[{"movie_id": 338762, "review_id": "5e7d5b7d6c849200146add17", "author_rating": 2.0, "review_text": "In one of the most mediocre movies so far this year, “Bloodshot” squanders every last positive thing it has going for it. Based on the bestselling sci-fi comic book, the film tells the story of recently killed soldier Ray Garrison (Vin Diesel) who is brought back to life as a super-assassin. Ray has an army of nanotechnology in his veins, making him an outrageously strong, unstoppable force who has the ability to instantly heal any injuries he sustains in combat. When his memories begin to contradict what’s reality and what’s fiction, Ray starts to suspect lead scientist Dr. Harting (Guy Pearce) may have sinister intentions — and he does everything in his superhuman power to stop him.\r\n\r\nThe film lacks enough material for a feature length film, and it feels like the story has been stretched out from the get-go. The plot is far-fetched but interesting, yet the best elements are dismissed in a rushed fashion. The film could’ve gone one of two ways, and it chooses the path of greatest disappointment, which leaves it in this weird limbo. It’s not quite smart enough and not quite dumb enough to work. Like when director Dave Wilson gets the sense that things are lagging, he inserts a not-so-subtle explosion or dick joke to keep things moving along. Yeah, it’s that kind of bad.\r\n\r\nEven the action scenes fall victim to rapid-fire editing that is intended to disguise the bloodless PG-13 action flick. There’s an almost-satisfying extended fight sequence involving elevators and a skyscraper, but it comes late in the film when most audiences will likely have already lost interest. Even worse, there are no consequences because Ray can’t be hurt or killed, and the special effects look like they were created in a couple of hours by a pre-teen boy on the family room laptop.\r\n\r\nDiesel is not a great actor, but that’s never been a job requirement to bring the charismatic, cinematic muscle to the big screen. He’s a perfectly acceptable action star, but here he turns in a laughably bad performance. His poor acting hogs the spotlight, especially when he shares scenes opposite the talented Pearce.\r\n\r\nThis movie is absolute junk that will die a quick death at the box office. Please, audiences: do your part to put “Bloodshot” out of its misery.", "created_at": "2020-03-27T01:48:45.031Z"}, {"movie_id": 338762, "review_id": "5e85f055da10f00014ee8e23", "author_rating": 3.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nFirst of all, no. I've never read the comic book, so I didn't know a single thing about the superhero Bloodshot going in. What I did know was that Jeff Wadlow was in command of the screenplay, and we all know how extremely horrible his latest movies are (Truth or Dare, Fantasy Island). Add Vin Diesel as the protagonist and a first-time director (David S. F. Wilson), it's impossible to have high expectations for such a film, no matter how good the source material is. Maybe it could surprise me and end up being a reasonably decent flick...\r\n\r\nIt didn't. Bloodshot is even worse than I expected. I genuinely thought that the action would be the movie's savior. I didn't watch any trailers, as usual, but I did see an image here and there of that red smoke, as well as a couple of glances at the regenerating CGI. Honestly, it's the most disappointing aspect of the whole film. Simply because it's the only thing I was expecting to be decent, at least. The \"final battle\" has some of the worst CGI of the century, and it goes on for way too long. There's an abundance of shaky-cam, the editing is truly awful at times, a lot of action sequences are barely understandable, and even the slow-motion is overused.\r\n\r\nHowever, the reason why the movie ultimately fails is, once again, due to Wadlow's screenplay (which he co-wrote with Eric Heisserer, but Wadlow is the main one). As always, his narrative is a total mess. Confusing, lacks creativity, raises tons of logical questions, and the real past of Ray Garrison is empty of any explanation. The ending is not only predictable and formulaic, but it also generates even more questions, leaving the viewer frustrated with so many unanswered plot points. David Leitch and Chad Stahelski (both have Deadpool and John Wick in their filmography) left the project right after being hired as the directors... I wonder why?!\r\n\r\nThe first minutes are probably the best of the entire runtime. I mean, excluding a not-sexy-at-all scene featuring Vin Diesel and Talulah Riley (Gina Garrison). That was cringe-worthy. Nevertheless, the story's concept is really captivating, to say the least (or the comic book wouldn't have its remarkable success). It's one of those action flicks that could easily turn into a successful franchise if the people involved in the project are more talented. With this, I transition to another of my main issues: Vin Diesel.\r\n\r\nVery rarely, I negatively criticize an actor's performance. I admit that I'm easily pleased by any cast. If you ask me \"what's an actor/actress you don't like?\", I would probably be stuck for an answer. Diesel's display is so emotionless that even someone like me can be affected by it. Besides being a rock throughout the whole film, Diesel has this weird habit of TALKING VERY LOUD AND CLEAR, only to instantly lower his volume so much that he's almost whispering. He does this consecutively and repeatedly in almost every dialogue.\r\n\r\nThere's no care for developing a single character, not even the protagonist. Everyone is just a stereotype of some secondary action character: the funny IT guy, the hot girl who develops feelings for the hero, the male teammate who gets jealous that his alpha territory gets invaded, and the \"motivation-less bad guy who's made look like a good guy in the beginning, but we all know who he truly is\"... Literally, the two most talented actors (Toby Kebbell and Talulah Riley) are the ones with the least amount of screentime.\r\n\r\nIn the end, Bloodshot is even worse than I expected. The messy, formulaic, and logically questionable screenplay by Jeff Wadlow and Eric Heisserer is the worst aspect of the movie, but the action is undoubtedly the most disappointing one. The \"final fight\" is one of the worst CGI sequences of the century, and the action throughout the runtime is filled with an uncontrollable shaky-cam, an excess of slow-motion, and some poor editing, making most of these scenes incredibly hard to follow. Vin Diesel delivers as much emotion as a rock, and while the rest of the cast is fine, the characters follow every single stereotype ever written for an action flick. It also doesn't help to put a first-time director in charge of the whole thing, but David S. F. Wilson is far from being the one to blame. Occasionally good action moments and a great concept just barely keep the film breathing. It's one of the worst movies of the year.\r\n\r\nRating: D", "created_at": "2020-04-02T14:01:57.320Z"}, {"movie_id": 338762, "review_id": "5f1d2beb735205003e4d0881", "author_rating": 5.0, "review_text": "I really disliked the ending, but the first fight scene also was some of that straight-up injectable #TheAesthetic shit. Those two kind of cancel each other out, and the rest of the movie I was pretty middle of the road on, so I guess the whole thing averaged out to 2.5 outta 5. Maybe it would have been a better experience on the big screen, but we aren't allowed to do that anymore, so, sorry Bloodshot but, you're stuck with a moderately-favourable \"meh\". \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-07-26T07:08:27.576Z"}, {"movie_id": 338762, "review_id": "5f7a0d759a64350037a9ef53", "author_rating": 7.0, "review_text": "Good watch, probably won't watch again, but can recommend.\r\n\r\nI had to watch this twice just to make sure I followed it correctly.  I was pretty tired the first time, and there is a lot of alternating between whispering / hushed tones and loud gunfire.\r\n\r\nThis movie does a lot of good visual action and effects, some stuff I don't think I've ever seen on screen before, it's well cast and the production value is through the roof, but I can't say that it's all that good a story.\r\n\r\nIt's definitely an interesting story, but the movie seeming radically torn between being a promotion of technological power and fear mongering, and the fear mongering bit always irks me because it gets in the way of real progress because someone want to tell a story one way versus another.\r\n\r\nThe majority of the movie you can see in other movies like any of the movies with Wolverine, \"Extraction\" (2020), but there are some special bits that make it stand out.  I just don't feel like I care about the action that is happening.  When you see someone explode a watermelon, yeah it's cool, but why are you doing it, why are you taking 2 hours to do it?\r\n\r\nThis is a good one-shot, just put it in the queue for when you want to see an action flick.", "created_at": "2020-10-04T17:59:17.715Z"}, {"movie_id": 338762, "review_id": "6307f69db7d352007bc9438a", "author_rating": 5.0, "review_text": "Bloodshot is an unexpectedly intelligent and patient sci-fi film. It spends its entire first half persuading us that it's just another dumb action movie, and right when we're convinced that that's exactly what it is, it pulls the rug out from under us and reveals that it was all just a ruse before establishing its true premise, and it does this with such skill that we can't stay mad at it for having fooled us so thoroughly. It's like one of those Russian dolls, only instead of having another, smaller doll inside, it has is a much more complex and satisfying movie.\r\n\r\nAll we see up to the halfway point is utterly generic, and Bloodshot knows it (“You've already copied every movie cliché there is. I think “Psycho Killer and a lunatic dancing in a slaughterhouse is enough”). Vin Diesel's character is a Frankenstein monster made from parts of Neo, Robocop, the Universal Soldier, Wolverine, and the T-1000.\r\n\r\nAfter conveniently listening, just once, to a trigger song, he regains his lost memory – and not in bits and pieces; like Celine Dion, it's all coming back to him now. Without even a training montage in between, Diesel employs his many new skills so expertly that he exacts revenge on his and his wife's killers with over an hour left to go.\r\n\r\nWhat Bloodshot does is take the expression 'a pig in a poke' and turn it 180 degrees. Director David S.F. Wilson and screenwriters Jeff Wadlow and Eric Heisserer aren't really copying action movie clichés but playing with them – subverting them for their own benefit, and the audience's as well. I was so pleasantly surprised that I'm willing to look at the silver lining on a couple of things.\r\n\r\n1) the hero is an indestructible, unstoppable one-man army, killing machine – i.e., same old, same old except that Diesel, unlike many contemporary action heroes, has an actual personality and can be introspective. 2) a sequence towards the end, where the protagonist fights a couple of baddies, deliberately looks like a video game cutscene, but it's still better than watching someone else play a video game. And 3) there are the dreaded comic sidekick and romantic subplot, but the former is tolerable, and the latter is subtle and unintrusive.\r\n\r\nAll things considered, Bloodshot's biggest flaw is that it's supposed to be the first installment in a series of movies set in the Valiant Comics shared cinematic universe (oddly, though it's based on the character Bloodshot, that name is never uttered in the film; I imagine they're leaving it for the inevitable sequel, as well as the merely hinted at romance between the male and female leads). The first movie in a franchise is almost always the best of the bunch, but Bloodshot is good on its own.", "created_at": "2022-08-25T22:24:29.712Z"}, {"movie_id": 338762, "review_id": "6451291593bd690153929a40", "author_rating": 6.0, "review_text": "I thought this would have been better then what it was. He gets murdered and they bring him back to life as a super soldier. I'm sure part 2 will be better.", "created_at": "2023-05-02T15:15:33.885Z"}]