[{"movie_id": 62177, "review_id": "50b3c30e760ee30df500021c", "author_rating": 8.0, "review_text": "I enjoyed Brave but it wasn't without a few flaws.\r\n\r\nFirst of all, I never felt like there was much meat to the story. It was enjoyable sure, and had some good morals and family values but I never felt like I was invested in the main characters. Stuff just seemed to happen.\r\n\r\nSecondly, and this isn't as much the movies fault as perhaps the marketing that surrounded it, but it was actually a very different movie than I thought it was going to be. I discovered that it's hard to break those pre-conceptions as I kept thinking the story was going somewhere else than it did.\r\n\r\nBrave was at its best when it made me laugh which  unfortunately, was just too seldom. For example, the entire scene where the 3 clans try to fight for Mérida's hand was way too short!\r\n\r\nThe voice cast was very good though. Kelly Macdonald in particular, was perfect as Mérida.\r\n\r\nAll in all, Brave was good but not great. It just seems to lack the \"magic\" I expect from Pixar. Not their worst outing but close to it.", "created_at": "2012-11-26T19:29:18.000Z"}, {"movie_id": 62177, "review_id": "5e0833329bcd0f001712d50c", "author_rating": 5.0, "review_text": "The following is a long-form review that I originally wrote in 2012.\r\n\r\nThe film in all was a relatively decent venture. Perhaps Pixar's well deserved success is its pitfall here. Though highly enjoyable, Brave was simply not up to the standard brought forth by the likes of the Toy Story trilogy, Up or Monsters Inc. ?This movie falls more into the category of \"Entertaining, acceptable, cute\" instead of the higher echelons some of the studio's past work has earned it.\r\n\r\nBrave attempts to take the \"Disney Princess\" line away from its predecessors in which princesses are only good for getting themselves into trouble so that men can rescue them (ie. Snow White, Belle, etc.) or in the case of the Little Mermaid in which she is willing to almost literally walk on broken glass for a man simply because he's pretty. And for this, we thank Brave. All that said and done however, there was one rather unfortunate side-effect of all this. I at first simply felt it was my warped interpretation, but every person whom I've spoken to drew the same conclusion, so perhaps not... Now, I'm sure it wasn't intentional, but, I must say, the main character Merida... Seemed to... Have a thing for her mum. Just saying, honestly, that's how the piece feels as it plays out.\r\n\r\nOn a less incestuous note though, stand up comic/actor Billy Connolly as Meridia's father King Fergus is simply brilliant, and probably the highest point of the whole film. Though the animation didn't exactly make leaps and bounds forward in comparison to anything else that's come out in the past couple of years, it was still most certainly impressive.\r\n\r\nMaybe if I had been part of Brave's target audience I could have appreciated the movie more. It was most certainly good, but I wasn't really ?blown away? by any aspect of the film whatsoever. It managed to scrape a slight \"above average\" but I really would have liked something more than I got, especially seeing as movies on the big screen tend to impress me more readily.\r\nBrave's biggest problem is that it is, in essence, forgettable. Though an entertaining 93 minutes to be sure, I can't imagine myself hankering for a re-watch any time soon.\r\n\r\n62%\r\n\r\n-Gimly", "created_at": "2019-12-29T05:01:38.223Z"}, {"movie_id": 62177, "review_id": "5f42ac7ae860170034567a19", "author_rating": 8.0, "review_text": "A wholehearted animated film from Disney.\r\n\r\n<em>'Brave'</em> is very good. The Scottish vibes help a lot, but the meaningful message and superb animation are just a few of the film's other big positives. The casting, characters and music are some too. The premise itself isn't anything breathtakingly new, but is most certainly enjoyable to see unfold.\r\n\r\nThe cast are excellent, with my personal standouts being Kelly Macdonald (Merida) and Emma Thompson (Elinor). There are also good performances from Billy Connolly (Fergus), Robbie Coltrane (Dingwall) and Julie Walters (Witch).\r\n\r\nIt's a fun and simple watch, one I thoroughly felt entertained by.", "created_at": "2020-08-23T17:50:50.631Z"}, {"movie_id": 62177, "review_id": "630cba86b3e627007a657403", "author_rating": 6.0, "review_text": "To be honest, I was expecting rather more from this feature. It centres around the tomboyish princess \"Merida\" who is being groomed by her fastidious mother 'Elinor\" into a refined and genteel lady befitting her station. Her father, \"Fergus\" is a bit rougher round the edges but by and large the family - along with the two younger twin boys - rub along ok. That is, until the king and queen announce to their daughter that it is time for her betrothal - and that she just marry one of the pretty hapless heirs from one of the three great clans of the kingdom. Unimpressed, she runs away and encounters a witch who agrees to cast a spell that will change her mother's mind... Well it does a load more than that, and soon the young \"Merida\" has to reconcile the fall out from her hastily sought wish as well as fend of a legendary bear that has already robbed the King of half of his leg. The adventure is entertaining enough, but the story is too thin to stretch for ninety minutes and despite some characterful and amusing efforts from Julie Walters, Billy Connolly and Emma Thompson, I found this just a bit slow. The accents are Scottish, but it really could have been set anywhere and be about anything. The standard of animation isn't brilliant either - it has a very linear style to it that I didn't think so natural, especially as much of this takes place outdoors in a dense and colourful forest. It's still an engaging family film though, one that you could safely leave the youngsters in front of without worry. One from the factory, you might say.", "created_at": "2022-08-29T13:09:26.927Z"}]