[{"movie_id": 1895, "review_id": "51ea450c760ee35aab42effc", "author_rating": 10.0, "review_text": "George Lucas comes full circle in more ways than one in \"Star Wars: Episode III -- Revenge of the Sith,\" which is the sixth -- and allegedly but not necessarily the last -- of the \"Star Wars\" movies. After \"Episode II\" got so bogged down in politics that it played like the Republic covered by C-Span, \"Episode III\" is a return to the classic space opera style that launched the series. Because the story leads up to where the original \"Star Wars\" began, we get to use the immemorial movie phrase, \"This is where we came in.\"\r\n\r\nThat Anakin Skywalker abandoned the Jedi and went over to the dark side is known to all students of \"Star Wars.\" That his twins Luke Skywalker and Princess Leia would redeem the family name is also known. What we discover in \"Episode III\" is how and why Anakin lost his way -- how a pleasant and brave young man was transformed into a dark, cloaked figure with a fearsome black metal face. As Yoda sadly puts it in his inimitable word order: \"The boy you trained, gone he is, consumed by Darth Vader.\"\r\n\r\nAs \"Episode III\" opens, Anakin Skywalker (Hayden Christensen) and his friend Obi-Wan Kenobi (Ewan McGregor) are piloting fighter craft, staging a daring two-man raid to rescue Chancellor Palpatine (Ian McDiarmid). He has been captured by the rebel Gen. Grievous (whose voice, by Matthew Woods, sounds curiously wheezy considering the general seems to use replacement parts). In the spirit of all the \"Star Wars\" movies, this rescue sequence flies in the face of logic, since the two pilots are able to board Grievous' command ship and proceed without much trouble to the ship's observation tower, where the chancellor is being held. There is a close call in an elevator shaft, but where are the guards and the security systems? And why, for that matter, does a deep space cruiser need an observation tower, when every porthole opens on to the universe? But never mind.\r\n\r\nBack within the sphere of the Jedi Council, Anakin finds that despite his heroism, he will not yet be named a Jedi Master. The council distrusts Palpatine and wants Anakin to spy on him; Palpatine wants Anakin to spy on the council. Who to choose? McDiarmid has the most complex role in the movie as he plays on Anakin's wounded ego. Anakin is tempted to go over to what is not yet clearly the dark side; in a movie not distinguished for its dialogue, Palpatine is insidiously snaky in his persuasiveness.\r\n\r\nThe way Anakin approaches his choice, however, has a certain poignancy. Anakin has a rendezvous with Padme (Natalie Portman); they were secretly married in the previous film, and now she reveals she is pregnant. His reaction is that of a nice kid in a teenage comedy, trying to seem pleased while wondering how this will affect the other neat stuff he gets to do. To say that George Lucas cannot write a love scene is an understatement; greeting cards have expressed more passion.\r\n\r\nThe dialogue throughout the movie is once again its weakest point: The characters talk in what sounds like Basic English, without color, wit or verbal delight, as if they were channeling Berlitz. The exceptions are Palpatine and of course Yoda, whose speech (voiced by Frank Oz) reminds me of Wolcott Gibbs' famous line about the early style of Time magazine: \"Backward ran sentences until reeled the mind.\"\r\n\r\nIn many cases the actors are being filmed in front of blue screens, with effects to be added later, and sometimes their readings are so flat, they don't seem to believe they're really in the middle of amazing events. How can you stand in front of exploding star fleets and sound as if you're talking on a cell phone at Starbucks?\r\n\r\n\"He's worried about you,\" Anakin is told at one point. \"You've been under a lot of stress.\" Sometimes the emphasis in sentences is misplaced. During the elevator adventure in the opening rescue, we hear \"Did I miss something?\" when it should be \"Did I miss something?\"\r\n\r\nThe dialogue is not the point, however; Lucas' characters engage in sturdy oratorical pronunciamentos and then leap into adventure. \"Episode III\" has more action per square minute, I'd guess, than any of the previous five movies, and it is spectacular. The special effects are more sophisticated than in the earlier movies, of course, but not necessarily more effective.\r\n\r\nThe dogfight between fighters in the original \"Star Wars\" and the dogfight that opens this one differ in their complexity (many more ships this time, more planes of action, more detailed backgrounds) but not in their excitement. And although Lucas has his characters attend a futuristic opera that looks like a cross between Cirque de Soleil and an ultrasound scan of an unborn baby, if you regard the opera hall simply as a place, it's not as engaging as the saloon on Tatooine in the first movie.\r\n\r\nThe lesson, I think, is that special effects should be judged not by their complexity but by the degree that they stimulate the imagination, and \"Episode III\" is distinguished not by how well the effects are done, but by how amazingly they are imagined. A climactic duel on a blazing volcanic planet is as impressive, in its line, as anything in \"Lord of the Rings.\" And Yoda, who began life as a Muppet but is now completely animated (like about 70 percent of what we see onscreen), was to begin with and still is the most lifelike of the non-humanoid \"Star Wars\" characters.\r\n\r\nA word, however, about the duels fought with lightsabers. When they flashed into life with a mighty whizzing thunk in the first \"Star Wars\" and whooshed through their deadly parabolas, that was exciting. But the thrill is gone.\r\n\r\nThe duelists are so well-matched that saber fights go on forever before anyone is wounded, and I am still not sure how the sabers seem able to shield their bearers from attack. When it comes to great movie sword fights, Liam Neeson and Tim Roth took home the gold medal in \"Rob Roy\" (1995), and the lightsaber battles in \"Episode III\" are more like isometrics.\r\n\r\nThese are all, however, more observations than criticisms. George Lucas has achieved what few artists do; he has created and populated a world of his own. His \"Star Wars\" movies are among the most influential, both technically and commercially, ever made. And they are fun. If he got bogged down in solemnity and theory in \"Episode II: Attack of the Clones,\" the Force is in a jollier mood this time, and \"Revenge of the Sith\" is a great entertainment.\r\n\r\nNote: I said this is not necessarily the last of the \"Star Wars\" movies. Although Lucas has absolutely said he is finished with the series, it is inconceivable to me that 20th Century-Fox will willingly abandon the franchise, especially as Lucas has hinted that parts VII, VIII and IX exist at least in his mind. There will be enormous pressure for them to be made, if not by him, then by his deputies.\r\n\r\n4.5/5\r\n\r\n- Rodger Ebert", "created_at": "2013-07-20T08:06:36.371Z"}, {"movie_id": 1895, "review_id": "5917a750c3a3683a93038457", "author_rating": 5.0, "review_text": "Having seen the first movie when it reached France as I was about 10, it left a vivid mark on my imagination, and I kind of treasured the little bit of fantasy it brought to me among probably millions of other people.\r\n\r\nI think the reason why episodes IV to VI became timeless classics is that they were simply fairy tales in sci-fi clothing. You had heroes and princesses actually doing their heroes and princesses things on the screen, but most of the coolest bits happened somewhere in the recesses of your own imagination.\r\n\r\nStruggle of good against evil. Quest for the father. Passage from childhood to adulthood through a series of trials and challenges. All the stuff chivalry stories are made off, presented in a minimalist way that stuck to the essential elements of the plot. All the rest, including top notch SFXs and the excellent Solo-R2D2-C3PO trio was just cleverly fleshing out this very strong backbone.\r\n\r\nJust a few lines from a dreamy-eyed Sir Alec Guinness about the clone wars while young and clumsy Luke had his pants burn by a floating tennis ball were enough to flare your imagination in depicting an epic struggle between dark empire forces and a few heroic Jedi knights overwhelmed by sheer force and treachery. A few words about Leia and Luke's past were enough to evoke the moving fate of orphans afraid to uncover the hidden truth about a father shrouded in menacing mystery. Stuff dreams are made of, really.\r\n\r\nSadly oh so sadly, it looks like nowadays a blockbuster will never get the green light until some kind of quality insurance comity makes sure even the slowest 10% of your average audience will never be left wondering about anything that goes on for more than 2.5 seconds. I guess some marketing genius managed to convince the producers that leaving anything to the imagination of the customer seriously threatened the return on investment or something.\r\n\r\nThe last 3 episodes were unfortunately born in this disastrous context and proceeded methodically with the extermination of the slightest bit of magic that populated the 3 previous movies. Everything is laid bare in front of our eyes like some specimens on a dissection table. No, not even that. More like pieces of hardware broken down into component parts on a sterilized workbench.\r\n\r\nSo the Force is just something you catch like a flu. The mythical clone war is just 15 minutes of a ridiculous \"plan 66\". The mighty Vader is just a poor boy with an over-sized ego and an IQ reduced to 2 digits figures by an excess of testosterone (or midichlorians or whatnot for that matter). The mighty conflict that flares through the galaxy is just the outcome of desperately trivial political plots. The Jedi council a bunch of pathetically weak over-aged muppets. Yoda a preposterous 10 inches tall kung-fu master.\r\n\r\nThe epic spirit of the first trilogy has been judged guilty of sales-threatening capital crime, quietly dragged behind the marketing barracks at dawn and shot in the back of the head.\r\n\r\nAs if to make good for this assassination, the last 3 movies drown us into a squirming pool of special effect and fan service that go light years over the top. Hysterical scenes flashing past before you really could decide where to focus your gaze just make the cheesy plot-advancing ones look miserable. Here again I feel the invisible hand of the marketing staff, managing to cram about every single second or third rate characters from the previous trilogy into an already bloated plot, stretching even further the already badly mauled consistency of the scenario in the process.\r\n\r\nFrankly, what could this stupid \"average viewer wants facts\" assumption bring but bitter disappointment? The result is not only boring, but really, really sad.", "created_at": "2017-05-14T00:39:44.362Z"}, {"movie_id": 1895, "review_id": "5e096a0f4c1d9a0019e73f0d", "author_rating": 5.0, "review_text": "Truly the best of the bad _Star Wars_ movies, _Revenge of the Sith_ doesn't make a whole lot of sense, both when viewed as self-contained, and when seen as a part of the _Star Wars_ whole, but at least Lucas bothered to put a whole movie in here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-30T03:07:59.517Z"}, {"movie_id": 1895, "review_id": "601a1c03ca0e17003d4bd23b", "author_rating": 8.0, "review_text": "Still not perfect, but <em>'Star Wars: Episode III – Revenge of the Sith'</em> is such a more enjoyable entry in the prequel trilogy - which ends strongly.\r\n\r\nI had a fun time with this. I do have a couple of (relatively minor) complaints, but first the positives. I'd say this is the best that this cast produced during this run of films. Hayden Christensen is excellent in his role, it's the most I've liked him in <em>'Star Wars'</em> for sure. Ewan McGregor and Natalie Portman give more than solid performances as well.\r\n\r\nThe special effects look nice throughout, while the score is pleasant. I also found the pacing to be practically ideal, which is a marked improvement on its predecessors. The humour and dialogue still isn't great, yet is also bettered. Crucially, the plot is very good.\r\n\r\nWith all that noted, I do have two things I didn't love. The first being the event that includes Samuel L. Jackson's character. I completely get the intention and reasoning of what occurs, but how it is shown did feel kinda forced and poorly written.\r\n\r\nAnother is the end, which overruns ever so slightly. I know it's setting up the original trilogy, but there are a few too many scenes; could've/should've ended on you know who's first breath.\r\n\r\nHowever, all in all, I got a positive amount of entertainment and would class this as a step above the preceding two films. I'm glad about that, as it makes the prequel productions way more meaningful and memorable than they were looking to be based on the 1999 & 2002 releases.", "created_at": "2021-02-03T03:44:03.943Z"}, {"movie_id": 1895, "review_id": "609f9a1f807298006fdc3542", "author_rating": 7.0, "review_text": "I had lost hope in the Prequels when they first came out - disappointing isnt a strong enough word to explain it, but its the best I can do.  So I came into this film with low expectations... I knew it wouldnt be great and I knew what it had to do to link up with the original Star Wars.\r\n\r\nAnd then, this one surprised me (and still does).  \r\n\r\nThe plot is taut, because it has to be (it has a lot of ground to cover).  The universe that was made in Ep 1 has to change dramatically to become Ep 4.  And the dialogue is mildly better (but still has its moments).  \r\n\r\nThe opening action scene wowed at the time (and still does).  And some of the duels are excellent - ObiWan vs Grievous was fun and (of course) ObiWan vs Anakin was superb - they had weight and impact and the swings actually \"landed\" (which is more than can be said for the other ones which just seemed to be dances).  \r\n\r\nAnd the acting is actually improved a bit - for a moment Christensen actually showed some talent (and he has shown this in other movies, just not in these).  He lets himself have an instant of regret after one of his killing sprees before refocusing back to his \"angry state.\"  It makes me wonder about how much emotion could have been put into this movie with a different director.  \r\n\r\nMcGregor is the best actor here.  Portman shines, but is underused.  Jackson is wooden in this.  And McDiarmid over acts and loses his sinisterness - he is better in the shadows in this role, either sitting or standing still.  When he does something more (even walking starts to get too much), he loses all believability (which is a shame as he is a fine actor in other roles).  \r\n\r\nThe score still remains typically 'Star Wars' - great.  The costumes have evolved again (it has been great watching the costumes change through these movies).  And the CGI is great in this - every background has something moving in it.  \r\n\r\nThere are flaws with this film - many of them that I have not already touched on, but others have so I wont.  \r\n\r\nBut, overall this movie is fun, and a good way to spend over 2 hours.  And by the time the helmet comes on at the end, you are there in the moment, holding your breath, waiting for that epic scuba sound to start.", "created_at": "2021-05-15T09:53:35.557Z"}, {"movie_id": 1895, "review_id": "6290d3d289b561009f1ef848", "author_rating": 6.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nRewatching before OBI-WAN KENOBI.\r\n\r\nWhen it comes to film sagas with massive fandoms, you'll find fans of literally all installments. STAR WARS has 11 movies and surely all are someone's #1. That said, REVENGE OF THE SITH proves to be an improvement in pretty much every single aspect compared to the first two prequels.\r\n\r\nThe narrative and its character arcs receive a much more interesting treatment - we finally get to witness Anakin's turn to the dark side and the rise of the Galactic Empire. Lightsaber fights are more captivating, visuals still hold up rather well, and even the performances are more convincing - dialogue remains pretty bad, especially within the love relationship between Anakin and Padmé, but Christensen surpasses his previous performance. The score continues to be as memorable as ever.\r\n\r\nIt may be far from my personal favorites, but it's, without a doubt, a film that deserves the positive evolution it has received as well as its fans. Clearly, the prequel that George Lucas always wanted to make, with no shifts in focus, irrelevant characters, or low-impact subplots.\r\n\r\nRating: B-", "created_at": "2022-05-27T13:36:18.352Z"}, {"movie_id": 1895, "review_id": "51ea450c760ee35aab42effc", "author_rating": 10.0, "review_text": "George Lucas comes full circle in more ways than one in \"Star Wars: Episode III -- Revenge of the Sith,\" which is the sixth -- and allegedly but not necessarily the last -- of the \"Star Wars\" movies. After \"Episode II\" got so bogged down in politics that it played like the Republic covered by C-Span, \"Episode III\" is a return to the classic space opera style that launched the series. Because the story leads up to where the original \"Star Wars\" began, we get to use the immemorial movie phrase, \"This is where we came in.\"\r\n\r\nThat Anakin Skywalker abandoned the Jedi and went over to the dark side is known to all students of \"Star Wars.\" That his twins Luke Skywalker and Princess Leia would redeem the family name is also known. What we discover in \"Episode III\" is how and why Anakin lost his way -- how a pleasant and brave young man was transformed into a dark, cloaked figure with a fearsome black metal face. As Yoda sadly puts it in his inimitable word order: \"The boy you trained, gone he is, consumed by Darth Vader.\"\r\n\r\nAs \"Episode III\" opens, Anakin Skywalker (Hayden Christensen) and his friend Obi-Wan Kenobi (Ewan McGregor) are piloting fighter craft, staging a daring two-man raid to rescue Chancellor Palpatine (Ian McDiarmid). He has been captured by the rebel Gen. Grievous (whose voice, by Matthew Woods, sounds curiously wheezy considering the general seems to use replacement parts). In the spirit of all the \"Star Wars\" movies, this rescue sequence flies in the face of logic, since the two pilots are able to board Grievous' command ship and proceed without much trouble to the ship's observation tower, where the chancellor is being held. There is a close call in an elevator shaft, but where are the guards and the security systems? And why, for that matter, does a deep space cruiser need an observation tower, when every porthole opens on to the universe? But never mind.\r\n\r\nBack within the sphere of the Jedi Council, Anakin finds that despite his heroism, he will not yet be named a Jedi Master. The council distrusts Palpatine and wants Anakin to spy on him; Palpatine wants Anakin to spy on the council. Who to choose? McDiarmid has the most complex role in the movie as he plays on Anakin's wounded ego. Anakin is tempted to go over to what is not yet clearly the dark side; in a movie not distinguished for its dialogue, Palpatine is insidiously snaky in his persuasiveness.\r\n\r\nThe way Anakin approaches his choice, however, has a certain poignancy. Anakin has a rendezvous with Padme (Natalie Portman); they were secretly married in the previous film, and now she reveals she is pregnant. His reaction is that of a nice kid in a teenage comedy, trying to seem pleased while wondering how this will affect the other neat stuff he gets to do. To say that George Lucas cannot write a love scene is an understatement; greeting cards have expressed more passion.\r\n\r\nThe dialogue throughout the movie is once again its weakest point: The characters talk in what sounds like Basic English, without color, wit or verbal delight, as if they were channeling Berlitz. The exceptions are Palpatine and of course Yoda, whose speech (voiced by Frank Oz) reminds me of Wolcott Gibbs' famous line about the early style of Time magazine: \"Backward ran sentences until reeled the mind.\"\r\n\r\nIn many cases the actors are being filmed in front of blue screens, with effects to be added later, and sometimes their readings are so flat, they don't seem to believe they're really in the middle of amazing events. How can you stand in front of exploding star fleets and sound as if you're talking on a cell phone at Starbucks?\r\n\r\n\"He's worried about you,\" Anakin is told at one point. \"You've been under a lot of stress.\" Sometimes the emphasis in sentences is misplaced. During the elevator adventure in the opening rescue, we hear \"Did I miss something?\" when it should be \"Did I miss something?\"\r\n\r\nThe dialogue is not the point, however; Lucas' characters engage in sturdy oratorical pronunciamentos and then leap into adventure. \"Episode III\" has more action per square minute, I'd guess, than any of the previous five movies, and it is spectacular. The special effects are more sophisticated than in the earlier movies, of course, but not necessarily more effective.\r\n\r\nThe dogfight between fighters in the original \"Star Wars\" and the dogfight that opens this one differ in their complexity (many more ships this time, more planes of action, more detailed backgrounds) but not in their excitement. And although Lucas has his characters attend a futuristic opera that looks like a cross between Cirque de Soleil and an ultrasound scan of an unborn baby, if you regard the opera hall simply as a place, it's not as engaging as the saloon on Tatooine in the first movie.\r\n\r\nThe lesson, I think, is that special effects should be judged not by their complexity but by the degree that they stimulate the imagination, and \"Episode III\" is distinguished not by how well the effects are done, but by how amazingly they are imagined. A climactic duel on a blazing volcanic planet is as impressive, in its line, as anything in \"Lord of the Rings.\" And Yoda, who began life as a Muppet but is now completely animated (like about 70 percent of what we see onscreen), was to begin with and still is the most lifelike of the non-humanoid \"Star Wars\" characters.\r\n\r\nA word, however, about the duels fought with lightsabers. When they flashed into life with a mighty whizzing thunk in the first \"Star Wars\" and whooshed through their deadly parabolas, that was exciting. But the thrill is gone.\r\n\r\nThe duelists are so well-matched that saber fights go on forever before anyone is wounded, and I am still not sure how the sabers seem able to shield their bearers from attack. When it comes to great movie sword fights, Liam Neeson and Tim Roth took home the gold medal in \"Rob Roy\" (1995), and the lightsaber battles in \"Episode III\" are more like isometrics.\r\n\r\nThese are all, however, more observations than criticisms. George Lucas has achieved what few artists do; he has created and populated a world of his own. His \"Star Wars\" movies are among the most influential, both technically and commercially, ever made. And they are fun. If he got bogged down in solemnity and theory in \"Episode II: Attack of the Clones,\" the Force is in a jollier mood this time, and \"Revenge of the Sith\" is a great entertainment.\r\n\r\nNote: I said this is not necessarily the last of the \"Star Wars\" movies. Although Lucas has absolutely said he is finished with the series, it is inconceivable to me that 20th Century-Fox will willingly abandon the franchise, especially as Lucas has hinted that parts VII, VIII and IX exist at least in his mind. There will be enormous pressure for them to be made, if not by him, then by his deputies.\r\n\r\n4.5/5\r\n\r\n- Rodger Ebert", "created_at": "2013-07-20T08:06:36.371Z"}, {"movie_id": 1895, "review_id": "5917a750c3a3683a93038457", "author_rating": 5.0, "review_text": "Having seen the first movie when it reached France as I was about 10, it left a vivid mark on my imagination, and I kind of treasured the little bit of fantasy it brought to me among probably millions of other people.\r\n\r\nI think the reason why episodes IV to VI became timeless classics is that they were simply fairy tales in sci-fi clothing. You had heroes and princesses actually doing their heroes and princesses things on the screen, but most of the coolest bits happened somewhere in the recesses of your own imagination.\r\n\r\nStruggle of good against evil. Quest for the father. Passage from childhood to adulthood through a series of trials and challenges. All the stuff chivalry stories are made off, presented in a minimalist way that stuck to the essential elements of the plot. All the rest, including top notch SFXs and the excellent Solo-R2D2-C3PO trio was just cleverly fleshing out this very strong backbone.\r\n\r\nJust a few lines from a dreamy-eyed Sir Alec Guinness about the clone wars while young and clumsy Luke had his pants burn by a floating tennis ball were enough to flare your imagination in depicting an epic struggle between dark empire forces and a few heroic Jedi knights overwhelmed by sheer force and treachery. A few words about Leia and Luke's past were enough to evoke the moving fate of orphans afraid to uncover the hidden truth about a father shrouded in menacing mystery. Stuff dreams are made of, really.\r\n\r\nSadly oh so sadly, it looks like nowadays a blockbuster will never get the green light until some kind of quality insurance comity makes sure even the slowest 10% of your average audience will never be left wondering about anything that goes on for more than 2.5 seconds. I guess some marketing genius managed to convince the producers that leaving anything to the imagination of the customer seriously threatened the return on investment or something.\r\n\r\nThe last 3 episodes were unfortunately born in this disastrous context and proceeded methodically with the extermination of the slightest bit of magic that populated the 3 previous movies. Everything is laid bare in front of our eyes like some specimens on a dissection table. No, not even that. More like pieces of hardware broken down into component parts on a sterilized workbench.\r\n\r\nSo the Force is just something you catch like a flu. The mythical clone war is just 15 minutes of a ridiculous \"plan 66\". The mighty Vader is just a poor boy with an over-sized ego and an IQ reduced to 2 digits figures by an excess of testosterone (or midichlorians or whatnot for that matter). The mighty conflict that flares through the galaxy is just the outcome of desperately trivial political plots. The Jedi council a bunch of pathetically weak over-aged muppets. Yoda a preposterous 10 inches tall kung-fu master.\r\n\r\nThe epic spirit of the first trilogy has been judged guilty of sales-threatening capital crime, quietly dragged behind the marketing barracks at dawn and shot in the back of the head.\r\n\r\nAs if to make good for this assassination, the last 3 movies drown us into a squirming pool of special effect and fan service that go light years over the top. Hysterical scenes flashing past before you really could decide where to focus your gaze just make the cheesy plot-advancing ones look miserable. Here again I feel the invisible hand of the marketing staff, managing to cram about every single second or third rate characters from the previous trilogy into an already bloated plot, stretching even further the already badly mauled consistency of the scenario in the process.\r\n\r\nFrankly, what could this stupid \"average viewer wants facts\" assumption bring but bitter disappointment? The result is not only boring, but really, really sad.", "created_at": "2017-05-14T00:39:44.362Z"}, {"movie_id": 1895, "review_id": "5e096a0f4c1d9a0019e73f0d", "author_rating": 5.0, "review_text": "Truly the best of the bad _Star Wars_ movies, _Revenge of the Sith_ doesn't make a whole lot of sense, both when viewed as self-contained, and when seen as a part of the _Star Wars_ whole, but at least Lucas bothered to put a whole movie in here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-30T03:07:59.517Z"}, {"movie_id": 1895, "review_id": "601a1c03ca0e17003d4bd23b", "author_rating": 8.0, "review_text": "Still not perfect, but <em>'Star Wars: Episode III – Revenge of the Sith'</em> is such a more enjoyable entry in the prequel trilogy - which ends strongly.\r\n\r\nI had a fun time with this. I do have a couple of (relatively minor) complaints, but first the positives. I'd say this is the best that this cast produced during this run of films. Hayden Christensen is excellent in his role, it's the most I've liked him in <em>'Star Wars'</em> for sure. Ewan McGregor and Natalie Portman give more than solid performances as well.\r\n\r\nThe special effects look nice throughout, while the score is pleasant. I also found the pacing to be practically ideal, which is a marked improvement on its predecessors. The humour and dialogue still isn't great, yet is also bettered. Crucially, the plot is very good.\r\n\r\nWith all that noted, I do have two things I didn't love. The first being the event that includes Samuel L. Jackson's character. I completely get the intention and reasoning of what occurs, but how it is shown did feel kinda forced and poorly written.\r\n\r\nAnother is the end, which overruns ever so slightly. I know it's setting up the original trilogy, but there are a few too many scenes; could've/should've ended on you know who's first breath.\r\n\r\nHowever, all in all, I got a positive amount of entertainment and would class this as a step above the preceding two films. I'm glad about that, as it makes the prequel productions way more meaningful and memorable than they were looking to be based on the 1999 & 2002 releases.", "created_at": "2021-02-03T03:44:03.943Z"}, {"movie_id": 1895, "review_id": "609f9a1f807298006fdc3542", "author_rating": 7.0, "review_text": "I had lost hope in the Prequels when they first came out - disappointing isnt a strong enough word to explain it, but its the best I can do.  So I came into this film with low expectations... I knew it wouldnt be great and I knew what it had to do to link up with the original Star Wars.\r\n\r\nAnd then, this one surprised me (and still does).  \r\n\r\nThe plot is taut, because it has to be (it has a lot of ground to cover).  The universe that was made in Ep 1 has to change dramatically to become Ep 4.  And the dialogue is mildly better (but still has its moments).  \r\n\r\nThe opening action scene wowed at the time (and still does).  And some of the duels are excellent - ObiWan vs Grievous was fun and (of course) ObiWan vs Anakin was superb - they had weight and impact and the swings actually \"landed\" (which is more than can be said for the other ones which just seemed to be dances).  \r\n\r\nAnd the acting is actually improved a bit - for a moment Christensen actually showed some talent (and he has shown this in other movies, just not in these).  He lets himself have an instant of regret after one of his killing sprees before refocusing back to his \"angry state.\"  It makes me wonder about how much emotion could have been put into this movie with a different director.  \r\n\r\nMcGregor is the best actor here.  Portman shines, but is underused.  Jackson is wooden in this.  And McDiarmid over acts and loses his sinisterness - he is better in the shadows in this role, either sitting or standing still.  When he does something more (even walking starts to get too much), he loses all believability (which is a shame as he is a fine actor in other roles).  \r\n\r\nThe score still remains typically 'Star Wars' - great.  The costumes have evolved again (it has been great watching the costumes change through these movies).  And the CGI is great in this - every background has something moving in it.  \r\n\r\nThere are flaws with this film - many of them that I have not already touched on, but others have so I wont.  \r\n\r\nBut, overall this movie is fun, and a good way to spend over 2 hours.  And by the time the helmet comes on at the end, you are there in the moment, holding your breath, waiting for that epic scuba sound to start.", "created_at": "2021-05-15T09:53:35.557Z"}, {"movie_id": 1895, "review_id": "6290d3d289b561009f1ef848", "author_rating": 6.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nRewatching before OBI-WAN KENOBI.\r\n\r\nWhen it comes to film sagas with massive fandoms, you'll find fans of literally all installments. STAR WARS has 11 movies and surely all are someone's #1. That said, REVENGE OF THE SITH proves to be an improvement in pretty much every single aspect compared to the first two prequels.\r\n\r\nThe narrative and its character arcs receive a much more interesting treatment - we finally get to witness Anakin's turn to the dark side and the rise of the Galactic Empire. Lightsaber fights are more captivating, visuals still hold up rather well, and even the performances are more convincing - dialogue remains pretty bad, especially within the love relationship between Anakin and Padmé, but Christensen surpasses his previous performance. The score continues to be as memorable as ever.\r\n\r\nIt may be far from my personal favorites, but it's, without a doubt, a film that deserves the positive evolution it has received as well as its fans. Clearly, the prequel that George Lucas always wanted to make, with no shifts in focus, irrelevant characters, or low-impact subplots.\r\n\r\nRating: B-", "created_at": "2022-05-27T13:36:18.352Z"}, {"movie_id": 1895, "review_id": "51ea450c760ee35aab42effc", "author_rating": 10.0, "review_text": "George Lucas comes full circle in more ways than one in \"Star Wars: Episode III -- Revenge of the Sith,\" which is the sixth -- and allegedly but not necessarily the last -- of the \"Star Wars\" movies. After \"Episode II\" got so bogged down in politics that it played like the Republic covered by C-Span, \"Episode III\" is a return to the classic space opera style that launched the series. Because the story leads up to where the original \"Star Wars\" began, we get to use the immemorial movie phrase, \"This is where we came in.\"\r\n\r\nThat Anakin Skywalker abandoned the Jedi and went over to the dark side is known to all students of \"Star Wars.\" That his twins Luke Skywalker and Princess Leia would redeem the family name is also known. What we discover in \"Episode III\" is how and why Anakin lost his way -- how a pleasant and brave young man was transformed into a dark, cloaked figure with a fearsome black metal face. As Yoda sadly puts it in his inimitable word order: \"The boy you trained, gone he is, consumed by Darth Vader.\"\r\n\r\nAs \"Episode III\" opens, Anakin Skywalker (Hayden Christensen) and his friend Obi-Wan Kenobi (Ewan McGregor) are piloting fighter craft, staging a daring two-man raid to rescue Chancellor Palpatine (Ian McDiarmid). He has been captured by the rebel Gen. Grievous (whose voice, by Matthew Woods, sounds curiously wheezy considering the general seems to use replacement parts). In the spirit of all the \"Star Wars\" movies, this rescue sequence flies in the face of logic, since the two pilots are able to board Grievous' command ship and proceed without much trouble to the ship's observation tower, where the chancellor is being held. There is a close call in an elevator shaft, but where are the guards and the security systems? And why, for that matter, does a deep space cruiser need an observation tower, when every porthole opens on to the universe? But never mind.\r\n\r\nBack within the sphere of the Jedi Council, Anakin finds that despite his heroism, he will not yet be named a Jedi Master. The council distrusts Palpatine and wants Anakin to spy on him; Palpatine wants Anakin to spy on the council. Who to choose? McDiarmid has the most complex role in the movie as he plays on Anakin's wounded ego. Anakin is tempted to go over to what is not yet clearly the dark side; in a movie not distinguished for its dialogue, Palpatine is insidiously snaky in his persuasiveness.\r\n\r\nThe way Anakin approaches his choice, however, has a certain poignancy. Anakin has a rendezvous with Padme (Natalie Portman); they were secretly married in the previous film, and now she reveals she is pregnant. His reaction is that of a nice kid in a teenage comedy, trying to seem pleased while wondering how this will affect the other neat stuff he gets to do. To say that George Lucas cannot write a love scene is an understatement; greeting cards have expressed more passion.\r\n\r\nThe dialogue throughout the movie is once again its weakest point: The characters talk in what sounds like Basic English, without color, wit or verbal delight, as if they were channeling Berlitz. The exceptions are Palpatine and of course Yoda, whose speech (voiced by Frank Oz) reminds me of Wolcott Gibbs' famous line about the early style of Time magazine: \"Backward ran sentences until reeled the mind.\"\r\n\r\nIn many cases the actors are being filmed in front of blue screens, with effects to be added later, and sometimes their readings are so flat, they don't seem to believe they're really in the middle of amazing events. How can you stand in front of exploding star fleets and sound as if you're talking on a cell phone at Starbucks?\r\n\r\n\"He's worried about you,\" Anakin is told at one point. \"You've been under a lot of stress.\" Sometimes the emphasis in sentences is misplaced. During the elevator adventure in the opening rescue, we hear \"Did I miss something?\" when it should be \"Did I miss something?\"\r\n\r\nThe dialogue is not the point, however; Lucas' characters engage in sturdy oratorical pronunciamentos and then leap into adventure. \"Episode III\" has more action per square minute, I'd guess, than any of the previous five movies, and it is spectacular. The special effects are more sophisticated than in the earlier movies, of course, but not necessarily more effective.\r\n\r\nThe dogfight between fighters in the original \"Star Wars\" and the dogfight that opens this one differ in their complexity (many more ships this time, more planes of action, more detailed backgrounds) but not in their excitement. And although Lucas has his characters attend a futuristic opera that looks like a cross between Cirque de Soleil and an ultrasound scan of an unborn baby, if you regard the opera hall simply as a place, it's not as engaging as the saloon on Tatooine in the first movie.\r\n\r\nThe lesson, I think, is that special effects should be judged not by their complexity but by the degree that they stimulate the imagination, and \"Episode III\" is distinguished not by how well the effects are done, but by how amazingly they are imagined. A climactic duel on a blazing volcanic planet is as impressive, in its line, as anything in \"Lord of the Rings.\" And Yoda, who began life as a Muppet but is now completely animated (like about 70 percent of what we see onscreen), was to begin with and still is the most lifelike of the non-humanoid \"Star Wars\" characters.\r\n\r\nA word, however, about the duels fought with lightsabers. When they flashed into life with a mighty whizzing thunk in the first \"Star Wars\" and whooshed through their deadly parabolas, that was exciting. But the thrill is gone.\r\n\r\nThe duelists are so well-matched that saber fights go on forever before anyone is wounded, and I am still not sure how the sabers seem able to shield their bearers from attack. When it comes to great movie sword fights, Liam Neeson and Tim Roth took home the gold medal in \"Rob Roy\" (1995), and the lightsaber battles in \"Episode III\" are more like isometrics.\r\n\r\nThese are all, however, more observations than criticisms. George Lucas has achieved what few artists do; he has created and populated a world of his own. His \"Star Wars\" movies are among the most influential, both technically and commercially, ever made. And they are fun. If he got bogged down in solemnity and theory in \"Episode II: Attack of the Clones,\" the Force is in a jollier mood this time, and \"Revenge of the Sith\" is a great entertainment.\r\n\r\nNote: I said this is not necessarily the last of the \"Star Wars\" movies. Although Lucas has absolutely said he is finished with the series, it is inconceivable to me that 20th Century-Fox will willingly abandon the franchise, especially as Lucas has hinted that parts VII, VIII and IX exist at least in his mind. There will be enormous pressure for them to be made, if not by him, then by his deputies.\r\n\r\n4.5/5\r\n\r\n- Rodger Ebert", "created_at": "2013-07-20T08:06:36.371Z"}, {"movie_id": 1895, "review_id": "5917a750c3a3683a93038457", "author_rating": 5.0, "review_text": "Having seen the first movie when it reached France as I was about 10, it left a vivid mark on my imagination, and I kind of treasured the little bit of fantasy it brought to me among probably millions of other people.\r\n\r\nI think the reason why episodes IV to VI became timeless classics is that they were simply fairy tales in sci-fi clothing. You had heroes and princesses actually doing their heroes and princesses things on the screen, but most of the coolest bits happened somewhere in the recesses of your own imagination.\r\n\r\nStruggle of good against evil. Quest for the father. Passage from childhood to adulthood through a series of trials and challenges. All the stuff chivalry stories are made off, presented in a minimalist way that stuck to the essential elements of the plot. All the rest, including top notch SFXs and the excellent Solo-R2D2-C3PO trio was just cleverly fleshing out this very strong backbone.\r\n\r\nJust a few lines from a dreamy-eyed Sir Alec Guinness about the clone wars while young and clumsy Luke had his pants burn by a floating tennis ball were enough to flare your imagination in depicting an epic struggle between dark empire forces and a few heroic Jedi knights overwhelmed by sheer force and treachery. A few words about Leia and Luke's past were enough to evoke the moving fate of orphans afraid to uncover the hidden truth about a father shrouded in menacing mystery. Stuff dreams are made of, really.\r\n\r\nSadly oh so sadly, it looks like nowadays a blockbuster will never get the green light until some kind of quality insurance comity makes sure even the slowest 10% of your average audience will never be left wondering about anything that goes on for more than 2.5 seconds. I guess some marketing genius managed to convince the producers that leaving anything to the imagination of the customer seriously threatened the return on investment or something.\r\n\r\nThe last 3 episodes were unfortunately born in this disastrous context and proceeded methodically with the extermination of the slightest bit of magic that populated the 3 previous movies. Everything is laid bare in front of our eyes like some specimens on a dissection table. No, not even that. More like pieces of hardware broken down into component parts on a sterilized workbench.\r\n\r\nSo the Force is just something you catch like a flu. The mythical clone war is just 15 minutes of a ridiculous \"plan 66\". The mighty Vader is just a poor boy with an over-sized ego and an IQ reduced to 2 digits figures by an excess of testosterone (or midichlorians or whatnot for that matter). The mighty conflict that flares through the galaxy is just the outcome of desperately trivial political plots. The Jedi council a bunch of pathetically weak over-aged muppets. Yoda a preposterous 10 inches tall kung-fu master.\r\n\r\nThe epic spirit of the first trilogy has been judged guilty of sales-threatening capital crime, quietly dragged behind the marketing barracks at dawn and shot in the back of the head.\r\n\r\nAs if to make good for this assassination, the last 3 movies drown us into a squirming pool of special effect and fan service that go light years over the top. Hysterical scenes flashing past before you really could decide where to focus your gaze just make the cheesy plot-advancing ones look miserable. Here again I feel the invisible hand of the marketing staff, managing to cram about every single second or third rate characters from the previous trilogy into an already bloated plot, stretching even further the already badly mauled consistency of the scenario in the process.\r\n\r\nFrankly, what could this stupid \"average viewer wants facts\" assumption bring but bitter disappointment? The result is not only boring, but really, really sad.", "created_at": "2017-05-14T00:39:44.362Z"}, {"movie_id": 1895, "review_id": "5e096a0f4c1d9a0019e73f0d", "author_rating": 5.0, "review_text": "Truly the best of the bad _Star Wars_ movies, _Revenge of the Sith_ doesn't make a whole lot of sense, both when viewed as self-contained, and when seen as a part of the _Star Wars_ whole, but at least Lucas bothered to put a whole movie in here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-30T03:07:59.517Z"}, {"movie_id": 1895, "review_id": "601a1c03ca0e17003d4bd23b", "author_rating": 8.0, "review_text": "Still not perfect, but <em>'Star Wars: Episode III – Revenge of the Sith'</em> is such a more enjoyable entry in the prequel trilogy - which ends strongly.\r\n\r\nI had a fun time with this. I do have a couple of (relatively minor) complaints, but first the positives. I'd say this is the best that this cast produced during this run of films. Hayden Christensen is excellent in his role, it's the most I've liked him in <em>'Star Wars'</em> for sure. Ewan McGregor and Natalie Portman give more than solid performances as well.\r\n\r\nThe special effects look nice throughout, while the score is pleasant. I also found the pacing to be practically ideal, which is a marked improvement on its predecessors. The humour and dialogue still isn't great, yet is also bettered. Crucially, the plot is very good.\r\n\r\nWith all that noted, I do have two things I didn't love. The first being the event that includes Samuel L. Jackson's character. I completely get the intention and reasoning of what occurs, but how it is shown did feel kinda forced and poorly written.\r\n\r\nAnother is the end, which overruns ever so slightly. I know it's setting up the original trilogy, but there are a few too many scenes; could've/should've ended on you know who's first breath.\r\n\r\nHowever, all in all, I got a positive amount of entertainment and would class this as a step above the preceding two films. I'm glad about that, as it makes the prequel productions way more meaningful and memorable than they were looking to be based on the 1999 & 2002 releases.", "created_at": "2021-02-03T03:44:03.943Z"}, {"movie_id": 1895, "review_id": "609f9a1f807298006fdc3542", "author_rating": 7.0, "review_text": "I had lost hope in the Prequels when they first came out - disappointing isnt a strong enough word to explain it, but its the best I can do.  So I came into this film with low expectations... I knew it wouldnt be great and I knew what it had to do to link up with the original Star Wars.\r\n\r\nAnd then, this one surprised me (and still does).  \r\n\r\nThe plot is taut, because it has to be (it has a lot of ground to cover).  The universe that was made in Ep 1 has to change dramatically to become Ep 4.  And the dialogue is mildly better (but still has its moments).  \r\n\r\nThe opening action scene wowed at the time (and still does).  And some of the duels are excellent - ObiWan vs Grievous was fun and (of course) ObiWan vs Anakin was superb - they had weight and impact and the swings actually \"landed\" (which is more than can be said for the other ones which just seemed to be dances).  \r\n\r\nAnd the acting is actually improved a bit - for a moment Christensen actually showed some talent (and he has shown this in other movies, just not in these).  He lets himself have an instant of regret after one of his killing sprees before refocusing back to his \"angry state.\"  It makes me wonder about how much emotion could have been put into this movie with a different director.  \r\n\r\nMcGregor is the best actor here.  Portman shines, but is underused.  Jackson is wooden in this.  And McDiarmid over acts and loses his sinisterness - he is better in the shadows in this role, either sitting or standing still.  When he does something more (even walking starts to get too much), he loses all believability (which is a shame as he is a fine actor in other roles).  \r\n\r\nThe score still remains typically 'Star Wars' - great.  The costumes have evolved again (it has been great watching the costumes change through these movies).  And the CGI is great in this - every background has something moving in it.  \r\n\r\nThere are flaws with this film - many of them that I have not already touched on, but others have so I wont.  \r\n\r\nBut, overall this movie is fun, and a good way to spend over 2 hours.  And by the time the helmet comes on at the end, you are there in the moment, holding your breath, waiting for that epic scuba sound to start.", "created_at": "2021-05-15T09:53:35.557Z"}, {"movie_id": 1895, "review_id": "6290d3d289b561009f1ef848", "author_rating": 6.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nRewatching before OBI-WAN KENOBI.\r\n\r\nWhen it comes to film sagas with massive fandoms, you'll find fans of literally all installments. STAR WARS has 11 movies and surely all are someone's #1. That said, REVENGE OF THE SITH proves to be an improvement in pretty much every single aspect compared to the first two prequels.\r\n\r\nThe narrative and its character arcs receive a much more interesting treatment - we finally get to witness Anakin's turn to the dark side and the rise of the Galactic Empire. Lightsaber fights are more captivating, visuals still hold up rather well, and even the performances are more convincing - dialogue remains pretty bad, especially within the love relationship between Anakin and Padmé, but Christensen surpasses his previous performance. The score continues to be as memorable as ever.\r\n\r\nIt may be far from my personal favorites, but it's, without a doubt, a film that deserves the positive evolution it has received as well as its fans. Clearly, the prequel that George Lucas always wanted to make, with no shifts in focus, irrelevant characters, or low-impact subplots.\r\n\r\nRating: B-", "created_at": "2022-05-27T13:36:18.352Z"}, {"movie_id": 1895, "review_id": "51ea450c760ee35aab42effc", "author_rating": 10.0, "review_text": "George Lucas comes full circle in more ways than one in \"Star Wars: Episode III -- Revenge of the Sith,\" which is the sixth -- and allegedly but not necessarily the last -- of the \"Star Wars\" movies. After \"Episode II\" got so bogged down in politics that it played like the Republic covered by C-Span, \"Episode III\" is a return to the classic space opera style that launched the series. Because the story leads up to where the original \"Star Wars\" began, we get to use the immemorial movie phrase, \"This is where we came in.\"\r\n\r\nThat Anakin Skywalker abandoned the Jedi and went over to the dark side is known to all students of \"Star Wars.\" That his twins Luke Skywalker and Princess Leia would redeem the family name is also known. What we discover in \"Episode III\" is how and why Anakin lost his way -- how a pleasant and brave young man was transformed into a dark, cloaked figure with a fearsome black metal face. As Yoda sadly puts it in his inimitable word order: \"The boy you trained, gone he is, consumed by Darth Vader.\"\r\n\r\nAs \"Episode III\" opens, Anakin Skywalker (Hayden Christensen) and his friend Obi-Wan Kenobi (Ewan McGregor) are piloting fighter craft, staging a daring two-man raid to rescue Chancellor Palpatine (Ian McDiarmid). He has been captured by the rebel Gen. Grievous (whose voice, by Matthew Woods, sounds curiously wheezy considering the general seems to use replacement parts). In the spirit of all the \"Star Wars\" movies, this rescue sequence flies in the face of logic, since the two pilots are able to board Grievous' command ship and proceed without much trouble to the ship's observation tower, where the chancellor is being held. There is a close call in an elevator shaft, but where are the guards and the security systems? And why, for that matter, does a deep space cruiser need an observation tower, when every porthole opens on to the universe? But never mind.\r\n\r\nBack within the sphere of the Jedi Council, Anakin finds that despite his heroism, he will not yet be named a Jedi Master. The council distrusts Palpatine and wants Anakin to spy on him; Palpatine wants Anakin to spy on the council. Who to choose? McDiarmid has the most complex role in the movie as he plays on Anakin's wounded ego. Anakin is tempted to go over to what is not yet clearly the dark side; in a movie not distinguished for its dialogue, Palpatine is insidiously snaky in his persuasiveness.\r\n\r\nThe way Anakin approaches his choice, however, has a certain poignancy. Anakin has a rendezvous with Padme (Natalie Portman); they were secretly married in the previous film, and now she reveals she is pregnant. His reaction is that of a nice kid in a teenage comedy, trying to seem pleased while wondering how this will affect the other neat stuff he gets to do. To say that George Lucas cannot write a love scene is an understatement; greeting cards have expressed more passion.\r\n\r\nThe dialogue throughout the movie is once again its weakest point: The characters talk in what sounds like Basic English, without color, wit or verbal delight, as if they were channeling Berlitz. The exceptions are Palpatine and of course Yoda, whose speech (voiced by Frank Oz) reminds me of Wolcott Gibbs' famous line about the early style of Time magazine: \"Backward ran sentences until reeled the mind.\"\r\n\r\nIn many cases the actors are being filmed in front of blue screens, with effects to be added later, and sometimes their readings are so flat, they don't seem to believe they're really in the middle of amazing events. How can you stand in front of exploding star fleets and sound as if you're talking on a cell phone at Starbucks?\r\n\r\n\"He's worried about you,\" Anakin is told at one point. \"You've been under a lot of stress.\" Sometimes the emphasis in sentences is misplaced. During the elevator adventure in the opening rescue, we hear \"Did I miss something?\" when it should be \"Did I miss something?\"\r\n\r\nThe dialogue is not the point, however; Lucas' characters engage in sturdy oratorical pronunciamentos and then leap into adventure. \"Episode III\" has more action per square minute, I'd guess, than any of the previous five movies, and it is spectacular. The special effects are more sophisticated than in the earlier movies, of course, but not necessarily more effective.\r\n\r\nThe dogfight between fighters in the original \"Star Wars\" and the dogfight that opens this one differ in their complexity (many more ships this time, more planes of action, more detailed backgrounds) but not in their excitement. And although Lucas has his characters attend a futuristic opera that looks like a cross between Cirque de Soleil and an ultrasound scan of an unborn baby, if you regard the opera hall simply as a place, it's not as engaging as the saloon on Tatooine in the first movie.\r\n\r\nThe lesson, I think, is that special effects should be judged not by their complexity but by the degree that they stimulate the imagination, and \"Episode III\" is distinguished not by how well the effects are done, but by how amazingly they are imagined. A climactic duel on a blazing volcanic planet is as impressive, in its line, as anything in \"Lord of the Rings.\" And Yoda, who began life as a Muppet but is now completely animated (like about 70 percent of what we see onscreen), was to begin with and still is the most lifelike of the non-humanoid \"Star Wars\" characters.\r\n\r\nA word, however, about the duels fought with lightsabers. When they flashed into life with a mighty whizzing thunk in the first \"Star Wars\" and whooshed through their deadly parabolas, that was exciting. But the thrill is gone.\r\n\r\nThe duelists are so well-matched that saber fights go on forever before anyone is wounded, and I am still not sure how the sabers seem able to shield their bearers from attack. When it comes to great movie sword fights, Liam Neeson and Tim Roth took home the gold medal in \"Rob Roy\" (1995), and the lightsaber battles in \"Episode III\" are more like isometrics.\r\n\r\nThese are all, however, more observations than criticisms. George Lucas has achieved what few artists do; he has created and populated a world of his own. His \"Star Wars\" movies are among the most influential, both technically and commercially, ever made. And they are fun. If he got bogged down in solemnity and theory in \"Episode II: Attack of the Clones,\" the Force is in a jollier mood this time, and \"Revenge of the Sith\" is a great entertainment.\r\n\r\nNote: I said this is not necessarily the last of the \"Star Wars\" movies. Although Lucas has absolutely said he is finished with the series, it is inconceivable to me that 20th Century-Fox will willingly abandon the franchise, especially as Lucas has hinted that parts VII, VIII and IX exist at least in his mind. There will be enormous pressure for them to be made, if not by him, then by his deputies.\r\n\r\n4.5/5\r\n\r\n- Rodger Ebert", "created_at": "2013-07-20T08:06:36.371Z"}, {"movie_id": 1895, "review_id": "5917a750c3a3683a93038457", "author_rating": 5.0, "review_text": "Having seen the first movie when it reached France as I was about 10, it left a vivid mark on my imagination, and I kind of treasured the little bit of fantasy it brought to me among probably millions of other people.\r\n\r\nI think the reason why episodes IV to VI became timeless classics is that they were simply fairy tales in sci-fi clothing. You had heroes and princesses actually doing their heroes and princesses things on the screen, but most of the coolest bits happened somewhere in the recesses of your own imagination.\r\n\r\nStruggle of good against evil. Quest for the father. Passage from childhood to adulthood through a series of trials and challenges. All the stuff chivalry stories are made off, presented in a minimalist way that stuck to the essential elements of the plot. All the rest, including top notch SFXs and the excellent Solo-R2D2-C3PO trio was just cleverly fleshing out this very strong backbone.\r\n\r\nJust a few lines from a dreamy-eyed Sir Alec Guinness about the clone wars while young and clumsy Luke had his pants burn by a floating tennis ball were enough to flare your imagination in depicting an epic struggle between dark empire forces and a few heroic Jedi knights overwhelmed by sheer force and treachery. A few words about Leia and Luke's past were enough to evoke the moving fate of orphans afraid to uncover the hidden truth about a father shrouded in menacing mystery. Stuff dreams are made of, really.\r\n\r\nSadly oh so sadly, it looks like nowadays a blockbuster will never get the green light until some kind of quality insurance comity makes sure even the slowest 10% of your average audience will never be left wondering about anything that goes on for more than 2.5 seconds. I guess some marketing genius managed to convince the producers that leaving anything to the imagination of the customer seriously threatened the return on investment or something.\r\n\r\nThe last 3 episodes were unfortunately born in this disastrous context and proceeded methodically with the extermination of the slightest bit of magic that populated the 3 previous movies. Everything is laid bare in front of our eyes like some specimens on a dissection table. No, not even that. More like pieces of hardware broken down into component parts on a sterilized workbench.\r\n\r\nSo the Force is just something you catch like a flu. The mythical clone war is just 15 minutes of a ridiculous \"plan 66\". The mighty Vader is just a poor boy with an over-sized ego and an IQ reduced to 2 digits figures by an excess of testosterone (or midichlorians or whatnot for that matter). The mighty conflict that flares through the galaxy is just the outcome of desperately trivial political plots. The Jedi council a bunch of pathetically weak over-aged muppets. Yoda a preposterous 10 inches tall kung-fu master.\r\n\r\nThe epic spirit of the first trilogy has been judged guilty of sales-threatening capital crime, quietly dragged behind the marketing barracks at dawn and shot in the back of the head.\r\n\r\nAs if to make good for this assassination, the last 3 movies drown us into a squirming pool of special effect and fan service that go light years over the top. Hysterical scenes flashing past before you really could decide where to focus your gaze just make the cheesy plot-advancing ones look miserable. Here again I feel the invisible hand of the marketing staff, managing to cram about every single second or third rate characters from the previous trilogy into an already bloated plot, stretching even further the already badly mauled consistency of the scenario in the process.\r\n\r\nFrankly, what could this stupid \"average viewer wants facts\" assumption bring but bitter disappointment? The result is not only boring, but really, really sad.", "created_at": "2017-05-14T00:39:44.362Z"}, {"movie_id": 1895, "review_id": "5e096a0f4c1d9a0019e73f0d", "author_rating": 5.0, "review_text": "Truly the best of the bad _Star Wars_ movies, _Revenge of the Sith_ doesn't make a whole lot of sense, both when viewed as self-contained, and when seen as a part of the _Star Wars_ whole, but at least Lucas bothered to put a whole movie in here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-30T03:07:59.517Z"}, {"movie_id": 1895, "review_id": "601a1c03ca0e17003d4bd23b", "author_rating": 8.0, "review_text": "Still not perfect, but <em>'Star Wars: Episode III – Revenge of the Sith'</em> is such a more enjoyable entry in the prequel trilogy - which ends strongly.\r\n\r\nI had a fun time with this. I do have a couple of (relatively minor) complaints, but first the positives. I'd say this is the best that this cast produced during this run of films. Hayden Christensen is excellent in his role, it's the most I've liked him in <em>'Star Wars'</em> for sure. Ewan McGregor and Natalie Portman give more than solid performances as well.\r\n\r\nThe special effects look nice throughout, while the score is pleasant. I also found the pacing to be practically ideal, which is a marked improvement on its predecessors. The humour and dialogue still isn't great, yet is also bettered. Crucially, the plot is very good.\r\n\r\nWith all that noted, I do have two things I didn't love. The first being the event that includes Samuel L. Jackson's character. I completely get the intention and reasoning of what occurs, but how it is shown did feel kinda forced and poorly written.\r\n\r\nAnother is the end, which overruns ever so slightly. I know it's setting up the original trilogy, but there are a few too many scenes; could've/should've ended on you know who's first breath.\r\n\r\nHowever, all in all, I got a positive amount of entertainment and would class this as a step above the preceding two films. I'm glad about that, as it makes the prequel productions way more meaningful and memorable than they were looking to be based on the 1999 & 2002 releases.", "created_at": "2021-02-03T03:44:03.943Z"}, {"movie_id": 1895, "review_id": "609f9a1f807298006fdc3542", "author_rating": 7.0, "review_text": "I had lost hope in the Prequels when they first came out - disappointing isnt a strong enough word to explain it, but its the best I can do.  So I came into this film with low expectations... I knew it wouldnt be great and I knew what it had to do to link up with the original Star Wars.\r\n\r\nAnd then, this one surprised me (and still does).  \r\n\r\nThe plot is taut, because it has to be (it has a lot of ground to cover).  The universe that was made in Ep 1 has to change dramatically to become Ep 4.  And the dialogue is mildly better (but still has its moments).  \r\n\r\nThe opening action scene wowed at the time (and still does).  And some of the duels are excellent - ObiWan vs Grievous was fun and (of course) ObiWan vs Anakin was superb - they had weight and impact and the swings actually \"landed\" (which is more than can be said for the other ones which just seemed to be dances).  \r\n\r\nAnd the acting is actually improved a bit - for a moment Christensen actually showed some talent (and he has shown this in other movies, just not in these).  He lets himself have an instant of regret after one of his killing sprees before refocusing back to his \"angry state.\"  It makes me wonder about how much emotion could have been put into this movie with a different director.  \r\n\r\nMcGregor is the best actor here.  Portman shines, but is underused.  Jackson is wooden in this.  And McDiarmid over acts and loses his sinisterness - he is better in the shadows in this role, either sitting or standing still.  When he does something more (even walking starts to get too much), he loses all believability (which is a shame as he is a fine actor in other roles).  \r\n\r\nThe score still remains typically 'Star Wars' - great.  The costumes have evolved again (it has been great watching the costumes change through these movies).  And the CGI is great in this - every background has something moving in it.  \r\n\r\nThere are flaws with this film - many of them that I have not already touched on, but others have so I wont.  \r\n\r\nBut, overall this movie is fun, and a good way to spend over 2 hours.  And by the time the helmet comes on at the end, you are there in the moment, holding your breath, waiting for that epic scuba sound to start.", "created_at": "2021-05-15T09:53:35.557Z"}, {"movie_id": 1895, "review_id": "6290d3d289b561009f1ef848", "author_rating": 6.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nRewatching before OBI-WAN KENOBI.\r\n\r\nWhen it comes to film sagas with massive fandoms, you'll find fans of literally all installments. STAR WARS has 11 movies and surely all are someone's #1. That said, REVENGE OF THE SITH proves to be an improvement in pretty much every single aspect compared to the first two prequels.\r\n\r\nThe narrative and its character arcs receive a much more interesting treatment - we finally get to witness Anakin's turn to the dark side and the rise of the Galactic Empire. Lightsaber fights are more captivating, visuals still hold up rather well, and even the performances are more convincing - dialogue remains pretty bad, especially within the love relationship between Anakin and Padmé, but Christensen surpasses his previous performance. The score continues to be as memorable as ever.\r\n\r\nIt may be far from my personal favorites, but it's, without a doubt, a film that deserves the positive evolution it has received as well as its fans. Clearly, the prequel that George Lucas always wanted to make, with no shifts in focus, irrelevant characters, or low-impact subplots.\r\n\r\nRating: B-", "created_at": "2022-05-27T13:36:18.352Z"}]