[{"movie_id": 329865, "review_id": "584312a4925141676400049c", "author_rating": null, "review_text": "Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!", "created_at": "2016-12-03T18:44:52.862Z"}, {"movie_id": 329865, "review_id": "5844cdd89251416a7400fc24", "author_rating": 7.0, "review_text": "Denis Villenueve offers a great film, but one that is exactly what the trailer put forth, this is not a Sci-Fi War film waiting to happen, or a modern-day horror. It's a character-driven piece about politics, life, humanity and communication.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-12-05T02:15:52.966Z"}, {"movie_id": 329865, "review_id": "58b34189c3a368522000b211", "author_rating": 7.0, "review_text": "**It was a perfect contact, but troubled at the communication.**\r\n\r\nThe film was decent. Nowadays there are lots of altered versions coming that you won't easily say those are the remakes or reboots or spin- offs or whatever they call them in these days. Like 'Premotheus' to 'Alien', this film can remind you a few titles from the past, but 'Contact' is what the majority of us believes it got inspired.\r\n\r\nThe eight Oscars nominees for the film is insane. I know some people liked it, and the film was good, that does not mean it is an Oscar product. I'm okay with the technical side recognition as it deserved that. So visually it was very good, but not a special effects extravaganza. Just a simple sci-fi drama, with a few thrills, particularly towards the end.\r\n\r\nWhen the unexpected visitors from the outer-space land their ships in the twelve different locations on the earth, the humans patiently try to communicate with them to learn their intentions. This story focused on the American soil, where experts are brought in to decode the alien language. How the rest of tale develops was told in the remaining parts.\r\n\r\nTo me it smells like a trilogy. If not, it should be. I enjoyed it, mainly because of being a drama. Sci-fi is always associated with action, adventure and thriller, but this drama was something fresh as per todays computer graphics dominated cinema world. This is particularly for the family and older people like the grownups. Like I said the youngsters love action and violence. So it is a one time viewable film and you will get everything in that attempt itself.\r\n\r\n_7/10_", "created_at": "2017-02-26T20:58:49.857Z"}, {"movie_id": 329865, "review_id": "5ac935e90e0a26497404ab59", "author_rating": 8.0, "review_text": "\"I have a brilliant idea for a movie so what we do is we watch scientists step-by-step learn to communicate with an alien species\"\r\n\r\n\"That's awesome but we need an emotional component or audiences will be bored\"\r\n\r\n\"Okay the main scientist's daughter is dead and we show clips of that every couple minutes\"\r\n\r\n\"Greenlight\"", "created_at": "2018-04-07T21:19:37.328Z"}, {"movie_id": 329865, "review_id": "5bf333700e0a261ac201cdf1", "author_rating": 8.0, "review_text": "Arrival is an attempt to take a more realistic approach to how an alien visitation would play out, especially within global politics. The main thrust is that Amy Adams has to find out what the aliens want before any other country can fuck it up and they did a great job in casting Amy Adams. I'm not usually any more than indifferent of Adams, but she does a great job here with what she's given. Jeremy Renner does as good as Jeremy Renner can do with a character that isn't just stoic bad-ass. I like Renner, but unlike other alien films, Arrival isn't an \"alien invasion\" movie where he can run around shooting stuff and making quips, so I'm not sure he was the best choice. The only other actor of note is Forrest Whitaker, who does fine, but he has this stupid accent that has no purpose. I had to watch interviews with him to make sure he wasn't just doing an accent every other time and this was his real voice. No, he does some unnatural accent that really draws you out of the film because there is no reason for it. It's not a foreign accent or a regional one (or at least not one that I've ever heard), it's just some made up shit he does for no reason. The plot is fine for where they are trying to go with the story. Personally, there are some tropes that I really fucking hate and Arrival rides on one of the ones I hate the most. I won't say what it is, because Arrival really should not be spoiled, but subjectively it was a stupid bullshit play and it makes things unnecessarily confusing. Arrival is about the aliens coming to Earth, but that serves more as the gasoline that fuels the very human drama that is very dialog driven and much more about Amy Adams than any of the aliens. I'm unclear about how long the movie takes place, but once they establish the motive of the movie, it feels cheap to skip a huge chunk of time and give us a montage of what happens instead of keeping the flow of progression. The movie takes place mostly in Montana and we get some beautiful scenery and the sets are all great. The cinematography has some interesting ideas and they use shots and colors to enhance the plot. not just document it. Hearing the comparisons to Interstellar, I was afraid of how arrogant, indulgent, and pretentious Arrival might be and while I understand now what they were trying to convey with the comparison, Arrival is none of those things. Arrival doesn't pretend that it's more than it is. There are a few story that keep my personal score from going beyond a four, but I don't see how anyone who watches Arrival knowing what kind of movie Arrival is could give it much less. If you put on Arrival expecting Mars Attacks, Alien, Independence Day, or any other sci-fi spectacle films you are going to be disappointed, Arrival is much more of a drama. Sure, it is technically a sci-fi because aliens, but that's not the drive of the film. If you choose to watch Arrival with the understanding that it can be slow and aggravating and has none of the flash and awe of a typical Sci-Fi, but replaces those with authentic characters and drama, don't think you will be disappointed.", "created_at": "2018-11-19T22:04:32.358Z"}, {"movie_id": 329865, "review_id": "5e2f2bbd1685da0013e9f95a", "author_rating": 9.0, "review_text": "Well damn.\r\n\r\nI couldn't stop thinking about this one and may not for awhile. \"Arrival\" is one of the best Sci-Fi films I've seen in this year. Everything about this film was just top notch that I can't put into words without going all over.\r\n\r\nSo let put it like this:\r\n\r\nAmy Adams was wonderful in this. A very grounded and real performance. Probably her best. Same thing that can said about Jeremy Renner.\r\n\r\nAnd how the aliens were part of the story was fascinating and quite clever. Without spoiling anything, they had a unique look to them. Like spiders. Although out the film, you feel their presence. A presence that's both scary and yet remarkable.\r\n\r\nDenis Villeneuve is my favorite working director. He can release a movie every year and still be close of making a masterpiece. Villeneuve delivers a haunting and heartbreaking story that leaves the audience with a experience that will stay with them. A beautiful, thought-provoking, Sci-Fi film that isn't an action or war movie. And I'm even more excited to see \"Blade Runner 2049\".\r\n\r\nAnd how can I forgot the amazing score, astonishing cinematography, intelligent script, and the tearjerker ending that left me in pieces.\r\n\r\nI honestly can't say anything else. Please do yourself a favor and watch it. For now, I'm dumbfounded.", "created_at": "2020-01-27T18:28:13.661Z"}, {"movie_id": 329865, "review_id": "5f0d0679efe37c0036cae81d", "author_rating": 10.0, "review_text": "Arrival has created the most profound and seamless symbolism, notably through cinematography/imagery, that may have ever been achieved to date in film.\r\n\r\nOn the surface, this appears to be a story about humans making contact with an alien species. For those with keen critical thinking skills, the seemingly foreign creatures at the beginning are not who we initially believed them to be by the end. This film amazingly weaves an abundance of profound images/clues in plain sight. Just like one of those optical illusions, which can at first appear a random assortment of dots. Yet, once your focus kicks in and you seize upon a detailed shape, you suddenly see an enormously complex picture that has been there the whole time, seemingly invisible just prior. \r\n\r\nAs I watched this film, I was curious about the shape of the aliens. They do not really conform to the aesthetic of an advanced species. While I internally wrestled with the purpose of this particular shape... it finally made sense. Boom!! Mind Blown!!!!\r\n\r\nI've heard people try to reconcile the linear/non-linear information as it unfolds in real time. This is certainly rich for grasping a fuller meaning and added depth. However, imho, the epicenter of meaning in this visual masterpiece begins with the shape of the aliens. \r\n\r\nIf you can unwrap that, you'll become like heroic linguist Elizabeth Banks, and decipher the deeper meaning behind this profound story.", "created_at": "2020-07-14T01:12:26.003Z"}, {"movie_id": 329865, "review_id": "611588baf1759c007ec7d2f6", "author_rating": 10.0, "review_text": "This may be my new favourite film. I was so emotionally involved in this film, and I'd be lying if I didn't admit a few tears were shed towards the end.", "created_at": "2021-08-12T20:46:50.237Z"}, {"movie_id": 329865, "review_id": "63573689c8a2d4007d8218d1", "author_rating": 8.0, "review_text": "**An excellent film, where the main theme is not what it seems.**\r\n\r\nIn general, I'm not a big fan of movies involving aliens... in part because they seem extremely unlikely to me (I don't really believe there is another planet with intelligent and skilled living beings like humans, or at least not developed enough to see us visit). However, I really enjoyed this film, which takes advantage of the visit of twelve spaceships from other worlds to make us question the way we view the passage of time and its linear nature. Critically acclaimed, the film received mixed reviews from audiences, with a number of detractors and admirers alike. I personally think the film is good enough to deserve our attention and respect.\r\n\r\nTo understand the script, it is necessary to bear in mind that the main theme of the film is not the spaceships and the alien visit, but Time, the passage of time and the way we look at it. As such, the film uses a non-linear narrative that can sometimes be difficult for viewers to understand: through dreams, the protagonist sees her young daughter, and we are led to think that she dreams of things from the past, and that she is now divorced, and her daughter has died of illness (I think it must have been leukemia). It is only later on that we realize that this is not quite the case… I don't want to reveal much more, but to understand the film, it is necessary to consider these points well. The extraterrestrial visit thus becomes an authentic sub-plot from a certain point onwards, and the real motivation of the visit is closely linked to its language and circular writing. I think I've given enough clues.\r\n\r\nThe advantages of this film being as it is are linked to the reflective and meditative form it takes, which can exasperate those who wanted more action or drama. I can understand that these audiences felt defrauded in their expectations. The slow narrative can sometimes drag on too much, and the film's extremely scientific nature can also make it a little difficult to understand. In the end, the quality of the plot goes downhill, things become something more cliché and predictable, but I saw that as less of a problem.\r\n\r\nI liked the work of Amy Addams, I think that the actress was relatively ignored by the judges of the Oscars that year, and it would have been fair, at the very least, to be nominated for Best Actress. She did work with soul, heart and commitment. Jeremy Renner also gave us an excellent performance, perhaps one of the best of his career so far, along with “Hurt Locker”. Unfortunately, the good performances end here: there are other excellent actors, but they didn't receive good material. The most obvious case is that of Forest Whittaker, who shone in “The Last King of Scotland”, and had a flat character here, without any development. Even so, he managed to do a lot with the little he was given.\r\n\r\nDespite only securing one Oscar for Sound Editing, the film was nominated for Best Picture, Best Director, Best Cinematography, Best Adapted Screenplay, Best Editing, Best Sound Mixing and Best Production Design. I don't know Dennis Villeneuve's work very well, I even have the impression that this was the first film of his that I've seen. So I'm not the best person to rate it. What I can say is that I liked the director's work here: he managed to give feeling and depth to a film that, on the other hand, could have been just an excuse for a lot of visual effects and CGI. The effects are there, the CGI is good, and it works really well, but the movie is more than that! The cinematography is also good, with many blurry scenes that are fundamental to the work of creating and manipulating the environment, with the film becoming increasingly tense and mysterious. The editing was also very well executed, although there were some pacing issues. Finally, a word of praise for Johann Johannsson's soundtrack, and in particular for the choice of the melody “On the Nature of Daylight”, by Max Richter.", "created_at": "2022-10-25T01:06:17.117Z"}, {"movie_id": 329865, "review_id": "647a821a93828e00bf9de1cd", "author_rating": 6.0, "review_text": "ok movie really boring at times. it was only interesting to the space craft and the aliens. other then that it was pretty dumb. working together and love is something the planet will never understand. well at least our leaders wont any way.", "created_at": "2023-06-02T23:58:18.123Z"}, {"movie_id": 329865, "review_id": "6547ec60d55c3d00abfe9c07", "author_rating": 7.0, "review_text": "I loved the visuals in this, and Amy does a great job of carrying the cast. I am able to suspend my disbelief for 120 minutes when watching sci fi, so I will avoid the useless &#34;but that&#39;s not what the military would do&#34; comments.\r\n\r\nThe movie has a great setup talking about language, culture, our perception of the world and how truly -alien- an alien life form would feel to us.\r\n\r\nUnfortunately, it uses that setup to deliver a platitude older than written language and then just throws away any conclusion to its sci fi story that we though was the main focus up until that point.\r\n\r\nYes, I know cancer is sad and all that from real life, now can we please know what happened to the aliens?? Did they get bored and leave when they saw the ending?", "created_at": "2023-11-05T19:26:24.853Z"}, {"movie_id": 329865, "review_id": "584312a4925141676400049c", "author_rating": null, "review_text": "Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!", "created_at": "2016-12-03T18:44:52.862Z"}, {"movie_id": 329865, "review_id": "5844cdd89251416a7400fc24", "author_rating": 7.0, "review_text": "Denis Villenueve offers a great film, but one that is exactly what the trailer put forth, this is not a Sci-Fi War film waiting to happen, or a modern-day horror. It's a character-driven piece about politics, life, humanity and communication.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-12-05T02:15:52.966Z"}, {"movie_id": 329865, "review_id": "58b34189c3a368522000b211", "author_rating": 7.0, "review_text": "**It was a perfect contact, but troubled at the communication.**\r\n\r\nThe film was decent. Nowadays there are lots of altered versions coming that you won't easily say those are the remakes or reboots or spin- offs or whatever they call them in these days. Like 'Premotheus' to 'Alien', this film can remind you a few titles from the past, but 'Contact' is what the majority of us believes it got inspired.\r\n\r\nThe eight Oscars nominees for the film is insane. I know some people liked it, and the film was good, that does not mean it is an Oscar product. I'm okay with the technical side recognition as it deserved that. So visually it was very good, but not a special effects extravaganza. Just a simple sci-fi drama, with a few thrills, particularly towards the end.\r\n\r\nWhen the unexpected visitors from the outer-space land their ships in the twelve different locations on the earth, the humans patiently try to communicate with them to learn their intentions. This story focused on the American soil, where experts are brought in to decode the alien language. How the rest of tale develops was told in the remaining parts.\r\n\r\nTo me it smells like a trilogy. If not, it should be. I enjoyed it, mainly because of being a drama. Sci-fi is always associated with action, adventure and thriller, but this drama was something fresh as per todays computer graphics dominated cinema world. This is particularly for the family and older people like the grownups. Like I said the youngsters love action and violence. So it is a one time viewable film and you will get everything in that attempt itself.\r\n\r\n_7/10_", "created_at": "2017-02-26T20:58:49.857Z"}, {"movie_id": 329865, "review_id": "5ac935e90e0a26497404ab59", "author_rating": 8.0, "review_text": "\"I have a brilliant idea for a movie so what we do is we watch scientists step-by-step learn to communicate with an alien species\"\r\n\r\n\"That's awesome but we need an emotional component or audiences will be bored\"\r\n\r\n\"Okay the main scientist's daughter is dead and we show clips of that every couple minutes\"\r\n\r\n\"Greenlight\"", "created_at": "2018-04-07T21:19:37.328Z"}, {"movie_id": 329865, "review_id": "5bf333700e0a261ac201cdf1", "author_rating": 8.0, "review_text": "Arrival is an attempt to take a more realistic approach to how an alien visitation would play out, especially within global politics. The main thrust is that Amy Adams has to find out what the aliens want before any other country can fuck it up and they did a great job in casting Amy Adams. I'm not usually any more than indifferent of Adams, but she does a great job here with what she's given. Jeremy Renner does as good as Jeremy Renner can do with a character that isn't just stoic bad-ass. I like Renner, but unlike other alien films, Arrival isn't an \"alien invasion\" movie where he can run around shooting stuff and making quips, so I'm not sure he was the best choice. The only other actor of note is Forrest Whitaker, who does fine, but he has this stupid accent that has no purpose. I had to watch interviews with him to make sure he wasn't just doing an accent every other time and this was his real voice. No, he does some unnatural accent that really draws you out of the film because there is no reason for it. It's not a foreign accent or a regional one (or at least not one that I've ever heard), it's just some made up shit he does for no reason. The plot is fine for where they are trying to go with the story. Personally, there are some tropes that I really fucking hate and Arrival rides on one of the ones I hate the most. I won't say what it is, because Arrival really should not be spoiled, but subjectively it was a stupid bullshit play and it makes things unnecessarily confusing. Arrival is about the aliens coming to Earth, but that serves more as the gasoline that fuels the very human drama that is very dialog driven and much more about Amy Adams than any of the aliens. I'm unclear about how long the movie takes place, but once they establish the motive of the movie, it feels cheap to skip a huge chunk of time and give us a montage of what happens instead of keeping the flow of progression. The movie takes place mostly in Montana and we get some beautiful scenery and the sets are all great. The cinematography has some interesting ideas and they use shots and colors to enhance the plot. not just document it. Hearing the comparisons to Interstellar, I was afraid of how arrogant, indulgent, and pretentious Arrival might be and while I understand now what they were trying to convey with the comparison, Arrival is none of those things. Arrival doesn't pretend that it's more than it is. There are a few story that keep my personal score from going beyond a four, but I don't see how anyone who watches Arrival knowing what kind of movie Arrival is could give it much less. If you put on Arrival expecting Mars Attacks, Alien, Independence Day, or any other sci-fi spectacle films you are going to be disappointed, Arrival is much more of a drama. Sure, it is technically a sci-fi because aliens, but that's not the drive of the film. If you choose to watch Arrival with the understanding that it can be slow and aggravating and has none of the flash and awe of a typical Sci-Fi, but replaces those with authentic characters and drama, don't think you will be disappointed.", "created_at": "2018-11-19T22:04:32.358Z"}, {"movie_id": 329865, "review_id": "5e2f2bbd1685da0013e9f95a", "author_rating": 9.0, "review_text": "Well damn.\r\n\r\nI couldn't stop thinking about this one and may not for awhile. \"Arrival\" is one of the best Sci-Fi films I've seen in this year. Everything about this film was just top notch that I can't put into words without going all over.\r\n\r\nSo let put it like this:\r\n\r\nAmy Adams was wonderful in this. A very grounded and real performance. Probably her best. Same thing that can said about Jeremy Renner.\r\n\r\nAnd how the aliens were part of the story was fascinating and quite clever. Without spoiling anything, they had a unique look to them. Like spiders. Although out the film, you feel their presence. A presence that's both scary and yet remarkable.\r\n\r\nDenis Villeneuve is my favorite working director. He can release a movie every year and still be close of making a masterpiece. Villeneuve delivers a haunting and heartbreaking story that leaves the audience with a experience that will stay with them. A beautiful, thought-provoking, Sci-Fi film that isn't an action or war movie. And I'm even more excited to see \"Blade Runner 2049\".\r\n\r\nAnd how can I forgot the amazing score, astonishing cinematography, intelligent script, and the tearjerker ending that left me in pieces.\r\n\r\nI honestly can't say anything else. Please do yourself a favor and watch it. For now, I'm dumbfounded.", "created_at": "2020-01-27T18:28:13.661Z"}, {"movie_id": 329865, "review_id": "5f0d0679efe37c0036cae81d", "author_rating": 10.0, "review_text": "Arrival has created the most profound and seamless symbolism, notably through cinematography/imagery, that may have ever been achieved to date in film.\r\n\r\nOn the surface, this appears to be a story about humans making contact with an alien species. For those with keen critical thinking skills, the seemingly foreign creatures at the beginning are not who we initially believed them to be by the end. This film amazingly weaves an abundance of profound images/clues in plain sight. Just like one of those optical illusions, which can at first appear a random assortment of dots. Yet, once your focus kicks in and you seize upon a detailed shape, you suddenly see an enormously complex picture that has been there the whole time, seemingly invisible just prior. \r\n\r\nAs I watched this film, I was curious about the shape of the aliens. They do not really conform to the aesthetic of an advanced species. While I internally wrestled with the purpose of this particular shape... it finally made sense. Boom!! Mind Blown!!!!\r\n\r\nI've heard people try to reconcile the linear/non-linear information as it unfolds in real time. This is certainly rich for grasping a fuller meaning and added depth. However, imho, the epicenter of meaning in this visual masterpiece begins with the shape of the aliens. \r\n\r\nIf you can unwrap that, you'll become like heroic linguist Elizabeth Banks, and decipher the deeper meaning behind this profound story.", "created_at": "2020-07-14T01:12:26.003Z"}, {"movie_id": 329865, "review_id": "611588baf1759c007ec7d2f6", "author_rating": 10.0, "review_text": "This may be my new favourite film. I was so emotionally involved in this film, and I'd be lying if I didn't admit a few tears were shed towards the end.", "created_at": "2021-08-12T20:46:50.237Z"}, {"movie_id": 329865, "review_id": "63573689c8a2d4007d8218d1", "author_rating": 8.0, "review_text": "**An excellent film, where the main theme is not what it seems.**\r\n\r\nIn general, I'm not a big fan of movies involving aliens... in part because they seem extremely unlikely to me (I don't really believe there is another planet with intelligent and skilled living beings like humans, or at least not developed enough to see us visit). However, I really enjoyed this film, which takes advantage of the visit of twelve spaceships from other worlds to make us question the way we view the passage of time and its linear nature. Critically acclaimed, the film received mixed reviews from audiences, with a number of detractors and admirers alike. I personally think the film is good enough to deserve our attention and respect.\r\n\r\nTo understand the script, it is necessary to bear in mind that the main theme of the film is not the spaceships and the alien visit, but Time, the passage of time and the way we look at it. As such, the film uses a non-linear narrative that can sometimes be difficult for viewers to understand: through dreams, the protagonist sees her young daughter, and we are led to think that she dreams of things from the past, and that she is now divorced, and her daughter has died of illness (I think it must have been leukemia). It is only later on that we realize that this is not quite the case… I don't want to reveal much more, but to understand the film, it is necessary to consider these points well. The extraterrestrial visit thus becomes an authentic sub-plot from a certain point onwards, and the real motivation of the visit is closely linked to its language and circular writing. I think I've given enough clues.\r\n\r\nThe advantages of this film being as it is are linked to the reflective and meditative form it takes, which can exasperate those who wanted more action or drama. I can understand that these audiences felt defrauded in their expectations. The slow narrative can sometimes drag on too much, and the film's extremely scientific nature can also make it a little difficult to understand. In the end, the quality of the plot goes downhill, things become something more cliché and predictable, but I saw that as less of a problem.\r\n\r\nI liked the work of Amy Addams, I think that the actress was relatively ignored by the judges of the Oscars that year, and it would have been fair, at the very least, to be nominated for Best Actress. She did work with soul, heart and commitment. Jeremy Renner also gave us an excellent performance, perhaps one of the best of his career so far, along with “Hurt Locker”. Unfortunately, the good performances end here: there are other excellent actors, but they didn't receive good material. The most obvious case is that of Forest Whittaker, who shone in “The Last King of Scotland”, and had a flat character here, without any development. Even so, he managed to do a lot with the little he was given.\r\n\r\nDespite only securing one Oscar for Sound Editing, the film was nominated for Best Picture, Best Director, Best Cinematography, Best Adapted Screenplay, Best Editing, Best Sound Mixing and Best Production Design. I don't know Dennis Villeneuve's work very well, I even have the impression that this was the first film of his that I've seen. So I'm not the best person to rate it. What I can say is that I liked the director's work here: he managed to give feeling and depth to a film that, on the other hand, could have been just an excuse for a lot of visual effects and CGI. The effects are there, the CGI is good, and it works really well, but the movie is more than that! The cinematography is also good, with many blurry scenes that are fundamental to the work of creating and manipulating the environment, with the film becoming increasingly tense and mysterious. The editing was also very well executed, although there were some pacing issues. Finally, a word of praise for Johann Johannsson's soundtrack, and in particular for the choice of the melody “On the Nature of Daylight”, by Max Richter.", "created_at": "2022-10-25T01:06:17.117Z"}, {"movie_id": 329865, "review_id": "647a821a93828e00bf9de1cd", "author_rating": 6.0, "review_text": "ok movie really boring at times. it was only interesting to the space craft and the aliens. other then that it was pretty dumb. working together and love is something the planet will never understand. well at least our leaders wont any way.", "created_at": "2023-06-02T23:58:18.123Z"}, {"movie_id": 329865, "review_id": "6547ec60d55c3d00abfe9c07", "author_rating": 7.0, "review_text": "I loved the visuals in this, and Amy does a great job of carrying the cast. I am able to suspend my disbelief for 120 minutes when watching sci fi, so I will avoid the useless &#34;but that&#39;s not what the military would do&#34; comments.\r\n\r\nThe movie has a great setup talking about language, culture, our perception of the world and how truly -alien- an alien life form would feel to us.\r\n\r\nUnfortunately, it uses that setup to deliver a platitude older than written language and then just throws away any conclusion to its sci fi story that we though was the main focus up until that point.\r\n\r\nYes, I know cancer is sad and all that from real life, now can we please know what happened to the aliens?? Did they get bored and leave when they saw the ending?", "created_at": "2023-11-05T19:26:24.853Z"}, {"movie_id": 329865, "review_id": "584312a4925141676400049c", "author_rating": null, "review_text": "Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!", "created_at": "2016-12-03T18:44:52.862Z"}, {"movie_id": 329865, "review_id": "5844cdd89251416a7400fc24", "author_rating": 7.0, "review_text": "Denis Villenueve offers a great film, but one that is exactly what the trailer put forth, this is not a Sci-Fi War film waiting to happen, or a modern-day horror. It's a character-driven piece about politics, life, humanity and communication.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-12-05T02:15:52.966Z"}, {"movie_id": 329865, "review_id": "58b34189c3a368522000b211", "author_rating": 7.0, "review_text": "**It was a perfect contact, but troubled at the communication.**\r\n\r\nThe film was decent. Nowadays there are lots of altered versions coming that you won't easily say those are the remakes or reboots or spin- offs or whatever they call them in these days. Like 'Premotheus' to 'Alien', this film can remind you a few titles from the past, but 'Contact' is what the majority of us believes it got inspired.\r\n\r\nThe eight Oscars nominees for the film is insane. I know some people liked it, and the film was good, that does not mean it is an Oscar product. I'm okay with the technical side recognition as it deserved that. So visually it was very good, but not a special effects extravaganza. Just a simple sci-fi drama, with a few thrills, particularly towards the end.\r\n\r\nWhen the unexpected visitors from the outer-space land their ships in the twelve different locations on the earth, the humans patiently try to communicate with them to learn their intentions. This story focused on the American soil, where experts are brought in to decode the alien language. How the rest of tale develops was told in the remaining parts.\r\n\r\nTo me it smells like a trilogy. If not, it should be. I enjoyed it, mainly because of being a drama. Sci-fi is always associated with action, adventure and thriller, but this drama was something fresh as per todays computer graphics dominated cinema world. This is particularly for the family and older people like the grownups. Like I said the youngsters love action and violence. So it is a one time viewable film and you will get everything in that attempt itself.\r\n\r\n_7/10_", "created_at": "2017-02-26T20:58:49.857Z"}, {"movie_id": 329865, "review_id": "5ac935e90e0a26497404ab59", "author_rating": 8.0, "review_text": "\"I have a brilliant idea for a movie so what we do is we watch scientists step-by-step learn to communicate with an alien species\"\r\n\r\n\"That's awesome but we need an emotional component or audiences will be bored\"\r\n\r\n\"Okay the main scientist's daughter is dead and we show clips of that every couple minutes\"\r\n\r\n\"Greenlight\"", "created_at": "2018-04-07T21:19:37.328Z"}, {"movie_id": 329865, "review_id": "5bf333700e0a261ac201cdf1", "author_rating": 8.0, "review_text": "Arrival is an attempt to take a more realistic approach to how an alien visitation would play out, especially within global politics. The main thrust is that Amy Adams has to find out what the aliens want before any other country can fuck it up and they did a great job in casting Amy Adams. I'm not usually any more than indifferent of Adams, but she does a great job here with what she's given. Jeremy Renner does as good as Jeremy Renner can do with a character that isn't just stoic bad-ass. I like Renner, but unlike other alien films, Arrival isn't an \"alien invasion\" movie where he can run around shooting stuff and making quips, so I'm not sure he was the best choice. The only other actor of note is Forrest Whitaker, who does fine, but he has this stupid accent that has no purpose. I had to watch interviews with him to make sure he wasn't just doing an accent every other time and this was his real voice. No, he does some unnatural accent that really draws you out of the film because there is no reason for it. It's not a foreign accent or a regional one (or at least not one that I've ever heard), it's just some made up shit he does for no reason. The plot is fine for where they are trying to go with the story. Personally, there are some tropes that I really fucking hate and Arrival rides on one of the ones I hate the most. I won't say what it is, because Arrival really should not be spoiled, but subjectively it was a stupid bullshit play and it makes things unnecessarily confusing. Arrival is about the aliens coming to Earth, but that serves more as the gasoline that fuels the very human drama that is very dialog driven and much more about Amy Adams than any of the aliens. I'm unclear about how long the movie takes place, but once they establish the motive of the movie, it feels cheap to skip a huge chunk of time and give us a montage of what happens instead of keeping the flow of progression. The movie takes place mostly in Montana and we get some beautiful scenery and the sets are all great. The cinematography has some interesting ideas and they use shots and colors to enhance the plot. not just document it. Hearing the comparisons to Interstellar, I was afraid of how arrogant, indulgent, and pretentious Arrival might be and while I understand now what they were trying to convey with the comparison, Arrival is none of those things. Arrival doesn't pretend that it's more than it is. There are a few story that keep my personal score from going beyond a four, but I don't see how anyone who watches Arrival knowing what kind of movie Arrival is could give it much less. If you put on Arrival expecting Mars Attacks, Alien, Independence Day, or any other sci-fi spectacle films you are going to be disappointed, Arrival is much more of a drama. Sure, it is technically a sci-fi because aliens, but that's not the drive of the film. If you choose to watch Arrival with the understanding that it can be slow and aggravating and has none of the flash and awe of a typical Sci-Fi, but replaces those with authentic characters and drama, don't think you will be disappointed.", "created_at": "2018-11-19T22:04:32.358Z"}, {"movie_id": 329865, "review_id": "5e2f2bbd1685da0013e9f95a", "author_rating": 9.0, "review_text": "Well damn.\r\n\r\nI couldn't stop thinking about this one and may not for awhile. \"Arrival\" is one of the best Sci-Fi films I've seen in this year. Everything about this film was just top notch that I can't put into words without going all over.\r\n\r\nSo let put it like this:\r\n\r\nAmy Adams was wonderful in this. A very grounded and real performance. Probably her best. Same thing that can said about Jeremy Renner.\r\n\r\nAnd how the aliens were part of the story was fascinating and quite clever. Without spoiling anything, they had a unique look to them. Like spiders. Although out the film, you feel their presence. A presence that's both scary and yet remarkable.\r\n\r\nDenis Villeneuve is my favorite working director. He can release a movie every year and still be close of making a masterpiece. Villeneuve delivers a haunting and heartbreaking story that leaves the audience with a experience that will stay with them. A beautiful, thought-provoking, Sci-Fi film that isn't an action or war movie. And I'm even more excited to see \"Blade Runner 2049\".\r\n\r\nAnd how can I forgot the amazing score, astonishing cinematography, intelligent script, and the tearjerker ending that left me in pieces.\r\n\r\nI honestly can't say anything else. Please do yourself a favor and watch it. For now, I'm dumbfounded.", "created_at": "2020-01-27T18:28:13.661Z"}, {"movie_id": 329865, "review_id": "5f0d0679efe37c0036cae81d", "author_rating": 10.0, "review_text": "Arrival has created the most profound and seamless symbolism, notably through cinematography/imagery, that may have ever been achieved to date in film.\r\n\r\nOn the surface, this appears to be a story about humans making contact with an alien species. For those with keen critical thinking skills, the seemingly foreign creatures at the beginning are not who we initially believed them to be by the end. This film amazingly weaves an abundance of profound images/clues in plain sight. Just like one of those optical illusions, which can at first appear a random assortment of dots. Yet, once your focus kicks in and you seize upon a detailed shape, you suddenly see an enormously complex picture that has been there the whole time, seemingly invisible just prior. \r\n\r\nAs I watched this film, I was curious about the shape of the aliens. They do not really conform to the aesthetic of an advanced species. While I internally wrestled with the purpose of this particular shape... it finally made sense. Boom!! Mind Blown!!!!\r\n\r\nI've heard people try to reconcile the linear/non-linear information as it unfolds in real time. This is certainly rich for grasping a fuller meaning and added depth. However, imho, the epicenter of meaning in this visual masterpiece begins with the shape of the aliens. \r\n\r\nIf you can unwrap that, you'll become like heroic linguist Elizabeth Banks, and decipher the deeper meaning behind this profound story.", "created_at": "2020-07-14T01:12:26.003Z"}, {"movie_id": 329865, "review_id": "611588baf1759c007ec7d2f6", "author_rating": 10.0, "review_text": "This may be my new favourite film. I was so emotionally involved in this film, and I'd be lying if I didn't admit a few tears were shed towards the end.", "created_at": "2021-08-12T20:46:50.237Z"}, {"movie_id": 329865, "review_id": "63573689c8a2d4007d8218d1", "author_rating": 8.0, "review_text": "**An excellent film, where the main theme is not what it seems.**\r\n\r\nIn general, I'm not a big fan of movies involving aliens... in part because they seem extremely unlikely to me (I don't really believe there is another planet with intelligent and skilled living beings like humans, or at least not developed enough to see us visit). However, I really enjoyed this film, which takes advantage of the visit of twelve spaceships from other worlds to make us question the way we view the passage of time and its linear nature. Critically acclaimed, the film received mixed reviews from audiences, with a number of detractors and admirers alike. I personally think the film is good enough to deserve our attention and respect.\r\n\r\nTo understand the script, it is necessary to bear in mind that the main theme of the film is not the spaceships and the alien visit, but Time, the passage of time and the way we look at it. As such, the film uses a non-linear narrative that can sometimes be difficult for viewers to understand: through dreams, the protagonist sees her young daughter, and we are led to think that she dreams of things from the past, and that she is now divorced, and her daughter has died of illness (I think it must have been leukemia). It is only later on that we realize that this is not quite the case… I don't want to reveal much more, but to understand the film, it is necessary to consider these points well. The extraterrestrial visit thus becomes an authentic sub-plot from a certain point onwards, and the real motivation of the visit is closely linked to its language and circular writing. I think I've given enough clues.\r\n\r\nThe advantages of this film being as it is are linked to the reflective and meditative form it takes, which can exasperate those who wanted more action or drama. I can understand that these audiences felt defrauded in their expectations. The slow narrative can sometimes drag on too much, and the film's extremely scientific nature can also make it a little difficult to understand. In the end, the quality of the plot goes downhill, things become something more cliché and predictable, but I saw that as less of a problem.\r\n\r\nI liked the work of Amy Addams, I think that the actress was relatively ignored by the judges of the Oscars that year, and it would have been fair, at the very least, to be nominated for Best Actress. She did work with soul, heart and commitment. Jeremy Renner also gave us an excellent performance, perhaps one of the best of his career so far, along with “Hurt Locker”. Unfortunately, the good performances end here: there are other excellent actors, but they didn't receive good material. The most obvious case is that of Forest Whittaker, who shone in “The Last King of Scotland”, and had a flat character here, without any development. Even so, he managed to do a lot with the little he was given.\r\n\r\nDespite only securing one Oscar for Sound Editing, the film was nominated for Best Picture, Best Director, Best Cinematography, Best Adapted Screenplay, Best Editing, Best Sound Mixing and Best Production Design. I don't know Dennis Villeneuve's work very well, I even have the impression that this was the first film of his that I've seen. So I'm not the best person to rate it. What I can say is that I liked the director's work here: he managed to give feeling and depth to a film that, on the other hand, could have been just an excuse for a lot of visual effects and CGI. The effects are there, the CGI is good, and it works really well, but the movie is more than that! The cinematography is also good, with many blurry scenes that are fundamental to the work of creating and manipulating the environment, with the film becoming increasingly tense and mysterious. The editing was also very well executed, although there were some pacing issues. Finally, a word of praise for Johann Johannsson's soundtrack, and in particular for the choice of the melody “On the Nature of Daylight”, by Max Richter.", "created_at": "2022-10-25T01:06:17.117Z"}, {"movie_id": 329865, "review_id": "647a821a93828e00bf9de1cd", "author_rating": 6.0, "review_text": "ok movie really boring at times. it was only interesting to the space craft and the aliens. other then that it was pretty dumb. working together and love is something the planet will never understand. well at least our leaders wont any way.", "created_at": "2023-06-02T23:58:18.123Z"}, {"movie_id": 329865, "review_id": "6547ec60d55c3d00abfe9c07", "author_rating": 7.0, "review_text": "I loved the visuals in this, and Amy does a great job of carrying the cast. I am able to suspend my disbelief for 120 minutes when watching sci fi, so I will avoid the useless &#34;but that&#39;s not what the military would do&#34; comments.\r\n\r\nThe movie has a great setup talking about language, culture, our perception of the world and how truly -alien- an alien life form would feel to us.\r\n\r\nUnfortunately, it uses that setup to deliver a platitude older than written language and then just throws away any conclusion to its sci fi story that we though was the main focus up until that point.\r\n\r\nYes, I know cancer is sad and all that from real life, now can we please know what happened to the aliens?? Did they get bored and leave when they saw the ending?", "created_at": "2023-11-05T19:26:24.853Z"}, {"movie_id": 329865, "review_id": "584312a4925141676400049c", "author_rating": null, "review_text": "Prior to approaching this film, a word of warning that it is what many like to call a \"thinking person's sci-fi\". If you're going to watch this, I beg that you dedicate your utmost attention to it, as it is truly one rewarding experiences, one of the smartest, most well-constructed science fiction marvels of recent years. 'Arrival' is Villeneuve's magnum opus.\r\n\r\nFirstly, to put your mind at ease, I won't be analysing the plot, thus avoiding the use of spoilers. This decade, Villeneuve has crafted some fantastic works of art in the form of 'Prisoners', 'Sicario' and now this science fiction gem, and here's hoping his career further develops with more movie masterpieces coming our way. In a world where mysteries remain and the possibility of extraterrestrial life still stands unanswered, 'Arrival' approaches this with it's cliche-free take on the genre.\r\n\r\nThe relatively unknown Bradford Young provides the film with some of the most stunning cinematography ever conceived, taking advantage of the twilight hour to give the film its somewhat unique look, supported magnificently by Icelandic composer Jóhann Jóhannsson whose score is both haunting and beautiful. If you're someone looking for a science-fiction tale that keeps you guessing and thinking throughout, with fantastic performances, cinematography, music and near-flawless direction, then 'Arrival' is the film for you. The masterpiece of 2016!", "created_at": "2016-12-03T18:44:52.862Z"}, {"movie_id": 329865, "review_id": "5844cdd89251416a7400fc24", "author_rating": 7.0, "review_text": "Denis Villenueve offers a great film, but one that is exactly what the trailer put forth, this is not a Sci-Fi War film waiting to happen, or a modern-day horror. It's a character-driven piece about politics, life, humanity and communication.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-12-05T02:15:52.966Z"}, {"movie_id": 329865, "review_id": "58b34189c3a368522000b211", "author_rating": 7.0, "review_text": "**It was a perfect contact, but troubled at the communication.**\r\n\r\nThe film was decent. Nowadays there are lots of altered versions coming that you won't easily say those are the remakes or reboots or spin- offs or whatever they call them in these days. Like 'Premotheus' to 'Alien', this film can remind you a few titles from the past, but 'Contact' is what the majority of us believes it got inspired.\r\n\r\nThe eight Oscars nominees for the film is insane. I know some people liked it, and the film was good, that does not mean it is an Oscar product. I'm okay with the technical side recognition as it deserved that. So visually it was very good, but not a special effects extravaganza. Just a simple sci-fi drama, with a few thrills, particularly towards the end.\r\n\r\nWhen the unexpected visitors from the outer-space land their ships in the twelve different locations on the earth, the humans patiently try to communicate with them to learn their intentions. This story focused on the American soil, where experts are brought in to decode the alien language. How the rest of tale develops was told in the remaining parts.\r\n\r\nTo me it smells like a trilogy. If not, it should be. I enjoyed it, mainly because of being a drama. Sci-fi is always associated with action, adventure and thriller, but this drama was something fresh as per todays computer graphics dominated cinema world. This is particularly for the family and older people like the grownups. Like I said the youngsters love action and violence. So it is a one time viewable film and you will get everything in that attempt itself.\r\n\r\n_7/10_", "created_at": "2017-02-26T20:58:49.857Z"}, {"movie_id": 329865, "review_id": "5ac935e90e0a26497404ab59", "author_rating": 8.0, "review_text": "\"I have a brilliant idea for a movie so what we do is we watch scientists step-by-step learn to communicate with an alien species\"\r\n\r\n\"That's awesome but we need an emotional component or audiences will be bored\"\r\n\r\n\"Okay the main scientist's daughter is dead and we show clips of that every couple minutes\"\r\n\r\n\"Greenlight\"", "created_at": "2018-04-07T21:19:37.328Z"}, {"movie_id": 329865, "review_id": "5bf333700e0a261ac201cdf1", "author_rating": 8.0, "review_text": "Arrival is an attempt to take a more realistic approach to how an alien visitation would play out, especially within global politics. The main thrust is that Amy Adams has to find out what the aliens want before any other country can fuck it up and they did a great job in casting Amy Adams. I'm not usually any more than indifferent of Adams, but she does a great job here with what she's given. Jeremy Renner does as good as Jeremy Renner can do with a character that isn't just stoic bad-ass. I like Renner, but unlike other alien films, Arrival isn't an \"alien invasion\" movie where he can run around shooting stuff and making quips, so I'm not sure he was the best choice. The only other actor of note is Forrest Whitaker, who does fine, but he has this stupid accent that has no purpose. I had to watch interviews with him to make sure he wasn't just doing an accent every other time and this was his real voice. No, he does some unnatural accent that really draws you out of the film because there is no reason for it. It's not a foreign accent or a regional one (or at least not one that I've ever heard), it's just some made up shit he does for no reason. The plot is fine for where they are trying to go with the story. Personally, there are some tropes that I really fucking hate and Arrival rides on one of the ones I hate the most. I won't say what it is, because Arrival really should not be spoiled, but subjectively it was a stupid bullshit play and it makes things unnecessarily confusing. Arrival is about the aliens coming to Earth, but that serves more as the gasoline that fuels the very human drama that is very dialog driven and much more about Amy Adams than any of the aliens. I'm unclear about how long the movie takes place, but once they establish the motive of the movie, it feels cheap to skip a huge chunk of time and give us a montage of what happens instead of keeping the flow of progression. The movie takes place mostly in Montana and we get some beautiful scenery and the sets are all great. The cinematography has some interesting ideas and they use shots and colors to enhance the plot. not just document it. Hearing the comparisons to Interstellar, I was afraid of how arrogant, indulgent, and pretentious Arrival might be and while I understand now what they were trying to convey with the comparison, Arrival is none of those things. Arrival doesn't pretend that it's more than it is. There are a few story that keep my personal score from going beyond a four, but I don't see how anyone who watches Arrival knowing what kind of movie Arrival is could give it much less. If you put on Arrival expecting Mars Attacks, Alien, Independence Day, or any other sci-fi spectacle films you are going to be disappointed, Arrival is much more of a drama. Sure, it is technically a sci-fi because aliens, but that's not the drive of the film. If you choose to watch Arrival with the understanding that it can be slow and aggravating and has none of the flash and awe of a typical Sci-Fi, but replaces those with authentic characters and drama, don't think you will be disappointed.", "created_at": "2018-11-19T22:04:32.358Z"}, {"movie_id": 329865, "review_id": "5e2f2bbd1685da0013e9f95a", "author_rating": 9.0, "review_text": "Well damn.\r\n\r\nI couldn't stop thinking about this one and may not for awhile. \"Arrival\" is one of the best Sci-Fi films I've seen in this year. Everything about this film was just top notch that I can't put into words without going all over.\r\n\r\nSo let put it like this:\r\n\r\nAmy Adams was wonderful in this. A very grounded and real performance. Probably her best. Same thing that can said about Jeremy Renner.\r\n\r\nAnd how the aliens were part of the story was fascinating and quite clever. Without spoiling anything, they had a unique look to them. Like spiders. Although out the film, you feel their presence. A presence that's both scary and yet remarkable.\r\n\r\nDenis Villeneuve is my favorite working director. He can release a movie every year and still be close of making a masterpiece. Villeneuve delivers a haunting and heartbreaking story that leaves the audience with a experience that will stay with them. A beautiful, thought-provoking, Sci-Fi film that isn't an action or war movie. And I'm even more excited to see \"Blade Runner 2049\".\r\n\r\nAnd how can I forgot the amazing score, astonishing cinematography, intelligent script, and the tearjerker ending that left me in pieces.\r\n\r\nI honestly can't say anything else. Please do yourself a favor and watch it. For now, I'm dumbfounded.", "created_at": "2020-01-27T18:28:13.661Z"}, {"movie_id": 329865, "review_id": "5f0d0679efe37c0036cae81d", "author_rating": 10.0, "review_text": "Arrival has created the most profound and seamless symbolism, notably through cinematography/imagery, that may have ever been achieved to date in film.\r\n\r\nOn the surface, this appears to be a story about humans making contact with an alien species. For those with keen critical thinking skills, the seemingly foreign creatures at the beginning are not who we initially believed them to be by the end. This film amazingly weaves an abundance of profound images/clues in plain sight. Just like one of those optical illusions, which can at first appear a random assortment of dots. Yet, once your focus kicks in and you seize upon a detailed shape, you suddenly see an enormously complex picture that has been there the whole time, seemingly invisible just prior. \r\n\r\nAs I watched this film, I was curious about the shape of the aliens. They do not really conform to the aesthetic of an advanced species. While I internally wrestled with the purpose of this particular shape... it finally made sense. Boom!! Mind Blown!!!!\r\n\r\nI've heard people try to reconcile the linear/non-linear information as it unfolds in real time. This is certainly rich for grasping a fuller meaning and added depth. However, imho, the epicenter of meaning in this visual masterpiece begins with the shape of the aliens. \r\n\r\nIf you can unwrap that, you'll become like heroic linguist Elizabeth Banks, and decipher the deeper meaning behind this profound story.", "created_at": "2020-07-14T01:12:26.003Z"}, {"movie_id": 329865, "review_id": "611588baf1759c007ec7d2f6", "author_rating": 10.0, "review_text": "This may be my new favourite film. I was so emotionally involved in this film, and I'd be lying if I didn't admit a few tears were shed towards the end.", "created_at": "2021-08-12T20:46:50.237Z"}, {"movie_id": 329865, "review_id": "63573689c8a2d4007d8218d1", "author_rating": 8.0, "review_text": "**An excellent film, where the main theme is not what it seems.**\r\n\r\nIn general, I'm not a big fan of movies involving aliens... in part because they seem extremely unlikely to me (I don't really believe there is another planet with intelligent and skilled living beings like humans, or at least not developed enough to see us visit). However, I really enjoyed this film, which takes advantage of the visit of twelve spaceships from other worlds to make us question the way we view the passage of time and its linear nature. Critically acclaimed, the film received mixed reviews from audiences, with a number of detractors and admirers alike. I personally think the film is good enough to deserve our attention and respect.\r\n\r\nTo understand the script, it is necessary to bear in mind that the main theme of the film is not the spaceships and the alien visit, but Time, the passage of time and the way we look at it. As such, the film uses a non-linear narrative that can sometimes be difficult for viewers to understand: through dreams, the protagonist sees her young daughter, and we are led to think that she dreams of things from the past, and that she is now divorced, and her daughter has died of illness (I think it must have been leukemia). It is only later on that we realize that this is not quite the case… I don't want to reveal much more, but to understand the film, it is necessary to consider these points well. The extraterrestrial visit thus becomes an authentic sub-plot from a certain point onwards, and the real motivation of the visit is closely linked to its language and circular writing. I think I've given enough clues.\r\n\r\nThe advantages of this film being as it is are linked to the reflective and meditative form it takes, which can exasperate those who wanted more action or drama. I can understand that these audiences felt defrauded in their expectations. The slow narrative can sometimes drag on too much, and the film's extremely scientific nature can also make it a little difficult to understand. In the end, the quality of the plot goes downhill, things become something more cliché and predictable, but I saw that as less of a problem.\r\n\r\nI liked the work of Amy Addams, I think that the actress was relatively ignored by the judges of the Oscars that year, and it would have been fair, at the very least, to be nominated for Best Actress. She did work with soul, heart and commitment. Jeremy Renner also gave us an excellent performance, perhaps one of the best of his career so far, along with “Hurt Locker”. Unfortunately, the good performances end here: there are other excellent actors, but they didn't receive good material. The most obvious case is that of Forest Whittaker, who shone in “The Last King of Scotland”, and had a flat character here, without any development. Even so, he managed to do a lot with the little he was given.\r\n\r\nDespite only securing one Oscar for Sound Editing, the film was nominated for Best Picture, Best Director, Best Cinematography, Best Adapted Screenplay, Best Editing, Best Sound Mixing and Best Production Design. I don't know Dennis Villeneuve's work very well, I even have the impression that this was the first film of his that I've seen. So I'm not the best person to rate it. What I can say is that I liked the director's work here: he managed to give feeling and depth to a film that, on the other hand, could have been just an excuse for a lot of visual effects and CGI. The effects are there, the CGI is good, and it works really well, but the movie is more than that! The cinematography is also good, with many blurry scenes that are fundamental to the work of creating and manipulating the environment, with the film becoming increasingly tense and mysterious. The editing was also very well executed, although there were some pacing issues. Finally, a word of praise for Johann Johannsson's soundtrack, and in particular for the choice of the melody “On the Nature of Daylight”, by Max Richter.", "created_at": "2022-10-25T01:06:17.117Z"}, {"movie_id": 329865, "review_id": "647a821a93828e00bf9de1cd", "author_rating": 6.0, "review_text": "ok movie really boring at times. it was only interesting to the space craft and the aliens. other then that it was pretty dumb. working together and love is something the planet will never understand. well at least our leaders wont any way.", "created_at": "2023-06-02T23:58:18.123Z"}, {"movie_id": 329865, "review_id": "6547ec60d55c3d00abfe9c07", "author_rating": 7.0, "review_text": "I loved the visuals in this, and Amy does a great job of carrying the cast. I am able to suspend my disbelief for 120 minutes when watching sci fi, so I will avoid the useless &#34;but that&#39;s not what the military would do&#34; comments.\r\n\r\nThe movie has a great setup talking about language, culture, our perception of the world and how truly -alien- an alien life form would feel to us.\r\n\r\nUnfortunately, it uses that setup to deliver a platitude older than written language and then just throws away any conclusion to its sci fi story that we though was the main focus up until that point.\r\n\r\nYes, I know cancer is sad and all that from real life, now can we please know what happened to the aliens?? Did they get bored and leave when they saw the ending?", "created_at": "2023-11-05T19:26:24.853Z"}]