[{"movie_id": 10707, "review_id": "5c5f36690e0a264d6f69be49", "author_rating": 8.0, "review_text": "***Gripping realistic account of divorce and its consequences; it’s also occasionally comical***   \r\n\r\n“The Squid and the Whale” (2005) is a frank, quirky and amusing drama about a family from Brooklyn in 1986 that encounters divorce and the ramifications thereof. The father (Jeff Daniels) is a literary professor and fading author while the wife (Laura Linney) is an emerging writer, a sweet liberal who for some reason can’t stop having affairs. The two boys are played by Jesse Eisenberg and Owen Kline. William Baldwin is on hand as a tennis instructor while Anna Paquin plays a college student.   \r\n\r\nThe story is unsurprisingly based on director/writer Noah Baumbach’s own family’s experience. I say “unsurprisingly” because the movie smacks of real life with its candid and sometimes comical approach.\r\n\r\nA few viewers didn’t ‘get’ the father, Bernard Berkman (Daniels), and have interpreted him in an uber-negative way. Yes, he’s a grotesquely competitive, pompous cheapskate, but his comical flaws are rounded out by an inherent decency. He’s clearly not the unfaithful partner and wants to keep the family together. He takes the time to spend quality time with his boys and mentor them, especially Walt (Eisenberg), who idolizes him.  \r\n\r\nSpeaking of the father and Walt, Eisenberg and Daniel’s characters and their performances are the highlight of this picture. Both characters are fascinating psychological studies. Eisenberg possesses the intense, intelligent charisma of James McAvoy and Brando. Is it any wonder that he went on to play The Joker in the DCEU? Winsome Halley Feiffer is on hand as his girlfriend.\r\n\r\nSpeaking of females, Anna Paquin is another highlight even while her lack of modesty isn’t very becoming. Nevertheless she looks great in jeans.   \r\n\r\nThe movie runs 1 hour, 21 minutes and was shot in Brooklyn, New York.\r\n\r\nGRADE: A-", "created_at": "2019-02-09T20:22:01.734Z"}]