[{"movie_id": 9656, "review_id": "560ecce09251414779003c6c", "author_rating": 3.0, "review_text": "Eye eye, what we got ere then?\r\n\r\nThere's a running eyeball motif throughout this revamp/reimaging of Bob Clark's much revered culter of the same name (1974), after sitting through it you may, like me, feel like extracting your own eyeballs and playing ping-pong with them! \r\n\r\nBunch of pretty sorority girls get menaced and mangled by a deranged killer who has come home for Christmas...\r\n\r\nThis lacks everything that made Bob Clark's film so effective. The less is more approach has gone, thus there is very little suspense, and in place is a gigantic back story for the killer. The characterisation of the girls, some acted by some very capable actresses, is practically non existent, so very little emotional heft to draw you into a state of caring for them. There's some good gore on show, but since tonally the pic is all over the place, it's never once scary or ironically funny.\r\n\r\nA poor show all round. 3/10", "created_at": "2015-10-02T18:28:48.491Z"}, {"movie_id": 9656, "review_id": "5e21443e397df00016977a8e", "author_rating": 5.0, "review_text": "Obviously doesn't hold a candle to the original, and some of the acting is pretty genuinely bad, but it knows what it wants and it goes for it. What it wants, here being: To be hamstrung to keeping in step with its predecessor but also being wildly different enough to piss anyone off who was expecting an actual \"remake\".\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-01-17T05:21:02.115Z"}, {"movie_id": 9656, "review_id": "6056ac574083b300297fa58a", "author_rating": 7.0, "review_text": "_**More entertaining than the original, but marred by a ridiculous tacked-on ending**_\r\n\r\nDuring Christmas Eve at a sorority house in New Hampshire, the students & housemother are harassed by a killer who likes to gouge out eyes. For some strange reason the mad slasher knows all the inner rooms and crawlspaces of the house (attic, basement, etc.).\r\n\r\n“Black Christmas” (2006) is the first of two remakes of the original film from 1974 (the other being released in 2019 and is a remake-in-name-only). This version is more colorful and entertaining than the original, but also more twisted, highlighted by a superior cast of women, including Michelle Trachtenberg (Melissa), Lacey Chabert (Dana), Mary Elizabeth Winstead (Heather), Jessica Harmon (Megan), Leela Savasta (Clair) and Katie Cassidy (Kelli).\r\n\r\nWritten & directed by Glen Morgan, the film is inventive with its backstory and the way the killer haunts the innards of the house, spying & preying on the girls. This is genuinely compelling stuff. Unfortunately, the film's tone and ending were marred by the interference of studio exec Bob Weinstein, who wanted a more over-the-top horror flick with cartoonish embellishments. The preposterous ending in particular seems tacked-on and (almost) ruins the movie. Thankfully some versions of the film are closer to Morgan’s original vision, at least as far as the climax goes.\r\n\r\nThe movie runs about 1 hour, 30 minutes, with a couple other versions longer or shorter by 4-5 minutes (depending on which ending was used). The film was shot in Vancouver, British Columbia, with the hospital scenes done at Riverview Hospital in nearby Coquitlam.\r\n\r\nGRADE: B", "created_at": "2021-03-21T02:15:51.116Z"}]