[{"movie_id": 343611, "review_id": "580f000d9251416c7d006717", "author_rating": null, "review_text": "I was a supporter of the first Jack Reacher film, having never developed a literary attachment to the eponymous hero and thus being perfectly happy to see him misinterpreted (apparently) by the diminutive Tom Cruise.\r\n\r\nBut this sequel, adapted from another of Lee Child's bestselling books, has the misfortune to bear a title which may provide its epitaph.\r\n\r\nReacher does come back, on a similar mission to last time: that is, to clear someone's name and run around (he does a lot of running) dodging those who would rather see him hand-cuffed and out of their ill-intentioned way.", "created_at": "2016-10-25T06:47:41.839Z"}, {"movie_id": 343611, "review_id": "59b1ea5bc3a368244303734c", "author_rating": 7.0, "review_text": "**...but he did go back and got into a trouble!**\r\n\r\nThe original source is a long book series, so they did not do it in order. Like the first film, which was based on the ninth book, this one was on the eighteenth. It was a stylishly made film. The actors were good, and their stunts were excellent. But not the storyline. This is a very familiar theme. You know, someone framed you and you go on to dig the truth while everyone trying to hunt you down. There are lots of close encounter, which give great thrilling entertainment. So, other than the story, everything looked fine.\r\n\r\nJack goes to meet one of his ex colleagues at his old headquarters. But soon he discovers she's behind the bars and now he's too for the crime they did not do. So escaping from the prison and looking for clues, who framed them and why, all one by one disclosed with some excellent running-chasing action sequences. The film almost as good as any timepass action film. But like it was the new wine in an old bottle. So it won't work for everyone, especially those with greater expectations.\r\n\r\nThe 55 year old Tom Cruise on the edge to become a veteran actor, but still he got that action hero macho in him. Probably another 3-4 films, including the upcoming 'Mission: Impossible' sequel. So this franchise could replace his cast with younger one in the future. Because another 20 books to go. Though, I'm thinking about the television series. Cobie too was awesome. The film justifies to its original, but not more than an above average. So good for once watching it.\r\n\r\n_6.5/10_", "created_at": "2017-09-08T00:54:51.406Z"}, {"movie_id": 343611, "review_id": "5f56cf7290dde00034ee54e3", "author_rating": 7.0, "review_text": "A suitably entertaining sequel, even if it is a downgrade on the very good original.\r\n\r\n<em>'Jack Reacher: Never Go Back'</em> sees a whole new cast, with one obvious exception, and that does affect my enjoyment - not a fan of major cast changes, myself. Still, the newcomers all add a decent amount with their performances. The premise, meanwhile, is less interesting than that of <em>'Jack Reacher'</em>, but it still makes for solid action.\r\n\r\nTom Cruise (Jack) is, as you'd predict, the clear best part of this follow-up. That man does a lot of productions in this genre, in that regard his performance doesn't feel majorly different from his other work but the film is at its highest point when he is onscreen. Cruise is joined by the pleasing Cobie Smulders (Turner) and satisfactory Danika Yarosh (Samantha). Elsewhere, you have the underused duo of Aldis Hodge (Espin) and Robert Knepper (James).\r\n\r\nIn conclusion, this may not match 2012's effort but there is still fun to be had.", "created_at": "2020-09-08T00:25:22.232Z"}, {"movie_id": 343611, "review_id": "64a62c68c3bffe00c86b84b0", "author_rating": 8.0, "review_text": "Good movie. Just like a normal type of Tom Cruise movie. Where he kicks lots of butte. In this one he's like a ghost. Trying to be like the bourne identity. Still a decent movie though.", "created_at": "2023-07-06T02:52:24.191Z"}]