[{"movie_id": 21208, "review_id": "56c7cbeec3a3684089001020", "author_rating": 10.0, "review_text": "Isabelle Fuhrman gives an epic performance. I can't really say too much without giving away spoilers, but I can see why she ended up being Clove!", "created_at": "2016-02-20T02:14:06.021Z"}, {"movie_id": 21208, "review_id": "6364f617d7107e008d77363a", "author_rating": 6.0, "review_text": "I had a problem with this right from the start. Just how this young girl from eastern Europe managed to get herself placed in a wealthy American family without any semblance of blood or DNA checks to establish - for real - that she was who the father \"John\" (Peter Sarsgaard) desperately wanted her to be. Though I did enjoy the film thereafter, that implausibility was never far from the back of my mind as we see the monster that is \"Esther\" (a strong performance from Isabelle Fuhrman) develop around us causing havoc and mayhem for the \"Coleman\" family - recently recovering from their own tragic bereavement. The concept is fascinating - an adult (and a ruthless and unstable one at that) in the persona of a child using innocence as the ultimate tool for deception is cleverly delivered by the cast and from the pen of Alex Mace. The wintry scenario and the John Ottman score also contribute well to a genuine sense of menace as those who get in her way are unceremoniously snuffed out. She even manages to ensnare the services of a young and vulnerable accomplice, too! It's a perfect example of hiding in plain sight, and is certainly one of the more effective role-playing, psychological, horror films I have seen.", "created_at": "2022-11-04T11:23:03.785Z"}, {"movie_id": 21208, "review_id": "64bbd3ac58efd300ff1af5a1", "author_rating": 8.0, "review_text": "This is a great movie. It's one of those movies you can only watch once though. Any more after that you know what's going on. Great ending but it ruins the movie from ever watching it again. Can't wait to see the sequel though.", "created_at": "2023-07-22T13:03:40.388Z"}]