[{"movie_id": 505026, "review_id": "6201271611386c006a3402f3", "author_rating": null, "review_text": "Originally set to release in December of 2019; the long-delayed cinematic retelling of Agatha Christie’s “Death on the Nile” has finally arrived in cinemas. The last cinematic version of the classic book arrived in 1978 and this time; Director and star Kenneth Branagh beings his version of Master Detective Hercule Poirot to Egypt after a chance encounter with his friend Bouc (Tom Bateman) while on vacation; Poirot attends the wedding of wealthy socialite Linette Ridgeway (Gal Gadot) and notices that she has married a man named Simon Doyle (Armie Hammer).\r\n\r\nThe wedding is a bit of a shock to many as just six weeks prior Doyle was engaged to Jacqueline de Bellefort (Emma Mackey), and Poirot observed the two of them in a London club and how Ridgeway was introduced to Simon by her friend Jacqueline.\r\n\r\nThe wedding reception is disrupted by the arrival of Jacqueline and Linette and Simon confides in Poirot that she has been following them around the world and asks the Detective to encourage her to leave them alone so they can get on with their life.\r\n\r\nJacqueline is highly disturbed and pleads her love for Simon and shows a gun which leads Poirot to encourage the newlyweds to abandon their overseas plans and go home. Simon and Linette press on and decide to take their wedding party on a cruise of the Nile in an attempt to get away from Jacqueline.\r\n\r\nThe plan seems to be working well until Jacqueline shows up as a ticketed passenger at a stop along the way. When a near-fatal accident occurs followed by a murder; Poirot must investigate the guests to find the killer. Naturally, there is plenty of motivation to go around, and as the deaths mount; Poirot must use his genius to find the killer.\r\n\r\nThe movie takes its time getting started but the CGI-enhanced scenery and the strong cast are very compelling and set the pieces in place very well. While I was able to solve the mystery about halfway into the film, some of the details around it were cleverly concealed and there were plenty of twists that had me consider other possible suspects.\r\n\r\nSome may find the film a bit slow but that is the nature of a good mystery as time is given to developing the characters and their motives which adds to the suspense of the film.\r\n\r\nIn the end, the film is an engaging mystery that recalls the classic movie mysteries of old and it will be very interesting to see if audiences will embrace the film in the same way as they did with “Murder on the Orient Express” and audiences will get more Poirot adventures from Branagh in the near future.\r\n\r\n4 stars out of 5.", "created_at": "2022-02-07T14:05:10.942Z"}, {"movie_id": 505026, "review_id": "62053742e2bca8009f82f8e1", "author_rating": 4.0, "review_text": "_Death on the Nile_ crawls towards a resolution you don’t feel invested in. Poirot’s backstory is interesting and there are some solid performances especially from the female cast, but the film otherwise feels like an unwanted game of Guess Who after you unwillingly chug two bottles of NyQuil and are asked to predict who the killer is after two long hours of tediousness.\r\n\r\n**Full review:** hubpages.com/entertainment/Death-on-the-Nile-2022-Review-A-Drowzy-Whodunit-Loaded-with-Mediocrity", "created_at": "2022-02-10T16:03:14.236Z"}, {"movie_id": 505026, "review_id": "6208069a9408ec00cc6c61f1", "author_rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/death-on-the-nile-spoiler-free-review\r\n\r\n\"Death on the Nile retains the problems of its predecessor, containing an even less mysterious central mystery and even less interesting multiple storylines. Kenneth Branagh is the great savior, offering a distinctive directing style and an iconic performance as Hercule Poirot.\r\n\r\nDespite some good displays and a couple of pleasant arcs, Michael Green's screenplay relies too much on its heavy exposition, not managing to escape the forced, dull, redundant dialogues. The audiovisual environment surrounding the entire film reeks of digital deception, sweating its green screen throughout the runtime.\r\n\r\nA whodunnit is worth more than merely finding the criminal, but the resolution literally being the first option that the first act suggests leaves an inevitable taste of disappointment.\"\r\n\r\nRating: C-", "created_at": "2022-02-12T19:12:26.387Z"}, {"movie_id": 505026, "review_id": "6242011c5a9915004841bea6", "author_rating": 6.0, "review_text": "It's probably best to start by saying that this adaptation of the Agatha Christie novel has virtually nothing at all in common with the 1978 Ustinov/Niven iteration (which I really like). Sir Kenneth Branagh starts off by giving us a little of the somewhat tragic WWI backstory to the famous Belgian detective before we are introduced to the newlywed \"Doyle\" couple Gal Gadot and Armie Hammer, his disgruntled ex girlfriend \"Jackie\" (Emma Mackey - whom I could have sworn was Margot Robbie) and an assembled cast aboard the luxury Nile paddle steamer \"Karnak\" where murder and mayhem ensue. A great deal of care has been taken with this production, and it looks great. That said, though, I found the characterisations pretty sterile; there are stars here but not (Annette Bening notwithstanding) big stars, and we get to know little of the personalities or grudges of the suspects. Tom Bateman reprises his role as \"Book\" from Sir Kenneth's other, equally flawed, \"Poirot\" outing back in 2017, but that stretches coincidence just a bit too much! There is little, if any humour, and though I did initially enjoy the 1930s Blues music it started to intrude a bit as the film progressed. Patrick Doyle's rather bland score reminded me of \"Kingdom of Heaven\" (2005) and though there is a fair degree of location photography, there is an equally fair degree of pretty obvious CGI too. Somehow, Sir Kenneth just isn't \"Poirot\" for me. His performances are always just a little bit too theatrical - he always has to be centre stage. The whole pace of the film really does lack any accumulating sense of menace and though it is certainly better seeing it on a big screen, I was really somewhat underwhelmed.", "created_at": "2022-03-28T18:40:28.765Z"}, {"movie_id": 505026, "review_id": "624a0cbb8c7b0f009a13153b", "author_rating": 5.0, "review_text": "From a technical standpoint it's not bad and does feature a good cast and fine performances, but it's also rather predictable (kind of called the twist early on) and it's fairly slow to the point it I was losing interest (even though it's less than two hours long sans credits). Only glad I watched this for free on HBO Max as this was a one-time viewing for me (as was Branagh's Murder on the Orient Express, which I found only mildly entertaining but also overlong). **2.75/5**", "created_at": "2022-04-03T21:08:11.767Z"}, {"movie_id": 505026, "review_id": "62af79203c4344080c4408e3", "author_rating": 4.0, "review_text": "I honestly did not expect much out of this movie given how Branagh’s Murder on the Orient Express turned out.\r\n\r\nNow, Hercule Poirot together with Sherlock Holmes are my two favourite fictional detectives and I’m obviously having strong opinions about the subject. If you liked the movie then fine but this is my personal opinions so… here we go.\r\n\r\nJust as with Murder on the Orient Express it could have been a decent mystery/crime movie if it had not pretended to be a Hercule Poirot movie but again this was a miserable attempt to make a Americanized version of Hercule Poirot.\r\n\r\nThe movie starts off with black and white scenes from World War I trying to make him out to be some war hero. There was no reason for that and it is not Hercule Poirot.\r\n\r\nOne good thing I can write about the movie is that there are some lovely scenery, especially at the beginning. Unfortunately that is about it as far as the good parts go from my point of view.\r\n\r\nApart from the good scenery the film goes overboard trying to get fancy with the camera. Like the ridiculous revolving scenes on the boat, bizarre perspectives and quite a few too dark and gloomy scenes.\r\n\r\nThe worst part of the movie is that it is totally disrespectful of the Hercule Poirot that Agatha Christie created. Poirot does NOT run after criminals while shots are being fired, Poirot may scream but with dignity, not soap opera like outbursts. He was not the only one having unbecoming outbursts by the way. And do not get me started about how the movie ruined the famous end scene where Poirot traditionally exposes the criminal by having Poirot waving a gun and appearing totally dishevelled. Even the hideously large moustache is just all wrong.\r\n\r\nDeath on the Nile is a British mystery novel by one of the most famous mystery writers ever, not some pulp fiction that you can put your own spin on but Kenneth Branagh does not seem to realize this.", "created_at": "2022-06-19T19:29:36.275Z"}, {"movie_id": 505026, "review_id": "63002ad4bb2602008459ec30", "author_rating": 5.0, "review_text": "**For a movie with death in the title, it takes way too long for the mystery to begin. Bore on the Nile.**\r\n\r\nDeath on the Nile waits almost an hour into the movie before there is an actual death... a murder mystery that is focused much more on the shallow lives of its wealthy aristocrats rather than solving the murder mystery. The mystery is fairly stereotypical and easy to figure out. The film is dreadfully slow, making the 2 hour run time feel more like 3 hours. If you enjoyed Murder on the Orient Express, you would probably enjoy the expanded characterization of Kenneth Branagh's Hercule Poirot amidst the spectacular set pieces and wardrobe of the 1930s. Mix in superstar Gal Gadot and some other up-and-coming talented actors and Death on the Nile rises from absolute bore to tolerable.\r\n\r\n_As a total bonus - Kenneth Branagh's mustache in this movie is a work of art in and of itself! That thing is amazing!_", "created_at": "2022-08-20T00:29:08.432Z"}, {"movie_id": 505026, "review_id": "6309bc35dcb6a30083594a00", "author_rating": 1.0, "review_text": "Death on the Nile has a prologue set in World War I, where a young Hercule Poirot is played by a digitally ‘de-aged’ Kenneth Branagh. Et tu, Kenneth? If you must do this, why not get a younger actor who looks likes Branagh? Or even one who doesn’t look like the Northern Irish writer/director/actor, so long as he looks like an actual human being; it’s safe to say that Branagh looks neither like himself nor like a member of the human race (he actually looks less grotesque after an explosion disfigures one side of his face). Again, this is only if you must do this – but then, you mustn’t do it, especially considering that this prologue exists only, and I kid you not, as an origin story for Poirot’s mustache.\r\n\r\nIn order to catch up with Branagh’s current appearance, the character then ages some 40 years in the space of about two decades, and in the interim it’s the world around him that has received a digital facelift – in particular Egypt, whose entire topography and everything in it, including flora, fauna, bodies of water, architecture, historical landmarks, etc., etc., has been computer-generated, and very crudely at that. They should have called this Death on Denial, because based on the evidence of this movie, the Nile isn’t a river in Egypt – or a river at all, nor Egypt a place that bears any resemblance to any known landscape that can be found on planet Earth.\r\n\r\nAs for the actual plot, who cares? It's impossible to believe in the existence of these characters as real persons because they're all clearly actors standing in front of green screens, and the \"Death\" of the title is rendered meaningless because it takes place in a lifeless world. Even an Agatha Christie murder mystery – nay, especially an Agatha Christie murder mystery demands a plausible backdrop, and in that sense a matte painting, rear projection, miniatures, any number indeed of practical special effects would offer a much more tangible setting for this story – the next best thing, as a matter of fact, to actually shooting on location (which admittedly is not always feasible).", "created_at": "2022-08-27T06:39:49.354Z"}, {"movie_id": 505026, "review_id": "631fa7dd435011007ab5bf34", "author_rating": null, "review_text": "Decidedly more electric than Murder on the Orient Express, but much sloppier. Can’t believe the “enough champagne to fill the nile” clip was unedited from the movie for the trailer, wild stuff.\r\n\r\nHad a good time at the theater 🥂", "created_at": "2022-09-12T21:42:53.163Z"}, {"movie_id": 505026, "review_id": "6201271611386c006a3402f3", "author_rating": null, "review_text": "Originally set to release in December of 2019; the long-delayed cinematic retelling of Agatha Christie’s “Death on the Nile” has finally arrived in cinemas. The last cinematic version of the classic book arrived in 1978 and this time; Director and star Kenneth Branagh beings his version of Master Detective Hercule Poirot to Egypt after a chance encounter with his friend Bouc (Tom Bateman) while on vacation; Poirot attends the wedding of wealthy socialite Linette Ridgeway (Gal Gadot) and notices that she has married a man named Simon Doyle (Armie Hammer).\r\n\r\nThe wedding is a bit of a shock to many as just six weeks prior Doyle was engaged to Jacqueline de Bellefort (Emma Mackey), and Poirot observed the two of them in a London club and how Ridgeway was introduced to Simon by her friend Jacqueline.\r\n\r\nThe wedding reception is disrupted by the arrival of Jacqueline and Linette and Simon confides in Poirot that she has been following them around the world and asks the Detective to encourage her to leave them alone so they can get on with their life.\r\n\r\nJacqueline is highly disturbed and pleads her love for Simon and shows a gun which leads Poirot to encourage the newlyweds to abandon their overseas plans and go home. Simon and Linette press on and decide to take their wedding party on a cruise of the Nile in an attempt to get away from Jacqueline.\r\n\r\nThe plan seems to be working well until Jacqueline shows up as a ticketed passenger at a stop along the way. When a near-fatal accident occurs followed by a murder; Poirot must investigate the guests to find the killer. Naturally, there is plenty of motivation to go around, and as the deaths mount; Poirot must use his genius to find the killer.\r\n\r\nThe movie takes its time getting started but the CGI-enhanced scenery and the strong cast are very compelling and set the pieces in place very well. While I was able to solve the mystery about halfway into the film, some of the details around it were cleverly concealed and there were plenty of twists that had me consider other possible suspects.\r\n\r\nSome may find the film a bit slow but that is the nature of a good mystery as time is given to developing the characters and their motives which adds to the suspense of the film.\r\n\r\nIn the end, the film is an engaging mystery that recalls the classic movie mysteries of old and it will be very interesting to see if audiences will embrace the film in the same way as they did with “Murder on the Orient Express” and audiences will get more Poirot adventures from Branagh in the near future.\r\n\r\n4 stars out of 5.", "created_at": "2022-02-07T14:05:10.942Z"}, {"movie_id": 505026, "review_id": "62053742e2bca8009f82f8e1", "author_rating": 4.0, "review_text": "_Death on the Nile_ crawls towards a resolution you don’t feel invested in. Poirot’s backstory is interesting and there are some solid performances especially from the female cast, but the film otherwise feels like an unwanted game of Guess Who after you unwillingly chug two bottles of NyQuil and are asked to predict who the killer is after two long hours of tediousness.\r\n\r\n**Full review:** hubpages.com/entertainment/Death-on-the-Nile-2022-Review-A-Drowzy-Whodunit-Loaded-with-Mediocrity", "created_at": "2022-02-10T16:03:14.236Z"}, {"movie_id": 505026, "review_id": "6208069a9408ec00cc6c61f1", "author_rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/death-on-the-nile-spoiler-free-review\r\n\r\n\"Death on the Nile retains the problems of its predecessor, containing an even less mysterious central mystery and even less interesting multiple storylines. Kenneth Branagh is the great savior, offering a distinctive directing style and an iconic performance as Hercule Poirot.\r\n\r\nDespite some good displays and a couple of pleasant arcs, Michael Green's screenplay relies too much on its heavy exposition, not managing to escape the forced, dull, redundant dialogues. The audiovisual environment surrounding the entire film reeks of digital deception, sweating its green screen throughout the runtime.\r\n\r\nA whodunnit is worth more than merely finding the criminal, but the resolution literally being the first option that the first act suggests leaves an inevitable taste of disappointment.\"\r\n\r\nRating: C-", "created_at": "2022-02-12T19:12:26.387Z"}, {"movie_id": 505026, "review_id": "6242011c5a9915004841bea6", "author_rating": 6.0, "review_text": "It's probably best to start by saying that this adaptation of the Agatha Christie novel has virtually nothing at all in common with the 1978 Ustinov/Niven iteration (which I really like). Sir Kenneth Branagh starts off by giving us a little of the somewhat tragic WWI backstory to the famous Belgian detective before we are introduced to the newlywed \"Doyle\" couple Gal Gadot and Armie Hammer, his disgruntled ex girlfriend \"Jackie\" (Emma Mackey - whom I could have sworn was Margot Robbie) and an assembled cast aboard the luxury Nile paddle steamer \"Karnak\" where murder and mayhem ensue. A great deal of care has been taken with this production, and it looks great. That said, though, I found the characterisations pretty sterile; there are stars here but not (Annette Bening notwithstanding) big stars, and we get to know little of the personalities or grudges of the suspects. Tom Bateman reprises his role as \"Book\" from Sir Kenneth's other, equally flawed, \"Poirot\" outing back in 2017, but that stretches coincidence just a bit too much! There is little, if any humour, and though I did initially enjoy the 1930s Blues music it started to intrude a bit as the film progressed. Patrick Doyle's rather bland score reminded me of \"Kingdom of Heaven\" (2005) and though there is a fair degree of location photography, there is an equally fair degree of pretty obvious CGI too. Somehow, Sir Kenneth just isn't \"Poirot\" for me. His performances are always just a little bit too theatrical - he always has to be centre stage. The whole pace of the film really does lack any accumulating sense of menace and though it is certainly better seeing it on a big screen, I was really somewhat underwhelmed.", "created_at": "2022-03-28T18:40:28.765Z"}, {"movie_id": 505026, "review_id": "624a0cbb8c7b0f009a13153b", "author_rating": 5.0, "review_text": "From a technical standpoint it's not bad and does feature a good cast and fine performances, but it's also rather predictable (kind of called the twist early on) and it's fairly slow to the point it I was losing interest (even though it's less than two hours long sans credits). Only glad I watched this for free on HBO Max as this was a one-time viewing for me (as was Branagh's Murder on the Orient Express, which I found only mildly entertaining but also overlong). **2.75/5**", "created_at": "2022-04-03T21:08:11.767Z"}, {"movie_id": 505026, "review_id": "62af79203c4344080c4408e3", "author_rating": 4.0, "review_text": "I honestly did not expect much out of this movie given how Branagh’s Murder on the Orient Express turned out.\r\n\r\nNow, Hercule Poirot together with Sherlock Holmes are my two favourite fictional detectives and I’m obviously having strong opinions about the subject. If you liked the movie then fine but this is my personal opinions so… here we go.\r\n\r\nJust as with Murder on the Orient Express it could have been a decent mystery/crime movie if it had not pretended to be a Hercule Poirot movie but again this was a miserable attempt to make a Americanized version of Hercule Poirot.\r\n\r\nThe movie starts off with black and white scenes from World War I trying to make him out to be some war hero. There was no reason for that and it is not Hercule Poirot.\r\n\r\nOne good thing I can write about the movie is that there are some lovely scenery, especially at the beginning. Unfortunately that is about it as far as the good parts go from my point of view.\r\n\r\nApart from the good scenery the film goes overboard trying to get fancy with the camera. Like the ridiculous revolving scenes on the boat, bizarre perspectives and quite a few too dark and gloomy scenes.\r\n\r\nThe worst part of the movie is that it is totally disrespectful of the Hercule Poirot that Agatha Christie created. Poirot does NOT run after criminals while shots are being fired, Poirot may scream but with dignity, not soap opera like outbursts. He was not the only one having unbecoming outbursts by the way. And do not get me started about how the movie ruined the famous end scene where Poirot traditionally exposes the criminal by having Poirot waving a gun and appearing totally dishevelled. Even the hideously large moustache is just all wrong.\r\n\r\nDeath on the Nile is a British mystery novel by one of the most famous mystery writers ever, not some pulp fiction that you can put your own spin on but Kenneth Branagh does not seem to realize this.", "created_at": "2022-06-19T19:29:36.275Z"}, {"movie_id": 505026, "review_id": "63002ad4bb2602008459ec30", "author_rating": 5.0, "review_text": "**For a movie with death in the title, it takes way too long for the mystery to begin. Bore on the Nile.**\r\n\r\nDeath on the Nile waits almost an hour into the movie before there is an actual death... a murder mystery that is focused much more on the shallow lives of its wealthy aristocrats rather than solving the murder mystery. The mystery is fairly stereotypical and easy to figure out. The film is dreadfully slow, making the 2 hour run time feel more like 3 hours. If you enjoyed Murder on the Orient Express, you would probably enjoy the expanded characterization of Kenneth Branagh's Hercule Poirot amidst the spectacular set pieces and wardrobe of the 1930s. Mix in superstar Gal Gadot and some other up-and-coming talented actors and Death on the Nile rises from absolute bore to tolerable.\r\n\r\n_As a total bonus - Kenneth Branagh's mustache in this movie is a work of art in and of itself! That thing is amazing!_", "created_at": "2022-08-20T00:29:08.432Z"}, {"movie_id": 505026, "review_id": "6309bc35dcb6a30083594a00", "author_rating": 1.0, "review_text": "Death on the Nile has a prologue set in World War I, where a young Hercule Poirot is played by a digitally ‘de-aged’ Kenneth Branagh. Et tu, Kenneth? If you must do this, why not get a younger actor who looks likes Branagh? Or even one who doesn’t look like the Northern Irish writer/director/actor, so long as he looks like an actual human being; it’s safe to say that Branagh looks neither like himself nor like a member of the human race (he actually looks less grotesque after an explosion disfigures one side of his face). Again, this is only if you must do this – but then, you mustn’t do it, especially considering that this prologue exists only, and I kid you not, as an origin story for Poirot’s mustache.\r\n\r\nIn order to catch up with Branagh’s current appearance, the character then ages some 40 years in the space of about two decades, and in the interim it’s the world around him that has received a digital facelift – in particular Egypt, whose entire topography and everything in it, including flora, fauna, bodies of water, architecture, historical landmarks, etc., etc., has been computer-generated, and very crudely at that. They should have called this Death on Denial, because based on the evidence of this movie, the Nile isn’t a river in Egypt – or a river at all, nor Egypt a place that bears any resemblance to any known landscape that can be found on planet Earth.\r\n\r\nAs for the actual plot, who cares? It's impossible to believe in the existence of these characters as real persons because they're all clearly actors standing in front of green screens, and the \"Death\" of the title is rendered meaningless because it takes place in a lifeless world. Even an Agatha Christie murder mystery – nay, especially an Agatha Christie murder mystery demands a plausible backdrop, and in that sense a matte painting, rear projection, miniatures, any number indeed of practical special effects would offer a much more tangible setting for this story – the next best thing, as a matter of fact, to actually shooting on location (which admittedly is not always feasible).", "created_at": "2022-08-27T06:39:49.354Z"}, {"movie_id": 505026, "review_id": "631fa7dd435011007ab5bf34", "author_rating": null, "review_text": "Decidedly more electric than Murder on the Orient Express, but much sloppier. Can’t believe the “enough champagne to fill the nile” clip was unedited from the movie for the trailer, wild stuff.\r\n\r\nHad a good time at the theater 🥂", "created_at": "2022-09-12T21:42:53.163Z"}, {"movie_id": 505026, "review_id": "6201271611386c006a3402f3", "author_rating": null, "review_text": "Originally set to release in December of 2019; the long-delayed cinematic retelling of Agatha Christie’s “Death on the Nile” has finally arrived in cinemas. The last cinematic version of the classic book arrived in 1978 and this time; Director and star Kenneth Branagh beings his version of Master Detective Hercule Poirot to Egypt after a chance encounter with his friend Bouc (Tom Bateman) while on vacation; Poirot attends the wedding of wealthy socialite Linette Ridgeway (Gal Gadot) and notices that she has married a man named Simon Doyle (Armie Hammer).\r\n\r\nThe wedding is a bit of a shock to many as just six weeks prior Doyle was engaged to Jacqueline de Bellefort (Emma Mackey), and Poirot observed the two of them in a London club and how Ridgeway was introduced to Simon by her friend Jacqueline.\r\n\r\nThe wedding reception is disrupted by the arrival of Jacqueline and Linette and Simon confides in Poirot that she has been following them around the world and asks the Detective to encourage her to leave them alone so they can get on with their life.\r\n\r\nJacqueline is highly disturbed and pleads her love for Simon and shows a gun which leads Poirot to encourage the newlyweds to abandon their overseas plans and go home. Simon and Linette press on and decide to take their wedding party on a cruise of the Nile in an attempt to get away from Jacqueline.\r\n\r\nThe plan seems to be working well until Jacqueline shows up as a ticketed passenger at a stop along the way. When a near-fatal accident occurs followed by a murder; Poirot must investigate the guests to find the killer. Naturally, there is plenty of motivation to go around, and as the deaths mount; Poirot must use his genius to find the killer.\r\n\r\nThe movie takes its time getting started but the CGI-enhanced scenery and the strong cast are very compelling and set the pieces in place very well. While I was able to solve the mystery about halfway into the film, some of the details around it were cleverly concealed and there were plenty of twists that had me consider other possible suspects.\r\n\r\nSome may find the film a bit slow but that is the nature of a good mystery as time is given to developing the characters and their motives which adds to the suspense of the film.\r\n\r\nIn the end, the film is an engaging mystery that recalls the classic movie mysteries of old and it will be very interesting to see if audiences will embrace the film in the same way as they did with “Murder on the Orient Express” and audiences will get more Poirot adventures from Branagh in the near future.\r\n\r\n4 stars out of 5.", "created_at": "2022-02-07T14:05:10.942Z"}, {"movie_id": 505026, "review_id": "62053742e2bca8009f82f8e1", "author_rating": 4.0, "review_text": "_Death on the Nile_ crawls towards a resolution you don’t feel invested in. Poirot’s backstory is interesting and there are some solid performances especially from the female cast, but the film otherwise feels like an unwanted game of Guess Who after you unwillingly chug two bottles of NyQuil and are asked to predict who the killer is after two long hours of tediousness.\r\n\r\n**Full review:** hubpages.com/entertainment/Death-on-the-Nile-2022-Review-A-Drowzy-Whodunit-Loaded-with-Mediocrity", "created_at": "2022-02-10T16:03:14.236Z"}, {"movie_id": 505026, "review_id": "6208069a9408ec00cc6c61f1", "author_rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/death-on-the-nile-spoiler-free-review\r\n\r\n\"Death on the Nile retains the problems of its predecessor, containing an even less mysterious central mystery and even less interesting multiple storylines. Kenneth Branagh is the great savior, offering a distinctive directing style and an iconic performance as Hercule Poirot.\r\n\r\nDespite some good displays and a couple of pleasant arcs, Michael Green's screenplay relies too much on its heavy exposition, not managing to escape the forced, dull, redundant dialogues. The audiovisual environment surrounding the entire film reeks of digital deception, sweating its green screen throughout the runtime.\r\n\r\nA whodunnit is worth more than merely finding the criminal, but the resolution literally being the first option that the first act suggests leaves an inevitable taste of disappointment.\"\r\n\r\nRating: C-", "created_at": "2022-02-12T19:12:26.387Z"}, {"movie_id": 505026, "review_id": "6242011c5a9915004841bea6", "author_rating": 6.0, "review_text": "It's probably best to start by saying that this adaptation of the Agatha Christie novel has virtually nothing at all in common with the 1978 Ustinov/Niven iteration (which I really like). Sir Kenneth Branagh starts off by giving us a little of the somewhat tragic WWI backstory to the famous Belgian detective before we are introduced to the newlywed \"Doyle\" couple Gal Gadot and Armie Hammer, his disgruntled ex girlfriend \"Jackie\" (Emma Mackey - whom I could have sworn was Margot Robbie) and an assembled cast aboard the luxury Nile paddle steamer \"Karnak\" where murder and mayhem ensue. A great deal of care has been taken with this production, and it looks great. That said, though, I found the characterisations pretty sterile; there are stars here but not (Annette Bening notwithstanding) big stars, and we get to know little of the personalities or grudges of the suspects. Tom Bateman reprises his role as \"Book\" from Sir Kenneth's other, equally flawed, \"Poirot\" outing back in 2017, but that stretches coincidence just a bit too much! There is little, if any humour, and though I did initially enjoy the 1930s Blues music it started to intrude a bit as the film progressed. Patrick Doyle's rather bland score reminded me of \"Kingdom of Heaven\" (2005) and though there is a fair degree of location photography, there is an equally fair degree of pretty obvious CGI too. Somehow, Sir Kenneth just isn't \"Poirot\" for me. His performances are always just a little bit too theatrical - he always has to be centre stage. The whole pace of the film really does lack any accumulating sense of menace and though it is certainly better seeing it on a big screen, I was really somewhat underwhelmed.", "created_at": "2022-03-28T18:40:28.765Z"}, {"movie_id": 505026, "review_id": "624a0cbb8c7b0f009a13153b", "author_rating": 5.0, "review_text": "From a technical standpoint it's not bad and does feature a good cast and fine performances, but it's also rather predictable (kind of called the twist early on) and it's fairly slow to the point it I was losing interest (even though it's less than two hours long sans credits). Only glad I watched this for free on HBO Max as this was a one-time viewing for me (as was Branagh's Murder on the Orient Express, which I found only mildly entertaining but also overlong). **2.75/5**", "created_at": "2022-04-03T21:08:11.767Z"}, {"movie_id": 505026, "review_id": "62af79203c4344080c4408e3", "author_rating": 4.0, "review_text": "I honestly did not expect much out of this movie given how Branagh’s Murder on the Orient Express turned out.\r\n\r\nNow, Hercule Poirot together with Sherlock Holmes are my two favourite fictional detectives and I’m obviously having strong opinions about the subject. If you liked the movie then fine but this is my personal opinions so… here we go.\r\n\r\nJust as with Murder on the Orient Express it could have been a decent mystery/crime movie if it had not pretended to be a Hercule Poirot movie but again this was a miserable attempt to make a Americanized version of Hercule Poirot.\r\n\r\nThe movie starts off with black and white scenes from World War I trying to make him out to be some war hero. There was no reason for that and it is not Hercule Poirot.\r\n\r\nOne good thing I can write about the movie is that there are some lovely scenery, especially at the beginning. Unfortunately that is about it as far as the good parts go from my point of view.\r\n\r\nApart from the good scenery the film goes overboard trying to get fancy with the camera. Like the ridiculous revolving scenes on the boat, bizarre perspectives and quite a few too dark and gloomy scenes.\r\n\r\nThe worst part of the movie is that it is totally disrespectful of the Hercule Poirot that Agatha Christie created. Poirot does NOT run after criminals while shots are being fired, Poirot may scream but with dignity, not soap opera like outbursts. He was not the only one having unbecoming outbursts by the way. And do not get me started about how the movie ruined the famous end scene where Poirot traditionally exposes the criminal by having Poirot waving a gun and appearing totally dishevelled. Even the hideously large moustache is just all wrong.\r\n\r\nDeath on the Nile is a British mystery novel by one of the most famous mystery writers ever, not some pulp fiction that you can put your own spin on but Kenneth Branagh does not seem to realize this.", "created_at": "2022-06-19T19:29:36.275Z"}, {"movie_id": 505026, "review_id": "63002ad4bb2602008459ec30", "author_rating": 5.0, "review_text": "**For a movie with death in the title, it takes way too long for the mystery to begin. Bore on the Nile.**\r\n\r\nDeath on the Nile waits almost an hour into the movie before there is an actual death... a murder mystery that is focused much more on the shallow lives of its wealthy aristocrats rather than solving the murder mystery. The mystery is fairly stereotypical and easy to figure out. The film is dreadfully slow, making the 2 hour run time feel more like 3 hours. If you enjoyed Murder on the Orient Express, you would probably enjoy the expanded characterization of Kenneth Branagh's Hercule Poirot amidst the spectacular set pieces and wardrobe of the 1930s. Mix in superstar Gal Gadot and some other up-and-coming talented actors and Death on the Nile rises from absolute bore to tolerable.\r\n\r\n_As a total bonus - Kenneth Branagh's mustache in this movie is a work of art in and of itself! That thing is amazing!_", "created_at": "2022-08-20T00:29:08.432Z"}, {"movie_id": 505026, "review_id": "6309bc35dcb6a30083594a00", "author_rating": 1.0, "review_text": "Death on the Nile has a prologue set in World War I, where a young Hercule Poirot is played by a digitally ‘de-aged’ Kenneth Branagh. Et tu, Kenneth? If you must do this, why not get a younger actor who looks likes Branagh? Or even one who doesn’t look like the Northern Irish writer/director/actor, so long as he looks like an actual human being; it’s safe to say that Branagh looks neither like himself nor like a member of the human race (he actually looks less grotesque after an explosion disfigures one side of his face). Again, this is only if you must do this – but then, you mustn’t do it, especially considering that this prologue exists only, and I kid you not, as an origin story for Poirot’s mustache.\r\n\r\nIn order to catch up with Branagh’s current appearance, the character then ages some 40 years in the space of about two decades, and in the interim it’s the world around him that has received a digital facelift – in particular Egypt, whose entire topography and everything in it, including flora, fauna, bodies of water, architecture, historical landmarks, etc., etc., has been computer-generated, and very crudely at that. They should have called this Death on Denial, because based on the evidence of this movie, the Nile isn’t a river in Egypt – or a river at all, nor Egypt a place that bears any resemblance to any known landscape that can be found on planet Earth.\r\n\r\nAs for the actual plot, who cares? It's impossible to believe in the existence of these characters as real persons because they're all clearly actors standing in front of green screens, and the \"Death\" of the title is rendered meaningless because it takes place in a lifeless world. Even an Agatha Christie murder mystery – nay, especially an Agatha Christie murder mystery demands a plausible backdrop, and in that sense a matte painting, rear projection, miniatures, any number indeed of practical special effects would offer a much more tangible setting for this story – the next best thing, as a matter of fact, to actually shooting on location (which admittedly is not always feasible).", "created_at": "2022-08-27T06:39:49.354Z"}, {"movie_id": 505026, "review_id": "631fa7dd435011007ab5bf34", "author_rating": null, "review_text": "Decidedly more electric than Murder on the Orient Express, but much sloppier. Can’t believe the “enough champagne to fill the nile” clip was unedited from the movie for the trailer, wild stuff.\r\n\r\nHad a good time at the theater 🥂", "created_at": "2022-09-12T21:42:53.163Z"}, {"movie_id": 505026, "review_id": "6201271611386c006a3402f3", "author_rating": null, "review_text": "Originally set to release in December of 2019; the long-delayed cinematic retelling of Agatha Christie’s “Death on the Nile” has finally arrived in cinemas. The last cinematic version of the classic book arrived in 1978 and this time; Director and star Kenneth Branagh beings his version of Master Detective Hercule Poirot to Egypt after a chance encounter with his friend Bouc (Tom Bateman) while on vacation; Poirot attends the wedding of wealthy socialite Linette Ridgeway (Gal Gadot) and notices that she has married a man named Simon Doyle (Armie Hammer).\r\n\r\nThe wedding is a bit of a shock to many as just six weeks prior Doyle was engaged to Jacqueline de Bellefort (Emma Mackey), and Poirot observed the two of them in a London club and how Ridgeway was introduced to Simon by her friend Jacqueline.\r\n\r\nThe wedding reception is disrupted by the arrival of Jacqueline and Linette and Simon confides in Poirot that she has been following them around the world and asks the Detective to encourage her to leave them alone so they can get on with their life.\r\n\r\nJacqueline is highly disturbed and pleads her love for Simon and shows a gun which leads Poirot to encourage the newlyweds to abandon their overseas plans and go home. Simon and Linette press on and decide to take their wedding party on a cruise of the Nile in an attempt to get away from Jacqueline.\r\n\r\nThe plan seems to be working well until Jacqueline shows up as a ticketed passenger at a stop along the way. When a near-fatal accident occurs followed by a murder; Poirot must investigate the guests to find the killer. Naturally, there is plenty of motivation to go around, and as the deaths mount; Poirot must use his genius to find the killer.\r\n\r\nThe movie takes its time getting started but the CGI-enhanced scenery and the strong cast are very compelling and set the pieces in place very well. While I was able to solve the mystery about halfway into the film, some of the details around it were cleverly concealed and there were plenty of twists that had me consider other possible suspects.\r\n\r\nSome may find the film a bit slow but that is the nature of a good mystery as time is given to developing the characters and their motives which adds to the suspense of the film.\r\n\r\nIn the end, the film is an engaging mystery that recalls the classic movie mysteries of old and it will be very interesting to see if audiences will embrace the film in the same way as they did with “Murder on the Orient Express” and audiences will get more Poirot adventures from Branagh in the near future.\r\n\r\n4 stars out of 5.", "created_at": "2022-02-07T14:05:10.942Z"}, {"movie_id": 505026, "review_id": "62053742e2bca8009f82f8e1", "author_rating": 4.0, "review_text": "_Death on the Nile_ crawls towards a resolution you don’t feel invested in. Poirot’s backstory is interesting and there are some solid performances especially from the female cast, but the film otherwise feels like an unwanted game of Guess Who after you unwillingly chug two bottles of NyQuil and are asked to predict who the killer is after two long hours of tediousness.\r\n\r\n**Full review:** hubpages.com/entertainment/Death-on-the-Nile-2022-Review-A-Drowzy-Whodunit-Loaded-with-Mediocrity", "created_at": "2022-02-10T16:03:14.236Z"}, {"movie_id": 505026, "review_id": "6208069a9408ec00cc6c61f1", "author_rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/death-on-the-nile-spoiler-free-review\r\n\r\n\"Death on the Nile retains the problems of its predecessor, containing an even less mysterious central mystery and even less interesting multiple storylines. Kenneth Branagh is the great savior, offering a distinctive directing style and an iconic performance as Hercule Poirot.\r\n\r\nDespite some good displays and a couple of pleasant arcs, Michael Green's screenplay relies too much on its heavy exposition, not managing to escape the forced, dull, redundant dialogues. The audiovisual environment surrounding the entire film reeks of digital deception, sweating its green screen throughout the runtime.\r\n\r\nA whodunnit is worth more than merely finding the criminal, but the resolution literally being the first option that the first act suggests leaves an inevitable taste of disappointment.\"\r\n\r\nRating: C-", "created_at": "2022-02-12T19:12:26.387Z"}, {"movie_id": 505026, "review_id": "6242011c5a9915004841bea6", "author_rating": 6.0, "review_text": "It's probably best to start by saying that this adaptation of the Agatha Christie novel has virtually nothing at all in common with the 1978 Ustinov/Niven iteration (which I really like). Sir Kenneth Branagh starts off by giving us a little of the somewhat tragic WWI backstory to the famous Belgian detective before we are introduced to the newlywed \"Doyle\" couple Gal Gadot and Armie Hammer, his disgruntled ex girlfriend \"Jackie\" (Emma Mackey - whom I could have sworn was Margot Robbie) and an assembled cast aboard the luxury Nile paddle steamer \"Karnak\" where murder and mayhem ensue. A great deal of care has been taken with this production, and it looks great. That said, though, I found the characterisations pretty sterile; there are stars here but not (Annette Bening notwithstanding) big stars, and we get to know little of the personalities or grudges of the suspects. Tom Bateman reprises his role as \"Book\" from Sir Kenneth's other, equally flawed, \"Poirot\" outing back in 2017, but that stretches coincidence just a bit too much! There is little, if any humour, and though I did initially enjoy the 1930s Blues music it started to intrude a bit as the film progressed. Patrick Doyle's rather bland score reminded me of \"Kingdom of Heaven\" (2005) and though there is a fair degree of location photography, there is an equally fair degree of pretty obvious CGI too. Somehow, Sir Kenneth just isn't \"Poirot\" for me. His performances are always just a little bit too theatrical - he always has to be centre stage. The whole pace of the film really does lack any accumulating sense of menace and though it is certainly better seeing it on a big screen, I was really somewhat underwhelmed.", "created_at": "2022-03-28T18:40:28.765Z"}, {"movie_id": 505026, "review_id": "624a0cbb8c7b0f009a13153b", "author_rating": 5.0, "review_text": "From a technical standpoint it's not bad and does feature a good cast and fine performances, but it's also rather predictable (kind of called the twist early on) and it's fairly slow to the point it I was losing interest (even though it's less than two hours long sans credits). Only glad I watched this for free on HBO Max as this was a one-time viewing for me (as was Branagh's Murder on the Orient Express, which I found only mildly entertaining but also overlong). **2.75/5**", "created_at": "2022-04-03T21:08:11.767Z"}, {"movie_id": 505026, "review_id": "62af79203c4344080c4408e3", "author_rating": 4.0, "review_text": "I honestly did not expect much out of this movie given how Branagh’s Murder on the Orient Express turned out.\r\n\r\nNow, Hercule Poirot together with Sherlock Holmes are my two favourite fictional detectives and I’m obviously having strong opinions about the subject. If you liked the movie then fine but this is my personal opinions so… here we go.\r\n\r\nJust as with Murder on the Orient Express it could have been a decent mystery/crime movie if it had not pretended to be a Hercule Poirot movie but again this was a miserable attempt to make a Americanized version of Hercule Poirot.\r\n\r\nThe movie starts off with black and white scenes from World War I trying to make him out to be some war hero. There was no reason for that and it is not Hercule Poirot.\r\n\r\nOne good thing I can write about the movie is that there are some lovely scenery, especially at the beginning. Unfortunately that is about it as far as the good parts go from my point of view.\r\n\r\nApart from the good scenery the film goes overboard trying to get fancy with the camera. Like the ridiculous revolving scenes on the boat, bizarre perspectives and quite a few too dark and gloomy scenes.\r\n\r\nThe worst part of the movie is that it is totally disrespectful of the Hercule Poirot that Agatha Christie created. Poirot does NOT run after criminals while shots are being fired, Poirot may scream but with dignity, not soap opera like outbursts. He was not the only one having unbecoming outbursts by the way. And do not get me started about how the movie ruined the famous end scene where Poirot traditionally exposes the criminal by having Poirot waving a gun and appearing totally dishevelled. Even the hideously large moustache is just all wrong.\r\n\r\nDeath on the Nile is a British mystery novel by one of the most famous mystery writers ever, not some pulp fiction that you can put your own spin on but Kenneth Branagh does not seem to realize this.", "created_at": "2022-06-19T19:29:36.275Z"}, {"movie_id": 505026, "review_id": "63002ad4bb2602008459ec30", "author_rating": 5.0, "review_text": "**For a movie with death in the title, it takes way too long for the mystery to begin. Bore on the Nile.**\r\n\r\nDeath on the Nile waits almost an hour into the movie before there is an actual death... a murder mystery that is focused much more on the shallow lives of its wealthy aristocrats rather than solving the murder mystery. The mystery is fairly stereotypical and easy to figure out. The film is dreadfully slow, making the 2 hour run time feel more like 3 hours. If you enjoyed Murder on the Orient Express, you would probably enjoy the expanded characterization of Kenneth Branagh's Hercule Poirot amidst the spectacular set pieces and wardrobe of the 1930s. Mix in superstar Gal Gadot and some other up-and-coming talented actors and Death on the Nile rises from absolute bore to tolerable.\r\n\r\n_As a total bonus - Kenneth Branagh's mustache in this movie is a work of art in and of itself! That thing is amazing!_", "created_at": "2022-08-20T00:29:08.432Z"}, {"movie_id": 505026, "review_id": "6309bc35dcb6a30083594a00", "author_rating": 1.0, "review_text": "Death on the Nile has a prologue set in World War I, where a young Hercule Poirot is played by a digitally ‘de-aged’ Kenneth Branagh. Et tu, Kenneth? If you must do this, why not get a younger actor who looks likes Branagh? Or even one who doesn’t look like the Northern Irish writer/director/actor, so long as he looks like an actual human being; it’s safe to say that Branagh looks neither like himself nor like a member of the human race (he actually looks less grotesque after an explosion disfigures one side of his face). Again, this is only if you must do this – but then, you mustn’t do it, especially considering that this prologue exists only, and I kid you not, as an origin story for Poirot’s mustache.\r\n\r\nIn order to catch up with Branagh’s current appearance, the character then ages some 40 years in the space of about two decades, and in the interim it’s the world around him that has received a digital facelift – in particular Egypt, whose entire topography and everything in it, including flora, fauna, bodies of water, architecture, historical landmarks, etc., etc., has been computer-generated, and very crudely at that. They should have called this Death on Denial, because based on the evidence of this movie, the Nile isn’t a river in Egypt – or a river at all, nor Egypt a place that bears any resemblance to any known landscape that can be found on planet Earth.\r\n\r\nAs for the actual plot, who cares? It's impossible to believe in the existence of these characters as real persons because they're all clearly actors standing in front of green screens, and the \"Death\" of the title is rendered meaningless because it takes place in a lifeless world. Even an Agatha Christie murder mystery – nay, especially an Agatha Christie murder mystery demands a plausible backdrop, and in that sense a matte painting, rear projection, miniatures, any number indeed of practical special effects would offer a much more tangible setting for this story – the next best thing, as a matter of fact, to actually shooting on location (which admittedly is not always feasible).", "created_at": "2022-08-27T06:39:49.354Z"}, {"movie_id": 505026, "review_id": "631fa7dd435011007ab5bf34", "author_rating": null, "review_text": "Decidedly more electric than Murder on the Orient Express, but much sloppier. Can’t believe the “enough champagne to fill the nile” clip was unedited from the movie for the trailer, wild stuff.\r\n\r\nHad a good time at the theater 🥂", "created_at": "2022-09-12T21:42:53.163Z"}]