[{"movie_id": 619778, "review_id": "6140d38c94d8a80067dd0441", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/malignant-spoiler-free-review\r\n\r\n\"Malignant is yet another excellent origin movie for a new franchise created by one of the most successful horror filmmakers of the century, James Wan. The talented director picks up a thematically rich, mysteriously intriguing narrative written by the feature film debutant Akela Cooper, and lets himself get inspired by the giallo genre. Boasting a fascinating protagonist brilliantly interpreted by Annabelle Wallis, the unexpected yet exposition-heavy revelations of the brave third act definitely improve upon a rather generic, unexciting first half. While the impressive action sequences steal the technical spotlight, Joseph Bishara's score holds divisive creative choices that might not please every viewer. For horror fans, I couldn't recommend it more.\"\r\n\r\nRating: B+", "created_at": "2021-09-14T16:53:32.696Z"}, {"movie_id": 619778, "review_id": "614676e8048638006188a655", "author_rating": 3.0, "review_text": "This is one of the dumbest films I have seen in a long time, start to finish it is a dumpster fire, the \"twist\" is projected so hard so early, and so often, then over explained to the point of the death of any subtlety, and it's not original or clever in it's execution. \r\n\r\nI don't understand how people seem to be liking this film I feel like I'm taking crazy pills\r\n\r\nI rarely say this, but I hated this dumb film", "created_at": "2021-09-18T23:31:52.043Z"}, {"movie_id": 619778, "review_id": "61548c0ae18b97008c97c75d", "author_rating": 3.0, "review_text": "Classic case of the trailer being the best part. I'll hand it to them though, I was completely fooled about what this movie was going to be. When they showed Gabriel behind the plastic sheet in the beginning ... I knew it was not what I signed on for.\r\n\r\nAs my mom would say: It insults my intelligence. ", "created_at": "2021-09-29T15:53:46.114Z"}, {"movie_id": 619778, "review_id": "618aa3dc160e7300935838fd", "author_rating": 9.0, "review_text": "This movie has started very strong  the ending was a little bit silly but it was  fun i like this movie it's better than any of the other horror movies that come out in 2020 and 2021 ok  the conjuring 3 was  the best this movie is on my second place", "created_at": "2021-11-09T16:37:48.294Z"}, {"movie_id": 619778, "review_id": "61b29201071650005f52e81b", "author_rating": 6.0, "review_text": "I'll give it this much, it's a weird movie. Can't say it's a good weird nor a bad one, just plain weird. Now, I do appreciate that James Wan returned to his horror roots in between the wait for Aquaman 2 goes into production.\r\n\r\nAs for this movie, there was parts that felt off, such as the acting which I don't think was all that impressive. Wan's direction wasn't particularly noteworthy either outside of the finale which had impressive moments. As a whole, the least I can say it's not pedestrian or forgettable, but on the other hand I really don't have much desire to revisit. **2.75/5**", "created_at": "2021-12-09T23:32:17.531Z"}, {"movie_id": 619778, "review_id": "62bdf9346840cc0063c04017", "author_rating": 6.0, "review_text": "Malignant is a ride, one that changes directions in multiple different ways that I did not expect. This film is an ambitious genre bend that takes tropes from slashers (loved the Friday the 13th/Halloween cords used in the beginning of the film), the classic James Wan ghost films, action, and strangely enough some elements from Scream in the comedy side. With some many different themes it was hard to really understand what this movie's identity was. The film had a serious tone throughout but had some awkward lines that felt right out of a Scream film. With those two different tones it felt as if the lines were funny bad writing rather than artistic vision.\r\n\r\nThe kills were bloody as all hell, which is par for the course with the slasher genre and a positive for this film. The reversed humanoid figure visuals for the killer were very incredibly unsettling.\r\n\r\nI really enjoyed the plot for the most part, even though I felt the beginning and the end were much stronger than the middle lull. The twist was great, and I did not see it coming till it was almost too late. When this happens the movie really finds it grove and kept me locked in for the remaining twenty minutes.\r\n\r\nOverall, Malignant is decent movie, maybe a little too ambitious for its own good.\r\n\r\n**Verdict:** _Decent_", "created_at": "2022-06-30T19:27:48.344Z"}, {"movie_id": 619778, "review_id": "651da01c07216600c568f3d0", "author_rating": 7.0, "review_text": "<b>70/100</b>\r\n\r\nIn <i>Malignant</i>, director James Wan crafts a visually-impressive horror experience in which camera work, production design, and aesthetics do most of the heavy lifting. Annabelle Wallis and her Backpack do their best with a garbage script and subpar supporting cast that appears to be there to punch the ticket. If you can get over the slow opening 30 minutes, <i>Malignant</i>'s innovative ideas distinguish it from the usual horror movie clichés, giving surprising turns that keep you intrigued until the end.", "created_at": "2023-10-04T17:25:48.079Z"}]