[{"movie_id": 12445, "review_id": "5d72222477c01f621d5b89e0", "author_rating": 8.0, "review_text": "It is the quality of one's convictions that determines success, not the number of followers. \r\n\r\nSo here it is, the 8th and final instalment of a film franchise that has lasted 10 years and runs at just under 20 hours in total. Following straight on from the frustratingly incomplete scene setter that was Deathly Hallows Part 1, we continue to track Harry, Hermione and Ron as they search for the remaining Horcruxes that will render the evil Lord Voldermort as a mere mortal. This narrative thread is run concurrently with the Voldermort movements, where he now has in his possession The Elder Wand (the wand to rule them all) and has gathered a vast army to descend upon Hogwarts and achieve his ultimate goal of killing Harry. Meanwhile vital character story arcs are filled in and secrets will out...\r\n\r\nDavid Yates directs and Steve Kloves adapts to the screen, both of whom were perfect choices given their considerable input to the series. Smartly the pic has been kept to a 2 hour and 10 minute run time, and thankfully it flows nicely and the pace never stalls. Being one of those who has never read the books I can't say what has been left out or if anything has been tampered with for dramatic licence? What I know for sure is that the emotional investment garnered from being with this story for so long, to be part of these characters lives, watching them grow, ensures that this closure piece pounds the senses. Sitting down to watch it you realise that we are going to lose people we care for, and Hogwarts, the wonderful place we fist glimpsed across the night time water, is going to be attacked and reduced to a battle scarred place of war.\r\n\r\nAs the effects work dazzles and the one time child actors come shining through as mature actors who have casted off previous wooden traits, the story filling strands show just what wonderful work Rowling achieved on the page. Some of the characters never stood a chance in life, some carried deep emotional scars, and others  held secrets so crucial to the whole Potter universe. For a series of such fantastical genre sparkle, the Harry Potter world eventually reveals itself to be a deep and fortified humanist drama, and engaging it most certainly is. That this is achieved as battlefield carnage is raised, with wand wars booming up on the screen, it means credit is due to all involved the making of such a cherished and intensely followed Octalogy.\r\n\r\nIs it the earth shattering finale one hoped for? Well not quite. Story wise for sure that is the case, but with the whole story driving towards the final battle between Harry and Voldermort, it's disappointing to find it's rather brief and in truth anti climatic. Harry the boy now burgeoning into a man versus the snake faced despot surely should have been a crowning glory, but sadly not so. To compound this irritating disappointment, we then get the epilogue that is bogged down by aging make-up design that is almost laughable. But these are just annoyances, not film killers, for this has been a magical ride for 10 years. Fans will feel a gap in the heart now it's over, maybe even shed a Snape like tear as well? Yet ultimately it has been a triumph and the rewatchable factor for the whole series will always remain high. 8/10", "created_at": "2019-09-06T09:08:52.317Z"}, {"movie_id": 12445, "review_id": "5d74d60fc6006d0012485dbb", "author_rating": 8.0, "review_text": "It is the quality of one's convictions that determines success, not the number of followers. \r\n\r\nSo here it is, the 8th and final instalment of a film franchise that has lasted 10 years and runs at just under 20 hours in total. Following straight on from the frustratingly incomplete scene setter that was Deathly Hallows Part 1, we continue to track Harry, Hermione and Ron as they search for the remaining Horcruxes that will render the evil Lord Voldermort as a mere mortal. This narrative thread is run concurrently with the Voldermort movements, where he now has in his possession The Elder Wand (the wand to rule them all) and has gathered a vast army to descend upon Hogwarts and achieve his ultimate goal of killing Harry. Meanwhile vital character story arcs are filled in and secrets will out...\r\n\r\nDavid Yates directs and Steve Kloves adapts to the screen, both of whom were perfect choices given their considerable input to the series. Smartly the pic has been kept to a 2 hour and 10 minute run time, and thankfully it flows nicely and the pace never stalls. Being one of those who has never read the books I can't say what has been left out or if anything has been tampered with for dramatic licence? What I know for sure is that the emotional investment garnered from being with this story for so long, to be part of these characters lives, watching them grow, ensures that this closure piece pounds the senses. Sitting down to watch it you realise that we are going to lose people we care for, and Hogwarts, the wonderful place we fist glimpsed across the night time water, is going to be attacked and reduced to a battle scarred place of war.\r\n\r\nAs the effects work dazzles and the one time child actors come shining through as mature actors who have casted off previous wooden traits, the story filling strands show just what wonderful work Rowling achieved on the page. Some of the characters never stood a chance in life, some carried deep emotional scars, and others held secrets so crucial to the whole Potter universe. For a series of such fantastical genre sparkle, the Harry Potter world eventually reveals itself to be a deep and fortified humanist drama, and engaging it most certainly is. That this is achieved as battlefield carnage is raised, with wand wars booming up on the screen, it means credit is due to all involved in the making of such a cherished and intensely followed Octalogy.\r\n\r\nIs it the earth shattering finale one hoped for? Well not quite. Story wise for sure that is the case, but with the whole story driving towards the final battle between Harry and Voldermort, it's disappointing to find it's rather brief and in truth anti climatic. Harry the boy now burgeoning into a man versus the snake faced despot surely should have been a crowning glory, but sadly not so. To compound this irritating disappointment, we then get the epilogue that is bogged down by aging make-up design that is almost laughable. But these are just annoyances, not film killers, for this has been a magical ride for 10 years. Fans will feel a gap in the heart now it's over, maybe even shed a Snape like tear as well? Yet ultimately it has been a triumph and the rewatchable factor for the whole series will always remain high. 8/10", "created_at": "2019-09-08T10:21:03.053Z"}]