[{"movie_id": 401469, "review_id": "5b9015ddc3a368344c000e59", "author_rating": null, "review_text": "Director Steve McQueen (12 Years a Slave) and Gone Girl author Gillian Flynn co-wrote the screenplay for his crazy-intense looking crime thriller starring queen of all queens, Viola Davis. Those three names are honestly all it would take to lure us to a theater, but it actually gets better: the film, based on Lynda La Plante’s novel of the same name, follows four women whose duplicitous husbands’ deaths lead them down a dangerous path.", "created_at": "2018-09-05T17:43:57.399Z"}, {"movie_id": 401469, "review_id": "5b901699c3a3683453000d05", "author_rating": null, "review_text": "Director Steve McQueen (12 Years a Slave) and Gone Girl author Gillian Flynn co-wrote the screenplay for his crazy-intense looking crime thriller starring queen of all queens, Viola Davis. Those three names are honestly all it would take to lure us to a theater, but it actually gets better: the film, based on Lynda La Plante’s novel of the same name, follows four women whose duplicitous husbands’ deaths lead them down a dangerous path.\r\n\r\nWidows co-stars everyone, basically, including Daniel Kaluuya, Michelle Rodriguez, Jacki Weaver, Colin Farrell, and Liam Neeson. Think: Good Girls meets Ocean’s 11, but the comedic elements are replaced by Davis staring soulfully into the (incredibly bleak) distance.", "created_at": "2018-09-05T17:47:05.393Z"}, {"movie_id": 401469, "review_id": "5bf71ee29251415ccc0d1632", "author_rating": 6.0, "review_text": "This film contains two movies, and I enjoyed one of them:\r\n\r\nWidows is the story of a trio of...well, widows, who hatch a scheme to pull off a heist. The reason why the widows choose to pull off this heist in the first place is a threat by gangster-turned-political-hopeful Jamal Manning (played by Brian Tyree Henry). It was his money that the deceased husbands of the women were trying to steal before dying in an explosion set off by a hail of police bullets. The money burned up in the flames, and he wants to be repaid. Veronica Rawlings (played by Viola Davis) comes into possession of the plans for a future robbery that her husband Harry (played by Liam Neeson) was planning, and with no other options she and the other women decide to use the plans to commit the robbery themselves in order to pay off the debt (with plenty of money left over).\r\n\r\nThe cast does a commendable job, with particularly good performances put forth by Viola Davis and Elizabeth Debicki as two of the titular widows, Cynthia Erivo as the babysitter for a third widow (played by Michelle Rodriguez) who gets brought into the scheme, and Get Out's Daniel Kaluuya as a cold-blooded henchman who doesn't need to walk around screaming and shouting in order to be terrifying. Also worth a mention is Robert Duvall, who may not be in the movie a whole lot but is memorable nonetheless. The film is shot well by cinematographer Sean Bobbitt, with one standout scene being the short drive taken by Colin Farrell's Chicago Machine political candidate from an area of blight to the nice, quiet street that he lives on at the edge of the ward where he hopes to be elected as alderman over his opponent (Manning). The camera watches as rundown inner-city buildings give way to nice houses that wouldn't seem out of place in a tidy little suburb.\r\n\r\nFor a while it is interesting to watch as the women, who were not involved in their respective husbands' lives of crime, try to ready themselves for the heist. Midway through the film, however, there's a surprise reveal. I said in the title of this review that this film contained two movies, one that I liked I liked. The movie that I liked ended with this \"twist\", and this is where the movie that I didn't like began. Not only is the twist totally unnecessary, but the film just seems to go downhill from there. The women, whose robbing skills seemed understandably shoddy up to this point, suddenly seem to work together like a well-oiled machine. There are more twists thrown into the mix (such as the identity of the person they will be stealing from). The fate of the Rawlings' son, hinted at earlier in the movie. is revealed in a poorly executed scene. The climax of the film feels like a second-rate action flick, and the playing-out of the big twist revealed earlier in the film feels contrived. Then the film ends in a, \"Really, that's how they're going to end this?\" way.\r\n\r\nI don't hate this film (faint praise, I know), but I feel that there was so much wasted opportunity. If only they had kept making the movie from the first half of this film I could have given it a higher rating, but as it stands I give it a 6 out of 10.", "created_at": "2018-11-22T21:25:54.222Z"}, {"movie_id": 401469, "review_id": "5c56a63c92514116fc57b00f", "author_rating": 6.0, "review_text": "Arguably longer than it had to be, particualrly when a lot of side-stories had little context and zero payoff. But there is not a **single** member of this cast who disappoints. Obviously heist movies are not a new thing, but there has never been a heist movie like _Widows_ before.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-02-03T08:28:44.475Z"}, {"movie_id": 401469, "review_id": "5d12a3bbc3a368128121698b", "author_rating": 6.0, "review_text": "**_Looks amazing, but tries to cover too many issues, and the plot is laughable_**\r\n\r\n> **Reggie Ugwu**: _What fascinates about seeing women in historically masculine roles? Do you see something qualitatively different about the way women and men conduct themselves?_\r\n> \r\n> **Viola Davis**: _All we want from women is for them to be pretty, and for them to be kind. And it's those shallow qualities associated with womanhood that we see on screen. So we always feel less than. We always feel like the predator's prey. We always feel that boot of male influence and power. That's what #MeToo and Time__'s Up is all about. This movie is a realistic journey into women gaining ownership of their lives. And not at the expense of who they are. The feminine energy and the vulnerability are still there. But I think it's a fantasy in every woman to do something bold and brash and not nice, to bust out of themselves and social norms to get at some level of authenticity. I think that's what attracts people. I know that's what attracts me._\r\n> \r\n> **Ugwu**: _The movie is coming out at a time when, from entertainment to politics, women are indeed being bold - demanding change and giving voice to their rage._\r\n> \r\n> **Steve McQueen**: _I'm grateful. But it's hugely bittersweet. I based this film on a TV show I saw 35 years ago and nothing's changed. Absolutely nothing's changed. But the fact that, as an object, this film can be useful - I'm very grateful for that._\r\n>\r\n> **Davis**: _I always say the three famous words: And now what? It's got to keep going. It can't just be \"This is a time for female rage, so this is a time for female-centric movies and maybe some black artists.\" It should've been time years ago. This is what it always should be._\r\n> \r\n> **McQueen**: _What's happening with #MeToo and Time's Up is amazing - these are huge, giant steps. But I just feel sometimes, as a black filmmaker, that it's still going around in circles. We've had this debate within the black film community about being represented as filmmakers and actors and stories. We never seem to break through. It goes up and then down. With #MeToo and Time's Up, it just goes on and on and on. And I think it's because there are people in situations of influence who are actually behind it and are doing a genius job. I wish those people would get on board with a black movement. Too much of this stuff is, \"Oh, I'm very happy for the black actors or actresses who are doing well.\" And it's like,_ White man, you're part of this_! You should be saying, \"Hey, I'm with them. I'm out there.\" That civil rights method: WE, not them. I don't know what you think about that, Viola._\r\n> \r\n> **Davis**: _If you're a black actor - especially actress - who gets to any level of power and you say, \"I'm going to produce my own film and I'm going to be the lead in the film\", you need a No. 2 who's going to get that film international distribution. That means you need a big white star._\r\n\r\n- \"Steve McQueen and Viola Davis on Hollywood, Race and Power\" (Reggie Ugwu); _The New York Times_ (November 15, 2018)\r\n\r\nArguably the most ambitious heist movie since _Heat_ (1995), just as did Michael Mann's genre (re)defining epic, _Widows_ has aspirations far beyond the limits of its generic template. Written by Steve McQueen and Gillian Flynn, and directed by McQueen, the film is based on the 12-episode British TV series of the same name written by Lynda La Plante, which aired on ITV in 1983 and 1985 (a six-episode sequel series, _She's Out_, aired in 1995, and the original series was unsuccessfully remade as a four-episode miniseries on ABC in 2002). McQueen's first two films, _Hunger_ and _Shame_, were two of the finest films of 2008 and 2011, respectively, but I'm pretty sure I'm the only person on the planet who didn't like his third, the recipient of the 2014 Academy Award for Best Picture – _12 Years a Slave_. Reading around some of the professional reviews of _Widows_, I seem to again find myself very much in the minority regarding a McQueen film; it has been very well received (91% approval on Rotten Tomatoes at time of writing), but I was left distinctly underwhelmed. Operating firmly within a genre framework, the film essentially tries to filter the basic heist template through a feminist pseudo-#MeToo prism, taking in such side-issues as political corruption, police homicide, Black Lives Matter, institutional racism, American gun culture, hegemonic masculinity, and the importance of wealth. McQueen approaches genre much like Michael Mann, as opposed to, say, Quentin Tarantino, using the generic template as a launch-pad to examine various socio-political issues, as opposed to using it as a destination in and of itself. The problem, however, is that he tries to pack far too much into too short a space of time. Whilst I can certainly appreciate and celebrate how progressive the narrative is, placing a black woman at the centre of a genre traditionally dominated by white men, the film still needs to work as a genre piece, or no amount of moralising, didacticism, polemics, or political grandstanding can save it. And this is where _Widows_ fails most egregiously – the core genre elements are as far-fetched and ridiculous as anything you're likely to see out of mainstream Hollywood, which serves to undermine and dilute the serious topicality for which McQueen is obviously striving.\r\n\r\nSet in Chicago, the film's protagonist is Veronica Rawlings (Viola Davis), an officer with the Chicago Teachers Union, married to career criminal Harry (Liam Neeson). Although she is not involved in his business, she knows what he does, and is happy to look the other way, allowing the couple to live a life of relative luxury. As the film begins, Harry and his crew, Carlos Perelli (Manuel Garcia-Rulfo), Florek Gunner (Jon Bernthal), and Jimmy Nunn (Coburn Gross), are fleeing from the police after a heist gone bad, a chase which ends in a shoot-out during which their van explodes, killing all four. Meanwhile, Jamal Manning (Bryan Tyree Henry), a local crime boss, has decided to run for alderman of the 18th Ward against Jack Mulligan (Colin Farrell, with the strangest Chicagoan accent you've ever heard), the son of retiring incumbent alderman Tom Mulligan (Robert Duvall, chewing scenery from scenes in which he doesn't even appear). Although the Mulligan family has controlled the 18th for over 60 years, due to a recent redrawing of the city's constitutional borders, Jack finds himself having to campaign in the poor black neighbourhoods which his father never had to worry about, thus giving Jamal a shot in the election. This connects up to the main plot insofar as Harry's fatal last job was stealing $2 million from Manning and his psychotic enforcer brother Jatemme (an ice-cold Daniel Kaluuya), cash which burnt up in the explosion. A few days after Harry's funeral, Jamal gives Veronica one month to liquidate her assets so as to pay him back. However, she discovers Harry's notebook, which contains a detailed plan for a heist worth $5 million. Deciding to use the notebook to carry out the heist, she recruits Linda Perelli (Michelle Rodriguez), whose store has been repossessed to cover Carlos's gambling debts, and Alice Gunner (Elizabeth Debicki, in the film's standout performance), whose odious mother, Agnieska (Jacki Weaver) has pushed her into high-end prostitution. She also approaches Amanda Nunn (a criminally underused Carrie Coon). However, with a four-month-old baby to look after, and reasonably secure finances, Amanda is reluctant to get involved. Still needing a fourth person, Linda recruits her babysitter, Belle (Cynthia Erivo), about which Veronica isn't thrilled, but with no other options, and the night of the heist rapidly approaching, she acquiesces.\r\n\r\nAs this plot outline should make very clear, _Widows_ is pure pulp, albeit pulp with something on its mind. McQueen's first genre film, he approaches it with the same seriousness with which he approached political protest, sexual addiction, and slavery. Obviously not especially interested in making what he sees as a generic crime thriller about bereft women taking matters into their own hands (which is about as political as the original series got), he and Flynn use the material as a vehicle for a racially-tinted critique of both powerful men (who are mainly, but not exclusively, white) and the corrupt systems that enable them. By creating a canvas depicting life at various social strata in Chicago – from the inherited white privilege of Jack Mulligan to the materialistic social trappings so important to Veronica, from the poor black neighbourhoods of the Manning family to the \"_everything is a transaction_\" philosophy of high-powered real-estate – the film attempts to address a plethora of racial, political, and gender issues. With this kind of Richard Price-style cross-section of an urban _milieu_, _Widows_ reminded me a little of _The Wire_. However, whereas David Simon, Ed Burns, _et al_ had 60 episodes to depict Baltimorean drug dealers, dock workers, politicians, educators, and journalists, McQueen and Flynn have just over two hours, and the results are concomitantly streamlined.\r\n\r\nAnd herein lies one of the film's biggest problems. Rather than trying to deal with one or two core issues with something resembling thoroughness, it instead tries to deal with upwards of about seven, and ends up saying little of relevance about any. There's gender, economics, politics, racism, police corruption, prostitution, gun culture, materialism, etc. It often feels as if McQueen and Flynn were simply throwing ideas against a wall to see what stuck, especially when you consider just how little attention some of these themes receive, making you wonder why they're there at all. Gun culture, for example, is really only addressed when Alice is assigned the task of buying the team's weapons. Asking where she is supposed to go to get guns, she is told simply and unironically, \"_this is America_\", a wink-and-a-nod point which relies almost entirely on the audience's left-leaning political affiliations. Another example is that of racially-motivated police homicide, a theme which feels especially shoehorned in. Several years prior to the film, Veronica and Harry’s teenage son, Marcus (Josiah Sheffie), was shot and killed by a white police officer at a routine traffic stop. And that's about it really. Marcus does factor into the film's big twist (kind of), but the racial overtones of his killing are never brought up again, and it remains unclear what McQueen is trying to say with this underdeveloped subplot. And ultimately, with so much thematic material competing for attention, much of it disconnected from the containing narrative, it's hard to focus.\r\n\r\nWhich is not to say, of course, that none of the film's themes are foregrounded. Gender, for example, is built into the plot, especially in relation to notions of subverting the patriarchal status quo. As they prepare the heist, Veronica tells the team that their greatest strength is the element of surprise, because \"_no one thinks we have the balls to pull this off_\". Later, she reminds them they have \"_to look and move like a team of men_\". Whilst on the heist itself, they have to disguise their voices so no one realises they are women. Similarly front-and-centre is the theme of race relations, something introduced in the opening frames – an above-the-bed shot of Harry and Veronica engaged in some _very_ heavy petting. Whilst promoting the film, Viola Davis has spoken a lot about how unusual it is to open a film with an interracial pseudo-sex scene, and she's right about that; even in a world which celebrates something like Jeff Nichols's _Loving_ (2016), interracial couples are still relatively rare on-screen, especially sexually active older couples (speaking at a Q&A screening of the film in LA, Davis said,\r\n\r\n> _I don't care how much people say they're committed to inclusivity – they're not committed to that; the opening shot in this movie where you have a dark-skinned woman with a big nose and wide lips and all of that, and her natural hair, kissing – romantically kissing a white man onscreen._\r\n\r\nRace is also dealt with via several references to Albert Woodfox, one of the so-called Angola Three, and a man who spent 43 years in solitary confinement in Louisiana State Penitentiary, from April 1972 until June 2015. Woodfox is actually quoted on a radio report to which Jatemme is listening, discussing what it feels like to realise that \"_nothing you do is gonna change your situation_.\" Of course, this is _exactly_ what the widows are trying to do (and, in a far less noble, though arguably far more legal sense, so too is Jamal).\r\n\r\nAnother excellent shot that carries huge thematic importance, this time in relation to city-wide macroeconomics, can be seen when Jack and his assistant, Siobhan (Molly Kunz), travel from a poor black neighbourhood to the affluent white suburb in which his campaign headquarters is situated. Filmed in one of McQueen's patented single-takes, what's especially interesting here is that after Farrell and Kunz get into the car, we can hear them, but we can't see them – regular McQueen cinematographer Sean Bobbitt (_The Place Beyond the Pines_; _Kill the Messenger_; _Stronger_) leaves his camera fixed on the bonnet, with only a portion of the windshield and one of the side-mirrors visible. Meanwhile, we see the city rapidly change in real-time in the background, taking only a couple of minutes to go from skid row to millionaire's row. McQueen's unusual camera placement forces the audience to acknowledge just how thin the line is, geographically speaking, between rich and poor (recalling that great quote from Bubbles (Andre Royo) in the first season of _The Wire_; \"thin line between heaven an' here\"). At the same time, of course, the ideological divide is massive.\r\n\r\nOf vital importance to this particular theme (the vast differences between the haves and have-nots) are the Mulligans. Robert Duvall plays Tom Mulligan as a closet racist (and sometimes he doesn't bother with the closet); an old-school politician who believes that whoever can grease the most palms and line the most pockets should become the most powerful. An angry vestige of a dying era, Tom resents the fact that a Mulligan must slum it to win black votes. Of course, Jack is no angel (he starts a program to get minority women back to work by making it easier for them to open businesses, from which he then takes a cut), but he is smart enough to recognise that the era of men like his father is over. I'm not sure if Duvall's over-the-top performance is the best thing about the film, or one of the worst; in one scene, during an intense argument with Jack, Tom _quite literally_ starts frothing at the mouth, and no one comments on it. He's just that type of character, and the film gleefully embraces his particular brand of crazy, often pushing scenes between him and Jack a beat or two beyond the point where they reach what should be their natural conclusion. For example, when Tom scoffs at the abstract painting on Jack's wall, and mocks his son for spending $50,000 on \"_wallpaper_,\" Jack retorts, \"_it's art_\", to which Tom growls, \"_wallpaper_.\" This is where a normal film would end the exchange, but _Widows_ allows each man another salvo; \"_Art_!\" says a frustrated Jack. \"_Wall. Paper_,\" replies Tom, steadfastly refusing to back down. It's wonderfully uncomfortable, and you get the sense this is not the first such allegorical exchange between these two, with the scene speaking to the relationship between money and power at the centre of the Mulligan subplot.\r\n\r\nA less signposted, but equally as important theme is the corruption, dishonesty, and mercenary-like behaviour endemic to all levels of society. The most obvious examples of this are probably the political corruption of the Mulligans and the street thuggery of the Manning brothers, but there are many more examples throughout the film. For example, the Chicago PD doesn't have much of a presence, with the main representative, Det. Fuller (Michael Harney) appearing in only two scenes as your basic corrupt movie-cop, Elsewhere, Linda is entrapped by the corruption of the loan sharks who buy her husband's gambling debt, Alice by her mother, who forces her into prostitution, and by David (Lukas Haas), the real-estate agent who pays for her services, and even Veronica, by Harry's chosen career path and the dangers to which it has exposed her. Really, the only man in the film who isn't corrupt in some way is Bash (Garret Dillahunt), Harry's loyal-to-a-fault working-stiff chauffeur, but even he (like Veronica and the rest of the widows) lives off the proceeds of crime. The system may be built on a foundation of toxic patriarchy (a very different thing to toxic masculinity), but the women are no angels in this _milieu_; no one is immune to the corrupting influence of socio-political norms. This is a world in which David's philosophy (\"_everything is a transaction_\") is universally subscribed to; for better or worse, people are either bought outright or sell off pieces of themselves.\r\n\r\nFor me though, the whole thing was underwhelming and predictable, with a twist that's as ridiculous as they come, and a narrative that relies far too much on coincidence and movie-logic. The widows need to disguise their voices on the job? Good thing that Belle's daughter has a gizmo that does exactly that! A highly successful modern-day thief who writes everything down longhand? A team of people (irrespective of gender and race) who become experts in something as complex as pulling off a major heist in a matter of weeks (what is this, _Battlefield Earth_)? For all its real-world social and political concerns, I never once bought into the central premise, that these four women could actually pull this off, and that undermines everything else. Much as David Simon has always argued _The Wire_ was about the quintessential American City, McQueen is here attempting to tell a story much larger than the sum of its parts. However, unlike the Baltimore of _The Wire_ (or the LA of _Heat_), McQueen's Chicago doesn't feel lived in (as opposed to say, Michael Mann's depiction of the same city in _Thief_); it feels like someone's idea of a city rather than an actual depiction of that city.\r\n\r\nJust because a film addresses certain themes doesn't mean it earns a free pass (\"_look, Hollywood cares about poor people; we better not criticise the ridiculous plot_\"), and from a narrative standpoint, _Widows_ is pretty ludicrous. With the plot often feeling contorted to support the themes, rather than the themes arising from the plot, McQueen's didactic and polemic concerns seem to have overridden his abilities as a storyteller. More a vehicle for protestation than anything else, that it tries to cover so many topics makes the whole experience emotionless, as if the filmmakers were dispassionately working off a checklist of issues on which to touch, rather than allowing the plot to organically lead into those issues. As I mentioned above, for this kind of film to work, the central heist narrative must be able to stand on its own, and this one most definitely cannot, which works to flatten and neuter the very real criticisms that the film is so concerned with enunciating. The socio-political commentary, for the most part, is never really integrated into the narrative – so you end up with a film that feels like its preaching at you rather than talking to you, light on emotion and dramatic verisimilitude, but top-heavy with moral superiority. If it had embraced its genre a bit more, and eased back on the homiletics, it would have worked much better, not just as a genre exercise, but, perhaps more importantly, as political commentary. As it is, it's a very good-looking but unoriginal, and at times, outright dumb movie, that seems to always assume its intellectual ascendency to the audience.", "created_at": "2019-06-25T22:44:11.722Z"}]