[{"movie_id": 9480, "review_id": "55c8cc20c3a36818e2000895", "author_rating": null, "review_text": "Waste of film stock", "created_at": "2015-08-10T16:06:56.567Z"}, {"movie_id": 9480, "review_id": "5c8429d992514129191ace14", "author_rating": 2.0, "review_text": "It's not just that Daredevil is a poorly made movie. It's that it takes a great character and turns him into a mishmash of tired clichés, shamelessly copying The Crow, Spider-Man, The Matrix, as well as both Burton and Schumacher's Batman in an attempt to appeal to the teen angst crowd. Don't blame Ben Affleck. He does what he can but the script and terrible production design lets him down as much as it us.", "created_at": "2019-03-09T21:02:17.655Z"}, {"movie_id": 9480, "review_id": "63e70add63aad2008586e7dd", "author_rating": 6.0, "review_text": "**Daredevil is cheesy but trying to be serious while dripping in 2000s grunge. It isn’t a masterpiece, but it was a solid superhero film for its time.**\r\n\r\nDaredevil (2003) falls prey to a lot of judgment from people who have spent over a decade with Marvel films and The Dark Knight trilogy, but rewind to a time when Blade, X-Men, and Tobey Macguire’s Spider-man were all you had for superhero films, and you might start to see Daredevil for what it was. It was a genuine product of its time - Seether and Evanescence heavily featured on the soundtrack, leather superhero suits, and ridiculous dialogue. Everything was so cheesy in superhero movies at the time - don’t forget that Catwoman came out just a year later. Daredevil tried to be more edgy and gritty than Spider-man at a time when most people still considered superhero movies as kids’ films. It had a lot going against it but still brought together a fantastic cast with Ben Affleck and Colin Farrell at a very popular time in their careers and Jennifer Garner while she was one of the biggest stars on TV. This movie even managed to spawn a spin-off film! Say what you want, but when I saw this movie in 7th grade, I thought Daredevil was one of the coolest superheroes I had ever seen, and even though years later I can see the movie more for what it is - it still holds a special place in my heart.", "created_at": "2023-02-11T03:26:21.542Z"}, {"movie_id": 9480, "review_id": "64f4c91b97a4e625996caf68", "author_rating": 6.0, "review_text": "This film feels longer than just 100 minutes! Ben Affleck (\"Matt Murdock\") is the eponymous super-hero who is blinded by an accident with some toxic waste but as a result, has acute hearing and sensitivity to movement. He spends his days as a lawyer, his nights à-la \"Spiderman\" as a bit of a vigilante trying keep the streets of New York's infamous \"Hell's Kitchen\" clear of criminals. Lately, his sights have become firmly set on the \"Kingpin\" (Colin Farrell) - the biggest baddie of them all, but a man whom the courts cannot incarcerate. His masked mission now becomes to bring this man to justice. This is a quickly paced, and colourful extravaganza - plenty of action, the visual effects are good and a premiss just a little different. The dialogue is pretty banal, Farrell is dreadful - a ham if I ever I saw one, and the action scenes are just a little bit too repetitive and dull after a while. Affleck brings little charisma to the screen and the romance with Jennifer Garner (\"Electric Nachos\" - or something similar) was gloopy and dragged the pace down all too often before an ending that, well - is just daft. It's harmless fun but I don't think I would bother watching it again.", "created_at": "2023-09-03T17:57:47.261Z"}]