[{"movie_id": 203834, "review_id": "5f5941b560c51d0039442f5c", "author_rating": 3.0, "review_text": "Empty watch, won't watch again, and can't recommend.\r\n\r\nI basically gave this a shot because Sarah Snook looked cute and it was a horror movie I hadn't heard about.  I had really expected it to get a lot better from there.  Sadly it doesn't.\r\n\r\nThe opening sequence is an odd choice, but it's just a mechanic to get her in a wheelchair, which I really wanted to love, but it is used a cheap way to debilitate her and add to a fear of helplessness when it sort of does the opposite.  As someone who has had to use a wheelchair before, it separates the character from most of the audience because they don't have that frame of reference: it's alienating usually.  The movie has to be really good and draw the audience to relate to the character before they can overlook things that seem foreign to them.\r\n\r\nThere are some really good sequences with the ghost, and it actually reminded me of \"Evil Dead\" quite a bit, but it did sort of devolve into what looks like two girls mud wrestling, so I'm hoping that wasn't a factor.\r\n\r\nThe story is all jumbled and clunky in how it's told so it ruins all the parts that would make it interesting, but even with a good mystery / twist, I think the movie would have been average at best, and instead it's a waste of time.  There are so many better movies out there to watch.", "created_at": "2020-09-09T20:57:25.781Z"}, {"movie_id": 203834, "review_id": "5f6bbbb3fbe36f003947278e", "author_rating": 4.0, "review_text": "<I>Jessabelle gonna get what's coming to you.</I>\r\n\r\nSome southern spooky times in this film along with a mystery that'll try to throw you off the path of what seems to be predictable coming close to the final act.\r\n\r\nThe reveal isn't a bad one and in fact it was pretty clever. Some might be disappointed in the reveal if they found it early. The effects were mild but pretty cool.", "created_at": "2020-09-23T21:18:43.680Z"}]