[{"movie_id": 10637, "review_id": "55be2d45c3a3686539004760", "author_rating": 8.5, "review_text": "In Greek mythology, the Titans were greater even than the gods.\r\n\r\nBased on real events in 1971, where T.C. Williams High School, a now hot bed integrated school, becomes a beacon of unification via their mixed race football team.\r\n\r\nAs is normally the case with films of this ilk, it quickly comes to pass that certain artistic licence has been taken with the truth. In reality the issues of race, integration and the near powder-keg atmosphere portrayed in the picture, were long past their worst in Virginia 1971. However, that should in no way detract from the thematics and truthful aspects of this Disney production. As is told in the film, the Titans did have what became known as the perfect season, whilst the bond formed between the black and white members most definitely existed. All told, the film soars high as an inspirational piece, not only for the mixed race community coming together plot's essential being, but in the crucial tale of one Gerry Bertier.\r\n\r\nThat this film urged me to seek out the story of Bertier is a testament to the power of film, regardless of any sort of sentimental prodding from the film makers. It's hoped that this film also prompts newcomers to research further the topics within the story.\r\n\r\nThe cast list is impressive, Denzel Washington and Will Patton find instant chemistry as the head coaches thrust together by outside influences, with both guys beautifully doing credit to the real life friendship that would be born from the situation. Ryan Hurst, Wood Harris, Ethan Suplee, Donald Faison, Kip Pardue, Craig Kirkwood and a pre-fame Ryan Gosling fill out the integrated football team. While two important female family roles are nicely portrayed by Hayden Panettiere and Nicole Ari Parker. The soundtrack is nicely put together, with the core offering of Marvin Gaye and Tammi Terrell's thumping rendition of \"Ain't No Mountain High Enough\" particularly potent and uplifting. \r\n\r\nThough not primarily offering up anything new in the pantheon of race and sport related movies, Remember The Titans does have so much good going for it. It's hard to be picky, even churlish about the little faults (are these actors really the age of high schoolers for example?), so hopefully come the end, after the credits roll, you will be suitably inspired and perhaps a touch more better off for having spent time with this particular football team. 8.5/10", "created_at": "2015-08-02T14:46:29.688Z"}, {"movie_id": 10637, "review_id": "56b4b72692514114eb004e60", "author_rating": null, "review_text": "Denzel Washington leads the team on a charge until the final whistle in Remember the Titans, a grand and inspirational football film. This Walt Disney classic is a primitive display of adversity and courage. The amount of chemistry from the then-segregated gridiron warriors was remarkable and helped propel this film as a truly great and heartfelt sports movie for every generation to experience. 5/5", "created_at": "2016-02-05T14:52:22.862Z"}, {"movie_id": 10637, "review_id": "63bf7c1c23be4600b2f088cf", "author_rating": 10.0, "review_text": "OK, well, reading through the bad reviews there are some grudges here based on, well, how the other teams were depicted because 1971 wasn't long enough for some of the people that played them to pass on their mortal coils.\r\n\r\nI can relate to that. I grew up countryfied and have tasted the salt of playing against a school that was three or four times our size, schools that could afford to cherry-pick who played. Schools where the defense could rest when the offense was on the field...apparently T.C. Williams was one of those giant schools.\r\n\r\nI can sympathize with some of the negative reviews here...because, honestly, if they made a movie like this about Woodstock, I'd give it 1 star out of principal. Seriously, no, we might be hicks, but we rotate from linebacker to offensive tackle. When you faced off against schools that had an actual student body, you knew you were going to lose, the only question was how hard were you going to make their victory. Sounds like T.C. Williams was one of those giant schools.\r\n\r\nOK, rant done.\r\n\r\nI caught this on TNT and the music drew me in right away. Hear a good song it catches your ear and drags you in.\r\n\r\nAnd this has the acting to back it up. It's very... nice seeing Washington NOT playing the smart-cop role or a variation there of. He can act, he can act well, and this is one of the movies where he's not playing the same role over and over again. So, when he comes out of that shell and gets a gig playing a role he doesn't always play... it's kind of a treat isn't it?\r\n\r\nOf course the highlight was really Hayden Panettiere, not because she was absolutely adorable in the film (which she was), but more because she did a great job of turning a little girl into that parent, on the sidelines, that thinks he's Ditka, so she was not only adorable but hysterical.\r\n\r\nThe Hippie, Ryan Gosling?, was another little gem, not because he did a particularly good job acting, though it was fair enough. No, he stood out because anyone that's payed football knew someone like him. It gave it a bit of an authentic feel.\r\n\r\nThe only real downside was that, by 1971, schools were integrated and been for a while. It kind of lost that authenticity when they went that route. But, you know what, who cares, it was entertaining enough despite that.\r\n\r\nIt was a solid football movie.\r\n\r\nAnd for all the 1 star reviews, particularly those written by people from the smaller schools that had to go up against the Titans... I feel for you. I remember being in that situation and I'd be bitter too if the giant school had a movie made about them that suggested they were in anyway the under-dog.", "created_at": "2023-01-12T03:18:52.902Z"}, {"movie_id": 10637, "review_id": "64d0ecafd9f4a603b6c9901e", "author_rating": 6.0, "review_text": "A African American and cacausion coach must put aside there racial differences to coach one of the worse teams in their school. They soon become one of the hottest teams and best teams to ever play for the school. Until tragedy strikes. The saddest thing is this is a true story.", "created_at": "2023-08-07T13:07:59.336Z"}]