[{"movie_id": 522402, "review_id": "6182b473e54d5d002c99321b", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/finch-spoiler-free-review\r\n\r\n\"Finch is far from being the most impressive, imaginative post-apocalyptic, survival film, but it's still a captivating, character-driven story that boasts an emotionally resonant, meaningful personal journey.\r\n\r\nTom Hanks proves to still be in shape by delivering a genuine performance as a man who teaches and learns about companionship, human bonding, and perseverance of love and life.\r\n\r\nFocusing on the relationships between Finch, the adorable dog, and the witty robot (excellently voiced by Caleb Landry Jones), Miguel Sapochnik takes good advantage of stunning cinematography (Jo Willems), exceptional VFX, and one of the year's best scores (Gustavo Santaolalla) to elevate an otherwise generic, somewhat slow movie.\r\n\r\nDespite some world-building elements being foreshadowed and not receiving a satisfactory outcome, I still highly recommend watching this subversive take on the world's ending.\"\r\n\r\nRating: B", "created_at": "2021-11-03T16:10:27.618Z"}, {"movie_id": 522402, "review_id": "619bd4a863536a0061995741", "author_rating": 8.0, "review_text": "Full Analysis at Spotamovie.com - **Intro** - Finch is a journey to discover life and the essential elements of it. Finch brings relevant topics on the screen, including just one actor (Tom Hanks), a dog and two robots. It may look like a simple story or static because of the apparent lack of characters, but, trust us, it’s engaging and let us think about our life and purpose. So let’s dive into the story. **The Story** - We are in a post-apocalyptical world. A solar flare destroyed the ozone, making life almost impossible on earth. Finch is one of the few survivors, and he struggles to take care of his health, his dog and his robotic friend Duwei. Finch’s skills as an engineer are good. Therefore he spent his time building a robot to take care of his dog Goodyear once he will be gone. Tornados, storms and the dangers on earth push Finch to move from its forte and find a new, safer destination. So, the journey begins for them and us. There is a lot to discover, even after an apocalypse. How will the new robot behave? Will Finch succeed on his mission?And how is life living during the night? - **We recommend you to read our analysis** at https://www.spotamovie.com/finch-2021-movie-movie-review-and-analysis/", "created_at": "2021-11-22T17:34:32.281Z"}, {"movie_id": 522402, "review_id": "624046d91cfe3a00476c64ca", "author_rating": 7.0, "review_text": "OK, first things first - original this isn't. It is an amalgam of many road trip and robot movies that we have all seen many times before. That said, it is maybe the first actual robot road movie I think I have ever seen, and Tom Hanks and his metallic sidekick \"Jeff\" - along with their dog, make quite an entertaining fist of it. The world has been exposed to massive radiation and he appears to be the sole survivor. With an incredible storm approaching his home, he constructs his new friend and the three make for San Francisco in his heavily adapted motorhome. It's a well paced affair, this, and Hanks (who is definitely not my favourite actor) turns in quite an engaging performance as gradually he and \"Jeff\" begin to learn from each other - for better or worse. There is the sparing use of flashback to give us an indication of what happened to his family, and of how he ended up in his predicament, and as their journey progresses the film offers us a perspective on just what being \"human\" might mean as he gradually realises that all is not well. It is probably twenty minutes too long, the establishment scenes are unnecessarily extensive but, though not a great film, Tom Hanks invests just enough to keep it in the right gear most of the time.", "created_at": "2022-03-27T11:13:29.185Z"}, {"movie_id": 522402, "review_id": "642a85d59cc67b059cc4f38c", "author_rating": 6.0, "review_text": "**Good but lacks flashback method**\r\n\r\nIt smells like a (cast away 2000) movie. The film was directed by Miguel Sapochnik, and the majority of his works were series that had wide fame, one of the best of them being directed by 6 of Game of Thrones, and the best episode he directed was Battle of the Bastards.\r\n\r\nThe story of the movie is about a man who lives alone on the planet with a dog, where he invented a robot to take care of the dog if he died or something bad happened to him.\r\n\r\nThe film talks about humanity and respect for whoever you talk to, even if you are talking to a robot made of iron sheets. Tom Hanks' performance was brilliant and the dialogues with the robots were entertaining.\r\n\r\nI liked the dog's relationship with Tom Hanks and the robot was an influential character. His performance was different from the robots that appeared in other artworks. He was argumentative, talkative, and had a strong personality. Yes, he regrets anything that Finch doesn't like, but does what he likes and then say sorry to Finch.\r\n\r\nThe negatives of the film could have added additional dialogue sentences that attract the viewer. It would have been better if the flashback method had been used. I wanted to know Finch's old lifestyle, what he was doing, what happened to the world and the people.", "created_at": "2023-04-03T07:52:53.152Z"}]