[{"movie_id": 807356, "review_id": "6323788adb154f007abcfdf1", "author_rating": 6.0, "review_text": "**Watcher's pace can sometimes feel haphazard or arbitrary, but the strong finale makes it all worthwhile.**\r\n\r\nThe Watcher builds slowly, spending plenty of time emphasizing the main character's isolation and loneliness. Each passing moment of this slow burn accentuates the paranoia of being watched. Maika Monroe proves her horror chops once again with Watcher, as she has before with movies like It Follows and The Guest. I wanted to give this movie a better rating than 3/5 but the gradual crawling pace of the film, although intentional and effective in creating tension, had me looking at my phone out of bordem. The last 20 minutes of the movie are intense and pay off nicely, though, and make it worth hanging around until the end. As a horror fan, I enjoyed Watcher and would recommend giving it a shot, but don't set your expectations high.", "created_at": "2022-09-15T19:10:02.344Z"}, {"movie_id": 807356, "review_id": "635800b143250f007d05c193", "author_rating": 7.0, "review_text": "_Watcher_ is a tense movie that does a great job building atmosphere and suspense, but that slow build is also to its detriment. As a horror fan, I am much more interested in movies that deliver intense tension leaving audiences at the edge of their seat. While this movie does attempt to deliver on that premise, it does so in a way that is incredibly long and dragged out. By the time the movie really had me hooked, it would cut away to a different scene and completely ruin any resemblance of momentum it had going for it. This results in a very uneven viewing experience that left me bored more often than not. The performance by Maika Monroe was brilliant and she does such an excellent job of portraying loneliness throughout the film. Even though she was surrounded by her husband and friends the sense of isolation this movie and Monroe builds is entrapping. The audience can genuinely empathies with her, creating a wonderful protagonist to root for. Despite the uneven story and the slowness of the entire film, the ending did leave me incredibly satisfied. This film is one that I appreciated the premise and the attempted delivery over enjoying the film as an experience, which tacks on an additional half a star to my rating.\r\n\r\n**Score:** _69%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-25T15:28:49.264Z"}, {"movie_id": 807356, "review_id": "636bc24721621b0091111511", "author_rating": 7.0, "review_text": "\"Julia\" (Maika Monroe) and her husband \"Francis\" (Karl Glusman) relocate from New York to his native Romania so he can take up a job in Bucharest. She has not a word of the native language, and so is pretty much on the back foot from the start as he goes to work each day leaving her to fend for herself. It's when she is looking out of their window one evening that she thinks she spots someone staring back at her. She waves, it waves back... What's going on? Is it just a bored next door neighbour or is something more dastardly afoot? Things become more sister for her when, returning home one night with her husband, she learns of the gruesome murder of a young woman nearby. Chloe Okuno does a decent job at creating and sustaining a certain sense of menace here. It's added by a decent script and a solid effort from Monroe as the increasingly paranoid woman who may be in great danger, or who may just have a very vivid imagination! I wasn't mad on the ending - it very nearly worked but I felt it hadn't quite the courage of what would have been a far more fitting conviction. It's not a great film, no - but it uses our imagination to do much of the work here and at times is really quite effective and certainly it is a bit different from a psychological perspective.", "created_at": "2022-11-09T15:07:51.155Z"}]