[{"movie_id": 10764, "review_id": "58a24ea3925141537f000530", "author_rating": 1.0, "review_text": "**It's a shame that they did this to the Bond films**\r\n\r\nIt's upsetting for Bond fans that Eon productions ran away from the lively, fun formula that sustained the franchise for 40 years. What does it leave us with? Well - this type of Bond film unfortunately. Staggeringly bland and uninteresting.  If we removed the name Bond from the film we would have no idea that we were watching a Bond movie. \r\n\r\nIt is depressing that they flushed 40 years of fun Bond films down the toilet to satiate people who dislike classic Bond adventures. They reached for a wider audience by going all generic action film to the detriment of the Bond legacy.\r\n\r\nWho is this unsophisticated, short, blond man in the suit? Unfortunately, _he could be anyone_ - even you or I. Bond is now a lager chugging everyman. Ian Fleming would be furious.\r\n\r\nNo chance of Craig's Bond wearing  _a strap on plastic seagull hat_ as Connery did in the classic Goldfinger (1964) - they would not dare make the films that fun and entertaining anymore.\r\n\r\nIt's a shame what they did to the Bond films.", "created_at": "2017-02-14T00:26:11.485Z"}, {"movie_id": 10764, "review_id": "58a8ee299251410a0e004a9a", "author_rating": 7.0, "review_text": "If we refused to do business with villains, we'd have almost no one to trade with!\r\n\r\nQuantum of Solace is directed by Marc Forster and written by Paul Haggis, Neil Purvis and Robert Wade, suggested from the stories written by Ian Fleming. It stars Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arteton & Jeffrey Wright. It is the 22nd film of the James Bond series.\r\n\r\nFollowing on straight from Casino Royale, we find James Bond thirsting for revenge on those he believes responsible for Vesper Lynd's death.\r\n\r\nIs Quantum Of Solace a great action film? Yes it surely is, is it however a great James Bond picture? Not quite, apparently, given the often venomous reaction to it from some Bond fan quarters. You wonder if Quantum Of Solace is a victim of Casino Royale's soaring success? A film that even surprised the many Daniel Craig haters. Were these internet warriors preying for a bad Bond film purely to further their argument that Craig should not be Bond? Did QOS give them smug satisfaction? Actually no it didn't, the box office and longevity of professional critiques proves this fact. Further viewings of QOS show it to be very astute in the Bond universe, where much of the charges of it not being fun enough etc just do not stick. As for not being Bondian enough? Opening car chase, a pursuit on foot that ends in a quite exhilarating rope dangle punch up, speedboat chaos, aeroplane peril with free-falling! Not Bond enough? Seriously? While it's also great to see Bond active on a motorcycle again.\r\n\r\nThe Casino Royale rebooted and re-suited offering was popular because it had an earthy make over, Daniel Craig's Bond is a fallible human being brimming with egotistical ruggedness. It's much of the same here in Quantum, where he is forced to go rouge, something that again has proved to be an itchy narrative thrust with sections of the Bond faithful. Yet as serious as he is, driven by pangs of annoyance, revenge and unanswered questions, Bond does have time to lay out a quip, there is some fun stuff their, honestly, Mother. Personally I enjoy the dark half of this Bond, \"I don't have any friends\", he wouldn't care\", and \"how many is that now?\", these are moments nearly as good as the interwoven opera blood bath and Bond drinking away his demons with 6 high velocity cocktails. Then there is Craig. Ah, Craig, Daniel Craig, again perfect in the tux and kicking arse with streetwise credibility, each scar on his nicely formed body a testament to this new rugged Bond of the people. That he rises above a relatively muddling script is testament to not only his acting ability, but also his new found acceptance in this most iconic of cinematic roles amongst the British institution that is James Bond.\r\n\r\nThe rest of the cast are a mixed bunch, Jeffrey Wright & Giancarlo Giannini are again merely making up the numbers, though the last gets to give Bond one of the film's darkest and cold inducing moments. Judi Dench of course does her usual solid M performance, swearing and growing the balls she hinted at previously, while Olga Kurylenko is very much a sparky Bond girl to savour; even if the sub-plot involving her almost feels like it was shoe-horned into the script as an added extra. Elsewhere there are problems. Casino Royale, had on the surface a weak villain, a man merely playing cards to pay off a more evil source, but he was effective. Sadly here in the Quantam universe the main villain is a hindrance to the picture. Mathieu Amalric's Dominic Greene does a good line in smarmy, but he's so weak the film nearly crumbles under the weight of his banality. The people at the house of Bond need to realise that little fish villains are only OK if we get the big daddy shark showing his/her face later in proceedings, for if this trend continues I fear the franchise could well lose the edge so well built up in Royale, and Gemma Arteton is pretty, but pretty ineffective. The locations are sumptuous, mind, and the sets are Bondian delights, with the title sequence certainly hitting the spot in spite of the quite dreadful Jack Black and Alcia Keys' theme song that accompanies the sequence. A homage to a former great Bond film sequence is respectful but a touch lazy, but QOS still overcomes its failings to be up above many action pictures of the last decade; this in spite of it being very slim line at an hour and 45 in length. Crucially, though, it pulses with Bond aggression and egotistical nous, just as Fleming wanted it. But this only comes out with further viewings...\r\n\r\nSkyfall will be the next venture for Bond, regardless of quality we know that it will fail to appease every Bond fan on the planet. That's just the way it is with the series, so many want so many different things from their Bond. But I feel this is a good period for Bond, they do have the right man wearing the tux and as a character he is well tuned into the times, both politically and cinematically, it's now up to the makers to fuse the two and deliver a film to fully realise the rebooted franchise's potential and maybe, just maybe, win the dissenters' trust. 7/10", "created_at": "2017-02-19T01:00:25.938Z"}, {"movie_id": 10764, "review_id": "58aee6519251410b3b006df0", "author_rating": 7.0, "review_text": "Quantum of Solace had to follow Casino Royale which rebooted the Bond franchise with critics as well as with some of the public with a youthful, angry Bond.\r\n\r\nQuantum of Solace starts 20 minutes after the events of Casino Royale with a fast edited but choppy car chase sequence. This is the first hint that Bond is following the Bourne films as co-editor Richard Pearson previously edited one of the Bourne films. This also highlights director's Marc Forster inexperience in making action films as many of the action sequences are hard to follow because of the way it has been edited.\r\n\r\nThe film was also hampered by the 2008 writer's strike. This meant that film went into production without a full working script which also meant that the director and even Daniel Craig allegedly wrote scenes for the film. It might explain the short running time.\r\n\r\nThe film unveils Quantum as a shady organisation with tentacles everywhere even in the heart of the British security services. The setting in Bolivia with disputes about water gives the film a political edge with a cynical look at corporations making dicey alliances with dictatorships to mutually exploit the people and plunder resources.\r\n\r\nForster gives the film some intriguing set pieces such the opera scene which is the meeting point for Quantum operatives which Bond infiltrates.\r\n\r\nThe short running time means the film is not overblown but with Craig at the helm it is kept lean and mean.", "created_at": "2017-02-23T13:40:33.451Z"}, {"movie_id": 10764, "review_id": "5e9689ef002134001399f235", "author_rating": 7.0, "review_text": "Probably liked this a bit more than the last time I saw this ('08 or '09) but still a sizable step down from Casino Royale, although I do appreciate that this is a direct sequel (whereas it seems most Bond movies are standalone). The plot isn't the best nor is the villain, albeit Mathieu Amalric does have the creep-factor going for him. The action sequences are good but not enough quieter moments.\r\n\r\nPlus, the (kind of) twist at the end regarding Vesper really cheapened that character, having her being duped like that, seems out of character given how perceptive she was with Bond.\r\n\r\nIn any case, still a solid enough movie as a whole and I absolutely love Olga Kuryenko, shame she never really took off. **3.25/5**", "created_at": "2020-04-15T04:13:35.114Z"}, {"movie_id": 10764, "review_id": "60c3d1caaaf89700415d2f84", "author_rating": 6.0, "review_text": "_**Decent Bond flick marred by ridiculous quick-editing**_\r\n\r\nBond seeks justice for the death of his woman in the previous film as well as those responsible for an assassination attempt on M (Judi Dench). The trail leads from mountainous northern Italy to the rooftops of Siena, Italy, to London to Haiti and finally to the secluded desert of Bolivia and Dominic Greene (Mathieu Amalric), a world-renowned developer of green technology. Greene is intent on securing a barren area of Bolivia in exchange for assisting General Medrano stage a coup there (Joaquín Cosio). Since the CIA looks the other way, only 007 stands in Greene's way with assistance from a retired spy and two formidable beauties (Olga Kurylenko and Gemma Arterton). M wonders if she can trust Bond or if his need for vengeance has corrupted him.\r\n\r\nReleased in 2008, \"Quantum of Solace\" is the second of five Bond films with Daniel Craig as Agent 007. Craig makes for a unique James Bond and I appreciate the serious vibe of his installments.\r\n\r\nThe problem with \"Quantum of Solace,\" the 23nd Bond film (if you count 1983's non-Eon \"Never Say Never Again\"), is the rapid-fire editing during the action scenes. Take, for instance, the opening chase-sequence that takes place on the tollway that leads through mountain tunnels from Nice through Monte Carlo and down to Portofino in Italy. It's a spectacularly scenic area. Unfortunately you won't see much of it here, just quick flashes; more importantly, you'll hardly understand what's going on due to the moronic fast editing. The camera switches about 3 or 4 times per second! I'm sure the filmmakers think such quick angle changes convey energy, but when it's done this fast all it does is confuse, disorient and ANNOY the viewer. It wouldn't be so bad if this was the only sequence like this but, no, after Bond's initial meeting with M (Judi Dench) there's another ridiculous rapid-fire action scene.\r\n\r\nThe filmmakers need to get a grip that James Bond is not a mindless action hero. He's too smart for that; he's the ultimate 'cool' attitude. Violence for him is an irritation resorted to only when necessary. He exists for the mental play, the checkmate and, later, the martini, shaken, not stirred; the beautiful woman too, of course. The only way the average viewer can successfully make it past the 25-minute mark of \"Quantum of Solace\" and enjoy the movie is if s/he drinks a pot of heavily-caffeinated coffee beforehand. If you do this it's an entertaining Bond picture with some effective sequences, like when Bond and Camille find themselves stuck in the remote desert after surviving a thrilling aerial combat, plus Olga (Camille) and Gemma (Strawberry Fields) are top-of-the-line, but the annoying quick-editing in the action scenes heavily mars the flick and prevents it from being in the top tier of the franchise.\r\n\r\nThe film runs 1 hour, 46 minutes, and was shot in England, Italy, Austria, Spain, Panama (standing in for Haiti), Chili (the Atacama Desert) and Baja California (the last two standing in for Bolivia).\r\n\r\nGRADE: C+/B-", "created_at": "2021-06-11T21:12:42.333Z"}, {"movie_id": 10764, "review_id": "6151c9eeaf95900061a969af", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/quantum-of-solace-spoiler-free-review\r\n\r\n\"Quantum of Solace is one of the biggest disappointments of the respective decade, holding a titanic drop in quality compared to its predecessor. Daniel Craig's dedicated performance isn't enough to save an over-violent James Bond flick, packed with terribly handled action sequences - shaky cam and quick cuts may be the worst technical combo in cinema - and an uninspiring, utterly boring narrative. Both the villain and the new Bond girls return to being easily forgettable cliches. Despite boasting the shortest runtime of the entire franchise, I couldn't wait for this unexpectedly poor sequel to reach its underwhelming ending. A stain that the next installment would fortunately clean…\"\r\n\r\nRating: D", "created_at": "2021-09-27T13:41:02.111Z"}, {"movie_id": 10764, "review_id": "63259cca511d09007f4fd81c", "author_rating": 6.0, "review_text": "Whilst there is certainly loads of action in this rather procedural outing for \"James Bond\" (a rather uncharismatic Daniel Craig) there is a real dearth of a substantial story. Picking up from \"Casino Royale\" (2006), this film sees our super-spy capture elusive \"Mr White\" (Jesper Christiansen) only to have him escape in the most treacherous of fashions - putting all in MI6 at risk. Pretty quickly, \"007\" is on the trail of the ostensibly benign millionaire \"Greene\" (Mathieu Amalric) and as the escapades gather pace we realise that the industrialist has a cunning plan to manipulate a crime consortium of global proportions; to take over the government of Bolivia and to control the ebb and flow of one of that nation's most crucial resources. Thing is, though, that this is all just too weak. The story is just lacklustre and undercooked. The efforts of the baddies - Amalric, Anatole Taubman as henchman \"Elvis\" and a straight-from-central-casting Joaquín Cosio as the scheming \"Gen. Medrano\" just to don't create any sense of menace or peril. Far too much time is spent swinging from scaffolding, or trashing a rather impressive set for a performance of \"Tosca\" rather than creating a solid story with twists and turns. Again, the character of \"M\" (Dame Judi Dench) has much more of a role, and sacrilegious as it may be, she just isn't very good at it. She seemed to be wearing the same clothes for most of her scenes, too! The dialogue is rather dry, no fun innuendo or double-entendre and though quite spunky, Olga Kurylenko is no natural as \"Camille\", a girl with an axe to grind (ideally into the general's skull). It ends a bit like \"Licence to Kill\" (1989) and, indeed, is all just a bit too much of an hybrid of the other films to offer much by way of distinction. Good to see an Aston Martin back on screen, but otherwise this rather curiously titled film offers very little to write home about.", "created_at": "2022-09-17T10:09:14.934Z"}, {"movie_id": 10764, "review_id": "6348ab7705f9cf007de99402", "author_rating": 5.0, "review_text": "I'll make it quick. I watched this movie, and after some while I realised, I had seen this one before.\r\n\r\nIt's so forgettable, you can skip it without loss. Expect disappointment if you do watch it. It's just a run-off-the-mill action flick, basically.", "created_at": "2022-10-14T00:21:11.772Z"}, {"movie_id": 10764, "review_id": "63be6f3aa6e2d20092121868", "author_rating": 1.0, "review_text": "Well, I loved the theme song, I honestly thought it didn't fit well with the Bond franchise (like the theme of The Living Daylights) but over all I really liked it as a rock song.\r\n\r\nAnd Olga Kurylenko I thought was a great Bond girl, plus they brought back Jeffrey Wright as Felix (and it's a reboot so it's OK he has his legs) but it was nice seeing the same person play Felix twice in a row wasn't it?\r\n\r\nBut Q, M, and Moneypenny were conspicuously absent weren't they? The plot was pretty convoluted (even for a Craig Era Bond) the action was super choppy because in 08 we were moving into that choppy means action trope that never should have been, and overall the movie stank.\r\n\r\nPlus, this is the first time we really got to see Craig's Bond who hates being Bond character come front and center and, honestly, that is the worst way to play Bond.", "created_at": "2023-01-11T08:11:38.080Z"}, {"movie_id": 10764, "review_id": "63e72ec912777800895ec862", "author_rating": 8.0, "review_text": "**High expectations harmed Quantum of Solace's reputation from the get-go but considering this film as the end of Casino Royale allows it to shine.**\r\n\r\nMany find Quantum of Solace a disappointing entry in the Daniel Craig Bond era, but I beg to differ. When viewed as a stand-alone film, I can understand frustrations with a meager storyline. But when considered the conclusion of Casino Royale, this movie becomes much better. Casino Royale ends with Bond suffering a significant loss, and Quantum allows him to take revenge. Bond is still grappling with a broken heart and is less interested in the standard Bond romantic escapades than usual. In fact, the main Bond girl of the movie is more of a partner in the film than a romantic prospect. The opening fight sequence, the action, the stunts, and the locations are some of the franchise's best. The expectations following Casino Royale were so high that Quantum of Solace never stood a chance (much like Spectre following Skyfall), but when Quantum is coupled with Casino Royale, more depth and development are added to both films.", "created_at": "2023-02-11T05:59:37.299Z"}, {"movie_id": 10764, "review_id": "643e17d9cb6db50499b09e48", "author_rating": 3.0, "review_text": "Try not to fall asleep while watching this movie.\r\nThis movie is as dull as the title, so it has that going for it. It's \"true\" advertising.\r\nThis one sort of takes over where Casino Royale left off. Bond does more detective work than action in this one.\r\nWell, that's okay. At least we aren't overly depressed. We just fall asleep.\r\n007 wants revenge, and it appears that this movie tries to be an \"anti revenge\" movie, but it flails too much to do that.", "created_at": "2023-04-18T04:08:57.931Z"}, {"movie_id": 10764, "review_id": "58a24ea3925141537f000530", "author_rating": 1.0, "review_text": "**It's a shame that they did this to the Bond films**\r\n\r\nIt's upsetting for Bond fans that Eon productions ran away from the lively, fun formula that sustained the franchise for 40 years. What does it leave us with? Well - this type of Bond film unfortunately. Staggeringly bland and uninteresting.  If we removed the name Bond from the film we would have no idea that we were watching a Bond movie. \r\n\r\nIt is depressing that they flushed 40 years of fun Bond films down the toilet to satiate people who dislike classic Bond adventures. They reached for a wider audience by going all generic action film to the detriment of the Bond legacy.\r\n\r\nWho is this unsophisticated, short, blond man in the suit? Unfortunately, _he could be anyone_ - even you or I. Bond is now a lager chugging everyman. Ian Fleming would be furious.\r\n\r\nNo chance of Craig's Bond wearing  _a strap on plastic seagull hat_ as Connery did in the classic Goldfinger (1964) - they would not dare make the films that fun and entertaining anymore.\r\n\r\nIt's a shame what they did to the Bond films.", "created_at": "2017-02-14T00:26:11.485Z"}, {"movie_id": 10764, "review_id": "58a8ee299251410a0e004a9a", "author_rating": 7.0, "review_text": "If we refused to do business with villains, we'd have almost no one to trade with!\r\n\r\nQuantum of Solace is directed by Marc Forster and written by Paul Haggis, Neil Purvis and Robert Wade, suggested from the stories written by Ian Fleming. It stars Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arteton & Jeffrey Wright. It is the 22nd film of the James Bond series.\r\n\r\nFollowing on straight from Casino Royale, we find James Bond thirsting for revenge on those he believes responsible for Vesper Lynd's death.\r\n\r\nIs Quantum Of Solace a great action film? Yes it surely is, is it however a great James Bond picture? Not quite, apparently, given the often venomous reaction to it from some Bond fan quarters. You wonder if Quantum Of Solace is a victim of Casino Royale's soaring success? A film that even surprised the many Daniel Craig haters. Were these internet warriors preying for a bad Bond film purely to further their argument that Craig should not be Bond? Did QOS give them smug satisfaction? Actually no it didn't, the box office and longevity of professional critiques proves this fact. Further viewings of QOS show it to be very astute in the Bond universe, where much of the charges of it not being fun enough etc just do not stick. As for not being Bondian enough? Opening car chase, a pursuit on foot that ends in a quite exhilarating rope dangle punch up, speedboat chaos, aeroplane peril with free-falling! Not Bond enough? Seriously? While it's also great to see Bond active on a motorcycle again.\r\n\r\nThe Casino Royale rebooted and re-suited offering was popular because it had an earthy make over, Daniel Craig's Bond is a fallible human being brimming with egotistical ruggedness. It's much of the same here in Quantum, where he is forced to go rouge, something that again has proved to be an itchy narrative thrust with sections of the Bond faithful. Yet as serious as he is, driven by pangs of annoyance, revenge and unanswered questions, Bond does have time to lay out a quip, there is some fun stuff their, honestly, Mother. Personally I enjoy the dark half of this Bond, \"I don't have any friends\", he wouldn't care\", and \"how many is that now?\", these are moments nearly as good as the interwoven opera blood bath and Bond drinking away his demons with 6 high velocity cocktails. Then there is Craig. Ah, Craig, Daniel Craig, again perfect in the tux and kicking arse with streetwise credibility, each scar on his nicely formed body a testament to this new rugged Bond of the people. That he rises above a relatively muddling script is testament to not only his acting ability, but also his new found acceptance in this most iconic of cinematic roles amongst the British institution that is James Bond.\r\n\r\nThe rest of the cast are a mixed bunch, Jeffrey Wright & Giancarlo Giannini are again merely making up the numbers, though the last gets to give Bond one of the film's darkest and cold inducing moments. Judi Dench of course does her usual solid M performance, swearing and growing the balls she hinted at previously, while Olga Kurylenko is very much a sparky Bond girl to savour; even if the sub-plot involving her almost feels like it was shoe-horned into the script as an added extra. Elsewhere there are problems. Casino Royale, had on the surface a weak villain, a man merely playing cards to pay off a more evil source, but he was effective. Sadly here in the Quantam universe the main villain is a hindrance to the picture. Mathieu Amalric's Dominic Greene does a good line in smarmy, but he's so weak the film nearly crumbles under the weight of his banality. The people at the house of Bond need to realise that little fish villains are only OK if we get the big daddy shark showing his/her face later in proceedings, for if this trend continues I fear the franchise could well lose the edge so well built up in Royale, and Gemma Arteton is pretty, but pretty ineffective. The locations are sumptuous, mind, and the sets are Bondian delights, with the title sequence certainly hitting the spot in spite of the quite dreadful Jack Black and Alcia Keys' theme song that accompanies the sequence. A homage to a former great Bond film sequence is respectful but a touch lazy, but QOS still overcomes its failings to be up above many action pictures of the last decade; this in spite of it being very slim line at an hour and 45 in length. Crucially, though, it pulses with Bond aggression and egotistical nous, just as Fleming wanted it. But this only comes out with further viewings...\r\n\r\nSkyfall will be the next venture for Bond, regardless of quality we know that it will fail to appease every Bond fan on the planet. That's just the way it is with the series, so many want so many different things from their Bond. But I feel this is a good period for Bond, they do have the right man wearing the tux and as a character he is well tuned into the times, both politically and cinematically, it's now up to the makers to fuse the two and deliver a film to fully realise the rebooted franchise's potential and maybe, just maybe, win the dissenters' trust. 7/10", "created_at": "2017-02-19T01:00:25.938Z"}, {"movie_id": 10764, "review_id": "58aee6519251410b3b006df0", "author_rating": 7.0, "review_text": "Quantum of Solace had to follow Casino Royale which rebooted the Bond franchise with critics as well as with some of the public with a youthful, angry Bond.\r\n\r\nQuantum of Solace starts 20 minutes after the events of Casino Royale with a fast edited but choppy car chase sequence. This is the first hint that Bond is following the Bourne films as co-editor Richard Pearson previously edited one of the Bourne films. This also highlights director's Marc Forster inexperience in making action films as many of the action sequences are hard to follow because of the way it has been edited.\r\n\r\nThe film was also hampered by the 2008 writer's strike. This meant that film went into production without a full working script which also meant that the director and even Daniel Craig allegedly wrote scenes for the film. It might explain the short running time.\r\n\r\nThe film unveils Quantum as a shady organisation with tentacles everywhere even in the heart of the British security services. The setting in Bolivia with disputes about water gives the film a political edge with a cynical look at corporations making dicey alliances with dictatorships to mutually exploit the people and plunder resources.\r\n\r\nForster gives the film some intriguing set pieces such the opera scene which is the meeting point for Quantum operatives which Bond infiltrates.\r\n\r\nThe short running time means the film is not overblown but with Craig at the helm it is kept lean and mean.", "created_at": "2017-02-23T13:40:33.451Z"}, {"movie_id": 10764, "review_id": "5e9689ef002134001399f235", "author_rating": 7.0, "review_text": "Probably liked this a bit more than the last time I saw this ('08 or '09) but still a sizable step down from Casino Royale, although I do appreciate that this is a direct sequel (whereas it seems most Bond movies are standalone). The plot isn't the best nor is the villain, albeit Mathieu Amalric does have the creep-factor going for him. The action sequences are good but not enough quieter moments.\r\n\r\nPlus, the (kind of) twist at the end regarding Vesper really cheapened that character, having her being duped like that, seems out of character given how perceptive she was with Bond.\r\n\r\nIn any case, still a solid enough movie as a whole and I absolutely love Olga Kuryenko, shame she never really took off. **3.25/5**", "created_at": "2020-04-15T04:13:35.114Z"}, {"movie_id": 10764, "review_id": "60c3d1caaaf89700415d2f84", "author_rating": 6.0, "review_text": "_**Decent Bond flick marred by ridiculous quick-editing**_\r\n\r\nBond seeks justice for the death of his woman in the previous film as well as those responsible for an assassination attempt on M (Judi Dench). The trail leads from mountainous northern Italy to the rooftops of Siena, Italy, to London to Haiti and finally to the secluded desert of Bolivia and Dominic Greene (Mathieu Amalric), a world-renowned developer of green technology. Greene is intent on securing a barren area of Bolivia in exchange for assisting General Medrano stage a coup there (Joaquín Cosio). Since the CIA looks the other way, only 007 stands in Greene's way with assistance from a retired spy and two formidable beauties (Olga Kurylenko and Gemma Arterton). M wonders if she can trust Bond or if his need for vengeance has corrupted him.\r\n\r\nReleased in 2008, \"Quantum of Solace\" is the second of five Bond films with Daniel Craig as Agent 007. Craig makes for a unique James Bond and I appreciate the serious vibe of his installments.\r\n\r\nThe problem with \"Quantum of Solace,\" the 23nd Bond film (if you count 1983's non-Eon \"Never Say Never Again\"), is the rapid-fire editing during the action scenes. Take, for instance, the opening chase-sequence that takes place on the tollway that leads through mountain tunnels from Nice through Monte Carlo and down to Portofino in Italy. It's a spectacularly scenic area. Unfortunately you won't see much of it here, just quick flashes; more importantly, you'll hardly understand what's going on due to the moronic fast editing. The camera switches about 3 or 4 times per second! I'm sure the filmmakers think such quick angle changes convey energy, but when it's done this fast all it does is confuse, disorient and ANNOY the viewer. It wouldn't be so bad if this was the only sequence like this but, no, after Bond's initial meeting with M (Judi Dench) there's another ridiculous rapid-fire action scene.\r\n\r\nThe filmmakers need to get a grip that James Bond is not a mindless action hero. He's too smart for that; he's the ultimate 'cool' attitude. Violence for him is an irritation resorted to only when necessary. He exists for the mental play, the checkmate and, later, the martini, shaken, not stirred; the beautiful woman too, of course. The only way the average viewer can successfully make it past the 25-minute mark of \"Quantum of Solace\" and enjoy the movie is if s/he drinks a pot of heavily-caffeinated coffee beforehand. If you do this it's an entertaining Bond picture with some effective sequences, like when Bond and Camille find themselves stuck in the remote desert after surviving a thrilling aerial combat, plus Olga (Camille) and Gemma (Strawberry Fields) are top-of-the-line, but the annoying quick-editing in the action scenes heavily mars the flick and prevents it from being in the top tier of the franchise.\r\n\r\nThe film runs 1 hour, 46 minutes, and was shot in England, Italy, Austria, Spain, Panama (standing in for Haiti), Chili (the Atacama Desert) and Baja California (the last two standing in for Bolivia).\r\n\r\nGRADE: C+/B-", "created_at": "2021-06-11T21:12:42.333Z"}, {"movie_id": 10764, "review_id": "6151c9eeaf95900061a969af", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/quantum-of-solace-spoiler-free-review\r\n\r\n\"Quantum of Solace is one of the biggest disappointments of the respective decade, holding a titanic drop in quality compared to its predecessor. Daniel Craig's dedicated performance isn't enough to save an over-violent James Bond flick, packed with terribly handled action sequences - shaky cam and quick cuts may be the worst technical combo in cinema - and an uninspiring, utterly boring narrative. Both the villain and the new Bond girls return to being easily forgettable cliches. Despite boasting the shortest runtime of the entire franchise, I couldn't wait for this unexpectedly poor sequel to reach its underwhelming ending. A stain that the next installment would fortunately clean…\"\r\n\r\nRating: D", "created_at": "2021-09-27T13:41:02.111Z"}, {"movie_id": 10764, "review_id": "63259cca511d09007f4fd81c", "author_rating": 6.0, "review_text": "Whilst there is certainly loads of action in this rather procedural outing for \"James Bond\" (a rather uncharismatic Daniel Craig) there is a real dearth of a substantial story. Picking up from \"Casino Royale\" (2006), this film sees our super-spy capture elusive \"Mr White\" (Jesper Christiansen) only to have him escape in the most treacherous of fashions - putting all in MI6 at risk. Pretty quickly, \"007\" is on the trail of the ostensibly benign millionaire \"Greene\" (Mathieu Amalric) and as the escapades gather pace we realise that the industrialist has a cunning plan to manipulate a crime consortium of global proportions; to take over the government of Bolivia and to control the ebb and flow of one of that nation's most crucial resources. Thing is, though, that this is all just too weak. The story is just lacklustre and undercooked. The efforts of the baddies - Amalric, Anatole Taubman as henchman \"Elvis\" and a straight-from-central-casting Joaquín Cosio as the scheming \"Gen. Medrano\" just to don't create any sense of menace or peril. Far too much time is spent swinging from scaffolding, or trashing a rather impressive set for a performance of \"Tosca\" rather than creating a solid story with twists and turns. Again, the character of \"M\" (Dame Judi Dench) has much more of a role, and sacrilegious as it may be, she just isn't very good at it. She seemed to be wearing the same clothes for most of her scenes, too! The dialogue is rather dry, no fun innuendo or double-entendre and though quite spunky, Olga Kurylenko is no natural as \"Camille\", a girl with an axe to grind (ideally into the general's skull). It ends a bit like \"Licence to Kill\" (1989) and, indeed, is all just a bit too much of an hybrid of the other films to offer much by way of distinction. Good to see an Aston Martin back on screen, but otherwise this rather curiously titled film offers very little to write home about.", "created_at": "2022-09-17T10:09:14.934Z"}, {"movie_id": 10764, "review_id": "6348ab7705f9cf007de99402", "author_rating": 5.0, "review_text": "I'll make it quick. I watched this movie, and after some while I realised, I had seen this one before.\r\n\r\nIt's so forgettable, you can skip it without loss. Expect disappointment if you do watch it. It's just a run-off-the-mill action flick, basically.", "created_at": "2022-10-14T00:21:11.772Z"}, {"movie_id": 10764, "review_id": "63be6f3aa6e2d20092121868", "author_rating": 1.0, "review_text": "Well, I loved the theme song, I honestly thought it didn't fit well with the Bond franchise (like the theme of The Living Daylights) but over all I really liked it as a rock song.\r\n\r\nAnd Olga Kurylenko I thought was a great Bond girl, plus they brought back Jeffrey Wright as Felix (and it's a reboot so it's OK he has his legs) but it was nice seeing the same person play Felix twice in a row wasn't it?\r\n\r\nBut Q, M, and Moneypenny were conspicuously absent weren't they? The plot was pretty convoluted (even for a Craig Era Bond) the action was super choppy because in 08 we were moving into that choppy means action trope that never should have been, and overall the movie stank.\r\n\r\nPlus, this is the first time we really got to see Craig's Bond who hates being Bond character come front and center and, honestly, that is the worst way to play Bond.", "created_at": "2023-01-11T08:11:38.080Z"}, {"movie_id": 10764, "review_id": "63e72ec912777800895ec862", "author_rating": 8.0, "review_text": "**High expectations harmed Quantum of Solace's reputation from the get-go but considering this film as the end of Casino Royale allows it to shine.**\r\n\r\nMany find Quantum of Solace a disappointing entry in the Daniel Craig Bond era, but I beg to differ. When viewed as a stand-alone film, I can understand frustrations with a meager storyline. But when considered the conclusion of Casino Royale, this movie becomes much better. Casino Royale ends with Bond suffering a significant loss, and Quantum allows him to take revenge. Bond is still grappling with a broken heart and is less interested in the standard Bond romantic escapades than usual. In fact, the main Bond girl of the movie is more of a partner in the film than a romantic prospect. The opening fight sequence, the action, the stunts, and the locations are some of the franchise's best. The expectations following Casino Royale were so high that Quantum of Solace never stood a chance (much like Spectre following Skyfall), but when Quantum is coupled with Casino Royale, more depth and development are added to both films.", "created_at": "2023-02-11T05:59:37.299Z"}, {"movie_id": 10764, "review_id": "643e17d9cb6db50499b09e48", "author_rating": 3.0, "review_text": "Try not to fall asleep while watching this movie.\r\nThis movie is as dull as the title, so it has that going for it. It's \"true\" advertising.\r\nThis one sort of takes over where Casino Royale left off. Bond does more detective work than action in this one.\r\nWell, that's okay. At least we aren't overly depressed. We just fall asleep.\r\n007 wants revenge, and it appears that this movie tries to be an \"anti revenge\" movie, but it flails too much to do that.", "created_at": "2023-04-18T04:08:57.931Z"}, {"movie_id": 10764, "review_id": "58a24ea3925141537f000530", "author_rating": 1.0, "review_text": "**It's a shame that they did this to the Bond films**\r\n\r\nIt's upsetting for Bond fans that Eon productions ran away from the lively, fun formula that sustained the franchise for 40 years. What does it leave us with? Well - this type of Bond film unfortunately. Staggeringly bland and uninteresting.  If we removed the name Bond from the film we would have no idea that we were watching a Bond movie. \r\n\r\nIt is depressing that they flushed 40 years of fun Bond films down the toilet to satiate people who dislike classic Bond adventures. They reached for a wider audience by going all generic action film to the detriment of the Bond legacy.\r\n\r\nWho is this unsophisticated, short, blond man in the suit? Unfortunately, _he could be anyone_ - even you or I. Bond is now a lager chugging everyman. Ian Fleming would be furious.\r\n\r\nNo chance of Craig's Bond wearing  _a strap on plastic seagull hat_ as Connery did in the classic Goldfinger (1964) - they would not dare make the films that fun and entertaining anymore.\r\n\r\nIt's a shame what they did to the Bond films.", "created_at": "2017-02-14T00:26:11.485Z"}, {"movie_id": 10764, "review_id": "58a8ee299251410a0e004a9a", "author_rating": 7.0, "review_text": "If we refused to do business with villains, we'd have almost no one to trade with!\r\n\r\nQuantum of Solace is directed by Marc Forster and written by Paul Haggis, Neil Purvis and Robert Wade, suggested from the stories written by Ian Fleming. It stars Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arteton & Jeffrey Wright. It is the 22nd film of the James Bond series.\r\n\r\nFollowing on straight from Casino Royale, we find James Bond thirsting for revenge on those he believes responsible for Vesper Lynd's death.\r\n\r\nIs Quantum Of Solace a great action film? Yes it surely is, is it however a great James Bond picture? Not quite, apparently, given the often venomous reaction to it from some Bond fan quarters. You wonder if Quantum Of Solace is a victim of Casino Royale's soaring success? A film that even surprised the many Daniel Craig haters. Were these internet warriors preying for a bad Bond film purely to further their argument that Craig should not be Bond? Did QOS give them smug satisfaction? Actually no it didn't, the box office and longevity of professional critiques proves this fact. Further viewings of QOS show it to be very astute in the Bond universe, where much of the charges of it not being fun enough etc just do not stick. As for not being Bondian enough? Opening car chase, a pursuit on foot that ends in a quite exhilarating rope dangle punch up, speedboat chaos, aeroplane peril with free-falling! Not Bond enough? Seriously? While it's also great to see Bond active on a motorcycle again.\r\n\r\nThe Casino Royale rebooted and re-suited offering was popular because it had an earthy make over, Daniel Craig's Bond is a fallible human being brimming with egotistical ruggedness. It's much of the same here in Quantum, where he is forced to go rouge, something that again has proved to be an itchy narrative thrust with sections of the Bond faithful. Yet as serious as he is, driven by pangs of annoyance, revenge and unanswered questions, Bond does have time to lay out a quip, there is some fun stuff their, honestly, Mother. Personally I enjoy the dark half of this Bond, \"I don't have any friends\", he wouldn't care\", and \"how many is that now?\", these are moments nearly as good as the interwoven opera blood bath and Bond drinking away his demons with 6 high velocity cocktails. Then there is Craig. Ah, Craig, Daniel Craig, again perfect in the tux and kicking arse with streetwise credibility, each scar on his nicely formed body a testament to this new rugged Bond of the people. That he rises above a relatively muddling script is testament to not only his acting ability, but also his new found acceptance in this most iconic of cinematic roles amongst the British institution that is James Bond.\r\n\r\nThe rest of the cast are a mixed bunch, Jeffrey Wright & Giancarlo Giannini are again merely making up the numbers, though the last gets to give Bond one of the film's darkest and cold inducing moments. Judi Dench of course does her usual solid M performance, swearing and growing the balls she hinted at previously, while Olga Kurylenko is very much a sparky Bond girl to savour; even if the sub-plot involving her almost feels like it was shoe-horned into the script as an added extra. Elsewhere there are problems. Casino Royale, had on the surface a weak villain, a man merely playing cards to pay off a more evil source, but he was effective. Sadly here in the Quantam universe the main villain is a hindrance to the picture. Mathieu Amalric's Dominic Greene does a good line in smarmy, but he's so weak the film nearly crumbles under the weight of his banality. The people at the house of Bond need to realise that little fish villains are only OK if we get the big daddy shark showing his/her face later in proceedings, for if this trend continues I fear the franchise could well lose the edge so well built up in Royale, and Gemma Arteton is pretty, but pretty ineffective. The locations are sumptuous, mind, and the sets are Bondian delights, with the title sequence certainly hitting the spot in spite of the quite dreadful Jack Black and Alcia Keys' theme song that accompanies the sequence. A homage to a former great Bond film sequence is respectful but a touch lazy, but QOS still overcomes its failings to be up above many action pictures of the last decade; this in spite of it being very slim line at an hour and 45 in length. Crucially, though, it pulses with Bond aggression and egotistical nous, just as Fleming wanted it. But this only comes out with further viewings...\r\n\r\nSkyfall will be the next venture for Bond, regardless of quality we know that it will fail to appease every Bond fan on the planet. That's just the way it is with the series, so many want so many different things from their Bond. But I feel this is a good period for Bond, they do have the right man wearing the tux and as a character he is well tuned into the times, both politically and cinematically, it's now up to the makers to fuse the two and deliver a film to fully realise the rebooted franchise's potential and maybe, just maybe, win the dissenters' trust. 7/10", "created_at": "2017-02-19T01:00:25.938Z"}, {"movie_id": 10764, "review_id": "58aee6519251410b3b006df0", "author_rating": 7.0, "review_text": "Quantum of Solace had to follow Casino Royale which rebooted the Bond franchise with critics as well as with some of the public with a youthful, angry Bond.\r\n\r\nQuantum of Solace starts 20 minutes after the events of Casino Royale with a fast edited but choppy car chase sequence. This is the first hint that Bond is following the Bourne films as co-editor Richard Pearson previously edited one of the Bourne films. This also highlights director's Marc Forster inexperience in making action films as many of the action sequences are hard to follow because of the way it has been edited.\r\n\r\nThe film was also hampered by the 2008 writer's strike. This meant that film went into production without a full working script which also meant that the director and even Daniel Craig allegedly wrote scenes for the film. It might explain the short running time.\r\n\r\nThe film unveils Quantum as a shady organisation with tentacles everywhere even in the heart of the British security services. The setting in Bolivia with disputes about water gives the film a political edge with a cynical look at corporations making dicey alliances with dictatorships to mutually exploit the people and plunder resources.\r\n\r\nForster gives the film some intriguing set pieces such the opera scene which is the meeting point for Quantum operatives which Bond infiltrates.\r\n\r\nThe short running time means the film is not overblown but with Craig at the helm it is kept lean and mean.", "created_at": "2017-02-23T13:40:33.451Z"}, {"movie_id": 10764, "review_id": "5e9689ef002134001399f235", "author_rating": 7.0, "review_text": "Probably liked this a bit more than the last time I saw this ('08 or '09) but still a sizable step down from Casino Royale, although I do appreciate that this is a direct sequel (whereas it seems most Bond movies are standalone). The plot isn't the best nor is the villain, albeit Mathieu Amalric does have the creep-factor going for him. The action sequences are good but not enough quieter moments.\r\n\r\nPlus, the (kind of) twist at the end regarding Vesper really cheapened that character, having her being duped like that, seems out of character given how perceptive she was with Bond.\r\n\r\nIn any case, still a solid enough movie as a whole and I absolutely love Olga Kuryenko, shame she never really took off. **3.25/5**", "created_at": "2020-04-15T04:13:35.114Z"}, {"movie_id": 10764, "review_id": "60c3d1caaaf89700415d2f84", "author_rating": 6.0, "review_text": "_**Decent Bond flick marred by ridiculous quick-editing**_\r\n\r\nBond seeks justice for the death of his woman in the previous film as well as those responsible for an assassination attempt on M (Judi Dench). The trail leads from mountainous northern Italy to the rooftops of Siena, Italy, to London to Haiti and finally to the secluded desert of Bolivia and Dominic Greene (Mathieu Amalric), a world-renowned developer of green technology. Greene is intent on securing a barren area of Bolivia in exchange for assisting General Medrano stage a coup there (Joaquín Cosio). Since the CIA looks the other way, only 007 stands in Greene's way with assistance from a retired spy and two formidable beauties (Olga Kurylenko and Gemma Arterton). M wonders if she can trust Bond or if his need for vengeance has corrupted him.\r\n\r\nReleased in 2008, \"Quantum of Solace\" is the second of five Bond films with Daniel Craig as Agent 007. Craig makes for a unique James Bond and I appreciate the serious vibe of his installments.\r\n\r\nThe problem with \"Quantum of Solace,\" the 23nd Bond film (if you count 1983's non-Eon \"Never Say Never Again\"), is the rapid-fire editing during the action scenes. Take, for instance, the opening chase-sequence that takes place on the tollway that leads through mountain tunnels from Nice through Monte Carlo and down to Portofino in Italy. It's a spectacularly scenic area. Unfortunately you won't see much of it here, just quick flashes; more importantly, you'll hardly understand what's going on due to the moronic fast editing. The camera switches about 3 or 4 times per second! I'm sure the filmmakers think such quick angle changes convey energy, but when it's done this fast all it does is confuse, disorient and ANNOY the viewer. It wouldn't be so bad if this was the only sequence like this but, no, after Bond's initial meeting with M (Judi Dench) there's another ridiculous rapid-fire action scene.\r\n\r\nThe filmmakers need to get a grip that James Bond is not a mindless action hero. He's too smart for that; he's the ultimate 'cool' attitude. Violence for him is an irritation resorted to only when necessary. He exists for the mental play, the checkmate and, later, the martini, shaken, not stirred; the beautiful woman too, of course. The only way the average viewer can successfully make it past the 25-minute mark of \"Quantum of Solace\" and enjoy the movie is if s/he drinks a pot of heavily-caffeinated coffee beforehand. If you do this it's an entertaining Bond picture with some effective sequences, like when Bond and Camille find themselves stuck in the remote desert after surviving a thrilling aerial combat, plus Olga (Camille) and Gemma (Strawberry Fields) are top-of-the-line, but the annoying quick-editing in the action scenes heavily mars the flick and prevents it from being in the top tier of the franchise.\r\n\r\nThe film runs 1 hour, 46 minutes, and was shot in England, Italy, Austria, Spain, Panama (standing in for Haiti), Chili (the Atacama Desert) and Baja California (the last two standing in for Bolivia).\r\n\r\nGRADE: C+/B-", "created_at": "2021-06-11T21:12:42.333Z"}, {"movie_id": 10764, "review_id": "6151c9eeaf95900061a969af", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/quantum-of-solace-spoiler-free-review\r\n\r\n\"Quantum of Solace is one of the biggest disappointments of the respective decade, holding a titanic drop in quality compared to its predecessor. Daniel Craig's dedicated performance isn't enough to save an over-violent James Bond flick, packed with terribly handled action sequences - shaky cam and quick cuts may be the worst technical combo in cinema - and an uninspiring, utterly boring narrative. Both the villain and the new Bond girls return to being easily forgettable cliches. Despite boasting the shortest runtime of the entire franchise, I couldn't wait for this unexpectedly poor sequel to reach its underwhelming ending. A stain that the next installment would fortunately clean…\"\r\n\r\nRating: D", "created_at": "2021-09-27T13:41:02.111Z"}, {"movie_id": 10764, "review_id": "63259cca511d09007f4fd81c", "author_rating": 6.0, "review_text": "Whilst there is certainly loads of action in this rather procedural outing for \"James Bond\" (a rather uncharismatic Daniel Craig) there is a real dearth of a substantial story. Picking up from \"Casino Royale\" (2006), this film sees our super-spy capture elusive \"Mr White\" (Jesper Christiansen) only to have him escape in the most treacherous of fashions - putting all in MI6 at risk. Pretty quickly, \"007\" is on the trail of the ostensibly benign millionaire \"Greene\" (Mathieu Amalric) and as the escapades gather pace we realise that the industrialist has a cunning plan to manipulate a crime consortium of global proportions; to take over the government of Bolivia and to control the ebb and flow of one of that nation's most crucial resources. Thing is, though, that this is all just too weak. The story is just lacklustre and undercooked. The efforts of the baddies - Amalric, Anatole Taubman as henchman \"Elvis\" and a straight-from-central-casting Joaquín Cosio as the scheming \"Gen. Medrano\" just to don't create any sense of menace or peril. Far too much time is spent swinging from scaffolding, or trashing a rather impressive set for a performance of \"Tosca\" rather than creating a solid story with twists and turns. Again, the character of \"M\" (Dame Judi Dench) has much more of a role, and sacrilegious as it may be, she just isn't very good at it. She seemed to be wearing the same clothes for most of her scenes, too! The dialogue is rather dry, no fun innuendo or double-entendre and though quite spunky, Olga Kurylenko is no natural as \"Camille\", a girl with an axe to grind (ideally into the general's skull). It ends a bit like \"Licence to Kill\" (1989) and, indeed, is all just a bit too much of an hybrid of the other films to offer much by way of distinction. Good to see an Aston Martin back on screen, but otherwise this rather curiously titled film offers very little to write home about.", "created_at": "2022-09-17T10:09:14.934Z"}, {"movie_id": 10764, "review_id": "6348ab7705f9cf007de99402", "author_rating": 5.0, "review_text": "I'll make it quick. I watched this movie, and after some while I realised, I had seen this one before.\r\n\r\nIt's so forgettable, you can skip it without loss. Expect disappointment if you do watch it. It's just a run-off-the-mill action flick, basically.", "created_at": "2022-10-14T00:21:11.772Z"}, {"movie_id": 10764, "review_id": "63be6f3aa6e2d20092121868", "author_rating": 1.0, "review_text": "Well, I loved the theme song, I honestly thought it didn't fit well with the Bond franchise (like the theme of The Living Daylights) but over all I really liked it as a rock song.\r\n\r\nAnd Olga Kurylenko I thought was a great Bond girl, plus they brought back Jeffrey Wright as Felix (and it's a reboot so it's OK he has his legs) but it was nice seeing the same person play Felix twice in a row wasn't it?\r\n\r\nBut Q, M, and Moneypenny were conspicuously absent weren't they? The plot was pretty convoluted (even for a Craig Era Bond) the action was super choppy because in 08 we were moving into that choppy means action trope that never should have been, and overall the movie stank.\r\n\r\nPlus, this is the first time we really got to see Craig's Bond who hates being Bond character come front and center and, honestly, that is the worst way to play Bond.", "created_at": "2023-01-11T08:11:38.080Z"}, {"movie_id": 10764, "review_id": "63e72ec912777800895ec862", "author_rating": 8.0, "review_text": "**High expectations harmed Quantum of Solace's reputation from the get-go but considering this film as the end of Casino Royale allows it to shine.**\r\n\r\nMany find Quantum of Solace a disappointing entry in the Daniel Craig Bond era, but I beg to differ. When viewed as a stand-alone film, I can understand frustrations with a meager storyline. But when considered the conclusion of Casino Royale, this movie becomes much better. Casino Royale ends with Bond suffering a significant loss, and Quantum allows him to take revenge. Bond is still grappling with a broken heart and is less interested in the standard Bond romantic escapades than usual. In fact, the main Bond girl of the movie is more of a partner in the film than a romantic prospect. The opening fight sequence, the action, the stunts, and the locations are some of the franchise's best. The expectations following Casino Royale were so high that Quantum of Solace never stood a chance (much like Spectre following Skyfall), but when Quantum is coupled with Casino Royale, more depth and development are added to both films.", "created_at": "2023-02-11T05:59:37.299Z"}, {"movie_id": 10764, "review_id": "643e17d9cb6db50499b09e48", "author_rating": 3.0, "review_text": "Try not to fall asleep while watching this movie.\r\nThis movie is as dull as the title, so it has that going for it. It's \"true\" advertising.\r\nThis one sort of takes over where Casino Royale left off. Bond does more detective work than action in this one.\r\nWell, that's okay. At least we aren't overly depressed. We just fall asleep.\r\n007 wants revenge, and it appears that this movie tries to be an \"anti revenge\" movie, but it flails too much to do that.", "created_at": "2023-04-18T04:08:57.931Z"}, {"movie_id": 10764, "review_id": "58a24ea3925141537f000530", "author_rating": 1.0, "review_text": "**It's a shame that they did this to the Bond films**\r\n\r\nIt's upsetting for Bond fans that Eon productions ran away from the lively, fun formula that sustained the franchise for 40 years. What does it leave us with? Well - this type of Bond film unfortunately. Staggeringly bland and uninteresting.  If we removed the name Bond from the film we would have no idea that we were watching a Bond movie. \r\n\r\nIt is depressing that they flushed 40 years of fun Bond films down the toilet to satiate people who dislike classic Bond adventures. They reached for a wider audience by going all generic action film to the detriment of the Bond legacy.\r\n\r\nWho is this unsophisticated, short, blond man in the suit? Unfortunately, _he could be anyone_ - even you or I. Bond is now a lager chugging everyman. Ian Fleming would be furious.\r\n\r\nNo chance of Craig's Bond wearing  _a strap on plastic seagull hat_ as Connery did in the classic Goldfinger (1964) - they would not dare make the films that fun and entertaining anymore.\r\n\r\nIt's a shame what they did to the Bond films.", "created_at": "2017-02-14T00:26:11.485Z"}, {"movie_id": 10764, "review_id": "58a8ee299251410a0e004a9a", "author_rating": 7.0, "review_text": "If we refused to do business with villains, we'd have almost no one to trade with!\r\n\r\nQuantum of Solace is directed by Marc Forster and written by Paul Haggis, Neil Purvis and Robert Wade, suggested from the stories written by Ian Fleming. It stars Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arteton & Jeffrey Wright. It is the 22nd film of the James Bond series.\r\n\r\nFollowing on straight from Casino Royale, we find James Bond thirsting for revenge on those he believes responsible for Vesper Lynd's death.\r\n\r\nIs Quantum Of Solace a great action film? Yes it surely is, is it however a great James Bond picture? Not quite, apparently, given the often venomous reaction to it from some Bond fan quarters. You wonder if Quantum Of Solace is a victim of Casino Royale's soaring success? A film that even surprised the many Daniel Craig haters. Were these internet warriors preying for a bad Bond film purely to further their argument that Craig should not be Bond? Did QOS give them smug satisfaction? Actually no it didn't, the box office and longevity of professional critiques proves this fact. Further viewings of QOS show it to be very astute in the Bond universe, where much of the charges of it not being fun enough etc just do not stick. As for not being Bondian enough? Opening car chase, a pursuit on foot that ends in a quite exhilarating rope dangle punch up, speedboat chaos, aeroplane peril with free-falling! Not Bond enough? Seriously? While it's also great to see Bond active on a motorcycle again.\r\n\r\nThe Casino Royale rebooted and re-suited offering was popular because it had an earthy make over, Daniel Craig's Bond is a fallible human being brimming with egotistical ruggedness. It's much of the same here in Quantum, where he is forced to go rouge, something that again has proved to be an itchy narrative thrust with sections of the Bond faithful. Yet as serious as he is, driven by pangs of annoyance, revenge and unanswered questions, Bond does have time to lay out a quip, there is some fun stuff their, honestly, Mother. Personally I enjoy the dark half of this Bond, \"I don't have any friends\", he wouldn't care\", and \"how many is that now?\", these are moments nearly as good as the interwoven opera blood bath and Bond drinking away his demons with 6 high velocity cocktails. Then there is Craig. Ah, Craig, Daniel Craig, again perfect in the tux and kicking arse with streetwise credibility, each scar on his nicely formed body a testament to this new rugged Bond of the people. That he rises above a relatively muddling script is testament to not only his acting ability, but also his new found acceptance in this most iconic of cinematic roles amongst the British institution that is James Bond.\r\n\r\nThe rest of the cast are a mixed bunch, Jeffrey Wright & Giancarlo Giannini are again merely making up the numbers, though the last gets to give Bond one of the film's darkest and cold inducing moments. Judi Dench of course does her usual solid M performance, swearing and growing the balls she hinted at previously, while Olga Kurylenko is very much a sparky Bond girl to savour; even if the sub-plot involving her almost feels like it was shoe-horned into the script as an added extra. Elsewhere there are problems. Casino Royale, had on the surface a weak villain, a man merely playing cards to pay off a more evil source, but he was effective. Sadly here in the Quantam universe the main villain is a hindrance to the picture. Mathieu Amalric's Dominic Greene does a good line in smarmy, but he's so weak the film nearly crumbles under the weight of his banality. The people at the house of Bond need to realise that little fish villains are only OK if we get the big daddy shark showing his/her face later in proceedings, for if this trend continues I fear the franchise could well lose the edge so well built up in Royale, and Gemma Arteton is pretty, but pretty ineffective. The locations are sumptuous, mind, and the sets are Bondian delights, with the title sequence certainly hitting the spot in spite of the quite dreadful Jack Black and Alcia Keys' theme song that accompanies the sequence. A homage to a former great Bond film sequence is respectful but a touch lazy, but QOS still overcomes its failings to be up above many action pictures of the last decade; this in spite of it being very slim line at an hour and 45 in length. Crucially, though, it pulses with Bond aggression and egotistical nous, just as Fleming wanted it. But this only comes out with further viewings...\r\n\r\nSkyfall will be the next venture for Bond, regardless of quality we know that it will fail to appease every Bond fan on the planet. That's just the way it is with the series, so many want so many different things from their Bond. But I feel this is a good period for Bond, they do have the right man wearing the tux and as a character he is well tuned into the times, both politically and cinematically, it's now up to the makers to fuse the two and deliver a film to fully realise the rebooted franchise's potential and maybe, just maybe, win the dissenters' trust. 7/10", "created_at": "2017-02-19T01:00:25.938Z"}, {"movie_id": 10764, "review_id": "58aee6519251410b3b006df0", "author_rating": 7.0, "review_text": "Quantum of Solace had to follow Casino Royale which rebooted the Bond franchise with critics as well as with some of the public with a youthful, angry Bond.\r\n\r\nQuantum of Solace starts 20 minutes after the events of Casino Royale with a fast edited but choppy car chase sequence. This is the first hint that Bond is following the Bourne films as co-editor Richard Pearson previously edited one of the Bourne films. This also highlights director's Marc Forster inexperience in making action films as many of the action sequences are hard to follow because of the way it has been edited.\r\n\r\nThe film was also hampered by the 2008 writer's strike. This meant that film went into production without a full working script which also meant that the director and even Daniel Craig allegedly wrote scenes for the film. It might explain the short running time.\r\n\r\nThe film unveils Quantum as a shady organisation with tentacles everywhere even in the heart of the British security services. The setting in Bolivia with disputes about water gives the film a political edge with a cynical look at corporations making dicey alliances with dictatorships to mutually exploit the people and plunder resources.\r\n\r\nForster gives the film some intriguing set pieces such the opera scene which is the meeting point for Quantum operatives which Bond infiltrates.\r\n\r\nThe short running time means the film is not overblown but with Craig at the helm it is kept lean and mean.", "created_at": "2017-02-23T13:40:33.451Z"}, {"movie_id": 10764, "review_id": "5e9689ef002134001399f235", "author_rating": 7.0, "review_text": "Probably liked this a bit more than the last time I saw this ('08 or '09) but still a sizable step down from Casino Royale, although I do appreciate that this is a direct sequel (whereas it seems most Bond movies are standalone). The plot isn't the best nor is the villain, albeit Mathieu Amalric does have the creep-factor going for him. The action sequences are good but not enough quieter moments.\r\n\r\nPlus, the (kind of) twist at the end regarding Vesper really cheapened that character, having her being duped like that, seems out of character given how perceptive she was with Bond.\r\n\r\nIn any case, still a solid enough movie as a whole and I absolutely love Olga Kuryenko, shame she never really took off. **3.25/5**", "created_at": "2020-04-15T04:13:35.114Z"}, {"movie_id": 10764, "review_id": "60c3d1caaaf89700415d2f84", "author_rating": 6.0, "review_text": "_**Decent Bond flick marred by ridiculous quick-editing**_\r\n\r\nBond seeks justice for the death of his woman in the previous film as well as those responsible for an assassination attempt on M (Judi Dench). The trail leads from mountainous northern Italy to the rooftops of Siena, Italy, to London to Haiti and finally to the secluded desert of Bolivia and Dominic Greene (Mathieu Amalric), a world-renowned developer of green technology. Greene is intent on securing a barren area of Bolivia in exchange for assisting General Medrano stage a coup there (Joaquín Cosio). Since the CIA looks the other way, only 007 stands in Greene's way with assistance from a retired spy and two formidable beauties (Olga Kurylenko and Gemma Arterton). M wonders if she can trust Bond or if his need for vengeance has corrupted him.\r\n\r\nReleased in 2008, \"Quantum of Solace\" is the second of five Bond films with Daniel Craig as Agent 007. Craig makes for a unique James Bond and I appreciate the serious vibe of his installments.\r\n\r\nThe problem with \"Quantum of Solace,\" the 23nd Bond film (if you count 1983's non-Eon \"Never Say Never Again\"), is the rapid-fire editing during the action scenes. Take, for instance, the opening chase-sequence that takes place on the tollway that leads through mountain tunnels from Nice through Monte Carlo and down to Portofino in Italy. It's a spectacularly scenic area. Unfortunately you won't see much of it here, just quick flashes; more importantly, you'll hardly understand what's going on due to the moronic fast editing. The camera switches about 3 or 4 times per second! I'm sure the filmmakers think such quick angle changes convey energy, but when it's done this fast all it does is confuse, disorient and ANNOY the viewer. It wouldn't be so bad if this was the only sequence like this but, no, after Bond's initial meeting with M (Judi Dench) there's another ridiculous rapid-fire action scene.\r\n\r\nThe filmmakers need to get a grip that James Bond is not a mindless action hero. He's too smart for that; he's the ultimate 'cool' attitude. Violence for him is an irritation resorted to only when necessary. He exists for the mental play, the checkmate and, later, the martini, shaken, not stirred; the beautiful woman too, of course. The only way the average viewer can successfully make it past the 25-minute mark of \"Quantum of Solace\" and enjoy the movie is if s/he drinks a pot of heavily-caffeinated coffee beforehand. If you do this it's an entertaining Bond picture with some effective sequences, like when Bond and Camille find themselves stuck in the remote desert after surviving a thrilling aerial combat, plus Olga (Camille) and Gemma (Strawberry Fields) are top-of-the-line, but the annoying quick-editing in the action scenes heavily mars the flick and prevents it from being in the top tier of the franchise.\r\n\r\nThe film runs 1 hour, 46 minutes, and was shot in England, Italy, Austria, Spain, Panama (standing in for Haiti), Chili (the Atacama Desert) and Baja California (the last two standing in for Bolivia).\r\n\r\nGRADE: C+/B-", "created_at": "2021-06-11T21:12:42.333Z"}, {"movie_id": 10764, "review_id": "6151c9eeaf95900061a969af", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/quantum-of-solace-spoiler-free-review\r\n\r\n\"Quantum of Solace is one of the biggest disappointments of the respective decade, holding a titanic drop in quality compared to its predecessor. Daniel Craig's dedicated performance isn't enough to save an over-violent James Bond flick, packed with terribly handled action sequences - shaky cam and quick cuts may be the worst technical combo in cinema - and an uninspiring, utterly boring narrative. Both the villain and the new Bond girls return to being easily forgettable cliches. Despite boasting the shortest runtime of the entire franchise, I couldn't wait for this unexpectedly poor sequel to reach its underwhelming ending. A stain that the next installment would fortunately clean…\"\r\n\r\nRating: D", "created_at": "2021-09-27T13:41:02.111Z"}, {"movie_id": 10764, "review_id": "63259cca511d09007f4fd81c", "author_rating": 6.0, "review_text": "Whilst there is certainly loads of action in this rather procedural outing for \"James Bond\" (a rather uncharismatic Daniel Craig) there is a real dearth of a substantial story. Picking up from \"Casino Royale\" (2006), this film sees our super-spy capture elusive \"Mr White\" (Jesper Christiansen) only to have him escape in the most treacherous of fashions - putting all in MI6 at risk. Pretty quickly, \"007\" is on the trail of the ostensibly benign millionaire \"Greene\" (Mathieu Amalric) and as the escapades gather pace we realise that the industrialist has a cunning plan to manipulate a crime consortium of global proportions; to take over the government of Bolivia and to control the ebb and flow of one of that nation's most crucial resources. Thing is, though, that this is all just too weak. The story is just lacklustre and undercooked. The efforts of the baddies - Amalric, Anatole Taubman as henchman \"Elvis\" and a straight-from-central-casting Joaquín Cosio as the scheming \"Gen. Medrano\" just to don't create any sense of menace or peril. Far too much time is spent swinging from scaffolding, or trashing a rather impressive set for a performance of \"Tosca\" rather than creating a solid story with twists and turns. Again, the character of \"M\" (Dame Judi Dench) has much more of a role, and sacrilegious as it may be, she just isn't very good at it. She seemed to be wearing the same clothes for most of her scenes, too! The dialogue is rather dry, no fun innuendo or double-entendre and though quite spunky, Olga Kurylenko is no natural as \"Camille\", a girl with an axe to grind (ideally into the general's skull). It ends a bit like \"Licence to Kill\" (1989) and, indeed, is all just a bit too much of an hybrid of the other films to offer much by way of distinction. Good to see an Aston Martin back on screen, but otherwise this rather curiously titled film offers very little to write home about.", "created_at": "2022-09-17T10:09:14.934Z"}, {"movie_id": 10764, "review_id": "6348ab7705f9cf007de99402", "author_rating": 5.0, "review_text": "I'll make it quick. I watched this movie, and after some while I realised, I had seen this one before.\r\n\r\nIt's so forgettable, you can skip it without loss. Expect disappointment if you do watch it. It's just a run-off-the-mill action flick, basically.", "created_at": "2022-10-14T00:21:11.772Z"}, {"movie_id": 10764, "review_id": "63be6f3aa6e2d20092121868", "author_rating": 1.0, "review_text": "Well, I loved the theme song, I honestly thought it didn't fit well with the Bond franchise (like the theme of The Living Daylights) but over all I really liked it as a rock song.\r\n\r\nAnd Olga Kurylenko I thought was a great Bond girl, plus they brought back Jeffrey Wright as Felix (and it's a reboot so it's OK he has his legs) but it was nice seeing the same person play Felix twice in a row wasn't it?\r\n\r\nBut Q, M, and Moneypenny were conspicuously absent weren't they? The plot was pretty convoluted (even for a Craig Era Bond) the action was super choppy because in 08 we were moving into that choppy means action trope that never should have been, and overall the movie stank.\r\n\r\nPlus, this is the first time we really got to see Craig's Bond who hates being Bond character come front and center and, honestly, that is the worst way to play Bond.", "created_at": "2023-01-11T08:11:38.080Z"}, {"movie_id": 10764, "review_id": "63e72ec912777800895ec862", "author_rating": 8.0, "review_text": "**High expectations harmed Quantum of Solace's reputation from the get-go but considering this film as the end of Casino Royale allows it to shine.**\r\n\r\nMany find Quantum of Solace a disappointing entry in the Daniel Craig Bond era, but I beg to differ. When viewed as a stand-alone film, I can understand frustrations with a meager storyline. But when considered the conclusion of Casino Royale, this movie becomes much better. Casino Royale ends with Bond suffering a significant loss, and Quantum allows him to take revenge. Bond is still grappling with a broken heart and is less interested in the standard Bond romantic escapades than usual. In fact, the main Bond girl of the movie is more of a partner in the film than a romantic prospect. The opening fight sequence, the action, the stunts, and the locations are some of the franchise's best. The expectations following Casino Royale were so high that Quantum of Solace never stood a chance (much like Spectre following Skyfall), but when Quantum is coupled with Casino Royale, more depth and development are added to both films.", "created_at": "2023-02-11T05:59:37.299Z"}, {"movie_id": 10764, "review_id": "643e17d9cb6db50499b09e48", "author_rating": 3.0, "review_text": "Try not to fall asleep while watching this movie.\r\nThis movie is as dull as the title, so it has that going for it. It's \"true\" advertising.\r\nThis one sort of takes over where Casino Royale left off. Bond does more detective work than action in this one.\r\nWell, that's okay. At least we aren't overly depressed. We just fall asleep.\r\n007 wants revenge, and it appears that this movie tries to be an \"anti revenge\" movie, but it flails too much to do that.", "created_at": "2023-04-18T04:08:57.931Z"}]