[{"movie_id": 9791, "review_id": "5570d2fb925141086600311d", "author_rating": 7.0, "review_text": "I need a kid like I need a bad heart. A pretty kid is a ticket to trouble... and I'm too old to ask for that.\r\n\r\nThe prison genre of film has a very chequered history, and the number of films are many, very much so, both good and bad. It has gotten to the stage where in this day and age we yearn and need more from our prison based films, something more substantial away from rape and violence, away from father figures, or of redemption and friendship bonds. Unfortunately Animal Factory relies on all the clichés of the genre to tell its tale, which is actually at odds with how good a film it is. Deftly performed by the principal cast members, mounted with a keen eye by director Steve Buscemi, and played with an authentic vibe that lures you in and keeps you hooked, but there is unfortunately nothing remotely new here. However, if you are not over familiar with the prison based arc of cinema? Then this delivers rewards, and such is the quality of production, it doesn't deserve to be marked down. 7/10", "created_at": "2015-06-04T22:36:43.948Z"}, {"movie_id": 9791, "review_id": "637caa3d07faa200e3e67ca8", "author_rating": 6.0, "review_text": "Edward Furlong (\"Ron\") gets a bit more than he bargained for when his ostensibly routine drugs bust turns into allegations of dealing and a five year stretch in the federal prison. Young, green, and totally ill-equipped for his new environment, he is bound to be \"popular\" with his fellow inmates... Fortunately, the experienced and disillusioned \"Earl\" (Willem Dafoe) takes pity on him, and with his protection the young man finds prison life a little more bearable until, he hopes, he can convince a judge that he is worthy of parole. I am afraid we have all seen this before and this iteration is no great shakes. The unremarkable supporting cast deliver the standard mix of recalcitrant characters with depictions of the usual issues of incarcerated racism, bigotry, homophobia - all topped off with a rather weak conclusion that was all just a bit too convenient for all concerned. At ninety minutes, it felt longer and neither the acting nor the dialogue do much to liven the thing up from it's rather ponderous pace nor to really authenticate the scenario. Steve Buscemi directed it, let's hope his next effort is less derivative.", "created_at": "2022-11-22T10:53:49.584Z"}]