[{"movie_id": 372226, "review_id": "56b9caa5c3a3681e5d002186", "author_rating": 8.0, "review_text": "Visaaranai is an uncompromising, hard-hitting and spine-chilling account of abuse of power. When the film begins, we see Pandi (an effective Dinesh), a migrant in Andhra Pradesh, leaving the park where he and his friends have been spending the nights (it is their way of saving the money that they might have to spend on a residence) in the wee hours of the morning and rushing to open the provisional store where he works. It is still not dawn yet but the store's owner is slightly miffed that Pandi is late. A group of men come to the shop asking for an address, but Pandi makes them out as cops from Tamil Nadu and tries to distance himself from whatever their agenda is. The group moves on and moments later, a man comes and asks him if his name is Pandi. The instant he replies yes, the man catches Pandi by the scruff of his neck and forces him into a waiting vehicle, where his friends are helplessly sitting and signalling him not to do anything silly because the men in the vehicle are cops. They are taken to the police station where, all of a sudden, the cops start beating them without bothering to ask them anything. \r\n\r\nAll this happens in the first ten minutes of the film and we are as clueless as the group of friends as to why they are being treated this way. Pandi thinks they are in trouble because he had, during the previous night, in a foolhardy manner shouted out in public to the girl whom he is in love with (Anandhi in a cameo) — a domestic help in the house of a cop — that he will help her get away from her employer. But then they stumble upon another friend, who tells that he was returning to their place in the night after watching a movie when he was caught by the cops, who mercilessly beat him and asked him to confess to stealing from a house. It is only then that they realise that they have gotten into a sticky situation. The beatings and torture continue, but a resolute Pandi forces them to not accept the charge as they had committed no wrong. But the cops, who are under pressure as the robbery happened at the house of a relative of a higher official, are eager to \"close the case\" — because closing a case is easier and convenient than actually solving it — by making Pandi and his friends accept to the crime. And the unfortunate group, which gets a ray of hope when they manage to get out of their situation — thanks to Muthuvel (Samuthirakani, solid as ever) the Tamil Nadu cop whom Pandi had encountered in his shop, who uses them to nab KK (Kishore), a white collar criminal with political connections — but only end up entrapped in a far more sinister situation from where there is no escape.\r\n\r\nBased on M Chandrakumar's novel Lock Up, Visaaranai unfolds as two neatly divided halves, and as we saw in Vetri Maaran's Polladhavan and Aadukalam, there is a substitution of antagonists in the second half. In fact, for while in the second half, we feel as if we have moved into a different film when the sub-plot involving KK unfolds. Our protagonist almost fade into the background, popping up now and then to remind us their ordeal might still not be completely over. KK is perhaps the most poignant character in a film that is filled with tragic characters and Kishore, who plays this character with such understatement that he makes us care for him even when we know that he is going to get our protagonists into deeper trouble. He knows the game he is playing and is very well aware they both he and Muthuvel are mere pawns in the game, a fact that he points out to the other as well. And yet, when he realises that he has been condemned by his own 'friends', he still finds that shocking. And it is a shock for us as well, as until then, this character seems to exist mainly to show us the contrast in which the underprivileged are treated compared to those who are rich and close to the powerful.\r\n\r\nWhat is scary is the randomness with which Pandi and his friends get into situations that threaten their very existence and it sends a chill down our spine. Just like how they ended up at the mercy of cops in AP, who caught them out of the blue, they become victims in a game played by individuals who have been exploiting the system for their personal gains in an all-too sudden manner.\r\n\r\nThe first half could easily have become the sort of tragedy that we see in Bala's films. We have underprivileged protagonists who have to endure torture at the hands of a caricaturish villain (Ajay Ghosh, who plays the ruthless inspector with glee). Characters get beaten to within an inch of their life. There is even some black humour (the cop offering prasadam to Pandi and his friends before beating the hell out of them). But there is also restraint in the filmmaking (another filmmaker would have shown us a scene of Pandi's girlfriend being sexually abused by her employer, but here, this information is delivered to us with the same force through a single effective line, even GV Prakash's score is largely discreet) and a context to the actions. We see how those in power can threaten those below them when Pandi's employer pleads with him to accept to the crime as he has been warned that he, too, might get into trouble.\r\n\r\nBut it is the terrific second half, which could easily have merely stopped with being an edge-of-the-seat thriller, that gives the film its moral weight. Vetri Maaran forces us to analyse the actions of the characters, question the unfairness of it all and feel angry with the way the system works. His cops are the exact opposite of the cops we find in the films of Gautham Menon — self-preserving individuals who have been hardened by the system and have realised that the only way to survive is to play the system to their advantage. Like the low-ranking cop (a superb E Ramadas), who breaks into a mini lecture about the value of human life only to suggest how they could get out of a potential mess by murdering a few lives. We see these men stage a suicide and shootings in cold-blooded fashion and with hardly any guilty that we instantly realise the fate that is in store for a 'decent' cop like Muthuvel, who wants to maintain his integrity in a world where there is no place for that trait. When the screen fades to black in the end, we feel as if it is we who have been shot at point-blank range and that is Vetri Maaran's success.", "created_at": "2016-02-09T11:16:53.085Z"}, {"movie_id": 372226, "review_id": "571cdf2a92514135ff0049c7", "author_rating": 9.0, "review_text": "> The dark side of the Indian police force.\r\n\r\nAnother sensational movie from Dhanush K. Raja, the producer of 'The Crow's Egg' that I recently reviewed in this site. This time he joined the hands with the writer, director who bought him a best actor award at the Indian Academy Award for the movie 'Playground'. The film was based on the novel 'Lock Up' that loosely inspired by the experiences of the author who is an autorickshaw driver now.\r\n\r\nI already mentioned that Indian cinema is waking up, knocking the doors of the international film critics, films festivals and film buffs. Thanks to the young generation in the film industry, looking for the international market expansion. It's time for you to check it out some of the Indian parallel cinemas, not the masala films. If you think you're totally in an unfamiliar territory, then it will be good to you start with this one.\r\n\r\nIndia is like the European Union, where each nation speaks a different language and its own culture, likewise each Indian state has a different language and culture. That's why it might be called the Indian subcontinent. This story begins when three Tamil labourers who are illegally living in a city park to save rent money from the work in the neighbor state Andhra, will be taken to the police custody without letting know them the reason. The rest of the film exposes the law enforcement agency's brutality on these young innocent men to force to accept a crime that is not committed by them which is a violation of human rights.\r\n\r\n> \"The influence is more important than skill when it comes to promotions.\"\r\n\r\nThe film has two phases and they were not focused on any particular characters. It is a couple of different events based flick that connected to each other by the characters. But everything is about corruption in the police force and common people who affected by that. Kind of unpredictable scenes with the decent twists. The first half takes place in Andhra Pradesh with the backdrop of some robbery case and then in the next half it moves to Tamil Nadu with once again a cop tale, but different scenario.\r\n\r\nWelcome to the Indian police's torture chamber. The dark side of the Indian police force. Not all about the bad cops, but also involves those honest ones caught between dishonest ones from the higher power. There was a small romance plot in the opening, later it vanished when entire story focus shifted to police interrogation. The pace had many up and down, that helped to turn things around like transforming from one state of condition to another.\r\n\r\nThis theme was exactly opposite to the old saying 'lightning never strikes the same place twice'. You can call it a bad luck, but for some people like the youngsters from this movie who came from the poor families from the rural without proper education, it is a matter of life and death and injustice. I won't be surprised if international remake are made. It won this year's Indian Academy Awards in the three categories including the supporting actor which was one of the important cop roles.\r\n\r\nThis is a Kollywood film, but watching it feels like a some dark tone Korean crime-drama-thriller. I have seen some of Indian cop films, but so far this one was the best when it comes to the realism yet not depicted them in a good way. I highly recommend it, but don't expect a genuine screenplay with a grand twist. It makes you feel how the innocence was taken away from the poor by the people with power, really heartbreaking.\r\n\r\n9/10", "created_at": "2016-04-24T14:58:50.023Z"}]