[{"movie_id": 19908, "review_id": "52945afd760ee305d8027f7a", "author_rating": 5.0, "review_text": "Fun, not that fun to have a higher mark than a 5/10.", "created_at": "2013-11-26T08:25:33.293Z"}, {"movie_id": 19908, "review_id": "5db4385625a5360018e33363", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI haven't seen Zombieland in quite a few years, but with its sequel being released this week, now it's the perfect moment to go back to the hilarious world of zombies. It still holds up incredibly well. In a time where zombie films and TV shows were starting to come up (The Walking Dead premiered one year later), this post-apocalyptic zombie comedy flick still remains as one of the best zombie movies of the century. Their use quickly became something cliche, and neither funny or scary. Nowadays, people are used to seeing the living dead on the screen all the time, so why does a 2009's film like this still work?\r\n\r\nWell, first of all, the outstanding cast is halfway through success. In 2009, only Woody Harrelson was already a renowned adult actor. Emma Stone and Jesse Eisenberg didn't star in anything truly remarkable yet, so much that Abigail Breslin was more recognizable than them. Even with only 13-years-old, she already had an Oscar nomination in a supporting role (Little Miss Sunshine). However, everyone delivers fantastic performances, which carry the simplistic yet entertaining story to such a success that it became a zombie classic.\r\n\r\nHarrelson portraying Tallahassee, the guy who's not scared of anything and likes to \"enjoy the little things\", is one of his career's coolest roles. Eisenberg is not exactly the type of actor I like since he can only do so much with his acting abilities. He always offers the same type of character: a quirky, twitch-full, idiosyncratic personality, which most of the times doesn't work. Contrary to this tendency, Columbus is a character that logically and hilariously fits this model, hence Eisenberg is the movie's primary source of comedy. From his list of rules to his weird behavior, everything feels natural since the character's background justifies his awkward self.\r\n\r\nStone and Breslin share great moments together, as well as Harrelson and Eisenberg, but the former duo has less exciting sequences. Nevertheless, even though the girls could have received more character development, their relationship gives them a compelling reason for us to care about. Wichita might just look like the cliche hot girl who falls for the good guy, but she would do anything to protect her sister, and her love for Little Rock does give her some gravitas. The cast's chemistry is undeniably astonishing. It's visually palpable that they had tons of fun doing this film, and that elevates every single conversation or action scene.\r\n\r\nThe short runtime allows for a fast-paced story, packed with fun moments, and a lot of bloody zombie killings. The production design is remarkable. Excellent use of practical effects and real sets, plus a perfect soundtrack. Ruben Fleischer knew precisely what he wanted the movie to be, and he never tried to make it something more. Yes, it still involves a romance of sorts, and some backstories might not be funny or joyful. However, it never feels forced or fabricated. It never overextends its stay because Zombieland is neither a romance or a drama. It's purposefully campy, plays with stereotypes creatively, and it's merely 88 minutes of good fun. We are in 2019, and studios forgot how to make films like this!\r\n\r\nEvery year, there are dozens of blockbusters that would be extremely entertaining if studios would just let them be what they are meant to, but no. They need to have some relevant story that carries a political tone or a social message. Zombieland has all the attributes of a pure blockbuster: a phenomenal cast, a straightforward narrative packed with thrilling sequences, a short runtime with fast pacing, compelling characters, and thousands of zombies. Put together a funny screenplay filled with chuckle-worthy jokes, and you have yourself one of the best zombie movies of the century. It's one of those films which don't exactly have what people address as \"flaws\". Zombieland has its cliches and lazy exposition, but it heavily compensates them with 80 minutes or so of spectacular entertainment. It's a zombie cult classic. Nut up or shut up, but watch the goddamn movie!\r\n\r\nRating: A-", "created_at": "2019-10-26T12:13:10.933Z"}, {"movie_id": 19908, "review_id": "63097c10e18b97007bda9ea9", "author_rating": 8.0, "review_text": "**Zombieland is a hilarious treat for comedy and zombie fans alike.**\r\n\r\nZombieland is a goofy spin on the hordes of zombie movies that came as a result of The Walking Dead’s popularity. It follows a zany cast of characters with big personalities thrust into a post-apocalyptic landscape. However, rather than living in constant fear and survival, it feels as if the characters consider it all another Tuesday. Their motivations are finding twinkies or love rather than escaping death. This tonal twist leads to a very entertaining, self-aware plot that takes funny jabs at traditional zombie tropes. The cast nails this tone as well, with Harrelson, Eisenberg, and Stone all delivering sarcastic yet genuine and caring performances.", "created_at": "2022-08-27T02:06:08.662Z"}]