[{"movie_id": 818397, "review_id": "626cb799d7107e0050a2fc39", "author_rating": 3.0, "review_text": "_Memory_ juggles so many subplots to unsatisfactory results. It’s as if the story throws a ball in the air for every concept in the film (Alzheimer’s, human trafficking, the FBI vs the police, rich people getting whatever they want, etc) only to allow each ball to smack against the ground without trying to catch them after their initial toss. For a film about a guy who kills people with the authorities chasing him for nearly two hours, _Memory_ is a monotonous bore. Not even Liam Neeson lighting himself on fire to cauterize a bullet wound can save what is otherwise a forgetful and fatigued memoir of a hoary hit man.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Memory-2022-Review-A-Forgetful-and-Fatigued-Memoir-of-a-Hoary-Hit-Man", "created_at": "2022-04-30T04:14:17.762Z"}, {"movie_id": 818397, "review_id": "641e232bc613ce00bdcd9909", "author_rating": 5.0, "review_text": "**Memory isn't terrible, but it's a little too slow for an action thriller and isn't edgy enough for a crime thriller. Sadly, Memory is forgettable.**\r\n\r\nI'm a big Liam Neeson fan. He trained Batman and Obi-Wan, led the A-Team and the Men in Black, and had the most intimidating and awesome phone call in cinematic history. Non-Stop, The Commuter, and The Grey were all solid films, too, but let's face it… he isn't getting any younger, so his action movies are slowing in pace. Memory was smart enough to incorporate that into the script while still having Neeson kick some butt. This movie is an improvement over some of his recent stuff like the Marksman (and, from what I hear, Blacklight), but I sure do miss the days of Taken or Kingdom of Heaven. My hopes were higher with Martin Campbell directing, but I spent most of the movie looking at my phone. It's not terrible, but it needed to be a little darker and more menacing to hold my attention. In the end, you won't care to remember much about Memory. Neeson is still the man, though!", "created_at": "2023-03-24T22:24:44.008Z"}]