[{"movie_id": 284564, "review_id": "5831940692514162c6024de4", "author_rating": 5.0, "review_text": "_31_ was made very quickly on a shoestring budget, and it shows in Rob Zombie's worst film to date.\r\n\r\nBizarrely though, it also features what might just be the best performance of Richard Brake's career. And that is no small feat, the man is a proven talent.\r\n\r\nStill probably skippable for the moviegoing community at large, but worth the time of a hardcore devotee.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-11-20T12:16:06.545Z"}, {"movie_id": 284564, "review_id": "5831941292514162c0023aa1", "author_rating": 5.0, "review_text": "_31_ was made very quickly on a shoestring budget, and it shows in Rob Zombie's worst film to date.\r\n\r\nBizarrely though, it also features what might just be the best performance of Richard Brake's career. And that is no small feat, the man is a proven talent.\r\n\r\nStill probably skippable for the moviegoing community at large, but worth the time of a hardcore devotee.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-11-20T12:16:18.362Z"}, {"movie_id": 284564, "review_id": "587318a19251410e71006075", "author_rating": 7.0, "review_text": "By this point in his career, there's not much mystery left to Zombie. From his days of White Zombie to his latest musical outpourings and films, he's made his desire to have fun and his love for the grittier horror of the past well known. Zombie fans know this. We go into each new project knowing there's little chance of being surprised but hoping that it's going to be a hell of a ride of full of homages. \r\n\r\n<i>31</i> is no exception. The film opens with a scratchy, shaky cam and proceeds to introduce us to a lot of the same cast we've seen before playing the same trashy and foul-mouthed character types we've seen before. The acting is intentionally full of cheese and the setting is once again his favourite decade. If you didn't enjoy <i>House of 1000 Corpses</i>, <i>The Devil's Rejects</i>, or <i>The Lords of Salem</i>, there's little chance that <i>31</i> will be your cup of tea. \r\n\r\nOn one hand, I'm not disappointed. <i>31</i> is pretty much exactly what I expected it to be. On the other hand, it's clear that Zombie is capable of doing something more unique and at this point it really feels like it's time for him to -- for at least one film -- take his horror a different direction. Sure, I'm tired of the boring cleancut CGI films of the mainstream, but if anyone can make one of these that is truly gorey and scary, Zombie's the guy. I'm not saying he should stop doing what's fun for him, but some variety would be nice.\r\n\r\nQuick notes:\r\n<br>- Richard Brake (Doom-Head) was perfection.\r\n<br>- Malcolm McDowell was underused.\r\n<br>- Sherri Moon Zombie wasn't the best casting choice for Charly, though I'd love to have her kicking ass here in a different capacity. \r\n<br>- Zombie really should make a full release of <i>Werewolf Women of the SS</i>.", "created_at": "2017-01-09T04:59:13.266Z"}]