[{"movie_id": 76341, "review_id": "55660928c3a3687ad7001db1", "author_rating": null, "review_text": "Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.", "created_at": "2015-05-27T18:12:56.152Z"}, {"movie_id": 76341, "review_id": "55732a53925141456e000639", "author_rating": 7.0, "review_text": "Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.", "created_at": "2015-06-06T17:13:55.642Z"}, {"movie_id": 76341, "review_id": "55edd26792514106d600e380", "author_rating": null, "review_text": "Awesome movie!  WITNESS ME will stick with me forever!", "created_at": "2015-09-07T18:07:35.289Z"}, {"movie_id": 76341, "review_id": "5654a732c3a368176600023d", "author_rating": 9.0, "review_text": "Fantastic action that makes up for some plot holes.", "created_at": "2015-11-24T18:06:42.421Z"}, {"movie_id": 76341, "review_id": "57162d35c3a3682f450038b2", "author_rating": null, "review_text": "Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.", "created_at": "2016-04-19T13:05:57.764Z"}, {"movie_id": 76341, "review_id": "5990b254925141675f0322f9", "author_rating": 10.0, "review_text": "I was never a fan of the original Mad Max films but this one just blew me away. There was something so powerfully visceral about this on the big screen. It was a fun on assault on the sense , in a good way. Its spectacle rather than plot driven so may not fare as well on the smaller screen. Watch on the largest possible tv in a darkened room with the phone and other gadgets off. Crank up the volume.", "created_at": "2017-08-13T20:11:00.604Z"}, {"movie_id": 76341, "review_id": "5a64efea0e0a2619f802ac7c", "author_rating": 7.0, "review_text": "I would say that this movie is pretty much the kind of movie that I expected it to be. That being said I think it was a bit softer than I hoped it to be. I think that, again, the Hollywood plonkers have opted to make a movie that got a more palate rating (to them and their cash registers) than what it should have been. It is not as obvious as with Robocop and a few other movies but the feeling is there.\r\n\r\nIt is still a fairly entertaining movie. It is of course yet another special effects movie and as such it does not disappoint. It differs from a lot of the usual special effects movies in that the effects are pretty down to Earth in a bizarre way. We are not talking about superheroes or near magical technologies here but instead we have a devastated landscape, scrounged together equipment and a totally ludicrous desire to blow up the last remains of human civilisation. The bizarre vehicle designs and the totally ridicules behaviour of a lot of people in this movie is alone worth watching it to be honest.\r\n\r\nAs with the previous Mad Max movies this one stretches the bounds of reality (I hope) when it comes to human behaviour and how they waste the few precious resources, specifically gasoline and bullets, that remains after the apocalypse. It provides some spectacular scenery but it also puts a bit of “what the f…” feeling to it all. Not that this part is not expected from a Mad Max movie though.\r\n\r\nWhat I think was my largest let-down in the movie was the Mad Max character itself. To me he is supposed to be a real bad-ass. In this movie he was not really that impressive. He certainly was far from the original Mad Max character in my opinion and was really overshadowed by the Furiosa character. I could have lived with that if this character would have been really impressive but she was not. She was cool but she was still underwhelming when comparing to anything in the original bad-ass Mad Max universe. I would say that Tina Turner and Mel Gibson still rules!\r\n\r\nStill it is a decent futuristic, apocalyptic action movie, maybe not living up to this old movie geeks expectations, but not at all a wasted movie evening. The sound track of the Blu-ray certainly gave my subwoofer an exercise as well.", "created_at": "2018-01-21T19:54:18.903Z"}, {"movie_id": 76341, "review_id": "5cb08c500e0a2626c8c45b94", "author_rating": 9.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nI’ll keep this’n somewhat brief, because I only saw the movie once and it was a few days ago now. Some time later on though, I will post a spoiler talk that goes into greater depth. For now though, enjoy this spoiler free review of _Mad Max: Fury Road_!\r\n\r\nThe number one complaint I’ve been seeing about _Fury Road_ is that there’s not much of a story. I would respond by saying, there might not be as much story as you could **want**, but there is certainly as much as you could **need**. The plot isn’t deep, or complex, or intricate, or philosophical. but it’s there, and it makes sense. Just last year, _John Wick_ showed us that you can get away with a pretty thin premise, if you work hard enough on building a thick, palpable world. And the world of _Fury Road_ is something else entirely, I can see why people aren’t blown away by the story, but the world is incredible.\r\n\r\nThere has been much discussion as to whether Max himself, or his cohort Furiosa (played by Charlize Theron) is the star of the film. I would argue that neither of them are. Director George Miller is. This is his vision. Warner Brothers took a big risk when they handed a 70 year old man nearly two hundred million dollars to revitalise his franchise which has been dead for 30 years, then get out of the way and let him do his thing. But it paid off. _Fury Road_ is more of an “experience” than most movies are, it just happens to be a great film, too.\r\n\r\nThe stunt work and visual effects deserve praise all to themselves. According to the filmmakers, roughly ten percent of all the effects were done with CGI. The other NINETY are practical, and it oozes with that spectacle. You really can feel the maximum force of the future sitting in that theatre, which is a rare and unexpected pleasure.\r\n\r\nIt’s my highest rated film of 2015 thus far, in fact, it’s one of only five films I’ve given more than 4 stars in the past five years. So please don’t take the recommendation lightly when I ask you all to go out and support this movie. Just make sure you do it in the biggest, best quality cinema you can, because this latest entry to the _Mad Max_ franchise is worth it.\r\n\r\n91%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:02:08.421Z"}, {"movie_id": 76341, "review_id": "5e2541901bf2660014fcc4c8", "author_rating": 2.0, "review_text": "1 Star, solely for the fleeting Presence of the Interceptor. As for the rest, Nothing to do with Mad Max, just a cross country jaunt of constant silly action. \r\nAs a Fan of the Original, Mel Gibson is Mad Max, an there will be no other. I have no idea what was going through anyones mind when they tried to tie this to the Mad Max Franchise, Probably not much. If the movie had just been called Fury Road, left Mad Max out of it, It may have been an interesting movie in its owb right, but I think it would have been laughed at and relegated to the $1.99 bin at your local service station.", "created_at": "2020-01-20T05:58:40.668Z"}, {"movie_id": 76341, "review_id": "5e2f2a45c56d2d00154e5d8d", "author_rating": 10.0, "review_text": "When I saw the reviews for this movie my first thought was \"Every critic has lost their minds... even me.\"\r\n\r\nThe story is about a post-apocalyptic wasteland - the fight for survival has twisted the remnants of mankind, turning most into mad, vicious gangs. In this chaotic world two rebels may be able to restore order while seeking their own forms of redemption: Max, a man who just wants peace after losing his wife and child and Furiosa - who thinks finding her childhood home is the answer.\r\n\r\nWhat a lovely day to be talking about Mad Max: Fury Road, because the trailers and the reviews for this movie have been off the walls mad. I mean five out of five star's! wow, just wow. The last Mad Max film came out in 1985, so it's a been a long time and so was this movie, as development took a long time. So I was curious and a bit shady for this movie, by seeing if George Miller (The director of the original films) was going to bring to the table. Now after seeing the movie and having a long thought about it, this movie is freaking awesome, no actually this is the best action movie of the year and probably the decade.\r\n\r\nGeorge Miller goes back to his roots and he doesn't disappointment. After all these years later he's still got it. He filmed all the action scenes with care and effort, because most of the action in this movie are mostly practical effects and that right there shows that Miller is going back to old school of action, and it's perfect. You are the man Miller!\r\n\r\nThe movie itself is mad and I do mean freaking insane. There's a guy in this movie who plays a flamethrower electric guitar on top of a speed vehicle and all through out the movie he was rocking it out. I don't know why, but little things like that made this movie so mad that it's enjoyable.\r\n\r\nTom Hardy as Max Rockatansky was good, I mean he wasn't as good as Mel Gibson but I still think he did a great job. Most of the time Max doesn't talk all that much, I mean most of he's lines are \"huh\", or \"Water\", but he has a couple of lines in the movie and it sounded epic all the time.\r\n\r\nCharlize Theron (as Furiosa) is basically the main character and Max is the supporting character. Charlize Theron was like a female version of Max in a way, because her character steels the whole show as her character is a strong female bad-ass that kicks so much ass that it's very rare in action movies today to do that. Now think of all the strong female character's in past action movies, well that's Furiosa right here.\r\n\r\nThe action scenes can be best describe as incredible and freaking crazy. The stunt work used during the movie was f**king amazing. There actually used practical effects mixed with CGI during the action scenes which looked so good and much better than over using effect's to make something look incredible and I know they used some CGI for scenes where it needed it, because it would be too dangerous or impossible to do, but for the most part it's all practical effect's. NOW THIS IS HOW ACTION MOVIES SHOULD BE DONE! THANK YOU MAD MAX: FURY ROAD FOR DOING THIS!!! Okay, I had to get that out there and sorry for shouting.\r\n\r\nImmortan Joe (played by Hugh Keays- Byrne), and yes he was in the first Mad Max movie, but here he plays a different villain this time and a menacing one as well. He was like a mix of Dark Vader and Sweet Tooth from Twisted Metal (Video Game). He was awesome villain that didn't take sh*t from anyone and always looked like he was going to cause a whole lot of trouble every time he's on screen.\r\n\r\nThe cinematography was just beautiful and some of the best looking shoots so far this year. I can't believe I'm saying that for a action movie that's been in development for years and it payed off perfectly. This is very rare for this to happen as a lot of movie franchises that have been in the making for years and years would normally come out to late where every body just lost interest and give up waiting, and the movie itself would turn out not so good, but here is much different. This movie broke new grounds of coming out late but still being a amazing thrill ride.\r\n\r\nThe other women in the movie know as the five wives are not just there to look pretty and be saved by any man, no they kicked ass in the movie and they actually did something. The five wives were strong women and this isn't just a mans movie, I mean most of the movie is the women kicking ass and being awesome. They kick more ass then Max ever did. That's why I got to give this movie praise for that.\r\n\r\nNow for the problems: I tried to look for things that didn't quite work for the movie and to be honest I couldn't find anything that I thought wasn't good. Well there was some slow parts in the movie but the slow parts where the action clams down for now it fills it's time with character development and back story and it worked.\r\n\r\nOverall rating: Forget \"Pitch Perfect 2\", this is the movie you should see at cinema. As a movie reviewer myself who wants action movies to be more then turn your brain off and enjoy whatever slob mess there in front of the screen, but what I want is a movie experience that I can look back on and say \"Now that, was one heck of a movie.\"", "created_at": "2020-01-27T18:21:57.344Z"}, {"movie_id": 76341, "review_id": "5e94e5a2156cc7001a3b6452", "author_rating": 9.0, "review_text": "George Miller brings us the fourth Mad Max film - Ultimate Carmageddon!\r\n\r\nAn apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.\r\n\r\nGeorge Miller directs and co-writes the screenplay with Brendan McCarthy and Nick Lathouris. It stars Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Zoë Kravitz, Josh Helman and Nathan Jones. Music is by Tom Holkenborg and cinematography by John Seale.\r\n\r\nWell it was a long time in the making, but finally a fourth Mad Max movie was made and it proves to be worth the wait. Undeniably light on plot, this essentially is a two hour chase movie played out to an apocalyptic backdrop of green skies, scorched orange and red vistas and the sort of storms that usually only come in nightmares. \r\n\r\nHundreds of crazily designed vehicles do untold damage to each other and to the barely human contingent - both goodies and baddies, the weaponary on show is vast and brutal, while the stunt work is breath taking. There's some narative stabs at redemptive force between Furiosa (Theron excellent) and Max (Hardy rightly restrained), but really this about high octane action and it's absolutely thrilling as Miller's camera work rarely sits still and brings all the carnage vividly to life.\r\n\r\nA petrol head's love poem in live action form and an action junkie's wet dream, Mad Max is back, and this time there's also a glorious female side-kick of considerable tough substance. 9/10", "created_at": "2020-04-13T22:20:18.656Z"}, {"movie_id": 76341, "review_id": "63c5cff7d4fe04008a679e5c", "author_rating": 10.0, "review_text": "**Mad Max: Fury Road’s magnificent effects, editing, cinematography, and directing make it a film unmatched in almost every way.**\r\n\r\nMad Max: Fury Road floods every second of its 2-hour runtime with frenetic chaos, massive practical effects, and unparalleled mastery. George Miller produced an action movie on a scale, unlike anything I have ever seen. The effects were almost all practical, giving the movie a grit and realism that most films never reach due to the overuse of computer-generated effects. The budget for this movie had to be insane because the cost to make all these vehicles and explosions and crashes had to be astronomical! And so worth every penny. This movie is enrapturing and stunning! Mad Max: Fury Road personifies madness from the frantic camerawork to the editing style to Tom Hardy’s wild-eyed performance making this film intense, heart-pounding, and unpredictable. The world-building and screenplay are genius as well. The story doesn’t get caught up in explaining everything but instead throws the audience into the middle of this insane post-apocalyptic world, making them feel the same chaos as the characters on the screen. I could go on and on, but plain and simple - Mad Max: Fury Road is an action masterpiece that is worth seeing over and over again.", "created_at": "2023-01-16T22:30:15.445Z"}, {"movie_id": 76341, "review_id": "55660928c3a3687ad7001db1", "author_rating": null, "review_text": "Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.", "created_at": "2015-05-27T18:12:56.152Z"}, {"movie_id": 76341, "review_id": "55732a53925141456e000639", "author_rating": 7.0, "review_text": "Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.", "created_at": "2015-06-06T17:13:55.642Z"}, {"movie_id": 76341, "review_id": "55edd26792514106d600e380", "author_rating": null, "review_text": "Awesome movie!  WITNESS ME will stick with me forever!", "created_at": "2015-09-07T18:07:35.289Z"}, {"movie_id": 76341, "review_id": "5654a732c3a368176600023d", "author_rating": 9.0, "review_text": "Fantastic action that makes up for some plot holes.", "created_at": "2015-11-24T18:06:42.421Z"}, {"movie_id": 76341, "review_id": "57162d35c3a3682f450038b2", "author_rating": null, "review_text": "Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.", "created_at": "2016-04-19T13:05:57.764Z"}, {"movie_id": 76341, "review_id": "5990b254925141675f0322f9", "author_rating": 10.0, "review_text": "I was never a fan of the original Mad Max films but this one just blew me away. There was something so powerfully visceral about this on the big screen. It was a fun on assault on the sense , in a good way. Its spectacle rather than plot driven so may not fare as well on the smaller screen. Watch on the largest possible tv in a darkened room with the phone and other gadgets off. Crank up the volume.", "created_at": "2017-08-13T20:11:00.604Z"}, {"movie_id": 76341, "review_id": "5a64efea0e0a2619f802ac7c", "author_rating": 7.0, "review_text": "I would say that this movie is pretty much the kind of movie that I expected it to be. That being said I think it was a bit softer than I hoped it to be. I think that, again, the Hollywood plonkers have opted to make a movie that got a more palate rating (to them and their cash registers) than what it should have been. It is not as obvious as with Robocop and a few other movies but the feeling is there.\r\n\r\nIt is still a fairly entertaining movie. It is of course yet another special effects movie and as such it does not disappoint. It differs from a lot of the usual special effects movies in that the effects are pretty down to Earth in a bizarre way. We are not talking about superheroes or near magical technologies here but instead we have a devastated landscape, scrounged together equipment and a totally ludicrous desire to blow up the last remains of human civilisation. The bizarre vehicle designs and the totally ridicules behaviour of a lot of people in this movie is alone worth watching it to be honest.\r\n\r\nAs with the previous Mad Max movies this one stretches the bounds of reality (I hope) when it comes to human behaviour and how they waste the few precious resources, specifically gasoline and bullets, that remains after the apocalypse. It provides some spectacular scenery but it also puts a bit of “what the f…” feeling to it all. Not that this part is not expected from a Mad Max movie though.\r\n\r\nWhat I think was my largest let-down in the movie was the Mad Max character itself. To me he is supposed to be a real bad-ass. In this movie he was not really that impressive. He certainly was far from the original Mad Max character in my opinion and was really overshadowed by the Furiosa character. I could have lived with that if this character would have been really impressive but she was not. She was cool but she was still underwhelming when comparing to anything in the original bad-ass Mad Max universe. I would say that Tina Turner and Mel Gibson still rules!\r\n\r\nStill it is a decent futuristic, apocalyptic action movie, maybe not living up to this old movie geeks expectations, but not at all a wasted movie evening. The sound track of the Blu-ray certainly gave my subwoofer an exercise as well.", "created_at": "2018-01-21T19:54:18.903Z"}, {"movie_id": 76341, "review_id": "5cb08c500e0a2626c8c45b94", "author_rating": 9.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nI’ll keep this’n somewhat brief, because I only saw the movie once and it was a few days ago now. Some time later on though, I will post a spoiler talk that goes into greater depth. For now though, enjoy this spoiler free review of _Mad Max: Fury Road_!\r\n\r\nThe number one complaint I’ve been seeing about _Fury Road_ is that there’s not much of a story. I would respond by saying, there might not be as much story as you could **want**, but there is certainly as much as you could **need**. The plot isn’t deep, or complex, or intricate, or philosophical. but it’s there, and it makes sense. Just last year, _John Wick_ showed us that you can get away with a pretty thin premise, if you work hard enough on building a thick, palpable world. And the world of _Fury Road_ is something else entirely, I can see why people aren’t blown away by the story, but the world is incredible.\r\n\r\nThere has been much discussion as to whether Max himself, or his cohort Furiosa (played by Charlize Theron) is the star of the film. I would argue that neither of them are. Director George Miller is. This is his vision. Warner Brothers took a big risk when they handed a 70 year old man nearly two hundred million dollars to revitalise his franchise which has been dead for 30 years, then get out of the way and let him do his thing. But it paid off. _Fury Road_ is more of an “experience” than most movies are, it just happens to be a great film, too.\r\n\r\nThe stunt work and visual effects deserve praise all to themselves. According to the filmmakers, roughly ten percent of all the effects were done with CGI. The other NINETY are practical, and it oozes with that spectacle. You really can feel the maximum force of the future sitting in that theatre, which is a rare and unexpected pleasure.\r\n\r\nIt’s my highest rated film of 2015 thus far, in fact, it’s one of only five films I’ve given more than 4 stars in the past five years. So please don’t take the recommendation lightly when I ask you all to go out and support this movie. Just make sure you do it in the biggest, best quality cinema you can, because this latest entry to the _Mad Max_ franchise is worth it.\r\n\r\n91%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:02:08.421Z"}, {"movie_id": 76341, "review_id": "5e2541901bf2660014fcc4c8", "author_rating": 2.0, "review_text": "1 Star, solely for the fleeting Presence of the Interceptor. As for the rest, Nothing to do with Mad Max, just a cross country jaunt of constant silly action. \r\nAs a Fan of the Original, Mel Gibson is Mad Max, an there will be no other. I have no idea what was going through anyones mind when they tried to tie this to the Mad Max Franchise, Probably not much. If the movie had just been called Fury Road, left Mad Max out of it, It may have been an interesting movie in its owb right, but I think it would have been laughed at and relegated to the $1.99 bin at your local service station.", "created_at": "2020-01-20T05:58:40.668Z"}, {"movie_id": 76341, "review_id": "5e2f2a45c56d2d00154e5d8d", "author_rating": 10.0, "review_text": "When I saw the reviews for this movie my first thought was \"Every critic has lost their minds... even me.\"\r\n\r\nThe story is about a post-apocalyptic wasteland - the fight for survival has twisted the remnants of mankind, turning most into mad, vicious gangs. In this chaotic world two rebels may be able to restore order while seeking their own forms of redemption: Max, a man who just wants peace after losing his wife and child and Furiosa - who thinks finding her childhood home is the answer.\r\n\r\nWhat a lovely day to be talking about Mad Max: Fury Road, because the trailers and the reviews for this movie have been off the walls mad. I mean five out of five star's! wow, just wow. The last Mad Max film came out in 1985, so it's a been a long time and so was this movie, as development took a long time. So I was curious and a bit shady for this movie, by seeing if George Miller (The director of the original films) was going to bring to the table. Now after seeing the movie and having a long thought about it, this movie is freaking awesome, no actually this is the best action movie of the year and probably the decade.\r\n\r\nGeorge Miller goes back to his roots and he doesn't disappointment. After all these years later he's still got it. He filmed all the action scenes with care and effort, because most of the action in this movie are mostly practical effects and that right there shows that Miller is going back to old school of action, and it's perfect. You are the man Miller!\r\n\r\nThe movie itself is mad and I do mean freaking insane. There's a guy in this movie who plays a flamethrower electric guitar on top of a speed vehicle and all through out the movie he was rocking it out. I don't know why, but little things like that made this movie so mad that it's enjoyable.\r\n\r\nTom Hardy as Max Rockatansky was good, I mean he wasn't as good as Mel Gibson but I still think he did a great job. Most of the time Max doesn't talk all that much, I mean most of he's lines are \"huh\", or \"Water\", but he has a couple of lines in the movie and it sounded epic all the time.\r\n\r\nCharlize Theron (as Furiosa) is basically the main character and Max is the supporting character. Charlize Theron was like a female version of Max in a way, because her character steels the whole show as her character is a strong female bad-ass that kicks so much ass that it's very rare in action movies today to do that. Now think of all the strong female character's in past action movies, well that's Furiosa right here.\r\n\r\nThe action scenes can be best describe as incredible and freaking crazy. The stunt work used during the movie was f**king amazing. There actually used practical effects mixed with CGI during the action scenes which looked so good and much better than over using effect's to make something look incredible and I know they used some CGI for scenes where it needed it, because it would be too dangerous or impossible to do, but for the most part it's all practical effect's. NOW THIS IS HOW ACTION MOVIES SHOULD BE DONE! THANK YOU MAD MAX: FURY ROAD FOR DOING THIS!!! Okay, I had to get that out there and sorry for shouting.\r\n\r\nImmortan Joe (played by Hugh Keays- Byrne), and yes he was in the first Mad Max movie, but here he plays a different villain this time and a menacing one as well. He was like a mix of Dark Vader and Sweet Tooth from Twisted Metal (Video Game). He was awesome villain that didn't take sh*t from anyone and always looked like he was going to cause a whole lot of trouble every time he's on screen.\r\n\r\nThe cinematography was just beautiful and some of the best looking shoots so far this year. I can't believe I'm saying that for a action movie that's been in development for years and it payed off perfectly. This is very rare for this to happen as a lot of movie franchises that have been in the making for years and years would normally come out to late where every body just lost interest and give up waiting, and the movie itself would turn out not so good, but here is much different. This movie broke new grounds of coming out late but still being a amazing thrill ride.\r\n\r\nThe other women in the movie know as the five wives are not just there to look pretty and be saved by any man, no they kicked ass in the movie and they actually did something. The five wives were strong women and this isn't just a mans movie, I mean most of the movie is the women kicking ass and being awesome. They kick more ass then Max ever did. That's why I got to give this movie praise for that.\r\n\r\nNow for the problems: I tried to look for things that didn't quite work for the movie and to be honest I couldn't find anything that I thought wasn't good. Well there was some slow parts in the movie but the slow parts where the action clams down for now it fills it's time with character development and back story and it worked.\r\n\r\nOverall rating: Forget \"Pitch Perfect 2\", this is the movie you should see at cinema. As a movie reviewer myself who wants action movies to be more then turn your brain off and enjoy whatever slob mess there in front of the screen, but what I want is a movie experience that I can look back on and say \"Now that, was one heck of a movie.\"", "created_at": "2020-01-27T18:21:57.344Z"}, {"movie_id": 76341, "review_id": "5e94e5a2156cc7001a3b6452", "author_rating": 9.0, "review_text": "George Miller brings us the fourth Mad Max film - Ultimate Carmageddon!\r\n\r\nAn apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.\r\n\r\nGeorge Miller directs and co-writes the screenplay with Brendan McCarthy and Nick Lathouris. It stars Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Zoë Kravitz, Josh Helman and Nathan Jones. Music is by Tom Holkenborg and cinematography by John Seale.\r\n\r\nWell it was a long time in the making, but finally a fourth Mad Max movie was made and it proves to be worth the wait. Undeniably light on plot, this essentially is a two hour chase movie played out to an apocalyptic backdrop of green skies, scorched orange and red vistas and the sort of storms that usually only come in nightmares. \r\n\r\nHundreds of crazily designed vehicles do untold damage to each other and to the barely human contingent - both goodies and baddies, the weaponary on show is vast and brutal, while the stunt work is breath taking. There's some narative stabs at redemptive force between Furiosa (Theron excellent) and Max (Hardy rightly restrained), but really this about high octane action and it's absolutely thrilling as Miller's camera work rarely sits still and brings all the carnage vividly to life.\r\n\r\nA petrol head's love poem in live action form and an action junkie's wet dream, Mad Max is back, and this time there's also a glorious female side-kick of considerable tough substance. 9/10", "created_at": "2020-04-13T22:20:18.656Z"}, {"movie_id": 76341, "review_id": "63c5cff7d4fe04008a679e5c", "author_rating": 10.0, "review_text": "**Mad Max: Fury Road’s magnificent effects, editing, cinematography, and directing make it a film unmatched in almost every way.**\r\n\r\nMad Max: Fury Road floods every second of its 2-hour runtime with frenetic chaos, massive practical effects, and unparalleled mastery. George Miller produced an action movie on a scale, unlike anything I have ever seen. The effects were almost all practical, giving the movie a grit and realism that most films never reach due to the overuse of computer-generated effects. The budget for this movie had to be insane because the cost to make all these vehicles and explosions and crashes had to be astronomical! And so worth every penny. This movie is enrapturing and stunning! Mad Max: Fury Road personifies madness from the frantic camerawork to the editing style to Tom Hardy’s wild-eyed performance making this film intense, heart-pounding, and unpredictable. The world-building and screenplay are genius as well. The story doesn’t get caught up in explaining everything but instead throws the audience into the middle of this insane post-apocalyptic world, making them feel the same chaos as the characters on the screen. I could go on and on, but plain and simple - Mad Max: Fury Road is an action masterpiece that is worth seeing over and over again.", "created_at": "2023-01-16T22:30:15.445Z"}, {"movie_id": 76341, "review_id": "55660928c3a3687ad7001db1", "author_rating": null, "review_text": "Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.", "created_at": "2015-05-27T18:12:56.152Z"}, {"movie_id": 76341, "review_id": "55732a53925141456e000639", "author_rating": 7.0, "review_text": "Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.", "created_at": "2015-06-06T17:13:55.642Z"}, {"movie_id": 76341, "review_id": "55edd26792514106d600e380", "author_rating": null, "review_text": "Awesome movie!  WITNESS ME will stick with me forever!", "created_at": "2015-09-07T18:07:35.289Z"}, {"movie_id": 76341, "review_id": "5654a732c3a368176600023d", "author_rating": 9.0, "review_text": "Fantastic action that makes up for some plot holes.", "created_at": "2015-11-24T18:06:42.421Z"}, {"movie_id": 76341, "review_id": "57162d35c3a3682f450038b2", "author_rating": null, "review_text": "Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.", "created_at": "2016-04-19T13:05:57.764Z"}, {"movie_id": 76341, "review_id": "5990b254925141675f0322f9", "author_rating": 10.0, "review_text": "I was never a fan of the original Mad Max films but this one just blew me away. There was something so powerfully visceral about this on the big screen. It was a fun on assault on the sense , in a good way. Its spectacle rather than plot driven so may not fare as well on the smaller screen. Watch on the largest possible tv in a darkened room with the phone and other gadgets off. Crank up the volume.", "created_at": "2017-08-13T20:11:00.604Z"}, {"movie_id": 76341, "review_id": "5a64efea0e0a2619f802ac7c", "author_rating": 7.0, "review_text": "I would say that this movie is pretty much the kind of movie that I expected it to be. That being said I think it was a bit softer than I hoped it to be. I think that, again, the Hollywood plonkers have opted to make a movie that got a more palate rating (to them and their cash registers) than what it should have been. It is not as obvious as with Robocop and a few other movies but the feeling is there.\r\n\r\nIt is still a fairly entertaining movie. It is of course yet another special effects movie and as such it does not disappoint. It differs from a lot of the usual special effects movies in that the effects are pretty down to Earth in a bizarre way. We are not talking about superheroes or near magical technologies here but instead we have a devastated landscape, scrounged together equipment and a totally ludicrous desire to blow up the last remains of human civilisation. The bizarre vehicle designs and the totally ridicules behaviour of a lot of people in this movie is alone worth watching it to be honest.\r\n\r\nAs with the previous Mad Max movies this one stretches the bounds of reality (I hope) when it comes to human behaviour and how they waste the few precious resources, specifically gasoline and bullets, that remains after the apocalypse. It provides some spectacular scenery but it also puts a bit of “what the f…” feeling to it all. Not that this part is not expected from a Mad Max movie though.\r\n\r\nWhat I think was my largest let-down in the movie was the Mad Max character itself. To me he is supposed to be a real bad-ass. In this movie he was not really that impressive. He certainly was far from the original Mad Max character in my opinion and was really overshadowed by the Furiosa character. I could have lived with that if this character would have been really impressive but she was not. She was cool but she was still underwhelming when comparing to anything in the original bad-ass Mad Max universe. I would say that Tina Turner and Mel Gibson still rules!\r\n\r\nStill it is a decent futuristic, apocalyptic action movie, maybe not living up to this old movie geeks expectations, but not at all a wasted movie evening. The sound track of the Blu-ray certainly gave my subwoofer an exercise as well.", "created_at": "2018-01-21T19:54:18.903Z"}, {"movie_id": 76341, "review_id": "5cb08c500e0a2626c8c45b94", "author_rating": 9.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nI’ll keep this’n somewhat brief, because I only saw the movie once and it was a few days ago now. Some time later on though, I will post a spoiler talk that goes into greater depth. For now though, enjoy this spoiler free review of _Mad Max: Fury Road_!\r\n\r\nThe number one complaint I’ve been seeing about _Fury Road_ is that there’s not much of a story. I would respond by saying, there might not be as much story as you could **want**, but there is certainly as much as you could **need**. The plot isn’t deep, or complex, or intricate, or philosophical. but it’s there, and it makes sense. Just last year, _John Wick_ showed us that you can get away with a pretty thin premise, if you work hard enough on building a thick, palpable world. And the world of _Fury Road_ is something else entirely, I can see why people aren’t blown away by the story, but the world is incredible.\r\n\r\nThere has been much discussion as to whether Max himself, or his cohort Furiosa (played by Charlize Theron) is the star of the film. I would argue that neither of them are. Director George Miller is. This is his vision. Warner Brothers took a big risk when they handed a 70 year old man nearly two hundred million dollars to revitalise his franchise which has been dead for 30 years, then get out of the way and let him do his thing. But it paid off. _Fury Road_ is more of an “experience” than most movies are, it just happens to be a great film, too.\r\n\r\nThe stunt work and visual effects deserve praise all to themselves. According to the filmmakers, roughly ten percent of all the effects were done with CGI. The other NINETY are practical, and it oozes with that spectacle. You really can feel the maximum force of the future sitting in that theatre, which is a rare and unexpected pleasure.\r\n\r\nIt’s my highest rated film of 2015 thus far, in fact, it’s one of only five films I’ve given more than 4 stars in the past five years. So please don’t take the recommendation lightly when I ask you all to go out and support this movie. Just make sure you do it in the biggest, best quality cinema you can, because this latest entry to the _Mad Max_ franchise is worth it.\r\n\r\n91%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:02:08.421Z"}, {"movie_id": 76341, "review_id": "5e2541901bf2660014fcc4c8", "author_rating": 2.0, "review_text": "1 Star, solely for the fleeting Presence of the Interceptor. As for the rest, Nothing to do with Mad Max, just a cross country jaunt of constant silly action. \r\nAs a Fan of the Original, Mel Gibson is Mad Max, an there will be no other. I have no idea what was going through anyones mind when they tried to tie this to the Mad Max Franchise, Probably not much. If the movie had just been called Fury Road, left Mad Max out of it, It may have been an interesting movie in its owb right, but I think it would have been laughed at and relegated to the $1.99 bin at your local service station.", "created_at": "2020-01-20T05:58:40.668Z"}, {"movie_id": 76341, "review_id": "5e2f2a45c56d2d00154e5d8d", "author_rating": 10.0, "review_text": "When I saw the reviews for this movie my first thought was \"Every critic has lost their minds... even me.\"\r\n\r\nThe story is about a post-apocalyptic wasteland - the fight for survival has twisted the remnants of mankind, turning most into mad, vicious gangs. In this chaotic world two rebels may be able to restore order while seeking their own forms of redemption: Max, a man who just wants peace after losing his wife and child and Furiosa - who thinks finding her childhood home is the answer.\r\n\r\nWhat a lovely day to be talking about Mad Max: Fury Road, because the trailers and the reviews for this movie have been off the walls mad. I mean five out of five star's! wow, just wow. The last Mad Max film came out in 1985, so it's a been a long time and so was this movie, as development took a long time. So I was curious and a bit shady for this movie, by seeing if George Miller (The director of the original films) was going to bring to the table. Now after seeing the movie and having a long thought about it, this movie is freaking awesome, no actually this is the best action movie of the year and probably the decade.\r\n\r\nGeorge Miller goes back to his roots and he doesn't disappointment. After all these years later he's still got it. He filmed all the action scenes with care and effort, because most of the action in this movie are mostly practical effects and that right there shows that Miller is going back to old school of action, and it's perfect. You are the man Miller!\r\n\r\nThe movie itself is mad and I do mean freaking insane. There's a guy in this movie who plays a flamethrower electric guitar on top of a speed vehicle and all through out the movie he was rocking it out. I don't know why, but little things like that made this movie so mad that it's enjoyable.\r\n\r\nTom Hardy as Max Rockatansky was good, I mean he wasn't as good as Mel Gibson but I still think he did a great job. Most of the time Max doesn't talk all that much, I mean most of he's lines are \"huh\", or \"Water\", but he has a couple of lines in the movie and it sounded epic all the time.\r\n\r\nCharlize Theron (as Furiosa) is basically the main character and Max is the supporting character. Charlize Theron was like a female version of Max in a way, because her character steels the whole show as her character is a strong female bad-ass that kicks so much ass that it's very rare in action movies today to do that. Now think of all the strong female character's in past action movies, well that's Furiosa right here.\r\n\r\nThe action scenes can be best describe as incredible and freaking crazy. The stunt work used during the movie was f**king amazing. There actually used practical effects mixed with CGI during the action scenes which looked so good and much better than over using effect's to make something look incredible and I know they used some CGI for scenes where it needed it, because it would be too dangerous or impossible to do, but for the most part it's all practical effect's. NOW THIS IS HOW ACTION MOVIES SHOULD BE DONE! THANK YOU MAD MAX: FURY ROAD FOR DOING THIS!!! Okay, I had to get that out there and sorry for shouting.\r\n\r\nImmortan Joe (played by Hugh Keays- Byrne), and yes he was in the first Mad Max movie, but here he plays a different villain this time and a menacing one as well. He was like a mix of Dark Vader and Sweet Tooth from Twisted Metal (Video Game). He was awesome villain that didn't take sh*t from anyone and always looked like he was going to cause a whole lot of trouble every time he's on screen.\r\n\r\nThe cinematography was just beautiful and some of the best looking shoots so far this year. I can't believe I'm saying that for a action movie that's been in development for years and it payed off perfectly. This is very rare for this to happen as a lot of movie franchises that have been in the making for years and years would normally come out to late where every body just lost interest and give up waiting, and the movie itself would turn out not so good, but here is much different. This movie broke new grounds of coming out late but still being a amazing thrill ride.\r\n\r\nThe other women in the movie know as the five wives are not just there to look pretty and be saved by any man, no they kicked ass in the movie and they actually did something. The five wives were strong women and this isn't just a mans movie, I mean most of the movie is the women kicking ass and being awesome. They kick more ass then Max ever did. That's why I got to give this movie praise for that.\r\n\r\nNow for the problems: I tried to look for things that didn't quite work for the movie and to be honest I couldn't find anything that I thought wasn't good. Well there was some slow parts in the movie but the slow parts where the action clams down for now it fills it's time with character development and back story and it worked.\r\n\r\nOverall rating: Forget \"Pitch Perfect 2\", this is the movie you should see at cinema. As a movie reviewer myself who wants action movies to be more then turn your brain off and enjoy whatever slob mess there in front of the screen, but what I want is a movie experience that I can look back on and say \"Now that, was one heck of a movie.\"", "created_at": "2020-01-27T18:21:57.344Z"}, {"movie_id": 76341, "review_id": "5e94e5a2156cc7001a3b6452", "author_rating": 9.0, "review_text": "George Miller brings us the fourth Mad Max film - Ultimate Carmageddon!\r\n\r\nAn apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.\r\n\r\nGeorge Miller directs and co-writes the screenplay with Brendan McCarthy and Nick Lathouris. It stars Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Zoë Kravitz, Josh Helman and Nathan Jones. Music is by Tom Holkenborg and cinematography by John Seale.\r\n\r\nWell it was a long time in the making, but finally a fourth Mad Max movie was made and it proves to be worth the wait. Undeniably light on plot, this essentially is a two hour chase movie played out to an apocalyptic backdrop of green skies, scorched orange and red vistas and the sort of storms that usually only come in nightmares. \r\n\r\nHundreds of crazily designed vehicles do untold damage to each other and to the barely human contingent - both goodies and baddies, the weaponary on show is vast and brutal, while the stunt work is breath taking. There's some narative stabs at redemptive force between Furiosa (Theron excellent) and Max (Hardy rightly restrained), but really this about high octane action and it's absolutely thrilling as Miller's camera work rarely sits still and brings all the carnage vividly to life.\r\n\r\nA petrol head's love poem in live action form and an action junkie's wet dream, Mad Max is back, and this time there's also a glorious female side-kick of considerable tough substance. 9/10", "created_at": "2020-04-13T22:20:18.656Z"}, {"movie_id": 76341, "review_id": "63c5cff7d4fe04008a679e5c", "author_rating": 10.0, "review_text": "**Mad Max: Fury Road’s magnificent effects, editing, cinematography, and directing make it a film unmatched in almost every way.**\r\n\r\nMad Max: Fury Road floods every second of its 2-hour runtime with frenetic chaos, massive practical effects, and unparalleled mastery. George Miller produced an action movie on a scale, unlike anything I have ever seen. The effects were almost all practical, giving the movie a grit and realism that most films never reach due to the overuse of computer-generated effects. The budget for this movie had to be insane because the cost to make all these vehicles and explosions and crashes had to be astronomical! And so worth every penny. This movie is enrapturing and stunning! Mad Max: Fury Road personifies madness from the frantic camerawork to the editing style to Tom Hardy’s wild-eyed performance making this film intense, heart-pounding, and unpredictable. The world-building and screenplay are genius as well. The story doesn’t get caught up in explaining everything but instead throws the audience into the middle of this insane post-apocalyptic world, making them feel the same chaos as the characters on the screen. I could go on and on, but plain and simple - Mad Max: Fury Road is an action masterpiece that is worth seeing over and over again.", "created_at": "2023-01-16T22:30:15.445Z"}, {"movie_id": 76341, "review_id": "55660928c3a3687ad7001db1", "author_rating": null, "review_text": "Fabulous action movie. Lots of interesting characters. They don't make many movies like this. The whole movie from start to finish was entertaining I'm looking forward to seeing it again. I definitely recommend seeing it.", "created_at": "2015-05-27T18:12:56.152Z"}, {"movie_id": 76341, "review_id": "55732a53925141456e000639", "author_rating": 7.0, "review_text": "Good action movie with a decent script for the genre. The photography is really good too but, in the end, it is quite repeating itself from beginning to end and the stormy OST is exhausting.", "created_at": "2015-06-06T17:13:55.642Z"}, {"movie_id": 76341, "review_id": "55edd26792514106d600e380", "author_rating": null, "review_text": "Awesome movie!  WITNESS ME will stick with me forever!", "created_at": "2015-09-07T18:07:35.289Z"}, {"movie_id": 76341, "review_id": "5654a732c3a368176600023d", "author_rating": 9.0, "review_text": "Fantastic action that makes up for some plot holes.", "created_at": "2015-11-24T18:06:42.421Z"}, {"movie_id": 76341, "review_id": "57162d35c3a3682f450038b2", "author_rating": null, "review_text": "Wonderful action movie. Scenes are unimaginable. Lots of graphics used in this movie. This is totally a very good action movie.", "created_at": "2016-04-19T13:05:57.764Z"}, {"movie_id": 76341, "review_id": "5990b254925141675f0322f9", "author_rating": 10.0, "review_text": "I was never a fan of the original Mad Max films but this one just blew me away. There was something so powerfully visceral about this on the big screen. It was a fun on assault on the sense , in a good way. Its spectacle rather than plot driven so may not fare as well on the smaller screen. Watch on the largest possible tv in a darkened room with the phone and other gadgets off. Crank up the volume.", "created_at": "2017-08-13T20:11:00.604Z"}, {"movie_id": 76341, "review_id": "5a64efea0e0a2619f802ac7c", "author_rating": 7.0, "review_text": "I would say that this movie is pretty much the kind of movie that I expected it to be. That being said I think it was a bit softer than I hoped it to be. I think that, again, the Hollywood plonkers have opted to make a movie that got a more palate rating (to them and their cash registers) than what it should have been. It is not as obvious as with Robocop and a few other movies but the feeling is there.\r\n\r\nIt is still a fairly entertaining movie. It is of course yet another special effects movie and as such it does not disappoint. It differs from a lot of the usual special effects movies in that the effects are pretty down to Earth in a bizarre way. We are not talking about superheroes or near magical technologies here but instead we have a devastated landscape, scrounged together equipment and a totally ludicrous desire to blow up the last remains of human civilisation. The bizarre vehicle designs and the totally ridicules behaviour of a lot of people in this movie is alone worth watching it to be honest.\r\n\r\nAs with the previous Mad Max movies this one stretches the bounds of reality (I hope) when it comes to human behaviour and how they waste the few precious resources, specifically gasoline and bullets, that remains after the apocalypse. It provides some spectacular scenery but it also puts a bit of “what the f…” feeling to it all. Not that this part is not expected from a Mad Max movie though.\r\n\r\nWhat I think was my largest let-down in the movie was the Mad Max character itself. To me he is supposed to be a real bad-ass. In this movie he was not really that impressive. He certainly was far from the original Mad Max character in my opinion and was really overshadowed by the Furiosa character. I could have lived with that if this character would have been really impressive but she was not. She was cool but she was still underwhelming when comparing to anything in the original bad-ass Mad Max universe. I would say that Tina Turner and Mel Gibson still rules!\r\n\r\nStill it is a decent futuristic, apocalyptic action movie, maybe not living up to this old movie geeks expectations, but not at all a wasted movie evening. The sound track of the Blu-ray certainly gave my subwoofer an exercise as well.", "created_at": "2018-01-21T19:54:18.903Z"}, {"movie_id": 76341, "review_id": "5cb08c500e0a2626c8c45b94", "author_rating": 9.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nI’ll keep this’n somewhat brief, because I only saw the movie once and it was a few days ago now. Some time later on though, I will post a spoiler talk that goes into greater depth. For now though, enjoy this spoiler free review of _Mad Max: Fury Road_!\r\n\r\nThe number one complaint I’ve been seeing about _Fury Road_ is that there’s not much of a story. I would respond by saying, there might not be as much story as you could **want**, but there is certainly as much as you could **need**. The plot isn’t deep, or complex, or intricate, or philosophical. but it’s there, and it makes sense. Just last year, _John Wick_ showed us that you can get away with a pretty thin premise, if you work hard enough on building a thick, palpable world. And the world of _Fury Road_ is something else entirely, I can see why people aren’t blown away by the story, but the world is incredible.\r\n\r\nThere has been much discussion as to whether Max himself, or his cohort Furiosa (played by Charlize Theron) is the star of the film. I would argue that neither of them are. Director George Miller is. This is his vision. Warner Brothers took a big risk when they handed a 70 year old man nearly two hundred million dollars to revitalise his franchise which has been dead for 30 years, then get out of the way and let him do his thing. But it paid off. _Fury Road_ is more of an “experience” than most movies are, it just happens to be a great film, too.\r\n\r\nThe stunt work and visual effects deserve praise all to themselves. According to the filmmakers, roughly ten percent of all the effects were done with CGI. The other NINETY are practical, and it oozes with that spectacle. You really can feel the maximum force of the future sitting in that theatre, which is a rare and unexpected pleasure.\r\n\r\nIt’s my highest rated film of 2015 thus far, in fact, it’s one of only five films I’ve given more than 4 stars in the past five years. So please don’t take the recommendation lightly when I ask you all to go out and support this movie. Just make sure you do it in the biggest, best quality cinema you can, because this latest entry to the _Mad Max_ franchise is worth it.\r\n\r\n91%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:02:08.421Z"}, {"movie_id": 76341, "review_id": "5e2541901bf2660014fcc4c8", "author_rating": 2.0, "review_text": "1 Star, solely for the fleeting Presence of the Interceptor. As for the rest, Nothing to do with Mad Max, just a cross country jaunt of constant silly action. \r\nAs a Fan of the Original, Mel Gibson is Mad Max, an there will be no other. I have no idea what was going through anyones mind when they tried to tie this to the Mad Max Franchise, Probably not much. If the movie had just been called Fury Road, left Mad Max out of it, It may have been an interesting movie in its owb right, but I think it would have been laughed at and relegated to the $1.99 bin at your local service station.", "created_at": "2020-01-20T05:58:40.668Z"}, {"movie_id": 76341, "review_id": "5e2f2a45c56d2d00154e5d8d", "author_rating": 10.0, "review_text": "When I saw the reviews for this movie my first thought was \"Every critic has lost their minds... even me.\"\r\n\r\nThe story is about a post-apocalyptic wasteland - the fight for survival has twisted the remnants of mankind, turning most into mad, vicious gangs. In this chaotic world two rebels may be able to restore order while seeking their own forms of redemption: Max, a man who just wants peace after losing his wife and child and Furiosa - who thinks finding her childhood home is the answer.\r\n\r\nWhat a lovely day to be talking about Mad Max: Fury Road, because the trailers and the reviews for this movie have been off the walls mad. I mean five out of five star's! wow, just wow. The last Mad Max film came out in 1985, so it's a been a long time and so was this movie, as development took a long time. So I was curious and a bit shady for this movie, by seeing if George Miller (The director of the original films) was going to bring to the table. Now after seeing the movie and having a long thought about it, this movie is freaking awesome, no actually this is the best action movie of the year and probably the decade.\r\n\r\nGeorge Miller goes back to his roots and he doesn't disappointment. After all these years later he's still got it. He filmed all the action scenes with care and effort, because most of the action in this movie are mostly practical effects and that right there shows that Miller is going back to old school of action, and it's perfect. You are the man Miller!\r\n\r\nThe movie itself is mad and I do mean freaking insane. There's a guy in this movie who plays a flamethrower electric guitar on top of a speed vehicle and all through out the movie he was rocking it out. I don't know why, but little things like that made this movie so mad that it's enjoyable.\r\n\r\nTom Hardy as Max Rockatansky was good, I mean he wasn't as good as Mel Gibson but I still think he did a great job. Most of the time Max doesn't talk all that much, I mean most of he's lines are \"huh\", or \"Water\", but he has a couple of lines in the movie and it sounded epic all the time.\r\n\r\nCharlize Theron (as Furiosa) is basically the main character and Max is the supporting character. Charlize Theron was like a female version of Max in a way, because her character steels the whole show as her character is a strong female bad-ass that kicks so much ass that it's very rare in action movies today to do that. Now think of all the strong female character's in past action movies, well that's Furiosa right here.\r\n\r\nThe action scenes can be best describe as incredible and freaking crazy. The stunt work used during the movie was f**king amazing. There actually used practical effects mixed with CGI during the action scenes which looked so good and much better than over using effect's to make something look incredible and I know they used some CGI for scenes where it needed it, because it would be too dangerous or impossible to do, but for the most part it's all practical effect's. NOW THIS IS HOW ACTION MOVIES SHOULD BE DONE! THANK YOU MAD MAX: FURY ROAD FOR DOING THIS!!! Okay, I had to get that out there and sorry for shouting.\r\n\r\nImmortan Joe (played by Hugh Keays- Byrne), and yes he was in the first Mad Max movie, but here he plays a different villain this time and a menacing one as well. He was like a mix of Dark Vader and Sweet Tooth from Twisted Metal (Video Game). He was awesome villain that didn't take sh*t from anyone and always looked like he was going to cause a whole lot of trouble every time he's on screen.\r\n\r\nThe cinematography was just beautiful and some of the best looking shoots so far this year. I can't believe I'm saying that for a action movie that's been in development for years and it payed off perfectly. This is very rare for this to happen as a lot of movie franchises that have been in the making for years and years would normally come out to late where every body just lost interest and give up waiting, and the movie itself would turn out not so good, but here is much different. This movie broke new grounds of coming out late but still being a amazing thrill ride.\r\n\r\nThe other women in the movie know as the five wives are not just there to look pretty and be saved by any man, no they kicked ass in the movie and they actually did something. The five wives were strong women and this isn't just a mans movie, I mean most of the movie is the women kicking ass and being awesome. They kick more ass then Max ever did. That's why I got to give this movie praise for that.\r\n\r\nNow for the problems: I tried to look for things that didn't quite work for the movie and to be honest I couldn't find anything that I thought wasn't good. Well there was some slow parts in the movie but the slow parts where the action clams down for now it fills it's time with character development and back story and it worked.\r\n\r\nOverall rating: Forget \"Pitch Perfect 2\", this is the movie you should see at cinema. As a movie reviewer myself who wants action movies to be more then turn your brain off and enjoy whatever slob mess there in front of the screen, but what I want is a movie experience that I can look back on and say \"Now that, was one heck of a movie.\"", "created_at": "2020-01-27T18:21:57.344Z"}, {"movie_id": 76341, "review_id": "5e94e5a2156cc7001a3b6452", "author_rating": 9.0, "review_text": "George Miller brings us the fourth Mad Max film - Ultimate Carmageddon!\r\n\r\nAn apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.\r\n\r\nGeorge Miller directs and co-writes the screenplay with Brendan McCarthy and Nick Lathouris. It stars Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Zoë Kravitz, Josh Helman and Nathan Jones. Music is by Tom Holkenborg and cinematography by John Seale.\r\n\r\nWell it was a long time in the making, but finally a fourth Mad Max movie was made and it proves to be worth the wait. Undeniably light on plot, this essentially is a two hour chase movie played out to an apocalyptic backdrop of green skies, scorched orange and red vistas and the sort of storms that usually only come in nightmares. \r\n\r\nHundreds of crazily designed vehicles do untold damage to each other and to the barely human contingent - both goodies and baddies, the weaponary on show is vast and brutal, while the stunt work is breath taking. There's some narative stabs at redemptive force between Furiosa (Theron excellent) and Max (Hardy rightly restrained), but really this about high octane action and it's absolutely thrilling as Miller's camera work rarely sits still and brings all the carnage vividly to life.\r\n\r\nA petrol head's love poem in live action form and an action junkie's wet dream, Mad Max is back, and this time there's also a glorious female side-kick of considerable tough substance. 9/10", "created_at": "2020-04-13T22:20:18.656Z"}, {"movie_id": 76341, "review_id": "63c5cff7d4fe04008a679e5c", "author_rating": 10.0, "review_text": "**Mad Max: Fury Road’s magnificent effects, editing, cinematography, and directing make it a film unmatched in almost every way.**\r\n\r\nMad Max: Fury Road floods every second of its 2-hour runtime with frenetic chaos, massive practical effects, and unparalleled mastery. George Miller produced an action movie on a scale, unlike anything I have ever seen. The effects were almost all practical, giving the movie a grit and realism that most films never reach due to the overuse of computer-generated effects. The budget for this movie had to be insane because the cost to make all these vehicles and explosions and crashes had to be astronomical! And so worth every penny. This movie is enrapturing and stunning! Mad Max: Fury Road personifies madness from the frantic camerawork to the editing style to Tom Hardy’s wild-eyed performance making this film intense, heart-pounding, and unpredictable. The world-building and screenplay are genius as well. The story doesn’t get caught up in explaining everything but instead throws the audience into the middle of this insane post-apocalyptic world, making them feel the same chaos as the characters on the screen. I could go on and on, but plain and simple - Mad Max: Fury Road is an action masterpiece that is worth seeing over and over again.", "created_at": "2023-01-16T22:30:15.445Z"}]