[{"movie_id": 109491, "review_id": "51cd31d419c29516a715a4b9", "author_rating": 3.5, "review_text": "Boring and too cheese.\r\n\r\nThe same way Percy Jackson is a bad copy of Harry Potter, Beautiful creatures is a bad copy of Twilight. The big difference is that Percy Jackson is a bad copy of a good series of novels and movies while Beautiful Creatures is a bad copy of yet another bad series of novels and movies.", "created_at": "2013-06-28T06:48:52.732Z"}, {"movie_id": 109491, "review_id": "5b1d773d0e0a264faf0021af", "author_rating": 4.0, "review_text": "***Too-campy, Christphobic Sothern Gothic fantasy about “casters” aka witches***\r\n\r\nRELEASED IN 2013 and directed by Richard LaGravenese, \"Beautiful Creatures” chronicles events in a small town in rural South Carolina where a college-minded high schooler (Alden Ehrenreich) becomes infatuated by a mysterious new girl (Alice Englert) who recently moved in with her eccentric uncle (Jeremy Irons) at his creepy Antebellum mansion. He learns that they are “casters,” immortals with magical powers; and that an evil relative (Emma Thompson) wants Lena for the darkness.\r\n\r\nThe director wrote the script based on the first of four young adult books of “The Caster Chronicles” by Kami Garcia and Margaret Stohl. Fans of the book, however, say it’s one of the most unfaithful book-to-screen adaptions. Since I’ve never read any of these books this was irrelevant to me.\r\n\r\nThere’s nothing wrong with the production as far as sets, costumes, cast, music goes. It cost $60 million and looks it. The Southern Gothic air is to die for and the first act is intriguing. Unfortunately, the tone is semi-campy where several of the characters are overly cartoonish. It’s reminiscent of comic booky Stephen King flicks (e.g. “Silver Bullet” and “Needful Things”), but a notch or two more exaggerated.\r\n\r\nThe first half is also encumbered by an overtly anti-Christian slant. I don’t have a problem with movies that depict the evils of fundamentalist legalism, like in “The Mist” (2007), but here the stereotypes are so overdone they don’t ring true, not to mention there’s no positive depiction of believers to compare with the negative ones (like in “The Mist”). According to this movie, ALL Christians are hateful, rash, judgmental, condemning bigots. Lazy writers love stereotypes because they don't have to write interesting complex characters.\r\n\r\nTake Lena’s first day at school where two girls automatically assume she’s “satanic” merely because she lives at the eerie plantation; they then proceed to openly pray for her. It’s so overdone, cartoony and eye-rolling it takes the viewer right out of the movie. This doesn’t even reflect reality in the modern world anyway: Even in a backwater town in the USA it’s more likely that a devout Christian would be persecuted by mocking unbelievers and nominal Christians rather than vice versa. Another thoroughly unrealistic element is how all the top community leaders are ee-vil fundies who GO TO THE SAME CHURCH. Why Sure!\r\n\r\nTo be fair, the second half halfheartedly tries to make up for this by briefly revealing a more positive Christian character and having the pastor give a worthy mini-sermon on sacrifice, but it’s too little too late after misrepresenting and offending half of the viewership.\r\n\r\nAnother problem is how the two protagonists suck face too much. The girl’s only 15. I’m not saying mid-teenagers don’t make-out, but (again) it’s so overdone it’s eye-rolling.\r\n\r\nFor a better executed and entertaining fantasy/horror flick based on a young adult book series, check out “Cirque du Freak: The Vampire’s Assistant” (2009).\r\n\r\nTHE MOVIE RUNS 2 hours, 4 minutes and was shot entirely in Louisiana (Covington, Madisonville, Batchelor, St. Francisville and New Orleans).\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2018-06-10T19:08:45.265Z"}, {"movie_id": 109491, "review_id": "644883426a222704a0d12ec3", "author_rating": 6.0, "review_text": "Another love story for a non mortal. It's been done  so much now that it's silly to even watch any more but at least she did do some pretty cool stuff.", "created_at": "2023-04-26T01:49:54.510Z"}]