[{"movie_id": 10756, "review_id": "5f8c8077ecbde9003a747bdb", "author_rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nEddie Murphy is almost always a good watch, even under his horrible Disney contract.\r\n\r\nThe sheer amount of production value in the movie to make the mansion look as good as it does, plus all the ghost effects, is daunting.  The story is good, and the way they go about investigating the mystery is good in the traditional sense: a good cycle of drip fed information, search and discovery.\r\n\r\nThe premise of the haunting itself isn't that interesting, but it is somewhat compelling that it has a \"Beauty and the Beast\" vibe to it, and Terence Stamp does \"creepy old guy\" very well.\r\n\r\nThe kids are fun, and the movie has a certain amount of charm to it, but nothing about the movie really stands out as amazing.", "created_at": "2020-10-18T17:50:47.050Z"}, {"movie_id": 10756, "review_id": "64d3ca7e03726400fffcab50", "author_rating": 6.0, "review_text": "Terence Stamp is the butler \"Ramsley\" at the gothic pile that is the home to \"Gracey\" (Nathaniel Parker). It's to this creepy mansion that estate agent \"Evers\" (Eddie Murphy) is summoned and eyeing a decent commission, he takes his wife \"Sara\" (Marsha Thomason) for a dinner that soon exposes them both to some spooky goings-on. It seems that \"Mrs Gracey\" met with a rather untimely death and \"Mrs Evers\" seems to be lined up to take her place - like it or not! Stamp gets what plaudits this deserves largely for seemingly having a bright light shone in his eyes for most his scenes. Otherwise, it's a pretty lacklustre vehicle for a very mediocre star who has long since lost his lustre, supported by some folks who largely bring very little extra to a party that suffers from quite a paucity of, well, haunting... To add a bit of weight to the storyline, the writers have included a sort of familial neglect angle to the characterisation with \"Evers\" too focused on a successful career and not so attentive on his wife and two rather annoying children. It does all come to an head eventually, with a bit of help from the ethereal \"Madame Leota\" (Jennifer Tilly) and whilst it's entirely forgettable on just about every front, the visuals are quite fun and \"Ramsley\" is possibly the best butler since Tim Curry. It's easy enough to have on the television in the background, but that's about the height of it.", "created_at": "2023-08-09T17:18:54.547Z"}]