[{"movie_id": 522627, "review_id": "5e059b644c1d9a0013dd8813", "author_rating": 6.0, "review_text": "While ‘The Gentlemen’ is a big step forward from Ritchie’s latest films, it’s not the return to form fans may be hoping for. That said, there is still fun to be had here, and it may work better at home than a cinematic experience.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-gentlemen-underwhelming-but-fun-return-to-form-for-guy-ritchie", "created_at": "2019-12-27T05:49:24.410Z"}, {"movie_id": 522627, "review_id": "5e1d348b95c0af00131150b6", "author_rating": 8.0, "review_text": "**_Nothing too unexpected here, but it's funny and hugely entertaining_**\r\n\r\n>_You don't crucify people! Not on Good Friday!_\r\n\r\n- Harold Shand; _The Long Good Friday_ (1980)\r\n\r\nThe Gentlemen is a return to the London gangster milieu where writer/director Guy Ritchie first made his name with films such as _Lock, Stock and Two Smoking Barrels_ (1998) and _snatch._ (2000). His first foray into this territory since the disappointing _RocknRolla_ (2008), _The Gentlemen_ comes at the end of over a decade making big-budget studio-backed crimes against cinema such as _Sherlock Holmes_ (2009), _Sherlo__ck Holmes: A Game of Shadows_ (2011), _The Man from U.N.C.L.E_. (2015), _King Arthur: Legend of the Sword_ (2017), and _Aladdin_ (2019). Granted, the film seems stuck in the last decade in more ways than one, it's highly questionable that the only gay character is a slimy man-whore into S&M, its token female character barely even manages to rise to the level of tokenism, and Ritchie does absolutely nothing new here – if you've seen _Lock, Stock_ or _snatch._, you'll know pretty much exactly what to expect – but _The Gentlemen_ is still hugely entertaining. Most of the jokes land, the dialogue is as sharp and expletive-laden as ever, the cast are having a ball, and the self-reflexivity, although a little forced in places, works well for the most part. And yes, the plot is as derivative as it gets, but there's no denying Ritchie has injected real verve into what looks on paper like an inconsequential C-movie. _The Gentlemen_ definitely won't change your life, but it will make you laugh.\r\n\r\nThe film begins as sleazy private eye Fletcher (Hugh Grant) arrives unannounced at the home of Ray (Charlie Hunnam), right-hand man to Mickey Pearson (Matthew McConaughey), a suave Oxford-educated American ex-pat who controls a huge marijuana empire in London, valued at around £400 million. Several months prior, Fletcher was hired by tabloid editor Big Dave (the great Eddie Marsen) to dig up dirt on Pearson with the aim to ruin him – Dave's revenge for Pearson blanking him at a gala. Fletcher has written a screenplay based on his investigation (titled _Bush_) and tells Ray that unless Pearson pays him £20 million, he will hand over everything he has to Dave. Meanwhile, Pearson has decided to sell his whole operation, but when word gets out, all hell breaks loose, as the various interested parties vie for advantage. Most of the subsequent film takes the form of Fletcher narrating his exploits to Ray, explaining how he learned so much about Pearson and what he does. Along the way, we meet characters such as Rosalind (Michelle Dockery), Pearson's ruthless and unflappable \"_cockney Cleopatra_\" wife, who runs a garage with an all-female staff; Berger (Jeremy Strong), Pearson's preferred buyer; Dry Eye (Henry Golding), the ambitious but brutal scion of a Chinese syndicate, who hopes to undermine Berger; Coach (a scene-stealing Colin Farrell), who runs a boxing gym for troubled youths and who inadvertently finds himself in the middle of everything; a plethora of property-rich-but-cash-poor landed gentry who are essential to Pearson's empire; a Russian oligarch; and a street gang called The Toddlers.\r\n\r\nAesthetically, _The Gentlemen_ is very much in the mould of Ritchie's previous gangster movies. Because Fletcher frames his narration as a screenplay, it allows Ritchie to employ a multitude of self-reflexive devices – a smash cut coinciding with Fletcher asking Ray to visualise a smash cut; voiceover transitioning into spoken dialogue; on-screen captions telling us who's who; animated maps; YouTube fight porn (don't ask); freeze-frames; rewinds; a shot of film running through a projector etc. At one point, Fletcher is discussing the merits of anamorphic (2.39:1) over 1.78:1, and the film's aspect ratio changes accordingly. At another, he's arguing for the merits of 35mm celluloid over digital, saying he likes the grain of celluloid photography, and the film duly switches formats. Such playfulness means that it never for a second takes itself too seriously, with probably the most self-reflexive moment coming towards the end, when we visit Miramax's offices in London (Miramax produced the movie), and we see a poster for Ritchie's _The Man From U.N.C.L.E._. All of this is immensely fun, with the more you know about the mechanics of assembling a film, the more humorously\r\nself-reflexive the film becomes – Fletcher even acknowledges his own role as an unreliable narrator, and a discussion of the importance of sound leads to his dismissal of Francis Ford Coppola's _The Conversation_ (1974) as \"_a bit boring._\"\r\n\r\nIn terms of themes, the most obvious is something Ritchie has examined before – the idea that the economic divide between gangsters and aristocrats masks their practical similarities. Pearson straddles this divide; he's a gangster, but so too is he an aristocrat (in all but name), and the smooth running of his business depends on both classes – the aristocrats who he needs to grow his product (for reasons that constitute a bit of a spoiler, so I'm not going to get into it) and the gangsters who distribute that product. The clash between the pompous insularity of the English upper class and the perceived uncouthness of the lower class has been done to death in both literature (Emily Brontë's _Wuthering Heights_ (1847) springs to mind) and film (Nicolas Roeg and Donald Cammell's _Performance_ (1970), for example), and although Ritchie doesn't say anything even remotely new about it, it still forms an interesting textural background – gentrification is ever present; there are ironic references to the posh areas of Croydon; Ray, a working-class Newcastle native, is a cleanliness freak who eats wagyu steak and lives in a mansion, and when he's dispatched on a mission to an uncivilised working-class area, he explains he \"_just hates them junkies_,\" seeing them as very much his social inferiors.\r\n\r\nOne of the most central scenes sees a group of obnoxious privileged teens holed up in a council flat, whilst on the street below, a gang of machete-wielding delinquents terrorise the neighbourhood. As Ray and his men clash with the gang, there's a real sense of old vs. new – traditional gangsters fighting it out with internet-savvy hoodlums who don't give a damn about tradition or respect. There are a lot of laughs to be had with these issues, such as Ray and Coach having problems pronouncing the name Phuc, or Coach debating with one of his boxers whether it's racist to call someone \"_a black c**t_\", even though they are black and they are a c**t. And again, none of this is presented as even remotely serious.\r\n\r\nThe biggest problems with the film are probably its lack of depth, and the familiarity of the presentation, characters, and _milieu_ – there's nothing here you haven't seen in previous Ritchie films. And as you would expect, there isn't much in the way of emotional maturity or narrative complexity. It's all very surface-level, and it makes no apologies for such.\r\n\r\nNevertheless, I thoroughly enjoyed _The Gentlemen_. It's a funny as hell caper and the actors are clearly having terrific fun. It might be formulaic and overly familiar, but it's also immensely enjoyable.", "created_at": "2020-01-14T03:24:59.244Z"}, {"movie_id": 522627, "review_id": "5e57e78235811d001960e7bd", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nI've always been a fan of Guy Ritchie's style. While I do admit that he tends to overuse his own techniques (like he does in this movie), he always manages to bring something unique to his projects. He delivered a pretty good live-action remake of Aladdin while offering his own take (Jasmine has more compelling motivations). I surprisingly enjoyed King Arthur: Legend Of The Sword, but the ending is disappointing. The Man from U.N.C.L.E. and the Sherlock Holmes films are entertaining and fun, to say the least. So, yes, I was sort of excited to watch The Gentlemen.\r\n\r\nWith such a stellar cast, how can someone not be interested in an old-fashioned crime-thriller? First of all, I want to get this out right away: it's a movie that anyone can enjoy, sure, but for people who know how films usually work, Ritchie applies a storytelling method that's going to make every \"filmmaking nerd\" lose their minds. Hugh Grant (Fletcher) is mostly the narrator of the entire story, and he's basically interpreting a \"version\" of Guy Ritchie telling the story of his own \"flick\".\r\n\r\nThis means Fletcher goes on and on about film specs like aspect ratios and film gauges but also helping the audience understand what's happening, by announcing if the story is near its climax or if \"the plot thickens\". It's a captivating and funny way of using exposition without it being lazy or forced. Grant also makes sure to ask the questions the audience should be asking. This way, even people who don't like to think when they go to the cinema (yes, they exist) will be able to follow the mystery unraveling.\r\n\r\nObviously, the unbelievable cast makes this movie so much fun. Matthew McConaughey is a masterful actor when it comes to carrying long dialogues. Everything he says is always engaging, either by the way he says it, his expressions, or the physical intensity he puts into his own words. Charlie Hunnam (Ray) probably delivers his most amusing performance to date. Ray is definitely going to be a fan-favorite character, and his interactions with Fletcher (with who he spends most of the runtime) are hilarious.\r\n\r\nHenry Golding (Dry Eye), Michelle Dockery (Rosalind Pearson), and Jeremy Strong (Matthew) all give excellent performances, but Colin Farrell is the best of this group of characters as Coach. His scenes are some of the funniest sequences of the entire year so far. From his accent to the action he eventually gets into, he's one of those characters who will leave everyone wanting more. As for the story, it's undoubtedly one of the most complex screenplays I've seen in a while. Comparing with Knives Out, the narrative structure ends up being a bit similar.\r\n\r\nBoth possess tons of twists and turns that will make everyone scratch their heads for quite some time. Both show different events of the story, featuring a specific character at a particular time in a distinct manner (flashback, flashforward, simple exposition). However, The Gentlemen abuses from its own trick a bit too much, especially during the first half. Something entertaining can quickly turn into something pretty annoying if the storytelling isn't well-balanced. Can't have too much of anything, right?\r\n\r\nThis is my overall issue with the film. Guy Ritchie brings something cool and fresh to escape heavy exposition, but it's still a lot of information to transmit, and it doesn't always work smoothly. Some subplots didn't need to go so deep, which takes time away from more emotionally investing storylines. Nevertheless, in the end, Ritchie stitches every story together seamlessly to create a very well-written flick. With so many intricate layers, it's extremely difficult to bring it all together to make a cohesive finale, but Ritchie does it superbly.\r\n\r\nAll in all, The Gentlemen is another hit for Guy Ritchie, and it might even be his best movie yet. With one of the most complex screenplays in a while, the phenomenal cast elevates this crime-thriller into one of the best films of 2020, so far. Matthew McConaughey, Charlie Hunnam, Hugh Grant, and Colin Farrell stand out, but every actor delivers excellent performances. Extremely funny and captivating storytelling through Grant's narration, which ironic or not, it's both the best and worst component of the movie. When used in excess, it can be a bit bothersome and lengthy, but for most of the runtime, this alternative to substantial exposition works brilliantly. Interesting characters, intriguing mystery, and hilarious bits of comedy make this feature very entertaining. Technically, great editing keeps a well-paced flow, but it's Ritchie's layered narrative that steals the show.\r\n\r\nRating: B+", "created_at": "2020-02-27T16:00:02.438Z"}]