[{"movie_id": 340666, "review_id": "581b44679251412808005716", "author_rating": null, "review_text": "We live in a country where our current presidential candidates fail to compare to our current president. We live in a country where minorities have been a subject to police brutality. We live in a country where you must enter debt by taking out a student loan and you are still not guaranteed a successful future. Are you uncomfortable yet? Comfortability won't be found here or in fashion designer turned director Tom Ford's second featured film Nocturnal Animals. The director forces you to become comfortable with being uncomfortable and the result is the most beautiful disturbingly gripping films of 2016.\r\n\r\n\r\n\r\n> From writer/director Tom Ford comes a haunting romantic thriller of shocking intimacy and gripping tension that explores the thin lines between love and cruelty, and revenge and redemption. Academy Award nominees Amy Adams and Jake Gyllenhaal star as a divorced couple discovering dark truths about each other and themselves in NOCTURNAL ANIMALS.\r\n\r\nDirector Tom Ford starts the film with a close up of a handful of naked older white females dancing nakedly with bodies society would be disturbed by. Ford does not focuses on just one part of the body but every piece of fat, extra skin, crease, scar, and stretch mark to really push your comfortability. No, Ford is not going for shock value, especially not so early in the film because there will be plenty time for that, but he is being nice of enough to give the audience a disclaimer. A disclaimer that nothing will be more comfortable than the opening sequence and if you couldn't handle that then Nocturnal Animals is going to be one hell of a trip for you. Heck, regardless, Nocturnal Animals is one hell of a trip.\r\n\r\nNocturnal Animals itself contains a double narrative strand which consists of Susan's real life and her bringing the book of her ex-husband to life. Ford does not implement a voiceover to let you know that you are now in the world of the book yet he makes you feel that you are watching another film. Ford pulls off a difficult task in making the audience care about both narratives and you want to believe that both are fictional then the uncomfortability levels begin to raise once again as you are forced to remember that one is indeed reality. Tony & Susan, the 1993 novel that the films was adapted from, unfolds how intimate the act of reading could be as an author could tap into the reader's thoughts, feelings and experience. Tom Ford pulls this same feat but just with the act of watching a film.\r\n\r\nWith his first job being a fashion designer, one would only assume to be blown away by the visuals Tom Ford would create. This is true as various scenes of LA and west Texas are beyond stunning but no one would expect the clash of visuals Ford would create with LA and west Texas. The transition from super cool and grotesque LA to a brutal, violent and revengeful west Texas will once again raise your uncomfortability levels.\r\n\r\nAfter all, this is a revenge film. We learn throughout the film that Susan, who comes from a wealthy family, falls in love with an inspiring author in Jake Gyllenhaal's Tony but would eventually go on to break his art in three different way. First, by telling him to take a step back from his dream of being an author. Secondly, aborting his child. Then, if the first two wasn't enough, she lives him for the handsome and dashing Armie Hammer's Hutton. Susan goes on to live the perfect life with Hutton and 20 years after her divorce with Tony, he decides to quietly place a novel about revenge in her mailbox. We feel Susan's chills as she reads the novel and without ever needing to say a word to her, Susan's perfect little world becomes to crumble\r\n\r\nJake Gyllenhaal and Amy Adams give us exactly what we expect from them. Aaron Taylor-Johnson offers a spine-chilling performance as Ray Marcus and Michael Shannon is fantastic as Bobby Andes. Tom Ford finally takes off his fashion designer hat and puts his fully-fledged director hat on as that was his approach with this film and two narratives. Tom Ford sustains the point that he is not a fashion designer turned director but a full-fledged director as a lesser director would have totally botched this film.", "created_at": "2016-11-03T14:06:31.774Z"}, {"movie_id": 340666, "review_id": "58b34050c3a36852a300adb9", "author_rating": 6.0, "review_text": "**RE   \r\nVEN  \r\nGE**\r\n\r\nThis was simply awesome. I meant the story, but the presentation was not my kind. I got the story and I enjoyed it. The performances can't be neglected either. Both the lead, Jake and Amy were the film's highlight. But I also happy for Michale Shannon's Oscars nominee. Based on the novel 'Tony and Susan', but for the film adaptation, the title got inspired by the book that appear in the story. From the director of 'A Single Man' which is his comeback film after a long gap. I would say a good attempt.\r\n\r\nThis is the story of a successful art gallery boss who got divorced and remarried to the man whom she was cheating with from her ex. Her decision was in particular influenced by her mother. Now she thinks she's happy, but one day her ex sends a copy of his latest novel that's dedicated in her name. Reading it, she realises the tough time he'd with their separation. Following the end of the book, she encounters an unexpected truth which could affect her life forever.\r\n\r\nA dual layer story. One was fiction and the other one in the real world. But the fictional tale highly influences the main narration and that's what I call the genuine writing. So the credit must go to none other than the original author. I have seen lots of revenge films, even it can be compared to 'Three Colours: White', but the major difference is the sweet revenge. For that alone the film was awesome. The climax was even better. If you understand the narration, you will enjoy it for sure. The filmmaking should have been a bit better. Excluding that the film is not to be skipped.\r\n\r\n_6/10_", "created_at": "2017-02-26T20:53:36.324Z"}, {"movie_id": 340666, "review_id": "58d7f346c3a368124f057f92", "author_rating": 7.0, "review_text": "A compelling thriller with an open-ended ending that feels far too easy for what it had going for it.\r\n\r\nNocturnal Animals starts out very strong. It feels reminiscent of Lynch's Lost Highway or Mulholland Dr. The main character lives a luxurious life surrounded by some very striking pieces of art (art pieces which, throughout the story, make things even more thrilling and surreal). She reads her ex-boyfriend's novel which quite honestly makes us feel like we're in a bad dream. The way the novel starts out feels like Michael Haneke's Funny Games. Its opening scene with Aaron Taylor-Johnson so brilliantly builds in tension with his character's mind games. The story however turns into a bit of a tame crime mystery held up with a sort of fun performance from Michael Shannon. The potential to be a very cryptic thriller is there, but decides instead to put all the pieces together for us. As a Lynch fan, this movie made me crave something stranger. I really wanted to be left mystified but instead I got an ending that was kind of obvious.", "created_at": "2017-03-26T16:58:46.142Z"}, {"movie_id": 340666, "review_id": "58e3a780c3a3684aa4010aaf", "author_rating": 8.0, "review_text": "Only in a world where a Reality TV star becomes President could Tom Ford be one of the best directors of the year... I guess that'd be this world.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-04-04T14:02:40.209Z"}, {"movie_id": 340666, "review_id": "639e19b8223e20008bcede20", "author_rating": 6.0, "review_text": "**A dense film, with few sympathetic characters, but quite reasonable.**\r\n\r\nThis is one of those films where the most interesting thing is the plot within the plot: the script begins by introducing us to Susan Morrow, a very sophisticated and elegant art gallery owner who suffers from insomnia and who receives, by mail, a sketch of a fictional novel which will be edited by her ex-husband. When she starts to read it, the film shows us the story he wrote: a very conventional family that is ambushed on an isolated road and kidnapped by criminals, leading the main character, a peaceful and friendly man, to go through a real nightmare. And at the same time, we see Susan remember several moments in her relationship, where things didn't always go well.\r\n\r\nThe film is not bad, but it requires some attention from the public to follow the three ongoing stories, and by far, the most interesting and most striking is the one that the protagonist reads in the powerful novel written by her ex-husband. Personally, I didn't feel any kind of sympathy for the protagonist, I found the character quite bland and uninteresting, and the narrative of her marriage and divorce shows many shadows of the character that can make it even more difficult to empathize with her.\r\n\r\nAmy Adams brought the main character to life and seems to me to have done a very dignified and intelligent job, even though this is one of those characters that we never seem to really get to know because she never makes herself known. Jake Gyllenhaal turns out to be much more interesting, not least because he gave life to two different characters: he was the ex-husband of Susan, Adams' character, and also the protagonist of the novel she reads, and who is a nice character, but who finds himself in a dire situation despite all reasonable attempts to avoid it. Now, if we consider that that romance is intrinsically linked to the failed marriage of the two characters, it would have been perfectly possible to give Adams the character that ended up in the hand of Isla Fisher, a good actress with very little to do here. Michael Shannon and Aaron Taylor-Johnson gave good performances in characters with a lot of impact.\r\n\r\nTechnically, the film makes good use of cinematography to convey the emotions that the characters are feeling: from Susan's depressing loneliness to the threat, danger and tension that surrounds the characters in the novel. Dark colors, very well-designed environments and a clever use of light and shooting angles all contribute to accentuate these sensations. In addition, the film has good sets and costumes, and a discreet but effective soundtrack.", "created_at": "2022-12-17T19:34:16.305Z"}]