[{"movie_id": 23483, "review_id": "589c581f925141245e004c0a", "author_rating": null, "review_text": "I thought this movie was a super comedy movie but I was wrong. I didn't know it was a pretty serious movie with real killings and stuff. It was like Kill Bill minus the really gross things. It was not a silly movie after all.\r\n\r\n\r\nThe character Kick-Ass was pretty stupid. I mean a high school nobody trying to be somebody. Of all the things he could think of, it's being a super hero. And then there's Big Daddy and Hit Girl who had the real stunts. Their characters were pretty funny. I mean I can't think of any words to describe Nicolas Cage's character. A good daddy who doesn't know how to bring up a girl. And then there's Chloe Moretz. Wow. She did all the action in the movie. I mean this girl is only 13 years old. I'm a fan. And then there's Red Mist who I think is very silly like Kick Ass as well.\r\n\r\n\r\nMy rate for this movie is A.", "created_at": "2017-02-09T11:53:03.338Z"}, {"movie_id": 23483, "review_id": "64b4fbb037806200ff39a32f", "author_rating": 10.0, "review_text": "My favourite movie!", "created_at": "2023-07-17T08:28:32.639Z"}, {"movie_id": 23483, "review_id": "64f6fa068e20c50cd3ed3456", "author_rating": 6.0, "review_text": "Geeky \"Dave\" (Aaron Taylor-Johnson) and his two pals go through life at high school being bullied and reading comic books. Finally fed up being put upon, he buys a superhero suit online and heads out into the night hoping that his green lycra will deter the city's nasties. After his umpteenth beating he is rescued by a like-minded father and daughter team who take him under their own wing and set about training him. Meantime, the kingpin of crime \"D'Amico\" (Mark Strong) is running the town with a ruthless rod of iron, watched adoringly by his hapless son \"Chris\" (Christopher Mintz-Plasse). Surprisingly, the former trio start to have some success against this arch-baddie so battle lines are soon drawn and, well you can guess the rest. Up to a point, this works. ATJ (especially with glasses and curly hair) is very easy on the eye and there is a degree of chemistry between his character and his cohort \"Mindy\" (Chloë Grace Moretz) all under the tutelage of a rather underplayed Nicolas Cage as her dad \"Damon\". Sadly, the initially quirky start that sees real people aspiring to make their community better - without the ability to fly or laser things with their eyes - peters out quite quickly and the jokes that are quite attitudinally sharp at the start just become a little more puerile and expletive-dependent. Mr. Strong isn't really much of a baddie and the combat scenes are well and truly prolonged to the point where they end up a bit repetitive and dull. It has it's moments, this movie - it's generally quite entertaining but at all but two hours in length it just runs out of ideas around the half way mark and only just struggles over the line.", "created_at": "2023-09-05T09:51:02.754Z"}]