[{"movie_id": 46261, "review_id": "51ec27f919c29551dc113fab", "author_rating": null, "review_text": "Oh, this is the stuff. How I’ve missed great horror. American studios have, by and large, ignored producing truly great horror over mindless pablum like Final Destination 6, or Saw 23, or Nostalgic Horror Film Remake 117. Slashers, gore-fests, dead teenager movies and all the other imagination-barren dreck neglect that incredible power a great horror film can wield over its viewer: namely, that it’s the only genre that can truly encompass every emotion, running the audience through the gamut so thoroughly that they’re exhausted and fully satisfied at the end.\r\n\r\nDon’t Be Afraid of the Dark is a great horror film. I’d also rank it up there with the great fantasy films; dark fantasy, to be sure, as dark as it gets, but fantasy all the same. It’s a faery tale, with the a-e spelling, replete with faeries, an evil stepmother, a princess and a castle.\r\n\r\nOh, and what a castle it is: the film takes place in the dark, dusty confines of the gloriously decaying Blackwood Manor, a house into which reasonable people would never dream of entering, much less owning. Luckily for us, this faery tale is populated by and large with unreasonable people, for reasonable people have no place in faery tales.\r\n\r\nLittle Sally Hirst is sent to live with her father in Blackwood Manor, as her mother doesn’t want her anymore. Her father Alex (Guy Pearce) and his live-in girlfriend Kim (Katie Holmes) are working on restoring the mansion to its former glory, it having been empty for the last hundred years. But Sally’s arrival awakens…things.\r\n\r\nLurking things.\r\n\r\nHungry things.\r\n\r\nLittle do Sally, Alex and Kim know the dark history of what happened to old Emerson Blackwood, and the secrets that the bolted-shut fireplace holds, or what has been unleashed at Blackwood Manor.\r\n\r\nThe tropes of the faery tales are both apparent and subverted here. Sally (Bailee Madison) is a withdrawn, sullen child, wise beyond her years and smart enough to know she’s been abandoned. Alex is a father who loves his daughter, but doesn’t know how to be a parent to her. Kim is a de facto stepmother who didn’t ask for this child but does her best to provide Sally with warmth and love, particularly in lieu of Alex. Terrors are visited upon the girl, but only she knows they’re real; after all, what parents truly believe there are monsters under their child’s bed? Parents know that the monsters aren’t real, even if they are. Children know the monsters are real, and no collection of assurances, no matter how lovingly given, offer enough protection.\r\n\r\nBailee Madison is the focus of the film, and she gives a terrific performace. She’s a real little girl, not a falsely-spun Hollywood version of one. She is reckless, irresponsible, smart, sullen, and terrified. Katie Holmes shines as the stepmother who tries her hardest. Guy Pearce fares well, though he has the most thankless role as the Parent Who Doesn’t Believe.\r\n\r\nOne of the great strengths of the film is how it uses that frustrating disbelief as one of its pillars. The creatures are eventually seen, in ever more apparent lighting, and what that removes from their eeriness it adds to their threat; we know, as does Sally, that these monsters are real, and without help, harm will come. It’s an growing, inexorable conclusion that is terrifying in its mounting inevitability.\r\n\r\nThe entirety of the film is masterfully crafted: the acting is uniformly excellent, the atmosphere is thick and foreboding, the cinematography lush and gorgeous, the art direction is darkly enchanting and the sound design (particularly of the creatures) is terrifying. Even after the creatures have been revealed, their terror doesn’t diminish, and I credit that not only to the sure hand of first-time director Troy Nixey but also the impeccable sound design.\r\n\r\nNixey, a former comic book artist, was hand-picked by producer and cowriter Guillermo del Toro after seeing Nixey’s short film “Latchkey’s Lament.” It was a perfect choice. Del Toro worked for decades on remaking this film, based on an ABC movie of the week from the 1970s starring Kim Darby. He said the film terrified him so much that it was the impetus for him to go into horror filmmaking. And del Toro’s signature touches are all around, from the youthful heroine to the incorporation of faery tales to the trademark art design. None of that should dilute the appreciation for Nixey’s work, however; it’s so rare to find a director who takes time to build atmosphere and ratchet up tension to the breaking point rather than telegraph every scare and pull the trigger too soon.\r\n\r\nThe film is rated R, for there is no other rating to accommodate it. The filmmakers were attempting for a PG-13 film, which they thought they could accomplish without overt gore, language, or sex. When they submitted it for rating, the MPAA gave it an R for intensity, saying it was non-negotiable for “pervasive scariness.” Upon being asked what they could do to get a more commercially-viable PG-13, the MPAA responded “Why ruin a perfectly scary movie?”\r\n\r\nDon’t Be Afraid of the Dark has what is so lacking in horror films today: imagination. Dark, terrifying, magnificent imagination. The kind that makes you glad you’re able to sit there, in a darkened theater, and let it devour you whole.", "created_at": "2013-07-21T18:27:05.035Z"}]