[{"movie_id": 2312, "review_id": "63fa8c0684f24900a94160e2", "author_rating": 5.0, "review_text": "**Considering that it's based on an action video game, the film is quite enjoyable, and not quite as deserving of the hate it's been getting.**\r\n\r\nThe movie market is full of movies based on video games. I even dare to say that practically all the most popular games have already known a film adaptation, from “Super Mario” to “Angry Birds”. I've seen quite a few of them, and so far I haven't found one that I could say I liked. Or rather, what I can remember right now...\r\n\r\nI don't know the game “Dungeon Siege”, but from what I saw in a quick search on the Internet it must be very similar to other games of the pseudo-medieval genre. Wicked kings, dungeons and sorcerers are part of this universe. They are fantasy, intended to stimulate the imagination and thirst for action of those who have never picked up a real medieval sword.\r\n\r\nDirected by Uwe Bol, a director I didn't know until now, and of whom I have not very recommendable references (but let's not, because of that, judge in advance!), the film I've just seen is relatively pleasant, and is based on a struggle for power in a kingdom called Ehb. On one side we have a wicked sorcerer and the late king's nephew, who wants to reign in his place, and on the other we have a poor farmer, at the head of an unlikely revolution. We've seen a lot of this, medieval themed films are always exploring these themes.\r\n\r\nWhile originality is lacking here, the film works reasonably well and isn't as bad as some have claimed. There are far worse things floating around between big lauds. All right, the film lacks a more effective direction and a greater epic sense, much of what you see has already been done in other better films and the characters are sketches without personality. But considering that the movie is based on a game, I think a decent effort was made.\r\n\r\nThe cast has several big names. For me, the best and most competent is Ray Liotta, who really makes an effort to raise the quality of what he does with the poor material he receives and manages to steal our attention whenever he appears on the scene. However, I also liked Ron Perlman and John Rhys-Davies. I didn't like Jason Statham, he seems to be in the movie just for the pay, and the rest of the cast has little or little time to do something.\r\n\r\nTechnically, the film deserves praise for its excellent cinematography, the good shooting options and the chosen locations. The soundtrack harmoniously unites an excellent original soundtrack and several hard rock themes that appear more during the credits, and stays in the ear for some time.", "created_at": "2023-02-25T22:30:30.141Z"}]