[{"movie_id": 100402, "review_id": "535868070e0a26067f0007d2", "author_rating": null, "review_text": "This movie is very good I loved it so much.", "created_at": "2014-04-24T01:25:27.917Z"}, {"movie_id": 100402, "review_id": "53f4879b0e0a267f8d001da8", "author_rating": 9.0, "review_text": "This is indeed a great piece of superhero entertainment. If superheroes and action, plenty of action, is within your sphere of interest then this movie truly delivers. There is even a story to support the stunts and special effects fireworks that is not too shabby. As a matter of fact, for being a Marvel-based movie, the story is more than acceptable.\r\n\r\nAs the blurb states, our hero is meeting a few adaptation issues after having been awaken into the modern world. Luckily the movie do not fall into the trap of making some silly comedy out of it but keeps these parts at a reasonable level where it stays funny without ruining the movie or disrupting the pace of the real story.\r\n\r\nThe story? Simple and not very original with the usual slew of traitors strewn about, you cannot trust anyone, our hero becomes a fugitive etc etc bla bla bla. It is however a pretty straightforward one which works quite well and is not getting bogged down in silly emotions and general idiotic behavior by our hero like for instance several instalments of Spider Man have done. Actually this is one thing that I really like with this movie. The hero is a true hero from start to finish without any of that modern Hollywood crap where the hero must be tarnished in one way or another to satisfy the directors and producers.\r\n\r\nAs I wrote above if you like superhero action movies then there is little not to like with this one. Acceptable story, plenty of action, good special effects, a cool chick (hey I am but an ordinary male, I like female actors in tight costumes) and a clear hero. None of the actors are really doing a bad job of it and in general the acting is as good as one can expect when portraying characters that, after all, are be totally ludicrous in real life. Its 8 out of 10 rating at IMDb (at the time of writing this) is well deserved. I am astonished that some people seem to have voted it down with a one star rating. It is a Marvel-based movie. You might feel it is more or less good but the style of the movie should not really be a major surprise to anyone and there is no way in hell that it deserves a one star rating unless someone really watched the wrong movie by accident.", "created_at": "2014-08-20T11:33:47.053Z"}, {"movie_id": 100402, "review_id": "544e11070e0a2608d4004175", "author_rating": 7.0, "review_text": "Put *a little* bit of brain in a superhero's movie script and you will have everybody talking wonders about it.\r\n\r\nThis is not a bad movie but neither astonishing. Fun and entertaining and with great FX, as expected.", "created_at": "2014-10-27T09:31:51.011Z"}, {"movie_id": 100402, "review_id": "54590aff0e0a261165002061", "author_rating": 7.0, "review_text": "The Winter Soldier has all the action, quirky one-liners, and bold adventure that we have come to expect of a Marvel movie.\r\n\r\nPlus we get introduced to a new/old villain as well as some fun romantic tension between Steve Rogers (Captain America) and Natasha Romanoff (The Black Widow).  (Scarlett Johansson is perfect in this role.)\r\n\r\nBut this film also has some minor irritations all stemming from Marvel's tendency to make _Captain America_ more complicated than it really needs to be.\r\n\r\nMINOR SPOILER ALERT:\r\n1. The love story/non-story.  Is this necessary? Will the Captain remain faithful to a 80 year-old woman on her deathbed OR engage in a date with his next door neighbor?  Plus the tension between him and Natasha Romanoff is intense.  This comes off as forced, awkward, and pointless.\r\n\r\n2. “The deception goes deeper than you can imagine. You can’t trust anybody.”  It's this way every time so it should no longer be a surprise.\r\n\r\n3. He’s dead but not really. Not him, the other him. Well…they both were dead – not really – but now they are both alive. But one of them can’t remember who he really is. In this film we get to do this with two characters instead of one.  It’s not a huge distraction but why does Marvel keep returning to this plot line? \r\n\r\nEND OF MINOR SPOILER ALERT\r\n\r\nThe Winter Soldier is best when Rogers and Romanoff are on the move trying to put the pieces of the puzzle together. The explosions are nice, the action scenes are intense but the real enjoyment of the film is where skill and wits are relied on more than gadgets and explosions. \r\n\r\nPatriotism is a bit more nuanced this time around and it's better for it.  The cast is great, no awkward acting moments to report. It’s a great summer flick with all the action you want.", "created_at": "2014-11-04T17:21:03.746Z"}, {"movie_id": 100402, "review_id": "55e43b63c3a368418e0035a3", "author_rating": 9.0, "review_text": "Till the end of the road.\r\n\r\nStonking! Now this is more like it, after the disappointments that have been Iron Man 2 and Thor 2, Captain America gets a sequel of substance and sparks. It manages to blend everything required to make a great superhero film, lashings of derring-do heroics, action bonanza, adventure, some sexy sizzle and of course the key, a story with brains and mystery elements.\r\n\r\nTrue enough to say that the considerable contributions of Black Widow and Falcon (and Nick Fury of course) keeps this as a lively Avengers spin-off movie, which is no bad thing at all, but it's still the Captain who dominates things, marking himself out as a viable main man. In fact the whole film has the old school comic book feel, yes there's the grandiose pyrotechnics - unsurprisingly amped up for the big finale, but there's an adherence to serial thriller conventions that is, well, rather warm and comforting.\r\n\r\nWith the Captain getting some surprising amount of emotional depth and humanity courtesy of the perfectly cast Chris Evans, the viewers have much to care about. Themes of Bondian world domination and global security crisis keep things nice and fanciful, while the unheralded work by the effects guys is modern cinematic art. There's some adherence to genre formula, and a bit of Marvel universe copy-catting going on, but this is one of the best films from the Marvel stable. A rich sequel indeed - more Captain America please. 9/10", "created_at": "2015-08-31T11:32:51.183Z"}, {"movie_id": 100402, "review_id": "5a2ccb3ac3a3680b8f145cdc", "author_rating": 9.0, "review_text": "**A long format review from 2014**\r\n\r\nMisleadingly, the titular Winter Soldier is essentially a minor subplot in what is more of an espionage-technoir-thriller meets spectacle-epic than your typical super hero film. The real meat of the movie, thankfully, has some more substance behind it. Though it wouldn't surprise me if we learn later that Sebastian Stan's villain was forced to take a back seat via last minute script changes à la Hawkeye in _The Avengers_.\r\n\r\nThese things are of course a matter of opinion, and I'd like to watch _Winter Soldier_ at least once more (particularly in 2D... God do I ever hate 3D) before committing to any particular ranking. But even without that, I feel confident in saying it's the best MCU Phase 2 film to date. We must await _Guardians of The Galaxy_ and _Age of Ultron_ before cementing that little award, but I'd say that it stands at the very least above _Iron Man 3_ and _The Dark World_.\r\n\r\nI always try to keep my reviews spoiler free, but being that in most parts of the world it isn't out yet, I'll be extra careful to do so with this one. This makes talking about _Winter Soldier_ on its own merits difficult, but there are certainly a few things that can be said.\r\n\r\nChris Evans (Cap'), Scarlett Johansson (Black Widow) and to a slightly lesser extent. Anthonie Mackie (Falcon) rule the film, and do so without any shortcomings. That's not to say that they couldn't physically have done any better, but their roles were all seamless as far as my blurred vision could tell, which is not an accolade I'd often give.\r\n\r\nWhere _The Dark World_ was simply a holding pattern for Thor with some very pretty pictures, _Iron Man 3_ and _The Winter Soldier_ went out and took some actual risks in their stories. But unlike _Iron Man 3's_, Winter Soldier's risks have (to its eternal credit) been universally well received.\r\n\r\nDirectors Joe and Anthony Russo also managed to cameo a couple of Community alumni, which will never be a bad thing in my eyes, even if they're just one-off, throwaway jokes.\r\n\r\nAs I said, I really feel I need to give _The Winter Soldier_ at the very least one more screening before I feel totally confident in my thoughts about it.\r\n\r\nBut the fact that I'm really fucking excited for that second viewing speaks in its favour if nothing else does.\r\n\r\n86%\r\n\r\n_-Gimly_", "created_at": "2017-12-10T05:50:50.967Z"}, {"movie_id": 100402, "review_id": "5c842694c3a3684e8cdacb97", "author_rating": 9.0, "review_text": "Captain America: The Winter Soldier opens up with an action sequence that's better than most action movie climaxes. It then sets up a really intriguing story before launching into one of the most suspenseful car chases since the Simpson/Bruckheimer 90s era. After that it's scene after scene of amazing action coupled with a complex story about heroes and villains being caught in a system that is too big to bring down, unless you're as good and level headed as Steve Rogers.\r\n\r\nThis isn't just a great comic book movie. It's a great movie; period. Using a spy thriller style mixed with martial arts and gunplay, set to the perfect music score, I would rank The Winter Soldier as one of my favourite action films hands down.", "created_at": "2019-03-09T20:48:20.066Z"}, {"movie_id": 100402, "review_id": "5ef02cbf5684630032031bc0", "author_rating": 10.0, "review_text": "Third time seeing this and still a fantastic all-around film, not just a comic book movie either. Briskly paced and a great complex story, this is a Marvel movie that felt complete from beginning to end, and actually advanced the universe so well. Chris Evans continues to embody the role and nice to see Scarlett Johansson given more to do (up to the point of this film's release) than in Iron Man 2 or The Avengers. **4.75/5**\r\n\r\nI probably rate this right alongside The Dark Knight amongst comic book movies and, saying this as a DC fan, perhaps edges out TDK (though could easily seeing roles reversed once I re-watch that one).", "created_at": "2020-06-22T03:59:59.038Z"}, {"movie_id": 100402, "review_id": "6004c3c97f6c8d003d747950", "author_rating": 8.0, "review_text": "Entertaining!\r\n\r\n<em>'Captain America: The Winter Soldier'</em> makes for an enjoyable flick. Chris Evans does great work as the lead character, while Scarlett Johansson gives her most fun to watch performance in the MCU up until this point; it would've been great if she had such a role pre-<em>'The Avengers'</em>, so she wouldn't have felt so out of place to me in that.\r\n\r\nAnthony Mackie and Robert Redford are notable in their respective roles, as is Sebastian Stan - even if, to be honest, his character's connection with the lead didn't quite hit as hard as the film attempts - at least for me. I didn't really believe how his character came about and how Barnes acts throughout, Stan does well though. Samuel L. Jackson is also good.\r\n\r\nEverything else is exactly what you'd expect from a film of this size. Great effects, entertaining action and a satisfying story. Very good, all in all.", "created_at": "2021-01-17T23:10:01.623Z"}, {"movie_id": 100402, "review_id": "624216d2fea0d7005c88d28a", "author_rating": 7.0, "review_text": "Picking up from his rather frosty denouement of 2011, \"Capt. America\" (Chris Evans) finds himself seventy years older but still with battles to fight. This time, he teams up with \"Nick Fury\" (Samuel L. Jackson) and his SHIELD agent \"Natasha\" (Scarlet Johansson) to combat the ruthless warrior known only as the \"Winter Soldier\". It doesn't take us long to discover that there is quite conspiracy going on too - with an attempt on the life of \"Fury\" before off we go on a roller-coaster ride of action adventure scenarios. The effects are great and the score works well to help keep the break-neck pace working well and excitingly. Evans is still just a little too pretty-boy for me, but the developing roles of Anthony Mackie, Johansson and a few cameos from the somewhat duplicitous \"Pierce\" (Robert Redford) all contribute well to make this a superior adventure film with a strong and characterful story underpinning it. It hasn't quite the charm of the first film, so I wouldn't say it is better - but it is certainly just as good, and as with the first outing, the 2¼ hours just flies by. Great cinema.", "created_at": "2022-03-28T20:13:06.310Z"}, {"movie_id": 100402, "review_id": "63e70a181277780081a30d0d", "author_rating": 8.0, "review_text": "**The darker tone and spy plot are a perfect fit for Captain America taking the MCU into new territory that results in one of the franchise’s very best.**\r\n\r\nThe Winter Soldier broke new ground for Marvel. The Russo Brothers took Captain America and immersed him in a dangerous world filled with subterfuge, spies, and betrayal. This was the first MCU film that didn’t feel as bright and light-hearted as its predecessors, and this new tone fit Cap’s story perfectly. The action was incredible. The plot twists kept piling up. Forcing Cap to question his moral compass and use his wits over his brawn to overcome his enemy were brilliant story decisions that developed the character and avoided the “bad guy with the same powers as the hero trope.” Black Widow’s inclusion in this spy adventure allowed Natasha to shine and further develop her morality. Everything in this film just works. I am admittedly not a major Captain America fan, but The Winter Solider overcomes all that to land this film on my favorite MCU list and comic book film list too!", "created_at": "2023-02-11T03:23:04.268Z"}, {"movie_id": 100402, "review_id": "6452a3ffc044290122cb6992", "author_rating": 7.0, "review_text": "Not as good as the first. Still a good movie though. The only thing I don't like is, he's suppose to be Captain America. With all these super powers. So why does he need help all time.", "created_at": "2023-05-03T18:12:15.976Z"}, {"movie_id": 100402, "review_id": "535868070e0a26067f0007d2", "author_rating": null, "review_text": "This movie is very good I loved it so much.", "created_at": "2014-04-24T01:25:27.917Z"}, {"movie_id": 100402, "review_id": "53f4879b0e0a267f8d001da8", "author_rating": 9.0, "review_text": "This is indeed a great piece of superhero entertainment. If superheroes and action, plenty of action, is within your sphere of interest then this movie truly delivers. There is even a story to support the stunts and special effects fireworks that is not too shabby. As a matter of fact, for being a Marvel-based movie, the story is more than acceptable.\r\n\r\nAs the blurb states, our hero is meeting a few adaptation issues after having been awaken into the modern world. Luckily the movie do not fall into the trap of making some silly comedy out of it but keeps these parts at a reasonable level where it stays funny without ruining the movie or disrupting the pace of the real story.\r\n\r\nThe story? Simple and not very original with the usual slew of traitors strewn about, you cannot trust anyone, our hero becomes a fugitive etc etc bla bla bla. It is however a pretty straightforward one which works quite well and is not getting bogged down in silly emotions and general idiotic behavior by our hero like for instance several instalments of Spider Man have done. Actually this is one thing that I really like with this movie. The hero is a true hero from start to finish without any of that modern Hollywood crap where the hero must be tarnished in one way or another to satisfy the directors and producers.\r\n\r\nAs I wrote above if you like superhero action movies then there is little not to like with this one. Acceptable story, plenty of action, good special effects, a cool chick (hey I am but an ordinary male, I like female actors in tight costumes) and a clear hero. None of the actors are really doing a bad job of it and in general the acting is as good as one can expect when portraying characters that, after all, are be totally ludicrous in real life. Its 8 out of 10 rating at IMDb (at the time of writing this) is well deserved. I am astonished that some people seem to have voted it down with a one star rating. It is a Marvel-based movie. You might feel it is more or less good but the style of the movie should not really be a major surprise to anyone and there is no way in hell that it deserves a one star rating unless someone really watched the wrong movie by accident.", "created_at": "2014-08-20T11:33:47.053Z"}, {"movie_id": 100402, "review_id": "544e11070e0a2608d4004175", "author_rating": 7.0, "review_text": "Put *a little* bit of brain in a superhero's movie script and you will have everybody talking wonders about it.\r\n\r\nThis is not a bad movie but neither astonishing. Fun and entertaining and with great FX, as expected.", "created_at": "2014-10-27T09:31:51.011Z"}, {"movie_id": 100402, "review_id": "54590aff0e0a261165002061", "author_rating": 7.0, "review_text": "The Winter Soldier has all the action, quirky one-liners, and bold adventure that we have come to expect of a Marvel movie.\r\n\r\nPlus we get introduced to a new/old villain as well as some fun romantic tension between Steve Rogers (Captain America) and Natasha Romanoff (The Black Widow).  (Scarlett Johansson is perfect in this role.)\r\n\r\nBut this film also has some minor irritations all stemming from Marvel's tendency to make _Captain America_ more complicated than it really needs to be.\r\n\r\nMINOR SPOILER ALERT:\r\n1. The love story/non-story.  Is this necessary? Will the Captain remain faithful to a 80 year-old woman on her deathbed OR engage in a date with his next door neighbor?  Plus the tension between him and Natasha Romanoff is intense.  This comes off as forced, awkward, and pointless.\r\n\r\n2. “The deception goes deeper than you can imagine. You can’t trust anybody.”  It's this way every time so it should no longer be a surprise.\r\n\r\n3. He’s dead but not really. Not him, the other him. Well…they both were dead – not really – but now they are both alive. But one of them can’t remember who he really is. In this film we get to do this with two characters instead of one.  It’s not a huge distraction but why does Marvel keep returning to this plot line? \r\n\r\nEND OF MINOR SPOILER ALERT\r\n\r\nThe Winter Soldier is best when Rogers and Romanoff are on the move trying to put the pieces of the puzzle together. The explosions are nice, the action scenes are intense but the real enjoyment of the film is where skill and wits are relied on more than gadgets and explosions. \r\n\r\nPatriotism is a bit more nuanced this time around and it's better for it.  The cast is great, no awkward acting moments to report. It’s a great summer flick with all the action you want.", "created_at": "2014-11-04T17:21:03.746Z"}, {"movie_id": 100402, "review_id": "55e43b63c3a368418e0035a3", "author_rating": 9.0, "review_text": "Till the end of the road.\r\n\r\nStonking! Now this is more like it, after the disappointments that have been Iron Man 2 and Thor 2, Captain America gets a sequel of substance and sparks. It manages to blend everything required to make a great superhero film, lashings of derring-do heroics, action bonanza, adventure, some sexy sizzle and of course the key, a story with brains and mystery elements.\r\n\r\nTrue enough to say that the considerable contributions of Black Widow and Falcon (and Nick Fury of course) keeps this as a lively Avengers spin-off movie, which is no bad thing at all, but it's still the Captain who dominates things, marking himself out as a viable main man. In fact the whole film has the old school comic book feel, yes there's the grandiose pyrotechnics - unsurprisingly amped up for the big finale, but there's an adherence to serial thriller conventions that is, well, rather warm and comforting.\r\n\r\nWith the Captain getting some surprising amount of emotional depth and humanity courtesy of the perfectly cast Chris Evans, the viewers have much to care about. Themes of Bondian world domination and global security crisis keep things nice and fanciful, while the unheralded work by the effects guys is modern cinematic art. There's some adherence to genre formula, and a bit of Marvel universe copy-catting going on, but this is one of the best films from the Marvel stable. A rich sequel indeed - more Captain America please. 9/10", "created_at": "2015-08-31T11:32:51.183Z"}, {"movie_id": 100402, "review_id": "5a2ccb3ac3a3680b8f145cdc", "author_rating": 9.0, "review_text": "**A long format review from 2014**\r\n\r\nMisleadingly, the titular Winter Soldier is essentially a minor subplot in what is more of an espionage-technoir-thriller meets spectacle-epic than your typical super hero film. The real meat of the movie, thankfully, has some more substance behind it. Though it wouldn't surprise me if we learn later that Sebastian Stan's villain was forced to take a back seat via last minute script changes à la Hawkeye in _The Avengers_.\r\n\r\nThese things are of course a matter of opinion, and I'd like to watch _Winter Soldier_ at least once more (particularly in 2D... God do I ever hate 3D) before committing to any particular ranking. But even without that, I feel confident in saying it's the best MCU Phase 2 film to date. We must await _Guardians of The Galaxy_ and _Age of Ultron_ before cementing that little award, but I'd say that it stands at the very least above _Iron Man 3_ and _The Dark World_.\r\n\r\nI always try to keep my reviews spoiler free, but being that in most parts of the world it isn't out yet, I'll be extra careful to do so with this one. This makes talking about _Winter Soldier_ on its own merits difficult, but there are certainly a few things that can be said.\r\n\r\nChris Evans (Cap'), Scarlett Johansson (Black Widow) and to a slightly lesser extent. Anthonie Mackie (Falcon) rule the film, and do so without any shortcomings. That's not to say that they couldn't physically have done any better, but their roles were all seamless as far as my blurred vision could tell, which is not an accolade I'd often give.\r\n\r\nWhere _The Dark World_ was simply a holding pattern for Thor with some very pretty pictures, _Iron Man 3_ and _The Winter Soldier_ went out and took some actual risks in their stories. But unlike _Iron Man 3's_, Winter Soldier's risks have (to its eternal credit) been universally well received.\r\n\r\nDirectors Joe and Anthony Russo also managed to cameo a couple of Community alumni, which will never be a bad thing in my eyes, even if they're just one-off, throwaway jokes.\r\n\r\nAs I said, I really feel I need to give _The Winter Soldier_ at the very least one more screening before I feel totally confident in my thoughts about it.\r\n\r\nBut the fact that I'm really fucking excited for that second viewing speaks in its favour if nothing else does.\r\n\r\n86%\r\n\r\n_-Gimly_", "created_at": "2017-12-10T05:50:50.967Z"}, {"movie_id": 100402, "review_id": "5c842694c3a3684e8cdacb97", "author_rating": 9.0, "review_text": "Captain America: The Winter Soldier opens up with an action sequence that's better than most action movie climaxes. It then sets up a really intriguing story before launching into one of the most suspenseful car chases since the Simpson/Bruckheimer 90s era. After that it's scene after scene of amazing action coupled with a complex story about heroes and villains being caught in a system that is too big to bring down, unless you're as good and level headed as Steve Rogers.\r\n\r\nThis isn't just a great comic book movie. It's a great movie; period. Using a spy thriller style mixed with martial arts and gunplay, set to the perfect music score, I would rank The Winter Soldier as one of my favourite action films hands down.", "created_at": "2019-03-09T20:48:20.066Z"}, {"movie_id": 100402, "review_id": "5ef02cbf5684630032031bc0", "author_rating": 10.0, "review_text": "Third time seeing this and still a fantastic all-around film, not just a comic book movie either. Briskly paced and a great complex story, this is a Marvel movie that felt complete from beginning to end, and actually advanced the universe so well. Chris Evans continues to embody the role and nice to see Scarlett Johansson given more to do (up to the point of this film's release) than in Iron Man 2 or The Avengers. **4.75/5**\r\n\r\nI probably rate this right alongside The Dark Knight amongst comic book movies and, saying this as a DC fan, perhaps edges out TDK (though could easily seeing roles reversed once I re-watch that one).", "created_at": "2020-06-22T03:59:59.038Z"}, {"movie_id": 100402, "review_id": "6004c3c97f6c8d003d747950", "author_rating": 8.0, "review_text": "Entertaining!\r\n\r\n<em>'Captain America: The Winter Soldier'</em> makes for an enjoyable flick. Chris Evans does great work as the lead character, while Scarlett Johansson gives her most fun to watch performance in the MCU up until this point; it would've been great if she had such a role pre-<em>'The Avengers'</em>, so she wouldn't have felt so out of place to me in that.\r\n\r\nAnthony Mackie and Robert Redford are notable in their respective roles, as is Sebastian Stan - even if, to be honest, his character's connection with the lead didn't quite hit as hard as the film attempts - at least for me. I didn't really believe how his character came about and how Barnes acts throughout, Stan does well though. Samuel L. Jackson is also good.\r\n\r\nEverything else is exactly what you'd expect from a film of this size. Great effects, entertaining action and a satisfying story. Very good, all in all.", "created_at": "2021-01-17T23:10:01.623Z"}, {"movie_id": 100402, "review_id": "624216d2fea0d7005c88d28a", "author_rating": 7.0, "review_text": "Picking up from his rather frosty denouement of 2011, \"Capt. America\" (Chris Evans) finds himself seventy years older but still with battles to fight. This time, he teams up with \"Nick Fury\" (Samuel L. Jackson) and his SHIELD agent \"Natasha\" (Scarlet Johansson) to combat the ruthless warrior known only as the \"Winter Soldier\". It doesn't take us long to discover that there is quite conspiracy going on too - with an attempt on the life of \"Fury\" before off we go on a roller-coaster ride of action adventure scenarios. The effects are great and the score works well to help keep the break-neck pace working well and excitingly. Evans is still just a little too pretty-boy for me, but the developing roles of Anthony Mackie, Johansson and a few cameos from the somewhat duplicitous \"Pierce\" (Robert Redford) all contribute well to make this a superior adventure film with a strong and characterful story underpinning it. It hasn't quite the charm of the first film, so I wouldn't say it is better - but it is certainly just as good, and as with the first outing, the 2¼ hours just flies by. Great cinema.", "created_at": "2022-03-28T20:13:06.310Z"}, {"movie_id": 100402, "review_id": "63e70a181277780081a30d0d", "author_rating": 8.0, "review_text": "**The darker tone and spy plot are a perfect fit for Captain America taking the MCU into new territory that results in one of the franchise’s very best.**\r\n\r\nThe Winter Soldier broke new ground for Marvel. The Russo Brothers took Captain America and immersed him in a dangerous world filled with subterfuge, spies, and betrayal. This was the first MCU film that didn’t feel as bright and light-hearted as its predecessors, and this new tone fit Cap’s story perfectly. The action was incredible. The plot twists kept piling up. Forcing Cap to question his moral compass and use his wits over his brawn to overcome his enemy were brilliant story decisions that developed the character and avoided the “bad guy with the same powers as the hero trope.” Black Widow’s inclusion in this spy adventure allowed Natasha to shine and further develop her morality. Everything in this film just works. I am admittedly not a major Captain America fan, but The Winter Solider overcomes all that to land this film on my favorite MCU list and comic book film list too!", "created_at": "2023-02-11T03:23:04.268Z"}, {"movie_id": 100402, "review_id": "6452a3ffc044290122cb6992", "author_rating": 7.0, "review_text": "Not as good as the first. Still a good movie though. The only thing I don't like is, he's suppose to be Captain America. With all these super powers. So why does he need help all time.", "created_at": "2023-05-03T18:12:15.976Z"}, {"movie_id": 100402, "review_id": "535868070e0a26067f0007d2", "author_rating": null, "review_text": "This movie is very good I loved it so much.", "created_at": "2014-04-24T01:25:27.917Z"}, {"movie_id": 100402, "review_id": "53f4879b0e0a267f8d001da8", "author_rating": 9.0, "review_text": "This is indeed a great piece of superhero entertainment. If superheroes and action, plenty of action, is within your sphere of interest then this movie truly delivers. There is even a story to support the stunts and special effects fireworks that is not too shabby. As a matter of fact, for being a Marvel-based movie, the story is more than acceptable.\r\n\r\nAs the blurb states, our hero is meeting a few adaptation issues after having been awaken into the modern world. Luckily the movie do not fall into the trap of making some silly comedy out of it but keeps these parts at a reasonable level where it stays funny without ruining the movie or disrupting the pace of the real story.\r\n\r\nThe story? Simple and not very original with the usual slew of traitors strewn about, you cannot trust anyone, our hero becomes a fugitive etc etc bla bla bla. It is however a pretty straightforward one which works quite well and is not getting bogged down in silly emotions and general idiotic behavior by our hero like for instance several instalments of Spider Man have done. Actually this is one thing that I really like with this movie. The hero is a true hero from start to finish without any of that modern Hollywood crap where the hero must be tarnished in one way or another to satisfy the directors and producers.\r\n\r\nAs I wrote above if you like superhero action movies then there is little not to like with this one. Acceptable story, plenty of action, good special effects, a cool chick (hey I am but an ordinary male, I like female actors in tight costumes) and a clear hero. None of the actors are really doing a bad job of it and in general the acting is as good as one can expect when portraying characters that, after all, are be totally ludicrous in real life. Its 8 out of 10 rating at IMDb (at the time of writing this) is well deserved. I am astonished that some people seem to have voted it down with a one star rating. It is a Marvel-based movie. You might feel it is more or less good but the style of the movie should not really be a major surprise to anyone and there is no way in hell that it deserves a one star rating unless someone really watched the wrong movie by accident.", "created_at": "2014-08-20T11:33:47.053Z"}, {"movie_id": 100402, "review_id": "544e11070e0a2608d4004175", "author_rating": 7.0, "review_text": "Put *a little* bit of brain in a superhero's movie script and you will have everybody talking wonders about it.\r\n\r\nThis is not a bad movie but neither astonishing. Fun and entertaining and with great FX, as expected.", "created_at": "2014-10-27T09:31:51.011Z"}, {"movie_id": 100402, "review_id": "54590aff0e0a261165002061", "author_rating": 7.0, "review_text": "The Winter Soldier has all the action, quirky one-liners, and bold adventure that we have come to expect of a Marvel movie.\r\n\r\nPlus we get introduced to a new/old villain as well as some fun romantic tension between Steve Rogers (Captain America) and Natasha Romanoff (The Black Widow).  (Scarlett Johansson is perfect in this role.)\r\n\r\nBut this film also has some minor irritations all stemming from Marvel's tendency to make _Captain America_ more complicated than it really needs to be.\r\n\r\nMINOR SPOILER ALERT:\r\n1. The love story/non-story.  Is this necessary? Will the Captain remain faithful to a 80 year-old woman on her deathbed OR engage in a date with his next door neighbor?  Plus the tension between him and Natasha Romanoff is intense.  This comes off as forced, awkward, and pointless.\r\n\r\n2. “The deception goes deeper than you can imagine. You can’t trust anybody.”  It's this way every time so it should no longer be a surprise.\r\n\r\n3. He’s dead but not really. Not him, the other him. Well…they both were dead – not really – but now they are both alive. But one of them can’t remember who he really is. In this film we get to do this with two characters instead of one.  It’s not a huge distraction but why does Marvel keep returning to this plot line? \r\n\r\nEND OF MINOR SPOILER ALERT\r\n\r\nThe Winter Soldier is best when Rogers and Romanoff are on the move trying to put the pieces of the puzzle together. The explosions are nice, the action scenes are intense but the real enjoyment of the film is where skill and wits are relied on more than gadgets and explosions. \r\n\r\nPatriotism is a bit more nuanced this time around and it's better for it.  The cast is great, no awkward acting moments to report. It’s a great summer flick with all the action you want.", "created_at": "2014-11-04T17:21:03.746Z"}, {"movie_id": 100402, "review_id": "55e43b63c3a368418e0035a3", "author_rating": 9.0, "review_text": "Till the end of the road.\r\n\r\nStonking! Now this is more like it, after the disappointments that have been Iron Man 2 and Thor 2, Captain America gets a sequel of substance and sparks. It manages to blend everything required to make a great superhero film, lashings of derring-do heroics, action bonanza, adventure, some sexy sizzle and of course the key, a story with brains and mystery elements.\r\n\r\nTrue enough to say that the considerable contributions of Black Widow and Falcon (and Nick Fury of course) keeps this as a lively Avengers spin-off movie, which is no bad thing at all, but it's still the Captain who dominates things, marking himself out as a viable main man. In fact the whole film has the old school comic book feel, yes there's the grandiose pyrotechnics - unsurprisingly amped up for the big finale, but there's an adherence to serial thriller conventions that is, well, rather warm and comforting.\r\n\r\nWith the Captain getting some surprising amount of emotional depth and humanity courtesy of the perfectly cast Chris Evans, the viewers have much to care about. Themes of Bondian world domination and global security crisis keep things nice and fanciful, while the unheralded work by the effects guys is modern cinematic art. There's some adherence to genre formula, and a bit of Marvel universe copy-catting going on, but this is one of the best films from the Marvel stable. A rich sequel indeed - more Captain America please. 9/10", "created_at": "2015-08-31T11:32:51.183Z"}, {"movie_id": 100402, "review_id": "5a2ccb3ac3a3680b8f145cdc", "author_rating": 9.0, "review_text": "**A long format review from 2014**\r\n\r\nMisleadingly, the titular Winter Soldier is essentially a minor subplot in what is more of an espionage-technoir-thriller meets spectacle-epic than your typical super hero film. The real meat of the movie, thankfully, has some more substance behind it. Though it wouldn't surprise me if we learn later that Sebastian Stan's villain was forced to take a back seat via last minute script changes à la Hawkeye in _The Avengers_.\r\n\r\nThese things are of course a matter of opinion, and I'd like to watch _Winter Soldier_ at least once more (particularly in 2D... God do I ever hate 3D) before committing to any particular ranking. But even without that, I feel confident in saying it's the best MCU Phase 2 film to date. We must await _Guardians of The Galaxy_ and _Age of Ultron_ before cementing that little award, but I'd say that it stands at the very least above _Iron Man 3_ and _The Dark World_.\r\n\r\nI always try to keep my reviews spoiler free, but being that in most parts of the world it isn't out yet, I'll be extra careful to do so with this one. This makes talking about _Winter Soldier_ on its own merits difficult, but there are certainly a few things that can be said.\r\n\r\nChris Evans (Cap'), Scarlett Johansson (Black Widow) and to a slightly lesser extent. Anthonie Mackie (Falcon) rule the film, and do so without any shortcomings. That's not to say that they couldn't physically have done any better, but their roles were all seamless as far as my blurred vision could tell, which is not an accolade I'd often give.\r\n\r\nWhere _The Dark World_ was simply a holding pattern for Thor with some very pretty pictures, _Iron Man 3_ and _The Winter Soldier_ went out and took some actual risks in their stories. But unlike _Iron Man 3's_, Winter Soldier's risks have (to its eternal credit) been universally well received.\r\n\r\nDirectors Joe and Anthony Russo also managed to cameo a couple of Community alumni, which will never be a bad thing in my eyes, even if they're just one-off, throwaway jokes.\r\n\r\nAs I said, I really feel I need to give _The Winter Soldier_ at the very least one more screening before I feel totally confident in my thoughts about it.\r\n\r\nBut the fact that I'm really fucking excited for that second viewing speaks in its favour if nothing else does.\r\n\r\n86%\r\n\r\n_-Gimly_", "created_at": "2017-12-10T05:50:50.967Z"}, {"movie_id": 100402, "review_id": "5c842694c3a3684e8cdacb97", "author_rating": 9.0, "review_text": "Captain America: The Winter Soldier opens up with an action sequence that's better than most action movie climaxes. It then sets up a really intriguing story before launching into one of the most suspenseful car chases since the Simpson/Bruckheimer 90s era. After that it's scene after scene of amazing action coupled with a complex story about heroes and villains being caught in a system that is too big to bring down, unless you're as good and level headed as Steve Rogers.\r\n\r\nThis isn't just a great comic book movie. It's a great movie; period. Using a spy thriller style mixed with martial arts and gunplay, set to the perfect music score, I would rank The Winter Soldier as one of my favourite action films hands down.", "created_at": "2019-03-09T20:48:20.066Z"}, {"movie_id": 100402, "review_id": "5ef02cbf5684630032031bc0", "author_rating": 10.0, "review_text": "Third time seeing this and still a fantastic all-around film, not just a comic book movie either. Briskly paced and a great complex story, this is a Marvel movie that felt complete from beginning to end, and actually advanced the universe so well. Chris Evans continues to embody the role and nice to see Scarlett Johansson given more to do (up to the point of this film's release) than in Iron Man 2 or The Avengers. **4.75/5**\r\n\r\nI probably rate this right alongside The Dark Knight amongst comic book movies and, saying this as a DC fan, perhaps edges out TDK (though could easily seeing roles reversed once I re-watch that one).", "created_at": "2020-06-22T03:59:59.038Z"}, {"movie_id": 100402, "review_id": "6004c3c97f6c8d003d747950", "author_rating": 8.0, "review_text": "Entertaining!\r\n\r\n<em>'Captain America: The Winter Soldier'</em> makes for an enjoyable flick. Chris Evans does great work as the lead character, while Scarlett Johansson gives her most fun to watch performance in the MCU up until this point; it would've been great if she had such a role pre-<em>'The Avengers'</em>, so she wouldn't have felt so out of place to me in that.\r\n\r\nAnthony Mackie and Robert Redford are notable in their respective roles, as is Sebastian Stan - even if, to be honest, his character's connection with the lead didn't quite hit as hard as the film attempts - at least for me. I didn't really believe how his character came about and how Barnes acts throughout, Stan does well though. Samuel L. Jackson is also good.\r\n\r\nEverything else is exactly what you'd expect from a film of this size. Great effects, entertaining action and a satisfying story. Very good, all in all.", "created_at": "2021-01-17T23:10:01.623Z"}, {"movie_id": 100402, "review_id": "624216d2fea0d7005c88d28a", "author_rating": 7.0, "review_text": "Picking up from his rather frosty denouement of 2011, \"Capt. America\" (Chris Evans) finds himself seventy years older but still with battles to fight. This time, he teams up with \"Nick Fury\" (Samuel L. Jackson) and his SHIELD agent \"Natasha\" (Scarlet Johansson) to combat the ruthless warrior known only as the \"Winter Soldier\". It doesn't take us long to discover that there is quite conspiracy going on too - with an attempt on the life of \"Fury\" before off we go on a roller-coaster ride of action adventure scenarios. The effects are great and the score works well to help keep the break-neck pace working well and excitingly. Evans is still just a little too pretty-boy for me, but the developing roles of Anthony Mackie, Johansson and a few cameos from the somewhat duplicitous \"Pierce\" (Robert Redford) all contribute well to make this a superior adventure film with a strong and characterful story underpinning it. It hasn't quite the charm of the first film, so I wouldn't say it is better - but it is certainly just as good, and as with the first outing, the 2¼ hours just flies by. Great cinema.", "created_at": "2022-03-28T20:13:06.310Z"}, {"movie_id": 100402, "review_id": "63e70a181277780081a30d0d", "author_rating": 8.0, "review_text": "**The darker tone and spy plot are a perfect fit for Captain America taking the MCU into new territory that results in one of the franchise’s very best.**\r\n\r\nThe Winter Soldier broke new ground for Marvel. The Russo Brothers took Captain America and immersed him in a dangerous world filled with subterfuge, spies, and betrayal. This was the first MCU film that didn’t feel as bright and light-hearted as its predecessors, and this new tone fit Cap’s story perfectly. The action was incredible. The plot twists kept piling up. Forcing Cap to question his moral compass and use his wits over his brawn to overcome his enemy were brilliant story decisions that developed the character and avoided the “bad guy with the same powers as the hero trope.” Black Widow’s inclusion in this spy adventure allowed Natasha to shine and further develop her morality. Everything in this film just works. I am admittedly not a major Captain America fan, but The Winter Solider overcomes all that to land this film on my favorite MCU list and comic book film list too!", "created_at": "2023-02-11T03:23:04.268Z"}, {"movie_id": 100402, "review_id": "6452a3ffc044290122cb6992", "author_rating": 7.0, "review_text": "Not as good as the first. Still a good movie though. The only thing I don't like is, he's suppose to be Captain America. With all these super powers. So why does he need help all time.", "created_at": "2023-05-03T18:12:15.976Z"}, {"movie_id": 100402, "review_id": "535868070e0a26067f0007d2", "author_rating": null, "review_text": "This movie is very good I loved it so much.", "created_at": "2014-04-24T01:25:27.917Z"}, {"movie_id": 100402, "review_id": "53f4879b0e0a267f8d001da8", "author_rating": 9.0, "review_text": "This is indeed a great piece of superhero entertainment. If superheroes and action, plenty of action, is within your sphere of interest then this movie truly delivers. There is even a story to support the stunts and special effects fireworks that is not too shabby. As a matter of fact, for being a Marvel-based movie, the story is more than acceptable.\r\n\r\nAs the blurb states, our hero is meeting a few adaptation issues after having been awaken into the modern world. Luckily the movie do not fall into the trap of making some silly comedy out of it but keeps these parts at a reasonable level where it stays funny without ruining the movie or disrupting the pace of the real story.\r\n\r\nThe story? Simple and not very original with the usual slew of traitors strewn about, you cannot trust anyone, our hero becomes a fugitive etc etc bla bla bla. It is however a pretty straightforward one which works quite well and is not getting bogged down in silly emotions and general idiotic behavior by our hero like for instance several instalments of Spider Man have done. Actually this is one thing that I really like with this movie. The hero is a true hero from start to finish without any of that modern Hollywood crap where the hero must be tarnished in one way or another to satisfy the directors and producers.\r\n\r\nAs I wrote above if you like superhero action movies then there is little not to like with this one. Acceptable story, plenty of action, good special effects, a cool chick (hey I am but an ordinary male, I like female actors in tight costumes) and a clear hero. None of the actors are really doing a bad job of it and in general the acting is as good as one can expect when portraying characters that, after all, are be totally ludicrous in real life. Its 8 out of 10 rating at IMDb (at the time of writing this) is well deserved. I am astonished that some people seem to have voted it down with a one star rating. It is a Marvel-based movie. You might feel it is more or less good but the style of the movie should not really be a major surprise to anyone and there is no way in hell that it deserves a one star rating unless someone really watched the wrong movie by accident.", "created_at": "2014-08-20T11:33:47.053Z"}, {"movie_id": 100402, "review_id": "544e11070e0a2608d4004175", "author_rating": 7.0, "review_text": "Put *a little* bit of brain in a superhero's movie script and you will have everybody talking wonders about it.\r\n\r\nThis is not a bad movie but neither astonishing. Fun and entertaining and with great FX, as expected.", "created_at": "2014-10-27T09:31:51.011Z"}, {"movie_id": 100402, "review_id": "54590aff0e0a261165002061", "author_rating": 7.0, "review_text": "The Winter Soldier has all the action, quirky one-liners, and bold adventure that we have come to expect of a Marvel movie.\r\n\r\nPlus we get introduced to a new/old villain as well as some fun romantic tension between Steve Rogers (Captain America) and Natasha Romanoff (The Black Widow).  (Scarlett Johansson is perfect in this role.)\r\n\r\nBut this film also has some minor irritations all stemming from Marvel's tendency to make _Captain America_ more complicated than it really needs to be.\r\n\r\nMINOR SPOILER ALERT:\r\n1. The love story/non-story.  Is this necessary? Will the Captain remain faithful to a 80 year-old woman on her deathbed OR engage in a date with his next door neighbor?  Plus the tension between him and Natasha Romanoff is intense.  This comes off as forced, awkward, and pointless.\r\n\r\n2. “The deception goes deeper than you can imagine. You can’t trust anybody.”  It's this way every time so it should no longer be a surprise.\r\n\r\n3. He’s dead but not really. Not him, the other him. Well…they both were dead – not really – but now they are both alive. But one of them can’t remember who he really is. In this film we get to do this with two characters instead of one.  It’s not a huge distraction but why does Marvel keep returning to this plot line? \r\n\r\nEND OF MINOR SPOILER ALERT\r\n\r\nThe Winter Soldier is best when Rogers and Romanoff are on the move trying to put the pieces of the puzzle together. The explosions are nice, the action scenes are intense but the real enjoyment of the film is where skill and wits are relied on more than gadgets and explosions. \r\n\r\nPatriotism is a bit more nuanced this time around and it's better for it.  The cast is great, no awkward acting moments to report. It’s a great summer flick with all the action you want.", "created_at": "2014-11-04T17:21:03.746Z"}, {"movie_id": 100402, "review_id": "55e43b63c3a368418e0035a3", "author_rating": 9.0, "review_text": "Till the end of the road.\r\n\r\nStonking! Now this is more like it, after the disappointments that have been Iron Man 2 and Thor 2, Captain America gets a sequel of substance and sparks. It manages to blend everything required to make a great superhero film, lashings of derring-do heroics, action bonanza, adventure, some sexy sizzle and of course the key, a story with brains and mystery elements.\r\n\r\nTrue enough to say that the considerable contributions of Black Widow and Falcon (and Nick Fury of course) keeps this as a lively Avengers spin-off movie, which is no bad thing at all, but it's still the Captain who dominates things, marking himself out as a viable main man. In fact the whole film has the old school comic book feel, yes there's the grandiose pyrotechnics - unsurprisingly amped up for the big finale, but there's an adherence to serial thriller conventions that is, well, rather warm and comforting.\r\n\r\nWith the Captain getting some surprising amount of emotional depth and humanity courtesy of the perfectly cast Chris Evans, the viewers have much to care about. Themes of Bondian world domination and global security crisis keep things nice and fanciful, while the unheralded work by the effects guys is modern cinematic art. There's some adherence to genre formula, and a bit of Marvel universe copy-catting going on, but this is one of the best films from the Marvel stable. A rich sequel indeed - more Captain America please. 9/10", "created_at": "2015-08-31T11:32:51.183Z"}, {"movie_id": 100402, "review_id": "5a2ccb3ac3a3680b8f145cdc", "author_rating": 9.0, "review_text": "**A long format review from 2014**\r\n\r\nMisleadingly, the titular Winter Soldier is essentially a minor subplot in what is more of an espionage-technoir-thriller meets spectacle-epic than your typical super hero film. The real meat of the movie, thankfully, has some more substance behind it. Though it wouldn't surprise me if we learn later that Sebastian Stan's villain was forced to take a back seat via last minute script changes à la Hawkeye in _The Avengers_.\r\n\r\nThese things are of course a matter of opinion, and I'd like to watch _Winter Soldier_ at least once more (particularly in 2D... God do I ever hate 3D) before committing to any particular ranking. But even without that, I feel confident in saying it's the best MCU Phase 2 film to date. We must await _Guardians of The Galaxy_ and _Age of Ultron_ before cementing that little award, but I'd say that it stands at the very least above _Iron Man 3_ and _The Dark World_.\r\n\r\nI always try to keep my reviews spoiler free, but being that in most parts of the world it isn't out yet, I'll be extra careful to do so with this one. This makes talking about _Winter Soldier_ on its own merits difficult, but there are certainly a few things that can be said.\r\n\r\nChris Evans (Cap'), Scarlett Johansson (Black Widow) and to a slightly lesser extent. Anthonie Mackie (Falcon) rule the film, and do so without any shortcomings. That's not to say that they couldn't physically have done any better, but their roles were all seamless as far as my blurred vision could tell, which is not an accolade I'd often give.\r\n\r\nWhere _The Dark World_ was simply a holding pattern for Thor with some very pretty pictures, _Iron Man 3_ and _The Winter Soldier_ went out and took some actual risks in their stories. But unlike _Iron Man 3's_, Winter Soldier's risks have (to its eternal credit) been universally well received.\r\n\r\nDirectors Joe and Anthony Russo also managed to cameo a couple of Community alumni, which will never be a bad thing in my eyes, even if they're just one-off, throwaway jokes.\r\n\r\nAs I said, I really feel I need to give _The Winter Soldier_ at the very least one more screening before I feel totally confident in my thoughts about it.\r\n\r\nBut the fact that I'm really fucking excited for that second viewing speaks in its favour if nothing else does.\r\n\r\n86%\r\n\r\n_-Gimly_", "created_at": "2017-12-10T05:50:50.967Z"}, {"movie_id": 100402, "review_id": "5c842694c3a3684e8cdacb97", "author_rating": 9.0, "review_text": "Captain America: The Winter Soldier opens up with an action sequence that's better than most action movie climaxes. It then sets up a really intriguing story before launching into one of the most suspenseful car chases since the Simpson/Bruckheimer 90s era. After that it's scene after scene of amazing action coupled with a complex story about heroes and villains being caught in a system that is too big to bring down, unless you're as good and level headed as Steve Rogers.\r\n\r\nThis isn't just a great comic book movie. It's a great movie; period. Using a spy thriller style mixed with martial arts and gunplay, set to the perfect music score, I would rank The Winter Soldier as one of my favourite action films hands down.", "created_at": "2019-03-09T20:48:20.066Z"}, {"movie_id": 100402, "review_id": "5ef02cbf5684630032031bc0", "author_rating": 10.0, "review_text": "Third time seeing this and still a fantastic all-around film, not just a comic book movie either. Briskly paced and a great complex story, this is a Marvel movie that felt complete from beginning to end, and actually advanced the universe so well. Chris Evans continues to embody the role and nice to see Scarlett Johansson given more to do (up to the point of this film's release) than in Iron Man 2 or The Avengers. **4.75/5**\r\n\r\nI probably rate this right alongside The Dark Knight amongst comic book movies and, saying this as a DC fan, perhaps edges out TDK (though could easily seeing roles reversed once I re-watch that one).", "created_at": "2020-06-22T03:59:59.038Z"}, {"movie_id": 100402, "review_id": "6004c3c97f6c8d003d747950", "author_rating": 8.0, "review_text": "Entertaining!\r\n\r\n<em>'Captain America: The Winter Soldier'</em> makes for an enjoyable flick. Chris Evans does great work as the lead character, while Scarlett Johansson gives her most fun to watch performance in the MCU up until this point; it would've been great if she had such a role pre-<em>'The Avengers'</em>, so she wouldn't have felt so out of place to me in that.\r\n\r\nAnthony Mackie and Robert Redford are notable in their respective roles, as is Sebastian Stan - even if, to be honest, his character's connection with the lead didn't quite hit as hard as the film attempts - at least for me. I didn't really believe how his character came about and how Barnes acts throughout, Stan does well though. Samuel L. Jackson is also good.\r\n\r\nEverything else is exactly what you'd expect from a film of this size. Great effects, entertaining action and a satisfying story. Very good, all in all.", "created_at": "2021-01-17T23:10:01.623Z"}, {"movie_id": 100402, "review_id": "624216d2fea0d7005c88d28a", "author_rating": 7.0, "review_text": "Picking up from his rather frosty denouement of 2011, \"Capt. America\" (Chris Evans) finds himself seventy years older but still with battles to fight. This time, he teams up with \"Nick Fury\" (Samuel L. Jackson) and his SHIELD agent \"Natasha\" (Scarlet Johansson) to combat the ruthless warrior known only as the \"Winter Soldier\". It doesn't take us long to discover that there is quite conspiracy going on too - with an attempt on the life of \"Fury\" before off we go on a roller-coaster ride of action adventure scenarios. The effects are great and the score works well to help keep the break-neck pace working well and excitingly. Evans is still just a little too pretty-boy for me, but the developing roles of Anthony Mackie, Johansson and a few cameos from the somewhat duplicitous \"Pierce\" (Robert Redford) all contribute well to make this a superior adventure film with a strong and characterful story underpinning it. It hasn't quite the charm of the first film, so I wouldn't say it is better - but it is certainly just as good, and as with the first outing, the 2¼ hours just flies by. Great cinema.", "created_at": "2022-03-28T20:13:06.310Z"}, {"movie_id": 100402, "review_id": "63e70a181277780081a30d0d", "author_rating": 8.0, "review_text": "**The darker tone and spy plot are a perfect fit for Captain America taking the MCU into new territory that results in one of the franchise’s very best.**\r\n\r\nThe Winter Soldier broke new ground for Marvel. The Russo Brothers took Captain America and immersed him in a dangerous world filled with subterfuge, spies, and betrayal. This was the first MCU film that didn’t feel as bright and light-hearted as its predecessors, and this new tone fit Cap’s story perfectly. The action was incredible. The plot twists kept piling up. Forcing Cap to question his moral compass and use his wits over his brawn to overcome his enemy were brilliant story decisions that developed the character and avoided the “bad guy with the same powers as the hero trope.” Black Widow’s inclusion in this spy adventure allowed Natasha to shine and further develop her morality. Everything in this film just works. I am admittedly not a major Captain America fan, but The Winter Solider overcomes all that to land this film on my favorite MCU list and comic book film list too!", "created_at": "2023-02-11T03:23:04.268Z"}, {"movie_id": 100402, "review_id": "6452a3ffc044290122cb6992", "author_rating": 7.0, "review_text": "Not as good as the first. Still a good movie though. The only thing I don't like is, he's suppose to be Captain America. With all these super powers. So why does he need help all time.", "created_at": "2023-05-03T18:12:15.976Z"}]