[{"movie_id": 479, "review_id": "559a837a9251413d99004b2e", "author_rating": 7.0, "review_text": "I know cats who'd take out whole zipcodes for that kind of cheese.\r\n\r\nRemakes do work occasionally, case in point Shaft, John Singleton's update of the 1971 Blacksploitation movie that starred Richard Roundtree as the title character. Roundtree gets a part in this one as well, playing the uncle of Samuel L. Jackson's title character, John Shaft.\r\n\r\nIt's the perfect role for Jackson, lashings of cool and menace, on his bulky shoulders dose the film easily rest. Plot finds Shaft turning in his badge after the law proves useless to let racist murderer Walter Wade Junior (Christian Bale a sneering villain but awesome looking in a tux) out on the streets. Shaft vows to bring Wade to justice, by any means necessary. Though he also has other things on his plate, namely Latino drug lord Peoples Hernandez (Jeffrey Wright a riot) and some less than honourable police officers.\r\n\r\nThe screenplay is a little trite, but as an action movie, one with the coolness and sparky humour, it really hits the required spots of those just after such easy minded fare. The support cast is a roll call of sound performers with the likes of Vanessa Williams, Dan Hedaya and Toni Collette fronting up, while the awesome ebullience of Busta Rhymes is very infectious.\r\n\r\nIsaac Hayes gloriously famous theme tune is still in place, pumped up by composer David Arnold, which ensures the feel of the original isn't lost, and Donald E. Thorin's photography is pin sharp and in turns gorgeous (night shots) and streetwise gritty. Shaft, the 2000 version, still bad-ass and sadly under appreciated. 7/10", "created_at": "2015-07-06T13:32:42.602Z"}, {"movie_id": 479, "review_id": "6110271465e0a2002683d2b6", "author_rating": 4.0, "review_text": "_**A black detective in Gotham desperately wants to nail a snooty racist murderer**_ \r\n\r\nThe nephew of the original John Shaft is a detective in New York City (Samuel L. Jackson) where he tries to apprehend an arrogant racist killer (Christian Bale) by finding a key witness (Toni Collette) while dealing with a gang lord (Jeffrey Wright) and corrupt cops. Vanessa Williams is on hand as a helpful officer.\r\n\r\n“Shaft” (2000) is a ‘hip’ crime thriller that resurrects the franchise 27 years after the original trilogy from 1971-1973 that featured Richard Roundtree in the title role (he returns here as the aged uncle). The cast and filmmaking are fine; the problem is the lame story with which they’re shackled. \r\n\r\nThe key crime in the opening act is glaringly weak. Bale’s character is a snooty punk born with a silver spoon in his mouth, but I didn’t buy his rash, racist actions at the night club. It just didn’t ring true, especially since he seems to get along with black people just fine the rest of the movie. Likewise, Collette’s actions aren’t convincing as the doe-eyed bartender. Simply put, the scriptwriters tried too hard to concoct a racist whitey villain when subtly was in order.\r\n\r\nIf you can roll with that serious flaw, there are enough thrills to amuse, including Jackson as the bad axx protagonist and Wright’s entertaining drug lord. Plus it’s always good to see the charming Vanessa Williams. \r\n\r\nThe film runs 1 hour, 39 minutes, and was shot in various areas of New York City, as well as nearby Newark. \r\n\r\nGRADE: C-", "created_at": "2021-08-08T18:48:52.852Z"}]