[{"movie_id": 49017, "review_id": "545a30060e0a261158004351", "author_rating": 5.0, "review_text": "FX, Evans and Dance's performances are the only things to save in this movie.\r\n\r\nIf you think Dracula becoming a hero and a martyr is a good idea, you will like it. Otherwise, like in my case, you will think that it was the worst idea in quite some time.\r\n\r\nSo, Dracula is not the most evil creature in the world any more ... :(", "created_at": "2014-11-05T14:11:18.661Z"}, {"movie_id": 49017, "review_id": "5a8c4e8dc3a36862a708acfb", "author_rating": 8.0, "review_text": "That the so called “critics” at Rotten Tomatoes screws this movie over is not really a surprise. Said “critics” are usually out of sync with both my opinions and the opinions of most of the viewers which can be seen again from the fact that these people give this movie a 23% rating whereas the actual viewers give it a 60% rating. At lot of “purists” also seem to take a disliking to this movie. Well, the movie is named Dracula Untold so it should be no surprise that the story would be a new one.\n\nPersonally I found this movie quite enjoyable. Yes it is not the original Dracula story but it is not straying too far from the basic origins and it is really a quite decent story unlike some of the disastrous Hollywood rewrites. The original story claims that Dracula became a vampire during his battles with the Turks and this movie picks up on that and tells the story of how that happened. Unlike most (all?) Dracula movies, Dracula is not really the bad guy but rather the inverse and the movie tells a story about sacrifices and Dracula’s quest to keep some of his humanity, moral and sanity.\n\nIt would not be a Dracula movie without some blood flowing and this movie delivers without overdoing it. Actually the actual bloodsucking stuff is quite played down until the end of the movie. There are a fair amount of fights against the Turks (who are the real bad guys in this movie) though and blood as well as various body parts no longer attached to their proper places does float around quite a bit. The special effects are not forgotten and I quite liked the bat swarms that Dracula commanded during the final fights against the Turks.\n\nI found Luke Evans performance as the prince and unwilling Dracula to be quite good. The rest of the characters were also well played. I am sure that none of them will be nominated for Oscars due to their part in this movie but I have nothing negative to say about their performance.\n\nOn the whole I found this movie quite enjoyable and I definitely disagree with all the people blasting it. I did also quite like the last couple of scenes in modern time at the end which teased of a follow up movie. I would definitely like to see that happen.", "created_at": "2018-02-20T16:36:29.851Z"}, {"movie_id": 49017, "review_id": "5af9ca24925141414b000407", "author_rating": 7.0, "review_text": "Dracula: The dark Superman\r\n\r\nRELEASED IN 2014 and directed by Gary Shore, \"Dracula Untold” tells the origin of Dracula: In the 15th century Prince Vlad the Impaler (Luke Evans) must protect his small kingdom of Wallachia (in modern-day Romania) from a Turk warlord (Dominic Cooper) who demands a thousand boys from Wallachia & Transylvania, including Vlad’s son. Threatened by the unsurmountable Turk army, Vlad desperately makes a dubious pact with a formidable caged vampire in order to acquire its dark powers and save his family & kingdom. Sarah Gadon plays Vlad’s winsome wife. \r\n\r\nThe producers flirted with the idea of “Dracula Untold” being part of Universal’s Dark Universe; and the epilogue of the movie, set in the modern world, suggests this, insinuating a franchise. This idea was dropped, however, and “The Mummy” (2017) became the first official film in the Dark Universe. In any case, “Dracula Untold” was fairly successful at the Box Office, making $56.3 million in North America and $217.1 million worldwide against a cost of $70 million.\r\n\r\nMy title blurb pretty much tells you all you need to know: “Dracula Untold” is basically the dark Superman of 15th century Eastern Europe where Dracula wields the power to defeat a thousand-man army. If you like the great prologue to Coppola’s “Bram Stoker’s Dracula” (1992), you’ll probably like this movie, which gives several nods to that forerunner. \r\n\r\nThe film LOOKS awesome and has a fine cast. But unlike “Bram Stoker’s Dracula,” it’s rapidly paced and doesn’t leave much room to breathe; so the characterizations aren’t quite deep enough. It’s good, but somehow hollow and forgettable. “Bram Stoker’s Dracula” was perhaps a little too slow while “Dracula Untold” is too hurried. I wish the creators found the happy medium between the two because, with just a little bit more time and attention to detail, it could’ve been great.              \r\n                   \r\nTHE MOVIE RUNS 1 hour, 32 minutes and was shot entirely in Northern Ireland. WRITERS: Matt Sazama and Burk Sharpless. \r\n \r\nGRADE: B", "created_at": "2018-05-14T17:40:52.186Z"}, {"movie_id": 49017, "review_id": "6323aca17a1bd6007e275495", "author_rating": 1.0, "review_text": "Bram Stoker's Count Dracula is textbook example of my Evil Iceberg Theory (the less you see of and know about a villain, the better). In an epistolary novel, the title character is the only one who doesn’t set his thoughts down in letters or in a diary (or, like Dr. Seward, a phonograph recording). \r\n\r\nIf, as Lovecraft wrote, \"The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown,\" then Dracula is the embodiment of this fear; inscrutable, unknowable, unreachable, impossible to negotiate or reason with. \r\n\r\nMoreover, it’s futile to try to assign him complex motivation; like the shark in Jaws or Dr. Lecter, the Count kills to feed — no more, no less. Taking all this into account, it's easy to see how bad an idea Dracula Untold really is.\r\n\r\nThe story is narrated — a long time after it took place, though oddly in the same childlike voice the narrator had when the events trasnspired — by Ingeras (Art Parkinson), son of Vlad III Draculea, aka the Impaler, aka Son of the Dragon, aka Son of the Devil, aka Dracula; let's just call him Vlad (Luke Evans). \r\n\r\n\"In the year of our Lord 1442, the Turkish sultan enslaved 1,000 children from Transylvania to fill the ranks of his army.\" One of these children grew up to become Vlad, who \"disgusted by his monstrous deeds ... buried his past with the dead and returned to Transylvania to rule in peace.\" So Vlad just took his ball and went home. Just like that, no revolt required. Someone should tell the Sultan how slavery really works.\r\n\r\nThis notwithstanding, Wallachia and Transylvania remain under Ottoman rule, and Vlad must pay an annual tribute to Sultan Mehmed II (Dominic Cooper); one can't help wondering why these two peoples are so hostile to each other, especially seeing how they share the lingua franca of British English. \r\n\r\nMehmed takes it upon himself to 'enslaving' a thousand other children (perhaps the first thousand just walked away like Vlad?), including Ingeras. Vlad refuses, and knowing that this means war, goes to a cave in a mountain to seek help from \"a vampire. From the Greek word pi, to drink [actually 'pi' is a Greek letter; the language in which it is a word that means 'drink' or 'suck' is Albanian]. The beast was once a mortal man who summoned a demon from the depths of hell to barter for his dark power. The demon deceived the man, granting his wish, but his price was an eternity condemned to the darkness of that cave, where he remains until he finds another to free him.\"\r\n\r\nThe cave vampire (Charles Dance), who once was a Roman and thus speaks, like all Romans do in the movies, the Queen's English, gives Vlad a sip of his blood, and with it “a taste of my power. The strength of 100 men. The speed of a shooting star. Domain of the night and all its creatures. See and hear through your senses. Even heal grievous wounds ... Once you drink, your thirst for human blood will be insatiable. But if you can hold out for three days, you will return to your mortal state having tasted my power, and perhaps saved your people. [What if I feed?] I will be freed having granted the darkness a worthy offering. You will become … like me. A scourge on this earth destined to destroy everything you love… I, however, will be free to unleash my wrath against the one who betrayed me. And one day, I will call upon you to serve me, my pawn, in an immortal game of revenge.\"\r\n\r\nAll this does is show that sometimes no explanation is the best explanation. Let's compare Coppola’s Dracula, in whose introduction — featuring modern Romanian dialogue with medieval English syntax (perhaps not historically correct but still much better than English-English) — Gary Oldman plunges his sword into the stone cross of a chapel, and drinks the blood that flows from it. \r\n\r\nThis doesn't necessarily make any more sense, but at least it's short and to the point, and Coppola has the good sense to not even try to explain it. \r\n\r\nConversely, all of Dracula Untold’s heavy exposition only raises more questions than it answers. How did this Roman guy end up in Transylvania? Are there no caves in Rome? Why can't he leave the cave and Vlad can? What exactly does \"an immortal game of revenge\" mean? This phrase simply reeks of oxymoron.\r\n\r\nSpeaking of Coppola, he was the second to make the character of Dracula and the historical Dracula one and the same person, and add a Reincarnation Romance to the plot (the first was Dan Curtis in his own 1974 Bram Stoker's Dracula, written by Richard Matheson). \r\n\r\nDirector Gary Shore and screenwriters Matt Sazama and Burk Sharpless repeat the formula in Dracula Untold, but their mistake is making an entire movie out of this premise. If they had done their homework, they would know that the link to Vlad III is tenuous at best, and that the real and probably only reason Stoker used the name 'Dracula' is because he was under the mistaken impression that it meant 'devil' in Romanian (but who knows; maybe the confusion of ' Greek pi' with Albanian 'pi' was a tribute to this linguistic faux pas on the Irish author’s part).", "created_at": "2022-09-15T22:52:17.775Z"}]