[{"movie_id": 99861, "review_id": "56351986c3a3681b59017d48", "author_rating": 6.5, "review_text": "There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.", "created_at": "2015-10-31T19:41:58.194Z"}, {"movie_id": 99861, "review_id": "5804e364c3a3686a3400000e", "author_rating": 7.0, "review_text": "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...", "created_at": "2016-10-17T14:42:44.693Z"}, {"movie_id": 99861, "review_id": "5a66d16ec3a3680cfb006191", "author_rating": 7.0, "review_text": "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.", "created_at": "2018-01-23T06:08:46.790Z"}, {"movie_id": 99861, "review_id": "5b1678d7c3a3685352018aad", "author_rating": 7.0, "review_text": "**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:49:43.675Z"}, {"movie_id": 99861, "review_id": "5c842655c3a3684e95db3e38", "author_rating": 5.0, "review_text": "The fact that Joss Whedon was able to salvage some sort of coherent film out of all he was forced to cram into a single movie is quite commendable. But the sad fact is that Avengers: Age of Ultron is really just a run of the mill \"bad guy wants to destroy the world for reasons\" actioner that we've seen done better many times before.\r\n\r\nDon't get me wrong. The movie's fun. The dialogue is frequently clever and humourous. And I really appreciated the quiet bits of storytelling that Whedon was able to sneak in. It's just that at the end of the day, the villain is weak sauce, there's way too much set up for other movies, and if I'm criticizing Man of Steel for having excessive destruction, I can't give Avengers a pass since they needlessly blow up not one, not two, but three cities. Pretty sure many insurance agencies went bankrupt paying out all the victims.", "created_at": "2019-03-09T20:47:17.431Z"}, {"movie_id": 99861, "review_id": "5dc32f5299259c00187a12c4", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-11-06T20:38:42.032Z"}, {"movie_id": 99861, "review_id": "5dc389ff8d22fc00143d1db1", "author_rating": null, "review_text": "This is the movie where Captain America became my favorite Avenger. Sure he doesn't have monstrous abilities like Iron Man and Hulk, but to be holding his own on the same ground as them is just a testament to how great of a hero he truly is.", "created_at": "2019-11-07T03:05:35.729Z"}, {"movie_id": 99861, "review_id": "5dc393227d2bc100133d151b", "author_rating": null, "review_text": "It has become a well-known fact that coming out with a sequel that's better than, if not on par with, the first one is an insane task. But kudos to Marvel for staying true to their colors with this sequel.", "created_at": "2019-11-07T03:44:34.837Z"}, {"movie_id": 99861, "review_id": "5dc399569d89390013350f9f", "author_rating": null, "review_text": "I expected more from Quicksilver.  He would've been a great addition to the Avengers.", "created_at": "2019-11-07T04:11:02.061Z"}, {"movie_id": 99861, "review_id": "5dc56e74470ead00189063a7", "author_rating": null, "review_text": "The thing that puzzles me is that in this film, Vision is presented to be a powerful hero, having the mind stone and all. But on the next films, he's become more of like a side character that just wasn't relevant anymore except for that little piece of stone on his forehead. Shame.", "created_at": "2019-11-08T13:32:36.277Z"}, {"movie_id": 99861, "review_id": "5dc579e46f8d950017c29a57", "author_rating": null, "review_text": "I'm glad to see that they found another role for Hawkeye other than being that one guy who seemed to be trying hard to keep up with the other more powerful heroes on the team. Now he's more of like the thing that keeps the team together and it suits his character well.", "created_at": "2019-11-08T14:21:24.351Z"}, {"movie_id": 99861, "review_id": "5e00e910d1a89300198cbe02", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-12-23T16:19:28.195Z"}, {"movie_id": 99861, "review_id": "5e00ee6875110d0011d84af1", "author_rating": null, "review_text": "Avengers: Age of Ultron\r\nI liked plenty of the stuff in it but it was pretty much the same as the first movie. Still a good watch though if you're not looking for anything serious.", "created_at": "2019-12-23T16:42:16.041Z"}, {"movie_id": 99861, "review_id": "5e01023d0284200019af5170", "author_rating": null, "review_text": "The humor in this movie was not as witty as the first one. It felt too childish and cheesy.", "created_at": "2019-12-23T18:06:53.750Z"}, {"movie_id": 99861, "review_id": "5e011ad70284200016af7e51", "author_rating": null, "review_text": "Still good, clean Avengers fun though a bit messier. The first one was still better.", "created_at": "2019-12-23T19:51:51.123Z"}, {"movie_id": 99861, "review_id": "5e02863c26dac10012674860", "author_rating": null, "review_text": "With the vast array of heroes and their own personal character stories, you can expect how much of a challenge it is to bring together all these superheroes and have them work on a single mission on a single timeline. It's not easy, experts.", "created_at": "2019-12-24T21:42:20.693Z"}, {"movie_id": 99861, "review_id": "5e08fd574a2226001728f48c", "author_rating": null, "review_text": "I confirmed in this movie that what's really making these films successful is the chemistry that the actors have. You can really see that everyone's doing their best.", "created_at": "2019-12-29T19:24:07.133Z"}, {"movie_id": 99861, "review_id": "5e091e34a1c59d0018ab0aea", "author_rating": null, "review_text": "Strong film from beginning to end. Has just enough humor, angst, and drama to make it a film worthy to be called a sequel.", "created_at": "2019-12-29T21:44:20.547Z"}, {"movie_id": 99861, "review_id": "5e09b6c91684f700159c39d1", "author_rating": null, "review_text": "If you're a fan of action, suspense, and awe worthy moments, then this movie is the right fit for you! Overall outstanding performance by everyone both on and off screen.", "created_at": "2019-12-30T08:35:21.957Z"}, {"movie_id": 99861, "review_id": "5e0e0c5468b1ea00187f406e", "author_rating": null, "review_text": "Despite the challenge of having to top their first Avengers film, Marvel did beautifully and the result was amazing. I hope to see more films like this in the future.", "created_at": "2020-01-02T15:29:24.122Z"}, {"movie_id": 99861, "review_id": "5e0e16226dc6c000184d0ec2", "author_rating": null, "review_text": "I see a lot of negative reviews directed at the humor in this movie. All I can say is that Marvel, since the beginning, has used this same format for their movies so I don't understand why \"fans\" are now criticizing the banter.", "created_at": "2020-01-02T16:11:14.409Z"}, {"movie_id": 99861, "review_id": "5e0e201e6dc6c000154cccd7", "author_rating": null, "review_text": "Compared to the first movie, this one was much more fast-paced and had more action scenes in it. We don't see a lot of character development but it's still enjoyable!", "created_at": "2020-01-02T16:53:50.894Z"}, {"movie_id": 99861, "review_id": "5e0e29f168b1ea00137fc3d3", "author_rating": null, "review_text": "Everyone else saying that there's not enough character development for the superheroes in this movie needs to remember the solo films for Iron Man, Captain America, and Thor. Do you want character development? Go watch those movies.", "created_at": "2020-01-02T17:35:45.375Z"}, {"movie_id": 99861, "review_id": "5e0e408612c60400174007c7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:06.751Z"}, {"movie_id": 99861, "review_id": "5e0e4087c2f44b00172fcdb7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:07.019Z"}, {"movie_id": 99861, "review_id": "5e0e529868b1ea00187f9d59", "author_rating": null, "review_text": "This was clearly a level-up from their first film. Although much more action-oriented, the production value still screams Marvel and what I liked most is the refinement of the collaborative action scenes.", "created_at": "2020-01-02T20:29:12.073Z"}, {"movie_id": 99861, "review_id": "5e0f07e95907de0012d74f33", "author_rating": null, "review_text": "Not as good as the first one... because it's BETTER! Marvel really knows how to make it work and they're at the top of their game right now.", "created_at": "2020-01-03T09:22:49.359Z"}, {"movie_id": 99861, "review_id": "5e0f2e39663b8700137ed8c1", "author_rating": null, "review_text": "Plot line is far from the cliche superhero story. Scriptwriters did a great job inserting that original, witty Marvel humor in between scenes to dispel some of the seriousness that's usually accompanied in these types of films.", "created_at": "2020-01-03T12:06:17.704Z"}, {"movie_id": 99861, "review_id": "5e104eba5907de0014da1425", "author_rating": null, "review_text": "Both Robert Downey Jr and Chris Evans really solidified their roles as the main Avengers in this film. Would love to see more of them!", "created_at": "2020-01-04T08:37:14.707Z"}, {"movie_id": 99861, "review_id": "5e1212979020120013b5c9b7", "author_rating": null, "review_text": "Man this movie really got me hooked and now I'm part of the Avengers bandwagon. Count me in on whatever nerdy stuff you guys do.", "created_at": "2020-01-05T16:45:11.926Z"}, {"movie_id": 99861, "review_id": "5e124864fc5f0600178f7778", "author_rating": null, "review_text": "Marvel is dominating the superhero film genre and it looks like they'll be sitting on the throne for years to come. How they make it work even with the huge amount of heroes they have is impressive. Hopefully this doesn't backfire anytime soon.", "created_at": "2020-01-05T20:34:44.219Z"}, {"movie_id": 99861, "review_id": "5e125a5a5907de0017deaaad", "author_rating": null, "review_text": "If you read the comics, you'll see that this isn't just another direct copy and paste of the storyline. Marvel is great enough to make some changes.", "created_at": "2020-01-05T21:51:22.583Z"}, {"movie_id": 99861, "review_id": "5e12c5cad64ac2001865d284", "author_rating": null, "review_text": "Solid choreography and the storyline was pretty decent. I personally liked the first film better but this is still a good, fun watch.", "created_at": "2020-01-06T05:29:46.555Z"}, {"movie_id": 99861, "review_id": "5e12c9ddd64ac20016653377", "author_rating": null, "review_text": "The only reason I can think of why someone would not like this movie is because they either have not seen the other films Marvel has released or they just don't understand how Marvel creates a film.", "created_at": "2020-01-06T05:47:09.283Z"}, {"movie_id": 99861, "review_id": "5e12cdd7d64ac2001465016f", "author_rating": null, "review_text": "I found the writing in this film to be witty and sharp. The humor was on point and I laughed way more than I should.", "created_at": "2020-01-06T06:04:07.311Z"}, {"movie_id": 99861, "review_id": "5e12d1dc5907de0014dec438", "author_rating": null, "review_text": "Compared to the first Avengers, there's a lot of things that they improved on in this film. From the storytelling, to the much more defined fight choreography, it's definitely a step-up from the previous one.", "created_at": "2020-01-06T06:21:16.963Z"}, {"movie_id": 99861, "review_id": "5e20d56f8f26bc001371c649", "author_rating": null, "review_text": "Don't be brainwashed. This is just a remix of the first Avenger movie. Nothing new here except for the new heroes but plot-wise it's pretty much the same thing.", "created_at": "2020-01-16T21:28:15.117Z"}, {"movie_id": 99861, "review_id": "5e20dedc397df000129666b8", "author_rating": null, "review_text": "It's just what I feared. Marvel has gotten so caught up in making sure that each character gets some action time that there's no room now for character development. They need to tone it down a bit.", "created_at": "2020-01-16T22:08:28.630Z"}, {"movie_id": 99861, "review_id": "5ef819bba284eb00398dc810", "author_rating": 7.0, "review_text": "Third viewing of this and while not the strongest within the MCU, or of the other Avenger movies, still has some good parts (introduction to Elizabeth Olsen's Scarlet Witch and Paul Bettany's Vision; further setting into motion the infinity stones, New Avengers, etc) while the plot as a whole felt messy at times. Still, found it entertaining especially seeing where the MCU was going since. **3.5/5**", "created_at": "2020-06-28T04:16:59.341Z"}, {"movie_id": 99861, "review_id": "600616349a358d0040c2ecad", "author_rating": 7.0, "review_text": "Cool seeing them all together again, even if I didn't massively enjoy it. It's good, nothing more or less in my opinion.\r\n\r\n<em>'Avengers: Age of Ultron'</em> isn't too far off 2012's <em>'The Avengers'</em>, especially in terms of how I fell about it. I definitely wanted more from both, yet they are still satisfying superhero action flicks. I'd rank this narrowly below the aforementioned.\r\n\r\nRobert Downey Jr. felt a little flat to me as Iron Man - he still has a decent amount of moments, just not as many as you get in his individual films. All the others continue to entertain to an equally suitable level, I didn't overly like the characters of Aaron Taylor-Johnson and Elizabeth Olsen but I also don't have any noteworthy negatives about them. The story between Scarlett Johansson and Mark Ruffalo didn't do much for me either.\r\n\r\nWith that noted, it is still an enjoyable ride through the 141 minute run time. The ending is intriguing, interested to see where that goes - I have a minor inkling about the mid-credits scene, given all the internet attention that has had - even for someone like me who knows very little overall.", "created_at": "2021-01-18T23:13:56.078Z"}, {"movie_id": 99861, "review_id": "56351986c3a3681b59017d48", "author_rating": 6.5, "review_text": "There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.", "created_at": "2015-10-31T19:41:58.194Z"}, {"movie_id": 99861, "review_id": "5804e364c3a3686a3400000e", "author_rating": 7.0, "review_text": "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...", "created_at": "2016-10-17T14:42:44.693Z"}, {"movie_id": 99861, "review_id": "5a66d16ec3a3680cfb006191", "author_rating": 7.0, "review_text": "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.", "created_at": "2018-01-23T06:08:46.790Z"}, {"movie_id": 99861, "review_id": "5b1678d7c3a3685352018aad", "author_rating": 7.0, "review_text": "**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:49:43.675Z"}, {"movie_id": 99861, "review_id": "5c842655c3a3684e95db3e38", "author_rating": 5.0, "review_text": "The fact that Joss Whedon was able to salvage some sort of coherent film out of all he was forced to cram into a single movie is quite commendable. But the sad fact is that Avengers: Age of Ultron is really just a run of the mill \"bad guy wants to destroy the world for reasons\" actioner that we've seen done better many times before.\r\n\r\nDon't get me wrong. The movie's fun. The dialogue is frequently clever and humourous. And I really appreciated the quiet bits of storytelling that Whedon was able to sneak in. It's just that at the end of the day, the villain is weak sauce, there's way too much set up for other movies, and if I'm criticizing Man of Steel for having excessive destruction, I can't give Avengers a pass since they needlessly blow up not one, not two, but three cities. Pretty sure many insurance agencies went bankrupt paying out all the victims.", "created_at": "2019-03-09T20:47:17.431Z"}, {"movie_id": 99861, "review_id": "5dc32f5299259c00187a12c4", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-11-06T20:38:42.032Z"}, {"movie_id": 99861, "review_id": "5dc389ff8d22fc00143d1db1", "author_rating": null, "review_text": "This is the movie where Captain America became my favorite Avenger. Sure he doesn't have monstrous abilities like Iron Man and Hulk, but to be holding his own on the same ground as them is just a testament to how great of a hero he truly is.", "created_at": "2019-11-07T03:05:35.729Z"}, {"movie_id": 99861, "review_id": "5dc393227d2bc100133d151b", "author_rating": null, "review_text": "It has become a well-known fact that coming out with a sequel that's better than, if not on par with, the first one is an insane task. But kudos to Marvel for staying true to their colors with this sequel.", "created_at": "2019-11-07T03:44:34.837Z"}, {"movie_id": 99861, "review_id": "5dc399569d89390013350f9f", "author_rating": null, "review_text": "I expected more from Quicksilver.  He would've been a great addition to the Avengers.", "created_at": "2019-11-07T04:11:02.061Z"}, {"movie_id": 99861, "review_id": "5dc56e74470ead00189063a7", "author_rating": null, "review_text": "The thing that puzzles me is that in this film, Vision is presented to be a powerful hero, having the mind stone and all. But on the next films, he's become more of like a side character that just wasn't relevant anymore except for that little piece of stone on his forehead. Shame.", "created_at": "2019-11-08T13:32:36.277Z"}, {"movie_id": 99861, "review_id": "5dc579e46f8d950017c29a57", "author_rating": null, "review_text": "I'm glad to see that they found another role for Hawkeye other than being that one guy who seemed to be trying hard to keep up with the other more powerful heroes on the team. Now he's more of like the thing that keeps the team together and it suits his character well.", "created_at": "2019-11-08T14:21:24.351Z"}, {"movie_id": 99861, "review_id": "5e00e910d1a89300198cbe02", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-12-23T16:19:28.195Z"}, {"movie_id": 99861, "review_id": "5e00ee6875110d0011d84af1", "author_rating": null, "review_text": "Avengers: Age of Ultron\r\nI liked plenty of the stuff in it but it was pretty much the same as the first movie. Still a good watch though if you're not looking for anything serious.", "created_at": "2019-12-23T16:42:16.041Z"}, {"movie_id": 99861, "review_id": "5e01023d0284200019af5170", "author_rating": null, "review_text": "The humor in this movie was not as witty as the first one. It felt too childish and cheesy.", "created_at": "2019-12-23T18:06:53.750Z"}, {"movie_id": 99861, "review_id": "5e011ad70284200016af7e51", "author_rating": null, "review_text": "Still good, clean Avengers fun though a bit messier. The first one was still better.", "created_at": "2019-12-23T19:51:51.123Z"}, {"movie_id": 99861, "review_id": "5e02863c26dac10012674860", "author_rating": null, "review_text": "With the vast array of heroes and their own personal character stories, you can expect how much of a challenge it is to bring together all these superheroes and have them work on a single mission on a single timeline. It's not easy, experts.", "created_at": "2019-12-24T21:42:20.693Z"}, {"movie_id": 99861, "review_id": "5e08fd574a2226001728f48c", "author_rating": null, "review_text": "I confirmed in this movie that what's really making these films successful is the chemistry that the actors have. You can really see that everyone's doing their best.", "created_at": "2019-12-29T19:24:07.133Z"}, {"movie_id": 99861, "review_id": "5e091e34a1c59d0018ab0aea", "author_rating": null, "review_text": "Strong film from beginning to end. Has just enough humor, angst, and drama to make it a film worthy to be called a sequel.", "created_at": "2019-12-29T21:44:20.547Z"}, {"movie_id": 99861, "review_id": "5e09b6c91684f700159c39d1", "author_rating": null, "review_text": "If you're a fan of action, suspense, and awe worthy moments, then this movie is the right fit for you! Overall outstanding performance by everyone both on and off screen.", "created_at": "2019-12-30T08:35:21.957Z"}, {"movie_id": 99861, "review_id": "5e0e0c5468b1ea00187f406e", "author_rating": null, "review_text": "Despite the challenge of having to top their first Avengers film, Marvel did beautifully and the result was amazing. I hope to see more films like this in the future.", "created_at": "2020-01-02T15:29:24.122Z"}, {"movie_id": 99861, "review_id": "5e0e16226dc6c000184d0ec2", "author_rating": null, "review_text": "I see a lot of negative reviews directed at the humor in this movie. All I can say is that Marvel, since the beginning, has used this same format for their movies so I don't understand why \"fans\" are now criticizing the banter.", "created_at": "2020-01-02T16:11:14.409Z"}, {"movie_id": 99861, "review_id": "5e0e201e6dc6c000154cccd7", "author_rating": null, "review_text": "Compared to the first movie, this one was much more fast-paced and had more action scenes in it. We don't see a lot of character development but it's still enjoyable!", "created_at": "2020-01-02T16:53:50.894Z"}, {"movie_id": 99861, "review_id": "5e0e29f168b1ea00137fc3d3", "author_rating": null, "review_text": "Everyone else saying that there's not enough character development for the superheroes in this movie needs to remember the solo films for Iron Man, Captain America, and Thor. Do you want character development? Go watch those movies.", "created_at": "2020-01-02T17:35:45.375Z"}, {"movie_id": 99861, "review_id": "5e0e408612c60400174007c7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:06.751Z"}, {"movie_id": 99861, "review_id": "5e0e4087c2f44b00172fcdb7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:07.019Z"}, {"movie_id": 99861, "review_id": "5e0e529868b1ea00187f9d59", "author_rating": null, "review_text": "This was clearly a level-up from their first film. Although much more action-oriented, the production value still screams Marvel and what I liked most is the refinement of the collaborative action scenes.", "created_at": "2020-01-02T20:29:12.073Z"}, {"movie_id": 99861, "review_id": "5e0f07e95907de0012d74f33", "author_rating": null, "review_text": "Not as good as the first one... because it's BETTER! Marvel really knows how to make it work and they're at the top of their game right now.", "created_at": "2020-01-03T09:22:49.359Z"}, {"movie_id": 99861, "review_id": "5e0f2e39663b8700137ed8c1", "author_rating": null, "review_text": "Plot line is far from the cliche superhero story. Scriptwriters did a great job inserting that original, witty Marvel humor in between scenes to dispel some of the seriousness that's usually accompanied in these types of films.", "created_at": "2020-01-03T12:06:17.704Z"}, {"movie_id": 99861, "review_id": "5e104eba5907de0014da1425", "author_rating": null, "review_text": "Both Robert Downey Jr and Chris Evans really solidified their roles as the main Avengers in this film. Would love to see more of them!", "created_at": "2020-01-04T08:37:14.707Z"}, {"movie_id": 99861, "review_id": "5e1212979020120013b5c9b7", "author_rating": null, "review_text": "Man this movie really got me hooked and now I'm part of the Avengers bandwagon. Count me in on whatever nerdy stuff you guys do.", "created_at": "2020-01-05T16:45:11.926Z"}, {"movie_id": 99861, "review_id": "5e124864fc5f0600178f7778", "author_rating": null, "review_text": "Marvel is dominating the superhero film genre and it looks like they'll be sitting on the throne for years to come. How they make it work even with the huge amount of heroes they have is impressive. Hopefully this doesn't backfire anytime soon.", "created_at": "2020-01-05T20:34:44.219Z"}, {"movie_id": 99861, "review_id": "5e125a5a5907de0017deaaad", "author_rating": null, "review_text": "If you read the comics, you'll see that this isn't just another direct copy and paste of the storyline. Marvel is great enough to make some changes.", "created_at": "2020-01-05T21:51:22.583Z"}, {"movie_id": 99861, "review_id": "5e12c5cad64ac2001865d284", "author_rating": null, "review_text": "Solid choreography and the storyline was pretty decent. I personally liked the first film better but this is still a good, fun watch.", "created_at": "2020-01-06T05:29:46.555Z"}, {"movie_id": 99861, "review_id": "5e12c9ddd64ac20016653377", "author_rating": null, "review_text": "The only reason I can think of why someone would not like this movie is because they either have not seen the other films Marvel has released or they just don't understand how Marvel creates a film.", "created_at": "2020-01-06T05:47:09.283Z"}, {"movie_id": 99861, "review_id": "5e12cdd7d64ac2001465016f", "author_rating": null, "review_text": "I found the writing in this film to be witty and sharp. The humor was on point and I laughed way more than I should.", "created_at": "2020-01-06T06:04:07.311Z"}, {"movie_id": 99861, "review_id": "5e12d1dc5907de0014dec438", "author_rating": null, "review_text": "Compared to the first Avengers, there's a lot of things that they improved on in this film. From the storytelling, to the much more defined fight choreography, it's definitely a step-up from the previous one.", "created_at": "2020-01-06T06:21:16.963Z"}, {"movie_id": 99861, "review_id": "5e20d56f8f26bc001371c649", "author_rating": null, "review_text": "Don't be brainwashed. This is just a remix of the first Avenger movie. Nothing new here except for the new heroes but plot-wise it's pretty much the same thing.", "created_at": "2020-01-16T21:28:15.117Z"}, {"movie_id": 99861, "review_id": "5e20dedc397df000129666b8", "author_rating": null, "review_text": "It's just what I feared. Marvel has gotten so caught up in making sure that each character gets some action time that there's no room now for character development. They need to tone it down a bit.", "created_at": "2020-01-16T22:08:28.630Z"}, {"movie_id": 99861, "review_id": "5ef819bba284eb00398dc810", "author_rating": 7.0, "review_text": "Third viewing of this and while not the strongest within the MCU, or of the other Avenger movies, still has some good parts (introduction to Elizabeth Olsen's Scarlet Witch and Paul Bettany's Vision; further setting into motion the infinity stones, New Avengers, etc) while the plot as a whole felt messy at times. Still, found it entertaining especially seeing where the MCU was going since. **3.5/5**", "created_at": "2020-06-28T04:16:59.341Z"}, {"movie_id": 99861, "review_id": "600616349a358d0040c2ecad", "author_rating": 7.0, "review_text": "Cool seeing them all together again, even if I didn't massively enjoy it. It's good, nothing more or less in my opinion.\r\n\r\n<em>'Avengers: Age of Ultron'</em> isn't too far off 2012's <em>'The Avengers'</em>, especially in terms of how I fell about it. I definitely wanted more from both, yet they are still satisfying superhero action flicks. I'd rank this narrowly below the aforementioned.\r\n\r\nRobert Downey Jr. felt a little flat to me as Iron Man - he still has a decent amount of moments, just not as many as you get in his individual films. All the others continue to entertain to an equally suitable level, I didn't overly like the characters of Aaron Taylor-Johnson and Elizabeth Olsen but I also don't have any noteworthy negatives about them. The story between Scarlett Johansson and Mark Ruffalo didn't do much for me either.\r\n\r\nWith that noted, it is still an enjoyable ride through the 141 minute run time. The ending is intriguing, interested to see where that goes - I have a minor inkling about the mid-credits scene, given all the internet attention that has had - even for someone like me who knows very little overall.", "created_at": "2021-01-18T23:13:56.078Z"}, {"movie_id": 99861, "review_id": "56351986c3a3681b59017d48", "author_rating": 6.5, "review_text": "There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.", "created_at": "2015-10-31T19:41:58.194Z"}, {"movie_id": 99861, "review_id": "5804e364c3a3686a3400000e", "author_rating": 7.0, "review_text": "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...", "created_at": "2016-10-17T14:42:44.693Z"}, {"movie_id": 99861, "review_id": "5a66d16ec3a3680cfb006191", "author_rating": 7.0, "review_text": "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.", "created_at": "2018-01-23T06:08:46.790Z"}, {"movie_id": 99861, "review_id": "5b1678d7c3a3685352018aad", "author_rating": 7.0, "review_text": "**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:49:43.675Z"}, {"movie_id": 99861, "review_id": "5c842655c3a3684e95db3e38", "author_rating": 5.0, "review_text": "The fact that Joss Whedon was able to salvage some sort of coherent film out of all he was forced to cram into a single movie is quite commendable. But the sad fact is that Avengers: Age of Ultron is really just a run of the mill \"bad guy wants to destroy the world for reasons\" actioner that we've seen done better many times before.\r\n\r\nDon't get me wrong. The movie's fun. The dialogue is frequently clever and humourous. And I really appreciated the quiet bits of storytelling that Whedon was able to sneak in. It's just that at the end of the day, the villain is weak sauce, there's way too much set up for other movies, and if I'm criticizing Man of Steel for having excessive destruction, I can't give Avengers a pass since they needlessly blow up not one, not two, but three cities. Pretty sure many insurance agencies went bankrupt paying out all the victims.", "created_at": "2019-03-09T20:47:17.431Z"}, {"movie_id": 99861, "review_id": "5dc32f5299259c00187a12c4", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-11-06T20:38:42.032Z"}, {"movie_id": 99861, "review_id": "5dc389ff8d22fc00143d1db1", "author_rating": null, "review_text": "This is the movie where Captain America became my favorite Avenger. Sure he doesn't have monstrous abilities like Iron Man and Hulk, but to be holding his own on the same ground as them is just a testament to how great of a hero he truly is.", "created_at": "2019-11-07T03:05:35.729Z"}, {"movie_id": 99861, "review_id": "5dc393227d2bc100133d151b", "author_rating": null, "review_text": "It has become a well-known fact that coming out with a sequel that's better than, if not on par with, the first one is an insane task. But kudos to Marvel for staying true to their colors with this sequel.", "created_at": "2019-11-07T03:44:34.837Z"}, {"movie_id": 99861, "review_id": "5dc399569d89390013350f9f", "author_rating": null, "review_text": "I expected more from Quicksilver.  He would've been a great addition to the Avengers.", "created_at": "2019-11-07T04:11:02.061Z"}, {"movie_id": 99861, "review_id": "5dc56e74470ead00189063a7", "author_rating": null, "review_text": "The thing that puzzles me is that in this film, Vision is presented to be a powerful hero, having the mind stone and all. But on the next films, he's become more of like a side character that just wasn't relevant anymore except for that little piece of stone on his forehead. Shame.", "created_at": "2019-11-08T13:32:36.277Z"}, {"movie_id": 99861, "review_id": "5dc579e46f8d950017c29a57", "author_rating": null, "review_text": "I'm glad to see that they found another role for Hawkeye other than being that one guy who seemed to be trying hard to keep up with the other more powerful heroes on the team. Now he's more of like the thing that keeps the team together and it suits his character well.", "created_at": "2019-11-08T14:21:24.351Z"}, {"movie_id": 99861, "review_id": "5e00e910d1a89300198cbe02", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-12-23T16:19:28.195Z"}, {"movie_id": 99861, "review_id": "5e00ee6875110d0011d84af1", "author_rating": null, "review_text": "Avengers: Age of Ultron\r\nI liked plenty of the stuff in it but it was pretty much the same as the first movie. Still a good watch though if you're not looking for anything serious.", "created_at": "2019-12-23T16:42:16.041Z"}, {"movie_id": 99861, "review_id": "5e01023d0284200019af5170", "author_rating": null, "review_text": "The humor in this movie was not as witty as the first one. It felt too childish and cheesy.", "created_at": "2019-12-23T18:06:53.750Z"}, {"movie_id": 99861, "review_id": "5e011ad70284200016af7e51", "author_rating": null, "review_text": "Still good, clean Avengers fun though a bit messier. The first one was still better.", "created_at": "2019-12-23T19:51:51.123Z"}, {"movie_id": 99861, "review_id": "5e02863c26dac10012674860", "author_rating": null, "review_text": "With the vast array of heroes and their own personal character stories, you can expect how much of a challenge it is to bring together all these superheroes and have them work on a single mission on a single timeline. It's not easy, experts.", "created_at": "2019-12-24T21:42:20.693Z"}, {"movie_id": 99861, "review_id": "5e08fd574a2226001728f48c", "author_rating": null, "review_text": "I confirmed in this movie that what's really making these films successful is the chemistry that the actors have. You can really see that everyone's doing their best.", "created_at": "2019-12-29T19:24:07.133Z"}, {"movie_id": 99861, "review_id": "5e091e34a1c59d0018ab0aea", "author_rating": null, "review_text": "Strong film from beginning to end. Has just enough humor, angst, and drama to make it a film worthy to be called a sequel.", "created_at": "2019-12-29T21:44:20.547Z"}, {"movie_id": 99861, "review_id": "5e09b6c91684f700159c39d1", "author_rating": null, "review_text": "If you're a fan of action, suspense, and awe worthy moments, then this movie is the right fit for you! Overall outstanding performance by everyone both on and off screen.", "created_at": "2019-12-30T08:35:21.957Z"}, {"movie_id": 99861, "review_id": "5e0e0c5468b1ea00187f406e", "author_rating": null, "review_text": "Despite the challenge of having to top their first Avengers film, Marvel did beautifully and the result was amazing. I hope to see more films like this in the future.", "created_at": "2020-01-02T15:29:24.122Z"}, {"movie_id": 99861, "review_id": "5e0e16226dc6c000184d0ec2", "author_rating": null, "review_text": "I see a lot of negative reviews directed at the humor in this movie. All I can say is that Marvel, since the beginning, has used this same format for their movies so I don't understand why \"fans\" are now criticizing the banter.", "created_at": "2020-01-02T16:11:14.409Z"}, {"movie_id": 99861, "review_id": "5e0e201e6dc6c000154cccd7", "author_rating": null, "review_text": "Compared to the first movie, this one was much more fast-paced and had more action scenes in it. We don't see a lot of character development but it's still enjoyable!", "created_at": "2020-01-02T16:53:50.894Z"}, {"movie_id": 99861, "review_id": "5e0e29f168b1ea00137fc3d3", "author_rating": null, "review_text": "Everyone else saying that there's not enough character development for the superheroes in this movie needs to remember the solo films for Iron Man, Captain America, and Thor. Do you want character development? Go watch those movies.", "created_at": "2020-01-02T17:35:45.375Z"}, {"movie_id": 99861, "review_id": "5e0e408612c60400174007c7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:06.751Z"}, {"movie_id": 99861, "review_id": "5e0e4087c2f44b00172fcdb7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:07.019Z"}, {"movie_id": 99861, "review_id": "5e0e529868b1ea00187f9d59", "author_rating": null, "review_text": "This was clearly a level-up from their first film. Although much more action-oriented, the production value still screams Marvel and what I liked most is the refinement of the collaborative action scenes.", "created_at": "2020-01-02T20:29:12.073Z"}, {"movie_id": 99861, "review_id": "5e0f07e95907de0012d74f33", "author_rating": null, "review_text": "Not as good as the first one... because it's BETTER! Marvel really knows how to make it work and they're at the top of their game right now.", "created_at": "2020-01-03T09:22:49.359Z"}, {"movie_id": 99861, "review_id": "5e0f2e39663b8700137ed8c1", "author_rating": null, "review_text": "Plot line is far from the cliche superhero story. Scriptwriters did a great job inserting that original, witty Marvel humor in between scenes to dispel some of the seriousness that's usually accompanied in these types of films.", "created_at": "2020-01-03T12:06:17.704Z"}, {"movie_id": 99861, "review_id": "5e104eba5907de0014da1425", "author_rating": null, "review_text": "Both Robert Downey Jr and Chris Evans really solidified their roles as the main Avengers in this film. Would love to see more of them!", "created_at": "2020-01-04T08:37:14.707Z"}, {"movie_id": 99861, "review_id": "5e1212979020120013b5c9b7", "author_rating": null, "review_text": "Man this movie really got me hooked and now I'm part of the Avengers bandwagon. Count me in on whatever nerdy stuff you guys do.", "created_at": "2020-01-05T16:45:11.926Z"}, {"movie_id": 99861, "review_id": "5e124864fc5f0600178f7778", "author_rating": null, "review_text": "Marvel is dominating the superhero film genre and it looks like they'll be sitting on the throne for years to come. How they make it work even with the huge amount of heroes they have is impressive. Hopefully this doesn't backfire anytime soon.", "created_at": "2020-01-05T20:34:44.219Z"}, {"movie_id": 99861, "review_id": "5e125a5a5907de0017deaaad", "author_rating": null, "review_text": "If you read the comics, you'll see that this isn't just another direct copy and paste of the storyline. Marvel is great enough to make some changes.", "created_at": "2020-01-05T21:51:22.583Z"}, {"movie_id": 99861, "review_id": "5e12c5cad64ac2001865d284", "author_rating": null, "review_text": "Solid choreography and the storyline was pretty decent. I personally liked the first film better but this is still a good, fun watch.", "created_at": "2020-01-06T05:29:46.555Z"}, {"movie_id": 99861, "review_id": "5e12c9ddd64ac20016653377", "author_rating": null, "review_text": "The only reason I can think of why someone would not like this movie is because they either have not seen the other films Marvel has released or they just don't understand how Marvel creates a film.", "created_at": "2020-01-06T05:47:09.283Z"}, {"movie_id": 99861, "review_id": "5e12cdd7d64ac2001465016f", "author_rating": null, "review_text": "I found the writing in this film to be witty and sharp. The humor was on point and I laughed way more than I should.", "created_at": "2020-01-06T06:04:07.311Z"}, {"movie_id": 99861, "review_id": "5e12d1dc5907de0014dec438", "author_rating": null, "review_text": "Compared to the first Avengers, there's a lot of things that they improved on in this film. From the storytelling, to the much more defined fight choreography, it's definitely a step-up from the previous one.", "created_at": "2020-01-06T06:21:16.963Z"}, {"movie_id": 99861, "review_id": "5e20d56f8f26bc001371c649", "author_rating": null, "review_text": "Don't be brainwashed. This is just a remix of the first Avenger movie. Nothing new here except for the new heroes but plot-wise it's pretty much the same thing.", "created_at": "2020-01-16T21:28:15.117Z"}, {"movie_id": 99861, "review_id": "5e20dedc397df000129666b8", "author_rating": null, "review_text": "It's just what I feared. Marvel has gotten so caught up in making sure that each character gets some action time that there's no room now for character development. They need to tone it down a bit.", "created_at": "2020-01-16T22:08:28.630Z"}, {"movie_id": 99861, "review_id": "5ef819bba284eb00398dc810", "author_rating": 7.0, "review_text": "Third viewing of this and while not the strongest within the MCU, or of the other Avenger movies, still has some good parts (introduction to Elizabeth Olsen's Scarlet Witch and Paul Bettany's Vision; further setting into motion the infinity stones, New Avengers, etc) while the plot as a whole felt messy at times. Still, found it entertaining especially seeing where the MCU was going since. **3.5/5**", "created_at": "2020-06-28T04:16:59.341Z"}, {"movie_id": 99861, "review_id": "600616349a358d0040c2ecad", "author_rating": 7.0, "review_text": "Cool seeing them all together again, even if I didn't massively enjoy it. It's good, nothing more or less in my opinion.\r\n\r\n<em>'Avengers: Age of Ultron'</em> isn't too far off 2012's <em>'The Avengers'</em>, especially in terms of how I fell about it. I definitely wanted more from both, yet they are still satisfying superhero action flicks. I'd rank this narrowly below the aforementioned.\r\n\r\nRobert Downey Jr. felt a little flat to me as Iron Man - he still has a decent amount of moments, just not as many as you get in his individual films. All the others continue to entertain to an equally suitable level, I didn't overly like the characters of Aaron Taylor-Johnson and Elizabeth Olsen but I also don't have any noteworthy negatives about them. The story between Scarlett Johansson and Mark Ruffalo didn't do much for me either.\r\n\r\nWith that noted, it is still an enjoyable ride through the 141 minute run time. The ending is intriguing, interested to see where that goes - I have a minor inkling about the mid-credits scene, given all the internet attention that has had - even for someone like me who knows very little overall.", "created_at": "2021-01-18T23:13:56.078Z"}, {"movie_id": 99861, "review_id": "56351986c3a3681b59017d48", "author_rating": 6.5, "review_text": "There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.", "created_at": "2015-10-31T19:41:58.194Z"}, {"movie_id": 99861, "review_id": "5804e364c3a3686a3400000e", "author_rating": 7.0, "review_text": "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...", "created_at": "2016-10-17T14:42:44.693Z"}, {"movie_id": 99861, "review_id": "5a66d16ec3a3680cfb006191", "author_rating": 7.0, "review_text": "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.", "created_at": "2018-01-23T06:08:46.790Z"}, {"movie_id": 99861, "review_id": "5b1678d7c3a3685352018aad", "author_rating": 7.0, "review_text": "**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:49:43.675Z"}, {"movie_id": 99861, "review_id": "5c842655c3a3684e95db3e38", "author_rating": 5.0, "review_text": "The fact that Joss Whedon was able to salvage some sort of coherent film out of all he was forced to cram into a single movie is quite commendable. But the sad fact is that Avengers: Age of Ultron is really just a run of the mill \"bad guy wants to destroy the world for reasons\" actioner that we've seen done better many times before.\r\n\r\nDon't get me wrong. The movie's fun. The dialogue is frequently clever and humourous. And I really appreciated the quiet bits of storytelling that Whedon was able to sneak in. It's just that at the end of the day, the villain is weak sauce, there's way too much set up for other movies, and if I'm criticizing Man of Steel for having excessive destruction, I can't give Avengers a pass since they needlessly blow up not one, not two, but three cities. Pretty sure many insurance agencies went bankrupt paying out all the victims.", "created_at": "2019-03-09T20:47:17.431Z"}, {"movie_id": 99861, "review_id": "5dc32f5299259c00187a12c4", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-11-06T20:38:42.032Z"}, {"movie_id": 99861, "review_id": "5dc389ff8d22fc00143d1db1", "author_rating": null, "review_text": "This is the movie where Captain America became my favorite Avenger. Sure he doesn't have monstrous abilities like Iron Man and Hulk, but to be holding his own on the same ground as them is just a testament to how great of a hero he truly is.", "created_at": "2019-11-07T03:05:35.729Z"}, {"movie_id": 99861, "review_id": "5dc393227d2bc100133d151b", "author_rating": null, "review_text": "It has become a well-known fact that coming out with a sequel that's better than, if not on par with, the first one is an insane task. But kudos to Marvel for staying true to their colors with this sequel.", "created_at": "2019-11-07T03:44:34.837Z"}, {"movie_id": 99861, "review_id": "5dc399569d89390013350f9f", "author_rating": null, "review_text": "I expected more from Quicksilver.  He would've been a great addition to the Avengers.", "created_at": "2019-11-07T04:11:02.061Z"}, {"movie_id": 99861, "review_id": "5dc56e74470ead00189063a7", "author_rating": null, "review_text": "The thing that puzzles me is that in this film, Vision is presented to be a powerful hero, having the mind stone and all. But on the next films, he's become more of like a side character that just wasn't relevant anymore except for that little piece of stone on his forehead. Shame.", "created_at": "2019-11-08T13:32:36.277Z"}, {"movie_id": 99861, "review_id": "5dc579e46f8d950017c29a57", "author_rating": null, "review_text": "I'm glad to see that they found another role for Hawkeye other than being that one guy who seemed to be trying hard to keep up with the other more powerful heroes on the team. Now he's more of like the thing that keeps the team together and it suits his character well.", "created_at": "2019-11-08T14:21:24.351Z"}, {"movie_id": 99861, "review_id": "5e00e910d1a89300198cbe02", "author_rating": null, "review_text": "Movie was great but felt like there was just too much action and fighting. The creativity of the choreography gets lost in the whirlwind of action and this I noticed most in Captain America's scenes. He does like a hundred different awesome things with his shield, but you don't have time to really take it in because you're already looking at Iron Man blasting 20 Ultron-bots to bits.", "created_at": "2019-12-23T16:19:28.195Z"}, {"movie_id": 99861, "review_id": "5e00ee6875110d0011d84af1", "author_rating": null, "review_text": "Avengers: Age of Ultron\r\nI liked plenty of the stuff in it but it was pretty much the same as the first movie. Still a good watch though if you're not looking for anything serious.", "created_at": "2019-12-23T16:42:16.041Z"}, {"movie_id": 99861, "review_id": "5e01023d0284200019af5170", "author_rating": null, "review_text": "The humor in this movie was not as witty as the first one. It felt too childish and cheesy.", "created_at": "2019-12-23T18:06:53.750Z"}, {"movie_id": 99861, "review_id": "5e011ad70284200016af7e51", "author_rating": null, "review_text": "Still good, clean Avengers fun though a bit messier. The first one was still better.", "created_at": "2019-12-23T19:51:51.123Z"}, {"movie_id": 99861, "review_id": "5e02863c26dac10012674860", "author_rating": null, "review_text": "With the vast array of heroes and their own personal character stories, you can expect how much of a challenge it is to bring together all these superheroes and have them work on a single mission on a single timeline. It's not easy, experts.", "created_at": "2019-12-24T21:42:20.693Z"}, {"movie_id": 99861, "review_id": "5e08fd574a2226001728f48c", "author_rating": null, "review_text": "I confirmed in this movie that what's really making these films successful is the chemistry that the actors have. You can really see that everyone's doing their best.", "created_at": "2019-12-29T19:24:07.133Z"}, {"movie_id": 99861, "review_id": "5e091e34a1c59d0018ab0aea", "author_rating": null, "review_text": "Strong film from beginning to end. Has just enough humor, angst, and drama to make it a film worthy to be called a sequel.", "created_at": "2019-12-29T21:44:20.547Z"}, {"movie_id": 99861, "review_id": "5e09b6c91684f700159c39d1", "author_rating": null, "review_text": "If you're a fan of action, suspense, and awe worthy moments, then this movie is the right fit for you! Overall outstanding performance by everyone both on and off screen.", "created_at": "2019-12-30T08:35:21.957Z"}, {"movie_id": 99861, "review_id": "5e0e0c5468b1ea00187f406e", "author_rating": null, "review_text": "Despite the challenge of having to top their first Avengers film, Marvel did beautifully and the result was amazing. I hope to see more films like this in the future.", "created_at": "2020-01-02T15:29:24.122Z"}, {"movie_id": 99861, "review_id": "5e0e16226dc6c000184d0ec2", "author_rating": null, "review_text": "I see a lot of negative reviews directed at the humor in this movie. All I can say is that Marvel, since the beginning, has used this same format for their movies so I don't understand why \"fans\" are now criticizing the banter.", "created_at": "2020-01-02T16:11:14.409Z"}, {"movie_id": 99861, "review_id": "5e0e201e6dc6c000154cccd7", "author_rating": null, "review_text": "Compared to the first movie, this one was much more fast-paced and had more action scenes in it. We don't see a lot of character development but it's still enjoyable!", "created_at": "2020-01-02T16:53:50.894Z"}, {"movie_id": 99861, "review_id": "5e0e29f168b1ea00137fc3d3", "author_rating": null, "review_text": "Everyone else saying that there's not enough character development for the superheroes in this movie needs to remember the solo films for Iron Man, Captain America, and Thor. Do you want character development? Go watch those movies.", "created_at": "2020-01-02T17:35:45.375Z"}, {"movie_id": 99861, "review_id": "5e0e408612c60400174007c7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:06.751Z"}, {"movie_id": 99861, "review_id": "5e0e4087c2f44b00172fcdb7", "author_rating": null, "review_text": "I'm happy Marvel gave Black Widow and Hawkeye the spotlight more on this film. They needed the extra character development because the other three main heroes all had solo films to help them out.", "created_at": "2020-01-02T19:12:07.019Z"}, {"movie_id": 99861, "review_id": "5e0e529868b1ea00187f9d59", "author_rating": null, "review_text": "This was clearly a level-up from their first film. Although much more action-oriented, the production value still screams Marvel and what I liked most is the refinement of the collaborative action scenes.", "created_at": "2020-01-02T20:29:12.073Z"}, {"movie_id": 99861, "review_id": "5e0f07e95907de0012d74f33", "author_rating": null, "review_text": "Not as good as the first one... because it's BETTER! Marvel really knows how to make it work and they're at the top of their game right now.", "created_at": "2020-01-03T09:22:49.359Z"}, {"movie_id": 99861, "review_id": "5e0f2e39663b8700137ed8c1", "author_rating": null, "review_text": "Plot line is far from the cliche superhero story. Scriptwriters did a great job inserting that original, witty Marvel humor in between scenes to dispel some of the seriousness that's usually accompanied in these types of films.", "created_at": "2020-01-03T12:06:17.704Z"}, {"movie_id": 99861, "review_id": "5e104eba5907de0014da1425", "author_rating": null, "review_text": "Both Robert Downey Jr and Chris Evans really solidified their roles as the main Avengers in this film. Would love to see more of them!", "created_at": "2020-01-04T08:37:14.707Z"}, {"movie_id": 99861, "review_id": "5e1212979020120013b5c9b7", "author_rating": null, "review_text": "Man this movie really got me hooked and now I'm part of the Avengers bandwagon. Count me in on whatever nerdy stuff you guys do.", "created_at": "2020-01-05T16:45:11.926Z"}, {"movie_id": 99861, "review_id": "5e124864fc5f0600178f7778", "author_rating": null, "review_text": "Marvel is dominating the superhero film genre and it looks like they'll be sitting on the throne for years to come. How they make it work even with the huge amount of heroes they have is impressive. Hopefully this doesn't backfire anytime soon.", "created_at": "2020-01-05T20:34:44.219Z"}, {"movie_id": 99861, "review_id": "5e125a5a5907de0017deaaad", "author_rating": null, "review_text": "If you read the comics, you'll see that this isn't just another direct copy and paste of the storyline. Marvel is great enough to make some changes.", "created_at": "2020-01-05T21:51:22.583Z"}, {"movie_id": 99861, "review_id": "5e12c5cad64ac2001865d284", "author_rating": null, "review_text": "Solid choreography and the storyline was pretty decent. I personally liked the first film better but this is still a good, fun watch.", "created_at": "2020-01-06T05:29:46.555Z"}, {"movie_id": 99861, "review_id": "5e12c9ddd64ac20016653377", "author_rating": null, "review_text": "The only reason I can think of why someone would not like this movie is because they either have not seen the other films Marvel has released or they just don't understand how Marvel creates a film.", "created_at": "2020-01-06T05:47:09.283Z"}, {"movie_id": 99861, "review_id": "5e12cdd7d64ac2001465016f", "author_rating": null, "review_text": "I found the writing in this film to be witty and sharp. The humor was on point and I laughed way more than I should.", "created_at": "2020-01-06T06:04:07.311Z"}, {"movie_id": 99861, "review_id": "5e12d1dc5907de0014dec438", "author_rating": null, "review_text": "Compared to the first Avengers, there's a lot of things that they improved on in this film. From the storytelling, to the much more defined fight choreography, it's definitely a step-up from the previous one.", "created_at": "2020-01-06T06:21:16.963Z"}, {"movie_id": 99861, "review_id": "5e20d56f8f26bc001371c649", "author_rating": null, "review_text": "Don't be brainwashed. This is just a remix of the first Avenger movie. Nothing new here except for the new heroes but plot-wise it's pretty much the same thing.", "created_at": "2020-01-16T21:28:15.117Z"}, {"movie_id": 99861, "review_id": "5e20dedc397df000129666b8", "author_rating": null, "review_text": "It's just what I feared. Marvel has gotten so caught up in making sure that each character gets some action time that there's no room now for character development. They need to tone it down a bit.", "created_at": "2020-01-16T22:08:28.630Z"}, {"movie_id": 99861, "review_id": "5ef819bba284eb00398dc810", "author_rating": 7.0, "review_text": "Third viewing of this and while not the strongest within the MCU, or of the other Avenger movies, still has some good parts (introduction to Elizabeth Olsen's Scarlet Witch and Paul Bettany's Vision; further setting into motion the infinity stones, New Avengers, etc) while the plot as a whole felt messy at times. Still, found it entertaining especially seeing where the MCU was going since. **3.5/5**", "created_at": "2020-06-28T04:16:59.341Z"}, {"movie_id": 99861, "review_id": "600616349a358d0040c2ecad", "author_rating": 7.0, "review_text": "Cool seeing them all together again, even if I didn't massively enjoy it. It's good, nothing more or less in my opinion.\r\n\r\n<em>'Avengers: Age of Ultron'</em> isn't too far off 2012's <em>'The Avengers'</em>, especially in terms of how I fell about it. I definitely wanted more from both, yet they are still satisfying superhero action flicks. I'd rank this narrowly below the aforementioned.\r\n\r\nRobert Downey Jr. felt a little flat to me as Iron Man - he still has a decent amount of moments, just not as many as you get in his individual films. All the others continue to entertain to an equally suitable level, I didn't overly like the characters of Aaron Taylor-Johnson and Elizabeth Olsen but I also don't have any noteworthy negatives about them. The story between Scarlett Johansson and Mark Ruffalo didn't do much for me either.\r\n\r\nWith that noted, it is still an enjoyable ride through the 141 minute run time. The ending is intriguing, interested to see where that goes - I have a minor inkling about the mid-credits scene, given all the internet attention that has had - even for someone like me who knows very little overall.", "created_at": "2021-01-18T23:13:56.078Z"}]