[{"movie_id": 460458, "review_id": "62d2edb953f83304009f59dc", "author_rating": 5.0, "review_text": "Well I cannot say that I I had high hopes for this movie but I have watched the other movies in the franchise and I am a bit of a sucker for horror/fantasy/science fiction movies. Especially if one can expect a decent amount of special effects and gore so…\r\n\r\nIt is not a great movie. Not even a good movie really but it is a half decent B-movie horror flick. It sure as hell is better than that woke piece of trash that Netflix has produced with their TV-show adaptation of the franchise but then that does not really say very much.\r\n\r\nThe story is rather non-existent and things just happen for no good reason. It is like the writer just took a bunch of zombie and monster encounters and threw them in a mixer to see what came out. Sure there is a resemblance of a background story there but it is not much.\r\n\r\nWe never get to know why the zombies escaped into Raccoon City, why the experiments where abandoned or anything else that might enlighten us as to why zombies pop up here and there all the time (apart from the fact that it is a Resident Evil movie and it is Raccoon City of course). There also seems to be a number of characters in the movie that knows a lot about what is actually going on but again, we never really get much of an explanation. I have understood that the movie is based on the story in the first three of the games so I guess those that have played them might understand the why’s better.\r\n\r\nThe main reason to watch this movie is the special effects, the gore and the action and this is best done with your brain in the off position. There are indeed some decent gory special effects and I have to say that the monsters in the later half of the movie was pretty okay.\r\n\r\nI do miss Milla Jovovich though. There is not really any good kick-ass replacement for her although some of the characters tried. Also, for f… sake, will the dumbass Hollywood script writers ever going to stop putting stupid shit in the movies, like firing off bazookas and rocket launcher in confined spaces, say a train car. It doesn’t work unless the goal is to also kill the person firing it you morons!\r\n\r\nOne thing that annoyed me throughout the entire movie though is the fact that it is really dark. Sure it is a horror movie so some dark scenes is to be expected but the entire movie is really really dark. To the extent that it really is difficult to see what is going on for a lot of the movie. It might have worked in a cinema but on a TV-screen, even with the pretty good OLED that I have, it is really too dark.\r\n\r\nSo it was pretty much what I expected, a basic B-movie of the gore feast variety. Didn’t feel like I wasted my time but that is a positive as it gets.", "created_at": "2022-07-16T16:56:26.003Z"}, {"movie_id": 460458, "review_id": "630a5fbdb042280082eb2171", "author_rating": 6.0, "review_text": "**The director’s love for the games is apparent, but too many poor decisions ruined what could have been the best and most faithful Resident Evil yet.**\r\n\r\nWelcome to Raccoon City marks the first live-action Resident Evil adaptation to stick close to the original games in story and feel. Character costumes looked like they were plucked right from the games. Sets and locations were identical to levels I spent hours playing. Easter eggs and nods throughout the film celebrated hardcore fans. Unfortunately, its flaws overshadow its victories. An overcrowded story with too many characters prevented developing the characters or making the story have any real impact. Forcing two full game stories into an hour and 47-minute run time had consequences. I enjoyed the movie’s attention to the slow descent from human to zombie, which showed the dread and hopelessness as the victims felt their humanity drain away. There is also a fantastic action scene in complete darkness where the muzzle flash provides the only light for the survivors to see. There were some wonderful moments that Resident Evil fans will enjoy, but nostalgia is really the only thing Welcome to Raccoon City has going for it.", "created_at": "2022-08-27T18:17:33.776Z"}, {"movie_id": 460458, "review_id": "64db74f659e8a900e227a6b2", "author_rating": 7.0, "review_text": "Not bad, first one without Alice though. Racoon city now has since been destroyed now. They start to find out what's underneath the city.", "created_at": "2023-08-15T12:52:06.150Z"}]