[{"movie_id": 159824, "review_id": "56d9a91ac3a3681e36022298", "author_rating": 8.0, "review_text": "> It's vampa time!\r\n\r\nFrankly, I was not thinking of writing a review for this. You know, some animated movies come and go unnoticed, so I believed it would be one of those. In fact, I did not like the first film much, that is the reason to watch it so delayedly and with a minimum expectation. Better late than never, well, I regret for viewing it so late. One of the best animation of 2015, maybe in the top 10 or 15.\r\n\r\nWell, it was a one liner, like, the daughter wants to move to the human social world thinking that might do good for her son's future. But her father plan to stop her getting away from him and the hotel. So those attempts are the rest of the movie. I liked the movie very much because it was very funny, especially the lines were and its accent, Adam Sandler nailed it.\r\n\r\nI have said millions of times that I don't know why Americans and critics hate Adam Sandler that much, I don't know about the rest of the world but I kind of like his films. The last few films like 'The Cobbler', 'Pixel', 'Men, Women & Children' and this one were so much better. It did not bring the old Sandler, but brought us a different and new Sandler on screen. He was definitely the main reason for this film's success.\r\n\r\nDon't just a book by its cover, well, here the cover is the previous installment. The first part was not a must see IMPO, but this is especially for the animated movie fans. PG rated movie, but still it might scare mildly for below 8 kids, only because of the theme. I had a great time with it and expecting it to do the same impact on you as well. And I can't predict the third will be as lucky as this one, lets wait and see.\r\n\r\n8/10", "created_at": "2016-03-04T15:26:18.548Z"}, {"movie_id": 159824, "review_id": "64a3a86a8e20c5010d4e8dee", "author_rating": 7.0, "review_text": "Not as good as the first, but it was still entertaining and funny. Draculas daughter has a kid with her human husband. The causes all kinds of new problems for Dracula.", "created_at": "2023-07-04T05:04:42.171Z"}]