[{"movie_id": 188927, "review_id": "57932005c3a368636b006bd1", "author_rating": null, "review_text": "Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative or wildly distinctive in comparison to the other earlier entries but it still thrives where it counts in the spectacle of space-aged escapism. The cast is solid as the players–Pine, Quinto, Pegg, Urban, Yelchin as well as Zoe Saldana’s Uhura and John Cho’s Sulu–all demonstrate a suspenseful unity on screen and give the audience an indescribable excitement in this latest chapter that far from disappoints. Elba’s Krall is robustly villainous in physicality and attitude and the alien race featured are interestingly hypnotic in creepiness. Lin, in the same vein as Abrams, is not shy about gift-wrapping his **Star Trek** edition in boisterous, sweeping helpings of scope and whimsy.\r\n\r\nOverall, this kinetic outing of **Beyond** practically guarantees that the rebooted **Star Trek** phenomenon will not be experiencing its final frontier any time soon.\r\n\r\n**Star Trek Beyond** (2016)\r\n\r\nParamount Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Chris Pine, Zachary Quinto, Zoe Saldana, Karl Urban, Anton Yelchin, Simon Pegg, John Cho, Idris Elba, Sofia Boutella\r\n\r\nDirected by: Justin Lin\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space and Fantasy Saga/Action and Adventure\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-07-23T07:43:01.041Z"}, {"movie_id": 188927, "review_id": "5795237dc3a3681f3100424b", "author_rating": null, "review_text": "I saw this movie two hours ago and I can't remember how it started. Ah. Diplomatic mission to offer a truce artifact to one of the warring sides from the other. It does not go well. Just a tad shy of 3 years into the 5 year mission and Kirk is bored enough to take a desk job. Screenplay set-up signifying it's all about to get much less stultifying. I don't know enough about camera angle choices to know if that's what makes the film feel disjointed, or the script, or editing chops, but something certainly felt unconnected. I started noticing details I had no business noticing. Everybody's hair is bigger. I watched Galaxy Quest recently, and when Krall showed up I choked on popcorn. In fact, prosthetics needed an above the title billing. Running from intruders in a dark corridor, I could see Uhura's earrings glinting. If I could see those, the enemy could, too. The device designed to End The Universe is too much like Big Hero 6. The space station too much like Elysium. And the jumpstart of a starship too much like Furious 7. One of these days in the near future scenic designers will stop putting skyscrapers on hula hoops in deep space. And it's a space station - where are all the people running to when the bad stuff starts happening? It's a scene device that needs to go. The Bad Dude airship docking station is right out of Independence Day. Can we get a little new here? Visual effects are gooey (literally) with some stuff that may or may not be a cue to the bee reference, and is at one point, squished out I don't know how while Kirk rides a vintage motorcycle in circles. And then the squish hardens. I also don't know how, or what that goo was supposed to keep in or out. Much of this is superfluous, but the story was not interesting enough to make me stop looking around. There are way too many wire bundles, a feature of Star Trek Next Gen Borg episodes. When we finally get the Bad Dude's backstory, it isn't enough. Kirk's bored, Bad Dude is disappointed, and how the hell Uhura survives every encounter requires too much suspension of belief. I also noticed that the guys in the theater were sporting ball caps with sunglasses perched on the brim. Noticing fashion in the cinema is not why I go to the movies. Read this week that Chris Hemsworth has signed on to the next Star Trek as George Kirk. Does not bode well for new better adventures.", "created_at": "2016-07-24T20:22:21.614Z"}, {"movie_id": 188927, "review_id": "57acef75c3a368206600016a", "author_rating": null, "review_text": "Star Trek Beyond is what a summer blockbuster is all about. Read my full review here! \r\n\r\nhttp://www.hweird1reviews.com/allreviews/star-trek-beyond-review", "created_at": "2016-08-11T21:34:45.769Z"}, {"movie_id": 188927, "review_id": "5835d8509251416c2e013535", "author_rating": 7.0, "review_text": "**When theirs rescue mission failed...**\r\n\r\nIt's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.\r\n\r\nNo offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.\r\n\r\nFrom the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.\r\n\r\nThis id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. \r\n\r\n_7/10_", "created_at": "2016-11-23T17:56:32.984Z"}, {"movie_id": 188927, "review_id": "58564e9d9251411a4604c3c2", "author_rating": 9.0, "review_text": "Last Saturday me and the kids sat down to watch Star Trek Beyond which we received in the mail the day before. In general we liked the movie quite a lot. Plenty of action, good special effects and a not too bad story. However, one thing irked me to now end. They blew up the enterprise…again. Stop destroying the bloody Enterprise in every movie for Christ sake! Been there, seen that done that. It is getting both old and frustrating.\r\n\r\nApart from that it was a good entry in the new timeline movie series. I am not sure what all those people giving it one star ratings and calling it the worst movie ever expected to get? Anyone who has watched the two other movies should be expecting a fairly action loaded blockbuster with lots of CGI in it and that is exactly what we got. Personally I think this is a good thing. I was getting rather bored by some of the previous installments in the original timeline where they almost never fired a shot and tried to talk or reason their way out of every problem they encountered.\r\n\r\nThe story was not too bad although I have to agree that it did not really advance the story or timeline much. It was more like a TV-show episode blown up to a full feature movie. It worked nicely though as a action story although I would have liked to know more about how Edison transformed into Krall and, although that could be explained by some mutation caused by the alien technology, how he managed to transform himself back to Edison.\r\n\r\nThe CGI with the alien swarm moving fluidly over the screen and the huge Yorktown station was quite stunning as far as I am concerned. I also liked that the ships, both Enterprise and the Franklin could take quite a bit of abuse before starting to fail. In a lot of the previous movies as well as the TV-shows it took one hit and some console exploded and the warp core went down.\r\n\r\nAll in all both me and the kids quite liked this installment in the series.", "created_at": "2016-12-18T08:53:49.367Z"}, {"movie_id": 188927, "review_id": "59fa29c1c3a3680f2c004509", "author_rating": 10.0, "review_text": "I always loved these type  of movies.This one is very adventurous and full of suspans.\r\nNice one.I've watched it more than 3 times and every time i have the same feeling.\r\nExtraordinary😁!!!!", "created_at": "2017-11-01T20:08:33.316Z"}, {"movie_id": 188927, "review_id": "63bf6f7adf857c009f432dd6", "author_rating": 1.0, "review_text": "Well, I finally saw it and I can honestly say that I was far less offended by it than I was by the hack job reboot of Kahn. And I only cared slightly less about the film than I did the original JJ reboot.\r\n\r\nIt was a popcorn sci-fi action flick, and I liked Urban and Pine but thought that Quinto should have brought more of himself to the film rather than attempting to channel Nimoy. It was a fair enough impression, but it didn't fit with the rest of the reboot that seemed to care nothing about Star Trek.\r\n\r\nUltimately when Quinto channels Nimoy like that it just gives the viewer the jarring sensation that one member of the cast cared about what came before and forces the viewer to remember that this actually is a Star Trek film.\r\n\r\nAnd that doesn't work in a rebooted franchise that relies on nostalgia, in place of a story, and then kind of mocks the nostalgia.\r\n\r\nThat is ultimately the problem, Star Trek was a science-Fiction space adventure that was both cheesy and offered veiled social commentary about an idealistic world governed by a strict meritocracy with a strong morality and how that idealism clashes with other species and ideals by both forging alliances and making enemies.\r\n\r\nThis had nothing to do with that. It is basically an action movie with science-fiction elements and occasional nods to the cheesy fun that Star Trek once was. At it's core it didn't have the heart that lends itself to an engaging plot and character arcs.\r\n\r\nAnd, given that it came after a betrayal, that is after they rebooted one of the franchise's best films and took away most everything that made it so great and fun... I didn't care enough to actually see it until it came on television.\r\n\r\nThe real issue the reboot thing, for some reason they always take out plot and character development and fill that void with action and it makes the film feel visually appealing yet hallow.", "created_at": "2023-01-12T02:24:58.784Z"}, {"movie_id": 188927, "review_id": "64351a3a06f98401108ae22d", "author_rating": 2.0, "review_text": "Spock in a relationship with Uhura...\r\nGimme a break!!!", "created_at": "2023-04-11T08:28:42.935Z"}, {"movie_id": 188927, "review_id": "57932005c3a368636b006bd1", "author_rating": null, "review_text": "Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative or wildly distinctive in comparison to the other earlier entries but it still thrives where it counts in the spectacle of space-aged escapism. The cast is solid as the players–Pine, Quinto, Pegg, Urban, Yelchin as well as Zoe Saldana’s Uhura and John Cho’s Sulu–all demonstrate a suspenseful unity on screen and give the audience an indescribable excitement in this latest chapter that far from disappoints. Elba’s Krall is robustly villainous in physicality and attitude and the alien race featured are interestingly hypnotic in creepiness. Lin, in the same vein as Abrams, is not shy about gift-wrapping his **Star Trek** edition in boisterous, sweeping helpings of scope and whimsy.\r\n\r\nOverall, this kinetic outing of **Beyond** practically guarantees that the rebooted **Star Trek** phenomenon will not be experiencing its final frontier any time soon.\r\n\r\n**Star Trek Beyond** (2016)\r\n\r\nParamount Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Chris Pine, Zachary Quinto, Zoe Saldana, Karl Urban, Anton Yelchin, Simon Pegg, John Cho, Idris Elba, Sofia Boutella\r\n\r\nDirected by: Justin Lin\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space and Fantasy Saga/Action and Adventure\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-07-23T07:43:01.041Z"}, {"movie_id": 188927, "review_id": "5795237dc3a3681f3100424b", "author_rating": null, "review_text": "I saw this movie two hours ago and I can't remember how it started. Ah. Diplomatic mission to offer a truce artifact to one of the warring sides from the other. It does not go well. Just a tad shy of 3 years into the 5 year mission and Kirk is bored enough to take a desk job. Screenplay set-up signifying it's all about to get much less stultifying. I don't know enough about camera angle choices to know if that's what makes the film feel disjointed, or the script, or editing chops, but something certainly felt unconnected. I started noticing details I had no business noticing. Everybody's hair is bigger. I watched Galaxy Quest recently, and when Krall showed up I choked on popcorn. In fact, prosthetics needed an above the title billing. Running from intruders in a dark corridor, I could see Uhura's earrings glinting. If I could see those, the enemy could, too. The device designed to End The Universe is too much like Big Hero 6. The space station too much like Elysium. And the jumpstart of a starship too much like Furious 7. One of these days in the near future scenic designers will stop putting skyscrapers on hula hoops in deep space. And it's a space station - where are all the people running to when the bad stuff starts happening? It's a scene device that needs to go. The Bad Dude airship docking station is right out of Independence Day. Can we get a little new here? Visual effects are gooey (literally) with some stuff that may or may not be a cue to the bee reference, and is at one point, squished out I don't know how while Kirk rides a vintage motorcycle in circles. And then the squish hardens. I also don't know how, or what that goo was supposed to keep in or out. Much of this is superfluous, but the story was not interesting enough to make me stop looking around. There are way too many wire bundles, a feature of Star Trek Next Gen Borg episodes. When we finally get the Bad Dude's backstory, it isn't enough. Kirk's bored, Bad Dude is disappointed, and how the hell Uhura survives every encounter requires too much suspension of belief. I also noticed that the guys in the theater were sporting ball caps with sunglasses perched on the brim. Noticing fashion in the cinema is not why I go to the movies. Read this week that Chris Hemsworth has signed on to the next Star Trek as George Kirk. Does not bode well for new better adventures.", "created_at": "2016-07-24T20:22:21.614Z"}, {"movie_id": 188927, "review_id": "57acef75c3a368206600016a", "author_rating": null, "review_text": "Star Trek Beyond is what a summer blockbuster is all about. Read my full review here! \r\n\r\nhttp://www.hweird1reviews.com/allreviews/star-trek-beyond-review", "created_at": "2016-08-11T21:34:45.769Z"}, {"movie_id": 188927, "review_id": "5835d8509251416c2e013535", "author_rating": 7.0, "review_text": "**When theirs rescue mission failed...**\r\n\r\nIt's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.\r\n\r\nNo offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.\r\n\r\nFrom the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.\r\n\r\nThis id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. \r\n\r\n_7/10_", "created_at": "2016-11-23T17:56:32.984Z"}, {"movie_id": 188927, "review_id": "58564e9d9251411a4604c3c2", "author_rating": 9.0, "review_text": "Last Saturday me and the kids sat down to watch Star Trek Beyond which we received in the mail the day before. In general we liked the movie quite a lot. Plenty of action, good special effects and a not too bad story. However, one thing irked me to now end. They blew up the enterprise…again. Stop destroying the bloody Enterprise in every movie for Christ sake! Been there, seen that done that. It is getting both old and frustrating.\r\n\r\nApart from that it was a good entry in the new timeline movie series. I am not sure what all those people giving it one star ratings and calling it the worst movie ever expected to get? Anyone who has watched the two other movies should be expecting a fairly action loaded blockbuster with lots of CGI in it and that is exactly what we got. Personally I think this is a good thing. I was getting rather bored by some of the previous installments in the original timeline where they almost never fired a shot and tried to talk or reason their way out of every problem they encountered.\r\n\r\nThe story was not too bad although I have to agree that it did not really advance the story or timeline much. It was more like a TV-show episode blown up to a full feature movie. It worked nicely though as a action story although I would have liked to know more about how Edison transformed into Krall and, although that could be explained by some mutation caused by the alien technology, how he managed to transform himself back to Edison.\r\n\r\nThe CGI with the alien swarm moving fluidly over the screen and the huge Yorktown station was quite stunning as far as I am concerned. I also liked that the ships, both Enterprise and the Franklin could take quite a bit of abuse before starting to fail. In a lot of the previous movies as well as the TV-shows it took one hit and some console exploded and the warp core went down.\r\n\r\nAll in all both me and the kids quite liked this installment in the series.", "created_at": "2016-12-18T08:53:49.367Z"}, {"movie_id": 188927, "review_id": "59fa29c1c3a3680f2c004509", "author_rating": 10.0, "review_text": "I always loved these type  of movies.This one is very adventurous and full of suspans.\r\nNice one.I've watched it more than 3 times and every time i have the same feeling.\r\nExtraordinary😁!!!!", "created_at": "2017-11-01T20:08:33.316Z"}, {"movie_id": 188927, "review_id": "63bf6f7adf857c009f432dd6", "author_rating": 1.0, "review_text": "Well, I finally saw it and I can honestly say that I was far less offended by it than I was by the hack job reboot of Kahn. And I only cared slightly less about the film than I did the original JJ reboot.\r\n\r\nIt was a popcorn sci-fi action flick, and I liked Urban and Pine but thought that Quinto should have brought more of himself to the film rather than attempting to channel Nimoy. It was a fair enough impression, but it didn't fit with the rest of the reboot that seemed to care nothing about Star Trek.\r\n\r\nUltimately when Quinto channels Nimoy like that it just gives the viewer the jarring sensation that one member of the cast cared about what came before and forces the viewer to remember that this actually is a Star Trek film.\r\n\r\nAnd that doesn't work in a rebooted franchise that relies on nostalgia, in place of a story, and then kind of mocks the nostalgia.\r\n\r\nThat is ultimately the problem, Star Trek was a science-Fiction space adventure that was both cheesy and offered veiled social commentary about an idealistic world governed by a strict meritocracy with a strong morality and how that idealism clashes with other species and ideals by both forging alliances and making enemies.\r\n\r\nThis had nothing to do with that. It is basically an action movie with science-fiction elements and occasional nods to the cheesy fun that Star Trek once was. At it's core it didn't have the heart that lends itself to an engaging plot and character arcs.\r\n\r\nAnd, given that it came after a betrayal, that is after they rebooted one of the franchise's best films and took away most everything that made it so great and fun... I didn't care enough to actually see it until it came on television.\r\n\r\nThe real issue the reboot thing, for some reason they always take out plot and character development and fill that void with action and it makes the film feel visually appealing yet hallow.", "created_at": "2023-01-12T02:24:58.784Z"}, {"movie_id": 188927, "review_id": "64351a3a06f98401108ae22d", "author_rating": 2.0, "review_text": "Spock in a relationship with Uhura...\r\nGimme a break!!!", "created_at": "2023-04-11T08:28:42.935Z"}, {"movie_id": 188927, "review_id": "57932005c3a368636b006bd1", "author_rating": null, "review_text": "Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative or wildly distinctive in comparison to the other earlier entries but it still thrives where it counts in the spectacle of space-aged escapism. The cast is solid as the players–Pine, Quinto, Pegg, Urban, Yelchin as well as Zoe Saldana’s Uhura and John Cho’s Sulu–all demonstrate a suspenseful unity on screen and give the audience an indescribable excitement in this latest chapter that far from disappoints. Elba’s Krall is robustly villainous in physicality and attitude and the alien race featured are interestingly hypnotic in creepiness. Lin, in the same vein as Abrams, is not shy about gift-wrapping his **Star Trek** edition in boisterous, sweeping helpings of scope and whimsy.\r\n\r\nOverall, this kinetic outing of **Beyond** practically guarantees that the rebooted **Star Trek** phenomenon will not be experiencing its final frontier any time soon.\r\n\r\n**Star Trek Beyond** (2016)\r\n\r\nParamount Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Chris Pine, Zachary Quinto, Zoe Saldana, Karl Urban, Anton Yelchin, Simon Pegg, John Cho, Idris Elba, Sofia Boutella\r\n\r\nDirected by: Justin Lin\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space and Fantasy Saga/Action and Adventure\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-07-23T07:43:01.041Z"}, {"movie_id": 188927, "review_id": "5795237dc3a3681f3100424b", "author_rating": null, "review_text": "I saw this movie two hours ago and I can't remember how it started. Ah. Diplomatic mission to offer a truce artifact to one of the warring sides from the other. It does not go well. Just a tad shy of 3 years into the 5 year mission and Kirk is bored enough to take a desk job. Screenplay set-up signifying it's all about to get much less stultifying. I don't know enough about camera angle choices to know if that's what makes the film feel disjointed, or the script, or editing chops, but something certainly felt unconnected. I started noticing details I had no business noticing. Everybody's hair is bigger. I watched Galaxy Quest recently, and when Krall showed up I choked on popcorn. In fact, prosthetics needed an above the title billing. Running from intruders in a dark corridor, I could see Uhura's earrings glinting. If I could see those, the enemy could, too. The device designed to End The Universe is too much like Big Hero 6. The space station too much like Elysium. And the jumpstart of a starship too much like Furious 7. One of these days in the near future scenic designers will stop putting skyscrapers on hula hoops in deep space. And it's a space station - where are all the people running to when the bad stuff starts happening? It's a scene device that needs to go. The Bad Dude airship docking station is right out of Independence Day. Can we get a little new here? Visual effects are gooey (literally) with some stuff that may or may not be a cue to the bee reference, and is at one point, squished out I don't know how while Kirk rides a vintage motorcycle in circles. And then the squish hardens. I also don't know how, or what that goo was supposed to keep in or out. Much of this is superfluous, but the story was not interesting enough to make me stop looking around. There are way too many wire bundles, a feature of Star Trek Next Gen Borg episodes. When we finally get the Bad Dude's backstory, it isn't enough. Kirk's bored, Bad Dude is disappointed, and how the hell Uhura survives every encounter requires too much suspension of belief. I also noticed that the guys in the theater were sporting ball caps with sunglasses perched on the brim. Noticing fashion in the cinema is not why I go to the movies. Read this week that Chris Hemsworth has signed on to the next Star Trek as George Kirk. Does not bode well for new better adventures.", "created_at": "2016-07-24T20:22:21.614Z"}, {"movie_id": 188927, "review_id": "57acef75c3a368206600016a", "author_rating": null, "review_text": "Star Trek Beyond is what a summer blockbuster is all about. Read my full review here! \r\n\r\nhttp://www.hweird1reviews.com/allreviews/star-trek-beyond-review", "created_at": "2016-08-11T21:34:45.769Z"}, {"movie_id": 188927, "review_id": "5835d8509251416c2e013535", "author_rating": 7.0, "review_text": "**When theirs rescue mission failed...**\r\n\r\nIt's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.\r\n\r\nNo offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.\r\n\r\nFrom the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.\r\n\r\nThis id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. \r\n\r\n_7/10_", "created_at": "2016-11-23T17:56:32.984Z"}, {"movie_id": 188927, "review_id": "58564e9d9251411a4604c3c2", "author_rating": 9.0, "review_text": "Last Saturday me and the kids sat down to watch Star Trek Beyond which we received in the mail the day before. In general we liked the movie quite a lot. Plenty of action, good special effects and a not too bad story. However, one thing irked me to now end. They blew up the enterprise…again. Stop destroying the bloody Enterprise in every movie for Christ sake! Been there, seen that done that. It is getting both old and frustrating.\r\n\r\nApart from that it was a good entry in the new timeline movie series. I am not sure what all those people giving it one star ratings and calling it the worst movie ever expected to get? Anyone who has watched the two other movies should be expecting a fairly action loaded blockbuster with lots of CGI in it and that is exactly what we got. Personally I think this is a good thing. I was getting rather bored by some of the previous installments in the original timeline where they almost never fired a shot and tried to talk or reason their way out of every problem they encountered.\r\n\r\nThe story was not too bad although I have to agree that it did not really advance the story or timeline much. It was more like a TV-show episode blown up to a full feature movie. It worked nicely though as a action story although I would have liked to know more about how Edison transformed into Krall and, although that could be explained by some mutation caused by the alien technology, how he managed to transform himself back to Edison.\r\n\r\nThe CGI with the alien swarm moving fluidly over the screen and the huge Yorktown station was quite stunning as far as I am concerned. I also liked that the ships, both Enterprise and the Franklin could take quite a bit of abuse before starting to fail. In a lot of the previous movies as well as the TV-shows it took one hit and some console exploded and the warp core went down.\r\n\r\nAll in all both me and the kids quite liked this installment in the series.", "created_at": "2016-12-18T08:53:49.367Z"}, {"movie_id": 188927, "review_id": "59fa29c1c3a3680f2c004509", "author_rating": 10.0, "review_text": "I always loved these type  of movies.This one is very adventurous and full of suspans.\r\nNice one.I've watched it more than 3 times and every time i have the same feeling.\r\nExtraordinary😁!!!!", "created_at": "2017-11-01T20:08:33.316Z"}, {"movie_id": 188927, "review_id": "63bf6f7adf857c009f432dd6", "author_rating": 1.0, "review_text": "Well, I finally saw it and I can honestly say that I was far less offended by it than I was by the hack job reboot of Kahn. And I only cared slightly less about the film than I did the original JJ reboot.\r\n\r\nIt was a popcorn sci-fi action flick, and I liked Urban and Pine but thought that Quinto should have brought more of himself to the film rather than attempting to channel Nimoy. It was a fair enough impression, but it didn't fit with the rest of the reboot that seemed to care nothing about Star Trek.\r\n\r\nUltimately when Quinto channels Nimoy like that it just gives the viewer the jarring sensation that one member of the cast cared about what came before and forces the viewer to remember that this actually is a Star Trek film.\r\n\r\nAnd that doesn't work in a rebooted franchise that relies on nostalgia, in place of a story, and then kind of mocks the nostalgia.\r\n\r\nThat is ultimately the problem, Star Trek was a science-Fiction space adventure that was both cheesy and offered veiled social commentary about an idealistic world governed by a strict meritocracy with a strong morality and how that idealism clashes with other species and ideals by both forging alliances and making enemies.\r\n\r\nThis had nothing to do with that. It is basically an action movie with science-fiction elements and occasional nods to the cheesy fun that Star Trek once was. At it's core it didn't have the heart that lends itself to an engaging plot and character arcs.\r\n\r\nAnd, given that it came after a betrayal, that is after they rebooted one of the franchise's best films and took away most everything that made it so great and fun... I didn't care enough to actually see it until it came on television.\r\n\r\nThe real issue the reboot thing, for some reason they always take out plot and character development and fill that void with action and it makes the film feel visually appealing yet hallow.", "created_at": "2023-01-12T02:24:58.784Z"}, {"movie_id": 188927, "review_id": "64351a3a06f98401108ae22d", "author_rating": 2.0, "review_text": "Spock in a relationship with Uhura...\r\nGimme a break!!!", "created_at": "2023-04-11T08:28:42.935Z"}, {"movie_id": 188927, "review_id": "57932005c3a368636b006bd1", "author_rating": null, "review_text": "Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative or wildly distinctive in comparison to the other earlier entries but it still thrives where it counts in the spectacle of space-aged escapism. The cast is solid as the players–Pine, Quinto, Pegg, Urban, Yelchin as well as Zoe Saldana’s Uhura and John Cho’s Sulu–all demonstrate a suspenseful unity on screen and give the audience an indescribable excitement in this latest chapter that far from disappoints. Elba’s Krall is robustly villainous in physicality and attitude and the alien race featured are interestingly hypnotic in creepiness. Lin, in the same vein as Abrams, is not shy about gift-wrapping his **Star Trek** edition in boisterous, sweeping helpings of scope and whimsy.\r\n\r\nOverall, this kinetic outing of **Beyond** practically guarantees that the rebooted **Star Trek** phenomenon will not be experiencing its final frontier any time soon.\r\n\r\n**Star Trek Beyond** (2016)\r\n\r\nParamount Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Chris Pine, Zachary Quinto, Zoe Saldana, Karl Urban, Anton Yelchin, Simon Pegg, John Cho, Idris Elba, Sofia Boutella\r\n\r\nDirected by: Justin Lin\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space and Fantasy Saga/Action and Adventure\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-07-23T07:43:01.041Z"}, {"movie_id": 188927, "review_id": "5795237dc3a3681f3100424b", "author_rating": null, "review_text": "I saw this movie two hours ago and I can't remember how it started. Ah. Diplomatic mission to offer a truce artifact to one of the warring sides from the other. It does not go well. Just a tad shy of 3 years into the 5 year mission and Kirk is bored enough to take a desk job. Screenplay set-up signifying it's all about to get much less stultifying. I don't know enough about camera angle choices to know if that's what makes the film feel disjointed, or the script, or editing chops, but something certainly felt unconnected. I started noticing details I had no business noticing. Everybody's hair is bigger. I watched Galaxy Quest recently, and when Krall showed up I choked on popcorn. In fact, prosthetics needed an above the title billing. Running from intruders in a dark corridor, I could see Uhura's earrings glinting. If I could see those, the enemy could, too. The device designed to End The Universe is too much like Big Hero 6. The space station too much like Elysium. And the jumpstart of a starship too much like Furious 7. One of these days in the near future scenic designers will stop putting skyscrapers on hula hoops in deep space. And it's a space station - where are all the people running to when the bad stuff starts happening? It's a scene device that needs to go. The Bad Dude airship docking station is right out of Independence Day. Can we get a little new here? Visual effects are gooey (literally) with some stuff that may or may not be a cue to the bee reference, and is at one point, squished out I don't know how while Kirk rides a vintage motorcycle in circles. And then the squish hardens. I also don't know how, or what that goo was supposed to keep in or out. Much of this is superfluous, but the story was not interesting enough to make me stop looking around. There are way too many wire bundles, a feature of Star Trek Next Gen Borg episodes. When we finally get the Bad Dude's backstory, it isn't enough. Kirk's bored, Bad Dude is disappointed, and how the hell Uhura survives every encounter requires too much suspension of belief. I also noticed that the guys in the theater were sporting ball caps with sunglasses perched on the brim. Noticing fashion in the cinema is not why I go to the movies. Read this week that Chris Hemsworth has signed on to the next Star Trek as George Kirk. Does not bode well for new better adventures.", "created_at": "2016-07-24T20:22:21.614Z"}, {"movie_id": 188927, "review_id": "57acef75c3a368206600016a", "author_rating": null, "review_text": "Star Trek Beyond is what a summer blockbuster is all about. Read my full review here! \r\n\r\nhttp://www.hweird1reviews.com/allreviews/star-trek-beyond-review", "created_at": "2016-08-11T21:34:45.769Z"}, {"movie_id": 188927, "review_id": "5835d8509251416c2e013535", "author_rating": 7.0, "review_text": "**When theirs rescue mission failed...**\r\n\r\nIt's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.\r\n\r\nNo offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.\r\n\r\nFrom the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.\r\n\r\nThis id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. \r\n\r\n_7/10_", "created_at": "2016-11-23T17:56:32.984Z"}, {"movie_id": 188927, "review_id": "58564e9d9251411a4604c3c2", "author_rating": 9.0, "review_text": "Last Saturday me and the kids sat down to watch Star Trek Beyond which we received in the mail the day before. In general we liked the movie quite a lot. Plenty of action, good special effects and a not too bad story. However, one thing irked me to now end. They blew up the enterprise…again. Stop destroying the bloody Enterprise in every movie for Christ sake! Been there, seen that done that. It is getting both old and frustrating.\r\n\r\nApart from that it was a good entry in the new timeline movie series. I am not sure what all those people giving it one star ratings and calling it the worst movie ever expected to get? Anyone who has watched the two other movies should be expecting a fairly action loaded blockbuster with lots of CGI in it and that is exactly what we got. Personally I think this is a good thing. I was getting rather bored by some of the previous installments in the original timeline where they almost never fired a shot and tried to talk or reason their way out of every problem they encountered.\r\n\r\nThe story was not too bad although I have to agree that it did not really advance the story or timeline much. It was more like a TV-show episode blown up to a full feature movie. It worked nicely though as a action story although I would have liked to know more about how Edison transformed into Krall and, although that could be explained by some mutation caused by the alien technology, how he managed to transform himself back to Edison.\r\n\r\nThe CGI with the alien swarm moving fluidly over the screen and the huge Yorktown station was quite stunning as far as I am concerned. I also liked that the ships, both Enterprise and the Franklin could take quite a bit of abuse before starting to fail. In a lot of the previous movies as well as the TV-shows it took one hit and some console exploded and the warp core went down.\r\n\r\nAll in all both me and the kids quite liked this installment in the series.", "created_at": "2016-12-18T08:53:49.367Z"}, {"movie_id": 188927, "review_id": "59fa29c1c3a3680f2c004509", "author_rating": 10.0, "review_text": "I always loved these type  of movies.This one is very adventurous and full of suspans.\r\nNice one.I've watched it more than 3 times and every time i have the same feeling.\r\nExtraordinary😁!!!!", "created_at": "2017-11-01T20:08:33.316Z"}, {"movie_id": 188927, "review_id": "63bf6f7adf857c009f432dd6", "author_rating": 1.0, "review_text": "Well, I finally saw it and I can honestly say that I was far less offended by it than I was by the hack job reboot of Kahn. And I only cared slightly less about the film than I did the original JJ reboot.\r\n\r\nIt was a popcorn sci-fi action flick, and I liked Urban and Pine but thought that Quinto should have brought more of himself to the film rather than attempting to channel Nimoy. It was a fair enough impression, but it didn't fit with the rest of the reboot that seemed to care nothing about Star Trek.\r\n\r\nUltimately when Quinto channels Nimoy like that it just gives the viewer the jarring sensation that one member of the cast cared about what came before and forces the viewer to remember that this actually is a Star Trek film.\r\n\r\nAnd that doesn't work in a rebooted franchise that relies on nostalgia, in place of a story, and then kind of mocks the nostalgia.\r\n\r\nThat is ultimately the problem, Star Trek was a science-Fiction space adventure that was both cheesy and offered veiled social commentary about an idealistic world governed by a strict meritocracy with a strong morality and how that idealism clashes with other species and ideals by both forging alliances and making enemies.\r\n\r\nThis had nothing to do with that. It is basically an action movie with science-fiction elements and occasional nods to the cheesy fun that Star Trek once was. At it's core it didn't have the heart that lends itself to an engaging plot and character arcs.\r\n\r\nAnd, given that it came after a betrayal, that is after they rebooted one of the franchise's best films and took away most everything that made it so great and fun... I didn't care enough to actually see it until it came on television.\r\n\r\nThe real issue the reboot thing, for some reason they always take out plot and character development and fill that void with action and it makes the film feel visually appealing yet hallow.", "created_at": "2023-01-12T02:24:58.784Z"}, {"movie_id": 188927, "review_id": "64351a3a06f98401108ae22d", "author_rating": 2.0, "review_text": "Spock in a relationship with Uhura...\r\nGimme a break!!!", "created_at": "2023-04-11T08:28:42.935Z"}]