[{"movie_id": 368006, "review_id": "573816b092514110a3000ee9", "author_rating": 8.0, "review_text": "A lot of the events in 24 happen mainly on account of accidents and coincidences, but it is to Vikram Kumar's credit that we buy into those scenes so willfully in this novel and entertaining, but definitely over-long, film that constantly charms us or leaves us thrilled with its inventiveness. The film begins with one such accident when an eagle acts a catalyst for Dr Sethuraman's ( Suriya ) invention — a time machine. He is a famed watchmaker and inventor, living contentedly with his wife Priya (Nithya Menen) and their son. But his look-alike twin brother Athreya is smarting at his success and plans to have the time machine, which is in the form of a watch, for himself. But Sethuraman manages to save both his son and his invention by giving up his own life. \r\n\r\nCut to 26 years later, and the baby has grown up to become Mani (Suriya, again!), a watchmaker, raised by Sathyabama (Saranya Ponvannan in yet another enthu-mom roles). Mani is oblivious to his past, but, by a quirk of fate, he discovers the watch, and over a scene that is a wonderful a piece of movie magic (involving droplets of rain), discovers its power. He uses it to woo Sathya ( Samantha ), a girl who turns up at his store to get her watch repaired — or rather makes her fall in love with him with help from the device. This is the film's light-hearted stretch and Vikram Kumar keeps throwing at us the possibilities that such a time machine offers. One such possibility, a Quicksilver-like ability to freeze time, even involves affecting the outcome of a cricket match! But the romantic portion in the second half is definitely a drag and the situation is made worse by a visually cliched song that has the leads walking around in picture postcard-esque locations. It effectively acts as a second interval. \r\n\r\nMeanwhile, Athreya, who has been in coma all these years, regains consciousness (again, this happens by accident and involves an eagle!), and finds himself having aged and paralysed waist down. But with the help of his trusted aide, Mithran tracks down both the watch and Mani and plots to get the device in his hands and go back into the past to rewrite his destiny. \r\n\r\nIt has been a while since we had a film whose twists and double twists were genuinely surprising and in 24, we are kept slightly off-guard as to what might happen when a character does something. Vikram Kumar doesn't sacrifice the internal logic of the story, so the twists always seem plausible and surprising. Like in the climax, when Mani decides to save his parents by time-travelling to the day they were murdered, and how that pans out. He also balances the sci-fi/fantasy elements with a melodramatic sub-plot, involving Sathyabama, Mani and her estranged family, which invokes the 'amma sentiment' and acts as an unabashed sop for the 'family audiences'. \r\n\r\nTechnically, the film looks fabulous and this is one rare instance in our films when the cinematography (Tirru), production design (Amit Ray and Subrata Chakraborty) and visual effects (supervised by Julien Troussellier) are superbly in sync with one another. Even the makeup (Clover Wootton and Preetisheel G Singh) is subtle; it's a relief that the team did not go overboard with prosthetics to differentiate Suriya's three roles. Only AR Rahman disappoints with a rather serviceable score. \r\n\r\nStill, all the aesthetic triumphs would have been in vain if the film did not have an actor who could keep everything together with his charisma and performance, and this is where Suriya delivers. He turns on his boyish charm, which is needed to make the romantic portions work (with most actors, the character's constant use of the line, 'I am a watch mechanic madam; enakku idhellaam sarva saadhaarnamaana vishayam' would have sounded grating but not here), mellows down during the big emotional scenes (the conversation between Mani and Sathyabama after the former has learned of his lineage) and lets loose his wicked side to make Athreya truly sinister (the shocking interval block). It is not often that we see a big star choosing to take a risk with a script that is not simplistic or formulaic, especially when his last few films have underperformed at the box office, but here Suriya pulls it off admirably.", "created_at": "2016-05-15T06:26:56.737Z"}, {"movie_id": 368006, "review_id": "57a377729251416b970062a3", "author_rating": 8.0, "review_text": "> The war of the brothers ended by one of theirs son.\r\n\r\nThe time travel is not new to Indian cinema, but a very less explored concept. Especially technology easily available in todays world, the filmmakers utilising the opportunity at their best. With this kind of theme, Indian films can seek the global market, who is already the number one film producer in the world. But it needs to put a full stop for the traditional narration and characters and character developments. Like the father and son characters are played by the same actor which has not changed since the last 70 years or so. And the film length as well too long to sit for it. Other than these, I enjoyed this film.\r\n\r\nSo the story begins in the 1990 where the twin brothers go for each others throat for a watch, in which the event finally ends in a total disaster. But not until 26 years later when it reaches for one of theirs son's hands, letting us know it is a time travel device. Then the fun parts, as well as the romance undertakes, until the final act where it becomes serious again and concludes with a twist. The sequel is for sure, they already named it 'Decoded' and I'm looking forward for its official launch.\r\n\r\nIt was a well written script, but there are too many naturally occurring intense scenes like the bird scenes et cetera. Those were added just to cover up the loops. Since it's a sci-fi and time travel theme, the errors should be taken care or minimise them as much as possible and that's what the writer did. But still there a few silly stuffs like where the watch ends at the end, and adding years and months to the device without the scientific knowledge to make it work.\r\n\r\nBut still I felt the director of 'Yaavarum Nalam' did a wonderful job. He spent nearly a decade for this script, the hard work finally paid off well. Surya produced it under his 2D entertainment banner and performed so well in the triple roles with the support of other excellent actors. Definitely a great watch for the Indians, for the International audience as well, but a familiar theme makes it a decent entertainer.\r\n\r\n8/10", "created_at": "2016-08-04T17:12:18.577Z"}]