[{"movie_id": 332210, "review_id": "585ea078c3a3681a6f00fa03", "author_rating": 7.0, "review_text": "**To realise their actual line of work.**\r\n\r\nI usually anticipate the animation films, but I was not interested in this. I saw it mainly because of how much I liked 'The Lego Movie'. This is not as good as that one, but cute little adorable animation. The film is exclusively for the kids and the families, but anybody can have a good time if they are not expecting according to their age, gender and other things. So if you are yet to watch, leave behind those in order to enjoy it.\r\n\r\nIt is nothing to do with the 2009 short film 'Partly Cloudy'. But those who wanted a feature film on the similar theme would enjoy it. It is a little different though. The storks who switched their business to another, 18 years later a chain of events makes them realise what they should be doing. So in an adventure, soon to be the boss, a bird named Junior struggles to fix his mistake. In the process, he unleashes some secrets which brings the final act where the narration decides which way to end.\r\n\r\nNot a bad story, which is a road adventure like many animation films. The comedies were good and the characters are well developed in the short span. Some parts seem very silly, but enjoyable. Particularly the wolf-pack and their weird approach to deal with things. The animation too was very smooth and overall film was short, so swiftly narrated tale. This is not the year's best animation, though watching it for entertainment would work. Animation fans should not miss it, and must see for little children.\r\n\r\n_7/10_", "created_at": "2016-12-24T16:21:12.095Z"}, {"movie_id": 332210, "review_id": "5f39a6b0a3b5e60034f09891", "author_rating": 7.0, "review_text": "A little all over the place and largely nonsensical, but <em>'Storks'</em> is suitably enjoyable; especially, I imagine, for the younger audience.\r\n\r\nIt's not as heartfelt as it intends to be, bar the odd moment at the end, but there are a couple of amusing gags here and there. The animation is pretty nice, too.\r\n\r\nCast-wise it's passable, Andy Samberg (Junior) and Katie Crown (Tulip) work together solidly, as Kelsey Grammer makes for a decent enough villain. Keegan-Michael Key (Alpha) and Jordan Peele (Beta) aren't as funny as I've seen from the duo elsewhere, while Jennifer Aniston (Sarah) is underused.\r\n\r\nNevertheless, a satisfactory animated film from Warner Bros.", "created_at": "2020-08-16T21:35:44.301Z"}]