[{"movie_id": 390497, "review_id": "5935d164c3a3685bac00320d", "author_rating": 8.0, "review_text": "**It's not just about survival...**\r\n\r\nThe title says it all. Then I read its synopsis and right away I knew how much should I expect from it. Because this might be a fresh attempt in the Korean film, at least for the first time I'm seeing in a Korean film, but not from the world cinema. Yeah, I have seen plenty, and I'd liked most of them. But this film was much, much better than it had been rated in the internet. The story, the main event starts without wasting any time. There's no initial developments like intros. When the thriller-adventure parts commences, reveals everything you have to know.\r\n\r\nJust over 2 hours long, the story frequently switches back and forth to where a man got trapped in a collapsed tunnel road and the outside where people and rescue team gathered. Like any other similar themed film, it borrowed a handful of clichés, but still you can witness the effort for the avoidance. Like if you see something or someone's crucial part come into play, usually you would predict what might happen to it in the later part of the story. Since those are unavoidable, they simply skipped in the final act as it is understandable and not to waste developing them to some extent.\r\n\r\nSo a man is fighting for his survival after a disaster strikes. But he got a cell phone signal buried under a deep mountain that I could not get. Anyway, he does make know his state of condition to the outside world. Soon they all rally to get him out. This film is not entirely a serious episode, despite the theme was. A little bit of satire. If that's how the film was intended or not, at least I had a couple of good laughs. Kind of reminded me 'Peepli (Live)', about the media circus in such situation. But that is the truth, what todays media have become, because of competition among themselves.\r\n\r\n> ❝Don't be weak and say you'll die, just live.❞\r\n\r\nThe trapped man has to make sure about food and water to survive till the rescue team reaches him down which could take a week or more. Yeah, they kind of mention the recent Chile event which was made into the film, 'The 33'. His portion of the story is like the combination of '127 Hours', 'Buried' and of course that Chilean film. There are lots of things happen, you could say twists and turns. Kind of too much at some point, the way they added more contents to it, but decently it all worked out.\r\n\r\nMeanwhile, on the outside world, not lags behind. It has its own set of characters and its circumstance events. Lots of fun and also highlights wrongs. Particularly like I said, the media and how politicians make use of such incident for publicity. And the final one about the construction firms and their shoddy works for profits. They have dug on these topics, but did not go deeper, because to keep it lighter and entertaining film than all about awareness.\r\n\r\nAll the way an engaging narrative. Means a long film, but very swiftly told story. Visually, it was a well made film, like everything's looked natural and believable. You could not differentiate the CGI/green screen work and the real objects of those disaster parts. But not the technical details such as drilling or the hollow space where he stays alive. When the narration progresses, it gets even worse, like you would say how could that even possible or just they wanted it that way to end the tale.\r\n\r\nA small part of the end kind of skips, but that's good for the film than dragging it for another half an hour. The casting was good, they all performed well, but my favourite was Oh Dal-su. As usual, I loved his part, one of the finest supporting characters in the world cinema. It's not a great film, but good, and acceptable as what it is. In the end feels like worth it. So I decided to suggest it for those who are interested, but could not decide whether to go for it or not, and for the Korean film fans outside the Korea.\r\n\r\n_7.5/10_", "created_at": "2017-06-05T21:47:16.330Z"}]