[{"movie_id": 31246, "review_id": "5fa44c831b7294003b8e1d82", "author_rating": 6.0, "review_text": "_**Fun musical / beach flick**_\r\n\r\nAll these ultra-low reviews are ridiculous. What were these people expecting? A serious drama with superb acting? An action film? Actually \"From Justin to KellY\" (2003) is a fun musical/beach film in the manner of Elvis films and the 60's beach flicks. One look at the movie poster and it's obvious.\r\n\r\nWhen viewing films of this ilk it's time to just kick back, turn off your brain and have a good time. On this level \"From Justin to Kelly\" works fabulously. It's pretty much just as good or better than any Elvis or beach movie you can think of. Filmed in the Miami/Ft. Lauderdale area, the story deals with the romantic adventures of youths on Spring Break. Keeping with the traditions of the genre there's no raunch or moronic sex/bathroom humor; the film has an appealing innocence.\r\n\r\nAnother highlight is that there are more gorgeous bikini-clad babes per minute than most movies out there (dudes too, if you're a woman).\r\n\r\nTo be expected, the songs featured are all substance-less modern pop ditties ('modern' as in the early 2000s, which hasn't changed much today). I don't normally listen to this kind of music, but it fits the upbeat and fun vibe of the film.\r\n\r\nI'm hardly an American Idol aficionado but I admit that I did enjoy the show when I occasionally viewed it with my wife. And Kelly Clarkson and Justin Guarini, the two stars of the film, were two of the more likable \"idols.\". (I also confess to liking Katharine McPhee, Bo Bice, Carrie Underwood, Chris Daughtry, Kelly Pickler and Clay Aiken). (I'm just joking about Aiken, lol). To be expected, Kelly and Justin aren't the best actors but they're not bad either, particularly as the story proceeds; the quality of the acting certainly doesn't prevent you from enjoying the flick. They did a fine job all things considered.\r\n\r\nOne can't bring up American Idol without mentioning the ever-present Kimberly Caldwell (from the channel station). She's an undeniably good-looking woman but she tends to grate on the nerves. The reason I bring her up is, if you've ever secretly fantasized about seeing her chopped in half, be sure to check out the goofy gorefest \"Wrong Turn 2: Dead End\" (2007) (I'd call it a horror film but it's way too silly and over-the-top to be horrifying). This film makes your fantasies come true, literally.\r\n\r\nThe DVD features the 81-minute fullscreen version of the film whereas as well as the 90-minute extended widescreen cut, which has a few extra dance numbers.\r\n\r\nIf you're in the mood for an innocent beach flick turn your brain off and enjoy!\r\n\r\nGRADE: B/B-", "created_at": "2020-11-05T19:03:31.158Z"}]