[{"movie_id": 542224, "review_id": "5e502612a93d250013469f0a", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAs surprising (and shameful) as it might be, I didn't know the original tale of which the film is based on. Maybe I just couldn't remember because once I learned the story, it did seem familiar. Either way, not knowing anything before-hand is my favorite way of \"preparing\" myself to watch a movie. I was moderately interested in this horror take of Gretel & Hansel, and I was genuinely excited to see Sophia Lillis as the lead actress. I feel very divided about it. It's a super captivating film production-wise, but it lacks some emotionally compelling storytelling, especially in the last third of the narrative.\r\n\r\nFirst of all, Sophia Lillis is excellent as Gretel. I really enjoyed her performances in It and It: Chapter Two, and I knew she had something special. It was a matter of time until she got the right role at the right movie, and Oz Perkins can thank her for carrying most of the story on her shoulders. With a well-balanced display, Lillis beautifully incorporates Gretel's persona, offering a good range of emotions, and proving that she has a future under horror projects.\r\n\r\nGretel's love for her brother is demonstrated both through affection and cold interactions, making their relationship feel less fairytale and more realistic. Sam Leakey is a pleasant surprise as Hansel, considering this is his acting debut. While it's noticeable that he's still green, he didn't annoy me at all, and he actually delivered a couple of great lines. Alice Krige offers a cliche yet weirdly captivating performance as the evil witch.\r\n\r\nNevertheless, it's through its beautiful visuals and addictive original score (very 80s-like) that Gretel & Hansel got me invested until the end. Its production and set design create such an immersive environment, and its score (Robin Coudert) elevates basically every single scene. Galo Olivares' cinematography features an unusual style, but one that easily generates tension and suspense. Technically, it's honestly a fantastic surprise, I was not expecting such a high-level film in these regards.\r\n\r\nHowever, it all comes down to the two main components of every movie: screenplay and characters. Even if Gretel is well-developed, the other characters could have received a bit of more care. The screenplay is the main issue, though. It starts with narration and heavy exposition. Something that takes too much out of the runtime, and it seems partially unnecessary since some of the information is somewhat repeated later on. It also spoils (well, it heavily hints) the connecting dots to the second half's mystery, turning that half too predictable and, to be completely honest, a tad boring.\r\n\r\nThe ending is also underwhelming. By not being able to properly close the narrative, the feeling of disappointment is tricky to avoid. It's one of those films that will definitely divide critics and audiences all around the world. The first group still has the technical aspects that can captivate anyone until the very end. However, audiences simply want to be entertained, and the purposefully slow pacing won't help, so I do understand if this group has an adverse reaction to this adaptation.\r\n\r\nAll in all, Gretel & Hansel is a pretty uncommon horror flick. It possesses technical features worthy of the very best movies of the same genre, but its screenplay lacks creativity and overall quality. A predictable narrative with slow pacing is (almost?) never a good attribute. Nevertheless, Sophia Lillis is an outstanding lead, giving a great performance. Galo Olivares' cinematography is pretty unique, the production and set design make the whole environment very immersive, but it's the addictive score from Robin Coudert that steals the spotlight. Oz Perkins shows excellent directing skills, but a less appealing second half with a disappointing third act doesn't let this film reach its true potential.\r\n\r\nRating: C+", "created_at": "2020-02-21T18:48:50.328Z"}]