[{"movie_id": 484641, "review_id": "5d82a0b1f6787a002e9e39d8", "author_rating": 7.0, "review_text": "Decent enough 1980s-era espionage action-thriller that pretty much combines Atomic Blonde, Red Sparrow and Besson's La Femme Nikita. Sasha Luss in the lead was quite good and the fight scenes were well choreographed. The story isn't special but twists were good and it did keep me entertained thanks to a nice supporting cast, especially Helen Mirren. **3.5/5**", "created_at": "2019-09-18T21:25:05.433Z"}, {"movie_id": 484641, "review_id": "5e0758d126dac10012709b48", "author_rating": 3.0, "review_text": "If _Red Sparrow_ was the crap version of _Atomic Blonde_, when the Hell does that make the crap version of _Red Sparrow_?\r\n\r\n...Fuckin' _Anna_ I guess.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-12-28T13:29:53.435Z"}, {"movie_id": 484641, "review_id": "6116659399d5c30046efd418", "author_rating": 7.0, "review_text": "I'm a sucker for Luc Besson's films. Even when they're bad they're better than most of the action schlock churned out both by Hollywood and cash-grab direct-to-video indies. \r\n\r\nThere is a lot I could rip to shreds from the implausibility of pretty much everything that happens to the less-than-stellar acting at times... but that's not why one watches a Luc Besson film. It's a wild and fun ride that doesn't let up and has some truly inspired action set pieces, some campy humor, and hyper-stylized imagery that makes this a joy to watch.", "created_at": "2021-08-13T12:29:07.128Z"}, {"movie_id": 484641, "review_id": "63793dd8156cc700763195c7", "author_rating": 5.0, "review_text": "**In a genre filled with solid spy action thrillers with small budgets, Anna disappoints even with a solid cast and experienced director.**\r\n\r\nMy hopes were high with the promise of a spy film with a John Wick-type female protagonist and a supporting cast with Luke Evans, Helen Mirren, and Cillian Murphy. But Anna doesn't even manage to entertain. The screen time is chewed up by developing her undercover identity, her various romances, hurts, betrayals, and very little subterfuge or action. Anna might have been released in theaters, but it was the quality of a direct-to-stream b-movie that had the dreams of a bigger budget film. I had expected more from Luc Beeson, the director of Leon, Nikita, and the Fifth Element. It's surprising with a director with successful films in the genre and an excellent supporting cast that, Anna ended up subpar and bland.", "created_at": "2022-11-19T20:34:32.495Z"}, {"movie_id": 484641, "review_id": "6383731f1b157d008244a4e3", "author_rating": 6.0, "review_text": "Luckily, Luc Besson has just enough notoriety left over to stimulate a bit of interest in his films. Had that not remained the case, then this derivative effort would probably never have seen the light of day. It tells the tale of the young model \"Anna\" (Sasha Luss) who is recruited by \"Tchenkov\" (Luke Evans) and his boss \"Olga\" (Dame Helen Mirren) to work for the KGB. She has the looks, the beauty - and the ninja skills, and is soon proving very effective and attracting the attention of the CIA in the form of \"Miller\" (Cillian Murphy). Quickly she, he, and her Soviet mentor are all caught up in a rather predictable game of cat and mouse. This has got really nothing to help it to stand out or to redeem the repetitive nature of the story. Fight, escape, fight, escape... It's all so routine, and frankly dull. Evans and Dame Helen deliver accents that are as thick as last months Tiramisu and though she does enter into the spirit off her character, Luss just doesn't cut through at all as the ambidextrous and glamorous assassin. It's almost two hours of your life, so I'd think carefully about whether to not you might need to be doing the ironing instead?", "created_at": "2022-11-27T14:24:31.407Z"}]