[{"movie_id": 536554, "review_id": "63b892b6f04d01007ce9b590", "author_rating": 7.0, "review_text": "M3GAN achieved its goal perfectly by delivering a hilarious dark comedy that was incredibly aware at how ridiculous the premise is. It had me laughing my ass off and had some pretty decent kills for a PG-13 film, although I think it could have been even better with a hard R rating.\r\n\r\nBut this film is not just a dark horror comedy, it dives deeper than its surface appeal. Deep down there is intimate social commentary on parents using technology as a crutch. Whenever M3GAN is in the room, Gemma finds it easier to neglect her niece and let's M3GAN take control of the parenting. This makes it much harder for her to get a genuine connection with her to fulfill motherly needs. I found this surprisingly compelling and really does have a genuine impact in today's society, obviously not with life size android dolls but with tablets and phones. Really enjoyed this aspect of the film.\r\n\r\nAllison Williams delivered a pretty decent performance; it was nice to see her in another prominent horror role since Get Out. Violet McGraw once again was great as an inspiring child actress; her filmography is beginning to be stacked for her being such a young age. All other performances were quite lackluster, but that is expected in a film of this nature.\r\n\r\nOverall, there is not really much more to say. This film is funny, weird, and wildly fun. It's never going to be a standout competitor for award season but there is something to say about the pure entertainment it was able to deliver.\r\n\r\nScore: 66%\r\nVerdict: Good\r\nTheater Verdict: See It", "created_at": "2023-01-06T21:29:26.274Z"}, {"movie_id": 536554, "review_id": "63bf563a8efe73007d8e5303", "author_rating": 9.0, "review_text": "I was excited, but didn't have much expectations for a PG-13 horror movie. But this was a surprisingly good horror flick. Though the majority of the film's slasher moments are near the end, the story's introduction and setup were surprisingly engaging. Watching the creation of M3GAN and the development of her relationship with the characters in the story was a great way of anticipating the moment she would take matters into her own hands. \r\nMy only problem is that I wanted to see more. Overall, surprisingly solid for a PG-13 horror movie. 9/10.", "created_at": "2023-01-12T00:37:14.726Z"}, {"movie_id": 536554, "review_id": "63c4677d595a5600865cc1b7", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/m3gan-review\r\n\r\n\"M3GAN doesn't reinvent the respective subgenre of killer robots or AI that turns against humans, but it kept me entertainingly invested throughout its entire runtime.\r\n\r\nAkela Cooper's premise is pushed to its limits - and even beyond - being elevated by excellent performances, a clever satirical narrative, eyebrow-raising killings, and meaningful messages about parenting and technology's role in a child's upbringing. It doesn't take itself too seriously or tries to be more than what it truly is.\r\n\r\nFar from being a masterpiece, but if only all January horror flicks were like this one...\"\r\n\r\nRating: B", "created_at": "2023-01-15T20:52:13.669Z"}, {"movie_id": 536554, "review_id": "63cc4ff89a643500ce14f042", "author_rating": 7.0, "review_text": "**M3GAN knows what its target audience wants and delivers the exact fun horror comedy to thrill and delight.**\r\n\r\nI was conflicted before seeing the movie. On the one hand, the trailer looked ridiculous. On the other, I knew that Blumhouse and James Wan partnered for this. After seeing the reviews, I finally accepted that I had to see this movie, and I’m glad I did. Was it ridiculous? Absolutely. M3GAN knew what it was. It knew it was cheesy but had fun with it while also cranking up the tension and suspense. So many cliche “stop standing there and do something” moments that surprisingly added to the stress and horror. I wouldn’t say the movie was ever scary, but it was an excellent thriller. It’s a fun Blumhouse film that was self-aware and goofy while creepy and tense. One of my favorite parts was the short scene with one of the worst detectives of all time that had me laughing out loud in the theater. M3GAN is not a movie for everyone, but people who like other Blumhouse films and dark comedies would find themselves at home with this movie.", "created_at": "2023-01-21T20:50:00.589Z"}, {"movie_id": 536554, "review_id": "63ce94a43c434400ceed9018", "author_rating": 6.0, "review_text": "'Cady\" (Violet McGraw) finds herself living with her aunt \"Gemma\" (Alison Williams) after an altercation with a snow truck leaves her orphaned. They don't exactly hit it off. The older woman is a career-driven lady who works at a toy manufacturer, specialising in gadgets and gismos that use AI. Thing is, their market dominance is waning - much to the chagrin of boss \"David\" (Ronny Chiang). Competitors are catching up and the children are getting even more sophisticated/lazy/dependent! She has a plan though - with her colleagues \"Cole\" (Brian Jordan Alvarez) and \"Tess\" (Jen Van Epps), she is working on the ultimate \"companion\". A doll that pairs with it's owner and becomes almost sibling-like. Snag with this film is that the plot is really all rather predictable, the acting isn't up to much and I didn't find the eponymous - hideously over-dressed - creation remotely menacing. Indeed, actually, at times I found it particularly useful (the neighbour's wayward dog, for example). It's a competently strung together drama, but it's all just a little too sterile and by-the-numbers for me. It does fire a warning shot to parents who could become over-reliant on their children's own reliance on surrogate friendships and dependencies, but once that point is made - and reiterated - the rest of this is, frankly, all rather unremarkable.", "created_at": "2023-01-23T14:07:32.324Z"}, {"movie_id": 536554, "review_id": "6471bdc6a199a600a755ec3a", "author_rating": 7.0, "review_text": "**It's an enjoyable film, it carries a pertinent anti-tech message, but it's not even close to being a horror film.**\r\n\r\nFirst, let me make one thing clear: horror movies have an imperative duty to scare and disturb us. Tension, suspense, fear and some scares are something that should not be missing. It's the essence of horror cinema, right? So, can someone explain to me where came from the bad idea of making horror movies for teenagers who aren't old enough to ride a motorcycle? Don't get me wrong… the movie is good, and I liked it, but I can't consider it a horror movie. It is not able to frighten anyone! It has no scares (we are able to predict them from a mile!), it has no tension or suspense. As a horror movie, forget it. As the people say, it rains, but it doesn't get us wet, do you understand?\r\n\r\nThe script begins with a young girl who loses her parents in a tragic accident and goes to live with an aunt who works in a large corporation of highly technological toys. Things aren't easy and neither of them is prepared for the situation. It is in this context that we met M3GAN, a prototype of a toy that is, basically, an android child that is capable of learning, improving itself, teaching and, basically, replacing parents in the tiring task of… being parents. The problem is that, being a machine, it has no notion of good or bad, right or wrong, and that seems to have been a secondary detail in its programming. So it's no surprise that she quickly turns into a sly, cynical creature who kills without any remorse.\r\n\r\nThe film was directed by Gerard Johnstone, an illustrious unknown. Who is behind the project is the producer and screenwriter James Wan, who we know from “Saw” and “Conjuring 2”. Wan's brand is everywhere. It would have been better if he had directed it and the project had evolved into a somber film, a true horror piece. Allison Williams does the main character well, giving us yet another excellent job. The actress is living a happy moment in her professional life after having shone in “Get Out” and seems to be managing to take advantage of the opportunities. Amie Donald and Jenna Davis, in turn, give body and voice (respectively) to M3GAN, complementing the work with an animatronic doll created for this purpose.\r\n\r\nThe animatronic doll is nothing new. Cinema has used this technology for decades, and Spielberg's shark – one of the first and most infamous examples – is proof of that. However, the special effects and CGI are to be congratulated. The film utilizes a number of expensive visual and digital resources to excellent effect, wonderfully complementing what was done in the studio. The sound (particularly the sound effects related to the doll) also deserves praise, and the cinematography, even though it doesn't bring new or innovative features, makes the best use of it all. The film has good costumes and convincing sets, as well as a very good, modern and fun soundtrack. It's on the editing table that things go wrong: either because of the excessive length, or because it wants to target young age groups, the film was badly edited, and the cuts are rough. There are even scenes from the trailer that, because they are not in the final cut, make it difficult to understand the story: for example, the scene where Gemma orders M3EGAN to protect Cady, which appears in the trailer and was cut from the film, but which would help to understand why the doll starts to behave that way to protect its young owner.\r\n\r\nThe only real fear that this film conveys is the credible possibility that, in the medium term, there will be some toy similar to M3GAN. Advances in AI, computing, robot creation and design, or other technologies make it plausible. Will it be that one day we will have robots and androids that, due to their characteristics, will be considered alive and, as such, immortal and, therefore, superior to the humans who created them? I don't think anyone wants to see that. Therefore, the film carries with it a message of distrust in technology, visible not only in M3GAN, but also in Cady's technological dependence. I can do nothing but applaud: the generations born after the year 2000 saw their childhood dominated by cell phones, iPads or computers, to the point of despising conventional games and toys and alienating themselves from living together, normal and healthy, with other children. I'm not making it up, this is a fact that we can all see in a short trip to any school. And if there are parents who appreciate the creation of devices that keep their children busy, I am in the group of parents who see technology as something that should be dosed in a more measured way, allowing children a normal childhood before introducing them to the digital and tech world. I think there is a time for everything in life, and childhood shouldn't be spent looking at screens and LCDs.", "created_at": "2023-05-27T08:22:30.863Z"}]