[{"movie_id": 9741, "review_id": "55bae9c3c3a3684afb0059d0", "author_rating": 10.0, "review_text": "Soon found out had a heart of glass.\r\n\r\nIt often gets forgotten just what an exciting talent M. Night Shyamalan was during the early part of his film making career. True that Unbreakable, with its deliberate slow pacing and left-field narrative, would (and has) proved to be not everyone's cup-o-tea, but there's a film making craft here, and a genius idea brought to vivid life, that makes a spectrum of film lovers lament how his career nose dived, how his ideas quickly got as stupid as his acting...\r\n\r\nUnbreakable challenges the thought process, spinning a story that's of a adult comic book heart, but also of a clinical human examination. The narrative is consistently ambiguous, holding the patient viewers in enthral as the cosmic conundrums come tumbling off of the screen. It's refreshing to find a story like this that is so devoid of cliché, where the wonderfully reflective Bruce Willis and the brilliantly fascinating Samuel L. Jackson feed off each other, their character's destinies superbly steered by cast and director. Unbreakable is a complex movie, but not needlessly so, its strengths are numerous for those of a keen eye and ear. It represents Shyamalan's most clever cinematic offering, to which the sad realisation comes to pass that he would never, as yet, be this smart and vibrant again. 10/10", "created_at": "2015-07-31T03:21:39.713Z"}, {"movie_id": 9741, "review_id": "58985a18c3a368771200782f", "author_rating": 6.0, "review_text": "Not The Shamhammer's best, but certainly of the era when he was still making \"good\".\r\n\r\nFinal rating:★★★ - I personally recommend you give it a go.", "created_at": "2017-02-06T11:12:24.163Z"}, {"movie_id": 9741, "review_id": "5c3cd0a7c3a36859f53d4b8b", "author_rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWhat a movie! This is one of the most underrated films out there, and it was unfairly compared to The Sixth Sense at the time the former was released. These are two very different movies, but both of them have a lot of twists, which was what brought fame to Shyamalan's films, especially The Sixth Sense.\r\n\r\nUnbreakable follows that same methodology. It has a lot of twists throughout the runtime, and they are quite diverse: some are very technical twists, related to our point of view of a particular scene that, as it progresses, we always find ourselves tricked (these ones, most people either don't catch them or just don't care ... For me, it's proof of brilliant writing); the others are the prominent plot twists, where something unpredictable happens to the overall story.\r\n\r\nThis movie has all of that and much more. The story itself is incredibly captivating since the main plot holds a lot of mystery and suspense, but these only work as well as they did thanks to Shyamalan, both director and screenwriter. His very unconventional way of storytelling and the anxiety that he's able to convey to some fantastic scenes, elevate the film while delivering a perfect narrative. It's even more mind-blowing the fact that this movie still makes so much sense and it didn't lose its replay value after 17 years!\r\n\r\nIn fact, I bet it would be a striking success nowadays, where the superhero genre is over-saturated. Each year, we get more and more movies following the excessively used genre's formula that makes almost every blockbuster an instant box office hit. Unbreakable is nowhere near that formula, and I genuinely think that any fan of comic-book films must watch this one so everyone can understand what a \"grounded superhero movie\" actually means. M. Night Shyamalan wrote a story that everyone can appreciate, without all of those big CGI fights and overwhelming visual effects. Comic-book fan or not, Unbreakable is the closest to what reality would be if superheroes really existed.\r\n\r\nRegarding the cast, Bruce Willis probably has his career-best dramatic performance in this film. He's terrific as David and I can feel all of the emotions which he wants to transmit to the screen. Samuel L. Jackson brilliantly plays Elijah, who has a real-life disease which SLJ portrayed beautifully and respectfully. The supporting cast is also worth praising since both Robin Wright (Audrey Dunn) and Spencer Treat Clark (Joseph Dunn) play magnificent roles as the wife and son of David, respectively.\r\n\r\nEveryone helped Shyamalan direct exquisite dialogue sequences that extended for minutes without end. The editing and production of this movie are unbelievable ... and it was filmed in 2000! There are so many long, one-take scenes that explain in just a few minutes, everything you need to know about a character or a specific place or event ... Even a full action sequence is filmed in just one-take (the stunt work is also pretty efficient)! The soundtrack is so important, especially in the last act where everything comes to a conclusion. It's inspirational and even epic, I dare calling it. It's just perfect! Throughout the runtime, you can barely notice it due to how subtle it is. However, when it is needed to deliver a new layer of feelings, it always raises the moment.\r\n\r\nAs discussed above, this is a M. Night Shyamalan film, so a very powerful twist right at the end needs to happen ... and it does. It gives the audience an unpredictable perspective about the whole story. I risk myself in saying that it isn't exactly necessary, but the truth is that it makes sense and it does bring the movie to a whole other level, so very, very well done! Finally, I just wish that this film had been released now. It is so much different than what we are used to watching and experiencing, that I dare to say it is one of the best movies inside this genre.\r\n\r\nOnce again, Shyamalan shows the audience why was he becoming one of the most popular directors/screenwriters and proves that his rather unconventional storytelling, unpredictable twists and excellent direction are skills to praise more often. Bruce Willis and Samuel L. Jackson have great chemistry, but the former has his career-best dramatic performance. The editing, production, soundtrack and even the pacing of this film are entirely flawless, as well as the ending twist that leaves us with our jaws dropped. Unbreakable is one of the most underrated superhero movies ever, but it sits way on top as one of my favorites.", "created_at": "2019-01-14T18:10:47.407Z"}]