[{"movie_id": 438631, "review_id": "616262f133ec2600456a6d65", "author_rating": 10.0, "review_text": "\r\n**FABULOUS 🥇🥇🥇🥇 . . . . And , Oh , Yes . . . . Hans Zimmer's Score's Already Got \"OSCAR\" Written On It 😉 ; & EXPECT A WHOLE \" HOST OF OTHER _MAJOR_ NOMINATIONS - AS WELL \"**\r\n\r\nThis Is A **- _B I G_ -** Screen - MINI - Review. Picture Viewed Oct. 07, 2021 ; At Vox Cinemas , U . A . E\r\n\r\n______________________________________________________\r\n\r\nPaul Atreides : \" Fear is the mind-killer. Fear is the little death that brings total obliteration. I will face my fear, and I will permit it to pass over me. When the fear has gone, there will be nothing. Only I will remain \".\r\n\r\n_______________________________________\r\n_______________\r\n\r\n**1.** If you're  one of the -Millions- of people around the world who loved Denis Villeneuve's hauntingly riveting 2015 thriller 'Sicario', ( yours truly included ) ; then strap in for 'one hell of an Interstellar ride, with an -{ EQUALLY }- **\" INTERSTELLAR 🌠 \"** CAST . . . . that -literally- presents itself like a Who's-who of Hollywood's \"Best, And Brightest\". This time around, the unequivocally -{ Prolific }- Academy Award nominated French Canadian director has taken acclaimed American author Frank Herbert's 1965 sci-fi thriller, ( once touted as the world's -Best- selling science fiction novel ), & turned it into a veritable masterpiece of a movie. -Make Sure- to 'keep a special eye out' for Rebecca Ferguson's completely \"Stunning\" portrayal of 'Lady Jessica Atreides' . . . . I can promise that you most certainly -Will Not- regret it. \r\n\r\n**2.** Almost needless to say, the Music, Acting , Cinematography 🔥 , Art-direction, C.g.i, Dramatic pacing & the sprawling, lavish Set-pieces are all, well . . . -{ \" Past Compare \" }- .\r\nWhen it comes to 2021's cinematic 'big budget\" smorgasbord : if you want to see the -Very- best Popcorn Flick \"Sensation\" of the year, it's most unequivocally going to be Bond 25 : 'No Time To Die'. But, on the -other- hand, if you're more in the mood for some -equally- magnificent **\"Artfilm Meets Blockbuster\" ( no seriously )** fare . . . that may -Well- hold you in a state of 'Absolute Rapture' from start to finish, then 'Dune' should most -Definitely- be your first choice. Just make sure to come to said movie with a { Genuinely } open and unbiased --- Heart , And Mind 🙃 . \r\n\r\n**3. \" Final Analysis \" :** The only -{ Pronounced }- lack you will feel, if any at all, is that of -{ Humour }‐ . . . . especially if you're someone who enjoys their big screen delights served with, well, a \"generous\" side of unrestrained -Mirth- . I counted -Literally- only about \"3.5\" barely plausible funny moments in the -Entire- flick. But the obvious reason for that is : it simply -Wouldn't- have worked within this sort of a 'Deadly Serious' dark, dramatic, & super futuristic setting ( 10,191 \"a.g\", to be precise ). So, having taken -that- aspect of the production into consideration ; it really ended up -_NOT_ - bothering me very much, AT ALL. Thus, in sum . . . . I was utterly **-{ MESMERIZED }-** by \" Dune : Part 1 \" and hence ; I chose to give it a **\" Wholehearted, Adoring, MEGA-APPRECIATIVE 13 Marks Out Of 10❗\" .**", "created_at": "2021-10-10T03:50:09.811Z"}, {"movie_id": 438631, "review_id": "616d9b3abf31f20043e2cbb1", "author_rating": 1.0, "review_text": "The worst movie I've ever seen. Don't waste your time.", "created_at": "2021-10-18T16:05:14.243Z"}, {"movie_id": 438631, "review_id": "6170aecdabdec00043dc778e", "author_rating": 6.0, "review_text": "    As a child, I remember catching David Lynch’s “Dune” on TV. I was too young to really understand the plot at the time, but I didn’t care, all I knew was that the worms were awesome. When I got a little older, I read the book for my first time. It was the first “adult” book I read on my own, and I was in love with it ever since. I read it many more times growing up, and when the miniseries came out, I watched and recorded it every night, then re-watched it time and time again. When “Children of Dune” aired, I again devoured it happily. In the case of the Lynch film, as I grew, I of course began to see more and more of the flaws, though I personally hold the “Spicediver Edit” in quite high esteem. That particular cut of the film manages to make the Lynch version into what is a genuinely good film, but still imperfect. The miniseries has, up until now, remained my preferred adaptation. Now we have a new adaptation: Denis Villeneuve’s “Dune”, and it certainly is quite different from the previous two versions in many ways, but is it good? Well, at least from my perspective, that answer is complicated. The short version is yes, it is a good film, but it’s not a great one.\r\n\r\n    The gist of the story is straightforward. Many, many millennia in the future, Paul, the son of the Duke Leto Atreides, finds himself and his family caught in plots of intrigue, and betrayal, after taking custody of a new and valuable planet. In order to survive, he finds that he will have to depend on the training of his mother, the Lady Jessica, the help of the planets local population, the fremen, and his growing awareness of a great, yet possibly terrible destiny that waits for him. \r\n\r\n    In reality though, the story is anything but. The novel is infamous for being “unadaptable” with its complex “plots within plots” storyline, along with its sheer size. There is simply too much going on in the story to make it easy to turn into a film, or even a series. The previous efforts have all brought different aspects of the novel to the forefront, and this new version is no different. In broad strokes, it is perhaps the most faithful to the novel in terms of themes, and it certainly emphasizes some aspects of the political commentary behind the novel, such as the missionaria protectiva, which was nowhere to be found in the Lynch film, and only really hinted at in the miniseries. They also spend a little more time focusing on the fremen and their sentiments toward off-worlders after living under the Harkonnen regime, but unfortunately, while it is nice to see these themes in the film, they are undercut by little development. In fact, the entire film suffers on that front. So much of the political context and scheming has been left out that the film as presented feels somehow empty. \r\n\r\n    Early in the film, it is established that the emperor considers the Duke Leto a threat due to his popularity, but never really explores too much beyond it. Even more strangely, the film establishes this, but then later makes it seem like they were never really certain about the fact that the emperor was involved in a key scene, unlike the book, where the Duke was fully aware that they were heading into a trap, and was attempting to outmaneuver his political opponents. The Baron Harkonnen is limited to a few admittedly atmospheric scenes where he more or less confirms the emperor is aiding him in their goal to destroy the Atreides line, but it is reduced to a few scant lines, the bare minimum necessary to understand the plot. This, unfortunately results in very shallow characterization, and the same problem runs throughout the film. Gurney Halleck, Thufir Hawat, and Doctor Yueh are all present, but each of them is only given a small handful of scenes, in which they only speak a few lines each, before they are forgotten to focus on Paul, or beautiful scenic shots. They never feel like fully realized characters in the film, more as brief supporting roles, whom are only present in order to fulfill their roles in the larger storyline. Thufir Hawat receives perhaps the worst treatment in this regard. Even the primary cast are not given a lot of development. We are given enough to know who they are, and a little of their personality, but nothing more. It seems strange, that the longest adaptation of the first half of the novel ever made should have less detail and character than either previous version. It does however, and it certainly hurts the film as a result. Long, moody shots are great, but only when they exist in addition with actual depth. The plot of the film has been streamlined to the point that it feels watered-down, and genuinely wastes the talents of its cast all stuck in roles that have been similarly effected. \r\n\r\n    There are also a few key scenes that actively go against things covered in the book. One scene features the Lady Jessica speaking of secretive matters regarding the bene gesserit sisterhood while sitting in the cockpit of an ornithopter right behind Thufir Hawat, whom would be easily able to hear everything she had just said. Another moment, involves the Reverend Mother Mohiam referring to Jessica as Leto’s “wife”, even though she would know full well that they aren’t married. Yet another moment involves that Shadout Mapes pulling out a crysknife to offer it to Jessica while out in the open, and Jessica is in the presence of guards. The Shadout later sheathes the knife unblooded, and those who have read the book will know why that choice does not work for the film, especially in the context of fremen later being shown cutting themselves before sheathing their knives. Of course, in any adaptation there will be liberties taken, and there are indeed more, but these three moments in particular certainly seem to stand out the most in regards to actively going against aspects of the original novel, and in doing so, hurt this film as an adaptation.\r\n\r\n    With that said, there were things I liked as well. As I have stated a number of times, the film is gorgeous. There are a couple of scenes that certainly seemed to be more “style over substances”, such as a shot of ships rising from the ocean for… no apparent reason, but man do they look beautiful. There is also a very real sense of scale in the film that I can freely admit neither previous version ever accomplished. As a result, there are a few scenes that do far better match their description in the book, and are glorious to watch.\r\n\r\n    I do really appreciate the way they portray the emperor, discussed, but never seen. A powerful force that can be felt looming in the background, his hand guiding everything happening. He is built up excellently, and I will be curious to see how well he is portrayed if we get a sequel. In the previous adaptations, he was prominently displayed and used to provide greater context for the politics of the story, but in the book, he is only ever seen in the end, and keeping book accurate in this case certainly works very well.\r\n\r\n    The film also features the most book accurate version of Paul’s growing prescience, hinting at possible outcomes rather than complete premonitions. The way it is executed is not necessarily without its flaws, or heavy-handedness in a couple of moments, but it works well. Similarly, we also get the story of the bull and Leto’s father for the first time, though the film attempts to make the bull symbolic in a manner I am not sure really works, or is earned.　Also notable is the death of a significant character finally matching their death in the novel. \r\n\r\n    I have also stated that the cast does a great job, and I stand by that. In the entire film, there is not a bad performance in the film. My only complaint would be with the portrayal of the Lady Jessica, who comes across as too emotional, presumably in an attempt to show her ability to shift from being upset to being entirely refined and composed in moments, but that is a matter of writing rather than performance. When it comes to the casting, I personally felt that many of the actors matched their roles well, in particular enjoying the casting of Duke Leto and the Baron. I did not however care much for the gender-swapping of Liet, which served no real purpose, especially when one considers how small the characters role was in this version of the film, though Sharon Duncan-Brewster did a good job with what she had. I also did not care for the casting of Rebecca Ferguson as Jessica. While she is a very good actress, she seemed to me a bit too “girl next door”, rather than the character from the novel that the Duke Leto notes “reintroduced regality into the Atreides line”. \r\n\r\n    When it comes to the score, I will admit that I was not certain how I would feel in regards to Hans Zimmer’s work on the film. The samples I had heard up until this point had been interesting, but I was not sure how it would work in terms of the film itself. I can say that it works well, though there are moments when it feels almost as watered-down as the plot itself. It never really allowed me to feel excited at any point, but it did match the tone of the film very well, and I can easily see myself turning it on whenever I clean my house in order to set a “mood” (Ha! See what I did there?). \r\n\r\n    In conclusion, despite my criticisms, I did enjoy the film. I think it works well enough to be understood, though there may be some moments where the average viewer could find themselves feeling confused. It certainly is a visual spectacle, but one undercut by excessive trimming of detail and world-building. I hope it is successful enough to warrant a sequel in order to finish the story, but I also find that I will not be upset if it does not. As adaptations go, this is no “The Lord of the Rings”. In the end, I have to rate this version of “Dune” closer to the original Lynch film, and maintain the miniseries as my favorite adaptation of an amazing novel.", "created_at": "2021-10-21T00:05:33.631Z"}, {"movie_id": 438631, "review_id": "6171738babdec000622bd805", "author_rating": null, "review_text": "Great movie with excellent BG music and visual effects. Waiting for part two.", "created_at": "2021-10-21T14:04:59.187Z"}, {"movie_id": 438631, "review_id": "61732977a097dc002a9b722f", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dune-spoiler-free-review\r\n\r\n\"Dune sets the new standard for epic cinema with eyegamic visuals, powerful sound design and score, and a compelling story told surrounded by an absolutely massive scale.\r\n\r\nDenis Villeneuve adds yet another audiovisual masterpiece to his filmography, despite some narrative-pacing issues due to the heavy exposition and repetitive yet crucial dream sequences. Timothée Chalamet and Rebecca Ferguson stand out in a stellar cast, where everyone delivers performances no short of impressive.\r\n\r\nFrom the remarkable character work to the constantly captivating interactions, without forgetting the spectacle of the riveting action/war scenes, the extremely layered screenplay is beautifully translated to the big screen, where every viewer should definitely go to watch this movie.\r\n\r\nFinally, don't forget that epic sci-fi/fantasy films are quite rare, so enjoy them as much as you can when they come out, instead of worrying about the comparisons with other sagas.\r\n\r\nThere's enough space to love them all.\"\r\n\r\nRating: A-", "created_at": "2021-10-22T21:13:27.576Z"}, {"movie_id": 438631, "review_id": "6179c519bb070d0062fff6df", "author_rating": 4.0, "review_text": "I'll open by saying I am not a fan of Villeneuve. In fact, I think he's a hack whose only genuine talent is making stupid people falsely think they are actually quite smart. I am also a HUGE Dune fan. They have been my favourite series of books since I first discovered them as a teenager. So although I hoped for the best with this, I was expecting the worst. What I got was somewhere in the middle. It's an OK movie, not great, thankfully not terrible, but OK\r\n\r\nIt got some things right the 1984 Lynch version got wrong, but still somehow managed to get other stuff wrong (including stuff Lynch got right). It was also a surprise how much Villeneuve just lifted directly from the Lynch film, both visually and auditorily.\r\n\r\nThe wardrobe choices were a huge disappointment. If you didn't know the time setting, going just on the clothes in the new Dune you'd be forgiven for thinking it was set a mere forty or fifty years (if that) in the future rather than the twenty thousand years in the future when it's really set. The Lynch stillsuits look futuristic, unworldly, and something that really would keep you alive in the deep desert. The new desert wear looks like they are just going to go dirt biking for an hour or two in our present-day world.\r\n\r\nThe casting (completely ignoring the pointless gender swap) was good, However, with the exception of Paul, Chani, and Rabban the original casting was all better. But the original (apart from the odd decision to use the totally unsuited Kyle MacLachlan) was a masterclass in how to cast the perfect people for the role.\r\n\r\nAnyway, enough of the comparisons, This film is about the first two-thirds of the first novel. I always thought the story would be better told via a big-budget TV series (or even mini-series) rather than a standalone movie. I still think what they tried to cover here was too much for a single movie, but it was a step in the right direction.\r\n\r\nThe film mainly sticks to the book story but does make some needless changes, the most obvious of which being the changes made to both the gender and story of Liet Kynes, which in turn impacts the story of Chani. Most other changes are small and mainly insignificant though.\r\n\r\nThe film being filmed in Norway, Jordan, and Abu Dhabi looks fantastic and very well suited to the large screen. And it's clear a great deal of time, effort, and money was put into the sets that looked equally good as the places they were meant to be.\r\n\r\nThe acting was of a suitably high standard, but unfortunately, many of the Dune names and terms were horribly mispronounced. That and the Hans Zimmer fart that is played constantly throughout the soundtrack is likely to pull people out of their emersion in the movie.\r\n\r\nI was also somewhat surprised by what was left out, OK the source material is VERY dense and obviously some needed to be cut, but I don't really think it's made clear just how crucial melange is to the functioning of the empire and society as a whole. Also what (and why) mentats are is largely ignored, you may think that isn't overly important, but it is at the core of how many things are done in the Dune universe.\r\n\r\nOver all, it's not a bad movie. Despite its flaws, I still think the 1984 Lynch version is better though.", "created_at": "2021-10-27T21:31:05.180Z"}, {"movie_id": 438631, "review_id": "6187330570309f0043940e07", "author_rating": 6.0, "review_text": "I enjoyed parts of this movie. But I seem to recall that I enjoyed reading the book this is based on (it was decades ago after all). And since I don’t remember the details of the source novel, I don’t know if it is the screenplay that dragged down my overall opinion or the original book.\r\n\r\nI can sum up pretty quickly the pieces that disappointed me, and be advised they are probably spoilers.\r\n\r\nI didn’t like how long it took to get our first glimpse of the spice worms, and even then they were represented as holes in the sand. Not exactly awesome. I didn’t like how they quickly killed off all the good guys except for Paul and his mom (okay, yeah that is definitely a spoiler). Plus I thought it weird that during the big battle scene we have awesome bombs and complex tracer missiles flying about, but on the ground we have merely well-choreographed hand-to-hand fighting with knives and swords. Couldn’t the folks who invented the missile come up with a pistol? Or am I being picky?", "created_at": "2021-11-07T01:59:33.313Z"}, {"movie_id": 438631, "review_id": "6192edac1ad93b0043d2a0bc", "author_rating": 2.0, "review_text": "I read Frank Herbert's book, Dune, when I was in high school and really don't remember it much except that it was great and a little scary. At that age, I probably didn't get the subtext message.\r\n\r\nI never saw any movies of it so I decided to watch both the 1984 Dune by David Lynch and the 2021 Denis Villeneuve version sequentially. I'm going to talk about both of them here.\r\n\r\nThis may not be a popular opinion: Lynch's version is **brilliant** and the Villeneuve Dune is absolute **shit**. Here's why:\r\n\r\nFirst, is the Villeneuve Dune slick? Yes, absolutely. I should hope so considering it's nearly 40 years after Lynch did his, for crissake.\r\n\r\nAre the character's in David Lynch's version kitschy and over the top? Yes! That's one reason it's so much better! It's Sci Fi, duh! You watch Marvel movies and suspend disbelief for incredible, imaginary super powers? All of Lynch's characters are downright gritty and believable within this particular surreal fantasy.\r\n\r\nBy the end of the Lynch Dune, I had sympathy for nearly every character in the film. Even the villains caught my emotions. Paul Atreides character development was realistic and attractive.\r\n\r\nVilleneuve's characters? I felt like my neighbor came over and asked, \"Hey, can you come to watch my kid's junior high school play?\" \"Sure, Denis, just let me fill my 1-liter flask with tequila first.\"\r\n\r\nVilleneuve's characters were so damned flat and lifeless that they evoked NO emotional response whatsoever. Although I occasionally sit through a bad flick, I can't remember recently watching a movie as awful character-wise, as the 2021 Dune. If I were an actor on that set, I would be silently screaming. How does a director even do this?\r\n\r\nOh, and where's the creativity? It's 46 years since George Lucas founded Industrial Light & Magic, and Denis can't create one single, new, goddamn space machine 46 years later? (One could argue the hummingbird copter is new, but it's not so creative when you realize that we didn't even know how hummingbird wings actually worked until this millennia.)\r\n\r\nBut here's the real clincher: the screenplay. David Lynch gave us a complete story. Sadly, he didn't have the final cut and disowned his film when the critics panned it. Despite the fact that Lynch is a true artist and genius, the studio took 45 minutes out of the film. 45 minutes! Even ruined by the studio, even 40 years later, Lynch's film has a clear vision and carries the timeless message that Frank Herbert intended. I would LOVE to see the original cut!\r\n\r\nVilleneuve, on the other hand, stopped abruptly in the middle of the book. I now realize that Denis is not about the story. Denis is all about the franchise money, and that sucks. As a result of the bad screenplay, this 2021 version doesn't even carry the socio-political statement it was supposed to have. I want my 155 minutes back.\r\n\r\nI don't watch Part 2s, especially when it comes to void-of-creativity and void-of-character-development Hollywood movies. You can take your bad franchise and shove it up your sci fi black hole.\r\n\r\nAdmittedly, I loved Blade Runner 2049, but this is so disappointing, I may never watch another Villeneuve film again. Do yourself a favor and see David Lynch's version of Dune.", "created_at": "2021-11-15T23:30:52.817Z"}, {"movie_id": 438631, "review_id": "61d8c475383df20095589aa5", "author_rating": 8.0, "review_text": "This newest adaptation of the classic Frank Herbert novel (which I've never read) has the usual amazing visuals director Denis Villeneuve is known for alongside great cinematography from Greig Fraser (Rogue One, upcoming The Batman) plus the incredible and bombastic score by Hans Zimmer has the technical aspects but void of any real emotion behind the story and, especially, characters.\r\n\r\nI couldn't find much wrong with the performances but nobody really wowed me despite having talents like Oscar Isaac, Josh Brolin, Javier Bardem, Jason Momoa and Rebecca Ferguson, I didn't think anybody stood out, and that includes Timothée Chalamet in the lead role. I can't say this was at all bad and have some mild interest in part two, but, and this says a lot about Villeneuve's great career, this is one of his lesser films. I'll probably at some point give this another watch, especially when/if part two comes out (who knows when that will be). **3.75/5** (rounding it, I was debating 3.5 or 4, went with the latter)\r\n\r\nOn the plus side, it is much better than the 1984 adaptation.", "created_at": "2022-01-07T22:53:41.500Z"}, {"movie_id": 438631, "review_id": "61f65f4d59e8a900c3a4cb1b", "author_rating": 10.0, "review_text": "I was really eager to watch this movie and at the same time a wee bit concerned because I knew that I would be hugely disappointed if it turned out to be another movie massacring a classic source material.\r\n\r\nI have to admit that it was a very long time since I read the Dune books but I have to say that the movie was mostly true to the books, as I remember them, and also reasonably free of agenda driven rubbish apart from the odd replacement of some characters with “gender correct” ones for no real good reason.\r\n\r\nThere is really not much point in me saying much about the story. It should be well known for any science fiction fan and it is a great story and really good material for a big screen movie despite some “critics” at Rotten Tomatoes moaning about it and calling it unwieldly etc. Probably too big a book with too many words for the small, agenda driven, brains of Rotten Tomatoes “critics”. No surprise there.\r\n\r\nThe movie as a whole is wonderful to watch, the scenery is oftentimes very beautiful and the décor, the buildings, the machinery is very well done. I was surprised that the world of Caladan was portrayed as a rather austere Scottish looking landscape but after getting over the initial surprise it worked very well actually.\r\n\r\nI also like that the Harkonnen, especially the Baron, are not turned into some exaggerated comical figures but, although disgusting and despicable, they are actual humans.\r\n\r\nOverall the casting was quite good and everyone played their roles well. At the beginning I felt that Paul was a bit too wimpy, from what I remember of the book he was quite well trained and skilled already from the start, but he picked up as the movie went along.\r\n\r\nIt is a science fiction, borderline fantasy, movie so there should be some special effects, right? This is a difficult movie to make special effects for since this universe is a weird mix between futuristic science fiction, fantasy elements and old-fashioned traditions.\r\n\r\nI have to say that they succeeded quite well though. The atmosphere felt just right, ships, spice harvesters, buildings looked cool and fitting the story. The way they implemented the personal shields was very nice. They didn’t go overboard on special effects and weird designs. The ornithopter was of course totally ridiculous from a scientific point of view but at least it looked pretty cool.\r\n\r\nIf I should complain about something, although that is not the fault of the movie but of the source material, I have never understood how, in a universe which is obviously driven by hidden agendas, machinations and assassinations, the Atreides could just pick up everything, leave their home and put all their important eggs in one basket at Arrakis.\r\n\r\nOne more small thing that I could complain about would of course be that we now have to wait two years, from what I have read, until we get to watch the next movie to get to the part were the really cool stuff happens.\r\n\r\nBottom line, this was movie is definitely in there vying for the title “best movie that I have watched this year”.", "created_at": "2022-01-30T09:50:05.425Z"}, {"movie_id": 438631, "review_id": "621a8e11f1b5710042ccdd8b", "author_rating": 8.0, "review_text": "‘Dune’s massive scope tends to overshadow its storyline and characters, but in return we get a great cast and stunning visuals, leaving us hoping the second chapter will be able to live up to the expectations.\r\n\r\n8/10", "created_at": "2022-02-26T20:31:13.130Z"}, {"movie_id": 438631, "review_id": "62d1aa6d549dda02d5d345b6", "author_rating": 9.0, "review_text": "_Dune_ was a massive undertaking due to the sheer amount of lore and political backstory director Villeneuve had to fit in a two-and-a-half-hour run-time, but I am happy to say it was executed brilliantly.\r\n\r\nThe story of _Dune_ is incredibly deep, there are so many layers of political factions and relationships that it can get quite confusing at times. I had to constantly be looking up specific individuals and their ties to each other to understand the minor nuances of the story. Despite that fact, Villeneuve is still able to deliver a coherent narrative that will allow the majority of the audience to understand the overarching plot. After the buildup of the first act, the story gets cooking, and I was utterly invested.\r\n\r\nThere is an incredible atmosphere present in this film. It begins as a Sci-Fi epic, following a house starting anew on a fresh planet and a new industry to conquer. You can feel the optimism and the sense of discovery in the shots due to the interesting angles, lighting, and a brilliant soundtrack composed by Hans Zimmer. But as the narrative evolves so does the tone, as a thick fog of helplessness bleeds on to the screen and you can feel the dread form. This tone was quite refreshing in today’s blockbuster cinema, as each movie needs to incorporate a vast amount of unnecessary comedy to appeal to the broader audience. Dune is unapologetic about what the story is trying to deliver and gives you exactly what it wants without any concessions.\r\n\r\nThe visuals are stunning throughout the entire runtime. One of my favorite scenes was during the spice extraction visit. I loved the blend of realism that was used in this Science Fiction setting. The ships and equipment look like they could exist in our own world with a few technological advancements. The fight choreography is really well done, especially the hand-to-hand combat. The final scene was epic, each fist and punch were so sharp and calculated, it was really impressive to watch in the age of jump cut action.\r\n\r\nThe acting is perfect throughout the film, I really cannot point to any one character that felt off or out of place. Timothee Chalamet did an incredible job as the lead man. He delivered a heartfelt performance and evolved throughout the entire film into the confident leader the story crashendos on. Rebecca Ferguson, Oscar Isaac, and Josh Brolin all did great jobs as well. I really brought the somewhat complex nature of Lady Jessic and Duke Leto, they had really great chemistry with themselves and with their son. Stellan Skarsgard had my favorite performance of the entire film. I felt entirely disgusted everytime he was on the screen, and he made the hairs on the back of my neck stand tall. He is truly a man poisoned by greed and will not stop at anything on his path to fortune. Jason Momoa does a fantastic job here too. I felt he really fit his role and his lines were delivered effortlessly, much better than his performance in the DCEU.\r\n\r\n_Dune_ delivers a fantastic Sci-Fi epic that gave me everything I was looking for and I will be eagerly awaiting the sequel's release.\r\n\r\n**Score:** _88%_\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-07-15T17:57:01.104Z"}, {"movie_id": 438631, "review_id": "630019b51c6aa7007ffc1007", "author_rating": 8.0, "review_text": "**Overall : Dune creates a universe and characters at an epic scale similar to Star Wars. For sci-fi fans, cinema fans, and fans of incredible special effects, Dune is a must-see.**\r\n\r\nProbably the most visually stunning movie of the year. I watched it first at home on HBO Max but had to see and hear it again in theaters when I realized this movie required a complete theatrical experience! The cast was top-notch, and the scale that Denis Villeneuve evoked in every scene was breathtaking. From the moment, Dune starts, it demands a sequel through its world-building, acting, and storylines leaving the audience wanting answers (the fact that it literally begins with the words \"Part One\" helps too). I can't wait to see what comes next!", "created_at": "2022-08-19T23:16:05.343Z"}, {"movie_id": 438631, "review_id": "616262f133ec2600456a6d65", "author_rating": 10.0, "review_text": "\r\n**FABULOUS 🥇🥇🥇🥇 . . . . And , Oh , Yes . . . . Hans Zimmer's Score's Already Got \"OSCAR\" Written On It 😉 ; & EXPECT A WHOLE \" HOST OF OTHER _MAJOR_ NOMINATIONS - AS WELL \"**\r\n\r\nThis Is A **- _B I G_ -** Screen - MINI - Review. Picture Viewed Oct. 07, 2021 ; At Vox Cinemas , U . A . E\r\n\r\n______________________________________________________\r\n\r\nPaul Atreides : \" Fear is the mind-killer. Fear is the little death that brings total obliteration. I will face my fear, and I will permit it to pass over me. When the fear has gone, there will be nothing. Only I will remain \".\r\n\r\n_______________________________________\r\n_______________\r\n\r\n**1.** If you're  one of the -Millions- of people around the world who loved Denis Villeneuve's hauntingly riveting 2015 thriller 'Sicario', ( yours truly included ) ; then strap in for 'one hell of an Interstellar ride, with an -{ EQUALLY }- **\" INTERSTELLAR 🌠 \"** CAST . . . . that -literally- presents itself like a Who's-who of Hollywood's \"Best, And Brightest\". This time around, the unequivocally -{ Prolific }- Academy Award nominated French Canadian director has taken acclaimed American author Frank Herbert's 1965 sci-fi thriller, ( once touted as the world's -Best- selling science fiction novel ), & turned it into a veritable masterpiece of a movie. -Make Sure- to 'keep a special eye out' for Rebecca Ferguson's completely \"Stunning\" portrayal of 'Lady Jessica Atreides' . . . . I can promise that you most certainly -Will Not- regret it. \r\n\r\n**2.** Almost needless to say, the Music, Acting , Cinematography 🔥 , Art-direction, C.g.i, Dramatic pacing & the sprawling, lavish Set-pieces are all, well . . . -{ \" Past Compare \" }- .\r\nWhen it comes to 2021's cinematic 'big budget\" smorgasbord : if you want to see the -Very- best Popcorn Flick \"Sensation\" of the year, it's most unequivocally going to be Bond 25 : 'No Time To Die'. But, on the -other- hand, if you're more in the mood for some -equally- magnificent **\"Artfilm Meets Blockbuster\" ( no seriously )** fare . . . that may -Well- hold you in a state of 'Absolute Rapture' from start to finish, then 'Dune' should most -Definitely- be your first choice. Just make sure to come to said movie with a { Genuinely } open and unbiased --- Heart , And Mind 🙃 . \r\n\r\n**3. \" Final Analysis \" :** The only -{ Pronounced }- lack you will feel, if any at all, is that of -{ Humour }‐ . . . . especially if you're someone who enjoys their big screen delights served with, well, a \"generous\" side of unrestrained -Mirth- . I counted -Literally- only about \"3.5\" barely plausible funny moments in the -Entire- flick. But the obvious reason for that is : it simply -Wouldn't- have worked within this sort of a 'Deadly Serious' dark, dramatic, & super futuristic setting ( 10,191 \"a.g\", to be precise ). So, having taken -that- aspect of the production into consideration ; it really ended up -_NOT_ - bothering me very much, AT ALL. Thus, in sum . . . . I was utterly **-{ MESMERIZED }-** by \" Dune : Part 1 \" and hence ; I chose to give it a **\" Wholehearted, Adoring, MEGA-APPRECIATIVE 13 Marks Out Of 10❗\" .**", "created_at": "2021-10-10T03:50:09.811Z"}, {"movie_id": 438631, "review_id": "616d9b3abf31f20043e2cbb1", "author_rating": 1.0, "review_text": "The worst movie I've ever seen. Don't waste your time.", "created_at": "2021-10-18T16:05:14.243Z"}, {"movie_id": 438631, "review_id": "6170aecdabdec00043dc778e", "author_rating": 6.0, "review_text": "    As a child, I remember catching David Lynch’s “Dune” on TV. I was too young to really understand the plot at the time, but I didn’t care, all I knew was that the worms were awesome. When I got a little older, I read the book for my first time. It was the first “adult” book I read on my own, and I was in love with it ever since. I read it many more times growing up, and when the miniseries came out, I watched and recorded it every night, then re-watched it time and time again. When “Children of Dune” aired, I again devoured it happily. In the case of the Lynch film, as I grew, I of course began to see more and more of the flaws, though I personally hold the “Spicediver Edit” in quite high esteem. That particular cut of the film manages to make the Lynch version into what is a genuinely good film, but still imperfect. The miniseries has, up until now, remained my preferred adaptation. Now we have a new adaptation: Denis Villeneuve’s “Dune”, and it certainly is quite different from the previous two versions in many ways, but is it good? Well, at least from my perspective, that answer is complicated. The short version is yes, it is a good film, but it’s not a great one.\r\n\r\n    The gist of the story is straightforward. Many, many millennia in the future, Paul, the son of the Duke Leto Atreides, finds himself and his family caught in plots of intrigue, and betrayal, after taking custody of a new and valuable planet. In order to survive, he finds that he will have to depend on the training of his mother, the Lady Jessica, the help of the planets local population, the fremen, and his growing awareness of a great, yet possibly terrible destiny that waits for him. \r\n\r\n    In reality though, the story is anything but. The novel is infamous for being “unadaptable” with its complex “plots within plots” storyline, along with its sheer size. There is simply too much going on in the story to make it easy to turn into a film, or even a series. The previous efforts have all brought different aspects of the novel to the forefront, and this new version is no different. In broad strokes, it is perhaps the most faithful to the novel in terms of themes, and it certainly emphasizes some aspects of the political commentary behind the novel, such as the missionaria protectiva, which was nowhere to be found in the Lynch film, and only really hinted at in the miniseries. They also spend a little more time focusing on the fremen and their sentiments toward off-worlders after living under the Harkonnen regime, but unfortunately, while it is nice to see these themes in the film, they are undercut by little development. In fact, the entire film suffers on that front. So much of the political context and scheming has been left out that the film as presented feels somehow empty. \r\n\r\n    Early in the film, it is established that the emperor considers the Duke Leto a threat due to his popularity, but never really explores too much beyond it. Even more strangely, the film establishes this, but then later makes it seem like they were never really certain about the fact that the emperor was involved in a key scene, unlike the book, where the Duke was fully aware that they were heading into a trap, and was attempting to outmaneuver his political opponents. The Baron Harkonnen is limited to a few admittedly atmospheric scenes where he more or less confirms the emperor is aiding him in their goal to destroy the Atreides line, but it is reduced to a few scant lines, the bare minimum necessary to understand the plot. This, unfortunately results in very shallow characterization, and the same problem runs throughout the film. Gurney Halleck, Thufir Hawat, and Doctor Yueh are all present, but each of them is only given a small handful of scenes, in which they only speak a few lines each, before they are forgotten to focus on Paul, or beautiful scenic shots. They never feel like fully realized characters in the film, more as brief supporting roles, whom are only present in order to fulfill their roles in the larger storyline. Thufir Hawat receives perhaps the worst treatment in this regard. Even the primary cast are not given a lot of development. We are given enough to know who they are, and a little of their personality, but nothing more. It seems strange, that the longest adaptation of the first half of the novel ever made should have less detail and character than either previous version. It does however, and it certainly hurts the film as a result. Long, moody shots are great, but only when they exist in addition with actual depth. The plot of the film has been streamlined to the point that it feels watered-down, and genuinely wastes the talents of its cast all stuck in roles that have been similarly effected. \r\n\r\n    There are also a few key scenes that actively go against things covered in the book. One scene features the Lady Jessica speaking of secretive matters regarding the bene gesserit sisterhood while sitting in the cockpit of an ornithopter right behind Thufir Hawat, whom would be easily able to hear everything she had just said. Another moment, involves the Reverend Mother Mohiam referring to Jessica as Leto’s “wife”, even though she would know full well that they aren’t married. Yet another moment involves that Shadout Mapes pulling out a crysknife to offer it to Jessica while out in the open, and Jessica is in the presence of guards. The Shadout later sheathes the knife unblooded, and those who have read the book will know why that choice does not work for the film, especially in the context of fremen later being shown cutting themselves before sheathing their knives. Of course, in any adaptation there will be liberties taken, and there are indeed more, but these three moments in particular certainly seem to stand out the most in regards to actively going against aspects of the original novel, and in doing so, hurt this film as an adaptation.\r\n\r\n    With that said, there were things I liked as well. As I have stated a number of times, the film is gorgeous. There are a couple of scenes that certainly seemed to be more “style over substances”, such as a shot of ships rising from the ocean for… no apparent reason, but man do they look beautiful. There is also a very real sense of scale in the film that I can freely admit neither previous version ever accomplished. As a result, there are a few scenes that do far better match their description in the book, and are glorious to watch.\r\n\r\n    I do really appreciate the way they portray the emperor, discussed, but never seen. A powerful force that can be felt looming in the background, his hand guiding everything happening. He is built up excellently, and I will be curious to see how well he is portrayed if we get a sequel. In the previous adaptations, he was prominently displayed and used to provide greater context for the politics of the story, but in the book, he is only ever seen in the end, and keeping book accurate in this case certainly works very well.\r\n\r\n    The film also features the most book accurate version of Paul’s growing prescience, hinting at possible outcomes rather than complete premonitions. The way it is executed is not necessarily without its flaws, or heavy-handedness in a couple of moments, but it works well. Similarly, we also get the story of the bull and Leto’s father for the first time, though the film attempts to make the bull symbolic in a manner I am not sure really works, or is earned.　Also notable is the death of a significant character finally matching their death in the novel. \r\n\r\n    I have also stated that the cast does a great job, and I stand by that. In the entire film, there is not a bad performance in the film. My only complaint would be with the portrayal of the Lady Jessica, who comes across as too emotional, presumably in an attempt to show her ability to shift from being upset to being entirely refined and composed in moments, but that is a matter of writing rather than performance. When it comes to the casting, I personally felt that many of the actors matched their roles well, in particular enjoying the casting of Duke Leto and the Baron. I did not however care much for the gender-swapping of Liet, which served no real purpose, especially when one considers how small the characters role was in this version of the film, though Sharon Duncan-Brewster did a good job with what she had. I also did not care for the casting of Rebecca Ferguson as Jessica. While she is a very good actress, she seemed to me a bit too “girl next door”, rather than the character from the novel that the Duke Leto notes “reintroduced regality into the Atreides line”. \r\n\r\n    When it comes to the score, I will admit that I was not certain how I would feel in regards to Hans Zimmer’s work on the film. The samples I had heard up until this point had been interesting, but I was not sure how it would work in terms of the film itself. I can say that it works well, though there are moments when it feels almost as watered-down as the plot itself. It never really allowed me to feel excited at any point, but it did match the tone of the film very well, and I can easily see myself turning it on whenever I clean my house in order to set a “mood” (Ha! See what I did there?). \r\n\r\n    In conclusion, despite my criticisms, I did enjoy the film. I think it works well enough to be understood, though there may be some moments where the average viewer could find themselves feeling confused. It certainly is a visual spectacle, but one undercut by excessive trimming of detail and world-building. I hope it is successful enough to warrant a sequel in order to finish the story, but I also find that I will not be upset if it does not. As adaptations go, this is no “The Lord of the Rings”. In the end, I have to rate this version of “Dune” closer to the original Lynch film, and maintain the miniseries as my favorite adaptation of an amazing novel.", "created_at": "2021-10-21T00:05:33.631Z"}, {"movie_id": 438631, "review_id": "6171738babdec000622bd805", "author_rating": null, "review_text": "Great movie with excellent BG music and visual effects. Waiting for part two.", "created_at": "2021-10-21T14:04:59.187Z"}, {"movie_id": 438631, "review_id": "61732977a097dc002a9b722f", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dune-spoiler-free-review\r\n\r\n\"Dune sets the new standard for epic cinema with eyegamic visuals, powerful sound design and score, and a compelling story told surrounded by an absolutely massive scale.\r\n\r\nDenis Villeneuve adds yet another audiovisual masterpiece to his filmography, despite some narrative-pacing issues due to the heavy exposition and repetitive yet crucial dream sequences. Timothée Chalamet and Rebecca Ferguson stand out in a stellar cast, where everyone delivers performances no short of impressive.\r\n\r\nFrom the remarkable character work to the constantly captivating interactions, without forgetting the spectacle of the riveting action/war scenes, the extremely layered screenplay is beautifully translated to the big screen, where every viewer should definitely go to watch this movie.\r\n\r\nFinally, don't forget that epic sci-fi/fantasy films are quite rare, so enjoy them as much as you can when they come out, instead of worrying about the comparisons with other sagas.\r\n\r\nThere's enough space to love them all.\"\r\n\r\nRating: A-", "created_at": "2021-10-22T21:13:27.576Z"}, {"movie_id": 438631, "review_id": "6179c519bb070d0062fff6df", "author_rating": 4.0, "review_text": "I'll open by saying I am not a fan of Villeneuve. In fact, I think he's a hack whose only genuine talent is making stupid people falsely think they are actually quite smart. I am also a HUGE Dune fan. They have been my favourite series of books since I first discovered them as a teenager. So although I hoped for the best with this, I was expecting the worst. What I got was somewhere in the middle. It's an OK movie, not great, thankfully not terrible, but OK\r\n\r\nIt got some things right the 1984 Lynch version got wrong, but still somehow managed to get other stuff wrong (including stuff Lynch got right). It was also a surprise how much Villeneuve just lifted directly from the Lynch film, both visually and auditorily.\r\n\r\nThe wardrobe choices were a huge disappointment. If you didn't know the time setting, going just on the clothes in the new Dune you'd be forgiven for thinking it was set a mere forty or fifty years (if that) in the future rather than the twenty thousand years in the future when it's really set. The Lynch stillsuits look futuristic, unworldly, and something that really would keep you alive in the deep desert. The new desert wear looks like they are just going to go dirt biking for an hour or two in our present-day world.\r\n\r\nThe casting (completely ignoring the pointless gender swap) was good, However, with the exception of Paul, Chani, and Rabban the original casting was all better. But the original (apart from the odd decision to use the totally unsuited Kyle MacLachlan) was a masterclass in how to cast the perfect people for the role.\r\n\r\nAnyway, enough of the comparisons, This film is about the first two-thirds of the first novel. I always thought the story would be better told via a big-budget TV series (or even mini-series) rather than a standalone movie. I still think what they tried to cover here was too much for a single movie, but it was a step in the right direction.\r\n\r\nThe film mainly sticks to the book story but does make some needless changes, the most obvious of which being the changes made to both the gender and story of Liet Kynes, which in turn impacts the story of Chani. Most other changes are small and mainly insignificant though.\r\n\r\nThe film being filmed in Norway, Jordan, and Abu Dhabi looks fantastic and very well suited to the large screen. And it's clear a great deal of time, effort, and money was put into the sets that looked equally good as the places they were meant to be.\r\n\r\nThe acting was of a suitably high standard, but unfortunately, many of the Dune names and terms were horribly mispronounced. That and the Hans Zimmer fart that is played constantly throughout the soundtrack is likely to pull people out of their emersion in the movie.\r\n\r\nI was also somewhat surprised by what was left out, OK the source material is VERY dense and obviously some needed to be cut, but I don't really think it's made clear just how crucial melange is to the functioning of the empire and society as a whole. Also what (and why) mentats are is largely ignored, you may think that isn't overly important, but it is at the core of how many things are done in the Dune universe.\r\n\r\nOver all, it's not a bad movie. Despite its flaws, I still think the 1984 Lynch version is better though.", "created_at": "2021-10-27T21:31:05.180Z"}, {"movie_id": 438631, "review_id": "6187330570309f0043940e07", "author_rating": 6.0, "review_text": "I enjoyed parts of this movie. But I seem to recall that I enjoyed reading the book this is based on (it was decades ago after all). And since I don’t remember the details of the source novel, I don’t know if it is the screenplay that dragged down my overall opinion or the original book.\r\n\r\nI can sum up pretty quickly the pieces that disappointed me, and be advised they are probably spoilers.\r\n\r\nI didn’t like how long it took to get our first glimpse of the spice worms, and even then they were represented as holes in the sand. Not exactly awesome. I didn’t like how they quickly killed off all the good guys except for Paul and his mom (okay, yeah that is definitely a spoiler). Plus I thought it weird that during the big battle scene we have awesome bombs and complex tracer missiles flying about, but on the ground we have merely well-choreographed hand-to-hand fighting with knives and swords. Couldn’t the folks who invented the missile come up with a pistol? Or am I being picky?", "created_at": "2021-11-07T01:59:33.313Z"}, {"movie_id": 438631, "review_id": "6192edac1ad93b0043d2a0bc", "author_rating": 2.0, "review_text": "I read Frank Herbert's book, Dune, when I was in high school and really don't remember it much except that it was great and a little scary. At that age, I probably didn't get the subtext message.\r\n\r\nI never saw any movies of it so I decided to watch both the 1984 Dune by David Lynch and the 2021 Denis Villeneuve version sequentially. I'm going to talk about both of them here.\r\n\r\nThis may not be a popular opinion: Lynch's version is **brilliant** and the Villeneuve Dune is absolute **shit**. Here's why:\r\n\r\nFirst, is the Villeneuve Dune slick? Yes, absolutely. I should hope so considering it's nearly 40 years after Lynch did his, for crissake.\r\n\r\nAre the character's in David Lynch's version kitschy and over the top? Yes! That's one reason it's so much better! It's Sci Fi, duh! You watch Marvel movies and suspend disbelief for incredible, imaginary super powers? All of Lynch's characters are downright gritty and believable within this particular surreal fantasy.\r\n\r\nBy the end of the Lynch Dune, I had sympathy for nearly every character in the film. Even the villains caught my emotions. Paul Atreides character development was realistic and attractive.\r\n\r\nVilleneuve's characters? I felt like my neighbor came over and asked, \"Hey, can you come to watch my kid's junior high school play?\" \"Sure, Denis, just let me fill my 1-liter flask with tequila first.\"\r\n\r\nVilleneuve's characters were so damned flat and lifeless that they evoked NO emotional response whatsoever. Although I occasionally sit through a bad flick, I can't remember recently watching a movie as awful character-wise, as the 2021 Dune. If I were an actor on that set, I would be silently screaming. How does a director even do this?\r\n\r\nOh, and where's the creativity? It's 46 years since George Lucas founded Industrial Light & Magic, and Denis can't create one single, new, goddamn space machine 46 years later? (One could argue the hummingbird copter is new, but it's not so creative when you realize that we didn't even know how hummingbird wings actually worked until this millennia.)\r\n\r\nBut here's the real clincher: the screenplay. David Lynch gave us a complete story. Sadly, he didn't have the final cut and disowned his film when the critics panned it. Despite the fact that Lynch is a true artist and genius, the studio took 45 minutes out of the film. 45 minutes! Even ruined by the studio, even 40 years later, Lynch's film has a clear vision and carries the timeless message that Frank Herbert intended. I would LOVE to see the original cut!\r\n\r\nVilleneuve, on the other hand, stopped abruptly in the middle of the book. I now realize that Denis is not about the story. Denis is all about the franchise money, and that sucks. As a result of the bad screenplay, this 2021 version doesn't even carry the socio-political statement it was supposed to have. I want my 155 minutes back.\r\n\r\nI don't watch Part 2s, especially when it comes to void-of-creativity and void-of-character-development Hollywood movies. You can take your bad franchise and shove it up your sci fi black hole.\r\n\r\nAdmittedly, I loved Blade Runner 2049, but this is so disappointing, I may never watch another Villeneuve film again. Do yourself a favor and see David Lynch's version of Dune.", "created_at": "2021-11-15T23:30:52.817Z"}, {"movie_id": 438631, "review_id": "61d8c475383df20095589aa5", "author_rating": 8.0, "review_text": "This newest adaptation of the classic Frank Herbert novel (which I've never read) has the usual amazing visuals director Denis Villeneuve is known for alongside great cinematography from Greig Fraser (Rogue One, upcoming The Batman) plus the incredible and bombastic score by Hans Zimmer has the technical aspects but void of any real emotion behind the story and, especially, characters.\r\n\r\nI couldn't find much wrong with the performances but nobody really wowed me despite having talents like Oscar Isaac, Josh Brolin, Javier Bardem, Jason Momoa and Rebecca Ferguson, I didn't think anybody stood out, and that includes Timothée Chalamet in the lead role. I can't say this was at all bad and have some mild interest in part two, but, and this says a lot about Villeneuve's great career, this is one of his lesser films. I'll probably at some point give this another watch, especially when/if part two comes out (who knows when that will be). **3.75/5** (rounding it, I was debating 3.5 or 4, went with the latter)\r\n\r\nOn the plus side, it is much better than the 1984 adaptation.", "created_at": "2022-01-07T22:53:41.500Z"}, {"movie_id": 438631, "review_id": "61f65f4d59e8a900c3a4cb1b", "author_rating": 10.0, "review_text": "I was really eager to watch this movie and at the same time a wee bit concerned because I knew that I would be hugely disappointed if it turned out to be another movie massacring a classic source material.\r\n\r\nI have to admit that it was a very long time since I read the Dune books but I have to say that the movie was mostly true to the books, as I remember them, and also reasonably free of agenda driven rubbish apart from the odd replacement of some characters with “gender correct” ones for no real good reason.\r\n\r\nThere is really not much point in me saying much about the story. It should be well known for any science fiction fan and it is a great story and really good material for a big screen movie despite some “critics” at Rotten Tomatoes moaning about it and calling it unwieldly etc. Probably too big a book with too many words for the small, agenda driven, brains of Rotten Tomatoes “critics”. No surprise there.\r\n\r\nThe movie as a whole is wonderful to watch, the scenery is oftentimes very beautiful and the décor, the buildings, the machinery is very well done. I was surprised that the world of Caladan was portrayed as a rather austere Scottish looking landscape but after getting over the initial surprise it worked very well actually.\r\n\r\nI also like that the Harkonnen, especially the Baron, are not turned into some exaggerated comical figures but, although disgusting and despicable, they are actual humans.\r\n\r\nOverall the casting was quite good and everyone played their roles well. At the beginning I felt that Paul was a bit too wimpy, from what I remember of the book he was quite well trained and skilled already from the start, but he picked up as the movie went along.\r\n\r\nIt is a science fiction, borderline fantasy, movie so there should be some special effects, right? This is a difficult movie to make special effects for since this universe is a weird mix between futuristic science fiction, fantasy elements and old-fashioned traditions.\r\n\r\nI have to say that they succeeded quite well though. The atmosphere felt just right, ships, spice harvesters, buildings looked cool and fitting the story. The way they implemented the personal shields was very nice. They didn’t go overboard on special effects and weird designs. The ornithopter was of course totally ridiculous from a scientific point of view but at least it looked pretty cool.\r\n\r\nIf I should complain about something, although that is not the fault of the movie but of the source material, I have never understood how, in a universe which is obviously driven by hidden agendas, machinations and assassinations, the Atreides could just pick up everything, leave their home and put all their important eggs in one basket at Arrakis.\r\n\r\nOne more small thing that I could complain about would of course be that we now have to wait two years, from what I have read, until we get to watch the next movie to get to the part were the really cool stuff happens.\r\n\r\nBottom line, this was movie is definitely in there vying for the title “best movie that I have watched this year”.", "created_at": "2022-01-30T09:50:05.425Z"}, {"movie_id": 438631, "review_id": "621a8e11f1b5710042ccdd8b", "author_rating": 8.0, "review_text": "‘Dune’s massive scope tends to overshadow its storyline and characters, but in return we get a great cast and stunning visuals, leaving us hoping the second chapter will be able to live up to the expectations.\r\n\r\n8/10", "created_at": "2022-02-26T20:31:13.130Z"}, {"movie_id": 438631, "review_id": "62d1aa6d549dda02d5d345b6", "author_rating": 9.0, "review_text": "_Dune_ was a massive undertaking due to the sheer amount of lore and political backstory director Villeneuve had to fit in a two-and-a-half-hour run-time, but I am happy to say it was executed brilliantly.\r\n\r\nThe story of _Dune_ is incredibly deep, there are so many layers of political factions and relationships that it can get quite confusing at times. I had to constantly be looking up specific individuals and their ties to each other to understand the minor nuances of the story. Despite that fact, Villeneuve is still able to deliver a coherent narrative that will allow the majority of the audience to understand the overarching plot. After the buildup of the first act, the story gets cooking, and I was utterly invested.\r\n\r\nThere is an incredible atmosphere present in this film. It begins as a Sci-Fi epic, following a house starting anew on a fresh planet and a new industry to conquer. You can feel the optimism and the sense of discovery in the shots due to the interesting angles, lighting, and a brilliant soundtrack composed by Hans Zimmer. But as the narrative evolves so does the tone, as a thick fog of helplessness bleeds on to the screen and you can feel the dread form. This tone was quite refreshing in today’s blockbuster cinema, as each movie needs to incorporate a vast amount of unnecessary comedy to appeal to the broader audience. Dune is unapologetic about what the story is trying to deliver and gives you exactly what it wants without any concessions.\r\n\r\nThe visuals are stunning throughout the entire runtime. One of my favorite scenes was during the spice extraction visit. I loved the blend of realism that was used in this Science Fiction setting. The ships and equipment look like they could exist in our own world with a few technological advancements. The fight choreography is really well done, especially the hand-to-hand combat. The final scene was epic, each fist and punch were so sharp and calculated, it was really impressive to watch in the age of jump cut action.\r\n\r\nThe acting is perfect throughout the film, I really cannot point to any one character that felt off or out of place. Timothee Chalamet did an incredible job as the lead man. He delivered a heartfelt performance and evolved throughout the entire film into the confident leader the story crashendos on. Rebecca Ferguson, Oscar Isaac, and Josh Brolin all did great jobs as well. I really brought the somewhat complex nature of Lady Jessic and Duke Leto, they had really great chemistry with themselves and with their son. Stellan Skarsgard had my favorite performance of the entire film. I felt entirely disgusted everytime he was on the screen, and he made the hairs on the back of my neck stand tall. He is truly a man poisoned by greed and will not stop at anything on his path to fortune. Jason Momoa does a fantastic job here too. I felt he really fit his role and his lines were delivered effortlessly, much better than his performance in the DCEU.\r\n\r\n_Dune_ delivers a fantastic Sci-Fi epic that gave me everything I was looking for and I will be eagerly awaiting the sequel's release.\r\n\r\n**Score:** _88%_\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-07-15T17:57:01.104Z"}, {"movie_id": 438631, "review_id": "630019b51c6aa7007ffc1007", "author_rating": 8.0, "review_text": "**Overall : Dune creates a universe and characters at an epic scale similar to Star Wars. For sci-fi fans, cinema fans, and fans of incredible special effects, Dune is a must-see.**\r\n\r\nProbably the most visually stunning movie of the year. I watched it first at home on HBO Max but had to see and hear it again in theaters when I realized this movie required a complete theatrical experience! The cast was top-notch, and the scale that Denis Villeneuve evoked in every scene was breathtaking. From the moment, Dune starts, it demands a sequel through its world-building, acting, and storylines leaving the audience wanting answers (the fact that it literally begins with the words \"Part One\" helps too). I can't wait to see what comes next!", "created_at": "2022-08-19T23:16:05.343Z"}, {"movie_id": 438631, "review_id": "616262f133ec2600456a6d65", "author_rating": 10.0, "review_text": "\r\n**FABULOUS 🥇🥇🥇🥇 . . . . And , Oh , Yes . . . . Hans Zimmer's Score's Already Got \"OSCAR\" Written On It 😉 ; & EXPECT A WHOLE \" HOST OF OTHER _MAJOR_ NOMINATIONS - AS WELL \"**\r\n\r\nThis Is A **- _B I G_ -** Screen - MINI - Review. Picture Viewed Oct. 07, 2021 ; At Vox Cinemas , U . A . E\r\n\r\n______________________________________________________\r\n\r\nPaul Atreides : \" Fear is the mind-killer. Fear is the little death that brings total obliteration. I will face my fear, and I will permit it to pass over me. When the fear has gone, there will be nothing. Only I will remain \".\r\n\r\n_______________________________________\r\n_______________\r\n\r\n**1.** If you're  one of the -Millions- of people around the world who loved Denis Villeneuve's hauntingly riveting 2015 thriller 'Sicario', ( yours truly included ) ; then strap in for 'one hell of an Interstellar ride, with an -{ EQUALLY }- **\" INTERSTELLAR 🌠 \"** CAST . . . . that -literally- presents itself like a Who's-who of Hollywood's \"Best, And Brightest\". This time around, the unequivocally -{ Prolific }- Academy Award nominated French Canadian director has taken acclaimed American author Frank Herbert's 1965 sci-fi thriller, ( once touted as the world's -Best- selling science fiction novel ), & turned it into a veritable masterpiece of a movie. -Make Sure- to 'keep a special eye out' for Rebecca Ferguson's completely \"Stunning\" portrayal of 'Lady Jessica Atreides' . . . . I can promise that you most certainly -Will Not- regret it. \r\n\r\n**2.** Almost needless to say, the Music, Acting , Cinematography 🔥 , Art-direction, C.g.i, Dramatic pacing & the sprawling, lavish Set-pieces are all, well . . . -{ \" Past Compare \" }- .\r\nWhen it comes to 2021's cinematic 'big budget\" smorgasbord : if you want to see the -Very- best Popcorn Flick \"Sensation\" of the year, it's most unequivocally going to be Bond 25 : 'No Time To Die'. But, on the -other- hand, if you're more in the mood for some -equally- magnificent **\"Artfilm Meets Blockbuster\" ( no seriously )** fare . . . that may -Well- hold you in a state of 'Absolute Rapture' from start to finish, then 'Dune' should most -Definitely- be your first choice. Just make sure to come to said movie with a { Genuinely } open and unbiased --- Heart , And Mind 🙃 . \r\n\r\n**3. \" Final Analysis \" :** The only -{ Pronounced }- lack you will feel, if any at all, is that of -{ Humour }‐ . . . . especially if you're someone who enjoys their big screen delights served with, well, a \"generous\" side of unrestrained -Mirth- . I counted -Literally- only about \"3.5\" barely plausible funny moments in the -Entire- flick. But the obvious reason for that is : it simply -Wouldn't- have worked within this sort of a 'Deadly Serious' dark, dramatic, & super futuristic setting ( 10,191 \"a.g\", to be precise ). So, having taken -that- aspect of the production into consideration ; it really ended up -_NOT_ - bothering me very much, AT ALL. Thus, in sum . . . . I was utterly **-{ MESMERIZED }-** by \" Dune : Part 1 \" and hence ; I chose to give it a **\" Wholehearted, Adoring, MEGA-APPRECIATIVE 13 Marks Out Of 10❗\" .**", "created_at": "2021-10-10T03:50:09.811Z"}, {"movie_id": 438631, "review_id": "616d9b3abf31f20043e2cbb1", "author_rating": 1.0, "review_text": "The worst movie I've ever seen. Don't waste your time.", "created_at": "2021-10-18T16:05:14.243Z"}, {"movie_id": 438631, "review_id": "6170aecdabdec00043dc778e", "author_rating": 6.0, "review_text": "    As a child, I remember catching David Lynch’s “Dune” on TV. I was too young to really understand the plot at the time, but I didn’t care, all I knew was that the worms were awesome. When I got a little older, I read the book for my first time. It was the first “adult” book I read on my own, and I was in love with it ever since. I read it many more times growing up, and when the miniseries came out, I watched and recorded it every night, then re-watched it time and time again. When “Children of Dune” aired, I again devoured it happily. In the case of the Lynch film, as I grew, I of course began to see more and more of the flaws, though I personally hold the “Spicediver Edit” in quite high esteem. That particular cut of the film manages to make the Lynch version into what is a genuinely good film, but still imperfect. The miniseries has, up until now, remained my preferred adaptation. Now we have a new adaptation: Denis Villeneuve’s “Dune”, and it certainly is quite different from the previous two versions in many ways, but is it good? Well, at least from my perspective, that answer is complicated. The short version is yes, it is a good film, but it’s not a great one.\r\n\r\n    The gist of the story is straightforward. Many, many millennia in the future, Paul, the son of the Duke Leto Atreides, finds himself and his family caught in plots of intrigue, and betrayal, after taking custody of a new and valuable planet. In order to survive, he finds that he will have to depend on the training of his mother, the Lady Jessica, the help of the planets local population, the fremen, and his growing awareness of a great, yet possibly terrible destiny that waits for him. \r\n\r\n    In reality though, the story is anything but. The novel is infamous for being “unadaptable” with its complex “plots within plots” storyline, along with its sheer size. There is simply too much going on in the story to make it easy to turn into a film, or even a series. The previous efforts have all brought different aspects of the novel to the forefront, and this new version is no different. In broad strokes, it is perhaps the most faithful to the novel in terms of themes, and it certainly emphasizes some aspects of the political commentary behind the novel, such as the missionaria protectiva, which was nowhere to be found in the Lynch film, and only really hinted at in the miniseries. They also spend a little more time focusing on the fremen and their sentiments toward off-worlders after living under the Harkonnen regime, but unfortunately, while it is nice to see these themes in the film, they are undercut by little development. In fact, the entire film suffers on that front. So much of the political context and scheming has been left out that the film as presented feels somehow empty. \r\n\r\n    Early in the film, it is established that the emperor considers the Duke Leto a threat due to his popularity, but never really explores too much beyond it. Even more strangely, the film establishes this, but then later makes it seem like they were never really certain about the fact that the emperor was involved in a key scene, unlike the book, where the Duke was fully aware that they were heading into a trap, and was attempting to outmaneuver his political opponents. The Baron Harkonnen is limited to a few admittedly atmospheric scenes where he more or less confirms the emperor is aiding him in their goal to destroy the Atreides line, but it is reduced to a few scant lines, the bare minimum necessary to understand the plot. This, unfortunately results in very shallow characterization, and the same problem runs throughout the film. Gurney Halleck, Thufir Hawat, and Doctor Yueh are all present, but each of them is only given a small handful of scenes, in which they only speak a few lines each, before they are forgotten to focus on Paul, or beautiful scenic shots. They never feel like fully realized characters in the film, more as brief supporting roles, whom are only present in order to fulfill their roles in the larger storyline. Thufir Hawat receives perhaps the worst treatment in this regard. Even the primary cast are not given a lot of development. We are given enough to know who they are, and a little of their personality, but nothing more. It seems strange, that the longest adaptation of the first half of the novel ever made should have less detail and character than either previous version. It does however, and it certainly hurts the film as a result. Long, moody shots are great, but only when they exist in addition with actual depth. The plot of the film has been streamlined to the point that it feels watered-down, and genuinely wastes the talents of its cast all stuck in roles that have been similarly effected. \r\n\r\n    There are also a few key scenes that actively go against things covered in the book. One scene features the Lady Jessica speaking of secretive matters regarding the bene gesserit sisterhood while sitting in the cockpit of an ornithopter right behind Thufir Hawat, whom would be easily able to hear everything she had just said. Another moment, involves the Reverend Mother Mohiam referring to Jessica as Leto’s “wife”, even though she would know full well that they aren’t married. Yet another moment involves that Shadout Mapes pulling out a crysknife to offer it to Jessica while out in the open, and Jessica is in the presence of guards. The Shadout later sheathes the knife unblooded, and those who have read the book will know why that choice does not work for the film, especially in the context of fremen later being shown cutting themselves before sheathing their knives. Of course, in any adaptation there will be liberties taken, and there are indeed more, but these three moments in particular certainly seem to stand out the most in regards to actively going against aspects of the original novel, and in doing so, hurt this film as an adaptation.\r\n\r\n    With that said, there were things I liked as well. As I have stated a number of times, the film is gorgeous. There are a couple of scenes that certainly seemed to be more “style over substances”, such as a shot of ships rising from the ocean for… no apparent reason, but man do they look beautiful. There is also a very real sense of scale in the film that I can freely admit neither previous version ever accomplished. As a result, there are a few scenes that do far better match their description in the book, and are glorious to watch.\r\n\r\n    I do really appreciate the way they portray the emperor, discussed, but never seen. A powerful force that can be felt looming in the background, his hand guiding everything happening. He is built up excellently, and I will be curious to see how well he is portrayed if we get a sequel. In the previous adaptations, he was prominently displayed and used to provide greater context for the politics of the story, but in the book, he is only ever seen in the end, and keeping book accurate in this case certainly works very well.\r\n\r\n    The film also features the most book accurate version of Paul’s growing prescience, hinting at possible outcomes rather than complete premonitions. The way it is executed is not necessarily without its flaws, or heavy-handedness in a couple of moments, but it works well. Similarly, we also get the story of the bull and Leto’s father for the first time, though the film attempts to make the bull symbolic in a manner I am not sure really works, or is earned.　Also notable is the death of a significant character finally matching their death in the novel. \r\n\r\n    I have also stated that the cast does a great job, and I stand by that. In the entire film, there is not a bad performance in the film. My only complaint would be with the portrayal of the Lady Jessica, who comes across as too emotional, presumably in an attempt to show her ability to shift from being upset to being entirely refined and composed in moments, but that is a matter of writing rather than performance. When it comes to the casting, I personally felt that many of the actors matched their roles well, in particular enjoying the casting of Duke Leto and the Baron. I did not however care much for the gender-swapping of Liet, which served no real purpose, especially when one considers how small the characters role was in this version of the film, though Sharon Duncan-Brewster did a good job with what she had. I also did not care for the casting of Rebecca Ferguson as Jessica. While she is a very good actress, she seemed to me a bit too “girl next door”, rather than the character from the novel that the Duke Leto notes “reintroduced regality into the Atreides line”. \r\n\r\n    When it comes to the score, I will admit that I was not certain how I would feel in regards to Hans Zimmer’s work on the film. The samples I had heard up until this point had been interesting, but I was not sure how it would work in terms of the film itself. I can say that it works well, though there are moments when it feels almost as watered-down as the plot itself. It never really allowed me to feel excited at any point, but it did match the tone of the film very well, and I can easily see myself turning it on whenever I clean my house in order to set a “mood” (Ha! See what I did there?). \r\n\r\n    In conclusion, despite my criticisms, I did enjoy the film. I think it works well enough to be understood, though there may be some moments where the average viewer could find themselves feeling confused. It certainly is a visual spectacle, but one undercut by excessive trimming of detail and world-building. I hope it is successful enough to warrant a sequel in order to finish the story, but I also find that I will not be upset if it does not. As adaptations go, this is no “The Lord of the Rings”. In the end, I have to rate this version of “Dune” closer to the original Lynch film, and maintain the miniseries as my favorite adaptation of an amazing novel.", "created_at": "2021-10-21T00:05:33.631Z"}, {"movie_id": 438631, "review_id": "6171738babdec000622bd805", "author_rating": null, "review_text": "Great movie with excellent BG music and visual effects. Waiting for part two.", "created_at": "2021-10-21T14:04:59.187Z"}, {"movie_id": 438631, "review_id": "61732977a097dc002a9b722f", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dune-spoiler-free-review\r\n\r\n\"Dune sets the new standard for epic cinema with eyegamic visuals, powerful sound design and score, and a compelling story told surrounded by an absolutely massive scale.\r\n\r\nDenis Villeneuve adds yet another audiovisual masterpiece to his filmography, despite some narrative-pacing issues due to the heavy exposition and repetitive yet crucial dream sequences. Timothée Chalamet and Rebecca Ferguson stand out in a stellar cast, where everyone delivers performances no short of impressive.\r\n\r\nFrom the remarkable character work to the constantly captivating interactions, without forgetting the spectacle of the riveting action/war scenes, the extremely layered screenplay is beautifully translated to the big screen, where every viewer should definitely go to watch this movie.\r\n\r\nFinally, don't forget that epic sci-fi/fantasy films are quite rare, so enjoy them as much as you can when they come out, instead of worrying about the comparisons with other sagas.\r\n\r\nThere's enough space to love them all.\"\r\n\r\nRating: A-", "created_at": "2021-10-22T21:13:27.576Z"}, {"movie_id": 438631, "review_id": "6179c519bb070d0062fff6df", "author_rating": 4.0, "review_text": "I'll open by saying I am not a fan of Villeneuve. In fact, I think he's a hack whose only genuine talent is making stupid people falsely think they are actually quite smart. I am also a HUGE Dune fan. They have been my favourite series of books since I first discovered them as a teenager. So although I hoped for the best with this, I was expecting the worst. What I got was somewhere in the middle. It's an OK movie, not great, thankfully not terrible, but OK\r\n\r\nIt got some things right the 1984 Lynch version got wrong, but still somehow managed to get other stuff wrong (including stuff Lynch got right). It was also a surprise how much Villeneuve just lifted directly from the Lynch film, both visually and auditorily.\r\n\r\nThe wardrobe choices were a huge disappointment. If you didn't know the time setting, going just on the clothes in the new Dune you'd be forgiven for thinking it was set a mere forty or fifty years (if that) in the future rather than the twenty thousand years in the future when it's really set. The Lynch stillsuits look futuristic, unworldly, and something that really would keep you alive in the deep desert. The new desert wear looks like they are just going to go dirt biking for an hour or two in our present-day world.\r\n\r\nThe casting (completely ignoring the pointless gender swap) was good, However, with the exception of Paul, Chani, and Rabban the original casting was all better. But the original (apart from the odd decision to use the totally unsuited Kyle MacLachlan) was a masterclass in how to cast the perfect people for the role.\r\n\r\nAnyway, enough of the comparisons, This film is about the first two-thirds of the first novel. I always thought the story would be better told via a big-budget TV series (or even mini-series) rather than a standalone movie. I still think what they tried to cover here was too much for a single movie, but it was a step in the right direction.\r\n\r\nThe film mainly sticks to the book story but does make some needless changes, the most obvious of which being the changes made to both the gender and story of Liet Kynes, which in turn impacts the story of Chani. Most other changes are small and mainly insignificant though.\r\n\r\nThe film being filmed in Norway, Jordan, and Abu Dhabi looks fantastic and very well suited to the large screen. And it's clear a great deal of time, effort, and money was put into the sets that looked equally good as the places they were meant to be.\r\n\r\nThe acting was of a suitably high standard, but unfortunately, many of the Dune names and terms were horribly mispronounced. That and the Hans Zimmer fart that is played constantly throughout the soundtrack is likely to pull people out of their emersion in the movie.\r\n\r\nI was also somewhat surprised by what was left out, OK the source material is VERY dense and obviously some needed to be cut, but I don't really think it's made clear just how crucial melange is to the functioning of the empire and society as a whole. Also what (and why) mentats are is largely ignored, you may think that isn't overly important, but it is at the core of how many things are done in the Dune universe.\r\n\r\nOver all, it's not a bad movie. Despite its flaws, I still think the 1984 Lynch version is better though.", "created_at": "2021-10-27T21:31:05.180Z"}, {"movie_id": 438631, "review_id": "6187330570309f0043940e07", "author_rating": 6.0, "review_text": "I enjoyed parts of this movie. But I seem to recall that I enjoyed reading the book this is based on (it was decades ago after all). And since I don’t remember the details of the source novel, I don’t know if it is the screenplay that dragged down my overall opinion or the original book.\r\n\r\nI can sum up pretty quickly the pieces that disappointed me, and be advised they are probably spoilers.\r\n\r\nI didn’t like how long it took to get our first glimpse of the spice worms, and even then they were represented as holes in the sand. Not exactly awesome. I didn’t like how they quickly killed off all the good guys except for Paul and his mom (okay, yeah that is definitely a spoiler). Plus I thought it weird that during the big battle scene we have awesome bombs and complex tracer missiles flying about, but on the ground we have merely well-choreographed hand-to-hand fighting with knives and swords. Couldn’t the folks who invented the missile come up with a pistol? Or am I being picky?", "created_at": "2021-11-07T01:59:33.313Z"}, {"movie_id": 438631, "review_id": "6192edac1ad93b0043d2a0bc", "author_rating": 2.0, "review_text": "I read Frank Herbert's book, Dune, when I was in high school and really don't remember it much except that it was great and a little scary. At that age, I probably didn't get the subtext message.\r\n\r\nI never saw any movies of it so I decided to watch both the 1984 Dune by David Lynch and the 2021 Denis Villeneuve version sequentially. I'm going to talk about both of them here.\r\n\r\nThis may not be a popular opinion: Lynch's version is **brilliant** and the Villeneuve Dune is absolute **shit**. Here's why:\r\n\r\nFirst, is the Villeneuve Dune slick? Yes, absolutely. I should hope so considering it's nearly 40 years after Lynch did his, for crissake.\r\n\r\nAre the character's in David Lynch's version kitschy and over the top? Yes! That's one reason it's so much better! It's Sci Fi, duh! You watch Marvel movies and suspend disbelief for incredible, imaginary super powers? All of Lynch's characters are downright gritty and believable within this particular surreal fantasy.\r\n\r\nBy the end of the Lynch Dune, I had sympathy for nearly every character in the film. Even the villains caught my emotions. Paul Atreides character development was realistic and attractive.\r\n\r\nVilleneuve's characters? I felt like my neighbor came over and asked, \"Hey, can you come to watch my kid's junior high school play?\" \"Sure, Denis, just let me fill my 1-liter flask with tequila first.\"\r\n\r\nVilleneuve's characters were so damned flat and lifeless that they evoked NO emotional response whatsoever. Although I occasionally sit through a bad flick, I can't remember recently watching a movie as awful character-wise, as the 2021 Dune. If I were an actor on that set, I would be silently screaming. How does a director even do this?\r\n\r\nOh, and where's the creativity? It's 46 years since George Lucas founded Industrial Light & Magic, and Denis can't create one single, new, goddamn space machine 46 years later? (One could argue the hummingbird copter is new, but it's not so creative when you realize that we didn't even know how hummingbird wings actually worked until this millennia.)\r\n\r\nBut here's the real clincher: the screenplay. David Lynch gave us a complete story. Sadly, he didn't have the final cut and disowned his film when the critics panned it. Despite the fact that Lynch is a true artist and genius, the studio took 45 minutes out of the film. 45 minutes! Even ruined by the studio, even 40 years later, Lynch's film has a clear vision and carries the timeless message that Frank Herbert intended. I would LOVE to see the original cut!\r\n\r\nVilleneuve, on the other hand, stopped abruptly in the middle of the book. I now realize that Denis is not about the story. Denis is all about the franchise money, and that sucks. As a result of the bad screenplay, this 2021 version doesn't even carry the socio-political statement it was supposed to have. I want my 155 minutes back.\r\n\r\nI don't watch Part 2s, especially when it comes to void-of-creativity and void-of-character-development Hollywood movies. You can take your bad franchise and shove it up your sci fi black hole.\r\n\r\nAdmittedly, I loved Blade Runner 2049, but this is so disappointing, I may never watch another Villeneuve film again. Do yourself a favor and see David Lynch's version of Dune.", "created_at": "2021-11-15T23:30:52.817Z"}, {"movie_id": 438631, "review_id": "61d8c475383df20095589aa5", "author_rating": 8.0, "review_text": "This newest adaptation of the classic Frank Herbert novel (which I've never read) has the usual amazing visuals director Denis Villeneuve is known for alongside great cinematography from Greig Fraser (Rogue One, upcoming The Batman) plus the incredible and bombastic score by Hans Zimmer has the technical aspects but void of any real emotion behind the story and, especially, characters.\r\n\r\nI couldn't find much wrong with the performances but nobody really wowed me despite having talents like Oscar Isaac, Josh Brolin, Javier Bardem, Jason Momoa and Rebecca Ferguson, I didn't think anybody stood out, and that includes Timothée Chalamet in the lead role. I can't say this was at all bad and have some mild interest in part two, but, and this says a lot about Villeneuve's great career, this is one of his lesser films. I'll probably at some point give this another watch, especially when/if part two comes out (who knows when that will be). **3.75/5** (rounding it, I was debating 3.5 or 4, went with the latter)\r\n\r\nOn the plus side, it is much better than the 1984 adaptation.", "created_at": "2022-01-07T22:53:41.500Z"}, {"movie_id": 438631, "review_id": "61f65f4d59e8a900c3a4cb1b", "author_rating": 10.0, "review_text": "I was really eager to watch this movie and at the same time a wee bit concerned because I knew that I would be hugely disappointed if it turned out to be another movie massacring a classic source material.\r\n\r\nI have to admit that it was a very long time since I read the Dune books but I have to say that the movie was mostly true to the books, as I remember them, and also reasonably free of agenda driven rubbish apart from the odd replacement of some characters with “gender correct” ones for no real good reason.\r\n\r\nThere is really not much point in me saying much about the story. It should be well known for any science fiction fan and it is a great story and really good material for a big screen movie despite some “critics” at Rotten Tomatoes moaning about it and calling it unwieldly etc. Probably too big a book with too many words for the small, agenda driven, brains of Rotten Tomatoes “critics”. No surprise there.\r\n\r\nThe movie as a whole is wonderful to watch, the scenery is oftentimes very beautiful and the décor, the buildings, the machinery is very well done. I was surprised that the world of Caladan was portrayed as a rather austere Scottish looking landscape but after getting over the initial surprise it worked very well actually.\r\n\r\nI also like that the Harkonnen, especially the Baron, are not turned into some exaggerated comical figures but, although disgusting and despicable, they are actual humans.\r\n\r\nOverall the casting was quite good and everyone played their roles well. At the beginning I felt that Paul was a bit too wimpy, from what I remember of the book he was quite well trained and skilled already from the start, but he picked up as the movie went along.\r\n\r\nIt is a science fiction, borderline fantasy, movie so there should be some special effects, right? This is a difficult movie to make special effects for since this universe is a weird mix between futuristic science fiction, fantasy elements and old-fashioned traditions.\r\n\r\nI have to say that they succeeded quite well though. The atmosphere felt just right, ships, spice harvesters, buildings looked cool and fitting the story. The way they implemented the personal shields was very nice. They didn’t go overboard on special effects and weird designs. The ornithopter was of course totally ridiculous from a scientific point of view but at least it looked pretty cool.\r\n\r\nIf I should complain about something, although that is not the fault of the movie but of the source material, I have never understood how, in a universe which is obviously driven by hidden agendas, machinations and assassinations, the Atreides could just pick up everything, leave their home and put all their important eggs in one basket at Arrakis.\r\n\r\nOne more small thing that I could complain about would of course be that we now have to wait two years, from what I have read, until we get to watch the next movie to get to the part were the really cool stuff happens.\r\n\r\nBottom line, this was movie is definitely in there vying for the title “best movie that I have watched this year”.", "created_at": "2022-01-30T09:50:05.425Z"}, {"movie_id": 438631, "review_id": "621a8e11f1b5710042ccdd8b", "author_rating": 8.0, "review_text": "‘Dune’s massive scope tends to overshadow its storyline and characters, but in return we get a great cast and stunning visuals, leaving us hoping the second chapter will be able to live up to the expectations.\r\n\r\n8/10", "created_at": "2022-02-26T20:31:13.130Z"}, {"movie_id": 438631, "review_id": "62d1aa6d549dda02d5d345b6", "author_rating": 9.0, "review_text": "_Dune_ was a massive undertaking due to the sheer amount of lore and political backstory director Villeneuve had to fit in a two-and-a-half-hour run-time, but I am happy to say it was executed brilliantly.\r\n\r\nThe story of _Dune_ is incredibly deep, there are so many layers of political factions and relationships that it can get quite confusing at times. I had to constantly be looking up specific individuals and their ties to each other to understand the minor nuances of the story. Despite that fact, Villeneuve is still able to deliver a coherent narrative that will allow the majority of the audience to understand the overarching plot. After the buildup of the first act, the story gets cooking, and I was utterly invested.\r\n\r\nThere is an incredible atmosphere present in this film. It begins as a Sci-Fi epic, following a house starting anew on a fresh planet and a new industry to conquer. You can feel the optimism and the sense of discovery in the shots due to the interesting angles, lighting, and a brilliant soundtrack composed by Hans Zimmer. But as the narrative evolves so does the tone, as a thick fog of helplessness bleeds on to the screen and you can feel the dread form. This tone was quite refreshing in today’s blockbuster cinema, as each movie needs to incorporate a vast amount of unnecessary comedy to appeal to the broader audience. Dune is unapologetic about what the story is trying to deliver and gives you exactly what it wants without any concessions.\r\n\r\nThe visuals are stunning throughout the entire runtime. One of my favorite scenes was during the spice extraction visit. I loved the blend of realism that was used in this Science Fiction setting. The ships and equipment look like they could exist in our own world with a few technological advancements. The fight choreography is really well done, especially the hand-to-hand combat. The final scene was epic, each fist and punch were so sharp and calculated, it was really impressive to watch in the age of jump cut action.\r\n\r\nThe acting is perfect throughout the film, I really cannot point to any one character that felt off or out of place. Timothee Chalamet did an incredible job as the lead man. He delivered a heartfelt performance and evolved throughout the entire film into the confident leader the story crashendos on. Rebecca Ferguson, Oscar Isaac, and Josh Brolin all did great jobs as well. I really brought the somewhat complex nature of Lady Jessic and Duke Leto, they had really great chemistry with themselves and with their son. Stellan Skarsgard had my favorite performance of the entire film. I felt entirely disgusted everytime he was on the screen, and he made the hairs on the back of my neck stand tall. He is truly a man poisoned by greed and will not stop at anything on his path to fortune. Jason Momoa does a fantastic job here too. I felt he really fit his role and his lines were delivered effortlessly, much better than his performance in the DCEU.\r\n\r\n_Dune_ delivers a fantastic Sci-Fi epic that gave me everything I was looking for and I will be eagerly awaiting the sequel's release.\r\n\r\n**Score:** _88%_\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-07-15T17:57:01.104Z"}, {"movie_id": 438631, "review_id": "630019b51c6aa7007ffc1007", "author_rating": 8.0, "review_text": "**Overall : Dune creates a universe and characters at an epic scale similar to Star Wars. For sci-fi fans, cinema fans, and fans of incredible special effects, Dune is a must-see.**\r\n\r\nProbably the most visually stunning movie of the year. I watched it first at home on HBO Max but had to see and hear it again in theaters when I realized this movie required a complete theatrical experience! The cast was top-notch, and the scale that Denis Villeneuve evoked in every scene was breathtaking. From the moment, Dune starts, it demands a sequel through its world-building, acting, and storylines leaving the audience wanting answers (the fact that it literally begins with the words \"Part One\" helps too). I can't wait to see what comes next!", "created_at": "2022-08-19T23:16:05.343Z"}, {"movie_id": 438631, "review_id": "616262f133ec2600456a6d65", "author_rating": 10.0, "review_text": "\r\n**FABULOUS 🥇🥇🥇🥇 . . . . And , Oh , Yes . . . . Hans Zimmer's Score's Already Got \"OSCAR\" Written On It 😉 ; & EXPECT A WHOLE \" HOST OF OTHER _MAJOR_ NOMINATIONS - AS WELL \"**\r\n\r\nThis Is A **- _B I G_ -** Screen - MINI - Review. Picture Viewed Oct. 07, 2021 ; At Vox Cinemas , U . A . E\r\n\r\n______________________________________________________\r\n\r\nPaul Atreides : \" Fear is the mind-killer. Fear is the little death that brings total obliteration. I will face my fear, and I will permit it to pass over me. When the fear has gone, there will be nothing. Only I will remain \".\r\n\r\n_______________________________________\r\n_______________\r\n\r\n**1.** If you're  one of the -Millions- of people around the world who loved Denis Villeneuve's hauntingly riveting 2015 thriller 'Sicario', ( yours truly included ) ; then strap in for 'one hell of an Interstellar ride, with an -{ EQUALLY }- **\" INTERSTELLAR 🌠 \"** CAST . . . . that -literally- presents itself like a Who's-who of Hollywood's \"Best, And Brightest\". This time around, the unequivocally -{ Prolific }- Academy Award nominated French Canadian director has taken acclaimed American author Frank Herbert's 1965 sci-fi thriller, ( once touted as the world's -Best- selling science fiction novel ), & turned it into a veritable masterpiece of a movie. -Make Sure- to 'keep a special eye out' for Rebecca Ferguson's completely \"Stunning\" portrayal of 'Lady Jessica Atreides' . . . . I can promise that you most certainly -Will Not- regret it. \r\n\r\n**2.** Almost needless to say, the Music, Acting , Cinematography 🔥 , Art-direction, C.g.i, Dramatic pacing & the sprawling, lavish Set-pieces are all, well . . . -{ \" Past Compare \" }- .\r\nWhen it comes to 2021's cinematic 'big budget\" smorgasbord : if you want to see the -Very- best Popcorn Flick \"Sensation\" of the year, it's most unequivocally going to be Bond 25 : 'No Time To Die'. But, on the -other- hand, if you're more in the mood for some -equally- magnificent **\"Artfilm Meets Blockbuster\" ( no seriously )** fare . . . that may -Well- hold you in a state of 'Absolute Rapture' from start to finish, then 'Dune' should most -Definitely- be your first choice. Just make sure to come to said movie with a { Genuinely } open and unbiased --- Heart , And Mind 🙃 . \r\n\r\n**3. \" Final Analysis \" :** The only -{ Pronounced }- lack you will feel, if any at all, is that of -{ Humour }‐ . . . . especially if you're someone who enjoys their big screen delights served with, well, a \"generous\" side of unrestrained -Mirth- . I counted -Literally- only about \"3.5\" barely plausible funny moments in the -Entire- flick. But the obvious reason for that is : it simply -Wouldn't- have worked within this sort of a 'Deadly Serious' dark, dramatic, & super futuristic setting ( 10,191 \"a.g\", to be precise ). So, having taken -that- aspect of the production into consideration ; it really ended up -_NOT_ - bothering me very much, AT ALL. Thus, in sum . . . . I was utterly **-{ MESMERIZED }-** by \" Dune : Part 1 \" and hence ; I chose to give it a **\" Wholehearted, Adoring, MEGA-APPRECIATIVE 13 Marks Out Of 10❗\" .**", "created_at": "2021-10-10T03:50:09.811Z"}, {"movie_id": 438631, "review_id": "616d9b3abf31f20043e2cbb1", "author_rating": 1.0, "review_text": "The worst movie I've ever seen. Don't waste your time.", "created_at": "2021-10-18T16:05:14.243Z"}, {"movie_id": 438631, "review_id": "6170aecdabdec00043dc778e", "author_rating": 6.0, "review_text": "    As a child, I remember catching David Lynch’s “Dune” on TV. I was too young to really understand the plot at the time, but I didn’t care, all I knew was that the worms were awesome. When I got a little older, I read the book for my first time. It was the first “adult” book I read on my own, and I was in love with it ever since. I read it many more times growing up, and when the miniseries came out, I watched and recorded it every night, then re-watched it time and time again. When “Children of Dune” aired, I again devoured it happily. In the case of the Lynch film, as I grew, I of course began to see more and more of the flaws, though I personally hold the “Spicediver Edit” in quite high esteem. That particular cut of the film manages to make the Lynch version into what is a genuinely good film, but still imperfect. The miniseries has, up until now, remained my preferred adaptation. Now we have a new adaptation: Denis Villeneuve’s “Dune”, and it certainly is quite different from the previous two versions in many ways, but is it good? Well, at least from my perspective, that answer is complicated. The short version is yes, it is a good film, but it’s not a great one.\r\n\r\n    The gist of the story is straightforward. Many, many millennia in the future, Paul, the son of the Duke Leto Atreides, finds himself and his family caught in plots of intrigue, and betrayal, after taking custody of a new and valuable planet. In order to survive, he finds that he will have to depend on the training of his mother, the Lady Jessica, the help of the planets local population, the fremen, and his growing awareness of a great, yet possibly terrible destiny that waits for him. \r\n\r\n    In reality though, the story is anything but. The novel is infamous for being “unadaptable” with its complex “plots within plots” storyline, along with its sheer size. There is simply too much going on in the story to make it easy to turn into a film, or even a series. The previous efforts have all brought different aspects of the novel to the forefront, and this new version is no different. In broad strokes, it is perhaps the most faithful to the novel in terms of themes, and it certainly emphasizes some aspects of the political commentary behind the novel, such as the missionaria protectiva, which was nowhere to be found in the Lynch film, and only really hinted at in the miniseries. They also spend a little more time focusing on the fremen and their sentiments toward off-worlders after living under the Harkonnen regime, but unfortunately, while it is nice to see these themes in the film, they are undercut by little development. In fact, the entire film suffers on that front. So much of the political context and scheming has been left out that the film as presented feels somehow empty. \r\n\r\n    Early in the film, it is established that the emperor considers the Duke Leto a threat due to his popularity, but never really explores too much beyond it. Even more strangely, the film establishes this, but then later makes it seem like they were never really certain about the fact that the emperor was involved in a key scene, unlike the book, where the Duke was fully aware that they were heading into a trap, and was attempting to outmaneuver his political opponents. The Baron Harkonnen is limited to a few admittedly atmospheric scenes where he more or less confirms the emperor is aiding him in their goal to destroy the Atreides line, but it is reduced to a few scant lines, the bare minimum necessary to understand the plot. This, unfortunately results in very shallow characterization, and the same problem runs throughout the film. Gurney Halleck, Thufir Hawat, and Doctor Yueh are all present, but each of them is only given a small handful of scenes, in which they only speak a few lines each, before they are forgotten to focus on Paul, or beautiful scenic shots. They never feel like fully realized characters in the film, more as brief supporting roles, whom are only present in order to fulfill their roles in the larger storyline. Thufir Hawat receives perhaps the worst treatment in this regard. Even the primary cast are not given a lot of development. We are given enough to know who they are, and a little of their personality, but nothing more. It seems strange, that the longest adaptation of the first half of the novel ever made should have less detail and character than either previous version. It does however, and it certainly hurts the film as a result. Long, moody shots are great, but only when they exist in addition with actual depth. The plot of the film has been streamlined to the point that it feels watered-down, and genuinely wastes the talents of its cast all stuck in roles that have been similarly effected. \r\n\r\n    There are also a few key scenes that actively go against things covered in the book. One scene features the Lady Jessica speaking of secretive matters regarding the bene gesserit sisterhood while sitting in the cockpit of an ornithopter right behind Thufir Hawat, whom would be easily able to hear everything she had just said. Another moment, involves the Reverend Mother Mohiam referring to Jessica as Leto’s “wife”, even though she would know full well that they aren’t married. Yet another moment involves that Shadout Mapes pulling out a crysknife to offer it to Jessica while out in the open, and Jessica is in the presence of guards. The Shadout later sheathes the knife unblooded, and those who have read the book will know why that choice does not work for the film, especially in the context of fremen later being shown cutting themselves before sheathing their knives. Of course, in any adaptation there will be liberties taken, and there are indeed more, but these three moments in particular certainly seem to stand out the most in regards to actively going against aspects of the original novel, and in doing so, hurt this film as an adaptation.\r\n\r\n    With that said, there were things I liked as well. As I have stated a number of times, the film is gorgeous. There are a couple of scenes that certainly seemed to be more “style over substances”, such as a shot of ships rising from the ocean for… no apparent reason, but man do they look beautiful. There is also a very real sense of scale in the film that I can freely admit neither previous version ever accomplished. As a result, there are a few scenes that do far better match their description in the book, and are glorious to watch.\r\n\r\n    I do really appreciate the way they portray the emperor, discussed, but never seen. A powerful force that can be felt looming in the background, his hand guiding everything happening. He is built up excellently, and I will be curious to see how well he is portrayed if we get a sequel. In the previous adaptations, he was prominently displayed and used to provide greater context for the politics of the story, but in the book, he is only ever seen in the end, and keeping book accurate in this case certainly works very well.\r\n\r\n    The film also features the most book accurate version of Paul’s growing prescience, hinting at possible outcomes rather than complete premonitions. The way it is executed is not necessarily without its flaws, or heavy-handedness in a couple of moments, but it works well. Similarly, we also get the story of the bull and Leto’s father for the first time, though the film attempts to make the bull symbolic in a manner I am not sure really works, or is earned.　Also notable is the death of a significant character finally matching their death in the novel. \r\n\r\n    I have also stated that the cast does a great job, and I stand by that. In the entire film, there is not a bad performance in the film. My only complaint would be with the portrayal of the Lady Jessica, who comes across as too emotional, presumably in an attempt to show her ability to shift from being upset to being entirely refined and composed in moments, but that is a matter of writing rather than performance. When it comes to the casting, I personally felt that many of the actors matched their roles well, in particular enjoying the casting of Duke Leto and the Baron. I did not however care much for the gender-swapping of Liet, which served no real purpose, especially when one considers how small the characters role was in this version of the film, though Sharon Duncan-Brewster did a good job with what she had. I also did not care for the casting of Rebecca Ferguson as Jessica. While she is a very good actress, she seemed to me a bit too “girl next door”, rather than the character from the novel that the Duke Leto notes “reintroduced regality into the Atreides line”. \r\n\r\n    When it comes to the score, I will admit that I was not certain how I would feel in regards to Hans Zimmer’s work on the film. The samples I had heard up until this point had been interesting, but I was not sure how it would work in terms of the film itself. I can say that it works well, though there are moments when it feels almost as watered-down as the plot itself. It never really allowed me to feel excited at any point, but it did match the tone of the film very well, and I can easily see myself turning it on whenever I clean my house in order to set a “mood” (Ha! See what I did there?). \r\n\r\n    In conclusion, despite my criticisms, I did enjoy the film. I think it works well enough to be understood, though there may be some moments where the average viewer could find themselves feeling confused. It certainly is a visual spectacle, but one undercut by excessive trimming of detail and world-building. I hope it is successful enough to warrant a sequel in order to finish the story, but I also find that I will not be upset if it does not. As adaptations go, this is no “The Lord of the Rings”. In the end, I have to rate this version of “Dune” closer to the original Lynch film, and maintain the miniseries as my favorite adaptation of an amazing novel.", "created_at": "2021-10-21T00:05:33.631Z"}, {"movie_id": 438631, "review_id": "6171738babdec000622bd805", "author_rating": null, "review_text": "Great movie with excellent BG music and visual effects. Waiting for part two.", "created_at": "2021-10-21T14:04:59.187Z"}, {"movie_id": 438631, "review_id": "61732977a097dc002a9b722f", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dune-spoiler-free-review\r\n\r\n\"Dune sets the new standard for epic cinema with eyegamic visuals, powerful sound design and score, and a compelling story told surrounded by an absolutely massive scale.\r\n\r\nDenis Villeneuve adds yet another audiovisual masterpiece to his filmography, despite some narrative-pacing issues due to the heavy exposition and repetitive yet crucial dream sequences. Timothée Chalamet and Rebecca Ferguson stand out in a stellar cast, where everyone delivers performances no short of impressive.\r\n\r\nFrom the remarkable character work to the constantly captivating interactions, without forgetting the spectacle of the riveting action/war scenes, the extremely layered screenplay is beautifully translated to the big screen, where every viewer should definitely go to watch this movie.\r\n\r\nFinally, don't forget that epic sci-fi/fantasy films are quite rare, so enjoy them as much as you can when they come out, instead of worrying about the comparisons with other sagas.\r\n\r\nThere's enough space to love them all.\"\r\n\r\nRating: A-", "created_at": "2021-10-22T21:13:27.576Z"}, {"movie_id": 438631, "review_id": "6179c519bb070d0062fff6df", "author_rating": 4.0, "review_text": "I'll open by saying I am not a fan of Villeneuve. In fact, I think he's a hack whose only genuine talent is making stupid people falsely think they are actually quite smart. I am also a HUGE Dune fan. They have been my favourite series of books since I first discovered them as a teenager. So although I hoped for the best with this, I was expecting the worst. What I got was somewhere in the middle. It's an OK movie, not great, thankfully not terrible, but OK\r\n\r\nIt got some things right the 1984 Lynch version got wrong, but still somehow managed to get other stuff wrong (including stuff Lynch got right). It was also a surprise how much Villeneuve just lifted directly from the Lynch film, both visually and auditorily.\r\n\r\nThe wardrobe choices were a huge disappointment. If you didn't know the time setting, going just on the clothes in the new Dune you'd be forgiven for thinking it was set a mere forty or fifty years (if that) in the future rather than the twenty thousand years in the future when it's really set. The Lynch stillsuits look futuristic, unworldly, and something that really would keep you alive in the deep desert. The new desert wear looks like they are just going to go dirt biking for an hour or two in our present-day world.\r\n\r\nThe casting (completely ignoring the pointless gender swap) was good, However, with the exception of Paul, Chani, and Rabban the original casting was all better. But the original (apart from the odd decision to use the totally unsuited Kyle MacLachlan) was a masterclass in how to cast the perfect people for the role.\r\n\r\nAnyway, enough of the comparisons, This film is about the first two-thirds of the first novel. I always thought the story would be better told via a big-budget TV series (or even mini-series) rather than a standalone movie. I still think what they tried to cover here was too much for a single movie, but it was a step in the right direction.\r\n\r\nThe film mainly sticks to the book story but does make some needless changes, the most obvious of which being the changes made to both the gender and story of Liet Kynes, which in turn impacts the story of Chani. Most other changes are small and mainly insignificant though.\r\n\r\nThe film being filmed in Norway, Jordan, and Abu Dhabi looks fantastic and very well suited to the large screen. And it's clear a great deal of time, effort, and money was put into the sets that looked equally good as the places they were meant to be.\r\n\r\nThe acting was of a suitably high standard, but unfortunately, many of the Dune names and terms were horribly mispronounced. That and the Hans Zimmer fart that is played constantly throughout the soundtrack is likely to pull people out of their emersion in the movie.\r\n\r\nI was also somewhat surprised by what was left out, OK the source material is VERY dense and obviously some needed to be cut, but I don't really think it's made clear just how crucial melange is to the functioning of the empire and society as a whole. Also what (and why) mentats are is largely ignored, you may think that isn't overly important, but it is at the core of how many things are done in the Dune universe.\r\n\r\nOver all, it's not a bad movie. Despite its flaws, I still think the 1984 Lynch version is better though.", "created_at": "2021-10-27T21:31:05.180Z"}, {"movie_id": 438631, "review_id": "6187330570309f0043940e07", "author_rating": 6.0, "review_text": "I enjoyed parts of this movie. But I seem to recall that I enjoyed reading the book this is based on (it was decades ago after all). And since I don’t remember the details of the source novel, I don’t know if it is the screenplay that dragged down my overall opinion or the original book.\r\n\r\nI can sum up pretty quickly the pieces that disappointed me, and be advised they are probably spoilers.\r\n\r\nI didn’t like how long it took to get our first glimpse of the spice worms, and even then they were represented as holes in the sand. Not exactly awesome. I didn’t like how they quickly killed off all the good guys except for Paul and his mom (okay, yeah that is definitely a spoiler). Plus I thought it weird that during the big battle scene we have awesome bombs and complex tracer missiles flying about, but on the ground we have merely well-choreographed hand-to-hand fighting with knives and swords. Couldn’t the folks who invented the missile come up with a pistol? Or am I being picky?", "created_at": "2021-11-07T01:59:33.313Z"}, {"movie_id": 438631, "review_id": "6192edac1ad93b0043d2a0bc", "author_rating": 2.0, "review_text": "I read Frank Herbert's book, Dune, when I was in high school and really don't remember it much except that it was great and a little scary. At that age, I probably didn't get the subtext message.\r\n\r\nI never saw any movies of it so I decided to watch both the 1984 Dune by David Lynch and the 2021 Denis Villeneuve version sequentially. I'm going to talk about both of them here.\r\n\r\nThis may not be a popular opinion: Lynch's version is **brilliant** and the Villeneuve Dune is absolute **shit**. Here's why:\r\n\r\nFirst, is the Villeneuve Dune slick? Yes, absolutely. I should hope so considering it's nearly 40 years after Lynch did his, for crissake.\r\n\r\nAre the character's in David Lynch's version kitschy and over the top? Yes! That's one reason it's so much better! It's Sci Fi, duh! You watch Marvel movies and suspend disbelief for incredible, imaginary super powers? All of Lynch's characters are downright gritty and believable within this particular surreal fantasy.\r\n\r\nBy the end of the Lynch Dune, I had sympathy for nearly every character in the film. Even the villains caught my emotions. Paul Atreides character development was realistic and attractive.\r\n\r\nVilleneuve's characters? I felt like my neighbor came over and asked, \"Hey, can you come to watch my kid's junior high school play?\" \"Sure, Denis, just let me fill my 1-liter flask with tequila first.\"\r\n\r\nVilleneuve's characters were so damned flat and lifeless that they evoked NO emotional response whatsoever. Although I occasionally sit through a bad flick, I can't remember recently watching a movie as awful character-wise, as the 2021 Dune. If I were an actor on that set, I would be silently screaming. How does a director even do this?\r\n\r\nOh, and where's the creativity? It's 46 years since George Lucas founded Industrial Light & Magic, and Denis can't create one single, new, goddamn space machine 46 years later? (One could argue the hummingbird copter is new, but it's not so creative when you realize that we didn't even know how hummingbird wings actually worked until this millennia.)\r\n\r\nBut here's the real clincher: the screenplay. David Lynch gave us a complete story. Sadly, he didn't have the final cut and disowned his film when the critics panned it. Despite the fact that Lynch is a true artist and genius, the studio took 45 minutes out of the film. 45 minutes! Even ruined by the studio, even 40 years later, Lynch's film has a clear vision and carries the timeless message that Frank Herbert intended. I would LOVE to see the original cut!\r\n\r\nVilleneuve, on the other hand, stopped abruptly in the middle of the book. I now realize that Denis is not about the story. Denis is all about the franchise money, and that sucks. As a result of the bad screenplay, this 2021 version doesn't even carry the socio-political statement it was supposed to have. I want my 155 minutes back.\r\n\r\nI don't watch Part 2s, especially when it comes to void-of-creativity and void-of-character-development Hollywood movies. You can take your bad franchise and shove it up your sci fi black hole.\r\n\r\nAdmittedly, I loved Blade Runner 2049, but this is so disappointing, I may never watch another Villeneuve film again. Do yourself a favor and see David Lynch's version of Dune.", "created_at": "2021-11-15T23:30:52.817Z"}, {"movie_id": 438631, "review_id": "61d8c475383df20095589aa5", "author_rating": 8.0, "review_text": "This newest adaptation of the classic Frank Herbert novel (which I've never read) has the usual amazing visuals director Denis Villeneuve is known for alongside great cinematography from Greig Fraser (Rogue One, upcoming The Batman) plus the incredible and bombastic score by Hans Zimmer has the technical aspects but void of any real emotion behind the story and, especially, characters.\r\n\r\nI couldn't find much wrong with the performances but nobody really wowed me despite having talents like Oscar Isaac, Josh Brolin, Javier Bardem, Jason Momoa and Rebecca Ferguson, I didn't think anybody stood out, and that includes Timothée Chalamet in the lead role. I can't say this was at all bad and have some mild interest in part two, but, and this says a lot about Villeneuve's great career, this is one of his lesser films. I'll probably at some point give this another watch, especially when/if part two comes out (who knows when that will be). **3.75/5** (rounding it, I was debating 3.5 or 4, went with the latter)\r\n\r\nOn the plus side, it is much better than the 1984 adaptation.", "created_at": "2022-01-07T22:53:41.500Z"}, {"movie_id": 438631, "review_id": "61f65f4d59e8a900c3a4cb1b", "author_rating": 10.0, "review_text": "I was really eager to watch this movie and at the same time a wee bit concerned because I knew that I would be hugely disappointed if it turned out to be another movie massacring a classic source material.\r\n\r\nI have to admit that it was a very long time since I read the Dune books but I have to say that the movie was mostly true to the books, as I remember them, and also reasonably free of agenda driven rubbish apart from the odd replacement of some characters with “gender correct” ones for no real good reason.\r\n\r\nThere is really not much point in me saying much about the story. It should be well known for any science fiction fan and it is a great story and really good material for a big screen movie despite some “critics” at Rotten Tomatoes moaning about it and calling it unwieldly etc. Probably too big a book with too many words for the small, agenda driven, brains of Rotten Tomatoes “critics”. No surprise there.\r\n\r\nThe movie as a whole is wonderful to watch, the scenery is oftentimes very beautiful and the décor, the buildings, the machinery is very well done. I was surprised that the world of Caladan was portrayed as a rather austere Scottish looking landscape but after getting over the initial surprise it worked very well actually.\r\n\r\nI also like that the Harkonnen, especially the Baron, are not turned into some exaggerated comical figures but, although disgusting and despicable, they are actual humans.\r\n\r\nOverall the casting was quite good and everyone played their roles well. At the beginning I felt that Paul was a bit too wimpy, from what I remember of the book he was quite well trained and skilled already from the start, but he picked up as the movie went along.\r\n\r\nIt is a science fiction, borderline fantasy, movie so there should be some special effects, right? This is a difficult movie to make special effects for since this universe is a weird mix between futuristic science fiction, fantasy elements and old-fashioned traditions.\r\n\r\nI have to say that they succeeded quite well though. The atmosphere felt just right, ships, spice harvesters, buildings looked cool and fitting the story. The way they implemented the personal shields was very nice. They didn’t go overboard on special effects and weird designs. The ornithopter was of course totally ridiculous from a scientific point of view but at least it looked pretty cool.\r\n\r\nIf I should complain about something, although that is not the fault of the movie but of the source material, I have never understood how, in a universe which is obviously driven by hidden agendas, machinations and assassinations, the Atreides could just pick up everything, leave their home and put all their important eggs in one basket at Arrakis.\r\n\r\nOne more small thing that I could complain about would of course be that we now have to wait two years, from what I have read, until we get to watch the next movie to get to the part were the really cool stuff happens.\r\n\r\nBottom line, this was movie is definitely in there vying for the title “best movie that I have watched this year”.", "created_at": "2022-01-30T09:50:05.425Z"}, {"movie_id": 438631, "review_id": "621a8e11f1b5710042ccdd8b", "author_rating": 8.0, "review_text": "‘Dune’s massive scope tends to overshadow its storyline and characters, but in return we get a great cast and stunning visuals, leaving us hoping the second chapter will be able to live up to the expectations.\r\n\r\n8/10", "created_at": "2022-02-26T20:31:13.130Z"}, {"movie_id": 438631, "review_id": "62d1aa6d549dda02d5d345b6", "author_rating": 9.0, "review_text": "_Dune_ was a massive undertaking due to the sheer amount of lore and political backstory director Villeneuve had to fit in a two-and-a-half-hour run-time, but I am happy to say it was executed brilliantly.\r\n\r\nThe story of _Dune_ is incredibly deep, there are so many layers of political factions and relationships that it can get quite confusing at times. I had to constantly be looking up specific individuals and their ties to each other to understand the minor nuances of the story. Despite that fact, Villeneuve is still able to deliver a coherent narrative that will allow the majority of the audience to understand the overarching plot. After the buildup of the first act, the story gets cooking, and I was utterly invested.\r\n\r\nThere is an incredible atmosphere present in this film. It begins as a Sci-Fi epic, following a house starting anew on a fresh planet and a new industry to conquer. You can feel the optimism and the sense of discovery in the shots due to the interesting angles, lighting, and a brilliant soundtrack composed by Hans Zimmer. But as the narrative evolves so does the tone, as a thick fog of helplessness bleeds on to the screen and you can feel the dread form. This tone was quite refreshing in today’s blockbuster cinema, as each movie needs to incorporate a vast amount of unnecessary comedy to appeal to the broader audience. Dune is unapologetic about what the story is trying to deliver and gives you exactly what it wants without any concessions.\r\n\r\nThe visuals are stunning throughout the entire runtime. One of my favorite scenes was during the spice extraction visit. I loved the blend of realism that was used in this Science Fiction setting. The ships and equipment look like they could exist in our own world with a few technological advancements. The fight choreography is really well done, especially the hand-to-hand combat. The final scene was epic, each fist and punch were so sharp and calculated, it was really impressive to watch in the age of jump cut action.\r\n\r\nThe acting is perfect throughout the film, I really cannot point to any one character that felt off or out of place. Timothee Chalamet did an incredible job as the lead man. He delivered a heartfelt performance and evolved throughout the entire film into the confident leader the story crashendos on. Rebecca Ferguson, Oscar Isaac, and Josh Brolin all did great jobs as well. I really brought the somewhat complex nature of Lady Jessic and Duke Leto, they had really great chemistry with themselves and with their son. Stellan Skarsgard had my favorite performance of the entire film. I felt entirely disgusted everytime he was on the screen, and he made the hairs on the back of my neck stand tall. He is truly a man poisoned by greed and will not stop at anything on his path to fortune. Jason Momoa does a fantastic job here too. I felt he really fit his role and his lines were delivered effortlessly, much better than his performance in the DCEU.\r\n\r\n_Dune_ delivers a fantastic Sci-Fi epic that gave me everything I was looking for and I will be eagerly awaiting the sequel's release.\r\n\r\n**Score:** _88%_\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-07-15T17:57:01.104Z"}, {"movie_id": 438631, "review_id": "630019b51c6aa7007ffc1007", "author_rating": 8.0, "review_text": "**Overall : Dune creates a universe and characters at an epic scale similar to Star Wars. For sci-fi fans, cinema fans, and fans of incredible special effects, Dune is a must-see.**\r\n\r\nProbably the most visually stunning movie of the year. I watched it first at home on HBO Max but had to see and hear it again in theaters when I realized this movie required a complete theatrical experience! The cast was top-notch, and the scale that Denis Villeneuve evoked in every scene was breathtaking. From the moment, Dune starts, it demands a sequel through its world-building, acting, and storylines leaving the audience wanting answers (the fact that it literally begins with the words \"Part One\" helps too). I can't wait to see what comes next!", "created_at": "2022-08-19T23:16:05.343Z"}]