[{"movie_id": 455980, "review_id": "5c46dd33c3a368478c8579d8", "author_rating": 7.0, "review_text": "I had a pretty great time with _Tag_. Maybe that's because I went to a nice theatre (which I haven't done in a while) and saw it with a couple of close friends on a very nice day, but I rather think that it's primarily because of Jeremy Renner's character. The way he's written, acted, and shot, are all pretty much flawless. Off the strength of him alone, I could probably send you out to see _Tag_, but there is a Hell of a lot else to appreciate about it too.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-22T09:06:59.770Z"}, {"movie_id": 455980, "review_id": "63c1ed5017b5ef007d529dd9", "author_rating": 10.0, "review_text": "It really is just funny. If you're looking for more than a funny movie it's time to question why you're watching Tag.\r\n\r\nThe strength is the casting. Everyone did a great job, but there are three highlights I feel the need to specifically praise:\r\n\r\nJake Johnson plays the best perpetual stoner friend I've seen since Brad Pitt in True Romance. He's both relatable and completely exaggerated, and he pulls both off with ease.\r\n\r\nIsla Fisher was, well, the best way to describe her is: \"consistently hysterical.\" She was so aggressively over-the-top that her scenes were a delight to watch. She was able to capture a specific personality trait of a certain type of person everyone knows, and then believably exaggerate it to hysterical proportions. She delivered what was probably the best comedic performance in 2018.\r\n\r\nAnd Jeremy Renner was able to play the aloof living McGuffin perfectly straight and believable no matter how absurd his scenes were. They say comedy is best delivered straight and he proves the statement true and adds a graceful timing to his performance.\r\n\r\nUnfortunately it's not going to be remembered, but it might be a cult classic if for no other reason that the characters were perfectly cast for their individual roles.\r\n\r\nUltimately, when all is said and done, Tag will make you laugh, and that really was the point of both making the film and watching the film. In my book that's a success.", "created_at": "2023-01-13T23:46:24.166Z"}]