[{"movie_id": 400535, "review_id": "5baccafd925141510c038c28", "author_rating": 7.0, "review_text": "Of the two _Sicario_ films, the first is most certainly the better, though, in my opinion, not at all by the margin that I have seen many others imply. These are both great movies, not great in an identical way (even if their formula **is** identical) but both great. I don't know that _Sicario_ **had** to be a film series as opposed to just the one movie, but the best experience I've had at the cinema for the past couple of months was with _Day of the Soldado_, so I'm glad it became one.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-09-27T12:20:13.719Z"}, {"movie_id": 400535, "review_id": "5cc1774e0e0a265b0fef7efb", "author_rating": 7.0, "review_text": "**_Not as good as the original, but still pretty decent_**\r\n \r\n> **_Sarah Sanders_**: _We have a completely broken immigration system. We have a national crisis, not just of safety and security, but a humanitarian crisis. We have drugs, we have human traffickers, we have terrorists that come across our border and there has to be a stop to that and we want to do - not just the wall; certainly that's one of the most important factors. We know that it works; we know that in the places that it's been, it's 95 percent effective. We want to be effective across the board and that includes the wall an__d other technology._\r\n>\r\n[...]\r\n\r\n> **_Chris Wallace_**: \"_Special Interest Aliens\" are just people who come from countries that have ever produced a terrorist. They're not terrorists themselves. And the State Department says that there is, quote, their words: \"no credible evidence of any terrorist coming across the border from Mexico_.\"\r\n> \r\n**_Sanders_**: _We know that roughly, nearly 4,000 known or suspected terrorists come into our country illegally, and we know that our most vulnerable point of entry is at our southern border._\r\n\r\n> **_Wallace_**: _Wait, wait, wait - I know the statistic; I didn't know if you were going to use it. But I studied up on this. Do you know where those 4,000 people come - where they're captured? Airports._\r\n\r\n> _**Sanders**_: _Not always._\r\n\r\n> **_Wallace_**: _Airports._\r\n\r\n> **_Sanders_**: _Certainly a large number_ -\r\n\r\n> **_Wallace_**: _The State Department says there hasn't been any terrorists that they've found coming across the southern border with Mexico._\r\n\r\n> _**Sanders**_: _It's by air, it's by land, and it's by sea. It's all of the above. But one thing that you're forgetting is that the most vulnerable point of entry that we have into this country is our southern border, and we have to protect it. And the more individuals that_ -\r\n\r\n> **_Wallace_**: _But they're not coming across the southern border, Sarah. They're coming and they're being stopped at airports._\r\n\r\n- White House Press Secretary Sarah Sanders speaking with Chris Wallace; _Fox News Sunday_ (January 6, 2019)\r\n\r\n_Sicario 2: Soldado_ [released in North America as _Sicario: Day of the Soldado_] is a sequel to Denis Villeneuve's _Sicario_ (2015). And if ever a film didn't scream \"sequel\", it was that one. Apart from the fact that it was only a modest box-office hit (grossing $84.9 million against a $30 million budget, in an era when the only films that become franchises must gross $800 billion in the first five minutes of their release), the storyline was carried to a fairly natural conclusion – Alejandro Gillick (Benicio del Toro), protected by his CIA handler Matt Graver (Josh Brolin), successfully manipulated naïve and idealistic CIRG officer Kate Macer (Emily Blunt) into helping him exact revenge for the murder of his wife and daughter at the hands of drug baron Fausto Alarcón (Julio Cesar Cedillo). The film concluded with Graver getting what he wanted, Gillick getting revenge, and Macer in possession of a more realistic, if bitter, understanding of how the US conducts its affairs in Mexico.\r\n\r\nA sequel felt wholly unnecessary. But a sequel is what we have. When a suicide bombing in Kansas kills fifteen people, the US government authorise Graver to adopt \"_extreme measures_\" to combat Mexican drug cartels, who are suspected of smuggling the terrorists across the border. Deciding to instigate a war between the two major cartels, Graver recruits Gillick to assassinate a high-profile lawyer for the Matamoros cartel while Graver and his team kidnap Isabel Reyes (Isabela Moner), the daughter of the kingpin of Matamoros' rival. Taking her to Texas, Graver and Gillick then 'rescue' her in a false flag operation, making it appear she was kidnapped by her father's enemies. As they transport her back to Mexico, Gillick begins to bond with her. However, after they cross the border, the Mexican police escorts double-cross them, and Isabel flees into the desert, pursued by Gillick. Meanwhile, the US government determines that two of the suicide bombers from Kansas were domestic terrorists, and thus were not smuggled into the country. With this mind, to help quell tensions with Mexico, Secretary of Defense James Riley (Matthew Modine) orders the CIA to abandon the mission, much to Garver's disgust.\r\n\r\nWith the first film wrapping up so neatly, the announcement of a sequel seemed like a typical Hollywood cash grab, one which would most likely crap all over the legacy of the truly excellent original. However, as bits and pieces of info regarding the sequel began to filter through, it started to feel less and less like the usual Hollywood knock-off we're all used to seeing. For starters, Taylor Sheridan would return as sole-writer, in a script that would not go in what, for many, might seem the only real direction in which to take the story - Macer getting revenge for Graver and Gillick using her. Instead, Macer wouldn't even appear, as the script would instead focus on pseudo-antagonists Gillick and Graver. To this end, the only other actors who would also return would be Raoul Max Trujillo as Rafael, one of Gillick's contacts in Mexico, and Jeffrey Donovan as Steve Foraing, Graver's number two. The big concern for a lot of people, however, was who would replace the irritatingly talented Villeneuve in the director's chair. And so it was another welcome bit of news when the man chosen was Stefano Sollima, the Italian director of _A.C.A.B. – All Cops Are Bastards_ (2012) and _Suburra_ (2015), as well as most of the episodes in the first season of _Gomorra: La serie_ (2014).\r\n\r\nOkay, so first things first. _Soldado_ isn't a patch on _Sicario_. Not even close (and, needless to say, there's nothing here to come anywhere near _that_ dinner table scene). And there are some problems which were largely absent first time around. For example, the narrative suffers slightly from the absence of Macer, not insofar as she herself is irreplaceable, but more in the sense that the audience no longer has a surrogate. Because we know who Graver and Gillick really are this time around, there is obviously no point in the film playing its cards close to its chest, and so it adapts a more balls-to-the-wall, damn-the-torpedoes approach. This renders the narrative more morally simplistic than the first film. In tandem with this, perhaps wisely, Sheridan has written _Soldado_ as a more conventional action-thriller than _Sicario_, but this has the knock-on effect that when the bullets start flying, as they do on several occasions, all the political/moral back-and-forth is made to seem nothing more than the material that gets us from one shootout to the next. Additionally, there's an element of repetition, as Isabel is traded off from one group to the next, and one definitely gets a sense of _déjà vu_, as she becomes a metaphorical cog in the screenwriter's machinery. Also, although Solima's direction is good (with that resume, how could he not get the gritty tone right), it's not as sharp as Villeneuve's. Finally, and this is a small point, the title of the film translates as _Hitman 2: Soldier_ [or _Hitman: Day of the Soldier_ in North America]. This makes not a lick of sense, and instead sounds like a 90s action movie starring Michael Dudikoff.\r\n\r\nHowever, for all that, I thoroughly enjoyed it. The script is sharp, relevant (references to a spineless POTUS undermining intelligence operations will be sure to please at least half the audience), gruff, and cool. With the two _Sicario_ films, _Hell or High Water_ (2016), _Wind River_ (2017), and _Yellowstone_ (2018-), Sheridan is fast becoming one of Hollywood's most accomplished writers. The film also stars two of the coolest men on the planet being masculine and suppressing their emotions. Del Toro never so much as even hints at cracking a smile, whilst Brolin has lost some of the sardonic dismissiveness he possessed in the first film, but none of the bluster or self-confidence. All things considered, for a film that never seemed to have any real reason to exist, this is a cracking piece of storytelling, and has me already looking forward to the next instalment.", "created_at": "2019-04-25T09:01:02.091Z"}]