[{"movie_id": 501170, "review_id": "5dbb01b612970c001838bead", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThere's this misconceived idea that \"scary movies\" are the ones with demons, monsters, or ghosts literally showing up in jump scare sequences, one after another, accompanied by an extremely loud sound. Granted, we're scared of what we're scared of. No debate here. However, one common complaint about this type of horror films is that they aren't \"scary enough\". I couldn't disagree more. These movies are the ones that truly get to us and stay with us for a while. If we watch a film with cyclical jump scares, we're going to forget about it as soon as we leave the theater. Movies with a horrific story, based on relatable themes, those are the ones that leave us uncomfortable and disturbed. I'm just writing this \"prologue\" to say that you shouldn't go in expecting a \"scary\" film. At least, not in a mainstream way. Moving on...\r\n\r\nAs you probably know by now (if you don't, check out my The Shining's review), I'm a huge fan of Stanley Kubrick's adaptation of Stephen King's novel of the same name. It's a cult classic horror movie, one that influenced generations to come, especially regarding filmmaking techniques and equipment. With that said, Mike Flanagan had one of the toughest jobs of 2019. Not only did he need to deliver a sequel worthy of being associated with a beloved classic, but he had to deal with all the differences between the source material and Kubrick's changes. I'm going to leave a SPOILER WARNING for The Shining since the film came out 40 years ago, and I already wrote a review about it. Still, SPOILER-FREE for Doctor Sleep, don't worry.\r\n\r\nIn case you don't know, the major difference between King's book and Kubrick's cinematic adaptation is the ending. In the book, Jack Torrance forgets to relieve the hotel boiler's pressure, and it explodes, destroying the hotel and killing Jack in the process. In Kubrick's movie, Jack freezes to death in the maze outside the hotel while chasing his son, while the hotel stands tall. Flanagan is able to do the impossible: he perfectly continues the story left by Kubrick while respecting King's \"demands\". Just don't go with a \"purist\" mentality, thinking that Flanagan doesn't have the right to explore and expand \"the shining\". It's a sequel, so expect things to be added to the story (nothing is removed or retconned, so relax). As long as it makes sense, be always open to new ideas.\r\n\r\nAs the director, Flanagan proves once again he's a pretty talented guy by seamlessly recreating some of The Shining's most iconic scenes, but also by delivering some tricks of his own. With the help of his amazing cinematographer, Michael Fimognari, they are able to generate incredible levels of tension, characteristic of the original film. As the editor, he puts together everything remarkably well. The sequences inside someone's mind are wonderfully handled and provide some of the best moments of the entire movie. However, there's a massive difference when it comes to how the runtime flows in each film.\r\n\r\nBoth cross the 140-minute mark, and both purposefully employ slow pacing. Nevertheless, The Shining feels like it goes by way faster than Doctor Sleep (and mathematically it does have less 5-10 minutes, but that's not the point). Why? Due to Kubrick's movie constantly having long takes and extense dialogues, while Flanagan's installment has a modern approach with regular cuts plus much more action. Audiences presumably won't think of this (it's not like the \"average Joe\" notices or even cares if a scene has been going for 5 minutes straight or pieced together with 50 cuts), and just assume that the latter is more boring than the first without really understanding why.\r\n\r\nPeople will probably blindly blame the story, but Doctor Sleep has a lot more \"blockbuster entertainment\" than The Shining. The latter is pretty much two hours spent inside a hotel where dialogue is the primary source of entertainment (things only go crazy in the last 15-20 minutes), and we all know that the general public usually doesn't fall for that. The sequel has a lot more action, subplots, and characters, so the runtime should go by faster than the original, right? No. This film is the number one proof that I'm going to use from now on to defend that uncut dialogue sequences and overall long takes are the best way of managing an extended runtime without it feeling too \"heavy\", especially in a psychological horror flick.\r\n\r\nI wrote all these last paragraphs not to complain about the movie's being too slow, too long, or too dull. I'm just trying to help everyone understand why the film might feel slower and (much) longer, while protecting its story because the screenplay is indeed extremely well-written. Like in the original, exposition is handled beautifully with scarce lazy displays, but it's the characters of Ewan McGregor and the debutant Kyliegh Curran that carry the narrative effortlessly. McGregor is the perfect casting as Danny Torrance, and he does a great job of embodying Dan's personality. However, it's Danny's journey through his young and adult years that impresses me.\r\n\r\nExceptional character development! Danny's life after the events at the Overlook Hotel is as realistic and logical as it could be. Flanagan does a phenomenal job in handling this character and throwing just the right obstacles in his path. The way he deals with the aftermath of The Shining, how he grows up as a man, and even what he ends up doing for a living, everything is absolutely perfect. Furthermore, he's not alone. Abra is a badass young girl who wants to use her \"shine\" to protect others, but this time it's the actress that steals the spotlight from the character. Kyliegh Curran delivers one of the best young acting debuts I've ever witnessed. She's wonderful as Abra, and her range of emotions is already surprisingly vast.\r\n\r\nShe has some of the best scenes of the movie, especially when she's \"fighting\" Rose the Hat, but here is where we get to my major issue with the film. Rebecca Ferguson gives an outstanding performance, no doubt about it. She elevates infinite sequences, giving 200% to her role. However, her character and The True Knot group are the only significant flaw of this sequel. When writing a villain, there are basically two paths for success: either make the \"bad guy\" a compelling character with whom the audience can create some sort of empathy with and understand where he/she comes from, or turn him/her into a menacing, powerful, scary force that makes us fear for our heroes.\r\n\r\nFlanagan apparently chooses the latter route, and unfortunately, it's his only misstep. I don't know if King didn't allow for changes to Rose or The True Knot cult, but they don't quite work when adapting to the big screen. Not only their history is never truly explored, but their motivations are too shallow, so I didn't care for a single character from the group, not even Rose. If she was the \"menacing, powerful, scary force\" that I wrote above, this wouldn't be so important, but the truth is she isn't. As the narrative progresses, there's a constant reminder that our heroes are in danger and that Rose is astonishingly strong, but the interactions between her and Abra prove the contrary. So, I never really felt frightened or overwhelmed by her.\r\n\r\nA decent portion of runtime is handed to Rose's group, but its development didn't work for me at all. They're not bad villains, and they're still more fleshed out that a lot of characters in horror movies. I just think something's missing. Nevertheless, that's the only major problem I have with the movie. For true fans of The Shining, the countless references and Easter Eggs are such a delight (there's good and bad fan-service, the one present in this sequel only appears after we are already invested in the story and its characters, demonstrating once more Flanagan's talent). From the haunting and addictive score that The Newton Brothers are able to seamlessly adapt to the sequel to the influential Kubrick's framing, Flanagan and his team produce something pretty extraordinary having in mind this is a sequel to one of the most beloved horror films of all-time.\r\n\r\nIn the end, Doctor Sleep might be the first sequel/remake/reboot/whatever to a cult classic movie that doesn't diminish the original, disgracefully copies it or takes something away from it, while actually being an individually great film with a captivating narrative and compelling leads, plus the right amount of homages to the classic. Mike Flanagan took the impossible task of balancing both Stephen King's The Shining and Stanley Kubrick's cinematic adaptation, and successfully nailed pretty much everything regarding the connection between the main stories. In addition to the slow pacing not working as well as in the original, The True Knot group is the big stumble in an otherwise pretty consistent screenplay. However, the phenomenal cast (with a terrific debut performance from Kyliegh Curran) elevate every scene, ultimately driving the sequel to a nostalgia-full ending that will turn out to be divisive among fans. I stand on the good side. Therefore, I genuinely appreciate this movie. If you're a fan of the original, you can't miss this one!\r\n\r\nRating: A-", "created_at": "2019-10-31T15:45:58.999Z"}, {"movie_id": 501170, "review_id": "5dbf9ca47d2bc10011377425", "author_rating": 7.0, "review_text": "‘Doctor Sleep’ could go either way with ‘The Shining’ fans - some will see it as a perfect follow-up, others will deem it too different (which I think is a good thing). ‘Doctor Sleep’ works as both and also stands on its own; you could fill in the blanks pretty easily if you had never read or seen the original film. It’s a fun supernatural horror film aided by fantastic performances by Ferguson and Curran.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-doctor-sleep-heres-the-shining-stephen-king-has-been-waiting-for", "created_at": "2019-11-04T03:36:04.170Z"}, {"movie_id": 501170, "review_id": "5e20721ab3316b00130356b2", "author_rating": 6.0, "review_text": "Doctor Sleep may not diagnose you to the land of nod, but tediously drains your shining spirit. Director Mike Flanagan had an unfathomable task. To both adapt a Stephen King novel, which is no easy achievement considering his uniquely descriptive writing style, and provide a sequel to what many describe as “the greatest horror film of all-time”. Quenching the thirst of King’s avid readers and cinephiles alike. So even without divulging my own opinion on Doctor Sleep, applause must be given for just producing this feature. That, unfortunately for Flanagan, doesn’t result in myself excusing specific inexcusable filmmaking tendencies that taint, not just Doctor Sleep, but various decaying intellectual properties that have been unnecessarily drudged up again.\r\n\r\nAn alcoholic scarred Dan Torrance, having endured the irrevocable dangers of the Overlook Hotel (‘The Shining’), has his peace shattered when he encounters a young extrasensory girl whom is being hunted down by shine-draining monsters.\r\n\r\nFirst and foremost, I have not read the novel, although this should not come as a surprise. I have however, watched ‘The Shining’ multiple times. Now, what promotes the aforementioned horror as the best of its kind, is legendary Stanley Kubrick using the essence of King’s novel and essentially making his own iteration of it. One that the renowned supernatural writer still, to this day, has mixed emotions for. So for Flanagan to introduce some faithful interpretations of Doctor Sleep, whilst maintaining the cinematic endeavour that Kubrick meticulously crafted, is as I said, unfathomable. And there’s a perfectly valid reason for that. The overtly supernatural strands of the novels do not complement the genesis of terror from Kubrick’s film. Which is why, with great regret, I have to report that Doctor Sleep does not work. It doesn’t.\r\n\r\nA beastly behemoth that, whilst does stand on its own two legs, relies on heavy-handed storytelling techniques and nostalgia to tackle both mediums that inspired it. In tonality, they are irrefutably different from each other. But before the disappointing third act is tackled, let’s address some positives first.\r\n\r\nDoctor Sleep is a shining example of depicting childhood trauma and how fragmented coping mechanisms are embedded throughout adulthood. Young Danny imaginatively designs mental traps so that he can hold the starving ghosts from the Overlook in captivity. Yet that wilful mentality does not prevent him from suffering with alcoholism, substance abuse and an insalubrious lifestyle that masquerades the trauma instead of curing it. Thematically, this is powerful, and grants the narrative a solid cohesion throughout. For the first two hours, you subconsciously warm to Danny due to the tormenting fears he has established throughout the two films. He’s a pillar of “the shining”. McGregor consistently captivated by depicting a fragile mentality through a physically demanding performance, maintaining the entranced demeanour of his younger character.\r\n\r\nThe first hour, that heavily explained “the shining” and the intentions of the merciless antagonists The True Knot, experienced inconsistent tones due to the mass sprawl of locational change. One minute we’re in a sleepy town, the next a woodland area, and then all of a sudden eight years have been and gone. The zippy nature of the editing and bloated exposition resulted in atmospheric terror being abolished. The tension was non-existent, and the imitation of Kubrick’s directing style paled in comparison.\r\n\r\nThen, the second hour commenced, which is by far one of the strongest acts the year has yet to offer. Flanagan retained a surprisingly dark tone that, was so shocking, forced audience members to leave the auditorium. The mind-space of Abra, a precocious teenager who has “shine”, produced a transcendental imaginative battle against Rose the Hat, leader of The True Knot. Ferguson, who portrayed the primary antagonist, was sensational. Equalling the likes of Pennywise as one of the most enthralling King villains ever depicted. Sinister, unrelenting and bordering on near-lunacy. Controlling every scene from just her eyes alone, she enhanced the palpable tension. She made the second act. In fact, she made the film. The interjecting gore and darkness throughout the middling act abruptly astonished me, and settled for a direction that I thought would control the underwhelming first act.\r\n\r\nThe third act then arrives, and the entire story crumbles much like the Overlook itself. Plagued by an overshadowing sickness that ‘The Shining’ had produced. Nostalgia. Remember that time where Jack viciously chopped the bedroom door down with an axe? Or that moment where blood came hurtling through the hallways in slow motion? What about Room 237? The introductory swooping camera movement that Kubrick embraced whilst the Torrance’s drove to the hotel? The typewriter? Slowly walking up the stairs in a confrontational manner? The snow-covered hedge maze? The twins? No? You don’t remember? Flanagan has got you covered. Nostalgia is a powerful tool, yet it must be handled with delicacy. The difference between imitating and homaging is very fine, and unfortunately Flanagan settled for the former.\r\n\r\nSo much of ‘The Shining’ is replicated in the third act, scene for scene, that it was a near-identical copy without the textual substance that accompanied them originally. The re-casting of the original actors, despite Essoe bettering Duvall’s performance (although not difficult), felt unnecessary. Almost tarnishing ‘The Shining’ in itself. Danny walking through the dilapidated hallways for ten minutes whilst Flanagan incorporates identical sequences, had no purpose other than to forcefully remind you that this is the sequel. Literarily, it never progresses Danny’s character or the plot. Rose the Hat staring at the blood-spewing elevators? Pointless. Danny staring at an axe encased in glass? A suitable nod to its predecessor. Do you see the difference? Between imitation and homage? The third act was littered with falsified copies, preying on the nostalgia of fans. It’s uninspired. It’s mundane. And it made me a dull boy.\r\n\r\nCreatively, Doctor Sleep managed to infuse the very best of its adapted novel and preceding feature, but embellished the very worst techniques when conveying the plot. Psychologically stimulating without installing dread. Extrasensory without testing the senses. Dimly shining amongst King’s supernatural adaptations.", "created_at": "2020-01-16T14:24:26.760Z"}, {"movie_id": 501170, "review_id": "5e2f2797c56d2d001a4e48b6", "author_rating": 7.0, "review_text": "“Hi there”\r\n\r\nHello there...\r\n\r\nMike Flanagan has some of the biggest balls in the horror industry. I mean just look at his filmography so far.\r\n\r\nHe took one of the worst horror movies in recent memory ‘Ouija’ and said: “yeah, I wanna make a sequel to that”, with ‘Ouija: Origin of Evil’ and somehow made it less terrible. How about ‘Haunting of Hill House’ where he’s going to direct every episode of a television series that has to weave two narratives together at once over ten episodes...and again he somehow made it work. And now this guy is gonna make a sequel to one of the most revered horror movies of all time with ‘Doctor Sleep’...the son of b**ch did it again!\r\n\r\nI think Flanagan deserves more credit as a director rather than people bitching that his movies “ain't scary enough an-” blah blah blah shut the hell up.\r\n\r\n‘Doctor Sleep’ was a complete surprise for all the right reasons. At first I wasn’t sure if the movie would hook me, because it takes awhile for it to get going, but slowly I got invested in the story and the characters. There have been four Stephen King movie adaptions this year: ‘Pet Sematary’, ‘IT Chapter Two’, ‘In The Tall Grass’, and now this movie. This is by far the best out of them all.\r\n\r\nThe runtime is 152 minutes long and I can safely say that the movie is 85% it’s own thing, because it doesn't just rely on nostalgia to tell their story and it’s only the last act where things start to play on nostalgia when the characters return to the Overlook Hotel. The nostalgia being the 80’s horror classic of course. It’s either that or 97 TV mini-series. Who’s got fond memories for that piece of sh*t? So with this being both a sequel to Kubrick's movie and King’s original novel; a clash of visions coming together with Flanagan trying to put this together, while also applying his own vision into the mix.\r\n\r\nNow that’s hard.\r\n\r\nThe part that got me invested in the story was the scene between Danny and a elderly patient who’s on their death bed. Danny comforts them as their peacefully past away, without dying alone. It’s a beautiful and heartfelt scene that you would never expect to see in a supernatural horror movie.\r\n\r\nEwan Mcgregor was fantastic as an alcoholic grown-up Danny Torrance. Nicholson's presence was felt through out the movie as adult Danny fears he might follow in his fathers footsteps. There’s a scene where Danny gives a talk at a rehab group and as doing so he reflects deeply on everything that happened to him in the past, while the camera is locked on Ewan’s face. Not only from his childhood, but everything afterwards and drowning out the trauma through drinking - something that us as the audience don’t see. I thought he was excellent. He absolutely “shines” as the character...and am not sorry for that pun.\r\n\r\nI loved how fleshed out the villains were, which surprised me the most about the movie. They are like vampires, but instead of feasting on blood, it’s “the shining” they crave for a expanded life. Casual and charming, and yet wickedly evil. There’s a particularly scene that was so difficult to watch and really got under my skin. However you do get to see them interreacting with each other in normal conversations as they casually go on with the day and work as a group. Rose the Hat sticks out from the rest as a sinister and endearing villian played marvelously by Rebecca Ferguson.\r\n\r\nMike Flanagan dose a great job on balancing both Kubrick’s and King’s version respectfully, but also manages to put his visual spin in. The one thing that hasn’t been mention yet is how great he is with child actors as he always gets the best performance out of them, especially Jacob Tremblay and Kyliegh Curran who was so convincing in the roles it was scary.\r\n\r\nThe movie looks stunning with the use of colors adding to the overall tone and helps creates the horror atmosphere. Same thing with the score that while it takes samples from Kubrick’s movie, but not to say it doesn’t have it’s own.\r\n\r\nFor issues:\r\n\r\nThere was a couple of callbacks that was a little on the noise, usually through references. As I said early the movie takes a while to find it’s footing and you couldn’t help but draw comparisons. There were a few questionable and almost silly lines that King himself would inject into his work for humor, but here, with tone in mind, just took the fear out of it.\r\n\r\nOverall rating: “Eat well and live long.”", "created_at": "2020-01-27T18:10:31.627Z"}, {"movie_id": 501170, "review_id": "5e4c6b142866fa00169d01b7", "author_rating": 6.0, "review_text": "Partially satisfying \"sequel\" (of sorts) to the Shining with good performances from Ewan McGregor and Kyliegh Curran (while Rebecca Ferguson kind of hams it up, but still was fun as a villainous). However, the movie is far too long with probably 15-20 minutes that could've gotten the axe (so to speak), and the plot was The Shining meets X-Men with some Monsters Inc thrown in for good measure.\r\n\r\nDidn't hate it at all, but not sure I have much desire to revisit, though I have to wonder what else they threw in there with the 3-hour long Director's Cut. **3.0/5**", "created_at": "2020-02-18T22:54:12.821Z"}, {"movie_id": 501170, "review_id": "5f2d7703596a910033fc9817", "author_rating": 9.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nI honestly wasn't excited about this one, so my expectations were low.  I didn't realize it was Stephen King, let alone a sequel to \"The Shining\" until I watched it.  I'm also not a big fan of \"The Shining\", but I haven't watched it since I learned to watch a movie critically.\r\n\r\nAfter hearing about \"shining\" from everyone, I immediately got excited when I realize that was what this movie was all about.  I've been waiting for this movie since \"Push\".  This movie is honestly what \"Star Wars: Episode I\" should have been.  This is how you give an explanation of how super powers work on a large scale: you tell a story that examples it, \"do not say\", it is how movies are supposed to work.\r\n\r\nThis was wonderfully casted: Ewan McGregor, Kyliegh Curran, and Rebecca Ferguson are amazing.  There deliveries have weight to them, and it really makes the movie.\r\n\r\nThe production value is fantastic, they definitely didn't spare a cent to make this look as good or nostalgic as it needed to be.\r\n\r\nThere are aspects of the story I think we could have done without, mostly just for time purposes, and there are portions of the story that are just gratuitously graphic, and some of those two things overlap, but I'm not going to say that any of the movie would actually be better for it.  The story, whether it be the movie or from the book, is exceedingly well paced, and powerful, every step of the way.\r\n\r\nIt has this wonderful theme of predators and prey, basically \"There's always a bigger fish\", but in a twisted, looping way.\r\n\r\nIf you can stand horror at all and like psychic powers, then definitely give this a watch.", "created_at": "2020-08-07T15:45:07.457Z"}, {"movie_id": 501170, "review_id": "63be0a1bf85958007d373ebc", "author_rating": 1.0, "review_text": "The problem here is that they made a sequel to the 1980 movie... and not a sequel to King's book.\r\n\r\nAnd, let's be honest, as good as Stanley's film was, it really had little to do with Kings novel. Almost The Shining in name only. So many changes were made, right down to the theme, that it barely resembled the book.\r\n\r\nSo, when they made the sequel to the movie, and not the novel, a lot of the elements that made the Doctor Sleep compelling, a lot of the plot points, and a lot of the twists and turns that made the novel worth reading had to be changed in order to keep continuity with Kubrick's changes.\r\n\r\nThe result is really kind of a mess. So much of what Doctor Sleep was referenced back to The Shining, the novel, that trying to adapt the script to the Kubrick film was, honestly, a mistake.\r\n\r\nIn the end, it grasps at straws and never finds a footing, making Doctor Sleep even further removed from the story it was based on than Kubrick's film was... with far less talent directing it.", "created_at": "2023-01-11T01:00:11.882Z"}, {"movie_id": 501170, "review_id": "5dbb01b612970c001838bead", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThere's this misconceived idea that \"scary movies\" are the ones with demons, monsters, or ghosts literally showing up in jump scare sequences, one after another, accompanied by an extremely loud sound. Granted, we're scared of what we're scared of. No debate here. However, one common complaint about this type of horror films is that they aren't \"scary enough\". I couldn't disagree more. These movies are the ones that truly get to us and stay with us for a while. If we watch a film with cyclical jump scares, we're going to forget about it as soon as we leave the theater. Movies with a horrific story, based on relatable themes, those are the ones that leave us uncomfortable and disturbed. I'm just writing this \"prologue\" to say that you shouldn't go in expecting a \"scary\" film. At least, not in a mainstream way. Moving on...\r\n\r\nAs you probably know by now (if you don't, check out my The Shining's review), I'm a huge fan of Stanley Kubrick's adaptation of Stephen King's novel of the same name. It's a cult classic horror movie, one that influenced generations to come, especially regarding filmmaking techniques and equipment. With that said, Mike Flanagan had one of the toughest jobs of 2019. Not only did he need to deliver a sequel worthy of being associated with a beloved classic, but he had to deal with all the differences between the source material and Kubrick's changes. I'm going to leave a SPOILER WARNING for The Shining since the film came out 40 years ago, and I already wrote a review about it. Still, SPOILER-FREE for Doctor Sleep, don't worry.\r\n\r\nIn case you don't know, the major difference between King's book and Kubrick's cinematic adaptation is the ending. In the book, Jack Torrance forgets to relieve the hotel boiler's pressure, and it explodes, destroying the hotel and killing Jack in the process. In Kubrick's movie, Jack freezes to death in the maze outside the hotel while chasing his son, while the hotel stands tall. Flanagan is able to do the impossible: he perfectly continues the story left by Kubrick while respecting King's \"demands\". Just don't go with a \"purist\" mentality, thinking that Flanagan doesn't have the right to explore and expand \"the shining\". It's a sequel, so expect things to be added to the story (nothing is removed or retconned, so relax). As long as it makes sense, be always open to new ideas.\r\n\r\nAs the director, Flanagan proves once again he's a pretty talented guy by seamlessly recreating some of The Shining's most iconic scenes, but also by delivering some tricks of his own. With the help of his amazing cinematographer, Michael Fimognari, they are able to generate incredible levels of tension, characteristic of the original film. As the editor, he puts together everything remarkably well. The sequences inside someone's mind are wonderfully handled and provide some of the best moments of the entire movie. However, there's a massive difference when it comes to how the runtime flows in each film.\r\n\r\nBoth cross the 140-minute mark, and both purposefully employ slow pacing. Nevertheless, The Shining feels like it goes by way faster than Doctor Sleep (and mathematically it does have less 5-10 minutes, but that's not the point). Why? Due to Kubrick's movie constantly having long takes and extense dialogues, while Flanagan's installment has a modern approach with regular cuts plus much more action. Audiences presumably won't think of this (it's not like the \"average Joe\" notices or even cares if a scene has been going for 5 minutes straight or pieced together with 50 cuts), and just assume that the latter is more boring than the first without really understanding why.\r\n\r\nPeople will probably blindly blame the story, but Doctor Sleep has a lot more \"blockbuster entertainment\" than The Shining. The latter is pretty much two hours spent inside a hotel where dialogue is the primary source of entertainment (things only go crazy in the last 15-20 minutes), and we all know that the general public usually doesn't fall for that. The sequel has a lot more action, subplots, and characters, so the runtime should go by faster than the original, right? No. This film is the number one proof that I'm going to use from now on to defend that uncut dialogue sequences and overall long takes are the best way of managing an extended runtime without it feeling too \"heavy\", especially in a psychological horror flick.\r\n\r\nI wrote all these last paragraphs not to complain about the movie's being too slow, too long, or too dull. I'm just trying to help everyone understand why the film might feel slower and (much) longer, while protecting its story because the screenplay is indeed extremely well-written. Like in the original, exposition is handled beautifully with scarce lazy displays, but it's the characters of Ewan McGregor and the debutant Kyliegh Curran that carry the narrative effortlessly. McGregor is the perfect casting as Danny Torrance, and he does a great job of embodying Dan's personality. However, it's Danny's journey through his young and adult years that impresses me.\r\n\r\nExceptional character development! Danny's life after the events at the Overlook Hotel is as realistic and logical as it could be. Flanagan does a phenomenal job in handling this character and throwing just the right obstacles in his path. The way he deals with the aftermath of The Shining, how he grows up as a man, and even what he ends up doing for a living, everything is absolutely perfect. Furthermore, he's not alone. Abra is a badass young girl who wants to use her \"shine\" to protect others, but this time it's the actress that steals the spotlight from the character. Kyliegh Curran delivers one of the best young acting debuts I've ever witnessed. She's wonderful as Abra, and her range of emotions is already surprisingly vast.\r\n\r\nShe has some of the best scenes of the movie, especially when she's \"fighting\" Rose the Hat, but here is where we get to my major issue with the film. Rebecca Ferguson gives an outstanding performance, no doubt about it. She elevates infinite sequences, giving 200% to her role. However, her character and The True Knot group are the only significant flaw of this sequel. When writing a villain, there are basically two paths for success: either make the \"bad guy\" a compelling character with whom the audience can create some sort of empathy with and understand where he/she comes from, or turn him/her into a menacing, powerful, scary force that makes us fear for our heroes.\r\n\r\nFlanagan apparently chooses the latter route, and unfortunately, it's his only misstep. I don't know if King didn't allow for changes to Rose or The True Knot cult, but they don't quite work when adapting to the big screen. Not only their history is never truly explored, but their motivations are too shallow, so I didn't care for a single character from the group, not even Rose. If she was the \"menacing, powerful, scary force\" that I wrote above, this wouldn't be so important, but the truth is she isn't. As the narrative progresses, there's a constant reminder that our heroes are in danger and that Rose is astonishingly strong, but the interactions between her and Abra prove the contrary. So, I never really felt frightened or overwhelmed by her.\r\n\r\nA decent portion of runtime is handed to Rose's group, but its development didn't work for me at all. They're not bad villains, and they're still more fleshed out that a lot of characters in horror movies. I just think something's missing. Nevertheless, that's the only major problem I have with the movie. For true fans of The Shining, the countless references and Easter Eggs are such a delight (there's good and bad fan-service, the one present in this sequel only appears after we are already invested in the story and its characters, demonstrating once more Flanagan's talent). From the haunting and addictive score that The Newton Brothers are able to seamlessly adapt to the sequel to the influential Kubrick's framing, Flanagan and his team produce something pretty extraordinary having in mind this is a sequel to one of the most beloved horror films of all-time.\r\n\r\nIn the end, Doctor Sleep might be the first sequel/remake/reboot/whatever to a cult classic movie that doesn't diminish the original, disgracefully copies it or takes something away from it, while actually being an individually great film with a captivating narrative and compelling leads, plus the right amount of homages to the classic. Mike Flanagan took the impossible task of balancing both Stephen King's The Shining and Stanley Kubrick's cinematic adaptation, and successfully nailed pretty much everything regarding the connection between the main stories. In addition to the slow pacing not working as well as in the original, The True Knot group is the big stumble in an otherwise pretty consistent screenplay. However, the phenomenal cast (with a terrific debut performance from Kyliegh Curran) elevate every scene, ultimately driving the sequel to a nostalgia-full ending that will turn out to be divisive among fans. I stand on the good side. Therefore, I genuinely appreciate this movie. If you're a fan of the original, you can't miss this one!\r\n\r\nRating: A-", "created_at": "2019-10-31T15:45:58.999Z"}, {"movie_id": 501170, "review_id": "5dbf9ca47d2bc10011377425", "author_rating": 7.0, "review_text": "‘Doctor Sleep’ could go either way with ‘The Shining’ fans - some will see it as a perfect follow-up, others will deem it too different (which I think is a good thing). ‘Doctor Sleep’ works as both and also stands on its own; you could fill in the blanks pretty easily if you had never read or seen the original film. It’s a fun supernatural horror film aided by fantastic performances by Ferguson and Curran.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-doctor-sleep-heres-the-shining-stephen-king-has-been-waiting-for", "created_at": "2019-11-04T03:36:04.170Z"}, {"movie_id": 501170, "review_id": "5e20721ab3316b00130356b2", "author_rating": 6.0, "review_text": "Doctor Sleep may not diagnose you to the land of nod, but tediously drains your shining spirit. Director Mike Flanagan had an unfathomable task. To both adapt a Stephen King novel, which is no easy achievement considering his uniquely descriptive writing style, and provide a sequel to what many describe as “the greatest horror film of all-time”. Quenching the thirst of King’s avid readers and cinephiles alike. So even without divulging my own opinion on Doctor Sleep, applause must be given for just producing this feature. That, unfortunately for Flanagan, doesn’t result in myself excusing specific inexcusable filmmaking tendencies that taint, not just Doctor Sleep, but various decaying intellectual properties that have been unnecessarily drudged up again.\r\n\r\nAn alcoholic scarred Dan Torrance, having endured the irrevocable dangers of the Overlook Hotel (‘The Shining’), has his peace shattered when he encounters a young extrasensory girl whom is being hunted down by shine-draining monsters.\r\n\r\nFirst and foremost, I have not read the novel, although this should not come as a surprise. I have however, watched ‘The Shining’ multiple times. Now, what promotes the aforementioned horror as the best of its kind, is legendary Stanley Kubrick using the essence of King’s novel and essentially making his own iteration of it. One that the renowned supernatural writer still, to this day, has mixed emotions for. So for Flanagan to introduce some faithful interpretations of Doctor Sleep, whilst maintaining the cinematic endeavour that Kubrick meticulously crafted, is as I said, unfathomable. And there’s a perfectly valid reason for that. The overtly supernatural strands of the novels do not complement the genesis of terror from Kubrick’s film. Which is why, with great regret, I have to report that Doctor Sleep does not work. It doesn’t.\r\n\r\nA beastly behemoth that, whilst does stand on its own two legs, relies on heavy-handed storytelling techniques and nostalgia to tackle both mediums that inspired it. In tonality, they are irrefutably different from each other. But before the disappointing third act is tackled, let’s address some positives first.\r\n\r\nDoctor Sleep is a shining example of depicting childhood trauma and how fragmented coping mechanisms are embedded throughout adulthood. Young Danny imaginatively designs mental traps so that he can hold the starving ghosts from the Overlook in captivity. Yet that wilful mentality does not prevent him from suffering with alcoholism, substance abuse and an insalubrious lifestyle that masquerades the trauma instead of curing it. Thematically, this is powerful, and grants the narrative a solid cohesion throughout. For the first two hours, you subconsciously warm to Danny due to the tormenting fears he has established throughout the two films. He’s a pillar of “the shining”. McGregor consistently captivated by depicting a fragile mentality through a physically demanding performance, maintaining the entranced demeanour of his younger character.\r\n\r\nThe first hour, that heavily explained “the shining” and the intentions of the merciless antagonists The True Knot, experienced inconsistent tones due to the mass sprawl of locational change. One minute we’re in a sleepy town, the next a woodland area, and then all of a sudden eight years have been and gone. The zippy nature of the editing and bloated exposition resulted in atmospheric terror being abolished. The tension was non-existent, and the imitation of Kubrick’s directing style paled in comparison.\r\n\r\nThen, the second hour commenced, which is by far one of the strongest acts the year has yet to offer. Flanagan retained a surprisingly dark tone that, was so shocking, forced audience members to leave the auditorium. The mind-space of Abra, a precocious teenager who has “shine”, produced a transcendental imaginative battle against Rose the Hat, leader of The True Knot. Ferguson, who portrayed the primary antagonist, was sensational. Equalling the likes of Pennywise as one of the most enthralling King villains ever depicted. Sinister, unrelenting and bordering on near-lunacy. Controlling every scene from just her eyes alone, she enhanced the palpable tension. She made the second act. In fact, she made the film. The interjecting gore and darkness throughout the middling act abruptly astonished me, and settled for a direction that I thought would control the underwhelming first act.\r\n\r\nThe third act then arrives, and the entire story crumbles much like the Overlook itself. Plagued by an overshadowing sickness that ‘The Shining’ had produced. Nostalgia. Remember that time where Jack viciously chopped the bedroom door down with an axe? Or that moment where blood came hurtling through the hallways in slow motion? What about Room 237? The introductory swooping camera movement that Kubrick embraced whilst the Torrance’s drove to the hotel? The typewriter? Slowly walking up the stairs in a confrontational manner? The snow-covered hedge maze? The twins? No? You don’t remember? Flanagan has got you covered. Nostalgia is a powerful tool, yet it must be handled with delicacy. The difference between imitating and homaging is very fine, and unfortunately Flanagan settled for the former.\r\n\r\nSo much of ‘The Shining’ is replicated in the third act, scene for scene, that it was a near-identical copy without the textual substance that accompanied them originally. The re-casting of the original actors, despite Essoe bettering Duvall’s performance (although not difficult), felt unnecessary. Almost tarnishing ‘The Shining’ in itself. Danny walking through the dilapidated hallways for ten minutes whilst Flanagan incorporates identical sequences, had no purpose other than to forcefully remind you that this is the sequel. Literarily, it never progresses Danny’s character or the plot. Rose the Hat staring at the blood-spewing elevators? Pointless. Danny staring at an axe encased in glass? A suitable nod to its predecessor. Do you see the difference? Between imitation and homage? The third act was littered with falsified copies, preying on the nostalgia of fans. It’s uninspired. It’s mundane. And it made me a dull boy.\r\n\r\nCreatively, Doctor Sleep managed to infuse the very best of its adapted novel and preceding feature, but embellished the very worst techniques when conveying the plot. Psychologically stimulating without installing dread. Extrasensory without testing the senses. Dimly shining amongst King’s supernatural adaptations.", "created_at": "2020-01-16T14:24:26.760Z"}, {"movie_id": 501170, "review_id": "5e2f2797c56d2d001a4e48b6", "author_rating": 7.0, "review_text": "“Hi there”\r\n\r\nHello there...\r\n\r\nMike Flanagan has some of the biggest balls in the horror industry. I mean just look at his filmography so far.\r\n\r\nHe took one of the worst horror movies in recent memory ‘Ouija’ and said: “yeah, I wanna make a sequel to that”, with ‘Ouija: Origin of Evil’ and somehow made it less terrible. How about ‘Haunting of Hill House’ where he’s going to direct every episode of a television series that has to weave two narratives together at once over ten episodes...and again he somehow made it work. And now this guy is gonna make a sequel to one of the most revered horror movies of all time with ‘Doctor Sleep’...the son of b**ch did it again!\r\n\r\nI think Flanagan deserves more credit as a director rather than people bitching that his movies “ain't scary enough an-” blah blah blah shut the hell up.\r\n\r\n‘Doctor Sleep’ was a complete surprise for all the right reasons. At first I wasn’t sure if the movie would hook me, because it takes awhile for it to get going, but slowly I got invested in the story and the characters. There have been four Stephen King movie adaptions this year: ‘Pet Sematary’, ‘IT Chapter Two’, ‘In The Tall Grass’, and now this movie. This is by far the best out of them all.\r\n\r\nThe runtime is 152 minutes long and I can safely say that the movie is 85% it’s own thing, because it doesn't just rely on nostalgia to tell their story and it’s only the last act where things start to play on nostalgia when the characters return to the Overlook Hotel. The nostalgia being the 80’s horror classic of course. It’s either that or 97 TV mini-series. Who’s got fond memories for that piece of sh*t? So with this being both a sequel to Kubrick's movie and King’s original novel; a clash of visions coming together with Flanagan trying to put this together, while also applying his own vision into the mix.\r\n\r\nNow that’s hard.\r\n\r\nThe part that got me invested in the story was the scene between Danny and a elderly patient who’s on their death bed. Danny comforts them as their peacefully past away, without dying alone. It’s a beautiful and heartfelt scene that you would never expect to see in a supernatural horror movie.\r\n\r\nEwan Mcgregor was fantastic as an alcoholic grown-up Danny Torrance. Nicholson's presence was felt through out the movie as adult Danny fears he might follow in his fathers footsteps. There’s a scene where Danny gives a talk at a rehab group and as doing so he reflects deeply on everything that happened to him in the past, while the camera is locked on Ewan’s face. Not only from his childhood, but everything afterwards and drowning out the trauma through drinking - something that us as the audience don’t see. I thought he was excellent. He absolutely “shines” as the character...and am not sorry for that pun.\r\n\r\nI loved how fleshed out the villains were, which surprised me the most about the movie. They are like vampires, but instead of feasting on blood, it’s “the shining” they crave for a expanded life. Casual and charming, and yet wickedly evil. There’s a particularly scene that was so difficult to watch and really got under my skin. However you do get to see them interreacting with each other in normal conversations as they casually go on with the day and work as a group. Rose the Hat sticks out from the rest as a sinister and endearing villian played marvelously by Rebecca Ferguson.\r\n\r\nMike Flanagan dose a great job on balancing both Kubrick’s and King’s version respectfully, but also manages to put his visual spin in. The one thing that hasn’t been mention yet is how great he is with child actors as he always gets the best performance out of them, especially Jacob Tremblay and Kyliegh Curran who was so convincing in the roles it was scary.\r\n\r\nThe movie looks stunning with the use of colors adding to the overall tone and helps creates the horror atmosphere. Same thing with the score that while it takes samples from Kubrick’s movie, but not to say it doesn’t have it’s own.\r\n\r\nFor issues:\r\n\r\nThere was a couple of callbacks that was a little on the noise, usually through references. As I said early the movie takes a while to find it’s footing and you couldn’t help but draw comparisons. There were a few questionable and almost silly lines that King himself would inject into his work for humor, but here, with tone in mind, just took the fear out of it.\r\n\r\nOverall rating: “Eat well and live long.”", "created_at": "2020-01-27T18:10:31.627Z"}, {"movie_id": 501170, "review_id": "5e4c6b142866fa00169d01b7", "author_rating": 6.0, "review_text": "Partially satisfying \"sequel\" (of sorts) to the Shining with good performances from Ewan McGregor and Kyliegh Curran (while Rebecca Ferguson kind of hams it up, but still was fun as a villainous). However, the movie is far too long with probably 15-20 minutes that could've gotten the axe (so to speak), and the plot was The Shining meets X-Men with some Monsters Inc thrown in for good measure.\r\n\r\nDidn't hate it at all, but not sure I have much desire to revisit, though I have to wonder what else they threw in there with the 3-hour long Director's Cut. **3.0/5**", "created_at": "2020-02-18T22:54:12.821Z"}, {"movie_id": 501170, "review_id": "5f2d7703596a910033fc9817", "author_rating": 9.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nI honestly wasn't excited about this one, so my expectations were low.  I didn't realize it was Stephen King, let alone a sequel to \"The Shining\" until I watched it.  I'm also not a big fan of \"The Shining\", but I haven't watched it since I learned to watch a movie critically.\r\n\r\nAfter hearing about \"shining\" from everyone, I immediately got excited when I realize that was what this movie was all about.  I've been waiting for this movie since \"Push\".  This movie is honestly what \"Star Wars: Episode I\" should have been.  This is how you give an explanation of how super powers work on a large scale: you tell a story that examples it, \"do not say\", it is how movies are supposed to work.\r\n\r\nThis was wonderfully casted: Ewan McGregor, Kyliegh Curran, and Rebecca Ferguson are amazing.  There deliveries have weight to them, and it really makes the movie.\r\n\r\nThe production value is fantastic, they definitely didn't spare a cent to make this look as good or nostalgic as it needed to be.\r\n\r\nThere are aspects of the story I think we could have done without, mostly just for time purposes, and there are portions of the story that are just gratuitously graphic, and some of those two things overlap, but I'm not going to say that any of the movie would actually be better for it.  The story, whether it be the movie or from the book, is exceedingly well paced, and powerful, every step of the way.\r\n\r\nIt has this wonderful theme of predators and prey, basically \"There's always a bigger fish\", but in a twisted, looping way.\r\n\r\nIf you can stand horror at all and like psychic powers, then definitely give this a watch.", "created_at": "2020-08-07T15:45:07.457Z"}, {"movie_id": 501170, "review_id": "63be0a1bf85958007d373ebc", "author_rating": 1.0, "review_text": "The problem here is that they made a sequel to the 1980 movie... and not a sequel to King's book.\r\n\r\nAnd, let's be honest, as good as Stanley's film was, it really had little to do with Kings novel. Almost The Shining in name only. So many changes were made, right down to the theme, that it barely resembled the book.\r\n\r\nSo, when they made the sequel to the movie, and not the novel, a lot of the elements that made the Doctor Sleep compelling, a lot of the plot points, and a lot of the twists and turns that made the novel worth reading had to be changed in order to keep continuity with Kubrick's changes.\r\n\r\nThe result is really kind of a mess. So much of what Doctor Sleep was referenced back to The Shining, the novel, that trying to adapt the script to the Kubrick film was, honestly, a mistake.\r\n\r\nIn the end, it grasps at straws and never finds a footing, making Doctor Sleep even further removed from the story it was based on than Kubrick's film was... with far less talent directing it.", "created_at": "2023-01-11T01:00:11.882Z"}, {"movie_id": 501170, "review_id": "5dbb01b612970c001838bead", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThere's this misconceived idea that \"scary movies\" are the ones with demons, monsters, or ghosts literally showing up in jump scare sequences, one after another, accompanied by an extremely loud sound. Granted, we're scared of what we're scared of. No debate here. However, one common complaint about this type of horror films is that they aren't \"scary enough\". I couldn't disagree more. These movies are the ones that truly get to us and stay with us for a while. If we watch a film with cyclical jump scares, we're going to forget about it as soon as we leave the theater. Movies with a horrific story, based on relatable themes, those are the ones that leave us uncomfortable and disturbed. I'm just writing this \"prologue\" to say that you shouldn't go in expecting a \"scary\" film. At least, not in a mainstream way. Moving on...\r\n\r\nAs you probably know by now (if you don't, check out my The Shining's review), I'm a huge fan of Stanley Kubrick's adaptation of Stephen King's novel of the same name. It's a cult classic horror movie, one that influenced generations to come, especially regarding filmmaking techniques and equipment. With that said, Mike Flanagan had one of the toughest jobs of 2019. Not only did he need to deliver a sequel worthy of being associated with a beloved classic, but he had to deal with all the differences between the source material and Kubrick's changes. I'm going to leave a SPOILER WARNING for The Shining since the film came out 40 years ago, and I already wrote a review about it. Still, SPOILER-FREE for Doctor Sleep, don't worry.\r\n\r\nIn case you don't know, the major difference between King's book and Kubrick's cinematic adaptation is the ending. In the book, Jack Torrance forgets to relieve the hotel boiler's pressure, and it explodes, destroying the hotel and killing Jack in the process. In Kubrick's movie, Jack freezes to death in the maze outside the hotel while chasing his son, while the hotel stands tall. Flanagan is able to do the impossible: he perfectly continues the story left by Kubrick while respecting King's \"demands\". Just don't go with a \"purist\" mentality, thinking that Flanagan doesn't have the right to explore and expand \"the shining\". It's a sequel, so expect things to be added to the story (nothing is removed or retconned, so relax). As long as it makes sense, be always open to new ideas.\r\n\r\nAs the director, Flanagan proves once again he's a pretty talented guy by seamlessly recreating some of The Shining's most iconic scenes, but also by delivering some tricks of his own. With the help of his amazing cinematographer, Michael Fimognari, they are able to generate incredible levels of tension, characteristic of the original film. As the editor, he puts together everything remarkably well. The sequences inside someone's mind are wonderfully handled and provide some of the best moments of the entire movie. However, there's a massive difference when it comes to how the runtime flows in each film.\r\n\r\nBoth cross the 140-minute mark, and both purposefully employ slow pacing. Nevertheless, The Shining feels like it goes by way faster than Doctor Sleep (and mathematically it does have less 5-10 minutes, but that's not the point). Why? Due to Kubrick's movie constantly having long takes and extense dialogues, while Flanagan's installment has a modern approach with regular cuts plus much more action. Audiences presumably won't think of this (it's not like the \"average Joe\" notices or even cares if a scene has been going for 5 minutes straight or pieced together with 50 cuts), and just assume that the latter is more boring than the first without really understanding why.\r\n\r\nPeople will probably blindly blame the story, but Doctor Sleep has a lot more \"blockbuster entertainment\" than The Shining. The latter is pretty much two hours spent inside a hotel where dialogue is the primary source of entertainment (things only go crazy in the last 15-20 minutes), and we all know that the general public usually doesn't fall for that. The sequel has a lot more action, subplots, and characters, so the runtime should go by faster than the original, right? No. This film is the number one proof that I'm going to use from now on to defend that uncut dialogue sequences and overall long takes are the best way of managing an extended runtime without it feeling too \"heavy\", especially in a psychological horror flick.\r\n\r\nI wrote all these last paragraphs not to complain about the movie's being too slow, too long, or too dull. I'm just trying to help everyone understand why the film might feel slower and (much) longer, while protecting its story because the screenplay is indeed extremely well-written. Like in the original, exposition is handled beautifully with scarce lazy displays, but it's the characters of Ewan McGregor and the debutant Kyliegh Curran that carry the narrative effortlessly. McGregor is the perfect casting as Danny Torrance, and he does a great job of embodying Dan's personality. However, it's Danny's journey through his young and adult years that impresses me.\r\n\r\nExceptional character development! Danny's life after the events at the Overlook Hotel is as realistic and logical as it could be. Flanagan does a phenomenal job in handling this character and throwing just the right obstacles in his path. The way he deals with the aftermath of The Shining, how he grows up as a man, and even what he ends up doing for a living, everything is absolutely perfect. Furthermore, he's not alone. Abra is a badass young girl who wants to use her \"shine\" to protect others, but this time it's the actress that steals the spotlight from the character. Kyliegh Curran delivers one of the best young acting debuts I've ever witnessed. She's wonderful as Abra, and her range of emotions is already surprisingly vast.\r\n\r\nShe has some of the best scenes of the movie, especially when she's \"fighting\" Rose the Hat, but here is where we get to my major issue with the film. Rebecca Ferguson gives an outstanding performance, no doubt about it. She elevates infinite sequences, giving 200% to her role. However, her character and The True Knot group are the only significant flaw of this sequel. When writing a villain, there are basically two paths for success: either make the \"bad guy\" a compelling character with whom the audience can create some sort of empathy with and understand where he/she comes from, or turn him/her into a menacing, powerful, scary force that makes us fear for our heroes.\r\n\r\nFlanagan apparently chooses the latter route, and unfortunately, it's his only misstep. I don't know if King didn't allow for changes to Rose or The True Knot cult, but they don't quite work when adapting to the big screen. Not only their history is never truly explored, but their motivations are too shallow, so I didn't care for a single character from the group, not even Rose. If she was the \"menacing, powerful, scary force\" that I wrote above, this wouldn't be so important, but the truth is she isn't. As the narrative progresses, there's a constant reminder that our heroes are in danger and that Rose is astonishingly strong, but the interactions between her and Abra prove the contrary. So, I never really felt frightened or overwhelmed by her.\r\n\r\nA decent portion of runtime is handed to Rose's group, but its development didn't work for me at all. They're not bad villains, and they're still more fleshed out that a lot of characters in horror movies. I just think something's missing. Nevertheless, that's the only major problem I have with the movie. For true fans of The Shining, the countless references and Easter Eggs are such a delight (there's good and bad fan-service, the one present in this sequel only appears after we are already invested in the story and its characters, demonstrating once more Flanagan's talent). From the haunting and addictive score that The Newton Brothers are able to seamlessly adapt to the sequel to the influential Kubrick's framing, Flanagan and his team produce something pretty extraordinary having in mind this is a sequel to one of the most beloved horror films of all-time.\r\n\r\nIn the end, Doctor Sleep might be the first sequel/remake/reboot/whatever to a cult classic movie that doesn't diminish the original, disgracefully copies it or takes something away from it, while actually being an individually great film with a captivating narrative and compelling leads, plus the right amount of homages to the classic. Mike Flanagan took the impossible task of balancing both Stephen King's The Shining and Stanley Kubrick's cinematic adaptation, and successfully nailed pretty much everything regarding the connection between the main stories. In addition to the slow pacing not working as well as in the original, The True Knot group is the big stumble in an otherwise pretty consistent screenplay. However, the phenomenal cast (with a terrific debut performance from Kyliegh Curran) elevate every scene, ultimately driving the sequel to a nostalgia-full ending that will turn out to be divisive among fans. I stand on the good side. Therefore, I genuinely appreciate this movie. If you're a fan of the original, you can't miss this one!\r\n\r\nRating: A-", "created_at": "2019-10-31T15:45:58.999Z"}, {"movie_id": 501170, "review_id": "5dbf9ca47d2bc10011377425", "author_rating": 7.0, "review_text": "‘Doctor Sleep’ could go either way with ‘The Shining’ fans - some will see it as a perfect follow-up, others will deem it too different (which I think is a good thing). ‘Doctor Sleep’ works as both and also stands on its own; you could fill in the blanks pretty easily if you had never read or seen the original film. It’s a fun supernatural horror film aided by fantastic performances by Ferguson and Curran.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-doctor-sleep-heres-the-shining-stephen-king-has-been-waiting-for", "created_at": "2019-11-04T03:36:04.170Z"}, {"movie_id": 501170, "review_id": "5e20721ab3316b00130356b2", "author_rating": 6.0, "review_text": "Doctor Sleep may not diagnose you to the land of nod, but tediously drains your shining spirit. Director Mike Flanagan had an unfathomable task. To both adapt a Stephen King novel, which is no easy achievement considering his uniquely descriptive writing style, and provide a sequel to what many describe as “the greatest horror film of all-time”. Quenching the thirst of King’s avid readers and cinephiles alike. So even without divulging my own opinion on Doctor Sleep, applause must be given for just producing this feature. That, unfortunately for Flanagan, doesn’t result in myself excusing specific inexcusable filmmaking tendencies that taint, not just Doctor Sleep, but various decaying intellectual properties that have been unnecessarily drudged up again.\r\n\r\nAn alcoholic scarred Dan Torrance, having endured the irrevocable dangers of the Overlook Hotel (‘The Shining’), has his peace shattered when he encounters a young extrasensory girl whom is being hunted down by shine-draining monsters.\r\n\r\nFirst and foremost, I have not read the novel, although this should not come as a surprise. I have however, watched ‘The Shining’ multiple times. Now, what promotes the aforementioned horror as the best of its kind, is legendary Stanley Kubrick using the essence of King’s novel and essentially making his own iteration of it. One that the renowned supernatural writer still, to this day, has mixed emotions for. So for Flanagan to introduce some faithful interpretations of Doctor Sleep, whilst maintaining the cinematic endeavour that Kubrick meticulously crafted, is as I said, unfathomable. And there’s a perfectly valid reason for that. The overtly supernatural strands of the novels do not complement the genesis of terror from Kubrick’s film. Which is why, with great regret, I have to report that Doctor Sleep does not work. It doesn’t.\r\n\r\nA beastly behemoth that, whilst does stand on its own two legs, relies on heavy-handed storytelling techniques and nostalgia to tackle both mediums that inspired it. In tonality, they are irrefutably different from each other. But before the disappointing third act is tackled, let’s address some positives first.\r\n\r\nDoctor Sleep is a shining example of depicting childhood trauma and how fragmented coping mechanisms are embedded throughout adulthood. Young Danny imaginatively designs mental traps so that he can hold the starving ghosts from the Overlook in captivity. Yet that wilful mentality does not prevent him from suffering with alcoholism, substance abuse and an insalubrious lifestyle that masquerades the trauma instead of curing it. Thematically, this is powerful, and grants the narrative a solid cohesion throughout. For the first two hours, you subconsciously warm to Danny due to the tormenting fears he has established throughout the two films. He’s a pillar of “the shining”. McGregor consistently captivated by depicting a fragile mentality through a physically demanding performance, maintaining the entranced demeanour of his younger character.\r\n\r\nThe first hour, that heavily explained “the shining” and the intentions of the merciless antagonists The True Knot, experienced inconsistent tones due to the mass sprawl of locational change. One minute we’re in a sleepy town, the next a woodland area, and then all of a sudden eight years have been and gone. The zippy nature of the editing and bloated exposition resulted in atmospheric terror being abolished. The tension was non-existent, and the imitation of Kubrick’s directing style paled in comparison.\r\n\r\nThen, the second hour commenced, which is by far one of the strongest acts the year has yet to offer. Flanagan retained a surprisingly dark tone that, was so shocking, forced audience members to leave the auditorium. The mind-space of Abra, a precocious teenager who has “shine”, produced a transcendental imaginative battle against Rose the Hat, leader of The True Knot. Ferguson, who portrayed the primary antagonist, was sensational. Equalling the likes of Pennywise as one of the most enthralling King villains ever depicted. Sinister, unrelenting and bordering on near-lunacy. Controlling every scene from just her eyes alone, she enhanced the palpable tension. She made the second act. In fact, she made the film. The interjecting gore and darkness throughout the middling act abruptly astonished me, and settled for a direction that I thought would control the underwhelming first act.\r\n\r\nThe third act then arrives, and the entire story crumbles much like the Overlook itself. Plagued by an overshadowing sickness that ‘The Shining’ had produced. Nostalgia. Remember that time where Jack viciously chopped the bedroom door down with an axe? Or that moment where blood came hurtling through the hallways in slow motion? What about Room 237? The introductory swooping camera movement that Kubrick embraced whilst the Torrance’s drove to the hotel? The typewriter? Slowly walking up the stairs in a confrontational manner? The snow-covered hedge maze? The twins? No? You don’t remember? Flanagan has got you covered. Nostalgia is a powerful tool, yet it must be handled with delicacy. The difference between imitating and homaging is very fine, and unfortunately Flanagan settled for the former.\r\n\r\nSo much of ‘The Shining’ is replicated in the third act, scene for scene, that it was a near-identical copy without the textual substance that accompanied them originally. The re-casting of the original actors, despite Essoe bettering Duvall’s performance (although not difficult), felt unnecessary. Almost tarnishing ‘The Shining’ in itself. Danny walking through the dilapidated hallways for ten minutes whilst Flanagan incorporates identical sequences, had no purpose other than to forcefully remind you that this is the sequel. Literarily, it never progresses Danny’s character or the plot. Rose the Hat staring at the blood-spewing elevators? Pointless. Danny staring at an axe encased in glass? A suitable nod to its predecessor. Do you see the difference? Between imitation and homage? The third act was littered with falsified copies, preying on the nostalgia of fans. It’s uninspired. It’s mundane. And it made me a dull boy.\r\n\r\nCreatively, Doctor Sleep managed to infuse the very best of its adapted novel and preceding feature, but embellished the very worst techniques when conveying the plot. Psychologically stimulating without installing dread. Extrasensory without testing the senses. Dimly shining amongst King’s supernatural adaptations.", "created_at": "2020-01-16T14:24:26.760Z"}, {"movie_id": 501170, "review_id": "5e2f2797c56d2d001a4e48b6", "author_rating": 7.0, "review_text": "“Hi there”\r\n\r\nHello there...\r\n\r\nMike Flanagan has some of the biggest balls in the horror industry. I mean just look at his filmography so far.\r\n\r\nHe took one of the worst horror movies in recent memory ‘Ouija’ and said: “yeah, I wanna make a sequel to that”, with ‘Ouija: Origin of Evil’ and somehow made it less terrible. How about ‘Haunting of Hill House’ where he’s going to direct every episode of a television series that has to weave two narratives together at once over ten episodes...and again he somehow made it work. And now this guy is gonna make a sequel to one of the most revered horror movies of all time with ‘Doctor Sleep’...the son of b**ch did it again!\r\n\r\nI think Flanagan deserves more credit as a director rather than people bitching that his movies “ain't scary enough an-” blah blah blah shut the hell up.\r\n\r\n‘Doctor Sleep’ was a complete surprise for all the right reasons. At first I wasn’t sure if the movie would hook me, because it takes awhile for it to get going, but slowly I got invested in the story and the characters. There have been four Stephen King movie adaptions this year: ‘Pet Sematary’, ‘IT Chapter Two’, ‘In The Tall Grass’, and now this movie. This is by far the best out of them all.\r\n\r\nThe runtime is 152 minutes long and I can safely say that the movie is 85% it’s own thing, because it doesn't just rely on nostalgia to tell their story and it’s only the last act where things start to play on nostalgia when the characters return to the Overlook Hotel. The nostalgia being the 80’s horror classic of course. It’s either that or 97 TV mini-series. Who’s got fond memories for that piece of sh*t? So with this being both a sequel to Kubrick's movie and King’s original novel; a clash of visions coming together with Flanagan trying to put this together, while also applying his own vision into the mix.\r\n\r\nNow that’s hard.\r\n\r\nThe part that got me invested in the story was the scene between Danny and a elderly patient who’s on their death bed. Danny comforts them as their peacefully past away, without dying alone. It’s a beautiful and heartfelt scene that you would never expect to see in a supernatural horror movie.\r\n\r\nEwan Mcgregor was fantastic as an alcoholic grown-up Danny Torrance. Nicholson's presence was felt through out the movie as adult Danny fears he might follow in his fathers footsteps. There’s a scene where Danny gives a talk at a rehab group and as doing so he reflects deeply on everything that happened to him in the past, while the camera is locked on Ewan’s face. Not only from his childhood, but everything afterwards and drowning out the trauma through drinking - something that us as the audience don’t see. I thought he was excellent. He absolutely “shines” as the character...and am not sorry for that pun.\r\n\r\nI loved how fleshed out the villains were, which surprised me the most about the movie. They are like vampires, but instead of feasting on blood, it’s “the shining” they crave for a expanded life. Casual and charming, and yet wickedly evil. There’s a particularly scene that was so difficult to watch and really got under my skin. However you do get to see them interreacting with each other in normal conversations as they casually go on with the day and work as a group. Rose the Hat sticks out from the rest as a sinister and endearing villian played marvelously by Rebecca Ferguson.\r\n\r\nMike Flanagan dose a great job on balancing both Kubrick’s and King’s version respectfully, but also manages to put his visual spin in. The one thing that hasn’t been mention yet is how great he is with child actors as he always gets the best performance out of them, especially Jacob Tremblay and Kyliegh Curran who was so convincing in the roles it was scary.\r\n\r\nThe movie looks stunning with the use of colors adding to the overall tone and helps creates the horror atmosphere. Same thing with the score that while it takes samples from Kubrick’s movie, but not to say it doesn’t have it’s own.\r\n\r\nFor issues:\r\n\r\nThere was a couple of callbacks that was a little on the noise, usually through references. As I said early the movie takes a while to find it’s footing and you couldn’t help but draw comparisons. There were a few questionable and almost silly lines that King himself would inject into his work for humor, but here, with tone in mind, just took the fear out of it.\r\n\r\nOverall rating: “Eat well and live long.”", "created_at": "2020-01-27T18:10:31.627Z"}, {"movie_id": 501170, "review_id": "5e4c6b142866fa00169d01b7", "author_rating": 6.0, "review_text": "Partially satisfying \"sequel\" (of sorts) to the Shining with good performances from Ewan McGregor and Kyliegh Curran (while Rebecca Ferguson kind of hams it up, but still was fun as a villainous). However, the movie is far too long with probably 15-20 minutes that could've gotten the axe (so to speak), and the plot was The Shining meets X-Men with some Monsters Inc thrown in for good measure.\r\n\r\nDidn't hate it at all, but not sure I have much desire to revisit, though I have to wonder what else they threw in there with the 3-hour long Director's Cut. **3.0/5**", "created_at": "2020-02-18T22:54:12.821Z"}, {"movie_id": 501170, "review_id": "5f2d7703596a910033fc9817", "author_rating": 9.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nI honestly wasn't excited about this one, so my expectations were low.  I didn't realize it was Stephen King, let alone a sequel to \"The Shining\" until I watched it.  I'm also not a big fan of \"The Shining\", but I haven't watched it since I learned to watch a movie critically.\r\n\r\nAfter hearing about \"shining\" from everyone, I immediately got excited when I realize that was what this movie was all about.  I've been waiting for this movie since \"Push\".  This movie is honestly what \"Star Wars: Episode I\" should have been.  This is how you give an explanation of how super powers work on a large scale: you tell a story that examples it, \"do not say\", it is how movies are supposed to work.\r\n\r\nThis was wonderfully casted: Ewan McGregor, Kyliegh Curran, and Rebecca Ferguson are amazing.  There deliveries have weight to them, and it really makes the movie.\r\n\r\nThe production value is fantastic, they definitely didn't spare a cent to make this look as good or nostalgic as it needed to be.\r\n\r\nThere are aspects of the story I think we could have done without, mostly just for time purposes, and there are portions of the story that are just gratuitously graphic, and some of those two things overlap, but I'm not going to say that any of the movie would actually be better for it.  The story, whether it be the movie or from the book, is exceedingly well paced, and powerful, every step of the way.\r\n\r\nIt has this wonderful theme of predators and prey, basically \"There's always a bigger fish\", but in a twisted, looping way.\r\n\r\nIf you can stand horror at all and like psychic powers, then definitely give this a watch.", "created_at": "2020-08-07T15:45:07.457Z"}, {"movie_id": 501170, "review_id": "63be0a1bf85958007d373ebc", "author_rating": 1.0, "review_text": "The problem here is that they made a sequel to the 1980 movie... and not a sequel to King's book.\r\n\r\nAnd, let's be honest, as good as Stanley's film was, it really had little to do with Kings novel. Almost The Shining in name only. So many changes were made, right down to the theme, that it barely resembled the book.\r\n\r\nSo, when they made the sequel to the movie, and not the novel, a lot of the elements that made the Doctor Sleep compelling, a lot of the plot points, and a lot of the twists and turns that made the novel worth reading had to be changed in order to keep continuity with Kubrick's changes.\r\n\r\nThe result is really kind of a mess. So much of what Doctor Sleep was referenced back to The Shining, the novel, that trying to adapt the script to the Kubrick film was, honestly, a mistake.\r\n\r\nIn the end, it grasps at straws and never finds a footing, making Doctor Sleep even further removed from the story it was based on than Kubrick's film was... with far less talent directing it.", "created_at": "2023-01-11T01:00:11.882Z"}, {"movie_id": 501170, "review_id": "5dbb01b612970c001838bead", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThere's this misconceived idea that \"scary movies\" are the ones with demons, monsters, or ghosts literally showing up in jump scare sequences, one after another, accompanied by an extremely loud sound. Granted, we're scared of what we're scared of. No debate here. However, one common complaint about this type of horror films is that they aren't \"scary enough\". I couldn't disagree more. These movies are the ones that truly get to us and stay with us for a while. If we watch a film with cyclical jump scares, we're going to forget about it as soon as we leave the theater. Movies with a horrific story, based on relatable themes, those are the ones that leave us uncomfortable and disturbed. I'm just writing this \"prologue\" to say that you shouldn't go in expecting a \"scary\" film. At least, not in a mainstream way. Moving on...\r\n\r\nAs you probably know by now (if you don't, check out my The Shining's review), I'm a huge fan of Stanley Kubrick's adaptation of Stephen King's novel of the same name. It's a cult classic horror movie, one that influenced generations to come, especially regarding filmmaking techniques and equipment. With that said, Mike Flanagan had one of the toughest jobs of 2019. Not only did he need to deliver a sequel worthy of being associated with a beloved classic, but he had to deal with all the differences between the source material and Kubrick's changes. I'm going to leave a SPOILER WARNING for The Shining since the film came out 40 years ago, and I already wrote a review about it. Still, SPOILER-FREE for Doctor Sleep, don't worry.\r\n\r\nIn case you don't know, the major difference between King's book and Kubrick's cinematic adaptation is the ending. In the book, Jack Torrance forgets to relieve the hotel boiler's pressure, and it explodes, destroying the hotel and killing Jack in the process. In Kubrick's movie, Jack freezes to death in the maze outside the hotel while chasing his son, while the hotel stands tall. Flanagan is able to do the impossible: he perfectly continues the story left by Kubrick while respecting King's \"demands\". Just don't go with a \"purist\" mentality, thinking that Flanagan doesn't have the right to explore and expand \"the shining\". It's a sequel, so expect things to be added to the story (nothing is removed or retconned, so relax). As long as it makes sense, be always open to new ideas.\r\n\r\nAs the director, Flanagan proves once again he's a pretty talented guy by seamlessly recreating some of The Shining's most iconic scenes, but also by delivering some tricks of his own. With the help of his amazing cinematographer, Michael Fimognari, they are able to generate incredible levels of tension, characteristic of the original film. As the editor, he puts together everything remarkably well. The sequences inside someone's mind are wonderfully handled and provide some of the best moments of the entire movie. However, there's a massive difference when it comes to how the runtime flows in each film.\r\n\r\nBoth cross the 140-minute mark, and both purposefully employ slow pacing. Nevertheless, The Shining feels like it goes by way faster than Doctor Sleep (and mathematically it does have less 5-10 minutes, but that's not the point). Why? Due to Kubrick's movie constantly having long takes and extense dialogues, while Flanagan's installment has a modern approach with regular cuts plus much more action. Audiences presumably won't think of this (it's not like the \"average Joe\" notices or even cares if a scene has been going for 5 minutes straight or pieced together with 50 cuts), and just assume that the latter is more boring than the first without really understanding why.\r\n\r\nPeople will probably blindly blame the story, but Doctor Sleep has a lot more \"blockbuster entertainment\" than The Shining. The latter is pretty much two hours spent inside a hotel where dialogue is the primary source of entertainment (things only go crazy in the last 15-20 minutes), and we all know that the general public usually doesn't fall for that. The sequel has a lot more action, subplots, and characters, so the runtime should go by faster than the original, right? No. This film is the number one proof that I'm going to use from now on to defend that uncut dialogue sequences and overall long takes are the best way of managing an extended runtime without it feeling too \"heavy\", especially in a psychological horror flick.\r\n\r\nI wrote all these last paragraphs not to complain about the movie's being too slow, too long, or too dull. I'm just trying to help everyone understand why the film might feel slower and (much) longer, while protecting its story because the screenplay is indeed extremely well-written. Like in the original, exposition is handled beautifully with scarce lazy displays, but it's the characters of Ewan McGregor and the debutant Kyliegh Curran that carry the narrative effortlessly. McGregor is the perfect casting as Danny Torrance, and he does a great job of embodying Dan's personality. However, it's Danny's journey through his young and adult years that impresses me.\r\n\r\nExceptional character development! Danny's life after the events at the Overlook Hotel is as realistic and logical as it could be. Flanagan does a phenomenal job in handling this character and throwing just the right obstacles in his path. The way he deals with the aftermath of The Shining, how he grows up as a man, and even what he ends up doing for a living, everything is absolutely perfect. Furthermore, he's not alone. Abra is a badass young girl who wants to use her \"shine\" to protect others, but this time it's the actress that steals the spotlight from the character. Kyliegh Curran delivers one of the best young acting debuts I've ever witnessed. She's wonderful as Abra, and her range of emotions is already surprisingly vast.\r\n\r\nShe has some of the best scenes of the movie, especially when she's \"fighting\" Rose the Hat, but here is where we get to my major issue with the film. Rebecca Ferguson gives an outstanding performance, no doubt about it. She elevates infinite sequences, giving 200% to her role. However, her character and The True Knot group are the only significant flaw of this sequel. When writing a villain, there are basically two paths for success: either make the \"bad guy\" a compelling character with whom the audience can create some sort of empathy with and understand where he/she comes from, or turn him/her into a menacing, powerful, scary force that makes us fear for our heroes.\r\n\r\nFlanagan apparently chooses the latter route, and unfortunately, it's his only misstep. I don't know if King didn't allow for changes to Rose or The True Knot cult, but they don't quite work when adapting to the big screen. Not only their history is never truly explored, but their motivations are too shallow, so I didn't care for a single character from the group, not even Rose. If she was the \"menacing, powerful, scary force\" that I wrote above, this wouldn't be so important, but the truth is she isn't. As the narrative progresses, there's a constant reminder that our heroes are in danger and that Rose is astonishingly strong, but the interactions between her and Abra prove the contrary. So, I never really felt frightened or overwhelmed by her.\r\n\r\nA decent portion of runtime is handed to Rose's group, but its development didn't work for me at all. They're not bad villains, and they're still more fleshed out that a lot of characters in horror movies. I just think something's missing. Nevertheless, that's the only major problem I have with the movie. For true fans of The Shining, the countless references and Easter Eggs are such a delight (there's good and bad fan-service, the one present in this sequel only appears after we are already invested in the story and its characters, demonstrating once more Flanagan's talent). From the haunting and addictive score that The Newton Brothers are able to seamlessly adapt to the sequel to the influential Kubrick's framing, Flanagan and his team produce something pretty extraordinary having in mind this is a sequel to one of the most beloved horror films of all-time.\r\n\r\nIn the end, Doctor Sleep might be the first sequel/remake/reboot/whatever to a cult classic movie that doesn't diminish the original, disgracefully copies it or takes something away from it, while actually being an individually great film with a captivating narrative and compelling leads, plus the right amount of homages to the classic. Mike Flanagan took the impossible task of balancing both Stephen King's The Shining and Stanley Kubrick's cinematic adaptation, and successfully nailed pretty much everything regarding the connection between the main stories. In addition to the slow pacing not working as well as in the original, The True Knot group is the big stumble in an otherwise pretty consistent screenplay. However, the phenomenal cast (with a terrific debut performance from Kyliegh Curran) elevate every scene, ultimately driving the sequel to a nostalgia-full ending that will turn out to be divisive among fans. I stand on the good side. Therefore, I genuinely appreciate this movie. If you're a fan of the original, you can't miss this one!\r\n\r\nRating: A-", "created_at": "2019-10-31T15:45:58.999Z"}, {"movie_id": 501170, "review_id": "5dbf9ca47d2bc10011377425", "author_rating": 7.0, "review_text": "‘Doctor Sleep’ could go either way with ‘The Shining’ fans - some will see it as a perfect follow-up, others will deem it too different (which I think is a good thing). ‘Doctor Sleep’ works as both and also stands on its own; you could fill in the blanks pretty easily if you had never read or seen the original film. It’s a fun supernatural horror film aided by fantastic performances by Ferguson and Curran.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-doctor-sleep-heres-the-shining-stephen-king-has-been-waiting-for", "created_at": "2019-11-04T03:36:04.170Z"}, {"movie_id": 501170, "review_id": "5e20721ab3316b00130356b2", "author_rating": 6.0, "review_text": "Doctor Sleep may not diagnose you to the land of nod, but tediously drains your shining spirit. Director Mike Flanagan had an unfathomable task. To both adapt a Stephen King novel, which is no easy achievement considering his uniquely descriptive writing style, and provide a sequel to what many describe as “the greatest horror film of all-time”. Quenching the thirst of King’s avid readers and cinephiles alike. So even without divulging my own opinion on Doctor Sleep, applause must be given for just producing this feature. That, unfortunately for Flanagan, doesn’t result in myself excusing specific inexcusable filmmaking tendencies that taint, not just Doctor Sleep, but various decaying intellectual properties that have been unnecessarily drudged up again.\r\n\r\nAn alcoholic scarred Dan Torrance, having endured the irrevocable dangers of the Overlook Hotel (‘The Shining’), has his peace shattered when he encounters a young extrasensory girl whom is being hunted down by shine-draining monsters.\r\n\r\nFirst and foremost, I have not read the novel, although this should not come as a surprise. I have however, watched ‘The Shining’ multiple times. Now, what promotes the aforementioned horror as the best of its kind, is legendary Stanley Kubrick using the essence of King’s novel and essentially making his own iteration of it. One that the renowned supernatural writer still, to this day, has mixed emotions for. So for Flanagan to introduce some faithful interpretations of Doctor Sleep, whilst maintaining the cinematic endeavour that Kubrick meticulously crafted, is as I said, unfathomable. And there’s a perfectly valid reason for that. The overtly supernatural strands of the novels do not complement the genesis of terror from Kubrick’s film. Which is why, with great regret, I have to report that Doctor Sleep does not work. It doesn’t.\r\n\r\nA beastly behemoth that, whilst does stand on its own two legs, relies on heavy-handed storytelling techniques and nostalgia to tackle both mediums that inspired it. In tonality, they are irrefutably different from each other. But before the disappointing third act is tackled, let’s address some positives first.\r\n\r\nDoctor Sleep is a shining example of depicting childhood trauma and how fragmented coping mechanisms are embedded throughout adulthood. Young Danny imaginatively designs mental traps so that he can hold the starving ghosts from the Overlook in captivity. Yet that wilful mentality does not prevent him from suffering with alcoholism, substance abuse and an insalubrious lifestyle that masquerades the trauma instead of curing it. Thematically, this is powerful, and grants the narrative a solid cohesion throughout. For the first two hours, you subconsciously warm to Danny due to the tormenting fears he has established throughout the two films. He’s a pillar of “the shining”. McGregor consistently captivated by depicting a fragile mentality through a physically demanding performance, maintaining the entranced demeanour of his younger character.\r\n\r\nThe first hour, that heavily explained “the shining” and the intentions of the merciless antagonists The True Knot, experienced inconsistent tones due to the mass sprawl of locational change. One minute we’re in a sleepy town, the next a woodland area, and then all of a sudden eight years have been and gone. The zippy nature of the editing and bloated exposition resulted in atmospheric terror being abolished. The tension was non-existent, and the imitation of Kubrick’s directing style paled in comparison.\r\n\r\nThen, the second hour commenced, which is by far one of the strongest acts the year has yet to offer. Flanagan retained a surprisingly dark tone that, was so shocking, forced audience members to leave the auditorium. The mind-space of Abra, a precocious teenager who has “shine”, produced a transcendental imaginative battle against Rose the Hat, leader of The True Knot. Ferguson, who portrayed the primary antagonist, was sensational. Equalling the likes of Pennywise as one of the most enthralling King villains ever depicted. Sinister, unrelenting and bordering on near-lunacy. Controlling every scene from just her eyes alone, she enhanced the palpable tension. She made the second act. In fact, she made the film. The interjecting gore and darkness throughout the middling act abruptly astonished me, and settled for a direction that I thought would control the underwhelming first act.\r\n\r\nThe third act then arrives, and the entire story crumbles much like the Overlook itself. Plagued by an overshadowing sickness that ‘The Shining’ had produced. Nostalgia. Remember that time where Jack viciously chopped the bedroom door down with an axe? Or that moment where blood came hurtling through the hallways in slow motion? What about Room 237? The introductory swooping camera movement that Kubrick embraced whilst the Torrance’s drove to the hotel? The typewriter? Slowly walking up the stairs in a confrontational manner? The snow-covered hedge maze? The twins? No? You don’t remember? Flanagan has got you covered. Nostalgia is a powerful tool, yet it must be handled with delicacy. The difference between imitating and homaging is very fine, and unfortunately Flanagan settled for the former.\r\n\r\nSo much of ‘The Shining’ is replicated in the third act, scene for scene, that it was a near-identical copy without the textual substance that accompanied them originally. The re-casting of the original actors, despite Essoe bettering Duvall’s performance (although not difficult), felt unnecessary. Almost tarnishing ‘The Shining’ in itself. Danny walking through the dilapidated hallways for ten minutes whilst Flanagan incorporates identical sequences, had no purpose other than to forcefully remind you that this is the sequel. Literarily, it never progresses Danny’s character or the plot. Rose the Hat staring at the blood-spewing elevators? Pointless. Danny staring at an axe encased in glass? A suitable nod to its predecessor. Do you see the difference? Between imitation and homage? The third act was littered with falsified copies, preying on the nostalgia of fans. It’s uninspired. It’s mundane. And it made me a dull boy.\r\n\r\nCreatively, Doctor Sleep managed to infuse the very best of its adapted novel and preceding feature, but embellished the very worst techniques when conveying the plot. Psychologically stimulating without installing dread. Extrasensory without testing the senses. Dimly shining amongst King’s supernatural adaptations.", "created_at": "2020-01-16T14:24:26.760Z"}, {"movie_id": 501170, "review_id": "5e2f2797c56d2d001a4e48b6", "author_rating": 7.0, "review_text": "“Hi there”\r\n\r\nHello there...\r\n\r\nMike Flanagan has some of the biggest balls in the horror industry. I mean just look at his filmography so far.\r\n\r\nHe took one of the worst horror movies in recent memory ‘Ouija’ and said: “yeah, I wanna make a sequel to that”, with ‘Ouija: Origin of Evil’ and somehow made it less terrible. How about ‘Haunting of Hill House’ where he’s going to direct every episode of a television series that has to weave two narratives together at once over ten episodes...and again he somehow made it work. And now this guy is gonna make a sequel to one of the most revered horror movies of all time with ‘Doctor Sleep’...the son of b**ch did it again!\r\n\r\nI think Flanagan deserves more credit as a director rather than people bitching that his movies “ain't scary enough an-” blah blah blah shut the hell up.\r\n\r\n‘Doctor Sleep’ was a complete surprise for all the right reasons. At first I wasn’t sure if the movie would hook me, because it takes awhile for it to get going, but slowly I got invested in the story and the characters. There have been four Stephen King movie adaptions this year: ‘Pet Sematary’, ‘IT Chapter Two’, ‘In The Tall Grass’, and now this movie. This is by far the best out of them all.\r\n\r\nThe runtime is 152 minutes long and I can safely say that the movie is 85% it’s own thing, because it doesn't just rely on nostalgia to tell their story and it’s only the last act where things start to play on nostalgia when the characters return to the Overlook Hotel. The nostalgia being the 80’s horror classic of course. It’s either that or 97 TV mini-series. Who’s got fond memories for that piece of sh*t? So with this being both a sequel to Kubrick's movie and King’s original novel; a clash of visions coming together with Flanagan trying to put this together, while also applying his own vision into the mix.\r\n\r\nNow that’s hard.\r\n\r\nThe part that got me invested in the story was the scene between Danny and a elderly patient who’s on their death bed. Danny comforts them as their peacefully past away, without dying alone. It’s a beautiful and heartfelt scene that you would never expect to see in a supernatural horror movie.\r\n\r\nEwan Mcgregor was fantastic as an alcoholic grown-up Danny Torrance. Nicholson's presence was felt through out the movie as adult Danny fears he might follow in his fathers footsteps. There’s a scene where Danny gives a talk at a rehab group and as doing so he reflects deeply on everything that happened to him in the past, while the camera is locked on Ewan’s face. Not only from his childhood, but everything afterwards and drowning out the trauma through drinking - something that us as the audience don’t see. I thought he was excellent. He absolutely “shines” as the character...and am not sorry for that pun.\r\n\r\nI loved how fleshed out the villains were, which surprised me the most about the movie. They are like vampires, but instead of feasting on blood, it’s “the shining” they crave for a expanded life. Casual and charming, and yet wickedly evil. There’s a particularly scene that was so difficult to watch and really got under my skin. However you do get to see them interreacting with each other in normal conversations as they casually go on with the day and work as a group. Rose the Hat sticks out from the rest as a sinister and endearing villian played marvelously by Rebecca Ferguson.\r\n\r\nMike Flanagan dose a great job on balancing both Kubrick’s and King’s version respectfully, but also manages to put his visual spin in. The one thing that hasn’t been mention yet is how great he is with child actors as he always gets the best performance out of them, especially Jacob Tremblay and Kyliegh Curran who was so convincing in the roles it was scary.\r\n\r\nThe movie looks stunning with the use of colors adding to the overall tone and helps creates the horror atmosphere. Same thing with the score that while it takes samples from Kubrick’s movie, but not to say it doesn’t have it’s own.\r\n\r\nFor issues:\r\n\r\nThere was a couple of callbacks that was a little on the noise, usually through references. As I said early the movie takes a while to find it’s footing and you couldn’t help but draw comparisons. There were a few questionable and almost silly lines that King himself would inject into his work for humor, but here, with tone in mind, just took the fear out of it.\r\n\r\nOverall rating: “Eat well and live long.”", "created_at": "2020-01-27T18:10:31.627Z"}, {"movie_id": 501170, "review_id": "5e4c6b142866fa00169d01b7", "author_rating": 6.0, "review_text": "Partially satisfying \"sequel\" (of sorts) to the Shining with good performances from Ewan McGregor and Kyliegh Curran (while Rebecca Ferguson kind of hams it up, but still was fun as a villainous). However, the movie is far too long with probably 15-20 minutes that could've gotten the axe (so to speak), and the plot was The Shining meets X-Men with some Monsters Inc thrown in for good measure.\r\n\r\nDidn't hate it at all, but not sure I have much desire to revisit, though I have to wonder what else they threw in there with the 3-hour long Director's Cut. **3.0/5**", "created_at": "2020-02-18T22:54:12.821Z"}, {"movie_id": 501170, "review_id": "5f2d7703596a910033fc9817", "author_rating": 9.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nI honestly wasn't excited about this one, so my expectations were low.  I didn't realize it was Stephen King, let alone a sequel to \"The Shining\" until I watched it.  I'm also not a big fan of \"The Shining\", but I haven't watched it since I learned to watch a movie critically.\r\n\r\nAfter hearing about \"shining\" from everyone, I immediately got excited when I realize that was what this movie was all about.  I've been waiting for this movie since \"Push\".  This movie is honestly what \"Star Wars: Episode I\" should have been.  This is how you give an explanation of how super powers work on a large scale: you tell a story that examples it, \"do not say\", it is how movies are supposed to work.\r\n\r\nThis was wonderfully casted: Ewan McGregor, Kyliegh Curran, and Rebecca Ferguson are amazing.  There deliveries have weight to them, and it really makes the movie.\r\n\r\nThe production value is fantastic, they definitely didn't spare a cent to make this look as good or nostalgic as it needed to be.\r\n\r\nThere are aspects of the story I think we could have done without, mostly just for time purposes, and there are portions of the story that are just gratuitously graphic, and some of those two things overlap, but I'm not going to say that any of the movie would actually be better for it.  The story, whether it be the movie or from the book, is exceedingly well paced, and powerful, every step of the way.\r\n\r\nIt has this wonderful theme of predators and prey, basically \"There's always a bigger fish\", but in a twisted, looping way.\r\n\r\nIf you can stand horror at all and like psychic powers, then definitely give this a watch.", "created_at": "2020-08-07T15:45:07.457Z"}, {"movie_id": 501170, "review_id": "63be0a1bf85958007d373ebc", "author_rating": 1.0, "review_text": "The problem here is that they made a sequel to the 1980 movie... and not a sequel to King's book.\r\n\r\nAnd, let's be honest, as good as Stanley's film was, it really had little to do with Kings novel. Almost The Shining in name only. So many changes were made, right down to the theme, that it barely resembled the book.\r\n\r\nSo, when they made the sequel to the movie, and not the novel, a lot of the elements that made the Doctor Sleep compelling, a lot of the plot points, and a lot of the twists and turns that made the novel worth reading had to be changed in order to keep continuity with Kubrick's changes.\r\n\r\nThe result is really kind of a mess. So much of what Doctor Sleep was referenced back to The Shining, the novel, that trying to adapt the script to the Kubrick film was, honestly, a mistake.\r\n\r\nIn the end, it grasps at straws and never finds a footing, making Doctor Sleep even further removed from the story it was based on than Kubrick's film was... with far less talent directing it.", "created_at": "2023-01-11T01:00:11.882Z"}]