[{"movie_id": 23629, "review_id": "589c3ebd92514124d80033db", "author_rating": null, "review_text": "I was surprised to actually like this film. Baby Doll, Sweet Pea, Rocket, Amber and Blondie are the 5 main characters in the film. As much as I like Baby Doll and her costume, I really liked Sweet Pea. Something in her was so familiar. She's the big sister who will do anything for her younger sister. That's me. \r\n\r\nI like the action scenes. Baby Doll was so sexy. I liked this movie.", "created_at": "2017-02-09T10:04:45.549Z"}, {"movie_id": 23629, "review_id": "58ac4f5dc3a36849cc0135d2", "author_rating": 3.0, "review_text": "Wow… Here I was, thinking I was going to get to see an awesome comic- like film about a group of girls kickin' a whole lotta butt surrounded by mind-bending fantasy scenery.\r\n\r\nTechnically, I was right… But only technically. Sucker Punch is like Chinese food. You can eat three plates and it will still leave you feeling hungry. It's a great deal of empty calories, is basically what I'm saying. Substance? Nah.\r\n\r\nLet me just get right into it. What's wrong with Sucker Punch is the screenplay. Not the actors, not the director, just the story. This story revolves around a group of five girls in an institution for the mentally insane, in a fantastical, steampunk-wannabe 1940's (my best guess) setting. They are treated horribly and their lives are miserable, and to cope with it all, the main protagonist Babydoll, escapes into her fantasies and in this trance-like state, devises a plan for them all to escape. \r\n\r\nThe concept is not bad. It might have even been really exciting, had it not been executed so laughably unrealistic. And by 'unrealistic', I don't mean the fantasies themselves. I'm referring to the fact that these fantasies were so obviously not dreamed up by an actual teenage girl, but rather they look like the perfect fulfillment of the wet wishes of a horny teenage boy. It is very likely that a teenage girl WOULD dream of being able to wield a samurai sword and beat up every monster, dragon and every other kind of bastard who crosses her path. She WOULD dream of coming out of every battle completely unscathed and with every hair on her pretty head still perfectly in place. She would NOT, however, be doing all of this scantily clad in sexy lingerie wearing fishnet stockings and high heels… I am a girl, with very vivid imagination. Trust me on this one. It was, in one word, ridiculous.\r\n\r\nAnother thing that really bothered me was the way these characters were worked out. As obviously miserable as their personal predicaments were, I could not relate to a single one of them. They were all completely 2- dimensional and just flat-out uninteresting. I didn't care about what happened to a single one of them. I don't believe all of the blame for this falls on the actresses (although theirs weren't exactly Oscar winning performances...), again, I chalk it up to poor screen writing. The only one who was able to make her character slightly more than moderately interesting, was not even one of 'the girls', it was Dr. Vera Gorski, played by Carla Gugino. At least she was interesting to watch, and she was even somewhat of a scene-stealer, taking much thunder away from the girls simply because she (both the actress and the character) had the biggest personality. All the others, I felt were mostly just going through the motions, because they had zero character development and no interesting dialogue to work with. And that's bad when you're talking about the characters that are supposed to carry the story. A pleasant (and much needed surprise) came in the form of Scott Glenn, who only appears in the fantasy segments as several different versions of a wise man. That was a nice touch. \r\n\r\nHowever, the one thing that really stood out for me as the true axis of failure that sums up Sucker Punch, was the feeling of total confusion that was present from the beginning and never cleared up. I'm not saying I didn't 'get it', I'm saying it was a hot, incoherent mess. And I usually don't mind being thrown back and forth and to and fro throughout a film, I don't mind playing guessing games and wondering what it will all lead to. I DO mind when the roller-coaster ride is over and all I feel is queasy. Some people have suggested that this is a really deep and complex film, but honestly, I think they're just reading too much into it. The stupid thing is, for the most part it was completely predictable, and STILL it lacked structure and decent storytelling. That may seem like a paradox, but there's an easy way to explain it. In the words of the great Roger Ebert: \"Now that's bad filmmaking.\" \r\n\r\nThe only element in Sucker Punch that was somewhat redeeming, were the visual effects. I must say, it was all very gorgeous and eye-pleasing. Also, the soundtrack was excellent, filled with very well performed covers of well-known songs and some perfectly chosen originals. Emily Browning, who plays Babydoll (and also sings a few songs on the soundtrack), was a good choice for the lead role, but I must say, in all honesty, that was mostly because she was visually very appealing as the main protagonist. More simply put – she was very pretty. Still, I'm not sure that's enough to carry a film. \r\n\r\nAll in all, I'm left feeling – Zack Snyder… Dude. What were you thinking. You can do so much better than this. I guess I just finally have to come to terms with the fact that everybody's human and is bound to make one big mistake at least once in their lives. Zack… this is yours.\r\n\r\nSucker Punch sucks.\r\n_(November 2013)_", "created_at": "2017-02-21T14:31:57.514Z"}, {"movie_id": 23629, "review_id": "5a01f6479251415718024511", "author_rating": 7.0, "review_text": "Snyder pushing buttons for polarising results.\r\n\r\nOff the bat I have to say I'm over thirty years older than what some pro critics have claimed is the demographic for this one. Sucker Punch, as reviews etc attest, is not for everyone, it has been called any number of things in derogative fashion, which since I enjoyed the film a lot means I'm a misogynist fetishist gamer, which to the best of my knowledge is not true. Lest I'm in the closet and now in middle age about to unleash traits and feelings previously untapped. Which if the latter is true you would have to say well done Zack Snyder, for that's serious film making...\r\n\r\nSucker Punch is loud, full of visual orgasms, musically adroit, exciting, clever and very sexy. Snyder has made no secret of his fetish leanings when making this piece, but it hardy constitutes a dark seedy mind at work. It can easily be argued that the film is very much pro women, the story itself - in amongst the explosive thunder of the fantastical action - is tender and beautiful, complete with emotional kickers. Perhaps it's in the eye of the beholder? But I see a strong female led action movie, with shifting fantasy realms, and cunningly it calls for deeper ponder come the finale.\r\n\r\nLove it or hate it, Snyder has pushed buttons with this exercise. Better that than another cash cow sequel or another remake, re-imaging or rebirth. 7/10", "created_at": "2017-11-07T18:07:03.039Z"}, {"movie_id": 23629, "review_id": "5fee2b455907de0040375a8d", "author_rating": 9.0, "review_text": "I for one felt this was a masterpiece; a Zack Snyder original.\r\n\r\nThe visual effects were stunning, the fight choreography was jaw dropping and the casts' performances were superb.\r\nEven the storyline itself was well written.\r\n\r\nThis is one of my favourite films.", "created_at": "2020-12-31T19:49:25.758Z"}]