[{"movie_id": 8849, "review_id": "602d73abad87f70041928a11", "author_rating": 4.0, "review_text": "Based on the 1966 film of the same name (and, in turn the 1963 stage play), 2004's _Alfie_ stars Jude Law as a British commitment-shy play boy in Manhattan.\r\n\r\nMuch like the original film, Alfie finds himself surrounded by beautiful women with a different one to jump into bed with each night. He treats both them and his friends like dirt, but doesn't care when he knows his charm can replace them.\r\n\r\nIf the original film contained a plot that would make the world blush when looked through a contemporary lens, then 2004's _Alfie_ attempts, in a way, to update that story for its modern audience.\r\n\r\nAs is typical with remakes of old British films, the location has been moved to appease its American audience but a tacit nod to the Cockney charm of _Alfie_'s original actor (Michael Caine) in the form of Jude Law.\r\n\r\nTo his credit, Jude Law does emanate charm in the same way that Caine did in 1966, mercilessly moving on from one relationship to the next without worry about consequence. However, with Alfie remaining English in New York, this has the unfortunate effect of making him stand out, and when a protagonist is clearly designed not to be likeable, then by having him contrast from the surrounding cast just alienates him further.\r\n\r\nIn addition, with the persistent nods to high fashion, Alfie isn't even relatable for most people as \"that laddish friend\" they once knew, and he comes across as both pompous and arrogant.\r\n\r\nThe story lifts large parts of the original, but seems to drop many of the subtle links between Alfie's relationships making him appear far more crass. Retained is Alfie's smoking habit, which is out of place in a modern film made all the worse by the inexplicable removal of why smoking was relevant to the original story.\r\n\r\nOverall, _Alfie_ is a complete mis-step made even more uncomfortable by the emergence of the #MeToo movement.", "created_at": "2021-02-17T19:51:07.463Z"}, {"movie_id": 8849, "review_id": "64f5637697a4e6259f1370e5", "author_rating": 5.0, "review_text": "Some films just don't need an \"update\". \"Alfie\" certainly didn't. Certainly Jude Law has a certain je ne sais quoi reprising the Michael Caine role as the womanising philanderer. His normal hump 'em and dump' em strategy is soon seriously compromised by his inability to \"perform\" and this has all sorts of ramifications on his shallow existence (relocated to New York in this version). Sienna Miller and Susan Sarandon fail to help lift this great looking but intellectually void film get going, and Law - though every inch the dapper, gorgeous, gigolo to look at - just hasn't the charm or sleaziness of Caine. It does have a decent soundtrack, but not the same with out Cilla Black...", "created_at": "2023-09-04T04:56:22.979Z"}]