[{"movie_id": 241251, "review_id": "5622f12c92514135b0000743", "author_rating": null, "review_text": "These days one can find busy singer/dancer/actress Jennifer Lopez performing her judging duties on the small screen with the longtime singing competition ‘American Idol’. However, the still radiant and curvaceous ‘JLo’ found some time to gravitate back to the big screen and revisit the overplayed ‘woman in peril’ genre with her latest generic psychological thriller in director Rob Cohen’s (‘The Fast And The Furious’) ‘The Boy Next Door’. Needlessly rehashed, rudimentary and titillating in tepidness, ‘The Boy Next Door’ is nothing more than a thin serving of the arbitrary ‘damsel-in-distress’ chick flicks that pop up and serve as throwaway conveyor belt melodramas. ‘The Boy Next Door’ will inevitably beg for obvious comparisons to ready-made Lifetime cable movies. Well, there are a decent amount of Lifetime movies that can actually give the limping ‘The Boy Next Door’ a run for its creative money.\r\n\r\nIn essence, Lopez is no stranger to these types of ‘harried heroines’ on the defense so she is quite comfortable in rollicking in the paper-thin premise of ‘The Boy Next Door’. In forgettable 2001’s ‘Angel Eyes’ and 2002’s ‘Enough’ we witness Lopez’s on-screen dilemma as the creepy men in her life are ominously drawn to her aura causing the heightened jeopardy at large. The case in ‘Boy’ is similar except that the delusional young man in question is as dreamy as he is deranged for the endangered cougar. Hey, he may be crazed but he is still cute, right ladies?\r\n\r\nThe reality is that we have seen this formula countless times before as ‘The Boy Next Door’ offers nothing fresh or feisty to the table. The teaspoon-sized tension is laughable. The run-of-the-mill steamy scenes are not even trashy enough to digest with notable suspense. Undoubtedly, ‘The Boy Next Door’ recklessly borrows from every psycho-thriller imaginable and still ends up looking bland and boorish. With all the loving-to-stalking fare out there past and present (ie ‘Fatal Attraction’, ‘The Crush’, ‘Fear’, ‘Swimfan’, ‘Disclosure’, ‘Obsessed’, etc.) the inclusion of ‘The Boy Next Door’ only clogs up the cinematic pipe in reference to this overdone genre.\r\n\r\nUnder Cohen’s pedestrian direction and screenwriter Barbara Curry’s spotty script ‘Boy’ tells the tale of an attractive middle-aged high school teacher named Claire Peterson (Lopez) whose bout with disillusionment will result in her tawdry affair with a neighboring handsome younger man in 19 year-old Noah Sandborn (Ryan Guzman from the ‘Step It Up’ movies). Before Claire falls into the arms of her youthful studmuffin she is riddled with conflict. For starters, her unfaithful husband Garrett (John Corbett, ‘My Big Fat Greek Wedding’) was banished from the house for his constant infidelities. Also, Claire’s sickly teen son Kevin (Ian Nelson) is experiencing growing pains. At this point, Claire needs a positive boost in her existence as she trudges along both in the classroom and at home, where her personal life seems to be in utter shambles.\r\n\r\nWhen the hunkish Noah arrives on the scene to assist his ailing uncle across the street from the Petersons, he makes a lasting impression on the older Claire. Noah is helpful to Claire and becomes sort of the manly mentor that her son Kevin needs to capture his adolescent confidence. Of course, Noah’s backstory is quite suspicious (such as his parents’ so-called mysterious death) but the oozing charm and good company that the older teen offers the stressed Claire is too convenient to pass up. Noah is just too good to be true and Claire has found a young man worthy of entertaining both her and Kevin.\r\n\r\nThe yummy Guzman certainly is the teacher's preferred pet to Lopez's lonely educator in the generic psycho-stalker thriller THE BOY NEXT DOOR\r\nThe yummy Guzman certainly is the teacher’s preferred pet to Lopez’s lonely educator in the generic psycho-stalker thriller THE BOY NEXT DOOR\r\nIn the aftermath of a horrible date arranged by her close friend and school vice principal Vicky Lansing (Kristin Chenoweth), Claire lets down her guard and succumbs to her sexual urge for Noah in a hasty moment of passion. Realizing that perhaps her bedtime dalliance with Noah was a mistaken indiscretion Claire informs Noah that they can no longer go on and act upon their carnal connection. This does not sit well with Noah at all. Soon, Claire will experience the psychotic wrath of her scorned young admirer whose smothering need to be with her becomes hauntingly overwhelming. The stakes are dangerously higher when the forgiven Garrett re-enters the picture in an effort to win back Claire’s broken heart.\r\n\r\nOverall, the low-budgeted ‘The Boy Next Door’ simply fills in the cheesy blanks with its amateurish jitters. Lopez’s angst-ridden Claire has all the frightened chops of a ransom hayride during a busy livestock convention. The lackluster acting by leads Lopez and Guzman are not impish or impulsive enough to care one way or the other. Corbett’s cheating hubby Garrett feels like a mere footnote in the flaccid proceedings. Chenoweth’s Vicky is offered as a minor sidekick to Lopez’s Claire and annoyingly buzzes around just to bridge the planted thrills.\r\n\r\nWith the baseless ‘Boy’ added to her film credits it appears that Jenny was never on the block.\r\n\r\nThe Boy Next Door (2015)  \r\n\r\nUniversal Pictures\r\n\r\n1 hr.  31 mins.\r\n\r\nStarring:  Jennifer Lopez, Ryan Guzman, Ian Nelson, John Corbett, Kristin Chenoweth, Lexi Atkins and Hill Harper\r\n\r\nDirected by: Rob Cohen\r\n\r\nRated: R\r\n\r\nGenre: Psychological thriller/Romance and Suspense\r\n\r\nCritic’s rating: * ½  stars (out of four stars)", "created_at": "2015-10-18T01:09:00.870Z"}]