[{"movie_id": 4836, "review_id": "553ea0e99251416874008083", "author_rating": 9.0, "review_text": "I'm not a gangster, just a businessman. And my commodity happens to be cocaine.\r\n\r\nWith a considerable amount of cash saved from his, ahem, dealings. A London drug dealer is all set to retire abroad and start a new life. However his mob boss Jimmy Price has two jobs for him to do immediately...\r\n\r\nLayer Cake is directed by Matthew Vaughn. Vaughn is more well known as Guy Ritchie's producer on his early British gangster genre forays. Suffice to say he had some insight into what made those films {Snatch et al} hugely popular with the watching British public. How pleasing it is then to say that Vaughn, by showing restraint and an unfussy approach, has crafted a film that's more than equal to the best of Britain gangster faves, and actually sets new parameters for toning a film. By focusing more on mood and atmosphere over bombastic scenarios, Vaughn, aided by a superlative Daniel Craig as the nameless dealer, lifts the film above its conventional plot arc. In what could have been a standard tale of a man doing one last job before going straight, we, along with Craig, find that all roads are blocked, it's as if there is some higher force at work here.\r\n\r\nLayer Cake also scores high for its more easy on the eye filming of London, this is no destitute capital where tower blocks loom like monsters over the characters. This London is thriving, vim and vitality, the place to be, seediness is far from the ebullient crowd. Ben Davis' photography perfectly complimenting the engrossing score from Lisa Gerrard & Ilan Eshkeri, both of which serve to make London an extra character in the story. The film however is not perfect, at 105 minutes it's actually too short, something that only becomes apparent when all the plot strands come crashing together in a rushed last quarter. Yet in spite of that failing, the ending delivers a jolt to the system, to crown, what to me at least, is one of Britain's finest and tidiest gangster offerings. 9/10", "created_at": "2015-04-27T20:49:45.859Z"}]