[{"movie_id": 308531, "review_id": "58013c31c3a36848e6000b4c", "author_rating": 8.0, "review_text": "**They are back with even more stimulated to fight the crime.**\r\n\r\nAnother great addition to the franchise, I completely enjoyed. The first thing is the pace, it was so fast, from opening to the end, non-stop actions and comedies. I regret that I was not able to watch this in digital 3D, other than that, this is a wonderful film for TMNT fans. I know, some people downgrading it, but don't believe them, it is just a fine film if not an awesome as I'm praising, particularly keeping in my mind the common people. So watch this for entertainment and it will deliver for sure.\r\n\r\nThere are some flaws, but I did not care about them, because it was not a documentary film or even a sci-fi film, it's just a fun-action film. So everything was aimed to bring laughs and it did successfully. If you go with science, then this is a nonsense film. Anyway, the vfx was very impressive, the CGI characters looked even better than the previous one. Don't compare it with the DC or Marvel's films, it is setting up its own trend. Like those new additions, Rhino and Warthog characters were seems more like reading a comic book, straight outta from the sketches.\r\n\r\nExcellent follow-up and expecting another sequel in the next two years. The director of 'Earth to Echo' did a great job, and also all the actors. Little disappointed was the villain. I expected some strong confrontation between the heroes and the bad guys which was a let down. Though, all the stunt sequences were well designed. Those clichés like a mad scientist, alien invasion, hole in the sky et cetera, did not stop me from having a good time. Surely I would watch it one more time, just for entertainment, that's what this film is good at. I suggest you as well to watch it if you're seeking the same.\r\n\r\n_8/10_", "created_at": "2016-10-14T20:12:33.544Z"}, {"movie_id": 308531, "review_id": "586913139251414e7800c584", "author_rating": 5.0, "review_text": "I cannot say that I had high hopes for this movie. It was a must buy for my collection since I had the first movie already and the kids wanted to see it anyway so yesterday when the kids where at my place we sat down to watch it.\r\n\r\nIt is definitely a movie for the younger audience. My two youngest kids had quite a few laughs while watching it and there was one ore two that entertained even me.\r\n\r\nOtherwise this movie is a rather messy concoction of loads and loads of CGI, action, stunts, cheesy comments and silly acting. It borders on being a slapstick movie. It is rather unbelievable but Megan Fox was the one of the main actors that did the most serious performance in the movie.\r\n\r\nThe enjoyment of this movie is pretty much the CGI action, ludicrous stunts, primarily by the turtles, plenty of explosions and gadgets. The turtles garbage truck was rather fun for example. Silly but fun.\r\n\r\nAs an adult be prepared to leave you brain in idle and try to enjoy the cinematic magic that went into this movie. Then you might find it slightly enjoyable or at least not a total waste of time.", "created_at": "2017-01-01T14:32:51.857Z"}, {"movie_id": 308531, "review_id": "58d2acf6c3a3681289000dd2", "author_rating": null, "review_text": "*** This review may contain spoilers ***\r\n\r\nI was indifferent to the first TMNT movie. It was okay; it could have been better. It could have also been far worse.\r\n\r\nSo, there was some apprehension going into TMNT: Out of the Shadows, because, traditionally, sequels were worse than their parent films.\r\n\r\nWell, Turtles wasn't. The second film is actually much better than the first. It still has hard- to-digest action sequences right out of Michael Bay's wet dreams, but this one also had some heart. It had a theme. \r\n\r\nBeing a teenager is difficult enough without, one, having to shoulder the burden of saving the city from an evil ninja, and, two, being forced to hide from the very society they are protecting. The TMNT concept practically begs to touch on things like teen angst, and the feeling of being an outcast that almost all teens feel at some point. But, because they're mutant turtles, this would of course be magnified 10 times. \r\n\r\nBut the franchise, in its various incarnations, hardly addresses this. But the new Turtle film does. It appeals to the sensibilities of people who recall the awkwardness of being a teenager. This movie actually says something.\r\n\r\nThere are some flaws, however. Shredder and Krang meet for the first time, Krang proposes an alliance, Shredder accepts. At no point does Shredder flip out while a talking brain rambles on about his plans for world domination. At no point does Shredder question Krang. He is a banished evil warlord. Why would Shredder trust him?\r\n\r\nMegan Fox, unfortunately, is still a thing.\r\n\r\nWould have been nice to have Casey Jones truer to his original character.\r\n\r\nBut where the film works is in the script, and, particularly, the scenes with the Turtles, sans their human friends.\r\n\r\nAnd then there's Rocksteady and Bebop. We 80's kids have been waiting 26 years to have them on screen, and, when it finally happens, it doesn't disappoint. There's an interesting dynamic at play with them: While the Turtles yearn for acceptance and to be human, Rocksteady and Bebop, former humans, are happy to be monsters.\r\n\r\nI guess the ooze is always on greener on the other side.\r\n\r\nBut a pretty good Turtle movie overall, and a lot of fun.", "created_at": "2017-03-22T16:57:26.323Z"}, {"movie_id": 308531, "review_id": "5ff915cdbbcae0003eae3d31", "author_rating": 5.0, "review_text": "Kinda better than the first film, though by the end it basically levels out as a draw between the two. Too mundane once more.\r\n\r\n<em>'Teenage Mutant Ninja Turtles: Out of the Shadows'</em> does improve a few things, one being the score - not that it's great or anything, but it's more pleasant than Brian Tyler's attempt. Overall it's a little more watchable, but what affects this most is the messy ending - especially with the CGI, which looks like a video game.\r\n\r\nCast-wise it's largely the same, though Johnny Knoxville is dropped - not that I noticed until the credits, mind. Can't say I'll remember any of the cast's performances, just like in the 2014 production.\r\n\r\nI guess it's a positive that this didn't completely crap the bed, as sequels sometimes do - especially ones that follow poor originals. Still, this isn't good at all - and, unsurprisingly, killed the would-be franchise early on.", "created_at": "2021-01-09T02:32:45.144Z"}]