[{"movie_id": 73567, "review_id": "5898598fc3a36877120077dd", "author_rating": 5.0, "review_text": "On the one hand, Killer Joe does get better as it progresses, but on the other, it's also the first Friedkin movie I haven't loved.\r\n\r\nFinal rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole.", "created_at": "2017-02-06T11:10:07.018Z"}, {"movie_id": 73567, "review_id": "5c5baee49251413381b968a9", "author_rating": 9.0, "review_text": "William Friedkin serves up Trailer Trash Neo-Noir with a side order of Fried Chicken. \r\n\r\nKiller Joe is directed by William Friedkin and adapted to screenplay by Tracy Letts from his own play of the same name. It stars Matthew McConaughey, Emile Hirsch, Juno Temple, Thomas Haden Church and Gina Gershon. Music is scored by Tyler Bates and cinematography by Caleb Deschanel. Plot finds Hirsch as Chris Smith, who because he is in severe debt to local thugs, hatches a plan to bump off his waster of a mother and claim the life insurance. Roping in the rest of his trailer dwelling family, he hires Killer Joe (McConaughey), a cop with a sideline in murder, but the Smith's have no idea just what price they will have to pay for his services.\r\n\r\nSo pulpy, so amusingly dark, Killer Joe is one of those films that will sit at the top of many film fan's best of lists for 2012. Yet if someone came up to me and declared it one of the worst then I certainly will understand. Undeniably it has no widespread appeal, you either get it or you don't, you will either laugh along with Friedkin and his dark observations or you will feel the whole thing is just too ugly to be entertainment. Man it's good to have Friedkin back pushing peoples buttons!\r\n\r\nFilmed in Texas in under three weeks, Killer Joe is a film that walks the fine line of misogyny and perversity for perversity's sake. But it never falls over that mark, even though these are scummy characters living in a scummy world, where there's sex and violence, and violent simulated sex and nudity; all of which is cloaked by a sweaty crime gone wrong caper. Much of the film is dialogue driven, rest assured this is very talky, but the director wrings out much tension and salaciousness from every character interaction, the slow-burn approach only heightening the sense of dread. When the finale comes, and it's a cracker-jack ending, there's an almost merciful release that it's all over. These are people you wouldn't want to hang out with ever, only there's Friedkin chuckling away to himself having made us spend an hour and forty minutes with this grime laden crew. If you feel like you need a bath afterwards, that's perfectly natural.\r\n\r\nFriedkin has garnered terrific performances from a top line cast. Hirsch (powder-keg), Church (naievity extraordinaire), Temple (virginal piggy in the middle) and Gershon (bold and suspicious), are all giving disturbing credibility to the material, but as good as they are they are trumped considerably by McConaughey. One of the most frustrating actors working today, much like Cage, a ream of poor movies adorn his CV, but once in a while he throws in a performance of such genuine quality that it begs to be acknowledged by his peers. Here as Killer Joe he lays on a Faust like menace, delivering his lines with clinically calm precision, yet still there's a glint in his eye, we know a black heart beats there but he can charm a snake out of its basket, a girl out of her underwear...\r\n\r\nUnflinching direction, bravura performances and neo-noir at its near best, one of the best films of 2012 so far. Well, to some of us at least.... 9/10", "created_at": "2019-02-07T04:07:00.203Z"}, {"movie_id": 73567, "review_id": "6388fa8d9512e100c16e0370", "author_rating": 7.0, "review_text": "_Killer Joe_ had the making to be a genuinely great film, but the quality control in the writing room limits the results.\r\n\r\nSo much of the story works for me on a thematic and plot progression basis. I enjoyed the premise and the stakes that this movie provides, but writer Tracy Letts wrote this like it was some subversive wet dream of his as a teenager.\r\n\r\nThis movie is vial, there is so much unnecessary nudity from creepy changing room shots to women's genitals being presented in full view, to soft-core pornography in the climax of the movie. I understand that this movie is supposed to have no redeeming characters, but the graphicness takes away from the scene more than adds to them. It is very reminiscent of my complaint about Rob Zombie films.\r\n\r\nWith that being said, the performances here are incredible. Matthew McConaughey is amazing. McConaughey is cold, calculated, and downright terrifying in almost every scene he is in. The final twenty minutes of this film are spectacular. His discovery and reveal gave me goosebumps. I loved it. Thomas Haden Church is pretty great too, he is so stupid and pointless that he adds a bit of humor in intense scenes that makes the viewer guilty for laughing. Everyone else was okay, they filled their roles well but did not necessarily impress me.\r\n\r\nDespite my complaints, I enjoyed this film. It was an intense and thrilling experience that kept me on my toes till the credits rolled. I still think that the graphic nature and vulgarness take away from what could have been.\r\n\r\n**Score:** _67%_ | \r\n**Verdict:** _Good_", "created_at": "2022-12-01T19:03:41.172Z"}]