[{"movie_id": 435, "review_id": "5cfede8b0e0a263f96c9ac0f", "author_rating": 5.0, "review_text": "It threatened and promised to be a  politically (wooly) mammoth disaster picture.\r\n\r\nJack Hall is certain that another ice age is imminent due to the effects of global warming, but the government just will not listen to him. Sure enough the climate changes and the world is at threat from perilous frozen weather, worse still for Jack is that his son is trapped in New York City!\r\n\r\nRoland Emmerich was the perfect choice to direct this particular piece. There is no denying that he has no little panache when it comes to destroying and blowing things up, think Independence Day, Stargate, Universal Soldier and Godzilla. What runs true through an Emmerich picture is that he is great on the CGI money shots and knows how to whet an appetite for destruction. Sadly, what is also true is that his second halves rarely deliver on their promise, so shall it be with The Day After Tomorrow. Even allowing for the expected mawkishness that comes with disaster/survival pictures, this picture relies too much on its contrivances, thus completely losing sight of its eco-conscious heart, something that I'm sure the politically aware Emmerich set out to deliver at the start.\r\n\r\nPacking his picture with solid and professional performers (led by the always watchable Dennis Quaid as Jack Hall), Emmerich is all too aware that his money shots are what the popcorn masses have chiefly paid to see. Tornados, floods and the subsequent freeze are all excellent moments in the piece, but now, some years later the film has to be called out for being the shallow showcase that it is, in fact the CGI looks unintentionally artificial. It's a missed opportunity to make a blockbuster with an intelligent heart, and sadly Emmerich, either through boredom or ignorance? failed to seal the deal and craft one of the better genre entries.\r\n\r\nJust about average for the destruction sequences, but very little else to recommend here I'm afraid. 5/10", "created_at": "2019-06-10T22:49:47.965Z"}, {"movie_id": 435, "review_id": "5f4a5f25cca7de003456ecfe", "author_rating": 10.0, "review_text": "I gather that climate deniers hate films like this. I would be sad if my political or social stances Completely prevented me from being able to appreciate films that stretch credulity the opposite way from my own views. I mean, I am an ardent atheist and have enjoyed religious films. I am all for science, but science fiction can take a few liberties and shortcuts and if I like it, I will suspend my disbelief. But many people automatically hate what they disagree with.\r\n\r\nAnyway, I really enjoyed this movie, as I like extreme weather and other disaster special effects in films. I didn't feel insulted by the perceived intelligence of the plot and dialogue as others seemed to be. I don't watch feature films for the latest information on climate change: the news and documentaries are around for that. The special effects were good enough and - okay — scenes like the quick freezing dropping from the atmosphere is probably total hokey, but it serves the rapid pace of the plot. The idea of what happens with Mexico at the end seems a little heavy handed politically, but I don’t have delicate sensibilities in the political arena, so fine. Yada yada yada: Just entertain me. This one does.", "created_at": "2020-08-29T13:59:01.774Z"}, {"movie_id": 435, "review_id": "63cc4f6e6d97e6008c250e8e", "author_rating": 6.0, "review_text": "**The Day After Tomorrow ends the world better than most natural disaster films, with an experienced disaster director and a grounded premise.**\r\n\r\nRoland Emmerich, the master of disaster, created one of the quintessential apocalyptic natural disaster films with The Day After Tomorrow. Floods, tsunamis, hail, suddenly dropping temperatures, and more all make their way into the perils of this film. The movie follows Dennis Quaid's climatologist as he warns the world of a quickly returning ice age. Once the global freeze catches humanity unprepared, survivors struggle against the impossible temperatures to find shelter and hope. The film sets itself apart with its cinematography featuring the expansive frozen wastelands and iconic monuments captured in ice. Performances are solid with a cast like Quaid, Gyllenhaal, and Rossum. The story is simple, which works for a disaster survival flick. The Day After Tomorrow is special compared to other big-budget catastrophe events because it is a little more grounded compared to some of the more outrageous films of Emmerich's more recent filmography, like Moonfall or 2012 but still benefits from a director that excels at destroying historic landmarks on the big screen.", "created_at": "2023-01-21T20:47:42.399Z"}, {"movie_id": 435, "review_id": "64f568733d43e000acfe32f0", "author_rating": 6.0, "review_text": "\"Jack Hall\" (Dennis Quaid) is the somewhat discredited scientist who warns of impending disaster when the mother of all ice storms gathers - reducing temperatures to well below freezing and causing huge tsunami waves and heavy snows to devastate civilisation. Adding to the poor man's woes is his son \"Sam\" (Jake Gyllenhaal) stranded in New York. It's a bit heavy on the CGI and, certainly, the plot is pretty well worn and far-fetched but it's a disaster movie so I wasn't really expecting Pulitzer prize winning stuff. The young Gyllenhaal is easy enough on the eye and his adventures are marginally more interesting than his father's perilous trek from Washington. The storyline has a certain earnestness about it that is a bit preposterous, and the concluding spiel from the US President \"Becker\" (Kenneth Welsh) is a bit naff. Luckily, it isn't in the least romantic - it's a straightforward and entertaining disaster movie that though far, far too long, is just about worth a watch...", "created_at": "2023-09-04T05:17:39.434Z"}]