[{"movie_id": 1975, "review_id": "5e206c8e0102c900133c53d5", "author_rating": 3.0, "review_text": "The Grudge 2 resents its illogical plot for basic ineffective jump scares. Shimizu’s western remake of his J-horror creation was one littered with promise, albeit irrefutably rough around the edges. Mediocre acting, snooze-inducing storytelling and jump scares aplenty. Japanese ghost children, that either croak as if exhuming a sore throat or scream like a domestic cat, popping their heads out of attics, entangling women in wavering hair and just being a general nuisance. Well, Shimizu begrudgingly brings Kayako and Toshio back for more ghoulish antics, as the fire initiated by Sarah “Buffy or Daphne, your pick...” Michelle Gellar somehow unleashed the dark spirits into the world. Essentially no longer restricted to the abandoned Saeki household, although still only haunt those that enter the house? I don’t know, the logic is tossed out of the shōji at this point.\r\n\r\nInstead of remaking the original sequel for ‘Ju-On’, Shimizu and writer Susco opted for a more original take, answering the fundamental question that we all yearned to ask: “gurl, where did you get that eye liner?”. Turns out, dark spirits is the answer. What I supremely detest about this sequel is the direction the two aforementioned crew members decide to take the story. It’s no longer about greeting death with a deep and powerful rage, cursing the location the spirits resides in. A semi-folklorish strand of Japanese traditions.\r\n\r\nInstead, to appease the simple minds of western mainstream audiences, they settled for a mundane supernatural progression that essentially tarnishes the original’s plot in almost every possible angle available. Sure, Shimizu integrates some well-intentioned imagery that may or may not produce a chill or two. Namely the photograph sequence and bludgeoning someone with a frying pan during breakfast (what a waste of bacon!). Yet these are often accompanied by a predictable jump scare that relinquishes the horror. Kayako pouncing out of a photograph. Kayako wandering the hospital corridors bursting lightbulbs in her wake (not very cost-effective...). Kayako playing footsies in a Love hotel room. Kayako being Kayako. Once or twice was enough. Twenty times? Rapidly becoming unimaginative.\r\n\r\nThe non-linear intersecting sub-plots, imitating its predecessor, provided no twists to the narrative and, if anything, forced the pacing to be inconsistent with its constant switching between character perspectives. A classic peer pressure scenario which is enough to make anyone’s eyes roll a hundred times.\r\n\r\nMagic mirror tricks, very unfashionable hoodies and an absolute waste of Buffy. The three elements that perfectly surmise the contents of this lacklustre sequel that boasts no genuine scares or tolerable execution. Again, stick to the original franchise.", "created_at": "2020-01-16T14:00:46.180Z"}]