[{"movie_id": 7972, "review_id": "5c43c2b6c3a3681a11238334", "author_rating": 9.0, "review_text": "The world is an evil place Charlie. Some of us make money off that and others get destroyed.  \r\n\r\nBefore the Devil Knows You're Dead is directed by Sidney Lumet and written by Kelly Masterson. It stars Philip Seymour Hoffman, Ethan Hawke, Marisa Tomei, Albert Finney, Rosemary Harris and Amy Ryan. Music is scored by Carter Burwell and cinematography by Ron Fortunato.\r\n\r\nTwo brothers with differing financial problems plan to rob their parents' jewellery store. But when all does not go to plan and tragedy strikes, it sends them, and those close to them, into a world of fear, shame and violence...\r\n\r\nIt opens with a raunchy sex scene, man and wife in the throes of committed passion, for these brief moments there is pleasure. Once over, though, it proves to be a false dawn, the last time anyone on screen will taste pleasure in Lumet's biting morality tale. From here on in the film unfolds in a dizzying array of multi-perspectives and over lapping of narrative structure, a three pronged assault on the senses as a family implodes in a haze of greed, lies and inadequacies. A botched robbery underpins the plotting, the aftermath of which is what is most cutting, we zip around learning the wherewithal and whys of the key players, learning exactly what we need to know to fully immerse in this bleak world. This is a world populated by love cheats, drug abuse, embezzling, bad parenting and blackmail, a world where the brothers Hanson (Hoffman & Hawke) now dwell, either ill equipped (Hawke's Hank) or stuck between idiocy and smug evil (Hoffman's Andy). Their folly, their greed, impacting with a juddering severity on the family circle.\r\n\r\nMy life, it doesn't add up. Nothing connects to anything else. I'm not the sum of my parts. All my parts don't add up to one...me.\r\n\r\nIt would be Lumet's last film (he passed away in 2011), thankfully it is a fitting final offering from the talented Philadelphian. He's aided considerably, mind, by a razor sharp script from debut screenplay writer Masterton. It's full of nastiness and tension, but still observational as a family tragedy, with major bonus' being that it never resorts to stereotypes or cops out come the crushing denouement. Where Lumet excels is in drawing near faultless performances from his cast. Youthful and downtrodden haplessness portrayed by Hawke, Hoffman's powerhouse manipulator with emotional issues, Tomei proving that over 40 is still sexy while dialling into a very touching performance. Finney, a cracker-jack of grief from the wily old fox, Ryan's hard edged ex-wife and Michael Shannon strolling into the picture late in the day exuding notable menace. All splendidly guided by the great director who asks them to portray characters convincing in going deeper for motivations and means.\r\n\r\nBleak, brutal and near brilliant across the board. 9/10", "created_at": "2019-01-20T00:37:10.817Z"}]