[{"movie_id": 524369, "review_id": "631c24430bb0760092860181", "author_rating": 1.0, "review_text": "The Many Saints of Newark is The Sopranos meets The Godfather Part II, and the result is so much less than the sum of its parts. Do we really need to know that Tony Soprano was once a chubby brat? \r\n\r\nMoreover, do we really want to know that that chubby brat grew up to be Michael Gandolfini? Michael would certainly be a chip off the old block, if his father had been Oswald Cobblepot instead of Jim Gandolfini.\r\n\r\nThis is truly a case of the apple falling a million miles away from the tree, but then pretty much everyone here falls short of the original actors/characters (I was never really a fan of the TV show, and even I would rather watch that instead).\r\n\r\nLivia, Junior, Janice, Paulie Walnuts, Silvio Dante, Big Pussy; Soprano diehards will recognize all of these and several other names , but not much else. The only connection to the HBO series is Michael Imperioli, and even then it's just his voice used as little more than en excuse for some lame retrospective dramatic irony.\r\n\r\nWhen he sees Tony for the first time, baby Christopher starts crying his eyes out; someone takes the opportunity to randomly comment that “Some babies, when they come into the world, know all kinds of things from the other side”. So baby Chris could somehow sense that uncle Tony was going to eventually murder him in cold blood? And if so, a fat lot of good that prescience did him. \r\n\r\nAs for the audience, we (even casual viewers like myself) remember very well that Tony Soprano strangled Christopher Moltisanti (which means 'many saints', hence the title of the film), because it’s practically the first thing that Imperioli tells us in the opening narration (to paraphrase Borges, saying something too much is almost as bad as not saying it). \r\n\r\nWriters David Chase and Lawrence Konner and director Alan Taylor even manage to ruin the only good thing about this piece of crap movie; i.e., the late, great Ray Liotta, who must have been paid very good money — and completely deserved it for appearing in this debacle — because the filmmakers kill off his character half an hour into the movie, just to introduce his identical twin (and I mean identical to a T; how many pairs of twins are still getting exactly the same haircuts in their late 60s?). \r\n\r\nSomeone at New Line must have thought that Liotta was overpaid and demanded that the actor pulled double duty; how else to explain this farcical turn of events?", "created_at": "2022-09-10T05:44:35.169Z"}]