[{"movie_id": 583406, "review_id": "6019b0c8a5743d00428a0c4b", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nJudas and the Black Messiah was a last-minute addition to this year’s Sundance, which basically changed every list about the most anticipated films of the festival, including my own. The buzz surrounding its Oscar chances, the remarkable cast, and mainly its important narrative based on true events were more than enough reasons to generate an undeniably powerful hype. When I watch movies inspired by real people and/or true stories, I want them to teach me about the historical moment they’re depicting. I want to finish my viewing sessions and know more than what I did at its beginning. I want the film to be enlightening, thought-provoking, and, most of all, impactful.\r\n\r\nI’m just a young white man living in Portugal with no previous knowledge of who Fred Hampton was or what he did. The closest I got to learning something about him was during last year’s The Trial of the Chicago 7, but that movie wasn’t even focused on the Black Panther Party, let alone one of his most important revolutionaries. My voice is far from being meaningful in regards to this film, and I will share Black critics’ articles that I find to be worthy of investing your time in reading. However, I do have an opinion about this movie, and I’m in my right to share it. I find Shaka King’s flick to have all of the qualities I mentioned above and much more. One of the best films of the festival, and I’m not risking it by writing it will end up as one of my favorite movies of the year.\r\n\r\nIn all honesty, I found myself struggling to completely understand Fred Hampton's intent during the first half or so. His goals are clear and can be summed up in simply trying to offer everyone a better life, one that was fair and where everyone was treated equally. My issue wasn't in his motivations or beliefs, but on the violent, murderous path that Hampton was *apparently* inciting people to take - I repeat, I didn't know a single thing about the real story nor Hampton himself. However, Daniel Kaluuya's very first words as the character stuck with me until now - \"We're not gonna fight fire with fire, we're gonna fight it with water. We're not gonna fight racism with racism. We're gonna fight it with solidarity. We're not gonna fight capitalism with Black capitalism. We're gonna fight it with socialism\" - and he kept developing this idea, which I find incredibly timely.\r\n\r\nThe scene that ultimately cleared my perception of Hampton's ideas was when William O'Neal takes the latter's most famous speech at the end of the second act in its most literal sense, which leaves Hampton baffled and shocked at O'Neal's interpretation of his words. Hampton's reaction, as well as a more emotional moment with the mother of his child, Deborah Johnson (Dominique Fishback), was the click I needed to fully comprehend the revolutionary's desires. This is one of the best compliments I can offer Shaka King and Will Berson's exquisite, detailed screenplay. It doesn't make Hampton a flawless superhero that never makes mistakes but instead depicts him as a human being who fought for everyone's rights. The latter is closer to being a Messiah than the former.\r\n\r\nThe intricate narrative might feel a bit too heavy for some viewers, but it packs extraordinarily energetic, inspirational, chill-inducing speeches that I won't forget that soon. Both Hampton and O'Neal raise sensitive themes that will definitely leave the audience thinking and discussing them throughout the year. Despite it being the longest film of the festival, its two-hour runtime feels adequate and well-paced. In addition to this, the terrific, \"in your face\" cinematography (Sean Bobbitt) focuses on the actors' performances, not giving a chance to the viewers to be distracted with anything else besides the characters' words. The emotional investment in the characters elevates the well-edited (Kristan Sprague) shooting sequences that left me on the edge of my seat (couch), which ultimately serves as a huge praise to the movie's writing.\r\n\r\nI left the cast for last. Now, I know 2021 just started, but if Daniel Kaluuya isn't nominated in every single awards show for the respective Best Supporting Actor category, I'll riot. I've yet to witness a less-than-great display from this unbelievably talented actor. Kaluuya is exceptionally captivating from the very first time he shows up on-screen and never drops his level. Lakeith Stanfield is also brilliant as a conflicted William O'Neal, delivering an extremely complex portrayal of someone who has to deal with actions he knows are wrong. Dominique Fishback and Jesse Plemons (Roy Mitchell, an FBI agent) also deserve a shoutout.\r\n\r\nJudas and the Black Messiah deserves all the hype it’s been getting and some more. Shaka King and Will Berson deliver a film inspired by true events with all the qualities this type of movie needs: enlightening, inspirational, thought-provoking, and tremendously impactful. Boasting what I’m sure will end up as one of the year’s best performances (Daniel Kaluuya), the story of Fred Hampton and William O’Neal is told through an incredibly captivating narrative, filled to the brim with absolutely epic, riveting, chill-inducing speeches and dialogues that will leave no viewer indifferent. Both characters bring timely themes back to the spotlight, hopefully generating a critical discourse regarding freedom, human rights, and equality. Besides Kaluuya, Lakeith Stanfield deserves massive praise, and I can’t forget about the lingering, character-driven cinematography that elevates every single scene. Final shoutout to Mark Isham and Craig Harris’s unforgettable, addictive score that plays a significant role in the narrative.\r\n\r\nRating: A", "created_at": "2021-02-02T20:06:32.797Z"}, {"movie_id": 583406, "review_id": "6019c63aa76ac5003d53ad94", "author_rating": null, "review_text": "Racism has all too often reared its ugly head in recent years with the rise of extremist groups who felt emboldened by recent political climates. As violence leads to protests which can themselves become violent; the perpetual cycle seems unending.\r\n\r\nIn the new film “Judas and the Black Messiah”, audiences are told the real-life story of Fred Hampton (Daniel Kaluuya) who runs a local chapter of The Black Panthers in Illinois in the 1960s.\r\n\r\nThe rise of what is perceived as militant groups in the wake of the killings of Malcolm X and Dr. Martin Luther King has caused increased police and Federal actions which have caused many in Hampton’s community to feel they are at war with the authorities and fighting for their very survival against a system of injustice and systemic racism.\r\n\r\nWhen car thief William O’Neal is arrested, FBI agent Roy Mitchell (Jesse Plemons); offers O’Neal a chance to avoid prison and earn some money by becoming an informant. Despite his reservations; O’Neal works his way into Hampton’s inner circle and develops a friendship with the man as he learns of his plans to unify the various factions in their communities.\r\n\r\nO’Neal sees how there is more to the Black Panthers as they feed, educate, and assist members of their community and work to contain more extreme elements that look to make statements through bombings and extreme actions.\r\n\r\nThe threat posed by Hampton draws the attention of FBI Director J Edgar Hoover (Martin Sheen), and plans are developed to take down Hampton and his organization which in turn puts even more pressure on Mitchell and O’Neal.\r\n\r\nThe movie is a gripping, disturbing, and sure to be controversial look into the lives of the key figures as well as the ongoing debates on racial injustice, police violence, hate groups, and violence in the community.\r\n\r\nDirector Shaka King attempts to find a balance in the film as there are moments where party members draw their weapons against the police and kill wounded officers. There are also numerous scenes where police beat and shoot unarmed individuals or use excessive force which underscores Hampton’s stance that his community is at war and this is a life or death struggle.\r\n\r\nThe last time I was so disturbed by a film of this genre was “Detroit” which shocked me with the horrific true crimes that were portrayed and how those involved escaped justice. I thought if as a Caucasian I could be so disturbed and disgusted by the terrifying events portrayed in the film; then they would be truly the stuff of nightmares for people of color.\r\n\r\nThe cast is very strong and gives memorable performances that show the complexity of their characters. They are not simply a militant and a snitch, but rather complex individuals trying to survive.\r\n\r\n“Judas and the Black Messiah” is a very well-crafted film that is equally informative and disturbing and does what good cinema does best; educate, entertain, and inform.\r\n\r\n4.5 stars out of 5", "created_at": "2021-02-02T21:38:02.068Z"}, {"movie_id": 583406, "review_id": "602e4995c3bffe003f358417", "author_rating": 9.0, "review_text": "'Judas and the Black Messiah' (a bloody brilliant title that took a while for me to figure out) is a true powerhouse of a film - not just because it echoes the current climate and the Black Lives Matter movement, but for its standout performances from Lakeith Stanfield and Daniel Kaluuya and its fantastic direction from Shaka King.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-judas-and-the-black-messiah-revolutionary-true-story-of-the-black-panther-party-in-the-1960s", "created_at": "2021-02-18T11:03:49.733Z"}, {"movie_id": 583406, "review_id": "60479536c8a5ac004573a5de", "author_rating": 5.0, "review_text": "It’s a bummer when a film has an important historical story to tell but the finished product just isn’t very good. Such is the case with “Judas and the Black Messiah,” director Shaka King‘s take on the true story of charismatic Black Panther Party leader Fred Hampton (Daniel Kaluuya) and FBI informant William O’Neal (LaKeith Stanfield), the man who infiltrated the African-American organization in Illinois in the late 1960s. It’s an interesting account of true events about two very important figures in our nation’s history, and the racial justice issues are just as relevant today. But topical material doesn’t always result in an award-worthy (or entertaining) movie.\r\n\r\nThere are plenty of things to appreciate about the film’s execution, including King’s confident directorial style and the knockout lead performances from Kaluuya and Stanfield. Kaluuya has massive shoes to fill when portraying a real life man who was filled with so much insight and wisdom, and he fully embraces Hampton’s mannerisms and speech, creating a wholly realized vision (the actor himself becomes almost unrecognizable).\r\n\r\nThe script is the weakest link, which is rare when so many of the other elements combine to create a cohesive vision. King and Will Berson‘s co-authored screenplay is too complicated, resulting in a stagnant film that takes more than an hour to hit its stride. Everything is painfully slow until then, with Berson and King taking far too long to tell the story. You can feel the admiration here, but the reverence towards their characters is so high that it impedes them from driving the story forward.\r\n\r\nThere’s a horrifying scene that tells the end of Hampton’s life story, an awful and upsetting act of injustice at the hands of law enforcement. It’s just one of the things that makes “Judas and the Black Messiah” an important narrative for current times, when so many people of color are still fighting for equality. I just wish the storytelling had been tightened a bit.", "created_at": "2021-03-09T15:33:10.265Z"}, {"movie_id": 583406, "review_id": "648da3c5c2ff3d0139ade243", "author_rating": 7.0, "review_text": "I haven't seen a dramatic movie that talks so clearly about the Black Panther Party, clearly its chief and its members are the conspiracy that was hatched by party members.\r\n\r\nThe movie talks about the rise and fall of the Black Panther movement. If you are a fan of dramatic films with a flavor of documentaries, you should watch the movie. For a period almost centuries ago, Americans with black skin suffered from obtaining their rights, and this was also forbidden to be reflected in a dramatic, dramatic or documentary film. In America on the issue of racism and addressing it, perhaps because of the demonstrations that took place in America after the killing of George Floyd by the American company and the return of racism again to the American street.\r\n\r\nThe film begins in 1969, one year after the assassination of Martin Luther King, King. This assassination changed many of the party's priorities and its goal became the overthrow of the US government by announcing the revolutionary struggle. That is why President Nixon decided during this period to eliminate the party by all possible means, legal and illegal.\r\n\r\nMany American artists sympathized with the Black Panther Party during this period. For example, the artist Jude Fonda visited the party's headquarters and declared her support for the party. Even the international star Marlin Brendo gave a speech to a large gathering of party members.\r\n\r\nJudas and the Black Messiah What is meant metaphorically by Judas in the movie is Bill O'Neal and the Black Messiah is Fred Hampton, and in general it is a projection of the story of Judas' betrayal of Christ and his handing over to the Jews.\r\n\r\nContrary to the image that we see in other films that talk about racism against blacks, the film didn't attack white people, but rather attacked certain American institutions. The movie tried to tell the story honestly without distorting history. We saw white groups join the Black Panther Party, and here the traditional form of this type of film was broken. There is no real conflict between whites and blacks.\r\n\r\nThere are a lot of revolutionary poetry and social justice, but the script was formulated correctly. The movie did not make us feel like a show movie, but rather it was a logical narration without adding spices. The story was told through the villain or the hero, and this added a new dimension to the movie. The film's director, Shaka King, performed a classy tribute to black women through the character of Deborah Johnson, and we saw how women help the men of the party in thought, knowledge, and armed struggle.\r\n\r\nThe performance of the actors in general was remarkable and worthy of appreciation, and there was a very beautiful harmony between the characters. Daniel Kaluuya performed the character of Fred Hampton with utmost brilliance and deserved the Golden Globe Award well deserved, as well as the wonderful performance of LaKeith Stanfield, which showed the contradictions of the traitor Bill O'Neal.\r\n\r\nThe characters I was most impressed with are Bill O'Neal, his looks are full of fear, anxiety, and a sense of shame, especially since Fred Hampton does not know his betrayal. Really It is one of the most successful movies in 2021", "created_at": "2023-06-17T12:15:01.308Z"}, {"movie_id": 583406, "review_id": "6019b0c8a5743d00428a0c4b", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nJudas and the Black Messiah was a last-minute addition to this year’s Sundance, which basically changed every list about the most anticipated films of the festival, including my own. The buzz surrounding its Oscar chances, the remarkable cast, and mainly its important narrative based on true events were more than enough reasons to generate an undeniably powerful hype. When I watch movies inspired by real people and/or true stories, I want them to teach me about the historical moment they’re depicting. I want to finish my viewing sessions and know more than what I did at its beginning. I want the film to be enlightening, thought-provoking, and, most of all, impactful.\r\n\r\nI’m just a young white man living in Portugal with no previous knowledge of who Fred Hampton was or what he did. The closest I got to learning something about him was during last year’s The Trial of the Chicago 7, but that movie wasn’t even focused on the Black Panther Party, let alone one of his most important revolutionaries. My voice is far from being meaningful in regards to this film, and I will share Black critics’ articles that I find to be worthy of investing your time in reading. However, I do have an opinion about this movie, and I’m in my right to share it. I find Shaka King’s flick to have all of the qualities I mentioned above and much more. One of the best films of the festival, and I’m not risking it by writing it will end up as one of my favorite movies of the year.\r\n\r\nIn all honesty, I found myself struggling to completely understand Fred Hampton's intent during the first half or so. His goals are clear and can be summed up in simply trying to offer everyone a better life, one that was fair and where everyone was treated equally. My issue wasn't in his motivations or beliefs, but on the violent, murderous path that Hampton was *apparently* inciting people to take - I repeat, I didn't know a single thing about the real story nor Hampton himself. However, Daniel Kaluuya's very first words as the character stuck with me until now - \"We're not gonna fight fire with fire, we're gonna fight it with water. We're not gonna fight racism with racism. We're gonna fight it with solidarity. We're not gonna fight capitalism with Black capitalism. We're gonna fight it with socialism\" - and he kept developing this idea, which I find incredibly timely.\r\n\r\nThe scene that ultimately cleared my perception of Hampton's ideas was when William O'Neal takes the latter's most famous speech at the end of the second act in its most literal sense, which leaves Hampton baffled and shocked at O'Neal's interpretation of his words. Hampton's reaction, as well as a more emotional moment with the mother of his child, Deborah Johnson (Dominique Fishback), was the click I needed to fully comprehend the revolutionary's desires. This is one of the best compliments I can offer Shaka King and Will Berson's exquisite, detailed screenplay. It doesn't make Hampton a flawless superhero that never makes mistakes but instead depicts him as a human being who fought for everyone's rights. The latter is closer to being a Messiah than the former.\r\n\r\nThe intricate narrative might feel a bit too heavy for some viewers, but it packs extraordinarily energetic, inspirational, chill-inducing speeches that I won't forget that soon. Both Hampton and O'Neal raise sensitive themes that will definitely leave the audience thinking and discussing them throughout the year. Despite it being the longest film of the festival, its two-hour runtime feels adequate and well-paced. In addition to this, the terrific, \"in your face\" cinematography (Sean Bobbitt) focuses on the actors' performances, not giving a chance to the viewers to be distracted with anything else besides the characters' words. The emotional investment in the characters elevates the well-edited (Kristan Sprague) shooting sequences that left me on the edge of my seat (couch), which ultimately serves as a huge praise to the movie's writing.\r\n\r\nI left the cast for last. Now, I know 2021 just started, but if Daniel Kaluuya isn't nominated in every single awards show for the respective Best Supporting Actor category, I'll riot. I've yet to witness a less-than-great display from this unbelievably talented actor. Kaluuya is exceptionally captivating from the very first time he shows up on-screen and never drops his level. Lakeith Stanfield is also brilliant as a conflicted William O'Neal, delivering an extremely complex portrayal of someone who has to deal with actions he knows are wrong. Dominique Fishback and Jesse Plemons (Roy Mitchell, an FBI agent) also deserve a shoutout.\r\n\r\nJudas and the Black Messiah deserves all the hype it’s been getting and some more. Shaka King and Will Berson deliver a film inspired by true events with all the qualities this type of movie needs: enlightening, inspirational, thought-provoking, and tremendously impactful. Boasting what I’m sure will end up as one of the year’s best performances (Daniel Kaluuya), the story of Fred Hampton and William O’Neal is told through an incredibly captivating narrative, filled to the brim with absolutely epic, riveting, chill-inducing speeches and dialogues that will leave no viewer indifferent. Both characters bring timely themes back to the spotlight, hopefully generating a critical discourse regarding freedom, human rights, and equality. Besides Kaluuya, Lakeith Stanfield deserves massive praise, and I can’t forget about the lingering, character-driven cinematography that elevates every single scene. Final shoutout to Mark Isham and Craig Harris’s unforgettable, addictive score that plays a significant role in the narrative.\r\n\r\nRating: A", "created_at": "2021-02-02T20:06:32.797Z"}, {"movie_id": 583406, "review_id": "6019c63aa76ac5003d53ad94", "author_rating": null, "review_text": "Racism has all too often reared its ugly head in recent years with the rise of extremist groups who felt emboldened by recent political climates. As violence leads to protests which can themselves become violent; the perpetual cycle seems unending.\r\n\r\nIn the new film “Judas and the Black Messiah”, audiences are told the real-life story of Fred Hampton (Daniel Kaluuya) who runs a local chapter of The Black Panthers in Illinois in the 1960s.\r\n\r\nThe rise of what is perceived as militant groups in the wake of the killings of Malcolm X and Dr. Martin Luther King has caused increased police and Federal actions which have caused many in Hampton’s community to feel they are at war with the authorities and fighting for their very survival against a system of injustice and systemic racism.\r\n\r\nWhen car thief William O’Neal is arrested, FBI agent Roy Mitchell (Jesse Plemons); offers O’Neal a chance to avoid prison and earn some money by becoming an informant. Despite his reservations; O’Neal works his way into Hampton’s inner circle and develops a friendship with the man as he learns of his plans to unify the various factions in their communities.\r\n\r\nO’Neal sees how there is more to the Black Panthers as they feed, educate, and assist members of their community and work to contain more extreme elements that look to make statements through bombings and extreme actions.\r\n\r\nThe threat posed by Hampton draws the attention of FBI Director J Edgar Hoover (Martin Sheen), and plans are developed to take down Hampton and his organization which in turn puts even more pressure on Mitchell and O’Neal.\r\n\r\nThe movie is a gripping, disturbing, and sure to be controversial look into the lives of the key figures as well as the ongoing debates on racial injustice, police violence, hate groups, and violence in the community.\r\n\r\nDirector Shaka King attempts to find a balance in the film as there are moments where party members draw their weapons against the police and kill wounded officers. There are also numerous scenes where police beat and shoot unarmed individuals or use excessive force which underscores Hampton’s stance that his community is at war and this is a life or death struggle.\r\n\r\nThe last time I was so disturbed by a film of this genre was “Detroit” which shocked me with the horrific true crimes that were portrayed and how those involved escaped justice. I thought if as a Caucasian I could be so disturbed and disgusted by the terrifying events portrayed in the film; then they would be truly the stuff of nightmares for people of color.\r\n\r\nThe cast is very strong and gives memorable performances that show the complexity of their characters. They are not simply a militant and a snitch, but rather complex individuals trying to survive.\r\n\r\n“Judas and the Black Messiah” is a very well-crafted film that is equally informative and disturbing and does what good cinema does best; educate, entertain, and inform.\r\n\r\n4.5 stars out of 5", "created_at": "2021-02-02T21:38:02.068Z"}, {"movie_id": 583406, "review_id": "602e4995c3bffe003f358417", "author_rating": 9.0, "review_text": "'Judas and the Black Messiah' (a bloody brilliant title that took a while for me to figure out) is a true powerhouse of a film - not just because it echoes the current climate and the Black Lives Matter movement, but for its standout performances from Lakeith Stanfield and Daniel Kaluuya and its fantastic direction from Shaka King.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-judas-and-the-black-messiah-revolutionary-true-story-of-the-black-panther-party-in-the-1960s", "created_at": "2021-02-18T11:03:49.733Z"}, {"movie_id": 583406, "review_id": "60479536c8a5ac004573a5de", "author_rating": 5.0, "review_text": "It’s a bummer when a film has an important historical story to tell but the finished product just isn’t very good. Such is the case with “Judas and the Black Messiah,” director Shaka King‘s take on the true story of charismatic Black Panther Party leader Fred Hampton (Daniel Kaluuya) and FBI informant William O’Neal (LaKeith Stanfield), the man who infiltrated the African-American organization in Illinois in the late 1960s. It’s an interesting account of true events about two very important figures in our nation’s history, and the racial justice issues are just as relevant today. But topical material doesn’t always result in an award-worthy (or entertaining) movie.\r\n\r\nThere are plenty of things to appreciate about the film’s execution, including King’s confident directorial style and the knockout lead performances from Kaluuya and Stanfield. Kaluuya has massive shoes to fill when portraying a real life man who was filled with so much insight and wisdom, and he fully embraces Hampton’s mannerisms and speech, creating a wholly realized vision (the actor himself becomes almost unrecognizable).\r\n\r\nThe script is the weakest link, which is rare when so many of the other elements combine to create a cohesive vision. King and Will Berson‘s co-authored screenplay is too complicated, resulting in a stagnant film that takes more than an hour to hit its stride. Everything is painfully slow until then, with Berson and King taking far too long to tell the story. You can feel the admiration here, but the reverence towards their characters is so high that it impedes them from driving the story forward.\r\n\r\nThere’s a horrifying scene that tells the end of Hampton’s life story, an awful and upsetting act of injustice at the hands of law enforcement. It’s just one of the things that makes “Judas and the Black Messiah” an important narrative for current times, when so many people of color are still fighting for equality. I just wish the storytelling had been tightened a bit.", "created_at": "2021-03-09T15:33:10.265Z"}, {"movie_id": 583406, "review_id": "648da3c5c2ff3d0139ade243", "author_rating": 7.0, "review_text": "I haven't seen a dramatic movie that talks so clearly about the Black Panther Party, clearly its chief and its members are the conspiracy that was hatched by party members.\r\n\r\nThe movie talks about the rise and fall of the Black Panther movement. If you are a fan of dramatic films with a flavor of documentaries, you should watch the movie. For a period almost centuries ago, Americans with black skin suffered from obtaining their rights, and this was also forbidden to be reflected in a dramatic, dramatic or documentary film. In America on the issue of racism and addressing it, perhaps because of the demonstrations that took place in America after the killing of George Floyd by the American company and the return of racism again to the American street.\r\n\r\nThe film begins in 1969, one year after the assassination of Martin Luther King, King. This assassination changed many of the party's priorities and its goal became the overthrow of the US government by announcing the revolutionary struggle. That is why President Nixon decided during this period to eliminate the party by all possible means, legal and illegal.\r\n\r\nMany American artists sympathized with the Black Panther Party during this period. For example, the artist Jude Fonda visited the party's headquarters and declared her support for the party. Even the international star Marlin Brendo gave a speech to a large gathering of party members.\r\n\r\nJudas and the Black Messiah What is meant metaphorically by Judas in the movie is Bill O'Neal and the Black Messiah is Fred Hampton, and in general it is a projection of the story of Judas' betrayal of Christ and his handing over to the Jews.\r\n\r\nContrary to the image that we see in other films that talk about racism against blacks, the film didn't attack white people, but rather attacked certain American institutions. The movie tried to tell the story honestly without distorting history. We saw white groups join the Black Panther Party, and here the traditional form of this type of film was broken. There is no real conflict between whites and blacks.\r\n\r\nThere are a lot of revolutionary poetry and social justice, but the script was formulated correctly. The movie did not make us feel like a show movie, but rather it was a logical narration without adding spices. The story was told through the villain or the hero, and this added a new dimension to the movie. The film's director, Shaka King, performed a classy tribute to black women through the character of Deborah Johnson, and we saw how women help the men of the party in thought, knowledge, and armed struggle.\r\n\r\nThe performance of the actors in general was remarkable and worthy of appreciation, and there was a very beautiful harmony between the characters. Daniel Kaluuya performed the character of Fred Hampton with utmost brilliance and deserved the Golden Globe Award well deserved, as well as the wonderful performance of LaKeith Stanfield, which showed the contradictions of the traitor Bill O'Neal.\r\n\r\nThe characters I was most impressed with are Bill O'Neal, his looks are full of fear, anxiety, and a sense of shame, especially since Fred Hampton does not know his betrayal. Really It is one of the most successful movies in 2021", "created_at": "2023-06-17T12:15:01.308Z"}, {"movie_id": 583406, "review_id": "6019b0c8a5743d00428a0c4b", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nJudas and the Black Messiah was a last-minute addition to this year’s Sundance, which basically changed every list about the most anticipated films of the festival, including my own. The buzz surrounding its Oscar chances, the remarkable cast, and mainly its important narrative based on true events were more than enough reasons to generate an undeniably powerful hype. When I watch movies inspired by real people and/or true stories, I want them to teach me about the historical moment they’re depicting. I want to finish my viewing sessions and know more than what I did at its beginning. I want the film to be enlightening, thought-provoking, and, most of all, impactful.\r\n\r\nI’m just a young white man living in Portugal with no previous knowledge of who Fred Hampton was or what he did. The closest I got to learning something about him was during last year’s The Trial of the Chicago 7, but that movie wasn’t even focused on the Black Panther Party, let alone one of his most important revolutionaries. My voice is far from being meaningful in regards to this film, and I will share Black critics’ articles that I find to be worthy of investing your time in reading. However, I do have an opinion about this movie, and I’m in my right to share it. I find Shaka King’s flick to have all of the qualities I mentioned above and much more. One of the best films of the festival, and I’m not risking it by writing it will end up as one of my favorite movies of the year.\r\n\r\nIn all honesty, I found myself struggling to completely understand Fred Hampton's intent during the first half or so. His goals are clear and can be summed up in simply trying to offer everyone a better life, one that was fair and where everyone was treated equally. My issue wasn't in his motivations or beliefs, but on the violent, murderous path that Hampton was *apparently* inciting people to take - I repeat, I didn't know a single thing about the real story nor Hampton himself. However, Daniel Kaluuya's very first words as the character stuck with me until now - \"We're not gonna fight fire with fire, we're gonna fight it with water. We're not gonna fight racism with racism. We're gonna fight it with solidarity. We're not gonna fight capitalism with Black capitalism. We're gonna fight it with socialism\" - and he kept developing this idea, which I find incredibly timely.\r\n\r\nThe scene that ultimately cleared my perception of Hampton's ideas was when William O'Neal takes the latter's most famous speech at the end of the second act in its most literal sense, which leaves Hampton baffled and shocked at O'Neal's interpretation of his words. Hampton's reaction, as well as a more emotional moment with the mother of his child, Deborah Johnson (Dominique Fishback), was the click I needed to fully comprehend the revolutionary's desires. This is one of the best compliments I can offer Shaka King and Will Berson's exquisite, detailed screenplay. It doesn't make Hampton a flawless superhero that never makes mistakes but instead depicts him as a human being who fought for everyone's rights. The latter is closer to being a Messiah than the former.\r\n\r\nThe intricate narrative might feel a bit too heavy for some viewers, but it packs extraordinarily energetic, inspirational, chill-inducing speeches that I won't forget that soon. Both Hampton and O'Neal raise sensitive themes that will definitely leave the audience thinking and discussing them throughout the year. Despite it being the longest film of the festival, its two-hour runtime feels adequate and well-paced. In addition to this, the terrific, \"in your face\" cinematography (Sean Bobbitt) focuses on the actors' performances, not giving a chance to the viewers to be distracted with anything else besides the characters' words. The emotional investment in the characters elevates the well-edited (Kristan Sprague) shooting sequences that left me on the edge of my seat (couch), which ultimately serves as a huge praise to the movie's writing.\r\n\r\nI left the cast for last. Now, I know 2021 just started, but if Daniel Kaluuya isn't nominated in every single awards show for the respective Best Supporting Actor category, I'll riot. I've yet to witness a less-than-great display from this unbelievably talented actor. Kaluuya is exceptionally captivating from the very first time he shows up on-screen and never drops his level. Lakeith Stanfield is also brilliant as a conflicted William O'Neal, delivering an extremely complex portrayal of someone who has to deal with actions he knows are wrong. Dominique Fishback and Jesse Plemons (Roy Mitchell, an FBI agent) also deserve a shoutout.\r\n\r\nJudas and the Black Messiah deserves all the hype it’s been getting and some more. Shaka King and Will Berson deliver a film inspired by true events with all the qualities this type of movie needs: enlightening, inspirational, thought-provoking, and tremendously impactful. Boasting what I’m sure will end up as one of the year’s best performances (Daniel Kaluuya), the story of Fred Hampton and William O’Neal is told through an incredibly captivating narrative, filled to the brim with absolutely epic, riveting, chill-inducing speeches and dialogues that will leave no viewer indifferent. Both characters bring timely themes back to the spotlight, hopefully generating a critical discourse regarding freedom, human rights, and equality. Besides Kaluuya, Lakeith Stanfield deserves massive praise, and I can’t forget about the lingering, character-driven cinematography that elevates every single scene. Final shoutout to Mark Isham and Craig Harris’s unforgettable, addictive score that plays a significant role in the narrative.\r\n\r\nRating: A", "created_at": "2021-02-02T20:06:32.797Z"}, {"movie_id": 583406, "review_id": "6019c63aa76ac5003d53ad94", "author_rating": null, "review_text": "Racism has all too often reared its ugly head in recent years with the rise of extremist groups who felt emboldened by recent political climates. As violence leads to protests which can themselves become violent; the perpetual cycle seems unending.\r\n\r\nIn the new film “Judas and the Black Messiah”, audiences are told the real-life story of Fred Hampton (Daniel Kaluuya) who runs a local chapter of The Black Panthers in Illinois in the 1960s.\r\n\r\nThe rise of what is perceived as militant groups in the wake of the killings of Malcolm X and Dr. Martin Luther King has caused increased police and Federal actions which have caused many in Hampton’s community to feel they are at war with the authorities and fighting for their very survival against a system of injustice and systemic racism.\r\n\r\nWhen car thief William O’Neal is arrested, FBI agent Roy Mitchell (Jesse Plemons); offers O’Neal a chance to avoid prison and earn some money by becoming an informant. Despite his reservations; O’Neal works his way into Hampton’s inner circle and develops a friendship with the man as he learns of his plans to unify the various factions in their communities.\r\n\r\nO’Neal sees how there is more to the Black Panthers as they feed, educate, and assist members of their community and work to contain more extreme elements that look to make statements through bombings and extreme actions.\r\n\r\nThe threat posed by Hampton draws the attention of FBI Director J Edgar Hoover (Martin Sheen), and plans are developed to take down Hampton and his organization which in turn puts even more pressure on Mitchell and O’Neal.\r\n\r\nThe movie is a gripping, disturbing, and sure to be controversial look into the lives of the key figures as well as the ongoing debates on racial injustice, police violence, hate groups, and violence in the community.\r\n\r\nDirector Shaka King attempts to find a balance in the film as there are moments where party members draw their weapons against the police and kill wounded officers. There are also numerous scenes where police beat and shoot unarmed individuals or use excessive force which underscores Hampton’s stance that his community is at war and this is a life or death struggle.\r\n\r\nThe last time I was so disturbed by a film of this genre was “Detroit” which shocked me with the horrific true crimes that were portrayed and how those involved escaped justice. I thought if as a Caucasian I could be so disturbed and disgusted by the terrifying events portrayed in the film; then they would be truly the stuff of nightmares for people of color.\r\n\r\nThe cast is very strong and gives memorable performances that show the complexity of their characters. They are not simply a militant and a snitch, but rather complex individuals trying to survive.\r\n\r\n“Judas and the Black Messiah” is a very well-crafted film that is equally informative and disturbing and does what good cinema does best; educate, entertain, and inform.\r\n\r\n4.5 stars out of 5", "created_at": "2021-02-02T21:38:02.068Z"}, {"movie_id": 583406, "review_id": "602e4995c3bffe003f358417", "author_rating": 9.0, "review_text": "'Judas and the Black Messiah' (a bloody brilliant title that took a while for me to figure out) is a true powerhouse of a film - not just because it echoes the current climate and the Black Lives Matter movement, but for its standout performances from Lakeith Stanfield and Daniel Kaluuya and its fantastic direction from Shaka King.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-judas-and-the-black-messiah-revolutionary-true-story-of-the-black-panther-party-in-the-1960s", "created_at": "2021-02-18T11:03:49.733Z"}, {"movie_id": 583406, "review_id": "60479536c8a5ac004573a5de", "author_rating": 5.0, "review_text": "It’s a bummer when a film has an important historical story to tell but the finished product just isn’t very good. Such is the case with “Judas and the Black Messiah,” director Shaka King‘s take on the true story of charismatic Black Panther Party leader Fred Hampton (Daniel Kaluuya) and FBI informant William O’Neal (LaKeith Stanfield), the man who infiltrated the African-American organization in Illinois in the late 1960s. It’s an interesting account of true events about two very important figures in our nation’s history, and the racial justice issues are just as relevant today. But topical material doesn’t always result in an award-worthy (or entertaining) movie.\r\n\r\nThere are plenty of things to appreciate about the film’s execution, including King’s confident directorial style and the knockout lead performances from Kaluuya and Stanfield. Kaluuya has massive shoes to fill when portraying a real life man who was filled with so much insight and wisdom, and he fully embraces Hampton’s mannerisms and speech, creating a wholly realized vision (the actor himself becomes almost unrecognizable).\r\n\r\nThe script is the weakest link, which is rare when so many of the other elements combine to create a cohesive vision. King and Will Berson‘s co-authored screenplay is too complicated, resulting in a stagnant film that takes more than an hour to hit its stride. Everything is painfully slow until then, with Berson and King taking far too long to tell the story. You can feel the admiration here, but the reverence towards their characters is so high that it impedes them from driving the story forward.\r\n\r\nThere’s a horrifying scene that tells the end of Hampton’s life story, an awful and upsetting act of injustice at the hands of law enforcement. It’s just one of the things that makes “Judas and the Black Messiah” an important narrative for current times, when so many people of color are still fighting for equality. I just wish the storytelling had been tightened a bit.", "created_at": "2021-03-09T15:33:10.265Z"}, {"movie_id": 583406, "review_id": "648da3c5c2ff3d0139ade243", "author_rating": 7.0, "review_text": "I haven't seen a dramatic movie that talks so clearly about the Black Panther Party, clearly its chief and its members are the conspiracy that was hatched by party members.\r\n\r\nThe movie talks about the rise and fall of the Black Panther movement. If you are a fan of dramatic films with a flavor of documentaries, you should watch the movie. For a period almost centuries ago, Americans with black skin suffered from obtaining their rights, and this was also forbidden to be reflected in a dramatic, dramatic or documentary film. In America on the issue of racism and addressing it, perhaps because of the demonstrations that took place in America after the killing of George Floyd by the American company and the return of racism again to the American street.\r\n\r\nThe film begins in 1969, one year after the assassination of Martin Luther King, King. This assassination changed many of the party's priorities and its goal became the overthrow of the US government by announcing the revolutionary struggle. That is why President Nixon decided during this period to eliminate the party by all possible means, legal and illegal.\r\n\r\nMany American artists sympathized with the Black Panther Party during this period. For example, the artist Jude Fonda visited the party's headquarters and declared her support for the party. Even the international star Marlin Brendo gave a speech to a large gathering of party members.\r\n\r\nJudas and the Black Messiah What is meant metaphorically by Judas in the movie is Bill O'Neal and the Black Messiah is Fred Hampton, and in general it is a projection of the story of Judas' betrayal of Christ and his handing over to the Jews.\r\n\r\nContrary to the image that we see in other films that talk about racism against blacks, the film didn't attack white people, but rather attacked certain American institutions. The movie tried to tell the story honestly without distorting history. We saw white groups join the Black Panther Party, and here the traditional form of this type of film was broken. There is no real conflict between whites and blacks.\r\n\r\nThere are a lot of revolutionary poetry and social justice, but the script was formulated correctly. The movie did not make us feel like a show movie, but rather it was a logical narration without adding spices. The story was told through the villain or the hero, and this added a new dimension to the movie. The film's director, Shaka King, performed a classy tribute to black women through the character of Deborah Johnson, and we saw how women help the men of the party in thought, knowledge, and armed struggle.\r\n\r\nThe performance of the actors in general was remarkable and worthy of appreciation, and there was a very beautiful harmony between the characters. Daniel Kaluuya performed the character of Fred Hampton with utmost brilliance and deserved the Golden Globe Award well deserved, as well as the wonderful performance of LaKeith Stanfield, which showed the contradictions of the traitor Bill O'Neal.\r\n\r\nThe characters I was most impressed with are Bill O'Neal, his looks are full of fear, anxiety, and a sense of shame, especially since Fred Hampton does not know his betrayal. Really It is one of the most successful movies in 2021", "created_at": "2023-06-17T12:15:01.308Z"}, {"movie_id": 583406, "review_id": "6019b0c8a5743d00428a0c4b", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nJudas and the Black Messiah was a last-minute addition to this year’s Sundance, which basically changed every list about the most anticipated films of the festival, including my own. The buzz surrounding its Oscar chances, the remarkable cast, and mainly its important narrative based on true events were more than enough reasons to generate an undeniably powerful hype. When I watch movies inspired by real people and/or true stories, I want them to teach me about the historical moment they’re depicting. I want to finish my viewing sessions and know more than what I did at its beginning. I want the film to be enlightening, thought-provoking, and, most of all, impactful.\r\n\r\nI’m just a young white man living in Portugal with no previous knowledge of who Fred Hampton was or what he did. The closest I got to learning something about him was during last year’s The Trial of the Chicago 7, but that movie wasn’t even focused on the Black Panther Party, let alone one of his most important revolutionaries. My voice is far from being meaningful in regards to this film, and I will share Black critics’ articles that I find to be worthy of investing your time in reading. However, I do have an opinion about this movie, and I’m in my right to share it. I find Shaka King’s flick to have all of the qualities I mentioned above and much more. One of the best films of the festival, and I’m not risking it by writing it will end up as one of my favorite movies of the year.\r\n\r\nIn all honesty, I found myself struggling to completely understand Fred Hampton's intent during the first half or so. His goals are clear and can be summed up in simply trying to offer everyone a better life, one that was fair and where everyone was treated equally. My issue wasn't in his motivations or beliefs, but on the violent, murderous path that Hampton was *apparently* inciting people to take - I repeat, I didn't know a single thing about the real story nor Hampton himself. However, Daniel Kaluuya's very first words as the character stuck with me until now - \"We're not gonna fight fire with fire, we're gonna fight it with water. We're not gonna fight racism with racism. We're gonna fight it with solidarity. We're not gonna fight capitalism with Black capitalism. We're gonna fight it with socialism\" - and he kept developing this idea, which I find incredibly timely.\r\n\r\nThe scene that ultimately cleared my perception of Hampton's ideas was when William O'Neal takes the latter's most famous speech at the end of the second act in its most literal sense, which leaves Hampton baffled and shocked at O'Neal's interpretation of his words. Hampton's reaction, as well as a more emotional moment with the mother of his child, Deborah Johnson (Dominique Fishback), was the click I needed to fully comprehend the revolutionary's desires. This is one of the best compliments I can offer Shaka King and Will Berson's exquisite, detailed screenplay. It doesn't make Hampton a flawless superhero that never makes mistakes but instead depicts him as a human being who fought for everyone's rights. The latter is closer to being a Messiah than the former.\r\n\r\nThe intricate narrative might feel a bit too heavy for some viewers, but it packs extraordinarily energetic, inspirational, chill-inducing speeches that I won't forget that soon. Both Hampton and O'Neal raise sensitive themes that will definitely leave the audience thinking and discussing them throughout the year. Despite it being the longest film of the festival, its two-hour runtime feels adequate and well-paced. In addition to this, the terrific, \"in your face\" cinematography (Sean Bobbitt) focuses on the actors' performances, not giving a chance to the viewers to be distracted with anything else besides the characters' words. The emotional investment in the characters elevates the well-edited (Kristan Sprague) shooting sequences that left me on the edge of my seat (couch), which ultimately serves as a huge praise to the movie's writing.\r\n\r\nI left the cast for last. Now, I know 2021 just started, but if Daniel Kaluuya isn't nominated in every single awards show for the respective Best Supporting Actor category, I'll riot. I've yet to witness a less-than-great display from this unbelievably talented actor. Kaluuya is exceptionally captivating from the very first time he shows up on-screen and never drops his level. Lakeith Stanfield is also brilliant as a conflicted William O'Neal, delivering an extremely complex portrayal of someone who has to deal with actions he knows are wrong. Dominique Fishback and Jesse Plemons (Roy Mitchell, an FBI agent) also deserve a shoutout.\r\n\r\nJudas and the Black Messiah deserves all the hype it’s been getting and some more. Shaka King and Will Berson deliver a film inspired by true events with all the qualities this type of movie needs: enlightening, inspirational, thought-provoking, and tremendously impactful. Boasting what I’m sure will end up as one of the year’s best performances (Daniel Kaluuya), the story of Fred Hampton and William O’Neal is told through an incredibly captivating narrative, filled to the brim with absolutely epic, riveting, chill-inducing speeches and dialogues that will leave no viewer indifferent. Both characters bring timely themes back to the spotlight, hopefully generating a critical discourse regarding freedom, human rights, and equality. Besides Kaluuya, Lakeith Stanfield deserves massive praise, and I can’t forget about the lingering, character-driven cinematography that elevates every single scene. Final shoutout to Mark Isham and Craig Harris’s unforgettable, addictive score that plays a significant role in the narrative.\r\n\r\nRating: A", "created_at": "2021-02-02T20:06:32.797Z"}, {"movie_id": 583406, "review_id": "6019c63aa76ac5003d53ad94", "author_rating": null, "review_text": "Racism has all too often reared its ugly head in recent years with the rise of extremist groups who felt emboldened by recent political climates. As violence leads to protests which can themselves become violent; the perpetual cycle seems unending.\r\n\r\nIn the new film “Judas and the Black Messiah”, audiences are told the real-life story of Fred Hampton (Daniel Kaluuya) who runs a local chapter of The Black Panthers in Illinois in the 1960s.\r\n\r\nThe rise of what is perceived as militant groups in the wake of the killings of Malcolm X and Dr. Martin Luther King has caused increased police and Federal actions which have caused many in Hampton’s community to feel they are at war with the authorities and fighting for their very survival against a system of injustice and systemic racism.\r\n\r\nWhen car thief William O’Neal is arrested, FBI agent Roy Mitchell (Jesse Plemons); offers O’Neal a chance to avoid prison and earn some money by becoming an informant. Despite his reservations; O’Neal works his way into Hampton’s inner circle and develops a friendship with the man as he learns of his plans to unify the various factions in their communities.\r\n\r\nO’Neal sees how there is more to the Black Panthers as they feed, educate, and assist members of their community and work to contain more extreme elements that look to make statements through bombings and extreme actions.\r\n\r\nThe threat posed by Hampton draws the attention of FBI Director J Edgar Hoover (Martin Sheen), and plans are developed to take down Hampton and his organization which in turn puts even more pressure on Mitchell and O’Neal.\r\n\r\nThe movie is a gripping, disturbing, and sure to be controversial look into the lives of the key figures as well as the ongoing debates on racial injustice, police violence, hate groups, and violence in the community.\r\n\r\nDirector Shaka King attempts to find a balance in the film as there are moments where party members draw their weapons against the police and kill wounded officers. There are also numerous scenes where police beat and shoot unarmed individuals or use excessive force which underscores Hampton’s stance that his community is at war and this is a life or death struggle.\r\n\r\nThe last time I was so disturbed by a film of this genre was “Detroit” which shocked me with the horrific true crimes that were portrayed and how those involved escaped justice. I thought if as a Caucasian I could be so disturbed and disgusted by the terrifying events portrayed in the film; then they would be truly the stuff of nightmares for people of color.\r\n\r\nThe cast is very strong and gives memorable performances that show the complexity of their characters. They are not simply a militant and a snitch, but rather complex individuals trying to survive.\r\n\r\n“Judas and the Black Messiah” is a very well-crafted film that is equally informative and disturbing and does what good cinema does best; educate, entertain, and inform.\r\n\r\n4.5 stars out of 5", "created_at": "2021-02-02T21:38:02.068Z"}, {"movie_id": 583406, "review_id": "602e4995c3bffe003f358417", "author_rating": 9.0, "review_text": "'Judas and the Black Messiah' (a bloody brilliant title that took a while for me to figure out) is a true powerhouse of a film - not just because it echoes the current climate and the Black Lives Matter movement, but for its standout performances from Lakeith Stanfield and Daniel Kaluuya and its fantastic direction from Shaka King.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-judas-and-the-black-messiah-revolutionary-true-story-of-the-black-panther-party-in-the-1960s", "created_at": "2021-02-18T11:03:49.733Z"}, {"movie_id": 583406, "review_id": "60479536c8a5ac004573a5de", "author_rating": 5.0, "review_text": "It’s a bummer when a film has an important historical story to tell but the finished product just isn’t very good. Such is the case with “Judas and the Black Messiah,” director Shaka King‘s take on the true story of charismatic Black Panther Party leader Fred Hampton (Daniel Kaluuya) and FBI informant William O’Neal (LaKeith Stanfield), the man who infiltrated the African-American organization in Illinois in the late 1960s. It’s an interesting account of true events about two very important figures in our nation’s history, and the racial justice issues are just as relevant today. But topical material doesn’t always result in an award-worthy (or entertaining) movie.\r\n\r\nThere are plenty of things to appreciate about the film’s execution, including King’s confident directorial style and the knockout lead performances from Kaluuya and Stanfield. Kaluuya has massive shoes to fill when portraying a real life man who was filled with so much insight and wisdom, and he fully embraces Hampton’s mannerisms and speech, creating a wholly realized vision (the actor himself becomes almost unrecognizable).\r\n\r\nThe script is the weakest link, which is rare when so many of the other elements combine to create a cohesive vision. King and Will Berson‘s co-authored screenplay is too complicated, resulting in a stagnant film that takes more than an hour to hit its stride. Everything is painfully slow until then, with Berson and King taking far too long to tell the story. You can feel the admiration here, but the reverence towards their characters is so high that it impedes them from driving the story forward.\r\n\r\nThere’s a horrifying scene that tells the end of Hampton’s life story, an awful and upsetting act of injustice at the hands of law enforcement. It’s just one of the things that makes “Judas and the Black Messiah” an important narrative for current times, when so many people of color are still fighting for equality. I just wish the storytelling had been tightened a bit.", "created_at": "2021-03-09T15:33:10.265Z"}, {"movie_id": 583406, "review_id": "648da3c5c2ff3d0139ade243", "author_rating": 7.0, "review_text": "I haven't seen a dramatic movie that talks so clearly about the Black Panther Party, clearly its chief and its members are the conspiracy that was hatched by party members.\r\n\r\nThe movie talks about the rise and fall of the Black Panther movement. If you are a fan of dramatic films with a flavor of documentaries, you should watch the movie. For a period almost centuries ago, Americans with black skin suffered from obtaining their rights, and this was also forbidden to be reflected in a dramatic, dramatic or documentary film. In America on the issue of racism and addressing it, perhaps because of the demonstrations that took place in America after the killing of George Floyd by the American company and the return of racism again to the American street.\r\n\r\nThe film begins in 1969, one year after the assassination of Martin Luther King, King. This assassination changed many of the party's priorities and its goal became the overthrow of the US government by announcing the revolutionary struggle. That is why President Nixon decided during this period to eliminate the party by all possible means, legal and illegal.\r\n\r\nMany American artists sympathized with the Black Panther Party during this period. For example, the artist Jude Fonda visited the party's headquarters and declared her support for the party. Even the international star Marlin Brendo gave a speech to a large gathering of party members.\r\n\r\nJudas and the Black Messiah What is meant metaphorically by Judas in the movie is Bill O'Neal and the Black Messiah is Fred Hampton, and in general it is a projection of the story of Judas' betrayal of Christ and his handing over to the Jews.\r\n\r\nContrary to the image that we see in other films that talk about racism against blacks, the film didn't attack white people, but rather attacked certain American institutions. The movie tried to tell the story honestly without distorting history. We saw white groups join the Black Panther Party, and here the traditional form of this type of film was broken. There is no real conflict between whites and blacks.\r\n\r\nThere are a lot of revolutionary poetry and social justice, but the script was formulated correctly. The movie did not make us feel like a show movie, but rather it was a logical narration without adding spices. The story was told through the villain or the hero, and this added a new dimension to the movie. The film's director, Shaka King, performed a classy tribute to black women through the character of Deborah Johnson, and we saw how women help the men of the party in thought, knowledge, and armed struggle.\r\n\r\nThe performance of the actors in general was remarkable and worthy of appreciation, and there was a very beautiful harmony between the characters. Daniel Kaluuya performed the character of Fred Hampton with utmost brilliance and deserved the Golden Globe Award well deserved, as well as the wonderful performance of LaKeith Stanfield, which showed the contradictions of the traitor Bill O'Neal.\r\n\r\nThe characters I was most impressed with are Bill O'Neal, his looks are full of fear, anxiety, and a sense of shame, especially since Fred Hampton does not know his betrayal. Really It is one of the most successful movies in 2021", "created_at": "2023-06-17T12:15:01.308Z"}]