[{"movie_id": 299687, "review_id": "56a6cb0392514129fe001383", "author_rating": null, "review_text": "Well, the young adult movie adaptation genre continues to percolate despite the farewell sentiments as demonstrated by hugely popular products meant to entice the teen scene such as the Twilight, Divergent, Maze Runner and The Hunger Games film series. Sure, why not tamper with a proven formula that guarantees all the right ingredients to tap into the angst-ridden world of young feminine empowerment set against a background of apocalyptic strife and undefined self-discovery? In director J Blakeson’s drippy and derivative dystopian drama The 5th Wave we are introduced to another similar sci-fi serving of a disillusioned heroine out to reflect some consciousness in a boundary of uncertainly and destructive despair. Sadly, The 5th Wave is nothing more than a stillborn alien invasion soap opera that wants to spout off its Hunger Games-esque copycat coating but fails to delve into anything remotely original or bitingly daring.\r\n\r\nThe 5th Wave is the literary brainchild of novelist Rick Yancey’s printed pages as he brings to life the trials and tribulations of tenacious teen tart Cassie Sullivan (Chloe Grace Moretz from “Kick-Ass”), a timid tyke-turned-guerilla warfare gal whose guts and gumption to find and protect her little brother during a full-scale alien invasion of the planet is put forth in flimsy animated fashion. Actually the young actress Moretz, a veteran of a few films already lodged under her belt, has quite a feisty presence on screen and more than holds her own as the “princess of panic” in the generic doomsday drama that really brings nothing to the tension-filled table.\r\n\r\nThe material that Moretz is obligated to bring to life feels rather strained and stilted because the YA creative cloud hovers over the proceedings in a predictable, syrupy manner. The 5th Wave lacks the intensity and philosophical fiber that The Hunger Games effortlessly put forth in imaginable conception. Plus, the energy and bombastic buzz of Hunger Games imitator Divergent does not seem to be part of The 5th Wave’s anemic pulse. Incredibly, Blakeson’s lean and lacking futuristic feminine fable incorporates a cinematic stew of film flavors that heavily echoes such solid blueprints as everything from Red Dawn and Independence Day to the WOW-factor of blockbusters in Jurassic Park and Starship Troopers. The sad part is that even with the borrowing of these cinematic ideas The 5th Wave still registers as a limp alien invasion actioner without much punch or promise. The film is well-intentioned in its YA-oriented gravitas but will soon be dismissed as another Hunger Games wannabe going through the motions.\r\n\r\nAs with the inspired makeup that is at the root of these conventional YA melodramas, The 5th Wave offers its share of youth-minded dire and doom, romantic exploration and the element of military-style redemption and rebellion. As Moretz’s Callie is called into action among the devastating ruins she is determined to reunite with her last surviving  relative Sam (Zackary Arthur). Soon, this mild-mannered schoolgirl has to whip into shape and protect the interests of her deteriorating community as the hard-nosed alien invaders look to wreak havoc and take over the world–or at least Callie’s part of the world that has her fellow citizens shocked and stunned.\r\n\r\nPoor Cassie…in addition to her mind focusing on locating her sibling, revving up for her showdown with the alien intruders and shaking of her vulnerabilities she is caught in a love triangle that tests her limits. Should Cassie fall for the dashing and daring Ben (Nick Robinson, “Jurassic World”), a fellow classmate about to enroll into the junior start-up army looking to combat the unwelcomed visitors or should her confused heart throb for backwoods bad boy Evan Walker (Alex Roe)? Also, how would Cassie feel if she discovers that her hunk-in-training may have a thing for the ravaging rough-around-the-edges recruit Ringer (Maika Monroe). Ah, love among the languishing landscape!\r\n\r\nIt is definitely the consensus that The 5th Wave may not be included in the Mount Rushmore of youth-friendly dystopias merely because it is nothing more than a shadowy reminiscence of the more defining, developed and decisive babes-in-the-woods boisterous actions. Even when not just comparing The 5th Wave to its better conceived contemporaries it dos not feel comfortable in its own mediocrity when standing on its own two feet. It is compelling only for its goal in pushing the conveyor belt of sci-fi YA duds to uphold Hollywood’s attempt to kidnap the psyche of young moviegoers looking for the next big screen teen scene sensation to boost box office receipts.\r\n\r\nSorry but there is no need to take out the sci-fi surfing board for the tepid trappings of The 5th Wave. \r\n\r\nThe 5th Wave (2016)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\n1 hr 53 mins.\r\n\r\nStarring: Chloe Grace Moretz, Nick Robinson, Alex Roe, Liev Schreiber, Maria Bello, Ron Livingston, Maika Monroe, Maggie Siff, and Zackary Arthur\r\n\r\nDirected by: J Blakeson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Teen Fantasy/Drama/Alien Invasion Thriller\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2016", "created_at": "2016-01-26T01:25:23.254Z"}, {"movie_id": 299687, "review_id": "571cd1bf925141342b000ac8", "author_rating": 5.0, "review_text": "> Another teen film trilogy, alien invasion theme on a roll.\r\n\r\nThe 80s teen films were different, (like the recent one 'Turbo Kid') especially those I watched when I was growing up in the late 90s and early 2000s. But now most of them are dystopian action-adventure-fantasy/sci-fi themes, and obviously trilogies with high end graphics. I won't blame for that, the time has come for a change, the movies have technical qualities and they know how to render them, but the stories are terrible.\r\n\r\nTo me this was just an okay film. Felt like the action-adventure versions of 'The Host', but I loved that one, not this. I know it's a trilogy, so, more stories to come with more explanations, but the first film in a series is always important and it failed to impress me. This installment is all about a teen girl and her younger brother. After getting separated during the chaos of alien invasion, she goes to look for him and that's the film.\r\n\r\nThis might be the finer contents for a book, but for a movie, it is not that any special. I did not like the ending as well, felt like it was so stupid. Even some B films got better conclusion and stunt sequences. I feel bad for Chloe Moretz for taking up this project. She should do more action films like 'Kick-Ass'. I thought she would be the one who's going to replace Angelina Jolie. I can only hope for this series to get better in the follow up and end as a decent trilogy.\r\n\r\n5/10", "created_at": "2016-04-24T14:01:35.254Z"}, {"movie_id": 299687, "review_id": "57d4843ec3a36855680079c7", "author_rating": 2.0, "review_text": "Here we go again, another female empowered teen movie. HW seem to be literally pumping this garbage out for the last few years. Is it any wonder why movie sales are down with garbage like this on the shelf? Designed to be for all those teens who like the idea of blood, but really don't want to see it (think twilight, hunger games etc). Save your money and 1h50m of your time and skip.\r\nIf you really need to see it, in brief it's about a 16 year old girls world turned upside down by an 'alien' invasion when her brother is taken by supposed US army to fight the aliens and father is shot. Befriended by one of 'the others' helps to get the aliens on the run.\r\nNifty idea, however for me falls way short as you don't see any real 'aliens', mediocre acting and story line is very predicable. Look for it in the bargain bin at videoezy in 12 months.", "created_at": "2016-09-10T22:07:58.016Z"}, {"movie_id": 299687, "review_id": "57e5cca7925141413f003f3e", "author_rating": 2.0, "review_text": "It's like someone read _The Road_ and went \"Oh hey, that was pretty good, I know how I can ruin it!\". It's a worse _Hunger Games_ movie than even the last _Hunger Games_ movie was. It's the kind of film where after the opening scene, there is a 40 minute flashback sequence of pure awkward exposition. It's the kind of film that manages to avoid being \"offensively bad\" by by the skin of its teeth, only because it is instead \"embarrassingly bad\". It's the kind of film that thinks it's going to get a sequel, so it resolves **nothing**, but that sequel will never happen.\r\n\r\nI terms of acting? Look, Liev Schreiber was okay, but his role is both minor and beneath him. Chloe Grace Moretz has never been worse. Even Maika Monroe who was amazing in _It Follows_ and _The Guest_ is absolutely awful in this. Everyone else was terrible. There are so many moments in The _5th Wave_ that had me shaking my head, and the acting, dialogue and plot are all equally to blame.\r\n\r\nOh. And the CGI fuckin' sucks.\r\n\r\n_Final rating:★ - Of no value._", "created_at": "2016-09-24T00:45:27.080Z"}, {"movie_id": 299687, "review_id": "5e2f293e1685da0011e9ca24", "author_rating": 2.0, "review_text": "The 6th wave was the wave of people leaving the theater during the movie.﻿", "created_at": "2020-01-27T18:17:34.365Z"}, {"movie_id": 299687, "review_id": "60994fc8e263bb003c29be02", "author_rating": 3.0, "review_text": "This is so utterly terrible, I don't know where to begin. The most obvious? The writing is some of the worst I've ever experienced.\r\n\r\nChloë and Maika, what were you thinking?? Please get better agents.", "created_at": "2021-05-10T15:22:48.687Z"}, {"movie_id": 299687, "review_id": "640b2e42326ec100e7c26cdb", "author_rating": 5.0, "review_text": "\"The 5th Wave\" is a science-fiction thriller directed by J Blakeson and starring Chloe Grace Moretz, Matthew Zuk, and Gabriela Lopez. The film is based on the novel of the same name by Rick Yancey and was released in 2016.\r\n\r\nThe story is set in a world that has been devastated by a series of four catastrophic waves, including an electromagnetic pulse that destroys all electronics and a deadly virus that kills billions of people. The survivors are left to fend for themselves against an alien invasion, with no idea of when or how the fifth wave will come.\r\n\r\nThe film follows Cassie Sullivan, played by Moretz, as she tries to survive in this new world and rescue her younger brother, who has been taken by the military. The movie is filled with action, suspense, and emotional moments, as Cassie encounters both human and alien enemies on her journey.\r\n\r\nMoretz delivers a strong performance as Cassie, a determined and resourceful protagonist who is forced to make difficult choices to survive. The supporting cast, including Zuk and Lopez, also do a commendable job in their respective roles.\r\n\r\nThe film's special effects and action sequences are impressive, with intense fight scenes and thrilling moments of survival. The cinematography is also noteworthy, with beautiful shots of the desolate landscape and eerie depictions of the alien invasion.\r\n\r\nHowever, despite these positive aspects, \"The 5th Wave\" falls short in its execution of the story. The pacing of the film is uneven, with a slow buildup to the action and a rushed conclusion that leaves some questions unanswered. Additionally, some of the plot points feel contrived or predictable.\r\n\r\nOverall, \"The 5th Wave\" is a solid science-fiction thriller with some impressive elements but ultimately fails to live up to its full potential. I would rate it a 5 out of 10. While it is an entertaining movie with strong performances and exciting action sequences, the flaws in its storytelling prevent it from being a truly great film.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:18:58.424Z"}, {"movie_id": 299687, "review_id": "56a6cb0392514129fe001383", "author_rating": null, "review_text": "Well, the young adult movie adaptation genre continues to percolate despite the farewell sentiments as demonstrated by hugely popular products meant to entice the teen scene such as the Twilight, Divergent, Maze Runner and The Hunger Games film series. Sure, why not tamper with a proven formula that guarantees all the right ingredients to tap into the angst-ridden world of young feminine empowerment set against a background of apocalyptic strife and undefined self-discovery? In director J Blakeson’s drippy and derivative dystopian drama The 5th Wave we are introduced to another similar sci-fi serving of a disillusioned heroine out to reflect some consciousness in a boundary of uncertainly and destructive despair. Sadly, The 5th Wave is nothing more than a stillborn alien invasion soap opera that wants to spout off its Hunger Games-esque copycat coating but fails to delve into anything remotely original or bitingly daring.\r\n\r\nThe 5th Wave is the literary brainchild of novelist Rick Yancey’s printed pages as he brings to life the trials and tribulations of tenacious teen tart Cassie Sullivan (Chloe Grace Moretz from “Kick-Ass”), a timid tyke-turned-guerilla warfare gal whose guts and gumption to find and protect her little brother during a full-scale alien invasion of the planet is put forth in flimsy animated fashion. Actually the young actress Moretz, a veteran of a few films already lodged under her belt, has quite a feisty presence on screen and more than holds her own as the “princess of panic” in the generic doomsday drama that really brings nothing to the tension-filled table.\r\n\r\nThe material that Moretz is obligated to bring to life feels rather strained and stilted because the YA creative cloud hovers over the proceedings in a predictable, syrupy manner. The 5th Wave lacks the intensity and philosophical fiber that The Hunger Games effortlessly put forth in imaginable conception. Plus, the energy and bombastic buzz of Hunger Games imitator Divergent does not seem to be part of The 5th Wave’s anemic pulse. Incredibly, Blakeson’s lean and lacking futuristic feminine fable incorporates a cinematic stew of film flavors that heavily echoes such solid blueprints as everything from Red Dawn and Independence Day to the WOW-factor of blockbusters in Jurassic Park and Starship Troopers. The sad part is that even with the borrowing of these cinematic ideas The 5th Wave still registers as a limp alien invasion actioner without much punch or promise. The film is well-intentioned in its YA-oriented gravitas but will soon be dismissed as another Hunger Games wannabe going through the motions.\r\n\r\nAs with the inspired makeup that is at the root of these conventional YA melodramas, The 5th Wave offers its share of youth-minded dire and doom, romantic exploration and the element of military-style redemption and rebellion. As Moretz’s Callie is called into action among the devastating ruins she is determined to reunite with her last surviving  relative Sam (Zackary Arthur). Soon, this mild-mannered schoolgirl has to whip into shape and protect the interests of her deteriorating community as the hard-nosed alien invaders look to wreak havoc and take over the world–or at least Callie’s part of the world that has her fellow citizens shocked and stunned.\r\n\r\nPoor Cassie…in addition to her mind focusing on locating her sibling, revving up for her showdown with the alien intruders and shaking of her vulnerabilities she is caught in a love triangle that tests her limits. Should Cassie fall for the dashing and daring Ben (Nick Robinson, “Jurassic World”), a fellow classmate about to enroll into the junior start-up army looking to combat the unwelcomed visitors or should her confused heart throb for backwoods bad boy Evan Walker (Alex Roe)? Also, how would Cassie feel if she discovers that her hunk-in-training may have a thing for the ravaging rough-around-the-edges recruit Ringer (Maika Monroe). Ah, love among the languishing landscape!\r\n\r\nIt is definitely the consensus that The 5th Wave may not be included in the Mount Rushmore of youth-friendly dystopias merely because it is nothing more than a shadowy reminiscence of the more defining, developed and decisive babes-in-the-woods boisterous actions. Even when not just comparing The 5th Wave to its better conceived contemporaries it dos not feel comfortable in its own mediocrity when standing on its own two feet. It is compelling only for its goal in pushing the conveyor belt of sci-fi YA duds to uphold Hollywood’s attempt to kidnap the psyche of young moviegoers looking for the next big screen teen scene sensation to boost box office receipts.\r\n\r\nSorry but there is no need to take out the sci-fi surfing board for the tepid trappings of The 5th Wave. \r\n\r\nThe 5th Wave (2016)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\n1 hr 53 mins.\r\n\r\nStarring: Chloe Grace Moretz, Nick Robinson, Alex Roe, Liev Schreiber, Maria Bello, Ron Livingston, Maika Monroe, Maggie Siff, and Zackary Arthur\r\n\r\nDirected by: J Blakeson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Teen Fantasy/Drama/Alien Invasion Thriller\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2016", "created_at": "2016-01-26T01:25:23.254Z"}, {"movie_id": 299687, "review_id": "571cd1bf925141342b000ac8", "author_rating": 5.0, "review_text": "> Another teen film trilogy, alien invasion theme on a roll.\r\n\r\nThe 80s teen films were different, (like the recent one 'Turbo Kid') especially those I watched when I was growing up in the late 90s and early 2000s. But now most of them are dystopian action-adventure-fantasy/sci-fi themes, and obviously trilogies with high end graphics. I won't blame for that, the time has come for a change, the movies have technical qualities and they know how to render them, but the stories are terrible.\r\n\r\nTo me this was just an okay film. Felt like the action-adventure versions of 'The Host', but I loved that one, not this. I know it's a trilogy, so, more stories to come with more explanations, but the first film in a series is always important and it failed to impress me. This installment is all about a teen girl and her younger brother. After getting separated during the chaos of alien invasion, she goes to look for him and that's the film.\r\n\r\nThis might be the finer contents for a book, but for a movie, it is not that any special. I did not like the ending as well, felt like it was so stupid. Even some B films got better conclusion and stunt sequences. I feel bad for Chloe Moretz for taking up this project. She should do more action films like 'Kick-Ass'. I thought she would be the one who's going to replace Angelina Jolie. I can only hope for this series to get better in the follow up and end as a decent trilogy.\r\n\r\n5/10", "created_at": "2016-04-24T14:01:35.254Z"}, {"movie_id": 299687, "review_id": "57d4843ec3a36855680079c7", "author_rating": 2.0, "review_text": "Here we go again, another female empowered teen movie. HW seem to be literally pumping this garbage out for the last few years. Is it any wonder why movie sales are down with garbage like this on the shelf? Designed to be for all those teens who like the idea of blood, but really don't want to see it (think twilight, hunger games etc). Save your money and 1h50m of your time and skip.\r\nIf you really need to see it, in brief it's about a 16 year old girls world turned upside down by an 'alien' invasion when her brother is taken by supposed US army to fight the aliens and father is shot. Befriended by one of 'the others' helps to get the aliens on the run.\r\nNifty idea, however for me falls way short as you don't see any real 'aliens', mediocre acting and story line is very predicable. Look for it in the bargain bin at videoezy in 12 months.", "created_at": "2016-09-10T22:07:58.016Z"}, {"movie_id": 299687, "review_id": "57e5cca7925141413f003f3e", "author_rating": 2.0, "review_text": "It's like someone read _The Road_ and went \"Oh hey, that was pretty good, I know how I can ruin it!\". It's a worse _Hunger Games_ movie than even the last _Hunger Games_ movie was. It's the kind of film where after the opening scene, there is a 40 minute flashback sequence of pure awkward exposition. It's the kind of film that manages to avoid being \"offensively bad\" by by the skin of its teeth, only because it is instead \"embarrassingly bad\". It's the kind of film that thinks it's going to get a sequel, so it resolves **nothing**, but that sequel will never happen.\r\n\r\nI terms of acting? Look, Liev Schreiber was okay, but his role is both minor and beneath him. Chloe Grace Moretz has never been worse. Even Maika Monroe who was amazing in _It Follows_ and _The Guest_ is absolutely awful in this. Everyone else was terrible. There are so many moments in The _5th Wave_ that had me shaking my head, and the acting, dialogue and plot are all equally to blame.\r\n\r\nOh. And the CGI fuckin' sucks.\r\n\r\n_Final rating:★ - Of no value._", "created_at": "2016-09-24T00:45:27.080Z"}, {"movie_id": 299687, "review_id": "5e2f293e1685da0011e9ca24", "author_rating": 2.0, "review_text": "The 6th wave was the wave of people leaving the theater during the movie.﻿", "created_at": "2020-01-27T18:17:34.365Z"}, {"movie_id": 299687, "review_id": "60994fc8e263bb003c29be02", "author_rating": 3.0, "review_text": "This is so utterly terrible, I don't know where to begin. The most obvious? The writing is some of the worst I've ever experienced.\r\n\r\nChloë and Maika, what were you thinking?? Please get better agents.", "created_at": "2021-05-10T15:22:48.687Z"}, {"movie_id": 299687, "review_id": "640b2e42326ec100e7c26cdb", "author_rating": 5.0, "review_text": "\"The 5th Wave\" is a science-fiction thriller directed by J Blakeson and starring Chloe Grace Moretz, Matthew Zuk, and Gabriela Lopez. The film is based on the novel of the same name by Rick Yancey and was released in 2016.\r\n\r\nThe story is set in a world that has been devastated by a series of four catastrophic waves, including an electromagnetic pulse that destroys all electronics and a deadly virus that kills billions of people. The survivors are left to fend for themselves against an alien invasion, with no idea of when or how the fifth wave will come.\r\n\r\nThe film follows Cassie Sullivan, played by Moretz, as she tries to survive in this new world and rescue her younger brother, who has been taken by the military. The movie is filled with action, suspense, and emotional moments, as Cassie encounters both human and alien enemies on her journey.\r\n\r\nMoretz delivers a strong performance as Cassie, a determined and resourceful protagonist who is forced to make difficult choices to survive. The supporting cast, including Zuk and Lopez, also do a commendable job in their respective roles.\r\n\r\nThe film's special effects and action sequences are impressive, with intense fight scenes and thrilling moments of survival. The cinematography is also noteworthy, with beautiful shots of the desolate landscape and eerie depictions of the alien invasion.\r\n\r\nHowever, despite these positive aspects, \"The 5th Wave\" falls short in its execution of the story. The pacing of the film is uneven, with a slow buildup to the action and a rushed conclusion that leaves some questions unanswered. Additionally, some of the plot points feel contrived or predictable.\r\n\r\nOverall, \"The 5th Wave\" is a solid science-fiction thriller with some impressive elements but ultimately fails to live up to its full potential. I would rate it a 5 out of 10. While it is an entertaining movie with strong performances and exciting action sequences, the flaws in its storytelling prevent it from being a truly great film.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:18:58.424Z"}, {"movie_id": 299687, "review_id": "56a6cb0392514129fe001383", "author_rating": null, "review_text": "Well, the young adult movie adaptation genre continues to percolate despite the farewell sentiments as demonstrated by hugely popular products meant to entice the teen scene such as the Twilight, Divergent, Maze Runner and The Hunger Games film series. Sure, why not tamper with a proven formula that guarantees all the right ingredients to tap into the angst-ridden world of young feminine empowerment set against a background of apocalyptic strife and undefined self-discovery? In director J Blakeson’s drippy and derivative dystopian drama The 5th Wave we are introduced to another similar sci-fi serving of a disillusioned heroine out to reflect some consciousness in a boundary of uncertainly and destructive despair. Sadly, The 5th Wave is nothing more than a stillborn alien invasion soap opera that wants to spout off its Hunger Games-esque copycat coating but fails to delve into anything remotely original or bitingly daring.\r\n\r\nThe 5th Wave is the literary brainchild of novelist Rick Yancey’s printed pages as he brings to life the trials and tribulations of tenacious teen tart Cassie Sullivan (Chloe Grace Moretz from “Kick-Ass”), a timid tyke-turned-guerilla warfare gal whose guts and gumption to find and protect her little brother during a full-scale alien invasion of the planet is put forth in flimsy animated fashion. Actually the young actress Moretz, a veteran of a few films already lodged under her belt, has quite a feisty presence on screen and more than holds her own as the “princess of panic” in the generic doomsday drama that really brings nothing to the tension-filled table.\r\n\r\nThe material that Moretz is obligated to bring to life feels rather strained and stilted because the YA creative cloud hovers over the proceedings in a predictable, syrupy manner. The 5th Wave lacks the intensity and philosophical fiber that The Hunger Games effortlessly put forth in imaginable conception. Plus, the energy and bombastic buzz of Hunger Games imitator Divergent does not seem to be part of The 5th Wave’s anemic pulse. Incredibly, Blakeson’s lean and lacking futuristic feminine fable incorporates a cinematic stew of film flavors that heavily echoes such solid blueprints as everything from Red Dawn and Independence Day to the WOW-factor of blockbusters in Jurassic Park and Starship Troopers. The sad part is that even with the borrowing of these cinematic ideas The 5th Wave still registers as a limp alien invasion actioner without much punch or promise. The film is well-intentioned in its YA-oriented gravitas but will soon be dismissed as another Hunger Games wannabe going through the motions.\r\n\r\nAs with the inspired makeup that is at the root of these conventional YA melodramas, The 5th Wave offers its share of youth-minded dire and doom, romantic exploration and the element of military-style redemption and rebellion. As Moretz’s Callie is called into action among the devastating ruins she is determined to reunite with her last surviving  relative Sam (Zackary Arthur). Soon, this mild-mannered schoolgirl has to whip into shape and protect the interests of her deteriorating community as the hard-nosed alien invaders look to wreak havoc and take over the world–or at least Callie’s part of the world that has her fellow citizens shocked and stunned.\r\n\r\nPoor Cassie…in addition to her mind focusing on locating her sibling, revving up for her showdown with the alien intruders and shaking of her vulnerabilities she is caught in a love triangle that tests her limits. Should Cassie fall for the dashing and daring Ben (Nick Robinson, “Jurassic World”), a fellow classmate about to enroll into the junior start-up army looking to combat the unwelcomed visitors or should her confused heart throb for backwoods bad boy Evan Walker (Alex Roe)? Also, how would Cassie feel if she discovers that her hunk-in-training may have a thing for the ravaging rough-around-the-edges recruit Ringer (Maika Monroe). Ah, love among the languishing landscape!\r\n\r\nIt is definitely the consensus that The 5th Wave may not be included in the Mount Rushmore of youth-friendly dystopias merely because it is nothing more than a shadowy reminiscence of the more defining, developed and decisive babes-in-the-woods boisterous actions. Even when not just comparing The 5th Wave to its better conceived contemporaries it dos not feel comfortable in its own mediocrity when standing on its own two feet. It is compelling only for its goal in pushing the conveyor belt of sci-fi YA duds to uphold Hollywood’s attempt to kidnap the psyche of young moviegoers looking for the next big screen teen scene sensation to boost box office receipts.\r\n\r\nSorry but there is no need to take out the sci-fi surfing board for the tepid trappings of The 5th Wave. \r\n\r\nThe 5th Wave (2016)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\n1 hr 53 mins.\r\n\r\nStarring: Chloe Grace Moretz, Nick Robinson, Alex Roe, Liev Schreiber, Maria Bello, Ron Livingston, Maika Monroe, Maggie Siff, and Zackary Arthur\r\n\r\nDirected by: J Blakeson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Teen Fantasy/Drama/Alien Invasion Thriller\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2016", "created_at": "2016-01-26T01:25:23.254Z"}, {"movie_id": 299687, "review_id": "571cd1bf925141342b000ac8", "author_rating": 5.0, "review_text": "> Another teen film trilogy, alien invasion theme on a roll.\r\n\r\nThe 80s teen films were different, (like the recent one 'Turbo Kid') especially those I watched when I was growing up in the late 90s and early 2000s. But now most of them are dystopian action-adventure-fantasy/sci-fi themes, and obviously trilogies with high end graphics. I won't blame for that, the time has come for a change, the movies have technical qualities and they know how to render them, but the stories are terrible.\r\n\r\nTo me this was just an okay film. Felt like the action-adventure versions of 'The Host', but I loved that one, not this. I know it's a trilogy, so, more stories to come with more explanations, but the first film in a series is always important and it failed to impress me. This installment is all about a teen girl and her younger brother. After getting separated during the chaos of alien invasion, she goes to look for him and that's the film.\r\n\r\nThis might be the finer contents for a book, but for a movie, it is not that any special. I did not like the ending as well, felt like it was so stupid. Even some B films got better conclusion and stunt sequences. I feel bad for Chloe Moretz for taking up this project. She should do more action films like 'Kick-Ass'. I thought she would be the one who's going to replace Angelina Jolie. I can only hope for this series to get better in the follow up and end as a decent trilogy.\r\n\r\n5/10", "created_at": "2016-04-24T14:01:35.254Z"}, {"movie_id": 299687, "review_id": "57d4843ec3a36855680079c7", "author_rating": 2.0, "review_text": "Here we go again, another female empowered teen movie. HW seem to be literally pumping this garbage out for the last few years. Is it any wonder why movie sales are down with garbage like this on the shelf? Designed to be for all those teens who like the idea of blood, but really don't want to see it (think twilight, hunger games etc). Save your money and 1h50m of your time and skip.\r\nIf you really need to see it, in brief it's about a 16 year old girls world turned upside down by an 'alien' invasion when her brother is taken by supposed US army to fight the aliens and father is shot. Befriended by one of 'the others' helps to get the aliens on the run.\r\nNifty idea, however for me falls way short as you don't see any real 'aliens', mediocre acting and story line is very predicable. Look for it in the bargain bin at videoezy in 12 months.", "created_at": "2016-09-10T22:07:58.016Z"}, {"movie_id": 299687, "review_id": "57e5cca7925141413f003f3e", "author_rating": 2.0, "review_text": "It's like someone read _The Road_ and went \"Oh hey, that was pretty good, I know how I can ruin it!\". It's a worse _Hunger Games_ movie than even the last _Hunger Games_ movie was. It's the kind of film where after the opening scene, there is a 40 minute flashback sequence of pure awkward exposition. It's the kind of film that manages to avoid being \"offensively bad\" by by the skin of its teeth, only because it is instead \"embarrassingly bad\". It's the kind of film that thinks it's going to get a sequel, so it resolves **nothing**, but that sequel will never happen.\r\n\r\nI terms of acting? Look, Liev Schreiber was okay, but his role is both minor and beneath him. Chloe Grace Moretz has never been worse. Even Maika Monroe who was amazing in _It Follows_ and _The Guest_ is absolutely awful in this. Everyone else was terrible. There are so many moments in The _5th Wave_ that had me shaking my head, and the acting, dialogue and plot are all equally to blame.\r\n\r\nOh. And the CGI fuckin' sucks.\r\n\r\n_Final rating:★ - Of no value._", "created_at": "2016-09-24T00:45:27.080Z"}, {"movie_id": 299687, "review_id": "5e2f293e1685da0011e9ca24", "author_rating": 2.0, "review_text": "The 6th wave was the wave of people leaving the theater during the movie.﻿", "created_at": "2020-01-27T18:17:34.365Z"}, {"movie_id": 299687, "review_id": "60994fc8e263bb003c29be02", "author_rating": 3.0, "review_text": "This is so utterly terrible, I don't know where to begin. The most obvious? The writing is some of the worst I've ever experienced.\r\n\r\nChloë and Maika, what were you thinking?? Please get better agents.", "created_at": "2021-05-10T15:22:48.687Z"}, {"movie_id": 299687, "review_id": "640b2e42326ec100e7c26cdb", "author_rating": 5.0, "review_text": "\"The 5th Wave\" is a science-fiction thriller directed by J Blakeson and starring Chloe Grace Moretz, Matthew Zuk, and Gabriela Lopez. The film is based on the novel of the same name by Rick Yancey and was released in 2016.\r\n\r\nThe story is set in a world that has been devastated by a series of four catastrophic waves, including an electromagnetic pulse that destroys all electronics and a deadly virus that kills billions of people. The survivors are left to fend for themselves against an alien invasion, with no idea of when or how the fifth wave will come.\r\n\r\nThe film follows Cassie Sullivan, played by Moretz, as she tries to survive in this new world and rescue her younger brother, who has been taken by the military. The movie is filled with action, suspense, and emotional moments, as Cassie encounters both human and alien enemies on her journey.\r\n\r\nMoretz delivers a strong performance as Cassie, a determined and resourceful protagonist who is forced to make difficult choices to survive. The supporting cast, including Zuk and Lopez, also do a commendable job in their respective roles.\r\n\r\nThe film's special effects and action sequences are impressive, with intense fight scenes and thrilling moments of survival. The cinematography is also noteworthy, with beautiful shots of the desolate landscape and eerie depictions of the alien invasion.\r\n\r\nHowever, despite these positive aspects, \"The 5th Wave\" falls short in its execution of the story. The pacing of the film is uneven, with a slow buildup to the action and a rushed conclusion that leaves some questions unanswered. Additionally, some of the plot points feel contrived or predictable.\r\n\r\nOverall, \"The 5th Wave\" is a solid science-fiction thriller with some impressive elements but ultimately fails to live up to its full potential. I would rate it a 5 out of 10. While it is an entertaining movie with strong performances and exciting action sequences, the flaws in its storytelling prevent it from being a truly great film.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:18:58.424Z"}, {"movie_id": 299687, "review_id": "56a6cb0392514129fe001383", "author_rating": null, "review_text": "Well, the young adult movie adaptation genre continues to percolate despite the farewell sentiments as demonstrated by hugely popular products meant to entice the teen scene such as the Twilight, Divergent, Maze Runner and The Hunger Games film series. Sure, why not tamper with a proven formula that guarantees all the right ingredients to tap into the angst-ridden world of young feminine empowerment set against a background of apocalyptic strife and undefined self-discovery? In director J Blakeson’s drippy and derivative dystopian drama The 5th Wave we are introduced to another similar sci-fi serving of a disillusioned heroine out to reflect some consciousness in a boundary of uncertainly and destructive despair. Sadly, The 5th Wave is nothing more than a stillborn alien invasion soap opera that wants to spout off its Hunger Games-esque copycat coating but fails to delve into anything remotely original or bitingly daring.\r\n\r\nThe 5th Wave is the literary brainchild of novelist Rick Yancey’s printed pages as he brings to life the trials and tribulations of tenacious teen tart Cassie Sullivan (Chloe Grace Moretz from “Kick-Ass”), a timid tyke-turned-guerilla warfare gal whose guts and gumption to find and protect her little brother during a full-scale alien invasion of the planet is put forth in flimsy animated fashion. Actually the young actress Moretz, a veteran of a few films already lodged under her belt, has quite a feisty presence on screen and more than holds her own as the “princess of panic” in the generic doomsday drama that really brings nothing to the tension-filled table.\r\n\r\nThe material that Moretz is obligated to bring to life feels rather strained and stilted because the YA creative cloud hovers over the proceedings in a predictable, syrupy manner. The 5th Wave lacks the intensity and philosophical fiber that The Hunger Games effortlessly put forth in imaginable conception. Plus, the energy and bombastic buzz of Hunger Games imitator Divergent does not seem to be part of The 5th Wave’s anemic pulse. Incredibly, Blakeson’s lean and lacking futuristic feminine fable incorporates a cinematic stew of film flavors that heavily echoes such solid blueprints as everything from Red Dawn and Independence Day to the WOW-factor of blockbusters in Jurassic Park and Starship Troopers. The sad part is that even with the borrowing of these cinematic ideas The 5th Wave still registers as a limp alien invasion actioner without much punch or promise. The film is well-intentioned in its YA-oriented gravitas but will soon be dismissed as another Hunger Games wannabe going through the motions.\r\n\r\nAs with the inspired makeup that is at the root of these conventional YA melodramas, The 5th Wave offers its share of youth-minded dire and doom, romantic exploration and the element of military-style redemption and rebellion. As Moretz’s Callie is called into action among the devastating ruins she is determined to reunite with her last surviving  relative Sam (Zackary Arthur). Soon, this mild-mannered schoolgirl has to whip into shape and protect the interests of her deteriorating community as the hard-nosed alien invaders look to wreak havoc and take over the world–or at least Callie’s part of the world that has her fellow citizens shocked and stunned.\r\n\r\nPoor Cassie…in addition to her mind focusing on locating her sibling, revving up for her showdown with the alien intruders and shaking of her vulnerabilities she is caught in a love triangle that tests her limits. Should Cassie fall for the dashing and daring Ben (Nick Robinson, “Jurassic World”), a fellow classmate about to enroll into the junior start-up army looking to combat the unwelcomed visitors or should her confused heart throb for backwoods bad boy Evan Walker (Alex Roe)? Also, how would Cassie feel if she discovers that her hunk-in-training may have a thing for the ravaging rough-around-the-edges recruit Ringer (Maika Monroe). Ah, love among the languishing landscape!\r\n\r\nIt is definitely the consensus that The 5th Wave may not be included in the Mount Rushmore of youth-friendly dystopias merely because it is nothing more than a shadowy reminiscence of the more defining, developed and decisive babes-in-the-woods boisterous actions. Even when not just comparing The 5th Wave to its better conceived contemporaries it dos not feel comfortable in its own mediocrity when standing on its own two feet. It is compelling only for its goal in pushing the conveyor belt of sci-fi YA duds to uphold Hollywood’s attempt to kidnap the psyche of young moviegoers looking for the next big screen teen scene sensation to boost box office receipts.\r\n\r\nSorry but there is no need to take out the sci-fi surfing board for the tepid trappings of The 5th Wave. \r\n\r\nThe 5th Wave (2016)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\n1 hr 53 mins.\r\n\r\nStarring: Chloe Grace Moretz, Nick Robinson, Alex Roe, Liev Schreiber, Maria Bello, Ron Livingston, Maika Monroe, Maggie Siff, and Zackary Arthur\r\n\r\nDirected by: J Blakeson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Teen Fantasy/Drama/Alien Invasion Thriller\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2016", "created_at": "2016-01-26T01:25:23.254Z"}, {"movie_id": 299687, "review_id": "571cd1bf925141342b000ac8", "author_rating": 5.0, "review_text": "> Another teen film trilogy, alien invasion theme on a roll.\r\n\r\nThe 80s teen films were different, (like the recent one 'Turbo Kid') especially those I watched when I was growing up in the late 90s and early 2000s. But now most of them are dystopian action-adventure-fantasy/sci-fi themes, and obviously trilogies with high end graphics. I won't blame for that, the time has come for a change, the movies have technical qualities and they know how to render them, but the stories are terrible.\r\n\r\nTo me this was just an okay film. Felt like the action-adventure versions of 'The Host', but I loved that one, not this. I know it's a trilogy, so, more stories to come with more explanations, but the first film in a series is always important and it failed to impress me. This installment is all about a teen girl and her younger brother. After getting separated during the chaos of alien invasion, she goes to look for him and that's the film.\r\n\r\nThis might be the finer contents for a book, but for a movie, it is not that any special. I did not like the ending as well, felt like it was so stupid. Even some B films got better conclusion and stunt sequences. I feel bad for Chloe Moretz for taking up this project. She should do more action films like 'Kick-Ass'. I thought she would be the one who's going to replace Angelina Jolie. I can only hope for this series to get better in the follow up and end as a decent trilogy.\r\n\r\n5/10", "created_at": "2016-04-24T14:01:35.254Z"}, {"movie_id": 299687, "review_id": "57d4843ec3a36855680079c7", "author_rating": 2.0, "review_text": "Here we go again, another female empowered teen movie. HW seem to be literally pumping this garbage out for the last few years. Is it any wonder why movie sales are down with garbage like this on the shelf? Designed to be for all those teens who like the idea of blood, but really don't want to see it (think twilight, hunger games etc). Save your money and 1h50m of your time and skip.\r\nIf you really need to see it, in brief it's about a 16 year old girls world turned upside down by an 'alien' invasion when her brother is taken by supposed US army to fight the aliens and father is shot. Befriended by one of 'the others' helps to get the aliens on the run.\r\nNifty idea, however for me falls way short as you don't see any real 'aliens', mediocre acting and story line is very predicable. Look for it in the bargain bin at videoezy in 12 months.", "created_at": "2016-09-10T22:07:58.016Z"}, {"movie_id": 299687, "review_id": "57e5cca7925141413f003f3e", "author_rating": 2.0, "review_text": "It's like someone read _The Road_ and went \"Oh hey, that was pretty good, I know how I can ruin it!\". It's a worse _Hunger Games_ movie than even the last _Hunger Games_ movie was. It's the kind of film where after the opening scene, there is a 40 minute flashback sequence of pure awkward exposition. It's the kind of film that manages to avoid being \"offensively bad\" by by the skin of its teeth, only because it is instead \"embarrassingly bad\". It's the kind of film that thinks it's going to get a sequel, so it resolves **nothing**, but that sequel will never happen.\r\n\r\nI terms of acting? Look, Liev Schreiber was okay, but his role is both minor and beneath him. Chloe Grace Moretz has never been worse. Even Maika Monroe who was amazing in _It Follows_ and _The Guest_ is absolutely awful in this. Everyone else was terrible. There are so many moments in The _5th Wave_ that had me shaking my head, and the acting, dialogue and plot are all equally to blame.\r\n\r\nOh. And the CGI fuckin' sucks.\r\n\r\n_Final rating:★ - Of no value._", "created_at": "2016-09-24T00:45:27.080Z"}, {"movie_id": 299687, "review_id": "5e2f293e1685da0011e9ca24", "author_rating": 2.0, "review_text": "The 6th wave was the wave of people leaving the theater during the movie.﻿", "created_at": "2020-01-27T18:17:34.365Z"}, {"movie_id": 299687, "review_id": "60994fc8e263bb003c29be02", "author_rating": 3.0, "review_text": "This is so utterly terrible, I don't know where to begin. The most obvious? The writing is some of the worst I've ever experienced.\r\n\r\nChloë and Maika, what were you thinking?? Please get better agents.", "created_at": "2021-05-10T15:22:48.687Z"}, {"movie_id": 299687, "review_id": "640b2e42326ec100e7c26cdb", "author_rating": 5.0, "review_text": "\"The 5th Wave\" is a science-fiction thriller directed by J Blakeson and starring Chloe Grace Moretz, Matthew Zuk, and Gabriela Lopez. The film is based on the novel of the same name by Rick Yancey and was released in 2016.\r\n\r\nThe story is set in a world that has been devastated by a series of four catastrophic waves, including an electromagnetic pulse that destroys all electronics and a deadly virus that kills billions of people. The survivors are left to fend for themselves against an alien invasion, with no idea of when or how the fifth wave will come.\r\n\r\nThe film follows Cassie Sullivan, played by Moretz, as she tries to survive in this new world and rescue her younger brother, who has been taken by the military. The movie is filled with action, suspense, and emotional moments, as Cassie encounters both human and alien enemies on her journey.\r\n\r\nMoretz delivers a strong performance as Cassie, a determined and resourceful protagonist who is forced to make difficult choices to survive. The supporting cast, including Zuk and Lopez, also do a commendable job in their respective roles.\r\n\r\nThe film's special effects and action sequences are impressive, with intense fight scenes and thrilling moments of survival. The cinematography is also noteworthy, with beautiful shots of the desolate landscape and eerie depictions of the alien invasion.\r\n\r\nHowever, despite these positive aspects, \"The 5th Wave\" falls short in its execution of the story. The pacing of the film is uneven, with a slow buildup to the action and a rushed conclusion that leaves some questions unanswered. Additionally, some of the plot points feel contrived or predictable.\r\n\r\nOverall, \"The 5th Wave\" is a solid science-fiction thriller with some impressive elements but ultimately fails to live up to its full potential. I would rate it a 5 out of 10. While it is an entertaining movie with strong performances and exciting action sequences, the flaws in its storytelling prevent it from being a truly great film.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:18:58.424Z"}]