[{"movie_id": 10625, "review_id": "57b0cd85c3a3684323000efc", "author_rating": 8.0, "review_text": "I hardly ever watch contemporary American comedies in which most of the top cast are women (I still haven't seen either 'Clueless', 'Bridesmaids' or 'Heathers', for example), but recently I enjoyed 'The Devil Wears Prada', I have liked both Lindsay Lohan (especially in 'Bobby' and 'The Prairie Home Companion') and Rachel McAdams (most significantly in 'Redeye' and 'Passion'), so knowing that one of my favourite SNL comediennes, Tina Fey, both wrote and co-starred in this, made me give it a shot. It being critically lauded by some male cinephiles I trust didn't hurt matters, either.\r\n\r\nIt was full of laughs and subtly got across its points about 21st-century American society and of the growing pains for young women in its high school shenanigans. 'Mean Girls' is definitely worth the trouble to find and to give a try yourself. It left me enthusiastically wishing Ms. Lohan can sort out her personal troubles and get back to acting, where she belongs.", "created_at": "2016-08-14T19:59:01.038Z"}, {"movie_id": 10625, "review_id": "5cb07e609251412fb023c6f6", "author_rating": 9.0, "review_text": "_Mean Girls_ has absolutely no business being as phenomenal as it is. None at all. If you've read many enough my reviews to get any sort of indication as to the sort of cinema I am in to, then you could be forgiven for assuming I wouldn't be a fan. After all, _Mean Girls_ is about as far away from my wheelhouse as a movie could conceivably be. But I fucking **love** it. And I honestly can't tell you why. Every single piece of _Mean Girls_ examined in isolation, is something I despise. Every trope, formula, format, cliche, device and style choice is something I have ragged on a hundred times before in different reviews, but for whatever reason, I cannot put _Mean Girls_ down. I don't think a single year has gone by since I first saw it in the late '00s that I haven't rewatched it. Usually, multiple times a year. Inexplicable, but there it is.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._", "created_at": "2019-04-12T12:02:40.265Z"}]