[{"movie_id": 341174, "review_id": "597e063fc3a3685417018825", "author_rating": 6.0, "review_text": "**The next fifty shades between an ordinary woman and a billionaire.**\r\n\r\nThe film was not received well as the book was. Just like the first film, it has been another below average. Might be because of its theme. Usually this kind of films do great business, but ratings and reviews does not praise or encourage the film. So I doubt anybody will be bored of it, which means watchable film and instead it won't be their favourite.\r\n\r\nThe story continued and this time it was not based on experiment or any kind of agreement, but mutual understanding. So the billionaire Grey and Ana's erotic adventure sustains. With the small-small developments the film goes all the way to the ending. That means, those who are watching it for the selected scenes, will surely would have a nice time. But nothing was strong as any European film on the similar theme.\r\n\r\nApart from the weak storyline, there's nothing wrong with it. As to what this film is about, it served better. That's what I say to you not to expect full storied romance-drama. As usual the actors were good and another two films to come in the 'Fifty Shades' franchise. I hope they can be better than the first two. Overall, it is only for the selected audience, but curiosity makes everybody watch it and they all pour they perspective which is flooded with average to negative. Otherwise, it is an acceptable film.\r\n\r\n_6/10_", "created_at": "2017-07-30T16:15:59.112Z"}, {"movie_id": 341174, "review_id": "63c1e284e16e5a0092b44768", "author_rating": 1.0, "review_text": "Ok, my fiance loves these films (but she's worse than me when it comes to sex in movies, and I'll sit through some serious crap for it) so we went to go see it on Valentines Day.\r\n\r\nAnd I am going to point out the problem, and I will do it by quoting the synopsis:\r\n\r\n\"Anastasia must confront the anger and envy of the women who came before her.\"\r\n\r\nYeah, that takes all of about 5 minutes of time in the film. It's the plot of the movie...and it takes about 5 minutes total. The problem is solved really quickly, in the middle of the film, and never comes up again.\r\n\r\nIt's like an after thought....but it's the plot.\r\n\r\nI've seen movies based on T and A in the past that have actually more plot focus than this.\r\n\r\nBut let's be honest, you are only watching it for the BDSM (which it is also light on) so I can't even give it 10 stars for that, and I am an easy grader when it comes to most movie reviews.", "created_at": "2023-01-13T23:00:20.552Z"}]