[{"movie_id": 1683, "review_id": "5e21db8bcf4b8b0014f146b9", "author_rating": 4.0, "review_text": "The Reaping harvests souls of the religiously devoted by subjecting them to this. “What hath God wrought?”. If ever there was a tagline that would instantly persuade audiences to leap up from their sofas, drive to the nearest cinema complex and purchase a couple of tickets, it’s this one. Sure, using a phrase from the Book of Numbers (as opposed to Exodus which is the primary plot device of the film...) certainly sets the religiously inclined tone, that eventually dissolves into the plagued river of blood but more on that later. It also indicates the unimaginative stupidity that ensues, leaving logic and science behind for a faith-based apocalyptic tale that is in need of some serious stoning. A professor in debunking miracles is invited to investigate a “river of blood” in the nearby town of Haven, but is quickly ensnared in an apocalyptic mystery.\r\n\r\nWhilst not the worst horror film in the existence of cinema, with a tepid schlocky tone that somewhat juxtaposes the devoted Christian ideologies presented, yet is so inexplicably dumb that it will leave you questioning why such a film was created in the first place. Its initial introduction commenced with much promise. Science against religion. Simple logical explanations explaining what many describe as religious miracles. Yes, it’s relatively on the nose and misses the point of acquiring faith, yet remained an interesting direction for the first half that managed to conjure up various problematic conversations.\r\n\r\nHot off her Oscar win, swanky Swank muddles through this unusual mystery with much trepidation, choosing not to believe that the plagues of Egypt condemning Haven are in fact coincidental, offering scientific explanations. Algae bloom for the “blood river” that has the consistency of red-dyed water (sorry not sorry...). Infections terminating frogs, that is never explained how they fell from the sky, but whatever. Flies consuming the flesh of the frogs, and you get the idea. She remains unconvinced throughout these biblical mishaps, and provides an interesting angle.\r\n\r\nWell, that is until about halfway through when she switches from being Bill Nye the Science Guy to Pope Francis of the Vatican. Suddenly she has faith, despite her tragic backstory clumsily spliced with the main plot, and holy reaping balls do events get crazy. CGI locust infestation, satanic cult crazes and a thunderstorm of fire that incinerates life in a matter of seconds. It went from a minor science experiment to absolute chaos, quicker than a snap of your fingers. The change of pace is so jarring and bewildering, that when the predictably obtuse third act arrives you’re stunned into silence. The tantalising debunking approach now plagued by, well, the plagues. The mystery is ham-fisted and makes no sense whatsoever. Constant flashbacks providing clues, more like clear answers mind you, were choppy and fragmented. It’s not scary in the slightest. Main characters are expended and forgotten about almost instantly, a shame considering Elba was decent as always. And what’s Rea’s purpose in this? No seriously. Except for providing basic exposition, he seemed pointless in this endeavour.\r\n\r\nA very minuscule part of my soul wants to like this for being the barking mad mystery that it is. To an extent, it is watchable if you know to turn your brain off and devour all the spiel on religious provocations, despite the interesting first act. It has this surreal allure, making each watch tolerable. But then I think back to the last thirty minutes and I then really want to experience all ten plagues for myself. Incomprehensibly ludicrous. What hath God wrought you ask? This.", "created_at": "2020-01-17T16:06:35.817Z"}, {"movie_id": 1683, "review_id": "60e4acee83ee670027c3d83a", "author_rating": 6.0, "review_text": "_**Intriguing first act gives way to dull second act, but decent ending**_\r\n\r\nReleased in 2007, \"The Reaping\" is a about a former ordained missionary who's now a professor who debunks supposed miracles around the world (Hilary Swank). She and her assistant (Idris Elba) venture to a bayou town where, amazingly, the ten plagues of Exodus are manifesting (!). David Morrissey plays their host in the town while AnnaSophia Robb plays the 12 year-old focal point of the plagues. Are the plagues real or can they be scientifically explained? If they're real, who's the source, God or the devil?\r\n\r\nThis is a haunting mystery horror film rather than a monster/slasher movie, so if you're looking for the latter don't bother. That said, this is an extremely well-made production. The visuals of the various plagues are awesome, particularly the bayou turning to blood, the locusts and fire raining from the sky. Moreover, Swank looks super sharp in the manner of Raquel Welch (neither are my type, but who can deny their looks that kill?). Elba is a likable partner and Morrissey seems creepy from the get-go. As for AnnaSophia, it's clear even at 12 years of age that she was gonna morph into a curvy cutie.\r\n\r\nWhere the movie goes wrong are elements of the story/script. It starts out good and is intriguing for the first 45 minutes or so, but then the next 30 minutes seriously lag. When the plot twist is revealed in the last act it turned me off the first time I watched the film, but I was braced for it with my second viewing and was able to accept it. The ending, while cartoonish, is spectacular in the manner of the end of \"Raiders of the Lost Ark.\" So this is a solid mystery/horror movie, but it could've been better if they worked out the kinks in the screenplay, like the draggy second act and unsavory plot twist.\r\n\r\nThe film runs 99 minutes and was shot in St. Francisville, Louisiana (the bayou town), Louisiana State University in Baton Rouge, Shreveport & New Orleans, Louisiana, as well as San Juan, Porta Rico (the opening sequence) and Austin Texas.\r\n\r\nGRADE: B-", "created_at": "2021-07-06T19:20:14.542Z"}]