[{"movie_id": 312221, "review_id": "568bbe1b9251411334024664", "author_rating": 9.0, "review_text": "one of best boxing movie i ever watched...it's a spin off to the original rocky series....Michael B. Jordan is perfect in his role...it's maybe one of the Sylvester Stallone's best performance till the date...the boxing scenes are really good....Ryan Coogler done a great job...must watch if u love boxing...", "created_at": "2016-01-05T12:59:08.001Z"}, {"movie_id": 312221, "review_id": "56cdebf5c3a368127f0000fb", "author_rating": 8.0, "review_text": "> CREED is the new ROCKY.\r\n\r\nHonestly, I was looking for the 7th film in the 'Rocky' series, so this spinoff was totally unexpected. But it is the right thing since the Rocky Balboa is getting old. Besides, in this reboot era, keeping franchise alive and leaping into the next generation was a very smart move. By doing this, they're keeping the original series fans with them to back it. I hope this will only get going like the Bond movies, since the young star, Jordan has another 30+ year potential to continue the 'Rocky' legacy by delivering some hits in his belt.\r\n\r\nI don't know how they have done it, just kept everything so simple yet delivered a successful movie. The director of 'Fruitvale Station' and its actor Jordan's second successive run. I wish the combo return for the third time for another grand scale flick. Of course Stallone's presence made a big difference, but the way his character was portrayed, I feel the next film will get more emotional, especially between Rocky and Adonis like Rocky and Micky. And I'm also hoping for a bit better romantic tale on the side.\r\n\r\nI grew up watching 'Rocky' movies, so I wanted badly it to be at least a decent, but it is a fantastic flick and I definitely suggest for those people like me. The youngsters as well can taste the new beginning in the Rocky legacy. CREED is the new ROCKY. The blueprint for the screenplay was exactly same as the original movies, even the music was very comparable yet everything was updated to the current timeline. Now I'm looking for a follow-up in the next 3 years.\r\n\r\n8/10", "created_at": "2016-02-24T17:44:21.178Z"}, {"movie_id": 312221, "review_id": "56e25218c3a368700b0015ec", "author_rating": 5.0, "review_text": "Так себе. Местами пафос просто прет наружу - даже противно смотреть. Сюжет вытянет из пальца, особенно не понравилось наличие больных в фильме: девушка музыкант, теряющая слух и рокки у которого находят рак. Если бы не фильмы про рокки, то я в принципе сомневаюсь, что фильм бы заметили.", "created_at": "2016-03-11T05:05:28.349Z"}, {"movie_id": 312221, "review_id": "6379bb745b2f47007fd6be39", "author_rating": 9.0, "review_text": "**Creed celebrates all the Rocky films that came before while establishing a fresh new direction for the franchise.**\r\n\r\nAfter decades of Rocky movies, with recent entries leading us all to believe the franchise's best days were behind us, Creed burst onto the big screen, proving everyone wrong. Creed is a legacy sequel in league with films like Top Gun: Maverick. The performances, the cinematography, the sets, the fight choreography, and the soundtrack were all incredible. But the most outstanding element of Creed was the writing. The decisions made to enhance the story were BRILLIANT! Changing the story to follow the son of Creed rather than Rocky's son and Rocky's battle with cancer showing his same unyielding fight even against a new foe, signal an exciting new era for the Rocky franchise. Creed sets the gold standard for legacy sequels while being a great place to jump in if you're new to the Rocky films.", "created_at": "2022-11-20T05:30:28.321Z"}, {"movie_id": 312221, "review_id": "63a8a746b3316b00ae1578bd", "author_rating": 7.0, "review_text": "Cleverly deducing that he wasn't really fit for the ring himself anymore, Sylvester Stallone engages the services of Ryan Coogler and the hunky Michael B. Jordan to develop this competent spin-off series from his \"Rocky\" franchise. The youngster (rather aptly named \"Adonis\") was born on the wrong side of the blanket, and is leading a life of petty crime when he is adopted by \"Mary Anne\" (Phylicia Rashad), the wife of his father, the late heavyweight champion \"Apollo Creed\". She gives him a home and a decent education and he ends up working in an office, bored out of his tiny mind. Frustrated, he heads to gym seeking training but nobody wants to touch him. Nobody that is, but \"Rocky\" (Stallone) who deicides to teach him the discipline necessary to become a winner. Meantime, the actual world champion - \"Conlan\" (Tony Bellew) is in a bit of a fix with the British prison authorities so an easy defence of his title against the son of a legend looks attractive to his venal manager \"Holiday\" (Graham McTavish). The fight is set - but can the young challenger upset the odds? What this does miss is the Bill Conte score, but otherwise it is a perfectly watchable story of grit and determination, again demonstrating effectively how boxing was a route from poverty and despair for so many across the world - and the fight scenes, especially at the end, look very convincing. I could have been doing with a little more of a backstory of \"Conlan\" - anyone who doesn't appreciate that it is just as tough growing up in Liverpool as in anywhere in the USA isn't really given much opportunity to realise that both boxers here are from the streets, as it were. To be honest, Jordan isn't actually a very good actor, but he is very easy on the eye and Stallone brings just enough class to the proceedings to make this a worthy cousin of the original.", "created_at": "2022-12-25T19:40:54.100Z"}, {"movie_id": 312221, "review_id": "63bf6f50df857c00d9c03a2b", "author_rating": 1.0, "review_text": "So Creeds kid as a good job and boxes on the side for reasons... and wins.\r\n\r\nBut he doesn't want to do underground boxing, he wasn't to make it big like his dad, because he's the bestest of the bestest.\r\n\r\nAnd there is a LITTLE struggle here, a little of the heros journey, but Creed starts out on the top and sort of finishes there too... so he doesn't really grow or change as a character...\r\n\r\n... because modern movies can't have that for reasons.", "created_at": "2023-01-12T02:24:16.319Z"}, {"movie_id": 312221, "review_id": "6402096b9f1be7008ebedf64", "author_rating": 10.0, "review_text": "Creed hits all the best notes of the original Rocky, while also being able to step out from its shadow to deliver a nearly perfect film.\r\n\r\nFrom start to finish, this movie had me invested. It was a brilliant choice to make Apollo Creed’s son the lead of the new franchise. On the surface, Adonis Creed should have it all in terms of wealth and security. But due to him being a bastard child, his life was a struggle, giving him the same hunger that Rocky had in the original, which I thought was done really well.\r\n\r\nThe chemistry between all of our characters is spectacular throughout. There is a deep sense of care that Rocky (Sylvester Stallone) and Adonis (Michael B. Jordan) have for each other. Rocky and Adonis develop a close father-son relationship as Rocky attempts to fill the void left by his estranged relationship with his son, and Adonis sees Rocky as the father figure he's never had. This connection creates some fantastic dramatic story beats that had me on the verge of tears. Bianca (Tessa Thompson) is a fantastic addition to the cast and creates that motherly figure for our two leads. These three take on the roles of Rocky, Adrian, and Mickie from the original while also having their own unique presence. My one complaint is that the opponent, \"Pretty\" Ricky Conlan, is pretty underdeveloped, but the main focus is really on the dynamic between Rocky and Adonis, so this wasn’t a huge drawback for me.\r\n\r\nThe fight choreography is insane in this film; it is without a doubt the best of the series. There is a boxing matchup in the middle of the film that is one take with some incredible angles; it completely immersed me. The ending is really well done, with a super long buildup that had me genuinely nervous for Adonis.\r\n\r\nThe score is fantastic. There are still similar notes from the original Rocky that are subtly present throughout the film. But they are mixed together with contemporary rap beats and rhythms that give the film a modern feel. It is a great homage to the past while also being true to the culture of our lead character.\r\n\r\nOverall, this film surpasses Rocky in almost every way and goes down as the best in the series. I am utterly blown away with how much I enjoyed this.\r\n\r\nScore: 98% |\r\nVerdict: Masterpiece", "created_at": "2023-03-03T14:51:23.678Z"}, {"movie_id": 312221, "review_id": "6487cc54d2b20900ebc18d73", "author_rating": 10.0, "review_text": "I wasn't expecting this movie to be that good. I was blown away by this movie. Way better then all the rocky movies combined. Just the way they play the history of the movie was awesome.", "created_at": "2023-06-13T01:54:28.211Z"}, {"movie_id": 312221, "review_id": "64db9077f495ee0290e5bb5d", "author_rating": 7.0, "review_text": "Creed was a good introduction to a new generation of Rocky movies. Michael B Jordan is great choice to carry on the legacy.", "created_at": "2023-08-15T14:49:27.913Z"}]