[{"movie_id": 450465, "review_id": "5c3fe4d09251416e2dafec00", "author_rating": null, "review_text": "It is hard to believe it has been 19 years since “Unbreakable” arrived in cinemas as the film seemed to setup a sequel but it did not look like it would come to fruition. That all changed in 2016 when “Split” arrived and shocked audiences with a late reveal that showed a connection to the film. Writer/Director M. Night Shyamalan has wasted no time in bringing the new film to fans with the arrival of “GLASS”.  The film picks up soon after the events of “Split” as The Horde embodied by 23 personalities in the form of Kevin Wendell Crumb (James McAvoy) continues to kidnap young girls to serve to his highly dangerous 24th personality The Beast.\r\n\r\nSecurity expert David Dunn (Bruce Willis) along with the help of his son attempts to locate the Horde as a new group of girls has gone missing.  In time David locates The Beast and the two clash; but end up captured by authorities and sent to a facility for evaluation.\r\n\r\nTheir captive Dr. Ellie Staple (Sarah Paulson) believes their special abilities are in their minds and that they really do not have the special abilities they believe they do. Each of them have a special cell designed to restrain them as David is under threat of being doused with water while Kevin has a series of strobes which will halt him and trigger a new personality.\r\n\r\nAdded to the mix is Elijah Price (Samuel L. Jackson), who has been at the facility under heavy sedation after the events of “Unbreakable”.\r\n\r\nAs the therapy unfolds it becomes clear that an elaborate game of cat and mouse is underway between Price and her charges as each seems to have their own agenda.  This all builds to a very unusual final act which left me pondering if I enjoyed the final result or was disappointed with it.\r\n\r\nThe film seems to slowly be building to a big finale but yet it is far more restrained than one would expect. The film has a constant theme of Super Heroes and their traditional stories and roles as well as that of their Super Villains. \r\n\r\nOne expects a massive Battle Royale complete with elaborate FX but the film takes a more restrained approach and in doing so may disappoint some fans while pleasing others. The film naturally has its twist moments and while I will not spoil it, I can say I predicted it before I even saw the film. When I saw “Split” I actually told my wife my theory and low and behold it was true. I also predicted the twists for many of Shyamalan’s previous films so I had hoped for a bit more in this regard. The film does offer up some interesting options for another sequel or Spin-Off and the cast was very good especially McAvoy who adds to his menagerie of characters by showing audiences a few more of the ones previously undisclosed.\r\n\r\nThe film is at times very enjoyable and at times a bit frustrating as it seems to deviate from themes and elements that were setup earlier. That being said it does very much appear that this could indeed be just the start of something much bigger in the series.\r\n\r\n3.5 stars out of 5", "created_at": "2019-01-17T02:13:36.891Z"}, {"movie_id": 450465, "review_id": "5c40a607c3a368216241e59b", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nYou all know how anxious I was about this movie. I’m a huge fan of Shyamalan, and I know how hard it is to try to defend a director who made The Last Airbender. Every time I offer undeniable proof of masterful filmmaking, I get overwhelmed with questions about his absurd twists and his cringe-worthy dialogues. Shyamalan is a bit like Kevin, he also has different personalities, depending on the films he releases. On one side, he is a phenomenal filmmaker who knows his craft better than anyone and who once was nicknamed “the second Spielberg”. A screenwriter who delivers mind-blowing plot twists and extremely captivating dialogue scenes. On the other side, there’s a guy who ruins entire movies with frustrating twists that no one asked for and with arguably horrible decisions regarding his characters. So, to each side does Shyamalan tends to in Glass?\r\n\r\nThe first act is seamless. I love how David is introduced 19 years later and how his life is now. Kevin continues to abduct impure teenage girls, and after a few minutes in, we get the first confrontation between our hero and villain. I wasn't expecting an action-heavy film, and I'm glad it isn't because it would ruin the tone of the other movies. This was never intended to be a massive finale with epic CGI fights, like a Marvel or DC installment. If you're one of those people who expected Glass to be an Infinity War-ish film, I don't even know why are you reading this because you have no idea what this trilogy is about.\r\n\r\nSarah Paulson portrays Dr. Ellie Staple, and she is responsible for treating people who think they are superheroes. So, the second act revolves around a fascinatingly engaging yet overlong narrative which leaves the main characters (and the audience) doubting if everything they did was a product of their supposedly damaged minds. There is so much to love and hate throughout this act. The interactions between these characters are as captivating as they could be, and I couldn't take my eyes off screen. Then, there's James McAvoy ... I have no words to describe how astonishing his performance is. Portraying one character is hard. Portraying almost 20 characters is just outrageous! However, McAvoy nails each personality delivering himself to his roles in such an unbelievable way. Sometimes I chuckled because I couldn't understand how it was possible an actor being able to do what he did, several times, in one-take sequences.\r\n\r\nBruce Willis and Samuel L. Jackson return to portray David and Mr. Glass, respectively. The former is solid, and the respect he has for his character is evident. However, David is sort of left aside in this movie, but I'll get there. SLJ, even with less screentime than the other two, has more to do, regarding moving the plot forward. He gives an extraordinary performance, as expected from such a capable actor. During this act, these four characters offer a lot of memorable scenes, but the narrative is filled with exposition, and it overextends its stay. Shyamalan wanted to show everyone that he knows what he is writing about and a lot of times he used his characters to explicitly say, well, everything the audience needed to know, without any need to.\r\n\r\nThe third act is where everyone is going to either love or hate the film. In this genre, we all know that the \"middle ground\" is non-existent. Either you're part of the group who loves it and you will defend it at all costs, or you're part of the group who hates everything about it just due to its final moments. There is more than one Shyamalan twist during this final act. Truth is, I left a bit disappointed. It doesn't matter what your expectations are, it doesn't matter your preferences, at least one of the twists is always going to upset you. What disappoints me the most is that I don't really love any of them. Unbreakable has a final plot twist that completely changes its whole story, and it comes out of nowhere. It's literally mind-blowing! Split has the 17-year twist of it being part of the former's universe, which made several audiences in festivals give it a stand ovation. Glass has ... a bunch of twists. Period. There are no OH-MY-GOD-like reactions. There are no jaws dropped.\r\n\r\nInstead, we are left with an arguably questionable decision. A couple of the twists are fine. I would even call them \"good twists\". However, the one that changes everything feels incredibly forced and most of all, it falls short for such a highly-anticipated trilogy's last installment. I can't help but wonder \"is this really the best path you could have chosen Shyamalan? Of all the endings you imagined, this is the one you think is the best to finish a 19-year-in-the-making superhero trilogy?\" Regarding the screenplay and the characters, I have the issue above and one associated with David Dunn. If Split didn't have that final twist, it would be a good thriller. Way above average, but not astounding. The link to Unbreakable's universe is what makes it a standout movie of 2017. So, I was expecting a lot of David, and I only got a small fraction of him.\r\n\r\nI'll put this way:\r\n- if you're expecting an Unbreakable sequel, you'll probably leave disappointed;\r\n- if you're expecting Split 2, you'll love McAvoy's take on almost 20 distinct personalities, and that alone is worth the price of admission;\r\n- if you're expecting a formulaic superhero epic finale, filled with massive CGI fights and tremendous visual effects, all wrapped around colossal set pieces, then you are not worthy of even watching Glass, because this means you don't have a clue what this trilogy is about.\r\n\r\nThis is NOT a conventional comic-book trilogy. If you don't know this by now and you're still waiting for that last climax, you're only setting yourself up for disappointment, when no one asked you to anticipate such unrealistic stuff. Never criticize a film for not selling you something it was never even marketed to do (it's like expecting a horror movie to have a romantic happy ending). That said, I left disappointed with its conclusion, but there's still so much to love and praise. Seeing how David accepted who he was and the life journey he took, experiencing Kevin's pain and how each personality was born, understanding what Elijah's purpose is and being blown away by his mastermind plans ... These are characters so well-developed and so well-established that I can forgive some missteps here and there.\r\n\r\nBefore diving into the technical aspects, Anya Taylor-Joy, Spencer Treat Clark (Joseph Dunn) and Charlayne Woodard (Elijah's mother) deserve appreciation for their performances, even if they don't have that much impact in the overall story. Anya has more to do as Casey since her character's bond with Kevin is an explored subplot. Regarding the last two, they only serve as exposition devices which connects to one of my problems with the second act, by not helping the plot move forward in the smoothest way possible.\r\n\r\nConcerning M. Night Shyamalan filmmaking skills, I barely have anything negative to say. The only minor issue I have is the excessive use of POV in the action scenes (a camera attached to the actor's body which provides a close-up of his face while fighting). Nevertheless, this film is yet another proof of how skillful this guy is behind the camera. There are so many memorable moments where the technique at display is worthy of awards. We will have to wait a few months to find such marvelous cinematography as in this film. Shyamalan and Mike Gioulakis (DP, director of photography) use our characters' respective colors (yellow for Kevin, green for David and purple for Mr. Glass) as the background palette of each scene in glorious fashion. The gradual change in color tells the audience so much about what our characters are going through, elevating one of the best dialogue sequences in the entire movie (the pink room).\r\n\r\nThe editing is sublime, and I love how Shyamalan uses close-ups to show how remarkable his cast is. McAvoy's performance is one of the best this year is going to give us, but part of it is even better due to the camera work. The unfocused background stunt work in a character's close-up is the art of filmmaking at his very best, and Shyamalan knows how to film it beautifully. The score is not as memorable as Unbreakable's, but the sound design is on point. Even with a low budget (compared to the other superhero movies), Shyamalan is able to produce a technical showdown of all his attributes as a sensational filmmaker. And this, my fellow readers, I will defend until the end of his career.\r\n\r\nAll in all, Glass doesn't live up to my extremely high expectations, but it does more than enough for me to enjoy it. I can't help but feel disappointed with the way everything ends and the path that Shyamalan chose, but there's still so much to love. James McAvoy offers you a performance worthy of any price of admission. Watching him portray over 15 characters is something you won't experience maybe ever again. Going through the layers of suspense, disbelief and mystery that the screenplay is structured by is itself an adventure filled with twists and turns which grabbed my attention until the very end.\r\n\r\nAn almost flawless first act delves into an overextended second act where the story lacks consistency and even logic, at times. However, the performances and the main thread of the film keeps everyone enthralled until the polarizing third and final act, where the significant plot twists occur. How can a movie be so fascinating and frustrating at the same time? Shyamalan, ladies and gentlemen. This masterful filmmaker lends all his skills to the film, and technically it’s close to perfection. Disappointing? Yes. Frustrating? Yes. Does it ruin the franchise? No, not even close. This isn’t The Matrix Revolutions, but it’s not Return of the King, as well. It’s a good ending to a superhero trilogy that might not be the best of all-time, but it’s up there, and it’s definitely unique, imaginative and the closest to what our real world would be like if superheroes were a real thing. \r\n\r\nIf you’re a comic-book fan, this trilogy is mandatory. If you love Marvel or DC, don’t you dare use the word “grounded” without watching this saga first. Shyamalan, see you around!\r\n\r\nRating: B+", "created_at": "2019-01-17T15:57:59.361Z"}, {"movie_id": 450465, "review_id": "5c5710289251410e1d4fc75f", "author_rating": null, "review_text": "It's a very good movie", "created_at": "2019-02-03T16:00:40.209Z"}, {"movie_id": 450465, "review_id": "5eb31d44f74f5f001d9632e4", "author_rating": 10.0, "review_text": "Wow! It was just...wow!\r\nM. Night Shyamalan finally made a worthwhile film, especially in a trilogy.", "created_at": "2020-05-06T20:25:40.397Z"}, {"movie_id": 450465, "review_id": "62dfacd8bbcae0005578d9f5", "author_rating": 7.0, "review_text": "I love these characters. I love the cast. I did not love the ending but... Eh, can't have everything. James McAvoy is so damn awesome with the multiple personalities his character has. And to me, this is one of Samuel L Jackson's best roles. Bruce Willis always delivers his bad ass persona in a way relateable by all who watch his films.", "created_at": "2022-07-26T08:59:04.377Z"}, {"movie_id": 450465, "review_id": "5c3fe4d09251416e2dafec00", "author_rating": null, "review_text": "It is hard to believe it has been 19 years since “Unbreakable” arrived in cinemas as the film seemed to setup a sequel but it did not look like it would come to fruition. That all changed in 2016 when “Split” arrived and shocked audiences with a late reveal that showed a connection to the film. Writer/Director M. Night Shyamalan has wasted no time in bringing the new film to fans with the arrival of “GLASS”.  The film picks up soon after the events of “Split” as The Horde embodied by 23 personalities in the form of Kevin Wendell Crumb (James McAvoy) continues to kidnap young girls to serve to his highly dangerous 24th personality The Beast.\r\n\r\nSecurity expert David Dunn (Bruce Willis) along with the help of his son attempts to locate the Horde as a new group of girls has gone missing.  In time David locates The Beast and the two clash; but end up captured by authorities and sent to a facility for evaluation.\r\n\r\nTheir captive Dr. Ellie Staple (Sarah Paulson) believes their special abilities are in their minds and that they really do not have the special abilities they believe they do. Each of them have a special cell designed to restrain them as David is under threat of being doused with water while Kevin has a series of strobes which will halt him and trigger a new personality.\r\n\r\nAdded to the mix is Elijah Price (Samuel L. Jackson), who has been at the facility under heavy sedation after the events of “Unbreakable”.\r\n\r\nAs the therapy unfolds it becomes clear that an elaborate game of cat and mouse is underway between Price and her charges as each seems to have their own agenda.  This all builds to a very unusual final act which left me pondering if I enjoyed the final result or was disappointed with it.\r\n\r\nThe film seems to slowly be building to a big finale but yet it is far more restrained than one would expect. The film has a constant theme of Super Heroes and their traditional stories and roles as well as that of their Super Villains. \r\n\r\nOne expects a massive Battle Royale complete with elaborate FX but the film takes a more restrained approach and in doing so may disappoint some fans while pleasing others. The film naturally has its twist moments and while I will not spoil it, I can say I predicted it before I even saw the film. When I saw “Split” I actually told my wife my theory and low and behold it was true. I also predicted the twists for many of Shyamalan’s previous films so I had hoped for a bit more in this regard. The film does offer up some interesting options for another sequel or Spin-Off and the cast was very good especially McAvoy who adds to his menagerie of characters by showing audiences a few more of the ones previously undisclosed.\r\n\r\nThe film is at times very enjoyable and at times a bit frustrating as it seems to deviate from themes and elements that were setup earlier. That being said it does very much appear that this could indeed be just the start of something much bigger in the series.\r\n\r\n3.5 stars out of 5", "created_at": "2019-01-17T02:13:36.891Z"}, {"movie_id": 450465, "review_id": "5c40a607c3a368216241e59b", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nYou all know how anxious I was about this movie. I’m a huge fan of Shyamalan, and I know how hard it is to try to defend a director who made The Last Airbender. Every time I offer undeniable proof of masterful filmmaking, I get overwhelmed with questions about his absurd twists and his cringe-worthy dialogues. Shyamalan is a bit like Kevin, he also has different personalities, depending on the films he releases. On one side, he is a phenomenal filmmaker who knows his craft better than anyone and who once was nicknamed “the second Spielberg”. A screenwriter who delivers mind-blowing plot twists and extremely captivating dialogue scenes. On the other side, there’s a guy who ruins entire movies with frustrating twists that no one asked for and with arguably horrible decisions regarding his characters. So, to each side does Shyamalan tends to in Glass?\r\n\r\nThe first act is seamless. I love how David is introduced 19 years later and how his life is now. Kevin continues to abduct impure teenage girls, and after a few minutes in, we get the first confrontation between our hero and villain. I wasn't expecting an action-heavy film, and I'm glad it isn't because it would ruin the tone of the other movies. This was never intended to be a massive finale with epic CGI fights, like a Marvel or DC installment. If you're one of those people who expected Glass to be an Infinity War-ish film, I don't even know why are you reading this because you have no idea what this trilogy is about.\r\n\r\nSarah Paulson portrays Dr. Ellie Staple, and she is responsible for treating people who think they are superheroes. So, the second act revolves around a fascinatingly engaging yet overlong narrative which leaves the main characters (and the audience) doubting if everything they did was a product of their supposedly damaged minds. There is so much to love and hate throughout this act. The interactions between these characters are as captivating as they could be, and I couldn't take my eyes off screen. Then, there's James McAvoy ... I have no words to describe how astonishing his performance is. Portraying one character is hard. Portraying almost 20 characters is just outrageous! However, McAvoy nails each personality delivering himself to his roles in such an unbelievable way. Sometimes I chuckled because I couldn't understand how it was possible an actor being able to do what he did, several times, in one-take sequences.\r\n\r\nBruce Willis and Samuel L. Jackson return to portray David and Mr. Glass, respectively. The former is solid, and the respect he has for his character is evident. However, David is sort of left aside in this movie, but I'll get there. SLJ, even with less screentime than the other two, has more to do, regarding moving the plot forward. He gives an extraordinary performance, as expected from such a capable actor. During this act, these four characters offer a lot of memorable scenes, but the narrative is filled with exposition, and it overextends its stay. Shyamalan wanted to show everyone that he knows what he is writing about and a lot of times he used his characters to explicitly say, well, everything the audience needed to know, without any need to.\r\n\r\nThe third act is where everyone is going to either love or hate the film. In this genre, we all know that the \"middle ground\" is non-existent. Either you're part of the group who loves it and you will defend it at all costs, or you're part of the group who hates everything about it just due to its final moments. There is more than one Shyamalan twist during this final act. Truth is, I left a bit disappointed. It doesn't matter what your expectations are, it doesn't matter your preferences, at least one of the twists is always going to upset you. What disappoints me the most is that I don't really love any of them. Unbreakable has a final plot twist that completely changes its whole story, and it comes out of nowhere. It's literally mind-blowing! Split has the 17-year twist of it being part of the former's universe, which made several audiences in festivals give it a stand ovation. Glass has ... a bunch of twists. Period. There are no OH-MY-GOD-like reactions. There are no jaws dropped.\r\n\r\nInstead, we are left with an arguably questionable decision. A couple of the twists are fine. I would even call them \"good twists\". However, the one that changes everything feels incredibly forced and most of all, it falls short for such a highly-anticipated trilogy's last installment. I can't help but wonder \"is this really the best path you could have chosen Shyamalan? Of all the endings you imagined, this is the one you think is the best to finish a 19-year-in-the-making superhero trilogy?\" Regarding the screenplay and the characters, I have the issue above and one associated with David Dunn. If Split didn't have that final twist, it would be a good thriller. Way above average, but not astounding. The link to Unbreakable's universe is what makes it a standout movie of 2017. So, I was expecting a lot of David, and I only got a small fraction of him.\r\n\r\nI'll put this way:\r\n- if you're expecting an Unbreakable sequel, you'll probably leave disappointed;\r\n- if you're expecting Split 2, you'll love McAvoy's take on almost 20 distinct personalities, and that alone is worth the price of admission;\r\n- if you're expecting a formulaic superhero epic finale, filled with massive CGI fights and tremendous visual effects, all wrapped around colossal set pieces, then you are not worthy of even watching Glass, because this means you don't have a clue what this trilogy is about.\r\n\r\nThis is NOT a conventional comic-book trilogy. If you don't know this by now and you're still waiting for that last climax, you're only setting yourself up for disappointment, when no one asked you to anticipate such unrealistic stuff. Never criticize a film for not selling you something it was never even marketed to do (it's like expecting a horror movie to have a romantic happy ending). That said, I left disappointed with its conclusion, but there's still so much to love and praise. Seeing how David accepted who he was and the life journey he took, experiencing Kevin's pain and how each personality was born, understanding what Elijah's purpose is and being blown away by his mastermind plans ... These are characters so well-developed and so well-established that I can forgive some missteps here and there.\r\n\r\nBefore diving into the technical aspects, Anya Taylor-Joy, Spencer Treat Clark (Joseph Dunn) and Charlayne Woodard (Elijah's mother) deserve appreciation for their performances, even if they don't have that much impact in the overall story. Anya has more to do as Casey since her character's bond with Kevin is an explored subplot. Regarding the last two, they only serve as exposition devices which connects to one of my problems with the second act, by not helping the plot move forward in the smoothest way possible.\r\n\r\nConcerning M. Night Shyamalan filmmaking skills, I barely have anything negative to say. The only minor issue I have is the excessive use of POV in the action scenes (a camera attached to the actor's body which provides a close-up of his face while fighting). Nevertheless, this film is yet another proof of how skillful this guy is behind the camera. There are so many memorable moments where the technique at display is worthy of awards. We will have to wait a few months to find such marvelous cinematography as in this film. Shyamalan and Mike Gioulakis (DP, director of photography) use our characters' respective colors (yellow for Kevin, green for David and purple for Mr. Glass) as the background palette of each scene in glorious fashion. The gradual change in color tells the audience so much about what our characters are going through, elevating one of the best dialogue sequences in the entire movie (the pink room).\r\n\r\nThe editing is sublime, and I love how Shyamalan uses close-ups to show how remarkable his cast is. McAvoy's performance is one of the best this year is going to give us, but part of it is even better due to the camera work. The unfocused background stunt work in a character's close-up is the art of filmmaking at his very best, and Shyamalan knows how to film it beautifully. The score is not as memorable as Unbreakable's, but the sound design is on point. Even with a low budget (compared to the other superhero movies), Shyamalan is able to produce a technical showdown of all his attributes as a sensational filmmaker. And this, my fellow readers, I will defend until the end of his career.\r\n\r\nAll in all, Glass doesn't live up to my extremely high expectations, but it does more than enough for me to enjoy it. I can't help but feel disappointed with the way everything ends and the path that Shyamalan chose, but there's still so much to love. James McAvoy offers you a performance worthy of any price of admission. Watching him portray over 15 characters is something you won't experience maybe ever again. Going through the layers of suspense, disbelief and mystery that the screenplay is structured by is itself an adventure filled with twists and turns which grabbed my attention until the very end.\r\n\r\nAn almost flawless first act delves into an overextended second act where the story lacks consistency and even logic, at times. However, the performances and the main thread of the film keeps everyone enthralled until the polarizing third and final act, where the significant plot twists occur. How can a movie be so fascinating and frustrating at the same time? Shyamalan, ladies and gentlemen. This masterful filmmaker lends all his skills to the film, and technically it’s close to perfection. Disappointing? Yes. Frustrating? Yes. Does it ruin the franchise? No, not even close. This isn’t The Matrix Revolutions, but it’s not Return of the King, as well. It’s a good ending to a superhero trilogy that might not be the best of all-time, but it’s up there, and it’s definitely unique, imaginative and the closest to what our real world would be like if superheroes were a real thing. \r\n\r\nIf you’re a comic-book fan, this trilogy is mandatory. If you love Marvel or DC, don’t you dare use the word “grounded” without watching this saga first. Shyamalan, see you around!\r\n\r\nRating: B+", "created_at": "2019-01-17T15:57:59.361Z"}, {"movie_id": 450465, "review_id": "5c5710289251410e1d4fc75f", "author_rating": null, "review_text": "It's a very good movie", "created_at": "2019-02-03T16:00:40.209Z"}, {"movie_id": 450465, "review_id": "5eb31d44f74f5f001d9632e4", "author_rating": 10.0, "review_text": "Wow! It was just...wow!\r\nM. Night Shyamalan finally made a worthwhile film, especially in a trilogy.", "created_at": "2020-05-06T20:25:40.397Z"}, {"movie_id": 450465, "review_id": "62dfacd8bbcae0005578d9f5", "author_rating": 7.0, "review_text": "I love these characters. I love the cast. I did not love the ending but... Eh, can't have everything. James McAvoy is so damn awesome with the multiple personalities his character has. And to me, this is one of Samuel L Jackson's best roles. Bruce Willis always delivers his bad ass persona in a way relateable by all who watch his films.", "created_at": "2022-07-26T08:59:04.377Z"}, {"movie_id": 450465, "review_id": "5c3fe4d09251416e2dafec00", "author_rating": null, "review_text": "It is hard to believe it has been 19 years since “Unbreakable” arrived in cinemas as the film seemed to setup a sequel but it did not look like it would come to fruition. That all changed in 2016 when “Split” arrived and shocked audiences with a late reveal that showed a connection to the film. Writer/Director M. Night Shyamalan has wasted no time in bringing the new film to fans with the arrival of “GLASS”.  The film picks up soon after the events of “Split” as The Horde embodied by 23 personalities in the form of Kevin Wendell Crumb (James McAvoy) continues to kidnap young girls to serve to his highly dangerous 24th personality The Beast.\r\n\r\nSecurity expert David Dunn (Bruce Willis) along with the help of his son attempts to locate the Horde as a new group of girls has gone missing.  In time David locates The Beast and the two clash; but end up captured by authorities and sent to a facility for evaluation.\r\n\r\nTheir captive Dr. Ellie Staple (Sarah Paulson) believes their special abilities are in their minds and that they really do not have the special abilities they believe they do. Each of them have a special cell designed to restrain them as David is under threat of being doused with water while Kevin has a series of strobes which will halt him and trigger a new personality.\r\n\r\nAdded to the mix is Elijah Price (Samuel L. Jackson), who has been at the facility under heavy sedation after the events of “Unbreakable”.\r\n\r\nAs the therapy unfolds it becomes clear that an elaborate game of cat and mouse is underway between Price and her charges as each seems to have their own agenda.  This all builds to a very unusual final act which left me pondering if I enjoyed the final result or was disappointed with it.\r\n\r\nThe film seems to slowly be building to a big finale but yet it is far more restrained than one would expect. The film has a constant theme of Super Heroes and their traditional stories and roles as well as that of their Super Villains. \r\n\r\nOne expects a massive Battle Royale complete with elaborate FX but the film takes a more restrained approach and in doing so may disappoint some fans while pleasing others. The film naturally has its twist moments and while I will not spoil it, I can say I predicted it before I even saw the film. When I saw “Split” I actually told my wife my theory and low and behold it was true. I also predicted the twists for many of Shyamalan’s previous films so I had hoped for a bit more in this regard. The film does offer up some interesting options for another sequel or Spin-Off and the cast was very good especially McAvoy who adds to his menagerie of characters by showing audiences a few more of the ones previously undisclosed.\r\n\r\nThe film is at times very enjoyable and at times a bit frustrating as it seems to deviate from themes and elements that were setup earlier. That being said it does very much appear that this could indeed be just the start of something much bigger in the series.\r\n\r\n3.5 stars out of 5", "created_at": "2019-01-17T02:13:36.891Z"}, {"movie_id": 450465, "review_id": "5c40a607c3a368216241e59b", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nYou all know how anxious I was about this movie. I’m a huge fan of Shyamalan, and I know how hard it is to try to defend a director who made The Last Airbender. Every time I offer undeniable proof of masterful filmmaking, I get overwhelmed with questions about his absurd twists and his cringe-worthy dialogues. Shyamalan is a bit like Kevin, he also has different personalities, depending on the films he releases. On one side, he is a phenomenal filmmaker who knows his craft better than anyone and who once was nicknamed “the second Spielberg”. A screenwriter who delivers mind-blowing plot twists and extremely captivating dialogue scenes. On the other side, there’s a guy who ruins entire movies with frustrating twists that no one asked for and with arguably horrible decisions regarding his characters. So, to each side does Shyamalan tends to in Glass?\r\n\r\nThe first act is seamless. I love how David is introduced 19 years later and how his life is now. Kevin continues to abduct impure teenage girls, and after a few minutes in, we get the first confrontation between our hero and villain. I wasn't expecting an action-heavy film, and I'm glad it isn't because it would ruin the tone of the other movies. This was never intended to be a massive finale with epic CGI fights, like a Marvel or DC installment. If you're one of those people who expected Glass to be an Infinity War-ish film, I don't even know why are you reading this because you have no idea what this trilogy is about.\r\n\r\nSarah Paulson portrays Dr. Ellie Staple, and she is responsible for treating people who think they are superheroes. So, the second act revolves around a fascinatingly engaging yet overlong narrative which leaves the main characters (and the audience) doubting if everything they did was a product of their supposedly damaged minds. There is so much to love and hate throughout this act. The interactions between these characters are as captivating as they could be, and I couldn't take my eyes off screen. Then, there's James McAvoy ... I have no words to describe how astonishing his performance is. Portraying one character is hard. Portraying almost 20 characters is just outrageous! However, McAvoy nails each personality delivering himself to his roles in such an unbelievable way. Sometimes I chuckled because I couldn't understand how it was possible an actor being able to do what he did, several times, in one-take sequences.\r\n\r\nBruce Willis and Samuel L. Jackson return to portray David and Mr. Glass, respectively. The former is solid, and the respect he has for his character is evident. However, David is sort of left aside in this movie, but I'll get there. SLJ, even with less screentime than the other two, has more to do, regarding moving the plot forward. He gives an extraordinary performance, as expected from such a capable actor. During this act, these four characters offer a lot of memorable scenes, but the narrative is filled with exposition, and it overextends its stay. Shyamalan wanted to show everyone that he knows what he is writing about and a lot of times he used his characters to explicitly say, well, everything the audience needed to know, without any need to.\r\n\r\nThe third act is where everyone is going to either love or hate the film. In this genre, we all know that the \"middle ground\" is non-existent. Either you're part of the group who loves it and you will defend it at all costs, or you're part of the group who hates everything about it just due to its final moments. There is more than one Shyamalan twist during this final act. Truth is, I left a bit disappointed. It doesn't matter what your expectations are, it doesn't matter your preferences, at least one of the twists is always going to upset you. What disappoints me the most is that I don't really love any of them. Unbreakable has a final plot twist that completely changes its whole story, and it comes out of nowhere. It's literally mind-blowing! Split has the 17-year twist of it being part of the former's universe, which made several audiences in festivals give it a stand ovation. Glass has ... a bunch of twists. Period. There are no OH-MY-GOD-like reactions. There are no jaws dropped.\r\n\r\nInstead, we are left with an arguably questionable decision. A couple of the twists are fine. I would even call them \"good twists\". However, the one that changes everything feels incredibly forced and most of all, it falls short for such a highly-anticipated trilogy's last installment. I can't help but wonder \"is this really the best path you could have chosen Shyamalan? Of all the endings you imagined, this is the one you think is the best to finish a 19-year-in-the-making superhero trilogy?\" Regarding the screenplay and the characters, I have the issue above and one associated with David Dunn. If Split didn't have that final twist, it would be a good thriller. Way above average, but not astounding. The link to Unbreakable's universe is what makes it a standout movie of 2017. So, I was expecting a lot of David, and I only got a small fraction of him.\r\n\r\nI'll put this way:\r\n- if you're expecting an Unbreakable sequel, you'll probably leave disappointed;\r\n- if you're expecting Split 2, you'll love McAvoy's take on almost 20 distinct personalities, and that alone is worth the price of admission;\r\n- if you're expecting a formulaic superhero epic finale, filled with massive CGI fights and tremendous visual effects, all wrapped around colossal set pieces, then you are not worthy of even watching Glass, because this means you don't have a clue what this trilogy is about.\r\n\r\nThis is NOT a conventional comic-book trilogy. If you don't know this by now and you're still waiting for that last climax, you're only setting yourself up for disappointment, when no one asked you to anticipate such unrealistic stuff. Never criticize a film for not selling you something it was never even marketed to do (it's like expecting a horror movie to have a romantic happy ending). That said, I left disappointed with its conclusion, but there's still so much to love and praise. Seeing how David accepted who he was and the life journey he took, experiencing Kevin's pain and how each personality was born, understanding what Elijah's purpose is and being blown away by his mastermind plans ... These are characters so well-developed and so well-established that I can forgive some missteps here and there.\r\n\r\nBefore diving into the technical aspects, Anya Taylor-Joy, Spencer Treat Clark (Joseph Dunn) and Charlayne Woodard (Elijah's mother) deserve appreciation for their performances, even if they don't have that much impact in the overall story. Anya has more to do as Casey since her character's bond with Kevin is an explored subplot. Regarding the last two, they only serve as exposition devices which connects to one of my problems with the second act, by not helping the plot move forward in the smoothest way possible.\r\n\r\nConcerning M. Night Shyamalan filmmaking skills, I barely have anything negative to say. The only minor issue I have is the excessive use of POV in the action scenes (a camera attached to the actor's body which provides a close-up of his face while fighting). Nevertheless, this film is yet another proof of how skillful this guy is behind the camera. There are so many memorable moments where the technique at display is worthy of awards. We will have to wait a few months to find such marvelous cinematography as in this film. Shyamalan and Mike Gioulakis (DP, director of photography) use our characters' respective colors (yellow for Kevin, green for David and purple for Mr. Glass) as the background palette of each scene in glorious fashion. The gradual change in color tells the audience so much about what our characters are going through, elevating one of the best dialogue sequences in the entire movie (the pink room).\r\n\r\nThe editing is sublime, and I love how Shyamalan uses close-ups to show how remarkable his cast is. McAvoy's performance is one of the best this year is going to give us, but part of it is even better due to the camera work. The unfocused background stunt work in a character's close-up is the art of filmmaking at his very best, and Shyamalan knows how to film it beautifully. The score is not as memorable as Unbreakable's, but the sound design is on point. Even with a low budget (compared to the other superhero movies), Shyamalan is able to produce a technical showdown of all his attributes as a sensational filmmaker. And this, my fellow readers, I will defend until the end of his career.\r\n\r\nAll in all, Glass doesn't live up to my extremely high expectations, but it does more than enough for me to enjoy it. I can't help but feel disappointed with the way everything ends and the path that Shyamalan chose, but there's still so much to love. James McAvoy offers you a performance worthy of any price of admission. Watching him portray over 15 characters is something you won't experience maybe ever again. Going through the layers of suspense, disbelief and mystery that the screenplay is structured by is itself an adventure filled with twists and turns which grabbed my attention until the very end.\r\n\r\nAn almost flawless first act delves into an overextended second act where the story lacks consistency and even logic, at times. However, the performances and the main thread of the film keeps everyone enthralled until the polarizing third and final act, where the significant plot twists occur. How can a movie be so fascinating and frustrating at the same time? Shyamalan, ladies and gentlemen. This masterful filmmaker lends all his skills to the film, and technically it’s close to perfection. Disappointing? Yes. Frustrating? Yes. Does it ruin the franchise? No, not even close. This isn’t The Matrix Revolutions, but it’s not Return of the King, as well. It’s a good ending to a superhero trilogy that might not be the best of all-time, but it’s up there, and it’s definitely unique, imaginative and the closest to what our real world would be like if superheroes were a real thing. \r\n\r\nIf you’re a comic-book fan, this trilogy is mandatory. If you love Marvel or DC, don’t you dare use the word “grounded” without watching this saga first. Shyamalan, see you around!\r\n\r\nRating: B+", "created_at": "2019-01-17T15:57:59.361Z"}, {"movie_id": 450465, "review_id": "5c5710289251410e1d4fc75f", "author_rating": null, "review_text": "It's a very good movie", "created_at": "2019-02-03T16:00:40.209Z"}, {"movie_id": 450465, "review_id": "5eb31d44f74f5f001d9632e4", "author_rating": 10.0, "review_text": "Wow! It was just...wow!\r\nM. Night Shyamalan finally made a worthwhile film, especially in a trilogy.", "created_at": "2020-05-06T20:25:40.397Z"}, {"movie_id": 450465, "review_id": "62dfacd8bbcae0005578d9f5", "author_rating": 7.0, "review_text": "I love these characters. I love the cast. I did not love the ending but... Eh, can't have everything. James McAvoy is so damn awesome with the multiple personalities his character has. And to me, this is one of Samuel L Jackson's best roles. Bruce Willis always delivers his bad ass persona in a way relateable by all who watch his films.", "created_at": "2022-07-26T08:59:04.377Z"}, {"movie_id": 450465, "review_id": "5c3fe4d09251416e2dafec00", "author_rating": null, "review_text": "It is hard to believe it has been 19 years since “Unbreakable” arrived in cinemas as the film seemed to setup a sequel but it did not look like it would come to fruition. That all changed in 2016 when “Split” arrived and shocked audiences with a late reveal that showed a connection to the film. Writer/Director M. Night Shyamalan has wasted no time in bringing the new film to fans with the arrival of “GLASS”.  The film picks up soon after the events of “Split” as The Horde embodied by 23 personalities in the form of Kevin Wendell Crumb (James McAvoy) continues to kidnap young girls to serve to his highly dangerous 24th personality The Beast.\r\n\r\nSecurity expert David Dunn (Bruce Willis) along with the help of his son attempts to locate the Horde as a new group of girls has gone missing.  In time David locates The Beast and the two clash; but end up captured by authorities and sent to a facility for evaluation.\r\n\r\nTheir captive Dr. Ellie Staple (Sarah Paulson) believes their special abilities are in their minds and that they really do not have the special abilities they believe they do. Each of them have a special cell designed to restrain them as David is under threat of being doused with water while Kevin has a series of strobes which will halt him and trigger a new personality.\r\n\r\nAdded to the mix is Elijah Price (Samuel L. Jackson), who has been at the facility under heavy sedation after the events of “Unbreakable”.\r\n\r\nAs the therapy unfolds it becomes clear that an elaborate game of cat and mouse is underway between Price and her charges as each seems to have their own agenda.  This all builds to a very unusual final act which left me pondering if I enjoyed the final result or was disappointed with it.\r\n\r\nThe film seems to slowly be building to a big finale but yet it is far more restrained than one would expect. The film has a constant theme of Super Heroes and their traditional stories and roles as well as that of their Super Villains. \r\n\r\nOne expects a massive Battle Royale complete with elaborate FX but the film takes a more restrained approach and in doing so may disappoint some fans while pleasing others. The film naturally has its twist moments and while I will not spoil it, I can say I predicted it before I even saw the film. When I saw “Split” I actually told my wife my theory and low and behold it was true. I also predicted the twists for many of Shyamalan’s previous films so I had hoped for a bit more in this regard. The film does offer up some interesting options for another sequel or Spin-Off and the cast was very good especially McAvoy who adds to his menagerie of characters by showing audiences a few more of the ones previously undisclosed.\r\n\r\nThe film is at times very enjoyable and at times a bit frustrating as it seems to deviate from themes and elements that were setup earlier. That being said it does very much appear that this could indeed be just the start of something much bigger in the series.\r\n\r\n3.5 stars out of 5", "created_at": "2019-01-17T02:13:36.891Z"}, {"movie_id": 450465, "review_id": "5c40a607c3a368216241e59b", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nYou all know how anxious I was about this movie. I’m a huge fan of Shyamalan, and I know how hard it is to try to defend a director who made The Last Airbender. Every time I offer undeniable proof of masterful filmmaking, I get overwhelmed with questions about his absurd twists and his cringe-worthy dialogues. Shyamalan is a bit like Kevin, he also has different personalities, depending on the films he releases. On one side, he is a phenomenal filmmaker who knows his craft better than anyone and who once was nicknamed “the second Spielberg”. A screenwriter who delivers mind-blowing plot twists and extremely captivating dialogue scenes. On the other side, there’s a guy who ruins entire movies with frustrating twists that no one asked for and with arguably horrible decisions regarding his characters. So, to each side does Shyamalan tends to in Glass?\r\n\r\nThe first act is seamless. I love how David is introduced 19 years later and how his life is now. Kevin continues to abduct impure teenage girls, and after a few minutes in, we get the first confrontation between our hero and villain. I wasn't expecting an action-heavy film, and I'm glad it isn't because it would ruin the tone of the other movies. This was never intended to be a massive finale with epic CGI fights, like a Marvel or DC installment. If you're one of those people who expected Glass to be an Infinity War-ish film, I don't even know why are you reading this because you have no idea what this trilogy is about.\r\n\r\nSarah Paulson portrays Dr. Ellie Staple, and she is responsible for treating people who think they are superheroes. So, the second act revolves around a fascinatingly engaging yet overlong narrative which leaves the main characters (and the audience) doubting if everything they did was a product of their supposedly damaged minds. There is so much to love and hate throughout this act. The interactions between these characters are as captivating as they could be, and I couldn't take my eyes off screen. Then, there's James McAvoy ... I have no words to describe how astonishing his performance is. Portraying one character is hard. Portraying almost 20 characters is just outrageous! However, McAvoy nails each personality delivering himself to his roles in such an unbelievable way. Sometimes I chuckled because I couldn't understand how it was possible an actor being able to do what he did, several times, in one-take sequences.\r\n\r\nBruce Willis and Samuel L. Jackson return to portray David and Mr. Glass, respectively. The former is solid, and the respect he has for his character is evident. However, David is sort of left aside in this movie, but I'll get there. SLJ, even with less screentime than the other two, has more to do, regarding moving the plot forward. He gives an extraordinary performance, as expected from such a capable actor. During this act, these four characters offer a lot of memorable scenes, but the narrative is filled with exposition, and it overextends its stay. Shyamalan wanted to show everyone that he knows what he is writing about and a lot of times he used his characters to explicitly say, well, everything the audience needed to know, without any need to.\r\n\r\nThe third act is where everyone is going to either love or hate the film. In this genre, we all know that the \"middle ground\" is non-existent. Either you're part of the group who loves it and you will defend it at all costs, or you're part of the group who hates everything about it just due to its final moments. There is more than one Shyamalan twist during this final act. Truth is, I left a bit disappointed. It doesn't matter what your expectations are, it doesn't matter your preferences, at least one of the twists is always going to upset you. What disappoints me the most is that I don't really love any of them. Unbreakable has a final plot twist that completely changes its whole story, and it comes out of nowhere. It's literally mind-blowing! Split has the 17-year twist of it being part of the former's universe, which made several audiences in festivals give it a stand ovation. Glass has ... a bunch of twists. Period. There are no OH-MY-GOD-like reactions. There are no jaws dropped.\r\n\r\nInstead, we are left with an arguably questionable decision. A couple of the twists are fine. I would even call them \"good twists\". However, the one that changes everything feels incredibly forced and most of all, it falls short for such a highly-anticipated trilogy's last installment. I can't help but wonder \"is this really the best path you could have chosen Shyamalan? Of all the endings you imagined, this is the one you think is the best to finish a 19-year-in-the-making superhero trilogy?\" Regarding the screenplay and the characters, I have the issue above and one associated with David Dunn. If Split didn't have that final twist, it would be a good thriller. Way above average, but not astounding. The link to Unbreakable's universe is what makes it a standout movie of 2017. So, I was expecting a lot of David, and I only got a small fraction of him.\r\n\r\nI'll put this way:\r\n- if you're expecting an Unbreakable sequel, you'll probably leave disappointed;\r\n- if you're expecting Split 2, you'll love McAvoy's take on almost 20 distinct personalities, and that alone is worth the price of admission;\r\n- if you're expecting a formulaic superhero epic finale, filled with massive CGI fights and tremendous visual effects, all wrapped around colossal set pieces, then you are not worthy of even watching Glass, because this means you don't have a clue what this trilogy is about.\r\n\r\nThis is NOT a conventional comic-book trilogy. If you don't know this by now and you're still waiting for that last climax, you're only setting yourself up for disappointment, when no one asked you to anticipate such unrealistic stuff. Never criticize a film for not selling you something it was never even marketed to do (it's like expecting a horror movie to have a romantic happy ending). That said, I left disappointed with its conclusion, but there's still so much to love and praise. Seeing how David accepted who he was and the life journey he took, experiencing Kevin's pain and how each personality was born, understanding what Elijah's purpose is and being blown away by his mastermind plans ... These are characters so well-developed and so well-established that I can forgive some missteps here and there.\r\n\r\nBefore diving into the technical aspects, Anya Taylor-Joy, Spencer Treat Clark (Joseph Dunn) and Charlayne Woodard (Elijah's mother) deserve appreciation for their performances, even if they don't have that much impact in the overall story. Anya has more to do as Casey since her character's bond with Kevin is an explored subplot. Regarding the last two, they only serve as exposition devices which connects to one of my problems with the second act, by not helping the plot move forward in the smoothest way possible.\r\n\r\nConcerning M. Night Shyamalan filmmaking skills, I barely have anything negative to say. The only minor issue I have is the excessive use of POV in the action scenes (a camera attached to the actor's body which provides a close-up of his face while fighting). Nevertheless, this film is yet another proof of how skillful this guy is behind the camera. There are so many memorable moments where the technique at display is worthy of awards. We will have to wait a few months to find such marvelous cinematography as in this film. Shyamalan and Mike Gioulakis (DP, director of photography) use our characters' respective colors (yellow for Kevin, green for David and purple for Mr. Glass) as the background palette of each scene in glorious fashion. The gradual change in color tells the audience so much about what our characters are going through, elevating one of the best dialogue sequences in the entire movie (the pink room).\r\n\r\nThe editing is sublime, and I love how Shyamalan uses close-ups to show how remarkable his cast is. McAvoy's performance is one of the best this year is going to give us, but part of it is even better due to the camera work. The unfocused background stunt work in a character's close-up is the art of filmmaking at his very best, and Shyamalan knows how to film it beautifully. The score is not as memorable as Unbreakable's, but the sound design is on point. Even with a low budget (compared to the other superhero movies), Shyamalan is able to produce a technical showdown of all his attributes as a sensational filmmaker. And this, my fellow readers, I will defend until the end of his career.\r\n\r\nAll in all, Glass doesn't live up to my extremely high expectations, but it does more than enough for me to enjoy it. I can't help but feel disappointed with the way everything ends and the path that Shyamalan chose, but there's still so much to love. James McAvoy offers you a performance worthy of any price of admission. Watching him portray over 15 characters is something you won't experience maybe ever again. Going through the layers of suspense, disbelief and mystery that the screenplay is structured by is itself an adventure filled with twists and turns which grabbed my attention until the very end.\r\n\r\nAn almost flawless first act delves into an overextended second act where the story lacks consistency and even logic, at times. However, the performances and the main thread of the film keeps everyone enthralled until the polarizing third and final act, where the significant plot twists occur. How can a movie be so fascinating and frustrating at the same time? Shyamalan, ladies and gentlemen. This masterful filmmaker lends all his skills to the film, and technically it’s close to perfection. Disappointing? Yes. Frustrating? Yes. Does it ruin the franchise? No, not even close. This isn’t The Matrix Revolutions, but it’s not Return of the King, as well. It’s a good ending to a superhero trilogy that might not be the best of all-time, but it’s up there, and it’s definitely unique, imaginative and the closest to what our real world would be like if superheroes were a real thing. \r\n\r\nIf you’re a comic-book fan, this trilogy is mandatory. If you love Marvel or DC, don’t you dare use the word “grounded” without watching this saga first. Shyamalan, see you around!\r\n\r\nRating: B+", "created_at": "2019-01-17T15:57:59.361Z"}, {"movie_id": 450465, "review_id": "5c5710289251410e1d4fc75f", "author_rating": null, "review_text": "It's a very good movie", "created_at": "2019-02-03T16:00:40.209Z"}, {"movie_id": 450465, "review_id": "5eb31d44f74f5f001d9632e4", "author_rating": 10.0, "review_text": "Wow! It was just...wow!\r\nM. Night Shyamalan finally made a worthwhile film, especially in a trilogy.", "created_at": "2020-05-06T20:25:40.397Z"}, {"movie_id": 450465, "review_id": "62dfacd8bbcae0005578d9f5", "author_rating": 7.0, "review_text": "I love these characters. I love the cast. I did not love the ending but... Eh, can't have everything. James McAvoy is so damn awesome with the multiple personalities his character has. And to me, this is one of Samuel L Jackson's best roles. Bruce Willis always delivers his bad ass persona in a way relateable by all who watch his films.", "created_at": "2022-07-26T08:59:04.377Z"}]