[{"movie_id": 140607, "review_id": "5675fd7792514179e7003dc5", "author_rating": null, "review_text": "So where were you when the Science Fiction cinema sensation ‘Star Wars’ took shape and captured the imagination of the massive global moviegoers’ escapist expectations back in 1977? Regardless of whether you existed thirty-eight years ago or not, the legend of George Lucas’ highly-heralded SF blockbuster that shattered box office records worldwide was automatically engrained in your cinematic psyche. Now nearly four decades later, the motion picture phenomenon that took place in ‘a galaxy a long time ago…far, far away’ has come to expand its entertaining promise and prominence even after numerous servings of movie sequels, television specials and other fanfare attributes that promoted the ‘Star Wars’ agenda throughout the countless years.\r\n\r\nThe modern-day arrival of yet another ‘Star Wars’ edition in the millennium movie-making age of technical and tactical brilliance is quite fitting and filmmaker J.J. Abrams is the right choice to helm this sacred film franchise and present a whole new litany of continuing adventurous narratives for a new generation of ‘Star Wars’ personalities dipping their tenacious toes into ‘the force of goodness’ battling ‘the dark side’ of authoritative evil.\r\n\r\nIn Abrams’s reboot ‘Star Wars: The Force Awakens’, the anticipation of enhancing and enlightening the reputation and respect of the Lucas landscape of stormtroopers, light sabres and of course the iconic ‘Star Wars’ returnees from the treasured trio of Harrison Ford (Han Solo)/Carrie Fisher (Leia) and Mark Hamill (Luke Skywalker) registers with a nostalgic blast of appreciation and exhilaration. ‘The Force Awakens’ is a sheer big screen celebration of majestic impishness and intrigue that will fortify the hunger of both casual and rabid ‘Star Wars’ fanatics. Indeed, the hype is warranted and Abrams, the mastermind of the big-budget movie sequelitis, is in top form as he triumphantly presents ‘The Force Awakens’ on a prized silver platter designed for its surging golden moments of charged ebullience.\r\n\r\nIn looking at the numbers game that is connected to the overall ‘Star Wars’ universe, it is hard to believe that the last prequel was released just a decade ago. Furthermore, it is mind-boggling that the aforementioned ‘Star Wars’ ‘royalty’ in Ford, Fisher and Hamill have shared the same space on film for the first time in over three decades since they last were featured in a ‘Star Wars’ movie together. Nevertheless, no one can deny that ‘The Force Awakens’ does not take the challenge in combining the remembrance of the ‘Star Wars’ installments of yesteryear with the fresh brand of current upstarts willing to engage in another boisterous saga that begins a whole chapter of compelling wonderment. The mix of veterans and novices in ‘The Force Awakens’ is quite interesting but the familiarity of the storytelling heft of good vs. evil is always a solid sell in the realm of the ‘Star Wars’ utopia.\r\n\r\nThe good news is that ‘The Force Awakens’ not only serves as a bridge that crosses both boundaries past and present in ‘Star Wars’ folklore but it taps into the masterful mystique that Lucas and company worked so diligently to showcase so historically some thirty-eight years ago. Still, some may have lobbied for a stronger storyline in ‘The Force Awakens’ as they may gently dismiss it as being merely thin in its premise while viewing it primarily as a launching pad to develop yet another series of movies to create the ‘Star Wars’ juggernaut for this current-day climax of warped speed wizardry. For those that want a basic outline of ‘The Force Awakens’ pulse it is as such where the beloved yet aging tandem of standouts Han Solo and Chewbacca (yes, good old hulking and walking hairball Chewie is back) is helping out heroic new bloods’ Rey and Finn (played by Daisy Ridley and John Boyega)’ in an effort to groom them for combating the emergence of Kylo Ren (Adam Driver), a villainous representative from the Dark Side of the Force.  \r\n\r\nBasically, ‘The Force Awakens’ is a grand and stirring homage to the prolific Science Fiction/space fantasy that dared to soar its ambitious wings while taking the old-fashioned concept of the good guys sparring with the bad guys and spinning a whimsical web of dark imperialism while searching for the intrinsic value of brotherhood. One cannot imagine the vitality of ‘Star Wars’ without the inclusion of notable and favorite characterizations that were instrumental in inviting a ravenous response to this filming phenom that has existed in your pop cultural lives for too many years to recount. In addition to joining top dogs in Ford’s Han Solo, Hamill’s Luke Skywalker, Fisher’s General Leia Organa (the former Princess Leia to all you old school ‘Star Wars’ enthusiasts out there) and Peter Mayhew’s Chewbacca, there is the welcomed presence of C3-PO (Anthony Daniels) as well. As for C3-PO’s newest sidekick BB-8, a mechanical rolling ball robot, he is the R2-D2 replacement that should easily win the heart of the kiddies looking for a cute contraption of a companion to treasure on the spot. It should be pointed out that ‘The Force Awakens’ is set 30 years from the last installment and thankfully this update has not lost a magical step since that time.\r\n\r\nAnyhow, the First Order’s solar system mechanism needs to be destroyed and must be eradicated by the young talents in spunky and pretty Rey (think the athletic female version of Luke Skywalker) as she teams up with former stormtrooper Finn, a warrior with an uncharacteristic compassion for not killing any designated weak soul as instructed. Naturally, this duo (while under the tutelage of the mature and ragged-looking Han Solo) has their hands full as they clash with the nefarious General Hux (Domhnall Gleeson from ‘Brooklyn’) and his Special Forces protégé Kylo Ren that strikes an immediate comparison to ‘Star Wars’ most notorious bad boy in the deliciously ruthless Darth Vader.\r\n\r\nDaisy Ridley's Rey and John Boyega's Finn are having a blast as the touted twosome out to save the day in J.J. Abram's celebrated STAR WARS reboot THE FORCE AWAKENS\r\nDaisy Ridley’s Rey and John Boyega’s Finn are having a blast as the touted twosome out to save the day in J.J. Abram’s celebrated STAR WARS reboot THE FORCE AWAKENS\r\nThankfully, the majority of the audience may recall similar elements in ‘The Force Awakens’ that was touched upon in ‘Star Wars’ editions such as ‘A New Hope’ and ‘Return Of The Jedi’ where the same structure and theme of the plot points are somewhat revisited. As charming and stimulating as ‘The Force Awakens’ appears in its glorious presentation of being a beautifully shot and visually vibrant popcorn piece, the real find in Abrams’ spectacular space-aged spectacle is Ridley’s heroine Rey, whose emotional and physical commitment to this futuristic fable feels grounded in genuine suspense and praise. Ridley has legitimate game and carries this hot and heavy galactic actioner on her sturdy shoulders with the overwhelming pressure of headlining a cinema giant looking the re-enter the consciousness of rabid ‘Star Wars’ aficionados everywhere. Clearly, we are invested in Ridley’s Rey whose feistiness never undercuts her feminine convictions or courageousness. She runs circles around her male co-stars in fellow ‘Star Wars’ newbies Boyega/Finn and Driver/Kylo Ren and her sense of empowerment is what drives the authentic Force behind Abrams’ inherited ‘Star Wars’ workload.\r\n\r\n‘Star Wars: The Force Awakens’ gleefully ignites the flashy flames of giddiness that we all associate with George Lucas’ indomitable big screen creation. The signature flourishes from composure John Williams’ commanding musical score to the stunning and innovative technical tweaking to the mixture of the old and new guard in front of the camera all make for an eventful and exciting return to the universal staging for a movie-making moment that will stand the test of time, the immense pop cultural movement at the movies known as ‘Star Wars’.\r\n\r\nStar Wars: The Force Awakens (2015)\r\n\r\nLucasfilms\r\n\r\n2 hrs. 15 mins.\r\n\r\nStarring: Harrison Ford, Daisy Ridley, Carrie Fisher, John Boyega, Oscar Isaac, Adam Driver, Peter Mayhew, Domhnall Gleeson, Lupita Nyong’o, Andy Serkis, Gwendoline Christie, Kenny Baker, Anthony Daniels  and Max von Sydow\r\n\r\nDirected and Co-Written by: J.J. Abrams\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Action and Adventure/Space Fantasy\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2015", "created_at": "2015-12-20T00:59:35.415Z"}, {"movie_id": 140607, "review_id": "569bd8d7c3a36858c800046d", "author_rating": null, "review_text": "A very entertaining film filled with immensely fun nostalgic moments and lots of laughs, but this is movie is not perfect, no it is not. \r\n\r\n**Spoiler alert!!**\r\n\r\nThis movie is an exact copy of the 4th one and this frustrates me more than it should. Although new characters and mysteries were introduced, the plot was too similar to the 4th film, but hey, at least they blew up the republic so no more boring bureaucracy!\r\nOne more thing that bothered me a lot is Kylo ren, not the character, the actor. I mean they couldn't pick an uglier wimp? I mean no offense Adam Driver, but bad guys need to look badass, and once you took of your helmet, you lost all hope of becoming a badass.\r\n\r\n**Summary:**\r\n\r\nDefinitely a movie worth watching despite minor setbacks.", "created_at": "2016-01-17T18:09:27.012Z"}, {"movie_id": 140607, "review_id": "571db465c3a3683de2000122", "author_rating": 9.0, "review_text": "Slumber Earthquake.\r\n\r\nThere really is no point trying to do an in depth review of this, it falls in line with a number of series blockbusters that are guaranteed to garner rabid responses, pro and con. \r\n\r\nThe Force Awakens is a film of many flaws, it has a pungent whiff of safeness about it, the charges of it being a glitzy remake are fair enough, while certain plot strands are frustrating and set to be big talking points for years - and years - to come.\r\n\r\nYet what about its worth to someone who is not obsessed with every finer detail? Someone who just loves the Star Wars universe as a spectacle prism of entertainment, and has just wanted a Star Wars film worthy of being fit to sit alongside that original trilogy?\r\n\r\nThis made me feel 11 again, took me back to a time in 1977 when I queued for three hours to see such wonders on the big screen. The Force Awakens is, in spite of the recognised flaws, a loving homage to a past love. It's sly with humour and nods to foundations, a blitzkrieg of effects and sound work (my Blu-ray viewing had my sub-woofer doing a jitterbug in the lounge), and it doesn't shy from surprise or the dangling of the carrot.\r\n\r\nThe makers have big heart and technical invention, the cast vibrant, spunky and strongly committed to the cause - the old hands a very reassuring presence - Yeah, so it's not sci-fi perfection, or any Star Wars geeks' idea of the perfect Star Wars movie (oh J.J. Abrams you devil you!), but it made this middle aged guy shed a tear of happiness. A moment to reaffirm why - as a young lad - I fell in love with film in the first place. 9/10", "created_at": "2016-04-25T06:08:37.324Z"}, {"movie_id": 140607, "review_id": "58d44f2fc3a368128901aa17", "author_rating": 8.0, "review_text": "**The Force Awakens: A New Hope 2.0**\r\n\r\nThe highly-anticipated follow-up to the Original Trilogy treads through familiar waters, taking the \"safe route\" approach. Though The Force Awakens has its fair share of phenomenal moments and is definitely an improvement over the Prequel Trilogy, its reliance on using the Original Trilogy (mainly A New Hope) as a template feels nothing more than an imitation of events that occurred prior.\r\n\r\nAt the end of Return of the Jedi, the Empire suffered a great loss, with the destruction of the Second Death Star and deaths of The Emperor and Darth Vader. It was implied that Luke, the last surviving Jedi, would restart a New Jedi Order (based on Expanded Universe media, which has been declared non-canon by Disney). That is indeed what happens; however, a rogue student of Luke's slaughtered his peers, seduced by the mysterious Supreme Leader Snoke of the First Order and adopts a new identity as Kylo Ren. In summary, the Jedi Order did indeed happen (off-screen), but gets wiped out (off-screen, again), leaving Luke the last surviving Jedi and retreats into exile (off-screen... seeing a pattern?). The Empire is basically resurrected as the First Order, with the Rebel Alliance becoming the Resistance, and once again, they're tasked with destroying a gigantic ball of death. Sounds an awful lot like A New Hope, as a modern-day \"soft reboot.\" \r\n\r\nDroid carrying top-secret info? Check.\r\nVillain dressed in black with mask? Check.\r\nProtagonist lives on desert planet? Check.\r\nDiscover that they're indeed Force-sensitive? Check.\r\nHan Solo and Chewbacca escorting our heroes to destination? Check.\r\nA cantina featuring a cantina band? Check.\r\nMentor figure (Obi-Wan in ANH, Han Solo in TFA) killed by villain? Check.\r\nBattle of Death Star (Yes, I'm calling Starkiller Base a Death Star)? Check.\r\nDoes big ball of death get destroyed? Check.\r\n\r\nRey is indeed a Force-sensitive individual, but throughout the movie, she is just as good a pilot as Han Solo, is able to use a Jedi mind trick with ease, and easily overcomes the villain (Though it could be argued that due to Kylo Ren's injury from Chewbacca, he was weakened). There better be a damn good explanation as to why Rey is so strong with the Force when The Last Jedi is released. Anakin and Luke required training to become a Jedi, Rey is basically a pro with little to absolutely no training.\r\n\r\nFinn... Though I did enjoy the idea of a Stormtrooper defecting from the First Order and eventually helping out the heroes, Finn got annoying quick. From cringe-worthy lines to his constant \"Gotta get away from the First Order\" state of mind, he should have been a more battle-hardened individual who eventually became disillusioned with the First Order. His more cowardly approach to defecting wasn't very well-executed. But I gotta admit that the relationship between him and Poe Dameron was well-done. Didn't feel forced, just felt natural. Him standing up to Kylo Ren in a duel made me respect his character a lot more. His battle with the other Stormtrooper was just amazing. I'm honestly hoping his character develops more in The Last Jedi.\r\n\r\nI liked Poe Dameron from the get-go. From being a smart-ass to Kylo Ren to taking out multiple TIE Fighters, Poe is definitely a welcome new character to the Star Wars universe. Especially BB-8, just an absolute ball of cuteness. BB-8 was one of the two new characters that really stood out to me. Funny how Star Wars manages to make you like the droids so much.\r\n\r\nHan Solo and Chewbacca play a substantial role in this film. Han Solo's death was beyond tragic, just seeing an iconic character we saw develop from a selfish, Force-denying individual to taking charge in dire times (putting his life on the line). Once Han Solo yelled out his son's name, I knew his time was up. Leia, now a General, doesn't really get much time to shine. She and Han have been broken up for some time now (I'm guessing since Ben Solo became Kylo Ren), but their bantering still remains. C-3PO (now with a red arm) and R2D2 (in low power mode due to Luke's departure) are basically given minimal roles in favor of BB-8. Luke Skywalker made an appearance in the very final moments of the movie, but does not utter a word. Just seeing his expression when Rey hands him his father's lightsaber was more than enough. \r\n\r\nA quick summary of other characters: Captain Phasma, a more useless female version of Boba Fett. Maz Kanata, a color and gender-swapped Yoda who somehow manages to obtain Anakin's/Luke's lightsaber. Supreme Leader Snoke, a mysterious figure leading the new Empire (sorry, First Order) and first appears as a hologram (like the Emperor). General Hux, deliverer of a Hitler-like speech to his space Nazis. \r\n\r\nKylo Ren. In my opinion, Kylo Ren is the best part of the entire movie. Sure he worships his deceased grandfather Anakin Skywalker/Darth Vader and flips out into extreme tantrums, he is more than just an ordinary one-dimensional villain. He worships Darth Vader because he wants to carry on his legacy of killing the Jedi and achieve his intimidating status of being a ruthless individual. He is torn by both sides of the Force. He is indeed strong with the Force, stopping blaster shots in mid-air, freezing people in-place, and can probe the minds of others as a method of torture. His unstable crossguard lightsaber is appropriate for his uncontrollable anger and conflicted state of mind. Once he killed Han Solo, there is no hope for him returning back to the Light. He became a full-on evil person. I'm ready to see the damage he will do in The Last Jedi.\r\n\r\nThe action/set pieces were very well-done and that opening sequence with the raid on the Jakku village is one of the best and most chilling moments in all of Star Wars. The Battle of Takodana and the resulting battle was phenomenal and seeing Poe take out multiple TIE Fighters make him an exceptionally skilled pilot, even moreso than Luke. The final battle between Rey/Finn and Kylo Ren didn't feel choreographed at all, just felt like a battle between novices, unlike the highly-choreographed kicks and flips and lightsaber-twirling present in the Prequel Trilogy. Rey and Finn leaving Jakku in the \"garbage\" ship and the whole sequence through the Star Destroyer graveyard was beyond phenomenal.\r\n\r\nThough The Force Awakens does indeed take steps forward to move the franchise forward into a new direction, it takes several steps back into familiar territory. And yes, it feels as if I have been ripping on this movie, but in my honest opinion, The Force Awakens is a solid entry to the Star Wars franchise. The action set-pieces were so well-done, the nostalgic factor of the Original Trilogy is prevalent, Kylo Ren proved to be a well-developed villain with room for improvement, and the relationships between the characters feels so organic and fluid-like, as if they're all cohesive with one-another.\r\n\r\nMy Rating: 7.5/10.0", "created_at": "2017-03-23T22:41:51.518Z"}, {"movie_id": 140607, "review_id": "5df9269f65686e00158a07b7", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nStar Wars: Episode VIII - The Last Jedi (2017) was just released, but my time didn't yet allow me to watch it. However, I do have time to review the film that started this new trilogy: The Force Awakens. At the time, it was my most anticipated movie of the year and I placed it second on the list of my favorite films of 2015 (just a bit below Mad Max: Fury Road).\r\n\r\nSo, yes, I do love this movie and it is definitely on the top3 of the saga! The cast choices are the undoubtful proof of the huge success that this film achieved. Daisy Ridley (Rey) is a massive discovery, her talent is limitless and she embraces her role like no other. She delivers a very emotional and powerful display, showing all of her acting skills. I can feel that she is 100% committed to her character and what a character to portray at your first big movie appearance.\r\n\r\nRey is excellently-developed throughout the film, she might mislead people into thinking she is just a mere scavenger, but once the movie gets going, she becomes an awesome character sharing some of the most epic moments in the whole runtime. She has an oddly mysterious backstory, which is going to produce theories and plot twists that I can't wait for, in the next films.\r\n\r\nJohn Boyega (Finn) is a fantastic supporting actor and another great casting. He brings just the right amount of humor with some exceptionally delivered lines and his facial expressions and timing are perfect. Finn is going to be one of the audience's favorites for sure, his journey to encounter Rey is interesting and unique in the saga. In my opinion, it is his story that carries the beginning of the movie and that sets up a lot of characters and plot points.\r\n\r\nAdam Driver as Kylo Ren ... Oh. My. God. What a performance! Driver is so subtle in the most meaningful moments but so compelling in the most menacing ones. He elevates Ren into a phenomenal antagonist with a splendidly written script. J.J. Abrams and co. do a wonderful job writing both the plot and the characters. Kylo Ren stands out, he is a multi-layered character with so much untold and hidden behind his personality and intriguing past. Once again, there are many theories and plot twists ahead that I'm drooling to know which one they are going to follow with.\r\n\r\nOscar Isaac is very exciting as Poe Dameron, another fabulous addition to the franchise. His character creates an honest bond with Finn and their interactions are pretty cool. They share some amazing scenes and Poe has all of the awesome X-Wing fights, which are outstanding. Supreme Leader Snoke (Andy Serkis) does not show up that much, but he definitely is a very threatening presence and a very well achieved motion capture work.\r\n\r\nAs for the original cast/characters, Harrison Ford has one of his best performances in the more recent years. Han Solo is one of his most popular characters and he portrays him flawlessly. Carrie Fisher returns as Leia and she offers a touch of reality to all of this. Every time she is on screen, everything becomes more realistic and tangible due to her graceful and humble display. Chewbacca has the usual funny \"dialogues\" with Solo and some glorious action set pieces.\r\n\r\nBB-8 is what people feared the most since he could easily be annoying or irrelevant. Thankfully, he is another checkbox on the list of marvelous additions to the Star Wars universe. It is mind-blowing how a droid can provide so much laughter and terrific action scenes, he is unquestionably a toy worth spending your money on for Christmas. C-3PO also appears and elevates the level of nostalgia that everyone is already full of.\r\n\r\nMoving to the technical aspects of the film, J.J. Abrams proves himself to every single person that doubted him since he is the main reason why this movie is one of the greats. From the seamless editing to the great camera work during the impressive action sequences, he enhances the story so much with his distinct use of visual storytelling. It feels like a real film and not just a Star Wars typical movie.\r\n\r\nThe visual effects are top notch and the cinematography could not be better due to the unbelievable practical backgrounds. Abrams uses a lot of long, wide shots with beautiful landscapes and mostly everything is real (besides the obvious, there is very few CGI, less than you probably think), which transforms every scene, every shot, into something more special. The tone is very well balanced between comedy and action, the storytelling process is astonishingly well handled and the pacing always maintains the tremendous excitement.\r\n\r\nOne of the common issues of all Star Wars films are the excessive exposition scenes. Well, J.J. massively improves on that aspect having just a couple of them and I am counting the traditional text that starts the movie. Like I said above, there is an extensive use of visual storytelling, in other words, everything that you see is giving you information while advancing the plot without actually literally telling you what is going on or what is going to happen.\r\n\r\nJohn Williams' score continues to superbly accompany every scene, not only the action ones, but it also strengthens dialogues. I love the ending, but here is where both fans and critics are going to become very divisive. It ends with a huge cliffhanger and some people are going to be disappointed because they are left with this feeling of unfulfillment and if you don't know how to deal with it, you might think you didn't enjoy the film.\r\n\r\nThe truth is you can't have everything right now. This is a trilogy, so it is absurd to even expect that you are going to have everything that you wish for in the first movie of a new era. I wanted more from the second the film finished, I also felt a bit let down because the movie concludes with something I had been expecting forever. However, this is a great feeling to have because it means the film meant something, it means the movie was so amazing that I just can't wait anymore for the next one!\r\n\r\nNevertheless, The Force Awakens can't escape some minor flaws. While pretty much every single character is great, Maz Kanata (Lupita Nyong'o) is not. With so much practical effects surrounding every environment, a 100% CGI character is going to (negatively) standout.  Besides, the whole subplot involving meeting with Maz feels a bit unnecessary and the story could have easily progressed without her.\r\n\r\nHowever, my main issue with this film is its lack of originality when it comes to creating a new actual danger for the galaxy. I mean, the Starkiller Base is essentially another Death Star, just bigger ... Really? They couldn't figure out anything else besides another giant planet destroyer? It does not reflect J.J. Abrams' incredible direction and the production team's excellent work, at all.\r\n\r\nFinally, there are some \"problems\" that I don't yet know if they are, in fact, problems. This is the first movie of the trilogy and some things happened that I don't know how or why they did, so I can't really fault the screenplay ... yet. We all know the huge plot device that Episode IV - A New Hope (1977) supposedly had for decades, but then Rogue One: A Star Wars Story (2016) was released and brilliantly solved what was already considered an internet meme.\r\n\r\nThis film does not have such a massive plot device, but there is one little moment that occurs in the first act that I still don't know if it is, in fact, a flaw or if there is an explanation waiting for us in the next movies.\r\n\r\nAll in all, The Force Awakens proves that the Star Wars franchise is still, very much, alive! This is easily one of the best films of 2015 and one of the best in the franchise. It features an outstanding cast with some excellent performances from the new actors joining the saga and powerfully nostalgic displays from the original members. Incredibly-developed characters carry this movie with the help of a mysterious and captivating screenplay, as well as a lot of visually exciting action sequences. J.J. Abrams has his stamp all over the film, with beautiful wide shots, massive practical effects, and exceptional use of visual storytelling. A cheap third Death Star and some very minor issues here and there don't allow the movie to shine flawlessly, but it is still freaking awesome! It undoubtedly belongs to my Top3, behind Empire Strikes Back and A New Hope.\r\n\r\nRating: A", "created_at": "2019-12-17T19:03:59.804Z"}, {"movie_id": 140607, "review_id": "5e09705300508a0017954ffb", "author_rating": 7.0, "review_text": "**The following is a review that I originally wrote in 2015.**\r\n\r\nWas it perfect?\r\nNo. \r\n\r\nWas it basically a shot for shot retread of A New Hope? \r\nYeah.\r\n\r\nDid it under-develop characters and plots of almost everything interesting to near Boba Fett-ian levels? \r\nSure.\r\n\r\nDid the entire thing rely on about 47 ridiculously implausible complete coincidences that the story would have fallen apart without?\r\nSounds accurate.\r\n\r\nBut after more than three decades, is Star Wars finally back?\r\nDamn right.\r\n\r\nApart from my just plain enjoying it, The Force Awakens makes me excited for the future of the franchise the first time in.. Well ever really. I liked the blend of new and old material, but I hope that moving forward, the series relies more on the new. I don't mean ditch all the original characters, I just mean we don't need endless callbacks to the past in Episode VIII. It worked fine for this one, and I totally get needing to re-acclimatise audiences, so I'm absolutely understanding of it in this case. But I hope they get away from that in future, and it seems very much as if that's the direction they're taking.", "created_at": "2019-12-30T03:34:43.960Z"}, {"movie_id": 140607, "review_id": "601b3e45ca0e17003e4d4847", "author_rating": 8.0, "review_text": "An enjoyable beginning to the sequel trilogy!\r\n\r\n<em>'Star Wars: The Force Awakens'</em> entertained me. It felt like a fresh direction for the overall franchise, which I guess is little surprise given George Lucas was not a major part of this. I actually didn't notice a great deal of difference, or at least as much as I thought there'd be given his exclusion.\r\n\r\nI enjoyed seeing the new cast merge with the old trio, even if there are only small appearances from two of the latter. Daisy Ridley and John Boyega are excellent additions, both give top performances - I will say I didn't sense major chemistry between the two, but I assume that'll come soon enough. Adam Driver, meanwhile, suits his role nicely.\r\n\r\nOriginal trio Harrison Ford, Carrie Fisher and Mark Hamill all feature, though - as alluded to - Ford is the only one that has a major part to play. Either way, it's cool seeing them back in the franchise.\r\n\r\nEverything else about the film satisfied me, I'm not saying it's perfect - esp. the plot - but I found it perfectly fun to watch. For me, it's a strong start for this era of <em>'Star Wars'</em>.", "created_at": "2021-02-04T00:22:29.334Z"}, {"movie_id": 140607, "review_id": "606a218b124c8d0078d3953e", "author_rating": 2.0, "review_text": "A meaningless continuation of a saga that was decidedly concluded in Return of the Jedi. This is a poor attempt at converting something that was created as a mythical epic into a soap opera.", "created_at": "2021-04-04T20:28:59.965Z"}]