[{"movie_id": 225728, "review_id": "5804e3fa92514148380000d2", "author_rating": 6.0, "review_text": "The directing and the photography are very good. The use of the color, the smoke and fog and the speed of the camera are very well chosen.\r\n\r\nFassbender gives a very good performance, but it swallows everybody else in the movie.\r\n\r\nWhat I don't like that much of this version is that Lady Macbeth almost fades away. Her character is not as important as it should be and, in the end, everything is expected and everything becomes a bit boring.", "created_at": "2016-10-17T14:45:14.218Z"}, {"movie_id": 225728, "review_id": "625721add96c3c00a6e55eda", "author_rating": 6.0, "review_text": "The thing about this play is that it is almost impossible to distil it down to two hours. Like most of Shakespeare's tragedies, there is immense richness in the language; in the pace the story develops; in the nuanced characterisations and in the imagery. Sure, the medium can reduce the need for much of the more descriptive narrative but it still takes time for the plotting and scheming; the menace and the power lust to percolate through. Now this isn't a terrible interpretation. Michael Fassbender is reasonable as the ambitious Thane of Glamis. He is informed by three witches after a battle that his accession to King Duncan's throne is assured, and together with his equally determined wife (Marion Cotillard) he sets about expediting that process. Not everyone believes his feigned innocence though, and that means he has to start removing his detractors - not least Banquo (Paddy Considine) and the late king's son Malcolm (an oddly cast Jack Raynor), and it's at this point that their cunning plan begins to unravel. The film looks great, the soundtrack is eerie and effective and the costumes, scenery and lighting really do help to convey something of the real Scottish environment; but again the absence of many significant plot lines - the caveats with the witches' initial prophecy, for example, rob the storyline of much of it's complex potency. The character of Lady Macbeth is underused as an underpinning motivation for her husband's actions and essentially we are just left with a rather straightforward story of power-hungry murder. It is worth watching, but it is also underwhelming.", "created_at": "2022-04-13T19:17:01.072Z"}]