[{"movie_id": 297802, "review_id": "5c22507dc3a368700bee2ef5", "author_rating": 7.0, "review_text": "Good movie to watch.", "created_at": "2018-12-25T15:45:01.785Z"}, {"movie_id": 297802, "review_id": "5c28f1c192514138d7c0a503", "author_rating": 7.0, "review_text": "***Lame-axx butt of a joke no longer*** \r\n\r\nArthur Curry (Jason Momoa) lives with his father on the Maine Coast, a caretaker of a lighthouse. With the mentorship of Vulko (Willem Dafoe) and the revelations of Mera (Amber Heard) he discovers that he is the half-breed heir to the underwater kingdom of Atlantis. As the rightful successor to the throne, he must tangle with his brother Orm (Patrick Wilson) to save the surface world from destruction. Meanwhile Black Manta (Yahya Abdul-Mateen II) seeks vengeance on Arthur for the death of his father.\r\n\r\n“Aquaman” (2018) is a colorful superhero flick featuring a flashy action scene for every 5 minute lull. It’s reminiscent of “Thor” (2011) and “Thor: The Dark World” (2013), but with spectacular undersea realms instead of Asgard & realms nearby. Yet the drama was better in those movies whereas here it feels like the creators were in a rush to jump to the next action sequence, which might make “Aquaman” ‘thrilling,’ but less compelling story-wise.\r\n\r\nStill, it’s very eventful with loads of energy (maybe TOO eventful for its own good). And I liked the balance of underwater scenes to surface scenes with spectacular locations, including the Sahara Desert and Sicily. Meanwhile Amber is stunning as redheaded Mera. Even Nicole Kidman shows up as Arthur’s mother, Atlanna. Speaking of Arthur, Momoa is magnificent as the protagonist and will forever change the public’s generally weak perception of Aquaman.\r\n\r\nThe film is a bit overlong at 2 hour, 23 minutes; and was shot in Australia (Hastings Point, Amity Point, Southport, Main Beach & Currumbin Beach); Newfoundland & Labrador, Canada; and Morocco (Erfoud & Merzouga).\r\n\r\nGRADE: B", "created_at": "2018-12-30T16:26:41.892Z"}, {"movie_id": 297802, "review_id": "5c2e36e192514164516c81ba", "author_rating": 8.0, "review_text": "I just came back home from watching Aquaman on the IMAX theater in Balexert in Geneva and thought that I should write something up while it’s still fresh in my mind. Something that happens all too rarely.\r\n\r\nI have to say that, overall, I had quite a blast watching this movie. It is indeed a good superhero and special effects extravaganza. In addition it is quite beautiful. A lot of the underwater scenes are very pleasing on the eye indeed. I am quite happy that I managed to drag my ass over to a theater and watch it on a IMAX screen. Some of the hype around it is perhaps a bit too much though. It does not quite reach the masterpiece level after all.\r\n\r\nStorywise, well it is a superhero movie after all so if you expect the story to be profound, logical and watertight you should lay off those mushrooms or whatever you are smoking. That said, the story was not too bad. Pretty straightforward and not too convoluted. A good, solid story suitable for a action/adventure movie.\r\n\r\nI did quite like the main protagonists on the good side. Especially Jason Momoa as Aquaman. I mean his time-to-kick-some-ass-stare was just so…evil. The script writer had put some stupid shit in there where he had to play overly dumb at times but on the whole he was a good guy throughout the entire movie. Almost no whining, angst and anti-hero shit like what have totally ruined most of the Marvel TV-shows lately.\r\n\r\nThe bad guys were not too bad either. Orm was lacking a bit in the bad guy charisma department but Black Manta was oozing despicable bad bad bad asshole from the first scene to the last. I probably should not say this because his weird helmet is indeed true to the comics but, well, it’s weird and kind of looks better in a comics than on the big screen.\r\n\r\nSpecial effects? Well, there is not that much to say really. They are pretty awesome throughout the movie and, as I wrote above, a lot of the time they are also beautiful. The various creatures, underwater vehicles and gadgets are really cool and well designed.\r\n\r\nThe one gripe I have about the movie is the totally unnecessary green preaching crap. Luckily it is confined to a couple of scenes but in those it is really slapped in the audience’s faces. A superhero movie should be entertaining, not preaching. If I want that shit I can turn on the news. It’s a star off from me just for that nonsense.", "created_at": "2019-01-03T16:22:57.540Z"}, {"movie_id": 297802, "review_id": "5c43f2630e0a266d5ad25734", "author_rating": 6.0, "review_text": "Doesn't hold a candle to _Wonder Woman_, but tall-buildings worth of leaps (and bounds) better than everything else that's come out of the DCIThoughtSheWasWithU. It's weirdly kind of... The nicest? Of these movies? Which is not the kind of direction you would think a film in this series would go based on how it started, but Jason Momoa is just charismatic as **Hell**, and _Aquaman_ leans on that a lot.\r\n\r\nBy the time it's over, _Aquaman_ really does hit just about every cliche of the genre there is, which is not exactly high praise. It's certainly not without heart, but it is still more spectacle than substance. But unlike, say, your _Transformers 4_, a movie often levelled the same criticism, it is not trash.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:00:35.748Z"}, {"movie_id": 297802, "review_id": "5c5088630e0a263ccdd9d015", "author_rating": null, "review_text": "Aquaman was soooo cool!!!", "created_at": "2019-01-29T17:07:47.559Z"}, {"movie_id": 297802, "review_id": "5ca0f1cb9251415bbe05297b", "author_rating": 10.0, "review_text": "I had decided to wait for the DVD release to watch this movie all I can say is wow oh wow why did I wait this was action galore lots of laughs momoah nailed the character perfectly to a t the movie was the best of the winter no doubt i highly recommend you get a copy of this movie no doubt you'll enjoy it I guarantee it", "created_at": "2019-03-31T16:58:51.536Z"}, {"movie_id": 297802, "review_id": "5d3d577521621b000ff0a42b", "author_rating": 1.0, "review_text": "The story was laughable.\r\nThe plot holes were immense.\r\nThe dialogue was atrocious.\r\nThe special effects were technically competent and pretty but cartoonish and unbelievable.\r\n\r\nEasily the worst film I've seen in the last year.\r\n\r\nIf it was a bit campy, then it might have succeeded in a kind of sub-Flash-Gordon fashion.", "created_at": "2019-07-28T08:06:13.022Z"}, {"movie_id": 297802, "review_id": "5d7b0f05af4324521a97f49f", "author_rating": 4.0, "review_text": "I am so conflicted.\r\nWe're introduced to the atlanteans with Nicole Kidman in a leotard and wet hair looking out of place in a living room and eating a gold fish.\r\nThe first fight scene has so many dramatic zoom-ins with dramatic music I thought I was watching the dramatic chipmunk video.\r\nWillem Dafoe riding a fish!\r\nCheesy lines like a bad 80's action parody.\r\nSome amazing CGI environments, others looked like they belonged in Diablo 3. Awful compositing throughout.\r\nUnnecessary detour through the Mines of Moria.\r\nPuzzles worthy of Lucas Arts point and click adventure games. A villain from 90s power rangers.\r\nAmazing scary trench scene! Giant sea creature war with fireworks and laser beams! \r\nNot good, and not bad enough to be entertaining.", "created_at": "2019-09-13T03:37:41.274Z"}, {"movie_id": 297802, "review_id": "62ca5a1de8d0280052f0f237", "author_rating": 6.0, "review_text": "_Aquaman_ delivers a fun and ambitious adventure for the DCEU, but flounders at its opportunity for true greatness.\r\n\r\nThere is so much to like about _Aquaman_, for starters the action is on another level. The DCEU has really mastered its fight choreography allowing for the directors to get wide, interesting shots of the action without having to add unnecessary cuts. There were so many fight sequences that had me thoroughly impressed with the creativity and the scope of the action. I particularly like how James Wan was able to transition across to the battlefield to show individual fights. It gave them a sense of connectedness that is sorely missing in many superhero films today.\r\n\r\nThe plot of this film had me intrigued, although it does tend to get quite weighed down by how involved the movie is. There are so many kingdoms of Atlantis involved and their relationships can get a tad confusing during the first watch. I was constantly trying to understand the relationships between all of the main members of Atlantis, but luckily, I could grasp the gist of what the story was trying to tell. I really appreciated the fantasy parallels that the directors were going for when it came to Atlantis. It gave it a grand feel on scale to a light version of Game of Thrones. The diversity of the nations was a really nice touch as well, I found it fascinating how each nation evolved independently from each other. The main criticism that I have with the story is the writing. There are so many scenarios or lines of dialogue that were incredibly awkward to watch. I think James Wan was really out of his element writing this movie compared to his cookie cutter horror films that he has built his reputation on. Hopefully he can learn from his mistakes for the sequel.\r\n\r\nI was not overly impressed with the acting in this film either. Jason Mamoa was acceptable as Aquaman but like I said previously there were quite a bit of lines that were delivered awkwardly. I found that the comedic timing of the jokes did not really land and felt out of place in this film. The chemistry between Mamoa and Amber Heard was non-existent, I did not buy for a second that the two were truly in love and the whole build up to the relationship felt incredibly forced. Willem Dafoe was excellent as always and Patrick Wilson was fairly adequate as well. This film had an all-star cast, so it is odd to me that so many lines were delivered awkwardly, I think it is more so on the writing and direction rather than the actors' abilities.\r\n\r\nEven with all my complaints about the film, I still found myself having a good time. Although, I can’t help but wonder, if given a more suitable director and writer, how amazing this film could have truly been.\r\n\r\n**Verdict:** _Decent_\r\n\r\n**Score:** _68%_", "created_at": "2022-07-10T04:48:29.516Z"}, {"movie_id": 297802, "review_id": "62dfab37e18e3f004bb6bc5e", "author_rating": 6.0, "review_text": "Honestly I wasn't expecting anything SPECTACULAR but it wasn't bad as I thought it would be. Mamoa pulls off Arthur very well it's the supporting cast... no, one cast member that turned my stomach to watch. AMBER HEARD. After all she did to Johnny Depp I got physically ILL watching her on screen. The rest of the movie would have been FINE if she wasn't in it. Honestly, I wish I could just BLOCK her out. I loved William Defoe's character... and I would have loved MORE interactions between him and other characters. I loved the visuals. Underwater is hard... so them making it so SEAMLESS, was awesome.", "created_at": "2022-07-26T08:52:07.230Z"}, {"movie_id": 297802, "review_id": "63c1ec7ae16e5a00819235f7", "author_rating": 5.0, "review_text": "I am so tired of CGI battles it's getting to the point where they put me to sleep. It was just too much there.\r\n\r\nHowever for most of the film it felt like an adventure, that is an improvement over Wonder Women which felt too much like it was trying to be the Dark Knight.\r\n\r\nUnfortunately, Aquaman goes into Dark Knight territory enough to irritate the audience. That was my complaint about MOST DCEU films, they aren't made to fit the character, they are all just Batman clones.\r\n\r\nIt should have stuck with the adventure feel and been a great film.\r\n\r\nInstead it went in the same direction that ruined Wonder Women and every other DC film of late, it tried to emulate Batman", "created_at": "2023-01-13T23:42:50.486Z"}, {"movie_id": 297802, "review_id": "63e72f45d388ae0080613e96", "author_rating": 8.0, "review_text": "**Aquaman truly feels like a comic book come to life with bright, vivid colors and all-out action from start to finish.**\r\n\r\nAquaman isn't a perfect movie, but even with its flaws, it's a blast that builds a massive new world in its own corner of the DCEU. Entire races and armies battle against each other for control of the world's oceans. Beautiful aesthetics fill this movie with stunning Greek landscapes to vast underwater kingdoms to haunting dark caverns. Aquaman is a fun Indiana Jones homage rolled into a comic book origin story anchored by Jason Momoa's tough-guy action hero. One of my favorite comic book characters of all time is Mera, and getting to see her in action was fantastic. Still, some of the changes they made to her backstory were a little disappointing, and her portrayal by a highly polarizing actress seems to have sidelined the character in future films. I loved the excessive action scenes and James Wan's over-the-top climactic undersea war. Everything about this movie felt full throttle, and even though it was a bit much at times, it made for a very entertaining popcorn flick.", "created_at": "2023-02-11T06:01:41.489Z"}, {"movie_id": 297802, "review_id": "5c22507dc3a368700bee2ef5", "author_rating": 7.0, "review_text": "Good movie to watch.", "created_at": "2018-12-25T15:45:01.785Z"}, {"movie_id": 297802, "review_id": "5c28f1c192514138d7c0a503", "author_rating": 7.0, "review_text": "***Lame-axx butt of a joke no longer*** \r\n\r\nArthur Curry (Jason Momoa) lives with his father on the Maine Coast, a caretaker of a lighthouse. With the mentorship of Vulko (Willem Dafoe) and the revelations of Mera (Amber Heard) he discovers that he is the half-breed heir to the underwater kingdom of Atlantis. As the rightful successor to the throne, he must tangle with his brother Orm (Patrick Wilson) to save the surface world from destruction. Meanwhile Black Manta (Yahya Abdul-Mateen II) seeks vengeance on Arthur for the death of his father.\r\n\r\n“Aquaman” (2018) is a colorful superhero flick featuring a flashy action scene for every 5 minute lull. It’s reminiscent of “Thor” (2011) and “Thor: The Dark World” (2013), but with spectacular undersea realms instead of Asgard & realms nearby. Yet the drama was better in those movies whereas here it feels like the creators were in a rush to jump to the next action sequence, which might make “Aquaman” ‘thrilling,’ but less compelling story-wise.\r\n\r\nStill, it’s very eventful with loads of energy (maybe TOO eventful for its own good). And I liked the balance of underwater scenes to surface scenes with spectacular locations, including the Sahara Desert and Sicily. Meanwhile Amber is stunning as redheaded Mera. Even Nicole Kidman shows up as Arthur’s mother, Atlanna. Speaking of Arthur, Momoa is magnificent as the protagonist and will forever change the public’s generally weak perception of Aquaman.\r\n\r\nThe film is a bit overlong at 2 hour, 23 minutes; and was shot in Australia (Hastings Point, Amity Point, Southport, Main Beach & Currumbin Beach); Newfoundland & Labrador, Canada; and Morocco (Erfoud & Merzouga).\r\n\r\nGRADE: B", "created_at": "2018-12-30T16:26:41.892Z"}, {"movie_id": 297802, "review_id": "5c2e36e192514164516c81ba", "author_rating": 8.0, "review_text": "I just came back home from watching Aquaman on the IMAX theater in Balexert in Geneva and thought that I should write something up while it’s still fresh in my mind. Something that happens all too rarely.\r\n\r\nI have to say that, overall, I had quite a blast watching this movie. It is indeed a good superhero and special effects extravaganza. In addition it is quite beautiful. A lot of the underwater scenes are very pleasing on the eye indeed. I am quite happy that I managed to drag my ass over to a theater and watch it on a IMAX screen. Some of the hype around it is perhaps a bit too much though. It does not quite reach the masterpiece level after all.\r\n\r\nStorywise, well it is a superhero movie after all so if you expect the story to be profound, logical and watertight you should lay off those mushrooms or whatever you are smoking. That said, the story was not too bad. Pretty straightforward and not too convoluted. A good, solid story suitable for a action/adventure movie.\r\n\r\nI did quite like the main protagonists on the good side. Especially Jason Momoa as Aquaman. I mean his time-to-kick-some-ass-stare was just so…evil. The script writer had put some stupid shit in there where he had to play overly dumb at times but on the whole he was a good guy throughout the entire movie. Almost no whining, angst and anti-hero shit like what have totally ruined most of the Marvel TV-shows lately.\r\n\r\nThe bad guys were not too bad either. Orm was lacking a bit in the bad guy charisma department but Black Manta was oozing despicable bad bad bad asshole from the first scene to the last. I probably should not say this because his weird helmet is indeed true to the comics but, well, it’s weird and kind of looks better in a comics than on the big screen.\r\n\r\nSpecial effects? Well, there is not that much to say really. They are pretty awesome throughout the movie and, as I wrote above, a lot of the time they are also beautiful. The various creatures, underwater vehicles and gadgets are really cool and well designed.\r\n\r\nThe one gripe I have about the movie is the totally unnecessary green preaching crap. Luckily it is confined to a couple of scenes but in those it is really slapped in the audience’s faces. A superhero movie should be entertaining, not preaching. If I want that shit I can turn on the news. It’s a star off from me just for that nonsense.", "created_at": "2019-01-03T16:22:57.540Z"}, {"movie_id": 297802, "review_id": "5c43f2630e0a266d5ad25734", "author_rating": 6.0, "review_text": "Doesn't hold a candle to _Wonder Woman_, but tall-buildings worth of leaps (and bounds) better than everything else that's come out of the DCIThoughtSheWasWithU. It's weirdly kind of... The nicest? Of these movies? Which is not the kind of direction you would think a film in this series would go based on how it started, but Jason Momoa is just charismatic as **Hell**, and _Aquaman_ leans on that a lot.\r\n\r\nBy the time it's over, _Aquaman_ really does hit just about every cliche of the genre there is, which is not exactly high praise. It's certainly not without heart, but it is still more spectacle than substance. But unlike, say, your _Transformers 4_, a movie often levelled the same criticism, it is not trash.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:00:35.748Z"}, {"movie_id": 297802, "review_id": "5c5088630e0a263ccdd9d015", "author_rating": null, "review_text": "Aquaman was soooo cool!!!", "created_at": "2019-01-29T17:07:47.559Z"}, {"movie_id": 297802, "review_id": "5ca0f1cb9251415bbe05297b", "author_rating": 10.0, "review_text": "I had decided to wait for the DVD release to watch this movie all I can say is wow oh wow why did I wait this was action galore lots of laughs momoah nailed the character perfectly to a t the movie was the best of the winter no doubt i highly recommend you get a copy of this movie no doubt you'll enjoy it I guarantee it", "created_at": "2019-03-31T16:58:51.536Z"}, {"movie_id": 297802, "review_id": "5d3d577521621b000ff0a42b", "author_rating": 1.0, "review_text": "The story was laughable.\r\nThe plot holes were immense.\r\nThe dialogue was atrocious.\r\nThe special effects were technically competent and pretty but cartoonish and unbelievable.\r\n\r\nEasily the worst film I've seen in the last year.\r\n\r\nIf it was a bit campy, then it might have succeeded in a kind of sub-Flash-Gordon fashion.", "created_at": "2019-07-28T08:06:13.022Z"}, {"movie_id": 297802, "review_id": "5d7b0f05af4324521a97f49f", "author_rating": 4.0, "review_text": "I am so conflicted.\r\nWe're introduced to the atlanteans with Nicole Kidman in a leotard and wet hair looking out of place in a living room and eating a gold fish.\r\nThe first fight scene has so many dramatic zoom-ins with dramatic music I thought I was watching the dramatic chipmunk video.\r\nWillem Dafoe riding a fish!\r\nCheesy lines like a bad 80's action parody.\r\nSome amazing CGI environments, others looked like they belonged in Diablo 3. Awful compositing throughout.\r\nUnnecessary detour through the Mines of Moria.\r\nPuzzles worthy of Lucas Arts point and click adventure games. A villain from 90s power rangers.\r\nAmazing scary trench scene! Giant sea creature war with fireworks and laser beams! \r\nNot good, and not bad enough to be entertaining.", "created_at": "2019-09-13T03:37:41.274Z"}, {"movie_id": 297802, "review_id": "62ca5a1de8d0280052f0f237", "author_rating": 6.0, "review_text": "_Aquaman_ delivers a fun and ambitious adventure for the DCEU, but flounders at its opportunity for true greatness.\r\n\r\nThere is so much to like about _Aquaman_, for starters the action is on another level. The DCEU has really mastered its fight choreography allowing for the directors to get wide, interesting shots of the action without having to add unnecessary cuts. There were so many fight sequences that had me thoroughly impressed with the creativity and the scope of the action. I particularly like how James Wan was able to transition across to the battlefield to show individual fights. It gave them a sense of connectedness that is sorely missing in many superhero films today.\r\n\r\nThe plot of this film had me intrigued, although it does tend to get quite weighed down by how involved the movie is. There are so many kingdoms of Atlantis involved and their relationships can get a tad confusing during the first watch. I was constantly trying to understand the relationships between all of the main members of Atlantis, but luckily, I could grasp the gist of what the story was trying to tell. I really appreciated the fantasy parallels that the directors were going for when it came to Atlantis. It gave it a grand feel on scale to a light version of Game of Thrones. The diversity of the nations was a really nice touch as well, I found it fascinating how each nation evolved independently from each other. The main criticism that I have with the story is the writing. There are so many scenarios or lines of dialogue that were incredibly awkward to watch. I think James Wan was really out of his element writing this movie compared to his cookie cutter horror films that he has built his reputation on. Hopefully he can learn from his mistakes for the sequel.\r\n\r\nI was not overly impressed with the acting in this film either. Jason Mamoa was acceptable as Aquaman but like I said previously there were quite a bit of lines that were delivered awkwardly. I found that the comedic timing of the jokes did not really land and felt out of place in this film. The chemistry between Mamoa and Amber Heard was non-existent, I did not buy for a second that the two were truly in love and the whole build up to the relationship felt incredibly forced. Willem Dafoe was excellent as always and Patrick Wilson was fairly adequate as well. This film had an all-star cast, so it is odd to me that so many lines were delivered awkwardly, I think it is more so on the writing and direction rather than the actors' abilities.\r\n\r\nEven with all my complaints about the film, I still found myself having a good time. Although, I can’t help but wonder, if given a more suitable director and writer, how amazing this film could have truly been.\r\n\r\n**Verdict:** _Decent_\r\n\r\n**Score:** _68%_", "created_at": "2022-07-10T04:48:29.516Z"}, {"movie_id": 297802, "review_id": "62dfab37e18e3f004bb6bc5e", "author_rating": 6.0, "review_text": "Honestly I wasn't expecting anything SPECTACULAR but it wasn't bad as I thought it would be. Mamoa pulls off Arthur very well it's the supporting cast... no, one cast member that turned my stomach to watch. AMBER HEARD. After all she did to Johnny Depp I got physically ILL watching her on screen. The rest of the movie would have been FINE if she wasn't in it. Honestly, I wish I could just BLOCK her out. I loved William Defoe's character... and I would have loved MORE interactions between him and other characters. I loved the visuals. Underwater is hard... so them making it so SEAMLESS, was awesome.", "created_at": "2022-07-26T08:52:07.230Z"}, {"movie_id": 297802, "review_id": "63c1ec7ae16e5a00819235f7", "author_rating": 5.0, "review_text": "I am so tired of CGI battles it's getting to the point where they put me to sleep. It was just too much there.\r\n\r\nHowever for most of the film it felt like an adventure, that is an improvement over Wonder Women which felt too much like it was trying to be the Dark Knight.\r\n\r\nUnfortunately, Aquaman goes into Dark Knight territory enough to irritate the audience. That was my complaint about MOST DCEU films, they aren't made to fit the character, they are all just Batman clones.\r\n\r\nIt should have stuck with the adventure feel and been a great film.\r\n\r\nInstead it went in the same direction that ruined Wonder Women and every other DC film of late, it tried to emulate Batman", "created_at": "2023-01-13T23:42:50.486Z"}, {"movie_id": 297802, "review_id": "63e72f45d388ae0080613e96", "author_rating": 8.0, "review_text": "**Aquaman truly feels like a comic book come to life with bright, vivid colors and all-out action from start to finish.**\r\n\r\nAquaman isn't a perfect movie, but even with its flaws, it's a blast that builds a massive new world in its own corner of the DCEU. Entire races and armies battle against each other for control of the world's oceans. Beautiful aesthetics fill this movie with stunning Greek landscapes to vast underwater kingdoms to haunting dark caverns. Aquaman is a fun Indiana Jones homage rolled into a comic book origin story anchored by Jason Momoa's tough-guy action hero. One of my favorite comic book characters of all time is Mera, and getting to see her in action was fantastic. Still, some of the changes they made to her backstory were a little disappointing, and her portrayal by a highly polarizing actress seems to have sidelined the character in future films. I loved the excessive action scenes and James Wan's over-the-top climactic undersea war. Everything about this movie felt full throttle, and even though it was a bit much at times, it made for a very entertaining popcorn flick.", "created_at": "2023-02-11T06:01:41.489Z"}, {"movie_id": 297802, "review_id": "5c22507dc3a368700bee2ef5", "author_rating": 7.0, "review_text": "Good movie to watch.", "created_at": "2018-12-25T15:45:01.785Z"}, {"movie_id": 297802, "review_id": "5c28f1c192514138d7c0a503", "author_rating": 7.0, "review_text": "***Lame-axx butt of a joke no longer*** \r\n\r\nArthur Curry (Jason Momoa) lives with his father on the Maine Coast, a caretaker of a lighthouse. With the mentorship of Vulko (Willem Dafoe) and the revelations of Mera (Amber Heard) he discovers that he is the half-breed heir to the underwater kingdom of Atlantis. As the rightful successor to the throne, he must tangle with his brother Orm (Patrick Wilson) to save the surface world from destruction. Meanwhile Black Manta (Yahya Abdul-Mateen II) seeks vengeance on Arthur for the death of his father.\r\n\r\n“Aquaman” (2018) is a colorful superhero flick featuring a flashy action scene for every 5 minute lull. It’s reminiscent of “Thor” (2011) and “Thor: The Dark World” (2013), but with spectacular undersea realms instead of Asgard & realms nearby. Yet the drama was better in those movies whereas here it feels like the creators were in a rush to jump to the next action sequence, which might make “Aquaman” ‘thrilling,’ but less compelling story-wise.\r\n\r\nStill, it’s very eventful with loads of energy (maybe TOO eventful for its own good). And I liked the balance of underwater scenes to surface scenes with spectacular locations, including the Sahara Desert and Sicily. Meanwhile Amber is stunning as redheaded Mera. Even Nicole Kidman shows up as Arthur’s mother, Atlanna. Speaking of Arthur, Momoa is magnificent as the protagonist and will forever change the public’s generally weak perception of Aquaman.\r\n\r\nThe film is a bit overlong at 2 hour, 23 minutes; and was shot in Australia (Hastings Point, Amity Point, Southport, Main Beach & Currumbin Beach); Newfoundland & Labrador, Canada; and Morocco (Erfoud & Merzouga).\r\n\r\nGRADE: B", "created_at": "2018-12-30T16:26:41.892Z"}, {"movie_id": 297802, "review_id": "5c2e36e192514164516c81ba", "author_rating": 8.0, "review_text": "I just came back home from watching Aquaman on the IMAX theater in Balexert in Geneva and thought that I should write something up while it’s still fresh in my mind. Something that happens all too rarely.\r\n\r\nI have to say that, overall, I had quite a blast watching this movie. It is indeed a good superhero and special effects extravaganza. In addition it is quite beautiful. A lot of the underwater scenes are very pleasing on the eye indeed. I am quite happy that I managed to drag my ass over to a theater and watch it on a IMAX screen. Some of the hype around it is perhaps a bit too much though. It does not quite reach the masterpiece level after all.\r\n\r\nStorywise, well it is a superhero movie after all so if you expect the story to be profound, logical and watertight you should lay off those mushrooms or whatever you are smoking. That said, the story was not too bad. Pretty straightforward and not too convoluted. A good, solid story suitable for a action/adventure movie.\r\n\r\nI did quite like the main protagonists on the good side. Especially Jason Momoa as Aquaman. I mean his time-to-kick-some-ass-stare was just so…evil. The script writer had put some stupid shit in there where he had to play overly dumb at times but on the whole he was a good guy throughout the entire movie. Almost no whining, angst and anti-hero shit like what have totally ruined most of the Marvel TV-shows lately.\r\n\r\nThe bad guys were not too bad either. Orm was lacking a bit in the bad guy charisma department but Black Manta was oozing despicable bad bad bad asshole from the first scene to the last. I probably should not say this because his weird helmet is indeed true to the comics but, well, it’s weird and kind of looks better in a comics than on the big screen.\r\n\r\nSpecial effects? Well, there is not that much to say really. They are pretty awesome throughout the movie and, as I wrote above, a lot of the time they are also beautiful. The various creatures, underwater vehicles and gadgets are really cool and well designed.\r\n\r\nThe one gripe I have about the movie is the totally unnecessary green preaching crap. Luckily it is confined to a couple of scenes but in those it is really slapped in the audience’s faces. A superhero movie should be entertaining, not preaching. If I want that shit I can turn on the news. It’s a star off from me just for that nonsense.", "created_at": "2019-01-03T16:22:57.540Z"}, {"movie_id": 297802, "review_id": "5c43f2630e0a266d5ad25734", "author_rating": 6.0, "review_text": "Doesn't hold a candle to _Wonder Woman_, but tall-buildings worth of leaps (and bounds) better than everything else that's come out of the DCIThoughtSheWasWithU. It's weirdly kind of... The nicest? Of these movies? Which is not the kind of direction you would think a film in this series would go based on how it started, but Jason Momoa is just charismatic as **Hell**, and _Aquaman_ leans on that a lot.\r\n\r\nBy the time it's over, _Aquaman_ really does hit just about every cliche of the genre there is, which is not exactly high praise. It's certainly not without heart, but it is still more spectacle than substance. But unlike, say, your _Transformers 4_, a movie often levelled the same criticism, it is not trash.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:00:35.748Z"}, {"movie_id": 297802, "review_id": "5c5088630e0a263ccdd9d015", "author_rating": null, "review_text": "Aquaman was soooo cool!!!", "created_at": "2019-01-29T17:07:47.559Z"}, {"movie_id": 297802, "review_id": "5ca0f1cb9251415bbe05297b", "author_rating": 10.0, "review_text": "I had decided to wait for the DVD release to watch this movie all I can say is wow oh wow why did I wait this was action galore lots of laughs momoah nailed the character perfectly to a t the movie was the best of the winter no doubt i highly recommend you get a copy of this movie no doubt you'll enjoy it I guarantee it", "created_at": "2019-03-31T16:58:51.536Z"}, {"movie_id": 297802, "review_id": "5d3d577521621b000ff0a42b", "author_rating": 1.0, "review_text": "The story was laughable.\r\nThe plot holes were immense.\r\nThe dialogue was atrocious.\r\nThe special effects were technically competent and pretty but cartoonish and unbelievable.\r\n\r\nEasily the worst film I've seen in the last year.\r\n\r\nIf it was a bit campy, then it might have succeeded in a kind of sub-Flash-Gordon fashion.", "created_at": "2019-07-28T08:06:13.022Z"}, {"movie_id": 297802, "review_id": "5d7b0f05af4324521a97f49f", "author_rating": 4.0, "review_text": "I am so conflicted.\r\nWe're introduced to the atlanteans with Nicole Kidman in a leotard and wet hair looking out of place in a living room and eating a gold fish.\r\nThe first fight scene has so many dramatic zoom-ins with dramatic music I thought I was watching the dramatic chipmunk video.\r\nWillem Dafoe riding a fish!\r\nCheesy lines like a bad 80's action parody.\r\nSome amazing CGI environments, others looked like they belonged in Diablo 3. Awful compositing throughout.\r\nUnnecessary detour through the Mines of Moria.\r\nPuzzles worthy of Lucas Arts point and click adventure games. A villain from 90s power rangers.\r\nAmazing scary trench scene! Giant sea creature war with fireworks and laser beams! \r\nNot good, and not bad enough to be entertaining.", "created_at": "2019-09-13T03:37:41.274Z"}, {"movie_id": 297802, "review_id": "62ca5a1de8d0280052f0f237", "author_rating": 6.0, "review_text": "_Aquaman_ delivers a fun and ambitious adventure for the DCEU, but flounders at its opportunity for true greatness.\r\n\r\nThere is so much to like about _Aquaman_, for starters the action is on another level. The DCEU has really mastered its fight choreography allowing for the directors to get wide, interesting shots of the action without having to add unnecessary cuts. There were so many fight sequences that had me thoroughly impressed with the creativity and the scope of the action. I particularly like how James Wan was able to transition across to the battlefield to show individual fights. It gave them a sense of connectedness that is sorely missing in many superhero films today.\r\n\r\nThe plot of this film had me intrigued, although it does tend to get quite weighed down by how involved the movie is. There are so many kingdoms of Atlantis involved and their relationships can get a tad confusing during the first watch. I was constantly trying to understand the relationships between all of the main members of Atlantis, but luckily, I could grasp the gist of what the story was trying to tell. I really appreciated the fantasy parallels that the directors were going for when it came to Atlantis. It gave it a grand feel on scale to a light version of Game of Thrones. The diversity of the nations was a really nice touch as well, I found it fascinating how each nation evolved independently from each other. The main criticism that I have with the story is the writing. There are so many scenarios or lines of dialogue that were incredibly awkward to watch. I think James Wan was really out of his element writing this movie compared to his cookie cutter horror films that he has built his reputation on. Hopefully he can learn from his mistakes for the sequel.\r\n\r\nI was not overly impressed with the acting in this film either. Jason Mamoa was acceptable as Aquaman but like I said previously there were quite a bit of lines that were delivered awkwardly. I found that the comedic timing of the jokes did not really land and felt out of place in this film. The chemistry between Mamoa and Amber Heard was non-existent, I did not buy for a second that the two were truly in love and the whole build up to the relationship felt incredibly forced. Willem Dafoe was excellent as always and Patrick Wilson was fairly adequate as well. This film had an all-star cast, so it is odd to me that so many lines were delivered awkwardly, I think it is more so on the writing and direction rather than the actors' abilities.\r\n\r\nEven with all my complaints about the film, I still found myself having a good time. Although, I can’t help but wonder, if given a more suitable director and writer, how amazing this film could have truly been.\r\n\r\n**Verdict:** _Decent_\r\n\r\n**Score:** _68%_", "created_at": "2022-07-10T04:48:29.516Z"}, {"movie_id": 297802, "review_id": "62dfab37e18e3f004bb6bc5e", "author_rating": 6.0, "review_text": "Honestly I wasn't expecting anything SPECTACULAR but it wasn't bad as I thought it would be. Mamoa pulls off Arthur very well it's the supporting cast... no, one cast member that turned my stomach to watch. AMBER HEARD. After all she did to Johnny Depp I got physically ILL watching her on screen. The rest of the movie would have been FINE if she wasn't in it. Honestly, I wish I could just BLOCK her out. I loved William Defoe's character... and I would have loved MORE interactions between him and other characters. I loved the visuals. Underwater is hard... so them making it so SEAMLESS, was awesome.", "created_at": "2022-07-26T08:52:07.230Z"}, {"movie_id": 297802, "review_id": "63c1ec7ae16e5a00819235f7", "author_rating": 5.0, "review_text": "I am so tired of CGI battles it's getting to the point where they put me to sleep. It was just too much there.\r\n\r\nHowever for most of the film it felt like an adventure, that is an improvement over Wonder Women which felt too much like it was trying to be the Dark Knight.\r\n\r\nUnfortunately, Aquaman goes into Dark Knight territory enough to irritate the audience. That was my complaint about MOST DCEU films, they aren't made to fit the character, they are all just Batman clones.\r\n\r\nIt should have stuck with the adventure feel and been a great film.\r\n\r\nInstead it went in the same direction that ruined Wonder Women and every other DC film of late, it tried to emulate Batman", "created_at": "2023-01-13T23:42:50.486Z"}, {"movie_id": 297802, "review_id": "63e72f45d388ae0080613e96", "author_rating": 8.0, "review_text": "**Aquaman truly feels like a comic book come to life with bright, vivid colors and all-out action from start to finish.**\r\n\r\nAquaman isn't a perfect movie, but even with its flaws, it's a blast that builds a massive new world in its own corner of the DCEU. Entire races and armies battle against each other for control of the world's oceans. Beautiful aesthetics fill this movie with stunning Greek landscapes to vast underwater kingdoms to haunting dark caverns. Aquaman is a fun Indiana Jones homage rolled into a comic book origin story anchored by Jason Momoa's tough-guy action hero. One of my favorite comic book characters of all time is Mera, and getting to see her in action was fantastic. Still, some of the changes they made to her backstory were a little disappointing, and her portrayal by a highly polarizing actress seems to have sidelined the character in future films. I loved the excessive action scenes and James Wan's over-the-top climactic undersea war. Everything about this movie felt full throttle, and even though it was a bit much at times, it made for a very entertaining popcorn flick.", "created_at": "2023-02-11T06:01:41.489Z"}, {"movie_id": 297802, "review_id": "5c22507dc3a368700bee2ef5", "author_rating": 7.0, "review_text": "Good movie to watch.", "created_at": "2018-12-25T15:45:01.785Z"}, {"movie_id": 297802, "review_id": "5c28f1c192514138d7c0a503", "author_rating": 7.0, "review_text": "***Lame-axx butt of a joke no longer*** \r\n\r\nArthur Curry (Jason Momoa) lives with his father on the Maine Coast, a caretaker of a lighthouse. With the mentorship of Vulko (Willem Dafoe) and the revelations of Mera (Amber Heard) he discovers that he is the half-breed heir to the underwater kingdom of Atlantis. As the rightful successor to the throne, he must tangle with his brother Orm (Patrick Wilson) to save the surface world from destruction. Meanwhile Black Manta (Yahya Abdul-Mateen II) seeks vengeance on Arthur for the death of his father.\r\n\r\n“Aquaman” (2018) is a colorful superhero flick featuring a flashy action scene for every 5 minute lull. It’s reminiscent of “Thor” (2011) and “Thor: The Dark World” (2013), but with spectacular undersea realms instead of Asgard & realms nearby. Yet the drama was better in those movies whereas here it feels like the creators were in a rush to jump to the next action sequence, which might make “Aquaman” ‘thrilling,’ but less compelling story-wise.\r\n\r\nStill, it’s very eventful with loads of energy (maybe TOO eventful for its own good). And I liked the balance of underwater scenes to surface scenes with spectacular locations, including the Sahara Desert and Sicily. Meanwhile Amber is stunning as redheaded Mera. Even Nicole Kidman shows up as Arthur’s mother, Atlanna. Speaking of Arthur, Momoa is magnificent as the protagonist and will forever change the public’s generally weak perception of Aquaman.\r\n\r\nThe film is a bit overlong at 2 hour, 23 minutes; and was shot in Australia (Hastings Point, Amity Point, Southport, Main Beach & Currumbin Beach); Newfoundland & Labrador, Canada; and Morocco (Erfoud & Merzouga).\r\n\r\nGRADE: B", "created_at": "2018-12-30T16:26:41.892Z"}, {"movie_id": 297802, "review_id": "5c2e36e192514164516c81ba", "author_rating": 8.0, "review_text": "I just came back home from watching Aquaman on the IMAX theater in Balexert in Geneva and thought that I should write something up while it’s still fresh in my mind. Something that happens all too rarely.\r\n\r\nI have to say that, overall, I had quite a blast watching this movie. It is indeed a good superhero and special effects extravaganza. In addition it is quite beautiful. A lot of the underwater scenes are very pleasing on the eye indeed. I am quite happy that I managed to drag my ass over to a theater and watch it on a IMAX screen. Some of the hype around it is perhaps a bit too much though. It does not quite reach the masterpiece level after all.\r\n\r\nStorywise, well it is a superhero movie after all so if you expect the story to be profound, logical and watertight you should lay off those mushrooms or whatever you are smoking. That said, the story was not too bad. Pretty straightforward and not too convoluted. A good, solid story suitable for a action/adventure movie.\r\n\r\nI did quite like the main protagonists on the good side. Especially Jason Momoa as Aquaman. I mean his time-to-kick-some-ass-stare was just so…evil. The script writer had put some stupid shit in there where he had to play overly dumb at times but on the whole he was a good guy throughout the entire movie. Almost no whining, angst and anti-hero shit like what have totally ruined most of the Marvel TV-shows lately.\r\n\r\nThe bad guys were not too bad either. Orm was lacking a bit in the bad guy charisma department but Black Manta was oozing despicable bad bad bad asshole from the first scene to the last. I probably should not say this because his weird helmet is indeed true to the comics but, well, it’s weird and kind of looks better in a comics than on the big screen.\r\n\r\nSpecial effects? Well, there is not that much to say really. They are pretty awesome throughout the movie and, as I wrote above, a lot of the time they are also beautiful. The various creatures, underwater vehicles and gadgets are really cool and well designed.\r\n\r\nThe one gripe I have about the movie is the totally unnecessary green preaching crap. Luckily it is confined to a couple of scenes but in those it is really slapped in the audience’s faces. A superhero movie should be entertaining, not preaching. If I want that shit I can turn on the news. It’s a star off from me just for that nonsense.", "created_at": "2019-01-03T16:22:57.540Z"}, {"movie_id": 297802, "review_id": "5c43f2630e0a266d5ad25734", "author_rating": 6.0, "review_text": "Doesn't hold a candle to _Wonder Woman_, but tall-buildings worth of leaps (and bounds) better than everything else that's come out of the DCIThoughtSheWasWithU. It's weirdly kind of... The nicest? Of these movies? Which is not the kind of direction you would think a film in this series would go based on how it started, but Jason Momoa is just charismatic as **Hell**, and _Aquaman_ leans on that a lot.\r\n\r\nBy the time it's over, _Aquaman_ really does hit just about every cliche of the genre there is, which is not exactly high praise. It's certainly not without heart, but it is still more spectacle than substance. But unlike, say, your _Transformers 4_, a movie often levelled the same criticism, it is not trash.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:00:35.748Z"}, {"movie_id": 297802, "review_id": "5c5088630e0a263ccdd9d015", "author_rating": null, "review_text": "Aquaman was soooo cool!!!", "created_at": "2019-01-29T17:07:47.559Z"}, {"movie_id": 297802, "review_id": "5ca0f1cb9251415bbe05297b", "author_rating": 10.0, "review_text": "I had decided to wait for the DVD release to watch this movie all I can say is wow oh wow why did I wait this was action galore lots of laughs momoah nailed the character perfectly to a t the movie was the best of the winter no doubt i highly recommend you get a copy of this movie no doubt you'll enjoy it I guarantee it", "created_at": "2019-03-31T16:58:51.536Z"}, {"movie_id": 297802, "review_id": "5d3d577521621b000ff0a42b", "author_rating": 1.0, "review_text": "The story was laughable.\r\nThe plot holes were immense.\r\nThe dialogue was atrocious.\r\nThe special effects were technically competent and pretty but cartoonish and unbelievable.\r\n\r\nEasily the worst film I've seen in the last year.\r\n\r\nIf it was a bit campy, then it might have succeeded in a kind of sub-Flash-Gordon fashion.", "created_at": "2019-07-28T08:06:13.022Z"}, {"movie_id": 297802, "review_id": "5d7b0f05af4324521a97f49f", "author_rating": 4.0, "review_text": "I am so conflicted.\r\nWe're introduced to the atlanteans with Nicole Kidman in a leotard and wet hair looking out of place in a living room and eating a gold fish.\r\nThe first fight scene has so many dramatic zoom-ins with dramatic music I thought I was watching the dramatic chipmunk video.\r\nWillem Dafoe riding a fish!\r\nCheesy lines like a bad 80's action parody.\r\nSome amazing CGI environments, others looked like they belonged in Diablo 3. Awful compositing throughout.\r\nUnnecessary detour through the Mines of Moria.\r\nPuzzles worthy of Lucas Arts point and click adventure games. A villain from 90s power rangers.\r\nAmazing scary trench scene! Giant sea creature war with fireworks and laser beams! \r\nNot good, and not bad enough to be entertaining.", "created_at": "2019-09-13T03:37:41.274Z"}, {"movie_id": 297802, "review_id": "62ca5a1de8d0280052f0f237", "author_rating": 6.0, "review_text": "_Aquaman_ delivers a fun and ambitious adventure for the DCEU, but flounders at its opportunity for true greatness.\r\n\r\nThere is so much to like about _Aquaman_, for starters the action is on another level. The DCEU has really mastered its fight choreography allowing for the directors to get wide, interesting shots of the action without having to add unnecessary cuts. There were so many fight sequences that had me thoroughly impressed with the creativity and the scope of the action. I particularly like how James Wan was able to transition across to the battlefield to show individual fights. It gave them a sense of connectedness that is sorely missing in many superhero films today.\r\n\r\nThe plot of this film had me intrigued, although it does tend to get quite weighed down by how involved the movie is. There are so many kingdoms of Atlantis involved and their relationships can get a tad confusing during the first watch. I was constantly trying to understand the relationships between all of the main members of Atlantis, but luckily, I could grasp the gist of what the story was trying to tell. I really appreciated the fantasy parallels that the directors were going for when it came to Atlantis. It gave it a grand feel on scale to a light version of Game of Thrones. The diversity of the nations was a really nice touch as well, I found it fascinating how each nation evolved independently from each other. The main criticism that I have with the story is the writing. There are so many scenarios or lines of dialogue that were incredibly awkward to watch. I think James Wan was really out of his element writing this movie compared to his cookie cutter horror films that he has built his reputation on. Hopefully he can learn from his mistakes for the sequel.\r\n\r\nI was not overly impressed with the acting in this film either. Jason Mamoa was acceptable as Aquaman but like I said previously there were quite a bit of lines that were delivered awkwardly. I found that the comedic timing of the jokes did not really land and felt out of place in this film. The chemistry between Mamoa and Amber Heard was non-existent, I did not buy for a second that the two were truly in love and the whole build up to the relationship felt incredibly forced. Willem Dafoe was excellent as always and Patrick Wilson was fairly adequate as well. This film had an all-star cast, so it is odd to me that so many lines were delivered awkwardly, I think it is more so on the writing and direction rather than the actors' abilities.\r\n\r\nEven with all my complaints about the film, I still found myself having a good time. Although, I can’t help but wonder, if given a more suitable director and writer, how amazing this film could have truly been.\r\n\r\n**Verdict:** _Decent_\r\n\r\n**Score:** _68%_", "created_at": "2022-07-10T04:48:29.516Z"}, {"movie_id": 297802, "review_id": "62dfab37e18e3f004bb6bc5e", "author_rating": 6.0, "review_text": "Honestly I wasn't expecting anything SPECTACULAR but it wasn't bad as I thought it would be. Mamoa pulls off Arthur very well it's the supporting cast... no, one cast member that turned my stomach to watch. AMBER HEARD. After all she did to Johnny Depp I got physically ILL watching her on screen. The rest of the movie would have been FINE if she wasn't in it. Honestly, I wish I could just BLOCK her out. I loved William Defoe's character... and I would have loved MORE interactions between him and other characters. I loved the visuals. Underwater is hard... so them making it so SEAMLESS, was awesome.", "created_at": "2022-07-26T08:52:07.230Z"}, {"movie_id": 297802, "review_id": "63c1ec7ae16e5a00819235f7", "author_rating": 5.0, "review_text": "I am so tired of CGI battles it's getting to the point where they put me to sleep. It was just too much there.\r\n\r\nHowever for most of the film it felt like an adventure, that is an improvement over Wonder Women which felt too much like it was trying to be the Dark Knight.\r\n\r\nUnfortunately, Aquaman goes into Dark Knight territory enough to irritate the audience. That was my complaint about MOST DCEU films, they aren't made to fit the character, they are all just Batman clones.\r\n\r\nIt should have stuck with the adventure feel and been a great film.\r\n\r\nInstead it went in the same direction that ruined Wonder Women and every other DC film of late, it tried to emulate Batman", "created_at": "2023-01-13T23:42:50.486Z"}, {"movie_id": 297802, "review_id": "63e72f45d388ae0080613e96", "author_rating": 8.0, "review_text": "**Aquaman truly feels like a comic book come to life with bright, vivid colors and all-out action from start to finish.**\r\n\r\nAquaman isn't a perfect movie, but even with its flaws, it's a blast that builds a massive new world in its own corner of the DCEU. Entire races and armies battle against each other for control of the world's oceans. Beautiful aesthetics fill this movie with stunning Greek landscapes to vast underwater kingdoms to haunting dark caverns. Aquaman is a fun Indiana Jones homage rolled into a comic book origin story anchored by Jason Momoa's tough-guy action hero. One of my favorite comic book characters of all time is Mera, and getting to see her in action was fantastic. Still, some of the changes they made to her backstory were a little disappointing, and her portrayal by a highly polarizing actress seems to have sidelined the character in future films. I loved the excessive action scenes and James Wan's over-the-top climactic undersea war. Everything about this movie felt full throttle, and even though it was a bit much at times, it made for a very entertaining popcorn flick.", "created_at": "2023-02-11T06:01:41.489Z"}]