[{"movie_id": 337170, "review_id": "5a493c3c9251415c8f001ce1", "author_rating": 9.0, "review_text": "_American Made_ is a peculiar film, but a very enjoyable one. It takes a playful, satirical look at the origins of the notorious 'Iran-Contra' affair, through the eyes of pilot Barry Seal. Along the ways we get thrills, laughs, astonishing (true-life) twists and turns and some vivid characters.\r\n\r\nEven if you followed the public Iran-Contra scandal, you may be unfamiliar with the story of Seal, who started running guns for the CIA years before the familiar public scandal erupted. American Made is a fast, breezy, amoral look at the ins and outs of a covert operation made to go wrong. There's no judgment here; in fact, we come to like Seal's crazy make-it-up-as-you-go-along approach to flying, to crime and to life in general.\r\n\r\nTom Cruise is perfectly cast as the cocky, reckless pilot. I've done a fair bit of flying, and I've met one or two hot-shots like (in a lesser degree) the one Cruise portrays. Cruise has lately been playing parts that are much too young for him (e.g. _Jack Reacher: Never Go Back_), but his age works well in this case. In a way, Seal is a guy fighting to stay young.\r\n\r\nIf there's one there's one thing to regret about _American Made_ it's that it carefully avoids most of the political backdrop. We're told that the Sandinistas were evil Russian-backed Communists, which is undoubtedly what the CIA would have said at the time. (Hindsight is more ambiguous.) We're shown, just barely, how the Reagan administration evolved a cockeyed criminal scheme for its own ends, but the film ends where the public Iran-Contra scandal began. Ollie North is a presence in only one or two shots.\r\n\r\nNonetheless, Barry Seal's personal story arc is wrapped up perfectly. The ending doesn't let anyone off the hook, but it does leave us questioning our own moral position, as we're inevitably drawn to like and admire Barry Seal, in spite of his total lack of scruples or judgment.\r\n\r\nDoug Liman directs with his usual flair. He's had a remarkably varied career, ranging from spy-action (_Bourne Identity_) to superheroes (_Jumper_) to political drama (_Fair Game_) to straight-up sci-fi (_Edge of Tomorrow_). _American Made_ stands up very well in that catalog. It's a fun film, a thoughtful film, an unusual film... though its darker side may not appeal to every taste.", "created_at": "2017-12-31T19:36:28.630Z"}, {"movie_id": 337170, "review_id": "63c1f1ae17b5ef00d360996c", "author_rating": 10.0, "review_text": "It's always kind of fun seeing Tom Cruise in a role where he has to actually act and not just do the action phone-in-emotion thing...because he is capable of being a decent actor and not just a pretty-boy action star.\r\n\r\nAnd, in this he was a decent actor.\r\n\r\nAnd the result is a very enjoyable and fun period piece that has just as much drama as it does action and comedy, which allows the time dedication to slip buy unnoticed.\r\n\r\nIt's actually pretty rare that you can watch a film this long and not really feel like you're watching a long film.\r\n\r\nThe only real downside is that the end hits you a bit abruptly, a bit too abruptly for the build up...but who cares when the build-up is this enjoyable.", "created_at": "2023-01-14T00:05:02.512Z"}]