[{"movie_id": 171274, "review_id": "58c14f6ac3a3687dd9004ee3", "author_rating": 7.0, "review_text": "'Inherent Vice' is the next feature film from Paul Thomas Anderson and you can tell. It boasts a great soundtrack, brilliant acting and a very convoluted story as it tells the story of a private detective (Phoenix) as he investigates into the disappearance of a former girlfriend.\r\n\r\nThe screenplay is very confusing. It is hard to follow and purposely so as it introduces many characters and multiple stories but I have heard that this aspect of the screenplay is very true to the original source material. All I could do was admit that the film was too bewildering and to enjoy the many jokes and humorous situations.\r\n\r\nJoaquin Phoenix is tremendous as the main character Larry \"Doc\" Sportello. He is complimented with a great supporting cast such as Josh Brolin and Benicio Del Toro.\r\n\r\nOverall, 'Inherent Vice' is not a typical popcorn flick and I was very confused by the overwhelming plot.\r\n\r\n★★★½", "created_at": "2017-03-09T12:49:46.202Z"}, {"movie_id": 171274, "review_id": "63bf4d7fe16e5a0092b32494", "author_rating": 10.0, "review_text": "I kind of feel that Anderson lends himself to a film like this. He uses a lot of extreme wide angles and if you ever smoked a little dope in college the world looks a little like when you mount that 18mm on your SLR. His choice of lenses lends itself to telling the story of a guy like Doc without going over the top ala Fear and Loathing and making it a little too blatantly FX.\r\n\r\nThe humor works in best possible dry as a martini kind of way, and it's played straight like comedy should be.\r\n\r\nBut really, the premise sold me. Take a hard boiled film noir kind of mystery and replace Sam Spade with the perpetual stoner and then watch him try to solve a mystery.\r\n\r\nIt's incoherent enough to make you believe that Doc is just a little too rocked to function properly most of the time, which is reflected in his effectiveness and decision making skills. He's smart enough to not bumble his way through it, but has gotten off the magic school bus enough to do his best possible work.\r\n\r\nAnd it makes the film do that one singular thing that all movies are required to do in order to be called a success... it entertains.\r\n\r\nAnd honestly it's a delight to watch. The acting was great, the director was the best possible person to take on the adaptation, and the lighting walked that fine line between naturalistic and cinematic.\r\n\r\nI'd call it a beautiful film, but it's hard to call a movie about drugs beautiful without sounding utterly pretentious... so, I'll settle with the highest praise a movie can get... it's entertaining and a pleasure to watch.", "created_at": "2023-01-11T23:59:59.139Z"}]