[{"movie_id": 273481, "review_id": "56c099389251412be00005f2", "author_rating": 9.0, "review_text": "> One of the finest movie about the raids on cartel gangs.\r\n\r\nThis was really a great film. Fighting against the drug trafficking was the theme. The story of an FBI agent who was recruited to work in an elite force that no one knows its existence. Their's aim is to tackle the main source, instead to deal with its lower order. Something that impossible to do without international cooperation. Every raid is done in secretively, sometime if required at any cost in whatever effort to stop it. Like I said, this was an awesome movie, and good to see it after the documentary like 'Cartel Land'.\r\n\r\nThe story is kind of hard to detail it out, because it was more an action movie than the talking. How a special force unit goes after the bad guys and stops them is the main plot. But the characters were so distinctive, every main roles had their own agenda for what they are doing and that's how the narration dominated with the high standards.\r\n\r\nThe cast who played them were simply outstanding, including that starts with Emily Blunt, who is someone looks changed the attitude to play physically challenging roles after 'Edge of Tomorrow'. And then Josh Brolin and another one, an upcoming young British actor who I really don't know, but Benicio Del Toro was actually the show stealer.\r\n\r\nHis part was unexpectedly great, totally raw and aggressive. Especially the his end scene, no one could have guessed it, but that's how the way it is. No doubt any top actors would have denied to perform that, anyway well shot with minimum violence, but the intention was very clear as fighting against the dark forces to cut off the head first. One of the best movie of the year, so definitely recommended if you're interested.\r\n\r\n8½/10", "created_at": "2016-02-14T15:11:52.766Z"}, {"movie_id": 273481, "review_id": "56d94725c3a36870ac00f230", "author_rating": 8.0, "review_text": "An stereotypical plot with, somehow, some interesting addition.\r\n\r\nThe plot is not superb but the script is really good, Del Toro makes a good performance and, as alway, a great pleasure to watch any movie with Emily Blunt on it. Great performance.\r\n\r\nThe directing is also really good and the soundtrack is remarkable, creating quite an atmosphere.\r\n\r\nFinally, the action scenes are very well done, with a sense of contempt. No fireworks here, just something that can be the closest to reality.", "created_at": "2016-03-04T08:28:21.016Z"}, {"movie_id": 273481, "review_id": "58c17143c3a36825db00aa92", "author_rating": 7.0, "review_text": "'Sicario' was a really good action film. The acting all around was very good (in particularly Emily Blunt). The set pieces were very well made.\r\n\r\n★★★½", "created_at": "2017-03-09T15:14:11.718Z"}, {"movie_id": 273481, "review_id": "5b99d9210e0a266282000f6f", "author_rating": 7.0, "review_text": "Not since the opening farmhouse scene from _Inglourious Barsteds_ have I seen such masterful control of palpable tension.\r\n\r\n_Final rating: ★★★½ - I strongly recommend you make the time._", "created_at": "2018-09-13T03:27:29.995Z"}, {"movie_id": 273481, "review_id": "607baea37e34830029449e11", "author_rating": 9.0, "review_text": "Still a fantastic crime suspense-thriller featuring great performances but one better than Benicio Del Toro who should have gotten an Oscar nomination for that role, not to mention the direction from Denis Villeneuve. As always Roger Deakins's cinematography was brilliant. **4.75/5**", "created_at": "2021-04-18T03:59:31.403Z"}, {"movie_id": 273481, "review_id": "6447e299e18b9705065b2932", "author_rating": 7.0, "review_text": "**A good kind of mystery**\r\n\r\nA security operation through which a large number of corpses are explored reveals that there is a cartel war rising on the horizon, but in a hidden way, and ends with the formation of a team to eliminate the cartel in Mexico and target the big heads.\r\n\r\nThe film focuses on the points of view of 3 people in the direction of the case, the first is Kate, a beginner who follows the laws strictly and considers that the mission is a moral responsibility, the second is Alejandro as Benicio Del Toro, who is experienced with mysterious intentions, and the third is Silvio (asiliano Maxim Hernandez), the Mexican policeman on his mission own.\r\n\r\nAll of these personalities have their own side, who pulls the other into his world, and who is the correct point of view among them. The film focuses on questions and personalities, not events, in order to reach the Mexican cartel. Each character has a special direction to reach the goal, and this makes their opposing ideas cause a sharp collision between order and chaos, and between formulas that allow bad action and the fine line between good and evil.\r\n\r\nThe film's opposing characters gave the film a mystery and made us wonder what exactly is happening and why it is implemented in this way. Then we quickly get to know the characters, but they are opposite through their actions and reactions. With these details, the director and writer were able to communicate their point of view to the viewer, and it was three things: how and when does information reach the viewer How do they hide this information, how do they benefit from this concealment, and finally how is tension built.\r\n\r\nAre Kate right or Matt and Alejandro right? Those who made Kate a marginalized role, so why did they choose her from the beginning until she abused her reactions, as if they were deliberately provoking her? We see the words of Matt and Alejandro and their side conversations, as well as their planning and movements with the mission and Kate, and we do not know what is happening, but when the information reached us, it reached us without value, as if they were taking advantage of Kate's ignorance and her presence for goals, but she is in the first place These targets are unknown.\r\n\r\nThese vague goals are considered a problem in the subtraction, because when the viewer is not aware of what is happening, the matter becomes blurry and the events are considered vague, but Kate, since she is the character, has the same problem as the viewer, so she became a source of strength and is the basis of the course of the movie. It was wonderful when you see a mystery of this kind.", "created_at": "2023-04-25T14:24:25.769Z"}]