[{"movie_id": 11345, "review_id": "5424b0f30e0a263b7e0046c0", "author_rating": 6.0, "review_text": "The most infamous serial killer of our time... is still out there.\r\n\r\nThe Zodiac is directed by Alexander Bulkley who also co-writes the screenplay with his brother Kelley Bulkley. It stars Justin Chambers, Robin Tunney, Rory Culkin, Philip Baker Hall, Brad Henke, Marty Lindsey, Rex Linn and William Mapother. Music is by Michael Suby and cinematography by Denis Maloney. Story is based on the true events involving a serial killer known as The Zodiac who terrorised the San Francisco Bay Area in the late 1960s. He was never captured.\r\n\r\nThere's a lot of scorn poured on Bulkley's movie, which on the surface is understandable given that it's neither an in-depth examination of the actual case or a terrifying serial killer thriller. It's cause isn't helped, either, by David Fincher's meticulous version that followed in 2007. Yet there's value in The Zodiac, even if it's difficult to recommend with confidence.\r\n\r\nThe Bulkley's choose to focus primarily on one policeman and his family and how they are deeply affected by The Zodiac case. This involves Detective Matt Parish (Chambers) coming under increasing pressure at work, where his superiors are demanding a result, and at home, where his wife Laura (Tunney) grows frantic/frustrated by the day and his young son Johnny (Culkin) becomes unhealthily fascinated by the case.\r\n\r\nThe director paints a very good period backdrop whilst deftly filling the narrative with a sense of paranoia that surely enveloped the Bay Area as The Zodiac enacted his crimes. The killer's face is rightly never seen, though we get POV shots from the killer and glimpses from afar or from behind him. While interestingly there's a link between The Zodiac and young Johnny as each go about their respective ways.\r\n\r\nThe colour schemes used at various points of the story are well thought out, providing the film with a documentary feel for the exteriors and a saturated neo-noir universe for interiors. There's a spareness to the production that really aids the subject matter. Cast performances are fine, with Tunney really getting to grips with her character, and Suby's score rumbles along ominously.\r\n\r\nNot to be sought out by blood hounds or Zodiac historians, this is still a better than average picture that holds some interest as it rises above its modest budget limitations. 6/10", "created_at": "2014-09-26T00:18:59.148Z"}]