[{"movie_id": 260346, "review_id": "55de1205c3a36827d3000333", "author_rating": 7.0, "review_text": "> Independently a fine movie rather being associated with TAKEN.\r\n\r\nActually, it was not a bad movie, I really enjoyed it. But associated with 'Taken' and being the third film in the series was the setback. Because unlike the first two films, this one was somewhat detached from the original theme. Except the cast from the previous two, the story takes place in a completely different platform. From all the three films, the phone call between father and daughter was retained, but was not effective as the first one which became just a trademark of the series, that's all.\r\n\r\nThe first half creates the puzzle and next half solves it. As expected, it was a typical structure in this trilogy, but the last quarter was turned into something like 'Mission Impossible'. In 'Taken' films, Bryan Mills (our lead guy) works alone, but he formed a team with a tech guy and others. That does not sound good, at least tried to be different from the original movie.\r\n\r\nIt is a little disappointment for 'Taken' fans, but you will have a best shot if you see it as an independent one off movie. Yes could have made a better action flick if it was not linked to it. Hope it all ends here like they have said. As a trilogy, it failed, or maybe we can call it a 50-50. But the first one was a masterpiece, a trendsetting piece.\r\n\r\n6.5/10", "created_at": "2015-08-26T19:22:45.858Z"}, {"movie_id": 260346, "review_id": "5622f26ec3a3680e1900c550", "author_rating": null, "review_text": "The rugged and feisty Liam Neeson (as on-screen alter ego ex-CIA operative Bryan Mills) is back in fighting form for a third and supposedly final go-around in ‘Taken 3′. This tired and tepid action-packed crime thriller is directed by French filmmaker Olivier Megaton (‘Taken 2’, ‘Transporter 3’) with screenwriting credits attributed to ‘Taken’ producer Luc Besson and Robert Mark Kamen. Clearly Neeson and company want to squeeze the remaining strained juices out of the ‘Taken’ film franchise as this movie series trilogy ends on an exhausting whimper. Uninspired, toothless and motoring on empty impishness, ‘Taken 3′ has run its kinetic course for the aging Neeson to aim, shoot and take down some serious repetitive butt-kicking numbers.\r\n\r\nAfter the last two energizing installments where flashy foreign locales were a major part of the appealing ‘Taken’ universe, ‘Taken 3′ is reduced to unraveling in the uneventful backyard of familiar Los Angeles that definitely lacks the exotic excitement and visual vitality that were previously showcased in posh landscapes such as Paris and Istanbul. In fact, star Neeson reportedly nixed the idea to partake in the ‘Taken 3′ production if there was another concept of kidnapping involved. Huh? Why avoid the element of kidnapping when in fact it was the soundly running gimmick that made the ‘Taken’ experience palpable and pulsating? Still, this is the least of ‘Taken 3’s bothersome problems as the movie delves in the manufactured mockery involving cliched car chases, sketchy gunplay and the inclusion of countless Russian mobsters parading about in obligatory fashion. Importantly, even Neeson seems quite disengaged as his robotic Bryan Mills goes through the motions trying to find some upside in the forced upbeat shenanigans that seem to trudge along scene after scene.\r\n\r\nThe very first outing in ‘Taken’ took audiences by surprised as it featured a matured Neeson as an avenging former CIA human weapon Mills committed to his fatherly duties in manhandling the Albanian human traffickers that dared to abscond his teen daughter Kim (Maggie Grace). In ‘Taken 2′, the hostile adversaries want Mills’s head on a platter after he tore up their territory in his crusade to rescue his precious offspring from the opportunistic ruffians. Now Mills finds his neck on the line in the connection with his ex-wife Lenore’s (Famke Janssen) brutal murder. Look out LA…the harried Bryan Mills is out in survival mode. The question remains: whose blood will be spilled in the process?\r\n\r\nPrior to Lenore’s senseless demise, she had visited her ex-hubby Bryan and the feelings between the former spouses are still strong. Mills still carries an emotional torch for Lenore but he cannot act upon his affections for her. Poor Lenore is trapped in her current unhappy marriage with an insufferable moneybags misfit Stuart St. John (Dougray Scott). In the aftermath of Lenore’s death, the distraught and beleaguered Mills finds out the trouble that he is embroiled in so convincingly. As a result of his former lover’s slaughtering Bryan Mills is reeling with outrage. Yes, folks, it appears that Mills is on the run and must prove his innocence and bring to the forefront the murderers that butchered Lenore. Mills has on his mind the need to protect his exposed college-aged daughter Kim from potential harm as well.\r\n\r\nIn the meanwhile, the LAPD lead investigator in Franck Doltzer (Oscar winner Forest Whitaker, ‘The King Of Scotland’) must track down the defiant Mills and make some sense out of the Lenore Mills St. John slaying.  Mills proves to be elusive and crafty as usual while leaving behind his trademark trashing of battered bodies and bouncing bullets in the chaotic southern California streets.\r\n\r\nSeemingly, the catchy novelty act of a hulking middle-aged Neeson exploding at the seams in action-oriented fashion resonated with glorious forethought. After all, ‘Taken’ single-handily resurrected Neeson’s box office cred and made him a cinematic hipster to the young folks and his aged contemporaries alike.  However, the third time is not the charm in revisiting the gun-toting ‘grandpa’. Sadly, ‘Taken 3′ is mindlessly played out as Neeson’s Mills or the handlers behind this hollow hedonistic actioner have dipped their toes in an empty well of ideas to conclude this three-part crime caper.\r\n\r\nLet’s face facts…we all were ‘Taken’ in by this pseudo punchy action yarn that no longer generates the destructive heat it once punctuated with carefree confidence.\r\n\r\nTaken 3 (2015)\r\n\r\n29th Century Fox\r\n\r\n1 hr.  49 mins.\r\n\r\nStarring: Liam Neeson, Forest Whitaker, Famke Jannssen, Maggie Grace and Dougray Scott\r\n\r\nDirected by: Olivier Megaton\r\n\r\nRated: PG-13\r\n\r\nGenre: Action and Adventure/Crime thriller/Mystery and Suspense\r\n\r\nCritic’s rating: ** stars (out of four stars)", "created_at": "2015-10-18T01:14:22.762Z"}, {"movie_id": 260346, "review_id": "5b02add492514109a7016b0a", "author_rating": 6.0, "review_text": "I was looking forward to this movie and I have to say that I was a wee bit disappointed. It is a decent enough action movie but the script leaves somewhat to be desired. A good chunk of the movie is quite good, actually it is very good, but there are some crucial scenes that, in my opinion, really drags it down to a rather mediocre level.\r\n\r\nThe plot is a fairly classical, not a very intelligent nor a very original, one. When trying to push the third sequel in a series Hollywood have a tendency to fall back on certain “trusted” elements. Like, make the hero haunted by the law and / or the government (no I do not consider the government to be the same as the law) or kill off some of the main (or at least likable) characters.\r\n\r\nIn this movie they are doing both. I do not know why this always seems to be the standard solution because I certainly do not like it. Are the general movie going audience really falling for these, in my mind, cheap scripts? I guess they must be since this formula is repeated over and over again. Well, it is not for me to judge other peoples tastes and if I would have been a bean counter for the movie industry then it would really have been my duty to squeeze out as much money as possible regardless of whether I thought it would make a good movie or not, However, I am not. I am a consumer of movies and my personal opinion is that these plot elements are pretty cheap and not really to my liking. But then, that is just me.\r\n\r\nAnyway, the movie is not really bad. It is a decent enough action movie and, in general, I quite like the performance of Liam Neeson. He is the half-sad, silent and, most of all, ass-kicking hero that I like. He is pretty much what holds this movie together. Well, that was perhaps not entirely fair. Forrest Whitaker is doing a quite good job as well. Most of the other characters are mostly fillers. The main bad guy started off fairly good but he really never got the chance to shine and the ending scenes with the big confrontation was…well I would say pretty pathetic.\r\n\r\nThis brings us to my man gripe with this movie. Up until this point Liam Neeson was really playing the big bad, and really skilled, killing machine. The way he, with the help of his friends, entered the bad guy’s stronghold was perhaps not very innovative (seen that, been there, and done that) but at least it was professional. After that however it turned into a bloody joke. Not only does our hero walk into a heavily defended stronghold carrying only a small pea shooter but every time he manages to liberate a decent weapon from the hopelessly incompetent bad guys he throws it away and, occasionally, picks up another pea shooter. What the f…?\r\n\r\nThen we have the fairly ridiculous big fight at the end where the bad guy runs around in his underwear. That was just embarrassing. Maybe I could have swallowed the underwear thing if it was not for the fact that Lieam Neeson suddenly lost all kind of professionalism. Apart from the pea shooter syndrome mentioned before he just gets himself wacked by this maniac until, in the last minute, he miraculously recovers and gets the upper hand. There were a few minor glimpses of intelligence in the whole scene but they were never really exploited.\r\n\r\nOn the whole, if would say this was a fairly decent and enjoyable action movie but I was expecting more from it. If the last third of the movie would have matched the first two thirds then my rating would have been higher. Maybe Liam Neeson is not a big enough star, although I like him a lot, to pick his roles like he wants to but I would say that he should indeed be a bit more picky and read the scripts before signing on.", "created_at": "2018-05-21T11:30:28.860Z"}, {"movie_id": 260346, "review_id": "5c8cda7a0e0a2612fa52fd28", "author_rating": 3.0, "review_text": "I can handle the 47 cuts and shakey cam poorly trying to hide the fact that Liam Neeson can't run. I can handle the inevitability of \"More money means more explosions!\" in franchises like these. I can even contort myself to handle the right-out-the-gate fridging of one of my favourite actresses that _Taken 3_ copped so much flak for. But what I cannot handle is how absolutely fucking dumb this movie gets in the second half. Every five minutes my roommate or I had to scream \"WHAT!?\" at the things that were happening on screen, and disparage the various idiotic and/or nonsense decisions that were being made.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-03-16T11:14:02.346Z"}, {"movie_id": 260346, "review_id": "55de1205c3a36827d3000333", "author_rating": 7.0, "review_text": "> Independently a fine movie rather being associated with TAKEN.\r\n\r\nActually, it was not a bad movie, I really enjoyed it. But associated with 'Taken' and being the third film in the series was the setback. Because unlike the first two films, this one was somewhat detached from the original theme. Except the cast from the previous two, the story takes place in a completely different platform. From all the three films, the phone call between father and daughter was retained, but was not effective as the first one which became just a trademark of the series, that's all.\r\n\r\nThe first half creates the puzzle and next half solves it. As expected, it was a typical structure in this trilogy, but the last quarter was turned into something like 'Mission Impossible'. In 'Taken' films, Bryan Mills (our lead guy) works alone, but he formed a team with a tech guy and others. That does not sound good, at least tried to be different from the original movie.\r\n\r\nIt is a little disappointment for 'Taken' fans, but you will have a best shot if you see it as an independent one off movie. Yes could have made a better action flick if it was not linked to it. Hope it all ends here like they have said. As a trilogy, it failed, or maybe we can call it a 50-50. But the first one was a masterpiece, a trendsetting piece.\r\n\r\n6.5/10", "created_at": "2015-08-26T19:22:45.858Z"}, {"movie_id": 260346, "review_id": "5622f26ec3a3680e1900c550", "author_rating": null, "review_text": "The rugged and feisty Liam Neeson (as on-screen alter ego ex-CIA operative Bryan Mills) is back in fighting form for a third and supposedly final go-around in ‘Taken 3′. This tired and tepid action-packed crime thriller is directed by French filmmaker Olivier Megaton (‘Taken 2’, ‘Transporter 3’) with screenwriting credits attributed to ‘Taken’ producer Luc Besson and Robert Mark Kamen. Clearly Neeson and company want to squeeze the remaining strained juices out of the ‘Taken’ film franchise as this movie series trilogy ends on an exhausting whimper. Uninspired, toothless and motoring on empty impishness, ‘Taken 3′ has run its kinetic course for the aging Neeson to aim, shoot and take down some serious repetitive butt-kicking numbers.\r\n\r\nAfter the last two energizing installments where flashy foreign locales were a major part of the appealing ‘Taken’ universe, ‘Taken 3′ is reduced to unraveling in the uneventful backyard of familiar Los Angeles that definitely lacks the exotic excitement and visual vitality that were previously showcased in posh landscapes such as Paris and Istanbul. In fact, star Neeson reportedly nixed the idea to partake in the ‘Taken 3′ production if there was another concept of kidnapping involved. Huh? Why avoid the element of kidnapping when in fact it was the soundly running gimmick that made the ‘Taken’ experience palpable and pulsating? Still, this is the least of ‘Taken 3’s bothersome problems as the movie delves in the manufactured mockery involving cliched car chases, sketchy gunplay and the inclusion of countless Russian mobsters parading about in obligatory fashion. Importantly, even Neeson seems quite disengaged as his robotic Bryan Mills goes through the motions trying to find some upside in the forced upbeat shenanigans that seem to trudge along scene after scene.\r\n\r\nThe very first outing in ‘Taken’ took audiences by surprised as it featured a matured Neeson as an avenging former CIA human weapon Mills committed to his fatherly duties in manhandling the Albanian human traffickers that dared to abscond his teen daughter Kim (Maggie Grace). In ‘Taken 2′, the hostile adversaries want Mills’s head on a platter after he tore up their territory in his crusade to rescue his precious offspring from the opportunistic ruffians. Now Mills finds his neck on the line in the connection with his ex-wife Lenore’s (Famke Janssen) brutal murder. Look out LA…the harried Bryan Mills is out in survival mode. The question remains: whose blood will be spilled in the process?\r\n\r\nPrior to Lenore’s senseless demise, she had visited her ex-hubby Bryan and the feelings between the former spouses are still strong. Mills still carries an emotional torch for Lenore but he cannot act upon his affections for her. Poor Lenore is trapped in her current unhappy marriage with an insufferable moneybags misfit Stuart St. John (Dougray Scott). In the aftermath of Lenore’s death, the distraught and beleaguered Mills finds out the trouble that he is embroiled in so convincingly. As a result of his former lover’s slaughtering Bryan Mills is reeling with outrage. Yes, folks, it appears that Mills is on the run and must prove his innocence and bring to the forefront the murderers that butchered Lenore. Mills has on his mind the need to protect his exposed college-aged daughter Kim from potential harm as well.\r\n\r\nIn the meanwhile, the LAPD lead investigator in Franck Doltzer (Oscar winner Forest Whitaker, ‘The King Of Scotland’) must track down the defiant Mills and make some sense out of the Lenore Mills St. John slaying.  Mills proves to be elusive and crafty as usual while leaving behind his trademark trashing of battered bodies and bouncing bullets in the chaotic southern California streets.\r\n\r\nSeemingly, the catchy novelty act of a hulking middle-aged Neeson exploding at the seams in action-oriented fashion resonated with glorious forethought. After all, ‘Taken’ single-handily resurrected Neeson’s box office cred and made him a cinematic hipster to the young folks and his aged contemporaries alike.  However, the third time is not the charm in revisiting the gun-toting ‘grandpa’. Sadly, ‘Taken 3′ is mindlessly played out as Neeson’s Mills or the handlers behind this hollow hedonistic actioner have dipped their toes in an empty well of ideas to conclude this three-part crime caper.\r\n\r\nLet’s face facts…we all were ‘Taken’ in by this pseudo punchy action yarn that no longer generates the destructive heat it once punctuated with carefree confidence.\r\n\r\nTaken 3 (2015)\r\n\r\n29th Century Fox\r\n\r\n1 hr.  49 mins.\r\n\r\nStarring: Liam Neeson, Forest Whitaker, Famke Jannssen, Maggie Grace and Dougray Scott\r\n\r\nDirected by: Olivier Megaton\r\n\r\nRated: PG-13\r\n\r\nGenre: Action and Adventure/Crime thriller/Mystery and Suspense\r\n\r\nCritic’s rating: ** stars (out of four stars)", "created_at": "2015-10-18T01:14:22.762Z"}, {"movie_id": 260346, "review_id": "5b02add492514109a7016b0a", "author_rating": 6.0, "review_text": "I was looking forward to this movie and I have to say that I was a wee bit disappointed. It is a decent enough action movie but the script leaves somewhat to be desired. A good chunk of the movie is quite good, actually it is very good, but there are some crucial scenes that, in my opinion, really drags it down to a rather mediocre level.\r\n\r\nThe plot is a fairly classical, not a very intelligent nor a very original, one. When trying to push the third sequel in a series Hollywood have a tendency to fall back on certain “trusted” elements. Like, make the hero haunted by the law and / or the government (no I do not consider the government to be the same as the law) or kill off some of the main (or at least likable) characters.\r\n\r\nIn this movie they are doing both. I do not know why this always seems to be the standard solution because I certainly do not like it. Are the general movie going audience really falling for these, in my mind, cheap scripts? I guess they must be since this formula is repeated over and over again. Well, it is not for me to judge other peoples tastes and if I would have been a bean counter for the movie industry then it would really have been my duty to squeeze out as much money as possible regardless of whether I thought it would make a good movie or not, However, I am not. I am a consumer of movies and my personal opinion is that these plot elements are pretty cheap and not really to my liking. But then, that is just me.\r\n\r\nAnyway, the movie is not really bad. It is a decent enough action movie and, in general, I quite like the performance of Liam Neeson. He is the half-sad, silent and, most of all, ass-kicking hero that I like. He is pretty much what holds this movie together. Well, that was perhaps not entirely fair. Forrest Whitaker is doing a quite good job as well. Most of the other characters are mostly fillers. The main bad guy started off fairly good but he really never got the chance to shine and the ending scenes with the big confrontation was…well I would say pretty pathetic.\r\n\r\nThis brings us to my man gripe with this movie. Up until this point Liam Neeson was really playing the big bad, and really skilled, killing machine. The way he, with the help of his friends, entered the bad guy’s stronghold was perhaps not very innovative (seen that, been there, and done that) but at least it was professional. After that however it turned into a bloody joke. Not only does our hero walk into a heavily defended stronghold carrying only a small pea shooter but every time he manages to liberate a decent weapon from the hopelessly incompetent bad guys he throws it away and, occasionally, picks up another pea shooter. What the f…?\r\n\r\nThen we have the fairly ridiculous big fight at the end where the bad guy runs around in his underwear. That was just embarrassing. Maybe I could have swallowed the underwear thing if it was not for the fact that Lieam Neeson suddenly lost all kind of professionalism. Apart from the pea shooter syndrome mentioned before he just gets himself wacked by this maniac until, in the last minute, he miraculously recovers and gets the upper hand. There were a few minor glimpses of intelligence in the whole scene but they were never really exploited.\r\n\r\nOn the whole, if would say this was a fairly decent and enjoyable action movie but I was expecting more from it. If the last third of the movie would have matched the first two thirds then my rating would have been higher. Maybe Liam Neeson is not a big enough star, although I like him a lot, to pick his roles like he wants to but I would say that he should indeed be a bit more picky and read the scripts before signing on.", "created_at": "2018-05-21T11:30:28.860Z"}, {"movie_id": 260346, "review_id": "5c8cda7a0e0a2612fa52fd28", "author_rating": 3.0, "review_text": "I can handle the 47 cuts and shakey cam poorly trying to hide the fact that Liam Neeson can't run. I can handle the inevitability of \"More money means more explosions!\" in franchises like these. I can even contort myself to handle the right-out-the-gate fridging of one of my favourite actresses that _Taken 3_ copped so much flak for. But what I cannot handle is how absolutely fucking dumb this movie gets in the second half. Every five minutes my roommate or I had to scream \"WHAT!?\" at the things that were happening on screen, and disparage the various idiotic and/or nonsense decisions that were being made.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-03-16T11:14:02.346Z"}, {"movie_id": 260346, "review_id": "55de1205c3a36827d3000333", "author_rating": 7.0, "review_text": "> Independently a fine movie rather being associated with TAKEN.\r\n\r\nActually, it was not a bad movie, I really enjoyed it. But associated with 'Taken' and being the third film in the series was the setback. Because unlike the first two films, this one was somewhat detached from the original theme. Except the cast from the previous two, the story takes place in a completely different platform. From all the three films, the phone call between father and daughter was retained, but was not effective as the first one which became just a trademark of the series, that's all.\r\n\r\nThe first half creates the puzzle and next half solves it. As expected, it was a typical structure in this trilogy, but the last quarter was turned into something like 'Mission Impossible'. In 'Taken' films, Bryan Mills (our lead guy) works alone, but he formed a team with a tech guy and others. That does not sound good, at least tried to be different from the original movie.\r\n\r\nIt is a little disappointment for 'Taken' fans, but you will have a best shot if you see it as an independent one off movie. Yes could have made a better action flick if it was not linked to it. Hope it all ends here like they have said. As a trilogy, it failed, or maybe we can call it a 50-50. But the first one was a masterpiece, a trendsetting piece.\r\n\r\n6.5/10", "created_at": "2015-08-26T19:22:45.858Z"}, {"movie_id": 260346, "review_id": "5622f26ec3a3680e1900c550", "author_rating": null, "review_text": "The rugged and feisty Liam Neeson (as on-screen alter ego ex-CIA operative Bryan Mills) is back in fighting form for a third and supposedly final go-around in ‘Taken 3′. This tired and tepid action-packed crime thriller is directed by French filmmaker Olivier Megaton (‘Taken 2’, ‘Transporter 3’) with screenwriting credits attributed to ‘Taken’ producer Luc Besson and Robert Mark Kamen. Clearly Neeson and company want to squeeze the remaining strained juices out of the ‘Taken’ film franchise as this movie series trilogy ends on an exhausting whimper. Uninspired, toothless and motoring on empty impishness, ‘Taken 3′ has run its kinetic course for the aging Neeson to aim, shoot and take down some serious repetitive butt-kicking numbers.\r\n\r\nAfter the last two energizing installments where flashy foreign locales were a major part of the appealing ‘Taken’ universe, ‘Taken 3′ is reduced to unraveling in the uneventful backyard of familiar Los Angeles that definitely lacks the exotic excitement and visual vitality that were previously showcased in posh landscapes such as Paris and Istanbul. In fact, star Neeson reportedly nixed the idea to partake in the ‘Taken 3′ production if there was another concept of kidnapping involved. Huh? Why avoid the element of kidnapping when in fact it was the soundly running gimmick that made the ‘Taken’ experience palpable and pulsating? Still, this is the least of ‘Taken 3’s bothersome problems as the movie delves in the manufactured mockery involving cliched car chases, sketchy gunplay and the inclusion of countless Russian mobsters parading about in obligatory fashion. Importantly, even Neeson seems quite disengaged as his robotic Bryan Mills goes through the motions trying to find some upside in the forced upbeat shenanigans that seem to trudge along scene after scene.\r\n\r\nThe very first outing in ‘Taken’ took audiences by surprised as it featured a matured Neeson as an avenging former CIA human weapon Mills committed to his fatherly duties in manhandling the Albanian human traffickers that dared to abscond his teen daughter Kim (Maggie Grace). In ‘Taken 2′, the hostile adversaries want Mills’s head on a platter after he tore up their territory in his crusade to rescue his precious offspring from the opportunistic ruffians. Now Mills finds his neck on the line in the connection with his ex-wife Lenore’s (Famke Janssen) brutal murder. Look out LA…the harried Bryan Mills is out in survival mode. The question remains: whose blood will be spilled in the process?\r\n\r\nPrior to Lenore’s senseless demise, she had visited her ex-hubby Bryan and the feelings between the former spouses are still strong. Mills still carries an emotional torch for Lenore but he cannot act upon his affections for her. Poor Lenore is trapped in her current unhappy marriage with an insufferable moneybags misfit Stuart St. John (Dougray Scott). In the aftermath of Lenore’s death, the distraught and beleaguered Mills finds out the trouble that he is embroiled in so convincingly. As a result of his former lover’s slaughtering Bryan Mills is reeling with outrage. Yes, folks, it appears that Mills is on the run and must prove his innocence and bring to the forefront the murderers that butchered Lenore. Mills has on his mind the need to protect his exposed college-aged daughter Kim from potential harm as well.\r\n\r\nIn the meanwhile, the LAPD lead investigator in Franck Doltzer (Oscar winner Forest Whitaker, ‘The King Of Scotland’) must track down the defiant Mills and make some sense out of the Lenore Mills St. John slaying.  Mills proves to be elusive and crafty as usual while leaving behind his trademark trashing of battered bodies and bouncing bullets in the chaotic southern California streets.\r\n\r\nSeemingly, the catchy novelty act of a hulking middle-aged Neeson exploding at the seams in action-oriented fashion resonated with glorious forethought. After all, ‘Taken’ single-handily resurrected Neeson’s box office cred and made him a cinematic hipster to the young folks and his aged contemporaries alike.  However, the third time is not the charm in revisiting the gun-toting ‘grandpa’. Sadly, ‘Taken 3′ is mindlessly played out as Neeson’s Mills or the handlers behind this hollow hedonistic actioner have dipped their toes in an empty well of ideas to conclude this three-part crime caper.\r\n\r\nLet’s face facts…we all were ‘Taken’ in by this pseudo punchy action yarn that no longer generates the destructive heat it once punctuated with carefree confidence.\r\n\r\nTaken 3 (2015)\r\n\r\n29th Century Fox\r\n\r\n1 hr.  49 mins.\r\n\r\nStarring: Liam Neeson, Forest Whitaker, Famke Jannssen, Maggie Grace and Dougray Scott\r\n\r\nDirected by: Olivier Megaton\r\n\r\nRated: PG-13\r\n\r\nGenre: Action and Adventure/Crime thriller/Mystery and Suspense\r\n\r\nCritic’s rating: ** stars (out of four stars)", "created_at": "2015-10-18T01:14:22.762Z"}, {"movie_id": 260346, "review_id": "5b02add492514109a7016b0a", "author_rating": 6.0, "review_text": "I was looking forward to this movie and I have to say that I was a wee bit disappointed. It is a decent enough action movie but the script leaves somewhat to be desired. A good chunk of the movie is quite good, actually it is very good, but there are some crucial scenes that, in my opinion, really drags it down to a rather mediocre level.\r\n\r\nThe plot is a fairly classical, not a very intelligent nor a very original, one. When trying to push the third sequel in a series Hollywood have a tendency to fall back on certain “trusted” elements. Like, make the hero haunted by the law and / or the government (no I do not consider the government to be the same as the law) or kill off some of the main (or at least likable) characters.\r\n\r\nIn this movie they are doing both. I do not know why this always seems to be the standard solution because I certainly do not like it. Are the general movie going audience really falling for these, in my mind, cheap scripts? I guess they must be since this formula is repeated over and over again. Well, it is not for me to judge other peoples tastes and if I would have been a bean counter for the movie industry then it would really have been my duty to squeeze out as much money as possible regardless of whether I thought it would make a good movie or not, However, I am not. I am a consumer of movies and my personal opinion is that these plot elements are pretty cheap and not really to my liking. But then, that is just me.\r\n\r\nAnyway, the movie is not really bad. It is a decent enough action movie and, in general, I quite like the performance of Liam Neeson. He is the half-sad, silent and, most of all, ass-kicking hero that I like. He is pretty much what holds this movie together. Well, that was perhaps not entirely fair. Forrest Whitaker is doing a quite good job as well. Most of the other characters are mostly fillers. The main bad guy started off fairly good but he really never got the chance to shine and the ending scenes with the big confrontation was…well I would say pretty pathetic.\r\n\r\nThis brings us to my man gripe with this movie. Up until this point Liam Neeson was really playing the big bad, and really skilled, killing machine. The way he, with the help of his friends, entered the bad guy’s stronghold was perhaps not very innovative (seen that, been there, and done that) but at least it was professional. After that however it turned into a bloody joke. Not only does our hero walk into a heavily defended stronghold carrying only a small pea shooter but every time he manages to liberate a decent weapon from the hopelessly incompetent bad guys he throws it away and, occasionally, picks up another pea shooter. What the f…?\r\n\r\nThen we have the fairly ridiculous big fight at the end where the bad guy runs around in his underwear. That was just embarrassing. Maybe I could have swallowed the underwear thing if it was not for the fact that Lieam Neeson suddenly lost all kind of professionalism. Apart from the pea shooter syndrome mentioned before he just gets himself wacked by this maniac until, in the last minute, he miraculously recovers and gets the upper hand. There were a few minor glimpses of intelligence in the whole scene but they were never really exploited.\r\n\r\nOn the whole, if would say this was a fairly decent and enjoyable action movie but I was expecting more from it. If the last third of the movie would have matched the first two thirds then my rating would have been higher. Maybe Liam Neeson is not a big enough star, although I like him a lot, to pick his roles like he wants to but I would say that he should indeed be a bit more picky and read the scripts before signing on.", "created_at": "2018-05-21T11:30:28.860Z"}, {"movie_id": 260346, "review_id": "5c8cda7a0e0a2612fa52fd28", "author_rating": 3.0, "review_text": "I can handle the 47 cuts and shakey cam poorly trying to hide the fact that Liam Neeson can't run. I can handle the inevitability of \"More money means more explosions!\" in franchises like these. I can even contort myself to handle the right-out-the-gate fridging of one of my favourite actresses that _Taken 3_ copped so much flak for. But what I cannot handle is how absolutely fucking dumb this movie gets in the second half. Every five minutes my roommate or I had to scream \"WHAT!?\" at the things that were happening on screen, and disparage the various idiotic and/or nonsense decisions that were being made.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-03-16T11:14:02.346Z"}, {"movie_id": 260346, "review_id": "55de1205c3a36827d3000333", "author_rating": 7.0, "review_text": "> Independently a fine movie rather being associated with TAKEN.\r\n\r\nActually, it was not a bad movie, I really enjoyed it. But associated with 'Taken' and being the third film in the series was the setback. Because unlike the first two films, this one was somewhat detached from the original theme. Except the cast from the previous two, the story takes place in a completely different platform. From all the three films, the phone call between father and daughter was retained, but was not effective as the first one which became just a trademark of the series, that's all.\r\n\r\nThe first half creates the puzzle and next half solves it. As expected, it was a typical structure in this trilogy, but the last quarter was turned into something like 'Mission Impossible'. In 'Taken' films, Bryan Mills (our lead guy) works alone, but he formed a team with a tech guy and others. That does not sound good, at least tried to be different from the original movie.\r\n\r\nIt is a little disappointment for 'Taken' fans, but you will have a best shot if you see it as an independent one off movie. Yes could have made a better action flick if it was not linked to it. Hope it all ends here like they have said. As a trilogy, it failed, or maybe we can call it a 50-50. But the first one was a masterpiece, a trendsetting piece.\r\n\r\n6.5/10", "created_at": "2015-08-26T19:22:45.858Z"}, {"movie_id": 260346, "review_id": "5622f26ec3a3680e1900c550", "author_rating": null, "review_text": "The rugged and feisty Liam Neeson (as on-screen alter ego ex-CIA operative Bryan Mills) is back in fighting form for a third and supposedly final go-around in ‘Taken 3′. This tired and tepid action-packed crime thriller is directed by French filmmaker Olivier Megaton (‘Taken 2’, ‘Transporter 3’) with screenwriting credits attributed to ‘Taken’ producer Luc Besson and Robert Mark Kamen. Clearly Neeson and company want to squeeze the remaining strained juices out of the ‘Taken’ film franchise as this movie series trilogy ends on an exhausting whimper. Uninspired, toothless and motoring on empty impishness, ‘Taken 3′ has run its kinetic course for the aging Neeson to aim, shoot and take down some serious repetitive butt-kicking numbers.\r\n\r\nAfter the last two energizing installments where flashy foreign locales were a major part of the appealing ‘Taken’ universe, ‘Taken 3′ is reduced to unraveling in the uneventful backyard of familiar Los Angeles that definitely lacks the exotic excitement and visual vitality that were previously showcased in posh landscapes such as Paris and Istanbul. In fact, star Neeson reportedly nixed the idea to partake in the ‘Taken 3′ production if there was another concept of kidnapping involved. Huh? Why avoid the element of kidnapping when in fact it was the soundly running gimmick that made the ‘Taken’ experience palpable and pulsating? Still, this is the least of ‘Taken 3’s bothersome problems as the movie delves in the manufactured mockery involving cliched car chases, sketchy gunplay and the inclusion of countless Russian mobsters parading about in obligatory fashion. Importantly, even Neeson seems quite disengaged as his robotic Bryan Mills goes through the motions trying to find some upside in the forced upbeat shenanigans that seem to trudge along scene after scene.\r\n\r\nThe very first outing in ‘Taken’ took audiences by surprised as it featured a matured Neeson as an avenging former CIA human weapon Mills committed to his fatherly duties in manhandling the Albanian human traffickers that dared to abscond his teen daughter Kim (Maggie Grace). In ‘Taken 2′, the hostile adversaries want Mills’s head on a platter after he tore up their territory in his crusade to rescue his precious offspring from the opportunistic ruffians. Now Mills finds his neck on the line in the connection with his ex-wife Lenore’s (Famke Janssen) brutal murder. Look out LA…the harried Bryan Mills is out in survival mode. The question remains: whose blood will be spilled in the process?\r\n\r\nPrior to Lenore’s senseless demise, she had visited her ex-hubby Bryan and the feelings between the former spouses are still strong. Mills still carries an emotional torch for Lenore but he cannot act upon his affections for her. Poor Lenore is trapped in her current unhappy marriage with an insufferable moneybags misfit Stuart St. John (Dougray Scott). In the aftermath of Lenore’s death, the distraught and beleaguered Mills finds out the trouble that he is embroiled in so convincingly. As a result of his former lover’s slaughtering Bryan Mills is reeling with outrage. Yes, folks, it appears that Mills is on the run and must prove his innocence and bring to the forefront the murderers that butchered Lenore. Mills has on his mind the need to protect his exposed college-aged daughter Kim from potential harm as well.\r\n\r\nIn the meanwhile, the LAPD lead investigator in Franck Doltzer (Oscar winner Forest Whitaker, ‘The King Of Scotland’) must track down the defiant Mills and make some sense out of the Lenore Mills St. John slaying.  Mills proves to be elusive and crafty as usual while leaving behind his trademark trashing of battered bodies and bouncing bullets in the chaotic southern California streets.\r\n\r\nSeemingly, the catchy novelty act of a hulking middle-aged Neeson exploding at the seams in action-oriented fashion resonated with glorious forethought. After all, ‘Taken’ single-handily resurrected Neeson’s box office cred and made him a cinematic hipster to the young folks and his aged contemporaries alike.  However, the third time is not the charm in revisiting the gun-toting ‘grandpa’. Sadly, ‘Taken 3′ is mindlessly played out as Neeson’s Mills or the handlers behind this hollow hedonistic actioner have dipped their toes in an empty well of ideas to conclude this three-part crime caper.\r\n\r\nLet’s face facts…we all were ‘Taken’ in by this pseudo punchy action yarn that no longer generates the destructive heat it once punctuated with carefree confidence.\r\n\r\nTaken 3 (2015)\r\n\r\n29th Century Fox\r\n\r\n1 hr.  49 mins.\r\n\r\nStarring: Liam Neeson, Forest Whitaker, Famke Jannssen, Maggie Grace and Dougray Scott\r\n\r\nDirected by: Olivier Megaton\r\n\r\nRated: PG-13\r\n\r\nGenre: Action and Adventure/Crime thriller/Mystery and Suspense\r\n\r\nCritic’s rating: ** stars (out of four stars)", "created_at": "2015-10-18T01:14:22.762Z"}, {"movie_id": 260346, "review_id": "5b02add492514109a7016b0a", "author_rating": 6.0, "review_text": "I was looking forward to this movie and I have to say that I was a wee bit disappointed. It is a decent enough action movie but the script leaves somewhat to be desired. A good chunk of the movie is quite good, actually it is very good, but there are some crucial scenes that, in my opinion, really drags it down to a rather mediocre level.\r\n\r\nThe plot is a fairly classical, not a very intelligent nor a very original, one. When trying to push the third sequel in a series Hollywood have a tendency to fall back on certain “trusted” elements. Like, make the hero haunted by the law and / or the government (no I do not consider the government to be the same as the law) or kill off some of the main (or at least likable) characters.\r\n\r\nIn this movie they are doing both. I do not know why this always seems to be the standard solution because I certainly do not like it. Are the general movie going audience really falling for these, in my mind, cheap scripts? I guess they must be since this formula is repeated over and over again. Well, it is not for me to judge other peoples tastes and if I would have been a bean counter for the movie industry then it would really have been my duty to squeeze out as much money as possible regardless of whether I thought it would make a good movie or not, However, I am not. I am a consumer of movies and my personal opinion is that these plot elements are pretty cheap and not really to my liking. But then, that is just me.\r\n\r\nAnyway, the movie is not really bad. It is a decent enough action movie and, in general, I quite like the performance of Liam Neeson. He is the half-sad, silent and, most of all, ass-kicking hero that I like. He is pretty much what holds this movie together. Well, that was perhaps not entirely fair. Forrest Whitaker is doing a quite good job as well. Most of the other characters are mostly fillers. The main bad guy started off fairly good but he really never got the chance to shine and the ending scenes with the big confrontation was…well I would say pretty pathetic.\r\n\r\nThis brings us to my man gripe with this movie. Up until this point Liam Neeson was really playing the big bad, and really skilled, killing machine. The way he, with the help of his friends, entered the bad guy’s stronghold was perhaps not very innovative (seen that, been there, and done that) but at least it was professional. After that however it turned into a bloody joke. Not only does our hero walk into a heavily defended stronghold carrying only a small pea shooter but every time he manages to liberate a decent weapon from the hopelessly incompetent bad guys he throws it away and, occasionally, picks up another pea shooter. What the f…?\r\n\r\nThen we have the fairly ridiculous big fight at the end where the bad guy runs around in his underwear. That was just embarrassing. Maybe I could have swallowed the underwear thing if it was not for the fact that Lieam Neeson suddenly lost all kind of professionalism. Apart from the pea shooter syndrome mentioned before he just gets himself wacked by this maniac until, in the last minute, he miraculously recovers and gets the upper hand. There were a few minor glimpses of intelligence in the whole scene but they were never really exploited.\r\n\r\nOn the whole, if would say this was a fairly decent and enjoyable action movie but I was expecting more from it. If the last third of the movie would have matched the first two thirds then my rating would have been higher. Maybe Liam Neeson is not a big enough star, although I like him a lot, to pick his roles like he wants to but I would say that he should indeed be a bit more picky and read the scripts before signing on.", "created_at": "2018-05-21T11:30:28.860Z"}, {"movie_id": 260346, "review_id": "5c8cda7a0e0a2612fa52fd28", "author_rating": 3.0, "review_text": "I can handle the 47 cuts and shakey cam poorly trying to hide the fact that Liam Neeson can't run. I can handle the inevitability of \"More money means more explosions!\" in franchises like these. I can even contort myself to handle the right-out-the-gate fridging of one of my favourite actresses that _Taken 3_ copped so much flak for. But what I cannot handle is how absolutely fucking dumb this movie gets in the second half. Every five minutes my roommate or I had to scream \"WHAT!?\" at the things that were happening on screen, and disparage the various idiotic and/or nonsense decisions that were being made.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-03-16T11:14:02.346Z"}]