[{"movie_id": 18882, "review_id": "5ee3cda84e6742001f53b3c2", "author_rating": 5.0, "review_text": "_**Deviates too much from the comic and has a boring midsection**_\r\n\r\nMarvel Comics' Man-Thing is a mindless, empathic swamp creature that lives in the Everglades. This 2005 film is loosely based on the story \"Cry of the Native\" from the 1973 comic (Adventure Into) Fear #16, which featured the Man-Thing, by writer Steve Gerber and Howland, Ohio's Val Mayerik (artist).\r\n\r\nThe plot's great: The Seminoles and environmentalists are upset over a developer taking over their precious swamp. A new police chief comes into town and has to deal with the situation, as well as investigate an increasing number of horrifying deaths in the swamp and reports of a \"man-thing\" creature living there.\r\n\r\nThe swamp sets, cinematography, music, locations (Sydney, Australia, of all places) and cast are all quite good. This is not a Grade-Z movie. As a matter of fact, it was originally intended for theatrical release.\r\n\r\nThe film has a good mysterious feel to it, in particular the first 30 minutes and final 20 minutes. The vibe, to be expected, is very comic booky, but the material is respected and generally taken seriously, avoiding the rut of camp.\r\n\r\nWhat works best is the \"Man-Thing\" itself; imagine Val Mayerik's rendition of the creature with a bunch of creepy branches & roots sticking out of its back & head and you'd have a pretty good idea of what ol' Manny looks like in this film: He's an 8-foot tall, hulking, and utterly horrifying piece of man-like swamp mass.\r\n\r\nNow for what doesn’t work. Although the Man-Thing looks great, which is a cinematic triumph in and of itself, he doesn't appear fully until the last 20 minutes. This would be fine if the story were captivating, like say \"Jaws,\" but it's not. Although the plot's great, the story itself barely holds your attention after the first half hour and is unnecessarily convoluted with pointless characters. The middle-hour is wasted on various people hanging out in the swamp for one dubious reason or another, half of them getting picked off by the creature. I'm sure they did this to show-off the superb swamp sets and lighting, etc., but they forgot the most important part, an interesting story and characters. This makes no sense since Gerber's run on the comic contains a wealth of great material to use for compelling scripts.\r\n\r\nAlso, the film deviates too far from Man-Thing's original concept. Some new ideas introduced are great, like the way the creature looks and horrifically attacks people, but where's Manny's empathic nature? Where's the \"whatever knows fear burns at the Man-Thing's touch\" element? And why does Manny kill people indistinguishably? For instance, the creature kills a noble native at one point and later threatens the two protagonists of the story. The Man-Thing never did this in the comics even though he was a mindless creature. In other words, he was a force for good, figuratively representing nature and, more specifically, the swamp. However, this CAN be related to the movie as well, if you think about it.\r\n\r\nSome things are sort of faithful to the comics. For instance, Ted Sallis is linked to the creature and I actually like the change in the movie compared to the eye-rolling “super soldier” serum angle of the comics.\r\n\r\nFor those not in the know, the first Marvel comic featuring the Man-thing beat out DC's Swamp Thing by two months in 1971. To complicate matters, the cover of The Phantom Stranger #14 features a creature that looks suspiciously like Man-Thing (albeit NOT the corresponding story inside the comic) and this issue was released the same month that Man-Thing debuted in Savage Tales #1. In any case, Theodore Sturgeon's similar swamp creature \"It\" appeared in one of his short stories 31 years earlier! The first comic book bog beast, The Heap, appeared two years later in 1942, obviously inspired by Sturgeon's creature.\r\n\r\nLet's compare \"Man-Thing\" with the similar \"Swamp-Thing\" from 1982. To be expected, the creature from \"Man-Thing\" absolutely blows away the guy-in-a-rubber-suit in \"Swamp-Thing.\" The sets, atmosphere and cinematography of \"Man-Thing\" are also better than \"Swamp-Thing,\" not to mention the vibe's not as goofy. As for the story, I would say they're about equal.\r\n\r\nFINAL ANALYSIS: The midsection of \"Man-Thing\" is lethargic and meandering, filled with uninteresting or undeveloped characters, but the film's attributes noted above make it worth checking out if you're into creature-on-the-loose flicks, particularly of the swamp monster variety. On that level it's a decent movie. The greatest part is the creature itself, which is a cinematic triumph, especially if you're a fan of the comic books. But these same fans will be disappointed because the film is a very loose interpretation with an utterly tedious midsection. It's too bad because the potential for greatness was there.\r\n\r\nThe film runs 1 hour, 37 minutes.\r\n\r\nGRADE: C", "created_at": "2020-06-12T18:47:04.983Z"}, {"movie_id": 18882, "review_id": "64ca5ff9d3719700e20a93e9", "author_rating": 6.0, "review_text": "Pretty good movie. I don't know why it's called man-thing cause he doesn't look like a man at all. The movie is based in the swamp. So why not call swamp-thing instead. He looks like groot from guardians of the galaxy but more evil.", "created_at": "2023-08-02T13:54:01.109Z"}]