[{"movie_id": 57165, "review_id": "56824ce4c3a3684be3013e88", "author_rating": 5.0, "review_text": "This could have a pass based on the 3D but, in all honesty, the script and the story is totally senseless and unconnected. The travel through the Underworld maze to the Tartarus is just the best example of how bad the story is. In addition, they just mix the Greek mythology in the most absurd ways, putting a minotaur where it doesn't belong. \r\n\r\nMake up is quite bad. Specially with the beards and appearance of the gods.\r\n\r\nAndromeda, who is also misplaced and doesn't really have any relevant role, is the spark to remark, played by Rosemund Pike.", "created_at": "2015-12-29T09:05:40.908Z"}, {"movie_id": 57165, "review_id": "5a546077c3a3685ed70099c8", "author_rating": 3.0, "review_text": "The visual effects where very good. Unfortunately, that was about it. The script was just awful. I do not want to watch a movie about Greek mythology just to see the gods being portrayed as week, loosing their power and ultimately disappearing.\n\nI don’t know why so many writers today cannot do anything better than to take a well known setting and then totally destroy it for thrills. It seems like they all have some “Lets-destroy-the-Enterprise” complex.\n\nTo me the awful script ruined this movie. It became depressing despite the good visual effects.", "created_at": "2018-01-09T06:25:59.624Z"}, {"movie_id": 57165, "review_id": "6525e7b907216645b8bfced2", "author_rating": 6.0, "review_text": "I'm split on this one! In some ways I kinda prefer <em>'Wrath of the Titans'</em> to its predecessor, though in other ways it is a downgrade.\r\n\r\nMy positives include the pacing and the use of 'the gods', with both - in my opinion - better done in this 2012 film when compared to the 2010 original. The shorter run time helps, while Liam Neeson and Ralph Fiennes are far better utilised this time.\r\n\r\nMy negatives include the story and (one or two) new cast/characters. The plot didn't really hold my attention very well, at a number of moments I felt my mind drift away from what was occurring onscreen. I wasn't bored or anything, though I could feel myself lose interest immediately after a scene that promised more than it delivered. As for the latter, Rosamund Pike and Édgar Ramírez are disappointing additions.\r\n\r\nWith that said, Bill Nighy is a newcomer here and he actually entertained me - probably my standout character from this sequel. Toby Kebbell is a solid newbie too, to be honest. Elsewhere, Ramin Djawadi is missed on music but Javier Navarrete does a perfectly fine job in fairness.\r\n\r\nNaturally, I can only speak for myself and to me this is an average, if admittedly forgettable, flick - nought worse.", "created_at": "2023-10-11T00:09:29.801Z"}]