[{"movie_id": 395, "review_id": "56de19d492514134f40005fa", "author_rating": 5.0, "review_text": "Monstrous - but not a total monstrosity.\r\n\r\nAntartica, and an expedition is about to uncover a battleground for Aliens and Predators.\r\n\r\nWhoever wins, we lose! So ran the tag line for Paul W. S. Anderson's prequel (?) to two fanatically worshipped franchises. Little was Anderson to know that it was the majority of cinema goers who would feel that they had \"lost\" their cash on coming out after watching this miss-matched effort. Though in truth nobody could seriously have expected a film to rival the best of both serials (Alien, Aliens & Predator), it's still right that us fans should expect the formula to be respectfully adhered too. We want character build up, we expect a group dynamic to function, and we definitely want the baddies to stay just that, as baddies.\r\n\r\nIt's not a total loss, though, even as Anderson all too quickly hurtles towards his \"humans caught in a cube like puzzle box\" blood bath, there is just enough back story and anticipation to tickle the tongue. In fact, when it all goes pear shaped and Xenomorphs, Pred-Rastas and humans are all lined up for slotting, it's damn near exciting stuff. While the pyramid/cube/maze design is pretty awesome. However, then the plus points are vanquished as the film quickly becomes kiddie friendly as gloop gives way to strawberry jelly, featuring a turn of events with our \"heroine\" that's so clumsy I'd be surprised if Anderson sleeps at night.\r\n\r\nStill, it's obvious that Anderson loves both franchises and he in no way would have wanted to make a stinker. But he has made a very average movie, one that's got two things in its favour. One being that is the neat middle section, the other that it's not half as bad as the messy hack job that was AVPR: Aliens vs Predator - Requiem in 2007. 5/10", "created_at": "2016-03-08T00:16:20.043Z"}, {"movie_id": 395, "review_id": "5aaf6a6492514116c0034006", "author_rating": 6.0, "review_text": "I can honestly say, that this is one of the most under-rated films of 2004.\r\n\r\nNot because it was good, just because it was panned so fucking hard by critics! I think this is mostly due to the fact that it was being compared to both the Alien and Predator series, which is fair enough, but it was never going to be what either of those films was.\r\n\r\nUltimately it's downfall came from some poor dialogue, and trying to reach a larger audience. Where Predators was a film that you didn't need to have watched all the others in order to follow, it was still fundamentally a Predator film, aimed at the Predator-loving market. AVP on the other hand used references to the older films, but then completely threw the canon out the window and went for a larger fanbase. And whilst it worked to some degree (my grandma liked it) it wasn't enough of a step in either direction. AVP was complicated as a stand alone, and disastrous when compared to anything else in the franchise except perhaps its sequel Requiem (and maybe Predator 2 or Alien3).\r\n\r\nHonestly I think the film works as an archetypal film in the realm of both Alien and Predator, just not a sequel or prequel to either. The lead protagonist is a woman by the name of Alexa Woods, portayed by Sanaa Lathan (Blade, Contagion) who was clearly meant to be a modern day Ripley, and catastrophically failed at doing so. The Predators were as cool as ever, and people complained that in the latter half of the film they weren't as ghostly as in Predator/Predator 2, but we've already had two whole films of that, and these were juvenile Predators, so it sort of made sense that they were a tad more restless.\r\n\r\nBringing Lance Henriksen (Damien: Omen II, Piranha II: The Spawning, The Terminator, Aliens, Alien 3, Pumpkinhead, The Quick and the Dead, Mind Ripper, Scream 3, The Lost Tribe) back was an awesome decision, one that was probably lost on the audience who had not seen the Alien series.\r\n\r\nTommy Flanagan (Smokin' Aces 1 and 2, Sin City, When a Stranger Calls [2006], Gladiator, Braveheart) is another an actor I love, it was a shame his character (Mark Verheiden) was so underused. Ultimately, the film is a good one to pick up and put down, don't think about it too much, don't compare it to the others, go in with your only expectation being that it's a monster-movie, then you won't come out too disappointed.\r\n\r\n59%\r\n\r\n-Gimly", "created_at": "2018-03-19T07:44:36.093Z"}, {"movie_id": 395, "review_id": "625d2584d266a23317968b3a", "author_rating": 5.0, "review_text": "If Paul WS Anderson had just taken a moment longer to look at the casting here, he might have had a decent property. A solid conflict between the ultimate ninja \"Predator\" and the ultimate killing machine from \"Alien\". Why didn't he? Instead, we find a truly C-list bunch of acting fodder exploring a temple wherein, aeons ago, these two titans of terror battled it out. On arrival in the sacrifice room, they inadvertently release some eggs, and some \"Predator\" creatures, and soon some of them are on the menu for both as a battle royal looms. The special effects are good, and the action elements work fine too. I even found myself taking sides - just not with the humans, who deserved every tortuous chewing, stabbing and nasty involuntary caesarians that they got. It's paced well, it looks eerie and sinister, and the ending is quite exciting - it's just a real shame the writing and the acting are really mediocre. Teed up for a sequel too - I can only hope it ups it's game for that!", "created_at": "2022-04-18T08:47:00.184Z"}, {"movie_id": 395, "review_id": "645d51243fe16000e32a7532", "author_rating": 2.0, "review_text": "Did they actually make this!? Wait, did I actually buy this!?", "created_at": "2023-05-11T20:33:40.334Z"}]