[{"movie_id": 227156, "review_id": "545905bdc3a368399d00204a", "author_rating": 3.5, "review_text": "I like this genre of film plus with Jeff Bridges and Meryl Streep, I was expecting more.  Bridges and Streep deliver top-shelf performances it's just there is not enough of them in the film.  \r\n\r\nThere's a scene where Streep and Bridges get into the conversation of whether free will is worth the hurt and pain that comes with it.  It's 10 minutes of acting every one should watch.\r\n\r\nThe problem is this scene comes near the end of the movie and it's not enough to offset the other 100 minutes of complete blandness.  There isn't this sense of dread or tension in the movie at all.  There really isn't any sense of drama or pace to the movie and what results is a movie that feels like a late night documentary.\r\n\r\nI'm tempted to blame the young actors on drawing the audience in but that's completely fair.  The film utilizes the voice of the main character - Jonas - as its narrator.  While this is a quick way to give the film its voice, it also diffuses all the drama out of the film.  We know that the narrator 'makes it out okay' since he's telling the story.  \r\n\r\nThere are so many themes - free will, destiny, joy, war, hope, emotion vs. rationalism - that completely get overlooked because the narrator is trying to get us through the story instead of just inviting us into the story. As a result, there isn't any tension in the first act to make you care about any of the characters.", "created_at": "2014-11-04T16:58:37.263Z"}, {"movie_id": 227156, "review_id": "546514830e0a262942002531", "author_rating": 2.0, "review_text": "Although the cast is good (for the young actors), and excellent for Jeff Bridges and Meryl Streep, this movie just has no scenario.\r\n\r\nThe no-emotion dystopia has been covered many times in the literature and movie industry but, here, the story is just too simplistic and gives no satisfaction at all. The subject had a lot more depth in 'A brave new world'. Heck, even Equilibrium had more content. I got through the 90 minutes of the movie and ended up with the sour feeling that the director skipped from the exposition to the conclusion without developing anything.\r\n\r\nReally not worth the time.", "created_at": "2014-11-13T20:28:51.771Z"}]