[{"movie_id": 24418, "review_id": "570d9fc992514124ef000a7d", "author_rating": 5.0, "review_text": "From watching John C. Reilly over the years, in everything from 'Hoffa' and 'Dolores Claiborne' when he was developing his craft, to 'Step Brothers' and 'Carnage', in which he was one of the leading actors that the film was centered on, I really wanted this film to work for me, though I feel in this recent glut of cinema spawned from Hollywood's post-'Twilight' obsession with vampires, that someone really needs to give this trend a coffin rest, at least for a while so creative fires can have a chance to rekindle--it seems to have been done to death. I'm sure this wasn't what Bram Stoker had in mind with his original 'Dracula'. There's nothing in these recent CGI-bloated messes meaty enough to sink one's teeth into. I'm sure Dr. Alucard himself is cursing the day he was granted immortality, if only to avoid his local multiplex, for this very reason.\r\n\r\nLike another recent film I tried to get into, but basically flew off the rails in an enormous video game-like tidal wave of effects I neither wanted nor needed to see ('Your Highness' by David Gordon Green), the filmmakers ill-advisedly thought that the audience had to be captivated by fights and chases galore, but it's like seeing yet another explosion in a Michael Bay movie: Just give me: a) Great presence in an actor, for once, like the Sir Christopher Lees, Sir Peter Cushings, Vincent Prices, Boris Karloffs and Bela Lugosis of yesteryear; b) A story worth telling; and c) A director who knows a thing or two about storytelling--otherwise, I'd rather boycott drinking blood, and simply switch, at least for contemporary film, to a different cup of tea. I'm not surprised whatsoever that this didn't do well at the box office, and that filmmakers decided not to continue with the franchise. Even for vampires, sometimes enough is enough for a lifetime.", "created_at": "2016-04-13T01:24:25.728Z"}, {"movie_id": 24418, "review_id": "58a07ef59251412609007d63", "author_rating": 7.0, "review_text": "I found this movie pretty much by accident when flicking through the Netflix catalogue. I thought what the heck and started to watch it. My hopes were really not that high. Actually I am not sure I had any hopes at all since I just stumbled on the movie and started to watch it on a whim. What I found was a rather okay and fun movie actually.\r\n\r\nThe movie is apparently based on popular book series Cirque du Freak by Darren Shan. Unfortunately, in their usual arrogant manner, the Hollywood moguls decided to rip the books appart and mash together book one and two in this movie. It appears the general consensus is, not surprisingly, that the books are better than the movie. Nevertheless, the movie was good enough that I most probably will have a go at reading at least one of the books in the series.\r\n\r\nThe movie itself then? Actually I liked it more than I expected. It took a little while before it got started but once it got going it was a good teenage magical fantasy adventure. I am actually a bit saddened that it appears there was never any sequels using the other books in the series.\r\n\r\nThe name Cirque du Freak is well chosen. This is not the usual bunch of people with magical abilities or fangs or some of the other attributes you usually see in magic or supernatural movies. The members of the Cirque are freaks in every sense of the word. I do not think I have seen such a bunch of weird and bisarre creatures before. Heck, the vampire that takes Darrel as his assistant is probably the most normal of the bunch.\r\n\r\nThe story is quite okay and the acting acceptable. The vampire, Creepsly, felt a bit underwhelming at first but he grew on me. So did Mr. Tiny who I definitely didn’t like at first but found doing quite a good job of playing the evil mastermind towards the end. His sleaziness was downright creepy.\r\n\r\nI am sure a lot of the story and character development from the books were left out because there is so much more that could have been done with the story. Darrel befriending the snake man, the brewing romance, Darrels relation with Creapsley and all the other interactions and characters that took place. If the producer had wanted to do a good job he could easily have added another 40 minutes to the movie. A shame he did not.\r\n\r\nBottom line, watching this movie was a pleasant experience. It is perhaps not a blockbuster but a nice little adventure, magic, supernatural and fantasy gem.", "created_at": "2017-02-12T15:27:49.617Z"}, {"movie_id": 24418, "review_id": "5b18583a0e0a261f85000746", "author_rating": 7.0, "review_text": "A teen joins a freak circus where he encounters a war between vampires\r\n\r\nRELEASED IN 2009 and directed by Marco Brambilla, \"Cirque Du Freak: The Vampire’s Assistant\" is a fantasy/horror/comedy about a teen (Chris Massoglia) who is compelled to join a circus of freaks where he becomes (you guessed it) the assistant of a vampire (John C. Reilly) and learns of a war between two classes of vampires. Josh Hutcherson is on hand as his best friend while Michael Cerveris plays the mysterious Mr. Tiny. Ray Stevenson is formidable as a vampiric heavy.\r\n\r\nAfter the mega-hit of “Twilight” (2008), producers naturally thought that another young adult book series involving vampires might be profitable. As such, this movie is based on the opening trilogy of the 12-book series “Cirque du Freak: The Saga of Darren Shan” by Darren Shan (pen name of Darren O'Shaughnessy). It mostly focuses on the first book with uber-fans of the books complaining about deviations. In any case, the film wasn’t a hit at the box office (costing $40 million and making back $39 million worldwide with $14 million of that made in North America). Regardless, I much prefer it to “Twilight.”\r\n\r\nFor some reason I always enjoy stories that center around life in circuses and carnivals. The excellent “Water for Elephants” (2011) is a good example. While that movie was decidedly realistic, “The Vampire’s Assistant” is obviously rooted in fantasy.\r\n\r\nThe first act is a low-key introduction to the two teen friends, their situation in life, and their intriguing visit to the Cirque Du Freak, which in English means The Freak Circus. The film improves in the second act with the excellent character of Larten Crepsley moving to the spotlight. Reilly is commanding and fascinating in the role. The third act is also really good, centering on the war between the vampires and the vampanese. The plot is involved enough without being too complex and the movie is impressively imaginative on practically every front.\r\n\r\nSalma Hayek stands out in the female department as one of the performers with a lame talent. But the creators don’t really take advantage of her presence. In other words, don’t expect anything like Salma’s mind-blowing sequence in “From Dusk till Dawn” (1996). The striking Jane Krakowski is on hand, but her role is very small. Winsome Jessica Carlson plays Rebecca, a potential babe for the protagonist, I guess; she was only 15 during shooting and looks it.\r\n\r\nTHE FILM RUNS 1 hour, 49 minutes and was shot in Louisiana (New Orleans, Baton Rouge and Folsom) and Los Angeles with studio work done in Universal City.\r\n\r\nGRADE: B", "created_at": "2018-06-06T21:55:06.089Z"}]