[{"movie_id": 395990, "review_id": "5a9ef2e6925141580c003e0a", "author_rating": 6.0, "review_text": "\"Willis and his director faced an uphill battle to make their lead character anything less than reprehensible; if that’s their only achievement, it’s a significant if questionable one...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2018/3/6/death-wish.html", "created_at": "2018-03-06T19:58:30.708Z"}, {"movie_id": 395990, "review_id": "5ada6204c3a3686a2000227c", "author_rating": 2.0, "review_text": "When Hollywood starts regurgitating old Charles Bronson Films that we’re ico in their day. Then cast the washed-up Bruce Willis , you gotta know that Hollywood is totally bereft of any original ideas. \r\n\r\nI mean what producer actually signed off on this piece of Shite?\r\n\r\nIt is an insult to any moviegoer and should be liable for incurred costs on wasting a patrons valuable time and money.\r\n\r\nSimply Abysmal.", "created_at": "2018-04-20T21:56:20.180Z"}, {"movie_id": 395990, "review_id": "5b933ca1c3a368568500127c", "author_rating": 5.0, "review_text": "\"It's not as good as the original\" he said, shocking absolutely no one.\r\n\r\nIt's alright though. I don't think that I'll watch this Bruce Willis version ever again, but I actually didn't hate my experience here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-09-08T03:06:09.727Z"}, {"movie_id": 395990, "review_id": "5c52f25ec3a36874b986d11b", "author_rating": null, "review_text": "Robert “Bronzi” Kovacs Played in a Movie called Death Kiss, he looks like Charles Bronson not a bad actor, he'd been better that Bruce, or possibly the two could have been in the remake.", "created_at": "2019-01-31T13:04:30.637Z"}, {"movie_id": 395990, "review_id": "60235bb0ea37e0004042042a", "author_rating": 7.0, "review_text": "An entertaining (full of) action film.\r\n\r\nI enjoyed <em>'Death Wish'</em>, plain and simply. The action is satisfying, with it featuring some neat death scenes. The plot, meanwhile, is one that has heart to it. Bruce Willis is suitably fun in the titular role and is joined by the terrific Dean Norris. Camila Morrone is the pick of the rest of the cast.\r\n\r\nIt's nothing deserving of any awards of course, but that's OK as this is a production well worth a watch - in my opinion at least. Not seen the original yet, will aim to check it (and its many sequels) out some time.", "created_at": "2021-02-10T04:06:08.275Z"}, {"movie_id": 395990, "review_id": "63c1f613a5743d007d11fe66", "author_rating": 10.0, "review_text": "I have spent a LOT of time here rallying against remakes and my absolute hatred for them. And trust me, that hatred is nearly absolute.\r\n\r\nBut, the fiance wanted to see this. And I read the reviews here, and I read the critic's reviews...and noticed that the critics all hated it on the basis of \"NRA Propaganda\" In other words they hated it because...politics.\r\n\r\nAnd I am really not a fan of that unless it's blatantly political.\r\n\r\nBut, then I noticed that the audience reviews were largely the EXACT opposite of the critics reviews (with the odd absolute remake hater like me and the everything is political crowd).\r\n\r\nSo, why was that...had to see it.\r\n\r\nAnd since ALL the Death Wist movies seemed to be exactly the same, might as well.\r\n\r\nEli Roth...that name should say it all. It was graphic and gory and not in the boring Saw way, but in the fun ultra-violent entertainment way. And, really, I won't complain about that at all. It's one of the kind of movies I like for the sake of popcorn munching entertainment.\r\n\r\nAnd that is what you get here, pure entertainment with NO POLITICS, despite what the \"everything is political crowd\" says.\r\n\r\nIt is JUST a super gory and graphic crime movie and nothing more, nothing propagandist about it. It's really just violence and gore for the sake of entertainment,.\r\n\r\nThe bottom line is, this is a remake that actually entertains. And since that is the primary purpose to sit down and watch a movie, if it meats that purpose, I recommend it and give it 10 of 10 stars.\r\n\r\nSo watch it...unless you have a weak stomach...because it will entertain you and it is a lot of fun.", "created_at": "2023-01-14T00:23:47.376Z"}]