[{"movie_id": 579974, "review_id": "62dec9b1955c65004c937529", "author_rating": 1.0, "review_text": "Taught me that Indian movies apparently should just be ignored, as ratings apparently tell you absolutely nothing about the quality of a film.\r\n\r\nThis is perhaps the worst acting I've ever seen - Plan 9 from Outer Space included - with post-production dubbed voices to boot! Add to that the most cringey, cartoonish pathetic storyline, and you're seriously wondering if this is all a joke. No, SERIOUSLY wondering.\r\n\r\nI considered I might keep watching for the laughs (I was laughing from the very first scene with the lip surgery receiving evil white woman sitting in the jungle in the 1920s surrounded by kneeling indigenous worshippers and a terribly-dubbed studio recording of a little girl singing, with the girl not even remote knowing the lyrics and making all the wrong mouth movements to pretend it's actually her doing the singing). But then I realized at 3h5m, the cringey OMG-it's-so-bad-it's-funny laughs definitely wouldn't last that long.\r\n\r\nHoly graboid on a blind horse, Batman, this is so bad!\r\n\r\nNo more Indian movies for me. Lesson learned.", "created_at": "2022-07-25T16:49:53.043Z"}, {"movie_id": 579974, "review_id": "6310cd180d29440079597c01", "author_rating": 10.0, "review_text": "The Cinemark near me has started to show Indian movies. Not feeling like sitting home tonight, I decided to catch this one, and luck was with me.\r\n\r\nMy image of Indian movies, I confess, was that they were mostly musicals centering around a love story involving a very beautiful young woman and a very handsome young man, with lots of elaborate, high-energy dance numbers to keep things going.\r\n\r\nThere is a love story here, but it's not the focus of the film. There are also a few large and very impressive dance numbers, but only a few. (The men's dancing, extremely athletic, astounded me.)\r\n\r\nRather, this movie focuses on the story of two young men in 1920s India who, each in his own way, are fighting against the English occupiers.\r\n\r\nThe English are portrayed as inhuman monsters. Very often, they made me think of the worst atrocities committed by the Germans in France during World War II, or the most rabid racists in the American South. The first time we see the two male leads dancing, a link is indeed made between the Indians and what appear to be Black American musicians.\r\n\r\nEvery time the Indians manage to take revenge on the English for their inhuman abuse of the Indians, you cheer - but at times I wondered if I would have cheered watching a parallel movie about Blacks taking revenge on white racists who had mistreated them in the American South, especially if I had been in a movie theater where, like tonight, I was the only audience member who did not belong to the oppressed population. Imagine Spike Lee, for example, able to make a movie in which he did not have to worry about selling tickets to whites as well as Blacks, and you have some idea of how anti-British colonials this movie is. It is the difference between a society in which the oppressor was a small minority of the population vs. Here, where Blacks are a minority of the American population. I don't want to push this comparison too far. The movie only makes the connection in one scene. But this is very definitely a movie that focuses on the story of a brutally oppressed people seeking freedom from an inhuman oppressor, rather than just a series of dance numbers.\r\n\r\nI don't speak any of the Indian languages used in the movie, but I had no problem following what was going on with the subtitles, which were almost always easy to read. I'm sure there were cultural references I didn't catch, however, especially at the end in the final big dance number, which seemed to be presenting India as a nation of different regions and cultures all united in one.\r\n\r\nThe director and cinematographer definitely deserve praise. There was one very striking visual image after the next, especially during the battle scenes. Ram Charan, dressed as a \"native warrior\"-if that term means anything anymore-flying through flames was breathtaking.\r\n\r\nSo, if you've even been curious about Indian movies, give this one a try. Yes, it's three hours long, but trust me, the time goes flying by. This is truly an action movie, a mixture of visual fantasy and often very graphic realism that held my interest to the end.", "created_at": "2022-09-01T15:17:44.227Z"}, {"movie_id": 579974, "review_id": "63ef5ac6ea84c70096ef8c4f", "author_rating": null, "review_text": "My first exposure to Telugu Cinema, is when I saw my wife watching a near naked guy running in the forest, chased by a Tiger, looking so shredded that I thought my wife was appreciating the sweaty, bulbous body of a forest guy. I dismissed it immediately as another macho movie after-all, which is not my wife's favorite (its Korean movies). Until I saw a raving review of the Netflix viewer in Youtube who aren't Indians but Americans and Europeans. Now that caused me curiosity. So I decided to watch it, and then watched it again. First I can't believe the quality of CGI in most cases and the great acting of the very charismatic actors NTR and Ram Charan. With Ajay Degn and Alia Bhatt making the movie an experience of a lifetime. The movie is brimming with action, drama and great fun that I wished I watched it in bigscreen. I even eatched its Telugu version. Although the Brit-actors aren't too convincing, the entire movie is bursting with energy and drama and with it a series of suspending your belief that a movie this good can feel so short even if its 3 hours. The movie led me on a journey of watching old Rajamouli, NTR and Ram Charan movies. I have been familiar with Devgn's Drishyam (also good). I just had ti watch this several times due to so many things one can find and the beauty of friendship and relationships in the world of freedom fighters. This is 11 but I can only give it 10/10 for sanity reason.", "created_at": "2023-02-17T10:45:26.562Z"}, {"movie_id": 579974, "review_id": "6444cfa3d38b580521118f65", "author_rating": 9.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\n“RRR” is one of those movies where just about everyone who watches it, loves it. It’s an over-the-top historical spectacle about a violent uprising in 1920s India, offering a fictitious retelling of real events. This international blockbuster has everything: thrilling action sequences, adrenaline-charged stunts, a rousing story, and euphoric Bollywood dance scenes that are nothing short of show-stopping.\r\n\r\nThe plot centers around two real-life India revolutionaries, Alluri Sitarama Raju (Ram Charan Teja) and Komaram Bheem (N.T. Rama Rao Jr.), and imagines what would have happened had the two met and become friends. In “RRR,” the men join together to fight against the British Raj and brutal colonialism in order to save the people. The trail of vengeance begins after a young girl is abducted and Bheem takes action to free her from the tyrannical regime. Raju is working for the enemy and becomes a strong adversary to Bheem’s rescue mission. Clashes and chaos ensue when the two start working together.\r\n\r\nThis movie is crazy, ridiculous, silly, excessive, and absolutely amazing. Director S.S. Rajamouli has an enviable skill and master of the craft, as he puts together some truly inventive and unforgettable sequences. Everything is executed with precision and it all works, no matter how outrageous the ideas sound (like unleashing an army of CGI animals into an unsuspecting crowd). This is a strong achievement in directing, and it’s one of the most entertaining movies I have ever seen.\r\n\r\nPart of the reason the film works so well is due to the two charismatic leads who can act, dance, sing, and do their own stunts. They’re bonafide action stars with old Hollywood charisma and charm, and their screen presence is unmatched. I could happily watch these two in anything. They’re so good together that audiences should be begging for a sequel.\r\n\r\nIt’s not all lighthearted fun, and Rajamouli takes his historical setting seriously. The film doesn’t gloss over brutality and violence, and there are upsetting scenes of abuse and death. Men, women, and children are put in great peril. The heroes in the movie are mostly men, and women are the ones who need to be rescued. This is a macho story and not a feminist one, but that doesn’t make much of a difference to the classic action movie vibe.\r\n\r\nEverything is dialed up to the maximum level, and every second of the movie’s 3-hour-plus run time is packed. “RRR” is a crowd-pleasing cinematic experience that’s intoxicating, exhilarating, and delivers a ton of fun. It may also inspire viewers to research India’s history and learn more about the country’s revolutionaries, which is an interesting undertaking in its own right.", "created_at": "2023-04-23T06:26:43.538Z"}, {"movie_id": 579974, "review_id": "64a742f396522000c603f946", "author_rating": 10.0, "review_text": "This movie is one, really fun, action-packed, superhero watch. The CGI, of course, is fantastic. What I love about this movie, though, is that it's not just an empty, trivial story as an excuse for CGI. Quite the contrary. The story itself is a fictionalized version of a very real, revolutionary period just before Gandhi's non-violence movement took the lead.\r\n\r\nIf anyone could make any complaint at all, it would be that the British roles are caricatures. Honestly though, what do we white Americans know of how Imperial Britain treated its \"non-white subjects\"? We DO know that, in 1919, British troops fired on a crowd of unarmed protesters killing hundreds of men, women and children. So the film is steeped in real history. Perhaps, the caricatures were Rajamouli's way of side-stepping the issue by allowing the viewer to accept them at the same level of unreality as the two super heroes of the film.\r\n\r\nThe film itself is over the top, fun and action-packed. It even has the requisite Bollywood dance scenes! I loved the way Ram became Rama, the mythological Hindu archer, an avatar of Vishnu. I probably missed other cultural references, but I suspect that when the two superheroes cooperate, they have 4 arms - that is Shiva, the destroyer with a bow and arrow in two of the arms. The story and production design are gripping. S.S. Rajamouli does such an amazing job with the pacing that three hours seems to fly by before you can even say popcorn.", "created_at": "2023-07-06T22:40:51.361Z"}]