[{"movie_id": 254, "review_id": "5cef40810e0a262318c98e11", "author_rating": 7.0, "review_text": "They just couldn't leave him on his island could they...\r\n\r\nKing Kong is directed by Peter Jackson and Jackson co-writes the screenplay with Fran Walsh and Philippa Boyens. It's based on a story by Merian C. Cooper and Edgar Wallace. It stars Naomi Watts, Jack Black, Adrien Brody, Thomas Kretschmann, Colin Hanks, Andy Serkis, Evan Parke, Jamie Bell and Kyle Chandler. Music is by James Newton Howard and cinematography by Andrew Lesnie.\r\n\r\nAfter completing the hugely successful Lord of the Rings trilogy, Peter Jackson turned his attentions to a reimaging of that daddy of classic creature features, King Kong. With all the new tools of the trade to hand, Jackson set about making a Kong film full of love and respect the original from 1933, whilst obviously making his own beast as it were. Story remains the same, mankind sets off to a fabled place known as Skull Island, there they find beasties not of this world, not least a gigantic mountain of a gorilla. They stupidly bring him back to America for money making exercises and things go really bad. The End.\r\n\r\nI have personally found it most interesting re-watching the film nearly 15 years since its release, especially given we have not long had a different Kong reboot with \"Kong: Skull Island\" in 2017. For the differences, for better or worse depending on your proclivities in Kongdom, are enormous. Kong: Skull Island is a no brain adventure yarn, high on action but low on intelligence, but it does know it. Jackson's Kong aspired to be much more cerebral, and for the most part it achieves it. Sadly it takes a whopping 3 hours to reveal its intentions, which was a problem to many back in 2005, and is still a hindrance sitting down to watch it these days - this even knowing and preparing once again for how long it is. Frustratingly there's a great film in the mix just crying out for an hour of extraneous filler and clunky dialogue to be jettisoned. \r\n\r\nOnce set up has been achieved in the first hour, we finally get to Skull Island and it's an absolute technical treat. The look is fantastic, the turn of events as Kong and his acolytes have been introduced is terrific. From here it's creature feature mayhem, the beauty and the beast aspect kicks into gear, and it's all very comforting, thrilling even - with one exception. A dinosaur stampede looks ridiculous, the blend of human actors and CGI is so poor it belies the money spent on the effects for this production. That aside, though, the action sequences are electric, particularly the monster mash ups. Yet the quite reflective periods on Skull Island really strike a chord as well, just sections where Kong and Ann Darrow (Naomi Watts) are chilling out together, taking in the landscape that money mad men want to take Kong away from...\r\n\r\nThen it's back to The States and carnage ensues, culminating in a brilliantly staged last quarter of film, where all that superb period detail gets obliterated during the battle between man and beast, and where even now I'm rooting for Kong to win! As the tenderness of the Beauty and the Beast arc subsides - and it is beautiful - it's then that you once again know that Jackson was too indulgent. His cast were on form, Serkis as Kong a revelation, this is a great picture at times, a real treat in High Definition, if only someone had fronted him up to not over indulge. For then we might have a 9/10 movie as opposed to a bloated 7/10 one.", "created_at": "2019-05-30T02:31:29.753Z"}, {"movie_id": 254, "review_id": "63bde408f8595800ae33ebf1", "author_rating": 1.0, "review_text": "05 is the worst of the Kong movies, mainly because it tries to do way too much. It tries to be epic, and because it tries to be epic it drags. DRAGS.\r\n\r\nWatching through it, there is about an hour and a half that I would cut, mostly because it's not necessary for a movie like this. There was character development... but too much of it. There was plot, but too much of it.\r\n\r\nIf the movie was trimmed down with an eye to making it flow, it would have been decent. But instead they let it run too long with with not enough happening in it to be an exciting monster movie.\r\n\r\nThe result was kind of a drag.", "created_at": "2023-01-10T22:17:44.317Z"}]