[{"movie_id": 535292, "review_id": "5dd8300728723c001253dab7", "author_rating": 7.0, "review_text": "Andre Davis (Chadwick Boseman) is the NYPD detective tasked with the case of two criminals who kill several police officers during a drug heist. The deaths enrage an entire precinct, and the captain (J.K. Simmons) now has a bunch of trigger-happy cops thirsting for revenge. He decides to pair Andre with a DEA agent (Sienna Miller). But the incident also uncovers a conspiracy, and Andre doesn’t know whom to trust. He has just one night to solve the case and catch the killers before they escape the city of Manhattan.\r\n\r\nChadwick Boseman’s rendition of Andre Davis is intense, and the actor has a commanding on-screen presence as well. He continues to display a lot of range in his acting repertoire to prove, yet again, why he deserves to be a leading man. J.K. Simmons is perfectly cast as Captain McKenna, who makes you really care about why the police deaths matter so much to him and the rest of the cops. Sienna Miller is also impressive in a restrained performance as the DEA agent Frankie Burns. On the other side of the law, Taylor Kitsch and Stephan James make a strong pair. Kitsch plays Raymond Jackson, a sharpshooter who knows how to dispatch whoever is in his sights, and James plays Michael Trujillo, the brains of the operation, who needs to figure how to escape without getting arrested.\r\n\r\nAlthough the plot is neither new nor inventive in any way, it has an interesting setup with perspectives from both sides of the law. Director Brian Kirk shoots the film, particularly the action, well enough to keep the pace engaging throughout. The screenplay has the potential to explore different motivations, but the film barely scratches the surface of its subject matter. If you’re familiar with the crime thriller genre, the chances are you’ll predict the outcome because we’ve seen this story play out many times before. Despite that, you’ll still enjoy ‘21 Bridges’, because the action combined with its competent cast and their performances make it highly watchable.", "created_at": "2019-11-22T18:59:19.697Z"}, {"movie_id": 535292, "review_id": "5eeb6e19db4ed60035cbcc39", "author_rating": 5.0, "review_text": "Some neato throwback vibes in this moderately enjoyable and **very** predictable crime thriller. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-06-18T13:37:29.257Z"}, {"movie_id": 535292, "review_id": "5f50b631fba625003527e2b6", "author_rating": 9.0, "review_text": "Exhilarating, powerful, edge-of-your-seat.\r\n\r\nChadwick Boseman was amazing.\r\n\r\n\r\nDon't get why there's a lot of negativity about this film - it was superb. Combined with a well laid out storyline, amazing cast, background music and produced by the director of Avengers Endgame!", "created_at": "2020-09-03T09:24:01.666Z"}, {"movie_id": 535292, "review_id": "62f5106fc3bffe0087766387", "author_rating": 8.0, "review_text": "A very good action thriller.\r\n\r\n<em>'21 Bridges'</em> has an excellent showing from Chadwick Boseman, everything else isn't quite up to his level though is all still very good. The support cast, which includes the likes of J. K. Simmons and Taylor Kitsch, pacing and music are my main pluses for this 2019 flick.\r\n\r\nIt's far from perfect of course, but I personally I got what I wanted from it and would happily watch it again.", "created_at": "2022-08-11T14:21:35.176Z"}]