[{"movie_id": 2289, "review_id": "5edc6021f36a32001d89b594", "author_rating": 9.0, "review_text": "_**Civil War Odyssey**_\r\n\r\nA Confederate soldier Inman (Jude Law) deserts in late 1864 to return to the mountains of western North Carolina and his one true love, Ada (Nicole Kidman). Inman experiences many different people, events and obstacles on his long journey while Ada has her own problems to deal with: death, grief, the ruthless “home guard,” starvation/poverty, and a house & farm she doesn't know how to run, that is, until the practical Ruby (Renée Zellweger) comes along.\r\n\r\nBased on the 1997 novel by Charles Frazier, “Cold Mountain” (2003) involves two stories that ultimately intertwine and is reminiscent of Homer's Odyssey. In light of Inman's journey home, the film is episodic but, thankfully, never loses its sense of cohesion. The story shows how the war destroyed or corrupted the South on practically every level, not just the soldiers who went off to fight, die, be maimed, desert or suffer defeat, but everyone left behind as well. Every person Inman meets on his journey is somehow damaged or sullied because of the war.\r\n\r\nFor example, in the case of the family in the large cabin the husband's friendliness is dubious. All the eligible men have gone to war and those who return are maimed and scarred. Is it any wonder that the women are love-starved and try to lose themselves in drunkenness and casual sex? As for a couple scenes of overt sexuality, the book & film are contrasting drunken carnal lust with intimate committed love.These scenes are adult-oriented, so be forewarned. I should add that the “kitchen table woman” is actress Melora Walters, who played George Costanza’s date in “The Hamptons” episode of Seinfeld. Meanwhile Natalie Portman shows up for another key sequence. \r\n\r\nThen there’s the immoral & looney \"Reverend\" Veasey (Philip Seymour Hoffman), who may tempt some to view the film as “anti-Christian,\" but this is a premature judgment in light of the entire story and particularly the ending. Not to mention likable, but shakey religionists like Veasey exist in real life. \r\n\r\nNot everyone can handle \"Cold Mountain\" because of its hardcore depiction of the horrors of war, madness and immorality, but it's not all death, misery and darkness; these are commendably counterbalanced by the beauty of life, love, loyalty, companionship, poetry and music. “Cold Mountain” is an all-around well-made motion picture that cuts the fat out of the book for a more effective story.\r\n\r\nThe film runs 2 hours, 33 minutes, and was shot mostly in the Carpathian Mountains, Romania, but with some scenes done in Virginia, South Carolina, and North Carolina.\r\n\r\nGRADE: A", "created_at": "2020-06-07T03:33:53.151Z"}]