[{"movie_id": 556984, "review_id": "5f8872673103250036f12925", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAaron Sorkin has been around for quite some time. A Few Good Men, Moneyball, Steve Jobs, and arguably one of the best movies of the last decade, The Social Network, all have one thing in common: Sorkin as a screenwriter, but not as the director. Molly's Game was Sorkin's directorial debut, which makes The Trial of the Chicago 7 only his second time in the director's chair. I've either loved or liked every film from him, so obviously, my expectations were already high enough solely due to his presence. However, with the announcement of such a stellar cast, it's impossible not to expect one of the best movies of the year to come out of this project...\r\n\r\nExpectations fulfilled. This is, in fact, one of 2020's very best films, without the shadow of a doubt. Based on real events, the movie quickly jumps to the main point of action: the trial. Only twenty minutes in, the viewer is already inside the famous courtroom where the expected and the unexpected occur simultaneously. Sorkin's employs a narrative structure that keeps me captivated until the final credits start to roll. The actions that led to this court case are demonstrated throughout the same instead of being shown through a linear timeline, which would reduce the trial's value. It's the main reason why such a simple premise turns into a phenomenal adaptation of the historical event.\r\n\r\nI couldn't take my eyes off-screen for a single second or lose one of the many incredible dialogues. Every conversation, every argument, every objection, overrule, or \"motion denied\" is transmitted to the viewer in an exceptionally captivating manner. It's one of those movies where the \"action\" belongs to words instead of fists. I felt tremendously invested in the trial. It never loses a gram of interest, it's full-on exciting all the time. I desperately wanted to find out the result of the case (I didn't possess knowledge of the real story, but I'll address this further down). I really wanted to witness the events that put the defendants in their respective positions. I strongly desired to see the end of the situation.\r\n\r\nAs soon as the film ends, I felt the urge to immediately research everything about the true story. I spent close to forty-five minutes reading many articles about the 1968 Democratic National Convention, the riots, the presidential nominees... everything. This is one of the most important criteria I have to define how successful a historical flick truly is: how much does it compel me to research everything about it. The Trial of the Chicago 7 convinces me to study the real events with significant impact. From what I've read, Sorkin changes a few details timeline-wise (something pretty common in this type of movie), but overall, it's a pretty accurate, realistic adaptation.\r\n\r\nTechnically, every component is remarkable, as expected from a Netflix-Sorkin partnership. However, the score plays a special part since its volume in crescendo elevates several escalating situations, leaving me at the edge of my couch, biting my nails. It's a fantastic achievement from Daniel Pemberton, who also scored Birds of Prey and Enola Holmes this year. Additionally, this might not be a one-location film, but Sorkin keeps the camera so focused on the courtroom that it feels like the audience is stuck in there with the defendants.\r\n\r\nBesides Sorkin's screenplay, the cast obviously plays a massive role. Just like I mentioned above, this is a movie where the \"action\" is played out through words. Inside the courtroom, there are constant arguments, countless contempts of court, a voir dire (it doesn't hurt to google courtroom terminology before the film), and so much more that leads the judge to make questionable decisions based on shocking evidence. Every actor is absolutely outstanding, I was able to feel everything during that trial, but I do have four standouts.\r\n\r\nSacha Baron Cohen (Abbie Hoffman) shares the laugh spotlight with Jeremy Strong (Jerry Rubin), but he ends up being the ultimate comic relief. His delivery and timing are pure gold. I can't deny that I was surprised by his performance since I've only seen him in Borat. He's extremely funny, but don't be mistaken by my words: Abbie proves to be one of the most essential defendants in the trial, offering a memorable testimony and demonstrating his real purpose. Eddie Redmayne brings his Oscar-winner face to the game by interpreting Tom Hayden. A vital character that lets the viewer know that while they might not all be completely guilty, they're not all exactly innocent as well. Hayden's final speech is one of Redmayne's best scenes of his career.\r\n\r\nMark Rylance plays the role of the public, portraying the defendants' lawyer, William Kunstler. He shares the viewer's frustration with the judge's decisions but never gives up, trying to bring justice to the case. If I had to bet on an actor to get awards buzz by the end of the year, it would be Rylance due to his powerful display. My last standout is Frank Langella as the judge Julius Hoffman. I believe a lot of people will give credit to every actor for portraying characters they love, but most will forget the actor that interprets the character everyone hates. Langella deserves all of the praise in the world for making me despise completely such an unfair, racist, unqualified judge. His performance is simply extraordinary.\r\n\r\nThese are my four standouts, but the entire cast is phenomenal. I'm a bit disappointed that I didn't get to see more from Yahya Abdul-Mateen II (Bobby Seale), but after researching Bobby's involvement in this story, I understand his lack of relevance to the main narrative. He plays more of a modern parallel to the 60s in the sense that the judge heavily discriminates against him during the trial, transmitting a message that humanity's behavior may have evolved regarding racism, but there's still a long way to go. A final shoutout to Joseph Gordon-Levitt, who is also excellent as Richard Schultz.\r\n\r\nI only have one issue. In terms of entertainment, the viewer entering the main stage after only twenty minutes is a bold yet efficient move. However, the introduction to the characters and the story itself goes by so fast that I could only understand who's who and their purpose during the trial. Sorkin assumes people know everything about who these characters are, what they did, and where the narrative is driving towards, skipping through dozens of details that (mostly) non-American audiences will struggle to understand in time. Sorkin could have given these characters more depth initially, offering the viewer time to get familiar with their names and organizations.\r\n\r\nAll in all, The Trial of the Chicago 7 is undoubtedly one of the best movies of the year, probably the best at the date of this review. Aaron Sorkin's narrative structure and the brilliant cast are the two main reasons why this film succeeds so well. Sorkin's screenplay is organized in a way that keeps the viewer astonishingly captivated throughout the entire runtime by following a nonlinear structure. Maintaining the focus on a single location is an exceptional decision for a movie where words are the action of the story. Inside the courtroom is where every fascinating argument ensues, never losing steam until the very end. It's also a lot funnier than I expected. Regarding the cast, Sacha Baron Cohen, Mark Rylance, Eddie Redmayne, and Frank Langella are my standouts, but every actor delivers outstanding performances. Daniel Pemberton's score shines in an overall very well-produced film. The first twenty minutes fly by in favor of entertainment by quickly placing the viewer inside the courtroom, but it's so rushed that it makes it difficult for the audience to remember everyone's names and purposes. Assuming everyone knows the true story and the people involved is a risky move, especially for non-Americans. Nevertheless, this minor issue doesn't affect an otherwise flawless movie. Obviously, I strongly recommend it! Maybe reading a bit about the real events beforehand will help the eventual viewing, but don't read too much due to the usual spoilers.\r\n\r\nRating: A", "created_at": "2020-10-15T16:01:43.965Z"}, {"movie_id": 556984, "review_id": "5f9bfc931bf87600385799dd", "author_rating": 9.0, "review_text": "Sacha Baron Cohen has now delivered my 2 favourite & memorable characters of the year in the same fortnight.  \r\n\r\nThis movie is a strange incongruence.  It inspired/engaged/enraged me at the same time as it made me feel flat.  It could have been longer (the time flew by) and drawn out the characters more, but I felt that it had said what it needed to say.  And the melodrama felt just above where it needed to be.  Having said that, the editing is top notch and the performances are at least \"on par\", if not outstanding (Baron Cohen,  Abdul-Mateen II, Rylance and Langela).  \r\n\r\nAnd regarding the Direction - its not perfect, it likely would have been better done in the hands of a master.  But if this was my second film, I would be f$%^ing stoked.  \r\n\r\nWatch this movie.", "created_at": "2020-10-30T11:44:19.945Z"}, {"movie_id": 556984, "review_id": "5fe769f8cee481003f2ae02e", "author_rating": 6.0, "review_text": "It is important for a film to say what it wants to say correctly and to somehow overcome its claim. \"The Trial of the Chicago 7\" is one of these films. A coherent narrative with a perfectly acceptable script and no extra glamor. Adapting in cinema has always been a difficult task, whether from another literary work or a real event. The film also manages to make this historical adaptation and not only shows the details well, which gives it a new spirit with the art of cinema, so that it has the necessary impact on the audience. An important point is that the film is successful in creating a feeling and does not seek to hide its weaknesses by crowding the film by using unnecessary Techniques or tricks. Throughout the film, we see a variety of emotional atmospheres that are sometimes very lively and sometimes very calm and quiet. The director, however, has been able to create emotion both in crowded spaces and in the silences, that sometimes take the audience to a deeper layer of the movie. The actors in the film are all acceptable, However, some of them do not become characters in the script, and in the meantime, “Langella” acting as the judge and “Sacha Baron Cohen” as Abbie was better than others. “Sorkin” has once again shown that he has an acceptable ability in screenwriting, and this time he has performed well in directing too. “The Trial of the Chicago 7” is a compact movie that works to the best of its ability And it tries to get closer to the form, though it cannot be said that it has done it completely, but in some places it gets close to the form. It should be noted that the film is very successful in its purpose and the use of old images and videos helps to convey this purpose to the viewer. What this film has done, that is, create a sense of criticism and sometimes hatred for a corrupt system, is something that not every film can easily do. In general, “The Trial of the Chicago 7” is a good movie that will be alive for a long time and anyone of any age and period can communicate with it.", "created_at": "2020-12-26T16:51:04.451Z"}, {"movie_id": 556984, "review_id": "604c1c6c4284ea007318a3ef", "author_rating": 8.0, "review_text": "Very well made, up until that ending anyway.\r\n\r\nIt's not a bad conclusion, but man is it cringe-inducing. It seems they were going for an end to match <em>'A Few Good Men'</em>, which was also written by Aaron Sorkin of course. From the overly uplifting score, to the slow clap, to the freeze-frame. Per <a href=\"https://www.esquire.com/uk/culture/film/a34187167/true-story-the-trial-of-the-chicago-7/\">Esquire</a>, the scene is not even how it went down IRL either. I'm all for 'Hollywood endings', just less of the cheese please.\r\n\r\nThe rest of <em>'The Trial of the Chicago 7'</em> is, though, very good. Sacha Baron Cohen (Abbie) is the greatest performer, the role is mostly comedic - which he nails - but even in the more serious moments he is terrific. Jeremy Strong (Jerry) is notable alongside him, also. Eddie Redmayne, Yahya Abdul-Mateen II, Frank Langella, Mark Rylance and Joseph Gordon-Levitt merit props, too.\r\n\r\nI did enjoy how it portrays the (true) story, one that is very interesting no doubt. Overall, I had a pleasant time watching this - though I'd rate it a tad higher if not for that (not negative, just a bit lame) ending.", "created_at": "2021-03-13T01:59:08.020Z"}, {"movie_id": 556984, "review_id": "5f8872673103250036f12925", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAaron Sorkin has been around for quite some time. A Few Good Men, Moneyball, Steve Jobs, and arguably one of the best movies of the last decade, The Social Network, all have one thing in common: Sorkin as a screenwriter, but not as the director. Molly's Game was Sorkin's directorial debut, which makes The Trial of the Chicago 7 only his second time in the director's chair. I've either loved or liked every film from him, so obviously, my expectations were already high enough solely due to his presence. However, with the announcement of such a stellar cast, it's impossible not to expect one of the best movies of the year to come out of this project...\r\n\r\nExpectations fulfilled. This is, in fact, one of 2020's very best films, without the shadow of a doubt. Based on real events, the movie quickly jumps to the main point of action: the trial. Only twenty minutes in, the viewer is already inside the famous courtroom where the expected and the unexpected occur simultaneously. Sorkin's employs a narrative structure that keeps me captivated until the final credits start to roll. The actions that led to this court case are demonstrated throughout the same instead of being shown through a linear timeline, which would reduce the trial's value. It's the main reason why such a simple premise turns into a phenomenal adaptation of the historical event.\r\n\r\nI couldn't take my eyes off-screen for a single second or lose one of the many incredible dialogues. Every conversation, every argument, every objection, overrule, or \"motion denied\" is transmitted to the viewer in an exceptionally captivating manner. It's one of those movies where the \"action\" belongs to words instead of fists. I felt tremendously invested in the trial. It never loses a gram of interest, it's full-on exciting all the time. I desperately wanted to find out the result of the case (I didn't possess knowledge of the real story, but I'll address this further down). I really wanted to witness the events that put the defendants in their respective positions. I strongly desired to see the end of the situation.\r\n\r\nAs soon as the film ends, I felt the urge to immediately research everything about the true story. I spent close to forty-five minutes reading many articles about the 1968 Democratic National Convention, the riots, the presidential nominees... everything. This is one of the most important criteria I have to define how successful a historical flick truly is: how much does it compel me to research everything about it. The Trial of the Chicago 7 convinces me to study the real events with significant impact. From what I've read, Sorkin changes a few details timeline-wise (something pretty common in this type of movie), but overall, it's a pretty accurate, realistic adaptation.\r\n\r\nTechnically, every component is remarkable, as expected from a Netflix-Sorkin partnership. However, the score plays a special part since its volume in crescendo elevates several escalating situations, leaving me at the edge of my couch, biting my nails. It's a fantastic achievement from Daniel Pemberton, who also scored Birds of Prey and Enola Holmes this year. Additionally, this might not be a one-location film, but Sorkin keeps the camera so focused on the courtroom that it feels like the audience is stuck in there with the defendants.\r\n\r\nBesides Sorkin's screenplay, the cast obviously plays a massive role. Just like I mentioned above, this is a movie where the \"action\" is played out through words. Inside the courtroom, there are constant arguments, countless contempts of court, a voir dire (it doesn't hurt to google courtroom terminology before the film), and so much more that leads the judge to make questionable decisions based on shocking evidence. Every actor is absolutely outstanding, I was able to feel everything during that trial, but I do have four standouts.\r\n\r\nSacha Baron Cohen (Abbie Hoffman) shares the laugh spotlight with Jeremy Strong (Jerry Rubin), but he ends up being the ultimate comic relief. His delivery and timing are pure gold. I can't deny that I was surprised by his performance since I've only seen him in Borat. He's extremely funny, but don't be mistaken by my words: Abbie proves to be one of the most essential defendants in the trial, offering a memorable testimony and demonstrating his real purpose. Eddie Redmayne brings his Oscar-winner face to the game by interpreting Tom Hayden. A vital character that lets the viewer know that while they might not all be completely guilty, they're not all exactly innocent as well. Hayden's final speech is one of Redmayne's best scenes of his career.\r\n\r\nMark Rylance plays the role of the public, portraying the defendants' lawyer, William Kunstler. He shares the viewer's frustration with the judge's decisions but never gives up, trying to bring justice to the case. If I had to bet on an actor to get awards buzz by the end of the year, it would be Rylance due to his powerful display. My last standout is Frank Langella as the judge Julius Hoffman. I believe a lot of people will give credit to every actor for portraying characters they love, but most will forget the actor that interprets the character everyone hates. Langella deserves all of the praise in the world for making me despise completely such an unfair, racist, unqualified judge. His performance is simply extraordinary.\r\n\r\nThese are my four standouts, but the entire cast is phenomenal. I'm a bit disappointed that I didn't get to see more from Yahya Abdul-Mateen II (Bobby Seale), but after researching Bobby's involvement in this story, I understand his lack of relevance to the main narrative. He plays more of a modern parallel to the 60s in the sense that the judge heavily discriminates against him during the trial, transmitting a message that humanity's behavior may have evolved regarding racism, but there's still a long way to go. A final shoutout to Joseph Gordon-Levitt, who is also excellent as Richard Schultz.\r\n\r\nI only have one issue. In terms of entertainment, the viewer entering the main stage after only twenty minutes is a bold yet efficient move. However, the introduction to the characters and the story itself goes by so fast that I could only understand who's who and their purpose during the trial. Sorkin assumes people know everything about who these characters are, what they did, and where the narrative is driving towards, skipping through dozens of details that (mostly) non-American audiences will struggle to understand in time. Sorkin could have given these characters more depth initially, offering the viewer time to get familiar with their names and organizations.\r\n\r\nAll in all, The Trial of the Chicago 7 is undoubtedly one of the best movies of the year, probably the best at the date of this review. Aaron Sorkin's narrative structure and the brilliant cast are the two main reasons why this film succeeds so well. Sorkin's screenplay is organized in a way that keeps the viewer astonishingly captivated throughout the entire runtime by following a nonlinear structure. Maintaining the focus on a single location is an exceptional decision for a movie where words are the action of the story. Inside the courtroom is where every fascinating argument ensues, never losing steam until the very end. It's also a lot funnier than I expected. Regarding the cast, Sacha Baron Cohen, Mark Rylance, Eddie Redmayne, and Frank Langella are my standouts, but every actor delivers outstanding performances. Daniel Pemberton's score shines in an overall very well-produced film. The first twenty minutes fly by in favor of entertainment by quickly placing the viewer inside the courtroom, but it's so rushed that it makes it difficult for the audience to remember everyone's names and purposes. Assuming everyone knows the true story and the people involved is a risky move, especially for non-Americans. Nevertheless, this minor issue doesn't affect an otherwise flawless movie. Obviously, I strongly recommend it! Maybe reading a bit about the real events beforehand will help the eventual viewing, but don't read too much due to the usual spoilers.\r\n\r\nRating: A", "created_at": "2020-10-15T16:01:43.965Z"}, {"movie_id": 556984, "review_id": "5f9bfc931bf87600385799dd", "author_rating": 9.0, "review_text": "Sacha Baron Cohen has now delivered my 2 favourite & memorable characters of the year in the same fortnight.  \r\n\r\nThis movie is a strange incongruence.  It inspired/engaged/enraged me at the same time as it made me feel flat.  It could have been longer (the time flew by) and drawn out the characters more, but I felt that it had said what it needed to say.  And the melodrama felt just above where it needed to be.  Having said that, the editing is top notch and the performances are at least \"on par\", if not outstanding (Baron Cohen,  Abdul-Mateen II, Rylance and Langela).  \r\n\r\nAnd regarding the Direction - its not perfect, it likely would have been better done in the hands of a master.  But if this was my second film, I would be f$%^ing stoked.  \r\n\r\nWatch this movie.", "created_at": "2020-10-30T11:44:19.945Z"}, {"movie_id": 556984, "review_id": "5fe769f8cee481003f2ae02e", "author_rating": 6.0, "review_text": "It is important for a film to say what it wants to say correctly and to somehow overcome its claim. \"The Trial of the Chicago 7\" is one of these films. A coherent narrative with a perfectly acceptable script and no extra glamor. Adapting in cinema has always been a difficult task, whether from another literary work or a real event. The film also manages to make this historical adaptation and not only shows the details well, which gives it a new spirit with the art of cinema, so that it has the necessary impact on the audience. An important point is that the film is successful in creating a feeling and does not seek to hide its weaknesses by crowding the film by using unnecessary Techniques or tricks. Throughout the film, we see a variety of emotional atmospheres that are sometimes very lively and sometimes very calm and quiet. The director, however, has been able to create emotion both in crowded spaces and in the silences, that sometimes take the audience to a deeper layer of the movie. The actors in the film are all acceptable, However, some of them do not become characters in the script, and in the meantime, “Langella” acting as the judge and “Sacha Baron Cohen” as Abbie was better than others. “Sorkin” has once again shown that he has an acceptable ability in screenwriting, and this time he has performed well in directing too. “The Trial of the Chicago 7” is a compact movie that works to the best of its ability And it tries to get closer to the form, though it cannot be said that it has done it completely, but in some places it gets close to the form. It should be noted that the film is very successful in its purpose and the use of old images and videos helps to convey this purpose to the viewer. What this film has done, that is, create a sense of criticism and sometimes hatred for a corrupt system, is something that not every film can easily do. In general, “The Trial of the Chicago 7” is a good movie that will be alive for a long time and anyone of any age and period can communicate with it.", "created_at": "2020-12-26T16:51:04.451Z"}, {"movie_id": 556984, "review_id": "604c1c6c4284ea007318a3ef", "author_rating": 8.0, "review_text": "Very well made, up until that ending anyway.\r\n\r\nIt's not a bad conclusion, but man is it cringe-inducing. It seems they were going for an end to match <em>'A Few Good Men'</em>, which was also written by Aaron Sorkin of course. From the overly uplifting score, to the slow clap, to the freeze-frame. Per <a href=\"https://www.esquire.com/uk/culture/film/a34187167/true-story-the-trial-of-the-chicago-7/\">Esquire</a>, the scene is not even how it went down IRL either. I'm all for 'Hollywood endings', just less of the cheese please.\r\n\r\nThe rest of <em>'The Trial of the Chicago 7'</em> is, though, very good. Sacha Baron Cohen (Abbie) is the greatest performer, the role is mostly comedic - which he nails - but even in the more serious moments he is terrific. Jeremy Strong (Jerry) is notable alongside him, also. Eddie Redmayne, Yahya Abdul-Mateen II, Frank Langella, Mark Rylance and Joseph Gordon-Levitt merit props, too.\r\n\r\nI did enjoy how it portrays the (true) story, one that is very interesting no doubt. Overall, I had a pleasant time watching this - though I'd rate it a tad higher if not for that (not negative, just a bit lame) ending.", "created_at": "2021-03-13T01:59:08.020Z"}, {"movie_id": 556984, "review_id": "5f8872673103250036f12925", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAaron Sorkin has been around for quite some time. A Few Good Men, Moneyball, Steve Jobs, and arguably one of the best movies of the last decade, The Social Network, all have one thing in common: Sorkin as a screenwriter, but not as the director. Molly's Game was Sorkin's directorial debut, which makes The Trial of the Chicago 7 only his second time in the director's chair. I've either loved or liked every film from him, so obviously, my expectations were already high enough solely due to his presence. However, with the announcement of such a stellar cast, it's impossible not to expect one of the best movies of the year to come out of this project...\r\n\r\nExpectations fulfilled. This is, in fact, one of 2020's very best films, without the shadow of a doubt. Based on real events, the movie quickly jumps to the main point of action: the trial. Only twenty minutes in, the viewer is already inside the famous courtroom where the expected and the unexpected occur simultaneously. Sorkin's employs a narrative structure that keeps me captivated until the final credits start to roll. The actions that led to this court case are demonstrated throughout the same instead of being shown through a linear timeline, which would reduce the trial's value. It's the main reason why such a simple premise turns into a phenomenal adaptation of the historical event.\r\n\r\nI couldn't take my eyes off-screen for a single second or lose one of the many incredible dialogues. Every conversation, every argument, every objection, overrule, or \"motion denied\" is transmitted to the viewer in an exceptionally captivating manner. It's one of those movies where the \"action\" belongs to words instead of fists. I felt tremendously invested in the trial. It never loses a gram of interest, it's full-on exciting all the time. I desperately wanted to find out the result of the case (I didn't possess knowledge of the real story, but I'll address this further down). I really wanted to witness the events that put the defendants in their respective positions. I strongly desired to see the end of the situation.\r\n\r\nAs soon as the film ends, I felt the urge to immediately research everything about the true story. I spent close to forty-five minutes reading many articles about the 1968 Democratic National Convention, the riots, the presidential nominees... everything. This is one of the most important criteria I have to define how successful a historical flick truly is: how much does it compel me to research everything about it. The Trial of the Chicago 7 convinces me to study the real events with significant impact. From what I've read, Sorkin changes a few details timeline-wise (something pretty common in this type of movie), but overall, it's a pretty accurate, realistic adaptation.\r\n\r\nTechnically, every component is remarkable, as expected from a Netflix-Sorkin partnership. However, the score plays a special part since its volume in crescendo elevates several escalating situations, leaving me at the edge of my couch, biting my nails. It's a fantastic achievement from Daniel Pemberton, who also scored Birds of Prey and Enola Holmes this year. Additionally, this might not be a one-location film, but Sorkin keeps the camera so focused on the courtroom that it feels like the audience is stuck in there with the defendants.\r\n\r\nBesides Sorkin's screenplay, the cast obviously plays a massive role. Just like I mentioned above, this is a movie where the \"action\" is played out through words. Inside the courtroom, there are constant arguments, countless contempts of court, a voir dire (it doesn't hurt to google courtroom terminology before the film), and so much more that leads the judge to make questionable decisions based on shocking evidence. Every actor is absolutely outstanding, I was able to feel everything during that trial, but I do have four standouts.\r\n\r\nSacha Baron Cohen (Abbie Hoffman) shares the laugh spotlight with Jeremy Strong (Jerry Rubin), but he ends up being the ultimate comic relief. His delivery and timing are pure gold. I can't deny that I was surprised by his performance since I've only seen him in Borat. He's extremely funny, but don't be mistaken by my words: Abbie proves to be one of the most essential defendants in the trial, offering a memorable testimony and demonstrating his real purpose. Eddie Redmayne brings his Oscar-winner face to the game by interpreting Tom Hayden. A vital character that lets the viewer know that while they might not all be completely guilty, they're not all exactly innocent as well. Hayden's final speech is one of Redmayne's best scenes of his career.\r\n\r\nMark Rylance plays the role of the public, portraying the defendants' lawyer, William Kunstler. He shares the viewer's frustration with the judge's decisions but never gives up, trying to bring justice to the case. If I had to bet on an actor to get awards buzz by the end of the year, it would be Rylance due to his powerful display. My last standout is Frank Langella as the judge Julius Hoffman. I believe a lot of people will give credit to every actor for portraying characters they love, but most will forget the actor that interprets the character everyone hates. Langella deserves all of the praise in the world for making me despise completely such an unfair, racist, unqualified judge. His performance is simply extraordinary.\r\n\r\nThese are my four standouts, but the entire cast is phenomenal. I'm a bit disappointed that I didn't get to see more from Yahya Abdul-Mateen II (Bobby Seale), but after researching Bobby's involvement in this story, I understand his lack of relevance to the main narrative. He plays more of a modern parallel to the 60s in the sense that the judge heavily discriminates against him during the trial, transmitting a message that humanity's behavior may have evolved regarding racism, but there's still a long way to go. A final shoutout to Joseph Gordon-Levitt, who is also excellent as Richard Schultz.\r\n\r\nI only have one issue. In terms of entertainment, the viewer entering the main stage after only twenty minutes is a bold yet efficient move. However, the introduction to the characters and the story itself goes by so fast that I could only understand who's who and their purpose during the trial. Sorkin assumes people know everything about who these characters are, what they did, and where the narrative is driving towards, skipping through dozens of details that (mostly) non-American audiences will struggle to understand in time. Sorkin could have given these characters more depth initially, offering the viewer time to get familiar with their names and organizations.\r\n\r\nAll in all, The Trial of the Chicago 7 is undoubtedly one of the best movies of the year, probably the best at the date of this review. Aaron Sorkin's narrative structure and the brilliant cast are the two main reasons why this film succeeds so well. Sorkin's screenplay is organized in a way that keeps the viewer astonishingly captivated throughout the entire runtime by following a nonlinear structure. Maintaining the focus on a single location is an exceptional decision for a movie where words are the action of the story. Inside the courtroom is where every fascinating argument ensues, never losing steam until the very end. It's also a lot funnier than I expected. Regarding the cast, Sacha Baron Cohen, Mark Rylance, Eddie Redmayne, and Frank Langella are my standouts, but every actor delivers outstanding performances. Daniel Pemberton's score shines in an overall very well-produced film. The first twenty minutes fly by in favor of entertainment by quickly placing the viewer inside the courtroom, but it's so rushed that it makes it difficult for the audience to remember everyone's names and purposes. Assuming everyone knows the true story and the people involved is a risky move, especially for non-Americans. Nevertheless, this minor issue doesn't affect an otherwise flawless movie. Obviously, I strongly recommend it! Maybe reading a bit about the real events beforehand will help the eventual viewing, but don't read too much due to the usual spoilers.\r\n\r\nRating: A", "created_at": "2020-10-15T16:01:43.965Z"}, {"movie_id": 556984, "review_id": "5f9bfc931bf87600385799dd", "author_rating": 9.0, "review_text": "Sacha Baron Cohen has now delivered my 2 favourite & memorable characters of the year in the same fortnight.  \r\n\r\nThis movie is a strange incongruence.  It inspired/engaged/enraged me at the same time as it made me feel flat.  It could have been longer (the time flew by) and drawn out the characters more, but I felt that it had said what it needed to say.  And the melodrama felt just above where it needed to be.  Having said that, the editing is top notch and the performances are at least \"on par\", if not outstanding (Baron Cohen,  Abdul-Mateen II, Rylance and Langela).  \r\n\r\nAnd regarding the Direction - its not perfect, it likely would have been better done in the hands of a master.  But if this was my second film, I would be f$%^ing stoked.  \r\n\r\nWatch this movie.", "created_at": "2020-10-30T11:44:19.945Z"}, {"movie_id": 556984, "review_id": "5fe769f8cee481003f2ae02e", "author_rating": 6.0, "review_text": "It is important for a film to say what it wants to say correctly and to somehow overcome its claim. \"The Trial of the Chicago 7\" is one of these films. A coherent narrative with a perfectly acceptable script and no extra glamor. Adapting in cinema has always been a difficult task, whether from another literary work or a real event. The film also manages to make this historical adaptation and not only shows the details well, which gives it a new spirit with the art of cinema, so that it has the necessary impact on the audience. An important point is that the film is successful in creating a feeling and does not seek to hide its weaknesses by crowding the film by using unnecessary Techniques or tricks. Throughout the film, we see a variety of emotional atmospheres that are sometimes very lively and sometimes very calm and quiet. The director, however, has been able to create emotion both in crowded spaces and in the silences, that sometimes take the audience to a deeper layer of the movie. The actors in the film are all acceptable, However, some of them do not become characters in the script, and in the meantime, “Langella” acting as the judge and “Sacha Baron Cohen” as Abbie was better than others. “Sorkin” has once again shown that he has an acceptable ability in screenwriting, and this time he has performed well in directing too. “The Trial of the Chicago 7” is a compact movie that works to the best of its ability And it tries to get closer to the form, though it cannot be said that it has done it completely, but in some places it gets close to the form. It should be noted that the film is very successful in its purpose and the use of old images and videos helps to convey this purpose to the viewer. What this film has done, that is, create a sense of criticism and sometimes hatred for a corrupt system, is something that not every film can easily do. In general, “The Trial of the Chicago 7” is a good movie that will be alive for a long time and anyone of any age and period can communicate with it.", "created_at": "2020-12-26T16:51:04.451Z"}, {"movie_id": 556984, "review_id": "604c1c6c4284ea007318a3ef", "author_rating": 8.0, "review_text": "Very well made, up until that ending anyway.\r\n\r\nIt's not a bad conclusion, but man is it cringe-inducing. It seems they were going for an end to match <em>'A Few Good Men'</em>, which was also written by Aaron Sorkin of course. From the overly uplifting score, to the slow clap, to the freeze-frame. Per <a href=\"https://www.esquire.com/uk/culture/film/a34187167/true-story-the-trial-of-the-chicago-7/\">Esquire</a>, the scene is not even how it went down IRL either. I'm all for 'Hollywood endings', just less of the cheese please.\r\n\r\nThe rest of <em>'The Trial of the Chicago 7'</em> is, though, very good. Sacha Baron Cohen (Abbie) is the greatest performer, the role is mostly comedic - which he nails - but even in the more serious moments he is terrific. Jeremy Strong (Jerry) is notable alongside him, also. Eddie Redmayne, Yahya Abdul-Mateen II, Frank Langella, Mark Rylance and Joseph Gordon-Levitt merit props, too.\r\n\r\nI did enjoy how it portrays the (true) story, one that is very interesting no doubt. Overall, I had a pleasant time watching this - though I'd rate it a tad higher if not for that (not negative, just a bit lame) ending.", "created_at": "2021-03-13T01:59:08.020Z"}, {"movie_id": 556984, "review_id": "5f8872673103250036f12925", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAaron Sorkin has been around for quite some time. A Few Good Men, Moneyball, Steve Jobs, and arguably one of the best movies of the last decade, The Social Network, all have one thing in common: Sorkin as a screenwriter, but not as the director. Molly's Game was Sorkin's directorial debut, which makes The Trial of the Chicago 7 only his second time in the director's chair. I've either loved or liked every film from him, so obviously, my expectations were already high enough solely due to his presence. However, with the announcement of such a stellar cast, it's impossible not to expect one of the best movies of the year to come out of this project...\r\n\r\nExpectations fulfilled. This is, in fact, one of 2020's very best films, without the shadow of a doubt. Based on real events, the movie quickly jumps to the main point of action: the trial. Only twenty minutes in, the viewer is already inside the famous courtroom where the expected and the unexpected occur simultaneously. Sorkin's employs a narrative structure that keeps me captivated until the final credits start to roll. The actions that led to this court case are demonstrated throughout the same instead of being shown through a linear timeline, which would reduce the trial's value. It's the main reason why such a simple premise turns into a phenomenal adaptation of the historical event.\r\n\r\nI couldn't take my eyes off-screen for a single second or lose one of the many incredible dialogues. Every conversation, every argument, every objection, overrule, or \"motion denied\" is transmitted to the viewer in an exceptionally captivating manner. It's one of those movies where the \"action\" belongs to words instead of fists. I felt tremendously invested in the trial. It never loses a gram of interest, it's full-on exciting all the time. I desperately wanted to find out the result of the case (I didn't possess knowledge of the real story, but I'll address this further down). I really wanted to witness the events that put the defendants in their respective positions. I strongly desired to see the end of the situation.\r\n\r\nAs soon as the film ends, I felt the urge to immediately research everything about the true story. I spent close to forty-five minutes reading many articles about the 1968 Democratic National Convention, the riots, the presidential nominees... everything. This is one of the most important criteria I have to define how successful a historical flick truly is: how much does it compel me to research everything about it. The Trial of the Chicago 7 convinces me to study the real events with significant impact. From what I've read, Sorkin changes a few details timeline-wise (something pretty common in this type of movie), but overall, it's a pretty accurate, realistic adaptation.\r\n\r\nTechnically, every component is remarkable, as expected from a Netflix-Sorkin partnership. However, the score plays a special part since its volume in crescendo elevates several escalating situations, leaving me at the edge of my couch, biting my nails. It's a fantastic achievement from Daniel Pemberton, who also scored Birds of Prey and Enola Holmes this year. Additionally, this might not be a one-location film, but Sorkin keeps the camera so focused on the courtroom that it feels like the audience is stuck in there with the defendants.\r\n\r\nBesides Sorkin's screenplay, the cast obviously plays a massive role. Just like I mentioned above, this is a movie where the \"action\" is played out through words. Inside the courtroom, there are constant arguments, countless contempts of court, a voir dire (it doesn't hurt to google courtroom terminology before the film), and so much more that leads the judge to make questionable decisions based on shocking evidence. Every actor is absolutely outstanding, I was able to feel everything during that trial, but I do have four standouts.\r\n\r\nSacha Baron Cohen (Abbie Hoffman) shares the laugh spotlight with Jeremy Strong (Jerry Rubin), but he ends up being the ultimate comic relief. His delivery and timing are pure gold. I can't deny that I was surprised by his performance since I've only seen him in Borat. He's extremely funny, but don't be mistaken by my words: Abbie proves to be one of the most essential defendants in the trial, offering a memorable testimony and demonstrating his real purpose. Eddie Redmayne brings his Oscar-winner face to the game by interpreting Tom Hayden. A vital character that lets the viewer know that while they might not all be completely guilty, they're not all exactly innocent as well. Hayden's final speech is one of Redmayne's best scenes of his career.\r\n\r\nMark Rylance plays the role of the public, portraying the defendants' lawyer, William Kunstler. He shares the viewer's frustration with the judge's decisions but never gives up, trying to bring justice to the case. If I had to bet on an actor to get awards buzz by the end of the year, it would be Rylance due to his powerful display. My last standout is Frank Langella as the judge Julius Hoffman. I believe a lot of people will give credit to every actor for portraying characters they love, but most will forget the actor that interprets the character everyone hates. Langella deserves all of the praise in the world for making me despise completely such an unfair, racist, unqualified judge. His performance is simply extraordinary.\r\n\r\nThese are my four standouts, but the entire cast is phenomenal. I'm a bit disappointed that I didn't get to see more from Yahya Abdul-Mateen II (Bobby Seale), but after researching Bobby's involvement in this story, I understand his lack of relevance to the main narrative. He plays more of a modern parallel to the 60s in the sense that the judge heavily discriminates against him during the trial, transmitting a message that humanity's behavior may have evolved regarding racism, but there's still a long way to go. A final shoutout to Joseph Gordon-Levitt, who is also excellent as Richard Schultz.\r\n\r\nI only have one issue. In terms of entertainment, the viewer entering the main stage after only twenty minutes is a bold yet efficient move. However, the introduction to the characters and the story itself goes by so fast that I could only understand who's who and their purpose during the trial. Sorkin assumes people know everything about who these characters are, what they did, and where the narrative is driving towards, skipping through dozens of details that (mostly) non-American audiences will struggle to understand in time. Sorkin could have given these characters more depth initially, offering the viewer time to get familiar with their names and organizations.\r\n\r\nAll in all, The Trial of the Chicago 7 is undoubtedly one of the best movies of the year, probably the best at the date of this review. Aaron Sorkin's narrative structure and the brilliant cast are the two main reasons why this film succeeds so well. Sorkin's screenplay is organized in a way that keeps the viewer astonishingly captivated throughout the entire runtime by following a nonlinear structure. Maintaining the focus on a single location is an exceptional decision for a movie where words are the action of the story. Inside the courtroom is where every fascinating argument ensues, never losing steam until the very end. It's also a lot funnier than I expected. Regarding the cast, Sacha Baron Cohen, Mark Rylance, Eddie Redmayne, and Frank Langella are my standouts, but every actor delivers outstanding performances. Daniel Pemberton's score shines in an overall very well-produced film. The first twenty minutes fly by in favor of entertainment by quickly placing the viewer inside the courtroom, but it's so rushed that it makes it difficult for the audience to remember everyone's names and purposes. Assuming everyone knows the true story and the people involved is a risky move, especially for non-Americans. Nevertheless, this minor issue doesn't affect an otherwise flawless movie. Obviously, I strongly recommend it! Maybe reading a bit about the real events beforehand will help the eventual viewing, but don't read too much due to the usual spoilers.\r\n\r\nRating: A", "created_at": "2020-10-15T16:01:43.965Z"}, {"movie_id": 556984, "review_id": "5f9bfc931bf87600385799dd", "author_rating": 9.0, "review_text": "Sacha Baron Cohen has now delivered my 2 favourite & memorable characters of the year in the same fortnight.  \r\n\r\nThis movie is a strange incongruence.  It inspired/engaged/enraged me at the same time as it made me feel flat.  It could have been longer (the time flew by) and drawn out the characters more, but I felt that it had said what it needed to say.  And the melodrama felt just above where it needed to be.  Having said that, the editing is top notch and the performances are at least \"on par\", if not outstanding (Baron Cohen,  Abdul-Mateen II, Rylance and Langela).  \r\n\r\nAnd regarding the Direction - its not perfect, it likely would have been better done in the hands of a master.  But if this was my second film, I would be f$%^ing stoked.  \r\n\r\nWatch this movie.", "created_at": "2020-10-30T11:44:19.945Z"}, {"movie_id": 556984, "review_id": "5fe769f8cee481003f2ae02e", "author_rating": 6.0, "review_text": "It is important for a film to say what it wants to say correctly and to somehow overcome its claim. \"The Trial of the Chicago 7\" is one of these films. A coherent narrative with a perfectly acceptable script and no extra glamor. Adapting in cinema has always been a difficult task, whether from another literary work or a real event. The film also manages to make this historical adaptation and not only shows the details well, which gives it a new spirit with the art of cinema, so that it has the necessary impact on the audience. An important point is that the film is successful in creating a feeling and does not seek to hide its weaknesses by crowding the film by using unnecessary Techniques or tricks. Throughout the film, we see a variety of emotional atmospheres that are sometimes very lively and sometimes very calm and quiet. The director, however, has been able to create emotion both in crowded spaces and in the silences, that sometimes take the audience to a deeper layer of the movie. The actors in the film are all acceptable, However, some of them do not become characters in the script, and in the meantime, “Langella” acting as the judge and “Sacha Baron Cohen” as Abbie was better than others. “Sorkin” has once again shown that he has an acceptable ability in screenwriting, and this time he has performed well in directing too. “The Trial of the Chicago 7” is a compact movie that works to the best of its ability And it tries to get closer to the form, though it cannot be said that it has done it completely, but in some places it gets close to the form. It should be noted that the film is very successful in its purpose and the use of old images and videos helps to convey this purpose to the viewer. What this film has done, that is, create a sense of criticism and sometimes hatred for a corrupt system, is something that not every film can easily do. In general, “The Trial of the Chicago 7” is a good movie that will be alive for a long time and anyone of any age and period can communicate with it.", "created_at": "2020-12-26T16:51:04.451Z"}, {"movie_id": 556984, "review_id": "604c1c6c4284ea007318a3ef", "author_rating": 8.0, "review_text": "Very well made, up until that ending anyway.\r\n\r\nIt's not a bad conclusion, but man is it cringe-inducing. It seems they were going for an end to match <em>'A Few Good Men'</em>, which was also written by Aaron Sorkin of course. From the overly uplifting score, to the slow clap, to the freeze-frame. Per <a href=\"https://www.esquire.com/uk/culture/film/a34187167/true-story-the-trial-of-the-chicago-7/\">Esquire</a>, the scene is not even how it went down IRL either. I'm all for 'Hollywood endings', just less of the cheese please.\r\n\r\nThe rest of <em>'The Trial of the Chicago 7'</em> is, though, very good. Sacha Baron Cohen (Abbie) is the greatest performer, the role is mostly comedic - which he nails - but even in the more serious moments he is terrific. Jeremy Strong (Jerry) is notable alongside him, also. Eddie Redmayne, Yahya Abdul-Mateen II, Frank Langella, Mark Rylance and Joseph Gordon-Levitt merit props, too.\r\n\r\nI did enjoy how it portrays the (true) story, one that is very interesting no doubt. Overall, I had a pleasant time watching this - though I'd rate it a tad higher if not for that (not negative, just a bit lame) ending.", "created_at": "2021-03-13T01:59:08.020Z"}]