[{"movie_id": 24150, "review_id": "5a026f89c3a36861aa007dc5", "author_rating": 8.0, "review_text": "Personally, I found _Halloween II_ the darkest of any Rob Zombie movie, and certainly more menacing than any other _Halloween_ film to date. It’s full of tortured, nasty, hateful, abhorrent, violent and crude characters, and that’s just the good guys! Mikey is back, in a big way. His look is a little different, but in a realistic “I’m-a-serial-murdering-insane-homeless-giant” kind of a way. And although the bleak, demoralising nature of the film made it painful to watch at times, I would say it was worth it overall. Featuring some strong acting, a surreal but accomplished script, an absolutely amazing soundtrack, and a totally absorbing storyline. I may be alone in thinking this, but to me, _Halloween II_ is a worthy entry into one of the most successful horror franchises of all time.", "created_at": "2017-11-08T02:44:25.396Z"}, {"movie_id": 24150, "review_id": "5aad917dc3a36846ba01aa9b", "author_rating": 1.0, "review_text": "What happened? When I watched the 2007 remake I was quite happy that it was a decent enough work and gave it 7 stars out of 10. This one though? Well the reboot is effectively killed as far as I am concerned. If there are to be made another movie in this franchise there has to be another reboot. This one is just ruined.\n\nThe first 20 minutes or so was not too bad. Then it just went to hell. Rob Zombie must have been high on drugs when he wrote this crud. A god chunk of it is just some drug-induced psychedelic mess.\n\nDebora Meyers is just a foul-mouthed brat who is so dislikable that you almost hope that Michael will get her. Dr. Loomis have been turned into a despicable asshole. Michael himself is mostly just a big dirty man who slashes people up. \n\nOccasionally he shows some of the supernatural qualities he is supposed to have but most often not. And he grunts a lot, what the f…? The dialogue is non-existent if you remove the foul language. I am normally quite resistant towards foul language but not when the movie is filled with it just to cover up the lack of talent in the writer.\n\nI think that I have not been so disappointed in a movie in a long time. This movie is utter trash and a disgrace to a franchise that is really one of my favorite horror ones.\n\nI am going to think more than twice before I ever watch a movie by Rob Zombie again.", "created_at": "2018-03-17T22:06:53.612Z"}, {"movie_id": 24150, "review_id": "5f7893f41f748b00362877b4", "author_rating": 2.0, "review_text": "I see 2 reviews here on this one, one is an 8 star the other a 1 star, I've been watching Movies for over 50 years now, I absolutely love them, all types and Genres, I can sit down with my Wife or alone and watch any good Hallmark Movie or any good Horror Movie, I have favorites in all genres.\r\n\r\nAnd I think I can give a good honest independent review on any type of Move, so obviously here with an 8 & 1 star reviews one of them is either 100% wrong and the other right or this move possibly falls somewhere in the middle at around a 5*.\r\n\r\nI watched it for the 1st time last night, I like the original, it's not a great Movie but it's good and a decent sequel to the Original,  Rob Zombie's Halloween remake of the Original was fairly good, 10x better than his second one.\r\n\r\nI have to agree 100% with Peter's review here, the star is a Loud, Foul Mouthed, and extremely irritating and ignorant Character, she is also a terrible actress in this Movie unless you just want her for her screaming in y our face.\r\n\r\nI like all the actors from other shows and Movies he throws in, some are wasted others are fairly good in their spots.\r\n\r\nI also rate it a 1 STAR, I'm not against Foul language in a Movie, but it should be used in the right spots and times, in this one, they just throw the F-Bombs out there like it's a normal thing and it's not, even when I worked in a Factory with mostly Men that drank some before during and after work, they did not use foul language that often.\r\n\r\nI could have raised my rating higher if that was not the case and if she was nothing more than a screamer, let her act a little, I agree with Peter's question, was Rob High when he filmed this, LOL!,  the reviewer that rates it an 8 star is WAY OFF!, I'm sorry whomever you are, but the only thing you get right is, it is Rob's Darkest Movie yet, other than that, this MOVIE SUCKS!\r\n\r\nDO NOT WASTE 1 MINUTE OF YOUR LIFE WATCHING IT,  watch the 2nd one with Jamie Lee Curtis, it's pretty good and also number 3 it's not a bad one either and better than the reviews it got.", "created_at": "2020-10-03T15:08:36.385Z"}, {"movie_id": 24150, "review_id": "63c21b9adf857c009f4454c3", "author_rating": 1.0, "review_text": "Malcolm McDowell so 2 stars just like I did the first one: ** The nudity isn't as much, so maybe I was wrong, maybe he was going for satire in the first one and not snuff porn...or maybe he was told to tone it down with the rape and dead naked women...\r\n\r\n...but there are still naked women that get murdered by the big scary male monster after committing a fundamentalist sin of one kind or another...\r\n\r\n...so was it intended to be a satire of the genre or does it just get Zombie off? Still not sure.\r\n\r\nAnd again, the atmosphere isn't there. The film has a feel to it that is almost grindhouse sleaze without being good enough to really achieve grindhouse sleaze.\r\n\r\nIt makes for an off putting after taste in your mouth.\r\n\r\nAnd with all the nudity it still feels like its trying to be Friday the 13th more than it is a Halloween installment.\r\n\r\nYet again I ask \"Why remake it?\" And this time the answer I can come up with is, Zombie is a great musician...unfortunately he shouldn't quit his day job.", "created_at": "2023-01-14T03:03:54.822Z"}, {"movie_id": 24150, "review_id": "63ec02a51f3e60007fb58963", "author_rating": 1.0, "review_text": "**Paying to see this is a waste of time and money.**\r\n\r\nI've seen the original franchise, but I confess that \"Halloween\" will never be a movie that I enjoy. It's simply not the style of horror I enjoy: \"slasher\" films are simply too \"campy\" and will probably scare only those whose fear is measured by the amount of fake blood used in the scene. However, Carpenter's films acquired, with some merit, the character of classics. None of the older sequels even deserve to be used as a benchmark. They are simply awful, and it was the Franciscan poverty of subsequent films that motivated Rob Zombie to take the franchise and start over from scratch. And if the first movie was bad, this one is worse.\r\n\r\nThe film wastes no time with introductions. Starting at the point where the predecessor ends, it immediately transports us to the action, with a lot of deaths of characters that we do not know, and with which we do not care. The film thus functions as a virtual meat mincer. The script is downright amateurish, and an excuse for a horror film based solely on gratuitous bloodshed.\r\n\r\nThe actors are pretty bad. Malcom McDowell, who is usually a very good actor if he is well directed, has one of the worst works of his career in this film: in addition to having almost no time to do anything, the little he does is terribly bad, and the character is very bad. and unhappy. Brad Dourif does what he can, but in all fairness, I can't rate his effort beyond merely satisfying. Even so, he is the best actor in the film. The rest of the cast is forgettable, or downright awful, and that includes the entirety of the female cast.\r\n\r\nTechnically, the film bets heavily on CGI and liters of fake blood. The director completely forgot that the audience tends to feel the film more if they really sympathize, or care, with some of the characters, and in particular with the protagonist. Instead, he offers us all the fake blood he could buy with his millionaire budget, and grotesque deaths. It's no more exciting or frightening than an expensive video game, but it must have brought in a nice bag of money for the main players...", "created_at": "2023-02-14T21:52:37.270Z"}, {"movie_id": 24150, "review_id": "653e5103109cd0014df50114", "author_rating": 5.0, "review_text": "It's a bore!\r\n\r\nI didn't anticipate much from 2009's <em>'Halloween II'</em> based on its predecessor and it turns out I was right to have done so. It's nae good! More of Brad Dourif is nice, though to be honest none of the cast members do anything to elevate this film up.\r\n\r\nNot that I blame those onscreen, as it's all poorly cobbled together. The early hospital scene, starring Octavia Spencer and Richard Riehle (minorly) interestingly, showed some promise, but this flick quickly descends into a waste of 105 or so minutes; I zoned out a few times.", "created_at": "2023-10-29T12:33:07.363Z"}]