[{"movie_id": 632617, "review_id": "62b0bc9190cf51005350b5e9", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/the-kids-are-gonna-be-okay-cmon-cmon-review<a>\r\n\r\n_C’mon C’mon_ isn’t an easy movie to classify. It doesn’t fit in a simple genre. It’s the kind of movie that reaches into your chest and builds a home there; a one-in-a-million movie that makes you acutely aware of being alive. You can feel the warmth of the blood in your veins and the ache of the bones in your body. You are present and you are witnessing magic.", "created_at": "2022-06-20T18:29:37.895Z"}, {"movie_id": 632617, "review_id": "634c00dfe263bb007c289cad", "author_rating": 9.0, "review_text": "This might be the first documtari-aphical I've ever seen maybe. It's a fascinating mash-up that gently reminds us of how lost we are as a society and yet, how hopeful we deserve to be. It's heart-full cinema at it's best.", "created_at": "2022-10-16T13:02:23.301Z"}, {"movie_id": 632617, "review_id": "63daaaf422df2e00843cd222", "author_rating": 8.0, "review_text": "C’mon C’mon is a beautiful look at the developing relationship between an uncle and his nephew. It made me feel a huge range of emotions and has a very satisfying ending. The script is excellent and it is elevated due to fantastic performances from the entire cast. Joaquin Phoenix is superb and his chemistry with both Woody Norman and Gaby Hoffmann is excellent. Norman was great, he had such a wide range for a young actor and was able to make his emotions feel genuine, which is difficult in a lot of child actors. Hoffman was also quite good, she displays her helplessness to care for both her son and ex-husband tremendously well. Cinematography was top notch and the audio design was brilliant. There are some really cool things that are done with the interview sections/street recordings that create a very unique listening experience. My one complaint is that the movie drags on a little longer than it should. There is not a lot going on in this film, and that is fine because you get to spent time with the characters and see their relationship blossom. But that creates a very slow pace that could have been corrected with a slightly shorter runtime.\r\n\r\nScore: 79%\r\nVerdict: Great", "created_at": "2023-02-01T18:09:56.272Z"}]