[{"movie_id": 354556, "review_id": "58fa0831925141587300b509", "author_rating": 5.0, "review_text": "**The Guardians: how to make a \"Russian X-Men\" flick for $7 million.**\r\n\r\nIn our world the sum of $7 million was last adequate for a blockbuster about 40 years ago. Obviously, the Russian team bet on using smaller resources to maximum gain. Not unlike the current Russian president's geopolitics, cough. The result is more than solid—for a direct-to-DVD level superhero flick, that is.\r\n\r\n**The women:** gorgeous in a way which only Eastern European women can ever be—combining the Scandinavian Valkyrie component with the finer feminine Slavic beauty. In short—the next Trump-type can do worse than dip into the beauty pool of The Guardians.\r\n\r\n**The men**: dreamy types, blond and dark, muscular and lithe—for all tastes.\r\n\r\n**The acting quality:** imagine the supporting cast of any generic direct-to-DVD film with Steven Segal, but worse by about 25%.\r\n\r\n**The action sequences:** world class.\r\n\r\n**The special effects:** more or less on par with the special effects from the first X-Men film from the year 2000, which back then cost $75 million to make. Apparently a decade and a half later technology has progressed enough to enable the plucky Russian team to achieve the same effects of…the effects…for a minuscule fraction of the cost.\r\n\r\n**The plot:** Soviet super-soldier experiments decades ago led to a bunch of amnesiac, un-aging men and women scattered around the country, who are gathered once more in order to stop the baddie who is wreaking havoc on New York, *sorry*, I meant Moscow. The baddie in question is like an uglier Bane, but with an approximation of the powers of Magneto.\r\n\r\n**The end result:** can it compete with the Marvel or DC films of today? Absolutely not. Is it good entertainment when measured by direct-to-DVD or TV film (or modern computer game) standards? Sure\r\n\r\n**Conclusion:** back in the 1960’s and 1970’s Italian directors like Sergio Leone and Dario Argento proved that even if you have no budget and no actors and no coherent plot, you can still create world-class, even legendary cinema through sheer class.\r\n\r\nThe Guardians has no class whatsoever, but is a perfectly OK derivative adventure with superheroes and things going bang, and in an \"exotic\" setting at that. Maybe this is just the start of something cheap and beautiful?\r\n\r\nIf Russia becomes a world center for cheap knock-offs of Hollywood films, I for one would be happy with this development and would watch these films, because with smaller budgets and therefore less oversight by focus-group obsessed bean counters, interesting stuff may start to develop within the generic story skeletons, as once was the case with Italian films.", "created_at": "2017-04-21T13:25:05.538Z"}, {"movie_id": 354556, "review_id": "596796139251413462003ddf", "author_rating": 6.0, "review_text": "**Not just another superhero film!**\r\n\r\nIt was more like a counterpart of the first 'Captain America' film. Because both the films set in the same background, which is the Cold War. But the Cold War was merely a reason to initiate what the film needed for its story. So as we roughly guessing the plot, there's something goes wrong in the secret experiment and then there emerges the superheroes and the supervillains.\r\n\r\nThe last time I saw such scale grand Russian film was 'The Inhabited Island' and decided never watch such Russian flicks. I might be wrong, because my knowledge about the Russian films is less, but there could be a lot better films that I haven't seen. Anyway, I put all my faith on it, despite very low ratings and heavily criticised it on the internet. I must say that, it was a decent film, neither a breathtaking nor a worst film (of the year).\r\n\r\nYep, there's lots of cliché, because you have seen them all in high standard Hollywood films. But since it is not a Hollywood, comparing them is unfair. A little appreciation needed for its effort. Except borrowing the concept should be questioned here. Because that's made its lack of originality. And one more exception is that science is everywhere the same, which is a big excuse for that.\r\n\r\nThe graphics were almost flawless. The characters are unique, but adapted from the same blueprint how every superhero film take off. So what went wrong with it is the big question, despite everything's carefully and nicely done. And the answer is the screenplay. Any superhero films majorly depends on the best designed action sequences and the stunt choreography with respective superpowers of the superheroes at its best.\r\n\r\n> ❝Death for us is not a problem, we've lived long enough.❞\r\n\r\nI liked the costumes, which aren't too fancy or simple, and the superpowers, but I don't think they were used that in the best way possible. And have you ever seen a 90 or less minute superhero film. That's another drawback. Because shortening the runtime does not speed up the narration. In this film, there were no space given for the character developments, like to make them, those heroes sit somewhere and have some lazy takes, which surely opens their deep thought, including personal events of the past and all. What I saw was, they came, they saw the villain and they fought him.\r\n\r\nWell, at first attempt, it should not succeed, otherwise the film ends there. That's how all the superheroes rise back from the initial stumble. Only after upgrading with modern scientific weapons and gadgets to boost their superpowers, they now can match the bad guy. Those were the properly done things from the film. But not everybody will be happy for it as it is another clichéd segment. So what, that's same even if it is a Hollywood or European film.\r\n\r\nThen what makes the film watchable is the production standards, that very much comparable with the big cost films around the world. Those criticised it was wrongly accused as saying it has the cheap CGI visuals, but that's definitely not true. Then the most successful film in the history of Indian cinema, 'Bahubali' would lead such worst visual effects list. If you watch this film, you would know that or you would bring your own perception. But the plot holes, surely there are many, if you are focused enough to identify them.\r\n\r\nAfter all, if you give your interest to watch the film, then there won't be any time to go after such errors. Thus, it is the thing what all the film critics usually do. Madness is some film fanatics joined them. So never mind all the negatives about the film. Don't think I'm defending it. Just know how I rated it, an average. My idea is to expose it not a very bad film as it was labelled. That does not mean it is a fantastic film either. A 50-50 chance film, which can be still watchable, and once you did, the outcome of the watch could be anything. So after seeing all the confusing ratings and reviews, it must be hard for you whether to go for it or not. Suppose if you ask me, I say choose wisely, and if you did, have low expectations.\r\n\r\n_6/10_", "created_at": "2017-07-13T15:47:31.354Z"}]