[{"movie_id": 277685, "review_id": "57d30c079251415490000861", "author_rating": 7.0, "review_text": "**In this viral going social media era, our actions must be very cautious!**\r\n\r\nA new age cinema. I don't know how it was put under 'found footage' subgenre film, since the webcams involved I think it is very much valid. There are lots of interesting stats for this like it is a $1m film, 80 minutes long, shot within the 16 days, but made to look like a single shot film in real time. This is a story of friends gang whose friend was recently committed suicide. Like usual one day, they are all hanging out on the Skype for a group chat, finds a stranger contact live among them who claims she's their dead friend. So the quest begins to find who really it is and what is the purpose behind such a pose.\r\n\r\nThis story is very familiar. Like a gang was put together in a room and revealing each others secret to bring total chaos. Take for example 'Cube'. What follows is we all know which is actually a famous cliché in a thriller like this. So I thought similar way for this and it was, but only in a digital format where the current world trend stands. So this film can be enjoyed by youngsters and those who are familiar which internet forums like facebook, skype, google, email et cetera. In the entire film, all you would see is the computer screen. So you have to quick where mousing is moving and text was composed and concentrating the audio comments. Something like sitting next to a friend's computer and looking what he's doing.\r\n\r\nI think it was a good film, keeps us guessing till the final minute. I'm watching it a bit late, but very happy I did not miss it after all and there is already a second film getting ready which is due this year's end. But I doubt the film won't get anywhere near to this one. The franchise might end up like 'Paranormal Activity' if sequels keeping coming. The actors were good though. I thought one of them was Jennifer Carpenter where one of the film posters resembles 'Quarantine', but during the watch I realised it was a different actress.\r\n\r\nDespite the familiar theme, the setting makes all the difference and pretty entertaining. The end scene was a surprise, because until that point I was not aware of this film genre. Definitely worth a watch for modernising the old storyline with lots of suspense.\r\n\r\n7/10", "created_at": "2016-09-09T19:22:47.669Z"}, {"movie_id": 277685, "review_id": "58c14febc3a3682658008e4d", "author_rating": 6.0, "review_text": "'Unfriended' is a modern horror film with interesting messages about modern society and our addiction to social networking tools on the Internet. It touches on quite a sensitive subject in cyber bullying from the very disturbing introduction. It tells the story of a teenage girl who was publicly humiliated on the internet and commits suicide due to the heckling and bullying from her peers. A year on and it seems that this group of peers are being stalked online by a vengeful pursuer.\r\n\r\nGabradze's direction is very intriguing. 'Unfriended' (lovingly renamed 'Mad Macs' by me) plays out in very simplistic fashion. The film shows the main character's computer screen throughout it's duration. The audience see every keystroke and mistake made by Blaire Lily (Shelley Hennig). This is a very compelling technique when trying to show the character's panic and fear slowly progressing. Blaire plays around with music software known as 'Spotify' during the film which gives an excuse for there to be non-diegetic music to add to the atmosphere.\r\n\r\nAs the film is mainly a conference video call on 'Skype', the actors are in separate rooms on individual \"webcams\" to add to the realism of the story. Although the film didn't require the actors each to connect to the internet, occasional screen buffering and flickering help add to the illusion.\r\n\r\n'Unfriended' is a very dialogue-driven film as not a lot of action takes place. Therefore, it is essential to have a good screenplay to keep the story as intriguing as possible. The screenplay is solid and there are genuine moments when the mysterious stalker is very creepy and scary. Due to the nature of the film's themes, there is a lot of slang and computer terms that seasoned users of said social networking tools will appreciate and understand. If you are not very wise to how these programs work it may be hard to keep up with the story.\r\n\r\nThe actors weren't the best but the film did work. It would seem that their jarring and annoying demeanor added to the theme of the piece however.\r\n\r\nOverall, 'Unfriended' is an interesting film. I thought it was a very clever statement on modern life. There were moments that were genuinely scary and creepy but like most modern horror films it relied too much on jump scares. It conjured up good memories of 'The Blair Witch Project' in how it tried to be as realistic as possible whilst also addressing dark themes of today's culture.\r\n\r\n★★★", "created_at": "2017-03-09T12:51:55.829Z"}, {"movie_id": 277685, "review_id": "5c4801bb92514154484dc070", "author_rating": 5.0, "review_text": "Actually pretty alright, maybe the format has been utilised better elsewhere, but you still have to admire _Unfriended's_ dedication, especially for all the way back in 2014. That dedication does have some drawbacks though, the devotion to the realism unfortunately also means realistically low quality webcam video & audio, as well as the realistic wait times I've using a computer. It felt like for **so** much of _Unfriended_ I was just sitting there waiting for a page come up, or a file to download, or a response on an IM, and yes of course any computer user will absolutely have to wait for these things, but it's not what you go to the movies to see.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-23T05:55:07.226Z"}, {"movie_id": 277685, "review_id": "5d999ea0b04605002a4392b5", "author_rating": 7.0, "review_text": "Online, your memories live forever... but so do your mistakes. \r\n\r\nA group of online chat room friends find themselves terrorised by someone or something using the account of their dead friend. \r\n\r\nFor someone like me who is way out of the age sphere for such things like the social media world featured here, Unfriended is a fascinating and unnerving experience. When your on line experiences are simply message boards and discussion forums etc, where twitter, skype, facebook and their like are alien to them, then one can only praise when an innovative and fresh idea is brought to the horror realm of film making. And lets face it, horror always needs new splinters to off set the ream of numerical sequels and remakes from hell.\r\n\r\nUnfriended is not scary on conventional terms, where it's not about to jolt you out of your seat or have you hiding behind the sofa. It is, however, scary how technology has advanced, how the millions of world wide web users so willingly commit to baring their innermost to all and sundry. Then there's the dark half, those who use the platforms for venal and nefarious means, bringing very real terrors into our world. \r\n\r\nI can't personally vouch for how genuine the tech aspects are in this film, but Unfriended definitely taps into a frightening realm, and that is to be applauded. Oh I will not be watching it again, I mean what would be the point? But I'm glad I did take the plunge, and simultaneously I'm glad I'm one of those who is happy just texting and using email...  7.5/10", "created_at": "2019-10-06T07:58:24.876Z"}]