[{"movie_id": 44896, "review_id": "589c3ef5925141242200355a", "author_rating": null, "review_text": "Honestly, I wasn't excited to see this film. I know I'll just catch this in dvd. But since there's nothing to do and it's my birthday and Mayi will treat me, okay!\r\n\r\nThe animation was great. I really liked the animation. The story was alright too. But the pacing of the story was slow that I was close to snoozing off. I felt like there were some scenes in the movie that should've been cut off.", "created_at": "2017-02-09T10:05:41.421Z"}, {"movie_id": 44896, "review_id": "58ac4dbb92514158f6012dc8", "author_rating": 8.0, "review_text": "'Rango' is typically one of those movies that can't quite be categorized into this or that little genre of comedy. Obviously, it's an animated film. Is it a kiddie movie? Well… kind of. Allow me to elaborate. The film starts off absolutely hilariously, with an accident, half a road kill and a journey through the desert turned into a maniacal chase as soon as a hungry hawk gets wind of Rango's presence. After meeting a lovely lizard named Beans, he ends up in the small town of Dirt. Where, after a good deal of bluff and dumb luck, he is appointed sheriff. So far, no harm, no foul, just good comedy. In fact, nearly-wetting-my-pants-laughing-out-loud-comedy.\r\n\r\nHowever, at this point is where it all turns just a little bit haywire. No real damage done, just a small sense of cluelessness as we go along. The story continues as though Gore Verbinski and John Logan were just trying to think of as many weird situations as they possibly could whilst forcibly trying to mash it up into one, cohesive storyline. Truth be told, seems like they were trying just a little bit too hard. It actually gets even a little bit boring here and there, where the pacing kind of sinks in up to the point where it all comes together and starts to make sense again. (Mind you – this could also be due to the fact that I was watching the extended version, not the theatrical one, but still.) But fear not, no real quality is lost, as 'Rango' provides some of the most excellent and funny characters I've ever seen in an animated movie. They also rounded up a perfect voice-cast, with Johnny Depp who doesn't sound anything like Jack Sparrow, but still adds the same kind of awkward quirkiness to his character. Alfred Molina's part is small but vital, and I'll bet you've never heard an armadillo with a perfect Mexican twang before… Bill Nighy is awesome as Rattlesnake Jake, and you can even hear a little bit of Davy Jones coming through sometimes. One of the best parts however, is done by Ray Winstone as Bad Bill. Who would expect some Wild West bad guy to have a cockney accent? Brilliant.\r\n\r\nAnother thing I must mention is the superb animation. Without a doubt the best I've ever seen from a non-Pixar production. Heck, even if it was Pixar it would have been their absolute best so far, and that's saying something. The animation parallels – or, dare I say, even surpasses – Finding Nemo. That's right; I said it, so sue me. Yep, Industrial Lights & Magic made a fan out of me.\r\n\r\nNow, back to the original question – is it a kiddie movie? Yes and no. Some parts are totally hilarious and will have your youngsters rolling over the floor with laughter. Other parts will sail right over their little heads as they are very much grown-up humour with references to classic films and jokes they simply won't get. (Is it just me or did I catch a tiny reference to Fear and Loathing in Las Vegas in the beginning?) Another factor is that some of the humour is a little grim and quite mature for small children, with some of the creatures smoking, swearing and even getting shot and/or killed. Now, personally I don't know any children who would be upset by any of this, they see things that are much worse on a daily basis on the Disney channel. But then again, I'm not American, and it is my understanding that some American parents are hugely bothered by some of the elements in this movie. So I would recommend that you simply watch it first and then decide if you would like your children to see it. But honestly, I would try not to be too sensitive about it, it doesn't get scary anywhere and none of language or behaviour is really that bad. \r\n\r\nAll in all, 'Rango' is definitely a fun ride, and one of the few animated movies that will entertain as many adults as it will children.\r\n_(July 2011)_", "created_at": "2017-02-21T14:24:59.570Z"}, {"movie_id": 44896, "review_id": "6316d8e7988afd00808d8629", "author_rating": 8.0, "review_text": "**An enjoyable film that gives us, perhaps, more than we could have hoped for.**\r\n\r\nThis film surprised by not coming from any of the major animation studios and, even so, having a lot of quality and winning the Oscar for Best Animated Film. I didn't see it at the time, I just saw it now, but I can say that I was reasonably pleased. The film pays an honorable tribute to the old western movies with a narrative set in the present day, but in a small village in the Nevada desert, where the water has disappeared, causing fear to all the residents, who still live and behave as they did in the old days.\r\n\r\nOf course, the characters are anthropomorphic animals, and the protagonist is an unnamed chameleon (mistakenly called lizard by everyone) who, already in the city, adopts the name of Rango, eventually being promoted sheriff. As such, he will have to deal with bandits, protect the already scarce water supplies and find out what happened to these supply. Overall, the story is quite satisfying and has its merits. The film is neither too childish nor overly tiring for adults, I felt there was enough material to appeal to a wide range of age groups.\r\n\r\nDirected by Gore Verbinsky, the film has a very pleasant pace, despite being a little longer than most animated films, which almost never exceed 90 minutes. In addition to really beautiful and well-executed cinematography, with good lighting and good use of color, the film has the best digital animation, clearly evident in the details of the buildings, the characters and the environment in which they move. The issue of water, and its importance, was not wrongly thought either, and it seems increasingly relevant in the times we live in… you don't have to live in the desert to feel the lack of drinking water. The soundtrack also deserves a special mention for its relevance and quality, with melodies that alternate between epic, western and Latin-Mexican.\r\n\r\nFinally, a note of appreciation for the quality of the voice actors and the work they did together: Johnny Depp works very well with his voice in the main character, and he still plays another character, in another vocal timbre. Isla Fisher, Abigail Breslin, Bill Nighy, Ned Beatty and Alfred Molina are all in great shape here.", "created_at": "2022-09-06T05:21:43.590Z"}]