[{"movie_id": 4327, "review_id": "5e206879f04d0100150fc6e5", "author_rating": 5.0, "review_text": "Charlie’s Angels is a heavenly paradise for inexcusably camp charades. Adapting classic television series into a feature film was becoming a common trend in the early part of this century. But maintaining the aesthetic appeal of its source material is often blurred with the requirement of targeting mass mainstream audiences. Would viewers of the original Charlie’s Angels watch a film continuation? Most likely not. So the legendary (and I use that adjective lightly...) McG decided to go full Hollywood, embracing action spy thrillers that came before, and produced one of the campiest guilty pleasures of all time. \r\n\r\nCan I describe the plot? Absolutely not. It’s thinner that Diaz’ lip fillers and needless botox. Three “Angels” who privately work for a millionaire are assigned a task in investigating technology giant Red Star. Stuff happens, a predictable plot twist unravels and the booming soundtrack of The Prodigy and Fat Boy Slim illuminate my ears. \r\n\r\nLet me start by saying I love Charlie’s Angels. I love it! It’s a film I hold very close to my heart, and a crucial element to my childhood. Probably a reasoning for my raging homosexuality, let’s be honest. I mean Barrymore, Diaz and Liu kicking a “creepy thin man” repeatedly wearing tight leather costumes in ‘Matrix’-stylised slow motion whilst working together as a cohesive unit of female empowerment!? Just lay me to rest, now! Give me a slice of that angel cake and let me never lose that heavenly flavour. \r\n\r\nYet, the amateur critic inside me just cannot classify this film as “good”. Why? Well, because it’s not. And it’s that ever-growing conflict between biased favouritism and legitimate critiquing that has me torn inside. Firstly, the plot is a mess. To the point where the story is a secondary product to the action set pieces and humorous dance sequences. When talented actors, such as Rockwell, are crucial aspects to this afterthought, it unfortunately wastes their efforts. The frantic editing prevents a natural flow of events, including the extravagant action, that anchors these angels. They are unable to spread their wings and fly.\r\n\r\nA dire shame considering the undeniable chemistry between the lead actresses, each harnessing a unique personality that allows their characters to connect as a team. Diaz is the ditzy dance queen, shaking her tush on Soul Train. Barrymore is the rebellious punk, sticking her middle finger up to everyone. Liu is the intellectual well-mannered lady, riding horses and piloting space rockets. They each add enough humour to come together seamlessly. Essentially, I live for them. The dialogue is cheesy and contagious, if ridiculously vacuous in subject matter. And the constant use of the same songs, namely “Heaven” and “Smack My B**** Up!”, lacked variety. Despite my internal love for The Prodigy and Fat Boy Slim. \r\n\r\nAs far as guilty pleasures go, Charlie’s Angels is up there for me. It’s poorly directed and woefully written, but I cannot deny my adoration for this campy beast. Unfortunately it doesn’t surpass the ultimate guilty pleasure ‘Lara Croft: Tomb Raider’, even after all these years...", "created_at": "2020-01-16T13:43:21.998Z"}, {"movie_id": 4327, "review_id": "6453c99933ad8f01380d8ea4", "author_rating": 8.0, "review_text": "Not the greatest fighters in this besides Lucy Liu. I really only liked the movie cause it was funny, and of course their sexy. That's pretty much it.", "created_at": "2023-05-04T15:04:57.613Z"}]