[{"movie_id": 400617, "review_id": "5a8432a70e0a2652ab00a5ca", "author_rating": null, "review_text": "Should you decide to visit your local cinema to take in a showing of Phantom Thread, Paul Thomas Anderson's latest offbeat character study, you might want to make a bit more effort with your wardrobe than you're accustomed to for such outings. After spending 130 minutes totally immersed in the world of 1950s high fashion, I felt like an utter rube walking out of the cinema in my jeans and hoody combo.\r\n\r\nPhantom Thread is as immersive as cinema gets. From its opening sequence, which takes us inside the House of Woodcock, a London fashion house run in quietly tyrannical fashion by renowned dressmaker Reynolds Woodcock (Daniel Day Lewis), Anderson's film dismisses any thoughts we might have of our own world of 2018. As we witness Reynolds go about his daily grooming routine it becomes clear we're watching a movie about a perfectionist, one made by a perfectionist, and starring a perfectionist in what is reputedly his final acting role.\r\n\r\nSet in his ways like a tree set in concrete, Reynolds knows what he likes, and he likes what he knows. As such, his relationships with the many admiring members of the opposite sex (the film is set at a time when no man was more attractive than one who made things; and if those things happened to make women feel beautiful, like Reynolds' gowns, all the better) rarely get past the following morning's breakfast, where idle chit chat and toast buttering irritate him to a laughably over the top degree.\r\n\r\nIt's during breakfast away from home, in a small country café, that Reynolds meets Alma (Vicky Krieps), a pretty Eastern European waitress who is won over by his flirtatious charm and accepts his invitation for a dinner date. The relationship blooms quickly and Reynolds invites her into his home, teaching her the ways of his trade.\r\n\r\nIt doesn't take long for Alma's ways to begin annoying the fiercely independent and somewhat narcissistic Reynolds, and her presence begins to disrupt his work - she's become an anti-muse! Reynolds' assumption that she will follow the other women in his past and leave quietly once exposed to his spoilt brat boorishness couldn't be more wrong however. Alma is determined to make the relationship work, even if she has to take extreme measures.\r\n\r\nRead the rest of Eric Hillis's review at http://www.themoviewaffler.com/2018/01/new-release-review-phantom-thread.html", "created_at": "2018-02-14T12:59:19.434Z"}, {"movie_id": 400617, "review_id": "5aa49f4ec3a3687c06017128", "author_rating": 2.0, "review_text": "I saw _Phantom Thread_ as part of a trio. We began watching this Oscar nominated movie at staggered intervals. I, from the beginning. The second, a half hour in. Then her partner, just past the half-way point. But all of us came to the same reaction when we'd been watching for what seemed like days only to realise there was still 30 minutes left: Lying on the cold, dirty floor, begging for it to end.\r\n\r\nPrepare for the most heterosexual thing I have ever said: We had to watch YouTube clips of Arnold Schwarzenegger movie-kills and then the whole original _Robocop_ as a palette cleanser after being forced to endure _Phantom Thread_. That's not hyperbole either, it felt genuinely necessary so that's what we did. I fear that we live in the world where something this pretentious is considered one of the best movies of the year.\r\n\r\n_Final rating:★ - Of no value. Avoid at all costs._", "created_at": "2018-03-11T03:15:26.636Z"}, {"movie_id": 400617, "review_id": "5ae4f0cfc3a3686f4300a217", "author_rating": 6.0, "review_text": "Probably the best, least biased documentary criticism of Jordan Peterson made thus far", "created_at": "2018-04-28T22:08:15.005Z"}]