[{"movie_id": 257445, "review_id": "56233480c3a3680e1600bf59", "author_rating": null, "review_text": "Well the Halloween season 2015 is upon us now and what better way than to cozy up to the youngsters at the box office than offering the innocuous tingly treat Goosebumps? The goofy-minded family-friendly frightfest does have the ingredients to muster up some interest for the little goblins out there looking for hearty rounds of boos and bumps. The question remains: does Goosebumps have the mindless macabre-related mayhem to sell its scatterbrained scary tactics to the trick-or-treat tykes looking for off-the-cuff jitters on the big screen?\r\n\r\nDirector Rob Letterman has armed the frivolous Goosebumps with aimless zaniness anchored on the nutty shoulders of the film’s leading kinetic kook Jack Black. Unfortunately, the loose presentation of combined live action and animation imagery put forth in Goosebumps seemed rather strained and misplaced. Sure, it is noted that Goosebumps reinforce a wackiness rooted in nonsensical hilarity…something considered safe and suitable for the kiddie crowd.  Nevertheless, Letterman’s breezy kiddie creepy caper–even with the free-spirited Jack Black at the helm–registers with a lameness that would have some demanding youths rolling their eyes  for something more hip and edgy.\r\n\r\nGoosebumps is from the imaginative mind of R.L. Stine who has authored the vastly popular children book series while selling millions of copies worldwide. Stine’s aforementioned Goosebumps book collection for young adults (YA) have led to a successful Saturday morning cartoon series as well. Now Sony Pictures Entertainment wants to capitalize on the craze and tap into the youngsters’ consciousness with outlandish Pied Piper Jack Black heading up the charge in this toothless tale of juvenile high jinks.\r\n\r\nOne would think that Goosebumps could up the ante a bit with the backers involved such as screenwriter Darren Lemke (“Jack the Giant Slayer”) from a story by Scott Alexander and Larry Karaszewski. Both Letterman and Black collaborated on the dud Gulliver’s Travels thus corrupting the Jonathan Swift literary masterpiece with their big screen bomb. Black, who stole the show with his mini-sized co-stars in School of Rock, would be an ideal choice to appear in another children-themed entry mired in outrageous fortune. Unfortunately, Goosebumps merely chalks up its sketchy existence in being a jumbled ball of flimsy foolishness while never really connecting solidly with a cohesive story that brings the frenzied proceedings together. Besides, what could Goosebumps the movie offer in freshness that the countless Stine books and animated program had not touched upon before in its adventurous skin? The answer: not very much.\r\n\r\nFor teenager Zach Cooper (Dylan Minnette, “Prisoners”) the transition in moving to the bedroom community of Madison, Delaware from the hustle and bustle of New York is quite a letdown. Zach’s recently widowed mother Gale (Amy Ryan) relocates for a new job offer and Zach has no choice but to accept his new less-than-stimulating surroundings. However, the one discovery that is about to make Zach a little more accepting of his new home is the pretty neighboring Hannah (Odeya Rush). The main obstacle that stands in the way of getting to know Hannah, sadly, is her over-protective father in stand-offish writer R.L. Stine (Black). The flustered Stine has some major issues with the creativity process when conceiving his characterizations.\r\n\r\nSoon Zach would have to join forces with the Stines and nerdy best buddy Champ (Ryan Lee,”Super 8″) when he accidentally unleashes R.L.’s monstrous creations onto the small unsuspecting town (it turns out that Stine’s fictitious beastly book protagonists are in fact real menaces come to life). Can Zach and company save the day as these bothersome pests roam the unprotected streets at will? Will Zach earn extra brownie points in winning Hannah’s heart as well as her reclusive father’s approval?\r\n\r\nIt is a mixed bag reception for the scattershot Goosebumps. On one hand many of the ardent followers of Stine’s written work will recognize the inclusion of some familiar notable villainous visitors that feature The Abominable Snowman of Pasadena, Revenge of the Gnomes and Werewolf of Fever Swamp (let’s not forget Slappy the evil ventriloquist too). Plus, some would consider it a bonus in having Black’s unflappable voice-over work earmarked for some of the standby monsters wreaking havoc in random fashion. The CGI special effects register with some semblance of awestruck momentum. Still, the manic moments piggyback one another and the cheap giggles, sight gags and punchy predicaments feel needlessly forced.\r\n\r\nStrangely, Black seems somewhat restrained as Robert Lawrence Stine. In fact, Jillian Bell’s off-the-wall Aunt Lorraine is more of an energetic comical force than the usually high-strung Black. Both Minnette’s Zach and Rush’s Hannah are somewhat serviceable as the Romeo-and-Juliet tandem but they could have played up their on-screen chemistry more charmingly than what was presented by them in inexplicable blandness. As for the supporting adult players they arbitrarily pop in and out without a chance to fully realize their contributions in this flimsy farce geared at the indiscriminate pee wees.\r\n\r\nPerhaps the tots will get a decent rise out of the jolly emptiness that is Goosebumps. As for the rest of us we will probably get a better result in sucking on last year’s recycled stale Halloween candy.\r\n\r\nGoosebumps (2015)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\nStarring: Jack Black, Dylan Minnette, Odeya Rush, Amy Ryan, Ryan Lee, Jillian Bell, Ken Marino, Halston Sage, M.L. Stine (cameo)\r\n\r\nDirected by: Rob Letterman\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Children’s Horror and Fantasy\r\n\r\nCritic’s Rating: ** stars (out of 4 stars)", "created_at": "2015-10-18T05:56:16.755Z"}, {"movie_id": 257445, "review_id": "57028f24c3a36856a5003379", "author_rating": 6.0, "review_text": "> Not a unique concept, but the rest were completely surprised me.\r\n\r\nTechnically, this was a another version of 'Jumanji', but a different universe. Originally it was not meant to be like that, because it was adapted from a series of children's book of the same name into a single movie. All the characters from the different books (book series) brought into one place, thus 'Jumanji' effect.\r\n\r\nWhen the fictional book characters come into the life, a group of youngsters team up to save the town from invasion. A tale that takes place in one day, especially most of the narration was a one night adventure. Totally an unexpected movie, but still not a masterpiece than just entertaining product. Maybe the actors were the reason, especially inclusion of Jack Black was the turn out. His second collaboration with the director after 'Gulliver's Travels'. And not to forget the CGI work was very acceptable for a little production like this.\r\n\r\nThis theme was a very old, but the characters were unique. Maybe it was a box office lucky, but people won't simply acknowledge for useless things. This film's success was the effort of hard work. I won't surprise if they decide to make a sequel. I meant the same team, not the lower grade filmmakers and actors.\r\n\r\n6½/10", "created_at": "2016-04-04T15:58:28.426Z"}, {"movie_id": 257445, "review_id": "585fb51192514115cf01cb44", "author_rating": 7.0, "review_text": "She's locked in this house and her dad's a psychopath.\r\nI have to say that being British born and bred I'm not at all familiar with Goosebumps, either the books or TV series etc, so I was going into this film blind as it were. With that in mind I'm not really able to review to fans of the original works.\r\n\r\nI went in with the hope of a good time, I liked the sound of the concept, I like Jack Black and I knew it was going to be well produced and no doubt heavily laden with the latest technological effects (ironically I had watched the splendid Jason and the Argonauts prior to Goosebumps, from one extreme to another or what?!).\r\n\r\nI got everything I expected and had fun without any frame of reference. If I wanted any more I could dig out some questions that would need to be answered, but why bother. I left at the end, as a middle aged film lover, contented. I would for sure keenly watch any sequel if it surfaces.\r\n\r\nDidn't do much for my Automatonophobia though... 6.5/10", "created_at": "2016-12-25T12:01:21.057Z"}, {"movie_id": 257445, "review_id": "5c447f370e0a266d6bd37e23", "author_rating": 4.0, "review_text": "I loved the _Goosebumps_ books (and less so, but still, the TV show) when I was growing up. I think if a kid watches this weird interpretation now, at the age that I was then, they might enjoy it. But for me? It didn't work. I actually did appreciate more than I thought I would, but based on the trailers my expectations were **abysmally** low, so that's not exactly saying much.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-01-20T14:01:27.204Z"}, {"movie_id": 257445, "review_id": "5c447f379251412bf6de12b7", "author_rating": 4.0, "review_text": "I loved the _Goosebumps_ books (and less so, but still, the TV show) when I was growing up. I think if a kid watches this weird interpretation now, at the age that I was then, they might enjoy it. But for me? It didn't work. I actually did appreciate more than I thought I would, but based on the trailers my expectations were **abysmally** low, so that's not exactly saying much.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2019-01-20T14:01:27.874Z"}, {"movie_id": 257445, "review_id": "6468bb872bcf6700e3ba9159", "author_rating": 8.0, "review_text": "I use to be into goosebumps as a kid. Love the show too. I have to admit this was an awesome movie.", "created_at": "2023-05-20T12:22:31.621Z"}]