[{"movie_id": 257344, "review_id": "561a102c9251415d3100163b", "author_rating": null, "review_text": "Nostalgia can be something to revisit as a decent form of escapism from one’s current worries. It feels so refreshing to turn back the hands of time and recall all the wonderful memories and perks of our younger days and, what is not to consider about the days gone by when reminiscing about certain trends in music, fashion, entertainment or past relationships? For this particular theme regarding director Chris Columbus’s tepid comedy ‘Pixels’, the focus pays homage to the old school pastime of video games. Sure, ‘Pixels’ tries to recapture the glory days of 80s video game mania and wrap it into an off-kilter disaster comedy that awkwardly borrows heavily from another 80s iconic big screen laugher we affectionately recognize as ‘Ghostbusters’. Instead, the clunky ‘Pixels’ is nothing more than an updated poor man’s version of the aforementioned ‘Ghostbusters’ with little distinctive spark or  imagination to accompany the empty zaniness. This latest lame and recycled Adam Sandler-led vehicle should come with the familiar message that is flashed at every conclusion of a video game: Game Over!\r\n\r\nEvery formulaic bone in the body of ‘Pixels’ is fragile because the movie really does not strive for anything sensational outside of its ambitious special effects wizardly. One can somewhat appreciate the few outlandish moments that garner a chuckle here and there but for the most part ‘Pixels’ suffers from transparent character developments that take a backseat to the incidental mayhem that persists.\r\n\r\nThe good news is that ‘Pixels’ is one of the few Sandler-branded films that one could actually stomach without resorting to the usual eye-rolling exasperation. Still, that is not saying very much nor is this what one might call a glowing endorsement neither. Screenwriters Tim Herlihy and Timothy Dowling manage to adequately stuff enough throwback reminders to the heyday of 80s-era frivolity regarding video game fever and the baby-boomers (and strangely enough youngsters and young adults) will probably relish the reminiscent goofiness of the period. The need to mesh the sentimental fixation of video games with the reliable foundation of disaster flicks that still reign supreme in today’s popcorn cinema scene is challenging yet ‘Pixels’ just does not have the convincing giddy-minded gumption to pull off such a free-wheeling stunt.\r\n\r\nAs many may proudly admit their hours-long odyssey into video arcades where brain cells were bombarded by exceptional gaming skills, we come across a selection of a former (and some may even say current) ‘nerd herd’ of gifted gamers that were resourceful back in the day when their fierce video game acumen was something not to mess with at all. Leading the pack of players that were previously involved in the 1982 World Videogame Championship competition is Sam Brenner (Adam Sandler), a slacker that has done nothing productive with his adult life since the notable achievement of being a runner-up at the WVC competition as a child. The champ, whose title was earned at Sam’s expense, is Eddie ‘The Fire Blaster’ Plant (Peter Dinklage). Rounding out the trio is game-playing expert and conspiracy-seeking ace Ludlow Lamonsoff (Josh Gad). Oh yeah…let’s not forget their mutual friend Will Cooper (Sandler’s comedy best buddy Kevin James) who just happens to be the President of the United States. How convenient, huh?\r\n\r\nWell, the expertise of the video-playing ‘fearsome threesome’ will come into being handy when a misinterpreted recording of a video game competition recovered in space by perturbed aliens sets off the threatening agenda for these space invaders to conquer the arrogant earthlings. After all, the taped recording ruffled the feathers of the aliens so the planet Earth needs to be challenged for the rights to claim planetary property. So the question remains: can the uninspired electronics-installing Sam, the cocky-minded Eddie and paranoid puss Ludlow defend our world and use their gaming prowess to outwit, outplay and outlast the aliens as a high stakes game is proposed for ownership of the planet?\r\n\r\nSome may dismiss ‘Pixels’ as a serviceable, quirky comedy that has a unique spirit onto its own. It does have its inserted nuttiness at various spurts. However, the overall presentation feels utterly choppy and the whole premise about these past gaming misfits returning to their childhood glory to rescue mankind through their glorified hobby comes off as manufactured, clumsy-minded campiness. There is nothing about ‘Pixels’ that screams originality besides being a faceless ‘Ghostbusters’ knock-off but with familiar video game branding (the gigantic Pac Man-eating creature comes to mind as he tries to swallow the entire metropolitan region). This frenzy-minded fable seems strained for canned laughs.\r\n\r\nSandler, although not as nearly obnoxious and grating on the nerves as he is in some of his other monotonous vehicles, seems to be sleep-walking in his role as the redemptive Sam looking for that second chance to come out as victorious to undermine his otherwise mundane existence. The breath-taking Michelle Monaghan, playing Sam’s shapely military protocol pop tart of a girlfriend Violet van Patten, is on hand to remind us that even labelled ‘losers’ that like to push gaming buttons on a console can get the last laugh in coming out feeling lucky. Monaghan’s Violet being Sam’s glamorous galpal and James’s Cooper as Sam’s Commander-in-Chief pal is probably the most outlandish and funny element about ‘Pixels’ to legitimately digest at this point. Gad is a mixed bag as the oafish Ludlow often opining for his indifferent pixel princess Lady Lisa (Ashley Benson). Dinklage steals the show as Eddie, a diminutive dynamo that is big on showy confidence within his small frame.\r\n\r\nIt is safe to say that the insanely amusing Bill Murray and his crew of ghost-busting goof-offs need not to lose any sleep over over the perfunctory put-on that is Sandler and company in the slight and forgettable silliness of ‘Pixels’. One might want to save their roll of quarters and wash a load of dirty laundry as opposed to playing a do-or-die game of ‘Donkey Kong’ with these video game vagabonds.\r\n\r\nPixels (2015)\r\n\r\nSony Pictures\r\n\r\n1 hr. 45 mins.\r\n\r\nStarring: Adam Sandler, Michelle Monaghan, Peter Dinklage, Josh Gad, Kevin James, Brian Cox, Matt Linz and Sean Bean\r\n\r\nDirected by: Chris Columbus\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comedy/Fantasy/Video Game Action & Adventure\r\n\r\nCritic’s Rating: * 1/2 stars (out of 4 stars)", "created_at": "2015-10-11T07:30:52.506Z"}, {"movie_id": 257344, "review_id": "563a4a91925141439c002d62", "author_rating": 7.0, "review_text": "> I enjoyed it because it reminded me my childhood.\r\n\r\nThere are plenty of movies related to the video games. The 80s movie 'Tron' was one of those first I have seen, followed by many. But the recent one 'Wreck-it Ralph' was the game changer in the modern animation/CGI which led to another similar flick, 'The Lego Movie'. Lego and 'Toy Story' are the toys, not the video games, but very close to this theme and I'm very happy that Hollywood made this film for the guys like me who grew up playing them.\r\n\r\nThe film had a very simple story with the great visuals. Sometimes simple is very good rather going for hi-tech. Especially those who played these games in their middle-age back in the 80s could be now very old and they might suffer to understand the film due to the technology/terms/phrase gap, if it matched to the todays hi-tech hi-resolution video games. But the youngsters of the present era didn't understand that who are the backbone of any movie's success and that's why this movie sunk in the ocean of criticism.\r\n\r\nMy childhood and teenage was the late 90s and early 00s respectively, So 8bit games are on the edge of revolution. My favourites were the races and brick games, especially 'Duck Hunt', because I get a gun, not joystick. So this movie really brought me those sweet memories. A decade ago I used those unique sounds and music for message alerts in my 2G mobile phone(s).\r\n\r\nI know recently Sandler had hit the rock bottom in his acting career, but, he's kind of lifted after the decent film 'The Cobbler' and excellent multistarrer 'Men, Women & Children'. This is not a massive comeback to what he's known for, comedies. But, sailing on average or above in better than falling downward in the career graph. To me this film was a better one, an above average, obviously not a masterpiece.\r\n\r\nGuest appearances were unexpected, but was not that effective, except Ashley Benson, who was so hot in her 2-3 odd minutes. This film is not for everyone. Youngsters and oldsters never understand it. If you were born in the 70s and 80s, then probably you will know what to expect. Even it does not deliver to your expectation, definitely gives satisfaction for bringing those lost memories of our childhood.\r\n\r\n7/10", "created_at": "2015-11-04T18:12:33.225Z"}, {"movie_id": 257344, "review_id": "63b241e1875d1a00e274f752", "author_rating": 7.0, "review_text": "**Pixels is another dumb, fun Adam Sandler film that doesn’t deserve all the hate. If you like Sandler movies, this is a good one.**\r\n\r\nI have seen this movie on so many “Worst of all time” lists, and it does not belong there. It’s an Adam Sandler movie, so that should give you an idea of what to expect - a goofy comedy with some absurd characters doing something ridiculous. And I’m here for it! I enjoy Sandler movies, and I really enjoyed this one. The characters were funny. The plot entertained. The effects worked with the 80s video game idea. Sandler and James are always a fun duo, and adding Gad and Dinklage cranked up the laughs. Michelle Monaghan was a good fit and knew how to play with the boys in this outrageous film. I’m not saying Pixels should win an Oscar, but it’s fun to watch and laugh with the family, especially if you’re a fan of other Sandler films.", "created_at": "2023-01-02T02:30:57.848Z"}]