[{"movie_id": 169881, "review_id": "63b0a948875d1a007d6e3ac7", "author_rating": 8.0, "review_text": "**It's a good movie, it entertains its audience well, but it's riddled with small historical errors that could easily have been corrected.**\r\n\r\nFilms about medieval times are always nice to watch, especially for me, who have a great affection for this historical period, about which I did a specialization as a historian. Unfortunately, and as happens regularly, this movie is full of mistakes.\r\n\r\nThe script is quite good, from an entertainment point of view: an English orphan who is raised and trained by an itinerant barber acquires a great fascination for medicine and for the ability to cure illnesses and physical ailments. However, he is aware that he knows very little, and that his master knows even less, and this awareness becomes clearer when he lives with Jewish doctors who learned his art in the East. So he decides to disguise himself as a Jew and travel to Persia in order to be admitted as a pupil of a master physician, Ibn Sina.\r\n\r\nFor those who don't know, the film is partly based on real facts and characters: Ibn Sina, for example, really existed and entered the history of medicine with his Westernized name: Avicenna. It is also true that the Arabs had, during this period (the so-called Year A Thousand), a much more advanced scientific knowledge than the Christians, and the Jews, who had a certain ease in circulating between the two worlds (East and West), ended up developing a particular vocation for science and medicine, which was later used in the West, especially in times of greater religious tolerance.\r\n\r\nUnfortunately, many things in the film (particularly the details) don't make sense: it would be a bit difficult for a Christian without much education to disguise himself as a Jew without being recognized and “unmasked”, nor would it be so easy to make a journey from the British Isles to the heart of Persia, although it would not be impossible. It would be impossible, however, to see the Persians of the year 1000 celebrating something with fireworks, since this technology only reached that culture two hundred years later. Modern notions of sorcery and necromancy would also only emerge from the 13th century onwards, and the Church never burned anyone, it declared the defendant a heretic and handed him over to civil justice, which (that one) could burn him or not. Even more egregious was the mistake of including in the film an epidemic of bubonic plague before the 14th century, when the disease historically appeared. And even though the Shah did exist, and the Seljuks were indeed a threat in the region during the time period depicted, we would never have seen Muslims prostrate themselves to the Shah because they simply won't. There are still other errors: the Tower of London, which appears at the end of the film, was only built a hundred years later and would not have the appearance of the current building until, at least, the 16th century. Don't get me wrong, the movie is worth it even with these problems. What we have to understand is that this is not a documentary and things were not exactly as they are portrayed.\r\n\r\nThomas Payne is quite good in the lead role and does a good job as an actor, even if he is sometimes overshadowed by the impressive and charismatic performances of colleagues like Stellan Skarsgard or Ben Kingsley, two actors who are in excellent shape and who give us truly committed performances. and interesting. Emma Ribgy has also done a good job, but has relatively little to do.\r\n\r\nTechnically, the film has good cinematography and good sets and costumes. They're not especially accurate from a historical point of view, but they're aesthetically well done. The CGI is reasonably good and works well, if not very realistic. The soundtrack didn't particularly convince or please me, but the visual and sound effects are good. The pace is also quite good, and despite the film being relatively long, you hardly feel the time passing.", "created_at": "2022-12-31T21:27:36.620Z"}]