[{"movie_id": 593643, "review_id": "63553f72880c92007e709310", "author_rating": 4.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"The Menu is one of the biggest personal disappointments of the year.\r\n\r\nMark Mylod's film boasts inspired performances by the entire cast - Ralph Fiennes and Nicholas Hoult stand out - and some clever satirical moments, but pretty much nothing else works. Humor falls completely flat - except for the sequences à la Masterchef Australia. Screenplay follows surprisingly generic paths, being a mystery without any minimally impactful shock. Characters lack depth, and the anti-elite message is too evident and insignificant.\r\n\r\nIt should still get an overall positive reception.\"\r\n\r\nRating: C-", "created_at": "2022-10-23T13:19:46.443Z"}, {"movie_id": 593643, "review_id": "637b437d976e4800b4563113", "author_rating": 7.0, "review_text": "Arch-foodie \"Tyler\" (Nicholas Hoult) and his girlfriend \"Margot\" (Anya Taylor-Joy) are off to dine in a restaurant without parallel. Based on an island of just twelve acres, they join a collection of wealthy and influential people for what has been defined as experience to die for! Upon arrival, we discover that \"Margot\" was not the originally intended guest of her companion - so first question... Who is she? Next question - why does it seem to matter so much to the fastidious and frankly rather menacing chef \"Slowik\" (Ralph Fiennes) and his assistant \"Elsa\" (Hong Chau) who looks like she used \"Rosa Klebb\" as a role model? As the dinner progresses it becomes quite clear that the menu is not just about the exquisitely prepared and presented food, but is also about an appraisal of the individually selected - and none too savoury - staff and clientele, none of who are quite what they seem! This has something of Agatha Christie's \"Ten Little Indians\" to it, and it quite effectively pokes fun at the supercilious and frequently rather pompous attitude of both those cooking and those eating (or experiencing) fine foam dining. That humour is dark and potent, too. Fiennes is entirely convincing and Hoult, as well as Janet McTeer as the self-important food critic \"Lillian\" and Paul Adelstein as her suitably obsequious companion \"Ted\" contribute well as the sense of the ridiculous evolves into one considerably more perilous. It could have evolved just a bit more quickly for me - there are certainly enough \"get on with it\" moments and though ATJ's character is feisty, it doesn't quite work and ultimately served to illustrate the increasing implausibility of the story and unlikely servility of the diners as we head towards an almost Vernean denouement. It is quirkily entertaining this - a well presented, multi-layered, attack on our own senses that is better second time around. Not perfect, but I suspect Michelin would love it.", "created_at": "2022-11-21T09:23:09.435Z"}, {"movie_id": 593643, "review_id": "637ce42d07faa200b1d61988", "author_rating": 5.0, "review_text": "**The Menu began with a tone and tension that made me want more but ultimately ended with confusion and disappointment.**\r\n\r\nThe hype for The Menu intrigued me. The reviews celebrated its genius. So I had to see it. And when I sat in the theater and the credits began to roll, all o could say was, \"Huh?\" The Menu starts with Ready or Not vibes with a fish-out-of-water real-world character who ends up at a fancy dinner with a collection of high society foodies and critics. The trailer gave me expectations of cannibalism cult or Most Dangerous Game-type plots, but instead, nothing really happened. I think I understood what The Menu was trying to convey with its deeper meaning, but I still came up disappointed. Anya Taylor-Joy and the rest of the cast gave great performances, but there was little that really brought the movie together. Maybe the subversion of the cannibal or hunting expectation was the movie's brilliance? The Menu definitely tried to be clever, but whether it was or not might be open to interpretation. Ironically, I sat through the whole movie and left wanting more… left hungry.", "created_at": "2022-11-22T15:01:01.477Z"}, {"movie_id": 593643, "review_id": "63813298fb834600876f20ee", "author_rating": 9.0, "review_text": "_The Menu_ was one of the most unique thriller experiences of the year! The setup is fantastic, and the story gives you just enough information to intrigue even though the story path is somewhat generic. It is dark, honest, and quite hilarious. This unique blend created a thriller like no other.\r\n\r\nThe performances were great. Anya Taylor-Joy was brilliant and is cementing herself as one of the best actresses of the decade. Nicholas Hoult was hilarious in such a subtle way that never takes away from the tense scenes at play. Ralph Fiennes is haunting but also sympathetic, making him a very interesting and genuine antagonist.\r\n\r\nThis was such an amazing film and another smash entry into horror palooza that is 2022.\r\n\r\n**Score:** _86%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-11-25T21:24:40.073Z"}, {"movie_id": 593643, "review_id": "63b60ba25ad76b00e6faf9fd", "author_rating": 7.0, "review_text": "Pretty good but I'm also a little disappointed by it. I really liked the cast and the acting (Nicholas Hoult and Ralph Fiennes were especially good). The story was entertaining enough but I didn't quite buy into it all. It's not as sharp or smart as it could be. It may be that I recently watched \"Triangle of Sadness\" and really enjoyed the humour and observations on the rich in that film and \"The Menu\" doesn't quite reach these heights in my opinion. It's still worth watching, with some good reveals and surprises throughout.", "created_at": "2023-01-04T23:28:34.553Z"}, {"movie_id": 593643, "review_id": "63b87d767352050087ebb569", "author_rating": 5.0, "review_text": "\"You, Margot from Nebraska (Anya Taylor-Joy), you've betrayed our sacred bond of trust. And you've shown your craft to be careless. I was wrong. You're an eater. You're a taker. You're very hard to look at. And you're no Julia Roberts.\"", "created_at": "2023-01-06T19:58:46.310Z"}, {"movie_id": 593643, "review_id": "63bc8acfae6f093cb9df0144", "author_rating": 9.0, "review_text": "> **Jim Jones; Executive Chef**\r\n\r\nGoing to a once-in-a-lifetime tasting at a restaurant headed by one of (if not _the_) most renowned chefs in the world sounds like a dream come true to any foodie. (Myself included, albeit vicariously via the Food Network) Two of these lucky guests are Tyler (played by **Nicholas Hoult**), and Margot (played by **Anya Taylor-Joy**).\r\n\r\nThe issue is, something is already not right.  No, it's not obvious; at least not to normal people like you and me. Elsa (played by **Hong Chau**) picked up on it, but she isn't like us.  As more and more guest arrive, someone isn't supposed to be there... Ah, don't worry, the feeling will pass.  After all, the tasting is just about to start...\r\n\r\nThis is when we meet the executive chef, Chef Slowik (brilliantly played by **Ralph Fiennes**).  At first he is charismatic and prepares his guest for each tasting with stories. But this little cult like bigrade eventually let on that they know more about their guests than anyone should... That is except for one. \r\n\r\nAs someone who is enamored with the food world, seeing The Menu satire some of my favorite shows:\r\n\r\n* Netflix's Chef's Table with the course spotlight cinematography and ingredients cards.\r\n* Any Celebrity Chef (i.e. Chef Slowik calling someone a 'donkey', clearly a reference to Gordon Ramsey).  \r\n\r\n...I was delighted that this film leaned into the dark end of how service work can feel sometimes.  This film feels cathartic having lived the life of a service worker, and I feel others who have had that experience should be able to connect to the darker parts of the film as well. \r\n\r\nThe plot culminate in a theme that I think despite what mild morbidity was displayed, most watchers can relate; Be it society's expectations or our own, the more we push toward perceived greatness we run away from that childhood excitement that set up on the path to begin with. \r\n\r\nThe Menu as a whole, is, well... Something you might hear at an actual tasting: A story of life, it's memories (good and bad) told in 5 courses.  If you're part of the menu, you deserve to stay until the end... That is, unless your not supposed to be here; perhaps life hasn't beaten you down enough yet... In-any-case, there is always the _cool aid_.", "created_at": "2023-01-09T21:44:47.621Z"}, {"movie_id": 593643, "review_id": "63c08aa7df857c00814145b8", "author_rating": 7.0, "review_text": "The Menu is a film defined by one key ingredient, the performance of Ralph Fiennes. His cold, biting acerbic chef, whose every word and nuance expresses a certain irony and a gradually building threat, is compelling. \r\n\r\nFrankly, it was Fiennes lynch pin performance that kept me watching The Menu. Had it been a less actor, I might well have walked away. Which brings me to the script. A predictable idea, with a certain promise that's far too loosely executed. The result is a plot that has more than a few dead ends and lacks a certain consistency and credulity. Its not awful, not at all. That said, with a more consideration and tightening of plot elements, it could have been so much more. \r\n\r\nIn summary, if The Menu is remembered for anything, to my mind, it will be the remarkable performance handed in by Ralph Fiennes. The bulk of my 7/10 rating is based on his remarkable work. Regrettably, in most other respects, this film is somewhat forgettable, horror fare.", "created_at": "2023-01-12T22:33:11.592Z"}, {"movie_id": 593643, "review_id": "63c1f174df857c00d9c148e5", "author_rating": 1.0, "review_text": "This was my actual last straw with IMDb... I guess you have to like this one or else.  And by that I mean they are purging all the bad reviews.\r\n\r\nSo, this is a movie about pretentious people, for pretentious people, that are killed by pretentious people so they can walk away feeling deep.\r\n\r\nFrom the start you know what is going to happen, because it's basically the same thing that always happens on ominous deserted islands... and the \"they eat the diners\" thing was removed because one of the couples were regular diners there.\r\n\r\nIt sort of gives you only one plot direction made clear by the fanaticism of the cult of cooks.\r\n\r\nSo there wasn't any guess work that needed to be done, and from the start you knew which character was going to live because the broadcast that with a giant arrow pointing down at them.\r\n\r\nBut, hey, it's the modern audiance, nothing can be subtle today.", "created_at": "2023-01-14T00:04:04.245Z"}, {"movie_id": 593643, "review_id": "63d23ab066ae4d008c923cc4", "author_rating": 8.0, "review_text": "“The Menu” takes anti capitalism and serves it up with a sprinkle or two of violence delivered on a plate by a perfectionist, cult leading chef. Mark Mylod produces a horror comedy that takes shots at culinary snobbery as well as performance art. \r\n\r\nMargot ( Anya Taylor-Joy ) and her supposed boyfriend Tyler (Nicholas Hoult ) take a boat, along with a number of other diners, to a remote Restaurant called Hawthorn situated on a private Island. The restaurant’s avant garde head chef ( Ralph Fines ) sells both art and home grown, self produced food to a select group of high earning customers with quality and presentation far above any other culinary experience. As the guests arrive they are first subjected to a tour of the Island to see the produce used in Hawthorn being grown and sea food being gathered. Once seated in the restaurant the food begins to be served along with a story from head chef outlining the dish and its significance to the overall experience.  Before the final course is served the stories become darker and more extreme culminating in the diners becoming fearful for their own lives.  \r\n\r\nBefore we reach the final course one sous chef announces that the menu requires “ an ending that ties everything together conceptually”. At this point in the proceedings it becomes clear that the restaurant staff are very much following the direction of their head chef without question, much in the way followers of any cult leader react.  “The Menu” is very unsettling and produces some uneasy, grimacing moments but balances them out well with enough humour and satire to make for a rather enjoyable experience.", "created_at": "2023-01-26T08:32:48.871Z"}, {"movie_id": 593643, "review_id": "64367cc7fd4f800077d38607", "author_rating": 3.0, "review_text": "This movie is not nearly as clever as it thinks it is. Without giving anything away, the plot is a unique one and the main villain's motivation is original, but the movie spoils everything by treating the audience like idiots.\r\n\r\nOne example (and this _is_ a spoiler, albeit a small one, so skip this paragraph if you still want to watch the movie) is when one character gets his finger chopped off. This was because he told his wife he was going to 'handle' the situation, and one of the baddies responded by asking 'with which hand?' When he didn't reply, she said 'left hand, ring finger' and one of the other baddies proceeded to chop said finger off.\r\n\r\nNow that all sounds very clever (handle/hand - what a pun!) if you don't think about it too much, but if you _do_, you'll realize that the baddies had no way of knowing that that character was going to use the word 'handle', and yet removing his finger seemed to have been pre-planned. Were they going to do it anyway, and his use of the word was a lucky coincidence that allowed them to make a pun while doing it? Or in their meeting earlier, did they say \"at some point someone might use the word 'handle', at which point we're going to remove part of their hand\"? I don't know, and some of you might say I'm being pedantic, but this movie was _full_ of things like this. It really took me out of it. 3/10, wouldn't recommend.", "created_at": "2023-04-12T09:41:27.473Z"}, {"movie_id": 593643, "review_id": "63553f72880c92007e709310", "author_rating": 4.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"The Menu is one of the biggest personal disappointments of the year.\r\n\r\nMark Mylod's film boasts inspired performances by the entire cast - Ralph Fiennes and Nicholas Hoult stand out - and some clever satirical moments, but pretty much nothing else works. Humor falls completely flat - except for the sequences à la Masterchef Australia. Screenplay follows surprisingly generic paths, being a mystery without any minimally impactful shock. Characters lack depth, and the anti-elite message is too evident and insignificant.\r\n\r\nIt should still get an overall positive reception.\"\r\n\r\nRating: C-", "created_at": "2022-10-23T13:19:46.443Z"}, {"movie_id": 593643, "review_id": "637b437d976e4800b4563113", "author_rating": 7.0, "review_text": "Arch-foodie \"Tyler\" (Nicholas Hoult) and his girlfriend \"Margot\" (Anya Taylor-Joy) are off to dine in a restaurant without parallel. Based on an island of just twelve acres, they join a collection of wealthy and influential people for what has been defined as experience to die for! Upon arrival, we discover that \"Margot\" was not the originally intended guest of her companion - so first question... Who is she? Next question - why does it seem to matter so much to the fastidious and frankly rather menacing chef \"Slowik\" (Ralph Fiennes) and his assistant \"Elsa\" (Hong Chau) who looks like she used \"Rosa Klebb\" as a role model? As the dinner progresses it becomes quite clear that the menu is not just about the exquisitely prepared and presented food, but is also about an appraisal of the individually selected - and none too savoury - staff and clientele, none of who are quite what they seem! This has something of Agatha Christie's \"Ten Little Indians\" to it, and it quite effectively pokes fun at the supercilious and frequently rather pompous attitude of both those cooking and those eating (or experiencing) fine foam dining. That humour is dark and potent, too. Fiennes is entirely convincing and Hoult, as well as Janet McTeer as the self-important food critic \"Lillian\" and Paul Adelstein as her suitably obsequious companion \"Ted\" contribute well as the sense of the ridiculous evolves into one considerably more perilous. It could have evolved just a bit more quickly for me - there are certainly enough \"get on with it\" moments and though ATJ's character is feisty, it doesn't quite work and ultimately served to illustrate the increasing implausibility of the story and unlikely servility of the diners as we head towards an almost Vernean denouement. It is quirkily entertaining this - a well presented, multi-layered, attack on our own senses that is better second time around. Not perfect, but I suspect Michelin would love it.", "created_at": "2022-11-21T09:23:09.435Z"}, {"movie_id": 593643, "review_id": "637ce42d07faa200b1d61988", "author_rating": 5.0, "review_text": "**The Menu began with a tone and tension that made me want more but ultimately ended with confusion and disappointment.**\r\n\r\nThe hype for The Menu intrigued me. The reviews celebrated its genius. So I had to see it. And when I sat in the theater and the credits began to roll, all o could say was, \"Huh?\" The Menu starts with Ready or Not vibes with a fish-out-of-water real-world character who ends up at a fancy dinner with a collection of high society foodies and critics. The trailer gave me expectations of cannibalism cult or Most Dangerous Game-type plots, but instead, nothing really happened. I think I understood what The Menu was trying to convey with its deeper meaning, but I still came up disappointed. Anya Taylor-Joy and the rest of the cast gave great performances, but there was little that really brought the movie together. Maybe the subversion of the cannibal or hunting expectation was the movie's brilliance? The Menu definitely tried to be clever, but whether it was or not might be open to interpretation. Ironically, I sat through the whole movie and left wanting more… left hungry.", "created_at": "2022-11-22T15:01:01.477Z"}, {"movie_id": 593643, "review_id": "63813298fb834600876f20ee", "author_rating": 9.0, "review_text": "_The Menu_ was one of the most unique thriller experiences of the year! The setup is fantastic, and the story gives you just enough information to intrigue even though the story path is somewhat generic. It is dark, honest, and quite hilarious. This unique blend created a thriller like no other.\r\n\r\nThe performances were great. Anya Taylor-Joy was brilliant and is cementing herself as one of the best actresses of the decade. Nicholas Hoult was hilarious in such a subtle way that never takes away from the tense scenes at play. Ralph Fiennes is haunting but also sympathetic, making him a very interesting and genuine antagonist.\r\n\r\nThis was such an amazing film and another smash entry into horror palooza that is 2022.\r\n\r\n**Score:** _86%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-11-25T21:24:40.073Z"}, {"movie_id": 593643, "review_id": "63b60ba25ad76b00e6faf9fd", "author_rating": 7.0, "review_text": "Pretty good but I'm also a little disappointed by it. I really liked the cast and the acting (Nicholas Hoult and Ralph Fiennes were especially good). The story was entertaining enough but I didn't quite buy into it all. It's not as sharp or smart as it could be. It may be that I recently watched \"Triangle of Sadness\" and really enjoyed the humour and observations on the rich in that film and \"The Menu\" doesn't quite reach these heights in my opinion. It's still worth watching, with some good reveals and surprises throughout.", "created_at": "2023-01-04T23:28:34.553Z"}, {"movie_id": 593643, "review_id": "63b87d767352050087ebb569", "author_rating": 5.0, "review_text": "\"You, Margot from Nebraska (Anya Taylor-Joy), you've betrayed our sacred bond of trust. And you've shown your craft to be careless. I was wrong. You're an eater. You're a taker. You're very hard to look at. And you're no Julia Roberts.\"", "created_at": "2023-01-06T19:58:46.310Z"}, {"movie_id": 593643, "review_id": "63bc8acfae6f093cb9df0144", "author_rating": 9.0, "review_text": "> **Jim Jones; Executive Chef**\r\n\r\nGoing to a once-in-a-lifetime tasting at a restaurant headed by one of (if not _the_) most renowned chefs in the world sounds like a dream come true to any foodie. (Myself included, albeit vicariously via the Food Network) Two of these lucky guests are Tyler (played by **Nicholas Hoult**), and Margot (played by **Anya Taylor-Joy**).\r\n\r\nThe issue is, something is already not right.  No, it's not obvious; at least not to normal people like you and me. Elsa (played by **Hong Chau**) picked up on it, but she isn't like us.  As more and more guest arrive, someone isn't supposed to be there... Ah, don't worry, the feeling will pass.  After all, the tasting is just about to start...\r\n\r\nThis is when we meet the executive chef, Chef Slowik (brilliantly played by **Ralph Fiennes**).  At first he is charismatic and prepares his guest for each tasting with stories. But this little cult like bigrade eventually let on that they know more about their guests than anyone should... That is except for one. \r\n\r\nAs someone who is enamored with the food world, seeing The Menu satire some of my favorite shows:\r\n\r\n* Netflix's Chef's Table with the course spotlight cinematography and ingredients cards.\r\n* Any Celebrity Chef (i.e. Chef Slowik calling someone a 'donkey', clearly a reference to Gordon Ramsey).  \r\n\r\n...I was delighted that this film leaned into the dark end of how service work can feel sometimes.  This film feels cathartic having lived the life of a service worker, and I feel others who have had that experience should be able to connect to the darker parts of the film as well. \r\n\r\nThe plot culminate in a theme that I think despite what mild morbidity was displayed, most watchers can relate; Be it society's expectations or our own, the more we push toward perceived greatness we run away from that childhood excitement that set up on the path to begin with. \r\n\r\nThe Menu as a whole, is, well... Something you might hear at an actual tasting: A story of life, it's memories (good and bad) told in 5 courses.  If you're part of the menu, you deserve to stay until the end... That is, unless your not supposed to be here; perhaps life hasn't beaten you down enough yet... In-any-case, there is always the _cool aid_.", "created_at": "2023-01-09T21:44:47.621Z"}, {"movie_id": 593643, "review_id": "63c08aa7df857c00814145b8", "author_rating": 7.0, "review_text": "The Menu is a film defined by one key ingredient, the performance of Ralph Fiennes. His cold, biting acerbic chef, whose every word and nuance expresses a certain irony and a gradually building threat, is compelling. \r\n\r\nFrankly, it was Fiennes lynch pin performance that kept me watching The Menu. Had it been a less actor, I might well have walked away. Which brings me to the script. A predictable idea, with a certain promise that's far too loosely executed. The result is a plot that has more than a few dead ends and lacks a certain consistency and credulity. Its not awful, not at all. That said, with a more consideration and tightening of plot elements, it could have been so much more. \r\n\r\nIn summary, if The Menu is remembered for anything, to my mind, it will be the remarkable performance handed in by Ralph Fiennes. The bulk of my 7/10 rating is based on his remarkable work. Regrettably, in most other respects, this film is somewhat forgettable, horror fare.", "created_at": "2023-01-12T22:33:11.592Z"}, {"movie_id": 593643, "review_id": "63c1f174df857c00d9c148e5", "author_rating": 1.0, "review_text": "This was my actual last straw with IMDb... I guess you have to like this one or else.  And by that I mean they are purging all the bad reviews.\r\n\r\nSo, this is a movie about pretentious people, for pretentious people, that are killed by pretentious people so they can walk away feeling deep.\r\n\r\nFrom the start you know what is going to happen, because it's basically the same thing that always happens on ominous deserted islands... and the \"they eat the diners\" thing was removed because one of the couples were regular diners there.\r\n\r\nIt sort of gives you only one plot direction made clear by the fanaticism of the cult of cooks.\r\n\r\nSo there wasn't any guess work that needed to be done, and from the start you knew which character was going to live because the broadcast that with a giant arrow pointing down at them.\r\n\r\nBut, hey, it's the modern audiance, nothing can be subtle today.", "created_at": "2023-01-14T00:04:04.245Z"}, {"movie_id": 593643, "review_id": "63d23ab066ae4d008c923cc4", "author_rating": 8.0, "review_text": "“The Menu” takes anti capitalism and serves it up with a sprinkle or two of violence delivered on a plate by a perfectionist, cult leading chef. Mark Mylod produces a horror comedy that takes shots at culinary snobbery as well as performance art. \r\n\r\nMargot ( Anya Taylor-Joy ) and her supposed boyfriend Tyler (Nicholas Hoult ) take a boat, along with a number of other diners, to a remote Restaurant called Hawthorn situated on a private Island. The restaurant’s avant garde head chef ( Ralph Fines ) sells both art and home grown, self produced food to a select group of high earning customers with quality and presentation far above any other culinary experience. As the guests arrive they are first subjected to a tour of the Island to see the produce used in Hawthorn being grown and sea food being gathered. Once seated in the restaurant the food begins to be served along with a story from head chef outlining the dish and its significance to the overall experience.  Before the final course is served the stories become darker and more extreme culminating in the diners becoming fearful for their own lives.  \r\n\r\nBefore we reach the final course one sous chef announces that the menu requires “ an ending that ties everything together conceptually”. At this point in the proceedings it becomes clear that the restaurant staff are very much following the direction of their head chef without question, much in the way followers of any cult leader react.  “The Menu” is very unsettling and produces some uneasy, grimacing moments but balances them out well with enough humour and satire to make for a rather enjoyable experience.", "created_at": "2023-01-26T08:32:48.871Z"}, {"movie_id": 593643, "review_id": "64367cc7fd4f800077d38607", "author_rating": 3.0, "review_text": "This movie is not nearly as clever as it thinks it is. Without giving anything away, the plot is a unique one and the main villain's motivation is original, but the movie spoils everything by treating the audience like idiots.\r\n\r\nOne example (and this _is_ a spoiler, albeit a small one, so skip this paragraph if you still want to watch the movie) is when one character gets his finger chopped off. This was because he told his wife he was going to 'handle' the situation, and one of the baddies responded by asking 'with which hand?' When he didn't reply, she said 'left hand, ring finger' and one of the other baddies proceeded to chop said finger off.\r\n\r\nNow that all sounds very clever (handle/hand - what a pun!) if you don't think about it too much, but if you _do_, you'll realize that the baddies had no way of knowing that that character was going to use the word 'handle', and yet removing his finger seemed to have been pre-planned. Were they going to do it anyway, and his use of the word was a lucky coincidence that allowed them to make a pun while doing it? Or in their meeting earlier, did they say \"at some point someone might use the word 'handle', at which point we're going to remove part of their hand\"? I don't know, and some of you might say I'm being pedantic, but this movie was _full_ of things like this. It really took me out of it. 3/10, wouldn't recommend.", "created_at": "2023-04-12T09:41:27.473Z"}, {"movie_id": 593643, "review_id": "63553f72880c92007e709310", "author_rating": 4.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"The Menu is one of the biggest personal disappointments of the year.\r\n\r\nMark Mylod's film boasts inspired performances by the entire cast - Ralph Fiennes and Nicholas Hoult stand out - and some clever satirical moments, but pretty much nothing else works. Humor falls completely flat - except for the sequences à la Masterchef Australia. Screenplay follows surprisingly generic paths, being a mystery without any minimally impactful shock. Characters lack depth, and the anti-elite message is too evident and insignificant.\r\n\r\nIt should still get an overall positive reception.\"\r\n\r\nRating: C-", "created_at": "2022-10-23T13:19:46.443Z"}, {"movie_id": 593643, "review_id": "637b437d976e4800b4563113", "author_rating": 7.0, "review_text": "Arch-foodie \"Tyler\" (Nicholas Hoult) and his girlfriend \"Margot\" (Anya Taylor-Joy) are off to dine in a restaurant without parallel. Based on an island of just twelve acres, they join a collection of wealthy and influential people for what has been defined as experience to die for! Upon arrival, we discover that \"Margot\" was not the originally intended guest of her companion - so first question... Who is she? Next question - why does it seem to matter so much to the fastidious and frankly rather menacing chef \"Slowik\" (Ralph Fiennes) and his assistant \"Elsa\" (Hong Chau) who looks like she used \"Rosa Klebb\" as a role model? As the dinner progresses it becomes quite clear that the menu is not just about the exquisitely prepared and presented food, but is also about an appraisal of the individually selected - and none too savoury - staff and clientele, none of who are quite what they seem! This has something of Agatha Christie's \"Ten Little Indians\" to it, and it quite effectively pokes fun at the supercilious and frequently rather pompous attitude of both those cooking and those eating (or experiencing) fine foam dining. That humour is dark and potent, too. Fiennes is entirely convincing and Hoult, as well as Janet McTeer as the self-important food critic \"Lillian\" and Paul Adelstein as her suitably obsequious companion \"Ted\" contribute well as the sense of the ridiculous evolves into one considerably more perilous. It could have evolved just a bit more quickly for me - there are certainly enough \"get on with it\" moments and though ATJ's character is feisty, it doesn't quite work and ultimately served to illustrate the increasing implausibility of the story and unlikely servility of the diners as we head towards an almost Vernean denouement. It is quirkily entertaining this - a well presented, multi-layered, attack on our own senses that is better second time around. Not perfect, but I suspect Michelin would love it.", "created_at": "2022-11-21T09:23:09.435Z"}, {"movie_id": 593643, "review_id": "637ce42d07faa200b1d61988", "author_rating": 5.0, "review_text": "**The Menu began with a tone and tension that made me want more but ultimately ended with confusion and disappointment.**\r\n\r\nThe hype for The Menu intrigued me. The reviews celebrated its genius. So I had to see it. And when I sat in the theater and the credits began to roll, all o could say was, \"Huh?\" The Menu starts with Ready or Not vibes with a fish-out-of-water real-world character who ends up at a fancy dinner with a collection of high society foodies and critics. The trailer gave me expectations of cannibalism cult or Most Dangerous Game-type plots, but instead, nothing really happened. I think I understood what The Menu was trying to convey with its deeper meaning, but I still came up disappointed. Anya Taylor-Joy and the rest of the cast gave great performances, but there was little that really brought the movie together. Maybe the subversion of the cannibal or hunting expectation was the movie's brilliance? The Menu definitely tried to be clever, but whether it was or not might be open to interpretation. Ironically, I sat through the whole movie and left wanting more… left hungry.", "created_at": "2022-11-22T15:01:01.477Z"}, {"movie_id": 593643, "review_id": "63813298fb834600876f20ee", "author_rating": 9.0, "review_text": "_The Menu_ was one of the most unique thriller experiences of the year! The setup is fantastic, and the story gives you just enough information to intrigue even though the story path is somewhat generic. It is dark, honest, and quite hilarious. This unique blend created a thriller like no other.\r\n\r\nThe performances were great. Anya Taylor-Joy was brilliant and is cementing herself as one of the best actresses of the decade. Nicholas Hoult was hilarious in such a subtle way that never takes away from the tense scenes at play. Ralph Fiennes is haunting but also sympathetic, making him a very interesting and genuine antagonist.\r\n\r\nThis was such an amazing film and another smash entry into horror palooza that is 2022.\r\n\r\n**Score:** _86%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-11-25T21:24:40.073Z"}, {"movie_id": 593643, "review_id": "63b60ba25ad76b00e6faf9fd", "author_rating": 7.0, "review_text": "Pretty good but I'm also a little disappointed by it. I really liked the cast and the acting (Nicholas Hoult and Ralph Fiennes were especially good). The story was entertaining enough but I didn't quite buy into it all. It's not as sharp or smart as it could be. It may be that I recently watched \"Triangle of Sadness\" and really enjoyed the humour and observations on the rich in that film and \"The Menu\" doesn't quite reach these heights in my opinion. It's still worth watching, with some good reveals and surprises throughout.", "created_at": "2023-01-04T23:28:34.553Z"}, {"movie_id": 593643, "review_id": "63b87d767352050087ebb569", "author_rating": 5.0, "review_text": "\"You, Margot from Nebraska (Anya Taylor-Joy), you've betrayed our sacred bond of trust. And you've shown your craft to be careless. I was wrong. You're an eater. You're a taker. You're very hard to look at. And you're no Julia Roberts.\"", "created_at": "2023-01-06T19:58:46.310Z"}, {"movie_id": 593643, "review_id": "63bc8acfae6f093cb9df0144", "author_rating": 9.0, "review_text": "> **Jim Jones; Executive Chef**\r\n\r\nGoing to a once-in-a-lifetime tasting at a restaurant headed by one of (if not _the_) most renowned chefs in the world sounds like a dream come true to any foodie. (Myself included, albeit vicariously via the Food Network) Two of these lucky guests are Tyler (played by **Nicholas Hoult**), and Margot (played by **Anya Taylor-Joy**).\r\n\r\nThe issue is, something is already not right.  No, it's not obvious; at least not to normal people like you and me. Elsa (played by **Hong Chau**) picked up on it, but she isn't like us.  As more and more guest arrive, someone isn't supposed to be there... Ah, don't worry, the feeling will pass.  After all, the tasting is just about to start...\r\n\r\nThis is when we meet the executive chef, Chef Slowik (brilliantly played by **Ralph Fiennes**).  At first he is charismatic and prepares his guest for each tasting with stories. But this little cult like bigrade eventually let on that they know more about their guests than anyone should... That is except for one. \r\n\r\nAs someone who is enamored with the food world, seeing The Menu satire some of my favorite shows:\r\n\r\n* Netflix's Chef's Table with the course spotlight cinematography and ingredients cards.\r\n* Any Celebrity Chef (i.e. Chef Slowik calling someone a 'donkey', clearly a reference to Gordon Ramsey).  \r\n\r\n...I was delighted that this film leaned into the dark end of how service work can feel sometimes.  This film feels cathartic having lived the life of a service worker, and I feel others who have had that experience should be able to connect to the darker parts of the film as well. \r\n\r\nThe plot culminate in a theme that I think despite what mild morbidity was displayed, most watchers can relate; Be it society's expectations or our own, the more we push toward perceived greatness we run away from that childhood excitement that set up on the path to begin with. \r\n\r\nThe Menu as a whole, is, well... Something you might hear at an actual tasting: A story of life, it's memories (good and bad) told in 5 courses.  If you're part of the menu, you deserve to stay until the end... That is, unless your not supposed to be here; perhaps life hasn't beaten you down enough yet... In-any-case, there is always the _cool aid_.", "created_at": "2023-01-09T21:44:47.621Z"}, {"movie_id": 593643, "review_id": "63c08aa7df857c00814145b8", "author_rating": 7.0, "review_text": "The Menu is a film defined by one key ingredient, the performance of Ralph Fiennes. His cold, biting acerbic chef, whose every word and nuance expresses a certain irony and a gradually building threat, is compelling. \r\n\r\nFrankly, it was Fiennes lynch pin performance that kept me watching The Menu. Had it been a less actor, I might well have walked away. Which brings me to the script. A predictable idea, with a certain promise that's far too loosely executed. The result is a plot that has more than a few dead ends and lacks a certain consistency and credulity. Its not awful, not at all. That said, with a more consideration and tightening of plot elements, it could have been so much more. \r\n\r\nIn summary, if The Menu is remembered for anything, to my mind, it will be the remarkable performance handed in by Ralph Fiennes. The bulk of my 7/10 rating is based on his remarkable work. Regrettably, in most other respects, this film is somewhat forgettable, horror fare.", "created_at": "2023-01-12T22:33:11.592Z"}, {"movie_id": 593643, "review_id": "63c1f174df857c00d9c148e5", "author_rating": 1.0, "review_text": "This was my actual last straw with IMDb... I guess you have to like this one or else.  And by that I mean they are purging all the bad reviews.\r\n\r\nSo, this is a movie about pretentious people, for pretentious people, that are killed by pretentious people so they can walk away feeling deep.\r\n\r\nFrom the start you know what is going to happen, because it's basically the same thing that always happens on ominous deserted islands... and the \"they eat the diners\" thing was removed because one of the couples were regular diners there.\r\n\r\nIt sort of gives you only one plot direction made clear by the fanaticism of the cult of cooks.\r\n\r\nSo there wasn't any guess work that needed to be done, and from the start you knew which character was going to live because the broadcast that with a giant arrow pointing down at them.\r\n\r\nBut, hey, it's the modern audiance, nothing can be subtle today.", "created_at": "2023-01-14T00:04:04.245Z"}, {"movie_id": 593643, "review_id": "63d23ab066ae4d008c923cc4", "author_rating": 8.0, "review_text": "“The Menu” takes anti capitalism and serves it up with a sprinkle or two of violence delivered on a plate by a perfectionist, cult leading chef. Mark Mylod produces a horror comedy that takes shots at culinary snobbery as well as performance art. \r\n\r\nMargot ( Anya Taylor-Joy ) and her supposed boyfriend Tyler (Nicholas Hoult ) take a boat, along with a number of other diners, to a remote Restaurant called Hawthorn situated on a private Island. The restaurant’s avant garde head chef ( Ralph Fines ) sells both art and home grown, self produced food to a select group of high earning customers with quality and presentation far above any other culinary experience. As the guests arrive they are first subjected to a tour of the Island to see the produce used in Hawthorn being grown and sea food being gathered. Once seated in the restaurant the food begins to be served along with a story from head chef outlining the dish and its significance to the overall experience.  Before the final course is served the stories become darker and more extreme culminating in the diners becoming fearful for their own lives.  \r\n\r\nBefore we reach the final course one sous chef announces that the menu requires “ an ending that ties everything together conceptually”. At this point in the proceedings it becomes clear that the restaurant staff are very much following the direction of their head chef without question, much in the way followers of any cult leader react.  “The Menu” is very unsettling and produces some uneasy, grimacing moments but balances them out well with enough humour and satire to make for a rather enjoyable experience.", "created_at": "2023-01-26T08:32:48.871Z"}, {"movie_id": 593643, "review_id": "64367cc7fd4f800077d38607", "author_rating": 3.0, "review_text": "This movie is not nearly as clever as it thinks it is. Without giving anything away, the plot is a unique one and the main villain's motivation is original, but the movie spoils everything by treating the audience like idiots.\r\n\r\nOne example (and this _is_ a spoiler, albeit a small one, so skip this paragraph if you still want to watch the movie) is when one character gets his finger chopped off. This was because he told his wife he was going to 'handle' the situation, and one of the baddies responded by asking 'with which hand?' When he didn't reply, she said 'left hand, ring finger' and one of the other baddies proceeded to chop said finger off.\r\n\r\nNow that all sounds very clever (handle/hand - what a pun!) if you don't think about it too much, but if you _do_, you'll realize that the baddies had no way of knowing that that character was going to use the word 'handle', and yet removing his finger seemed to have been pre-planned. Were they going to do it anyway, and his use of the word was a lucky coincidence that allowed them to make a pun while doing it? Or in their meeting earlier, did they say \"at some point someone might use the word 'handle', at which point we're going to remove part of their hand\"? I don't know, and some of you might say I'm being pedantic, but this movie was _full_ of things like this. It really took me out of it. 3/10, wouldn't recommend.", "created_at": "2023-04-12T09:41:27.473Z"}, {"movie_id": 593643, "review_id": "63553f72880c92007e709310", "author_rating": 4.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"The Menu is one of the biggest personal disappointments of the year.\r\n\r\nMark Mylod's film boasts inspired performances by the entire cast - Ralph Fiennes and Nicholas Hoult stand out - and some clever satirical moments, but pretty much nothing else works. Humor falls completely flat - except for the sequences à la Masterchef Australia. Screenplay follows surprisingly generic paths, being a mystery without any minimally impactful shock. Characters lack depth, and the anti-elite message is too evident and insignificant.\r\n\r\nIt should still get an overall positive reception.\"\r\n\r\nRating: C-", "created_at": "2022-10-23T13:19:46.443Z"}, {"movie_id": 593643, "review_id": "637b437d976e4800b4563113", "author_rating": 7.0, "review_text": "Arch-foodie \"Tyler\" (Nicholas Hoult) and his girlfriend \"Margot\" (Anya Taylor-Joy) are off to dine in a restaurant without parallel. Based on an island of just twelve acres, they join a collection of wealthy and influential people for what has been defined as experience to die for! Upon arrival, we discover that \"Margot\" was not the originally intended guest of her companion - so first question... Who is she? Next question - why does it seem to matter so much to the fastidious and frankly rather menacing chef \"Slowik\" (Ralph Fiennes) and his assistant \"Elsa\" (Hong Chau) who looks like she used \"Rosa Klebb\" as a role model? As the dinner progresses it becomes quite clear that the menu is not just about the exquisitely prepared and presented food, but is also about an appraisal of the individually selected - and none too savoury - staff and clientele, none of who are quite what they seem! This has something of Agatha Christie's \"Ten Little Indians\" to it, and it quite effectively pokes fun at the supercilious and frequently rather pompous attitude of both those cooking and those eating (or experiencing) fine foam dining. That humour is dark and potent, too. Fiennes is entirely convincing and Hoult, as well as Janet McTeer as the self-important food critic \"Lillian\" and Paul Adelstein as her suitably obsequious companion \"Ted\" contribute well as the sense of the ridiculous evolves into one considerably more perilous. It could have evolved just a bit more quickly for me - there are certainly enough \"get on with it\" moments and though ATJ's character is feisty, it doesn't quite work and ultimately served to illustrate the increasing implausibility of the story and unlikely servility of the diners as we head towards an almost Vernean denouement. It is quirkily entertaining this - a well presented, multi-layered, attack on our own senses that is better second time around. Not perfect, but I suspect Michelin would love it.", "created_at": "2022-11-21T09:23:09.435Z"}, {"movie_id": 593643, "review_id": "637ce42d07faa200b1d61988", "author_rating": 5.0, "review_text": "**The Menu began with a tone and tension that made me want more but ultimately ended with confusion and disappointment.**\r\n\r\nThe hype for The Menu intrigued me. The reviews celebrated its genius. So I had to see it. And when I sat in the theater and the credits began to roll, all o could say was, \"Huh?\" The Menu starts with Ready or Not vibes with a fish-out-of-water real-world character who ends up at a fancy dinner with a collection of high society foodies and critics. The trailer gave me expectations of cannibalism cult or Most Dangerous Game-type plots, but instead, nothing really happened. I think I understood what The Menu was trying to convey with its deeper meaning, but I still came up disappointed. Anya Taylor-Joy and the rest of the cast gave great performances, but there was little that really brought the movie together. Maybe the subversion of the cannibal or hunting expectation was the movie's brilliance? The Menu definitely tried to be clever, but whether it was or not might be open to interpretation. Ironically, I sat through the whole movie and left wanting more… left hungry.", "created_at": "2022-11-22T15:01:01.477Z"}, {"movie_id": 593643, "review_id": "63813298fb834600876f20ee", "author_rating": 9.0, "review_text": "_The Menu_ was one of the most unique thriller experiences of the year! The setup is fantastic, and the story gives you just enough information to intrigue even though the story path is somewhat generic. It is dark, honest, and quite hilarious. This unique blend created a thriller like no other.\r\n\r\nThe performances were great. Anya Taylor-Joy was brilliant and is cementing herself as one of the best actresses of the decade. Nicholas Hoult was hilarious in such a subtle way that never takes away from the tense scenes at play. Ralph Fiennes is haunting but also sympathetic, making him a very interesting and genuine antagonist.\r\n\r\nThis was such an amazing film and another smash entry into horror palooza that is 2022.\r\n\r\n**Score:** _86%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-11-25T21:24:40.073Z"}, {"movie_id": 593643, "review_id": "63b60ba25ad76b00e6faf9fd", "author_rating": 7.0, "review_text": "Pretty good but I'm also a little disappointed by it. I really liked the cast and the acting (Nicholas Hoult and Ralph Fiennes were especially good). The story was entertaining enough but I didn't quite buy into it all. It's not as sharp or smart as it could be. It may be that I recently watched \"Triangle of Sadness\" and really enjoyed the humour and observations on the rich in that film and \"The Menu\" doesn't quite reach these heights in my opinion. It's still worth watching, with some good reveals and surprises throughout.", "created_at": "2023-01-04T23:28:34.553Z"}, {"movie_id": 593643, "review_id": "63b87d767352050087ebb569", "author_rating": 5.0, "review_text": "\"You, Margot from Nebraska (Anya Taylor-Joy), you've betrayed our sacred bond of trust. And you've shown your craft to be careless. I was wrong. You're an eater. You're a taker. You're very hard to look at. And you're no Julia Roberts.\"", "created_at": "2023-01-06T19:58:46.310Z"}, {"movie_id": 593643, "review_id": "63bc8acfae6f093cb9df0144", "author_rating": 9.0, "review_text": "> **Jim Jones; Executive Chef**\r\n\r\nGoing to a once-in-a-lifetime tasting at a restaurant headed by one of (if not _the_) most renowned chefs in the world sounds like a dream come true to any foodie. (Myself included, albeit vicariously via the Food Network) Two of these lucky guests are Tyler (played by **Nicholas Hoult**), and Margot (played by **Anya Taylor-Joy**).\r\n\r\nThe issue is, something is already not right.  No, it's not obvious; at least not to normal people like you and me. Elsa (played by **Hong Chau**) picked up on it, but she isn't like us.  As more and more guest arrive, someone isn't supposed to be there... Ah, don't worry, the feeling will pass.  After all, the tasting is just about to start...\r\n\r\nThis is when we meet the executive chef, Chef Slowik (brilliantly played by **Ralph Fiennes**).  At first he is charismatic and prepares his guest for each tasting with stories. But this little cult like bigrade eventually let on that they know more about their guests than anyone should... That is except for one. \r\n\r\nAs someone who is enamored with the food world, seeing The Menu satire some of my favorite shows:\r\n\r\n* Netflix's Chef's Table with the course spotlight cinematography and ingredients cards.\r\n* Any Celebrity Chef (i.e. Chef Slowik calling someone a 'donkey', clearly a reference to Gordon Ramsey).  \r\n\r\n...I was delighted that this film leaned into the dark end of how service work can feel sometimes.  This film feels cathartic having lived the life of a service worker, and I feel others who have had that experience should be able to connect to the darker parts of the film as well. \r\n\r\nThe plot culminate in a theme that I think despite what mild morbidity was displayed, most watchers can relate; Be it society's expectations or our own, the more we push toward perceived greatness we run away from that childhood excitement that set up on the path to begin with. \r\n\r\nThe Menu as a whole, is, well... Something you might hear at an actual tasting: A story of life, it's memories (good and bad) told in 5 courses.  If you're part of the menu, you deserve to stay until the end... That is, unless your not supposed to be here; perhaps life hasn't beaten you down enough yet... In-any-case, there is always the _cool aid_.", "created_at": "2023-01-09T21:44:47.621Z"}, {"movie_id": 593643, "review_id": "63c08aa7df857c00814145b8", "author_rating": 7.0, "review_text": "The Menu is a film defined by one key ingredient, the performance of Ralph Fiennes. His cold, biting acerbic chef, whose every word and nuance expresses a certain irony and a gradually building threat, is compelling. \r\n\r\nFrankly, it was Fiennes lynch pin performance that kept me watching The Menu. Had it been a less actor, I might well have walked away. Which brings me to the script. A predictable idea, with a certain promise that's far too loosely executed. The result is a plot that has more than a few dead ends and lacks a certain consistency and credulity. Its not awful, not at all. That said, with a more consideration and tightening of plot elements, it could have been so much more. \r\n\r\nIn summary, if The Menu is remembered for anything, to my mind, it will be the remarkable performance handed in by Ralph Fiennes. The bulk of my 7/10 rating is based on his remarkable work. Regrettably, in most other respects, this film is somewhat forgettable, horror fare.", "created_at": "2023-01-12T22:33:11.592Z"}, {"movie_id": 593643, "review_id": "63c1f174df857c00d9c148e5", "author_rating": 1.0, "review_text": "This was my actual last straw with IMDb... I guess you have to like this one or else.  And by that I mean they are purging all the bad reviews.\r\n\r\nSo, this is a movie about pretentious people, for pretentious people, that are killed by pretentious people so they can walk away feeling deep.\r\n\r\nFrom the start you know what is going to happen, because it's basically the same thing that always happens on ominous deserted islands... and the \"they eat the diners\" thing was removed because one of the couples were regular diners there.\r\n\r\nIt sort of gives you only one plot direction made clear by the fanaticism of the cult of cooks.\r\n\r\nSo there wasn't any guess work that needed to be done, and from the start you knew which character was going to live because the broadcast that with a giant arrow pointing down at them.\r\n\r\nBut, hey, it's the modern audiance, nothing can be subtle today.", "created_at": "2023-01-14T00:04:04.245Z"}, {"movie_id": 593643, "review_id": "63d23ab066ae4d008c923cc4", "author_rating": 8.0, "review_text": "“The Menu” takes anti capitalism and serves it up with a sprinkle or two of violence delivered on a plate by a perfectionist, cult leading chef. Mark Mylod produces a horror comedy that takes shots at culinary snobbery as well as performance art. \r\n\r\nMargot ( Anya Taylor-Joy ) and her supposed boyfriend Tyler (Nicholas Hoult ) take a boat, along with a number of other diners, to a remote Restaurant called Hawthorn situated on a private Island. The restaurant’s avant garde head chef ( Ralph Fines ) sells both art and home grown, self produced food to a select group of high earning customers with quality and presentation far above any other culinary experience. As the guests arrive they are first subjected to a tour of the Island to see the produce used in Hawthorn being grown and sea food being gathered. Once seated in the restaurant the food begins to be served along with a story from head chef outlining the dish and its significance to the overall experience.  Before the final course is served the stories become darker and more extreme culminating in the diners becoming fearful for their own lives.  \r\n\r\nBefore we reach the final course one sous chef announces that the menu requires “ an ending that ties everything together conceptually”. At this point in the proceedings it becomes clear that the restaurant staff are very much following the direction of their head chef without question, much in the way followers of any cult leader react.  “The Menu” is very unsettling and produces some uneasy, grimacing moments but balances them out well with enough humour and satire to make for a rather enjoyable experience.", "created_at": "2023-01-26T08:32:48.871Z"}, {"movie_id": 593643, "review_id": "64367cc7fd4f800077d38607", "author_rating": 3.0, "review_text": "This movie is not nearly as clever as it thinks it is. Without giving anything away, the plot is a unique one and the main villain's motivation is original, but the movie spoils everything by treating the audience like idiots.\r\n\r\nOne example (and this _is_ a spoiler, albeit a small one, so skip this paragraph if you still want to watch the movie) is when one character gets his finger chopped off. This was because he told his wife he was going to 'handle' the situation, and one of the baddies responded by asking 'with which hand?' When he didn't reply, she said 'left hand, ring finger' and one of the other baddies proceeded to chop said finger off.\r\n\r\nNow that all sounds very clever (handle/hand - what a pun!) if you don't think about it too much, but if you _do_, you'll realize that the baddies had no way of knowing that that character was going to use the word 'handle', and yet removing his finger seemed to have been pre-planned. Were they going to do it anyway, and his use of the word was a lucky coincidence that allowed them to make a pun while doing it? Or in their meeting earlier, did they say \"at some point someone might use the word 'handle', at which point we're going to remove part of their hand\"? I don't know, and some of you might say I'm being pedantic, but this movie was _full_ of things like this. It really took me out of it. 3/10, wouldn't recommend.", "created_at": "2023-04-12T09:41:27.473Z"}]