[{"movie_id": 377273, "review_id": "59fe1d56c3a3686853025031", "author_rating": 7.0, "review_text": "**Home is where all the memories preserved.**\r\n\r\nI have to start the review by mentioning the recent year Russian film 'Durak', also known as 'The Fool' in English. In the same year, another similar themed Russian film, 'Leviathan' got nominated for the Oscars. What those both films highlighted were not just the corruptions, but the threats the common people face. Raising voice for good against evil is still a distant for such potential country. Here comes the Brazilian version. This is not on the same level. I meant the intensity of the event, how all folds. Nevertheless, the same core issue in a different continent.\r\n\r\nThis film met with several controversies. One of them omitted it from the Oscars race. But the film was received well from all the quarters. I did not find any issue. I thought it became unfortunate victim, especially, could be because of the developers and their connection with the corrupt powerful men. It's neither a masterpiece. I just consider it a good film. A message film. But not for everyone. Particularly, it is good for grownups viewing for the reason I'll going mention later.\r\n\r\nThe story of the 65 year old Clara. Her life has been successful being a music critic. Now a widow, and all her children settled down. It opened on her birthday where all the friends and family gathered to celebrate the occasion. Living alone in a small and beautiful beach view apartment. But the thing is she's the last one who still in that old building. Everyone had left it when the developers decided to demolish it and build a modern one. She's fighting to save the heritage. All her memories lie in there. But the developers have a different plan to force her out, and that's the remaining film to unfold how and other following developments.\r\n\r\n> ❝So when you like it, it's 'vintage'. If you don't like it, it's 'old'. Right?❞\r\n\r\nThe opening scene was a slight offbeat. Because right away it does not reveal who is the person of the film. Besides, some of the odd scenes in the middle would raise some eyebrows. Those were not actually the full fledged scenes, but glimpses that goes back to like the 70s or something. The idea of those parts were not properly understandable, but I think it is about missing those good times. The lone fighter concept was inspiring. At one point, when everybody around her thought that she's making an unnecessary scene out of it, she was firm on her decision and did what has to be done.\r\n\r\nThis was one of those films I did not like it on the spot. But slowly captivated. Once it's focus was fixed on one particular character, the rest of the tale set forward on what it wanted to tell us. As I understood it, it was not exactly about corruption, except a part of it was. It was the fight for ones right. A fight to save the past. On the other hand, the people from her opposite are ready to take extreme steps to defeat her. That's where it gets into the controversy. The controversy of those stupid tricks used to achieve the goal. This kind of a film coming from Brasil is really wonderful to educate poor knowledge people who easily become victims in a similar fashion.\r\n\r\nIt was a French-Brasil collaboration film. I'm reviewing it after a couple of days of my watch. Because I wanted to think about it for a while, scene by scene. The more I recall, the more I'm starting to like it. So I advise same to you as well that don't come to any conclusion just after you have watched. Because it could not be what you have heard about it. My only issue was the runtime. The 150 minutes were a too long. But manageable if you watch regularly, such slow films.\r\n\r\nWell written, directed and acted. Even the location was ideal. But they could have avoided the those sex scenes which I earlier labelled them as odd scenes. There were too many, even camera pans out from somewhere far away in the bush. Kind of unrelated. I am not against such an idea, as human daily life filled with those. But when the theme was seriously pivoting on a serious issue, these came as distraction. Why I'm pointing out that strongly is that a fine film like this should be for all ages, even for teenagers. It missed that opportunity. Otherwise and still a nice drama film to recommend the adults.\r\n\r\n_7/10_", "created_at": "2017-11-04T20:04:38.522Z"}]