[{"movie_id": 6933, "review_id": "5b000e43c3a3687c530079a7", "author_rating": 5.0, "review_text": "\"One Missed Call\" is a remake of the Japanese version from 2003, was directed by Eric Valette and stars Shannyn Sossamon in the leading role. The plot was as simple back then as it is here and now. People receive a call from their own future self to their own cell containing the last few seconds of their deaths. \r\n\r\nThe only problem with this remake is, that the film makers had no idea what they were doing and in my opinion the material of original director Takashi Miike was pretty much raped and left for dead. Not only that this remake doesn't have the creepy feeling of the original \"Chakushin Ari\", even the characters have been \"white washed\". We have seen this already with the US remake of \"The Ring\", with the differenece that in that remake a lot of respect was shown towards the original movie \"Ringu\". Not so in \"One Missed Call\". The significant ringtone was changed to a dull and relaxed one, taking completely away that sharp and chilling aura surrounding these calls. On top director Eric Valette completely missed the point of \"One Missed Call\" being a franchise such as the already mentioned \"The Ring\" and also \"The Grudge\". Of all these franchises solely \"The Grudge\" was able to stick to the basic idea behind the Asian vengeful spirit, probably because original director Takashi Shimizu also took on the US remake. Yes, there were mostly non Asian characters in it and that was fine for the spirits in form of Kayako and Toshio kept their Japanese origin, making the 3 US remakes still relatable to the origin \"Yu-On\" franchise. \"The Ring\" already failed to do so by replacing Sadako with Samara, but at least it was a really good movie with a great atmosphere. \r\n\r\n\"One Missed Call\" was supposed to carry the tradition forth with Mimiko, but instead we got some random characters you don't even care about and the PG13 crime gives this remake its death blow. You loved the original especially for the extended bone breaking, limb twisting death scene in the film studio? Forget about that in this one. This here is made for children's eyes. Sure, the CGI ghost effects towards the end were somewhat charming, but it is just about as creepy as some effects presented in \"The Pirates Of The Carribean\" and such. The hugging scene of the mother with rotten flesh falling off her fouly body piece by piece? Not even included! The only correct similarity seems to be that in both films the little girl who later becomes the vengeful spirit died due to an Asthma attack ignored by the mother(s). But that's about it.  \r\n\r\nThis remake is shot nicely and also the leading actors Shannyn Sossamon and Edward Burns tried their best to carry the film, but when the film itself already lacks any form of vision and respect for its origin, it just ends up as being a pointless, soulless cash grab product with a few nice visuals. If your kids are 13 you can show this atrocity to them, but please... as soon as they are old enough, do them a favour and show them the real thing. To all the fans of the original: stay away from this one. It will only anger you and leave a very bad taste in your mouth... Or is that due to the red candy? You have been warned!", "created_at": "2018-05-19T11:45:07.385Z"}, {"movie_id": 6933, "review_id": "64bae76343501100c7110b6f", "author_rating": 7.0, "review_text": "Good movie. I hear a lot of bad things about this movie, but I don't understand why. I thought it was a pretty good movie. Any one would be scared if this happened to them.", "created_at": "2023-07-21T20:15:31.097Z"}]