[{"movie_id": 614934, "review_id": "62b8deb0a61de103b56957b7", "author_rating": 7.0, "review_text": "After about ten minutes, I was both exhausted and terrified. Was what I had just seen - colourful but frenetic and haphazard going to continue? Well, it does calm down - and continues to quite cleverly interweave the early years and aspirations of this young boy with the openly racist political situation that prevailed in the Southern United States in the early 1940s. From here on in, I am treating this as a provocative and entertaining but entirely speculative drama about this man. Historians always argue about what did happen - or what might have, and I haven't any factual insight to add. On that basis, this is a quickly paced and creatively structured depiction of the main points of the life of Elvis. Austin Butler has an uncanny resemblance. As was often said of Dustin Hoffman, it's a fine line between mimicry and acting, but here I think Butler is more in the latter corner. He puts enormous effort into this portrayal. Physically and emotionally he gives convincingly of his all, leaving us in no doubt as to the talents and raw charisma that drove Presley to sell more records than anyone else. History tells us that he was discovered, and that until his death he had a pretty turbulent relationship with his promoter - Col. Tom Parker (Tom Hanks). Hanks is fine, no better. His make up did distract me, especially as he aged, and his accent isn't the best; but he features surprisingly sparingly even if he is essentially relaying the narrative to us. Virtually all of this focusses on the excellent Butler as he demonstrates the highs and low of this man who ended up craving love and adulation as readily as anyone can crave drugs or booze (though he used his fair share of them too). I could have done with more flesh on the bones of his relationship with his mother and his wife, but the depictions of the parasitic hangers-on who continually bleed him dry leave us with a potent image of a not unintelligent man who brought pleasure to millions with his gyrating, his songs and his personality, but maybe didn't keep that much back for himself. It's planet Baz, so of course it is flamboyant and busy, the musical numbers are fluid and full of energy. Once it settles down it is a vibrant and lively effort that really does fly by and that I really did enjoy.", "created_at": "2022-06-26T22:33:20.232Z"}, {"movie_id": 614934, "review_id": "62b9d34a7304b5135b7e2fba", "author_rating": 5.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Elvis features a glorious, electrifying, iconic performance from Austin Butler that will deservedly guarantee him all the awards of the year.\r\n\r\nUnfortunately, the actor isn't enough to overcome the many technical issues, besides Tom Hanks' massive miscast and the formulaic musical biopic narrative. Baz Luhrmann's style theoretically fits the legendary singer's vibrant aura, and the filmmaker's intention is clear.\r\n\r\nNevertheless, the frenetic, choppy editing and the restless camera movements rather come off as a messy, confusing, headache-inducing atmosphere instead of elements that elevate the overall piece. The unnecessarily hefty doesn't help.\r\n\r\nI was hoping to be surprised, but then again, I'm admittedly not the biggest Elvis/Luhrmann fan.\"\r\n\r\nRating: C+", "created_at": "2022-06-27T15:56:58.653Z"}, {"movie_id": 614934, "review_id": "62e7058d1bf266005da38305", "author_rating": null, "review_text": "Film ruined the career of Elvis Presley. In the 1960s, while The Beatles and Rolling Stones were airborne across America, he was caught in a trap: starring in over 20 inane film projects. This allowed the rock n’ roll revolution that centered on Elvis to pass him by. Ironically, this story and more were adapted to the screen last month in the biographical film, ‘Elvis’. The picture was directed by Baz Lurhmann (of ‘Moulin Rouge!’ and ‘The Great Gatsby’ fame) and stars newcomer Austin Butler as our favorite jailhouse rocker. It spans Presley’s career entirely, but with a rigorous focus on the abusive relationship with his manager, “Colonel” Tom Parker, played by Tom Hanks.\r\n\r\nThe conspiracy theorists have been right all this time. Elvis Presley is alive and well, but young, thirty, and goes by the name of Austin Butler…or at least that’s what I saw on the screen. I can’t praise Butler enough, let alone give him the justice he deserves in this paragraph, so I recommend you keep an eye out for him this next awards season. I am of the adamant opinion that there are three different Elvis Presleys: 50s rock star, 60s movie star, and 70s icon. All three act and move so, so unalike, and Austin understood and played them all. The movie is almost sequenced in this way: giving all three Elvises (Elvi?) their own hour to portray themselves. Similar praises are in order to Helen Thompson, who plays Elvis’ mother, Gladys Presley, and Alton Mason who plays Little Richard, who I wish we would’ve seen more of. The first quarter of the movie is set in the late-1950s, around Elvis’ rise to fame, and a majority of these scenes, especially the few that have Elvis and Gladys conversing about what lies ahead for the both of them, are so tonally gripping and devastating. Every director has a style, whether that be the calculated darkness of Alfred Hitchcock or Michael Bay’s explosions-a-plenty. Baz Luhrmann’s is simply vehement extravagance. I can’t praise his art direction throughout the film enough. Whether it’s the set design, costume design, or the way Austin melts the camera lens whenever he’s on-screen, Baz Luhrmann’s presence is always intensely felt, especially if you’re familiar with his past work. Luhrmann also co-wrote the screenplay, which continues to make me feel as though he was the perfect man for this job.  While your ‘Bohemian Rhapsodies’ will play ‘Another One Bites The Dust’ at the drop of any hat, ‘Elvis’ earns every music queue. It doesn’t just use the music, the film reexamines it. Tones in goofy, throw-away songs, like ‘Cotton Candy Land’ and ‘Power of My Love’, are completely overhauled and turned into life-defining theme songs for these real life characters. New songs, such as ‘Vegas‘ by Doja Cat, ‘Tupelo Shuffle‘ by Swae Lee with Diplo, and ‘Let It All Hang Out‘ by Denzel Curry also have this same sense of extravagance, electrifying every scene they’re in. One track that I thought was used beautifully and like never before was the iconic ‘Unchained Melody’, which had the audience ready to sob on the theater floor every time I saw the film on its opening weekend.\r\n\r\nTruthfully, there was not much that I didn’t overwhelmingly enjoy. At around two hours and forty minutes, the runtime may be a little much for the average viewer. I’ve come to the determination that, yes, it’s long, but not too long. Nothing in the almost three hours could be lost without the story (and the emotional significance of its payoff) being affected drastically. The story flows like a puzzle, with every piece being important to understand the full picture. Baz states that there’s a four-hour cut somewhere in the archive and while he says it will most likely never see the light of day, I believe it. When it comes to time, though, I hate that we didn’t spend more time in the period where Elvis was forced to make those truly terrible films of the 1960s. You can feel the importance of this wasted time in Elvis’ life, but it’s not explicitly shown and might leave those unfamiliar addled. Our introduction to Elvis’ longtime wife, Priscilla Presley, was quite weak as well, as we never really see them meet. She’s just kind of…there. Sure, she’s not integral to the main story (that of Elvis and the Colonel), but not having your two romantic leads meet is surely a bold choice. Tom Hanks as Tom Parker is something I would have portrayed differently as well. I’ve seen a lot of people online refer to him as “cartoonish” and, when I saw the film with ‘Sabor Latino’ host Cristopher Loya, he could only compare Hanks’ performance to Jared Leto’s ridiculous portrayal of Paolo Gucci in 2021’s laughable ‘House of Gucci’. I have to agree. This cunning, evil businessman should have been lurking in the shadows of Elvis’ story, not ridiculously running around and laughing through halls with a cane. I feel like I’m watching Cesar Romero’s Joker compared to Heath Ledger’s. This is not to say it’s a terrible performance, which it isn’t, but simply succeeded in portraying a different idea than I would have liked it to.   \r\n\r\nElvis Presley means so many different things to so many different people. As a man, he is portrayed truthfully here, with very little being held back. The climax of the movie, based around Elvis’ 1968 NBC television special, often referred to as “The Comeback”, shows the man grasping with mortality and relevancy with the undervalued song, ‘If I Can Dream’. This scene specifically says a lot about how the film and its crew feel about Elvis Presley, whether it’s the tears in Austin Butler’s eyes as he belts out the song, the camera’s intricate zoom on the Colonel watching Elvis from the background, or Baz Lurhmann’s distortion of the background with magazine articles, showing us how the world thought at the time. It’s almost an enhanced stage play with thick, thoughtful dialogue throughout. I very much enjoyed the film and it places high in my favorites of all time. While Elton John’s ‘Rocketman’ might still be my reigning, defending biopic champion, second place isn’t too shabby at all. The powers that be all came together to make this one, great cinematic experience that the entire family will be able to enjoy and appreciate. I recommend you do it while the film is still available in theaters across the globe.", "created_at": "2022-07-31T22:43:25.158Z"}, {"movie_id": 614934, "review_id": "63001c0f7d41aa008152eab4", "author_rating": 6.0, "review_text": "**Good moments but WAY too long.**\r\n\r\nA spectacular performance by Austin Butler, fabulous costumes, and set design were all weighed down by a much too long runtime and the impending doom of focusing on Elvis’ crooked manager.", "created_at": "2022-08-19T23:26:07.983Z"}, {"movie_id": 614934, "review_id": "632e4e7c7ecd28008304f6e8", "author_rating": 7.0, "review_text": "ELVIS (2022) has flashes of brilliance but Baz Luhrmann's scissor-happy editing causes it to suffer as the music isn't allowed to breathe.\r\n\r\nAnd Tom Hanks's Goldmember impersonation is... something.", "created_at": "2022-09-24T00:25:32.508Z"}, {"movie_id": 614934, "review_id": "6349a2a9414291007f3af751", "author_rating": 7.0, "review_text": "_Elvis_ is exactly what I expected going into this and I still found myself having a great time with this film. It is so incredible seeing the highs and lows of an artist's career and being there for the ride is such an intimate experience, even if the actual story is probably butchered to death to fit in a feature length film. But a biopic is only as great as the leading actor carrying this film and I glad to report that Austin Butler absolutely nailed this role. Fantastic through and through. My one big complaint about this film is the runtime. Almost three hours feels entirely unnecessary, but with it being on HBO Max, it is way more digestible in two chunks.\r\n\r\n**Score:** _74%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T17:55:53.298Z"}, {"movie_id": 614934, "review_id": "63837082229ae2155427d43e", "author_rating": 7.0, "review_text": "I found this movie to be fairly entertaining and, if mostly accurate, how much damage a con man can do to a performer’s career, and indeed their life, if they are unscrupulous and greedy. I had heard that the man who called himself Colonel Parker had forced songwriters to give Presley writing credits before he would let him perform their songs, but I had never dug deep enough to learn how badly he was duping his own client and supposed friend.\r\n\r\nAnd as often seems to happen with celebrities with fame and money, drugs appear to have shortened Elvis’s life. With early rock stars or those living that lifestyle, overdoses often did them in. But With the likes of Judy Garland and Elvis, it was prescription drugs that slowly caused their lives to ebb away. A sad story in many ways. I would have liked to see him more as a father and husband. But the acting, writing and the story of his musical journey was enough to keep me interested. It was funny, but when they related at the end the postscripts to the lives, their description of Colonel Parker’s final years seemed designed to elicit pity or ”serves him right.” But in a weird way, I wonder if her was content powering down his life in Vegas gambling his fortune away. Who else would he leave it to?", "created_at": "2022-11-27T14:13:22.070Z"}, {"movie_id": 614934, "review_id": "63f7a844d1ca2a00b27a621d", "author_rating": 6.0, "review_text": "Elvis (2022) is a biopic that offers an insightful glimpse into the life and talent of one of the greatest performers to ever grace the stage. Austin Butler delivers an outstanding performance as Elvis, effortlessly capturing the essence of the legendary artist from start to finish. His portrayal is likely to earn him much-deserved accolades during the awards season.\r\n\r\nHowever, the film does have its flaws. Clocking in at 2 hours and 40 minutes, it's a bit too long for comfort, and towards the end, it starts to lose its momentum, leading to an unsatisfying finish. Additionally, the film's over-the-top and extravagant visual style, while suitable for the musical numbers, can become burdensome and distracting during the quieter moments.\r\n\r\nUnfortunately, the film's narrator and one of its most prominent actors, Tom Hanks, gives a surprisingly disappointing performance. His prosthetics often look like they're falling off, and his accent is distracting and difficult to get used to. This issue is compounded by the fact that he's the narrator, which means he's present throughout much of the movie, causing some frustration and annoyance.\r\n\r\nDespite its shortcomings, Elvis is still an enjoyable and informative movie that provides an excellent window into the life of a musical icon. While it may not be perfect, there are certainly enough high points to warrant a watch, making it worth a solid 6/10 rating.", "created_at": "2023-02-23T17:54:12.654Z"}, {"movie_id": 614934, "review_id": "64fe27a16a222701372c427b", "author_rating": 7.0, "review_text": "**amazing, beautiful and shocking movie**\r\n\r\n I didn't expect that I would like the movie in this way because I have no interest in the singer Elvis Bresley because I have never heard his songs. All I know is that he is a rock and roll legend. I had no interest or any attachment to this character, but the movie made me admire his true personality.\r\n\r\nThat was so magical with all the beauty of the story and it really hurt my heart. Biographical films about rock stars have something traditional. You see at the beginning of the movies as the hero of the true story he was humble and then you see his rise to the top and his attachment to drugs and his love for women until the end. This movie has this characteristic as well, but the film's direction by Baz Luhrmann was frankly excellent as it had a rhythm The film is fast-paced. It is difficult to take a break between the movie because the rhythm of the film was fast.\r\n\r\nEverything was fast until I realized that the story of Elvis could be turned into a series with several episodes, 7 or 8, but when the story was turned into a movie, the events of his life story were transformed into an incredibly fast frame. My eyes were inside the movie as a zoom frame mode following the movie from the first scene to the last scene curiously. The colors were amazing, it was something shiny.", "created_at": "2023-09-10T20:31:29.191Z"}, {"movie_id": 614934, "review_id": "62b8deb0a61de103b56957b7", "author_rating": 7.0, "review_text": "After about ten minutes, I was both exhausted and terrified. Was what I had just seen - colourful but frenetic and haphazard going to continue? Well, it does calm down - and continues to quite cleverly interweave the early years and aspirations of this young boy with the openly racist political situation that prevailed in the Southern United States in the early 1940s. From here on in, I am treating this as a provocative and entertaining but entirely speculative drama about this man. Historians always argue about what did happen - or what might have, and I haven't any factual insight to add. On that basis, this is a quickly paced and creatively structured depiction of the main points of the life of Elvis. Austin Butler has an uncanny resemblance. As was often said of Dustin Hoffman, it's a fine line between mimicry and acting, but here I think Butler is more in the latter corner. He puts enormous effort into this portrayal. Physically and emotionally he gives convincingly of his all, leaving us in no doubt as to the talents and raw charisma that drove Presley to sell more records than anyone else. History tells us that he was discovered, and that until his death he had a pretty turbulent relationship with his promoter - Col. Tom Parker (Tom Hanks). Hanks is fine, no better. His make up did distract me, especially as he aged, and his accent isn't the best; but he features surprisingly sparingly even if he is essentially relaying the narrative to us. Virtually all of this focusses on the excellent Butler as he demonstrates the highs and low of this man who ended up craving love and adulation as readily as anyone can crave drugs or booze (though he used his fair share of them too). I could have done with more flesh on the bones of his relationship with his mother and his wife, but the depictions of the parasitic hangers-on who continually bleed him dry leave us with a potent image of a not unintelligent man who brought pleasure to millions with his gyrating, his songs and his personality, but maybe didn't keep that much back for himself. It's planet Baz, so of course it is flamboyant and busy, the musical numbers are fluid and full of energy. Once it settles down it is a vibrant and lively effort that really does fly by and that I really did enjoy.", "created_at": "2022-06-26T22:33:20.232Z"}, {"movie_id": 614934, "review_id": "62b9d34a7304b5135b7e2fba", "author_rating": 5.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Elvis features a glorious, electrifying, iconic performance from Austin Butler that will deservedly guarantee him all the awards of the year.\r\n\r\nUnfortunately, the actor isn't enough to overcome the many technical issues, besides Tom Hanks' massive miscast and the formulaic musical biopic narrative. Baz Luhrmann's style theoretically fits the legendary singer's vibrant aura, and the filmmaker's intention is clear.\r\n\r\nNevertheless, the frenetic, choppy editing and the restless camera movements rather come off as a messy, confusing, headache-inducing atmosphere instead of elements that elevate the overall piece. The unnecessarily hefty doesn't help.\r\n\r\nI was hoping to be surprised, but then again, I'm admittedly not the biggest Elvis/Luhrmann fan.\"\r\n\r\nRating: C+", "created_at": "2022-06-27T15:56:58.653Z"}, {"movie_id": 614934, "review_id": "62e7058d1bf266005da38305", "author_rating": null, "review_text": "Film ruined the career of Elvis Presley. In the 1960s, while The Beatles and Rolling Stones were airborne across America, he was caught in a trap: starring in over 20 inane film projects. This allowed the rock n’ roll revolution that centered on Elvis to pass him by. Ironically, this story and more were adapted to the screen last month in the biographical film, ‘Elvis’. The picture was directed by Baz Lurhmann (of ‘Moulin Rouge!’ and ‘The Great Gatsby’ fame) and stars newcomer Austin Butler as our favorite jailhouse rocker. It spans Presley’s career entirely, but with a rigorous focus on the abusive relationship with his manager, “Colonel” Tom Parker, played by Tom Hanks.\r\n\r\nThe conspiracy theorists have been right all this time. Elvis Presley is alive and well, but young, thirty, and goes by the name of Austin Butler…or at least that’s what I saw on the screen. I can’t praise Butler enough, let alone give him the justice he deserves in this paragraph, so I recommend you keep an eye out for him this next awards season. I am of the adamant opinion that there are three different Elvis Presleys: 50s rock star, 60s movie star, and 70s icon. All three act and move so, so unalike, and Austin understood and played them all. The movie is almost sequenced in this way: giving all three Elvises (Elvi?) their own hour to portray themselves. Similar praises are in order to Helen Thompson, who plays Elvis’ mother, Gladys Presley, and Alton Mason who plays Little Richard, who I wish we would’ve seen more of. The first quarter of the movie is set in the late-1950s, around Elvis’ rise to fame, and a majority of these scenes, especially the few that have Elvis and Gladys conversing about what lies ahead for the both of them, are so tonally gripping and devastating. Every director has a style, whether that be the calculated darkness of Alfred Hitchcock or Michael Bay’s explosions-a-plenty. Baz Luhrmann’s is simply vehement extravagance. I can’t praise his art direction throughout the film enough. Whether it’s the set design, costume design, or the way Austin melts the camera lens whenever he’s on-screen, Baz Luhrmann’s presence is always intensely felt, especially if you’re familiar with his past work. Luhrmann also co-wrote the screenplay, which continues to make me feel as though he was the perfect man for this job.  While your ‘Bohemian Rhapsodies’ will play ‘Another One Bites The Dust’ at the drop of any hat, ‘Elvis’ earns every music queue. It doesn’t just use the music, the film reexamines it. Tones in goofy, throw-away songs, like ‘Cotton Candy Land’ and ‘Power of My Love’, are completely overhauled and turned into life-defining theme songs for these real life characters. New songs, such as ‘Vegas‘ by Doja Cat, ‘Tupelo Shuffle‘ by Swae Lee with Diplo, and ‘Let It All Hang Out‘ by Denzel Curry also have this same sense of extravagance, electrifying every scene they’re in. One track that I thought was used beautifully and like never before was the iconic ‘Unchained Melody’, which had the audience ready to sob on the theater floor every time I saw the film on its opening weekend.\r\n\r\nTruthfully, there was not much that I didn’t overwhelmingly enjoy. At around two hours and forty minutes, the runtime may be a little much for the average viewer. I’ve come to the determination that, yes, it’s long, but not too long. Nothing in the almost three hours could be lost without the story (and the emotional significance of its payoff) being affected drastically. The story flows like a puzzle, with every piece being important to understand the full picture. Baz states that there’s a four-hour cut somewhere in the archive and while he says it will most likely never see the light of day, I believe it. When it comes to time, though, I hate that we didn’t spend more time in the period where Elvis was forced to make those truly terrible films of the 1960s. You can feel the importance of this wasted time in Elvis’ life, but it’s not explicitly shown and might leave those unfamiliar addled. Our introduction to Elvis’ longtime wife, Priscilla Presley, was quite weak as well, as we never really see them meet. She’s just kind of…there. Sure, she’s not integral to the main story (that of Elvis and the Colonel), but not having your two romantic leads meet is surely a bold choice. Tom Hanks as Tom Parker is something I would have portrayed differently as well. I’ve seen a lot of people online refer to him as “cartoonish” and, when I saw the film with ‘Sabor Latino’ host Cristopher Loya, he could only compare Hanks’ performance to Jared Leto’s ridiculous portrayal of Paolo Gucci in 2021’s laughable ‘House of Gucci’. I have to agree. This cunning, evil businessman should have been lurking in the shadows of Elvis’ story, not ridiculously running around and laughing through halls with a cane. I feel like I’m watching Cesar Romero’s Joker compared to Heath Ledger’s. This is not to say it’s a terrible performance, which it isn’t, but simply succeeded in portraying a different idea than I would have liked it to.   \r\n\r\nElvis Presley means so many different things to so many different people. As a man, he is portrayed truthfully here, with very little being held back. The climax of the movie, based around Elvis’ 1968 NBC television special, often referred to as “The Comeback”, shows the man grasping with mortality and relevancy with the undervalued song, ‘If I Can Dream’. This scene specifically says a lot about how the film and its crew feel about Elvis Presley, whether it’s the tears in Austin Butler’s eyes as he belts out the song, the camera’s intricate zoom on the Colonel watching Elvis from the background, or Baz Lurhmann’s distortion of the background with magazine articles, showing us how the world thought at the time. It’s almost an enhanced stage play with thick, thoughtful dialogue throughout. I very much enjoyed the film and it places high in my favorites of all time. While Elton John’s ‘Rocketman’ might still be my reigning, defending biopic champion, second place isn’t too shabby at all. The powers that be all came together to make this one, great cinematic experience that the entire family will be able to enjoy and appreciate. I recommend you do it while the film is still available in theaters across the globe.", "created_at": "2022-07-31T22:43:25.158Z"}, {"movie_id": 614934, "review_id": "63001c0f7d41aa008152eab4", "author_rating": 6.0, "review_text": "**Good moments but WAY too long.**\r\n\r\nA spectacular performance by Austin Butler, fabulous costumes, and set design were all weighed down by a much too long runtime and the impending doom of focusing on Elvis’ crooked manager.", "created_at": "2022-08-19T23:26:07.983Z"}, {"movie_id": 614934, "review_id": "632e4e7c7ecd28008304f6e8", "author_rating": 7.0, "review_text": "ELVIS (2022) has flashes of brilliance but Baz Luhrmann's scissor-happy editing causes it to suffer as the music isn't allowed to breathe.\r\n\r\nAnd Tom Hanks's Goldmember impersonation is... something.", "created_at": "2022-09-24T00:25:32.508Z"}, {"movie_id": 614934, "review_id": "6349a2a9414291007f3af751", "author_rating": 7.0, "review_text": "_Elvis_ is exactly what I expected going into this and I still found myself having a great time with this film. It is so incredible seeing the highs and lows of an artist's career and being there for the ride is such an intimate experience, even if the actual story is probably butchered to death to fit in a feature length film. But a biopic is only as great as the leading actor carrying this film and I glad to report that Austin Butler absolutely nailed this role. Fantastic through and through. My one big complaint about this film is the runtime. Almost three hours feels entirely unnecessary, but with it being on HBO Max, it is way more digestible in two chunks.\r\n\r\n**Score:** _74%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T17:55:53.298Z"}, {"movie_id": 614934, "review_id": "63837082229ae2155427d43e", "author_rating": 7.0, "review_text": "I found this movie to be fairly entertaining and, if mostly accurate, how much damage a con man can do to a performer’s career, and indeed their life, if they are unscrupulous and greedy. I had heard that the man who called himself Colonel Parker had forced songwriters to give Presley writing credits before he would let him perform their songs, but I had never dug deep enough to learn how badly he was duping his own client and supposed friend.\r\n\r\nAnd as often seems to happen with celebrities with fame and money, drugs appear to have shortened Elvis’s life. With early rock stars or those living that lifestyle, overdoses often did them in. But With the likes of Judy Garland and Elvis, it was prescription drugs that slowly caused their lives to ebb away. A sad story in many ways. I would have liked to see him more as a father and husband. But the acting, writing and the story of his musical journey was enough to keep me interested. It was funny, but when they related at the end the postscripts to the lives, their description of Colonel Parker’s final years seemed designed to elicit pity or ”serves him right.” But in a weird way, I wonder if her was content powering down his life in Vegas gambling his fortune away. Who else would he leave it to?", "created_at": "2022-11-27T14:13:22.070Z"}, {"movie_id": 614934, "review_id": "63f7a844d1ca2a00b27a621d", "author_rating": 6.0, "review_text": "Elvis (2022) is a biopic that offers an insightful glimpse into the life and talent of one of the greatest performers to ever grace the stage. Austin Butler delivers an outstanding performance as Elvis, effortlessly capturing the essence of the legendary artist from start to finish. His portrayal is likely to earn him much-deserved accolades during the awards season.\r\n\r\nHowever, the film does have its flaws. Clocking in at 2 hours and 40 minutes, it's a bit too long for comfort, and towards the end, it starts to lose its momentum, leading to an unsatisfying finish. Additionally, the film's over-the-top and extravagant visual style, while suitable for the musical numbers, can become burdensome and distracting during the quieter moments.\r\n\r\nUnfortunately, the film's narrator and one of its most prominent actors, Tom Hanks, gives a surprisingly disappointing performance. His prosthetics often look like they're falling off, and his accent is distracting and difficult to get used to. This issue is compounded by the fact that he's the narrator, which means he's present throughout much of the movie, causing some frustration and annoyance.\r\n\r\nDespite its shortcomings, Elvis is still an enjoyable and informative movie that provides an excellent window into the life of a musical icon. While it may not be perfect, there are certainly enough high points to warrant a watch, making it worth a solid 6/10 rating.", "created_at": "2023-02-23T17:54:12.654Z"}, {"movie_id": 614934, "review_id": "64fe27a16a222701372c427b", "author_rating": 7.0, "review_text": "**amazing, beautiful and shocking movie**\r\n\r\n I didn't expect that I would like the movie in this way because I have no interest in the singer Elvis Bresley because I have never heard his songs. All I know is that he is a rock and roll legend. I had no interest or any attachment to this character, but the movie made me admire his true personality.\r\n\r\nThat was so magical with all the beauty of the story and it really hurt my heart. Biographical films about rock stars have something traditional. You see at the beginning of the movies as the hero of the true story he was humble and then you see his rise to the top and his attachment to drugs and his love for women until the end. This movie has this characteristic as well, but the film's direction by Baz Luhrmann was frankly excellent as it had a rhythm The film is fast-paced. It is difficult to take a break between the movie because the rhythm of the film was fast.\r\n\r\nEverything was fast until I realized that the story of Elvis could be turned into a series with several episodes, 7 or 8, but when the story was turned into a movie, the events of his life story were transformed into an incredibly fast frame. My eyes were inside the movie as a zoom frame mode following the movie from the first scene to the last scene curiously. The colors were amazing, it was something shiny.", "created_at": "2023-09-10T20:31:29.191Z"}, {"movie_id": 614934, "review_id": "62b8deb0a61de103b56957b7", "author_rating": 7.0, "review_text": "After about ten minutes, I was both exhausted and terrified. Was what I had just seen - colourful but frenetic and haphazard going to continue? Well, it does calm down - and continues to quite cleverly interweave the early years and aspirations of this young boy with the openly racist political situation that prevailed in the Southern United States in the early 1940s. From here on in, I am treating this as a provocative and entertaining but entirely speculative drama about this man. Historians always argue about what did happen - or what might have, and I haven't any factual insight to add. On that basis, this is a quickly paced and creatively structured depiction of the main points of the life of Elvis. Austin Butler has an uncanny resemblance. As was often said of Dustin Hoffman, it's a fine line between mimicry and acting, but here I think Butler is more in the latter corner. He puts enormous effort into this portrayal. Physically and emotionally he gives convincingly of his all, leaving us in no doubt as to the talents and raw charisma that drove Presley to sell more records than anyone else. History tells us that he was discovered, and that until his death he had a pretty turbulent relationship with his promoter - Col. Tom Parker (Tom Hanks). Hanks is fine, no better. His make up did distract me, especially as he aged, and his accent isn't the best; but he features surprisingly sparingly even if he is essentially relaying the narrative to us. Virtually all of this focusses on the excellent Butler as he demonstrates the highs and low of this man who ended up craving love and adulation as readily as anyone can crave drugs or booze (though he used his fair share of them too). I could have done with more flesh on the bones of his relationship with his mother and his wife, but the depictions of the parasitic hangers-on who continually bleed him dry leave us with a potent image of a not unintelligent man who brought pleasure to millions with his gyrating, his songs and his personality, but maybe didn't keep that much back for himself. It's planet Baz, so of course it is flamboyant and busy, the musical numbers are fluid and full of energy. Once it settles down it is a vibrant and lively effort that really does fly by and that I really did enjoy.", "created_at": "2022-06-26T22:33:20.232Z"}, {"movie_id": 614934, "review_id": "62b9d34a7304b5135b7e2fba", "author_rating": 5.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Elvis features a glorious, electrifying, iconic performance from Austin Butler that will deservedly guarantee him all the awards of the year.\r\n\r\nUnfortunately, the actor isn't enough to overcome the many technical issues, besides Tom Hanks' massive miscast and the formulaic musical biopic narrative. Baz Luhrmann's style theoretically fits the legendary singer's vibrant aura, and the filmmaker's intention is clear.\r\n\r\nNevertheless, the frenetic, choppy editing and the restless camera movements rather come off as a messy, confusing, headache-inducing atmosphere instead of elements that elevate the overall piece. The unnecessarily hefty doesn't help.\r\n\r\nI was hoping to be surprised, but then again, I'm admittedly not the biggest Elvis/Luhrmann fan.\"\r\n\r\nRating: C+", "created_at": "2022-06-27T15:56:58.653Z"}, {"movie_id": 614934, "review_id": "62e7058d1bf266005da38305", "author_rating": null, "review_text": "Film ruined the career of Elvis Presley. In the 1960s, while The Beatles and Rolling Stones were airborne across America, he was caught in a trap: starring in over 20 inane film projects. This allowed the rock n’ roll revolution that centered on Elvis to pass him by. Ironically, this story and more were adapted to the screen last month in the biographical film, ‘Elvis’. The picture was directed by Baz Lurhmann (of ‘Moulin Rouge!’ and ‘The Great Gatsby’ fame) and stars newcomer Austin Butler as our favorite jailhouse rocker. It spans Presley’s career entirely, but with a rigorous focus on the abusive relationship with his manager, “Colonel” Tom Parker, played by Tom Hanks.\r\n\r\nThe conspiracy theorists have been right all this time. Elvis Presley is alive and well, but young, thirty, and goes by the name of Austin Butler…or at least that’s what I saw on the screen. I can’t praise Butler enough, let alone give him the justice he deserves in this paragraph, so I recommend you keep an eye out for him this next awards season. I am of the adamant opinion that there are three different Elvis Presleys: 50s rock star, 60s movie star, and 70s icon. All three act and move so, so unalike, and Austin understood and played them all. The movie is almost sequenced in this way: giving all three Elvises (Elvi?) their own hour to portray themselves. Similar praises are in order to Helen Thompson, who plays Elvis’ mother, Gladys Presley, and Alton Mason who plays Little Richard, who I wish we would’ve seen more of. The first quarter of the movie is set in the late-1950s, around Elvis’ rise to fame, and a majority of these scenes, especially the few that have Elvis and Gladys conversing about what lies ahead for the both of them, are so tonally gripping and devastating. Every director has a style, whether that be the calculated darkness of Alfred Hitchcock or Michael Bay’s explosions-a-plenty. Baz Luhrmann’s is simply vehement extravagance. I can’t praise his art direction throughout the film enough. Whether it’s the set design, costume design, or the way Austin melts the camera lens whenever he’s on-screen, Baz Luhrmann’s presence is always intensely felt, especially if you’re familiar with his past work. Luhrmann also co-wrote the screenplay, which continues to make me feel as though he was the perfect man for this job.  While your ‘Bohemian Rhapsodies’ will play ‘Another One Bites The Dust’ at the drop of any hat, ‘Elvis’ earns every music queue. It doesn’t just use the music, the film reexamines it. Tones in goofy, throw-away songs, like ‘Cotton Candy Land’ and ‘Power of My Love’, are completely overhauled and turned into life-defining theme songs for these real life characters. New songs, such as ‘Vegas‘ by Doja Cat, ‘Tupelo Shuffle‘ by Swae Lee with Diplo, and ‘Let It All Hang Out‘ by Denzel Curry also have this same sense of extravagance, electrifying every scene they’re in. One track that I thought was used beautifully and like never before was the iconic ‘Unchained Melody’, which had the audience ready to sob on the theater floor every time I saw the film on its opening weekend.\r\n\r\nTruthfully, there was not much that I didn’t overwhelmingly enjoy. At around two hours and forty minutes, the runtime may be a little much for the average viewer. I’ve come to the determination that, yes, it’s long, but not too long. Nothing in the almost three hours could be lost without the story (and the emotional significance of its payoff) being affected drastically. The story flows like a puzzle, with every piece being important to understand the full picture. Baz states that there’s a four-hour cut somewhere in the archive and while he says it will most likely never see the light of day, I believe it. When it comes to time, though, I hate that we didn’t spend more time in the period where Elvis was forced to make those truly terrible films of the 1960s. You can feel the importance of this wasted time in Elvis’ life, but it’s not explicitly shown and might leave those unfamiliar addled. Our introduction to Elvis’ longtime wife, Priscilla Presley, was quite weak as well, as we never really see them meet. She’s just kind of…there. Sure, she’s not integral to the main story (that of Elvis and the Colonel), but not having your two romantic leads meet is surely a bold choice. Tom Hanks as Tom Parker is something I would have portrayed differently as well. I’ve seen a lot of people online refer to him as “cartoonish” and, when I saw the film with ‘Sabor Latino’ host Cristopher Loya, he could only compare Hanks’ performance to Jared Leto’s ridiculous portrayal of Paolo Gucci in 2021’s laughable ‘House of Gucci’. I have to agree. This cunning, evil businessman should have been lurking in the shadows of Elvis’ story, not ridiculously running around and laughing through halls with a cane. I feel like I’m watching Cesar Romero’s Joker compared to Heath Ledger’s. This is not to say it’s a terrible performance, which it isn’t, but simply succeeded in portraying a different idea than I would have liked it to.   \r\n\r\nElvis Presley means so many different things to so many different people. As a man, he is portrayed truthfully here, with very little being held back. The climax of the movie, based around Elvis’ 1968 NBC television special, often referred to as “The Comeback”, shows the man grasping with mortality and relevancy with the undervalued song, ‘If I Can Dream’. This scene specifically says a lot about how the film and its crew feel about Elvis Presley, whether it’s the tears in Austin Butler’s eyes as he belts out the song, the camera’s intricate zoom on the Colonel watching Elvis from the background, or Baz Lurhmann’s distortion of the background with magazine articles, showing us how the world thought at the time. It’s almost an enhanced stage play with thick, thoughtful dialogue throughout. I very much enjoyed the film and it places high in my favorites of all time. While Elton John’s ‘Rocketman’ might still be my reigning, defending biopic champion, second place isn’t too shabby at all. The powers that be all came together to make this one, great cinematic experience that the entire family will be able to enjoy and appreciate. I recommend you do it while the film is still available in theaters across the globe.", "created_at": "2022-07-31T22:43:25.158Z"}, {"movie_id": 614934, "review_id": "63001c0f7d41aa008152eab4", "author_rating": 6.0, "review_text": "**Good moments but WAY too long.**\r\n\r\nA spectacular performance by Austin Butler, fabulous costumes, and set design were all weighed down by a much too long runtime and the impending doom of focusing on Elvis’ crooked manager.", "created_at": "2022-08-19T23:26:07.983Z"}, {"movie_id": 614934, "review_id": "632e4e7c7ecd28008304f6e8", "author_rating": 7.0, "review_text": "ELVIS (2022) has flashes of brilliance but Baz Luhrmann's scissor-happy editing causes it to suffer as the music isn't allowed to breathe.\r\n\r\nAnd Tom Hanks's Goldmember impersonation is... something.", "created_at": "2022-09-24T00:25:32.508Z"}, {"movie_id": 614934, "review_id": "6349a2a9414291007f3af751", "author_rating": 7.0, "review_text": "_Elvis_ is exactly what I expected going into this and I still found myself having a great time with this film. It is so incredible seeing the highs and lows of an artist's career and being there for the ride is such an intimate experience, even if the actual story is probably butchered to death to fit in a feature length film. But a biopic is only as great as the leading actor carrying this film and I glad to report that Austin Butler absolutely nailed this role. Fantastic through and through. My one big complaint about this film is the runtime. Almost three hours feels entirely unnecessary, but with it being on HBO Max, it is way more digestible in two chunks.\r\n\r\n**Score:** _74%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T17:55:53.298Z"}, {"movie_id": 614934, "review_id": "63837082229ae2155427d43e", "author_rating": 7.0, "review_text": "I found this movie to be fairly entertaining and, if mostly accurate, how much damage a con man can do to a performer’s career, and indeed their life, if they are unscrupulous and greedy. I had heard that the man who called himself Colonel Parker had forced songwriters to give Presley writing credits before he would let him perform their songs, but I had never dug deep enough to learn how badly he was duping his own client and supposed friend.\r\n\r\nAnd as often seems to happen with celebrities with fame and money, drugs appear to have shortened Elvis’s life. With early rock stars or those living that lifestyle, overdoses often did them in. But With the likes of Judy Garland and Elvis, it was prescription drugs that slowly caused their lives to ebb away. A sad story in many ways. I would have liked to see him more as a father and husband. But the acting, writing and the story of his musical journey was enough to keep me interested. It was funny, but when they related at the end the postscripts to the lives, their description of Colonel Parker’s final years seemed designed to elicit pity or ”serves him right.” But in a weird way, I wonder if her was content powering down his life in Vegas gambling his fortune away. Who else would he leave it to?", "created_at": "2022-11-27T14:13:22.070Z"}, {"movie_id": 614934, "review_id": "63f7a844d1ca2a00b27a621d", "author_rating": 6.0, "review_text": "Elvis (2022) is a biopic that offers an insightful glimpse into the life and talent of one of the greatest performers to ever grace the stage. Austin Butler delivers an outstanding performance as Elvis, effortlessly capturing the essence of the legendary artist from start to finish. His portrayal is likely to earn him much-deserved accolades during the awards season.\r\n\r\nHowever, the film does have its flaws. Clocking in at 2 hours and 40 minutes, it's a bit too long for comfort, and towards the end, it starts to lose its momentum, leading to an unsatisfying finish. Additionally, the film's over-the-top and extravagant visual style, while suitable for the musical numbers, can become burdensome and distracting during the quieter moments.\r\n\r\nUnfortunately, the film's narrator and one of its most prominent actors, Tom Hanks, gives a surprisingly disappointing performance. His prosthetics often look like they're falling off, and his accent is distracting and difficult to get used to. This issue is compounded by the fact that he's the narrator, which means he's present throughout much of the movie, causing some frustration and annoyance.\r\n\r\nDespite its shortcomings, Elvis is still an enjoyable and informative movie that provides an excellent window into the life of a musical icon. While it may not be perfect, there are certainly enough high points to warrant a watch, making it worth a solid 6/10 rating.", "created_at": "2023-02-23T17:54:12.654Z"}, {"movie_id": 614934, "review_id": "64fe27a16a222701372c427b", "author_rating": 7.0, "review_text": "**amazing, beautiful and shocking movie**\r\n\r\n I didn't expect that I would like the movie in this way because I have no interest in the singer Elvis Bresley because I have never heard his songs. All I know is that he is a rock and roll legend. I had no interest or any attachment to this character, but the movie made me admire his true personality.\r\n\r\nThat was so magical with all the beauty of the story and it really hurt my heart. Biographical films about rock stars have something traditional. You see at the beginning of the movies as the hero of the true story he was humble and then you see his rise to the top and his attachment to drugs and his love for women until the end. This movie has this characteristic as well, but the film's direction by Baz Luhrmann was frankly excellent as it had a rhythm The film is fast-paced. It is difficult to take a break between the movie because the rhythm of the film was fast.\r\n\r\nEverything was fast until I realized that the story of Elvis could be turned into a series with several episodes, 7 or 8, but when the story was turned into a movie, the events of his life story were transformed into an incredibly fast frame. My eyes were inside the movie as a zoom frame mode following the movie from the first scene to the last scene curiously. The colors were amazing, it was something shiny.", "created_at": "2023-09-10T20:31:29.191Z"}, {"movie_id": 614934, "review_id": "62b8deb0a61de103b56957b7", "author_rating": 7.0, "review_text": "After about ten minutes, I was both exhausted and terrified. Was what I had just seen - colourful but frenetic and haphazard going to continue? Well, it does calm down - and continues to quite cleverly interweave the early years and aspirations of this young boy with the openly racist political situation that prevailed in the Southern United States in the early 1940s. From here on in, I am treating this as a provocative and entertaining but entirely speculative drama about this man. Historians always argue about what did happen - or what might have, and I haven't any factual insight to add. On that basis, this is a quickly paced and creatively structured depiction of the main points of the life of Elvis. Austin Butler has an uncanny resemblance. As was often said of Dustin Hoffman, it's a fine line between mimicry and acting, but here I think Butler is more in the latter corner. He puts enormous effort into this portrayal. Physically and emotionally he gives convincingly of his all, leaving us in no doubt as to the talents and raw charisma that drove Presley to sell more records than anyone else. History tells us that he was discovered, and that until his death he had a pretty turbulent relationship with his promoter - Col. Tom Parker (Tom Hanks). Hanks is fine, no better. His make up did distract me, especially as he aged, and his accent isn't the best; but he features surprisingly sparingly even if he is essentially relaying the narrative to us. Virtually all of this focusses on the excellent Butler as he demonstrates the highs and low of this man who ended up craving love and adulation as readily as anyone can crave drugs or booze (though he used his fair share of them too). I could have done with more flesh on the bones of his relationship with his mother and his wife, but the depictions of the parasitic hangers-on who continually bleed him dry leave us with a potent image of a not unintelligent man who brought pleasure to millions with his gyrating, his songs and his personality, but maybe didn't keep that much back for himself. It's planet Baz, so of course it is flamboyant and busy, the musical numbers are fluid and full of energy. Once it settles down it is a vibrant and lively effort that really does fly by and that I really did enjoy.", "created_at": "2022-06-26T22:33:20.232Z"}, {"movie_id": 614934, "review_id": "62b9d34a7304b5135b7e2fba", "author_rating": 5.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Elvis features a glorious, electrifying, iconic performance from Austin Butler that will deservedly guarantee him all the awards of the year.\r\n\r\nUnfortunately, the actor isn't enough to overcome the many technical issues, besides Tom Hanks' massive miscast and the formulaic musical biopic narrative. Baz Luhrmann's style theoretically fits the legendary singer's vibrant aura, and the filmmaker's intention is clear.\r\n\r\nNevertheless, the frenetic, choppy editing and the restless camera movements rather come off as a messy, confusing, headache-inducing atmosphere instead of elements that elevate the overall piece. The unnecessarily hefty doesn't help.\r\n\r\nI was hoping to be surprised, but then again, I'm admittedly not the biggest Elvis/Luhrmann fan.\"\r\n\r\nRating: C+", "created_at": "2022-06-27T15:56:58.653Z"}, {"movie_id": 614934, "review_id": "62e7058d1bf266005da38305", "author_rating": null, "review_text": "Film ruined the career of Elvis Presley. In the 1960s, while The Beatles and Rolling Stones were airborne across America, he was caught in a trap: starring in over 20 inane film projects. This allowed the rock n’ roll revolution that centered on Elvis to pass him by. Ironically, this story and more were adapted to the screen last month in the biographical film, ‘Elvis’. The picture was directed by Baz Lurhmann (of ‘Moulin Rouge!’ and ‘The Great Gatsby’ fame) and stars newcomer Austin Butler as our favorite jailhouse rocker. It spans Presley’s career entirely, but with a rigorous focus on the abusive relationship with his manager, “Colonel” Tom Parker, played by Tom Hanks.\r\n\r\nThe conspiracy theorists have been right all this time. Elvis Presley is alive and well, but young, thirty, and goes by the name of Austin Butler…or at least that’s what I saw on the screen. I can’t praise Butler enough, let alone give him the justice he deserves in this paragraph, so I recommend you keep an eye out for him this next awards season. I am of the adamant opinion that there are three different Elvis Presleys: 50s rock star, 60s movie star, and 70s icon. All three act and move so, so unalike, and Austin understood and played them all. The movie is almost sequenced in this way: giving all three Elvises (Elvi?) their own hour to portray themselves. Similar praises are in order to Helen Thompson, who plays Elvis’ mother, Gladys Presley, and Alton Mason who plays Little Richard, who I wish we would’ve seen more of. The first quarter of the movie is set in the late-1950s, around Elvis’ rise to fame, and a majority of these scenes, especially the few that have Elvis and Gladys conversing about what lies ahead for the both of them, are so tonally gripping and devastating. Every director has a style, whether that be the calculated darkness of Alfred Hitchcock or Michael Bay’s explosions-a-plenty. Baz Luhrmann’s is simply vehement extravagance. I can’t praise his art direction throughout the film enough. Whether it’s the set design, costume design, or the way Austin melts the camera lens whenever he’s on-screen, Baz Luhrmann’s presence is always intensely felt, especially if you’re familiar with his past work. Luhrmann also co-wrote the screenplay, which continues to make me feel as though he was the perfect man for this job.  While your ‘Bohemian Rhapsodies’ will play ‘Another One Bites The Dust’ at the drop of any hat, ‘Elvis’ earns every music queue. It doesn’t just use the music, the film reexamines it. Tones in goofy, throw-away songs, like ‘Cotton Candy Land’ and ‘Power of My Love’, are completely overhauled and turned into life-defining theme songs for these real life characters. New songs, such as ‘Vegas‘ by Doja Cat, ‘Tupelo Shuffle‘ by Swae Lee with Diplo, and ‘Let It All Hang Out‘ by Denzel Curry also have this same sense of extravagance, electrifying every scene they’re in. One track that I thought was used beautifully and like never before was the iconic ‘Unchained Melody’, which had the audience ready to sob on the theater floor every time I saw the film on its opening weekend.\r\n\r\nTruthfully, there was not much that I didn’t overwhelmingly enjoy. At around two hours and forty minutes, the runtime may be a little much for the average viewer. I’ve come to the determination that, yes, it’s long, but not too long. Nothing in the almost three hours could be lost without the story (and the emotional significance of its payoff) being affected drastically. The story flows like a puzzle, with every piece being important to understand the full picture. Baz states that there’s a four-hour cut somewhere in the archive and while he says it will most likely never see the light of day, I believe it. When it comes to time, though, I hate that we didn’t spend more time in the period where Elvis was forced to make those truly terrible films of the 1960s. You can feel the importance of this wasted time in Elvis’ life, but it’s not explicitly shown and might leave those unfamiliar addled. Our introduction to Elvis’ longtime wife, Priscilla Presley, was quite weak as well, as we never really see them meet. She’s just kind of…there. Sure, she’s not integral to the main story (that of Elvis and the Colonel), but not having your two romantic leads meet is surely a bold choice. Tom Hanks as Tom Parker is something I would have portrayed differently as well. I’ve seen a lot of people online refer to him as “cartoonish” and, when I saw the film with ‘Sabor Latino’ host Cristopher Loya, he could only compare Hanks’ performance to Jared Leto’s ridiculous portrayal of Paolo Gucci in 2021’s laughable ‘House of Gucci’. I have to agree. This cunning, evil businessman should have been lurking in the shadows of Elvis’ story, not ridiculously running around and laughing through halls with a cane. I feel like I’m watching Cesar Romero’s Joker compared to Heath Ledger’s. This is not to say it’s a terrible performance, which it isn’t, but simply succeeded in portraying a different idea than I would have liked it to.   \r\n\r\nElvis Presley means so many different things to so many different people. As a man, he is portrayed truthfully here, with very little being held back. The climax of the movie, based around Elvis’ 1968 NBC television special, often referred to as “The Comeback”, shows the man grasping with mortality and relevancy with the undervalued song, ‘If I Can Dream’. This scene specifically says a lot about how the film and its crew feel about Elvis Presley, whether it’s the tears in Austin Butler’s eyes as he belts out the song, the camera’s intricate zoom on the Colonel watching Elvis from the background, or Baz Lurhmann’s distortion of the background with magazine articles, showing us how the world thought at the time. It’s almost an enhanced stage play with thick, thoughtful dialogue throughout. I very much enjoyed the film and it places high in my favorites of all time. While Elton John’s ‘Rocketman’ might still be my reigning, defending biopic champion, second place isn’t too shabby at all. The powers that be all came together to make this one, great cinematic experience that the entire family will be able to enjoy and appreciate. I recommend you do it while the film is still available in theaters across the globe.", "created_at": "2022-07-31T22:43:25.158Z"}, {"movie_id": 614934, "review_id": "63001c0f7d41aa008152eab4", "author_rating": 6.0, "review_text": "**Good moments but WAY too long.**\r\n\r\nA spectacular performance by Austin Butler, fabulous costumes, and set design were all weighed down by a much too long runtime and the impending doom of focusing on Elvis’ crooked manager.", "created_at": "2022-08-19T23:26:07.983Z"}, {"movie_id": 614934, "review_id": "632e4e7c7ecd28008304f6e8", "author_rating": 7.0, "review_text": "ELVIS (2022) has flashes of brilliance but Baz Luhrmann's scissor-happy editing causes it to suffer as the music isn't allowed to breathe.\r\n\r\nAnd Tom Hanks's Goldmember impersonation is... something.", "created_at": "2022-09-24T00:25:32.508Z"}, {"movie_id": 614934, "review_id": "6349a2a9414291007f3af751", "author_rating": 7.0, "review_text": "_Elvis_ is exactly what I expected going into this and I still found myself having a great time with this film. It is so incredible seeing the highs and lows of an artist's career and being there for the ride is such an intimate experience, even if the actual story is probably butchered to death to fit in a feature length film. But a biopic is only as great as the leading actor carrying this film and I glad to report that Austin Butler absolutely nailed this role. Fantastic through and through. My one big complaint about this film is the runtime. Almost three hours feels entirely unnecessary, but with it being on HBO Max, it is way more digestible in two chunks.\r\n\r\n**Score:** _74%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T17:55:53.298Z"}, {"movie_id": 614934, "review_id": "63837082229ae2155427d43e", "author_rating": 7.0, "review_text": "I found this movie to be fairly entertaining and, if mostly accurate, how much damage a con man can do to a performer’s career, and indeed their life, if they are unscrupulous and greedy. I had heard that the man who called himself Colonel Parker had forced songwriters to give Presley writing credits before he would let him perform their songs, but I had never dug deep enough to learn how badly he was duping his own client and supposed friend.\r\n\r\nAnd as often seems to happen with celebrities with fame and money, drugs appear to have shortened Elvis’s life. With early rock stars or those living that lifestyle, overdoses often did them in. But With the likes of Judy Garland and Elvis, it was prescription drugs that slowly caused their lives to ebb away. A sad story in many ways. I would have liked to see him more as a father and husband. But the acting, writing and the story of his musical journey was enough to keep me interested. It was funny, but when they related at the end the postscripts to the lives, their description of Colonel Parker’s final years seemed designed to elicit pity or ”serves him right.” But in a weird way, I wonder if her was content powering down his life in Vegas gambling his fortune away. Who else would he leave it to?", "created_at": "2022-11-27T14:13:22.070Z"}, {"movie_id": 614934, "review_id": "63f7a844d1ca2a00b27a621d", "author_rating": 6.0, "review_text": "Elvis (2022) is a biopic that offers an insightful glimpse into the life and talent of one of the greatest performers to ever grace the stage. Austin Butler delivers an outstanding performance as Elvis, effortlessly capturing the essence of the legendary artist from start to finish. His portrayal is likely to earn him much-deserved accolades during the awards season.\r\n\r\nHowever, the film does have its flaws. Clocking in at 2 hours and 40 minutes, it's a bit too long for comfort, and towards the end, it starts to lose its momentum, leading to an unsatisfying finish. Additionally, the film's over-the-top and extravagant visual style, while suitable for the musical numbers, can become burdensome and distracting during the quieter moments.\r\n\r\nUnfortunately, the film's narrator and one of its most prominent actors, Tom Hanks, gives a surprisingly disappointing performance. His prosthetics often look like they're falling off, and his accent is distracting and difficult to get used to. This issue is compounded by the fact that he's the narrator, which means he's present throughout much of the movie, causing some frustration and annoyance.\r\n\r\nDespite its shortcomings, Elvis is still an enjoyable and informative movie that provides an excellent window into the life of a musical icon. While it may not be perfect, there are certainly enough high points to warrant a watch, making it worth a solid 6/10 rating.", "created_at": "2023-02-23T17:54:12.654Z"}, {"movie_id": 614934, "review_id": "64fe27a16a222701372c427b", "author_rating": 7.0, "review_text": "**amazing, beautiful and shocking movie**\r\n\r\n I didn't expect that I would like the movie in this way because I have no interest in the singer Elvis Bresley because I have never heard his songs. All I know is that he is a rock and roll legend. I had no interest or any attachment to this character, but the movie made me admire his true personality.\r\n\r\nThat was so magical with all the beauty of the story and it really hurt my heart. Biographical films about rock stars have something traditional. You see at the beginning of the movies as the hero of the true story he was humble and then you see his rise to the top and his attachment to drugs and his love for women until the end. This movie has this characteristic as well, but the film's direction by Baz Luhrmann was frankly excellent as it had a rhythm The film is fast-paced. It is difficult to take a break between the movie because the rhythm of the film was fast.\r\n\r\nEverything was fast until I realized that the story of Elvis could be turned into a series with several episodes, 7 or 8, but when the story was turned into a movie, the events of his life story were transformed into an incredibly fast frame. My eyes were inside the movie as a zoom frame mode following the movie from the first scene to the last scene curiously. The colors were amazing, it was something shiny.", "created_at": "2023-09-10T20:31:29.191Z"}]