[{"movie_id": 77, "review_id": "55a2e0f3c3a3681ce7003ef2", "author_rating": 9.0, "review_text": "We all lie to ourselves to be happy.\r\n\r\nIt's not until a film like Memento comes along, or that you personally have to deal with someone close who suffers a form of this subject to hand, that you get jolted to remember just how your memory is such a prized and treasured thing - and crucially that it's one of your key safety devices.\r\n\r\nChristopher and Jonathan Nolan crafted one of the best films of 2000 based on those facets of the human condition. Their protagonist is Leonard Shelby, played with stupendous believability by Guy Pearce, who is suffering from a memory amnesia caused by a trauma to the head as he tried to aide his wife who was raped and murdered. He can remember things before the incident, but anything post that and he can't form a memory. So who can he trust? Does he know any of the few people who appear to be in his life at the present time? He tattoos his body to help him remember, constantly writes notes to keep him alert in his now alien world, while all the time he is on the search for the man who ruined his life.\r\n\r\nChristopher Nolan plants the audience right into Leonard's world. By using a reverse story telling structure it's deliberately complex and ingenious given that it opens with the ending! It has been argued that it's trickery for trickery sake, style over substance, but the way each scene is built upon in the narrative is a thing of high quality, it's all relevant and demands the closest of attention from the viewer, where cheekily we are ourselves asked to form memories of prior narrative passages. Mystery is strong throughout, the characters currently in Leonard's life may have different means and motives, it keeps us alert, with the confusion, lies, manipulations, enigmas and amnesia angles booming with neo-noir vibrancy. And the Nolan's know their noir of course, adding a narrator who is hard to define or trust himself!\r\n\r\nThe reverse structure wasn't new in 2000, but Christopher Nolan picks up the idea and adds new strands to it, simultaneously bringing his visual ticks as David Julyan's musical score shifts from elegiac forebodings to pulse pounding dread, and as evidenced by the darling easter egg option that allows one to watch it in chronological order, it's a damn fine thriller without the reverse trickery anyway. Super. 9/10", "created_at": "2015-07-12T21:49:39.979Z"}, {"movie_id": 77, "review_id": "5737757fc3a36840ec002af0", "author_rating": 10.0, "review_text": "Excellent. I can't believe I've finally gotten around to watching all of Christopher Nolan's films (I have 'The Prestige' on DVD, but have yet to see it), but it's been well worth the wait. There are a couple of handful of English-language directors operating right now that I will make sure I watch every single film of, and Nolan has become one of those for me, and rightfully so. A very fine twist on the noir framework.", "created_at": "2016-05-14T18:59:11.215Z"}, {"movie_id": 77, "review_id": "58c14e39c3a368265b0097d4", "author_rating": 10.0, "review_text": "‘Memento’ is director Christopher Nolan’s tribute to classic film noir tales of revenge and mystery. By adding a new twist to traditional conventions, Nolan is able to consume and grip the viewer throughout the entire film and for years after. The aspect that differentiates this neo-noir from its competitors today is its jumbled and complex narrative which continually moves backwards in time. The viewers first see the main character complete his revenge murder (a triumphant scene we usually associate with the ending of film noirs). We then begin to see events unfold backwards and the reason for this becomes clear.\r\n\r\nLeonard Shelby (Guy Pearce) and his wife are attacked in their home. His wife is murdered but Guy Pearce is left with a brain condition that disables him from creating anymore short-term memory. Constantly being reminded of the horror of the situation, he is relentlessly spurred on to get his revenge on his wife’s killer. As the viewer progresses through the film, they begin to feel more and more like Lenny. The audience have no idea of what has happened prior to the scene currently showing and so we are left feeling the same confusion as our protagonist. To cope with his condition, he maintains a system of notes, photographs, and tattoos to record information about himself and others, including his wife's killer. He is aided in his investigation by \"Teddy\" (Joe Pantoliano) and Natalie (Carrie-Anne Moss), neither of whom he can really trust (both of the latter actors starred together in ‘The Matrix (1999)’ in which Pantoliano was not to be trusted, disorientating the informed viewer more).\r\n\r\nThe film's events unfold in two separate, alternating narratives—one in colour, and the other in black and white. Leonard's investigation is depicted in five-minute colour sequences that are in reverse chronological order, however, the short black and white scenes are shown in chronological order and show Leonard on the phone to a mysterious stranger having a conversation that the viewers cannot understand (these sequences are more direct references to the film noir genre that Christopher Nolan is embracing). This style of directing makes the audience completely empathise with Leonard’s situation as you never know more than he does, but also it creates huge comedic and emotional moments which rely heavily on the notion of dramatic irony.\r\n\r\nWith Nolan’s use of handheld camera work, an overtone of pink colouring, and sharp editing (the only transition effects in use are occasional fade outs) the viewer is made to feel disorientated and is therefore able to empathise more with Leonard’s character. The original idea was a short story by Nolan’s brother, Jonathan who also helped with the screenplay. The dialogue in the film is its best feature with its insightful, powerful and heart-wrenching speeches about the nature of memory. As we learn how we rely upon memory for our sense of reality, we begin to question reality itself.  The idea of faith and constant references to the bible can make the entire film a metaphor for people’s faith in Christianity or any other religion at that.\r\n\r\n★★★★★", "created_at": "2017-03-09T12:44:41.542Z"}, {"movie_id": 77, "review_id": "621a8f2219ab59001c73c4ad", "author_rating": 8.0, "review_text": "Structuring the film in such a way that the viewer knows as little as the protagonist, the Nolan's have created a nifty puzzle that slowly unravels to its climax.\r\n\r\n8/10", "created_at": "2022-02-26T20:35:46.724Z"}]