[{"movie_id": 614930, "review_id": "64ca446385b1050139aa5cf1", "author_rating": null, "review_text": "The popular Teenage Mutant Ninja Turtle Franchise has taken a break from the recent live-action updates and has returned to animation to reboot and modernize the franchise.\r\n\r\n“Teenage Mutant Ninja Turtles: Mutant Mayhem” is a loving and updated look at the story as Seth Rogen and his creative team have shaken up the franchise but remained true to the core characters and universe.\r\n\r\nThe film follows the four Turtles Leonardo (Nicolas Cantu), Raphael (Brady Noon), Donatello (Micah Abbey), and Michelangelo (Shamon Brown Jr.), who are looking to find acceptance in the world despite their father Splinter (Jackie Chan), warning them not to trust humans and that they will never be accepted.\r\n\r\nAs typical teens do, the boys frequently rebel to sneak out and use their Ninja skills to travel New York to do tasks ranging from shopping to watching outdoor movies which only fuels their desires to be accepted and\r\nhave normal experiences such as High School.\r\n\r\nAt the same time as a crimewave is happening attributed to a menace known as Superfly (Ice Cube), who is gathering all kinds of high-end gear for his nefarious scheme.\r\n\r\nWhen the brothers become aware of this while helping a human named April (Ago Edebiri), they become obsessed with her and desire to help her get to the bottom of the thefts and hope to win her approval as well as human acceptance in the process.\r\n\r\nWhat follows is a madcap adventure with plenty of action and humor and\r\nseveral celebrity voices which adds a new level of fun to the expanded\r\ncast of supporting characters.\r\n\r\nThe animation style is at times a bit rough to watch over an extended\r\nperiod but as the film progressed I became used to it and it did much like the two recent Spider-man animated films grow on me even if it can be distracting at times.\r\n\r\nThe cast is solid and the film seemed to play well to viewers of all ages\r\nas there were jokes and references for all ages and the storyline was engaging even if it did at times seem to drag in places.\r\n\r\nIn the end the film is a loving and solid entry into the franchise and one that I am sure we will be seeing more animated entries from in the near future and is a must watch for fans of all ages.\r\n\r\n4 stars out of 5", "created_at": "2023-08-02T11:56:19.429Z"}, {"movie_id": 614930, "review_id": "64cca32e2f266b09ef121ed8", "author_rating": 9.0, "review_text": "One of the greatest surprises of the year has to be “Teenage Mutant Ninja Turtles,” a film that I never would’ve expected to be as terrific as it is. Co-directed by Jeff Rowe and Kyler Spears and co-written by Rowe, Seth Rogen, and Evan Goldberg, this animated feature is confident, action packed, funny, and is a visual delight. It’s a crowning achievement in animation, and the perfect summer movie to boot.\r\n\r\nThe film tells the origin story of four turtle brothers, Raphael (Brady Noon), Leonardo (Nicolas Cantu), Donatello (Micah Abbey), and Michelangelo (Shamon Brown Jr.), who were mutated after a dangerous laboratory explosion left them covered in radioactive ooze. Their adopted father Splinter (Jackie Chan), a kind and elderly New York City sewer rat, has sheltered his teenage sons from the harsh, dangerous, and judgmental human world for over a decade. Deciding that they want to be accepted as normal teenagers, the brothers head out into the city on their own, crossing paths with young reporter April O’Neil (Ayo Edebiri). A fast friendship develops, and the turtles find themselves taking on a mysterious crime syndicate that’s run by fellow mutants.\r\n\r\nIt’s a good story that’s elevated by across-the-board talent. Spears and Rowe’s crackerjack direction is on point, especially when it comes to orchestrating thrilling action scenes. This is easily one of the most well-directed animated features I’ve ever seen. Energetic and bursting with enthusiasm, it’s nearly impossible not to have a blast watching this movie.\r\n\r\nThe characters are great, too. The turtles may be mutants, but they still act like regular, dumb teenage boys, finding humor in the silliness of everyday experiences. The voice performances are outstanding too, with a talented cast and a diversity that feels natural and appropriate. Everyone (including Paul Rudd, Ice Cube, John Cena, Rose Byrne, and Giancarlo Esposito) gives top-tier turns, and it makes the movie even better.\r\n\r\nIt’s worth noting that this animated film isn’t made for little kids, and youngsters will likely be very bored and fidgety. This is more of a movie that’s geared towards ‘tweens, teens, and their parents (especially dads over 35 who grew up with the Ninja Turtles in various iterations). I would think longtime fans would be enamored with what the film does to their classic heroes, because a person like me who had very limited knowledge of the characters was quickly won over.\r\n\r\nFilms like “Teenage Mutant Ninja Turtles: Mutant Mayhem” and “Spider-Man: Across the Spider-Verse” are exciting because not only are they breathing exciting life into the animation genre, they are setting the highest standards for quality, edgy animated films for adults. We should all hope for more projects of this caliber.", "created_at": "2023-08-04T07:05:18.216Z"}, {"movie_id": 614930, "review_id": "64cf724b303c8500e338e008", "author_rating": 6.0, "review_text": "Helpfully, for those us who are not turtle-heads, we are provided with a little potted history of just how the four shelled super-heroes were discovered in a sewer by 'Splinter\" having had a drink of some secret formula that had accidentally dropped down a sluice. Spin forwards a few years and the four are living a clandestine life, discouraged by their father with having anything to do with human beings. On one evening though, whilst out \"shopping\", they encounter \"April\" who gets her scooter pinched. They quickly try to get it back for her, she follows them and a series of adventures follow as we are quickly immersed in a city-wide battle against other, less convivial, mutants bent on destruction and mayhem. I was expecting little from this but it is actually quite an enjoyable action-packed animation. Some effort has been put into the script to enable some fun in the dialogue and for the characterisations to not just be sword-swinging would-be painters, but to have just the tiniest element of depth to them as the story develops. I didn't love the slightly bloated-head style of the animation, the proportion to the rest of their bodies was all a bit \"Scooby Do\" and I found there to be way too much soundtrack that drowned out the speech a lot of the time, but it was better than I was anticipating...", "created_at": "2023-08-06T10:13:31.532Z"}, {"movie_id": 614930, "review_id": "64d20b444d67910139efa85e", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"Teenage Mutant Ninja Turtles: Mutant Mayhem is a whole lot of fun! It delivers everything TMNT fans wished for: entertaining turtle banter, badass ninja action - best sequence belongs to Jackie Chan's Splinter - and an awesome score.\r\n\r\nThe animation style inspired by purposely exaggerated sketches from director Jeff Rowe's teenage years - much like The Mitchells vs. the Machines and Into the Spider-Verse - perfectly fits the lighthearted atmosphere of the source material, and brings the famous turtles to the big screen in what is arguably the best film adaptation of the franchise.\r\n\r\nBring me the sequel!\"\r\n\r\nRating: B", "created_at": "2023-08-08T09:30:44.704Z"}, {"movie_id": 614930, "review_id": "64f436a3caa50800c888918d", "author_rating": 1.0, "review_text": "Why did they turn April into an obese black girl?\r\n\r\nOh, right right right... Woke brain cancer.", "created_at": "2023-09-03T07:32:51.662Z"}]