[{"movie_id": 553, "review_id": "5e8a2f7a3a965000164a123f", "author_rating": 9.0, "review_text": "Rapists and murders may be the victims according to you, but I, I call them dogs. And if they're lapping up their own vomit, the only way to stop them is with a lash. \r\n\r\nA sparse soundstage is stylishly utilized to create a minimalist small-town setting in which a mysterious woman named Grace (Nicole Kidman) hides from the criminals who pursue her. The town locals at first decide to shield Grace, and in return she openly works labour tasks for them to work off her gratitude. It's not long, however, before the residents of Dogville begin to show their true teeth...\r\n\r\nOne thing is an absolute, Lars Von Trier knows how to push the buttons of critics and movie lovers alike. Dogville proved to be a case in point, a film that saw some high profile film critics renounce the director as anti American - even anti human, while others lauded the \"Great Dane\" as a visionary and a director of bravura panache. The point is, and it's a fact, there is no guarantee that Dogville will hit the spot of every first time viewer venturing in for the challenge.\r\n\r\nAs it happens, I'm very much in the plus camp here, to me it's not only brave in style of production, but also it's narratively as caustic as anything so called \"anti human\" directors like Kubrick, Godard etc ever produced. The bareness of the sound stage setting, where we can see the workings of all residents of Dogville going about their respective business, very much shows there is no hiding place, all the bile strewn movements/ignorance is laid bare for all to see, we are all complicit.\r\n\r\nThere's an outstanding cast assembled, fronted by Kidman (never more beautiful and never better as an actress), with support coming from Paul Bettany, Stellan Skarsgård, Lauren Bacall, Ben Gazzara, Patricia Clarkson, James Caan, Philip Baker Hall and others who give their all for their director. It's often charged that Trier is a misogynist, personally I don't see it that way, more so as Dogville reaches its crushing climax. This easily could have been shaved of 20 minutes from the run time, but it has to be said that Von Trier doesn't waste a single frame here.\r\n\r\nRoll your dice and take your chance, you will either love it or hate it, or admire or admonish, what isn't in doubt is that you will never ever forget watching Dogville. 9/10", "created_at": "2020-04-05T19:20:26.661Z"}, {"movie_id": 553, "review_id": "64e86a8b1feac100e169eff4", "author_rating": 7.0, "review_text": "I reckon this is my favourite Lars Von Trier film. Set amidst some eerily basic staging purporting to be an hick American town, we see the arrival of \"Grace\" (Nicole Kidman). Now she is attired in furs and lace and is clearly on the run from something, or someone. Shortly after, some hoods turn up in the town and leave a card in case she ever shows up... The townsfolk are ostensibly nice enough - if rather an eclectic mix, and local \"Tom\" (Paul Bettany) takes a bit of a shine to her. Can she stay? Initially they can find nothing for her to do, but gradually they seem to embrace her and she becomes an integral - almost enthralled - member of their society. Some rather odd manipulation from the young \"Jason\" (Miles Purinton) causes things to start to take a darker turn, though, and she and her as yet unfulfilled beau decide that it might be time for her to go. Will she be permitted? This story is darkly brutal at times, the harshness of her increasingly inhumane treatment is exemplified by the presence of a cast that features an almost menacing Lauren Bacall, as well as effective contributions from Blair Brown, Ben Gazzara and Philip Baker Hall who all demonstrate clearly just how fake the facade in this town is. Kidman is superb, probably the best I have seen her on screen. She has a potent chemistry with the on-form Bettany and the stage lighting, paucity of settings and the overall simplicity of the production works really well before an ending that I feared might not deliver as I wanted - but boy, it does! This is well worth a watch. It illustrates the best and worst in human nature - but with the emphasis very much more on the latter!", "created_at": "2023-08-25T08:47:07.214Z"}, {"movie_id": 553, "review_id": "655a25947f054018d6f45db9", "author_rating": 10.0, "review_text": "SPOILERS\r\n\r\nOn my second watch of this film, I am now convinced that Von Trier is the Ingmar Bergman of the 20th century. No other director today digs so profoundly into the human soul, or in such a creative way. And no other director has been so daring with visual translation.\r\n\r\nOn this watching of Dogville, it finally hit me that this story is the life story of a woman in an abusive relationship. Maybe inspired in part by Polly's \"Seeräuberjenny\" from Threepenny Opera, or not. Nonetheless, the film script is the same as what might be experienced by a woman drawn into a relationship by a seemingly enchanting man(town). Eventually, as it turns exploitive and finally abusive, she becomes numb and resigned. Some women never escape that stage. Some women are able to escape and most of those are murdered by the abuser. And a few actually murder the abuser. Perhaps the latter is the only way out.", "created_at": "2023-11-19T15:11:16.585Z"}]