[{"movie_id": 406761, "review_id": "5b193fe30e0a261f8d0073fd", "author_rating": null, "review_text": "Los Angeles of 2028 is a riot laden area where Martial Law is the norm and brutality is a way of life. Amidst this setting, the Hotel Artemis is open for business.. The Artemis is not your typical hotel as it provides emergency medical services to members who engage in criminal activities.\r\n\r\nThe Nurse (Jodie Foster) runs the facility and with the help of her massive Orderly Everest (Dave Bautista), they ensure that only members get admitted and follow the rules as well as receive state of the art care while in the facility.\r\n Guests at the facility are giving names based on the suite in which they are assigned which involve geographical locales and there are a very strict set of rules they must follow such as no guns, bombs, killing other guests, and so on.\r\nThe Hotel Artemis is not a simple stitch and bandage facility as they offer advanced medical services such as Nanites, replacement organ printing, robotic A.I. medical treatment and other services which in 2018 seem like Science Fiction.\r\nEnter Waikiki (Sterling K. Brown), who has tried to leave his criminal past behind him yet was savvy enough to keep paying his membership fees at the Artemis all the while. He and his brother have been injured in a heist and with the city under a deadly riot, they make their way to the Artemis to get treatment and hide out from the chaos outside.\r\n\r\nThanks to their services, the hotel is rarely empty and an Arms Dealer named Acapulco (Charlie Day), and an assassin named Nice (Sofia Boutella), are also in residence. The fact that Nice and Waikiki have a past association makes things a bit interesting as guests are always mindful of those around them even though the strict rules of membership exist to ward off any threats or danger to the guests or staff.\r\nComplications arise when the near capacity hotel is informed that the Wolf King of L.A. (Jeff Goldblum) is en- route. The Nurse opts to follow the rules of first come first served and in doing so enrages his son (Zachary Quinto), who decided to barricade the Hotel to make sure nobody gets in before his father, who incidentally owns the facility.\r\n\r\nAs if this was not enough of a complication, a police officer from troubled past of The Nurse arrives begging for help which sets a very dangerous chain of events into motion.\r\n\r\nThe film is a very fresh and entertaining story filled with interesting characters, strong performances, and just enough action to keep the film moving along but yet keeping the focus as a character based drama.\r\n\r\nFirst time Director Drew Pearce gets the most of his cast and has used his script to create a very entertaining and unique film that is well worth a watch. It is so nice to see Jodie Foster showing us once again that she is one of the most gifted actresses of our time as the two-time Oscar winner goes all in to portray a very damaged and troubled character who for what she lacks in glamour; more than makes up for with a determined strength.\r\n\r\nI hope this film is a success as I would love to see more stories from the Hotel as I really enjoyed the film from start to finish.\r\n\r\n4 stars out of 5", "created_at": "2018-06-07T14:23:31.615Z"}, {"movie_id": 406761, "review_id": "5bb85622c3a3682437005ee5", "author_rating": 7.0, "review_text": "Aaaah near-future Los Angeles, will you ever be portrayed as anything other than a crime-ridden, riotous hellscape? Probably not. And honestly, I'm pretty okay with that. Either way, despite that being the exact setting of _Hotel Artemis_, it has surprisingly little impact on the tale, which takes place almost entirely within the titular hotel. It's good, and everyone is good in it, plus you've got the #aesthetic to take into account, which all in all is more than enough for me.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-10-06T06:28:50.947Z"}, {"movie_id": 406761, "review_id": "5cd9fc63c3a3683c67c4054a", "author_rating": 5.0, "review_text": "**_Aesthetically pleasing, but the narrative is predictable and clichéd_**\r\n\r\n> _There's an interesting thing that runs through the movie, which is that there's this...So what happens in_ Artemis _is that it's set mostly inside this secret hospital for criminals in Los Angeles in 2028, and it's about what happens when the wrong mix of people end up in that hospital, but all the while there is this backdrop of the biggest riot in LA history, the clear water riots, which are water based, drought based riots, water privatization riots in fact. I really wanted this thing where all the way through_ _the film, we are led to believe by the media in the movie and by the way some of the characters talk about it, that we're safe in here in the place that we pay for, and the trouble is this kind of faceless, multi ethnic mob on the outside, and that actually we always think the problem is on the outside, but really, the problem is on the inside. That's absolutely what the point of_ Artemis _is; we kind of demonise the outside world, but the real demons are our own._\r\n\r\n- Drew Pearce; \"_Hotel Artemis_ Director Drew Pearce on Making His Personal Genre Movie, His Influences, and More\" (Jack Giroux); _Slash Film_ (June 7, 2018)\r\n\r\n_Hotel Artemis_ is a film which doesn't do a great deal wrong. However, it is also a film which doesn't do a great deal right. It just kind of hangs in mid-air, with clichéd characters acting in clichéd ways and having clichéd conversations. And then it ends. It's not actually _about_ anything. It's also predictable, with precious little substance. It looks pretty though.\r\n\r\nIn 2028, riots are tearing Los Angeles apart. The film takes place primarily in the eponymous Hotel Artemis, a secret hospital for criminals in the heart of the city. The motley crew of characters, many of whom are known only by the name of the room in which they're staying, include Waikiki (Sterling K. Brown) and his brother Honolulu (Brian Tyree Henry), bank robbers who have been involved in a shootout with police; Nice (Sofia Boutella), an assassin who \"_only kills important people_\", and just so happens to be Waikiki's ex-girlfriend; and Acapulco (a spectacularly miscast Charlie Day), a weapons dealer and all round weasel. Also present are The Wolf King (Jeff Goldblum), Los Angeles's most feared gangster, who also finances the hospital, his incompetent son, Crosby (an underutilised Zachery Quinto), and Morgan (Jenny Slate), a cop injured in the riots. The hospital is run by \"Nurse\" (Jodie Foster), an agoraphobic alcoholic haunted by visions of her past, with porter duties handled by Everest (Dave Bautista). The hospital functions because all guests must adhere to a rigid set of rules (the first of which is \"_don't kill the other patients_\") and a strict no weapons policy.\r\n\r\nSounds pretty interesting doesn't it? It's not. The dialogue is awful, the narrative beats can be seen coming a mile away, and the characters are all archetypes, with only Nurse really fleshed out to any degree. There's the loud-mouth snivelling weapons dealer, the gorgeous but oh-so-deadly assassin, the criminal kingpin and his screw-up son who just wants to be like dad, the skilled bank robber who spends most of his time trying to get himself out of the trouble caused by his unreliable brother, and the tough-as-old-boots medical professional who just wants to help people when in actual fact, she's beyond help herself. The premise may be reasonably interesting, but, in his debut feature, writer/director Drew Pearce undermines it by populating the _milieu_ with cardboard cut-outs instead of characters. True, most of the actors give it their all (Bautista in particular gives a performance far superior to the material with which he has to work), but there's just no substance here, no depth. There are simply too many clichés at every level to be able to overlook them.\r\n\r\nYes, it's an original(ish) idea made with a small(ish) budget, which is exactly what we need more of these days, when every second film is a CGI-infested remake, comic book adaptation, or sequel (or a CGI-infested remake of a sequel to a comic book adaptation). However, an original idea is all very well and good, but it can only take you so far; the execution has to be there as well, and this is where _Hotel Artemis_ falls down. It's simply not an especially well-made film. Pearce does a reasonably good job with the directorial side of things, as aesthetically, the hotel is really intriguing, with a nice use of primary colours and a well-conceived juxtaposition of modern technology and 3D printers with retro décor and secret passages. In terms of plot, however, there's just nothing to latch onto or get your teeth into. None of the characters really do or say anything very interesting, and a half-hour into the film, as it became increasingly apparent that none of them were going to be developed to any great degree, I just stopped caring.", "created_at": "2019-05-13T23:23:15.644Z"}, {"movie_id": 406761, "review_id": "63c1f22ea5743d007d11f980", "author_rating": 10.0, "review_text": "It was made in the wrong decade. It's very much a toned down esthetic heavy middle 90s science-fiction romp with an Oliver Stone ensemble cast. It's very retro-distopian-science-fiction with a low budget that relies on the look to make the film.\r\n\r\nThat being said, it's not bad. In all honesty, it's actually pretty entertaining if you walk into it expecting only what it promises to be, a quasi-indie film that's made to entertain and nothing more.\r\n\r\nThe premise is fun. There is talent in the cast (and more notable celebrities than there should be). It looks cool. The action is a ride. The dialogue is hip. And the characters are developed only just enough to advance you through the film.\r\n\r\nAnd, in the end, you walk away satisfied and entertained, so, really, it delivers exactly what it promises to.", "created_at": "2023-01-14T00:07:10.869Z"}]