[{"movie_id": 24428, "review_id": "4fce8f8819c29523880000de", "author_rating": 8.0, "review_text": "With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.", "created_at": "2012-06-05T23:00:24.000Z"}, {"movie_id": 24428, "review_id": "59f29e47c3a3687126003ccd", "author_rating": 9.0, "review_text": "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:47:35.267Z"}, {"movie_id": 24428, "review_id": "5a657f809251410b2d030491", "author_rating": null, "review_text": "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.", "created_at": "2018-01-22T06:06:56.333Z"}, {"movie_id": 24428, "review_id": "5c8426f992514127631f9b36", "author_rating": 8.0, "review_text": "One of the few movies to actually make me feel like a kid again, Joss Whedon was the perfect filmmaker to do this film. Everyone gets their time to shine. The script juggles every plot point and character moment with clarity and ease. It's funny, smart, and visually jaw dropping. Definitely lived up to the five movie hype.", "created_at": "2019-03-09T20:50:01.703Z"}, {"movie_id": 24428, "review_id": "5cad1876c3a36812a018fc9c", "author_rating": 8.5, "review_text": "I give this 10 Stars based on it being not only better than the trailer and the hype made me thing it would be, but also that it was the first time anything the size and scope of the Marvel Cinematic universe was pulled off successfully. Having Joss direct this movie lives and dies on character interaction. This movie is on the definitive list in my opinion even just for that.", "created_at": "2019-04-09T22:11:02.850Z"}, {"movie_id": 24428, "review_id": "5d46cf540f2fbd7864efbe30", "author_rating": 9.0, "review_text": "Everything that's happening, the things that are about to come to light, people might just need a little old fashioned.\r\n\r\nThe Avengers (AKA: Avengers Assemble) is written and directed by Joss Whedon, with Zak Penn co-writing the story. It stars Robert Downey Junior, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddlestone, Clark Gregg, Samuel L. Jackson, Cobie Smulders and Stellan Skarsgard. Music is scored by Alan Silvestri and cinematography by Seamus McGarvey.\r\n\r\nAsgardian outcast Loki (Hiddlestone) has struck a deal with the Chitauri to exchange the Tesseract for an army with which he can attack Earth and thus control it. With the Earth in mortal danger, S.H.I.E.L.D director Nick Fury (Jackson) activates the Avengers Initiative; a collection of super heroes and deadly assassins who, if they can actually come together as one united force, hold the fate of the Earth in their hands.\r\n\r\nI have no real frame of reference with The Avengers comic book world, when I was young I read a bit of Spidey, Batman and was kind of partial to The Fantastic Four, but I really don't remember story lines and gave up reading that sort of stuff once sport and exams came into my life. I love movies and as I enter the later stages of my forties I'm pleased to say I have a wide range of film genre interests. I have very much enjoyed The Avengers solo films so far, with the exception of Iron Man 2 which quite frankly is average at best, but the reality is that if The Avengers failed as a movie, that Whedon got it so wrong, then I wouldn't be foaming at the mouth or proclaiming that the director be stripped naked and whipped around the streets of Hollywood! As it is, with one or two minor irks aside, The Avengers is about as much fun as I have had with a movie in quite a few years.\r\n\r\nI wouldn't know if the makers got the essence right, or if the story is at one in the Marvel Avengers Universe, I just know that it is a right old blast and made a colossal amount of money at the box office, even trumping The Dark Knight Rises in that department. It's a film full of derring-do heroics, ripe witticisms, wonderfully staged action, simmering sexual tensions, ego collisions, charm, heart and splendid human interactions. It looks fabulous on Blu-ray, the art design, the colour photography and Silvestri's score rumbles like thunder and crackles like lightning, just as a super hero movie score should do. The cast performances are hugely enjoyable as they bounce off of one and other, feeding off the respective thespian energy with a knowing of the right tone to make this colourful comic book world be all that it can be. While Whedon, with a weight of expectation akin to Atlas holding the World on his shoulders, comes through with flying colours with astute pacing and an impressive marshaling of an acting army.\r\n\r\nFlaws? Jackson's Nick Fury could have done with more screen time and Cobie Smulders is sadly short changed as well. The Chitauri are only really a threat because of their sheer numbers, not because of any great alien design, and, well, The Hulk CGI hasn't really advanced much from the 2008 version, but really these are small itches rather than big ones. Is The Avengers the best film of 2012? It will be seen as such for many fans of the source(s) who have waited with baited breath for this coming together of their heroes, and that notion really shouldn't irk the more highbrow film fans out there. Me? No it isn't the best film of 2012, but as I found my self perched on the edge of my seat as the finale unfurls in a wave of explosive heroic energy, and I caressed my ribs from laughing out loud, I knew then that undoubtedly The Avengers is the most fun film of 2012. 9/10", "created_at": "2019-08-04T12:28:04.980Z"}, {"movie_id": 24428, "review_id": "5dc32f2f5aadc4001520e0dd", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-11-06T20:38:07.253Z"}, {"movie_id": 24428, "review_id": "5dc389f37d2bc100133d06df", "author_rating": null, "review_text": "Definitely the greatest superhero movie of all time. Marvel has set the bar high with this one and so far, they're doing a good job of keeping up with that despite not being able to raise it higher!", "created_at": "2019-11-07T03:05:23.344Z"}, {"movie_id": 24428, "review_id": "5dc3930999259c00157aa7cb", "author_rating": null, "review_text": "I found it creative of Marvel to introduce each character one by one. It really set the tone and had me looking forward to what's gonna happen.", "created_at": "2019-11-07T03:44:09.147Z"}, {"movie_id": 24428, "review_id": "5dc3993d470ead00138cf1ec", "author_rating": null, "review_text": "Perfect casting! You can really see and feel that the actors have great chemistry both in and out of their characters.", "created_at": "2019-11-07T04:10:37.105Z"}, {"movie_id": 24428, "review_id": "5dc56e556f8d950013c2d977", "author_rating": null, "review_text": "Wonderful movie to watch if you want to be entertained and not think about the plot too much.", "created_at": "2019-11-08T13:32:05.653Z"}, {"movie_id": 24428, "review_id": "5dc579c56f8d950010c2f5c5", "author_rating": null, "review_text": "When you have a bunch of flashy superheroes fighting supernatural, extraterrestrial villains from another dimension, it can get pretty hard to highlight each of their strengths,  but Marvel pulled it off with this one!", "created_at": "2019-11-08T14:20:53.615Z"}, {"movie_id": 24428, "review_id": "5e00e8fb75110d0018d85d20", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-12-23T16:19:07.269Z"}, {"movie_id": 24428, "review_id": "5e00ee5565686e0013987f15", "author_rating": null, "review_text": "I tried my best to avoid getting carried away by the hype of this movie because nowadays most of the movies that are too much hyped end up just being disappointments but I'm glad to say that I WAS NOT DISAPPOINTED when this came out.", "created_at": "2019-12-23T16:41:57.040Z"}, {"movie_id": 24428, "review_id": "5e0102250284200014af5898", "author_rating": null, "review_text": "One word for this movie: AWESOME. It’s an amazing film and has everything a superhero fanboy hoped for and more.", "created_at": "2019-12-23T18:06:29.819Z"}, {"movie_id": 24428, "review_id": "5e011ac665686e0018983449", "author_rating": null, "review_text": "One of the many things I loved in this film was the conflict between Iron Man and Captain America for leadership and how the two differ in their approach. A very unique way of building a team of superheroes.", "created_at": "2019-12-23T19:51:34.381Z"}, {"movie_id": 24428, "review_id": "5e02862b26dac10012674852", "author_rating": null, "review_text": "The cast really delivered. Sure they were playing the roles of superheroes but you can really see and feel a deeper level of emotions in their performance.", "created_at": "2019-12-24T21:42:03.600Z"}, {"movie_id": 24428, "review_id": "5e08f6e5a1c59d0018aac032", "author_rating": null, "review_text": "Kudos to the fight choreographers who designed all the action sequences for this movie. They really did a good one!", "created_at": "2019-12-29T18:56:37.052Z"}, {"movie_id": 24428, "review_id": "5e091b9d5ff34e0013b9ce5f", "author_rating": null, "review_text": "If you haven't seen this film yet, do yourself a favor and remain unspoiled. This is one of the movies that need to be savored.", "created_at": "2019-12-29T21:33:17.599Z"}, {"movie_id": 24428, "review_id": "5e09b284383df20018b90384", "author_rating": null, "review_text": "Good fighting sequences but camerawork feels too crazy and made it quite difficult to fully enjoy the great choreography.", "created_at": "2019-12-30T08:17:08.404Z"}, {"movie_id": 24428, "review_id": "5e09b5c86d97e600173c5508", "author_rating": null, "review_text": "I thought I would be able to enjoy it upon hearing that it was gonna be 3 hours long but it turned out to be too much. Watching it felt like a drag and was too melo-dramatic for a superhero film.", "created_at": "2019-12-30T08:31:04.632Z"}, {"movie_id": 24428, "review_id": "5e0e0c41fd4f8000155f3cf4", "author_rating": null, "review_text": "It was a great idea to bring together this group of amazing superheroes and at the same time amazing actors to create a top-class superhero film.", "created_at": "2020-01-02T15:29:05.209Z"}, {"movie_id": 24428, "review_id": "5e0e160b6dc6c000134d1fa6", "author_rating": null, "review_text": "I appreciate how they made sure to introduce each character before bringing them together for an epic fight to defend the Earth. It gives much more depth to each superhero.", "created_at": "2020-01-02T16:10:51.122Z"}, {"movie_id": 24428, "review_id": "5e0e200d12c60400143fa896", "author_rating": null, "review_text": "I gotta admit I was not ready for all that shaky-cam action. I mean, you could clearly see that the choreography for the fight scenes was good enough for a superhero movie, but why did you have to add so much shaking and cutscenes?", "created_at": "2020-01-02T16:53:33.128Z"}, {"movie_id": 24428, "review_id": "5e0e29dc6dc6c000154cd86b", "author_rating": null, "review_text": "I'm not exaggerating when I say that this is the best superhero film of all time!", "created_at": "2020-01-02T17:35:24.070Z"}, {"movie_id": 24428, "review_id": "5e0e4062c2f44b0013301af8", "author_rating": null, "review_text": "The title says it all, you will really MARVEL at the awesomeness of this film. Where else can you find a film with more superheroes than you can imagine working together to save the Earth?", "created_at": "2020-01-02T19:11:30.020Z"}, {"movie_id": 24428, "review_id": "5e0e528712c6040017401e24", "author_rating": null, "review_text": "Marvel really outdid themselves on this one. This is one of their greatest works to date and only a handful of films can compare to this one - and all of them have mostly been Marvel too!", "created_at": "2020-01-02T20:28:55.182Z"}, {"movie_id": 24428, "review_id": "5e0f03159f37b00015561eb1", "author_rating": null, "review_text": "Are you a fan of epic adventure movies? Then this is your dream come true! Truly this is the ultimate superhero mash-up and it's executed perfectly. Props to the filmmakers for taking the time to design it to be more than just a superhero film packed with action scenes and adding depth to each character.", "created_at": "2020-01-03T09:02:13.271Z"}, {"movie_id": 24428, "review_id": "5e0f2bcf663b8700177ef84f", "author_rating": null, "review_text": "More than just a superhero film, this movie had a definite soul and smart plot as well. It's a guarantee that superhero fans will love it but at the same time, other, more common, moviegoers will find it entertaining too.,", "created_at": "2020-01-03T11:55:59.996Z"}, {"movie_id": 24428, "review_id": "5e104c6cd64ac20018608071", "author_rating": null, "review_text": "The best thing about this movie is that it gave each superhero their own unique way of contributing to the team. It wasn't just another film wherein there's one superhero that stands out among the rest while the rest got overshadowed by this main character.", "created_at": "2020-01-04T08:27:24.569Z"}, {"movie_id": 24428, "review_id": "5e1210fae78e2d0017768edd", "author_rating": null, "review_text": "Stan Lee cameos are the best! It's too bad he won't be around to do that now. It was one of the things I looked forward to in each of the Marvel movies.", "created_at": "2020-01-05T16:38:18.235Z"}, {"movie_id": 24428, "review_id": "5e1244e15907de0017de881d", "author_rating": null, "review_text": "This is not a good movie... It's a GREAT MOVIE! Filmmakers did an awesome job taking the storyline from the comic books and making sure that most of it was kept.", "created_at": "2020-01-05T20:19:45.004Z"}, {"movie_id": 24428, "review_id": "5e125949d64ac2001864cba3", "author_rating": null, "review_text": "Superhero with not only super-awesome heroes but superb script as well. For an action adventure film, the writing is extremely detailed and that's what appealed to me the most.", "created_at": "2020-01-05T21:46:49.742Z"}, {"movie_id": 24428, "review_id": "5e12c5af9020120013b74f2e", "author_rating": null, "review_text": "I don't think Marvel could've found a better cast that could've played the characters!", "created_at": "2020-01-06T05:29:19.509Z"}, {"movie_id": 24428, "review_id": "5e12c9c68741c400123d9d8a", "author_rating": null, "review_text": "If you're a comic book fan like me, you'd understand that usually, superhero storylines adapt a more straight, serious tone, but with the Avengers you have the great storyline of a superhero film and the comedic relief of banter.", "created_at": "2020-01-06T05:46:46.176Z"}, {"movie_id": 24428, "review_id": "5e12cdc25907de0012deea04", "author_rating": null, "review_text": "The incredible mix of superheroes together with their personalities and powers is a guarantee to impress any sort of audience.", "created_at": "2020-01-06T06:03:46.319Z"}, {"movie_id": 24428, "review_id": "5e12d1cafc5f06001590b427", "author_rating": null, "review_text": "Count on the Avengers to make man-tights and capes look more fashionable than ever! With incredible fight choreography, it's hard not to be impressed.", "created_at": "2020-01-06T06:20:58.799Z"}, {"movie_id": 24428, "review_id": "5e20d3be8f26bc001171c86e", "author_rating": null, "review_text": "It takes more than just great actors to make a successful film so for the people behind the curtains making everything even more awesome, I want to give my thanks for blessing us with this masterpiece of a film!", "created_at": "2020-01-16T21:21:02.781Z"}, {"movie_id": 24428, "review_id": "5e20ddf38f26bc001571bb9e", "author_rating": null, "review_text": "When you have an amazing team of actors with great chemistry both on and off screen, a team of directors who are passionate about what they do, and a production crew that's always coming up with new ways to reinvent the superhero genre, then you've got a successful film like this.", "created_at": "2020-01-16T22:04:35.109Z"}, {"movie_id": 24428, "review_id": "5eddc7268d52c90022a60a4b", "author_rating": 8.0, "review_text": "Probably only my third time watching and still a really entertaining action film with good banter amongst the Avengers and the team-up in the third act really work well. The whole banding together with the death of Agent Coulson still doesn't feel right, good character but didn't think he was so beloved to be a catalyst for them. Minor point just something that stood out then, and now. Also a bit hollow given, IIRC, was alive and well for the Agents of SHIELD TV series... **4.25/5**", "created_at": "2020-06-08T05:05:42.360Z"}, {"movie_id": 24428, "review_id": "600233081c635b0055ef5f7e", "author_rating": 7.0, "review_text": "The last hour is a lot of fun, but I found the opening chunk disappointing.\r\n\r\nI was expecting wall-to-wall action, pretty much from the start - especially given the forces that join together. However, I felt the first half of <em>'The Avengers'</em> as slow. What also didn't help is that the villain, carried over from a preceding MCU film, isn't super interesting - we also don't see the antagonist's earlier film counterpart for a fair few scenes, which felt too delayed.\r\n\r\nThe last half is much better, which allowed me to enjoy myself properly. Robert Downey Jr., while not as entertaining as he is on his own, brings goodness, as do the likes of Chris Evans and Chris Hemsworth.\r\n\r\nI'm not a big fan of recasts, though Mark Ruffalo as Hulk is a positive one; even if that took a bit away from the novelty of all the superheroes joining, given we hadn't seen Ruffalo himself before. Added to Scarlett Johansson's Black Widow, at least in terms of the film franchise, getting major screen time out of nowhere - having been a bit part character in her debut MCU appearance.\r\n\r\nThe music is noteworthy, while everything looks brilliant. Overall and in short: It's a fun, good action film - I just expected greater.", "created_at": "2021-01-16T00:27:52.914Z"}, {"movie_id": 24428, "review_id": "4fce8f8819c29523880000de", "author_rating": 8.0, "review_text": "With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.", "created_at": "2012-06-05T23:00:24.000Z"}, {"movie_id": 24428, "review_id": "59f29e47c3a3687126003ccd", "author_rating": 9.0, "review_text": "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:47:35.267Z"}, {"movie_id": 24428, "review_id": "5a657f809251410b2d030491", "author_rating": null, "review_text": "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.", "created_at": "2018-01-22T06:06:56.333Z"}, {"movie_id": 24428, "review_id": "5c8426f992514127631f9b36", "author_rating": 8.0, "review_text": "One of the few movies to actually make me feel like a kid again, Joss Whedon was the perfect filmmaker to do this film. Everyone gets their time to shine. The script juggles every plot point and character moment with clarity and ease. It's funny, smart, and visually jaw dropping. Definitely lived up to the five movie hype.", "created_at": "2019-03-09T20:50:01.703Z"}, {"movie_id": 24428, "review_id": "5cad1876c3a36812a018fc9c", "author_rating": 8.5, "review_text": "I give this 10 Stars based on it being not only better than the trailer and the hype made me thing it would be, but also that it was the first time anything the size and scope of the Marvel Cinematic universe was pulled off successfully. Having Joss direct this movie lives and dies on character interaction. This movie is on the definitive list in my opinion even just for that.", "created_at": "2019-04-09T22:11:02.850Z"}, {"movie_id": 24428, "review_id": "5d46cf540f2fbd7864efbe30", "author_rating": 9.0, "review_text": "Everything that's happening, the things that are about to come to light, people might just need a little old fashioned.\r\n\r\nThe Avengers (AKA: Avengers Assemble) is written and directed by Joss Whedon, with Zak Penn co-writing the story. It stars Robert Downey Junior, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddlestone, Clark Gregg, Samuel L. Jackson, Cobie Smulders and Stellan Skarsgard. Music is scored by Alan Silvestri and cinematography by Seamus McGarvey.\r\n\r\nAsgardian outcast Loki (Hiddlestone) has struck a deal with the Chitauri to exchange the Tesseract for an army with which he can attack Earth and thus control it. With the Earth in mortal danger, S.H.I.E.L.D director Nick Fury (Jackson) activates the Avengers Initiative; a collection of super heroes and deadly assassins who, if they can actually come together as one united force, hold the fate of the Earth in their hands.\r\n\r\nI have no real frame of reference with The Avengers comic book world, when I was young I read a bit of Spidey, Batman and was kind of partial to The Fantastic Four, but I really don't remember story lines and gave up reading that sort of stuff once sport and exams came into my life. I love movies and as I enter the later stages of my forties I'm pleased to say I have a wide range of film genre interests. I have very much enjoyed The Avengers solo films so far, with the exception of Iron Man 2 which quite frankly is average at best, but the reality is that if The Avengers failed as a movie, that Whedon got it so wrong, then I wouldn't be foaming at the mouth or proclaiming that the director be stripped naked and whipped around the streets of Hollywood! As it is, with one or two minor irks aside, The Avengers is about as much fun as I have had with a movie in quite a few years.\r\n\r\nI wouldn't know if the makers got the essence right, or if the story is at one in the Marvel Avengers Universe, I just know that it is a right old blast and made a colossal amount of money at the box office, even trumping The Dark Knight Rises in that department. It's a film full of derring-do heroics, ripe witticisms, wonderfully staged action, simmering sexual tensions, ego collisions, charm, heart and splendid human interactions. It looks fabulous on Blu-ray, the art design, the colour photography and Silvestri's score rumbles like thunder and crackles like lightning, just as a super hero movie score should do. The cast performances are hugely enjoyable as they bounce off of one and other, feeding off the respective thespian energy with a knowing of the right tone to make this colourful comic book world be all that it can be. While Whedon, with a weight of expectation akin to Atlas holding the World on his shoulders, comes through with flying colours with astute pacing and an impressive marshaling of an acting army.\r\n\r\nFlaws? Jackson's Nick Fury could have done with more screen time and Cobie Smulders is sadly short changed as well. The Chitauri are only really a threat because of their sheer numbers, not because of any great alien design, and, well, The Hulk CGI hasn't really advanced much from the 2008 version, but really these are small itches rather than big ones. Is The Avengers the best film of 2012? It will be seen as such for many fans of the source(s) who have waited with baited breath for this coming together of their heroes, and that notion really shouldn't irk the more highbrow film fans out there. Me? No it isn't the best film of 2012, but as I found my self perched on the edge of my seat as the finale unfurls in a wave of explosive heroic energy, and I caressed my ribs from laughing out loud, I knew then that undoubtedly The Avengers is the most fun film of 2012. 9/10", "created_at": "2019-08-04T12:28:04.980Z"}, {"movie_id": 24428, "review_id": "5dc32f2f5aadc4001520e0dd", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-11-06T20:38:07.253Z"}, {"movie_id": 24428, "review_id": "5dc389f37d2bc100133d06df", "author_rating": null, "review_text": "Definitely the greatest superhero movie of all time. Marvel has set the bar high with this one and so far, they're doing a good job of keeping up with that despite not being able to raise it higher!", "created_at": "2019-11-07T03:05:23.344Z"}, {"movie_id": 24428, "review_id": "5dc3930999259c00157aa7cb", "author_rating": null, "review_text": "I found it creative of Marvel to introduce each character one by one. It really set the tone and had me looking forward to what's gonna happen.", "created_at": "2019-11-07T03:44:09.147Z"}, {"movie_id": 24428, "review_id": "5dc3993d470ead00138cf1ec", "author_rating": null, "review_text": "Perfect casting! You can really see and feel that the actors have great chemistry both in and out of their characters.", "created_at": "2019-11-07T04:10:37.105Z"}, {"movie_id": 24428, "review_id": "5dc56e556f8d950013c2d977", "author_rating": null, "review_text": "Wonderful movie to watch if you want to be entertained and not think about the plot too much.", "created_at": "2019-11-08T13:32:05.653Z"}, {"movie_id": 24428, "review_id": "5dc579c56f8d950010c2f5c5", "author_rating": null, "review_text": "When you have a bunch of flashy superheroes fighting supernatural, extraterrestrial villains from another dimension, it can get pretty hard to highlight each of their strengths,  but Marvel pulled it off with this one!", "created_at": "2019-11-08T14:20:53.615Z"}, {"movie_id": 24428, "review_id": "5e00e8fb75110d0018d85d20", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-12-23T16:19:07.269Z"}, {"movie_id": 24428, "review_id": "5e00ee5565686e0013987f15", "author_rating": null, "review_text": "I tried my best to avoid getting carried away by the hype of this movie because nowadays most of the movies that are too much hyped end up just being disappointments but I'm glad to say that I WAS NOT DISAPPOINTED when this came out.", "created_at": "2019-12-23T16:41:57.040Z"}, {"movie_id": 24428, "review_id": "5e0102250284200014af5898", "author_rating": null, "review_text": "One word for this movie: AWESOME. It’s an amazing film and has everything a superhero fanboy hoped for and more.", "created_at": "2019-12-23T18:06:29.819Z"}, {"movie_id": 24428, "review_id": "5e011ac665686e0018983449", "author_rating": null, "review_text": "One of the many things I loved in this film was the conflict between Iron Man and Captain America for leadership and how the two differ in their approach. A very unique way of building a team of superheroes.", "created_at": "2019-12-23T19:51:34.381Z"}, {"movie_id": 24428, "review_id": "5e02862b26dac10012674852", "author_rating": null, "review_text": "The cast really delivered. Sure they were playing the roles of superheroes but you can really see and feel a deeper level of emotions in their performance.", "created_at": "2019-12-24T21:42:03.600Z"}, {"movie_id": 24428, "review_id": "5e08f6e5a1c59d0018aac032", "author_rating": null, "review_text": "Kudos to the fight choreographers who designed all the action sequences for this movie. They really did a good one!", "created_at": "2019-12-29T18:56:37.052Z"}, {"movie_id": 24428, "review_id": "5e091b9d5ff34e0013b9ce5f", "author_rating": null, "review_text": "If you haven't seen this film yet, do yourself a favor and remain unspoiled. This is one of the movies that need to be savored.", "created_at": "2019-12-29T21:33:17.599Z"}, {"movie_id": 24428, "review_id": "5e09b284383df20018b90384", "author_rating": null, "review_text": "Good fighting sequences but camerawork feels too crazy and made it quite difficult to fully enjoy the great choreography.", "created_at": "2019-12-30T08:17:08.404Z"}, {"movie_id": 24428, "review_id": "5e09b5c86d97e600173c5508", "author_rating": null, "review_text": "I thought I would be able to enjoy it upon hearing that it was gonna be 3 hours long but it turned out to be too much. Watching it felt like a drag and was too melo-dramatic for a superhero film.", "created_at": "2019-12-30T08:31:04.632Z"}, {"movie_id": 24428, "review_id": "5e0e0c41fd4f8000155f3cf4", "author_rating": null, "review_text": "It was a great idea to bring together this group of amazing superheroes and at the same time amazing actors to create a top-class superhero film.", "created_at": "2020-01-02T15:29:05.209Z"}, {"movie_id": 24428, "review_id": "5e0e160b6dc6c000134d1fa6", "author_rating": null, "review_text": "I appreciate how they made sure to introduce each character before bringing them together for an epic fight to defend the Earth. It gives much more depth to each superhero.", "created_at": "2020-01-02T16:10:51.122Z"}, {"movie_id": 24428, "review_id": "5e0e200d12c60400143fa896", "author_rating": null, "review_text": "I gotta admit I was not ready for all that shaky-cam action. I mean, you could clearly see that the choreography for the fight scenes was good enough for a superhero movie, but why did you have to add so much shaking and cutscenes?", "created_at": "2020-01-02T16:53:33.128Z"}, {"movie_id": 24428, "review_id": "5e0e29dc6dc6c000154cd86b", "author_rating": null, "review_text": "I'm not exaggerating when I say that this is the best superhero film of all time!", "created_at": "2020-01-02T17:35:24.070Z"}, {"movie_id": 24428, "review_id": "5e0e4062c2f44b0013301af8", "author_rating": null, "review_text": "The title says it all, you will really MARVEL at the awesomeness of this film. Where else can you find a film with more superheroes than you can imagine working together to save the Earth?", "created_at": "2020-01-02T19:11:30.020Z"}, {"movie_id": 24428, "review_id": "5e0e528712c6040017401e24", "author_rating": null, "review_text": "Marvel really outdid themselves on this one. This is one of their greatest works to date and only a handful of films can compare to this one - and all of them have mostly been Marvel too!", "created_at": "2020-01-02T20:28:55.182Z"}, {"movie_id": 24428, "review_id": "5e0f03159f37b00015561eb1", "author_rating": null, "review_text": "Are you a fan of epic adventure movies? Then this is your dream come true! Truly this is the ultimate superhero mash-up and it's executed perfectly. Props to the filmmakers for taking the time to design it to be more than just a superhero film packed with action scenes and adding depth to each character.", "created_at": "2020-01-03T09:02:13.271Z"}, {"movie_id": 24428, "review_id": "5e0f2bcf663b8700177ef84f", "author_rating": null, "review_text": "More than just a superhero film, this movie had a definite soul and smart plot as well. It's a guarantee that superhero fans will love it but at the same time, other, more common, moviegoers will find it entertaining too.,", "created_at": "2020-01-03T11:55:59.996Z"}, {"movie_id": 24428, "review_id": "5e104c6cd64ac20018608071", "author_rating": null, "review_text": "The best thing about this movie is that it gave each superhero their own unique way of contributing to the team. It wasn't just another film wherein there's one superhero that stands out among the rest while the rest got overshadowed by this main character.", "created_at": "2020-01-04T08:27:24.569Z"}, {"movie_id": 24428, "review_id": "5e1210fae78e2d0017768edd", "author_rating": null, "review_text": "Stan Lee cameos are the best! It's too bad he won't be around to do that now. It was one of the things I looked forward to in each of the Marvel movies.", "created_at": "2020-01-05T16:38:18.235Z"}, {"movie_id": 24428, "review_id": "5e1244e15907de0017de881d", "author_rating": null, "review_text": "This is not a good movie... It's a GREAT MOVIE! Filmmakers did an awesome job taking the storyline from the comic books and making sure that most of it was kept.", "created_at": "2020-01-05T20:19:45.004Z"}, {"movie_id": 24428, "review_id": "5e125949d64ac2001864cba3", "author_rating": null, "review_text": "Superhero with not only super-awesome heroes but superb script as well. For an action adventure film, the writing is extremely detailed and that's what appealed to me the most.", "created_at": "2020-01-05T21:46:49.742Z"}, {"movie_id": 24428, "review_id": "5e12c5af9020120013b74f2e", "author_rating": null, "review_text": "I don't think Marvel could've found a better cast that could've played the characters!", "created_at": "2020-01-06T05:29:19.509Z"}, {"movie_id": 24428, "review_id": "5e12c9c68741c400123d9d8a", "author_rating": null, "review_text": "If you're a comic book fan like me, you'd understand that usually, superhero storylines adapt a more straight, serious tone, but with the Avengers you have the great storyline of a superhero film and the comedic relief of banter.", "created_at": "2020-01-06T05:46:46.176Z"}, {"movie_id": 24428, "review_id": "5e12cdc25907de0012deea04", "author_rating": null, "review_text": "The incredible mix of superheroes together with their personalities and powers is a guarantee to impress any sort of audience.", "created_at": "2020-01-06T06:03:46.319Z"}, {"movie_id": 24428, "review_id": "5e12d1cafc5f06001590b427", "author_rating": null, "review_text": "Count on the Avengers to make man-tights and capes look more fashionable than ever! With incredible fight choreography, it's hard not to be impressed.", "created_at": "2020-01-06T06:20:58.799Z"}, {"movie_id": 24428, "review_id": "5e20d3be8f26bc001171c86e", "author_rating": null, "review_text": "It takes more than just great actors to make a successful film so for the people behind the curtains making everything even more awesome, I want to give my thanks for blessing us with this masterpiece of a film!", "created_at": "2020-01-16T21:21:02.781Z"}, {"movie_id": 24428, "review_id": "5e20ddf38f26bc001571bb9e", "author_rating": null, "review_text": "When you have an amazing team of actors with great chemistry both on and off screen, a team of directors who are passionate about what they do, and a production crew that's always coming up with new ways to reinvent the superhero genre, then you've got a successful film like this.", "created_at": "2020-01-16T22:04:35.109Z"}, {"movie_id": 24428, "review_id": "5eddc7268d52c90022a60a4b", "author_rating": 8.0, "review_text": "Probably only my third time watching and still a really entertaining action film with good banter amongst the Avengers and the team-up in the third act really work well. The whole banding together with the death of Agent Coulson still doesn't feel right, good character but didn't think he was so beloved to be a catalyst for them. Minor point just something that stood out then, and now. Also a bit hollow given, IIRC, was alive and well for the Agents of SHIELD TV series... **4.25/5**", "created_at": "2020-06-08T05:05:42.360Z"}, {"movie_id": 24428, "review_id": "600233081c635b0055ef5f7e", "author_rating": 7.0, "review_text": "The last hour is a lot of fun, but I found the opening chunk disappointing.\r\n\r\nI was expecting wall-to-wall action, pretty much from the start - especially given the forces that join together. However, I felt the first half of <em>'The Avengers'</em> as slow. What also didn't help is that the villain, carried over from a preceding MCU film, isn't super interesting - we also don't see the antagonist's earlier film counterpart for a fair few scenes, which felt too delayed.\r\n\r\nThe last half is much better, which allowed me to enjoy myself properly. Robert Downey Jr., while not as entertaining as he is on his own, brings goodness, as do the likes of Chris Evans and Chris Hemsworth.\r\n\r\nI'm not a big fan of recasts, though Mark Ruffalo as Hulk is a positive one; even if that took a bit away from the novelty of all the superheroes joining, given we hadn't seen Ruffalo himself before. Added to Scarlett Johansson's Black Widow, at least in terms of the film franchise, getting major screen time out of nowhere - having been a bit part character in her debut MCU appearance.\r\n\r\nThe music is noteworthy, while everything looks brilliant. Overall and in short: It's a fun, good action film - I just expected greater.", "created_at": "2021-01-16T00:27:52.914Z"}, {"movie_id": 24428, "review_id": "4fce8f8819c29523880000de", "author_rating": 8.0, "review_text": "With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.", "created_at": "2012-06-05T23:00:24.000Z"}, {"movie_id": 24428, "review_id": "59f29e47c3a3687126003ccd", "author_rating": 9.0, "review_text": "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:47:35.267Z"}, {"movie_id": 24428, "review_id": "5a657f809251410b2d030491", "author_rating": null, "review_text": "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.", "created_at": "2018-01-22T06:06:56.333Z"}, {"movie_id": 24428, "review_id": "5c8426f992514127631f9b36", "author_rating": 8.0, "review_text": "One of the few movies to actually make me feel like a kid again, Joss Whedon was the perfect filmmaker to do this film. Everyone gets their time to shine. The script juggles every plot point and character moment with clarity and ease. It's funny, smart, and visually jaw dropping. Definitely lived up to the five movie hype.", "created_at": "2019-03-09T20:50:01.703Z"}, {"movie_id": 24428, "review_id": "5cad1876c3a36812a018fc9c", "author_rating": 8.5, "review_text": "I give this 10 Stars based on it being not only better than the trailer and the hype made me thing it would be, but also that it was the first time anything the size and scope of the Marvel Cinematic universe was pulled off successfully. Having Joss direct this movie lives and dies on character interaction. This movie is on the definitive list in my opinion even just for that.", "created_at": "2019-04-09T22:11:02.850Z"}, {"movie_id": 24428, "review_id": "5d46cf540f2fbd7864efbe30", "author_rating": 9.0, "review_text": "Everything that's happening, the things that are about to come to light, people might just need a little old fashioned.\r\n\r\nThe Avengers (AKA: Avengers Assemble) is written and directed by Joss Whedon, with Zak Penn co-writing the story. It stars Robert Downey Junior, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddlestone, Clark Gregg, Samuel L. Jackson, Cobie Smulders and Stellan Skarsgard. Music is scored by Alan Silvestri and cinematography by Seamus McGarvey.\r\n\r\nAsgardian outcast Loki (Hiddlestone) has struck a deal with the Chitauri to exchange the Tesseract for an army with which he can attack Earth and thus control it. With the Earth in mortal danger, S.H.I.E.L.D director Nick Fury (Jackson) activates the Avengers Initiative; a collection of super heroes and deadly assassins who, if they can actually come together as one united force, hold the fate of the Earth in their hands.\r\n\r\nI have no real frame of reference with The Avengers comic book world, when I was young I read a bit of Spidey, Batman and was kind of partial to The Fantastic Four, but I really don't remember story lines and gave up reading that sort of stuff once sport and exams came into my life. I love movies and as I enter the later stages of my forties I'm pleased to say I have a wide range of film genre interests. I have very much enjoyed The Avengers solo films so far, with the exception of Iron Man 2 which quite frankly is average at best, but the reality is that if The Avengers failed as a movie, that Whedon got it so wrong, then I wouldn't be foaming at the mouth or proclaiming that the director be stripped naked and whipped around the streets of Hollywood! As it is, with one or two minor irks aside, The Avengers is about as much fun as I have had with a movie in quite a few years.\r\n\r\nI wouldn't know if the makers got the essence right, or if the story is at one in the Marvel Avengers Universe, I just know that it is a right old blast and made a colossal amount of money at the box office, even trumping The Dark Knight Rises in that department. It's a film full of derring-do heroics, ripe witticisms, wonderfully staged action, simmering sexual tensions, ego collisions, charm, heart and splendid human interactions. It looks fabulous on Blu-ray, the art design, the colour photography and Silvestri's score rumbles like thunder and crackles like lightning, just as a super hero movie score should do. The cast performances are hugely enjoyable as they bounce off of one and other, feeding off the respective thespian energy with a knowing of the right tone to make this colourful comic book world be all that it can be. While Whedon, with a weight of expectation akin to Atlas holding the World on his shoulders, comes through with flying colours with astute pacing and an impressive marshaling of an acting army.\r\n\r\nFlaws? Jackson's Nick Fury could have done with more screen time and Cobie Smulders is sadly short changed as well. The Chitauri are only really a threat because of their sheer numbers, not because of any great alien design, and, well, The Hulk CGI hasn't really advanced much from the 2008 version, but really these are small itches rather than big ones. Is The Avengers the best film of 2012? It will be seen as such for many fans of the source(s) who have waited with baited breath for this coming together of their heroes, and that notion really shouldn't irk the more highbrow film fans out there. Me? No it isn't the best film of 2012, but as I found my self perched on the edge of my seat as the finale unfurls in a wave of explosive heroic energy, and I caressed my ribs from laughing out loud, I knew then that undoubtedly The Avengers is the most fun film of 2012. 9/10", "created_at": "2019-08-04T12:28:04.980Z"}, {"movie_id": 24428, "review_id": "5dc32f2f5aadc4001520e0dd", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-11-06T20:38:07.253Z"}, {"movie_id": 24428, "review_id": "5dc389f37d2bc100133d06df", "author_rating": null, "review_text": "Definitely the greatest superhero movie of all time. Marvel has set the bar high with this one and so far, they're doing a good job of keeping up with that despite not being able to raise it higher!", "created_at": "2019-11-07T03:05:23.344Z"}, {"movie_id": 24428, "review_id": "5dc3930999259c00157aa7cb", "author_rating": null, "review_text": "I found it creative of Marvel to introduce each character one by one. It really set the tone and had me looking forward to what's gonna happen.", "created_at": "2019-11-07T03:44:09.147Z"}, {"movie_id": 24428, "review_id": "5dc3993d470ead00138cf1ec", "author_rating": null, "review_text": "Perfect casting! You can really see and feel that the actors have great chemistry both in and out of their characters.", "created_at": "2019-11-07T04:10:37.105Z"}, {"movie_id": 24428, "review_id": "5dc56e556f8d950013c2d977", "author_rating": null, "review_text": "Wonderful movie to watch if you want to be entertained and not think about the plot too much.", "created_at": "2019-11-08T13:32:05.653Z"}, {"movie_id": 24428, "review_id": "5dc579c56f8d950010c2f5c5", "author_rating": null, "review_text": "When you have a bunch of flashy superheroes fighting supernatural, extraterrestrial villains from another dimension, it can get pretty hard to highlight each of their strengths,  but Marvel pulled it off with this one!", "created_at": "2019-11-08T14:20:53.615Z"}, {"movie_id": 24428, "review_id": "5e00e8fb75110d0018d85d20", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-12-23T16:19:07.269Z"}, {"movie_id": 24428, "review_id": "5e00ee5565686e0013987f15", "author_rating": null, "review_text": "I tried my best to avoid getting carried away by the hype of this movie because nowadays most of the movies that are too much hyped end up just being disappointments but I'm glad to say that I WAS NOT DISAPPOINTED when this came out.", "created_at": "2019-12-23T16:41:57.040Z"}, {"movie_id": 24428, "review_id": "5e0102250284200014af5898", "author_rating": null, "review_text": "One word for this movie: AWESOME. It’s an amazing film and has everything a superhero fanboy hoped for and more.", "created_at": "2019-12-23T18:06:29.819Z"}, {"movie_id": 24428, "review_id": "5e011ac665686e0018983449", "author_rating": null, "review_text": "One of the many things I loved in this film was the conflict between Iron Man and Captain America for leadership and how the two differ in their approach. A very unique way of building a team of superheroes.", "created_at": "2019-12-23T19:51:34.381Z"}, {"movie_id": 24428, "review_id": "5e02862b26dac10012674852", "author_rating": null, "review_text": "The cast really delivered. Sure they were playing the roles of superheroes but you can really see and feel a deeper level of emotions in their performance.", "created_at": "2019-12-24T21:42:03.600Z"}, {"movie_id": 24428, "review_id": "5e08f6e5a1c59d0018aac032", "author_rating": null, "review_text": "Kudos to the fight choreographers who designed all the action sequences for this movie. They really did a good one!", "created_at": "2019-12-29T18:56:37.052Z"}, {"movie_id": 24428, "review_id": "5e091b9d5ff34e0013b9ce5f", "author_rating": null, "review_text": "If you haven't seen this film yet, do yourself a favor and remain unspoiled. This is one of the movies that need to be savored.", "created_at": "2019-12-29T21:33:17.599Z"}, {"movie_id": 24428, "review_id": "5e09b284383df20018b90384", "author_rating": null, "review_text": "Good fighting sequences but camerawork feels too crazy and made it quite difficult to fully enjoy the great choreography.", "created_at": "2019-12-30T08:17:08.404Z"}, {"movie_id": 24428, "review_id": "5e09b5c86d97e600173c5508", "author_rating": null, "review_text": "I thought I would be able to enjoy it upon hearing that it was gonna be 3 hours long but it turned out to be too much. Watching it felt like a drag and was too melo-dramatic for a superhero film.", "created_at": "2019-12-30T08:31:04.632Z"}, {"movie_id": 24428, "review_id": "5e0e0c41fd4f8000155f3cf4", "author_rating": null, "review_text": "It was a great idea to bring together this group of amazing superheroes and at the same time amazing actors to create a top-class superhero film.", "created_at": "2020-01-02T15:29:05.209Z"}, {"movie_id": 24428, "review_id": "5e0e160b6dc6c000134d1fa6", "author_rating": null, "review_text": "I appreciate how they made sure to introduce each character before bringing them together for an epic fight to defend the Earth. It gives much more depth to each superhero.", "created_at": "2020-01-02T16:10:51.122Z"}, {"movie_id": 24428, "review_id": "5e0e200d12c60400143fa896", "author_rating": null, "review_text": "I gotta admit I was not ready for all that shaky-cam action. I mean, you could clearly see that the choreography for the fight scenes was good enough for a superhero movie, but why did you have to add so much shaking and cutscenes?", "created_at": "2020-01-02T16:53:33.128Z"}, {"movie_id": 24428, "review_id": "5e0e29dc6dc6c000154cd86b", "author_rating": null, "review_text": "I'm not exaggerating when I say that this is the best superhero film of all time!", "created_at": "2020-01-02T17:35:24.070Z"}, {"movie_id": 24428, "review_id": "5e0e4062c2f44b0013301af8", "author_rating": null, "review_text": "The title says it all, you will really MARVEL at the awesomeness of this film. Where else can you find a film with more superheroes than you can imagine working together to save the Earth?", "created_at": "2020-01-02T19:11:30.020Z"}, {"movie_id": 24428, "review_id": "5e0e528712c6040017401e24", "author_rating": null, "review_text": "Marvel really outdid themselves on this one. This is one of their greatest works to date and only a handful of films can compare to this one - and all of them have mostly been Marvel too!", "created_at": "2020-01-02T20:28:55.182Z"}, {"movie_id": 24428, "review_id": "5e0f03159f37b00015561eb1", "author_rating": null, "review_text": "Are you a fan of epic adventure movies? Then this is your dream come true! Truly this is the ultimate superhero mash-up and it's executed perfectly. Props to the filmmakers for taking the time to design it to be more than just a superhero film packed with action scenes and adding depth to each character.", "created_at": "2020-01-03T09:02:13.271Z"}, {"movie_id": 24428, "review_id": "5e0f2bcf663b8700177ef84f", "author_rating": null, "review_text": "More than just a superhero film, this movie had a definite soul and smart plot as well. It's a guarantee that superhero fans will love it but at the same time, other, more common, moviegoers will find it entertaining too.,", "created_at": "2020-01-03T11:55:59.996Z"}, {"movie_id": 24428, "review_id": "5e104c6cd64ac20018608071", "author_rating": null, "review_text": "The best thing about this movie is that it gave each superhero their own unique way of contributing to the team. It wasn't just another film wherein there's one superhero that stands out among the rest while the rest got overshadowed by this main character.", "created_at": "2020-01-04T08:27:24.569Z"}, {"movie_id": 24428, "review_id": "5e1210fae78e2d0017768edd", "author_rating": null, "review_text": "Stan Lee cameos are the best! It's too bad he won't be around to do that now. It was one of the things I looked forward to in each of the Marvel movies.", "created_at": "2020-01-05T16:38:18.235Z"}, {"movie_id": 24428, "review_id": "5e1244e15907de0017de881d", "author_rating": null, "review_text": "This is not a good movie... It's a GREAT MOVIE! Filmmakers did an awesome job taking the storyline from the comic books and making sure that most of it was kept.", "created_at": "2020-01-05T20:19:45.004Z"}, {"movie_id": 24428, "review_id": "5e125949d64ac2001864cba3", "author_rating": null, "review_text": "Superhero with not only super-awesome heroes but superb script as well. For an action adventure film, the writing is extremely detailed and that's what appealed to me the most.", "created_at": "2020-01-05T21:46:49.742Z"}, {"movie_id": 24428, "review_id": "5e12c5af9020120013b74f2e", "author_rating": null, "review_text": "I don't think Marvel could've found a better cast that could've played the characters!", "created_at": "2020-01-06T05:29:19.509Z"}, {"movie_id": 24428, "review_id": "5e12c9c68741c400123d9d8a", "author_rating": null, "review_text": "If you're a comic book fan like me, you'd understand that usually, superhero storylines adapt a more straight, serious tone, but with the Avengers you have the great storyline of a superhero film and the comedic relief of banter.", "created_at": "2020-01-06T05:46:46.176Z"}, {"movie_id": 24428, "review_id": "5e12cdc25907de0012deea04", "author_rating": null, "review_text": "The incredible mix of superheroes together with their personalities and powers is a guarantee to impress any sort of audience.", "created_at": "2020-01-06T06:03:46.319Z"}, {"movie_id": 24428, "review_id": "5e12d1cafc5f06001590b427", "author_rating": null, "review_text": "Count on the Avengers to make man-tights and capes look more fashionable than ever! With incredible fight choreography, it's hard not to be impressed.", "created_at": "2020-01-06T06:20:58.799Z"}, {"movie_id": 24428, "review_id": "5e20d3be8f26bc001171c86e", "author_rating": null, "review_text": "It takes more than just great actors to make a successful film so for the people behind the curtains making everything even more awesome, I want to give my thanks for blessing us with this masterpiece of a film!", "created_at": "2020-01-16T21:21:02.781Z"}, {"movie_id": 24428, "review_id": "5e20ddf38f26bc001571bb9e", "author_rating": null, "review_text": "When you have an amazing team of actors with great chemistry both on and off screen, a team of directors who are passionate about what they do, and a production crew that's always coming up with new ways to reinvent the superhero genre, then you've got a successful film like this.", "created_at": "2020-01-16T22:04:35.109Z"}, {"movie_id": 24428, "review_id": "5eddc7268d52c90022a60a4b", "author_rating": 8.0, "review_text": "Probably only my third time watching and still a really entertaining action film with good banter amongst the Avengers and the team-up in the third act really work well. The whole banding together with the death of Agent Coulson still doesn't feel right, good character but didn't think he was so beloved to be a catalyst for them. Minor point just something that stood out then, and now. Also a bit hollow given, IIRC, was alive and well for the Agents of SHIELD TV series... **4.25/5**", "created_at": "2020-06-08T05:05:42.360Z"}, {"movie_id": 24428, "review_id": "600233081c635b0055ef5f7e", "author_rating": 7.0, "review_text": "The last hour is a lot of fun, but I found the opening chunk disappointing.\r\n\r\nI was expecting wall-to-wall action, pretty much from the start - especially given the forces that join together. However, I felt the first half of <em>'The Avengers'</em> as slow. What also didn't help is that the villain, carried over from a preceding MCU film, isn't super interesting - we also don't see the antagonist's earlier film counterpart for a fair few scenes, which felt too delayed.\r\n\r\nThe last half is much better, which allowed me to enjoy myself properly. Robert Downey Jr., while not as entertaining as he is on his own, brings goodness, as do the likes of Chris Evans and Chris Hemsworth.\r\n\r\nI'm not a big fan of recasts, though Mark Ruffalo as Hulk is a positive one; even if that took a bit away from the novelty of all the superheroes joining, given we hadn't seen Ruffalo himself before. Added to Scarlett Johansson's Black Widow, at least in terms of the film franchise, getting major screen time out of nowhere - having been a bit part character in her debut MCU appearance.\r\n\r\nThe music is noteworthy, while everything looks brilliant. Overall and in short: It's a fun, good action film - I just expected greater.", "created_at": "2021-01-16T00:27:52.914Z"}, {"movie_id": 24428, "review_id": "4fce8f8819c29523880000de", "author_rating": 8.0, "review_text": "With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.", "created_at": "2012-06-05T23:00:24.000Z"}, {"movie_id": 24428, "review_id": "59f29e47c3a3687126003ccd", "author_rating": 9.0, "review_text": "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:47:35.267Z"}, {"movie_id": 24428, "review_id": "5a657f809251410b2d030491", "author_rating": null, "review_text": "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.", "created_at": "2018-01-22T06:06:56.333Z"}, {"movie_id": 24428, "review_id": "5c8426f992514127631f9b36", "author_rating": 8.0, "review_text": "One of the few movies to actually make me feel like a kid again, Joss Whedon was the perfect filmmaker to do this film. Everyone gets their time to shine. The script juggles every plot point and character moment with clarity and ease. It's funny, smart, and visually jaw dropping. Definitely lived up to the five movie hype.", "created_at": "2019-03-09T20:50:01.703Z"}, {"movie_id": 24428, "review_id": "5cad1876c3a36812a018fc9c", "author_rating": 8.5, "review_text": "I give this 10 Stars based on it being not only better than the trailer and the hype made me thing it would be, but also that it was the first time anything the size and scope of the Marvel Cinematic universe was pulled off successfully. Having Joss direct this movie lives and dies on character interaction. This movie is on the definitive list in my opinion even just for that.", "created_at": "2019-04-09T22:11:02.850Z"}, {"movie_id": 24428, "review_id": "5d46cf540f2fbd7864efbe30", "author_rating": 9.0, "review_text": "Everything that's happening, the things that are about to come to light, people might just need a little old fashioned.\r\n\r\nThe Avengers (AKA: Avengers Assemble) is written and directed by Joss Whedon, with Zak Penn co-writing the story. It stars Robert Downey Junior, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddlestone, Clark Gregg, Samuel L. Jackson, Cobie Smulders and Stellan Skarsgard. Music is scored by Alan Silvestri and cinematography by Seamus McGarvey.\r\n\r\nAsgardian outcast Loki (Hiddlestone) has struck a deal with the Chitauri to exchange the Tesseract for an army with which he can attack Earth and thus control it. With the Earth in mortal danger, S.H.I.E.L.D director Nick Fury (Jackson) activates the Avengers Initiative; a collection of super heroes and deadly assassins who, if they can actually come together as one united force, hold the fate of the Earth in their hands.\r\n\r\nI have no real frame of reference with The Avengers comic book world, when I was young I read a bit of Spidey, Batman and was kind of partial to The Fantastic Four, but I really don't remember story lines and gave up reading that sort of stuff once sport and exams came into my life. I love movies and as I enter the later stages of my forties I'm pleased to say I have a wide range of film genre interests. I have very much enjoyed The Avengers solo films so far, with the exception of Iron Man 2 which quite frankly is average at best, but the reality is that if The Avengers failed as a movie, that Whedon got it so wrong, then I wouldn't be foaming at the mouth or proclaiming that the director be stripped naked and whipped around the streets of Hollywood! As it is, with one or two minor irks aside, The Avengers is about as much fun as I have had with a movie in quite a few years.\r\n\r\nI wouldn't know if the makers got the essence right, or if the story is at one in the Marvel Avengers Universe, I just know that it is a right old blast and made a colossal amount of money at the box office, even trumping The Dark Knight Rises in that department. It's a film full of derring-do heroics, ripe witticisms, wonderfully staged action, simmering sexual tensions, ego collisions, charm, heart and splendid human interactions. It looks fabulous on Blu-ray, the art design, the colour photography and Silvestri's score rumbles like thunder and crackles like lightning, just as a super hero movie score should do. The cast performances are hugely enjoyable as they bounce off of one and other, feeding off the respective thespian energy with a knowing of the right tone to make this colourful comic book world be all that it can be. While Whedon, with a weight of expectation akin to Atlas holding the World on his shoulders, comes through with flying colours with astute pacing and an impressive marshaling of an acting army.\r\n\r\nFlaws? Jackson's Nick Fury could have done with more screen time and Cobie Smulders is sadly short changed as well. The Chitauri are only really a threat because of their sheer numbers, not because of any great alien design, and, well, The Hulk CGI hasn't really advanced much from the 2008 version, but really these are small itches rather than big ones. Is The Avengers the best film of 2012? It will be seen as such for many fans of the source(s) who have waited with baited breath for this coming together of their heroes, and that notion really shouldn't irk the more highbrow film fans out there. Me? No it isn't the best film of 2012, but as I found my self perched on the edge of my seat as the finale unfurls in a wave of explosive heroic energy, and I caressed my ribs from laughing out loud, I knew then that undoubtedly The Avengers is the most fun film of 2012. 9/10", "created_at": "2019-08-04T12:28:04.980Z"}, {"movie_id": 24428, "review_id": "5dc32f2f5aadc4001520e0dd", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-11-06T20:38:07.253Z"}, {"movie_id": 24428, "review_id": "5dc389f37d2bc100133d06df", "author_rating": null, "review_text": "Definitely the greatest superhero movie of all time. Marvel has set the bar high with this one and so far, they're doing a good job of keeping up with that despite not being able to raise it higher!", "created_at": "2019-11-07T03:05:23.344Z"}, {"movie_id": 24428, "review_id": "5dc3930999259c00157aa7cb", "author_rating": null, "review_text": "I found it creative of Marvel to introduce each character one by one. It really set the tone and had me looking forward to what's gonna happen.", "created_at": "2019-11-07T03:44:09.147Z"}, {"movie_id": 24428, "review_id": "5dc3993d470ead00138cf1ec", "author_rating": null, "review_text": "Perfect casting! You can really see and feel that the actors have great chemistry both in and out of their characters.", "created_at": "2019-11-07T04:10:37.105Z"}, {"movie_id": 24428, "review_id": "5dc56e556f8d950013c2d977", "author_rating": null, "review_text": "Wonderful movie to watch if you want to be entertained and not think about the plot too much.", "created_at": "2019-11-08T13:32:05.653Z"}, {"movie_id": 24428, "review_id": "5dc579c56f8d950010c2f5c5", "author_rating": null, "review_text": "When you have a bunch of flashy superheroes fighting supernatural, extraterrestrial villains from another dimension, it can get pretty hard to highlight each of their strengths,  but Marvel pulled it off with this one!", "created_at": "2019-11-08T14:20:53.615Z"}, {"movie_id": 24428, "review_id": "5e00e8fb75110d0018d85d20", "author_rating": null, "review_text": "The Avengers is a dream movie come true for superhero fans with its group of extremely talented actors and epic champions, to create an action- packed movie with hilarious banter laced in between scenes. I love how each of the actors and actresses has portrayed each of the roles they were given.", "created_at": "2019-12-23T16:19:07.269Z"}, {"movie_id": 24428, "review_id": "5e00ee5565686e0013987f15", "author_rating": null, "review_text": "I tried my best to avoid getting carried away by the hype of this movie because nowadays most of the movies that are too much hyped end up just being disappointments but I'm glad to say that I WAS NOT DISAPPOINTED when this came out.", "created_at": "2019-12-23T16:41:57.040Z"}, {"movie_id": 24428, "review_id": "5e0102250284200014af5898", "author_rating": null, "review_text": "One word for this movie: AWESOME. It’s an amazing film and has everything a superhero fanboy hoped for and more.", "created_at": "2019-12-23T18:06:29.819Z"}, {"movie_id": 24428, "review_id": "5e011ac665686e0018983449", "author_rating": null, "review_text": "One of the many things I loved in this film was the conflict between Iron Man and Captain America for leadership and how the two differ in their approach. A very unique way of building a team of superheroes.", "created_at": "2019-12-23T19:51:34.381Z"}, {"movie_id": 24428, "review_id": "5e02862b26dac10012674852", "author_rating": null, "review_text": "The cast really delivered. Sure they were playing the roles of superheroes but you can really see and feel a deeper level of emotions in their performance.", "created_at": "2019-12-24T21:42:03.600Z"}, {"movie_id": 24428, "review_id": "5e08f6e5a1c59d0018aac032", "author_rating": null, "review_text": "Kudos to the fight choreographers who designed all the action sequences for this movie. They really did a good one!", "created_at": "2019-12-29T18:56:37.052Z"}, {"movie_id": 24428, "review_id": "5e091b9d5ff34e0013b9ce5f", "author_rating": null, "review_text": "If you haven't seen this film yet, do yourself a favor and remain unspoiled. This is one of the movies that need to be savored.", "created_at": "2019-12-29T21:33:17.599Z"}, {"movie_id": 24428, "review_id": "5e09b284383df20018b90384", "author_rating": null, "review_text": "Good fighting sequences but camerawork feels too crazy and made it quite difficult to fully enjoy the great choreography.", "created_at": "2019-12-30T08:17:08.404Z"}, {"movie_id": 24428, "review_id": "5e09b5c86d97e600173c5508", "author_rating": null, "review_text": "I thought I would be able to enjoy it upon hearing that it was gonna be 3 hours long but it turned out to be too much. Watching it felt like a drag and was too melo-dramatic for a superhero film.", "created_at": "2019-12-30T08:31:04.632Z"}, {"movie_id": 24428, "review_id": "5e0e0c41fd4f8000155f3cf4", "author_rating": null, "review_text": "It was a great idea to bring together this group of amazing superheroes and at the same time amazing actors to create a top-class superhero film.", "created_at": "2020-01-02T15:29:05.209Z"}, {"movie_id": 24428, "review_id": "5e0e160b6dc6c000134d1fa6", "author_rating": null, "review_text": "I appreciate how they made sure to introduce each character before bringing them together for an epic fight to defend the Earth. It gives much more depth to each superhero.", "created_at": "2020-01-02T16:10:51.122Z"}, {"movie_id": 24428, "review_id": "5e0e200d12c60400143fa896", "author_rating": null, "review_text": "I gotta admit I was not ready for all that shaky-cam action. I mean, you could clearly see that the choreography for the fight scenes was good enough for a superhero movie, but why did you have to add so much shaking and cutscenes?", "created_at": "2020-01-02T16:53:33.128Z"}, {"movie_id": 24428, "review_id": "5e0e29dc6dc6c000154cd86b", "author_rating": null, "review_text": "I'm not exaggerating when I say that this is the best superhero film of all time!", "created_at": "2020-01-02T17:35:24.070Z"}, {"movie_id": 24428, "review_id": "5e0e4062c2f44b0013301af8", "author_rating": null, "review_text": "The title says it all, you will really MARVEL at the awesomeness of this film. Where else can you find a film with more superheroes than you can imagine working together to save the Earth?", "created_at": "2020-01-02T19:11:30.020Z"}, {"movie_id": 24428, "review_id": "5e0e528712c6040017401e24", "author_rating": null, "review_text": "Marvel really outdid themselves on this one. This is one of their greatest works to date and only a handful of films can compare to this one - and all of them have mostly been Marvel too!", "created_at": "2020-01-02T20:28:55.182Z"}, {"movie_id": 24428, "review_id": "5e0f03159f37b00015561eb1", "author_rating": null, "review_text": "Are you a fan of epic adventure movies? Then this is your dream come true! Truly this is the ultimate superhero mash-up and it's executed perfectly. Props to the filmmakers for taking the time to design it to be more than just a superhero film packed with action scenes and adding depth to each character.", "created_at": "2020-01-03T09:02:13.271Z"}, {"movie_id": 24428, "review_id": "5e0f2bcf663b8700177ef84f", "author_rating": null, "review_text": "More than just a superhero film, this movie had a definite soul and smart plot as well. It's a guarantee that superhero fans will love it but at the same time, other, more common, moviegoers will find it entertaining too.,", "created_at": "2020-01-03T11:55:59.996Z"}, {"movie_id": 24428, "review_id": "5e104c6cd64ac20018608071", "author_rating": null, "review_text": "The best thing about this movie is that it gave each superhero their own unique way of contributing to the team. It wasn't just another film wherein there's one superhero that stands out among the rest while the rest got overshadowed by this main character.", "created_at": "2020-01-04T08:27:24.569Z"}, {"movie_id": 24428, "review_id": "5e1210fae78e2d0017768edd", "author_rating": null, "review_text": "Stan Lee cameos are the best! It's too bad he won't be around to do that now. It was one of the things I looked forward to in each of the Marvel movies.", "created_at": "2020-01-05T16:38:18.235Z"}, {"movie_id": 24428, "review_id": "5e1244e15907de0017de881d", "author_rating": null, "review_text": "This is not a good movie... It's a GREAT MOVIE! Filmmakers did an awesome job taking the storyline from the comic books and making sure that most of it was kept.", "created_at": "2020-01-05T20:19:45.004Z"}, {"movie_id": 24428, "review_id": "5e125949d64ac2001864cba3", "author_rating": null, "review_text": "Superhero with not only super-awesome heroes but superb script as well. For an action adventure film, the writing is extremely detailed and that's what appealed to me the most.", "created_at": "2020-01-05T21:46:49.742Z"}, {"movie_id": 24428, "review_id": "5e12c5af9020120013b74f2e", "author_rating": null, "review_text": "I don't think Marvel could've found a better cast that could've played the characters!", "created_at": "2020-01-06T05:29:19.509Z"}, {"movie_id": 24428, "review_id": "5e12c9c68741c400123d9d8a", "author_rating": null, "review_text": "If you're a comic book fan like me, you'd understand that usually, superhero storylines adapt a more straight, serious tone, but with the Avengers you have the great storyline of a superhero film and the comedic relief of banter.", "created_at": "2020-01-06T05:46:46.176Z"}, {"movie_id": 24428, "review_id": "5e12cdc25907de0012deea04", "author_rating": null, "review_text": "The incredible mix of superheroes together with their personalities and powers is a guarantee to impress any sort of audience.", "created_at": "2020-01-06T06:03:46.319Z"}, {"movie_id": 24428, "review_id": "5e12d1cafc5f06001590b427", "author_rating": null, "review_text": "Count on the Avengers to make man-tights and capes look more fashionable than ever! With incredible fight choreography, it's hard not to be impressed.", "created_at": "2020-01-06T06:20:58.799Z"}, {"movie_id": 24428, "review_id": "5e20d3be8f26bc001171c86e", "author_rating": null, "review_text": "It takes more than just great actors to make a successful film so for the people behind the curtains making everything even more awesome, I want to give my thanks for blessing us with this masterpiece of a film!", "created_at": "2020-01-16T21:21:02.781Z"}, {"movie_id": 24428, "review_id": "5e20ddf38f26bc001571bb9e", "author_rating": null, "review_text": "When you have an amazing team of actors with great chemistry both on and off screen, a team of directors who are passionate about what they do, and a production crew that's always coming up with new ways to reinvent the superhero genre, then you've got a successful film like this.", "created_at": "2020-01-16T22:04:35.109Z"}, {"movie_id": 24428, "review_id": "5eddc7268d52c90022a60a4b", "author_rating": 8.0, "review_text": "Probably only my third time watching and still a really entertaining action film with good banter amongst the Avengers and the team-up in the third act really work well. The whole banding together with the death of Agent Coulson still doesn't feel right, good character but didn't think he was so beloved to be a catalyst for them. Minor point just something that stood out then, and now. Also a bit hollow given, IIRC, was alive and well for the Agents of SHIELD TV series... **4.25/5**", "created_at": "2020-06-08T05:05:42.360Z"}, {"movie_id": 24428, "review_id": "600233081c635b0055ef5f7e", "author_rating": 7.0, "review_text": "The last hour is a lot of fun, but I found the opening chunk disappointing.\r\n\r\nI was expecting wall-to-wall action, pretty much from the start - especially given the forces that join together. However, I felt the first half of <em>'The Avengers'</em> as slow. What also didn't help is that the villain, carried over from a preceding MCU film, isn't super interesting - we also don't see the antagonist's earlier film counterpart for a fair few scenes, which felt too delayed.\r\n\r\nThe last half is much better, which allowed me to enjoy myself properly. Robert Downey Jr., while not as entertaining as he is on his own, brings goodness, as do the likes of Chris Evans and Chris Hemsworth.\r\n\r\nI'm not a big fan of recasts, though Mark Ruffalo as Hulk is a positive one; even if that took a bit away from the novelty of all the superheroes joining, given we hadn't seen Ruffalo himself before. Added to Scarlett Johansson's Black Widow, at least in terms of the film franchise, getting major screen time out of nowhere - having been a bit part character in her debut MCU appearance.\r\n\r\nThe music is noteworthy, while everything looks brilliant. Overall and in short: It's a fun, good action film - I just expected greater.", "created_at": "2021-01-16T00:27:52.914Z"}]