[{"movie_id": 110415, "review_id": "5bbb4e3192514147040069db", "author_rating": 8.0, "review_text": "Original IP Post-Apocalyptia as well as the 21st century can possibly dish it out.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2018-10-08T12:31:45.972Z"}, {"movie_id": 110415, "review_id": "5ecbf01ebb070d0020e7f2b7", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSnowpiercer is getting a TV adaptation soon, so now it's the best moment to rewatch one of the best movies in 2014. At the time, Bong Joon-ho wasn't exactly a famous director that everyone knew about. Therefore, the cast led by Captain America himself, Chris Evans, and the intriguing premise did all the work in creating the cult following it got. Ironically, I haven't watched this film since its release, so this is only my second time boarding its train. I'm going to start with the best thing that this movie possesses: its screenplay.\r\n\r\nThis is one of the most shocking films I've seen when it comes to delivering jaw-dropping twists, one after the other, exclusively through dialogue. As it would become a staple in Bong Joon-ho's filmography, his writing is so incredibly complex and multi-layered that it's truly a miracle that his movies end up making any sense. Snowpiercer (which is co-written by Kelly Masterson) has literally dozens of logical questions that any other film would not only fail to explain, they wouldn't even try to. With any other screenwriters, this movie would feel too far-fetched and hard to believe. But it's far from that.\r\n\r\nEach character receives extraordinarily elaborate development, filled with mind-blowing revelations and eye-opening twists. Every line of dialogue, every picture, every camera movement, every shot, every scene matters. Everything the viewer sees or hears either means something or foreshadows an eventual payoff. Snowpiercer is the definition of \"every shot counts\". Don't you dare go to the bathroom without stopping the film first. You'll undoubtedly miss something significant. Absolutely brilliant screenplay and astonishing, well-written characters.\r\n\r\n\r\nIt's indisputably a narrative-driven story. Snowpiercer is a lesson in exposition. Even though there's plenty of action (I'll get there), it's a movie that relies on the viewer's ability to be captivated by dialogue. The concept is definitely unique, and the story is extremely captivating, but only if the viewer can understand the value of entertainment in listening to these characters while they go through their revolution... in learning who these characters were, are and will be. Just as an example, there's a third act's monologue performed by Chris Evans that not only delivers tons of information about his character, but it's also emotionally compelling to watch. If someone doesn't *feel* anything during this scene, then maybe Snowpiercer might not be the movie for you.\r\n\r\nI find The Platform to have a similar concept. Instead of a train, it's a vertical prison, but the allegory of how society works is evident in both films. How politics, religion, and early education can control Humanity. The top/front people not only receive more than what they need, but they still overuse everything, completely ignoring the bottom/tail humans that need to fight for scraps. These films take entirely different paths, but Snowpiercer owns a much more complex narrative than The Platform. However, it's still interesting to see the comparisons between these two distinct approaches on a similar theme.\r\n\r\nNevertheless, for everyone that needs some sort of dynamic entertainment, this flick is also packed with action set pieces. There's a tiny bit of too much shaky cam for my taste, but overall, it accomplishes the mission of delivering the chaotic, energetic, claustrophobic environment that the action sequences need. It's a train, after all. It's not like they could produce massive battles in such a small space. In fact, the screenplay allows the crew to show some really creative, innovative techniques. The use of slow-motion (not only during the action scenes) elevates the movie, generating great suspense/tension, and it's perfectly timed (including a fantastic one-take sequence with Chris Evans).\r\n\r\n\r\nSince I just mentioned him, might as well address his impressive performance. People might not remember this, but at the time of the film's release, Evans was interested in pursuing a directing career, setting his acting as a secondary role. While I do believe he's going to make a great director, I'm beyond happy that he continued to use his acting abilities. As with most of MCU's actors, I feel like he's pretty underrated considering what he has demonstrated throughout his career. Snowpiercer is just the tip of the iceberg. Chris Evans is a remarkable actor and much more than \"just\" a version of Captain America.\r\n\r\nTilda Swinton (Mason) also offers a quite interesting display, Octavia Spencer (Tanya) is fascinating, while the legend Ed Harris (Wilford) takes his short but effective screentime to prove how gifted he is, especially concerning plot exposition. He's always able to be captivating by merely opening his mouth. Marco Beltrami's score is riveting and memorable. The editing (Steve M. Choe, Changju Kim) is not only seamless, but it definitely helps the viewer better understand the story. Finally, the production and set design are impeccable, offering the \"one-location\", claustrophobic vibe that a train unavoidably has.\r\n\r\nMy only major issue involves the ending. It's quite impactful but also underwhelming and morally divisive. A particular decision that affects everyone in the train (basically, the entire Humanity) doesn't quite convince me that it's the best conclusion. It sort of diminishes some of the characters' efforts to get where they do, as well as the story's initial purpose. On one hand, it's an ending that raises a few questions in a movie that does a terrific job in explaining every little detail until this last moment. On the other hand, the train is far from giving a fair life to everyone...\r\n\r\n\r\nIn the end, Snowpiercer is not only one of 2014's best films but also one of the best of the respective decade. With a brilliant screenplay, Bong Joon-ho delivers an extremely complex narrative, filled with emotionally shocking character development, and featuring excellent stunt work. The underlying theme of how Humanity is controlled by how its society works (from politics to religion to education) cleverly accompanies the already twistful story. Snowpiercer is a phenomenal lesson in \"exposition\", and the definition of \"every shot matters\". Boasting jaw-dropping performances from everyone, especially from Chris Evans, every dialogue is remarkably captivating, packed with mind-blowing revelations, and an unbelievable effort in explaining every little detail regarding the train's functionality. This would undoubtedly be at the top of the decade's best movies if not for a morally divisive and somewhat underwhelming/questionable ending. Technically, an addictive score, amazing editing, and impressive production/set design put the final stamp of quality in a brightly original, unique piece of cinema.\r\n\r\nRating: A", "created_at": "2020-05-25T16:19:42.958Z"}]