[{"movie_id": 475557, "review_id": "5d975abdae26be001abe129b", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nObviously, Joker is one of my most anticipated movies of 2019. I mean, how couldn't it be?! Besides belonging to the superhero genre, DC has been on a streak of great films within its universe, so an isolated installment definitely excites me, especially about one of the evilest villains ever. It's by far one of the less comic-book-y flicks of the century. It doesn't follow the generic origin story formula, it avoids any cliches associated with the genre, and it's the type of movie that's becoming more and more rare nowadays. It's a character study like we haven't seen in a long time.\r\n\r\nI'll simply begin with the person that elevates the entire thing: Joaquin Phoenix. Now, if there's something I'm not going to do is compare his performance with Heath Ledger's. That's the number one mistake people are going to keep making forever. First of all, The Dark Knight and Joker couldn't be more distinct films, even if they belong to the same genre (despite Joker being unique, it's still about a famous comic-book villain). Then, despite Phoenix and Ledger portraying the same \"version\" of the clown (crazy, sadistic psychopath), the former is 90% Arthur Fleck while the latter is 100% Joker, throughout each of their movies. Finally, Phoenix is the sole protagonist of this feature, while Ledger had the best live-action Batman sharing the spotlight.\r\n\r\nIn conclusion, it's both unfair, and a bit unreasonable to compare both interpretations since their roles have a different impact on the narrative, as well as each film being entirely different. In the end, both are impressive. However, let's switch to Phoenix since he's the star of this show … He has 2019's best performance, by far! With a strong marketing campaign, I'm sure he'll get that Oscar. I hope so! It's so well-deserved. Todd Phillips and Scott Silver developed a brilliant screenplay, but Phoenix elevates it to a whole other level.\r\n\r\nThroughout the entire runtime, I felt weird. Perturbed. Even uncomfortable with what I was watching and consequently feeling. It's a dark, brutal, violent, emotionally powerful origin of a villain who I feel disturbingly empathetic towards. Phoenix makes the story work due to its remarkably captivating display of someone who's mentally ill. Arthur Fleck slowly becoming crazier is due to how society behaves and not due to some chemical pool that transforms his skin white and hair green (nothing wrong with this, but I know which origin story I prefer). \"The world is getting crazier out there\", and it becomes excruciatingly painful to deal with it, especially when so much is going on with Arthur’s personal life, and most of it he doesn't even realize because he tries to hide everything behind a smile.\r\n\r\nIt's a screenplay filled with narrative twists that not only pack a punch of surprise but leave you feeling extremely upset. The last act is one of the best in the last few years. If the second act is an enormous build-up, the last one is a terrific payoff. I can't remember the last movie I saw where I loved 100% every single narrative decision. I wouldn't do any of the big moments differently. There are so many excellent references hidden in plain sight that comic-book fans (and fans of the TDK trilogy as well) will love just like I did. In the ending, there's one pivotal moment in particular that serves as the absolute climax … I got chills all over my body. They couldn't have done that scene more perfect. I only have one tiny nitpick with the way some scenes feel repetitive since they neither move the plot forward or give us anything new. Some of these still help to create tension, some feel like they're just… there.\r\n\r\nA Best Picture and Best Actor nominations seem to be on its way, but these are not the only achievements that deserve to be recognized. The original score by Hildur Guðnadóttir is incredibly addictive, so much that I'm listening to it while writing this review. It definitely helps to generate tremendous build-up, and it elevates the sinister environment of Gotham City. Lawrence Sher's cinematography is utterly stunning. The underexposure of some scenes is glorious. Sher paints the screen with so many gorgeous shots, especially with his close-ups on Phoenix, where the latter is able to shine. Jeff Groth is also impeccable in the editing room. There are several long takes with Phoenix just giving his all and letting all his emotions out (or keeping them all contained), which is always something I deeply appreciate since it helps with the flow of the narrative.\r\n\r\nRegarding the film's controversy surrounding its messages and the incentive to violence, I really don't know what to say. It's ridiculous. I remember those times when going into the movie theater was a surreal experience. It was the number one place for people to forget about their lives, jobs, everything. Joker is a fictional story! It's the origin of one of the worst psychopaths in the history of comic-books and cinema. If people expected to leave the theater \"happy\" or \"joyful\", then at least one of the film's message is right: society really is getting crazier. Have people forgotten who Joker is? What could you possibly expect from his origin story?!\r\n\r\nNowadays, no one knows how to behave (social media is the primary source for spreading hate). No one respects the fellow citizen or even the world itself. More and more people only look at their own bellies. Political agendas are everywhere. New extreme movements are created every other year. Social hypersensibility is exponentially growing. The same way some people will hate this movie for not being able (or simply not wanting) to accept that they feel empathy towards a murderer, people all around the world behave like their actions don't reflect on another person's life and on their own planet. If people get ruthlessly violent because they watched Joker, how can someone complain that the film's message is bad when it's eventually true?\r\n\r\nAll in all, Joker is one of the best movies of the year, and it's definitely on my Top3 at the date of this review. Joaquin Phoenix delivers my favorite male performance of 2019, by elevating a script about the origin of one of the evilest villains ever. The way he gradually becomes more insane is worthy of study, but it's how he's able to make the audience create empathy towards a psychopath that leaves me disturbingly captivated. Todd Phillips produces a character-study filled with an astonishingly tense build-up and one of the most chill-inducing payoffs of the last few years. With every single narrative decision nailed perfectly, Hildur Guðnadóttir's score and Lawrence Sher's cinematography stand out. The lack of restraint in showing the unmerciful violence (physical and mental) that society inflicts on one another is what makes us feel unsettled. Because we know it's mostly true, and we refuse to accept it. It's not a film about the Joker. It's a very realistic portrayal of someone (anyone!) who can become someone like him. And it's disturbingly brilliant!\r\n\r\nPS: Robert DeNiro (Murray Franklin) and Zazie Beetz (Sophie Dumond) are also great. Phoenix's performance is so mesmerizing that I almost forgot there were other actors in the movie.\r\n\r\nRating: A", "created_at": "2019-10-04T14:44:13.190Z"}, {"movie_id": 475557, "review_id": "5dac3463174a870019a7c547", "author_rating": null, "review_text": "Joker. The character that has existed since 1940, has become so heavy with so many different portrayals, different origins, that it feels impossible for any mortal man alive to impersonate the scattered personalities. It is an insurmountable task for any director to digest it all and still produce one more.\r\n\r\nTodd Phillips had a crazy challenge. He brought in one of the best actors alive to lift it with him, Joaquin Phoenix. Together, they have built a mass-market masterpiece which is just above the crop. It is appropriately crazy and completely focussed on the central character. The narrator goes close to the shores of that craziness, wets his feet but remains dry to tell this story. It is like those news reporters which go closer to the burning amazon, but it is impossible to step in the fumes. In no way, Joker is telling his story. Instead, his story is told to us and there are pillars of sanity (like the detectives, asylum clerk etc.) which remain steadfast to give a strong anchor to the audience. This dilutes the effect of the film.\r\n\r\nWith the copious amount of material on Joker already, I wished to consider this film as a standalone character study vaguely inspired by the batman universe. But this is not entirely possible. I was forced to think about it on two levels. With Batman and Without Batman. \r\n\r\nWith Batman, The Joker is on the home turf. There have been many renditions of Joker, and Heath Ledger's portrayal is still vivid in my mind. I knew that Arthur here will go on to become someone who is going to say, “‎Introduce a little anarchy. Upset the established order, and everything becomes chaos. I'm an agent of chaos...”. When I was thinking Joker in the context of Batman, I could not keep Ledger's joker too far away. I was searching for a path for Arthur to go from the mentally unstable to the calculating anarchist. I was left searching for that path when the movie ended. To remain as the crown prince of crime, and to justify the title of the greatest adversary of Batman, just mental instability isn't good enough. He needs to be much more intelligent, much more cunning. These traits are often visible early, In the case of Arthur, I could not find that complete foundation upon which the later psyche can stand. This reminded me of Cameron Monaghan's Jerome Valeska. The joker of my understanding is somewhere between the cruelty of Jerome and pitiable delusions of Arthur. Also, the iconic Batman moment was not needed in this. I kept feeling that Joker is trying to stand with the support of Batman's tale as a clutch. A safety net enforced by the producers.\r\n\r\nOn the other hand, if I consider this movie as a standalone tale, then it was a bit more satisfying. There are tearjerker movies where nothing good ever happens with the protagonist. A series of bad lucks, or difficulties keep blocking a normal life. He is most definitely poor, has a sub-optimal family background, has a medical affliction which is unique and provides a foundation of the pity I felt. This is not very far from Rani Mukharjee's Hichki if you only consider the medical condition. Rani's Naina had Tourette syndrome while Joaquin's Arthur suffers from pseudobulbar affect. The setting and genre make the two films vastly different. More often than not, I have noticed these disorders lift a lot of burden from the narrative. In the case of Joker, couple his disorder with usually being in the wrong place at the wrong time, you have a travesty of human life. Add to that, an unstable parent, amplify it with the volatile societal conditions, you have a perfect decoction of what Joker is made of. As a tale of its own, it works. The delivery is great thanks to the spectacular performance. It also helps to increase the awareness of mental health. But when you strip off all the Batman context, it remains a well-acted and averagely written tale. \r\n\r\nUnfortunately, this is a single film, and I felt it is torn between these two polarising treatments. It wants to find its ground, which it finds. But that ground is far from being sensational. It remains somewhat indecisive. It can not be well soaked in Batman lore like James Gordon's tale, Gotham is. I am considering Gotham because both Gotham and Joker do not feature Batman, but they both have Bruce. Gotham understands its lore and fully embraces it but Joker does not want to. At the same time, as a tale of the psychologically troubled protagonist, Joker tries to play safe with the aim to please audience en-mass. I kept thinking about American Psycho and The Machinist. (Coincidently, both star ex-Batman Christian Bale). Those two take you in the psyche of the protagonist. Those take you inside the burning Amazon and not stand at a safe distance. Joker does not aim to do so. \r\n\r\nI am not at all qualified to talk about the acting performances. Joaquin Phoenix is in every frame and the way he waltzes between emotions is terrifyingly amazing. The Tai Chi to calm himself down, the menacing stare when finally becomes the Joker, those are chilling. He lives the character to the best of his abilities. Regrettably, he does not have the same level of writing support which Heath Ledger had and so due to no fault of his own, Joaquin could not topple Heath Ledger's portrayal of the crown prince of crime.\r\n\r\nIf I consider Todd Philips's entire resume, this was a genre shift for him. He knew very well that the biggest trump card is Joaquin Phoenix, so he takes no risk. He keeps him in focus, almost always all the setting and cinematography works for him. The only exception being Robert De Niro. Robert is allowed to carry his scenes quite independently. I think Todd Philips relied on both these giants to carry their parts. Sadly, I had gone to a theatre which had a bad print or screen so I think I will have to watch it again sometimes to enjoy the cinematography.\r\n\r\nI realised, I kept writing a lot and this is already over a thousand words. If you are here and reading still, I must say thank you. To summarise, The Joker worked for me and I enjoyed it, but I would not consider it the best depication of the iconic villain from comic books. The best may yet come.", "created_at": "2019-10-20T10:18:11.465Z"}, {"movie_id": 475557, "review_id": "5db52049d40d4c0014fd08bc", "author_rating": 9.0, "review_text": "The Joker is similar to the DC Joker character but is not a criminal genius. The movie was a great depiction of how a person who has been mistreated, lied to, and ignored, totally lacking access to human compassion, can snap. The acting is top notch, and it puts a spotlight on the importance of mental health in modern times.", "created_at": "2019-10-27T04:42:49.176Z"}, {"movie_id": 475557, "review_id": "5dd9cdd528723c0014588c1f", "author_rating": 7.0, "review_text": "Okay, this film has already been so widely debated that I’m not sure what I can really add to the conversation. So, I’ll just give my thoughts.\r\n\r\n“Joker” is a fairly basic character study of Arthur Fleck, a mentally ill man who feels increasingly marginalized by an uncaring and brutal society in Gotham City. To start, the characters, except for Arthur himself, are pretty flat. They seem to have little purpose other than to further Arthur’s story. This includes Thomas Wayne, who in other media is portrayed as a man of many dimensions, wealthy but caring, and instilling these values in his son Bruce. Here, he is portrayed as much more uncaring and elitist. Which gives much less of an impact in the inevitable alley scene we see in everything remotely related to Batman. More on this in a minute. It’s important to the point.\r\n\r\nArthur suffers a condition that makes him burst into laughter at inappropriate times. He also has other unspecified mental illnesses. We’re never given the specifics. This is actually a little troubling because of the general depiction of mental illness. It almost seems like they are saying that if someone is mentally ill then they are a ticking time bomb and it’s only a matter of time before they go off. This is not a good look.\r\n\r\nAfter a series of events, Arthur begins spiraling downward, but at the same time realizes how much influence he can have over other people, an aspect of the Joker that isn’t often explored. And this is where the characters other than Arthur being rather flat comes into play.\r\n\r\nThere’s more than one indication that we are actually witnessing these events through Arthur’s eyes. And this creates a brilliant depiction of a narcissistic personality. The only character that gets fully fleshed out is Arthur himself, but he can’t or won’t connect with other people to see their depth. As such, we get to see narcissism from the inside, no connection to others and in fact seeing them as pawns in his own schemes. It’s subtle and definitely not in your face, but if you look carefully, the hints are there.\r\n\r\nThose who fear that \"Joker\" would glorify incel violence or otherwise can rest a little easier, but as I mentioned, the film isn't without its troubling portrayals. It does vilify the mentally ill, which creates a whole host of other issues. The movie swings wildly between \"excellent\" and just \"okay,\" and sometimes even \"meh.\" As such, it gets a recommendation, but only a mild one.", "created_at": "2019-11-24T00:24:53.294Z"}, {"movie_id": 475557, "review_id": "5de278e63faba000150b67f4", "author_rating": 9.0, "review_text": "*A Masterpiece*.\r\n\r\nThe movie shows the escalating events that made Arthur become the Joker. Initially an inoffensive poor and sick man, Arthur suffered a tide of unfortunate events that pushed him closer and closer to the edge. \r\n\r\nIgnored and despised by everyone, sick and alone in the world, and neglected by the State, Arthur becomes progressively more violent until he breaks.\r\n\r\nMuch more than one more Super-hero movie, *Joker* uses well-known characters to promote the reflection on the \"ignored\" ones. At least, ignored until they become a Joker.", "created_at": "2019-11-30T14:12:54.562Z"}, {"movie_id": 475557, "review_id": "5df59eaad1a89300197854b5", "author_rating": 8.0, "review_text": "***Not fun, but absorbing, artistic and tragic***\r\n\r\nA mentally troubled middle-aged clown (Joaquin Phoenix) who lives with his mother (Frances Conroy) in Gotham City goes from not good to worse when he finally realizes his true identity. Robert DeNiro plays a talk show host and Zazie Beetz the friendly girl down the hall. Brett Cullen is on hand as Thomas Wayne, Bruce’s rich father.   \r\n\r\n\"Joker\" (2019) is an arty, slow-burn character study of the popular DC Comics’ villain, but it’s more of a psychological crime drama/thriller and tragedy than a superhero flick (or, in this case, supervillain). The movie’s captivating from the get-go and practically everything works for a broodingly superb cinematic experience. \r\n\r\nThere are several amusing bits, but this ain’t a fun flick. It’s heavy and tragic. But what’s the message? Simply that this is how a quirky man who wanted to make people laugh became The Joker. He’s a little reminiscent of the clown in Steve Gerber’s “Night of the Laughing Dead” in Man-Thing #5 (1974).     \r\n\r\nThe movie runs 2 hours, 2 minutes, and was shot in New York City (Bronx, Harlem, Manhattan) and nearby New Jersey (Jersey City & Newark).  \r\n\r\nGRADE: A-/A", "created_at": "2019-12-15T02:47:06.716Z"}, {"movie_id": 475557, "review_id": "5e0e888768188800145829f8", "author_rating": 9.0, "review_text": "_Joker_ is a tour-de-force of a movie, not quite like anything I've seen, maybe since Taxi Driver. At its core it's a movie about the breaking point of a broken man, wrapped under the banner of a comic book movie that, take out the Waynes, works on its own.\r\nJoaquin Phoenix truly gives a transformative performance (not unlike Heath Ledger) and will say is deserving of an Academy Award. The supporting cast all did well, though, and it is a small role, Zazie Beetz was great and De Niro had his moments, particularly at the end.\r\n\r\nGot to hand it to Todd Phillips, between this and the good, albeit flawed, War Dogs, has proven to be more than those Hangover movies.\r\n\r\nNo, this isn't a feel-good movie and while it does sit at the top of my 2019 list, not entirely sure when I'd revisit. **4.75/5**", "created_at": "2020-01-03T00:19:19.624Z"}, {"movie_id": 475557, "review_id": "5e2f26e44ca676001249c3c2", "author_rating": 8.0, "review_text": "the ‘Hangover 2 & 3’, the two most uncomfortable comedies he’s ever directed that felt more crime drama than anything funny. There’s also some dark humor in ‘Joker’ that involves a door chain. It’s silly, yet absolutely terrifying with the given context. A complete departure from his other work and that’s why I think it’s one of his best. I honestly think he made something so unique and meaningful. Seriously, I do.\r\n\r\nThe score by Hildur Guðnadóttir helped set the tone tremendously. A melancholy tone with a chaotic twist. A representation of Arthur slowly drowning in his own misery and pain. A little fun fact: The score for the film were written based on the script even before the actual filming of the movie started, which I think is the best way to do it, if you ask me. Someone to imagine movie by songs and incorporate their interpretation through music.\r\n\r\nThe cinematography was gorgeous and there’s a handful of shots that has imprinted into my memory. Lawrence Sher does an excellent job off showing the decaying Gotham city and the sewer waste look of the city. Bright neon lights with striking colors that manage to make the most run down of places look pretty.\r\n\r\nI like how they actually gave Thomas Wayne a character rather than “guy gets shot in alleyway”. He’s portrayed as a ruthless man with blunt ways of saving Gotham City. However he loves his wife and son, so his unforgiving attitude was all for the shake of keeping his loved ones safe. He’s also a massive movie buff where he often goes to watch the classics on the big screen. So it’s an interesting take on the character viewed in somebody’s else perspective.\r\n\r\nThere’s a scene where Arthur goes to watch a comedy standup show to take notes on a comedians act. Every time a joke is told and everyone laughs, his face is frozen in place with an unsure grin while his eyes look around the room wondering why everyone’s laughing, but when the laughter dies down he jumps to live with a delayed laugh. It’s moments like that are simple, yet says a lot about him. Basically showing how disconnected he is with humor and everyone else.\r\n\r\nNow lets talk about the controversy that's been surrounding this movie:\r\n\r\nThis is one of the most ludicrous controversy in recent memory. The movie will not cause or inspire violence, but shows why violence happens. I mean, there probably has been incidents when somebody committed a horrendous crime because their were influenced by a movie or a game. However, it’s he/she that should be brought into question, not the creators. Maybe this movie could inspire people to think twice about how they treat others. Why not think about the positives? If “Joker” is going to be responsible for violence and mass shootings, then so is every other movie with any form of violence ever. If people really care about how violence is portrayed in movies, then Rob Zombies ‘3 From Hell’ should also receive the same attention. Just imagine ‘Natural Born Killers’ times 100, but I guess it’s not mainstream enough for any of that. And sure, there’s some brutal and raw approach to violence in ‘Joker’, but we all have seen worst. ‘Deadpool’ is more graphic than this. It's not the directors duty to teach morals to the viewer. People will never learn to stop pointing fingers at things to blame and actually do something about it! People often understandment how much power their got.\r\n\r\nAnywhere, sorry about that folks, just had to get that off my chest. Go and check it out.\r\n\r\nOverall rating: “Send in the clowns” ⇠ you’ve gotta sing that like Frank Sinatra.", "created_at": "2020-01-27T18:07:32.017Z"}, {"movie_id": 475557, "review_id": "5e31cc72c56d2d001851772a", "author_rating": null, "review_text": "It is intersting to analyze this movie in a context of global increase of violent social movements against the Establishment. Joker succeed in making me accept a violent reactions without really explicit political fundation.", "created_at": "2020-01-29T18:18:26.733Z"}, {"movie_id": 475557, "review_id": "5e4d8cba283ed900195ccff2", "author_rating": 3.0, "review_text": "This is going to be one of those posts where I go against the mainstream but my reaction when I watched this movie was: You got to be f… kidding me?\r\n\r\nThe only resemblance to the REAL joker in this movie is the name. As far as I am concerned this movie is an insult to the fans of Batman and the REAL Joker.\r\n\r\nThe “Joker” in this move is a unintelligent deranged nutcase. There is a sob story in the background about how he became that way which is totally uninteresting.\r\n\r\nThe REAL joker is a intelligent criminal mastermind. I was waiting for this nutcase to actually become that for the entire movie. Spoiler alert, it never happened! This guy starts as a useless sobbing nutcase and he ends the movie as the same useless sobbing nutcase.\r\n\r\nThe movie has NOTHING to do with the real Joker. It is a blatant attempt to garner support for a unrelated psychopathic thriller by using the Joker name. If it would have been advertised as such I probably would have, if not liked it, so at least appreciated it for it’s qualities. It is indeed a well done movie technically and the main character is indeed excellently performed.\r\n\r\nHowever, even if I try to distance myself from the deceitful Joker label, I find it overall boring, too long and really a movie about a psychopath probably made by someone with mental issues himself. But then that’s Hollywood today.\r\n\r\nThat the politically biased and elitist so called “critics” on sites like Rotten Tomatoes like it is not really surprising but I have to confess that I am somewhat surprised at the rave ratings by real viewers on some other sites.\r\n\r\nHonestly, I was expecting to be disappointing by this movie. Then I am always cautious about movies getting rave reviews, especially from the previously mentioned totally useless and crappy “review” site. I did not expect this level of disappointment though. Epic fail as far as I am concerned.", "created_at": "2020-02-19T19:30:02.315Z"}, {"movie_id": 475557, "review_id": "5f5b57f3da10f00037917127", "author_rating": null, "review_text": "Joker made me laugh , cry , and made me feel scared . This movie isn't your run of the mill superhero flick this is a gritty  homage to that of films made by the great Martin Scorsese . Some scenes will have you in shock and awe without breaking away from what Arthur sees and feels as he lives in an 80's era Gotham living with <a href=\"https://paperhelp.nyc/\">paper help</a> and his mom and a mental disorder (Pseudobulbar affect if I'm not mistaken ) , the film also adds the unreliable narrator aspect ( where the camera can show you something that either isn't real or isn't happening), besides that the acting is phenomenal, Joaquin Phoenix really brings his A game, showing Arthur fleck as a loving, kind individual that just wants to make you laugh but is beaten down by an ever changing society that both beat him down and in the end breaks him. This movie also adds the idea of the \"one bad day\" theme from the killing joke comic where in the comic joker says and i quote '' all it takes is one bad day to bring the sanest man to lunacy \" and it takes that idea and brings it to the forefront. In conclusion I think joker was beyond amazing, between the acting, music score and set pieces it was a wild (and scary) ride . Symbolism also sneaks into the movie with slight things you wouldn't notice upon first watching . This movie leaves you confused on what was real and what wasn't . In the end between you and your spouse , friend , or family member will have reasons on what was real and what wasn't  and that's what made the movie even better for me , how it left me talking days after and like dark knight and iron man before this i believe that joker will change the superhero movie genre forever... send in the clowns 10/10 would see again", "created_at": "2020-09-11T10:56:51.682Z"}, {"movie_id": 475557, "review_id": "60739f5f7776f0005810629a", "author_rating": 10.0, "review_text": "Each to their own, as always, but for me: Incredible!\r\n\r\nI was fully aware of <em>'Joker'</em> ever since its release, impossible not to be given the extraordinary hype that surrounded it, but it still absolutely surpassed my expectations - a sensational film. I adored every second of this; and I'm not even a Joker/DC Comics etc. 'fan'.\r\n\r\nJoaquin Phoenix gives an astonishingly outstanding performance as the titular character, undoubtedly one of the greatest showings that I've ever seen from an actor. I'm not one that takes notice of awards, but he is fully deserving of anything of that ilk that he won due to this. Quality!\r\n\r\nEverything else about the film is fantastic. Great score, great cinematography, great pacing... it's all just utterly superb and makes for a spectacular watch. I love that they avoided just going wall-to-wall crazy with this, don't get me wrong things get mad but there's more to it than just violence et al.\r\n\r\nI had presumed that I was going to enjoy this, but it honestly smashed any predictions I had about it before seeing it. Even after just one viewing, I can already state it's one of my favourite films. Excellent!", "created_at": "2021-04-12T01:16:15.424Z"}, {"movie_id": 475557, "review_id": "621a97793a48c5006d1e59e4", "author_rating": 10.0, "review_text": "Carried by a terrific Phoenix, ‘Joker’ leaves an emotional impact as we see a bullied clown slowly transform into someone who enjoys creating chaos. Too bad we don't get to enjoy Phoenix as Joker more, though, because pretty soon after the turning point, the movie ends.\r\n\r\n10/10", "created_at": "2022-02-26T21:11:21.299Z"}, {"movie_id": 475557, "review_id": "627f007f2dc9dc009eed60e9", "author_rating": 10.0, "review_text": "It was exactly what it wanted to be, and it pulled it off perfectly. The \"slow\" parts add a lot to the atmosphere and it all culminates in a dramatic and unforgettable ending.", "created_at": "2022-05-14T01:06:07.034Z"}, {"movie_id": 475557, "review_id": "62dfa90b33a53305200fa01a", "author_rating": 10.0, "review_text": "I knew it was gonna be super hard for me to like a Joker after Heath Ledger... Cameron in Gotham did awesome, Leto was really insane as Mr. J. But, I wanted a Joker stand alone... And this is what they gave me...\r\n\r\nBrilliant. From start to finish i just was on the edge of my seat. This movie pulled at my heart. I saw myself in this character and understand every reason why a series of bad days could make a person ... Snap. Well done.", "created_at": "2022-07-26T08:42:51.056Z"}, {"movie_id": 475557, "review_id": "63bf6cd423be46007cb9ab32", "author_rating": 10.0, "review_text": "It's not an incel movie, despite what people are saying. And it's no a White Supremacy film either. It's not even a pro T-word president film. In fact, it addresses some pretty heavy left wing issues. Or at least issues that were traditionally on the left before things went...weird and all topsy turvy.\r\n\r\nHowever, it is also NOT a Marvel Film, so of you are walking in expecting a Marvel style movie you will walk out hating it. So don't go in expecting an MCU film.\r\n\r\nInstead you get a dramatic, slow moving, intensely building movie that develops it's characters.\r\n\r\nAnd it really develops them, when you start watching the film the Joker was sympathetic... and by the time you walked out you really hated him.\r\n\r\nAnd that is all I feel comfortable saying without spoiling things.", "created_at": "2023-01-12T02:13:40.091Z"}, {"movie_id": 475557, "review_id": "64a6df942b531d00e86cd12b", "author_rating": 6.0, "review_text": "Really crazy dramatized movie. Slowly watching him go crazy. Pretty shocking ending and I wasn't expecting it.", "created_at": "2023-07-06T15:36:52.490Z"}, {"movie_id": 475557, "review_id": "6538b07e9c24fc0126569ed9", "author_rating": 9.0, "review_text": "The scenario told in this film depicts a situation in which we frequently disregard the feelings and situations of others around us, people who may not have the same advantages as us. We can sense the psychological upheaval that Joker is experiencing from his point of view. All disappointment and rage build up and eventually explode. The people of Gotham rebelled as a result of their dissatisfaction and indignation at the injustice they faced.\r\n\r\nThe Joker is also seen dancing on a car in the midst of the rioting, surrounded by people shouting his name. Making them an embodiment of \"Hero\" in order for them to share their ideas.\r\n\r\nRead more for Indonesian review in\r\nhttp://www.alunauwie.com/2020/07/joker-all-i-have-are-negative-thoughts.html", "created_at": "2023-10-25T06:06:54.631Z"}]