[{"movie_id": 1452, "review_id": "5e4771a91e9225001dbf0fa7", "author_rating": 8.0, "review_text": "***The Passion of the Christ, I mean Superman***\r\n\r\nSuperman returns to Earth after five years trying to find out what happened to his homeworld. As Clark Kent he gets his job back at the Daily Planet newspaper, but finds out Lois Lane has moved on without him -- having a live-in fiancé and a five-year-old child, not to mention winning a Pulitzer for her article \"Why the World Doesn't Need Superman.\" Meanwhile Lex Luthor and his henchmen discover Superman's Fortress of Solitude and steal some of the alien crystals. Luthor's mad scheme is to create a new continent, killing billions of people in the process.\r\n\r\nThe story is a superhero retelling of the Christ story:\r\n\r\n- Jor-el gives his only son to protect (save) humankind. \r\n- Superman repeatedly states that he's everywhere and will always be around (i.e. omnipresent). \r\n- Luthor and his henchmen's beating of Supes is reminiscent of Christ's beating before his crucifixion. \r\n- Superman sacrifices himself to save humanity from Luthor's new continent. \r\n- When superman \"dies\" above the atmosphere of Earth he is shown in a cross posture.\r\n\r\nMeanwhile Lois Lane is an obvious type of atheism. Although she once believed in and even loved Superman, she's now convinced the world doesn't really need him. She's obviously unhappy and bitter; she lacks the pizazz she had when she once believed.\r\n\r\nOf course, all this heavy symbolism is useless if the story itself fails to capture the viewer's attention. This is especially vital when the picture runs 2 hours and 34 minutes. \r\n\r\nThe film definitely has an epic vibe to it, even more so than the first in the series. It seems more serious, i.e. less campy, especially where Luthor and his team are concerned. The film also possesses an imperceptible reverent quality. Even though the whole Superman mythos is totally absurd, the film somehow enables the viewer to accept it as real. On top of all this there are numerous humorous bits, which are laugh-out-loud funny (watch out for the hilarious \"It's a bird,\" \"It's a plane\" piece).\r\n\r\nOther things worth commenting on:\r\n\r\n- Some complain that Kate Bosworth lacks charisma as Lois Lane, but this all fits into the bitter \"I no longer believe\" subplot. Bosworth is fine in the role. \r\n- Some complain about Superman's 5-year visit to Krypton. What's the problem? Part of my youth was spent in Minneapolis and I've gone back there numerous times to quell my curiosity. Why wouldn't Superman feel the same way? Why was he gone so long and why did he need a crystalized craft? Because he was potentially exposing himself to large amounts of Kryptonite (radioactive pieces of his homeworld) which would severely weaken him, not to mention he gets his powers from the Earth's sun. \r\n- Some complain about Lois' fiancé and her son, the latter of whom may or may not be the offspring of Supes. Wouldn't it be natural for Lois to move on after about two years waiting? Her \"shacking up\" before marriage can be attributed to her new \"I no longer believe\" mentality. \r\n- Love is a strong theme here as is fitting for any retelling of the Christ story. Superman loves Lois and vice versa, even though Lois is initially in denial. Love gives life and saves from death. \r\n- I liked the fact that Lois' fiancé, Richard (Marsden), isn't made out to be a villain. Interestingly, Lois picked a man who, as a pilot, could fly her around like Supes, albeit less spectacularly. I also like the fact that the film shows Lois being faithful to Richard even though she discovers she still loves Superman. The human heart is capable of loving more than one person, but can only be faithful or committed to one, if you know what I mean. \r\n- Frank Langella is his usual charismatic self as Perry White. \r\n- Kevin Spacey is excellent as Luthor and arguably superior to Hackman; this is especially evident as the story progresses. His larger-than-life lunatic scheme is truly fitting for Supe's main foe. \r\n- There are numerous dramatic parts where the film takes its time to tell the story; there's obviously no rush to get to the next CGI action scene. Those with ADD beware. Needless to say, this is a film for adults even though kids will enjoy many aspects. \r\n- \"Superman Returns\" was one of the most expensive films ever made at $209 million but made most of it back in North America ($200 million) while almost doubling it worldwide ($392 million). What's strange is studio heads were disappointed with these numbers, claiming it should have made $500 million.\r\n\r\nBOTTOM LINE: I was surprised to discover how good \"Superman Returns\" is. This is an epic and moving superhero film; sci-fi/fantasy at its best. Is it as good or better than the best superhero films? Not only is it as good, it's deeper.\r\n\r\nGRADE: A-", "created_at": "2020-02-15T04:20:57.997Z"}, {"movie_id": 1452, "review_id": "5e94e84f66a7c30016036557", "author_rating": 8.0, "review_text": "The light to show the way. \r\n\r\nAfter a five year hiatus, Superman returns to Earth to find that Lois Lane is now a soon to be married mother, but some things don't change, loony Lex Luthor is loose and his latest plan will kill billions of people.\r\n\r\nI first reviewed Superman Returns some two years after its initial release, I had first caught it on release back in 2006 and was really taken with Bryan Singer's approach to a subject he clearly loves. I was awash with nostalgic fervour back then and the moment the theme tune kicked in (great move by Singer to use the John Williams original) I was grinning like a Cheshire cat, yet it seemed I was in a minority back then as regards the film's worth, and with each passing year I find I still am.\r\n\r\nSuperman Returns will forever be known as the franchise entry that has too much heart, because it finds Singer giving Superman emotional fortitude and, crucially, making it the heart of the story. Those that purely wanted a big colourful popcorn explosion will forever be unfulfilled it seems. Yet it has to be said that fans of Singer's work (such as I) totally get the emotionally heavy approach he has taken, watching Superman shred himself after learning of Lois' love for another, makes for compulsive viewing. Because our man of steel is conflicted, not only with his sense of protective being, but also in the rigours of love, it's this conflict of Superman that drives the film on. Not to say that there isn't any action here, though, in fact some of the sequences here are truly exhilarating. Oh yes, the popcorn crowd are well catered for, planes, space shuttles and a tension filled helicopter, all figure in and around Superman and Luthor's world.\r\n\r\nBrandon Routh dons the cape worn so brilliantly by Christopher Reeve in the 70s, and smartly Routh takes the route of \"if it isn't broke then don't fix it\", there's no need to put ones own stamp on a character already so well defined and well loved. Looking like Reeve, and playing out uncannily like him, Routh studied Reeve's performances to get as close to the Reeve incarnation as he could, and he gets it down pat whilst adding a bit of brooding honesty into the mix. Kate Bosworth gets to be Lois Lane, it's a very solid and controlled performance that would have seen her as a shoe in for the role again if Singer had of taken the reins for a sequel. Taking up the role of Lex Luthor, and clearly having a great time, is Kevin Spacey, this is a more clever Luthor incarnation, it's spiteful and devoid of campery. While along for the ride as Luthor's moll is Parker Posey, she's sparky with a hint of devilish sexiness.\r\n\r\nBryan Singer reinvigorated the Superman franchise, and in doing so brought a new verve to the characterisation of an American icon. It has proved to be divisive amongst the fans and critics alike, so much so that Singer has left the Superman world. But viewing it even now brings many rewards, it is a damn fine Superman movie. You can never have too much heart at your film's core, that is as long as one remembers what made prior efforts work in the first place, Singer did to my mind fuse both very admirably indeed. 8/10", "created_at": "2020-04-13T22:31:43.933Z"}]