[{"movie_id": 49049, "review_id": "50db93c119c29535dbc36f3c", "author_rating": null, "review_text": "I like this movie more than the one with Silvester Stallone. Nice slowmotion shots and a good story for an action movie.", "created_at": "2012-12-27T00:18:09.300Z"}, {"movie_id": 49049, "review_id": "50ea1c0d760ee3799412a8d0", "author_rating": 9.0, "review_text": "This film blow me away! I was not expecting this, a cop (a judge) based in the future with high violent's and great characters. You will think you will hate Dredd but you wont.", "created_at": "2013-01-07T00:51:25.071Z"}, {"movie_id": 49049, "review_id": "511f69a5760ee35c3b11fb3a", "author_rating": 7.0, "review_text": "I think this adaptation of the Judge Dredd comics books are a much more how most people probably would expect that a Judge Dredd movie should be, especially compared to the rather disappointing 1995 version. That of course means that the movie is quite violent. Anyone who has ever read the comics should not be surprised about the fact that this movie is mostly about taking out the bad guys, and if you cannot take out the bad guys using violence then just use more violence.\r\n\r\nExcept for a few gripes that I will come to I quite liked this movie. The plot is a fairly simple one but it is also a plot that I would not have been surprised to find in one of the 2000 AD comics. It is a quite suitable plot for a Judge Dredd movie. The plot centres around the drug “Slo-Mo” which slows down your perception of time. This of course gave the director carte blanche to use extreme slow motion effects which could have been quite annoying if overdone. I think it is used quite well in this movie though. I especially liked the effects on the people standing behind the door that Dredd blew in at the beginning of the movie.\r\n\r\nJudge Dredd himself is well played by Karl Urban and, thankfully, he does not remove the helmet in this movie. I’m sure it was done to satisfy Stallone’s ego in the 1995 movie and it was one of the things that ruined it. Judge Dredd is not supposed to remove his helmet, period. “Ma-Ma” is also a quite okay bad guy for this movie. Sufficiently psychopathic yet intelligent and rational enough to make a believable, at least as believable as a Judge Dredd villain can be, adversary to Dredd.\r\n\r\nI have a few gripes about the movie though. My main gripe is that it is not the ultra-modern city from the comics, at least from the comics that I have read since I have not read them all. It is more of a bunch of mega-scrapers spread out among the city slum that is left from today and still looks very non-futuristic. The initial chase scene is done using an old Volkswagen van for Christ sake. I really did not like that and, as far as I am concerned, it lost a star for that. If I remember the comics correctly MegaCity One was built more or less on top of the old ruins.\r\n\r\nAnother thing that I did not like was the crooked judges. Ii is possible that they used the concept of a bad judge in some of the comics, I do not remember, but I still did not like it. The judges are supposed to be above “ordinary people”. I am sure that they could have come up with some other plot element than that.\r\n\r\nAnyway, the bottom line is that I quite enjoyed the movie. The fact that the DTS-HD Master Audio sound on my Blu-ray copy was excellent did add to the enjoyment of course. The surround and LFE effects was quite powerful yet balanced so they did not cause my somewhat weak subwoofer to go into resonance. Very enjoyable movie evening indeed.", "created_at": "2013-02-16T11:12:37.261Z"}, {"movie_id": 49049, "review_id": "5207b0e0760ee362ff24c0b1", "author_rating": null, "review_text": "About a million years ago (1980-85ish), when I was a boy, I bought a comic each and every week called 2000AD. And I loved it. I mean, properly LOVED it. The flagship strip in this publication was (and all these years later, remains) Judge Dredd. The titular lead character (his name, a play on that of novelty UK ska/reggae artist Judge Dread - who himself lifted the moniker from a Prince Buster tune - although there any similarity ends, absolutely) was a \"Judge\", a one-tier law enforcement agent with the authority to arrest, charge, try and sentence perpetrators of crime on the spot (including issuing the death sentence, a sentence dealt out frequently), operating in the early 22nd century in Mega City One, a post-apocalyptic overpopulated dystopian conurbation stretching from Boston to Washington DC. A grim, violent piece, it nevertheless managed to mine some gallows humour from the ultra-right wing dispensing of justice, especially as doled out by our perpetually helmeted Dirty Harry-style anti-hero (of course, Harry Callaghan was constantly railing against the system. Not so Joe Dredd; he WAS the f*cking system).\r\n\r\nThere were many different colourful characters within the pages of 2000AD but Dredd was by far the favourite (generally speaking; My personal favourite was Strontium Dog, followed closely by Nemesis the Warlock and The A.B.C. Warriors) and was always the one most ripe for a possible movie adaptation somewhere down the line. And so it was that in 1994 promising British director Danny Cannon was attached to direct Judge Dredd - the next Sylvester Stallone movie. D'Oh! Anyway, the movie was released in 1995 and it was pretty-much a travesty, top-to-bottom. Cannon, it appeared, was simply hired to be Stallone's bitch, and despite the thing looking the part (the art department deserve some props for that film, you know) Stallone seemed determined to kick any in-place mythology straight in the bin if he didn't fancy it (Dredd never takes his helmet off, because the law is faceless, or something; Stallone takes his helmet off. Judges don't have relations with one another; Dredd develops a love interest with comic strip regular Judge Hershey. Thuggish recurring anti-hero Fergee is reduced to comic relief, major MAJOR Dredd arch-enemies The Angel Gang are reduced to one-scene throwaways and a robot looking A LOT like Hammerstein from The A.B.C. Warriors is introduced for no good reason whatsoever).\r\n\r\nAnd that, it seemed, was that. Nice one, Sly.\r\n\r\nUntil now. Finally, almost two decades of time and blockbuster, money-spinning superhero comic adaptations at the cinemas seems to have washed much of the foul stench of Sylvesters \"oeuf de poo-poo\" away, and for the final flush, here at last is the reboot: Dredd, starring Karl Urban (The Bourne Supremacy, Doom) and directed by Pete Travis (Vantage Point, Endgame) with a budget half that of its turkey-basted predecessor (more like a quarter when adjusting for inflation). So, what's it like? Well, if you're a fan of the source material you're going to have to throw out all of your notions of what Dredd and his Mega City environment should look like. Although neither nailed it aesthetically, the Cannon/Stallone movie looks the part more than this one. Until someone wants to commit Avatar-sized monies to the project, I don't know if anyone will ever truly nail it. No, this one is a rough and dirty thing, reminiscent of the sort of nasty, faceless sh*tholes you'll find in the Death Wish franchise of movies. Still, beauty's only skin-deep, they say, and what's important is that this movie captures the eighties vision of dystopian future in exactly the manner that Judge Dredd the comic strip did all those years ago. It \"feels\" like Judge Dredd, in a way that the Stallone movie never did, despite oh-so-many more bells and whistles.\r\n\r\nThe plot? The plot is simplicity itself. Dredd is assigned to accompany and evaluate new recruit Anderson (Olivia Thirlby), a mutant who failed the Judge's aptitude test by a hair's breadth but who possesses a remarkable psychic ability to read peoples' minds, which the Justice Department obviously would want to exploit, IF Dredd decides that she can cut it as a Judge. Out they go to investigate a triple gangland-style execution in the Peach Trees city block, one of the thousands of futuristic high-rises that can hold 70,000 inhabitants, many of whom never have to leave the block in their entire lives. This particular block is ruled over by drug boss Ma-Ma (Lena Headey, 300), who ordered the executions. In an early exchange, Dredd & Anderson capture one of Ma-Ma's goons, and Anderson ascertains via her psychic skills that this particular goon was among those directly responsible for the executions. They decide to take him back to the Hall of Justice for questioning so's they can get the goods on head honcho Ma-Ma and her drug-traffiking industry but before they can do so, Ma-Ma seizes control of the security department of the block, locks the entire place down trapping the judges inside, and tells everybody inside to either help her kill the judges or get the f*ck out of her way; anyone helping the judges can expect to be killed too. So, Dredd and Anderson can either hide out until backup arrives, try to break out of the block somehow, or go up the building and after Ma-Ma, to kill her before she kills them. Which of those options do you suppose our man is going to go for?\r\n\r\nIn many ways, this film could've been called \"Anderson\" rather than \"Dredd\" (though obviously that wouldn't have been as marketable) since it's Anderson - played to just the right tone by Olivia Thirlby - who grows throughout this movie. And that's as it should be with Dredd: he DOESN'T change, he DOESN'T grow. He is a rock, a constant. Karl Urban - a childhood fan of Dredd himself - understands this and plays him to perfection (WITHOUT removing his helmet once; again, as it should be. Poxy Stallone). He's Robocop, without the warmth. For me though, the standout is Lena Headey. I wasn't enamoured at all with the idea of a \"new\" character as the main antagonist, and some whore-turned-druglord just smelled like that first \"market\" scene in Hannibal to me. But she's brilliant, really vicious. And the drug that Ma-Ma is pushing - Slo-Mo, which causes users to experience time at a tiny fraction of its real speed - allows us to view things through the eyes of the users, which in turn allows for some excellent slow-motion ballets of gruesome violence. And whilst the gore stays just-about on the cartoonish edge of things, this IS a very, VERY gruesome movie. About as gory as I've ever seen outside of the horror genre. But it moves at a real lick, it never lets up and it's all done and dusted inside the 90-minute mark. Lovely.\r\n\r\nAs of this writing, Dredd hasn't made its money back at the cinemas; a shame for a film that has had largely positive reviews and word-of-mouth. Still, it'll definitely go into the black when the DVD/blu-rays are released in the next couple of weeks, and that'll hopefully trigger a sequel or even the trilogy that writer Alex Garland wants to make. According to him, Dredd III - if it gets that far - will feature the Dark Judges. And that thought makes me quiver with excitement, like a boy reading his first copy of 2000AD, a million years ago.", "created_at": "2013-08-11T15:42:24.184Z"}, {"movie_id": 49049, "review_id": "5558b043c3a3687774008f3d", "author_rating": 4.0, "review_text": "So, nothing new under the sun. The same boring story and characters mixed in another movie. The only thing remarkable in this movie is the slow motion used during the drug usage, which is not much to say.", "created_at": "2015-05-17T15:14:11.666Z"}, {"movie_id": 49049, "review_id": "5aaf58d80e0a2665f501f68e", "author_rating": 8.0, "review_text": "I really was quite a fan of Dredd, I thought the actors, post-staff, director, writers and cinematographer all did an outstanding job. However, there is one man in the crew who makes the rest look bad.\r\nBy comparison.\r\nBecause Paul Leonard-Morgan's soundtrack is by leaps and bounds the standout piece of what was already a decent film by its own right. His work on Dredd is praise enough (he also did spectacular thing's for Limitless in 2011).\r\nI never got into the deeper Judge Dredd universe (ie. 2000 AD comics) and almost all of my knowledge comes from cursory internet searches, and that \"Dredd VS Death\" video game. But from what I can gather, Dredd is a more honest depiction of the source material than the Stallone-led Judge Dredd of '95.\r\nSo the music is outstanding, the Slow-Mo scenes are innovative and spectacularly produced and the specialised ammunition are astounding to watch. These are the three best parts of the film, in descending order, which to be fair, means that the gimmicks of Dredd are its most impressive feature. It's story is not broad (More of a \"day in the life\" than \"save the human race\" deal) and its characters are not greatly explored (though certainly not shallow), and it's mostly held together by these aforementioned \"gimmicks\", but more power to them! Better to have a solid baseline interconnected with deeply original fascination, than to have a boring rehashed piece of crap baseline, loosely stapled together with some poor excuse for dumping the same cliche $100,000 CGI explosions we've already seen four hundred times this quarter.\r\nSurprisingly, New Zealender Karl Urban (Star Trek, Star Trek: Into Darkness, LotR trilogy) makes for a better Dredd than I'd anticipated. Having a psychic was something I was initially sceptical of, too, however Olivia Thrilby (Juno, The Darkest Hour) put my concerns to rest after a long enough period to buy her role (about 25 minutes). And Lena Headey (Sarah Connor Chronicles, The Purge, Game of Thrones) I've liked since she played Queen Gorgo from 300 nearly a decade ago, so she\"s always a safe bet in my books, particularly in the role of relentless druglord Ma-Ma, she really is at home playing ruthless women of power, isn't she?\r\nThat all said, Dredd is not the best film I've ever seen. It's not even the best action-focused science-fiction film released in 2012 I've ever seen. But it takes risks, and that's nothing to be scoffed at. We need more Dredd's in our film industries, something to break up the monotony of most of Hollywood. Something that doesn't need to go big, or tick x amount of acceptability boxes, it's satisfied just being good.\r\n 77%\r\n\r\n-Gimly", "created_at": "2018-03-19T06:29:44.957Z"}, {"movie_id": 49049, "review_id": "5c24666192514167fbc64fed", "author_rating": 8.0, "review_text": "Incendiary!\r\n\r\nDredd is directed by Pete Travis and written by Alex Garland. It stars Karl Urban, Olivia Thirlby, Lena Headey and Wood Harris. Music is by Paul Leonard-Morgan and cinematography by Anthony Dod Mantle.\r\n\r\nReview for 2D Version Only.\r\n\r\nSylvester Stallone' 1995 attempt at bringing Judge Dredd to the big screen was met with a critical mauling, both professionally and by serious fans of the 2000AD comic books from whence the character came. On its own terms it's a fun popcorn piece, but one that totally missed the fascist grime of the source. Here however, under the guidance of Travis and Garland, Dredd gets the picture the fans and the character deserves.\r\n\r\nPlot is simple, we are in a dystopian future in a place known as Mega-City One. The only law and order are the Judges who are able to act as judge, jury and executioner. One such feared judge is Judge Dredd (Urban) and when he and his partner in training, Anderson (Thirlby), answer a call to a triple homicide at the multi storey slum tenement known as Peach Trees, they are locked in by crime boss Ma-Ma (Headey) and forced to defend themselves against practically everyone who resides there.\r\n\r\nThis is stripped down to the essence of what makes Judge Dredd such a beloved character in comic book lore. There's no need for backstories, love interests or comedy side-kicks, this is bad ass characters from either side of the law going at it full throttle. The action is unrelenting and explosive in its construction, bloody and brutal into the bargain as well.\r\n\r\nDredd the character is rightly kept to a basic level, he's a hard dude in a suit and helmet, with an arsenal of weapons upon his person and he delivers short sharp shock pieces of dialogue with gruff assertiveness. Anderson is a mutant of sorts, she can read minds, which superbly adds spice to this fight for survival narrative. Ma-Ma is a damaged villain, disgustingly menacing without histrionics, it's her calmness that's so terrifying.\r\n\r\nAt the core of the criminal activities fronted by Ma-Ma is a new drug called Slo-Mo, a drug that reduces the brain's perception to 1% of speed. This allows the makers to bring some dazzling effects into play whilst setting up some blood letting scenarios. The production design is top draw, where Mega-City One has a perfect totalitarianism sheen to it, which in turn is boosted by Dod Mantle's excellent colour lenses.\r\n\r\nWith Urban perfectly cast and his two lady co-stars also firing, Dredd is a thrilling action sci-fi movie. It doesn't push new boundaries and raise the bar per se, but it keeps the fires well and truly burning in the genre whilst appeasing the fans wholesale. 8/10", "created_at": "2018-12-27T05:42:57.794Z"}, {"movie_id": 49049, "review_id": "623f46d6706e56005dbea1a3", "author_rating": null, "review_text": "I used to read the comics when I was young, and they were simple, straightforward shoot 'em ups with \"Dredd\" the epitome of tough, no-nonsense law enforcement in a futuristic environment where crime, violence, poverty and unemployment were pretty normal for many people. This time, Karl Urban takes the title role as the policeman/judge/jury type, and he and his rookie \"Anderson\" (Olivia Thirlby) investigate a few dead bodies in the lobby of an hundred-odd storey building controlled by the drug dealing matriarch \"Ma-Ma\" (Lena Headey) and her menacing henchmen. To begin with, they must find the killer and get out alive - but when some of his own kind arrive and turn against him - and his partner is captured - he sets out to settle this once and for all. Yep, the dialogue is shocking; the acting only little better (Headey is about as menacing as yesterday's creme brûlée) but that's not the point. It's meant to be a brutal action adventure - loads of pyrotechnics, attitude, gun-battles (with some great weapons, btw) that is just aimless fun. That's what is says on the tin, and that's what is does. Never any doubt about the ending, but the route is what it's all about - and for me, anyway, it's just 90 minutes of mindless escapism with a bit of mind-reading thrown in for good measure. Not everything can be Jane Austen - aim low and you ought not to be too disappointed.", "created_at": "2022-03-26T17:01:10.708Z"}]