[{"movie_id": 522931, "review_id": "60c0f950f18ce7002972d96e", "author_rating": null, "review_text": "When audiences last saw Bodyguard Michael Bryce (Ryan Reynolds); he was dealing with the aftermath of helping save the day and his long-time nemesis Darius Kincaid (Samuel L. Jackson).   Taking place shortly after the events of the first film; “The Hitman’s  Wife’s Bodyguard”  finds Michael trying therapy after he has a reoccurring and disturbing dream following the loss of his AAA Bodyguard license.\r\n\r\nHis Therapist is eager to be rid of him and his multiple neuroses and suggests that he give up guns and the life he knew and find himself and his future self while relaxing in Italy.\r\n\r\nMichael accepts this and becomes at peace and is so clueless that while lounging with his noise-canceling headphones by the pool; he is oblivious to a brutal and protracted gunfight around him.\r\n\r\nIn no time; Sonia Kincaid (Selma Hayek); whisks Michael away and fills his ears with a string of highly unfiltered comments and rants.  It seems that Darius has been kidnapped and asked her to get Michael to help him out. Michael is unwilling to use guns and finds the to say unstable would be kind; Sonia to be way too unhinged for his new lease on life and that Kincaid wanted “Anyone but Michael” when he asked his wife to get help.\r\n\r\nThe trio is forced to work with one another by Interpol as it seems there is a plot underway to destroy the European Union and Michael, Sonia, and Darius have no choice but to do the bidding of the Government or face charges.\r\n\r\nThe fact that Sonia is desperate for a baby and a Honeymoon only complicates matters further as they recklessly head to their assigned mission and find that a very wealthy individual has nefarious plans and has hired elite professionals to ensure all opposition to his plans are removed.\r\n\r\nWhat follows is a madcap, violent, and dysfunctional romp as the trio battle the bad guys, the law, their own abundant issues, and each other to try to save the day and clear their slate with the authorities.\r\n\r\nWhile the film is not going to win many points for an original, complex, or overly complex plot; the setup and narrative serve to give the film a showcase for its strengths which are the three leads. Reynolds and Jackson work very well with one another and Hayek often steals her scenes with her compassionate yet teetering on the unhinged portrayal of Sonia.\r\n\r\nThe jokes fly as frequently as the blood and the bullets and there is some great scenery as well which frames the action and story perfectly. There are also some appearances by some very good actors in significant supporting roles which I will not spoil but suffice it to say they really support the main cast well.\r\n\r\nI summarized my reaction to the local Publicist as follows…” Not much plot, cartoony bad guys; but the great cast, action, and humor”.  While the film will not set a new standard in the Action Comedy category, it is still an enjoyable enough romp despite the flaws and it would be great to see the trio back for another madcap adventure down the line.\r\n\r\n3.5 stars out of 5", "created_at": "2021-06-09T17:24:32.088Z"}, {"movie_id": 522931, "review_id": "60e939c122e4800047ae5600", "author_rating": 10.0, "review_text": "I can't remember the last time I laughed so hard. Every time Ryan, Samuel, and Salma open their mouth it becomes a big laugh moment. The trio is just perfect and the performance of Ryan Reynolds, Samuel L Jackson, and Salma Hayek was so so so good. \r\n\r\nThe story wasn't great as the first movie but it was hell funny and full of bloody action sequences. There was some crazy car chasing scenes and big explosions. The VFX and the Cinematography were excellent.\r\n\r\nI like the addition of Morgan Freeman, Frank Grillo, my favorite, and Antonio Banderas. They all added more fun to this movie. I don't understand the hate for this movie. It was an interesting and entertaining movie from start to end. It's full of continuous action and jokes. I just loved it.", "created_at": "2021-07-10T06:10:09.624Z"}, {"movie_id": 522931, "review_id": "60f0625d97fdec0045ca185e", "author_rating": 6.0, "review_text": "Despite holding one of the worst sequel titles ever created, The Hitman's Wife's Bodyguard was always going to be a film I'd be interested in watching. The original flick was a straightforward, dumb action-comedy movie with a bunch of Hollywood stars attached to the project, which was always going to be financially successful. Fan-favorite comedic actors like Ryan Reynolds (Pokémon Detective Pikachu) and Samuel L. Jackson (Spiral) bantering for over an hour-and-a-half? Of course, viewers will run to the theaters...\r\n\r\nThis sequel follows pretty much the same formulas of its predecessor. Every remotely emotional moment or storyline is replaced by a random joke or nonsensical action sequence. A vast majority of the dialogues feel like stand-up comedy or improv from the actors. Even the villain portrayed by Antonio Banderas (Dolittle) checks all the caricatural boxes of the \"bad guy\". From the writing to Patrick Hughes' (The Hitman's Bodyguard) direction, it all feels too familiar and unexciting.\r\n\r\nThe bloated runtime, the overwhelming amount of jokes, and some rough language might be a tad too much for some audience members, but the phenomenal chemistry between every cast element is enough to compensate for an otherwise forgettable flick. Hopefully, a more than certain third film won't add more apostrophes to its title...\r\n\r\nRating: C", "created_at": "2021-07-15T16:29:17.569Z"}, {"movie_id": 522931, "review_id": "6122a4e43c4344002cc034db", "author_rating": 8.0, "review_text": "Fun enough action-comedy, probably a tad better (from what I can remember) than the first one, mainly due to the inclusion of Salma Hayek who was great and the sparring between Reynolds and Jackson wasn't as annoying compared to the last go around. Solid supporting cast with Antonio Banderas and Morgan Freeman as well. **3.75/5**", "created_at": "2021-08-22T19:26:28.538Z"}, {"movie_id": 522931, "review_id": "6275d5569979d2009b65a4e1", "author_rating": 6.0, "review_text": "As a sequel of an action comedy, this is a _predictable_ action comedy. It fills two hours with all the expected elements, in multiple instances and variations. \r\nWit replaced by \"strong language\", plot replaced by clichés, suspense replaced by action sequences (with CGI to reduce costs and make things safer). A couple of nods to completely different franchises, solid pacing; no arc of suspense despite an continent is to be eradicated. The story lacks any sense, the characters any depth - but it has lots and lots of humour.\r\n\r\nPity it's not my type of humour; but hey, other people will be shaking with laughter and will be highly entertained.\r\n\r\nWatch at your own risk and discretion: check any two minutes at random, decide - the entire movie is like that sample.", "created_at": "2022-05-07T02:11:34.656Z"}]