[{"movie_id": 882598, "review_id": "63351984c2679600847bb34a", "author_rating": 2.0, "review_text": "**Smile’s creepy trailers and clever marketing were the best parts of a movie with a meager plot drenched in uneasy sounds, and way too many jump scares.**\r\n\r\nSmile obsesses over saturating every moment in unsettling dread. The score and sound effects make every moment uneasy and uncomfortable, and not in a good way. Smile’s premise bore many similarities to It Follows with much poorer execution. Smile stumbled from jump scare to jump scare. I started closing my eyes because the jump scares were so predictable, and I was tired of having disturbing images screamed in my face. I will say that Sosie Bacon did an excellent job with what she was given, with her performance being the only bright spot in the film. Unfortunately, the movie was unimpressive and tried to cloak mediocrity in a fountain of jump scares, stressful noises, and unpleasant moments.", "created_at": "2022-09-29T04:05:24.726Z"}, {"movie_id": 882598, "review_id": "6349a527e263bb0084f27628", "author_rating": 7.0, "review_text": "As an avid horror fan, I can genuinely say that Smile unsettled me beyond belief. In many horror films of today, directors rely solely on jump scares to create this sense of shock and horror. But in Smile, Parker Finn is able to build suspense and tension throughout a scene to then crescendo into a jump scare that the audience knows is coming but are so tense that they cannot help but to release into fright.\r\n\r\nWhile this movie does not break major ground in terms of plot and storytelling there is some depth that is added with mental health and the feeling of isolation during manic episodes. I felt for Rose throughout this entire film, as she used to be the one helping patients through mental crisis and now that she is having one of her own, she is met with the same doubts even though it is a genuine fear. The sense of hopelessness grows throughout the movie as hope drains from our lead actress.\r\n\r\nSpeaking of our lead actress, Sosie Bacon is fantastic in this movie. She carries every single scene she is in, which is just about every one. Her minor facial movements and eye expressions were so sad and realistic to that of someone experiencing trauma. I loved everything about her performance and will be excited to see her moving forward. The other performances were average across the board, but they didn't really have a lot to work with and filled their roles well. Jessie Usher felt a little out of place though, I feel like he did the nice and charismatic husband role well but when he had to display genuine fear and anger he overacted quite a bit.\r\n\r\nFinally, I wanted to touch on the ending. I am not going to spoil anything for the audience, but this is exactly what I wanted throughout the entire film. I kept asking myself, are they going to do it? But second guessed myself and when the payoff happened, I left the theater with a big Smile on my face.\r\n\r\n**Score:** _75%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T18:06:31.034Z"}, {"movie_id": 882598, "review_id": "63525e254ca676007a52b46e", "author_rating": 5.0, "review_text": "\"Dr. Rose Cotter\" (Sosie Bacon) is a dedicated clinical psychologist who witnesses the gruesome suicide of a young woman in her hospital consulting room. Traumatised, as you might expect, she gradually starts to suffer from unexpected goings on in her own life. Her relationship becomes unstable and soon she appears to have but a tenuous grasp on reality herself. What's going on? Is she doomed to a similar fate? This has something of the \"Azazel\" theory to it, and as the story develops director Parker Finn manages to build quite a degree of mystery and suspense. The malevolence of her haunting spirit is well captured by those working the audio - the sound effects and the score contribute well to the overall feel of this film. The acting though, well I am sorry - I found that to be a terrible let down. Initially, Bacon owned the film but after a few moments she just hadn't the weight to carry the thing in what is, essentially, a one-hander. Her support comes mainly for her ex-boyfriend/cop and all round sceptic about the whole thing \"Joel\" (Kyle Gallner) after her boyfriend \"Trevor\" (Jessie T. Usher) and her own erstwhile psychiatrist played by an indifferent Robin Weigert give up the ghost with her. Sadly, they offer little to add depth to this rather superficial horror effort. There are jump moments, but they lose their potency as this actor fails to capitalise on the tensions being created around her. Perhaps had the story spent less time on her character development, and the pace been tightened up a bit then we might have had less time to worry about that; but the style of the photography with too many lingering images merely serves to sterilise the whole thing for me. I was really disappointed, and after a while just wanted to go watch \"Fallen\" (1998) instead.", "created_at": "2022-10-21T08:53:57.843Z"}, {"movie_id": 882598, "review_id": "63591e85665408008196fe5b", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2022-edition\r\n\r\n\"Smile deserves the praise it has received since its release.\r\n\r\nParker Finn's feature directorial debut contains haunting levels of suspense, consequently creating surprisingly effective jumpscare sequences. Sound design generates an immersive atmosphere rarely seen in horror films, but it turns out to be the moving, character-driven narrative that truly captivates viewers.\r\n\r\nThe impact of past traumas is excellently addressed by a screenplay that glaringly fails to conclude the story at the most appropriate, thematically correct time - one of the most damaging endings of the year.\r\n\r\nRegardless, it's definitely a personal recommendation.\"\r\n\r\nRating: B", "created_at": "2022-10-26T11:48:21.808Z"}, {"movie_id": 882598, "review_id": "638117a7dbbb4200849c8720", "author_rating": 10.0, "review_text": "Jebus! 😱 This is the most effective horror experience I've had since The Ring. Possibly ever. Holy. Crap. Glad there's still time to watch an animated family movie before I need to sleep. 45 years old, didn't think I could ever be this scared again from a horror movie 😂 This is sublime. I wouldn't change a single thing about it. Fire up that OLED, turn off the lights, and do yourself a favor and put on those earphones.", "created_at": "2022-11-25T19:29:43.515Z"}, {"movie_id": 882598, "review_id": "63bb9733a6e2d20092107cc2", "author_rating": 6.0, "review_text": "Some creepy moments for sure and a decent performance from Sosie Bacon, this is just another supernatural-horror film that I didn't find terribly entertaining and is pretty predictable. I suppose there are worse ways to spend two hours and since it's on Paramount+, maybe it's worth the time especially if you're a fan of these sorts of films. **3.0/5**", "created_at": "2023-01-09T04:25:23.837Z"}, {"movie_id": 882598, "review_id": "63dc5bf6ddd52d007c80f15f", "author_rating": null, "review_text": "After witnessing a bizarre, traumatic incident involving a patient, Dr. Rose Cotter (Sosie Bacon) starts experiencing odd occurrences that she can't explain. As an overwhelming terror begins taking over her life, Rose must confront her past in order to survive and escape her horrifying new reality. \r\n\r\nI really enjoyed this movie; it’s well-acted, and nicely shot, and the dread and suspense maintain throughout. \r\n\r\nRecommended.", "created_at": "2023-02-03T00:57:26.885Z"}, {"movie_id": 882598, "review_id": "63e0b013373ac2170994b502", "author_rating": 10.0, "review_text": "First thing that I like about this movie is that, it's unique. It's not like a copy of another copy like we usually see these days. Story's unique. Second thing that I liked about this movie is that it's scary, it's quite scary. If you're horror fan, you should definitely watch this. I suggest you to watch it in the dark, preferably alone. Also, the actress playing the main character does outstanding job. Overall, I'm going to put this movie in my favorite horror movies list. It surely deserves its place there.", "created_at": "2023-02-06T07:45:23.541Z"}]