[{"movie_id": 97630, "review_id": "51ec270219c295369f3aec4c", "author_rating": null, "review_text": "It’s simultaneously a blessing and a curse that I often wind up seeing films post-theatrical release. Even though I don’t intentionally seek out spoilers (OK, I do, but I’m getting better about it), I do still read reviews of films. The best reviews convey two things: 1) what the author thought of the film in question, and 2) enough information to give the reader an informed opinion as to whether or not said reader will enjoy the film, regardless of the author’s response.\r\n\r\nThose reviews, coupled with the near-unanimous praise the film has received from all quarters caused me to believe that I would fall in love with this film, becoming swept up in its high-tension, immaculately-crafted story of the hunt for, and eventual assassination of, master terrorist Osama bin Laden.\r\n\r\nI was so very, very wrong.\r\n\r\nIt starts well enough: under a black screen, a restrained opening plays audio (I do not know if it was real or dramatized) of phone calls placed on September 11, 2001 as the terrorist attacks that brought down the World Trade Center and the Pentagon were occurring. The film then introduces us to Maya (Jessica Chastain), one of many CIA workers tasked with finding the man responsible for those terrorist attacks. We follow Maya over the next twelve years, seeing small glimpses of her as she grows from determined but unsure interrogator to a woman whose sole reason in life is the location and capture of Osama bin Laden.\r\n\r\nThe film was in production for a long time, and the ending had to be hastily rewritten to account for the real-life assault on the bin Laden compound, which resulted in his death. What a boon this became for the film (to say nothing of the country as a whole), as the thirty-minute compound assault that serves as the film’s final act is a breathtaking, tour-de-force whirlwind, following Seal Team Six into the dark den of the most notorious terrorist in American history and emerging victorious.\r\n\r\nUnfortunately, the two hours preceding that astonishing climax is unforgivably dull, lacking almost completely in character development and good writing, and structured with the worst possible way in which to tell this epic and (potentially) fascinating story.\r\n\r\nChastain, one of the best actresses of her generation, vacillates between being utterly terrific (attempting to convince her superiors of her lead, her final scene) and sadly miscast. Chastain is an actress of uncommon grace and beauty, and trying to put her in the role of an embittered federal agent simply doesn’t work. The rest of the cast is serviceable, but the script (more on that in a moment) simply gives them nothing to do. At least the SEALs fare slightly better, with Joel Edgerton and Chris Pratt (from TV’s 'Parks & Recreation') crafting positive impressions from their slivers of dialogue.\r\n\r\nOh, that script. Written by journalist Mark Boal (Oscar-winning screenwriter of Bigelow’s 'The Hurt Locker'), it is a cacophony of crap. The dialogue is inane (“Bin Laden is there. And you’re going to kill him for me.”), the characters are flat, lifeless, and uninteresting, and most unforgivably, it takes what should have been a massively satisfying story (the hard-won retribution visited upon the monster that killed 3,000 innocent Americans), and trivialized it to nothing than the personal investment of a single person spurred by the death of a couple of coworkers during the twelve-year-long search. I understand that the search for bin Laden was over a decade of boredom and legwork, punctuated only by intermittent threats (most of which felt cooked up specifically for the film, despite those setpieces paling to what I can only imagine the real scenarios must have been like). But Bigelow’s insistence on conveying that to the viewers by boring them to tears as well is not an effective recipe for drama.\r\n\r\nIn a way, it’s the inverse of Steven Spielberg’s 'Saving Private Ryan'. 'Ryan' is a not a good film (the screenplay is utter dreck), but the skill, inventiveness, and sheer directorial talent on display in that phenomenal opening sequence catapult it to being on the greatest scenes in cinema history. Here, Bigelow stages her own version at the end of her film, and the results are equally gripping and visceral. On the basis of that one scene alone, Bigelow (much like Spielberg) deserved inclusion in the Academy’s nominees for Best Director. Outside of that, however, I find the critical acclaim of the film to be completely mystifying. The movie as a whole is rotten to its poorly-written core, a waste of money, and a diminishment of one of the best real-life stories of modern times. If you can, pop in for the last reel, but spend the other two hours watching something better.", "created_at": "2013-07-21T18:22:58.615Z"}, {"movie_id": 97630, "review_id": "5378d3f6c3a368553a003fc6", "author_rating": 5.0, "review_text": "Quite a flat movie. The story is interesting and also the fact that it shows how US has used tortures (which everybody but some US citizens already knew) but not much more than that.", "created_at": "2014-05-18T15:38:30.023Z"}]