[{"movie_id": 416234, "review_id": "5b3236ea0e0a263ff800cd8b", "author_rating": 4.0, "review_text": "Given the cast assembled and the events it's based on, I'm sure you'll forgive me for having at least some expectations for _Winchester_. Whatever those expectations were though, I can tell you right now, they weren't met. _Winchester_ was massively disappointing, as by-the-numbers as you can get, and if it wasn't for a couple of good performances and the occasional decent effect, it would have literally nothing to offer.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2018-06-26T12:51:54.188Z"}, {"movie_id": 416234, "review_id": "62e469ae46e75f006ed83d9a", "author_rating": 2.0, "review_text": "**A movie as empty as a haunted house.**\r\n\r\nI fully understand the fascination with Winchester Mystery House, an old mansion that was born from Sarah Winchester's will and ideas: owner of a fortune linked to the firearm's industry, she thought she was being haunted by the ghosts of people killed by these weapons and was advised by a medium to live in a mansion that was always being remodeled, with rooms and divisions permanently being added or demolished in an apparently random way. Sarah Winchester truly believed that she would be killed if she stopped or finished the building, so the house was only completed (obviously unended) with her death, and then opened to the public as a tourist attraction. It's a fascinating, curious and bizarre story, but it took a long time to reach the cinema.\r\n\r\nThe movie, however, is not remarkable, being just another ghost story in a haunted house. The Spierig Brothers (directors and writers) do not bring anything new to their film, limiting themselves to using almost all the regular clichés of American horror, including static and scary images that appear out of nowhere (at quite predictable moments) for the usual jump scares. As a haunted house horror movie, I've seen better.\r\n\r\nOne of the biggest problems of the film is the poor script and the bad conception of the characters. The two brothers who wrote the script were so enamored with the mysterious house that they weren't able to create a really intriguing story around it, and its original inhabitant. Everything goes reasonably well from the point where the doctor arrives at the mansion, but the preceding story, which justifies his trip and stay at the place, is very far-fetched. On the other hand, the melodramatic twist at the end, involving the doctor and a ghost from his past, was predictable from the beginning and is very nauseating. Poorly written and almost without personality, the characters just appear, talk and disappear without our caring about them. And as if the truth were not enough to make us believe in the possible curse of the Winchester family, the script got a completely made up story for Marion Marriott, niece (and heiress) of the manor owner. She existed in real life, but her life wasn't what the movie says, and her husband didn't die as it is said. It is a pointless and unnecessary invention.\r\n\r\nThe cast has a handful of familiar names, but maybe they don't really want to be remembered for the work they've done here. In fact, the cast effort is reduced, and the prevailing feeling is that the actors were not really committed or motivated. If Helen Mirren is the most seasoned and famous actress in the cast, the truth is that she is never really there, in body and mind. She seems oblivious, or uninterested. Jason Clarke still seems to have some interest in what he's doing, and I felt the actor tried to do something positive, but he won't have had much of an opportunity to go beyond what he's done.\r\n\r\nThe film is not a technical brilliance. There have been attempts to film in the original house, but we are told that the very design of the house, with cramped spaces and low light, will not be ideal for movie shooting. Personally, I also believe that the organization that is managing the property has shown some reluctance to allow it, since they have always had, until today, great restraint in allowing the capture of images of the interior of the house. Everything that was recreated in the studio seems to me to be very well done, and I liked the sets and the house. However, the production values ​​basically stop here… the cinematography is pretty basic and the editing is banal, but it manages to give the film a pace that isn't tiresome. The props and period details look convincing, but the CGI is poor, the digitally made images are of very poor quality, and the visual and sound effects seem cheap and elementary.", "created_at": "2022-07-29T23:13:51.009Z"}]