[{"movie_id": 340485, "review_id": "587a9c36c3a36847e8007c84", "author_rating": 7.0, "review_text": "**To redefine the life and to discover the love.**\r\n\r\nFrom the British director of 'Fish Tank' fame, this is another a young struggling girl's story. Being brought up in a low income and abusive family, and because of that trying to redefine the life. Not about heading the wrong way like drugs and other related stuffs. So this is the story of an older teen girl named Star who flees the home to find her new life and love. It all begins when she meets a youngster in a supermarket and since then she followed him everywhere. Actually the film focused to tell a gang of youth who are door to door magazine subscription dealers. They travel all over the country and have all kinds of enjoyment.\r\n\r\nIn order to stay in the group, Star has to prove her worth. She reserves her spot, but working on her own way. I always feared the narration might go to take a nasty twist. There came a couple scenes near to that, but compromised not to change the mood of the storytelling. Because it seems the writer was interested to reveal a girl try to achieve two goals. After coming to know one of it was staged, how she contemplates the other one crafted carefully. Not to forget, her fate, the future depends on it, since she's not well qualified to go out in the world to do whatever she wants.\r\n\r\nSo I think it was a decent film with a decent message. If you know the director, you would know what her films talk about. Unlike 'Fish Tank', this is about an American girl. The influence of lifestyle, culture, almost everything related to youngsters covered. The lead actress was good. It was not Shia Labeouf's film, but in a supporting role, he did his best. There are a few others I knew, but they did not get big part. The only issue with it was the length. If you are okay with it, especially for a slow drama, then the film is enjoyable. 'American Honey' is like 'American Money', one of the ways people try to make their 'American Dream' come to true. This film is exclusively for drama genre fans.\r\n\r\n_7/10_", "created_at": "2017-01-14T21:46:30.717Z"}, {"movie_id": 340485, "review_id": "59206ef2c3a36879120429ce", "author_rating": 3.0, "review_text": "Pointless and terrible film that leads to nowhere.\r\n\r\nThe Director of Fish Tank, was not able to capture lighting in a bottle twice.\r\n\r\nMost of the movie is spent in a van listening to rap music, the other large part is the boring romance story with a protagonist who seemed better to be a prostitute, then a door to door salesperson.\r\n\r\nOther characters are introduced but no depth is added to these characters, even though we spend a lot of time in a van with them.\r\n\r\nThe movie doesnt even pay off with the Conclusion it seemingly leads too, it just ends.", "created_at": "2017-05-20T16:29:38.020Z"}]