[{"movie_id": 87827, "review_id": "539eff1f0e0a2667f9000106", "author_rating": 9.0, "review_text": "Visually, this movie traps yourself from the beginning to the end.\r\n\r\nThe story is really deep and moving and the performances are plainly good.\r\n\r\nA must to be seen.", "created_at": "2014-06-16T14:28:47.654Z"}, {"movie_id": 87827, "review_id": "59e7196fc3a36851990090bc", "author_rating": 9.0, "review_text": "Perfectly written, amazingly filmed, and surprisingly ended. Definitely, going in my amnisa list.", "created_at": "2017-10-18T09:05:51.600Z"}, {"movie_id": 87827, "review_id": "5b38b88f0e0a267486003170", "author_rating": 4.0, "review_text": "My rating: 4 out of 10 stars\r\n\r\nA young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.\r\n\r\nI did not have huge expectations on this movie since it is not exactly my style of movie but nevertheless I have to say that I was disappointed. The movie is certainly quite beautiful to watch, at least part of it. However it is also a movie with a strong theistic agenda. Even though it is, luckily, not really religious/political extremism it is thick and intruding nonetheless. I was expecting Pi to actually learn something during the course of his adventure but he does not. He starts the movie gullible and foolish looking for meaning in life (religion) and the movie ends pretty much in the same way with him claiming that he had faith and therefore he survived. Yet none of the decisions he made was based on faith but simply pragmatical decisions of survival. If anything the movie proved that faith or religion had nothing to do with it.\r\n\r\nAs I said the movie was, partly, quite beautiful to watch and this is entirely what rendered it the stars that I gave it. For the rest it was a very boring movie. The only mildly entertaining part was the scenes on the boat with Gérard Depardieu playing the very unpleasant cook. As beautiful to watch as they were many of the scenes were quite unrealistic though and had an artificial look to them even when, I believe, it was not intended. We bought the movie because my youngest daughter loves movies about animals but not even she was overly entertained by this movie.", "created_at": "2018-07-01T11:18:39.288Z"}]