[{"movie_id": 123553, "review_id": "5340f8b40e0a2679bf001707", "author_rating": 6.0, "review_text": "I have not read the books. Judging by the reviews from people who have read them that seems to be a good thing as most of them seem to complain that the movie is not a good representation of the books. Then, when looking at the book ratings at Goodreads there seems to be a rather large spread between reviews loving the book and reviews hating it.\r\n\r\nIf I had read the books I would expect them to sit on my young adult shelf in Goodreads. At least the movie is clearly for a teenage audience. Nevertheless it is quite entertaining as far as I am concerned. A bit silly and predictable at times but still entertaining. I would even call it a family movie although there where some scenes that might be a bit scary for the youngest ones in the family.\r\n\r\nThe story is yet another variant of the classical young girl or boy discovers that there are things that go bump in the night and also that she is part of those things. I have to say that I quite like those kind of stories.\r\n\r\nAs I wrote I found the movie quite entertaining but, although I cannot say that I have anything specific to complain, the movie never really lifts itself above the average crowd of entertaining movies. The special effects are ok but nothing more, the acting is average, the story is okay and so on. It was enjoyable 130 minutes and I never felt bored but I never went wow either.\r\n\r\nBy the way, it never became clear to me why this episode was called City of Bones though. Maybe that is one of the things that the movie left out from the books.", "created_at": "2014-04-06T06:48:20.623Z"}, {"movie_id": 123553, "review_id": "561270c492514106150082ea", "author_rating": 5.0, "review_text": "Bad and disjointed movie created at the warmth of Harry Potter and Hunger Games series. Only, this time doesn't work at all. Lot's of FX for an incoherent and boring story.\r\n\r\nWorst of all, no reason to call this episode \"City of Bones\" since it doesn't play a major role, at all. At least, not in the movie.", "created_at": "2015-10-05T12:44:52.509Z"}]