[{"movie_id": 274854, "review_id": "562c283fc3a3681b610063af", "author_rating": null, "review_text": "There was a time when the movie gods were treating audiences to the omnipresence of zombies. One could not swing a dead cat without running into zombie-related cinema. It was all the rage at the box office that was experiencing a certain celluloid renaissance with overloading narratives within the “zombie zone”. Sure, zombies are still the norm in pop cultural media on both the big and small screen (anybody not heard of “The Walking Dead”?). However, another iconic horror-induced symbol–the witch–is making its way back into prominence in the cinema circles. Unfortunately, the “twitch of the witch” is explored in an over-the-top, messy and misplaced CGI-coated production of the outlandish The Last Witch Hunter.\r\n\r\nSo there are a number of reasons why the whimsical wasteland The Last Witch Hunter might be considered high-tech jumbled junk. Nevertheless, the consensus is that sometimes high-tech jumbled junk is one enthusiast’s treasured and enjoyable guilty pleasure worth its mindlessness in gold. Well, The Last Witch Hunter certainly will attract its share of followers as a gaudy and grainy fantasy adventure both big in scope and surreal absurdity. Still, this mythical monstrosity feels annoyingly strained and tries too hard to sell its outrageous, synthetic spryness.\r\n\r\nThe Last Witch Hunter is about larger-than-life throwaway silly thrills and cherishes its berserk-style entertainment with unapologetic relish. There is nothing inherently wrong with upping the ante in boisterous bounciness but Hunter is unfocused and all over the map while never committing fully to being a distinctive, impish-minded vehicle. Instead, Hunter is incoherent and erratically ridiculous as it shamefully incorporates bits and pieces from other better-made schlocky showcases.\r\n\r\nThe casting of the monotone and muscle-toned Vin Diesel seems inspired and logical for something as clumsily radical as The Last Witch Hunter. Diesel, the movie action star that made his notable mark in money-making film franchises that include The Fast and the Furious and Riddick entries, sinks his teeth into another so-called explosive characterization in Hunter’s 800-year old immortal witch hunter Kaulder. Of course Kaulder is a tortured soul and has made it his mission in hunting down naughty witches throughout his eternal existence. Kaulder needs to eradicate these magical misfits in his bid to deal with the tragic curse that has dominated his tattered psyche.\r\n\r\nKaulder may have an affinity for seeking and wreaking havoc on the notorious witches that threaten to corrupt the surroundings but he is partial to one witch in particular–the youngish Chloe (Rose Leslie from “Game of Thrones”) whose assistance is invaluable to the brooding Kaulder. Also, Kaulder is joined by diminutive cleric sidekick Dolan 37 (Elijah Wood) as well in the quest to hunt down these wily witches.\r\n\r\nThe mysterious vibes pertaining to Kaulder is somewhat realized. For instance, we know that Kaulder works steadily for the organization known as Axe and Cross. Plus, we are introduced to Kaulder’s only close buddy Dolan 36 (Oscar-winning Michael Caine) and are given a vague backstory about Kaulder’s troubled past and histrionics. The no-nonsense Kaulder’s passion for witch hunting is the only straight-forward sign that we definitely have no doubt about one way or the other.\r\n\r\n\"Witch\" way to go? Who knows but only one witch hunter can answer that in Vin Diesel's Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\n“Witch” way to go? Who knows but only one witch hunter can answer that in Vin Diesel’s Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\nIn addition to highlighting Kaulder and company’s expectations to wipe away the “broomstick broads”, the plot starts to thicken as concerns are brewing involving the resurrection of the menacing creature in the Witch Queen (Julie Englebrecht). Naturally, the Witch Queen presents an immediate danger to the cautious Kaulder because of their nostalgic convoluted conflicts previously. Can the crazy-minded coven that looks to promote the Witch Queen succeed and overcome the slaying methods of Kaulder and his crew of crusaders?\r\n\r\nNotoriously clichéd and cockeyed, The Last Witch Hunter is a corrosive concept meshed together with all the creative comparison of a tangled ball of yarn. Similarly, director Breck Eisner’s toothless witch fantasy adventure Hunter echoes the same kind of forgettable computer-generated gibberish that was evident in this year’s bombastic medieval miscue The Seventh Son featuring the Academy Award-winning Jeff Bridges front and center in another numbing sword-swinging, supernatural sideshow of sorts. The overall film project, plagued with Eisner’s scattershot direction and a tepid script by a trio of screenwriters in Cory Goodman, Burk Sharpless and Matt Sazama (responsible for the disastrous Priest and Dracula Untold), screams of a flavorless stew–many ingredients are mixed in but a natural taste for the concoction never comes into fruition. Relentlessly murky and misguided, The Last Witch Hunter fails to trigger anything remotely intriguing beyond the furious flourishes of shocking, cartoonish imagery.  \r\n\r\nThe premise can be regarded as feeling woefully forced and choppy. The dank cinematography is indistinguishable and the visual special effects are an ambivalent hit-and-miss result depending on what frame of the movie’s indescribable spectacle that grabs your undivided attention at the moment. The storyline is hardly gripping or contemplative even from a campy standpoint. The Last Witch Hunter is frivolously flaccid and never manages to capture any of its dizzy-oriented imagination no matter how wildly off-kilter it tries to achieve in its aimless execution.\r\n\r\nDiesel fans may buy his high-wire act in Hunter and go with the flow but the actor does not deviate away from the familiar characters he has revisited countless times over in his better known on-screen outings. For years Diesel has reveled in preposterous volt-making vehicles for the most part has captured the curiosity of his targeted demographics in both excitable fanboys and hormonal female followers alike. The question remains: can they show some solid consideration in having the balding bad boy of action-packed capers toil among the foolish inclusion of wayward witches and sorcerers in an exposition that looks as if it was conceived with a Middle Ages crayon? The supporting players in Hunter are as arbitrarily acknowledged as the saturated and over-indulgent whims of this far-fetched fable that seems uniquely colorless despite its chaotic grand package of black magic banality.\r\n\r\nSomehow labeling Diesel’s Kaulder as the “last witch hunter” feels deceptive because if the Hollywood sequel machine has its way their version of “last” will undoubtedly be continuous into the next eye-rolling chapter. The real sinful hex at large that some unsuspecting moviegoers will ultimately suffer is succumbing to the laughable supernatural spell that The Last Witch Hunter will cast in insufferable, confusing fashion.\r\n\r\nThe Last Witch Hunter (2015)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 46 mins.\r\n\r\nStarring: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht, Olarfur Darri Olafsson, Rena Owen\r\n\r\nDirected by: Breck Eisner\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Fantasy/Supernatural\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-10-25T00:54:23.557Z"}, {"movie_id": 274854, "review_id": "57c8b10cc3a3685c00000a63", "author_rating": 5.0, "review_text": "> Fighting the same witch twice in the 800 years!\r\n\r\nI have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r\n\r\nIt was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r\n\r\nYes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r\n\r\nDiesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r\n\r\n5/10", "created_at": "2016-09-01T22:51:56.019Z"}, {"movie_id": 274854, "review_id": "57c9ac0e925141538c001d86", "author_rating": 6.0, "review_text": "**The initial tableaux:** \r\n\r\n**Initial, part I**: We're in the black plague era in Europe, say 13th century.  The spread of the plague is attributed to the spellcasting of evil witches.  Vin Diesel's character, Kaulder, is one of the witch hunters who finds the Witch Queen.  Kaulder and company put an end to the plague, but at the cost of Kaulder's wife, his only child, and most of his hunter friends.  While dying, the Witch Queen curses Kaulder.\r\n\r\n**Initial, part II**:  In current New York City, Kaulder is still hunting witches.  Yes, the same Kaulder. He's allied with an old group within the church, the Axe and Cross, which tries and imprisons witches.  They also keep secrets.  Kaulder's main contact with Axe and Cross is Dolan the 36th, played by Michael Caine, in one of those short roles that he does so well.  Dolan is quite old, and Dolan the 37th seems ready to take over being contact with the immortal Kaulder.\r\n\r\n**Delineation of conflicts:**\r\nIn the present, witch activity seems to be picking up.  Something large is brewing.  Kaulder suffers a number of reverses, and his list of allies shrinks.\r\n\r\nThe film began in apocalyptic mode, and near the end it is almost there again.  Kaulder must face what he did not face the first time, 800 years ago.\r\n\r\n**Resolution:** Will Kaulder find new allies, or must he carry the day himself?\r\n\r\n**One line summary:** Attempt at another Vin Diesel movie franchise.\r\n\r\n**_Statistics:_** \r\n\r\n**Cinematography:** 8/10 Well done on the whole; the visuals kept my attention.\r\n\r\n**Sound:** 8/10 Dialog is clear.  Music seemed appropriate.\r\n\r\n**Acting:** 5/10 Michael Caine was fine in his short role as noted above.  Vin Diesel is convincing as an action hero, even here with swords, magic, fists, and intention instead of cars, guns, and explosives. Julie Engelbrecht had her fine moments as Kaulder's arch nemesis, the Witch Queen, at the very beginning, and at the very end. Olafur Darri Olafsson was a blast as Belial, an in-your-face opponent for Kaulder.\r\n\r\nElijah Wood's performance sucked rocks.  Rose Leslie (Game of Thrones, 17 episodes) was almost interesting as Kaulder's on-again, off-again witch ally.  That was a bit weak, since she was supposed to be the female lead.\r\n\r\n**Screenplay:** 5/10 Violence and threat moves the plot along, so the 106 minutes runtime does not drag too badly. I'm glad I saw the film, but would not watch it again.  Why not?  The narrative is not well-constructed.  It seemed like every five minutes there was some change or rules, or some impressive (?) artifact to consider.\r\n\r\nAt the end of the film, I felt that I should have been happier for the protagonist, but just could not be. Would there be major challenges for him in the centuries to come?  Would Chloe be a reliable ally? By this time I did not care, and I felt this to be a major failing of the film.\r\n\r\n**_Final Rating:_** 6/10 I liked it better than most people did, but I would be hard pressed to say, 'you must see this one.'", "created_at": "2016-09-02T16:42:54.178Z"}, {"movie_id": 274854, "review_id": "5bb59abc9251410dc1006ec8", "author_rating": 5.0, "review_text": "Arguably the coolest poster a movie's ever had.\r\n\r\nVin & Co. lay the cheese on **thick** in this one. I'm talking slab of fried haloumi thick. But that's not exactly the end of the world. It's kind of like if _Constantine_ was way worse, or if _Seventh Son_ was way better. With a little 2004's _Van Helsing_ thrown in for good measure.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T04:44:44.806Z"}, {"movie_id": 274854, "review_id": "5ca06b59c3a368734a83276b", "author_rating": 5.0, "review_text": "You cling to your pathetic life, those closest to you betray you and those you claim to protect don't even know your name.\r\n\r\nHmm, okies. It feels like the studio execs sat around the big table and thought here's Vin Diesel lets build a boisterous popcorn franchise setting piece around him. \r\n\r\nPlot has Diesel as the title character who here in the modern world is all that stands between humanity and the combined forces of the deadliest witches in history. Cue lots of crash bang and wallop, digital blitzkrieg and Vin with a glint in his eye in spite of not having the emotional paths required for the role. In support are Elijah Wood, Michael Caine and Rose Leslie, all of whom arguably come under the miscast banner.\r\n\r\nThere's some smart ideas at the film's core, the nightmares and dreamscapes narrative smarts particularly hint at what might have been a potent asset to the pic. There's some nifty set-pieces on show as well, which just about stops this from being a boring picture - but it comes mightily close, and in HD form it looks and sounds terrific. Yet it's never a fully realised whole for dramatic impact, with the casting decisions only compounding this feeling.\r\n\r\nIn nutshell terms The Last Witch Hunter is a passable time waster that entertains if one is in an undemanding mood. 5/10", "created_at": "2019-03-31T07:25:13.647Z"}, {"movie_id": 274854, "review_id": "5ccb2c720e0a262fc9ff9faa", "author_rating": 4.0, "review_text": "***Pedestrian horror sorta-superhero starring Vin Diesel***\r\n\r\nAn 800 year-old immortal Witch Hunter (Vin Diesel) now lives in swank New York City, still hunting malevolent witches with the help of two priests, an aged one (Michael Caine) and a novice (Elijah Wood). Rose Leslie plays a winsome witch with mettle while Ólafur Darri Ólafsson is on hand as a formidable evil warlock.\r\n\r\nI thought I’d like \"The Last Witch Hunter\" (2015) since it mixes “End of Days” (1999) with “Van Helsing” (2004) and elements of “Ghost Rider” (2007) and “The Mummy” (1999) but, while Vin Diesel towers in the lead role, the story is meh. The overblown intro with its CGI-laden witch grotto sequence wasn’t a good first impression. By the halfway mark I wanted to turn it off, but I persevered.\r\n\r\nEverything is here for a quality movie of this sort, but the story isn’t captivating and doesn’t build any drive. It just goes through the motions. The script needed a serious rewrite. But Vin Diesel is charismatic as the witch-hunting ‘James Bond’ and redhead Leslie has some appeal.\r\n\r\nThe film runs 1 hour, 46 minutes and was shot in Pittsburgh and Southern Cal.\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2019-05-02T17:44:18.792Z"}, {"movie_id": 274854, "review_id": "562c283fc3a3681b610063af", "author_rating": null, "review_text": "There was a time when the movie gods were treating audiences to the omnipresence of zombies. One could not swing a dead cat without running into zombie-related cinema. It was all the rage at the box office that was experiencing a certain celluloid renaissance with overloading narratives within the “zombie zone”. Sure, zombies are still the norm in pop cultural media on both the big and small screen (anybody not heard of “The Walking Dead”?). However, another iconic horror-induced symbol–the witch–is making its way back into prominence in the cinema circles. Unfortunately, the “twitch of the witch” is explored in an over-the-top, messy and misplaced CGI-coated production of the outlandish The Last Witch Hunter.\r\n\r\nSo there are a number of reasons why the whimsical wasteland The Last Witch Hunter might be considered high-tech jumbled junk. Nevertheless, the consensus is that sometimes high-tech jumbled junk is one enthusiast’s treasured and enjoyable guilty pleasure worth its mindlessness in gold. Well, The Last Witch Hunter certainly will attract its share of followers as a gaudy and grainy fantasy adventure both big in scope and surreal absurdity. Still, this mythical monstrosity feels annoyingly strained and tries too hard to sell its outrageous, synthetic spryness.\r\n\r\nThe Last Witch Hunter is about larger-than-life throwaway silly thrills and cherishes its berserk-style entertainment with unapologetic relish. There is nothing inherently wrong with upping the ante in boisterous bounciness but Hunter is unfocused and all over the map while never committing fully to being a distinctive, impish-minded vehicle. Instead, Hunter is incoherent and erratically ridiculous as it shamefully incorporates bits and pieces from other better-made schlocky showcases.\r\n\r\nThe casting of the monotone and muscle-toned Vin Diesel seems inspired and logical for something as clumsily radical as The Last Witch Hunter. Diesel, the movie action star that made his notable mark in money-making film franchises that include The Fast and the Furious and Riddick entries, sinks his teeth into another so-called explosive characterization in Hunter’s 800-year old immortal witch hunter Kaulder. Of course Kaulder is a tortured soul and has made it his mission in hunting down naughty witches throughout his eternal existence. Kaulder needs to eradicate these magical misfits in his bid to deal with the tragic curse that has dominated his tattered psyche.\r\n\r\nKaulder may have an affinity for seeking and wreaking havoc on the notorious witches that threaten to corrupt the surroundings but he is partial to one witch in particular–the youngish Chloe (Rose Leslie from “Game of Thrones”) whose assistance is invaluable to the brooding Kaulder. Also, Kaulder is joined by diminutive cleric sidekick Dolan 37 (Elijah Wood) as well in the quest to hunt down these wily witches.\r\n\r\nThe mysterious vibes pertaining to Kaulder is somewhat realized. For instance, we know that Kaulder works steadily for the organization known as Axe and Cross. Plus, we are introduced to Kaulder’s only close buddy Dolan 36 (Oscar-winning Michael Caine) and are given a vague backstory about Kaulder’s troubled past and histrionics. The no-nonsense Kaulder’s passion for witch hunting is the only straight-forward sign that we definitely have no doubt about one way or the other.\r\n\r\n\"Witch\" way to go? Who knows but only one witch hunter can answer that in Vin Diesel's Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\n“Witch” way to go? Who knows but only one witch hunter can answer that in Vin Diesel’s Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\nIn addition to highlighting Kaulder and company’s expectations to wipe away the “broomstick broads”, the plot starts to thicken as concerns are brewing involving the resurrection of the menacing creature in the Witch Queen (Julie Englebrecht). Naturally, the Witch Queen presents an immediate danger to the cautious Kaulder because of their nostalgic convoluted conflicts previously. Can the crazy-minded coven that looks to promote the Witch Queen succeed and overcome the slaying methods of Kaulder and his crew of crusaders?\r\n\r\nNotoriously clichéd and cockeyed, The Last Witch Hunter is a corrosive concept meshed together with all the creative comparison of a tangled ball of yarn. Similarly, director Breck Eisner’s toothless witch fantasy adventure Hunter echoes the same kind of forgettable computer-generated gibberish that was evident in this year’s bombastic medieval miscue The Seventh Son featuring the Academy Award-winning Jeff Bridges front and center in another numbing sword-swinging, supernatural sideshow of sorts. The overall film project, plagued with Eisner’s scattershot direction and a tepid script by a trio of screenwriters in Cory Goodman, Burk Sharpless and Matt Sazama (responsible for the disastrous Priest and Dracula Untold), screams of a flavorless stew–many ingredients are mixed in but a natural taste for the concoction never comes into fruition. Relentlessly murky and misguided, The Last Witch Hunter fails to trigger anything remotely intriguing beyond the furious flourishes of shocking, cartoonish imagery.  \r\n\r\nThe premise can be regarded as feeling woefully forced and choppy. The dank cinematography is indistinguishable and the visual special effects are an ambivalent hit-and-miss result depending on what frame of the movie’s indescribable spectacle that grabs your undivided attention at the moment. The storyline is hardly gripping or contemplative even from a campy standpoint. The Last Witch Hunter is frivolously flaccid and never manages to capture any of its dizzy-oriented imagination no matter how wildly off-kilter it tries to achieve in its aimless execution.\r\n\r\nDiesel fans may buy his high-wire act in Hunter and go with the flow but the actor does not deviate away from the familiar characters he has revisited countless times over in his better known on-screen outings. For years Diesel has reveled in preposterous volt-making vehicles for the most part has captured the curiosity of his targeted demographics in both excitable fanboys and hormonal female followers alike. The question remains: can they show some solid consideration in having the balding bad boy of action-packed capers toil among the foolish inclusion of wayward witches and sorcerers in an exposition that looks as if it was conceived with a Middle Ages crayon? The supporting players in Hunter are as arbitrarily acknowledged as the saturated and over-indulgent whims of this far-fetched fable that seems uniquely colorless despite its chaotic grand package of black magic banality.\r\n\r\nSomehow labeling Diesel’s Kaulder as the “last witch hunter” feels deceptive because if the Hollywood sequel machine has its way their version of “last” will undoubtedly be continuous into the next eye-rolling chapter. The real sinful hex at large that some unsuspecting moviegoers will ultimately suffer is succumbing to the laughable supernatural spell that The Last Witch Hunter will cast in insufferable, confusing fashion.\r\n\r\nThe Last Witch Hunter (2015)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 46 mins.\r\n\r\nStarring: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht, Olarfur Darri Olafsson, Rena Owen\r\n\r\nDirected by: Breck Eisner\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Fantasy/Supernatural\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-10-25T00:54:23.557Z"}, {"movie_id": 274854, "review_id": "57c8b10cc3a3685c00000a63", "author_rating": 5.0, "review_text": "> Fighting the same witch twice in the 800 years!\r\n\r\nI have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r\n\r\nIt was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r\n\r\nYes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r\n\r\nDiesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r\n\r\n5/10", "created_at": "2016-09-01T22:51:56.019Z"}, {"movie_id": 274854, "review_id": "57c9ac0e925141538c001d86", "author_rating": 6.0, "review_text": "**The initial tableaux:** \r\n\r\n**Initial, part I**: We're in the black plague era in Europe, say 13th century.  The spread of the plague is attributed to the spellcasting of evil witches.  Vin Diesel's character, Kaulder, is one of the witch hunters who finds the Witch Queen.  Kaulder and company put an end to the plague, but at the cost of Kaulder's wife, his only child, and most of his hunter friends.  While dying, the Witch Queen curses Kaulder.\r\n\r\n**Initial, part II**:  In current New York City, Kaulder is still hunting witches.  Yes, the same Kaulder. He's allied with an old group within the church, the Axe and Cross, which tries and imprisons witches.  They also keep secrets.  Kaulder's main contact with Axe and Cross is Dolan the 36th, played by Michael Caine, in one of those short roles that he does so well.  Dolan is quite old, and Dolan the 37th seems ready to take over being contact with the immortal Kaulder.\r\n\r\n**Delineation of conflicts:**\r\nIn the present, witch activity seems to be picking up.  Something large is brewing.  Kaulder suffers a number of reverses, and his list of allies shrinks.\r\n\r\nThe film began in apocalyptic mode, and near the end it is almost there again.  Kaulder must face what he did not face the first time, 800 years ago.\r\n\r\n**Resolution:** Will Kaulder find new allies, or must he carry the day himself?\r\n\r\n**One line summary:** Attempt at another Vin Diesel movie franchise.\r\n\r\n**_Statistics:_** \r\n\r\n**Cinematography:** 8/10 Well done on the whole; the visuals kept my attention.\r\n\r\n**Sound:** 8/10 Dialog is clear.  Music seemed appropriate.\r\n\r\n**Acting:** 5/10 Michael Caine was fine in his short role as noted above.  Vin Diesel is convincing as an action hero, even here with swords, magic, fists, and intention instead of cars, guns, and explosives. Julie Engelbrecht had her fine moments as Kaulder's arch nemesis, the Witch Queen, at the very beginning, and at the very end. Olafur Darri Olafsson was a blast as Belial, an in-your-face opponent for Kaulder.\r\n\r\nElijah Wood's performance sucked rocks.  Rose Leslie (Game of Thrones, 17 episodes) was almost interesting as Kaulder's on-again, off-again witch ally.  That was a bit weak, since she was supposed to be the female lead.\r\n\r\n**Screenplay:** 5/10 Violence and threat moves the plot along, so the 106 minutes runtime does not drag too badly. I'm glad I saw the film, but would not watch it again.  Why not?  The narrative is not well-constructed.  It seemed like every five minutes there was some change or rules, or some impressive (?) artifact to consider.\r\n\r\nAt the end of the film, I felt that I should have been happier for the protagonist, but just could not be. Would there be major challenges for him in the centuries to come?  Would Chloe be a reliable ally? By this time I did not care, and I felt this to be a major failing of the film.\r\n\r\n**_Final Rating:_** 6/10 I liked it better than most people did, but I would be hard pressed to say, 'you must see this one.'", "created_at": "2016-09-02T16:42:54.178Z"}, {"movie_id": 274854, "review_id": "5bb59abc9251410dc1006ec8", "author_rating": 5.0, "review_text": "Arguably the coolest poster a movie's ever had.\r\n\r\nVin & Co. lay the cheese on **thick** in this one. I'm talking slab of fried haloumi thick. But that's not exactly the end of the world. It's kind of like if _Constantine_ was way worse, or if _Seventh Son_ was way better. With a little 2004's _Van Helsing_ thrown in for good measure.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T04:44:44.806Z"}, {"movie_id": 274854, "review_id": "5ca06b59c3a368734a83276b", "author_rating": 5.0, "review_text": "You cling to your pathetic life, those closest to you betray you and those you claim to protect don't even know your name.\r\n\r\nHmm, okies. It feels like the studio execs sat around the big table and thought here's Vin Diesel lets build a boisterous popcorn franchise setting piece around him. \r\n\r\nPlot has Diesel as the title character who here in the modern world is all that stands between humanity and the combined forces of the deadliest witches in history. Cue lots of crash bang and wallop, digital blitzkrieg and Vin with a glint in his eye in spite of not having the emotional paths required for the role. In support are Elijah Wood, Michael Caine and Rose Leslie, all of whom arguably come under the miscast banner.\r\n\r\nThere's some smart ideas at the film's core, the nightmares and dreamscapes narrative smarts particularly hint at what might have been a potent asset to the pic. There's some nifty set-pieces on show as well, which just about stops this from being a boring picture - but it comes mightily close, and in HD form it looks and sounds terrific. Yet it's never a fully realised whole for dramatic impact, with the casting decisions only compounding this feeling.\r\n\r\nIn nutshell terms The Last Witch Hunter is a passable time waster that entertains if one is in an undemanding mood. 5/10", "created_at": "2019-03-31T07:25:13.647Z"}, {"movie_id": 274854, "review_id": "5ccb2c720e0a262fc9ff9faa", "author_rating": 4.0, "review_text": "***Pedestrian horror sorta-superhero starring Vin Diesel***\r\n\r\nAn 800 year-old immortal Witch Hunter (Vin Diesel) now lives in swank New York City, still hunting malevolent witches with the help of two priests, an aged one (Michael Caine) and a novice (Elijah Wood). Rose Leslie plays a winsome witch with mettle while Ólafur Darri Ólafsson is on hand as a formidable evil warlock.\r\n\r\nI thought I’d like \"The Last Witch Hunter\" (2015) since it mixes “End of Days” (1999) with “Van Helsing” (2004) and elements of “Ghost Rider” (2007) and “The Mummy” (1999) but, while Vin Diesel towers in the lead role, the story is meh. The overblown intro with its CGI-laden witch grotto sequence wasn’t a good first impression. By the halfway mark I wanted to turn it off, but I persevered.\r\n\r\nEverything is here for a quality movie of this sort, but the story isn’t captivating and doesn’t build any drive. It just goes through the motions. The script needed a serious rewrite. But Vin Diesel is charismatic as the witch-hunting ‘James Bond’ and redhead Leslie has some appeal.\r\n\r\nThe film runs 1 hour, 46 minutes and was shot in Pittsburgh and Southern Cal.\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2019-05-02T17:44:18.792Z"}, {"movie_id": 274854, "review_id": "562c283fc3a3681b610063af", "author_rating": null, "review_text": "There was a time when the movie gods were treating audiences to the omnipresence of zombies. One could not swing a dead cat without running into zombie-related cinema. It was all the rage at the box office that was experiencing a certain celluloid renaissance with overloading narratives within the “zombie zone”. Sure, zombies are still the norm in pop cultural media on both the big and small screen (anybody not heard of “The Walking Dead”?). However, another iconic horror-induced symbol–the witch–is making its way back into prominence in the cinema circles. Unfortunately, the “twitch of the witch” is explored in an over-the-top, messy and misplaced CGI-coated production of the outlandish The Last Witch Hunter.\r\n\r\nSo there are a number of reasons why the whimsical wasteland The Last Witch Hunter might be considered high-tech jumbled junk. Nevertheless, the consensus is that sometimes high-tech jumbled junk is one enthusiast’s treasured and enjoyable guilty pleasure worth its mindlessness in gold. Well, The Last Witch Hunter certainly will attract its share of followers as a gaudy and grainy fantasy adventure both big in scope and surreal absurdity. Still, this mythical monstrosity feels annoyingly strained and tries too hard to sell its outrageous, synthetic spryness.\r\n\r\nThe Last Witch Hunter is about larger-than-life throwaway silly thrills and cherishes its berserk-style entertainment with unapologetic relish. There is nothing inherently wrong with upping the ante in boisterous bounciness but Hunter is unfocused and all over the map while never committing fully to being a distinctive, impish-minded vehicle. Instead, Hunter is incoherent and erratically ridiculous as it shamefully incorporates bits and pieces from other better-made schlocky showcases.\r\n\r\nThe casting of the monotone and muscle-toned Vin Diesel seems inspired and logical for something as clumsily radical as The Last Witch Hunter. Diesel, the movie action star that made his notable mark in money-making film franchises that include The Fast and the Furious and Riddick entries, sinks his teeth into another so-called explosive characterization in Hunter’s 800-year old immortal witch hunter Kaulder. Of course Kaulder is a tortured soul and has made it his mission in hunting down naughty witches throughout his eternal existence. Kaulder needs to eradicate these magical misfits in his bid to deal with the tragic curse that has dominated his tattered psyche.\r\n\r\nKaulder may have an affinity for seeking and wreaking havoc on the notorious witches that threaten to corrupt the surroundings but he is partial to one witch in particular–the youngish Chloe (Rose Leslie from “Game of Thrones”) whose assistance is invaluable to the brooding Kaulder. Also, Kaulder is joined by diminutive cleric sidekick Dolan 37 (Elijah Wood) as well in the quest to hunt down these wily witches.\r\n\r\nThe mysterious vibes pertaining to Kaulder is somewhat realized. For instance, we know that Kaulder works steadily for the organization known as Axe and Cross. Plus, we are introduced to Kaulder’s only close buddy Dolan 36 (Oscar-winning Michael Caine) and are given a vague backstory about Kaulder’s troubled past and histrionics. The no-nonsense Kaulder’s passion for witch hunting is the only straight-forward sign that we definitely have no doubt about one way or the other.\r\n\r\n\"Witch\" way to go? Who knows but only one witch hunter can answer that in Vin Diesel's Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\n“Witch” way to go? Who knows but only one witch hunter can answer that in Vin Diesel’s Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\nIn addition to highlighting Kaulder and company’s expectations to wipe away the “broomstick broads”, the plot starts to thicken as concerns are brewing involving the resurrection of the menacing creature in the Witch Queen (Julie Englebrecht). Naturally, the Witch Queen presents an immediate danger to the cautious Kaulder because of their nostalgic convoluted conflicts previously. Can the crazy-minded coven that looks to promote the Witch Queen succeed and overcome the slaying methods of Kaulder and his crew of crusaders?\r\n\r\nNotoriously clichéd and cockeyed, The Last Witch Hunter is a corrosive concept meshed together with all the creative comparison of a tangled ball of yarn. Similarly, director Breck Eisner’s toothless witch fantasy adventure Hunter echoes the same kind of forgettable computer-generated gibberish that was evident in this year’s bombastic medieval miscue The Seventh Son featuring the Academy Award-winning Jeff Bridges front and center in another numbing sword-swinging, supernatural sideshow of sorts. The overall film project, plagued with Eisner’s scattershot direction and a tepid script by a trio of screenwriters in Cory Goodman, Burk Sharpless and Matt Sazama (responsible for the disastrous Priest and Dracula Untold), screams of a flavorless stew–many ingredients are mixed in but a natural taste for the concoction never comes into fruition. Relentlessly murky and misguided, The Last Witch Hunter fails to trigger anything remotely intriguing beyond the furious flourishes of shocking, cartoonish imagery.  \r\n\r\nThe premise can be regarded as feeling woefully forced and choppy. The dank cinematography is indistinguishable and the visual special effects are an ambivalent hit-and-miss result depending on what frame of the movie’s indescribable spectacle that grabs your undivided attention at the moment. The storyline is hardly gripping or contemplative even from a campy standpoint. The Last Witch Hunter is frivolously flaccid and never manages to capture any of its dizzy-oriented imagination no matter how wildly off-kilter it tries to achieve in its aimless execution.\r\n\r\nDiesel fans may buy his high-wire act in Hunter and go with the flow but the actor does not deviate away from the familiar characters he has revisited countless times over in his better known on-screen outings. For years Diesel has reveled in preposterous volt-making vehicles for the most part has captured the curiosity of his targeted demographics in both excitable fanboys and hormonal female followers alike. The question remains: can they show some solid consideration in having the balding bad boy of action-packed capers toil among the foolish inclusion of wayward witches and sorcerers in an exposition that looks as if it was conceived with a Middle Ages crayon? The supporting players in Hunter are as arbitrarily acknowledged as the saturated and over-indulgent whims of this far-fetched fable that seems uniquely colorless despite its chaotic grand package of black magic banality.\r\n\r\nSomehow labeling Diesel’s Kaulder as the “last witch hunter” feels deceptive because if the Hollywood sequel machine has its way their version of “last” will undoubtedly be continuous into the next eye-rolling chapter. The real sinful hex at large that some unsuspecting moviegoers will ultimately suffer is succumbing to the laughable supernatural spell that The Last Witch Hunter will cast in insufferable, confusing fashion.\r\n\r\nThe Last Witch Hunter (2015)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 46 mins.\r\n\r\nStarring: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht, Olarfur Darri Olafsson, Rena Owen\r\n\r\nDirected by: Breck Eisner\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Fantasy/Supernatural\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-10-25T00:54:23.557Z"}, {"movie_id": 274854, "review_id": "57c8b10cc3a3685c00000a63", "author_rating": 5.0, "review_text": "> Fighting the same witch twice in the 800 years!\r\n\r\nI have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r\n\r\nIt was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r\n\r\nYes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r\n\r\nDiesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r\n\r\n5/10", "created_at": "2016-09-01T22:51:56.019Z"}, {"movie_id": 274854, "review_id": "57c9ac0e925141538c001d86", "author_rating": 6.0, "review_text": "**The initial tableaux:** \r\n\r\n**Initial, part I**: We're in the black plague era in Europe, say 13th century.  The spread of the plague is attributed to the spellcasting of evil witches.  Vin Diesel's character, Kaulder, is one of the witch hunters who finds the Witch Queen.  Kaulder and company put an end to the plague, but at the cost of Kaulder's wife, his only child, and most of his hunter friends.  While dying, the Witch Queen curses Kaulder.\r\n\r\n**Initial, part II**:  In current New York City, Kaulder is still hunting witches.  Yes, the same Kaulder. He's allied with an old group within the church, the Axe and Cross, which tries and imprisons witches.  They also keep secrets.  Kaulder's main contact with Axe and Cross is Dolan the 36th, played by Michael Caine, in one of those short roles that he does so well.  Dolan is quite old, and Dolan the 37th seems ready to take over being contact with the immortal Kaulder.\r\n\r\n**Delineation of conflicts:**\r\nIn the present, witch activity seems to be picking up.  Something large is brewing.  Kaulder suffers a number of reverses, and his list of allies shrinks.\r\n\r\nThe film began in apocalyptic mode, and near the end it is almost there again.  Kaulder must face what he did not face the first time, 800 years ago.\r\n\r\n**Resolution:** Will Kaulder find new allies, or must he carry the day himself?\r\n\r\n**One line summary:** Attempt at another Vin Diesel movie franchise.\r\n\r\n**_Statistics:_** \r\n\r\n**Cinematography:** 8/10 Well done on the whole; the visuals kept my attention.\r\n\r\n**Sound:** 8/10 Dialog is clear.  Music seemed appropriate.\r\n\r\n**Acting:** 5/10 Michael Caine was fine in his short role as noted above.  Vin Diesel is convincing as an action hero, even here with swords, magic, fists, and intention instead of cars, guns, and explosives. Julie Engelbrecht had her fine moments as Kaulder's arch nemesis, the Witch Queen, at the very beginning, and at the very end. Olafur Darri Olafsson was a blast as Belial, an in-your-face opponent for Kaulder.\r\n\r\nElijah Wood's performance sucked rocks.  Rose Leslie (Game of Thrones, 17 episodes) was almost interesting as Kaulder's on-again, off-again witch ally.  That was a bit weak, since she was supposed to be the female lead.\r\n\r\n**Screenplay:** 5/10 Violence and threat moves the plot along, so the 106 minutes runtime does not drag too badly. I'm glad I saw the film, but would not watch it again.  Why not?  The narrative is not well-constructed.  It seemed like every five minutes there was some change or rules, or some impressive (?) artifact to consider.\r\n\r\nAt the end of the film, I felt that I should have been happier for the protagonist, but just could not be. Would there be major challenges for him in the centuries to come?  Would Chloe be a reliable ally? By this time I did not care, and I felt this to be a major failing of the film.\r\n\r\n**_Final Rating:_** 6/10 I liked it better than most people did, but I would be hard pressed to say, 'you must see this one.'", "created_at": "2016-09-02T16:42:54.178Z"}, {"movie_id": 274854, "review_id": "5bb59abc9251410dc1006ec8", "author_rating": 5.0, "review_text": "Arguably the coolest poster a movie's ever had.\r\n\r\nVin & Co. lay the cheese on **thick** in this one. I'm talking slab of fried haloumi thick. But that's not exactly the end of the world. It's kind of like if _Constantine_ was way worse, or if _Seventh Son_ was way better. With a little 2004's _Van Helsing_ thrown in for good measure.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T04:44:44.806Z"}, {"movie_id": 274854, "review_id": "5ca06b59c3a368734a83276b", "author_rating": 5.0, "review_text": "You cling to your pathetic life, those closest to you betray you and those you claim to protect don't even know your name.\r\n\r\nHmm, okies. It feels like the studio execs sat around the big table and thought here's Vin Diesel lets build a boisterous popcorn franchise setting piece around him. \r\n\r\nPlot has Diesel as the title character who here in the modern world is all that stands between humanity and the combined forces of the deadliest witches in history. Cue lots of crash bang and wallop, digital blitzkrieg and Vin with a glint in his eye in spite of not having the emotional paths required for the role. In support are Elijah Wood, Michael Caine and Rose Leslie, all of whom arguably come under the miscast banner.\r\n\r\nThere's some smart ideas at the film's core, the nightmares and dreamscapes narrative smarts particularly hint at what might have been a potent asset to the pic. There's some nifty set-pieces on show as well, which just about stops this from being a boring picture - but it comes mightily close, and in HD form it looks and sounds terrific. Yet it's never a fully realised whole for dramatic impact, with the casting decisions only compounding this feeling.\r\n\r\nIn nutshell terms The Last Witch Hunter is a passable time waster that entertains if one is in an undemanding mood. 5/10", "created_at": "2019-03-31T07:25:13.647Z"}, {"movie_id": 274854, "review_id": "5ccb2c720e0a262fc9ff9faa", "author_rating": 4.0, "review_text": "***Pedestrian horror sorta-superhero starring Vin Diesel***\r\n\r\nAn 800 year-old immortal Witch Hunter (Vin Diesel) now lives in swank New York City, still hunting malevolent witches with the help of two priests, an aged one (Michael Caine) and a novice (Elijah Wood). Rose Leslie plays a winsome witch with mettle while Ólafur Darri Ólafsson is on hand as a formidable evil warlock.\r\n\r\nI thought I’d like \"The Last Witch Hunter\" (2015) since it mixes “End of Days” (1999) with “Van Helsing” (2004) and elements of “Ghost Rider” (2007) and “The Mummy” (1999) but, while Vin Diesel towers in the lead role, the story is meh. The overblown intro with its CGI-laden witch grotto sequence wasn’t a good first impression. By the halfway mark I wanted to turn it off, but I persevered.\r\n\r\nEverything is here for a quality movie of this sort, but the story isn’t captivating and doesn’t build any drive. It just goes through the motions. The script needed a serious rewrite. But Vin Diesel is charismatic as the witch-hunting ‘James Bond’ and redhead Leslie has some appeal.\r\n\r\nThe film runs 1 hour, 46 minutes and was shot in Pittsburgh and Southern Cal.\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2019-05-02T17:44:18.792Z"}, {"movie_id": 274854, "review_id": "562c283fc3a3681b610063af", "author_rating": null, "review_text": "There was a time when the movie gods were treating audiences to the omnipresence of zombies. One could not swing a dead cat without running into zombie-related cinema. It was all the rage at the box office that was experiencing a certain celluloid renaissance with overloading narratives within the “zombie zone”. Sure, zombies are still the norm in pop cultural media on both the big and small screen (anybody not heard of “The Walking Dead”?). However, another iconic horror-induced symbol–the witch–is making its way back into prominence in the cinema circles. Unfortunately, the “twitch of the witch” is explored in an over-the-top, messy and misplaced CGI-coated production of the outlandish The Last Witch Hunter.\r\n\r\nSo there are a number of reasons why the whimsical wasteland The Last Witch Hunter might be considered high-tech jumbled junk. Nevertheless, the consensus is that sometimes high-tech jumbled junk is one enthusiast’s treasured and enjoyable guilty pleasure worth its mindlessness in gold. Well, The Last Witch Hunter certainly will attract its share of followers as a gaudy and grainy fantasy adventure both big in scope and surreal absurdity. Still, this mythical monstrosity feels annoyingly strained and tries too hard to sell its outrageous, synthetic spryness.\r\n\r\nThe Last Witch Hunter is about larger-than-life throwaway silly thrills and cherishes its berserk-style entertainment with unapologetic relish. There is nothing inherently wrong with upping the ante in boisterous bounciness but Hunter is unfocused and all over the map while never committing fully to being a distinctive, impish-minded vehicle. Instead, Hunter is incoherent and erratically ridiculous as it shamefully incorporates bits and pieces from other better-made schlocky showcases.\r\n\r\nThe casting of the monotone and muscle-toned Vin Diesel seems inspired and logical for something as clumsily radical as The Last Witch Hunter. Diesel, the movie action star that made his notable mark in money-making film franchises that include The Fast and the Furious and Riddick entries, sinks his teeth into another so-called explosive characterization in Hunter’s 800-year old immortal witch hunter Kaulder. Of course Kaulder is a tortured soul and has made it his mission in hunting down naughty witches throughout his eternal existence. Kaulder needs to eradicate these magical misfits in his bid to deal with the tragic curse that has dominated his tattered psyche.\r\n\r\nKaulder may have an affinity for seeking and wreaking havoc on the notorious witches that threaten to corrupt the surroundings but he is partial to one witch in particular–the youngish Chloe (Rose Leslie from “Game of Thrones”) whose assistance is invaluable to the brooding Kaulder. Also, Kaulder is joined by diminutive cleric sidekick Dolan 37 (Elijah Wood) as well in the quest to hunt down these wily witches.\r\n\r\nThe mysterious vibes pertaining to Kaulder is somewhat realized. For instance, we know that Kaulder works steadily for the organization known as Axe and Cross. Plus, we are introduced to Kaulder’s only close buddy Dolan 36 (Oscar-winning Michael Caine) and are given a vague backstory about Kaulder’s troubled past and histrionics. The no-nonsense Kaulder’s passion for witch hunting is the only straight-forward sign that we definitely have no doubt about one way or the other.\r\n\r\n\"Witch\" way to go? Who knows but only one witch hunter can answer that in Vin Diesel's Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\n“Witch” way to go? Who knows but only one witch hunter can answer that in Vin Diesel’s Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\nIn addition to highlighting Kaulder and company’s expectations to wipe away the “broomstick broads”, the plot starts to thicken as concerns are brewing involving the resurrection of the menacing creature in the Witch Queen (Julie Englebrecht). Naturally, the Witch Queen presents an immediate danger to the cautious Kaulder because of their nostalgic convoluted conflicts previously. Can the crazy-minded coven that looks to promote the Witch Queen succeed and overcome the slaying methods of Kaulder and his crew of crusaders?\r\n\r\nNotoriously clichéd and cockeyed, The Last Witch Hunter is a corrosive concept meshed together with all the creative comparison of a tangled ball of yarn. Similarly, director Breck Eisner’s toothless witch fantasy adventure Hunter echoes the same kind of forgettable computer-generated gibberish that was evident in this year’s bombastic medieval miscue The Seventh Son featuring the Academy Award-winning Jeff Bridges front and center in another numbing sword-swinging, supernatural sideshow of sorts. The overall film project, plagued with Eisner’s scattershot direction and a tepid script by a trio of screenwriters in Cory Goodman, Burk Sharpless and Matt Sazama (responsible for the disastrous Priest and Dracula Untold), screams of a flavorless stew–many ingredients are mixed in but a natural taste for the concoction never comes into fruition. Relentlessly murky and misguided, The Last Witch Hunter fails to trigger anything remotely intriguing beyond the furious flourishes of shocking, cartoonish imagery.  \r\n\r\nThe premise can be regarded as feeling woefully forced and choppy. The dank cinematography is indistinguishable and the visual special effects are an ambivalent hit-and-miss result depending on what frame of the movie’s indescribable spectacle that grabs your undivided attention at the moment. The storyline is hardly gripping or contemplative even from a campy standpoint. The Last Witch Hunter is frivolously flaccid and never manages to capture any of its dizzy-oriented imagination no matter how wildly off-kilter it tries to achieve in its aimless execution.\r\n\r\nDiesel fans may buy his high-wire act in Hunter and go with the flow but the actor does not deviate away from the familiar characters he has revisited countless times over in his better known on-screen outings. For years Diesel has reveled in preposterous volt-making vehicles for the most part has captured the curiosity of his targeted demographics in both excitable fanboys and hormonal female followers alike. The question remains: can they show some solid consideration in having the balding bad boy of action-packed capers toil among the foolish inclusion of wayward witches and sorcerers in an exposition that looks as if it was conceived with a Middle Ages crayon? The supporting players in Hunter are as arbitrarily acknowledged as the saturated and over-indulgent whims of this far-fetched fable that seems uniquely colorless despite its chaotic grand package of black magic banality.\r\n\r\nSomehow labeling Diesel’s Kaulder as the “last witch hunter” feels deceptive because if the Hollywood sequel machine has its way their version of “last” will undoubtedly be continuous into the next eye-rolling chapter. The real sinful hex at large that some unsuspecting moviegoers will ultimately suffer is succumbing to the laughable supernatural spell that The Last Witch Hunter will cast in insufferable, confusing fashion.\r\n\r\nThe Last Witch Hunter (2015)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 46 mins.\r\n\r\nStarring: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht, Olarfur Darri Olafsson, Rena Owen\r\n\r\nDirected by: Breck Eisner\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Fantasy/Supernatural\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-10-25T00:54:23.557Z"}, {"movie_id": 274854, "review_id": "57c8b10cc3a3685c00000a63", "author_rating": 5.0, "review_text": "> Fighting the same witch twice in the 800 years!\r\n\r\nI have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r\n\r\nIt was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r\n\r\nYes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r\n\r\nDiesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r\n\r\n5/10", "created_at": "2016-09-01T22:51:56.019Z"}, {"movie_id": 274854, "review_id": "57c9ac0e925141538c001d86", "author_rating": 6.0, "review_text": "**The initial tableaux:** \r\n\r\n**Initial, part I**: We're in the black plague era in Europe, say 13th century.  The spread of the plague is attributed to the spellcasting of evil witches.  Vin Diesel's character, Kaulder, is one of the witch hunters who finds the Witch Queen.  Kaulder and company put an end to the plague, but at the cost of Kaulder's wife, his only child, and most of his hunter friends.  While dying, the Witch Queen curses Kaulder.\r\n\r\n**Initial, part II**:  In current New York City, Kaulder is still hunting witches.  Yes, the same Kaulder. He's allied with an old group within the church, the Axe and Cross, which tries and imprisons witches.  They also keep secrets.  Kaulder's main contact with Axe and Cross is Dolan the 36th, played by Michael Caine, in one of those short roles that he does so well.  Dolan is quite old, and Dolan the 37th seems ready to take over being contact with the immortal Kaulder.\r\n\r\n**Delineation of conflicts:**\r\nIn the present, witch activity seems to be picking up.  Something large is brewing.  Kaulder suffers a number of reverses, and his list of allies shrinks.\r\n\r\nThe film began in apocalyptic mode, and near the end it is almost there again.  Kaulder must face what he did not face the first time, 800 years ago.\r\n\r\n**Resolution:** Will Kaulder find new allies, or must he carry the day himself?\r\n\r\n**One line summary:** Attempt at another Vin Diesel movie franchise.\r\n\r\n**_Statistics:_** \r\n\r\n**Cinematography:** 8/10 Well done on the whole; the visuals kept my attention.\r\n\r\n**Sound:** 8/10 Dialog is clear.  Music seemed appropriate.\r\n\r\n**Acting:** 5/10 Michael Caine was fine in his short role as noted above.  Vin Diesel is convincing as an action hero, even here with swords, magic, fists, and intention instead of cars, guns, and explosives. Julie Engelbrecht had her fine moments as Kaulder's arch nemesis, the Witch Queen, at the very beginning, and at the very end. Olafur Darri Olafsson was a blast as Belial, an in-your-face opponent for Kaulder.\r\n\r\nElijah Wood's performance sucked rocks.  Rose Leslie (Game of Thrones, 17 episodes) was almost interesting as Kaulder's on-again, off-again witch ally.  That was a bit weak, since she was supposed to be the female lead.\r\n\r\n**Screenplay:** 5/10 Violence and threat moves the plot along, so the 106 minutes runtime does not drag too badly. I'm glad I saw the film, but would not watch it again.  Why not?  The narrative is not well-constructed.  It seemed like every five minutes there was some change or rules, or some impressive (?) artifact to consider.\r\n\r\nAt the end of the film, I felt that I should have been happier for the protagonist, but just could not be. Would there be major challenges for him in the centuries to come?  Would Chloe be a reliable ally? By this time I did not care, and I felt this to be a major failing of the film.\r\n\r\n**_Final Rating:_** 6/10 I liked it better than most people did, but I would be hard pressed to say, 'you must see this one.'", "created_at": "2016-09-02T16:42:54.178Z"}, {"movie_id": 274854, "review_id": "5bb59abc9251410dc1006ec8", "author_rating": 5.0, "review_text": "Arguably the coolest poster a movie's ever had.\r\n\r\nVin & Co. lay the cheese on **thick** in this one. I'm talking slab of fried haloumi thick. But that's not exactly the end of the world. It's kind of like if _Constantine_ was way worse, or if _Seventh Son_ was way better. With a little 2004's _Van Helsing_ thrown in for good measure.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T04:44:44.806Z"}, {"movie_id": 274854, "review_id": "5ca06b59c3a368734a83276b", "author_rating": 5.0, "review_text": "You cling to your pathetic life, those closest to you betray you and those you claim to protect don't even know your name.\r\n\r\nHmm, okies. It feels like the studio execs sat around the big table and thought here's Vin Diesel lets build a boisterous popcorn franchise setting piece around him. \r\n\r\nPlot has Diesel as the title character who here in the modern world is all that stands between humanity and the combined forces of the deadliest witches in history. Cue lots of crash bang and wallop, digital blitzkrieg and Vin with a glint in his eye in spite of not having the emotional paths required for the role. In support are Elijah Wood, Michael Caine and Rose Leslie, all of whom arguably come under the miscast banner.\r\n\r\nThere's some smart ideas at the film's core, the nightmares and dreamscapes narrative smarts particularly hint at what might have been a potent asset to the pic. There's some nifty set-pieces on show as well, which just about stops this from being a boring picture - but it comes mightily close, and in HD form it looks and sounds terrific. Yet it's never a fully realised whole for dramatic impact, with the casting decisions only compounding this feeling.\r\n\r\nIn nutshell terms The Last Witch Hunter is a passable time waster that entertains if one is in an undemanding mood. 5/10", "created_at": "2019-03-31T07:25:13.647Z"}, {"movie_id": 274854, "review_id": "5ccb2c720e0a262fc9ff9faa", "author_rating": 4.0, "review_text": "***Pedestrian horror sorta-superhero starring Vin Diesel***\r\n\r\nAn 800 year-old immortal Witch Hunter (Vin Diesel) now lives in swank New York City, still hunting malevolent witches with the help of two priests, an aged one (Michael Caine) and a novice (Elijah Wood). Rose Leslie plays a winsome witch with mettle while Ólafur Darri Ólafsson is on hand as a formidable evil warlock.\r\n\r\nI thought I’d like \"The Last Witch Hunter\" (2015) since it mixes “End of Days” (1999) with “Van Helsing” (2004) and elements of “Ghost Rider” (2007) and “The Mummy” (1999) but, while Vin Diesel towers in the lead role, the story is meh. The overblown intro with its CGI-laden witch grotto sequence wasn’t a good first impression. By the halfway mark I wanted to turn it off, but I persevered.\r\n\r\nEverything is here for a quality movie of this sort, but the story isn’t captivating and doesn’t build any drive. It just goes through the motions. The script needed a serious rewrite. But Vin Diesel is charismatic as the witch-hunting ‘James Bond’ and redhead Leslie has some appeal.\r\n\r\nThe film runs 1 hour, 46 minutes and was shot in Pittsburgh and Southern Cal.\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2019-05-02T17:44:18.792Z"}]