[{"movie_id": 403300, "review_id": "5e23716cbfeb8b0011d21e56", "author_rating": 8.0, "review_text": "An audiovisual beauty like all Malick's films although this is definitely the first one that has a more interesting story to tell since Tree of Life but unfortunately in my opinion its own ambition and pretense of doing something more epic plays against it because A Hidden Life it's a film that greatly extends its stay.\r\n\r\nAlthough Malick doesn't change the formula he has been using both narrative and visually, this story manages to feel different perhaps because unlike films like To The Wonder, Knight of Cups and Song to Song, Malick goes back in time and the visual aura of the film has a more distinctive touch.\r\n\r\nAgain Malick doesn't seems to demand a lot from his actors because once again the romantic situations feel repetitive but as I said being a more relevant story, this time the interactions feel deeper.\r\n\r\nHere the problem as I said is the duration. The film is just a few minutes away from being three hours long and because of the narrative's shape those three hours feels like too much.\r\nI cannot deny that A Hidden Life is a beautiful film, it's a really good film but it's a really long one.\r\n\r\nI mean, I completely enjoy it, I would see it again without a doubt but I could definitely cut an hour from it to make it more agile, although I understand this was Malick's vision and desire for the audiences to experience his film.\r\n\r\nI repeat, I liked it a lot, it's Malick's most rewarding work since Tree of Life and it's a film that any serious movie lover will enjoy or at least it will give it the chance to be marvel by it.", "created_at": "2020-01-18T20:58:20.726Z"}, {"movie_id": 403300, "review_id": "5e2cde4698f1f10012fa67e8", "author_rating": 9.0, "review_text": "Terrence Malick is a filmmaker whose primary concern is the sanctity of the human soul, and in this instance, he has chosen a time and a place where that sanctity was under tremendous threat, and a story of two people sacrificing themselves to protect it. 'A Hidden Life' is a remarkable and uncompromising film, a work of hope and sorrow and belief in the human spirit. Even with the foundation of a true story, Malick still continues to experiment, to follow his instincts and find a thematic journey more important than a narrative one. At nearly three hours, with almost no dialogue, a slow and considered pace and Malick's propensity for aesthetic indulgence, it certainly won't be a film for everyone, but those able to tap into it will find a deep and profound experience. 'A Hidden Life' isn't Terrence Malick returning to form. It's another step in the evolution and exploration of one of the most singular filmmakers the cinema has ever seen.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-a-hidden-life-terrence-malicks-stunning-ode-to-the-power-of-kindness", "created_at": "2020-01-26T00:33:10.183Z"}, {"movie_id": 403300, "review_id": "5e2f2cfdac8e6b0015bcdc60", "author_rating": 7.0, "review_text": "“If God gives us free will, we are responsible for what we do or what we fail to do.”\r\n\r\nAmbitious, but strangely simple.\r\n\r\nA true and powerful story told in a very Malick way. Based on letters written in Austria during Hitler’s early reigns; ‘A Hidden Life’ follows a husband and wife objecting the Nazi party - which unfortunately leads to the husbands imprisonment and his wife being persecuted by villagers, all friends and neighbours for decades - all become enemies.\r\n\r\nThe camera work and cinematography were all excellent, of course with it being a Terrance Malick movie. Free flowing camera movement that often drifts around the actors and looms over these people's lives - often getting up close and personal. There are some powerhouse performances from everyone as Malick effectively lets the actors work freely by improvising on the spot and being present in the moment. So we get to experience Franz and his wife Franziska (along with their children) living in the present and how beautifully poetic it can be. So we can briefly live the life of these people before the horrors of war ruin everything. The little moments we take for granted.\r\n\r\nApparently whenever an actor gets dry on camera, Malick would gently push them forward and tell them to keep going - in terms of activity and discovering new things while losing a train of thought and reverie in character. I think this is the reason why the actors always give such raw and natural performances. I would imagine it also helps them develop and personally attach themselves to the character in bolder lengths, because they can never do wrong.\r\n\r\nAlthough it didn’t need to be three hours long and could have easily been 2 hours. I had issues with how long the movie stayed in one setting, as it dragged the pacing down a bit. I must admit there was a point where I nearly dozed off, not because it was boring, but prior to watching I had a long day that pretty much drained me and the movie at times didn’t help. However there was a point mid way through where the movie woke me up, which is incredibly rare for an art house movie.\r\n\r\nI’ll give Malick credit, nobody makes movies like he does. Love it or hate it, but no other director has come close to finding the inner heart and soul in nature that’s with human beings. I think it’s easy to look at his work and label them as “pretentious”. His approach to narration is incredibly jumbled, but more truthful than movie dialogue, because we don’t mean what we say most of the time; a rambling mess. I often find the people who dismiss him and think they know about ‘keeping it real’, are the pretentious ones.\r\n\r\nThe unique thing about this movie and his previous work, when the movie is over you start to notice nature and I really do mean notice nature - something you would have never done before. Such as: grass and leaves dancing in the wind, natural light, the warmth of the sun touching your skin, and the smell of nature. It’s incredibly compelling how a movie can activate my senses that I haven’t experience in a very long time, dating back to childhood.\r\n\r\n“Nostalgia is a powerful feeling; it can drown out anything.”\r\n\r\nOverall rating: A welcome return to form.", "created_at": "2020-01-27T18:33:33.726Z"}, {"movie_id": 403300, "review_id": "5e3251b94ca67600174df7a6", "author_rating": 9.0, "review_text": "**_A meditation on morality and faith; a film of unparalleled sublimity; an experience beyond the sensory_**\r\n\r\n>_Death be not proud, though some have called thee_\r\n\r\n>_Mighty and dreadfull, for, thou art not soe,_\r\n\r\n>_For, those, whom thou think'st, thou dost overthrow,_\r\n\r\n>_Die not, poore death, nor yet canst thou kill mee._\r\n\r\n>_From rest and sleepe, which but thy pictures bee,_\r\n\r\n>_Much pleasure, then from thee, much more must flow,_\r\n\r\n>_And soonest our best men with thee doe goe,_\r\n\r\n>_Rest of their bones, and souls deliverie._\r\n\r\n>_Thou art slave to Fate, Chance, kings, and desperate_ _men,_\r\n\r\n>_And dost with poyson, warre, and sicknesse dwell,_\r\n\r\n>_And poppie, or charmes can make us sleepe as well,_\r\n\r\n>_And better than thy stroake; why swell'st thou then?_\r\n\r\n>_One short sleepe past, wee wake eternally,_\r\n\r\n>_And death shall be no more; death, thou shalt die._\r\n\r\n- John Donne; \"Holy Sonnet X\" (1609)\r\n\r\n>_...the growing good of the world is partly dependent on unhistoric acts; and that things are not so ill with you and me as they might have been, is half owing to the number who lived faithfully a hidden life, and rest in unvisited tombs._\r\n\r\n- George Eliot; _Middlemarch_ (1872)\r\n\r\n>_I am convinced that it is still best that I speak the truth, even if it costs me my life. For you will not find it written in any of the commandments of God or of the Church that a man is obliged under pain of sin to take an oath committing him to obey whatever might be commanded of him by his secular ruler._\r\n\r\n- Franz Jägerstätter (July 19, 1943)\r\n\r\n>_Dearest wife and mother. It was not possible for me to spare you the pain that you must now suffer on my account. How hard it must have been for our dear Saviour when, through His sufferings and death, He had to prepare such a great sorrow for His Mother – and they bore all this out of love for us sinners. I thank our dear Jesus, too, that I am privileged to suffer and even die for Him._\r\n\r\n- Franz Jägerstätter (August 8, 1943)\r\n\r\n>_Why should I be afraid to die? I belong to you. If I go first, I'll wait for you there, on the other side of the dark waters._\r\n\r\n- Pvt. Jack Bell; _The Thin Red Line_ (1998)\r\n\r\nLegendary writer/director Terrence Malick originally studied philosophy and excelled as an undergraduate at Harvard under philosopher of aesthetics, ethics, and ordinary language, Stanley Cavell. In 1966, Malick wrote an exceptionally well-received thesis on Edmund Husserl, the founder of phenomenology (study of structures of consciousness), and Martin Heidegger, pioneer in the fields of hermeneutics (study of theories of interpretation) and existentialism (study of the totality of an individual's experience), and founder of existential phenomenology (more on that momentarily). Malick graduated _summa cum laude_ and _Phi Beta Kappa_ with a Rhodes Scholarship, and headed to Oxford to work on his PhD thesis under Gilbert Ryle, a behavourist best known for his opposition to the Cartesian conception of mind-body duality (the theory that the mental and the physical are separate and do not affect one another). However, Ryle felt that Malick's proposed study of conceptions of \"being-in-the-world\" in the work Søren Kierkegaard, Ludwig Wittgenstein, and Heidegger \"_wasn't philosophical enough_\", and Malick returned to the US without his doctorate. In 1969, he published a translation of Heidegger's 1929 essay \"Vom Wesen Des Grundes\" as _The Essence of Reasons_, before finding his way into filmmaking, where his knowledge of Heidegger, particularly the concepts of existential phenomenology, would inform his filmography from its inception.\r\n\r\nAt the same time, Malick's films have always tended to deal with explicitly Christian themes, particularly the notion of grace (the free and unmerited favour of God). _Badlands_ (1973) and _Days of Heaven_ (1978) are both moral parables about fallen men – in _Badlands_, Kit Carruthers (Martin Sheen) accepts his evil and trades on society's fascination with that evil, whereas in _Days of Heaven_, Bill (Richard Gere) attempts to outrun the wrong he has done, bringing biblical retribution down on himself and those around him. Malick's masterpiece _The Thin Red Line_ (1998) is partly about the contrast between war and the belief that this world is merely a gateway to the next, whilst also looking at the idea that the glory of God can be seen everywhere, no matter the circumstances, if one only has the eyes to see it. The criminally underrated _The New World_ (2005) looks at the clash between nature and grace, and the corruption of the values of the Old World. Nature versus grace also forms the spine of the Palm d'Or-winning odyssey that is _The Tree of Life_ (2011), but here, Malick is more interested in looking at the similarities between the macro (the birth of the universe) and the micro (the death of a child), and how each is part of a tapestry none of us can fully comprehend. And then we have his unofficial modern-day trilogy, each made without a script – _To the Wonder_ (2012), _Knight of Cups_ (2015), and _Song to Song_ (2017), punctuated by his pseudo-documentary _Voyage of Time_ (2016). _To the Wonder_ continues to look at the contrast between nature and grace, albeit with a modern inflection. _Knight of Cups_ is essentially a modern version of John Bunyan's Christian allegory _The Pilgrim's Progress_ (1678) and looks at the dangers of coveting that which one hasn't earned or doesn't deserve. _Song to Song_ functions in a similar manner, transposing the story from the film business to the music industry. And _Voyage of Time_ is a homily to nothing less than the creator of the heavens and Earth. And Malick's next film? _The Last Planet_, a narrative covering a series of episodes from the life of Jesus Christ. Yet for all this, Malick is never didactic, dogmatic, or puritanical. No matter how lofty his vision, his films remain always rooted in the human soul, very much in the tradition of Heidegger's existential phenomenology, which focuses on the ontology of the earthly _Dasein_ (\"being-there\") rather than the epistemology of the _Lebenswelt_ (\"lifeworld\") – even the most overtly metaphysical scenes in Malick (the creation sequences in _Tree of Life_ and _Voyage of Time_) are still ultimately focused on earthly physical existence.\r\n\r\nAll of which brings us belatedly to _A Hidden Life_, which may be Malick's most ostensibly Christian work yet. Although his most narratively conventional and linear film since Thin Red Line, it's quintessentially Malickian, featuring many of his most identifiable stylistic traits (whispered voice-overs, sweeping cameras spinning around non-stationary characters, the beauty of nature contrasted with the ugliness of humanity). In this sense, although critics who disliked the trilogy are hailing it as Malick's \"_return to form_\", it's certainly not going to win him any new converts. Malick's films are about the search for transcendence in a compromised and often evil world, and, telling the true story of the Austrian conscientious objector Franz Jägerstätter, who refused to swear an oath of allegiance to Hitler, _A Hidden Life_ is no different, asking questions such as should one do what one knows to be morally right, even when it accomplishes nothing except the suffering of one's self and family; what is the value of sacrifice if it goes unknown; how far can principals be invoked in such a situation; should spiritual purity be the supreme arbitrator of one's conscience; is one obliged to condemn evil even if that condemnation is irrelevant? Pretty light stuff all round, really. Winner of both the _Prix François Chalais_ and the _Prix du Jury Œcuménique at Cannes_, the film was screened at the Vatican Film Library in December 2019, with Malick making an ultra-rare public appearance. And how good is _A Hidden Life_? Very, very, very good. Not quite _Thin Red Line_/_Tree of Life_ good, but certainly _Badlands_/_Days of Heaven_/_New World_ good. This is cinema at its most sublimely pious, a supremely talented master-_auteur_ operating at the height of his not inconsiderable powers.\r\n\r\nAustria, 1938. In the bucolic village of Sankt Radegund, nestled in the mountains and valleys of Oberösterreich, peasant farmer Franz Jägerstätter (August Diehl) lives a simple but blissful life with his wife Fani (Valerie Pachner), his mother Rosalia (Karin Neuhäuser), Fani's sister Resie (Maria Simon), and his and Fani's three children – Rösl (Ida Mutschlechner), Maridl (Maria Weger), and Loisl (Aennie Lade). A devout Christian, Franz is unenthusiastic about the looming war, despite its widespread popularity in the village, bringing him and his family into conflict with many of the locals, most notably Mayor Keil (Martin Wuttke), who considers Franz a friend, but who is also in favour of the _Anschluss_, believing Austria to have been decimated by immigration. Franz is called up to basic training and is away for several months, but when France surrenders in June 1940, it's thought that the war will soon end, and he's sent home without having been deployed. However, as time goes by, and as the war shows no signs of ending, his opposition grows ever more ingrained, to the point where his wife, mother, and sister-in-law are being harassed and his children teased. Seeking the counsel of local priest and close family friend Ferdinand Fürthauer (Tobias Moretti), Franz is referred to the Bishop of Salzburg, Josephus Fließer (the final performance of the great Michael Nyqvist), who tells him that the Church teaches one must be faithful to one's fatherland. Eventually, Franz is conscripted, and the first order of business is to swear an oath of allegiance to Hitler. Franz, however, refuses, and is arrested and imprisoned. For the next few years, several people try to get him to change his stance, most notably Captain Herder (Matthias Schoenaerts) and Lueben (the penultimate performance by the legendary Bruno Ganz), a sympathetic judge, both of whom try to convince him that his sacrifice will accomplish nothing except cause pain for his family. Nevertheless, although he has no desire to martyr himself, he remains resolute.\r\n\r\nNeedless to say, Malick fashions this material into a thematically rich mosaic. To a certain extent, all his films deal, to one degree or another, with the notion of the corruption of Eden. In _Badlands_, it's the exploitation of childlike innocence; in _Days of Heaven_, it's the destruction of the bucolic Texas panhandle by a Biblical plague and fire; in _Thin Red Line_ it's the peaceful and harmonious Solomon Islands, their culture fractured by a War about which they care little; in _New World_, it's the spirituality of the pre-colonial Americas; in _Tree of Life_, Malick returns to the corruption of innocence, but so too looks at the effects of cruelty on the human soul; even the present-day trilogy looks at notions of ruination and spiritual disintegration. However, _Hidden Life_ is perhaps his most explicit examination of this theme thus far. Sankt Radegund is introduced as an earthly paradise, hidden in the embrace of the nearby mountains, fed by the River En (the film was originally called simply _Radegund_, before adopting the George Elliot quote as its title). One of the first lines of dialogue is Fani stating, \"_we lived above the clouds_\". Life is simple and pure, with subsistence cultivated from nature by hand. However, as the war takes hold, the village comes under attack, not by bombs, but by ideological complicity and moral midgetry. The harmony and idealism have been corrupted, not by Franz's refusal to comply, by everyone else's insistence on compliance. The village at the end of the film is an infinitely different place from that at the start, a tainted place. As much as this is Franz's film, so too is it a story about the fall of Eden.\r\n\r\nAlthough Malick has never been an especially political filmmaker in a conventional sense, one could certainly read an element of political allegory in _Hidden Life_. This is a story of Christians, often very devout Christians, refusing to condemn an evil man when he rises to become the leader of their country (\"_don't they know evil when they see it?_\") So too is it the story of the Church's failure to stand against evil for fear of having its power curtailed. It also looks at how characters like Keil are easily convinced by Hitler's anti-immigration rhetoric, and touches on the idea that a man's integrity might be called into question because he dares to call out a leader for their transgressions. All of this has obvious contemporary parallels. For example, look at how US evangelicals have blindly embraced Trump despite the antithetical nature of their (apparent) ideology and his actions. Nowhere is this clearer than in the puritanical figure of Vice President Mike Pence, a supposedly pious born-again Christian who actively supports and excuses an immoral and corrupt regime. The ease with which Hitler's empty nationalist bravado won supporters to his cause is not dissimilar to how Trump marshalled his base during his 2016 presidential campaign, and how he keeps that base sweet with his ongoing racist diatribes. Similarly, the idea that a man's integrity can be called into question for failing to offer blind loyalty to a corrupt leader finds parallels in the case of Lt. Col. Alexander S. Vindman, a Purple Heart recipient (won during his time with a military that Trump repeatedly dodged), who had his integrity and patriotism questioned for daring to testify against Trump during the 2019 impeachment hearings. Similarly, at one point, Franz is told, \"_a darker time is coming, and men will be more clever. They don't confront the truth. They just ignore it._\" Malick may or may not have explicitly intended the contemporary resonance of such lines, but one can't deny their applicability to the here and now.\r\n\r\nIn any case, Franz doesn't resist the Nazis because he wants to spearhead a movement or because of political high-mindedness. His reasons are simpler – he believes that God teaches us to resist evil, and as a great evil, he must therefore resist Nazism. There's nothing egotistical and precious little that's political in this stance. It's not even a question of personal morality. He believes he's acting in the way instructed by the Almighty (\"_they ask you to take an oath to the anti-Christ_\"). In an important exchange with Lueben, Franz is asked, \"_Do you have a right to do this?_\", to which he responds, \"_Do I have a right not to?_\" His resistance is ingrained in his very soul, it is part of his purpose in life. Indeed, watching him head willingly toward his tragic fate, turning the other cheek to the prison guards who humiliate and torture him, he becomes something of a Christ figure (\"_does a man have a right to put himself to death for the truth?_\"), with his time in prison not unlike the Passion. An important conversation concerning this is when he is speaking to Ohlendorf (Johan Leysen), a cynical artisan who is restoring the local church's artwork. Ohlendorf laments that he must work not on images of Christ's suffering as it was, but on the sanitised version desired by the clergy, and he lacks the courage to do otherwise; \"_I paint their comfortable Christ, with a halo over his head. Some day I might have the courage to venture. Not yet. Some day. I'll paint the true Christ._\" It's a subtle summation of Franz's situation, of course, but so too of the film, which shows Franz's suffering as it was even as it celebrates the power of faith to transcend such suffering.\r\n\r\nIn this sense, much like Pvt. Witt (Jim Caviezel) in _Thin Red Line_, Franz is a Heideggerian _sein-zum-tode_ (\"being-towards-death\"). This describes not the hastening towards the end of _Dasein_ in a biological sense but is rather about the process of growing in the _Lebenswelt_ to a point where one gains an authentic perspective on _Dasein_, a perspective solidified by death, as one comes to completely accept the temporality of this existence, and hence no longer fear death. The application to both Witt and Franz is obvious – both men accept that this world is transitory and that life is simply part of the soul's eternal journey, so neither man fears death, and by not fearing it, they triumph over it. In _Thin Red Line_, Pvt. Bell (Ben Chaplin), writes to his wife, \"_if I go first, I'll wait for you there, on the other side of the dark water_\". Here, Fani tells Franz, \"_I'll see you there. In the mountains._\" The sentiment is the same – after this world comes another; after the transitory comes the eternal.\r\n\r\nAt the same time, however, the film never denies or ignores the pain of living, nor the corruption and decay found in the world. Malick has Franz point out such things as \"_he who created this world created evil_\", whilst Fani naively believes \"_no evil can happen to good men_\", something explicitly addressed and denied by Cpt. Staros (Elias Koteas) in _Thin Red Line_, who asks, \"_are you righteous? Kind? Does your confidence lie in this? Are you loved by all? Know that I was, too. Do you imagine your sufferings will be less because you loved goodness? Truth?_\" Goodness and truth do not exempt one from suffering. The sun shines on all men alike, good and evil, and although Fani hypothesises that \"_a time will come when we will know what this is for_\", Malick seems to suggest that it will not be on this plane of existence. If there is sense to be found, as Franz and Witt believe there is, much of Malick's work seems to suggest that that sense is to be found elsewhere.\r\n\r\nAesthetically, as one expects from Malick, _A Hidden Life_ is almost overwhelmingly beautiful. I have to admit, I was concerned when I found out this would be Malick's first film without production design Jack Fisk, and even more concerned with I learned it would also be without cinematographer Emmanuel Lubezki, who has worked on all of Malick's material since _New World_ (_Voyage of Time_ notwithstanding). Instead, the film was shot by Jörg Widmer, a prolific Steadicam operator and camera assistant who also started working with Malick on _New World_. And the cinematography is very, very impressive, albeit not quite up to the quality of John Toll's work on Thin Red Line or Lubezki's on Tree of Life. But what is?\r\n\r\nAs in everything Malick has ever done, the power, vastness, and indifference of the natural world are paramount. Indeed the film opens with the sounds of birds chirping and a river flowing, followed by a voice-over in which Fani invokes the natural grandeur of Sankt Radegund (\"_I thought that we could build our nest high-up. In the trees. Fly away like birds to the mountains_\"). All of this before we see a single image. The film then begins (and closes) on breath-taking shots of the mountains around the village. After the opening shots, Malick surprised me by cutting to old archive footage of Nazi marches and rallies. Bizarrely, Taika Waititi chose to open his anti-hate film _Jojo Rabbit_ (2019) in similar fashion, although, as one can imagine, Malick's film has a slightly (ever so slightly) different tone to Waititi's brilliant satire. Something else Malick does that he has never done before is that a lot of the VO is epistolary, with large portions of it taken from the letters Franz and Fani write to one another when he was in prison. Again, for Malick, this is a very conventional style to employ, especially insofar as his VOs have been getting more and more abstract as his film have gone on – in _Badlands_, a lot of the VO is from a diary, whereas in _Song to Song_, the VO is so ethereal, it often doesn't even form full sentences. The VO in _Hidden Life_ is spoken entirely by Franz and Fani, and is far less abstract, which is not to say for one second that it's explanatory or expositionary, rather than it's more linear.\r\n\r\nShooting digitally on the Red Epic Dragon camera, Malick and Widmer shot most of the exteriors (and some of the interiors) in a wide-lens anamorphic format that distorts everything outside the dead-centre of the frame. The effect is subtle (we're not talking fisheye lens distortion), but important – pushing the mountains further around the village, bringing the sky closer, elongating the already vast fields. This is a land beyond time, a modern Utopia that kisses the very sky. You look at this world and you think to yourself, \"_why would anyone not do everything in their power to stay here, or to return here if forced to leave?_\" We're seduced by the beauty. But Franz sees something more beautiful. He can leave this place because he sees the glory beyond this life, the eternal beauty of faith in God. The more invested you are in the natural splendour and wonder of Radegund, the more awed you are, the more Franz's conviction will mean to you. Such is Malick's total control of the medium – theme and form impossible to divide. This, more than anything, is where the film's power lies, and how it moves beyond the sensory, becoming a homily to the transcendent power of faith. You don't watch _A Hidden Life_. You let it enter your soul.\r\n\r\nAs for problems, as a Malick fanatic, I found very few. You know what you're getting with a Malick film, so complaining about the length (it's just shy of three hours) or the pace is kind of pointless. You know if you like how Malick paces his films, and if you found, for example, _New World_ boring beyond belief, so too will you find _Hidden Life_. One thing I will say, though, there are a few scenes in the last act that are a little repetitive, giving us information we already have or hitting emotional beats we've already hit. It could also be argued that the film abstracts or flat-out ignores the real horrors of World War II, but that's by design. It isn't about those horrors, and _Thin Red Line_ proves Malick has no problem showing man's inhumanity to man. This film is not about the chaos and horror of combat. It's about the spiritual journey of an individual, and frankly, if Malick has suddenly injected a combat scene into it, it would have completely disrupted and undermined the tone. The same is true for politics; much like Sam Mendes's Great War movie, _1917_ (2019), _Hidden Life_ is not about politics, so to accuse it of failing to address politics is to imply it's obliged to address politics. Which it most certainly is not; no work of art in any medium is obliged to address anything, no matter its theme or focus. I've also seen a few critics say that the film is vague on the reasons for Franz's resistance. Which is astounding to me; I don't understand how you can watch the film and come out saying \"_I don't get why he did that_\". The entire film is fundamentally about why he did it. It's in every frame, every piece of dialogue and VO.\r\n\r\n_A Hidden Life_ left me profoundly moved, on a level that very, very few films have (_Thin Red Line_ and _Tree of Life_ amongst them). Less a film than a spiritual odyssey, if you're a Malick fan, you should be enraptured. I don't know if I'd necessarily call it a masterpiece, but it's certainly close and is easily the best film of 2019 that I've seen thus far (the fact that it missed out on a single Academy Award nomination is a commentary unto itself). Malick's film have always had something of a Manichean viewpoint (the \"_darkness and light_\" of _Thin Red Line_; the \"_way of nature and the way of grace_\" of _Tree of Life_), but _Hidden Life_ is probably the most rigidly Manichean film he's ever done, with the Eden of Radegund contrasted with the evil of Franz's imprisonment. However, even within this rigid divide, Fani experiences cruelty in Radegund, and Franz experiences kindness in prison – the primal forces bleeding into one another's domains, with the film's thematic complexity never feeling forced for a second. _A Hidden Life_ is an exceptional piece of work in every way, and if you allow yourself to fold into it, the rewards are many.", "created_at": "2020-01-30T03:47:05.050Z"}, {"movie_id": 403300, "review_id": "5e7d56e6eec4f34267aa0511", "author_rating": 9.0, "review_text": "Terrence Malick lovers are going to mesmerized by “A Hidden Life,” his latest, and perhaps even greatest, work in years. As a huge fan of the director’s films, this three hour ethereal work of art plays like an extended dream and is textbook Malick perfection. But for those who find his films trying rather than celebrating his cinematic genius, this will likely prove to be yet another bore.\r\n\r\nBased on real events, this film is the story of a mostly unknown heroic Austrian farmer, Franz Jägerstätter (August Diehl), who refused to fight for the Nazis during World War II. This conscientious objector is ostracized by his village and eventually is threatened with execution for treason. Franz eventually is thrown into jail, but he never falters with his brave stance. Instead, he stands for what he feels is morally right, clinging to his faith and the love for his wife Fanni (Valerie Pachner) and children to keep his spirit afloat.\r\n\r\nAdmittedly, the film is much longer than it should be. There isn’t much more than 30 minutes of story, but it’s told with a philosophical beauty that eases the passage of time. That’s what makes the film an experience instead of a literal, traditional tale. Jörg Widmer’s cinematography is masterful with a lyrical, visual poetry. Wide-angle shots of waving wheat fields and snow-capped peaks of the Austrian Alps shrouded in the clouds are jaw-dropping. The film is a collection of sensory visuals that will make viewers feel as if they’re right there, reaching out to touch the just-rained-on grass or struggling with the animals on the farm. I could smell the thunderstorm. I could feel the crisp mountain air.\r\n\r\nMalick is a complicated director who isn’t easy to endure much less like, but his storytelling is grandiose yet takes pause at the simplest aspects of life and survival. This is not a film for the impatient, as there is a lot of plowing, whispering, and slow-moving, indulgent visuals. It’s best to think of “A Hidden Life” as a meditation on morality, conviction, and existence, or a timely theme of spiritual struggles that arise from fighting for your beliefs and doing what you know is right.\r\n\r\nPerhaps this is what the devout refer to as a “religious experience.” I am not a spiritual person, but the beauty of this film moved me.", "created_at": "2020-03-27T01:29:10.581Z"}]