[{"movie_id": 1949, "review_id": "5cedc289c3a3685e8726b0e4", "author_rating": 9.0, "review_text": "Peerless precision from Fincher.\r\n\r\nI have seen it written that this film shows that Fincher had grown up, and whilst I understand that train of thought, it simply isn't true. What Fincher has done is give a true story his meticulous care and standard deft precision by leaving no stone unturned. We get simply one of the (if not thee) best films to deal with the investigating process of a high profile serial killer, a film that as a character study is actually essential viewing in the pantheon of genre productions.\r\n\r\nThe devilish greatness of this film is in the fact that it can't pay off with a pandering mainstream ending, the makers are telling a true story and any sort of research will lead viewers to the fact that there is no twist here, no joyous ticket selling round of applause at this ending, it is what it is, frustratingly brilliant. The case the film is about consumes all involved with it, and to see how it affects those involved is engrossing (yet sad) because if the viewer is so inclined to jump on board then it will consume you as well, the film and the actors within demand you see this for the affecting character piece it is.\r\n\r\nThe acting here gives me hope that classic acting is alive and well in this generation, I was once not enamoured with Mark Ruffalo in his early days as an actor, but here he puts such heartfelt verve into the role of David Toschi I felt I need to send him a written apology!. Robert Downey Junior is joyous as Paul Avery, all 60s chic and swagger without tipping over the edge of the mountain caricature (both men to become future Avengers of course). Yet surprisingly to me I found that it is Jake Gyllenhaal as Robert Graysmith who is the film's key axis, the central heartbeat, with a performance that demands undivided attention, a performance brought about by Fincher's quest for perfection from everything to do with film making. Gyllenhaal hated working on the film, he hated Fincher's work ethic, but in time he must now look back and see that here the director coaxed out a performance that has in time been seen as not only great, but also beneficial to his career (hello Nightcrawler).\r\n\r\nThis is not Se7en 2, and British film mags like Empire should have known better than to use that tag line to get the readers' attention, because fans of serial killer thrillers need not apply here, fans of outstanding cinema about the human psyche during the pursuit of a serial killer - Well get in line folks, for this is one of the best movies of the decade. 10/10", "created_at": "2019-05-28T23:21:45.746Z"}, {"movie_id": 1949, "review_id": "5fbbeeac06f984003d6a254c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me closely for the past week, I'm currently (re)watching five of David Fincher's films in preparation for his next movie, Mank, which premieres on Netflix in a couple of weeks. I've already revisited Se7en and Fight Club, two iconic films that not only profoundly impacted filmmaking but also our culture. However, Zodiac isn't one of Fincher's most popular movies, and maybe that's one of the reasons why I'm watching it for the very first time. Based on a real story, Fincher's first non-fiction adaptation is also one of the longest films of his career. I didn't know anything about the true events before watching this movie, which leads me to the biggest compliment I can offer to this type of film.\r\n\r\nThere are hundreds of characteristics that a viewer can observe, analyze, and through them, ultimately form an overall opinion about a movie. Nevertheless, when it comes to cinematic adaptations of a true story, there's always one aspect that I value tremendously, which is how much the film convinces me to research about its story after I finish watching it. Truth is, midway through Zodiac, I started to acknowledge its lengthy duration. Don't be mistaken. It's not what people call a \"slow movie\", much on the contrary. It's long, yes, but it's packed with non-stop, rapid-fire dialogues that Fincher himself asked the actors to speed up so that the runtime wouldn't stretch even more.\r\n\r\nThroughout the entire film, I feel the exact same manner as the main characters. For the first hour or so, the case is ramping up, the murders increase in quantity, new developments emerge, just like new suspects, letters, ciphers, and everything that comes with dealing with this serial killer. During this period, I feel extremely captivated, but then comes a phase where the characters themselves start to give up due to the lack of concrete evidence to finally convict a suspect. I feel the frustration, depression, and even the infuriating absence of a clear path to the killer. However, Robert Graysmith's (Jake Gyllenhaal) obsession with the case starts becoming my own, and the last thirty minutes are incredibly stressful, frightful, and enthusiastic.\r\n\r\nZodiac possesses 157 minutes, mostly consisting of talking and only a couple of stylish, slow-motion murder scenes, so obviously, this is a dialogue-driven narrative. James Vanderbilt's screenplay is packed with detailed characterization, extensive conversations, and from what I could gather, an impressive historical accuracy. Fincher and Vanderbilt prove their unbelievable commitment with the mind-blowing preparation for this flick, which basically included an entirely unique investigation on the real case (interviewing the people who give life to the movie's protagonists, family members, police departments, witnesses, etc.). Yet another evidence that supports the importance of the pre-production phase in filmmaking.\r\n\r\nSo, in case I forget to answer my own question, Zodiac achieved its primary mission. As soon as the film ended, I found myself googling everything about the real case, trying to find out new information, obsessed with the intriguing story. It doesn't even matter if the viewer loves the movie or not, its impact is undeniable since most people will feel the same urgency to understand more about the real case. Two other attributes deeply contribute to this result: the cast and the editing. The latter is performed by Angus Wall, and his work is some of the best film editing I've ever witnessed. It's the main reason why the huge runtime feels adequate and why the narrative moves so well. No wonder almost every job of his got so many award nominations.\r\n\r\nFinally, the actors are all extraordinary. Mark Ruffalo (Dave Toschi), Anthony Edwards (Bill Armstrong), Robert Downey Jr. (Paul Avery), and Jake Gyllenhaal portray distinct, well-developed characters who deal with the case in their own way. Obsession is definitely the fundamental social theme present in the movie, depicted differently with each character. Armstrong completely moves on and never looks back. Toschi tries to forget, but he can't accept that he failed to do his job. Avery develops a mental condition and/or addiction due to its inability to deal with the pressure, stress, and frustration of reporting the case. Graysmith lets his total obsession over Zodiac impact his personal life, affecting his family in the process.\r\n\r\nFincher is able to represent each and every one of these behaviors in an astonishingly realistic fashion. The use of long uninterrupted takes helps the conversations flow better, and the simple, non-distracting camera work from Harry Savides lets the viewer focus on who they're listening to. It's one of those films which I can't really point out direct flaws. There's that period during the second act where I start to feel tired and worn out, and despite the irreprehensible dedication to providing every single bit of knowledge about the actual events, it's still an enormous amount of information to process, which made me feel a bit lost occasionally. Fortunately, the movie ends strongly, culminating in a simple yet powerful exchange of looks.\r\n\r\nAll in all, Zodiac gains the most generous praise that a film based on a true story can ever receive from me. James Vanderbilt's screenplay convinced me to research everything about the real events as soon as the movie finished, which is undeniably an impactful effect of watching such a well-written, captivating narrative with well-developed, authentic characters. David Fincher's commitment to being as historically accurate as possible is visible on-screen, a remarkable result of a massive preparation that very few filmmakers would even think about performing. With some of the best editing work in the history of cinema, the lengthy runtime flows better than expected, but the amount of information to digest is overwhelming and tiresome, dropping the levels of entertainment, especially during a certain period of the second act. Nevertheless, a phenomenal third act, three outstanding performances from Mark Ruffalo, Robert Downey Jr., and Jake Gyllenhaal, and an emotionally compelling, realistic approach to extreme obsession turn the entire film into one of the best of its genre. Another massive recommendation from this side.\r\n\r\nRating: A-", "created_at": "2020-11-23T17:17:32.477Z"}, {"movie_id": 1949, "review_id": "606be9f844ea54002916ba13", "author_rating": 9.0, "review_text": "A great character driven crime-drama with wonderful performances from Gyllenhaal, Ruffalo and Downey Jr. Been a few years since I last saw this one but decided to give it a re-watch (seen it I think five times now including the rated version in theaters and then DVD). Even though it's 2.75 hours, never gets dull and is engrossing through and through, even if the conclusion might not be accurate. **4.5/5**", "created_at": "2021-04-06T04:56:24.236Z"}, {"movie_id": 1949, "review_id": "63099f38bb070d00843778e7", "author_rating": 4.0, "review_text": "Two years before Zodiac, Capote depicted Truman Capote making a fuss about possibly not having an ending for his seminal true crime novel In Cold Blood. Robert Graysmith, on whose non-fiction books Zodiac is based, had no such qualms, nor did director David Fincher. The comparison may be unfair; Graysmith is no Capote (but then, who is?), and In Cold Blood isn’t a whodunit – though technically neither is Zodiac, since after more than two hours we don’t learn who [has] done it so much as who-a-very-small-group-of-people-think-done-it. In a nutshell, this is a movie about a hunch.\r\n\r\nThe film would work better (and that’s not to say it doesn’t work at all) if it were, like Capote, about a man obsessed with a crime and those who have committed it – especially considering that the Zodiac killings constitute arguably the most famous unsolved murder case in American history; unfortunately, Fincher is what James Randi would have called a true believer, and Zodiac leaves little doubt that the director is as persuaded that Arthur Leigh Allen (John Carroll Lynch) was the Zodiac as he is that Herman Mankiewicz singlehandedly wrote the script for Citizen Kane.\r\n\r\nZodiac is a better movie than Mank, however, because Fincher was more in possession of his faculties in 2007 than in 2020; accordingly, the former film makes a more coherent and convincing case for its thesis than does the latter (and even this we can attribute to the credibility of a very deep roster of skilled supporting players in addition to the rock-solid core of leading men-cum-character actors in the most prominent roles), although it still boils down to a ‘what if?’ scenario. So flimsy in fact is the entire house of cards that the story ends – or rather comes to a halt (lacking, as noted above, a logical conclusion) – on a fallacious note: “Just because you can't prove it, doesn't mean it's not true.” It’d be a lot more reassuring if you could, though.", "created_at": "2022-08-27T04:36:08.503Z"}, {"movie_id": 1949, "review_id": "5cedc289c3a3685e8726b0e4", "author_rating": 9.0, "review_text": "Peerless precision from Fincher.\r\n\r\nI have seen it written that this film shows that Fincher had grown up, and whilst I understand that train of thought, it simply isn't true. What Fincher has done is give a true story his meticulous care and standard deft precision by leaving no stone unturned. We get simply one of the (if not thee) best films to deal with the investigating process of a high profile serial killer, a film that as a character study is actually essential viewing in the pantheon of genre productions.\r\n\r\nThe devilish greatness of this film is in the fact that it can't pay off with a pandering mainstream ending, the makers are telling a true story and any sort of research will lead viewers to the fact that there is no twist here, no joyous ticket selling round of applause at this ending, it is what it is, frustratingly brilliant. The case the film is about consumes all involved with it, and to see how it affects those involved is engrossing (yet sad) because if the viewer is so inclined to jump on board then it will consume you as well, the film and the actors within demand you see this for the affecting character piece it is.\r\n\r\nThe acting here gives me hope that classic acting is alive and well in this generation, I was once not enamoured with Mark Ruffalo in his early days as an actor, but here he puts such heartfelt verve into the role of David Toschi I felt I need to send him a written apology!. Robert Downey Junior is joyous as Paul Avery, all 60s chic and swagger without tipping over the edge of the mountain caricature (both men to become future Avengers of course). Yet surprisingly to me I found that it is Jake Gyllenhaal as Robert Graysmith who is the film's key axis, the central heartbeat, with a performance that demands undivided attention, a performance brought about by Fincher's quest for perfection from everything to do with film making. Gyllenhaal hated working on the film, he hated Fincher's work ethic, but in time he must now look back and see that here the director coaxed out a performance that has in time been seen as not only great, but also beneficial to his career (hello Nightcrawler).\r\n\r\nThis is not Se7en 2, and British film mags like Empire should have known better than to use that tag line to get the readers' attention, because fans of serial killer thrillers need not apply here, fans of outstanding cinema about the human psyche during the pursuit of a serial killer - Well get in line folks, for this is one of the best movies of the decade. 10/10", "created_at": "2019-05-28T23:21:45.746Z"}, {"movie_id": 1949, "review_id": "5fbbeeac06f984003d6a254c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me closely for the past week, I'm currently (re)watching five of David Fincher's films in preparation for his next movie, Mank, which premieres on Netflix in a couple of weeks. I've already revisited Se7en and Fight Club, two iconic films that not only profoundly impacted filmmaking but also our culture. However, Zodiac isn't one of Fincher's most popular movies, and maybe that's one of the reasons why I'm watching it for the very first time. Based on a real story, Fincher's first non-fiction adaptation is also one of the longest films of his career. I didn't know anything about the true events before watching this movie, which leads me to the biggest compliment I can offer to this type of film.\r\n\r\nThere are hundreds of characteristics that a viewer can observe, analyze, and through them, ultimately form an overall opinion about a movie. Nevertheless, when it comes to cinematic adaptations of a true story, there's always one aspect that I value tremendously, which is how much the film convinces me to research about its story after I finish watching it. Truth is, midway through Zodiac, I started to acknowledge its lengthy duration. Don't be mistaken. It's not what people call a \"slow movie\", much on the contrary. It's long, yes, but it's packed with non-stop, rapid-fire dialogues that Fincher himself asked the actors to speed up so that the runtime wouldn't stretch even more.\r\n\r\nThroughout the entire film, I feel the exact same manner as the main characters. For the first hour or so, the case is ramping up, the murders increase in quantity, new developments emerge, just like new suspects, letters, ciphers, and everything that comes with dealing with this serial killer. During this period, I feel extremely captivated, but then comes a phase where the characters themselves start to give up due to the lack of concrete evidence to finally convict a suspect. I feel the frustration, depression, and even the infuriating absence of a clear path to the killer. However, Robert Graysmith's (Jake Gyllenhaal) obsession with the case starts becoming my own, and the last thirty minutes are incredibly stressful, frightful, and enthusiastic.\r\n\r\nZodiac possesses 157 minutes, mostly consisting of talking and only a couple of stylish, slow-motion murder scenes, so obviously, this is a dialogue-driven narrative. James Vanderbilt's screenplay is packed with detailed characterization, extensive conversations, and from what I could gather, an impressive historical accuracy. Fincher and Vanderbilt prove their unbelievable commitment with the mind-blowing preparation for this flick, which basically included an entirely unique investigation on the real case (interviewing the people who give life to the movie's protagonists, family members, police departments, witnesses, etc.). Yet another evidence that supports the importance of the pre-production phase in filmmaking.\r\n\r\nSo, in case I forget to answer my own question, Zodiac achieved its primary mission. As soon as the film ended, I found myself googling everything about the real case, trying to find out new information, obsessed with the intriguing story. It doesn't even matter if the viewer loves the movie or not, its impact is undeniable since most people will feel the same urgency to understand more about the real case. Two other attributes deeply contribute to this result: the cast and the editing. The latter is performed by Angus Wall, and his work is some of the best film editing I've ever witnessed. It's the main reason why the huge runtime feels adequate and why the narrative moves so well. No wonder almost every job of his got so many award nominations.\r\n\r\nFinally, the actors are all extraordinary. Mark Ruffalo (Dave Toschi), Anthony Edwards (Bill Armstrong), Robert Downey Jr. (Paul Avery), and Jake Gyllenhaal portray distinct, well-developed characters who deal with the case in their own way. Obsession is definitely the fundamental social theme present in the movie, depicted differently with each character. Armstrong completely moves on and never looks back. Toschi tries to forget, but he can't accept that he failed to do his job. Avery develops a mental condition and/or addiction due to its inability to deal with the pressure, stress, and frustration of reporting the case. Graysmith lets his total obsession over Zodiac impact his personal life, affecting his family in the process.\r\n\r\nFincher is able to represent each and every one of these behaviors in an astonishingly realistic fashion. The use of long uninterrupted takes helps the conversations flow better, and the simple, non-distracting camera work from Harry Savides lets the viewer focus on who they're listening to. It's one of those films which I can't really point out direct flaws. There's that period during the second act where I start to feel tired and worn out, and despite the irreprehensible dedication to providing every single bit of knowledge about the actual events, it's still an enormous amount of information to process, which made me feel a bit lost occasionally. Fortunately, the movie ends strongly, culminating in a simple yet powerful exchange of looks.\r\n\r\nAll in all, Zodiac gains the most generous praise that a film based on a true story can ever receive from me. James Vanderbilt's screenplay convinced me to research everything about the real events as soon as the movie finished, which is undeniably an impactful effect of watching such a well-written, captivating narrative with well-developed, authentic characters. David Fincher's commitment to being as historically accurate as possible is visible on-screen, a remarkable result of a massive preparation that very few filmmakers would even think about performing. With some of the best editing work in the history of cinema, the lengthy runtime flows better than expected, but the amount of information to digest is overwhelming and tiresome, dropping the levels of entertainment, especially during a certain period of the second act. Nevertheless, a phenomenal third act, three outstanding performances from Mark Ruffalo, Robert Downey Jr., and Jake Gyllenhaal, and an emotionally compelling, realistic approach to extreme obsession turn the entire film into one of the best of its genre. Another massive recommendation from this side.\r\n\r\nRating: A-", "created_at": "2020-11-23T17:17:32.477Z"}, {"movie_id": 1949, "review_id": "606be9f844ea54002916ba13", "author_rating": 9.0, "review_text": "A great character driven crime-drama with wonderful performances from Gyllenhaal, Ruffalo and Downey Jr. Been a few years since I last saw this one but decided to give it a re-watch (seen it I think five times now including the rated version in theaters and then DVD). Even though it's 2.75 hours, never gets dull and is engrossing through and through, even if the conclusion might not be accurate. **4.5/5**", "created_at": "2021-04-06T04:56:24.236Z"}, {"movie_id": 1949, "review_id": "63099f38bb070d00843778e7", "author_rating": 4.0, "review_text": "Two years before Zodiac, Capote depicted Truman Capote making a fuss about possibly not having an ending for his seminal true crime novel In Cold Blood. Robert Graysmith, on whose non-fiction books Zodiac is based, had no such qualms, nor did director David Fincher. The comparison may be unfair; Graysmith is no Capote (but then, who is?), and In Cold Blood isn’t a whodunit – though technically neither is Zodiac, since after more than two hours we don’t learn who [has] done it so much as who-a-very-small-group-of-people-think-done-it. In a nutshell, this is a movie about a hunch.\r\n\r\nThe film would work better (and that’s not to say it doesn’t work at all) if it were, like Capote, about a man obsessed with a crime and those who have committed it – especially considering that the Zodiac killings constitute arguably the most famous unsolved murder case in American history; unfortunately, Fincher is what James Randi would have called a true believer, and Zodiac leaves little doubt that the director is as persuaded that Arthur Leigh Allen (John Carroll Lynch) was the Zodiac as he is that Herman Mankiewicz singlehandedly wrote the script for Citizen Kane.\r\n\r\nZodiac is a better movie than Mank, however, because Fincher was more in possession of his faculties in 2007 than in 2020; accordingly, the former film makes a more coherent and convincing case for its thesis than does the latter (and even this we can attribute to the credibility of a very deep roster of skilled supporting players in addition to the rock-solid core of leading men-cum-character actors in the most prominent roles), although it still boils down to a ‘what if?’ scenario. So flimsy in fact is the entire house of cards that the story ends – or rather comes to a halt (lacking, as noted above, a logical conclusion) – on a fallacious note: “Just because you can't prove it, doesn't mean it's not true.” It’d be a lot more reassuring if you could, though.", "created_at": "2022-08-27T04:36:08.503Z"}, {"movie_id": 1949, "review_id": "5cedc289c3a3685e8726b0e4", "author_rating": 9.0, "review_text": "Peerless precision from Fincher.\r\n\r\nI have seen it written that this film shows that Fincher had grown up, and whilst I understand that train of thought, it simply isn't true. What Fincher has done is give a true story his meticulous care and standard deft precision by leaving no stone unturned. We get simply one of the (if not thee) best films to deal with the investigating process of a high profile serial killer, a film that as a character study is actually essential viewing in the pantheon of genre productions.\r\n\r\nThe devilish greatness of this film is in the fact that it can't pay off with a pandering mainstream ending, the makers are telling a true story and any sort of research will lead viewers to the fact that there is no twist here, no joyous ticket selling round of applause at this ending, it is what it is, frustratingly brilliant. The case the film is about consumes all involved with it, and to see how it affects those involved is engrossing (yet sad) because if the viewer is so inclined to jump on board then it will consume you as well, the film and the actors within demand you see this for the affecting character piece it is.\r\n\r\nThe acting here gives me hope that classic acting is alive and well in this generation, I was once not enamoured with Mark Ruffalo in his early days as an actor, but here he puts such heartfelt verve into the role of David Toschi I felt I need to send him a written apology!. Robert Downey Junior is joyous as Paul Avery, all 60s chic and swagger without tipping over the edge of the mountain caricature (both men to become future Avengers of course). Yet surprisingly to me I found that it is Jake Gyllenhaal as Robert Graysmith who is the film's key axis, the central heartbeat, with a performance that demands undivided attention, a performance brought about by Fincher's quest for perfection from everything to do with film making. Gyllenhaal hated working on the film, he hated Fincher's work ethic, but in time he must now look back and see that here the director coaxed out a performance that has in time been seen as not only great, but also beneficial to his career (hello Nightcrawler).\r\n\r\nThis is not Se7en 2, and British film mags like Empire should have known better than to use that tag line to get the readers' attention, because fans of serial killer thrillers need not apply here, fans of outstanding cinema about the human psyche during the pursuit of a serial killer - Well get in line folks, for this is one of the best movies of the decade. 10/10", "created_at": "2019-05-28T23:21:45.746Z"}, {"movie_id": 1949, "review_id": "5fbbeeac06f984003d6a254c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me closely for the past week, I'm currently (re)watching five of David Fincher's films in preparation for his next movie, Mank, which premieres on Netflix in a couple of weeks. I've already revisited Se7en and Fight Club, two iconic films that not only profoundly impacted filmmaking but also our culture. However, Zodiac isn't one of Fincher's most popular movies, and maybe that's one of the reasons why I'm watching it for the very first time. Based on a real story, Fincher's first non-fiction adaptation is also one of the longest films of his career. I didn't know anything about the true events before watching this movie, which leads me to the biggest compliment I can offer to this type of film.\r\n\r\nThere are hundreds of characteristics that a viewer can observe, analyze, and through them, ultimately form an overall opinion about a movie. Nevertheless, when it comes to cinematic adaptations of a true story, there's always one aspect that I value tremendously, which is how much the film convinces me to research about its story after I finish watching it. Truth is, midway through Zodiac, I started to acknowledge its lengthy duration. Don't be mistaken. It's not what people call a \"slow movie\", much on the contrary. It's long, yes, but it's packed with non-stop, rapid-fire dialogues that Fincher himself asked the actors to speed up so that the runtime wouldn't stretch even more.\r\n\r\nThroughout the entire film, I feel the exact same manner as the main characters. For the first hour or so, the case is ramping up, the murders increase in quantity, new developments emerge, just like new suspects, letters, ciphers, and everything that comes with dealing with this serial killer. During this period, I feel extremely captivated, but then comes a phase where the characters themselves start to give up due to the lack of concrete evidence to finally convict a suspect. I feel the frustration, depression, and even the infuriating absence of a clear path to the killer. However, Robert Graysmith's (Jake Gyllenhaal) obsession with the case starts becoming my own, and the last thirty minutes are incredibly stressful, frightful, and enthusiastic.\r\n\r\nZodiac possesses 157 minutes, mostly consisting of talking and only a couple of stylish, slow-motion murder scenes, so obviously, this is a dialogue-driven narrative. James Vanderbilt's screenplay is packed with detailed characterization, extensive conversations, and from what I could gather, an impressive historical accuracy. Fincher and Vanderbilt prove their unbelievable commitment with the mind-blowing preparation for this flick, which basically included an entirely unique investigation on the real case (interviewing the people who give life to the movie's protagonists, family members, police departments, witnesses, etc.). Yet another evidence that supports the importance of the pre-production phase in filmmaking.\r\n\r\nSo, in case I forget to answer my own question, Zodiac achieved its primary mission. As soon as the film ended, I found myself googling everything about the real case, trying to find out new information, obsessed with the intriguing story. It doesn't even matter if the viewer loves the movie or not, its impact is undeniable since most people will feel the same urgency to understand more about the real case. Two other attributes deeply contribute to this result: the cast and the editing. The latter is performed by Angus Wall, and his work is some of the best film editing I've ever witnessed. It's the main reason why the huge runtime feels adequate and why the narrative moves so well. No wonder almost every job of his got so many award nominations.\r\n\r\nFinally, the actors are all extraordinary. Mark Ruffalo (Dave Toschi), Anthony Edwards (Bill Armstrong), Robert Downey Jr. (Paul Avery), and Jake Gyllenhaal portray distinct, well-developed characters who deal with the case in their own way. Obsession is definitely the fundamental social theme present in the movie, depicted differently with each character. Armstrong completely moves on and never looks back. Toschi tries to forget, but he can't accept that he failed to do his job. Avery develops a mental condition and/or addiction due to its inability to deal with the pressure, stress, and frustration of reporting the case. Graysmith lets his total obsession over Zodiac impact his personal life, affecting his family in the process.\r\n\r\nFincher is able to represent each and every one of these behaviors in an astonishingly realistic fashion. The use of long uninterrupted takes helps the conversations flow better, and the simple, non-distracting camera work from Harry Savides lets the viewer focus on who they're listening to. It's one of those films which I can't really point out direct flaws. There's that period during the second act where I start to feel tired and worn out, and despite the irreprehensible dedication to providing every single bit of knowledge about the actual events, it's still an enormous amount of information to process, which made me feel a bit lost occasionally. Fortunately, the movie ends strongly, culminating in a simple yet powerful exchange of looks.\r\n\r\nAll in all, Zodiac gains the most generous praise that a film based on a true story can ever receive from me. James Vanderbilt's screenplay convinced me to research everything about the real events as soon as the movie finished, which is undeniably an impactful effect of watching such a well-written, captivating narrative with well-developed, authentic characters. David Fincher's commitment to being as historically accurate as possible is visible on-screen, a remarkable result of a massive preparation that very few filmmakers would even think about performing. With some of the best editing work in the history of cinema, the lengthy runtime flows better than expected, but the amount of information to digest is overwhelming and tiresome, dropping the levels of entertainment, especially during a certain period of the second act. Nevertheless, a phenomenal third act, three outstanding performances from Mark Ruffalo, Robert Downey Jr., and Jake Gyllenhaal, and an emotionally compelling, realistic approach to extreme obsession turn the entire film into one of the best of its genre. Another massive recommendation from this side.\r\n\r\nRating: A-", "created_at": "2020-11-23T17:17:32.477Z"}, {"movie_id": 1949, "review_id": "606be9f844ea54002916ba13", "author_rating": 9.0, "review_text": "A great character driven crime-drama with wonderful performances from Gyllenhaal, Ruffalo and Downey Jr. Been a few years since I last saw this one but decided to give it a re-watch (seen it I think five times now including the rated version in theaters and then DVD). Even though it's 2.75 hours, never gets dull and is engrossing through and through, even if the conclusion might not be accurate. **4.5/5**", "created_at": "2021-04-06T04:56:24.236Z"}, {"movie_id": 1949, "review_id": "63099f38bb070d00843778e7", "author_rating": 4.0, "review_text": "Two years before Zodiac, Capote depicted Truman Capote making a fuss about possibly not having an ending for his seminal true crime novel In Cold Blood. Robert Graysmith, on whose non-fiction books Zodiac is based, had no such qualms, nor did director David Fincher. The comparison may be unfair; Graysmith is no Capote (but then, who is?), and In Cold Blood isn’t a whodunit – though technically neither is Zodiac, since after more than two hours we don’t learn who [has] done it so much as who-a-very-small-group-of-people-think-done-it. In a nutshell, this is a movie about a hunch.\r\n\r\nThe film would work better (and that’s not to say it doesn’t work at all) if it were, like Capote, about a man obsessed with a crime and those who have committed it – especially considering that the Zodiac killings constitute arguably the most famous unsolved murder case in American history; unfortunately, Fincher is what James Randi would have called a true believer, and Zodiac leaves little doubt that the director is as persuaded that Arthur Leigh Allen (John Carroll Lynch) was the Zodiac as he is that Herman Mankiewicz singlehandedly wrote the script for Citizen Kane.\r\n\r\nZodiac is a better movie than Mank, however, because Fincher was more in possession of his faculties in 2007 than in 2020; accordingly, the former film makes a more coherent and convincing case for its thesis than does the latter (and even this we can attribute to the credibility of a very deep roster of skilled supporting players in addition to the rock-solid core of leading men-cum-character actors in the most prominent roles), although it still boils down to a ‘what if?’ scenario. So flimsy in fact is the entire house of cards that the story ends – or rather comes to a halt (lacking, as noted above, a logical conclusion) – on a fallacious note: “Just because you can't prove it, doesn't mean it's not true.” It’d be a lot more reassuring if you could, though.", "created_at": "2022-08-27T04:36:08.503Z"}, {"movie_id": 1949, "review_id": "5cedc289c3a3685e8726b0e4", "author_rating": 9.0, "review_text": "Peerless precision from Fincher.\r\n\r\nI have seen it written that this film shows that Fincher had grown up, and whilst I understand that train of thought, it simply isn't true. What Fincher has done is give a true story his meticulous care and standard deft precision by leaving no stone unturned. We get simply one of the (if not thee) best films to deal with the investigating process of a high profile serial killer, a film that as a character study is actually essential viewing in the pantheon of genre productions.\r\n\r\nThe devilish greatness of this film is in the fact that it can't pay off with a pandering mainstream ending, the makers are telling a true story and any sort of research will lead viewers to the fact that there is no twist here, no joyous ticket selling round of applause at this ending, it is what it is, frustratingly brilliant. The case the film is about consumes all involved with it, and to see how it affects those involved is engrossing (yet sad) because if the viewer is so inclined to jump on board then it will consume you as well, the film and the actors within demand you see this for the affecting character piece it is.\r\n\r\nThe acting here gives me hope that classic acting is alive and well in this generation, I was once not enamoured with Mark Ruffalo in his early days as an actor, but here he puts such heartfelt verve into the role of David Toschi I felt I need to send him a written apology!. Robert Downey Junior is joyous as Paul Avery, all 60s chic and swagger without tipping over the edge of the mountain caricature (both men to become future Avengers of course). Yet surprisingly to me I found that it is Jake Gyllenhaal as Robert Graysmith who is the film's key axis, the central heartbeat, with a performance that demands undivided attention, a performance brought about by Fincher's quest for perfection from everything to do with film making. Gyllenhaal hated working on the film, he hated Fincher's work ethic, but in time he must now look back and see that here the director coaxed out a performance that has in time been seen as not only great, but also beneficial to his career (hello Nightcrawler).\r\n\r\nThis is not Se7en 2, and British film mags like Empire should have known better than to use that tag line to get the readers' attention, because fans of serial killer thrillers need not apply here, fans of outstanding cinema about the human psyche during the pursuit of a serial killer - Well get in line folks, for this is one of the best movies of the decade. 10/10", "created_at": "2019-05-28T23:21:45.746Z"}, {"movie_id": 1949, "review_id": "5fbbeeac06f984003d6a254c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me closely for the past week, I'm currently (re)watching five of David Fincher's films in preparation for his next movie, Mank, which premieres on Netflix in a couple of weeks. I've already revisited Se7en and Fight Club, two iconic films that not only profoundly impacted filmmaking but also our culture. However, Zodiac isn't one of Fincher's most popular movies, and maybe that's one of the reasons why I'm watching it for the very first time. Based on a real story, Fincher's first non-fiction adaptation is also one of the longest films of his career. I didn't know anything about the true events before watching this movie, which leads me to the biggest compliment I can offer to this type of film.\r\n\r\nThere are hundreds of characteristics that a viewer can observe, analyze, and through them, ultimately form an overall opinion about a movie. Nevertheless, when it comes to cinematic adaptations of a true story, there's always one aspect that I value tremendously, which is how much the film convinces me to research about its story after I finish watching it. Truth is, midway through Zodiac, I started to acknowledge its lengthy duration. Don't be mistaken. It's not what people call a \"slow movie\", much on the contrary. It's long, yes, but it's packed with non-stop, rapid-fire dialogues that Fincher himself asked the actors to speed up so that the runtime wouldn't stretch even more.\r\n\r\nThroughout the entire film, I feel the exact same manner as the main characters. For the first hour or so, the case is ramping up, the murders increase in quantity, new developments emerge, just like new suspects, letters, ciphers, and everything that comes with dealing with this serial killer. During this period, I feel extremely captivated, but then comes a phase where the characters themselves start to give up due to the lack of concrete evidence to finally convict a suspect. I feel the frustration, depression, and even the infuriating absence of a clear path to the killer. However, Robert Graysmith's (Jake Gyllenhaal) obsession with the case starts becoming my own, and the last thirty minutes are incredibly stressful, frightful, and enthusiastic.\r\n\r\nZodiac possesses 157 minutes, mostly consisting of talking and only a couple of stylish, slow-motion murder scenes, so obviously, this is a dialogue-driven narrative. James Vanderbilt's screenplay is packed with detailed characterization, extensive conversations, and from what I could gather, an impressive historical accuracy. Fincher and Vanderbilt prove their unbelievable commitment with the mind-blowing preparation for this flick, which basically included an entirely unique investigation on the real case (interviewing the people who give life to the movie's protagonists, family members, police departments, witnesses, etc.). Yet another evidence that supports the importance of the pre-production phase in filmmaking.\r\n\r\nSo, in case I forget to answer my own question, Zodiac achieved its primary mission. As soon as the film ended, I found myself googling everything about the real case, trying to find out new information, obsessed with the intriguing story. It doesn't even matter if the viewer loves the movie or not, its impact is undeniable since most people will feel the same urgency to understand more about the real case. Two other attributes deeply contribute to this result: the cast and the editing. The latter is performed by Angus Wall, and his work is some of the best film editing I've ever witnessed. It's the main reason why the huge runtime feels adequate and why the narrative moves so well. No wonder almost every job of his got so many award nominations.\r\n\r\nFinally, the actors are all extraordinary. Mark Ruffalo (Dave Toschi), Anthony Edwards (Bill Armstrong), Robert Downey Jr. (Paul Avery), and Jake Gyllenhaal portray distinct, well-developed characters who deal with the case in their own way. Obsession is definitely the fundamental social theme present in the movie, depicted differently with each character. Armstrong completely moves on and never looks back. Toschi tries to forget, but he can't accept that he failed to do his job. Avery develops a mental condition and/or addiction due to its inability to deal with the pressure, stress, and frustration of reporting the case. Graysmith lets his total obsession over Zodiac impact his personal life, affecting his family in the process.\r\n\r\nFincher is able to represent each and every one of these behaviors in an astonishingly realistic fashion. The use of long uninterrupted takes helps the conversations flow better, and the simple, non-distracting camera work from Harry Savides lets the viewer focus on who they're listening to. It's one of those films which I can't really point out direct flaws. There's that period during the second act where I start to feel tired and worn out, and despite the irreprehensible dedication to providing every single bit of knowledge about the actual events, it's still an enormous amount of information to process, which made me feel a bit lost occasionally. Fortunately, the movie ends strongly, culminating in a simple yet powerful exchange of looks.\r\n\r\nAll in all, Zodiac gains the most generous praise that a film based on a true story can ever receive from me. James Vanderbilt's screenplay convinced me to research everything about the real events as soon as the movie finished, which is undeniably an impactful effect of watching such a well-written, captivating narrative with well-developed, authentic characters. David Fincher's commitment to being as historically accurate as possible is visible on-screen, a remarkable result of a massive preparation that very few filmmakers would even think about performing. With some of the best editing work in the history of cinema, the lengthy runtime flows better than expected, but the amount of information to digest is overwhelming and tiresome, dropping the levels of entertainment, especially during a certain period of the second act. Nevertheless, a phenomenal third act, three outstanding performances from Mark Ruffalo, Robert Downey Jr., and Jake Gyllenhaal, and an emotionally compelling, realistic approach to extreme obsession turn the entire film into one of the best of its genre. Another massive recommendation from this side.\r\n\r\nRating: A-", "created_at": "2020-11-23T17:17:32.477Z"}, {"movie_id": 1949, "review_id": "606be9f844ea54002916ba13", "author_rating": 9.0, "review_text": "A great character driven crime-drama with wonderful performances from Gyllenhaal, Ruffalo and Downey Jr. Been a few years since I last saw this one but decided to give it a re-watch (seen it I think five times now including the rated version in theaters and then DVD). Even though it's 2.75 hours, never gets dull and is engrossing through and through, even if the conclusion might not be accurate. **4.5/5**", "created_at": "2021-04-06T04:56:24.236Z"}, {"movie_id": 1949, "review_id": "63099f38bb070d00843778e7", "author_rating": 4.0, "review_text": "Two years before Zodiac, Capote depicted Truman Capote making a fuss about possibly not having an ending for his seminal true crime novel In Cold Blood. Robert Graysmith, on whose non-fiction books Zodiac is based, had no such qualms, nor did director David Fincher. The comparison may be unfair; Graysmith is no Capote (but then, who is?), and In Cold Blood isn’t a whodunit – though technically neither is Zodiac, since after more than two hours we don’t learn who [has] done it so much as who-a-very-small-group-of-people-think-done-it. In a nutshell, this is a movie about a hunch.\r\n\r\nThe film would work better (and that’s not to say it doesn’t work at all) if it were, like Capote, about a man obsessed with a crime and those who have committed it – especially considering that the Zodiac killings constitute arguably the most famous unsolved murder case in American history; unfortunately, Fincher is what James Randi would have called a true believer, and Zodiac leaves little doubt that the director is as persuaded that Arthur Leigh Allen (John Carroll Lynch) was the Zodiac as he is that Herman Mankiewicz singlehandedly wrote the script for Citizen Kane.\r\n\r\nZodiac is a better movie than Mank, however, because Fincher was more in possession of his faculties in 2007 than in 2020; accordingly, the former film makes a more coherent and convincing case for its thesis than does the latter (and even this we can attribute to the credibility of a very deep roster of skilled supporting players in addition to the rock-solid core of leading men-cum-character actors in the most prominent roles), although it still boils down to a ‘what if?’ scenario. So flimsy in fact is the entire house of cards that the story ends – or rather comes to a halt (lacking, as noted above, a logical conclusion) – on a fallacious note: “Just because you can't prove it, doesn't mean it's not true.” It’d be a lot more reassuring if you could, though.", "created_at": "2022-08-27T04:36:08.503Z"}]