[{"movie_id": 460465, "review_id": "6073dd204d0e8d0043061b63", "author_rating": 10.0, "review_text": "I will be short. You should understand how hard to make movies based on such a legendary universe (expectation is too high!), with a lot of characters that need screen time, and with limited budget, PLUS in a pandemic situation, - the director made a great job.\r\n\r\nThis is the best adaptation of such a legendary title.", "created_at": "2021-04-12T05:39:44.021Z"}, {"movie_id": 460465, "review_id": "608203c52b8a430029d0a07d", "author_rating": null, "review_text": "Mortal Kombat Gives Fans Of The Franchise The Brutal Live-Action Version They Deserve\r\nFans of the Mortal Kombat series have known that the path to bringing the violent and controversial game to live-action formats has been a mixed bag. While the first film in 1995 was a decent hit; the follow-up in 1997 disappointed fans who had grown weary of the PG-13 take on the series.\r\n\r\nSubsequent efforts such as the 2011 television series also left fans wanting more; especially since the game series had become even more graphic and violent.\r\n\r\nAn animated film released in 2020 gave fans a taste of what they wanted as it featured graphical violence which many fans believed was essential to properly catch the spirit and action of the series.\r\n\r\nThe latest offering in the series “Mortal Kombat”; reboots the cinematic universe and gives fans the intense, brutal, and graphic violence that they have demanded. The film keeps the basic premise that the Outworld realm has won nine tournaments in a row, and based on the ancient laws; one more victory would allow them to take control of the Earth.\r\n\r\nRaiden the Thunder God (Tadanobu Asano); who has been tasked with protecting Earth looks to assemble and train a band of champions to save Earth. Naturally, this is not going to be easy as Shang Tsung (Chin Han); is not willing to follow the rules of the tournament and dispatches his top fighter (Sub Zero (Joe Taslim) to dispatch the champions of Earth before the tournament in a clear violation of the rules in order to ensure total victory.\r\n\r\nWhat follows is solid and very graphic action which contains gore and brutality on a level that almost kept the film from earning an R-rating. The action sequences are well-choreographed and there were some great recreations of classic moves by characters from the game series which were really well utilized and did not seem like gratuitous pandering.\r\n\r\nWhile the plot is fairly simplistic and does not deviate greatly from the source material; it does give a larger backstory to the universe. It was really enjoyable to see many nods to the franchise throughout both subtle and overt and while some characters were glaringly absent which was a surprise; the characters that were included were really solid to see and the door was wide open for their inclusion at a later date.\r\n\r\nWhile the cast does not contain any star power in terms of what Western audiences might expect from a major studio release; the ensemble works well and do a great job in bringing their characters to life.\r\n\r\nThe film leaves sequels wide open and teases a character that in my opinion was a glaring omission from the film. That being said; “Mortal Kombat” gives fans a solid adaptation that does not shy away from gore and violence and gives fans the cinematic experience that they have wanted.\r\n\r\n3.5 stars out of 5", "created_at": "2021-04-22T23:16:21.703Z"}, {"movie_id": 460465, "review_id": "60847e545c3247007764906c", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEven though I consider myself somewhat of a gamer, I was never the biggest fan of the Mortal Kombat games, probably because I never really knew how to play them. Besides occasional visits to my neighbor's house to play several games on his PlayStation 1 (or 2?), I've only played this game on the nostalgic arcade machines that gave me incredible joy when I was younger. In all honesty, I don't exactly remember if I watched the previous film adaptations of the popular franchise, but I do know that both didn't receive the best feedback from critics and audiences, especially the 1997's flick. Therefore, I went to the theater - first time in over four months - with no real expectations. I just hoped the action would compensate for the predictably flawed screenplay.\r\n\r\nAll in all, I'm surprised at how much I actually had fun with this movie. Considering this is Simon McQuoid's feature directorial debut, as well as Greg Russo's first screenplay credit, my hopes rested on Dave Callaham's previous works (Wonder Woman 1984, Zombieland: Double Tap) and on the gory, violent action sequences. The latter component is the best element in the entire film, which will definitely leave the viewers in search of action-heavy entertainment satisfied. The opening sequence shows the merciless brutality of each fight through phenomenal stunt work (Hiroyuki Sanada is impressively talented), long takes with exceptional choreography, and a shocking amount of blood - something quite characteristic of the game franchise.\r\n\r\nThe only negative aspect about this opening is the fact that no other action scene surpasses it, which doesn't mean that the rest of the battles fail to live up to the expectations of the most avid fans. Despite a few shaky, roughly edited scenes, the vast majority of the fights are easy to follow and feature jaw-dropping moments, such as the \"Fatality!\" finishing moves. McQuoid and his team of writers try to make the movie understandable and exciting to everyone, but if there's a chance of placing a reference, an Easter Egg, or something alike, they proudly and unrestrainedly present it to the audience, which will trigger the most hardcore fans to let go of a resounding, adrenaline-fueled \"YEAH!\".\r\n\r\nI admit that I didn't expect the film to deliver those epic announcements from the game. From \"Flawless Victory!\" to \"Fatality!\", without forgetting the classic \"Fight!\", I did smile during these moments, where the actors actually change the tone of their voice to mimic the famous one-liners. Is it extraordinarily cheesy and over-the-top? Of course. Would any fan want it any other way? It might be a tad too much for some viewers, but I have to compliment McQuoid for fully committing to this adaptation. There's no ounce of shame, regret, or restraint. It's a movie made with a passionate public in mind, and I wholeheartedly recommend it to every single fan of the games.\r\n\r\nI firmly believe people will end up liking or disliking this film based on how much the action compensates for the lack of a compelling story, which is something even the most enthusiastic fans are probably anticipating as well. From a couple of nonsensical narrative decisions to hollow, uninteresting characters, the screenplay is solely focused on explaining everything surrounding Mortal Kombat - Earthworld, Outworld, champions, stakes, rules of the tournament - through lazy yet admittedly efficient exposition scenes. The characters could have been better developed, and the actors are far from being completely convincing. However, no one will enter the theater or click \"play\" on HBO Max expecting to witness an Oscar-worthy story...\r\n\r\nMortal Kombat is a surprisingly decent adaptation of the popular franchise, which will leave the most hardcore fans quite satisfied. For viewers with no experience or knowledge about the games, it could be a tough watch. However, if all the audience seeks is action-heavy entertainment, then Simon McQuoid's directorial debut fulfills the more reasonable expectations. Packed with references that even the least avid gamers will recognize, the fighting scenes are mostly well-filmed and quite energetic, focusing more on the gruesome, bloody, jaw-dropping Fatalities. Despite the opening sequence being the peak of great action, there are a couple of moments that could be compared to some parts of that epic start. Story-wise, Greg Russo and Dave Callaham's screenplay is as flawed as expected, possessing ridiculous developments and an abundance of dull exposition scenes, but it's the underwhelming use of a few interesting characters that negatively impacts the movie the most. In the end, I definitely recommend it to fans of the franchise, who will surely appreciate this film a lot more than myself.\r\n\r\nRating: B-", "created_at": "2021-04-24T20:23:48.438Z"}, {"movie_id": 460465, "review_id": "6084a79a8d22fc003f1c11de", "author_rating": 7.0, "review_text": "I liked this more than I should have.  \r\n\r\nI have tried the games, but am not into the fighting genre of games (although the Injustice series grabbed me for its story).  The previous movies were fun and didnt take themselves seriously - which was good, but they got too hammy and over the top.  The last cartoon took itself way to seriously and was disappointing and forgettable to say the least.  \r\n\r\nThis movie, however seemed to grab everything good from the previous attempts, added actors who know some martial arts, used some of the key terms and moves from the games and had a stand out performance from Josh Lawson as Kano adding the 'very dry type of  Australian' humour.  Hell, the score was even good.  \r\n \r\nGiven that this is pretty much the same as the game - 10-12 fights some spectacular fatalities and a basic plot with no character development - this was a very fun way to spend 2 hours.", "created_at": "2021-04-24T23:19:54.151Z"}, {"movie_id": 460465, "review_id": "608c456f66469a00428df802", "author_rating": 5.0, "review_text": "Fluff entertainment at its most bland. The fighting is pretty forgettable but at least they utilized the R rating for some decent gore that honors the game at least. Acting is at best so-so while the dialogue was pretty bad and it probably 10-15 minutes too long. Can't say I'll remember this but for what it is, it's fine as a time-waster. **2.75/5**", "created_at": "2021-04-30T17:59:11.344Z"}, {"movie_id": 460465, "review_id": "6099654b72a2c9003e33c4f2", "author_rating": 10.0, "review_text": "Okay so let's start by saying I wasn't exactly sure what to think going into this movie I didn't know what was going to happen but wow this is one of the best action films of the decade so far yeah it started slow but really was a good full time of excitement", "created_at": "2021-05-10T16:54:35.282Z"}, {"movie_id": 460465, "review_id": "60e750acb76cbb00461c9fbd", "author_rating": 6.0, "review_text": "OK LETS start off with if you have not watched the latest animations of mortal kombat this will movie will make you feel abit effy. You will need more background on the actual characters you know from previous movies and those you don't. and the True scorpion and sub zero animation also covers alot. Good fighting movie though. Shouting GET OVER HERE!!!!!!and FINISH HIM haha it makes a person feel like you part of it.", "created_at": "2021-07-08T19:23:24.122Z"}, {"movie_id": 460465, "review_id": "62dfa6ae1dbc88067315f7f6", "author_rating": 5.0, "review_text": "I've played Mortal Kombat since it first came out. I watched the original movies in the theaters. I had high hopes that maybe a reboot would make it feel fresh and maybe establish it as a darker genre like the games are.\r\n\r\nThe only saving grace in this film is the Scorpion and Sub-Zero Feud. I felt disconnected from Raiden and Shang Tsung because they were so emotionless and hollow. I did like who they got to play Kabal because I felt like that character was really well-written. I usually don't like Sonya Blade but this movie made me like her. I don't like Liu Kang I never will so it didn't much matter who they cast in that role because that character to me is too generic. I did not care one way or another for Kung Lao or Kano. The guy playing Jax has been the best Jax so far. I hate how they made Milenna look in this one and it just didn't suit the purpose of what her character really is. Goro felt copied and pasted from the original film.\r\n\r\nAll in all this could have been much better but I doubt we get to see anything past this due to how generic and unfeeling this film actually felt. Sad excuse for a Mortal Kombat reboot.", "created_at": "2022-07-26T08:32:46.806Z"}, {"movie_id": 460465, "review_id": "630becdd0398ab007d7798f2", "author_rating": 1.0, "review_text": "Mortal Kombat is not just too long for a movie based on a fighting video game; it’s actually too dumb to even be a movie based on a fighting video game. On the one hand it does a Resident Evil, introducing a new character and making him the hero, instead of giving this role to an already established character – preferably one that is, you know, popular among the franchise’s fan base.\r\n\r\nAnd on the other hand, it dips into the same old MK well, kicking off with the Hanzo Hasashi Family Massacre – Kombat’s equivalent of the biblical Massacre of the Innocents. Only last year the animated Mortal Kombat Legends: Scorpion's Revenge covered the exact same ground, and did it a lot better. The intertitle that follows the prologue confirms that we are not about to see anything new (Earthrealm blahblahblah Tournament blahblahblah Outworld blahblahblah).\r\n\r\nMK21 contains exactly (sub)zero surprises. The first time we see Jax, we know he is going to lose his original arms and have them replaced with cybernetic prosthetics (the only surprising thing about this is that the character's first replacement arms are quite underwhelming. Jax eventually gets something more in line with what we’re used to; the question is, why does the movie do in three steps what it should do in two?). Similarly, Kano's true, treacherous nature is no secret.\r\n\r\nWe already know all this. We know it like the backs of our hands. If we don't know it from playing the game, we know it from watching the 1995 movie – speaking of which, MK95 is 10 minutes shorter (it wasted little time with pre-Tournament antics, and it didn’t even bother with a Training Montage; in contrast, MK21 includes what is best described as a tutorial, not the way you want to go about evoking a video game feel), which is to say 10 minutes better. It also had better effects; its Goro was clumsy and awkward – something like the Cryptkeeper on stereoids – but when Johnny Cage punched him in the balls, I felt it. Conversely, when Cole (Lewis Tan), the aforementioned brand-new character, fights Goro in MK21, it’s like he’s shadowboxing, and his shadow happens to be a four-armed man-mountain of pixels.\r\n\r\nAll things considered, what’s the point of watching a movie where we can anticipate every important event, and anything we don’t see coming a mile away turns out to be unnecessary? For example, it's cool – pun intended – when Sub-Zero makes it hail, but that’s just a gimmick – nothing more than smoke and mirrors.", "created_at": "2022-08-28T22:31:57.632Z"}, {"movie_id": 460465, "review_id": "63be05b1fc31d3008bcfd2d5", "author_rating": 1.0, "review_text": "OK... my wife is the Mortal Kombat fan of the family, and the fighting game fan of the family. So this should really be her review... because I'm just going to trash it.\r\n\r\nThe problem here is plot, as in they actually tried to add in a real plot. Mortal Kombat is a fighting game. You play it to peacefully beat your friends to a bloody pulp... and that is where the fun is.\r\n\r\nBut they added a plot.\r\n\r\nIn Twister, the star of the show was the tornado. The plot was there to move the view from tornado to tornado. And in Back Draft, it was the same... with fire.\r\n\r\nMortal Kombat thought it had to be deep. It thought it had to be something more than it a tournament. It thought the characters had to have more than surface level depth.\r\n\r\nTHE DIDN'T.\r\n\r\nThe Tournament should have been the star. The plot should have only been there to move you from fight to fight with a climax that shouted \"FATALITY!\" and left it at that.\r\n\r\nInstead they tried to add depth where no depth was needed... and that killed the fun of Mortal Kombat.\r\n\r\nNot every movie needs to have a plot and characters, some movies work best as mindless popcorn munching escapism.", "created_at": "2023-01-11T00:41:21.142Z"}, {"movie_id": 460465, "review_id": "63c170d5a5743d00b0bf662c", "author_rating": 6.0, "review_text": "<b>Mortal Kombat shows off some amazing design and stunt work, but the writing keeps it from everything fans wanted it to be. Hopefully, the sequel will learn from these shortcomings.</b>\r\n\r\nI would be lying if I said Mortal Kombat (2021) was everything I had hoped. But I also enjoyed it and hope the sequel does happen someday soon.\r\n\r\n<blockquote><b>Pros:</b>\r\n* The character roster was pretty big for a first outing, and I appreciated seeing so many of my favorites right off the bat.\r\n* The costuming and aesthetics were stunning. I immediately recognized each character because their designs held true to the games while still being updated and modernized. The attention to detail was incredible.\r\n* Josh Lawson surprised, making Kano undoubtedly the most entertaining part of this movie.\r\n* Casting some true martial artists like Joe Taslim and Hiroyuki Sanada gave the action more skill and grit.\r\n* The R rating was the right fit for Mortal Kombat, allowing the gore-filled fatalities fans have come to love in the games.\r\n\r\n</blockquote><blockquote><b>Cons:</b>\r\n* With a massive payer of characters to choose from in the Mortal Kombat universe, the addition of Lewis Tan’s Cole Young was unnecessary and annoying. A dozen existing characters could have served as the audience’s perspective.\r\n* Adapting a fantastical and violent video game to a feature film is no simple task. However, Kevin Tancharoen perfectly grounded the Mortal Kombat story while keeping the magic and fantasy roots in Mortal Kombat: Legacy (2011). Unfortunately, Simon McQuoid struggled with that balance, resulting in a script that felt like the CW team wrote.\r\n* The whole Arcana superpower thing stripped the need for skill from some of the fighters, becoming a disappointing dues ex machina. I would have preferred better writing.</blockquote>\r\n\r\nAll in all, there were more pros than cons, but the cons took what could have been great and made it decent. All the pros give me hope that Mortal Kombat 2 can fix the cons and make a much better sequel. Fingers crossed!", "created_at": "2023-01-13T14:55:17.648Z"}]