[{"movie_id": 693827, "review_id": "6109d4819590e300458d9ec0", "author_rating": 5.0, "review_text": "Done a million times and better. So sad to see two of the greatest, Harvey Keitel and Sam Worthington, get wasted in this drivel. The producers can take their \"based on true events\" tagline and shove it up their cunts. No one cares what's made up and what's not it is supposed to be entertaining. This was a horrible bore fest.", "created_at": "2021-08-03T23:42:57.102Z"}, {"movie_id": 693827, "review_id": "622a1ea76d1bb2001d93ea38", "author_rating": 10.0, "review_text": "One of the best movies I’ve seen in a while. An emotional odyssey that plays on the expectation of who Lansky was and adds layers to him.", "created_at": "2022-03-10T15:52:07.347Z"}, {"movie_id": 693827, "review_id": "622a208cd236e6006df98e0b", "author_rating": 10.0, "review_text": "Harvey Keitel -- probably as old as we are likely to ever see him, but no less a master of his craft -- stars as Meyer Lansky in \"Lansky.\"\r\n\r\nIt's about as exciting as sneaking up on a glass of tepid water, action-wise -- but a straight telling, with Lansky there to tell the story to \"himself\" -- made it more than worthwhile for grudging admirers of Organized Crime, and also fans of Harvey Keitel, of which I am massive.\r\n\r\nKeitel's monologue during the Grand Budapest Hotel concerning \"two poodles and blonde on a walk in the park\" when Keitel suddenly erupts as the Mastermind Genius Inmate of Station 19 is one of the funniest surprises of that very funny movie.\r\nThis movie is certainly no rival for Grand Budapest because so few are, but just seeing Keitel playing it straight for one of the biggest (and most prosecution-proof) gambling racketeers of the 20th Century at a very late stage in his career is its own kind of fun.\r\nGreat intimate portraiture.", "created_at": "2022-03-10T16:00:12.714Z"}, {"movie_id": 693827, "review_id": "62d9d82cbd3209004d552fa2", "author_rating": 10.0, "review_text": "Loved this one, am sure anyone who enjoys history related to The organized crime in the US would feel the same.", "created_at": "2022-07-21T22:50:20.695Z"}]