[{"movie_id": 11849, "review_id": "5aa802b8c3a36839cb020cdf", "author_rating": 5.0, "review_text": "Campy, amusing heroic fantasy with – you guessed it – dungeons and dragons.\r\n\r\nRELEASED IN 2000 and directed by Courtney Solomon, \"Dungeons & Dragons\" chronicles events in the kingdom of Izmer where the idealistic Empress (Thora Birch) advocates equality between the mages and commoners while the power-mad Profion (Jeremy Irons) plots to overthrow the Empress with the help of his formidable henchman Damodar (Bruce Payne). A ragtag team is assembled to save Izmer by apprehending the Eye of the Dragon: Two thieves (Justin Whalin and Marlon Wayans), a beautiful mage apprentice (Zoe McLellan), a dwarf (Lee Arenberg) and an elf girl (Kristen Wilson).  \r\n \r\nThe first shot with Irons hamming it up as the diabolical Profion made me bust out laughing. In other words, the movie telegraphs from the get-go that it’s not to be taken seriously. If you can roll with the campiness, this is an amusing throwaway fantasy flick. Imagine the gaudiness of “Star Wars” (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you’d have a good idea of what “Dungeons & Dragons” has to offer. \r\n\r\nThis was a theatrical release that cost a whopping $45 million, but totally bombed at the box office. The 2005 sequel “Wrath of the Dragon God” (with only Bruce Payne returning as Damodar) cost just $15 million and is slightly better because the creators took the material seriously, but it’s decidedly TV fantasy fare.\r\n\r\nThe film scores pretty well on the female front with the winsome McLellan and cutie Birch. Whalin and Wayans are entertaining as the two main protagonists, if you can get past their goofiness. People love to hate Snails (Wayans), but I found him to be a likable, amusing character.                                 \r\n\r\nTHE MOVIE RUNS 1 hour 47 minutes and was shot in the Czech Republic (Kutná Hora and Prague). WRITERS: Topper Lilien and Carroll Cartwright.  \r\n\r\nGRADE: C", "created_at": "2018-03-13T16:56:24.271Z"}, {"movie_id": 11849, "review_id": "64ecc2dd5258ae00c94d9d22", "author_rating": 5.0, "review_text": "I saw this at the time it was released in 2000, and I couldn't quite fathom how Oscar winning Jeremy Irons (\"Profion\") ever found his way onto the screen for this nonsense. The whole thing centres around his megalomaniacal desire to depose the Empress (a shockingly wooden Thora Birch) and seize her sceptre that controls the white dragons. She's having none of that, so he must now seek out the red \"Rod of Savina\" via his menacing henchman \"Damodar\" (Bruce Payne) for that controls the red ones. Meantime petty thieves \"Ridley\" (Justin Whalin) and his pal \"Snails\" (Marlon Wayans) manage to get embroiled in the plot after a visit to the House of Magic goes a bit awry. The scene is now set for some silly, set-piece escapades with some basic special effects, a daft cameo from Richard O'Brien (reappraising his \"Adventure Game\" performance) and, well you get the drift. It's poor, this - but I didn't hate it. There is a bit of fun being had, Whalin is easy enough on the eye and the whole thing has it's tongue so firmly planted in it's cheek that it is hard to actually dislike it - especially at the end when Iron hits super-ham mode and the dragons all take flight. Sure, the dialogue is daft but somehow that just didn't matter. Despite myself, I quite enjoyed this....", "created_at": "2023-08-28T15:53:01.366Z"}]