[{"movie_id": 361743, "review_id": "628e79eb1a32483b62466c62", "author_rating": 9.0, "review_text": "What an excellent sequel - I, in fact, like it more than its predecessor.\r\n\r\n<em>'Top Gun: Maverick'</em> is fantastic, simply put. I was expecting it to be good, but it's actually much more enjoyable than I had anticipated. The callbacks to the original are expertly done, the new characters are strong/well cast, it has plenty of meaning, music is fab and the action is outstanding - the aerial stuff is sensational.\r\n\r\nThe story is superb, with each high stake coming across as intended - parts even gave me slight goosebumps, which is a surprise given I'm not someone who has a connection to the 1986 film. It's all super neatly put together, I honestly came close to giving it a higher rating.\r\n\r\nTom Cruise is brilliant as he reprises the role of Maverick, while Miles Teller comes in and gives a top performance. Jennifer Connelly is another positive, though her role does kinda feel a tiny bit forced in order to have a love interest; given Kelly McGillis' [unexplained] absence.\r\n\r\nMonica Barbaro stands out most from the fresh faces, though I actually did enjoy watching them all - which is something I thought the film may struggle with, adding new people, but it's done nicely; sure Jon Hamm and Glen Powell are a little cliché, though overall I approve.\r\n\r\nA great watch - I'd highly recommend it, though naturally would suggest watching the previous film first if you haven't already.", "created_at": "2022-05-25T18:48:11.776Z"}, {"movie_id": 361743, "review_id": "6291388cd48cee0f2ab6246f", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/top-gun-maverick-spoiler-free-review\r\n\r\n\"Top Gun: Maverick is the return of pure, nostalgic blockbusters, instantly becoming one of this year's personal favorites. The best aerial action sequences ever amaze even the highest expectations, not only due to the absolutely insane real stunts but largely because of the flawless contribution of all filmmaking elements.\r\n\r\nThe surprisingly emotional screenplay helps Tom Cruise deliver one of the best performances of his career. Perfect editing is essential to creating such realism, as well as raising the tension levels for one of the best final acts within the respective genre.\r\n\r\nAnd, finally, the memorable score loaded with epic tracks makes the theater experience the only way this magnificent work should be seen.\r\n\r\nSuperior to the original in every way.\"\r\n\r\nRating: A-", "created_at": "2022-05-27T20:46:04.171Z"}, {"movie_id": 361743, "review_id": "629181017d5db510a72f8efc", "author_rating": 5.0, "review_text": "A lot of things in this movie do not make sense, like \"why not use F-35?\", \"why didn't cruise missiles target enemy air defence and planes in hangars?\" to name a few. \r\n\r\nThe original movie had some seriousness built into it, the sequel I think is closer to a comic book movie. Very similar to the original star wars, especially the action sequence at the end. Just a tad more realistic than black widow, you can clearly see the action comedy style of Marvel movies.\r\n\r\nI think a lot of conservatives reminiscing Reagan years would watch it, that should be enough to make it a hit.\r\n\r\nI think that is also the reason of the high score. To me the movie quality is more of 5 ~ 7 out of 10.\r\n\r\nJust don't think too much when watching it, but I don't think that is too big a problem for the target audience.", "created_at": "2022-05-28T01:55:13.438Z"}, {"movie_id": 361743, "review_id": "629470aca44d090067b777ba", "author_rating": 7.0, "review_text": "It seems like I have been watching the trailers for this film for years now - and you know what? Yes - it was worth the wait. The film is all about some truly exhilarating aerial photography that culminates in some super dogfighting and a good old dose of nostalgia. Tom Cruise is very much in his element as the ageing - and frequently not afraid to look it - eponymous \"Top Gun\" pilot drafted in by a rather sceptical admiral to train up a new squad for a very perilous mission to destroy an underground uranium enrichment facility. The team arrive - full of hormones - and he must whip them into shape, a task made more difficult by the presence of \"Rooster\" (Miles Teller) who is the son of his old mate \"Goose\" who came to a sticky end last time out in 1986. He also gets to rekindle his romance with bar owner \"Penny\" (Jennifer Connelly) whilst all under the protection of his former wingman, now the poorly retired admiral \"Kazansky\" (Val Kilmer). To be honest, the story isn't really up to much - there are some twists and turns, the script is not without some humour but there is no jeopardy really. We all know what is going to happen in the end. That said, though, everyone is on good form; the pace (aside from the interludes with Connelly which do rather abruptly slow things down a bit) is consistently action packed and the imagery from both inside and outside of these amazing pieces of machinery is not at all repetitive and is compelling to watch. Even the usual gung-ho, ye-ha stuff is kept to a minimum - this is a superior film depicting the US military at it's most competitive, but also at it's most intelligent - and I really quite enjoyed it. Big screen photography - don't wait til it is on the telly.", "created_at": "2022-05-30T07:22:20.417Z"}, {"movie_id": 361743, "review_id": "6298c0207e12f02c82337cbb", "author_rating": 6.0, "review_text": "_Top Gun: Maverick_ is a sequel that is a leaps and bounds improvement over the original film. There’s better acting from the entire cast, more of an emotional attachment between at least two of the main characters in the film, and subtle humor that actually lands. But the film’s constant need to fly in the same flight pattern as the original film comes off as more of a restraint than a fond recollection.\r\n\r\nThe sequel seems to highlight many of the shortcomings of the original film, which in retrospect seems like something you’d try to avoid. With its record breaking box office during Memorial Day weekend, _Top Gun: Maverick_ is an enormously thrilling sequel with unparalleled action sequences that has proven to be exactly what fans have been waiting over 30 years for.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Top-Gun-Maverick-2022-Review-Dont-Think-Just-Sequel", "created_at": "2022-06-02T13:50:24.192Z"}, {"movie_id": 361743, "review_id": "629e44ae7d5db5086bea758c", "author_rating": null, "review_text": "💯 Best movie I've seen this year. You won't be disappointed.", "created_at": "2022-06-06T18:17:18.351Z"}, {"movie_id": 361743, "review_id": "62b0614f568463006125f78a", "author_rating": 10.0, "review_text": "Haven't seen a movie this perfect in decades. It was most obviously written and directed with the audience in mind - no politics, no preaching, no gratuitous sex, no woke, no offensive casting or characters. Brilliant, simplistic screenwriting and thrill rides. The original, if you've seen it, was iconic as it was, and to know it makes the second film here more enjoyable, but even if you're not familiar with the background of the characters it's clearly presented enough to be a stand-alone enjoyable film.", "created_at": "2022-06-20T12:00:15.969Z"}, {"movie_id": 361743, "review_id": "62be35db28723c007c11d7f9", "author_rating": 10.0, "review_text": "> Loved this movie.  Even had me guessing to the end.  Seems like every cast member picked to play their role was the only person that could pull it off especially for the song of Goose.  9.9/10 sequel never lived up to original this one did. 10/10", "created_at": "2022-06-30T23:46:35.105Z"}, {"movie_id": 361743, "review_id": "62fc861b7cffda0092ddb40c", "author_rating": 10.0, "review_text": "This is how American movies should be made.\r\n\r\nI have to confess I'd all but given up on Hollywood. The incessant woke indoctrination had led me to the conclusion, the US film industry, had little left to offer and then along came, Top Gun: Maverick.\r\n\r\nA simple, well rendered, military action flick that reinvents the formula for success and doggedly sticks to it. \r\n\r\nEverything about this film is polished. It comfortably updates the 80's original with style, verve and hands down top shelf acting from Tom Cruise and the cast.\r\n\r\nI'm not a fan of NATO or US exceptionalism but this films such quality, it even had me cheering, irrespective.\r\n\r\nEntertainment as it should be.....\r\n\r\n10/10.", "created_at": "2022-08-17T06:09:31.075Z"}, {"movie_id": 361743, "review_id": "63002a83b39e350082d57a9c", "author_rating": 10.0, "review_text": "**Best movie of 2022 so far, and I don’t see what could possibly top it!**\r\n\r\nThis movie is nearly perfect in every way. Top Gun: Maverick is a masterpiece, from the pacing to the acting to the cinematography to the character development to the casting to the writing. I can’t think of a single thing that didn’t blow me away. The intensity and intentionality of the action were magnificent and balanced with heartfelt moments of character growth and story. Tom Cruise’s best movie in a career filled with memorable and exceptional films.", "created_at": "2022-08-20T00:27:47.422Z"}, {"movie_id": 361743, "review_id": "630791e10398ab007a28e8cc", "author_rating": 10.0, "review_text": "**Wanna see the real cheesy, very 80s, bloodpumping, blockbuster movie? a movie that can lift your mood without being to complicated? a movie that can make you feel immerse in movie theaters?**\r\n\r\nSay no more fam, cuz i presents you one of my favorite in 2022\r\nTOP GUN MAVERICK\r\n\r\n_**\"Set 30 years after its predecessor, it follows Maverick's return to the United States Navy Strike Fighter Tactics Instructor program (also known as U.S. Navy-Fighter Weapons School - \"TOPGUN\"), where he must confront his past as he trains a group of younger pilots, among them the son of Maverick's deceased best friend Lieutenant Nick \"Goose\" Bradshaw, USN.\"**_\r\n\r\n—Wrathzo\r\n\r\nI never thought, a sequel from 80s hits movie would be exceeding its predecessor. tbh i thought this movie would be suck and will be getting the fate like The Matrix Resurrections and RoboCop remake. But boy i was wrong, this movie is the definition of Awesomeness in Cinema.\r\n\r\nLet me start with the Story. This movie doesnt have any complex story and some of it structure if im looking at it, kinda almost the same as the first one. But is it identical? yes? so it means they just copying it? no. what i mean is Peter Craig did take a few ideas from the first movie for a few scene (i think its a homage for the first movie) but the context has alot more meaning than the first one tbh.\r\n\r\nNow Scoring, Lorne Balfe did great job for remaking the Top Gun Anthem... Damn it feels good hearing that theme again... and also, i want to applause Onerepublic and Lady Gaga for creating such an awesome soundtrack for the movie\r\n\r\nNow lastly for cinematography and visual effect, its probably the first time in my life i got out from IMAX and said \"i paid 10$ dollar for this movie? i feel like i should've paid more. This movie is too good\". The sound design, the real action from fighter jet, the bloodpumping visual. It all works together creating this masterpiece. its been a decade since i feel this immerse on the movie.\r\n\r\n**In conclusion, ill keep this short\r\nThis is the reason why Movie Theatre was created, now go watch it on IMAX. Trust me, you'll never regret it.**", "created_at": "2022-08-25T15:14:41.556Z"}, {"movie_id": 361743, "review_id": "6313d4f30d294400795a492c", "author_rating": 8.0, "review_text": "This was a good movie. It has a pretty generic story, but its filled with a lot of heart and the right music at the right times. It also helps that on the technical side. It crispy clear video and amazing audio keeps you totally immersed.", "created_at": "2022-09-03T22:28:03.557Z"}, {"movie_id": 361743, "review_id": "631fa25d7fcab3007af1f7d4", "author_rating": null, "review_text": "I'm a simple man, I see Christopher McQuarrie's name, and I get ready for some well-crafted action filmmaking.\r\n\r\nThis is easily one of the best action movies I've gotten the chance to see in theaters, grounded in a rock-solid emotional foundation. The screenplay does an excellent job giving us all of its payoffs in a mesmerizing finale, almost as well as the Wachowski's SPEED RACER. Impactful stuff.\r\n\r\nLooks great, sounds great, feels great. Loved it.", "created_at": "2022-09-12T21:19:25.791Z"}, {"movie_id": 361743, "review_id": "63648ce10d2f53009198fdda", "author_rating": null, "review_text": "nice movie", "created_at": "2022-11-04T03:54:09.095Z"}, {"movie_id": 361743, "review_id": "63804fec6e938a008404b0ea", "author_rating": 8.0, "review_text": "Really solid action-thriller with amazing stunts and pulls on the heartstrings without feeling forced. Tom Cruise is great as usual and Miles Teller was fine though didn't feel like he had enough time to shine, but his scenes with Cruise were good. Jennifer Connelly has aged really well and they did nice service for Val Kilmer's Iceman. Really solid, entertaining old fashioned blockbuster. **4.25/5**", "created_at": "2022-11-25T05:17:32.781Z"}, {"movie_id": 361743, "review_id": "63b892367352050087ebbae4", "author_rating": 9.0, "review_text": "Top Gun: Maverick had a ton of praise when I finally got around to watching it and it did a relatively good job living up to it.\r\n\r\nMy main two complaints from the original have been entirely corrected in it's sequel: cheesy dialogue and terrible shot selection in the aerial sequences. The script has been vastly improved upon with updated dialogue just all around better acting than the original. There were not corny lines or interactions that felt awkward. The aerial combat sections are incredible, they are done with such precision and purpose. I could actually understand what was on and where the fighter crafts were in relation to each. These raised the stacks and hade me fully invested.\r\n\r\nThe overall story is pretty great. I loved how the recruits were training for a final \"suicide\" mission, instead of just graduating from the academy. The dynamics between Tom Cruise and his superiors/students were great and felt witty and genuine. The continued relationship with Iceman was touching as they seem to have a real connection that has lasted throughout the years, although I thought his illness and they way they presented it was a bit out of place. My one big complain his Cruises love interest. This plot really has no impact on the story and is just thrown in there for old time sakes. I did enjoy their chemistry together and it was cute to his interactions with daughter. But, I watched the original directly before this and was utterly confused on who she was. It was really odd to have a throw away line in the original be the main love interest in the sequel, but like I said, it did not have a huge impact.\r\n\r\nThe performances are spectacular in this film. Tom Cruise and Miles Teller are standouts and their back and forth is really fun to see, delivering some funny jabs but some series dramatic moments. Jon Hamm was great as a hard ass commanding officer. Glen Powell was a standout as well, his cockiness and rivalry with Rooster was great but complex.\r\n\r\nThis film is a blast, and I really wish I would have made the time to see it in theaters. I really enjoyed this and I am definitely not one who fancies these types of films, but it captured me.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:27:18.398Z"}, {"movie_id": 361743, "review_id": "63c59ee4e54d5d0094a87225", "author_rating": 10.0, "review_text": "You're not supposed to like this, very literally.  IMDb will block your reviews of this movie if you praise it.  Amazon (owned by the same company) is fudging the like ratio, and Youtube did the same with the trailer.\r\n\r\nThat makes sense.  It really does.\r\n\r\nMaverick is a patriotic action movie with a male lead that doesn't make the male lead look like an idiot.  The white guy isn't evil.  America isn't evil.  It's a sequel that doesn't trash the heroes of the first film or attack the fans.\r\n\r\nFrom start to finish it's just a solid apolitical action movie.\r\n\r\nSo of course you are supposed to hate it, it literally breaks all the rules of modern Hollywood.\r\n\r\nAnd that was why it was the biggest blockbuster of the past few years.  That is why it had returns that would be a mega-bock buster pre-COVID.  It's the type of movie that people actually want to see, which is why it's under attack on certain sites.  You're not supposed to know that people like it and they weren't supposed to make a movie that people wanted to see.\r\n\r\nEverything has to be a propaganda piece.  \r\n\r\nBut you want to know a secret?  If this came out in the 80s it wouldn't have done well.  It's not as good of an action movie as they had back then.  It actually sort of sucks compared to a lot of the classic action movies of this genre.\r\n\r\nBut then it came out in 2022 and the rules have all changed.  Today everything is racist or far left.  So what you have here is a movie that is great... by 2022 standards... simply because it's not the crap that Hollywood is shoving down your throats and demanding that you like.", "created_at": "2023-01-16T19:00:52.831Z"}, {"movie_id": 361743, "review_id": "6488483b99259c00e2f6a930", "author_rating": null, "review_text": "For me this movie was a letdown. Having watched the original Top Gun when it first came out, this version comes nowhere close to that one. Like most movies in the past decade or so, real originality is lacking. Seems like all there are nowadays are rehashes of older stuff. The supporting cast is lackluster at best.\r\nThere is nothing in this movie to get excited about. I suppose if you get drunk and need to sleep it off... go watch this movie.", "created_at": "2023-06-13T10:43:07.230Z"}, {"movie_id": 361743, "review_id": "628e79eb1a32483b62466c62", "author_rating": 9.0, "review_text": "What an excellent sequel - I, in fact, like it more than its predecessor.\r\n\r\n<em>'Top Gun: Maverick'</em> is fantastic, simply put. I was expecting it to be good, but it's actually much more enjoyable than I had anticipated. The callbacks to the original are expertly done, the new characters are strong/well cast, it has plenty of meaning, music is fab and the action is outstanding - the aerial stuff is sensational.\r\n\r\nThe story is superb, with each high stake coming across as intended - parts even gave me slight goosebumps, which is a surprise given I'm not someone who has a connection to the 1986 film. It's all super neatly put together, I honestly came close to giving it a higher rating.\r\n\r\nTom Cruise is brilliant as he reprises the role of Maverick, while Miles Teller comes in and gives a top performance. Jennifer Connelly is another positive, though her role does kinda feel a tiny bit forced in order to have a love interest; given Kelly McGillis' [unexplained] absence.\r\n\r\nMonica Barbaro stands out most from the fresh faces, though I actually did enjoy watching them all - which is something I thought the film may struggle with, adding new people, but it's done nicely; sure Jon Hamm and Glen Powell are a little cliché, though overall I approve.\r\n\r\nA great watch - I'd highly recommend it, though naturally would suggest watching the previous film first if you haven't already.", "created_at": "2022-05-25T18:48:11.776Z"}, {"movie_id": 361743, "review_id": "6291388cd48cee0f2ab6246f", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/top-gun-maverick-spoiler-free-review\r\n\r\n\"Top Gun: Maverick is the return of pure, nostalgic blockbusters, instantly becoming one of this year's personal favorites. The best aerial action sequences ever amaze even the highest expectations, not only due to the absolutely insane real stunts but largely because of the flawless contribution of all filmmaking elements.\r\n\r\nThe surprisingly emotional screenplay helps Tom Cruise deliver one of the best performances of his career. Perfect editing is essential to creating such realism, as well as raising the tension levels for one of the best final acts within the respective genre.\r\n\r\nAnd, finally, the memorable score loaded with epic tracks makes the theater experience the only way this magnificent work should be seen.\r\n\r\nSuperior to the original in every way.\"\r\n\r\nRating: A-", "created_at": "2022-05-27T20:46:04.171Z"}, {"movie_id": 361743, "review_id": "629181017d5db510a72f8efc", "author_rating": 5.0, "review_text": "A lot of things in this movie do not make sense, like \"why not use F-35?\", \"why didn't cruise missiles target enemy air defence and planes in hangars?\" to name a few. \r\n\r\nThe original movie had some seriousness built into it, the sequel I think is closer to a comic book movie. Very similar to the original star wars, especially the action sequence at the end. Just a tad more realistic than black widow, you can clearly see the action comedy style of Marvel movies.\r\n\r\nI think a lot of conservatives reminiscing Reagan years would watch it, that should be enough to make it a hit.\r\n\r\nI think that is also the reason of the high score. To me the movie quality is more of 5 ~ 7 out of 10.\r\n\r\nJust don't think too much when watching it, but I don't think that is too big a problem for the target audience.", "created_at": "2022-05-28T01:55:13.438Z"}, {"movie_id": 361743, "review_id": "629470aca44d090067b777ba", "author_rating": 7.0, "review_text": "It seems like I have been watching the trailers for this film for years now - and you know what? Yes - it was worth the wait. The film is all about some truly exhilarating aerial photography that culminates in some super dogfighting and a good old dose of nostalgia. Tom Cruise is very much in his element as the ageing - and frequently not afraid to look it - eponymous \"Top Gun\" pilot drafted in by a rather sceptical admiral to train up a new squad for a very perilous mission to destroy an underground uranium enrichment facility. The team arrive - full of hormones - and he must whip them into shape, a task made more difficult by the presence of \"Rooster\" (Miles Teller) who is the son of his old mate \"Goose\" who came to a sticky end last time out in 1986. He also gets to rekindle his romance with bar owner \"Penny\" (Jennifer Connelly) whilst all under the protection of his former wingman, now the poorly retired admiral \"Kazansky\" (Val Kilmer). To be honest, the story isn't really up to much - there are some twists and turns, the script is not without some humour but there is no jeopardy really. We all know what is going to happen in the end. That said, though, everyone is on good form; the pace (aside from the interludes with Connelly which do rather abruptly slow things down a bit) is consistently action packed and the imagery from both inside and outside of these amazing pieces of machinery is not at all repetitive and is compelling to watch. Even the usual gung-ho, ye-ha stuff is kept to a minimum - this is a superior film depicting the US military at it's most competitive, but also at it's most intelligent - and I really quite enjoyed it. Big screen photography - don't wait til it is on the telly.", "created_at": "2022-05-30T07:22:20.417Z"}, {"movie_id": 361743, "review_id": "6298c0207e12f02c82337cbb", "author_rating": 6.0, "review_text": "_Top Gun: Maverick_ is a sequel that is a leaps and bounds improvement over the original film. There’s better acting from the entire cast, more of an emotional attachment between at least two of the main characters in the film, and subtle humor that actually lands. But the film’s constant need to fly in the same flight pattern as the original film comes off as more of a restraint than a fond recollection.\r\n\r\nThe sequel seems to highlight many of the shortcomings of the original film, which in retrospect seems like something you’d try to avoid. With its record breaking box office during Memorial Day weekend, _Top Gun: Maverick_ is an enormously thrilling sequel with unparalleled action sequences that has proven to be exactly what fans have been waiting over 30 years for.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Top-Gun-Maverick-2022-Review-Dont-Think-Just-Sequel", "created_at": "2022-06-02T13:50:24.192Z"}, {"movie_id": 361743, "review_id": "629e44ae7d5db5086bea758c", "author_rating": null, "review_text": "💯 Best movie I've seen this year. You won't be disappointed.", "created_at": "2022-06-06T18:17:18.351Z"}, {"movie_id": 361743, "review_id": "62b0614f568463006125f78a", "author_rating": 10.0, "review_text": "Haven't seen a movie this perfect in decades. It was most obviously written and directed with the audience in mind - no politics, no preaching, no gratuitous sex, no woke, no offensive casting or characters. Brilliant, simplistic screenwriting and thrill rides. The original, if you've seen it, was iconic as it was, and to know it makes the second film here more enjoyable, but even if you're not familiar with the background of the characters it's clearly presented enough to be a stand-alone enjoyable film.", "created_at": "2022-06-20T12:00:15.969Z"}, {"movie_id": 361743, "review_id": "62be35db28723c007c11d7f9", "author_rating": 10.0, "review_text": "> Loved this movie.  Even had me guessing to the end.  Seems like every cast member picked to play their role was the only person that could pull it off especially for the song of Goose.  9.9/10 sequel never lived up to original this one did. 10/10", "created_at": "2022-06-30T23:46:35.105Z"}, {"movie_id": 361743, "review_id": "62fc861b7cffda0092ddb40c", "author_rating": 10.0, "review_text": "This is how American movies should be made.\r\n\r\nI have to confess I'd all but given up on Hollywood. The incessant woke indoctrination had led me to the conclusion, the US film industry, had little left to offer and then along came, Top Gun: Maverick.\r\n\r\nA simple, well rendered, military action flick that reinvents the formula for success and doggedly sticks to it. \r\n\r\nEverything about this film is polished. It comfortably updates the 80's original with style, verve and hands down top shelf acting from Tom Cruise and the cast.\r\n\r\nI'm not a fan of NATO or US exceptionalism but this films such quality, it even had me cheering, irrespective.\r\n\r\nEntertainment as it should be.....\r\n\r\n10/10.", "created_at": "2022-08-17T06:09:31.075Z"}, {"movie_id": 361743, "review_id": "63002a83b39e350082d57a9c", "author_rating": 10.0, "review_text": "**Best movie of 2022 so far, and I don’t see what could possibly top it!**\r\n\r\nThis movie is nearly perfect in every way. Top Gun: Maverick is a masterpiece, from the pacing to the acting to the cinematography to the character development to the casting to the writing. I can’t think of a single thing that didn’t blow me away. The intensity and intentionality of the action were magnificent and balanced with heartfelt moments of character growth and story. Tom Cruise’s best movie in a career filled with memorable and exceptional films.", "created_at": "2022-08-20T00:27:47.422Z"}, {"movie_id": 361743, "review_id": "630791e10398ab007a28e8cc", "author_rating": 10.0, "review_text": "**Wanna see the real cheesy, very 80s, bloodpumping, blockbuster movie? a movie that can lift your mood without being to complicated? a movie that can make you feel immerse in movie theaters?**\r\n\r\nSay no more fam, cuz i presents you one of my favorite in 2022\r\nTOP GUN MAVERICK\r\n\r\n_**\"Set 30 years after its predecessor, it follows Maverick's return to the United States Navy Strike Fighter Tactics Instructor program (also known as U.S. Navy-Fighter Weapons School - \"TOPGUN\"), where he must confront his past as he trains a group of younger pilots, among them the son of Maverick's deceased best friend Lieutenant Nick \"Goose\" Bradshaw, USN.\"**_\r\n\r\n—Wrathzo\r\n\r\nI never thought, a sequel from 80s hits movie would be exceeding its predecessor. tbh i thought this movie would be suck and will be getting the fate like The Matrix Resurrections and RoboCop remake. But boy i was wrong, this movie is the definition of Awesomeness in Cinema.\r\n\r\nLet me start with the Story. This movie doesnt have any complex story and some of it structure if im looking at it, kinda almost the same as the first one. But is it identical? yes? so it means they just copying it? no. what i mean is Peter Craig did take a few ideas from the first movie for a few scene (i think its a homage for the first movie) but the context has alot more meaning than the first one tbh.\r\n\r\nNow Scoring, Lorne Balfe did great job for remaking the Top Gun Anthem... Damn it feels good hearing that theme again... and also, i want to applause Onerepublic and Lady Gaga for creating such an awesome soundtrack for the movie\r\n\r\nNow lastly for cinematography and visual effect, its probably the first time in my life i got out from IMAX and said \"i paid 10$ dollar for this movie? i feel like i should've paid more. This movie is too good\". The sound design, the real action from fighter jet, the bloodpumping visual. It all works together creating this masterpiece. its been a decade since i feel this immerse on the movie.\r\n\r\n**In conclusion, ill keep this short\r\nThis is the reason why Movie Theatre was created, now go watch it on IMAX. Trust me, you'll never regret it.**", "created_at": "2022-08-25T15:14:41.556Z"}, {"movie_id": 361743, "review_id": "6313d4f30d294400795a492c", "author_rating": 8.0, "review_text": "This was a good movie. It has a pretty generic story, but its filled with a lot of heart and the right music at the right times. It also helps that on the technical side. It crispy clear video and amazing audio keeps you totally immersed.", "created_at": "2022-09-03T22:28:03.557Z"}, {"movie_id": 361743, "review_id": "631fa25d7fcab3007af1f7d4", "author_rating": null, "review_text": "I'm a simple man, I see Christopher McQuarrie's name, and I get ready for some well-crafted action filmmaking.\r\n\r\nThis is easily one of the best action movies I've gotten the chance to see in theaters, grounded in a rock-solid emotional foundation. The screenplay does an excellent job giving us all of its payoffs in a mesmerizing finale, almost as well as the Wachowski's SPEED RACER. Impactful stuff.\r\n\r\nLooks great, sounds great, feels great. Loved it.", "created_at": "2022-09-12T21:19:25.791Z"}, {"movie_id": 361743, "review_id": "63648ce10d2f53009198fdda", "author_rating": null, "review_text": "nice movie", "created_at": "2022-11-04T03:54:09.095Z"}, {"movie_id": 361743, "review_id": "63804fec6e938a008404b0ea", "author_rating": 8.0, "review_text": "Really solid action-thriller with amazing stunts and pulls on the heartstrings without feeling forced. Tom Cruise is great as usual and Miles Teller was fine though didn't feel like he had enough time to shine, but his scenes with Cruise were good. Jennifer Connelly has aged really well and they did nice service for Val Kilmer's Iceman. Really solid, entertaining old fashioned blockbuster. **4.25/5**", "created_at": "2022-11-25T05:17:32.781Z"}, {"movie_id": 361743, "review_id": "63b892367352050087ebbae4", "author_rating": 9.0, "review_text": "Top Gun: Maverick had a ton of praise when I finally got around to watching it and it did a relatively good job living up to it.\r\n\r\nMy main two complaints from the original have been entirely corrected in it's sequel: cheesy dialogue and terrible shot selection in the aerial sequences. The script has been vastly improved upon with updated dialogue just all around better acting than the original. There were not corny lines or interactions that felt awkward. The aerial combat sections are incredible, they are done with such precision and purpose. I could actually understand what was on and where the fighter crafts were in relation to each. These raised the stacks and hade me fully invested.\r\n\r\nThe overall story is pretty great. I loved how the recruits were training for a final \"suicide\" mission, instead of just graduating from the academy. The dynamics between Tom Cruise and his superiors/students were great and felt witty and genuine. The continued relationship with Iceman was touching as they seem to have a real connection that has lasted throughout the years, although I thought his illness and they way they presented it was a bit out of place. My one big complain his Cruises love interest. This plot really has no impact on the story and is just thrown in there for old time sakes. I did enjoy their chemistry together and it was cute to his interactions with daughter. But, I watched the original directly before this and was utterly confused on who she was. It was really odd to have a throw away line in the original be the main love interest in the sequel, but like I said, it did not have a huge impact.\r\n\r\nThe performances are spectacular in this film. Tom Cruise and Miles Teller are standouts and their back and forth is really fun to see, delivering some funny jabs but some series dramatic moments. Jon Hamm was great as a hard ass commanding officer. Glen Powell was a standout as well, his cockiness and rivalry with Rooster was great but complex.\r\n\r\nThis film is a blast, and I really wish I would have made the time to see it in theaters. I really enjoyed this and I am definitely not one who fancies these types of films, but it captured me.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:27:18.398Z"}, {"movie_id": 361743, "review_id": "63c59ee4e54d5d0094a87225", "author_rating": 10.0, "review_text": "You're not supposed to like this, very literally.  IMDb will block your reviews of this movie if you praise it.  Amazon (owned by the same company) is fudging the like ratio, and Youtube did the same with the trailer.\r\n\r\nThat makes sense.  It really does.\r\n\r\nMaverick is a patriotic action movie with a male lead that doesn't make the male lead look like an idiot.  The white guy isn't evil.  America isn't evil.  It's a sequel that doesn't trash the heroes of the first film or attack the fans.\r\n\r\nFrom start to finish it's just a solid apolitical action movie.\r\n\r\nSo of course you are supposed to hate it, it literally breaks all the rules of modern Hollywood.\r\n\r\nAnd that was why it was the biggest blockbuster of the past few years.  That is why it had returns that would be a mega-bock buster pre-COVID.  It's the type of movie that people actually want to see, which is why it's under attack on certain sites.  You're not supposed to know that people like it and they weren't supposed to make a movie that people wanted to see.\r\n\r\nEverything has to be a propaganda piece.  \r\n\r\nBut you want to know a secret?  If this came out in the 80s it wouldn't have done well.  It's not as good of an action movie as they had back then.  It actually sort of sucks compared to a lot of the classic action movies of this genre.\r\n\r\nBut then it came out in 2022 and the rules have all changed.  Today everything is racist or far left.  So what you have here is a movie that is great... by 2022 standards... simply because it's not the crap that Hollywood is shoving down your throats and demanding that you like.", "created_at": "2023-01-16T19:00:52.831Z"}, {"movie_id": 361743, "review_id": "6488483b99259c00e2f6a930", "author_rating": null, "review_text": "For me this movie was a letdown. Having watched the original Top Gun when it first came out, this version comes nowhere close to that one. Like most movies in the past decade or so, real originality is lacking. Seems like all there are nowadays are rehashes of older stuff. The supporting cast is lackluster at best.\r\nThere is nothing in this movie to get excited about. I suppose if you get drunk and need to sleep it off... go watch this movie.", "created_at": "2023-06-13T10:43:07.230Z"}, {"movie_id": 361743, "review_id": "628e79eb1a32483b62466c62", "author_rating": 9.0, "review_text": "What an excellent sequel - I, in fact, like it more than its predecessor.\r\n\r\n<em>'Top Gun: Maverick'</em> is fantastic, simply put. I was expecting it to be good, but it's actually much more enjoyable than I had anticipated. The callbacks to the original are expertly done, the new characters are strong/well cast, it has plenty of meaning, music is fab and the action is outstanding - the aerial stuff is sensational.\r\n\r\nThe story is superb, with each high stake coming across as intended - parts even gave me slight goosebumps, which is a surprise given I'm not someone who has a connection to the 1986 film. It's all super neatly put together, I honestly came close to giving it a higher rating.\r\n\r\nTom Cruise is brilliant as he reprises the role of Maverick, while Miles Teller comes in and gives a top performance. Jennifer Connelly is another positive, though her role does kinda feel a tiny bit forced in order to have a love interest; given Kelly McGillis' [unexplained] absence.\r\n\r\nMonica Barbaro stands out most from the fresh faces, though I actually did enjoy watching them all - which is something I thought the film may struggle with, adding new people, but it's done nicely; sure Jon Hamm and Glen Powell are a little cliché, though overall I approve.\r\n\r\nA great watch - I'd highly recommend it, though naturally would suggest watching the previous film first if you haven't already.", "created_at": "2022-05-25T18:48:11.776Z"}, {"movie_id": 361743, "review_id": "6291388cd48cee0f2ab6246f", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/top-gun-maverick-spoiler-free-review\r\n\r\n\"Top Gun: Maverick is the return of pure, nostalgic blockbusters, instantly becoming one of this year's personal favorites. The best aerial action sequences ever amaze even the highest expectations, not only due to the absolutely insane real stunts but largely because of the flawless contribution of all filmmaking elements.\r\n\r\nThe surprisingly emotional screenplay helps Tom Cruise deliver one of the best performances of his career. Perfect editing is essential to creating such realism, as well as raising the tension levels for one of the best final acts within the respective genre.\r\n\r\nAnd, finally, the memorable score loaded with epic tracks makes the theater experience the only way this magnificent work should be seen.\r\n\r\nSuperior to the original in every way.\"\r\n\r\nRating: A-", "created_at": "2022-05-27T20:46:04.171Z"}, {"movie_id": 361743, "review_id": "629181017d5db510a72f8efc", "author_rating": 5.0, "review_text": "A lot of things in this movie do not make sense, like \"why not use F-35?\", \"why didn't cruise missiles target enemy air defence and planes in hangars?\" to name a few. \r\n\r\nThe original movie had some seriousness built into it, the sequel I think is closer to a comic book movie. Very similar to the original star wars, especially the action sequence at the end. Just a tad more realistic than black widow, you can clearly see the action comedy style of Marvel movies.\r\n\r\nI think a lot of conservatives reminiscing Reagan years would watch it, that should be enough to make it a hit.\r\n\r\nI think that is also the reason of the high score. To me the movie quality is more of 5 ~ 7 out of 10.\r\n\r\nJust don't think too much when watching it, but I don't think that is too big a problem for the target audience.", "created_at": "2022-05-28T01:55:13.438Z"}, {"movie_id": 361743, "review_id": "629470aca44d090067b777ba", "author_rating": 7.0, "review_text": "It seems like I have been watching the trailers for this film for years now - and you know what? Yes - it was worth the wait. The film is all about some truly exhilarating aerial photography that culminates in some super dogfighting and a good old dose of nostalgia. Tom Cruise is very much in his element as the ageing - and frequently not afraid to look it - eponymous \"Top Gun\" pilot drafted in by a rather sceptical admiral to train up a new squad for a very perilous mission to destroy an underground uranium enrichment facility. The team arrive - full of hormones - and he must whip them into shape, a task made more difficult by the presence of \"Rooster\" (Miles Teller) who is the son of his old mate \"Goose\" who came to a sticky end last time out in 1986. He also gets to rekindle his romance with bar owner \"Penny\" (Jennifer Connelly) whilst all under the protection of his former wingman, now the poorly retired admiral \"Kazansky\" (Val Kilmer). To be honest, the story isn't really up to much - there are some twists and turns, the script is not without some humour but there is no jeopardy really. We all know what is going to happen in the end. That said, though, everyone is on good form; the pace (aside from the interludes with Connelly which do rather abruptly slow things down a bit) is consistently action packed and the imagery from both inside and outside of these amazing pieces of machinery is not at all repetitive and is compelling to watch. Even the usual gung-ho, ye-ha stuff is kept to a minimum - this is a superior film depicting the US military at it's most competitive, but also at it's most intelligent - and I really quite enjoyed it. Big screen photography - don't wait til it is on the telly.", "created_at": "2022-05-30T07:22:20.417Z"}, {"movie_id": 361743, "review_id": "6298c0207e12f02c82337cbb", "author_rating": 6.0, "review_text": "_Top Gun: Maverick_ is a sequel that is a leaps and bounds improvement over the original film. There’s better acting from the entire cast, more of an emotional attachment between at least two of the main characters in the film, and subtle humor that actually lands. But the film’s constant need to fly in the same flight pattern as the original film comes off as more of a restraint than a fond recollection.\r\n\r\nThe sequel seems to highlight many of the shortcomings of the original film, which in retrospect seems like something you’d try to avoid. With its record breaking box office during Memorial Day weekend, _Top Gun: Maverick_ is an enormously thrilling sequel with unparalleled action sequences that has proven to be exactly what fans have been waiting over 30 years for.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Top-Gun-Maverick-2022-Review-Dont-Think-Just-Sequel", "created_at": "2022-06-02T13:50:24.192Z"}, {"movie_id": 361743, "review_id": "629e44ae7d5db5086bea758c", "author_rating": null, "review_text": "💯 Best movie I've seen this year. You won't be disappointed.", "created_at": "2022-06-06T18:17:18.351Z"}, {"movie_id": 361743, "review_id": "62b0614f568463006125f78a", "author_rating": 10.0, "review_text": "Haven't seen a movie this perfect in decades. It was most obviously written and directed with the audience in mind - no politics, no preaching, no gratuitous sex, no woke, no offensive casting or characters. Brilliant, simplistic screenwriting and thrill rides. The original, if you've seen it, was iconic as it was, and to know it makes the second film here more enjoyable, but even if you're not familiar with the background of the characters it's clearly presented enough to be a stand-alone enjoyable film.", "created_at": "2022-06-20T12:00:15.969Z"}, {"movie_id": 361743, "review_id": "62be35db28723c007c11d7f9", "author_rating": 10.0, "review_text": "> Loved this movie.  Even had me guessing to the end.  Seems like every cast member picked to play their role was the only person that could pull it off especially for the song of Goose.  9.9/10 sequel never lived up to original this one did. 10/10", "created_at": "2022-06-30T23:46:35.105Z"}, {"movie_id": 361743, "review_id": "62fc861b7cffda0092ddb40c", "author_rating": 10.0, "review_text": "This is how American movies should be made.\r\n\r\nI have to confess I'd all but given up on Hollywood. The incessant woke indoctrination had led me to the conclusion, the US film industry, had little left to offer and then along came, Top Gun: Maverick.\r\n\r\nA simple, well rendered, military action flick that reinvents the formula for success and doggedly sticks to it. \r\n\r\nEverything about this film is polished. It comfortably updates the 80's original with style, verve and hands down top shelf acting from Tom Cruise and the cast.\r\n\r\nI'm not a fan of NATO or US exceptionalism but this films such quality, it even had me cheering, irrespective.\r\n\r\nEntertainment as it should be.....\r\n\r\n10/10.", "created_at": "2022-08-17T06:09:31.075Z"}, {"movie_id": 361743, "review_id": "63002a83b39e350082d57a9c", "author_rating": 10.0, "review_text": "**Best movie of 2022 so far, and I don’t see what could possibly top it!**\r\n\r\nThis movie is nearly perfect in every way. Top Gun: Maverick is a masterpiece, from the pacing to the acting to the cinematography to the character development to the casting to the writing. I can’t think of a single thing that didn’t blow me away. The intensity and intentionality of the action were magnificent and balanced with heartfelt moments of character growth and story. Tom Cruise’s best movie in a career filled with memorable and exceptional films.", "created_at": "2022-08-20T00:27:47.422Z"}, {"movie_id": 361743, "review_id": "630791e10398ab007a28e8cc", "author_rating": 10.0, "review_text": "**Wanna see the real cheesy, very 80s, bloodpumping, blockbuster movie? a movie that can lift your mood without being to complicated? a movie that can make you feel immerse in movie theaters?**\r\n\r\nSay no more fam, cuz i presents you one of my favorite in 2022\r\nTOP GUN MAVERICK\r\n\r\n_**\"Set 30 years after its predecessor, it follows Maverick's return to the United States Navy Strike Fighter Tactics Instructor program (also known as U.S. Navy-Fighter Weapons School - \"TOPGUN\"), where he must confront his past as he trains a group of younger pilots, among them the son of Maverick's deceased best friend Lieutenant Nick \"Goose\" Bradshaw, USN.\"**_\r\n\r\n—Wrathzo\r\n\r\nI never thought, a sequel from 80s hits movie would be exceeding its predecessor. tbh i thought this movie would be suck and will be getting the fate like The Matrix Resurrections and RoboCop remake. But boy i was wrong, this movie is the definition of Awesomeness in Cinema.\r\n\r\nLet me start with the Story. This movie doesnt have any complex story and some of it structure if im looking at it, kinda almost the same as the first one. But is it identical? yes? so it means they just copying it? no. what i mean is Peter Craig did take a few ideas from the first movie for a few scene (i think its a homage for the first movie) but the context has alot more meaning than the first one tbh.\r\n\r\nNow Scoring, Lorne Balfe did great job for remaking the Top Gun Anthem... Damn it feels good hearing that theme again... and also, i want to applause Onerepublic and Lady Gaga for creating such an awesome soundtrack for the movie\r\n\r\nNow lastly for cinematography and visual effect, its probably the first time in my life i got out from IMAX and said \"i paid 10$ dollar for this movie? i feel like i should've paid more. This movie is too good\". The sound design, the real action from fighter jet, the bloodpumping visual. It all works together creating this masterpiece. its been a decade since i feel this immerse on the movie.\r\n\r\n**In conclusion, ill keep this short\r\nThis is the reason why Movie Theatre was created, now go watch it on IMAX. Trust me, you'll never regret it.**", "created_at": "2022-08-25T15:14:41.556Z"}, {"movie_id": 361743, "review_id": "6313d4f30d294400795a492c", "author_rating": 8.0, "review_text": "This was a good movie. It has a pretty generic story, but its filled with a lot of heart and the right music at the right times. It also helps that on the technical side. It crispy clear video and amazing audio keeps you totally immersed.", "created_at": "2022-09-03T22:28:03.557Z"}, {"movie_id": 361743, "review_id": "631fa25d7fcab3007af1f7d4", "author_rating": null, "review_text": "I'm a simple man, I see Christopher McQuarrie's name, and I get ready for some well-crafted action filmmaking.\r\n\r\nThis is easily one of the best action movies I've gotten the chance to see in theaters, grounded in a rock-solid emotional foundation. The screenplay does an excellent job giving us all of its payoffs in a mesmerizing finale, almost as well as the Wachowski's SPEED RACER. Impactful stuff.\r\n\r\nLooks great, sounds great, feels great. Loved it.", "created_at": "2022-09-12T21:19:25.791Z"}, {"movie_id": 361743, "review_id": "63648ce10d2f53009198fdda", "author_rating": null, "review_text": "nice movie", "created_at": "2022-11-04T03:54:09.095Z"}, {"movie_id": 361743, "review_id": "63804fec6e938a008404b0ea", "author_rating": 8.0, "review_text": "Really solid action-thriller with amazing stunts and pulls on the heartstrings without feeling forced. Tom Cruise is great as usual and Miles Teller was fine though didn't feel like he had enough time to shine, but his scenes with Cruise were good. Jennifer Connelly has aged really well and they did nice service for Val Kilmer's Iceman. Really solid, entertaining old fashioned blockbuster. **4.25/5**", "created_at": "2022-11-25T05:17:32.781Z"}, {"movie_id": 361743, "review_id": "63b892367352050087ebbae4", "author_rating": 9.0, "review_text": "Top Gun: Maverick had a ton of praise when I finally got around to watching it and it did a relatively good job living up to it.\r\n\r\nMy main two complaints from the original have been entirely corrected in it's sequel: cheesy dialogue and terrible shot selection in the aerial sequences. The script has been vastly improved upon with updated dialogue just all around better acting than the original. There were not corny lines or interactions that felt awkward. The aerial combat sections are incredible, they are done with such precision and purpose. I could actually understand what was on and where the fighter crafts were in relation to each. These raised the stacks and hade me fully invested.\r\n\r\nThe overall story is pretty great. I loved how the recruits were training for a final \"suicide\" mission, instead of just graduating from the academy. The dynamics between Tom Cruise and his superiors/students were great and felt witty and genuine. The continued relationship with Iceman was touching as they seem to have a real connection that has lasted throughout the years, although I thought his illness and they way they presented it was a bit out of place. My one big complain his Cruises love interest. This plot really has no impact on the story and is just thrown in there for old time sakes. I did enjoy their chemistry together and it was cute to his interactions with daughter. But, I watched the original directly before this and was utterly confused on who she was. It was really odd to have a throw away line in the original be the main love interest in the sequel, but like I said, it did not have a huge impact.\r\n\r\nThe performances are spectacular in this film. Tom Cruise and Miles Teller are standouts and their back and forth is really fun to see, delivering some funny jabs but some series dramatic moments. Jon Hamm was great as a hard ass commanding officer. Glen Powell was a standout as well, his cockiness and rivalry with Rooster was great but complex.\r\n\r\nThis film is a blast, and I really wish I would have made the time to see it in theaters. I really enjoyed this and I am definitely not one who fancies these types of films, but it captured me.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:27:18.398Z"}, {"movie_id": 361743, "review_id": "63c59ee4e54d5d0094a87225", "author_rating": 10.0, "review_text": "You're not supposed to like this, very literally.  IMDb will block your reviews of this movie if you praise it.  Amazon (owned by the same company) is fudging the like ratio, and Youtube did the same with the trailer.\r\n\r\nThat makes sense.  It really does.\r\n\r\nMaverick is a patriotic action movie with a male lead that doesn't make the male lead look like an idiot.  The white guy isn't evil.  America isn't evil.  It's a sequel that doesn't trash the heroes of the first film or attack the fans.\r\n\r\nFrom start to finish it's just a solid apolitical action movie.\r\n\r\nSo of course you are supposed to hate it, it literally breaks all the rules of modern Hollywood.\r\n\r\nAnd that was why it was the biggest blockbuster of the past few years.  That is why it had returns that would be a mega-bock buster pre-COVID.  It's the type of movie that people actually want to see, which is why it's under attack on certain sites.  You're not supposed to know that people like it and they weren't supposed to make a movie that people wanted to see.\r\n\r\nEverything has to be a propaganda piece.  \r\n\r\nBut you want to know a secret?  If this came out in the 80s it wouldn't have done well.  It's not as good of an action movie as they had back then.  It actually sort of sucks compared to a lot of the classic action movies of this genre.\r\n\r\nBut then it came out in 2022 and the rules have all changed.  Today everything is racist or far left.  So what you have here is a movie that is great... by 2022 standards... simply because it's not the crap that Hollywood is shoving down your throats and demanding that you like.", "created_at": "2023-01-16T19:00:52.831Z"}, {"movie_id": 361743, "review_id": "6488483b99259c00e2f6a930", "author_rating": null, "review_text": "For me this movie was a letdown. Having watched the original Top Gun when it first came out, this version comes nowhere close to that one. Like most movies in the past decade or so, real originality is lacking. Seems like all there are nowadays are rehashes of older stuff. The supporting cast is lackluster at best.\r\nThere is nothing in this movie to get excited about. I suppose if you get drunk and need to sleep it off... go watch this movie.", "created_at": "2023-06-13T10:43:07.230Z"}, {"movie_id": 361743, "review_id": "628e79eb1a32483b62466c62", "author_rating": 9.0, "review_text": "What an excellent sequel - I, in fact, like it more than its predecessor.\r\n\r\n<em>'Top Gun: Maverick'</em> is fantastic, simply put. I was expecting it to be good, but it's actually much more enjoyable than I had anticipated. The callbacks to the original are expertly done, the new characters are strong/well cast, it has plenty of meaning, music is fab and the action is outstanding - the aerial stuff is sensational.\r\n\r\nThe story is superb, with each high stake coming across as intended - parts even gave me slight goosebumps, which is a surprise given I'm not someone who has a connection to the 1986 film. It's all super neatly put together, I honestly came close to giving it a higher rating.\r\n\r\nTom Cruise is brilliant as he reprises the role of Maverick, while Miles Teller comes in and gives a top performance. Jennifer Connelly is another positive, though her role does kinda feel a tiny bit forced in order to have a love interest; given Kelly McGillis' [unexplained] absence.\r\n\r\nMonica Barbaro stands out most from the fresh faces, though I actually did enjoy watching them all - which is something I thought the film may struggle with, adding new people, but it's done nicely; sure Jon Hamm and Glen Powell are a little cliché, though overall I approve.\r\n\r\nA great watch - I'd highly recommend it, though naturally would suggest watching the previous film first if you haven't already.", "created_at": "2022-05-25T18:48:11.776Z"}, {"movie_id": 361743, "review_id": "6291388cd48cee0f2ab6246f", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/top-gun-maverick-spoiler-free-review\r\n\r\n\"Top Gun: Maverick is the return of pure, nostalgic blockbusters, instantly becoming one of this year's personal favorites. The best aerial action sequences ever amaze even the highest expectations, not only due to the absolutely insane real stunts but largely because of the flawless contribution of all filmmaking elements.\r\n\r\nThe surprisingly emotional screenplay helps Tom Cruise deliver one of the best performances of his career. Perfect editing is essential to creating such realism, as well as raising the tension levels for one of the best final acts within the respective genre.\r\n\r\nAnd, finally, the memorable score loaded with epic tracks makes the theater experience the only way this magnificent work should be seen.\r\n\r\nSuperior to the original in every way.\"\r\n\r\nRating: A-", "created_at": "2022-05-27T20:46:04.171Z"}, {"movie_id": 361743, "review_id": "629181017d5db510a72f8efc", "author_rating": 5.0, "review_text": "A lot of things in this movie do not make sense, like \"why not use F-35?\", \"why didn't cruise missiles target enemy air defence and planes in hangars?\" to name a few. \r\n\r\nThe original movie had some seriousness built into it, the sequel I think is closer to a comic book movie. Very similar to the original star wars, especially the action sequence at the end. Just a tad more realistic than black widow, you can clearly see the action comedy style of Marvel movies.\r\n\r\nI think a lot of conservatives reminiscing Reagan years would watch it, that should be enough to make it a hit.\r\n\r\nI think that is also the reason of the high score. To me the movie quality is more of 5 ~ 7 out of 10.\r\n\r\nJust don't think too much when watching it, but I don't think that is too big a problem for the target audience.", "created_at": "2022-05-28T01:55:13.438Z"}, {"movie_id": 361743, "review_id": "629470aca44d090067b777ba", "author_rating": 7.0, "review_text": "It seems like I have been watching the trailers for this film for years now - and you know what? Yes - it was worth the wait. The film is all about some truly exhilarating aerial photography that culminates in some super dogfighting and a good old dose of nostalgia. Tom Cruise is very much in his element as the ageing - and frequently not afraid to look it - eponymous \"Top Gun\" pilot drafted in by a rather sceptical admiral to train up a new squad for a very perilous mission to destroy an underground uranium enrichment facility. The team arrive - full of hormones - and he must whip them into shape, a task made more difficult by the presence of \"Rooster\" (Miles Teller) who is the son of his old mate \"Goose\" who came to a sticky end last time out in 1986. He also gets to rekindle his romance with bar owner \"Penny\" (Jennifer Connelly) whilst all under the protection of his former wingman, now the poorly retired admiral \"Kazansky\" (Val Kilmer). To be honest, the story isn't really up to much - there are some twists and turns, the script is not without some humour but there is no jeopardy really. We all know what is going to happen in the end. That said, though, everyone is on good form; the pace (aside from the interludes with Connelly which do rather abruptly slow things down a bit) is consistently action packed and the imagery from both inside and outside of these amazing pieces of machinery is not at all repetitive and is compelling to watch. Even the usual gung-ho, ye-ha stuff is kept to a minimum - this is a superior film depicting the US military at it's most competitive, but also at it's most intelligent - and I really quite enjoyed it. Big screen photography - don't wait til it is on the telly.", "created_at": "2022-05-30T07:22:20.417Z"}, {"movie_id": 361743, "review_id": "6298c0207e12f02c82337cbb", "author_rating": 6.0, "review_text": "_Top Gun: Maverick_ is a sequel that is a leaps and bounds improvement over the original film. There’s better acting from the entire cast, more of an emotional attachment between at least two of the main characters in the film, and subtle humor that actually lands. But the film’s constant need to fly in the same flight pattern as the original film comes off as more of a restraint than a fond recollection.\r\n\r\nThe sequel seems to highlight many of the shortcomings of the original film, which in retrospect seems like something you’d try to avoid. With its record breaking box office during Memorial Day weekend, _Top Gun: Maverick_ is an enormously thrilling sequel with unparalleled action sequences that has proven to be exactly what fans have been waiting over 30 years for.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Top-Gun-Maverick-2022-Review-Dont-Think-Just-Sequel", "created_at": "2022-06-02T13:50:24.192Z"}, {"movie_id": 361743, "review_id": "629e44ae7d5db5086bea758c", "author_rating": null, "review_text": "💯 Best movie I've seen this year. You won't be disappointed.", "created_at": "2022-06-06T18:17:18.351Z"}, {"movie_id": 361743, "review_id": "62b0614f568463006125f78a", "author_rating": 10.0, "review_text": "Haven't seen a movie this perfect in decades. It was most obviously written and directed with the audience in mind - no politics, no preaching, no gratuitous sex, no woke, no offensive casting or characters. Brilliant, simplistic screenwriting and thrill rides. The original, if you've seen it, was iconic as it was, and to know it makes the second film here more enjoyable, but even if you're not familiar with the background of the characters it's clearly presented enough to be a stand-alone enjoyable film.", "created_at": "2022-06-20T12:00:15.969Z"}, {"movie_id": 361743, "review_id": "62be35db28723c007c11d7f9", "author_rating": 10.0, "review_text": "> Loved this movie.  Even had me guessing to the end.  Seems like every cast member picked to play their role was the only person that could pull it off especially for the song of Goose.  9.9/10 sequel never lived up to original this one did. 10/10", "created_at": "2022-06-30T23:46:35.105Z"}, {"movie_id": 361743, "review_id": "62fc861b7cffda0092ddb40c", "author_rating": 10.0, "review_text": "This is how American movies should be made.\r\n\r\nI have to confess I'd all but given up on Hollywood. The incessant woke indoctrination had led me to the conclusion, the US film industry, had little left to offer and then along came, Top Gun: Maverick.\r\n\r\nA simple, well rendered, military action flick that reinvents the formula for success and doggedly sticks to it. \r\n\r\nEverything about this film is polished. It comfortably updates the 80's original with style, verve and hands down top shelf acting from Tom Cruise and the cast.\r\n\r\nI'm not a fan of NATO or US exceptionalism but this films such quality, it even had me cheering, irrespective.\r\n\r\nEntertainment as it should be.....\r\n\r\n10/10.", "created_at": "2022-08-17T06:09:31.075Z"}, {"movie_id": 361743, "review_id": "63002a83b39e350082d57a9c", "author_rating": 10.0, "review_text": "**Best movie of 2022 so far, and I don’t see what could possibly top it!**\r\n\r\nThis movie is nearly perfect in every way. Top Gun: Maverick is a masterpiece, from the pacing to the acting to the cinematography to the character development to the casting to the writing. I can’t think of a single thing that didn’t blow me away. The intensity and intentionality of the action were magnificent and balanced with heartfelt moments of character growth and story. Tom Cruise’s best movie in a career filled with memorable and exceptional films.", "created_at": "2022-08-20T00:27:47.422Z"}, {"movie_id": 361743, "review_id": "630791e10398ab007a28e8cc", "author_rating": 10.0, "review_text": "**Wanna see the real cheesy, very 80s, bloodpumping, blockbuster movie? a movie that can lift your mood without being to complicated? a movie that can make you feel immerse in movie theaters?**\r\n\r\nSay no more fam, cuz i presents you one of my favorite in 2022\r\nTOP GUN MAVERICK\r\n\r\n_**\"Set 30 years after its predecessor, it follows Maverick's return to the United States Navy Strike Fighter Tactics Instructor program (also known as U.S. Navy-Fighter Weapons School - \"TOPGUN\"), where he must confront his past as he trains a group of younger pilots, among them the son of Maverick's deceased best friend Lieutenant Nick \"Goose\" Bradshaw, USN.\"**_\r\n\r\n—Wrathzo\r\n\r\nI never thought, a sequel from 80s hits movie would be exceeding its predecessor. tbh i thought this movie would be suck and will be getting the fate like The Matrix Resurrections and RoboCop remake. But boy i was wrong, this movie is the definition of Awesomeness in Cinema.\r\n\r\nLet me start with the Story. This movie doesnt have any complex story and some of it structure if im looking at it, kinda almost the same as the first one. But is it identical? yes? so it means they just copying it? no. what i mean is Peter Craig did take a few ideas from the first movie for a few scene (i think its a homage for the first movie) but the context has alot more meaning than the first one tbh.\r\n\r\nNow Scoring, Lorne Balfe did great job for remaking the Top Gun Anthem... Damn it feels good hearing that theme again... and also, i want to applause Onerepublic and Lady Gaga for creating such an awesome soundtrack for the movie\r\n\r\nNow lastly for cinematography and visual effect, its probably the first time in my life i got out from IMAX and said \"i paid 10$ dollar for this movie? i feel like i should've paid more. This movie is too good\". The sound design, the real action from fighter jet, the bloodpumping visual. It all works together creating this masterpiece. its been a decade since i feel this immerse on the movie.\r\n\r\n**In conclusion, ill keep this short\r\nThis is the reason why Movie Theatre was created, now go watch it on IMAX. Trust me, you'll never regret it.**", "created_at": "2022-08-25T15:14:41.556Z"}, {"movie_id": 361743, "review_id": "6313d4f30d294400795a492c", "author_rating": 8.0, "review_text": "This was a good movie. It has a pretty generic story, but its filled with a lot of heart and the right music at the right times. It also helps that on the technical side. It crispy clear video and amazing audio keeps you totally immersed.", "created_at": "2022-09-03T22:28:03.557Z"}, {"movie_id": 361743, "review_id": "631fa25d7fcab3007af1f7d4", "author_rating": null, "review_text": "I'm a simple man, I see Christopher McQuarrie's name, and I get ready for some well-crafted action filmmaking.\r\n\r\nThis is easily one of the best action movies I've gotten the chance to see in theaters, grounded in a rock-solid emotional foundation. The screenplay does an excellent job giving us all of its payoffs in a mesmerizing finale, almost as well as the Wachowski's SPEED RACER. Impactful stuff.\r\n\r\nLooks great, sounds great, feels great. Loved it.", "created_at": "2022-09-12T21:19:25.791Z"}, {"movie_id": 361743, "review_id": "63648ce10d2f53009198fdda", "author_rating": null, "review_text": "nice movie", "created_at": "2022-11-04T03:54:09.095Z"}, {"movie_id": 361743, "review_id": "63804fec6e938a008404b0ea", "author_rating": 8.0, "review_text": "Really solid action-thriller with amazing stunts and pulls on the heartstrings without feeling forced. Tom Cruise is great as usual and Miles Teller was fine though didn't feel like he had enough time to shine, but his scenes with Cruise were good. Jennifer Connelly has aged really well and they did nice service for Val Kilmer's Iceman. Really solid, entertaining old fashioned blockbuster. **4.25/5**", "created_at": "2022-11-25T05:17:32.781Z"}, {"movie_id": 361743, "review_id": "63b892367352050087ebbae4", "author_rating": 9.0, "review_text": "Top Gun: Maverick had a ton of praise when I finally got around to watching it and it did a relatively good job living up to it.\r\n\r\nMy main two complaints from the original have been entirely corrected in it's sequel: cheesy dialogue and terrible shot selection in the aerial sequences. The script has been vastly improved upon with updated dialogue just all around better acting than the original. There were not corny lines or interactions that felt awkward. The aerial combat sections are incredible, they are done with such precision and purpose. I could actually understand what was on and where the fighter crafts were in relation to each. These raised the stacks and hade me fully invested.\r\n\r\nThe overall story is pretty great. I loved how the recruits were training for a final \"suicide\" mission, instead of just graduating from the academy. The dynamics between Tom Cruise and his superiors/students were great and felt witty and genuine. The continued relationship with Iceman was touching as they seem to have a real connection that has lasted throughout the years, although I thought his illness and they way they presented it was a bit out of place. My one big complain his Cruises love interest. This plot really has no impact on the story and is just thrown in there for old time sakes. I did enjoy their chemistry together and it was cute to his interactions with daughter. But, I watched the original directly before this and was utterly confused on who she was. It was really odd to have a throw away line in the original be the main love interest in the sequel, but like I said, it did not have a huge impact.\r\n\r\nThe performances are spectacular in this film. Tom Cruise and Miles Teller are standouts and their back and forth is really fun to see, delivering some funny jabs but some series dramatic moments. Jon Hamm was great as a hard ass commanding officer. Glen Powell was a standout as well, his cockiness and rivalry with Rooster was great but complex.\r\n\r\nThis film is a blast, and I really wish I would have made the time to see it in theaters. I really enjoyed this and I am definitely not one who fancies these types of films, but it captured me.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:27:18.398Z"}, {"movie_id": 361743, "review_id": "63c59ee4e54d5d0094a87225", "author_rating": 10.0, "review_text": "You're not supposed to like this, very literally.  IMDb will block your reviews of this movie if you praise it.  Amazon (owned by the same company) is fudging the like ratio, and Youtube did the same with the trailer.\r\n\r\nThat makes sense.  It really does.\r\n\r\nMaverick is a patriotic action movie with a male lead that doesn't make the male lead look like an idiot.  The white guy isn't evil.  America isn't evil.  It's a sequel that doesn't trash the heroes of the first film or attack the fans.\r\n\r\nFrom start to finish it's just a solid apolitical action movie.\r\n\r\nSo of course you are supposed to hate it, it literally breaks all the rules of modern Hollywood.\r\n\r\nAnd that was why it was the biggest blockbuster of the past few years.  That is why it had returns that would be a mega-bock buster pre-COVID.  It's the type of movie that people actually want to see, which is why it's under attack on certain sites.  You're not supposed to know that people like it and they weren't supposed to make a movie that people wanted to see.\r\n\r\nEverything has to be a propaganda piece.  \r\n\r\nBut you want to know a secret?  If this came out in the 80s it wouldn't have done well.  It's not as good of an action movie as they had back then.  It actually sort of sucks compared to a lot of the classic action movies of this genre.\r\n\r\nBut then it came out in 2022 and the rules have all changed.  Today everything is racist or far left.  So what you have here is a movie that is great... by 2022 standards... simply because it's not the crap that Hollywood is shoving down your throats and demanding that you like.", "created_at": "2023-01-16T19:00:52.831Z"}, {"movie_id": 361743, "review_id": "6488483b99259c00e2f6a930", "author_rating": null, "review_text": "For me this movie was a letdown. Having watched the original Top Gun when it first came out, this version comes nowhere close to that one. Like most movies in the past decade or so, real originality is lacking. Seems like all there are nowadays are rehashes of older stuff. The supporting cast is lackluster at best.\r\nThere is nothing in this movie to get excited about. I suppose if you get drunk and need to sleep it off... go watch this movie.", "created_at": "2023-06-13T10:43:07.230Z"}]