[{"movie_id": 9573, "review_id": "5c814acf92514127691b1988", "author_rating": 6.0, "review_text": "***Dirty Harry’s final case (not really, but seems like it)***\r\n\r\nRecovering from a heart transplant, a retired FBI profiler (Clint Eastwood) takes a case as a private investigator because of his amazing link to one of the victims. Jeff Daniels plays his amusing neighbor, a dock bum, while Wanda De Jesus appears as his potential girlfriend.\r\n\r\n“Blood Work” (2002) was based on a Michael Connelly novel and his corresponding protagonist, Terry McCaleb, but the movie comes across as Dirty Harry’s final case after retirement, sorta like “Gran Torino” (2008) was akin to “Dirty Harry, the Golden Years.” \r\n\r\nEastwood was 71 during shooting, but his character is roughly eight years younger and he pulls it off. I point this out to stress that he’s no longer kick-axx Dirty Harry. This is an aged, retired and recovering detective working on what is likely his last case. A lot of dialog is devoted to emphasizing how over-the-hill he is and how horrible he looks.\r\n\r\nSo, while this is a gritty big city detective flick in the mold of Dirty Harry, it’s way more subdued and mature. It’s more dramatic and less compelling. If you can roll with that, it’s a decent detective movie. It’s relatively realistic until the ending, which features a twist that I didn’t foresee (although others say they did). The climax is unlikely and smacks of a typical Hollywood ending. “A Simple Plan” (1998) did the same thing: a believable story that takes a “Yeah, right” turn at the close.\r\n\r\nThe film runs 1 hour, 50 minutes and was shot in the Los Angeles area. Anjelica Huston also appears as a doctor while Paul Rodriguez is on hand as a cranky Hispanic detective.\r\n\r\nGRADE: C+/B-", "created_at": "2019-03-07T16:46:07.632Z"}, {"movie_id": 9573, "review_id": "6201dc97a6e2d2001b45a2e4", "author_rating": 7.0, "review_text": "Good entertainment.\r\n\r\nI like the plot of <em>'Blood Work'</em>. I'm unsure if it would hold up if you went through with a fine-tooth comb, but it certainly gave me the required enjoyment levels. Clint Eastwood gives a sturdy performance, as do Jeff Daniels and Wanda De Jesus; elsewhere on the cast, neat to see Anjelica Huston and Rick Hoffman, <a href=\"https://en.wikipedia.org/wiki/List_of_Suits_characters#:~:text=Faye%20to%20leave.-,Louis%20Litt,-%5Bedit%5D\" rel=\"nofollow\">Louis Litt</a> himself, appear in smaller roles.\r\n\r\nIt's not as unpredictable as it perhaps thinks it is, due to the casting more than anything, but I had a fun enough time with it.", "created_at": "2022-02-08T02:59:35.507Z"}]