[{"movie_id": 670, "review_id": "4fdc2408760ee31b8300077b", "author_rating": null, "review_text": "I’m sure that all of you can always spot a film with good acting, superb plot and great cinematography easily but when it comes to a thriller that possesses all those above quality, it would be such a rarity. OldBoy here, second installment from The Vengeance Trilogy directed by  Park Chan-wook (Sympathy for Mr. Vengeance, OldBoy, Sympathy for Lady Vengeance) really have them all, good story, powerful acting and the most horrifying and clever end twist if not genius. In fact no matter how many times you see this, the twist would still be awesome. The theme of revenge here is taken to the next level, to its supremacy for it’s really carefully-planned. OldBoy has a mind-bending assortment of drama, thriller, romance and beautifully spiced up with sadistic plot, shocking elements, ultra violence and clever psychological twist. Imagine yourself captured, locked in a room for 15 years, not knowing why and who did it and when you finally escaped and thought it’s all over, you were wrong and here’s the punching line, the direct punch to your stomach. Min-sik Choi as Oh Dae su really acted well, he really got us carried away by dragging us into the mystery that surrounds his life, into the depression he’s been feeling and into the deep well of his curiosity. Once again, OldBoy is a way too remarkable, when “revenge” isn’t merely knife-chopping or gun-battling. Enough said.", "created_at": "2012-06-16T06:13:28.000Z"}, {"movie_id": 670, "review_id": "5066662e19c2955bad000697", "author_rating": 10.0, "review_text": "This is definitely one of the films to see before you die. It's seat-squirmingly unsettling, shocking and very violent. \r\n\r\nIt's a journey into a truly disturbed mind; a mind, which - like yours will be - is unable to cope with what it discovers.\r\n\r\nThis film is brilliantly twisted. It has a thread of the most wonderful, blackest humour running through it, a sense of complete disorientation and enough plot twists and turns to sustain your interest.\r\n\r\nNot one of the best revenge thrillers I've seen - simply THE best!", "created_at": "2012-09-29T03:08:30.000Z"}, {"movie_id": 670, "review_id": "64cfc6c985090f00c87d61cd", "author_rating": null, "review_text": "Just about everyone I’d spoken to about this film recommended it to me.\r\n\r\nI watched this film with the original Korean-language soundtrack, with English subtitles.\r\n\r\nOh Dae-su (Chi Min-sik) is a bit of a flirt (whether he is a womaniser is not made clear) with a wife and young child, who has turned two years old on the day we start the film. Dae-su is in a prison waiting room having insulted a woman he was flirting with. A friend comes and eventually gets him out, but while he’s making a call to his wife to explain he will be home soon, he is kidnapped.\r\n\r\nIncarcerated in a small room, with only a TV for company, he is fed and looked after, but not allowed his freedom. He unsuccessfully attempts suicide several times. He keeps himself fit by doing exercise programmes he sees on TV and he starts to dig his way out with chopsticks. He sees a TV report that shows he’s been framed for the murder of his wife. Fifteen years later, without a word of explanation, he is released.\r\n\r\nThe rest of the film follows his attempts to find out why he was imprisoned, who did it, and where his daughter is.\r\n\r\nThe film is frenetic, highly charged, and very emotional on several levels. It is also bloody in places, but Dae-su’s obsession for seeking revenge on whomsoever imprisoned him and on finding out where his daughter is drives this film along. There are psychological aspects to the film as well, and the film does eventually resolve itself – it is not one of those open-ended “I wonder who did it” type films. Follow the film through and you will get all the answers.\r\n\r\nI would recommend it, but I wouldn’t call it light entertainment.", "created_at": "2023-08-06T16:14:01.069Z"}]