[{"movie_id": 520763, "review_id": "60ad0aba50733c0041017e2d", "author_rating": null, "review_text": "Last year we had a screening for “A Quiet Place Part II” scheduled and eagerly awaited the follow-up to the suspenseful and popular original film. Sadly we all know what happened soon after as a two-week lockdown grew and cinemas around the world were closed.\r\n\r\nAs cinemas re-open with growing but limited capacity; the film is set for release and will be a great indicator as to if the public is ready to return to cinemas in significant numbers or will they sit it out and opt to see the film down the line on Paramount+.\r\n\r\nThe film opens with a look at the day things changed for the world as Lee (John Krasinski); does some shopping while news reports come in of an explosion in Shanghai. Enjoying the weather; he joins his family at a Little League game and talks with his friend Emmett (Cillian Murphy) when the game is interrupted by the appearance of a large fireball in the sky.\r\n\r\nAs they head home; the city falls under attack by deadly creatures and Lee and his family narrowly escape. The film then jumps forward immediately following the conclusion of the first film and Evelyn (Emily Blunt); attempts to lead her newborn son, daughter Regan ( Millicent Simmons), and son Marcus (Noah Jupe) to a safer locale.\r\n\r\nWhen Marcus is injured along the way; Evelyn takes refuge with Emmett who is not happy to have to care for others after the loss of his wife and despite a secure locale in a foundry; demands the family leave the following day.\r\n\r\nWhen an unexpected radio signal appears; Regan is determined to leave and find the source as she knows the frequency of her Cochlear Implant is a weapon against the creatures and she figures if that can be broadcasted and the information revealed; then humanity has a chance to fight back and win.\r\n\r\nWhat follows is a very gripping and intense story as Regan and Emmett attempt to complete the mission while Evelyn and her family endure all manner of threats as they try to survive.\r\n\r\nThe film builds upon what made the first film so great in that there are strong and relatable characters and some very tense situations. The screening we attended was so quiet you could tell that audience members were so enthralled that they were afraid to make any noise.\r\n\r\nThe film ups the action and expands upon the universe without losing any of the strong character-driven elements or relying too much upon CGI to carry the film.\r\n\r\nJohn Krasinski writes, directed, and produced the film, and while he has less screen time than he did in the original; the film is the rare sequel that holds its own and actually improves upon the original.\r\n\r\nMy only issue with the film was that the ending was rather abrupt and left me with several unanswered questions. While this would be more than fine if we were assured of a third film to resolve unanswered elements; word is that a spin-off is in development so hopefully this will resolve the issues I had or at the least co-exist with a third part of the series.\r\n\r\nFor now; “A Quiet Place Part II” drives home why we need the cinematic experience as from the large screen to the Dolby Atmos sound; the film is a sensory experience that needs to be enjoyed in a communal setting with maximum sensory input.\r\n\r\nThe film sets the tension meter to the max and never disappoints and I urge you to experience this film the way it was intended.\r\n\r\n4.5 stars out of 5", "created_at": "2021-05-25T14:33:30.129Z"}, {"movie_id": 520763, "review_id": "60b7c7f7c8a5ac0059e8ed30", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you're reading this, then you probably visited my review of 2018's A Quiet Place. Hence, you know how much I absolutely love that movie. A low-budget, high-concept horror flick that surprised everyone, including myself, ultimately becoming one of the very best films of the respective year, as well as one of the best original horror stories in the last couple of decades. Now, I acknowledge that John Krasinski created something that could very well turn out to be the \"next big thing\" when it comes to horror franchises. However, that doesn't mean I support that endeavor. Artistically, I would much rather prefer for this to be a one-off, but I know better than anyone that if an original movie is tremendously successful at the box office - especially one that requires a short amount of money to make - sequel talks will obviously emerge.\r\n\r\nMy only major issue with the first film was, in fact, its ending. It's an admittedly badass conclusion, but it also felt like a cry to Hollywood in order to extend the story. I didn't expect this type of ending for such a character-driven personal project, but in all honesty, I rather have a sequel to A Quiet Place than the 10th SAW film or the continuation of the never-ending Fast & Furious saga. With that said, my expectations were still pretty high due to Krasinski's even more impactful involvement in the movie. With sole screenwriting credit and only possessing a few minutes of screentime this time around, Krasinski gets more time to focus on his primary technical role, delivering, once again, a masterfully directed film.\r\n\r\nI find A Quiet Place Part II inferior to its predecessor in many ways, but the extreme levels of suspense generated by Krasinski's flawless direction are still the highlight of this saga. The beautifully shot opening sequence (cinematography by Polly Morgan) sets up the incredibly high level of tension for the subsequent monster scenes, all requiring the viewers to hold their breath for several minutes. These nerve-wracking moments are elevated by terrific acting performances across the board - I'll get there - but Krasinski demonstrates exquisite knowledge of the art of filmmaking, using his best attributes in favor of the movie. Boasting a nail-biting atmosphere and effective jumpscares, the characters find a few imaginative evasion maneuvers to avoid the monsters.\r\n\r\nHowever, this leads me to one of my main issues with this sequel. The first film establishes the creatures in its ruthless, merciless first few minutes, where it becomes clear that if someone makes the tiniest noise and if a monster is nearby, they're dead. There's a minimal chance of survival, and the emotionally resonant ending also attests to this fundamental, lethal aspect of the whole \"sound-hunting beasts\" concept. Nevertheless, during the entire runtime of the sequel, including the phenomenal opening, it's like we're witnessing different monsters. If the first movie already had a couple of logic-related issues, this sequel increases the number of personal nitpicks.\r\n\r\nPeople can run away quite a bit before the creatures get close - so much that I firmly believed the film would go back to the opening sequence to explain how the main characters managed to escape a specific attack. Protagonists survive absurdly improbable situations due to heavy plot armor. Even a couple of character/plot decisions are questionable, to say the least, particularly the trigger that sets up the third act. After the first movie, where everything feels surprisingly grounded and far from nonsensical, jumping to the continuation of the same story and having to disconnect our brain continuously is a bit disappointing, especially since the screenplay remains incredibly focused on the characters.\r\n\r\nAlmost every element in this film feels less emotionally impactful than the original, but it's far from being a massive letdown. In fact, having in mind the competition in the genre, A Quiet Place Part II might even be one of the best horror sequels ever for all I know. Firstly, the actors are absolutely magnificent. Emily Blunt (Evelyn) and Cillian Murphy - who I didn't expect to have that much importance and screentime as he has - bring their experience to a movie where the young actors are the ones who truly shine. Noah Jupe (Marcus) and Millicent Simmonds (Regan) steal the spotlight from the more renowned colleagues, delivering impressive performances that will surely guarantee them several award nominations by the end of the year.\r\n\r\nThe focus on deeply exploring the characters strengthens the emotional connection with the viewers, making every scene carry a certain gravitas. Ethical dilemmas are beautifully tackled through Murphy's character, Emmett, who creates an unexpected bond with Regan. The latter stands out as a brave, smart, altruist deaf girl who should inspire many people worldwide - it's worth remembering that Simmonds, a real-life deaf girl, brings outstanding authenticity to her role. Just like the original film, most dialogues contain sign language, so the narrative is also developed through visual storytelling. Once again, Krasinski knows perfectly when and how to tell the audience something exclusively through the camera, many times just pure silence, keeping the viewers' attention on the screen at all times.\r\n\r\nThroughout the sequel, there are various visual nods and callbacks to the first flick that I also appreciated quite a lot, such as a certain object on a shelf or a repeated sentence. The ending carries less emotional weight than the original's brutal final minutes, but the entire last act will go down as one of the most impeccably edited conclusions of the year. Michael P. Shawver needs to cross-cut between excruciatingly tense sequences on completely different locations with important characters facing the same level of danger. The action is displayed seamlessly, letting the viewers genuinely enjoy the last moments of the movie without annoyingly choppy editing. Marco Beltrami's score is really gripping during the entirety of these last few scenes.\r\n\r\nA Quiet Place Part II feels less than its predecessor in almost every element, but it's still one of the best sequels of the genre. From the riveting, frenetic opening sequence - much of it shot in long, uncut takes - to one of the most impressively edited endings I've seen in years, John Krasinski maintains an incredibly tense, suspenseful atmosphere throughout the entire runtime, something that's becoming a trademark of his directing career. Story-wise, the characters continue to be the main focus of the narrative. Boasting emotional dilemmas and bold character development, the kids have a surprising impact on the overall screenplay. Cillian Murphy and Emily Blunt are remarkable, but Noah Jupe and Millicent Simmonds are astonishing, especially the latter. However, the monsters are depicted in a much less threatening, lethal manner, leading to many questionable plot decisions, as well as absurd survival situations. In addition to this, the world-building lacks significant revelations and creative ideas. Overall, it's a less emotionally resonant film than the original, which doesn't exactly let me down, but I did expect more from this sequel. Still, I highly recommend watching it at the theater. After all, both audience and critics are enjoying this movie tremendously...\r\n\r\nRating: B", "created_at": "2021-06-02T18:03:35.925Z"}, {"movie_id": 520763, "review_id": "60e1bcacfbe36f007407c442", "author_rating": 7.0, "review_text": "Not gonna say more but a worthy sequel and gives same or some might say more goosebumps than prequel but amazing work by jhon krasinski and new cinematography director etc .overall good cinematography, visuals etc was interesting.  I enjoyed it and would love a sequel. Personal rating 8 .thank you.", "created_at": "2021-07-04T13:50:36.274Z"}, {"movie_id": 520763, "review_id": "60e49d016ee3d7007541de6b", "author_rating": null, "review_text": "It’s not bad but really when you take a look at it from the no hype perspective it’s basically a few action scenes and not much else.\r\nIt’s short changing the audience in arc replacing it with an average plot.\r\nIt’s not terrible and everyone is great in it. It’s just the actual story is very vacuous and that disappoints.", "created_at": "2021-07-06T18:12:17.313Z"}, {"movie_id": 520763, "review_id": "6106ef797719d700456d0b02", "author_rating": 7.0, "review_text": "Good, not great, follow up. Some good suspense-filled scenes and solid emotive performances since there's not a whole lot of dialogue. The first one was better as a whole but this is a worthwhile sequel, simplistic which is a plus, no unnecessary drama on the human side. Don't know if I'll revisit it anytime soon but as a one-off viewing, it works well enough. **3.5/5**", "created_at": "2021-08-01T19:01:13.052Z"}, {"movie_id": 520763, "review_id": "615d9d4066a7c300423621b4", "author_rating": 8.0, "review_text": "A Quiet Place Part II ditches the tension and the stealth the first film was known for and introduces more monsters, more action, more characters, and more of a world that’s barely hanging on by a thread.\r\n\r\nLee’s oldest kids become the key players here, with Emily Blunt’s Evelyn Abbott taking a backseat, while Murphy proves why he’s one of the most underrated actors working today.\r\n\r\nOverall, A Quiet Place Part II is an exceptionally entertaining sequel with quality performances and a primary focus on monster mayhem which, as horror and suspense fans, we should all get behind.\r\n\r\nFull review: https://boundingintocomics.com/2021/06/06/a-quiet-place-part-ii-review-long-time-no-hear/", "created_at": "2021-10-06T12:57:36.795Z"}, {"movie_id": 520763, "review_id": "6313cf09028420007b39da48", "author_rating": 8.0, "review_text": "**A Quiet Place Part II is a marvelous sequel that rises to the heights of its predecessor and possibly beyond!**\r\n\r\nIt is nearly impossible to choose which is better: the original or the sequel. A Quiet Place: Part II expands the world of A Quiet Place outside of the Abbott farm adding new survivors and new locations. The characters become richer and more endearing as they develop throughout. There is even more to learn about the fearsome creatures as well. Part II boasts incredibly tense scenes that rival the first film that will have you on the edge of your seat and your heart pounding. There are some frustrating scenes where characters make idiotic decisions that build tension but also a slight annoyance, but alas, so are all horror films. This film is as good as the first and expands the franchise's universe with the hope of more epic, suspenseful-filled sequels.", "created_at": "2022-09-03T22:02:49.606Z"}, {"movie_id": 520763, "review_id": "63fd80f19f1be7007ca5ba5a", "author_rating": 6.0, "review_text": "More standard fare. <em>'A Quiet Place Part II'</em> is, for all intents and purposes, <em>'<a href=\"https://en.wikipedia.org/wiki/Stranger_Things\" rel=\"nofollow\">Stranger Things</a>'</em> meets <em>'<a href=\"https://en.wikipedia.org/wiki/The_Walking_Dead_(TV_series)\" rel=\"nofollow\">The Walking Dead</a>'</em> <em>(I am here for the Eleven and Rick crossover, tbf).</em>\r\n\r\nI may hold issues with the first film, though at least you can definitely class it as original given the use of sound. That 2018 film is very much enviroment-based, whereas this 2020 flick is far more human-based - and not in the best way. I still didn't dislike it, but I can't honestly say I found entertainment in it either - despite it having Emily Blunt and Cillian Murphy, two actors I tend to enjoy <em><b>a lot</b></em>. They are good here though, don't get me wrong.\r\n\r\nI found this one to be more forgettable and ploddy, like does anything tangible actually happen? I'm struggling to remember anything, and I've only just finished watching. It's a pretty straightforward affair, this. I will note, however, that Millicent Simmonds does a neat job with her role throughout - an improvement from <em>'A Quiet Place'</em>, certainly (not that she is anything bad in that, mind).\r\n\r\nHere's hoping Part III holds the first film's ilk. Admittedly, at least this one doesn't feature any moments as overtly stupid as its predecessor does (well, actually... OK, I'll let you off this time, Marcus).", "created_at": "2023-02-28T04:20:01.161Z"}, {"movie_id": 520763, "review_id": "60ad0aba50733c0041017e2d", "author_rating": null, "review_text": "Last year we had a screening for “A Quiet Place Part II” scheduled and eagerly awaited the follow-up to the suspenseful and popular original film. Sadly we all know what happened soon after as a two-week lockdown grew and cinemas around the world were closed.\r\n\r\nAs cinemas re-open with growing but limited capacity; the film is set for release and will be a great indicator as to if the public is ready to return to cinemas in significant numbers or will they sit it out and opt to see the film down the line on Paramount+.\r\n\r\nThe film opens with a look at the day things changed for the world as Lee (John Krasinski); does some shopping while news reports come in of an explosion in Shanghai. Enjoying the weather; he joins his family at a Little League game and talks with his friend Emmett (Cillian Murphy) when the game is interrupted by the appearance of a large fireball in the sky.\r\n\r\nAs they head home; the city falls under attack by deadly creatures and Lee and his family narrowly escape. The film then jumps forward immediately following the conclusion of the first film and Evelyn (Emily Blunt); attempts to lead her newborn son, daughter Regan ( Millicent Simmons), and son Marcus (Noah Jupe) to a safer locale.\r\n\r\nWhen Marcus is injured along the way; Evelyn takes refuge with Emmett who is not happy to have to care for others after the loss of his wife and despite a secure locale in a foundry; demands the family leave the following day.\r\n\r\nWhen an unexpected radio signal appears; Regan is determined to leave and find the source as she knows the frequency of her Cochlear Implant is a weapon against the creatures and she figures if that can be broadcasted and the information revealed; then humanity has a chance to fight back and win.\r\n\r\nWhat follows is a very gripping and intense story as Regan and Emmett attempt to complete the mission while Evelyn and her family endure all manner of threats as they try to survive.\r\n\r\nThe film builds upon what made the first film so great in that there are strong and relatable characters and some very tense situations. The screening we attended was so quiet you could tell that audience members were so enthralled that they were afraid to make any noise.\r\n\r\nThe film ups the action and expands upon the universe without losing any of the strong character-driven elements or relying too much upon CGI to carry the film.\r\n\r\nJohn Krasinski writes, directed, and produced the film, and while he has less screen time than he did in the original; the film is the rare sequel that holds its own and actually improves upon the original.\r\n\r\nMy only issue with the film was that the ending was rather abrupt and left me with several unanswered questions. While this would be more than fine if we were assured of a third film to resolve unanswered elements; word is that a spin-off is in development so hopefully this will resolve the issues I had or at the least co-exist with a third part of the series.\r\n\r\nFor now; “A Quiet Place Part II” drives home why we need the cinematic experience as from the large screen to the Dolby Atmos sound; the film is a sensory experience that needs to be enjoyed in a communal setting with maximum sensory input.\r\n\r\nThe film sets the tension meter to the max and never disappoints and I urge you to experience this film the way it was intended.\r\n\r\n4.5 stars out of 5", "created_at": "2021-05-25T14:33:30.129Z"}, {"movie_id": 520763, "review_id": "60b7c7f7c8a5ac0059e8ed30", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you're reading this, then you probably visited my review of 2018's A Quiet Place. Hence, you know how much I absolutely love that movie. A low-budget, high-concept horror flick that surprised everyone, including myself, ultimately becoming one of the very best films of the respective year, as well as one of the best original horror stories in the last couple of decades. Now, I acknowledge that John Krasinski created something that could very well turn out to be the \"next big thing\" when it comes to horror franchises. However, that doesn't mean I support that endeavor. Artistically, I would much rather prefer for this to be a one-off, but I know better than anyone that if an original movie is tremendously successful at the box office - especially one that requires a short amount of money to make - sequel talks will obviously emerge.\r\n\r\nMy only major issue with the first film was, in fact, its ending. It's an admittedly badass conclusion, but it also felt like a cry to Hollywood in order to extend the story. I didn't expect this type of ending for such a character-driven personal project, but in all honesty, I rather have a sequel to A Quiet Place than the 10th SAW film or the continuation of the never-ending Fast & Furious saga. With that said, my expectations were still pretty high due to Krasinski's even more impactful involvement in the movie. With sole screenwriting credit and only possessing a few minutes of screentime this time around, Krasinski gets more time to focus on his primary technical role, delivering, once again, a masterfully directed film.\r\n\r\nI find A Quiet Place Part II inferior to its predecessor in many ways, but the extreme levels of suspense generated by Krasinski's flawless direction are still the highlight of this saga. The beautifully shot opening sequence (cinematography by Polly Morgan) sets up the incredibly high level of tension for the subsequent monster scenes, all requiring the viewers to hold their breath for several minutes. These nerve-wracking moments are elevated by terrific acting performances across the board - I'll get there - but Krasinski demonstrates exquisite knowledge of the art of filmmaking, using his best attributes in favor of the movie. Boasting a nail-biting atmosphere and effective jumpscares, the characters find a few imaginative evasion maneuvers to avoid the monsters.\r\n\r\nHowever, this leads me to one of my main issues with this sequel. The first film establishes the creatures in its ruthless, merciless first few minutes, where it becomes clear that if someone makes the tiniest noise and if a monster is nearby, they're dead. There's a minimal chance of survival, and the emotionally resonant ending also attests to this fundamental, lethal aspect of the whole \"sound-hunting beasts\" concept. Nevertheless, during the entire runtime of the sequel, including the phenomenal opening, it's like we're witnessing different monsters. If the first movie already had a couple of logic-related issues, this sequel increases the number of personal nitpicks.\r\n\r\nPeople can run away quite a bit before the creatures get close - so much that I firmly believed the film would go back to the opening sequence to explain how the main characters managed to escape a specific attack. Protagonists survive absurdly improbable situations due to heavy plot armor. Even a couple of character/plot decisions are questionable, to say the least, particularly the trigger that sets up the third act. After the first movie, where everything feels surprisingly grounded and far from nonsensical, jumping to the continuation of the same story and having to disconnect our brain continuously is a bit disappointing, especially since the screenplay remains incredibly focused on the characters.\r\n\r\nAlmost every element in this film feels less emotionally impactful than the original, but it's far from being a massive letdown. In fact, having in mind the competition in the genre, A Quiet Place Part II might even be one of the best horror sequels ever for all I know. Firstly, the actors are absolutely magnificent. Emily Blunt (Evelyn) and Cillian Murphy - who I didn't expect to have that much importance and screentime as he has - bring their experience to a movie where the young actors are the ones who truly shine. Noah Jupe (Marcus) and Millicent Simmonds (Regan) steal the spotlight from the more renowned colleagues, delivering impressive performances that will surely guarantee them several award nominations by the end of the year.\r\n\r\nThe focus on deeply exploring the characters strengthens the emotional connection with the viewers, making every scene carry a certain gravitas. Ethical dilemmas are beautifully tackled through Murphy's character, Emmett, who creates an unexpected bond with Regan. The latter stands out as a brave, smart, altruist deaf girl who should inspire many people worldwide - it's worth remembering that Simmonds, a real-life deaf girl, brings outstanding authenticity to her role. Just like the original film, most dialogues contain sign language, so the narrative is also developed through visual storytelling. Once again, Krasinski knows perfectly when and how to tell the audience something exclusively through the camera, many times just pure silence, keeping the viewers' attention on the screen at all times.\r\n\r\nThroughout the sequel, there are various visual nods and callbacks to the first flick that I also appreciated quite a lot, such as a certain object on a shelf or a repeated sentence. The ending carries less emotional weight than the original's brutal final minutes, but the entire last act will go down as one of the most impeccably edited conclusions of the year. Michael P. Shawver needs to cross-cut between excruciatingly tense sequences on completely different locations with important characters facing the same level of danger. The action is displayed seamlessly, letting the viewers genuinely enjoy the last moments of the movie without annoyingly choppy editing. Marco Beltrami's score is really gripping during the entirety of these last few scenes.\r\n\r\nA Quiet Place Part II feels less than its predecessor in almost every element, but it's still one of the best sequels of the genre. From the riveting, frenetic opening sequence - much of it shot in long, uncut takes - to one of the most impressively edited endings I've seen in years, John Krasinski maintains an incredibly tense, suspenseful atmosphere throughout the entire runtime, something that's becoming a trademark of his directing career. Story-wise, the characters continue to be the main focus of the narrative. Boasting emotional dilemmas and bold character development, the kids have a surprising impact on the overall screenplay. Cillian Murphy and Emily Blunt are remarkable, but Noah Jupe and Millicent Simmonds are astonishing, especially the latter. However, the monsters are depicted in a much less threatening, lethal manner, leading to many questionable plot decisions, as well as absurd survival situations. In addition to this, the world-building lacks significant revelations and creative ideas. Overall, it's a less emotionally resonant film than the original, which doesn't exactly let me down, but I did expect more from this sequel. Still, I highly recommend watching it at the theater. After all, both audience and critics are enjoying this movie tremendously...\r\n\r\nRating: B", "created_at": "2021-06-02T18:03:35.925Z"}, {"movie_id": 520763, "review_id": "60e1bcacfbe36f007407c442", "author_rating": 7.0, "review_text": "Not gonna say more but a worthy sequel and gives same or some might say more goosebumps than prequel but amazing work by jhon krasinski and new cinematography director etc .overall good cinematography, visuals etc was interesting.  I enjoyed it and would love a sequel. Personal rating 8 .thank you.", "created_at": "2021-07-04T13:50:36.274Z"}, {"movie_id": 520763, "review_id": "60e49d016ee3d7007541de6b", "author_rating": null, "review_text": "It’s not bad but really when you take a look at it from the no hype perspective it’s basically a few action scenes and not much else.\r\nIt’s short changing the audience in arc replacing it with an average plot.\r\nIt’s not terrible and everyone is great in it. It’s just the actual story is very vacuous and that disappoints.", "created_at": "2021-07-06T18:12:17.313Z"}, {"movie_id": 520763, "review_id": "6106ef797719d700456d0b02", "author_rating": 7.0, "review_text": "Good, not great, follow up. Some good suspense-filled scenes and solid emotive performances since there's not a whole lot of dialogue. The first one was better as a whole but this is a worthwhile sequel, simplistic which is a plus, no unnecessary drama on the human side. Don't know if I'll revisit it anytime soon but as a one-off viewing, it works well enough. **3.5/5**", "created_at": "2021-08-01T19:01:13.052Z"}, {"movie_id": 520763, "review_id": "615d9d4066a7c300423621b4", "author_rating": 8.0, "review_text": "A Quiet Place Part II ditches the tension and the stealth the first film was known for and introduces more monsters, more action, more characters, and more of a world that’s barely hanging on by a thread.\r\n\r\nLee’s oldest kids become the key players here, with Emily Blunt’s Evelyn Abbott taking a backseat, while Murphy proves why he’s one of the most underrated actors working today.\r\n\r\nOverall, A Quiet Place Part II is an exceptionally entertaining sequel with quality performances and a primary focus on monster mayhem which, as horror and suspense fans, we should all get behind.\r\n\r\nFull review: https://boundingintocomics.com/2021/06/06/a-quiet-place-part-ii-review-long-time-no-hear/", "created_at": "2021-10-06T12:57:36.795Z"}, {"movie_id": 520763, "review_id": "6313cf09028420007b39da48", "author_rating": 8.0, "review_text": "**A Quiet Place Part II is a marvelous sequel that rises to the heights of its predecessor and possibly beyond!**\r\n\r\nIt is nearly impossible to choose which is better: the original or the sequel. A Quiet Place: Part II expands the world of A Quiet Place outside of the Abbott farm adding new survivors and new locations. The characters become richer and more endearing as they develop throughout. There is even more to learn about the fearsome creatures as well. Part II boasts incredibly tense scenes that rival the first film that will have you on the edge of your seat and your heart pounding. There are some frustrating scenes where characters make idiotic decisions that build tension but also a slight annoyance, but alas, so are all horror films. This film is as good as the first and expands the franchise's universe with the hope of more epic, suspenseful-filled sequels.", "created_at": "2022-09-03T22:02:49.606Z"}, {"movie_id": 520763, "review_id": "63fd80f19f1be7007ca5ba5a", "author_rating": 6.0, "review_text": "More standard fare. <em>'A Quiet Place Part II'</em> is, for all intents and purposes, <em>'<a href=\"https://en.wikipedia.org/wiki/Stranger_Things\" rel=\"nofollow\">Stranger Things</a>'</em> meets <em>'<a href=\"https://en.wikipedia.org/wiki/The_Walking_Dead_(TV_series)\" rel=\"nofollow\">The Walking Dead</a>'</em> <em>(I am here for the Eleven and Rick crossover, tbf).</em>\r\n\r\nI may hold issues with the first film, though at least you can definitely class it as original given the use of sound. That 2018 film is very much enviroment-based, whereas this 2020 flick is far more human-based - and not in the best way. I still didn't dislike it, but I can't honestly say I found entertainment in it either - despite it having Emily Blunt and Cillian Murphy, two actors I tend to enjoy <em><b>a lot</b></em>. They are good here though, don't get me wrong.\r\n\r\nI found this one to be more forgettable and ploddy, like does anything tangible actually happen? I'm struggling to remember anything, and I've only just finished watching. It's a pretty straightforward affair, this. I will note, however, that Millicent Simmonds does a neat job with her role throughout - an improvement from <em>'A Quiet Place'</em>, certainly (not that she is anything bad in that, mind).\r\n\r\nHere's hoping Part III holds the first film's ilk. Admittedly, at least this one doesn't feature any moments as overtly stupid as its predecessor does (well, actually... OK, I'll let you off this time, Marcus).", "created_at": "2023-02-28T04:20:01.161Z"}, {"movie_id": 520763, "review_id": "60ad0aba50733c0041017e2d", "author_rating": null, "review_text": "Last year we had a screening for “A Quiet Place Part II” scheduled and eagerly awaited the follow-up to the suspenseful and popular original film. Sadly we all know what happened soon after as a two-week lockdown grew and cinemas around the world were closed.\r\n\r\nAs cinemas re-open with growing but limited capacity; the film is set for release and will be a great indicator as to if the public is ready to return to cinemas in significant numbers or will they sit it out and opt to see the film down the line on Paramount+.\r\n\r\nThe film opens with a look at the day things changed for the world as Lee (John Krasinski); does some shopping while news reports come in of an explosion in Shanghai. Enjoying the weather; he joins his family at a Little League game and talks with his friend Emmett (Cillian Murphy) when the game is interrupted by the appearance of a large fireball in the sky.\r\n\r\nAs they head home; the city falls under attack by deadly creatures and Lee and his family narrowly escape. The film then jumps forward immediately following the conclusion of the first film and Evelyn (Emily Blunt); attempts to lead her newborn son, daughter Regan ( Millicent Simmons), and son Marcus (Noah Jupe) to a safer locale.\r\n\r\nWhen Marcus is injured along the way; Evelyn takes refuge with Emmett who is not happy to have to care for others after the loss of his wife and despite a secure locale in a foundry; demands the family leave the following day.\r\n\r\nWhen an unexpected radio signal appears; Regan is determined to leave and find the source as she knows the frequency of her Cochlear Implant is a weapon against the creatures and she figures if that can be broadcasted and the information revealed; then humanity has a chance to fight back and win.\r\n\r\nWhat follows is a very gripping and intense story as Regan and Emmett attempt to complete the mission while Evelyn and her family endure all manner of threats as they try to survive.\r\n\r\nThe film builds upon what made the first film so great in that there are strong and relatable characters and some very tense situations. The screening we attended was so quiet you could tell that audience members were so enthralled that they were afraid to make any noise.\r\n\r\nThe film ups the action and expands upon the universe without losing any of the strong character-driven elements or relying too much upon CGI to carry the film.\r\n\r\nJohn Krasinski writes, directed, and produced the film, and while he has less screen time than he did in the original; the film is the rare sequel that holds its own and actually improves upon the original.\r\n\r\nMy only issue with the film was that the ending was rather abrupt and left me with several unanswered questions. While this would be more than fine if we were assured of a third film to resolve unanswered elements; word is that a spin-off is in development so hopefully this will resolve the issues I had or at the least co-exist with a third part of the series.\r\n\r\nFor now; “A Quiet Place Part II” drives home why we need the cinematic experience as from the large screen to the Dolby Atmos sound; the film is a sensory experience that needs to be enjoyed in a communal setting with maximum sensory input.\r\n\r\nThe film sets the tension meter to the max and never disappoints and I urge you to experience this film the way it was intended.\r\n\r\n4.5 stars out of 5", "created_at": "2021-05-25T14:33:30.129Z"}, {"movie_id": 520763, "review_id": "60b7c7f7c8a5ac0059e8ed30", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you're reading this, then you probably visited my review of 2018's A Quiet Place. Hence, you know how much I absolutely love that movie. A low-budget, high-concept horror flick that surprised everyone, including myself, ultimately becoming one of the very best films of the respective year, as well as one of the best original horror stories in the last couple of decades. Now, I acknowledge that John Krasinski created something that could very well turn out to be the \"next big thing\" when it comes to horror franchises. However, that doesn't mean I support that endeavor. Artistically, I would much rather prefer for this to be a one-off, but I know better than anyone that if an original movie is tremendously successful at the box office - especially one that requires a short amount of money to make - sequel talks will obviously emerge.\r\n\r\nMy only major issue with the first film was, in fact, its ending. It's an admittedly badass conclusion, but it also felt like a cry to Hollywood in order to extend the story. I didn't expect this type of ending for such a character-driven personal project, but in all honesty, I rather have a sequel to A Quiet Place than the 10th SAW film or the continuation of the never-ending Fast & Furious saga. With that said, my expectations were still pretty high due to Krasinski's even more impactful involvement in the movie. With sole screenwriting credit and only possessing a few minutes of screentime this time around, Krasinski gets more time to focus on his primary technical role, delivering, once again, a masterfully directed film.\r\n\r\nI find A Quiet Place Part II inferior to its predecessor in many ways, but the extreme levels of suspense generated by Krasinski's flawless direction are still the highlight of this saga. The beautifully shot opening sequence (cinematography by Polly Morgan) sets up the incredibly high level of tension for the subsequent monster scenes, all requiring the viewers to hold their breath for several minutes. These nerve-wracking moments are elevated by terrific acting performances across the board - I'll get there - but Krasinski demonstrates exquisite knowledge of the art of filmmaking, using his best attributes in favor of the movie. Boasting a nail-biting atmosphere and effective jumpscares, the characters find a few imaginative evasion maneuvers to avoid the monsters.\r\n\r\nHowever, this leads me to one of my main issues with this sequel. The first film establishes the creatures in its ruthless, merciless first few minutes, where it becomes clear that if someone makes the tiniest noise and if a monster is nearby, they're dead. There's a minimal chance of survival, and the emotionally resonant ending also attests to this fundamental, lethal aspect of the whole \"sound-hunting beasts\" concept. Nevertheless, during the entire runtime of the sequel, including the phenomenal opening, it's like we're witnessing different monsters. If the first movie already had a couple of logic-related issues, this sequel increases the number of personal nitpicks.\r\n\r\nPeople can run away quite a bit before the creatures get close - so much that I firmly believed the film would go back to the opening sequence to explain how the main characters managed to escape a specific attack. Protagonists survive absurdly improbable situations due to heavy plot armor. Even a couple of character/plot decisions are questionable, to say the least, particularly the trigger that sets up the third act. After the first movie, where everything feels surprisingly grounded and far from nonsensical, jumping to the continuation of the same story and having to disconnect our brain continuously is a bit disappointing, especially since the screenplay remains incredibly focused on the characters.\r\n\r\nAlmost every element in this film feels less emotionally impactful than the original, but it's far from being a massive letdown. In fact, having in mind the competition in the genre, A Quiet Place Part II might even be one of the best horror sequels ever for all I know. Firstly, the actors are absolutely magnificent. Emily Blunt (Evelyn) and Cillian Murphy - who I didn't expect to have that much importance and screentime as he has - bring their experience to a movie where the young actors are the ones who truly shine. Noah Jupe (Marcus) and Millicent Simmonds (Regan) steal the spotlight from the more renowned colleagues, delivering impressive performances that will surely guarantee them several award nominations by the end of the year.\r\n\r\nThe focus on deeply exploring the characters strengthens the emotional connection with the viewers, making every scene carry a certain gravitas. Ethical dilemmas are beautifully tackled through Murphy's character, Emmett, who creates an unexpected bond with Regan. The latter stands out as a brave, smart, altruist deaf girl who should inspire many people worldwide - it's worth remembering that Simmonds, a real-life deaf girl, brings outstanding authenticity to her role. Just like the original film, most dialogues contain sign language, so the narrative is also developed through visual storytelling. Once again, Krasinski knows perfectly when and how to tell the audience something exclusively through the camera, many times just pure silence, keeping the viewers' attention on the screen at all times.\r\n\r\nThroughout the sequel, there are various visual nods and callbacks to the first flick that I also appreciated quite a lot, such as a certain object on a shelf or a repeated sentence. The ending carries less emotional weight than the original's brutal final minutes, but the entire last act will go down as one of the most impeccably edited conclusions of the year. Michael P. Shawver needs to cross-cut between excruciatingly tense sequences on completely different locations with important characters facing the same level of danger. The action is displayed seamlessly, letting the viewers genuinely enjoy the last moments of the movie without annoyingly choppy editing. Marco Beltrami's score is really gripping during the entirety of these last few scenes.\r\n\r\nA Quiet Place Part II feels less than its predecessor in almost every element, but it's still one of the best sequels of the genre. From the riveting, frenetic opening sequence - much of it shot in long, uncut takes - to one of the most impressively edited endings I've seen in years, John Krasinski maintains an incredibly tense, suspenseful atmosphere throughout the entire runtime, something that's becoming a trademark of his directing career. Story-wise, the characters continue to be the main focus of the narrative. Boasting emotional dilemmas and bold character development, the kids have a surprising impact on the overall screenplay. Cillian Murphy and Emily Blunt are remarkable, but Noah Jupe and Millicent Simmonds are astonishing, especially the latter. However, the monsters are depicted in a much less threatening, lethal manner, leading to many questionable plot decisions, as well as absurd survival situations. In addition to this, the world-building lacks significant revelations and creative ideas. Overall, it's a less emotionally resonant film than the original, which doesn't exactly let me down, but I did expect more from this sequel. Still, I highly recommend watching it at the theater. After all, both audience and critics are enjoying this movie tremendously...\r\n\r\nRating: B", "created_at": "2021-06-02T18:03:35.925Z"}, {"movie_id": 520763, "review_id": "60e1bcacfbe36f007407c442", "author_rating": 7.0, "review_text": "Not gonna say more but a worthy sequel and gives same or some might say more goosebumps than prequel but amazing work by jhon krasinski and new cinematography director etc .overall good cinematography, visuals etc was interesting.  I enjoyed it and would love a sequel. Personal rating 8 .thank you.", "created_at": "2021-07-04T13:50:36.274Z"}, {"movie_id": 520763, "review_id": "60e49d016ee3d7007541de6b", "author_rating": null, "review_text": "It’s not bad but really when you take a look at it from the no hype perspective it’s basically a few action scenes and not much else.\r\nIt’s short changing the audience in arc replacing it with an average plot.\r\nIt’s not terrible and everyone is great in it. It’s just the actual story is very vacuous and that disappoints.", "created_at": "2021-07-06T18:12:17.313Z"}, {"movie_id": 520763, "review_id": "6106ef797719d700456d0b02", "author_rating": 7.0, "review_text": "Good, not great, follow up. Some good suspense-filled scenes and solid emotive performances since there's not a whole lot of dialogue. The first one was better as a whole but this is a worthwhile sequel, simplistic which is a plus, no unnecessary drama on the human side. Don't know if I'll revisit it anytime soon but as a one-off viewing, it works well enough. **3.5/5**", "created_at": "2021-08-01T19:01:13.052Z"}, {"movie_id": 520763, "review_id": "615d9d4066a7c300423621b4", "author_rating": 8.0, "review_text": "A Quiet Place Part II ditches the tension and the stealth the first film was known for and introduces more monsters, more action, more characters, and more of a world that’s barely hanging on by a thread.\r\n\r\nLee’s oldest kids become the key players here, with Emily Blunt’s Evelyn Abbott taking a backseat, while Murphy proves why he’s one of the most underrated actors working today.\r\n\r\nOverall, A Quiet Place Part II is an exceptionally entertaining sequel with quality performances and a primary focus on monster mayhem which, as horror and suspense fans, we should all get behind.\r\n\r\nFull review: https://boundingintocomics.com/2021/06/06/a-quiet-place-part-ii-review-long-time-no-hear/", "created_at": "2021-10-06T12:57:36.795Z"}, {"movie_id": 520763, "review_id": "6313cf09028420007b39da48", "author_rating": 8.0, "review_text": "**A Quiet Place Part II is a marvelous sequel that rises to the heights of its predecessor and possibly beyond!**\r\n\r\nIt is nearly impossible to choose which is better: the original or the sequel. A Quiet Place: Part II expands the world of A Quiet Place outside of the Abbott farm adding new survivors and new locations. The characters become richer and more endearing as they develop throughout. There is even more to learn about the fearsome creatures as well. Part II boasts incredibly tense scenes that rival the first film that will have you on the edge of your seat and your heart pounding. There are some frustrating scenes where characters make idiotic decisions that build tension but also a slight annoyance, but alas, so are all horror films. This film is as good as the first and expands the franchise's universe with the hope of more epic, suspenseful-filled sequels.", "created_at": "2022-09-03T22:02:49.606Z"}, {"movie_id": 520763, "review_id": "63fd80f19f1be7007ca5ba5a", "author_rating": 6.0, "review_text": "More standard fare. <em>'A Quiet Place Part II'</em> is, for all intents and purposes, <em>'<a href=\"https://en.wikipedia.org/wiki/Stranger_Things\" rel=\"nofollow\">Stranger Things</a>'</em> meets <em>'<a href=\"https://en.wikipedia.org/wiki/The_Walking_Dead_(TV_series)\" rel=\"nofollow\">The Walking Dead</a>'</em> <em>(I am here for the Eleven and Rick crossover, tbf).</em>\r\n\r\nI may hold issues with the first film, though at least you can definitely class it as original given the use of sound. That 2018 film is very much enviroment-based, whereas this 2020 flick is far more human-based - and not in the best way. I still didn't dislike it, but I can't honestly say I found entertainment in it either - despite it having Emily Blunt and Cillian Murphy, two actors I tend to enjoy <em><b>a lot</b></em>. They are good here though, don't get me wrong.\r\n\r\nI found this one to be more forgettable and ploddy, like does anything tangible actually happen? I'm struggling to remember anything, and I've only just finished watching. It's a pretty straightforward affair, this. I will note, however, that Millicent Simmonds does a neat job with her role throughout - an improvement from <em>'A Quiet Place'</em>, certainly (not that she is anything bad in that, mind).\r\n\r\nHere's hoping Part III holds the first film's ilk. Admittedly, at least this one doesn't feature any moments as overtly stupid as its predecessor does (well, actually... OK, I'll let you off this time, Marcus).", "created_at": "2023-02-28T04:20:01.161Z"}, {"movie_id": 520763, "review_id": "60ad0aba50733c0041017e2d", "author_rating": null, "review_text": "Last year we had a screening for “A Quiet Place Part II” scheduled and eagerly awaited the follow-up to the suspenseful and popular original film. Sadly we all know what happened soon after as a two-week lockdown grew and cinemas around the world were closed.\r\n\r\nAs cinemas re-open with growing but limited capacity; the film is set for release and will be a great indicator as to if the public is ready to return to cinemas in significant numbers or will they sit it out and opt to see the film down the line on Paramount+.\r\n\r\nThe film opens with a look at the day things changed for the world as Lee (John Krasinski); does some shopping while news reports come in of an explosion in Shanghai. Enjoying the weather; he joins his family at a Little League game and talks with his friend Emmett (Cillian Murphy) when the game is interrupted by the appearance of a large fireball in the sky.\r\n\r\nAs they head home; the city falls under attack by deadly creatures and Lee and his family narrowly escape. The film then jumps forward immediately following the conclusion of the first film and Evelyn (Emily Blunt); attempts to lead her newborn son, daughter Regan ( Millicent Simmons), and son Marcus (Noah Jupe) to a safer locale.\r\n\r\nWhen Marcus is injured along the way; Evelyn takes refuge with Emmett who is not happy to have to care for others after the loss of his wife and despite a secure locale in a foundry; demands the family leave the following day.\r\n\r\nWhen an unexpected radio signal appears; Regan is determined to leave and find the source as she knows the frequency of her Cochlear Implant is a weapon against the creatures and she figures if that can be broadcasted and the information revealed; then humanity has a chance to fight back and win.\r\n\r\nWhat follows is a very gripping and intense story as Regan and Emmett attempt to complete the mission while Evelyn and her family endure all manner of threats as they try to survive.\r\n\r\nThe film builds upon what made the first film so great in that there are strong and relatable characters and some very tense situations. The screening we attended was so quiet you could tell that audience members were so enthralled that they were afraid to make any noise.\r\n\r\nThe film ups the action and expands upon the universe without losing any of the strong character-driven elements or relying too much upon CGI to carry the film.\r\n\r\nJohn Krasinski writes, directed, and produced the film, and while he has less screen time than he did in the original; the film is the rare sequel that holds its own and actually improves upon the original.\r\n\r\nMy only issue with the film was that the ending was rather abrupt and left me with several unanswered questions. While this would be more than fine if we were assured of a third film to resolve unanswered elements; word is that a spin-off is in development so hopefully this will resolve the issues I had or at the least co-exist with a third part of the series.\r\n\r\nFor now; “A Quiet Place Part II” drives home why we need the cinematic experience as from the large screen to the Dolby Atmos sound; the film is a sensory experience that needs to be enjoyed in a communal setting with maximum sensory input.\r\n\r\nThe film sets the tension meter to the max and never disappoints and I urge you to experience this film the way it was intended.\r\n\r\n4.5 stars out of 5", "created_at": "2021-05-25T14:33:30.129Z"}, {"movie_id": 520763, "review_id": "60b7c7f7c8a5ac0059e8ed30", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you're reading this, then you probably visited my review of 2018's A Quiet Place. Hence, you know how much I absolutely love that movie. A low-budget, high-concept horror flick that surprised everyone, including myself, ultimately becoming one of the very best films of the respective year, as well as one of the best original horror stories in the last couple of decades. Now, I acknowledge that John Krasinski created something that could very well turn out to be the \"next big thing\" when it comes to horror franchises. However, that doesn't mean I support that endeavor. Artistically, I would much rather prefer for this to be a one-off, but I know better than anyone that if an original movie is tremendously successful at the box office - especially one that requires a short amount of money to make - sequel talks will obviously emerge.\r\n\r\nMy only major issue with the first film was, in fact, its ending. It's an admittedly badass conclusion, but it also felt like a cry to Hollywood in order to extend the story. I didn't expect this type of ending for such a character-driven personal project, but in all honesty, I rather have a sequel to A Quiet Place than the 10th SAW film or the continuation of the never-ending Fast & Furious saga. With that said, my expectations were still pretty high due to Krasinski's even more impactful involvement in the movie. With sole screenwriting credit and only possessing a few minutes of screentime this time around, Krasinski gets more time to focus on his primary technical role, delivering, once again, a masterfully directed film.\r\n\r\nI find A Quiet Place Part II inferior to its predecessor in many ways, but the extreme levels of suspense generated by Krasinski's flawless direction are still the highlight of this saga. The beautifully shot opening sequence (cinematography by Polly Morgan) sets up the incredibly high level of tension for the subsequent monster scenes, all requiring the viewers to hold their breath for several minutes. These nerve-wracking moments are elevated by terrific acting performances across the board - I'll get there - but Krasinski demonstrates exquisite knowledge of the art of filmmaking, using his best attributes in favor of the movie. Boasting a nail-biting atmosphere and effective jumpscares, the characters find a few imaginative evasion maneuvers to avoid the monsters.\r\n\r\nHowever, this leads me to one of my main issues with this sequel. The first film establishes the creatures in its ruthless, merciless first few minutes, where it becomes clear that if someone makes the tiniest noise and if a monster is nearby, they're dead. There's a minimal chance of survival, and the emotionally resonant ending also attests to this fundamental, lethal aspect of the whole \"sound-hunting beasts\" concept. Nevertheless, during the entire runtime of the sequel, including the phenomenal opening, it's like we're witnessing different monsters. If the first movie already had a couple of logic-related issues, this sequel increases the number of personal nitpicks.\r\n\r\nPeople can run away quite a bit before the creatures get close - so much that I firmly believed the film would go back to the opening sequence to explain how the main characters managed to escape a specific attack. Protagonists survive absurdly improbable situations due to heavy plot armor. Even a couple of character/plot decisions are questionable, to say the least, particularly the trigger that sets up the third act. After the first movie, where everything feels surprisingly grounded and far from nonsensical, jumping to the continuation of the same story and having to disconnect our brain continuously is a bit disappointing, especially since the screenplay remains incredibly focused on the characters.\r\n\r\nAlmost every element in this film feels less emotionally impactful than the original, but it's far from being a massive letdown. In fact, having in mind the competition in the genre, A Quiet Place Part II might even be one of the best horror sequels ever for all I know. Firstly, the actors are absolutely magnificent. Emily Blunt (Evelyn) and Cillian Murphy - who I didn't expect to have that much importance and screentime as he has - bring their experience to a movie where the young actors are the ones who truly shine. Noah Jupe (Marcus) and Millicent Simmonds (Regan) steal the spotlight from the more renowned colleagues, delivering impressive performances that will surely guarantee them several award nominations by the end of the year.\r\n\r\nThe focus on deeply exploring the characters strengthens the emotional connection with the viewers, making every scene carry a certain gravitas. Ethical dilemmas are beautifully tackled through Murphy's character, Emmett, who creates an unexpected bond with Regan. The latter stands out as a brave, smart, altruist deaf girl who should inspire many people worldwide - it's worth remembering that Simmonds, a real-life deaf girl, brings outstanding authenticity to her role. Just like the original film, most dialogues contain sign language, so the narrative is also developed through visual storytelling. Once again, Krasinski knows perfectly when and how to tell the audience something exclusively through the camera, many times just pure silence, keeping the viewers' attention on the screen at all times.\r\n\r\nThroughout the sequel, there are various visual nods and callbacks to the first flick that I also appreciated quite a lot, such as a certain object on a shelf or a repeated sentence. The ending carries less emotional weight than the original's brutal final minutes, but the entire last act will go down as one of the most impeccably edited conclusions of the year. Michael P. Shawver needs to cross-cut between excruciatingly tense sequences on completely different locations with important characters facing the same level of danger. The action is displayed seamlessly, letting the viewers genuinely enjoy the last moments of the movie without annoyingly choppy editing. Marco Beltrami's score is really gripping during the entirety of these last few scenes.\r\n\r\nA Quiet Place Part II feels less than its predecessor in almost every element, but it's still one of the best sequels of the genre. From the riveting, frenetic opening sequence - much of it shot in long, uncut takes - to one of the most impressively edited endings I've seen in years, John Krasinski maintains an incredibly tense, suspenseful atmosphere throughout the entire runtime, something that's becoming a trademark of his directing career. Story-wise, the characters continue to be the main focus of the narrative. Boasting emotional dilemmas and bold character development, the kids have a surprising impact on the overall screenplay. Cillian Murphy and Emily Blunt are remarkable, but Noah Jupe and Millicent Simmonds are astonishing, especially the latter. However, the monsters are depicted in a much less threatening, lethal manner, leading to many questionable plot decisions, as well as absurd survival situations. In addition to this, the world-building lacks significant revelations and creative ideas. Overall, it's a less emotionally resonant film than the original, which doesn't exactly let me down, but I did expect more from this sequel. Still, I highly recommend watching it at the theater. After all, both audience and critics are enjoying this movie tremendously...\r\n\r\nRating: B", "created_at": "2021-06-02T18:03:35.925Z"}, {"movie_id": 520763, "review_id": "60e1bcacfbe36f007407c442", "author_rating": 7.0, "review_text": "Not gonna say more but a worthy sequel and gives same or some might say more goosebumps than prequel but amazing work by jhon krasinski and new cinematography director etc .overall good cinematography, visuals etc was interesting.  I enjoyed it and would love a sequel. Personal rating 8 .thank you.", "created_at": "2021-07-04T13:50:36.274Z"}, {"movie_id": 520763, "review_id": "60e49d016ee3d7007541de6b", "author_rating": null, "review_text": "It’s not bad but really when you take a look at it from the no hype perspective it’s basically a few action scenes and not much else.\r\nIt’s short changing the audience in arc replacing it with an average plot.\r\nIt’s not terrible and everyone is great in it. It’s just the actual story is very vacuous and that disappoints.", "created_at": "2021-07-06T18:12:17.313Z"}, {"movie_id": 520763, "review_id": "6106ef797719d700456d0b02", "author_rating": 7.0, "review_text": "Good, not great, follow up. Some good suspense-filled scenes and solid emotive performances since there's not a whole lot of dialogue. The first one was better as a whole but this is a worthwhile sequel, simplistic which is a plus, no unnecessary drama on the human side. Don't know if I'll revisit it anytime soon but as a one-off viewing, it works well enough. **3.5/5**", "created_at": "2021-08-01T19:01:13.052Z"}, {"movie_id": 520763, "review_id": "615d9d4066a7c300423621b4", "author_rating": 8.0, "review_text": "A Quiet Place Part II ditches the tension and the stealth the first film was known for and introduces more monsters, more action, more characters, and more of a world that’s barely hanging on by a thread.\r\n\r\nLee’s oldest kids become the key players here, with Emily Blunt’s Evelyn Abbott taking a backseat, while Murphy proves why he’s one of the most underrated actors working today.\r\n\r\nOverall, A Quiet Place Part II is an exceptionally entertaining sequel with quality performances and a primary focus on monster mayhem which, as horror and suspense fans, we should all get behind.\r\n\r\nFull review: https://boundingintocomics.com/2021/06/06/a-quiet-place-part-ii-review-long-time-no-hear/", "created_at": "2021-10-06T12:57:36.795Z"}, {"movie_id": 520763, "review_id": "6313cf09028420007b39da48", "author_rating": 8.0, "review_text": "**A Quiet Place Part II is a marvelous sequel that rises to the heights of its predecessor and possibly beyond!**\r\n\r\nIt is nearly impossible to choose which is better: the original or the sequel. A Quiet Place: Part II expands the world of A Quiet Place outside of the Abbott farm adding new survivors and new locations. The characters become richer and more endearing as they develop throughout. There is even more to learn about the fearsome creatures as well. Part II boasts incredibly tense scenes that rival the first film that will have you on the edge of your seat and your heart pounding. There are some frustrating scenes where characters make idiotic decisions that build tension but also a slight annoyance, but alas, so are all horror films. This film is as good as the first and expands the franchise's universe with the hope of more epic, suspenseful-filled sequels.", "created_at": "2022-09-03T22:02:49.606Z"}, {"movie_id": 520763, "review_id": "63fd80f19f1be7007ca5ba5a", "author_rating": 6.0, "review_text": "More standard fare. <em>'A Quiet Place Part II'</em> is, for all intents and purposes, <em>'<a href=\"https://en.wikipedia.org/wiki/Stranger_Things\" rel=\"nofollow\">Stranger Things</a>'</em> meets <em>'<a href=\"https://en.wikipedia.org/wiki/The_Walking_Dead_(TV_series)\" rel=\"nofollow\">The Walking Dead</a>'</em> <em>(I am here for the Eleven and Rick crossover, tbf).</em>\r\n\r\nI may hold issues with the first film, though at least you can definitely class it as original given the use of sound. That 2018 film is very much enviroment-based, whereas this 2020 flick is far more human-based - and not in the best way. I still didn't dislike it, but I can't honestly say I found entertainment in it either - despite it having Emily Blunt and Cillian Murphy, two actors I tend to enjoy <em><b>a lot</b></em>. They are good here though, don't get me wrong.\r\n\r\nI found this one to be more forgettable and ploddy, like does anything tangible actually happen? I'm struggling to remember anything, and I've only just finished watching. It's a pretty straightforward affair, this. I will note, however, that Millicent Simmonds does a neat job with her role throughout - an improvement from <em>'A Quiet Place'</em>, certainly (not that she is anything bad in that, mind).\r\n\r\nHere's hoping Part III holds the first film's ilk. Admittedly, at least this one doesn't feature any moments as overtly stupid as its predecessor does (well, actually... OK, I'll let you off this time, Marcus).", "created_at": "2023-02-28T04:20:01.161Z"}]