[{"movie_id": 328425, "review_id": "561a13c29251412c9c000277", "author_rating": null, "review_text": "Traditionally, horror films and psychological thrillers follow a predictable path in their themes of dot-to-dot suspense. Rarely does a suspense piece deviate away from the formulaic blueprint that make these types of flicks the familiar frightfests they are in conception. However, the crafty Joel Edgerton, as the juggling movie mastermind sporting directing, acting and writing credits, provides the mind-bending goods in the refreshingly titillating ‘The Gift’, an edge-of-your-seat chiller that definitely is worth unwrapping with nervous anticipation. The ambitious moments in ‘The Gift’ are golden especially when the twists and turns are considered a solid fixture in the film’s creepy conclusion.\r\n\r\nIt is understandable in assuming that ‘The Gift’ could have been yet another custom-made psychological thriller promoting the same hire-for-dire predicaments. Nevertheless, the insidious presence of Edgerton, along with co-stars Jason Bateman and Rebecca Hall, as the Chicagoan married couple settling in their aesthetic-looking LA-based home elevates ‘The Gift’ as a stalker flick with captivating smarts and attitude.\r\n\r\nIt is actually a homecoming situation for Simon (Bateman) as he returns to his California town courtesy of his job-related executive rise within his computer security firm. The mover-and-shaker couple Simon and Robyn (Hall) settle into their impressive, spacious window-friendly place with a modern innovative appearance. When the couple decides to head out and do some furniture shopping they bump into Gordon (Edgerton). Gordon identifies himself as Simon’s old high school classmate, something that catches the computer exec by surprise because he does not necessary recall the goatee-sporting Gordon right off the bat. The greeting is awkward but Simon politely acknowledges Gordon in an effort to appease him.\r\n\r\nUnfortunately, jotting down the clingy Gordon’s phone number is opening up a proverbial can of worms. Soon, Simon and Robyn would be hindered by Gordon’s constant intrusive visits to their elegant home. Furthermore, Gordon adds to the creep factor by bestowing different degrees of generous gifts on the marital twosome. Gordon does not seem to take the hint that his unannounced visitations are smothering and rather bothersome to the lovebirds. The nervy gesture of Gordon hanging around is particularly worrisome because he seems to dominate Robyn’s attention and time as Simon is away  at his lucrative job during the day.\r\n\r\nThe tension mounts for Simon and Robyn outside of the menacing interruptions caused by the mysterious Gordo. For starters, the pressure is on for the tandem to start a family as they hope to entertain the arrival of their first child. Secondly, Simon tries to best a rival at work to further his corporate ladder climbing into management. Thus, Gordon’s bizarre gift-giving tendencies and continual pit stops in the couple’s blossoming lives purely add to the stress and strain of keeping their marriage solid and conflict-free.\r\n\r\nThe Gift could have followed its road map to predictability and used the oddball Gordon as the doomsday dude that continues his twisted agenda without any rhyme or reason. Here is where Edgerton, as the aforementioned triple threat in directing, writing and acting, earns his creative stripes because he manages to flip the script on the viewers and causes them to comprehend the off-kilter motivations of this complex agitator. Is Gordon justified in his campaign to cause havoc for the corporate rising star Simon? Is Simon as squeaky clean as it appears? What is the backstory surrounding the nostalgic circumstances concerning Gordon’s and Simon’s past history as childhood classmates together? Can Robyn piece together the perplexing puzzle that involves the two men on different avenues to self-destruction?\r\n\r\nIt would be a disservice to reveal some of the shocking angles in ‘The Gift’ because the film certainly engineers must of its nerve-racking twists so cleverly to the point of describing too much of the dramatic layers may spoil the tension-driven surprise. The overall toxic message that is conveyed pretty much sums up Edgerton’s inventive and piercing thrill ride. Be careful how you mistreat or dismiss someone from the past on the way up because you very well could tangle with them as one’s fortunes could descend without a moment’s notice.  Or to put it in simplistic street-wise terminology: karma is indeed a bitch!\r\n\r\nThe Gift (2015)\r\n\r\nSTX Entertainment\r\n\r\n1 hr. 48 mins.\r\n\r\nStarring: Jason Bateman, Rebecca Hall, Joel Edgerton, Allison Tolman, Busy Phillipps, Beau Knapp, Wendell Pierce and David Denman\r\n\r\nDirected and Written by: Joel Edgerton\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Psychological Thriller/Suspense and Drama\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n", "created_at": "2015-10-11T07:46:10.871Z"}, {"movie_id": 328425, "review_id": "566ee7e4925141738300eb82", "author_rating": 7.0, "review_text": "> In a rage for revenge, the GIFTS can be our handy weapon.\r\n\r\nFirstly, it was well written by Joel Edgerton as well debuted as a director with it. That is only because of comparing with other over hyped crappy mystery-thrillers. Frankly, to me it was a decent flick that I enjoyed watching. Flaws, loopholes, whatever you call them, this film had so many due to lack of revelation of the earlier occurrence. While I tried to raise the questions on the issues I found, I also discovered possible answers for them. So either way it covers up as a little smartly, but in reality that does not make any sense at all.\r\n\r\nKind of a revenge movie, but I can't reveal more than that about the theme as it may spoil if you have not seen it yet. It was about a young married couple who moved back to their hometown after losing their unborn baby. They encounter one of their high school friends in a shopping mall and the relationship grows intensely on one end where the other side was indirectly denied. So what might happen when the grown up guys caught in a state like this is what brings the crux of the story.\r\n\r\nAs usual Rebecca Hall was so hot, Jason Bateman in a convincing act and Joel Edgerton, who was in a key role exhibited his part decently. Pretty good title as well. In the beginning it looked so simple, but while story moving forward the meaning was intensely unveiled.\r\n\r\nThe narration was kind of brilliant, because it won't let you take a side when clash begin to happen. At a time not quite easy to predict the scenes. This mystery-thriller was too much dramaticed and presented at a slow pace. Especially avoids the serious violences, but still covers a few that obviously required to shape up the film. Like I said it was not a special movie, but worth to choose and for a few people it might be an awesome flick.\r\n\r\n6½/10", "created_at": "2015-12-14T16:01:40.635Z"}, {"movie_id": 328425, "review_id": "5730e6709251413fb5000551", "author_rating": 9.0, "review_text": "Being a) the shortest boy in my class in my early years; b) the smartest; and c) adopted by parents of mixed ethnicity (which was a rarity in my small city at that time, the mid 70's), I was a natural target for bullies. At every conceivable instance (and a lot of inconceivable ones as well!), I fought all comers, often coming home black-and-blue, and exhausted--I may have lost some matches to bigger and older boys, but if they were going to win, they were at least going to pay for it, and feel the after-effects for a while. (Thankfully this ended when I was talking with my friend, who was carrying home his personal baseball equipment, when I was approached. I asked if I could borrow his bat for a second, and that ended that. I wouldn't recommend that as a solution to others, for legal reasons. Thankfully the bully's mom and mine were friends, and when he ran home crying and told her what happened, she replied, 'If Billy did that to you, then you deserved it.')\r\n\r\nI don't often do so, but I watched the DVD extras before I watched the film (I usually wait until afterwards). Edgerton's impressive directorial debut here, as well as script, fulfilled (at least to my eyes) his purpose, that of making a psychological thriller along the level of his directing idols, Sir Alfred Hitchcock and David Fincher. The three main stars, Edgerton, Jason Bateman and Rebecca Hall (I kept thinking she was Anne Hathaway!), did very good work here. I never really went for Bateman's work when he was younger, but a good friend often watched 'Arrested Development' when I was over, a few years back, and I have grown to like his acting, but he really hits it out of the park here. Had this not been an independent production but a more big-budget affair (i.e., David Fincher), I think he could have gotten an Oscar nomination--he's THAT good here.\r\n\r\nThere was the occasional logical issue I had with the film afterwards, when I stopped and REALLY thought hard about it, but I have no problem with that kind of thing, if I enjoy everything else (which I did). Highly recommended. Definitely worth buying and rewatching--and I can't say that about most films made today. I hope that Edgerton doesn't give up acting, because he's definitely good at it, but I hope he also keeps on writing scripts and directing. Simply based on 'The Gift', he has an admirer in me for life.", "created_at": "2016-05-09T19:35:12.131Z"}, {"movie_id": 328425, "review_id": "58c17098c3a3687da8005d4d", "author_rating": 6.0, "review_text": "This film was good. The acting was good. It was well written and had good plot twists. It did get a bit too predictable and over-the-top by the end.\r\n\r\n★★★", "created_at": "2017-03-09T15:11:20.150Z"}]