[{"movie_id": 581032, "review_id": "5fe4c612d70594003e0007a9", "author_rating": null, "review_text": "Tom Hanks and Director Paul Greengrass have combined to create a truly moving and memorable western which is one of the best films of 2020.\r\n\r\nHanks stars as Captain Kidd; a former Confederate Captain making his way in occupied Texas in the post-Civil-War era. Kidd travels from town to town reading various newspaper stories of interest to gathered locals who are too busy or unable to read the news and look forward to his lively interpretations of news of interest on a local and national level.\r\n\r\nOn his way to his next location; Kidd comes upon a fair skinned blonde girl wearing Native American clothing and speaking a tribal dialect he does not understand. The fact that their cart has been overturned and a lone male is hanging from a tree leads Kidd to uncover the tragic history of the child.\r\n\r\nAccording to documents he discovers in the wreck; she was taken during a raid and her parents and sibling killed. The tribe that raised her was subsequently killed leaving her an orphan twice over. As such; the girl named Johanna (Helena Zengel); is to be taken to a nearby town and remanded to a local agency for transportation to an Aunt and her husband over 600 miles away.\r\n\r\nKidd sees it as his duty to take her to the nearby town which is confirmed by some passing Union soldiers who occupy the area during the Reconstruction era much to the scorn of the locals who are stinging from losing the Civil War.\r\n\r\nThings do not go as planned as Kid is told that the authority in charge of such cases is away for three months so he must either wait or deliver the girl himself.\r\n\r\nThanks to the help of a former soldier under his command, Kidd sets out on the road to Dallas and then to the very dangerous areas beyond as he attempts to take Johanna to safety.\r\n\r\nAlong the way the two will face danger, challenges, and bond on a very memorable journey.\r\n\r\nHanks is very solid in the role and his character is compassionate yet complex. There is a reason for his generosity and he attempts to make peace with the pain and regret in his life by trying to do what is right and coming to terms with what has plagued him.\r\n\r\nThe film moves at a steady pace and does not have many extended action sequences but when action does arrive it is central to the story and never seems gratuitous.\r\n\r\nZengel is a great pairing with Hanks as the young German actress will be one to watch going forward. She is able to convey so much without an abundance of lines and you can clearly see how well she and Hanks clicked.\r\n\r\nThe visuals of the film are scenic as the audience really gets a look at the rugged beauty of the land and life during this era. It was fascinating to see what Dallas and San Antonio looked like in the 1860s after knowing them as the modern cities that they are today.\r\n\r\nThere is much to like about the film and I am eagerly putting “News of the World” on my best of 2020 list and I truly hope this film gets the recognition it deserves come awards time as it is truly a wonderful and inspiring film that is cinema at its finest.\r\n\r\n4.5 stars out of 5", "created_at": "2020-12-24T16:47:14.108Z"}, {"movie_id": 581032, "review_id": "60078f653a993700494c8675", "author_rating": 3.0, "review_text": "One of the MOST boring attempts at making a Western by a Top shelf actor to date.. Hollywood really needs to come to grips with fact they NO longer have what it takes to make these kind of films...and havnt for a few years now... \r\n\r\nNow continue on with the worlds dieing films, or Zombies, or female assassins, or better yet the ANTIFA genre of destroying neighborhoods and hating this country... The whole anti white male genre is a real boomer... but they need to stay away from Westerns... seriously.. For starters... your fresh out of masculine leading men that will work on a crappy script.... \r\n\r\nYa this is one genre that is lost  to the arts", "created_at": "2021-01-20T02:03:17.183Z"}, {"movie_id": 581032, "review_id": "609b1eca28d7fe0029675b14", "author_rating": 9.0, "review_text": "This doesn’t happen very often, but I actually read their book this movie was based on. I enjoy both. There were a couple of changes I noticed, but I wasn’t offended by them. With one it seemed they had Captain Kidd escape a jam with a speech rather than an explosion, and it worked for me.\r\n\r\nThis is a quirky western and, as such, often ridiculed by western movie fans. It isn’t a classic in my book, but if it came on while I was eating (we multi-task by combining meals with movies), I wouldn’t feel the need to lean down to pick the controller up off the floor to change channels. I would let it run.\r\n\r\nI wasn’t surprised to see a few racist reviews on IMDB, but one comment on this website raised my eyebrows. Signs of the times, I guess.", "created_at": "2021-05-12T00:18:18.579Z"}]