[{"movie_id": 250538, "review_id": "55258995c3a3687e11002143", "author_rating": 9.0, "review_text": "Migration is the part of life for birds and animals for millions of years. For the different season, to be in the different places, away from harsh nature is to comforts from any severeness. Still happening in greater number everywhere except humans who thought enough is enough, let's stay and face the challenges. Wow, that's awesome, the civilization was born. So those who stayed in the different places, formed different race, different culture and language with borders around. All kinds of people (religious) have to live together, if something goes wrong between them, the weaker must retreat, but to where?\r\n\r\nI have to mention all these, because to remind ourselves how far we'd come. Today to travel to another continent you've to pass so many formalities like visa, passport, security check, background check, check-up for latest fast spreading disease, body scans for smuggling, purpose of visit etc. It is better to turn into a bird and fly away than going through all this. That's why I am not a nationalist and call myself the citizen of planet Earth, which put me on debate with guys around on the several occasions.\r\n\r\nOkay. The movie was inspired by 'Lost Boys of Sudan'. The true story of four young Sudanese, after their elders were killed in the attack of their village they team up to escape. Henceforth living in the refugee camp in Kenya, looking for an opportunity for a better life. It lands, but struggle continues as to adapt the new place and finding the right employment. The journey from nowhere to the land of dream, but they had no dream at all, all they wanted was a normal life anywhere peacefully. On the other end, the rules and regulations begin to haunt them, which they were not used to it.\r\n\r\n> ‘‘We found strength in sticking together\r\n>  But our hope of ever leaving was fading.’’\r\n\r\nDefinitely an inspiring story. For the meaning of the title, you have to wait until the last minute. Because all the great stories told in the history began or ends with the great sacrifice. That was a touching scene, I just imagined, in reality, how tough it would have been. You probably don't understand what I'm saying, but I'm trying to keep spoiler away. We had seen the similar theme from another angle in Gerard Butler starer 'Machine Gun Preacher'. Yep, about the same war, but set in a different place. The main difference is this movie is not a heroic tale like that where a white man fights for the innocent Africans. You know there are about 20.000 boys and girls orphaned and displaced during the civil war that lasted for nearly 25 years. The writer had to pick just one from the thousands of stories. So that's how 'The Good Lie' came, a story of complete integrity.\r\n\r\nFrom the filmmaker of Oscar nominated foreign movie 'Monsieur Lazhar'. One of my favourites from Canada. I loved all his previous films, so the expectation for this was same as always. It partially feels like a docudrama, but it was not. Leaping into Hollywood did not change his style of film making. He turned into an American movie in which something lacks today, reality and honesty with dynamic story than its characters. Reese Witherspoon's presence did not affect either, the narration was neutral from the perspective of character preference. In fact, Reese Witherspoon's existence helped to put some familiar face on the posters. Especially for the marketing purpose for the wide release, other than the film festivals. So this movie definitely is to go for it, only if you're not seeking entertainment.\r\n\r\n8.5/10", "created_at": "2015-04-08T20:03:33.355Z"}]