[{"movie_id": 396461, "review_id": "5c447be50e0a266d6bd3762c", "author_rating": 6.0, "review_text": "Relatable? Hell no. But a little bit of weirdness helps the medicine go down and _Under the Silver Lake_ is a fine sort of movie to just let happen. The performances are decent, and sure, there's a lot of wank happening here, but some originality too, and that goes a long way.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T13:47:17.596Z"}, {"movie_id": 396461, "review_id": "5d03906fc3a3684adb26441d", "author_rating": 9.0, "review_text": "I loved It Follows and I'm loving this.  \r\n\r\nThe collaboration between Mitchell and Disasterpeace is fantastic once again. (This is what an impressionistic soundtrack sounds like Mr Nolan).  Visually it is very stimulating without smacking you about the face with technique. \r\n\r\nMight not be for everybody. I imagine it might hit too close to home for a lot of young men aged between 22 and 35. \r\n\r\nIf it appears that the movie concerns itself with a flimsy predicament enhanced by arguably shallow pop culture aspects then that's because it's precisely what a significant proportion of the male population, like the main character,(played by Andrew Garfield who is superb too) preoccupy themselves with. \"It's as common as tits and hamburgers.\"\r\n\r\n\"Your art. Your writing. Your culture, is the shell of other men's ambitions. Ambitions beyond what you will ever understand.\" \r\n\r\nTime will tell on this. I'm sure of it.", "created_at": "2019-06-14T12:17:51.327Z"}, {"movie_id": 396461, "review_id": "5d4a09b1439be100149075df", "author_rating": 3.0, "review_text": "**_Just like Mulholland Drive. Except really, really, really awful_**\r\n\r\n>_I got sent the script for_ Under The Silver Lake _and it was as mind-bending in word, as it was, in deed, as it were. It was 160-odd pages, which is about 30 or 40 pages more than the usual script, and it was like as if Sean Astin's character, Mikey, from_ The Goonies _is far too old to still be going on adventures, but he still wants to. But now he's in a David Lynch film that's set in a Los Angeles that's like the antithesis of the_ La La Land _Los Angeles. The deep, dark underbelly of L.A. And I read it and I just th__ought, this is totally marvellous and totally unique, and it's very, very rare that you get a unique piece of cinema in this day and age. I thought, well, I love_ The Goonies_, and I love David Lynch, and I love Los Angeles._\r\n\r\n>_Also I loved it because it was quite skewering of Hollywood and a kind of patriarchal abusive system. I think Sam sees himself as a Travis Bickle. He sees himself as this liberator, he's fully deluded in this self-assessment. He sees himself as this vigilante liberator of the divine, sacred feminine in Hollywood. But actually he has a tendency to perpetuate the same abuse in an unconscious way perhaps. I just found it really, really interesting, and it's a mystery, within a mystery, within a mystery, and there's no getting to the centre of it. I think that's maybe the point - we're on a constant quest towards the centre of things. And perhaps that's enough, just being on the quest is enough._\r\n\r\n- Andrew Garfield; \"Andrew Garfield Interview: _Under the Silver Lake_, Pop Culture Obsessions, and Spider-Verse\" (Ben Travis); _Empire_ (March 19, 2019)\r\n\r\nIn 2001, an unknown 26-year-old filmmaker named Richard Kelly released a film called _Donnie Darko_. Filmed on a tight budget over a few weeks, it made little impact at the box-office, but was critically championed as heralding a genuinely unique and exciting voice in genre filmmaking. The following year, the film was released on VHS and DVD, earning twice as much as it did at the cinema, and giving Kelly virtual _carte blanche_ for his next project. In 2006, that hotly-anticipated project was premièred in a rough-cut form at Cannes. The 160-minute _Southland Tales_ was savaged by critics, and went through multiple re-edits before a 144-minute version was released theatrically in North America in 2007. Grossing less than $1 million against a $7 million budget, the film was released straight-to-DVD in most international territories. Kelly's career has yet to recover, and he has made only one film since. In 2014, David Robert Mitchell released his second feature, _It Follows_, which he shot on a tight budget over a few weeks. A box office and critical success, the film was championed as heralding a genuinely unique and exciting voice in genre filmmaking, giving Mitchell virtual _carte blanche_ for his next project. In 2018, that hotly-anticipated project was premièred at Cannes, where it was savaged by critics.\r\n\r\nOkay, the analogy isn't perfect – _Southland Tales_ was Kelly's second film, whereas _Under the Silver Lake_ is Mitchell's third; _It Follows_ was nowhere near as good or as celebrated as _Donnie Darko_; and _Under the Silver Lake_ isn't quite as bad as _Southland Tales_, nor have the negative reviews from Cannes been quite as damning or universal. However, the sequence of events is undeniably similar - a young filmmaker riding high on an unexpected success dusts off an ambitious older project he had been unable to make at the time, and is given far too much autonomy and leeway, resulting in a pretentious, self-indulgent, convoluted, overlong mess. It's like no one has learnt from the hubris of Michael Cimino!\r\n\r\nPositioning itself as equal parts neo-noir and genre subversion, _Under the Silver Lake_ is essentially a cross between David Lynch's _Mulholland Drive_ (2001) and Thomas Pynchon's _Inherent Vice_ (2009). With the major difference being that it's absolutely, unrelentingly terrible. As with Mitchell's previous films, _Silver Lake_ works as both an example and a subversion of genre - _The Myth of the American Sleepover_ (2010) was a homage to films such as Peter Bogdanovich's _The Last Picture Show_ (1971), George Lucas's _American Graffiti_ (1973) and the work of John Hughes, whilst also deconstructing the coming-of-age subgenre; and _It Follows_ recalls films such as William Friedkin's _The Exorcist_ (1973), Wes Craven's _A Nightmare on Elm Street_ (1984) and the work of John Carpenter, whilst also satirising the tropes of such films. _Silver Lake_ is no different - a mystery noir à la Robert Aldrich's _Kiss Me Deadly_ (1955), Robert Altman's _The Long Goodbye_ (1973), and Roman Polański's _Chinatown_ (1974), the film is also at pains to undermine and critique many of the generic markers found in such films. A 140-minute labyrinthine, paranoia-laden shaggy-dog story full of MacGuffins, false leads, narrative dead ends, and unexplained details, the film relocates the detective stories of Raymond Chandler and Dashiell Hammett to the chaotic postmodern era of cognitive semiotics where the relationship between signifier and signified is now so arbitrary that meaning-making itself has become a protean commodity. However, it is easily the most self-important piece of garbage I've seen in a long time; a philosophically juvenile rumination thoroughly convinced of its own portentousness. Fundamentally misogynistic (it's not misogyny, apparently, because Mitchell is being super-ironic when he presents no less than six female characters as literal sex toys for the protagonist), it's at least 45 minutes too long, with an unfocused narrative, poorly thought-out metaphors, an insipid protagonist, about 377 themes, and a laughable screenplay. The cinematography is pretty though.\r\n\r\nSet in contemporary LA, _Under the Silver Lake_ follows Sam (Andrew Garfield), a 33-year-old man-child with no job, no ambition, and no direction, whose day consists of sitting on his balcony watching his neighbour (Wendy Vanden Heuvel) parade around topless, having unfulfilling NSA sex with a friend-with-benefits (Riki Lindhome), and visiting his drinking buddy (Topher Grace) to use a drone to spy on women (it should tell you a bunch about the film that none of these three characters are even assigned a name). Out of the blue, he meets and instantly falls in love with Sarah (an admittedly radiant Riley Keough), but when he visits her apartment the day after meeting her, he finds her gone and the apartment empty, apart from a shoebox with a photograph and a few trinkets, and a strange symbol painted on the wall. Although he later identifies Sarah as one of three women killed in a car crash alongside billionaire media mogul (and professional stuntman) Jefferson Sevence (Chris Gann), having recognised a hat found at the scene to be hers, he refuses to believe she's dead. And so begins an odyssey to track her down that ultimately involves, amongst other things, a parrot who keeps repeating the same meaningless phrase, a hipster pirate, secret codes hidden in everyday objects such as statues, song lyrics, _Nintendo Power_ magazines, and cereal boxes, a glam rock band named Jesus and the Brides of Dracula, the July 1970 issue of _Playboy_, a dog murderer, a conspiracy theorist comic book writer (Patrick Fischler), the Hobo Code, a vast network of underground tunnels, an actual literal homeless king (David Yow), a helpful coyote, an unhelpful skunk, an escort agency staffed by former child-stars, a balloon dancer (Grace Van Patten), a walled-off Xanadu-like mansion, a mysterious songwriter (Jeremy Bobb) with a strange claim, a female serial killer who enters men's apartments wearing nothing but an owl mask, and a New Age cult lead by super-wealthy men.\r\n\r\nAnd if this makes it sound convoluted, unwieldly, and overly plotted, believe me, you don't know the half of it.\r\n\r\nPerhaps the most immediately obvious aspects of _Silver Lake_ is the sheer range of homages that Mitchell includes at both plot and formal levels. Some of these homages are impressively handled, some not so much. The music by Rich Vreeland, for example, and the cinematography by Mike Gioulakis are both extremely retro, serving to situate the film firmly in the formal styles of yesterday. Vreeland's score (although I didn't like it in and of itself) is a solid imitation of the work of composers such as Franz Waxman (_Sunset Boulevard_; _A Place in the Sun_; _Rear Window_) and Bernard Herrmann (_Citizen Kane_; _Vertigo_; _Psycho_), whilst Gioulakis's photography, with its overly dramatic camera movements and crash zooms that seem to come out of nowhere, recalls the work of Robert Burks (_Rear Window_; _To Catch a Thief_; _Vertigo_) and Sam Leavitt (_The Defiant Ones_; _Anatomy of a Murder_; _Cape Fear_).\r\n\r\nMost of the other homages come at plot level, and although some are well integrated into the narrative, many feel shoehorned in, as if Mitchell is showing off his range of reference, so much so that the film essentially becomes pastiche. Examples include Sam's mother's obsession with Janet Gaynor, particularly Frank Borzage's _7th Heaven_ (1927); Sam sitting on his balcony using binoculars to spy on people, á la L.B. Jefferies (James Stewart) in Alfred Hitchcock's _Rear Window_ (1954); Sam's fascination with Don Ornitz's picture of Janet Wolf from the cover of the July 1970 issue of _Playboy_; a Nirvana poster above Sam's bed; Sam and Sarah watching Jean Negulesco's _How to Marry a Millionaire_ (1953); a brief glimpse of an _Amazing Spider-Man_ comic (intertextual and self-reflexive, given Garfield's appearance as the titular character in two films); a visual quotation of Marilyn Monroe in a swimming pool from George Cukor's unfinished _Something's Got to Give_ (1962); the Brides of Dracula doing a cover of Lulu's \"To Sir with Love\" (1967) from James Clavell's film of the same name; R.E.M.'s \"Strange Currencies\" (1994) playing at a party; a visit to Griffith Observatory from Nicholas Ray's _Rebel Without a Cause_ (1955); references to the original _Legend of Zelda_ (1986); a very on-the-nose shot of a gravestone with the word \"Hitchcock\" on it; and a scene that references songs as varied as The Arrows' \"I Love Rock 'n' Roll\" (1975), Gary Portnoy's \"Where Everybody Knows Your Name\" (1982) from the TV show _Cheers_, Foreigner's \"I Want to Know What Love Is\" (1984), Harold Faltermeyer's \"Axel F\" (1985) from the film _Beverly Hills Cop_, Pixies' \"Where is my Mind?\" (1988), Nirvana's \"Smells Like Teen Spirit\" (1991), and Backstreet Boys' \"I Want it That Way\" (1999). The most consistent referential touchstone, however, is David Lynch, particularly _Mulholland Drive_, an infinitely superior mystery thriller also set in the darker environs of LA involving a sprawling cast of strange characters.\r\n\r\nThematically, the film is all over the place, never settling on any one issue (or even a few issues), instead jumping around like a hyperactive puppy trying to be in eight different places at once. Characters say things such as \"_who isn't being followed these days?_\" and \"_the ideology you thought you adopted through free will was actually subliminal messaging_\", but it's all meaningless in a narrative chaos where nothing is ever examined for more than a couple of minutes before the film leaps onto something new. Positing that pop culture has profound hidden meaning (in direct contrast to most cultural-anthropological thinking), the film is so imprecise and scattered that it's impossible to tell if Mitchell actually buys into the notion that schizophrenic conspiracies are all around us or if he's being facetious.\r\n\r\nAnd yes, I understand what he's doing here - presenting the film from the point of view of a pop culture-saturated Millennial who's easily distracted and hence keeps losing the run of his own story. However, just because it's apparent what the director is trying to do doesn't mean he has succeeded. Oliver Stone did a far better job of depicting a similarly media-soaked shortened-attention span over 20 years ago with _Natural Born Killers_ (1994). Easily the most interesting issue touched on is the concept that much of what has defined generations and been the artistic impetus behind and symbol of cultural revolutions throughout the 20th century all comes from the same corrupted and cynical place; the music that has most embodied rebellion and freedom is actually even more manufactured than the worst boy band could ever be. This is a fascinating and fundamentally postmodernist way of thinking, but mere moments after introducing it, Mitchell abandons the theme entirely in favour of a piece of absolutely gratuitous violence which says nothing of interest about anything.\r\n\r\nThe most troubling thing about the film from a thematic point of view, however, is how it depicts women. Yes, it's partly about the male gaze and how Hollywood has a track record of objectifying women, especially in films of this nature, so a degree of objectification is necessary. But Mitchell does it to the point where critique simply becomes content - he doesn't need six women (only two of whom are even given names, and none of whom receive much in the way of characterisation) to throw themselves at Sam to adequately deconstruct the trope. Granted, his intentions may be noble; he is obviously side-lining the female characters with the goal of satirising male entitlement, but he is unable to distinguish between replication and repudiation. All the best intentions in the world don't alter the fact that the women in the film are wallpaper, and his attempt to critique Hollywood's tendency to depict women as such ends up as simply another example of the very trope he is setting out to critique. So all the unnecessarily topless shots aren't exploitative you see, because irony!! Additionally, it's worth mentioning that Sam doesn't initiate a single sexual encounter; every one of them is initiated by the woman. How does that fit into Mitchell's deconstruction of Hollywood's depiction of men using women, if the women are essentially allowing themselves to be used? If his critique was in any way consistent, Sam would be seducing them, not the other way around, thus allowing Mitchell to directly engage with the notion that men look at women as playthings. It's a facile attempt to critique a theme that cries out this is a filmmaker attempting something that he simply doesn't have the requisite ability to pull off.\r\n\r\nAnd if only these thematic issues were the film's only problems, it mightn't be so bad. Unfortunately, there is so, so much else wrong here. This is a (supposed) satire, yet there is practically no humour. There are a couple of funny scenes (such as when Sam beats up two children for egging his car), but they are few and far between. Additionally, Mitchell completely fails to make us care about Sam or his quest to find Sarah; there is no emotional connection whatsoever. As for the quest itself, it soon becomes obvious that we're following Sam down a rabbit-hole which Mitchell has filled to the brim with pointless digressions, meaningless distractions, and derivative clichés. Whereas in _Mulholland Drive_, Lynch creates a beautiful and complex tapestry where everything has precise meaning, with no wasted motion, no weirdness simply for weirdness sake, in _Silver Lake_, Mitchell just lobs anything and everything at the viewer whether it's ultimately significant or not. A pirate? Sure. A female serial killer? Why not. A dog murderer? Of course. A story that makes sense and deals with its themes coherently? Don't be ridiculous. It's like the worst type of student film where the filmmaker has been allowed to shoot whatever he wants, and ends up making something so convoluted that any meaning it may have becomes subsumed amongst self-important pretension. And the more needlessly complex and bloated the plot becomes, the less interesting it is. The whole thing smacks of Mitchell shouting \"_look at me. Look how wacky I am._\"\r\n\r\n_Under the Silver Lake_ is a tiresome, self-important, overlong, intellectually juvenile mess. If Mitchell actually has anything to say about subliminal messaging, the commodification of women, wealth buying privileges even in the afterlife, the pervasiveness of pop culture, or conspiracy theories, it's lost within a painfully dull and self-indulgent plot. With _It Follows_, Mitchell was constricted by a tight budget. With _Silver Lake_, he has been allowed to play relatively unsupervised in the sandbox, and the results are disastrous; a swollen, self-admiring film that can't follow through on anything, thematically or narratively, a film that is totally and completely in love with itself.", "created_at": "2019-08-06T23:13:53.151Z"}]