[{"movie_id": 9645, "review_id": "53d11134c3a368776700a432", "author_rating": 3.0, "review_text": "Wetter than a fishes bathing costume.\r\n\r\nIt’s a pretty unadventurous title that matches the content of the film. Directed by Steve Beck and starring Gabriel Byrne, Desmond Harrington, Ron Eldard and Julianna Margulies, plot finds a salvage crew discovering a long lost passenger liner out in the remote Bering Sea. With the laws of the sea stating that they can keep what they find, they are delighted to find gold on board. But it’s not long before strange things start to happen.\r\n\r\nIt starts of real well with a bloody and gruesome prelude, the production design is super and everything is in place for a chiller out there in the foggy waters. Unfortunately what we actually get is a predictable series of clichés cribbed from better movies of the past, none of which capable of eliciting a genuine scare. The makers think that having a bombastic techno score accompanying the dramatic moments will make them appear more shocking. It doesn’t, while the cast are ill served by direction and writing.\r\n\r\n\r\nHorror 101 for beginners. 3/10", "created_at": "2014-07-24T13:59:16.095Z"}, {"movie_id": 9645, "review_id": "592ee96192514130eb00fcce", "author_rating": 3.0, "review_text": "I remember thinking this was good as a child... I was wrong.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2017-05-31T16:03:45.885Z"}, {"movie_id": 9645, "review_id": "5b2e95ec0e0a2657d4007a61", "author_rating": 7.0, "review_text": "Ghostly happenings on a decades-lost lost ocean liner \r\n\r\nRELEASED IN 2002 and directed by Steve Beck, \"Ghost Ship\" revolves around salvagers finding a mysterious ship in the Bering Sea that's been lost for four decades and they intend to claim it, but things go from strange to worse as they board the eerie vessel and try to tow it to harbor.\r\n\r\nThe cast is strong, headed by Gabriel Byrne. Emily Brown appears as a 12 year-old girl. Julianna Margulies looks fine but they don't do enough with her. Francesca Rettondini is also on hand. Let's just say the low-budget \"Ghost Voyage\" (2008) is better in the area of women.\r\n\r\nStill, the ship sets are excellent and it certainly seems like they shot the film on a real vessel. Interestingly, the Antonia Graza of the movie is a replica of the Andrea Doria.  Other positives include: The refreshing score with “Not Falling” by Mudvayne thrown in for good measure; a nice haunting atmosphere at sea with one creepy scene reminiscent of the excellent “Dead Calm” (1989); potent visuals of the formidable vessel looming over the tugboat; plus some good thrills, notably one of the greatest horror scenes in the history of cinema in the prologue, no kidding. There's also a decent revelation thrown in at the end.\r\n\r\nIf you like this one be sure to check out the aforementioned \"Ghost Voyage,\" which is a TV movie. \"Ghost Ship\" was released to theaters and obviously had a bigger budget, but that doesn't mean it's better, just that it's more polished.\r\n\r\nTHE FILM RUNS 91 minutes. WRITERS: Mark Hanlon and John Pogue.\r\n\r\nGRADE: B", "created_at": "2018-06-23T18:48:12.708Z"}, {"movie_id": 9645, "review_id": "5f63d7251684f700394bcd30", "author_rating": 5.0, "review_text": "Another second viewing flick, wasn't a big fan the first time and basically thought the same now. There are some fun cheesy moments here and there but kind of like Thirteen Ghosts (same director), has some interesting ideas that don't amount to much. Course, I'm also not much of a fan of supernatural horror movies as they play fast and loose with the rules. **2.5/5**", "created_at": "2020-09-17T21:37:41.269Z"}, {"movie_id": 9645, "review_id": "5f6ab7facee2f60034301b9c", "author_rating": 6.0, "review_text": "Besides **THAT** epic death scene, this movie is mildly entertaining.\u2028It has flaws and a terrible story, which I admit the reveal was amusing.\u2028If you like terror on the seas but amusingly bad to riff on, this’ll be the movie.\u2028That opening scene is memorable for a reason though and basically overshadowed the rest of the movie.", "created_at": "2020-09-23T02:50:34.559Z"}, {"movie_id": 9645, "review_id": "6467730133a376011ec332ca", "author_rating": 6.0, "review_text": "The beginning and the end of this movie is really the only good thing about the movie. Everything else is just a crew chasing around a ghost girl trying to figure out what happened to her. Pretty boring.", "created_at": "2023-05-19T13:00:49.607Z"}]