[{"movie_id": 284053, "review_id": "59f09b979251416ac10169f7", "author_rating": 8.0, "review_text": "_Ragnarok_ is a tough one to review completely without spoiler, so I'll keep this brief:\r\n\r\n* I was bothered by a small number of things that happened in this movie.\r\n* I was in love with a large number of things that happened in this movie.\r\n* _Thor: Ragnarok_ is not the MCU's best movie.\r\n* _Thor: Ragnarok_ is the MCU's most fun movie.\r\n* Can we **please** have a worldwide ban on putting anything that happens in the third act of your movie, in said movie's trailers?\r\nThank you for your time. 4 stars.\r\n\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2017-10-25T14:11:35.487Z"}, {"movie_id": 284053, "review_id": "5a08bdccc3a368672a006056", "author_rating": 8.0, "review_text": "The Best CBM movie of 2017\r\n\r\nThe film is one of the most entertaining of the MCU films so far and a HUGE improvement over Thor: The Dark World. Cate Blanchett as the villainess Hela, the Goddess of Death, is a far better villain that TDW's lame Malekith. Kat Dennings' annoying Darcy and Natalie Portman's bland Jane are not missed at all. Instead, we get Tessa Thompson's badass Valkyrie, who can hold her own in a fight and isn't just there just as a love interest for Thor (Chris Hemsworth). Jeff Goldblum is hilarious as Grandmaster, who runs the gladiator fights on the planet Sakaar. But the real pleasure of the movie is watching the love-hate brother relationship between Thor and his adoptive brother, Loki (Tom Hiddleston). The relationship between the two men was the only redeeming feature of TDW, and it's great to see it expanded in this movie. Also great is seeing Thor buddy up with Bruce Banner/ Hulk (Mark Ruffalo). The only thing I didn't like about the movie was the fate of The Warriors Three. They deserved better than that. But otherwise, it's a great comic book movie.", "created_at": "2017-11-12T21:31:56.063Z"}, {"movie_id": 284053, "review_id": "5c842588c3a3684e9ddb0434", "author_rating": 8.0, "review_text": "From minute one, Thor Ragnarok bursts onto the screen with a new found energy, style, Jeff Goldblum, beautiful use of colours and shot compositions, an amazing 80s inspired music score, and comedy that's actually funny. Somehow, Thor Ragnarok is both the darkest film in the entire MCU given that it deals with the destruction of an entire world, and the most lighthearted.\r\n\r\nThor Ragnarok is very much a Taika Waititi film that uses Marvel lore and characters. It has many shocking twists, turns, witty comedy, and pleasant re-introductions (and introductions) to some of the MCU's best characters that I can't wait to see more of. Oh, and did I mention this movie has Jeff Goldblum?!", "created_at": "2019-03-09T20:43:52.187Z"}, {"movie_id": 284053, "review_id": "5ca977ae0e0a264c88f3411f", "author_rating": 8.0, "review_text": "This movie sets a new bar for the MCU. It's funny, entertaining and VERY fun. It takes a completely different yet good turn from the past 2 movies and is a colourful blast.", "created_at": "2019-04-07T04:08:14.999Z"}, {"movie_id": 284053, "review_id": "5dc33022470ead00138c6f0b", "author_rating": null, "review_text": "Too bad. I loved the first two Thor movies and was expecting that the third one will hold up to the quality of the first two. But I guess today it's really hard to pull off a trilogy that'll ring throughout the years like how the Wachowskis did with the Matrix.", "created_at": "2019-11-06T20:42:10.404Z"}, {"movie_id": 284053, "review_id": "5dc38a4a9d8939001334efa2", "author_rating": null, "review_text": "Marvel films are known for sneaking humor in between action sequences, but I don't know what they did with this one. The choreography was lame and I don't understand why Thor felt like he was trying too hard to be funny.", "created_at": "2019-11-07T03:06:50.053Z"}, {"movie_id": 284053, "review_id": "5dc393938d22fc00123d44ee", "author_rating": null, "review_text": "Despite all the hate surrounding this movie, I actually enjoyed it. If you're as big of a fan of \"Thor\" like me, then you pretty much just like everything that comes out with him on it.", "created_at": "2019-11-07T03:46:27.253Z"}, {"movie_id": 284053, "review_id": "5dc39979470ead00158d3072", "author_rating": null, "review_text": "Thor's character is great with the other Avengers,  but he just doesn't do that well as a stand-alone character with his own storyline. It's sad because he had so much potential too.", "created_at": "2019-11-07T04:11:37.874Z"}, {"movie_id": 284053, "review_id": "5dc56f3399259c00157e4553", "author_rating": null, "review_text": "Story could've been great but it seemed to me that the writers got lazy with the script and just opted to feed Thor some cheesy humor that made him seem like this kid who was trying too hard to be funny instead of the GOD of Thunder the first two films built him up to be.", "created_at": "2019-11-08T13:35:47.022Z"}, {"movie_id": 284053, "review_id": "5dc57a1e7d2bc10011400b0c", "author_rating": null, "review_text": "I'm a big fan of Thor but I just couldn't bring myself to like what they did to him in this film. I get that he's going through tough times but turning him from being a thundering, huge god to a man-child who shoots lightning is such an insult to Thor.", "created_at": "2019-11-08T14:22:22.316Z"}, {"movie_id": 284053, "review_id": "5e00eea1d1a89300128c2e28", "author_rating": null, "review_text": "I know not a lot of people found the humor to be funny but my family and I actually loved it!", "created_at": "2019-12-23T16:43:13.291Z"}, {"movie_id": 284053, "review_id": "5e01027b0284200019af51bd", "author_rating": null, "review_text": "As a big fan of stand-up comedy, I can say this one really delivered. Most of the jokes had perfect timing and executed in perfect deadpan. Would want another movie like this!", "created_at": "2019-12-23T18:07:55.997Z"}, {"movie_id": 284053, "review_id": "5e011b53d236e6001291b842", "author_rating": null, "review_text": "I really don't understand why everyone's hating this movie. I remember myself and everyone else in the cinema, laughing our asses off all throughout the movie.", "created_at": "2019-12-23T19:53:55.649Z"}, {"movie_id": 284053, "review_id": "5e028667d1a89300198fb276", "author_rating": null, "review_text": "Childish humor, the same fight scenes and although I gotta say that the plot was creative, it still didn't do it for me.", "created_at": "2019-12-24T21:43:03.726Z"}, {"movie_id": 284053, "review_id": "5e09008026dac1001477b72f", "author_rating": null, "review_text": "This wasn't the Thor movie I expected. Seeing as Marvel did so well with the first two Thor films, I'm surprised this turned out to be a big joke.", "created_at": "2019-12-29T19:37:36.943Z"}, {"movie_id": 284053, "review_id": "5e0922a42fccee00155d9580", "author_rating": null, "review_text": "If you enjoy 8 year old humor and cheesy one-liners, then go ahead and watch this movie. Otherwise, go pick another film.", "created_at": "2019-12-29T22:03:16.578Z"}, {"movie_id": 284053, "review_id": "5e09ba4d635e780018412f6e", "author_rating": null, "review_text": "Meh it passed the time. I honestly didn't hate the film but didn't find it to be as entertaining as the other films Marvel has already put out.", "created_at": "2019-12-30T08:50:21.487Z"}, {"movie_id": 284053, "review_id": "5e0e0c99c2f44b00172f8c0b", "author_rating": null, "review_text": "This does it for me. I expected more from Thor as he is the God of Thunder and you could do so much with him but they weren't able to do that in this film.", "created_at": "2020-01-02T15:30:33.568Z"}, {"movie_id": 284053, "review_id": "5e0e16ac12c60400123f3f42", "author_rating": null, "review_text": "Thor's soundtrack was always cool, but not on this film.", "created_at": "2020-01-02T16:13:32.100Z"}, {"movie_id": 284053, "review_id": "5e0e20db6dc6c000134d418d", "author_rating": null, "review_text": "The two earlier Thor films had a more \"godlike\" tone to them. Why not keep that and use it with the third one? This is a huge downgrade for Thor.", "created_at": "2020-01-02T16:56:59.387Z"}, {"movie_id": 284053, "review_id": "5e0e2a3212c60400143fbd43", "author_rating": null, "review_text": "Thor is a funny guy, yes, but he is not in any way childish. I'm disappointed because I really did enjoy his brand of humor in the other Avengers films.", "created_at": "2020-01-02T17:36:50.329Z"}, {"movie_id": 284053, "review_id": "5e0e40e368b1ea00157fcc6d", "author_rating": null, "review_text": "If you expected too much, then prepare to be disappointed. No epic battles with the valkyries, no Fenrir eating everything that remains, and no Loki bringing death to Asgard.", "created_at": "2020-01-02T19:13:39.680Z"}, {"movie_id": 284053, "review_id": "5e0e52d1fd4f8000155fb205", "author_rating": null, "review_text": "Despite the many negative reviews surrounding the humor in this film, I was surprised to see that I actually liked it! It's still not that good of a film but once you get into the story, it could be enjoyable.", "created_at": "2020-01-02T20:30:09.557Z"}, {"movie_id": 284053, "review_id": "5e0f0a77d64ac200185daaa3", "author_rating": null, "review_text": "Thor, the goofball of thunder. Mindless comedy and cheesy lines rather than real character development.", "created_at": "2020-01-03T09:33:43.250Z"}, {"movie_id": 284053, "review_id": "5e0f3b1bd64ac200185e25e1", "author_rating": null, "review_text": "I blame myself for expecting too much from Marvel. They already flopped with the second Thor film and it looks like they're not gonna be redeeming themselves with this one either.", "created_at": "2020-01-03T13:01:15.210Z"}, {"movie_id": 284053, "review_id": "5e107864663b870015817a3e", "author_rating": null, "review_text": "Nothing to offer other than childish humor and not-even-funny jokes. Even the VFX on this movie sucked,", "created_at": "2020-01-04T11:35:00.053Z"}, {"movie_id": 284053, "review_id": "5e1218f0d8af670014bcda84", "author_rating": null, "review_text": "The reason why people don't enjoy this film is because they just expect too much. You can't just have Thor doing the same thing over and over again. Right now he's taken on a different direction of character development but he is still the God of Thunder.", "created_at": "2020-01-05T17:12:16.623Z"}, {"movie_id": 284053, "review_id": "5e124a795907de0017de90c1", "author_rating": null, "review_text": "Honestly, I enjoyed it. Not as much as the first Thor film but it still was good popcorn fun.", "created_at": "2020-01-05T20:43:38.001Z"}, {"movie_id": 284053, "review_id": "5e125daaae26be00144aa8e0", "author_rating": null, "review_text": "Still good, family fun. We ain't no die-hard Marvel fans but we still were able to enjoy it and have good laughs all throughout.", "created_at": "2020-01-05T22:05:30.144Z"}, {"movie_id": 284053, "review_id": "5e12c5f4d8af670016be26b6", "author_rating": null, "review_text": "They sure did take things too far with this one. One joke after another and at one point I was confused whether I was watching a superhero film or a parody.", "created_at": "2020-01-06T05:30:28.115Z"}, {"movie_id": 284053, "review_id": "5e12ca0c9020120018b75d92", "author_rating": null, "review_text": "I've seen some bad movies before so I know what I'm saying when I say that this is definitely one of them.", "created_at": "2020-01-06T05:47:56.869Z"}, {"movie_id": 284053, "review_id": "5e12ce025907de0017dfa141", "author_rating": null, "review_text": "I hate how they had to make everything seem funny. Thor is a funny guy but that doesn't mean his film has to be made entirely into a comedy.", "created_at": "2020-01-06T06:04:50.686Z"}, {"movie_id": 284053, "review_id": "5e12d20dfc5f06001590b4e8", "author_rating": null, "review_text": "I personally think it's a step towards the wrong direction. I hope they don't let Thor end up a goofball.", "created_at": "2020-01-06T06:22:05.800Z"}, {"movie_id": 284053, "review_id": "5e20d657cf4b8b0017ef0a6d", "author_rating": null, "review_text": "If my kids love it, then I love it too. I actually like this kind of Thor more as he is much more kid-friendly.", "created_at": "2020-01-16T21:32:07.197Z"}, {"movie_id": 284053, "review_id": "5e20dfd5397df00012966900", "author_rating": null, "review_text": "Alright it looks like Thor finally is done with all that stiff, royalty thing and is now free to do his own thing. Sounds good to me!", "created_at": "2020-01-16T22:12:37.359Z"}, {"movie_id": 284053, "review_id": "600a40912d531a005562f0ea", "author_rating": 9.0, "review_text": "<em>'Thor: Ragnarok'</em> continues the upward direction of the <em>'Thor'</em> films.\r\n\r\nI had a blast with this. I thoroughly enjoyed seeing the story unfold, the score is terrific, the new and old cast members are great and there's a lot of amusement in there too. It's superb, it's my third favourite MCU film at this stage.\r\n\r\nDon't get me wrong, I like the 2011 original but that's turned out to be the weakest of the three. I found <em>'Thor: The Dark World'</em> to be a fairly major improvement on that, this 2017 is narrowly better than that aforementioned 2013 release. Bring on <em>'Thor: Love and Thunder'</em>!\r\n\r\nChris Hemsworth is quality in the lead role, I found him super enjoyable in this second sequel. Big fan of his new hairstyle, by the way. This is also the most I liked Tom Hiddleston in an MCU film. Jeff Goldblum, Cate Blanchett and, particularly, Tessa Thompson are fab additions. Shoutout to (director, as well!) Taika Waititi also, he made me laugh a fair few times as Korg.\r\n\r\nGreat film, oh and I love the nod to a certain 1971 Quaker Oats Company-induced film... nicely done.", "created_at": "2021-01-22T03:03:45.830Z"}, {"movie_id": 284053, "review_id": "63c216bba5743d00b0bfab77", "author_rating": 5.0, "review_text": "OK, this isn't what the advertisements say, at least its not the best Marvel movie (I think that title stills goes to Winter Soldier). That being said, it IS the best Thor movie.\r\n\r\nIt is certainly an escape from the normal Thor movies. It's an escape from the Asgardcentric feel of Dark World. And, well, the best parts of the first Thor were the parts when he was on Earth.\r\n\r\nHere we have more humor in the film, which isn't unique for Thor, but this one has more of an Antman feel, or at least it has the humor we saw in the Thor Spots around Civil War.\r\n\r\nIt works, the humor plays very well and it's done, well, perfectly. Thor's humor is almost in the vein of a jovial meathead and a very likable one. Plus, Chris Hemsworth has great comedic timing and sensibilities. He knows how to deliver a joke in a believable way without going over-the-top.\r\n\r\nIt works.\r\n\r\nAnd, of course, Tom Hiddleston works exceptionally well with the lead.\r\n\r\nMark Ruffalo has returned and he has been gone far too long. Far too long. And, really, Hulk is the best character to pit with Thor, both in his green form and as Banner.\r\n\r\nI'd go further, but that would lead into spoilers, but it was nice to see a spin on World War Hulk, and it did leave the door wide open for another Thor story...\r\n\r\nAnd if they do continue this saga, it would be wonderful to see it done in the same way.\r\n\r\nThis was a great break from the previous Thor films, which, especially with Dark World, felt kind of like a chore.", "created_at": "2023-01-14T02:43:07.206Z"}]