[{"movie_id": 493922, "review_id": "5b25dbd8c3a36841fc00a043", "author_rating": null, "review_text": "It would seem the Hollywood tradition started in the 1980's of false reviews made by either non-existent people or people paid to write glowing assessments is alive and well.\r\n\r\nThat is my only way of explaining why this film is so highly regarded.  I went to the user review area of IMDB just to see if I was missing something or if others thought this good looking, atmospheric, well acted two hour slog sucked as well.  To my relief I found I was not alone.\r\n\r\nWhat we have here is a case of style over substance.  There is really nothing to \"hang your hat on\" with regards to what is happening to the family featured.  When the reveals start coming they are either obvious or trite.  The ending is complete crap, especially after the two hour journey to get to it.\r\n\r\nThe scariest scene happens early on and is not in any way supernatural.  After, we just go on and on and round and round and can only assume the mother is mentally ill.  That she is imagining everything that is \"odd\" or causing it herself.  When that proves not to be the situation, the denouement we are given is, again, craptastic and straight out of any run of the mill Z grade made for VOD horror movie plot.\r\n\r\nThis has been compared to \"The Exorcist\" but do not let that fool you.  This is no \"Exorcist\" or even anything close.\r\n\r\nAt best this is a film about a family dealing with mental illness.  Only not!", "created_at": "2018-06-17T03:56:08.614Z"}, {"movie_id": 493922, "review_id": "5b6a3b370e0a267ef810bce9", "author_rating": 9.0, "review_text": "While psychological horror movies seem to be a thing of the past, with movies of this nature cropping up once every little while, _Hereditary_ creeps along with the force of looming evil. This isn't an average Halloween, popcorn-at-the-theatre moviegoing experience. Instead, what we are presented with is palpable heaviness for the better half of two hours while tensions rise in a dwindling household and with some burgeoning Satanic undertones encapsulated in some of the darkest, most isolating atmosphere that contends with the likes of _The Witch_ and _Rosemary's Baby_.\r\n\r\nToni Collette plays Annie Graham, mother of two children - eldest son in high school, the youngest a girl possibly at the tail-end of middle school. With the recent death of her mother, Annie attempts again and again to reconcile with the misfortunes - to put it lightly - that befalls her family. Annie's psychological state dances between the forefront of the film, while the backdrop of lingering family turmoil boils to the top.\r\n\r\nThis is an unrelenting experiment in acceptance, both placed on the key figures in the film, as well as those watching. When watching, keep in mind the word \"control\" and discern whether Annie had any at all. This isn't a movie for anybody - I'd go far as to say that this movie isn't for the average moviegoer. There are certain plot points that don't make sense. But if you go into this knowing what the director was trying to do, which, in my opinion, was to make the viewer feel completely uncomfortable while paying homage to some great horror movies, then it will be a rewarding watch.", "created_at": "2018-08-08T00:37:11.958Z"}, {"movie_id": 493922, "review_id": "5bb6eeb50e0a2633a0022114", "author_rating": 7.0, "review_text": "Simple Simon met the Pieman playing with a knife. Said Simple Simon to the Pieman: \"Will you take my life?\"\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-10-05T04:55:17.423Z"}, {"movie_id": 493922, "review_id": "5cc15019c3a368708f80ad23", "author_rating": 7.0, "review_text": "**_Rewards concentration_** [contains spoilers]\r\n\r\n> _The 9th spirit in order is Paimon; a great king, & very Obedient to Lucifer, he appeareth in the forme of a man, sitting upon a dromedary, with a Crowne most glorious on his head. There goeth before him a host of spirits like men with Trumpets and well sounding Cymballs, and all other sorts of musicall Instruments &c. he hath a great voice, and roareth at his first comming, and his speech is such as the Magician cannot well understand, unless he compelleth him. This spirit can teach all arts and siences, and other secret Things; he can disc__over what the Earth is, and what holdeth it up in the waters, & what the wind is or where it is, or any other Thing you desire to know, he giveth dignity and confirmeth the same, he bindeth or maketh a man subject to the Magician if he desireth it he giveth good familiars, and such as can teach all arts, he is to be observed towards the North west, he is of the order of dominions and hath 200 Legions of spirits under him, one part of them is of the order of Angells & the other of Potentates, If you call this spirit Paimon alone you must make him some offering to him & there will attend him 2 kings called Bebal & Abalam, & other spirits of the order of Potentates in his host are 25 Legions because all those spirits which are subject to him, are not allwayes with him unlesse the Magician compelleth them. His Character is this which must be worn as a Lamen before thee &c._\r\n\r\n- \"_Ars Goetia_\", in _Clavicula Salomonis Regis_ [_Lesser Key of Solomon_] (17th century)\r\n\r\nWhen her secretive mother dies, miniatures artist Annie Graham (Toni Collette), is almost relieved, as the two had a deeply fraught relationship. With two children, 16-year-old Peter (Alex Wolff) and 13-year-old Charlie (Milly Shapiro), and a loving husband, Steve (Gabriel Byrne), Annie is determined to do a better job of raising a family than she felt her mother did. However, when she suffers another, far more devastating loss, Annie's mental state becomes increasingly precarious, as a series of terrifying revelations about her ancestry are slowly revealed.\r\n\r\nHereditary is writer/director Ari Aster's debut feature. However, what's worth noting is that the film is produced by Lars Knudsen, who also produced _The VVitch: A New England Folktale_ (2015). This is significant insofar as _Hereditary_ bears more than a passing resemblance to Robert Eggers's film. Mood, tone, theme, pacing, narrative structure, shot composition; all recall _The VVitch_ at times. Even the plot shares some important beats, most evident in the last shot, which is both narratively and compositionally identical to the shot in _The VVitch_ when Black Phillip speaks for the first time - a BCU on a possessed character as a disciple speaks off camera. And like _The VVitch_, you either go with the plot and let it burrow under your skin, or you remain detached and most likely find the whole enterprise unintentionally hilarious.\r\n\r\nIn a more generalised sense, there is quite a bit to praise here. For a start, to say the film is a horror is to basically give away the last 20 minutes, as up until that point it's a superbly realised semi-realist study of the crippling psychological disintegration that can accompany bereavement. Speaking of giving things away, very unusually for a Hollywood film, _Hereditary_'s trailer brilliantly misdirects the audience, making it seem as if the film revolves around the death of Annie's mother, when in actual fact, this plot strand is abandoned at the end of the first act, after which the death of Charlie becomes the central focus.\r\n\r\nOne thing the film does especially well is reward viewers who are paying attention. There are multiple hints and signs throughout of what is going to happen in the last act, and one especially well structured reward involves by far the creepiest moment in the film; the blond man standing in the shadows of the doorway, barely visible, smiling manically at Peter. This is actually the second time we see the character; he is also at the wake early in the movie, watching Charlie approaching the coffin, and, again, smiling unnaturally. This can be easily missed if you're not paying attention, and it's an extremely well realised pseudo-Easter egg. Also worthy of praise is Toni Collette, who gives a superb performance that partly recalls Shelley Duvall's hysterics in Stanley Kubrick's _The Shining_ (1980). Collette's ability to communicate everything in her psyche by simply changing her facial expression is outstanding, and somewhat reminiscent of that extraordinary piece of wordless acting by Halle Berry in the last scene of Marc Foster's _Monster's Ball_ (2001). This is especially noticeably towards the end of the film, when Annie is alternating between being herself and being controlled by Paimon; Collette's mastery of her own facial expression tells the audience everything it needs to know about what is happening.\r\n\r\nJoshua Rothkopf, in his review of the film for _Time Out_ calls it \"_a new generation's_ Exorcist.\" That's a bit over the top; it won't have half the same kind of societal impact as William Friedkin's film did, and it's nowhere near as good as the best horror film of the last few decades, Daniel Myrick and Eduardo Sánchez's _The Blair Witch Project_ (1999). However, it's very well made, is creepy as hell, dares to put real grief on screen, and features excellent performances (and, thankfully, only a couple of jump scares). Well worth seeing.", "created_at": "2019-04-25T06:13:45.966Z"}, {"movie_id": 493922, "review_id": "6058e8e3b39e3500544b42bb", "author_rating": 10.0, "review_text": "I've been meaning to watch this movie for a while now and made the mistake of watching this 12 at night while I was alone (Don't do that!) Usually horror movies don't effect me and if they do its usually while the movie is playing. But this movie has stayed with me for days now. I can't get it out of my head. This is not a movie for someone who wants jump scares, slasher death/screams or a movie that plays in the background. You have to actually pay attention or you will be completely confused at the end. There are subtle hints throughout the movie to show you where the movie is headed but there are still surprises throughout. \r\n\r\nThe acting is very good. I have to say though I love Toni Collette and that was one of the main reasons I watched it. ***Spoilers Start*** Toni Collette and Alex Wolff do an amazing job carrying this movie. After Charlie's death, the look on Alex's face conveys so much that words are not necessary to understand that shock he is under. There is no overacting or crying or screaming just shock and utter disbelief.***Spoilers End*** Everyone in the family does an amazing job in their roles. Charlie is just so creepy throughout the movie. You empathize with all of them and understand their frustrations even while knowing some of their decisions are just plain wrong.\r\n\r\nThough there are no conventional jump scares the atmosphere of the movie has you on edge the whole time. There is a building of tension between the family from all things unsaid about their past/current trauma and the grief that they are currently going through that comes to a head. Watching this family completely come undone is emotionally heavy but also  has terrifying consequences. \r\n\r\nDefinitely a must watch if you like horror. But not for people who want to be scared in the moment with killings and jump scares.", "created_at": "2021-03-22T18:58:43.670Z"}, {"movie_id": 493922, "review_id": "653f060350733c013e351cdf", "author_rating": 8.0, "review_text": "<em>'Hereditary'</em> is strong horror fare!\r\n\r\nI did find the opening half of the film the strongest, in the second half I lost interest ever so slightly and the ending underwhelms a tiny bit. It does, however, do impressive work in creating an unsettling environment to tell its story - there are one or two moments that did surprise me, a lot.\r\n\r\nToni Collette gives a brilliant performance, one that I couldn't possible pick any holes in - top stuff! Gabriel Byrne, Alex Wolff and Milly Shapiro are worthy of praise as well. They all manage to add so much life and believability to the plot, even towards its more fantastical conclusion.", "created_at": "2023-10-30T01:25:23.396Z"}]