[{"movie_id": 646389, "review_id": "63bf63cedf857c008140c62a", "author_rating": null, "review_text": "Brodie Torrance (Gerard Butler), is a recently widowed dad who looks\r\nforward to completing his nearly empty run from Singapore to Tokyo so he\r\ncan take advantage of the time difference and meet up with his daughter in\r\nHawaii in time to celebrate the new year.\r\n\r\nIn the new film “Plane” things do not go as planned as the nearly empty\r\nthe flight also hosts a prisoner transfer as a dangerous fugitive named Louis\r\n(Mike Colter), is brought onto the flight late.\r\n\r\nForced by a corporate officer to fly through a storm they were told would\r\nbe clear by the time they reached it to save time and fuel, the flight\r\nencounters severe issues and soon find themselves without avionics and\r\nforced to make an emergency landing on an island.\r\n\r\nUnable to send for help and unsure of their exact location, Brodie learns\r\nthat they are on an outer island of the Philippines and that there is only\r\ninsurrectionists and militia on the island and that the military or police\r\nare not options.\r\n\r\nWhile attempting to find a way to contact help, Brodie enlists Louis to\r\nhelp and soon finds that the passengers and crew have been taking hostage\r\nby a brutal local militia.  Forced to improvise rescue and wait for\r\nhelp, the tense and violent situation quickly becomes a living nightmare\r\nas they fight to survive.\r\n\r\nThe tension level of the film is great as the early segments in the plane\r\ndid a great job of showing the routine of a pilot and also ramped up the\r\ntension. I can be a nervous passenger when a plane gets into bad weather\r\nand I found my palms getting sweaty and anxiety creeping in during the\r\ndetailed sequences of the flight in peril.\r\n\r\nThe action of the film was engaging as were the characters as they were\r\neasy to pull for despite not having much in the way of backstory or\r\ncharacter development.  The film has plenty of action as was engaging from\r\nstart to finish which makes “Plane” a pleasant diversion and one fan of\r\nButler will not want to miss.\r\n\r\n4 stars out of 5", "created_at": "2023-01-12T01:35:10.840Z"}, {"movie_id": 646389, "review_id": "63dac03a3dc313007d812398", "author_rating": 6.0, "review_text": "I was pleasantly surprised by Plane. Going into it, I had pretty low expectations as it seemed to be a cheap, action flick that was built for the dad's in our life. But there were some pretty good performances, set pieces, and brutal action that raised this movie from mediocrity.\r\n\r\nThe plot is incredibly bare bones: a plane gets damaged in a storm and crash lands on a desolate island. We've seen this used in countless films and TV shows throughout the years but, the way this is handled is pretty incredible. We see it from the pilots perspective as he and the stewards are trying to navigate the situation to create the best course of action to survive. It was done in a very believable way, giving us a glimpse at crash landing procedure and how truly indestructible planes are. The entire 30-minutes sequence had me on the edge of my seat even though I knew it was coming from a mile away. The CGI in this section was quite rough though as the plane looked like something rendered in an Xbox 360 game.\r\n\r\nThe movie does fall into some pretty classic tropes in movies like this. One being that almost all the \"good\" people are the classic white American men and woman, but the \"bad\" people (the island combatants and our main prisoner hero) are individuals of color. It is subtle, but something I noticed that slightly rubbed me the wrong way. Also the depiction of how the Philippines refused to assist in their own territory was laughable. But it opened the way for the good men of the American military were there to save the day and kill some island terrorists. It has some minor military propaganda that didn't totally take away from my experience, but worth a mention. \r\n\r\nThe performances were all pretty good. Gerard Butler played his usual role, I enjoyed his charisma as a pilot but also the gruff and militaristic persona he pulled out from his previous service. Mike Colter was great as the ultimate badass of the movie, killing terrorists with whatever he could get his hands on. This was nothing against his performance, but I hated how they wrote his characters ending in the film. It did not do his character arch any justice and felt out of place. The rest of the cast was decent.\r\n\r\nOverall, this movie delivers exactly what it promised in a short concise runtime and I cannot ask any more than that.\r\n\r\nScore: 63%\r\nVerdict: Decent", "created_at": "2023-02-01T19:40:42.532Z"}, {"movie_id": 646389, "review_id": "63e3e1b17304b500c9f5ffac", "author_rating": 6.0, "review_text": "May contain an odd spoiler \r\n\r\n“Plane” has a Scottish Pilot, Brodie Torrance ( Gerard Butler ) intent on getting his passengers to their destination in time to meet up with his daughter during the New Year festivities. However all does not go to plan when bad weather puts paid to any such activities and prematurely forces Brodie to make an emergency landing. During the attempt to land an FBI agent escorting a dangerous criminal, Louis Gaspare ( Mike Colter ), drops his mobile phone. Rather than leave it during a dangerous decent he tries to retrieve it only to loose both his life and that of a stewardess trying to help him. \r\n\r\nSurviving this landing on a remote island was not easy but the skills of Brodie saves the remaining passengers and crew. However far from praised for his actions the passengers decide it’s rather an inconvenience and complain constantly as the crew try to repair the communications. Unfortunately there is much more for the passengers to complain about once they are taken hostage by rebel forces who control the Island. More deaths ensue, however Brodie and his new friend, Louis are the only two to avoid capture after killing a few rebels along the way. Brodie and Louis work together to dispatch more rebels in an attempt to rescue the hostages.\r\n\r\nWhat ensues is a Die Hard style action thriller but based at New Year rather than Christmas. “Plane” does have some tense moments but very much ticks every Die Hard trope box it can. What is extremely notable, much like Die Hard, a rather large number of rebels are killed compared to hostages. In hindsight, as requested by Brodie, if I was Hans Gruber , sorry the rebel leader, I’d have let all the hostages go. I did enjoy this movie but for what it is, an action packed, nothing new , 1 hour 47 mins.\r\n\r\nNew tag line . Survive Together or Die Hard alone.", "created_at": "2023-02-08T17:53:53.436Z"}, {"movie_id": 646389, "review_id": "63e4bdaedb4ed60081220559", "author_rating": 6.0, "review_text": "OK, where is Jason Statham? He does these things so much better! Maybe he was off having an haircut so they decided to cast a distinctly wooden Gerard Butler as airline captain \"Torrance\" who is charged with flying his plane from Singapore to Tokyo before he heads on to his daughter's wedding in the USA. There aren't many passengers on his airliner, so to save cash and fuel he is directed to fly very near a violent storm that - well, next thing he has managed to land his sizeable aeroplane on a remote and lawless Filipino island (that luckily is replete with a dirt-track \"mining\" road that would not look out of place encircling Los Angeles). Now we happen to know that one of his few charges was also under the charge of the police, and now \"Brodie\" and the erstwhile captive - and useful - \"Gaspare\" (Mike Colter) must unite to fend off the venal bandits lead by their chief \"Junmar\" (Evan Dane Taylor) whilst getting a message to the rescue parties that can hopefully come and save their bacon. This film is so far-fetched that you might as well leave any need for reality at the door as you go in. The dialogue is pedestrian and the plot lurches from one implausibly half-baked scenario to another with consummate ease. That said, it hots up nicely for the last twenty minutes of gunfighting and that does rescue it a little from the mediocrity it probably deserves. It passed an hour and an half in the cinema easily enough, but it is not a film you will ever remember watching.", "created_at": "2023-02-09T09:32:30.913Z"}, {"movie_id": 646389, "review_id": "63e70b7b6c84920097fe96e2", "author_rating": 7.0, "review_text": "**Plane is a well-done action thriller with a solid lead and good fight sequences. Nothing more. Nothing less.**\r\n\r\nPlane is a low-budget action/survival movie that checks all the boxes and provides plenty of gritty Gun fights and brutal melee combat along the way. The film that didn’t spend much time picking a clever name also didn’t waste much time on character development. Instead, the plot is centered on Gerard Butler as he works to secure the safety and survival of a small group of passengers. Unfortunately, the island they crash-landed on is full of a bunch of pirate/terrorist types, so Butler does some shooting and punching, and choking to save the day. Plane won’t win any awards, but it is a solid action movie that I would watch again and recommend renting (probably not a whole $20 purchase to own, though) to any action fan. I’m glad it got a theatrical release so people can trust that it’s a little bigger budget and higher quality than most straight-to-stream action films.", "created_at": "2023-02-11T03:28:59.326Z"}, {"movie_id": 646389, "review_id": "641c1c7295c0af0084eba8e0", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"Plane exceeds low personal expectations. Originality, creativity, and deep exploration of themes or character arcs aren’t exactly part of the screenplay, but Jean-François Richet executes all his ideas in such an efficient manner that it fully justifies releasing in theaters instead of going straight to VOD. Gerard Butler uses his charisma to lead a by-the-numbers survival-rescue mission that surprisingly holds beautifully shot action sequences and quite high entertainment levels. A film that delivers what it promises and a bit more.\"\r\n\r\nRating: B", "created_at": "2023-03-23T09:31:30.932Z"}, {"movie_id": 646389, "review_id": "649e5ed38289a0011cc1c2d4", "author_rating": 6.0, "review_text": "**This movie is for entertainment purpose**\r\n\r\nAlthough the scenario is expected and there is nothing new in it, I enjoyed watching the movie, this type of movie that I can call popcorn movies that you see in the cinema or at home, and this type is fun doesn't require the viewer to think a lot during the show.\r\n\r\nGerard Butler was distinguished. sometimes i forget that he is an actor of action movies and he has similar movies. When you watch the movie, you feel that it is a film in the early 2000s, and this makes you feel that you need to watch this type of movies from time to time. The movie managed to grab my attention because there is a factor of isolation. Isolation in the air while boarding the plane and the problems that occurred during take-off and after landing on the ground, which is the isolation of staying on the island.\r\n\r\nImagine you land the plane in an area controlled by separatists and the killers are people who don't follow the law. This movie has become a kind of survival, which is the struggle for survival, and these movies have a large type of viewers, regardless of the usual plot and the familiar and expected ending.\r\n\r\nIf i am from the kind of audience whose movies only depend on the plot, I will criticize the movie from beginning to end, but there are sometimes movies that you should watch for fun, like Plane 2023. Cinema is the art of conversation, but it is also an enjoyable experience. Each movie has a specific goal for viewers. This movie is for entertainment purpose.", "created_at": "2023-06-30T04:49:23.592Z"}]