[{"movie_id": 597890, "review_id": "606e3e5bcd204600415b5967", "author_rating": null, "review_text": "The classic novel Lord of the Flies by William Golding  is not only a beloved classic but has been assigned reading for generations of students since it was first published in 1954. The book has been adapted into plays and films over the years and remains a chilling and poignant cautionary tale.\r\n\r\nIn the new movie “Voyagers” audiences are introduced to an Earth that has been ravaged by climate change and disease. In an effort to save the species; a grand experiment to genetically create a group of children who are the origins of a colonization effort is undertaken.\r\n\r\nThe planet is 86 years away so the decision is made that the children will be raised and trained indoors without any exposure to nature, open skies, fresh air, and other aspects they will be deprived of on the ship.\r\n\r\nRichard (Colin Farrell) decides to accompany the children on the mission as he wants to protect them and ensure things go as planned so their progeny will be well suited to continue on the mission to the next generation who will ultimately be the ones who colonize the planet.\r\n\r\nTen years into the mission things are going well until a discovery is made that a drink the children take daily known as “The Blue” is a drug used to suppress their emotions and keep them docile and easy to control.\r\n\r\nWhen friends Christopher (Tye Sheridan) and Zac (Fionn Whitehead); who learned the secret of the drug decide to stop taking it; they soon reveal the truth of their discovery to the rest of the children who in turn stop using the drug.\r\n\r\nIn no time rampant emotions, aggressions, desires, paranoia, and mistrust start to run wild and Zac becomes obsessed with Sela (Lilly-Rose Depp).  His unwelcome advances soon become more and more aggressive which causes Christopher and Richard to intervene and tragedy soon follows.\r\n\r\nChristopher and Zac soon find themselves at odds with one another and fear and paranoia lead the crew to form into factions and turn on one other which not only threatens the mission but their very survival.\r\n\r\nThe film was very engaging and while I saw the influence of Lord of the Flies early on; the engaging cast and setting make the film entertaining and enjoyable despite any really unexpected twists.\r\n\r\nThe young leads work well with one another and it will be very interesting to watch how their careers unfold in the years to come.  “Voyagers” is a refreshing new take on a classic tale and provides an entertaining and engaging adventure for viewers to enjoy.\r\n\r\n4 stars out of 5", "created_at": "2021-04-07T23:20:59.822Z"}, {"movie_id": 597890, "review_id": "606ecbf3629b2c006ef91d5c", "author_rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nWhen people ask me my favorite genre, I usually reply with the admittedly annoying and cliche \"I enjoy every type of film\". While this is ultimately true, I do tend to love sci-fi and a couple of other genres more than the rest. I find sci-fi to be one of the most creative filmmaking sources, partially due to the infinite potential of its storytelling. From extraterrestrial life to an exploration of deep space, our world knows so little of what's beyond our planet, which makes the respective genre a perfect framework for imaginative, unique fiction. Voyagers features an interesting cast, but Neil Burger was behind the disappointingly hollow Divergent saga, so I couldn't help but go in with very low expectations.\r\n\r\nEven anticipating a tough watch, I never thought Voyagers would be a contender for one of the worst flicks of the year. The general premise is far from being groundbreaking, even with the not-that-original spin that it puts on the \"colonization of another planet\" concept. Still, it's considered a formula because it worked on several other occasions. It just doesn't in this movie. The group of young people bred separately from the outer world could have received an innovative, inventive arc but instead follows an incredibly generic, dull, lazy character development path. The chaos and mayhem triggered by a single person - who just so happens to embody literally everything that's wrong with our society - is as extremely forced as it is utterly ridiculous.\r\n\r\nIn fact, it even raises logical questions regarding the premise of the film. Obviously, people can be born into the same place with the same education, morals, and everything that comes with growing up and still develop a distinct personality. However, Burger doesn't demonstrate why some characters end up challenging the authority and questioning their purpose. Everything happens because it needs to happen. A character performs an irrational action because the plot demands it. Most of the story development is given through absurdly childish dialogues, where a character repeatedly asks \"why?\" to someone with some sort of an answer.\r\n\r\nBurger's screenplay barely survives due to the lack of any exciting characteristic. From an obviously misleading subplot to the frustratingly predictable main narrative, this movie carries zero surprises. The horrendously choppy, abrupt editing work (Naomi Geraghty) turns an already complicated watch into something borderline irritating. Add weirdly creepy, nonsensical imagery of random life events on completely arbitrary points of the runtime, and Voyagers becomes a really hard film to genuinely enjoy. With no flow between scenes, the primary mission is lost in the first minutes, and the characters fail to complete any resemblance of an arc.\r\n\r\nActually, it's ironically funny how Isaac Hempstead Wright (Bran Stark in Game of Thrones) continues the trend of not doing anything relevant in a movie or TV series. Unfortunately, not even the cast saves this disaster. Tye Sheridan (Dark Phoenix), Lily-Rose Depp (Crisis), and Fionn Whitehead (Dunkirk) try their hardest with the poor scripts, but some line deliveries are truly cringe-worthy. Colin Farrell's (The Gentlemen) character suffers from one of Burger's numerous bad decisions, ending up as yet another forgettable component of the film. The ending arrives way too fast, something that attests to the way too fast pacing.\r\n\r\nIn these cases where I struggle to find positives in the two pillars of any movie - story and characters - I turn to the technical elements to help me out. Sadly, Voyagers is one of the rare one-location films that doesn't feel suspenseful or claustrophobic, despite many efforts. From the surprisingly ordinary score (Trevor Gureckis) to the by-the-numbers camera work (Enrique Chediak), there's not a single aspect I can take with me as an \"at least that was great\" thought. I guess the set design looks futuristic enough for a spaceship, but once again, it's nothing viewers haven't seen before.\r\n\r\nVoyagers holds a well-known, successful sci-fi formula and takes it through the most uninteresting, unsurprising, frustratingly generic development path. Neil Burger's screenplay fails to deliver a creative, captivating story with compelling characters, offering the complete opposite. From the terrible editing work to the extremely lazy plot development, passing through cringe-worthy dialogues and randomly weird, irrelevant imagery, it's tough to find a positive aspect in such a hollow movie. Even though most of the runtime is spent in a single location, the suspense levels are close to zero. The themes of the story are clear from the get-go, but the execution of almost every plot point or character action feels incredibly forced. The set design is the only technical component worthy of some appreciation. Not even a talented cast can overcome the awful scripts. A contender for one of the worst films of the year.\r\n\r\nRating: D-", "created_at": "2021-04-08T09:25:07.827Z"}, {"movie_id": 597890, "review_id": "606edddbd4fe0400572261ef", "author_rating": 4.0, "review_text": "It's always nice to watch some unpretentious and industrious Hollywood B-movie science fiction in a cinematic landscape dominated by franchise-obsessed, superhero-crazed tentpoles. Unfortunately, 'Voyagers' never transcends its derivative origins and basic thrills.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-voyagers-an-overly-familiar-journey", "created_at": "2021-04-08T10:41:31.899Z"}, {"movie_id": 597890, "review_id": "60df16bbd0b434007f0645be", "author_rating": 8.0, "review_text": "**A -HIGHLY- Intelligent & Thought 🌠 Provoking\r\nMovie , Stylistically & Visually -FANTASTIC- . . . But One That Is Somewhat \" -_DIVERGENT_- \" From Its MPAA Certified PG-13 Rating 🤷‍♂️ .**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Mini Review .\r\n______________________________________________________ \r\n\r\nChristopher : \" Maybe this is our true nature \" .\r\nRichard : \" That's  a profound thought \" .\r\n______________________________________________________ \r\n\r\nI've -actually- come across -atleast- a 100 reviews on IMDb ( -_a similar forum to this one_- ) slamming 'Voyagers' for being, in essence : \" -{ Not Much More }- than an ( outer space ) rip-off of a certain acclaimed author's novel -turned film- { \"Lord of the Flies\" ( 1954 ) }. Here is my response to that accusation , in earnest. -All- Directors , & -All- Artists , frankly... are -{ Constantly }- being \" inspired \" by prior artistic works, &  \" borrow \" from them far more often than we may 'readily' be prepared to admit. I would like to make it entirely clear that this most certainly -{ Not }- the same thing as 'ripping-off', 'plagiarizing', or 'stealing'. For the seemingly -endless- \r\ncontrarians on IMDb that have ruthlessly, even viciously, accused this undeniably -{ Enthralling }- Space 🌌 thriller's super-talented Director Neil Burger, { known best for the critically rejected yet -popularly- \"Colossal\" 'Divergent' ( 2014 ) }, of doing just that : Kindly note the 'following' . \" I'd be 'willing-to-bet' that if the bespoke 'literary late great', Author & Nobel Laureate William Golding, were somehow able to publicly opine on the \r\nmatter from the great-beyond ; he would be rather -{ Unequivocal }- in lavishing praise on -{ This }- particular iteration.... { of that age-old \" _**Darkness-Of-Man's-Heart**_ ( etc. ) \" theme } ....presented here as a grand scale \"Cinematic Thought-Experiment\" of sorts. The pointed, Unbridled critique of the frailty of human nature offered in the picture, along with its perfectly paced and -unabashed- study of how 'Serious-immorality' can rear its ugly head in literally -{ Any }- given social setting, is, in point of fact, completely & utterly **\" FASCINATING \" ,** at the very -least- . Even just as a pure work-of-Art, the film works Beautifully 💙 , 'in it's own right'. Moreover, the ( somewhat ) \"fresh-faced\" ensemble of 'Up-and-comers', led by none other than veteran actor Colin Farrell, render their ( often ) \"deliberately-Subdued\" performances, for the most part, \"To an absolute freakin' tee\" . \r\n\r\nSummary : Alas, I know in my heart of hearts that I -Must- take a -Whole- point off this ( 'ultimately' ) fiery & riveting film's overall score, & here's why, in a nutshell : { \" As a -Parent- you'd have to be a bit 'bonkers', really, to take your 'Darling-13-year'old' into this picture ( it is rated PG-13 ) \" } ; & that is -{ Not }- an exaggeration. Also, I feel that this -{ Should }- really have been atleast a -Slightly- longer- film . . . . . exploring a few **\" _KEY_ \"** aspects of the story in greater depth. So, from me, all told, that's going to be a 'pandemic-Considerate', yet nonetheless -{ decidedly }- \" Inspired, Even **INVIGORATED** \" 7.75 Marks Out Of 10.00 🚀🔥🖖 .", "created_at": "2021-07-02T13:38:03.379Z"}, {"movie_id": 597890, "review_id": "62f6ea59ae28110082ab6227", "author_rating": 1.0, "review_text": "Easily one of the worst sci-fi movies out there.\r\n\r\nSpoiler ahead:\r\nThe premise is essentially that sex hormones turn people into monsters. Period. That's it. Testosterone turns you into an asshole that wants to sexually assault and murder people. It's really as bad a movie as it sounds.", "created_at": "2022-08-13T00:03:37.797Z"}, {"movie_id": 597890, "review_id": "606e3e5bcd204600415b5967", "author_rating": null, "review_text": "The classic novel Lord of the Flies by William Golding  is not only a beloved classic but has been assigned reading for generations of students since it was first published in 1954. The book has been adapted into plays and films over the years and remains a chilling and poignant cautionary tale.\r\n\r\nIn the new movie “Voyagers” audiences are introduced to an Earth that has been ravaged by climate change and disease. In an effort to save the species; a grand experiment to genetically create a group of children who are the origins of a colonization effort is undertaken.\r\n\r\nThe planet is 86 years away so the decision is made that the children will be raised and trained indoors without any exposure to nature, open skies, fresh air, and other aspects they will be deprived of on the ship.\r\n\r\nRichard (Colin Farrell) decides to accompany the children on the mission as he wants to protect them and ensure things go as planned so their progeny will be well suited to continue on the mission to the next generation who will ultimately be the ones who colonize the planet.\r\n\r\nTen years into the mission things are going well until a discovery is made that a drink the children take daily known as “The Blue” is a drug used to suppress their emotions and keep them docile and easy to control.\r\n\r\nWhen friends Christopher (Tye Sheridan) and Zac (Fionn Whitehead); who learned the secret of the drug decide to stop taking it; they soon reveal the truth of their discovery to the rest of the children who in turn stop using the drug.\r\n\r\nIn no time rampant emotions, aggressions, desires, paranoia, and mistrust start to run wild and Zac becomes obsessed with Sela (Lilly-Rose Depp).  His unwelcome advances soon become more and more aggressive which causes Christopher and Richard to intervene and tragedy soon follows.\r\n\r\nChristopher and Zac soon find themselves at odds with one another and fear and paranoia lead the crew to form into factions and turn on one other which not only threatens the mission but their very survival.\r\n\r\nThe film was very engaging and while I saw the influence of Lord of the Flies early on; the engaging cast and setting make the film entertaining and enjoyable despite any really unexpected twists.\r\n\r\nThe young leads work well with one another and it will be very interesting to watch how their careers unfold in the years to come.  “Voyagers” is a refreshing new take on a classic tale and provides an entertaining and engaging adventure for viewers to enjoy.\r\n\r\n4 stars out of 5", "created_at": "2021-04-07T23:20:59.822Z"}, {"movie_id": 597890, "review_id": "606ecbf3629b2c006ef91d5c", "author_rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nWhen people ask me my favorite genre, I usually reply with the admittedly annoying and cliche \"I enjoy every type of film\". While this is ultimately true, I do tend to love sci-fi and a couple of other genres more than the rest. I find sci-fi to be one of the most creative filmmaking sources, partially due to the infinite potential of its storytelling. From extraterrestrial life to an exploration of deep space, our world knows so little of what's beyond our planet, which makes the respective genre a perfect framework for imaginative, unique fiction. Voyagers features an interesting cast, but Neil Burger was behind the disappointingly hollow Divergent saga, so I couldn't help but go in with very low expectations.\r\n\r\nEven anticipating a tough watch, I never thought Voyagers would be a contender for one of the worst flicks of the year. The general premise is far from being groundbreaking, even with the not-that-original spin that it puts on the \"colonization of another planet\" concept. Still, it's considered a formula because it worked on several other occasions. It just doesn't in this movie. The group of young people bred separately from the outer world could have received an innovative, inventive arc but instead follows an incredibly generic, dull, lazy character development path. The chaos and mayhem triggered by a single person - who just so happens to embody literally everything that's wrong with our society - is as extremely forced as it is utterly ridiculous.\r\n\r\nIn fact, it even raises logical questions regarding the premise of the film. Obviously, people can be born into the same place with the same education, morals, and everything that comes with growing up and still develop a distinct personality. However, Burger doesn't demonstrate why some characters end up challenging the authority and questioning their purpose. Everything happens because it needs to happen. A character performs an irrational action because the plot demands it. Most of the story development is given through absurdly childish dialogues, where a character repeatedly asks \"why?\" to someone with some sort of an answer.\r\n\r\nBurger's screenplay barely survives due to the lack of any exciting characteristic. From an obviously misleading subplot to the frustratingly predictable main narrative, this movie carries zero surprises. The horrendously choppy, abrupt editing work (Naomi Geraghty) turns an already complicated watch into something borderline irritating. Add weirdly creepy, nonsensical imagery of random life events on completely arbitrary points of the runtime, and Voyagers becomes a really hard film to genuinely enjoy. With no flow between scenes, the primary mission is lost in the first minutes, and the characters fail to complete any resemblance of an arc.\r\n\r\nActually, it's ironically funny how Isaac Hempstead Wright (Bran Stark in Game of Thrones) continues the trend of not doing anything relevant in a movie or TV series. Unfortunately, not even the cast saves this disaster. Tye Sheridan (Dark Phoenix), Lily-Rose Depp (Crisis), and Fionn Whitehead (Dunkirk) try their hardest with the poor scripts, but some line deliveries are truly cringe-worthy. Colin Farrell's (The Gentlemen) character suffers from one of Burger's numerous bad decisions, ending up as yet another forgettable component of the film. The ending arrives way too fast, something that attests to the way too fast pacing.\r\n\r\nIn these cases where I struggle to find positives in the two pillars of any movie - story and characters - I turn to the technical elements to help me out. Sadly, Voyagers is one of the rare one-location films that doesn't feel suspenseful or claustrophobic, despite many efforts. From the surprisingly ordinary score (Trevor Gureckis) to the by-the-numbers camera work (Enrique Chediak), there's not a single aspect I can take with me as an \"at least that was great\" thought. I guess the set design looks futuristic enough for a spaceship, but once again, it's nothing viewers haven't seen before.\r\n\r\nVoyagers holds a well-known, successful sci-fi formula and takes it through the most uninteresting, unsurprising, frustratingly generic development path. Neil Burger's screenplay fails to deliver a creative, captivating story with compelling characters, offering the complete opposite. From the terrible editing work to the extremely lazy plot development, passing through cringe-worthy dialogues and randomly weird, irrelevant imagery, it's tough to find a positive aspect in such a hollow movie. Even though most of the runtime is spent in a single location, the suspense levels are close to zero. The themes of the story are clear from the get-go, but the execution of almost every plot point or character action feels incredibly forced. The set design is the only technical component worthy of some appreciation. Not even a talented cast can overcome the awful scripts. A contender for one of the worst films of the year.\r\n\r\nRating: D-", "created_at": "2021-04-08T09:25:07.827Z"}, {"movie_id": 597890, "review_id": "606edddbd4fe0400572261ef", "author_rating": 4.0, "review_text": "It's always nice to watch some unpretentious and industrious Hollywood B-movie science fiction in a cinematic landscape dominated by franchise-obsessed, superhero-crazed tentpoles. Unfortunately, 'Voyagers' never transcends its derivative origins and basic thrills.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-voyagers-an-overly-familiar-journey", "created_at": "2021-04-08T10:41:31.899Z"}, {"movie_id": 597890, "review_id": "60df16bbd0b434007f0645be", "author_rating": 8.0, "review_text": "**A -HIGHLY- Intelligent & Thought 🌠 Provoking\r\nMovie , Stylistically & Visually -FANTASTIC- . . . But One That Is Somewhat \" -_DIVERGENT_- \" From Its MPAA Certified PG-13 Rating 🤷‍♂️ .**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Mini Review .\r\n______________________________________________________ \r\n\r\nChristopher : \" Maybe this is our true nature \" .\r\nRichard : \" That's  a profound thought \" .\r\n______________________________________________________ \r\n\r\nI've -actually- come across -atleast- a 100 reviews on IMDb ( -_a similar forum to this one_- ) slamming 'Voyagers' for being, in essence : \" -{ Not Much More }- than an ( outer space ) rip-off of a certain acclaimed author's novel -turned film- { \"Lord of the Flies\" ( 1954 ) }. Here is my response to that accusation , in earnest. -All- Directors , & -All- Artists , frankly... are -{ Constantly }- being \" inspired \" by prior artistic works, &  \" borrow \" from them far more often than we may 'readily' be prepared to admit. I would like to make it entirely clear that this most certainly -{ Not }- the same thing as 'ripping-off', 'plagiarizing', or 'stealing'. For the seemingly -endless- \r\ncontrarians on IMDb that have ruthlessly, even viciously, accused this undeniably -{ Enthralling }- Space 🌌 thriller's super-talented Director Neil Burger, { known best for the critically rejected yet -popularly- \"Colossal\" 'Divergent' ( 2014 ) }, of doing just that : Kindly note the 'following' . \" I'd be 'willing-to-bet' that if the bespoke 'literary late great', Author & Nobel Laureate William Golding, were somehow able to publicly opine on the \r\nmatter from the great-beyond ; he would be rather -{ Unequivocal }- in lavishing praise on -{ This }- particular iteration.... { of that age-old \" _**Darkness-Of-Man's-Heart**_ ( etc. ) \" theme } ....presented here as a grand scale \"Cinematic Thought-Experiment\" of sorts. The pointed, Unbridled critique of the frailty of human nature offered in the picture, along with its perfectly paced and -unabashed- study of how 'Serious-immorality' can rear its ugly head in literally -{ Any }- given social setting, is, in point of fact, completely & utterly **\" FASCINATING \" ,** at the very -least- . Even just as a pure work-of-Art, the film works Beautifully 💙 , 'in it's own right'. Moreover, the ( somewhat ) \"fresh-faced\" ensemble of 'Up-and-comers', led by none other than veteran actor Colin Farrell, render their ( often ) \"deliberately-Subdued\" performances, for the most part, \"To an absolute freakin' tee\" . \r\n\r\nSummary : Alas, I know in my heart of hearts that I -Must- take a -Whole- point off this ( 'ultimately' ) fiery & riveting film's overall score, & here's why, in a nutshell : { \" As a -Parent- you'd have to be a bit 'bonkers', really, to take your 'Darling-13-year'old' into this picture ( it is rated PG-13 ) \" } ; & that is -{ Not }- an exaggeration. Also, I feel that this -{ Should }- really have been atleast a -Slightly- longer- film . . . . . exploring a few **\" _KEY_ \"** aspects of the story in greater depth. So, from me, all told, that's going to be a 'pandemic-Considerate', yet nonetheless -{ decidedly }- \" Inspired, Even **INVIGORATED** \" 7.75 Marks Out Of 10.00 🚀🔥🖖 .", "created_at": "2021-07-02T13:38:03.379Z"}, {"movie_id": 597890, "review_id": "62f6ea59ae28110082ab6227", "author_rating": 1.0, "review_text": "Easily one of the worst sci-fi movies out there.\r\n\r\nSpoiler ahead:\r\nThe premise is essentially that sex hormones turn people into monsters. Period. That's it. Testosterone turns you into an asshole that wants to sexually assault and murder people. It's really as bad a movie as it sounds.", "created_at": "2022-08-13T00:03:37.797Z"}, {"movie_id": 597890, "review_id": "606e3e5bcd204600415b5967", "author_rating": null, "review_text": "The classic novel Lord of the Flies by William Golding  is not only a beloved classic but has been assigned reading for generations of students since it was first published in 1954. The book has been adapted into plays and films over the years and remains a chilling and poignant cautionary tale.\r\n\r\nIn the new movie “Voyagers” audiences are introduced to an Earth that has been ravaged by climate change and disease. In an effort to save the species; a grand experiment to genetically create a group of children who are the origins of a colonization effort is undertaken.\r\n\r\nThe planet is 86 years away so the decision is made that the children will be raised and trained indoors without any exposure to nature, open skies, fresh air, and other aspects they will be deprived of on the ship.\r\n\r\nRichard (Colin Farrell) decides to accompany the children on the mission as he wants to protect them and ensure things go as planned so their progeny will be well suited to continue on the mission to the next generation who will ultimately be the ones who colonize the planet.\r\n\r\nTen years into the mission things are going well until a discovery is made that a drink the children take daily known as “The Blue” is a drug used to suppress their emotions and keep them docile and easy to control.\r\n\r\nWhen friends Christopher (Tye Sheridan) and Zac (Fionn Whitehead); who learned the secret of the drug decide to stop taking it; they soon reveal the truth of their discovery to the rest of the children who in turn stop using the drug.\r\n\r\nIn no time rampant emotions, aggressions, desires, paranoia, and mistrust start to run wild and Zac becomes obsessed with Sela (Lilly-Rose Depp).  His unwelcome advances soon become more and more aggressive which causes Christopher and Richard to intervene and tragedy soon follows.\r\n\r\nChristopher and Zac soon find themselves at odds with one another and fear and paranoia lead the crew to form into factions and turn on one other which not only threatens the mission but their very survival.\r\n\r\nThe film was very engaging and while I saw the influence of Lord of the Flies early on; the engaging cast and setting make the film entertaining and enjoyable despite any really unexpected twists.\r\n\r\nThe young leads work well with one another and it will be very interesting to watch how their careers unfold in the years to come.  “Voyagers” is a refreshing new take on a classic tale and provides an entertaining and engaging adventure for viewers to enjoy.\r\n\r\n4 stars out of 5", "created_at": "2021-04-07T23:20:59.822Z"}, {"movie_id": 597890, "review_id": "606ecbf3629b2c006ef91d5c", "author_rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nWhen people ask me my favorite genre, I usually reply with the admittedly annoying and cliche \"I enjoy every type of film\". While this is ultimately true, I do tend to love sci-fi and a couple of other genres more than the rest. I find sci-fi to be one of the most creative filmmaking sources, partially due to the infinite potential of its storytelling. From extraterrestrial life to an exploration of deep space, our world knows so little of what's beyond our planet, which makes the respective genre a perfect framework for imaginative, unique fiction. Voyagers features an interesting cast, but Neil Burger was behind the disappointingly hollow Divergent saga, so I couldn't help but go in with very low expectations.\r\n\r\nEven anticipating a tough watch, I never thought Voyagers would be a contender for one of the worst flicks of the year. The general premise is far from being groundbreaking, even with the not-that-original spin that it puts on the \"colonization of another planet\" concept. Still, it's considered a formula because it worked on several other occasions. It just doesn't in this movie. The group of young people bred separately from the outer world could have received an innovative, inventive arc but instead follows an incredibly generic, dull, lazy character development path. The chaos and mayhem triggered by a single person - who just so happens to embody literally everything that's wrong with our society - is as extremely forced as it is utterly ridiculous.\r\n\r\nIn fact, it even raises logical questions regarding the premise of the film. Obviously, people can be born into the same place with the same education, morals, and everything that comes with growing up and still develop a distinct personality. However, Burger doesn't demonstrate why some characters end up challenging the authority and questioning their purpose. Everything happens because it needs to happen. A character performs an irrational action because the plot demands it. Most of the story development is given through absurdly childish dialogues, where a character repeatedly asks \"why?\" to someone with some sort of an answer.\r\n\r\nBurger's screenplay barely survives due to the lack of any exciting characteristic. From an obviously misleading subplot to the frustratingly predictable main narrative, this movie carries zero surprises. The horrendously choppy, abrupt editing work (Naomi Geraghty) turns an already complicated watch into something borderline irritating. Add weirdly creepy, nonsensical imagery of random life events on completely arbitrary points of the runtime, and Voyagers becomes a really hard film to genuinely enjoy. With no flow between scenes, the primary mission is lost in the first minutes, and the characters fail to complete any resemblance of an arc.\r\n\r\nActually, it's ironically funny how Isaac Hempstead Wright (Bran Stark in Game of Thrones) continues the trend of not doing anything relevant in a movie or TV series. Unfortunately, not even the cast saves this disaster. Tye Sheridan (Dark Phoenix), Lily-Rose Depp (Crisis), and Fionn Whitehead (Dunkirk) try their hardest with the poor scripts, but some line deliveries are truly cringe-worthy. Colin Farrell's (The Gentlemen) character suffers from one of Burger's numerous bad decisions, ending up as yet another forgettable component of the film. The ending arrives way too fast, something that attests to the way too fast pacing.\r\n\r\nIn these cases where I struggle to find positives in the two pillars of any movie - story and characters - I turn to the technical elements to help me out. Sadly, Voyagers is one of the rare one-location films that doesn't feel suspenseful or claustrophobic, despite many efforts. From the surprisingly ordinary score (Trevor Gureckis) to the by-the-numbers camera work (Enrique Chediak), there's not a single aspect I can take with me as an \"at least that was great\" thought. I guess the set design looks futuristic enough for a spaceship, but once again, it's nothing viewers haven't seen before.\r\n\r\nVoyagers holds a well-known, successful sci-fi formula and takes it through the most uninteresting, unsurprising, frustratingly generic development path. Neil Burger's screenplay fails to deliver a creative, captivating story with compelling characters, offering the complete opposite. From the terrible editing work to the extremely lazy plot development, passing through cringe-worthy dialogues and randomly weird, irrelevant imagery, it's tough to find a positive aspect in such a hollow movie. Even though most of the runtime is spent in a single location, the suspense levels are close to zero. The themes of the story are clear from the get-go, but the execution of almost every plot point or character action feels incredibly forced. The set design is the only technical component worthy of some appreciation. Not even a talented cast can overcome the awful scripts. A contender for one of the worst films of the year.\r\n\r\nRating: D-", "created_at": "2021-04-08T09:25:07.827Z"}, {"movie_id": 597890, "review_id": "606edddbd4fe0400572261ef", "author_rating": 4.0, "review_text": "It's always nice to watch some unpretentious and industrious Hollywood B-movie science fiction in a cinematic landscape dominated by franchise-obsessed, superhero-crazed tentpoles. Unfortunately, 'Voyagers' never transcends its derivative origins and basic thrills.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-voyagers-an-overly-familiar-journey", "created_at": "2021-04-08T10:41:31.899Z"}, {"movie_id": 597890, "review_id": "60df16bbd0b434007f0645be", "author_rating": 8.0, "review_text": "**A -HIGHLY- Intelligent & Thought 🌠 Provoking\r\nMovie , Stylistically & Visually -FANTASTIC- . . . But One That Is Somewhat \" -_DIVERGENT_- \" From Its MPAA Certified PG-13 Rating 🤷‍♂️ .**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Mini Review .\r\n______________________________________________________ \r\n\r\nChristopher : \" Maybe this is our true nature \" .\r\nRichard : \" That's  a profound thought \" .\r\n______________________________________________________ \r\n\r\nI've -actually- come across -atleast- a 100 reviews on IMDb ( -_a similar forum to this one_- ) slamming 'Voyagers' for being, in essence : \" -{ Not Much More }- than an ( outer space ) rip-off of a certain acclaimed author's novel -turned film- { \"Lord of the Flies\" ( 1954 ) }. Here is my response to that accusation , in earnest. -All- Directors , & -All- Artists , frankly... are -{ Constantly }- being \" inspired \" by prior artistic works, &  \" borrow \" from them far more often than we may 'readily' be prepared to admit. I would like to make it entirely clear that this most certainly -{ Not }- the same thing as 'ripping-off', 'plagiarizing', or 'stealing'. For the seemingly -endless- \r\ncontrarians on IMDb that have ruthlessly, even viciously, accused this undeniably -{ Enthralling }- Space 🌌 thriller's super-talented Director Neil Burger, { known best for the critically rejected yet -popularly- \"Colossal\" 'Divergent' ( 2014 ) }, of doing just that : Kindly note the 'following' . \" I'd be 'willing-to-bet' that if the bespoke 'literary late great', Author & Nobel Laureate William Golding, were somehow able to publicly opine on the \r\nmatter from the great-beyond ; he would be rather -{ Unequivocal }- in lavishing praise on -{ This }- particular iteration.... { of that age-old \" _**Darkness-Of-Man's-Heart**_ ( etc. ) \" theme } ....presented here as a grand scale \"Cinematic Thought-Experiment\" of sorts. The pointed, Unbridled critique of the frailty of human nature offered in the picture, along with its perfectly paced and -unabashed- study of how 'Serious-immorality' can rear its ugly head in literally -{ Any }- given social setting, is, in point of fact, completely & utterly **\" FASCINATING \" ,** at the very -least- . Even just as a pure work-of-Art, the film works Beautifully 💙 , 'in it's own right'. Moreover, the ( somewhat ) \"fresh-faced\" ensemble of 'Up-and-comers', led by none other than veteran actor Colin Farrell, render their ( often ) \"deliberately-Subdued\" performances, for the most part, \"To an absolute freakin' tee\" . \r\n\r\nSummary : Alas, I know in my heart of hearts that I -Must- take a -Whole- point off this ( 'ultimately' ) fiery & riveting film's overall score, & here's why, in a nutshell : { \" As a -Parent- you'd have to be a bit 'bonkers', really, to take your 'Darling-13-year'old' into this picture ( it is rated PG-13 ) \" } ; & that is -{ Not }- an exaggeration. Also, I feel that this -{ Should }- really have been atleast a -Slightly- longer- film . . . . . exploring a few **\" _KEY_ \"** aspects of the story in greater depth. So, from me, all told, that's going to be a 'pandemic-Considerate', yet nonetheless -{ decidedly }- \" Inspired, Even **INVIGORATED** \" 7.75 Marks Out Of 10.00 🚀🔥🖖 .", "created_at": "2021-07-02T13:38:03.379Z"}, {"movie_id": 597890, "review_id": "62f6ea59ae28110082ab6227", "author_rating": 1.0, "review_text": "Easily one of the worst sci-fi movies out there.\r\n\r\nSpoiler ahead:\r\nThe premise is essentially that sex hormones turn people into monsters. Period. That's it. Testosterone turns you into an asshole that wants to sexually assault and murder people. It's really as bad a movie as it sounds.", "created_at": "2022-08-13T00:03:37.797Z"}, {"movie_id": 597890, "review_id": "606e3e5bcd204600415b5967", "author_rating": null, "review_text": "The classic novel Lord of the Flies by William Golding  is not only a beloved classic but has been assigned reading for generations of students since it was first published in 1954. The book has been adapted into plays and films over the years and remains a chilling and poignant cautionary tale.\r\n\r\nIn the new movie “Voyagers” audiences are introduced to an Earth that has been ravaged by climate change and disease. In an effort to save the species; a grand experiment to genetically create a group of children who are the origins of a colonization effort is undertaken.\r\n\r\nThe planet is 86 years away so the decision is made that the children will be raised and trained indoors without any exposure to nature, open skies, fresh air, and other aspects they will be deprived of on the ship.\r\n\r\nRichard (Colin Farrell) decides to accompany the children on the mission as he wants to protect them and ensure things go as planned so their progeny will be well suited to continue on the mission to the next generation who will ultimately be the ones who colonize the planet.\r\n\r\nTen years into the mission things are going well until a discovery is made that a drink the children take daily known as “The Blue” is a drug used to suppress their emotions and keep them docile and easy to control.\r\n\r\nWhen friends Christopher (Tye Sheridan) and Zac (Fionn Whitehead); who learned the secret of the drug decide to stop taking it; they soon reveal the truth of their discovery to the rest of the children who in turn stop using the drug.\r\n\r\nIn no time rampant emotions, aggressions, desires, paranoia, and mistrust start to run wild and Zac becomes obsessed with Sela (Lilly-Rose Depp).  His unwelcome advances soon become more and more aggressive which causes Christopher and Richard to intervene and tragedy soon follows.\r\n\r\nChristopher and Zac soon find themselves at odds with one another and fear and paranoia lead the crew to form into factions and turn on one other which not only threatens the mission but their very survival.\r\n\r\nThe film was very engaging and while I saw the influence of Lord of the Flies early on; the engaging cast and setting make the film entertaining and enjoyable despite any really unexpected twists.\r\n\r\nThe young leads work well with one another and it will be very interesting to watch how their careers unfold in the years to come.  “Voyagers” is a refreshing new take on a classic tale and provides an entertaining and engaging adventure for viewers to enjoy.\r\n\r\n4 stars out of 5", "created_at": "2021-04-07T23:20:59.822Z"}, {"movie_id": 597890, "review_id": "606ecbf3629b2c006ef91d5c", "author_rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nWhen people ask me my favorite genre, I usually reply with the admittedly annoying and cliche \"I enjoy every type of film\". While this is ultimately true, I do tend to love sci-fi and a couple of other genres more than the rest. I find sci-fi to be one of the most creative filmmaking sources, partially due to the infinite potential of its storytelling. From extraterrestrial life to an exploration of deep space, our world knows so little of what's beyond our planet, which makes the respective genre a perfect framework for imaginative, unique fiction. Voyagers features an interesting cast, but Neil Burger was behind the disappointingly hollow Divergent saga, so I couldn't help but go in with very low expectations.\r\n\r\nEven anticipating a tough watch, I never thought Voyagers would be a contender for one of the worst flicks of the year. The general premise is far from being groundbreaking, even with the not-that-original spin that it puts on the \"colonization of another planet\" concept. Still, it's considered a formula because it worked on several other occasions. It just doesn't in this movie. The group of young people bred separately from the outer world could have received an innovative, inventive arc but instead follows an incredibly generic, dull, lazy character development path. The chaos and mayhem triggered by a single person - who just so happens to embody literally everything that's wrong with our society - is as extremely forced as it is utterly ridiculous.\r\n\r\nIn fact, it even raises logical questions regarding the premise of the film. Obviously, people can be born into the same place with the same education, morals, and everything that comes with growing up and still develop a distinct personality. However, Burger doesn't demonstrate why some characters end up challenging the authority and questioning their purpose. Everything happens because it needs to happen. A character performs an irrational action because the plot demands it. Most of the story development is given through absurdly childish dialogues, where a character repeatedly asks \"why?\" to someone with some sort of an answer.\r\n\r\nBurger's screenplay barely survives due to the lack of any exciting characteristic. From an obviously misleading subplot to the frustratingly predictable main narrative, this movie carries zero surprises. The horrendously choppy, abrupt editing work (Naomi Geraghty) turns an already complicated watch into something borderline irritating. Add weirdly creepy, nonsensical imagery of random life events on completely arbitrary points of the runtime, and Voyagers becomes a really hard film to genuinely enjoy. With no flow between scenes, the primary mission is lost in the first minutes, and the characters fail to complete any resemblance of an arc.\r\n\r\nActually, it's ironically funny how Isaac Hempstead Wright (Bran Stark in Game of Thrones) continues the trend of not doing anything relevant in a movie or TV series. Unfortunately, not even the cast saves this disaster. Tye Sheridan (Dark Phoenix), Lily-Rose Depp (Crisis), and Fionn Whitehead (Dunkirk) try their hardest with the poor scripts, but some line deliveries are truly cringe-worthy. Colin Farrell's (The Gentlemen) character suffers from one of Burger's numerous bad decisions, ending up as yet another forgettable component of the film. The ending arrives way too fast, something that attests to the way too fast pacing.\r\n\r\nIn these cases where I struggle to find positives in the two pillars of any movie - story and characters - I turn to the technical elements to help me out. Sadly, Voyagers is one of the rare one-location films that doesn't feel suspenseful or claustrophobic, despite many efforts. From the surprisingly ordinary score (Trevor Gureckis) to the by-the-numbers camera work (Enrique Chediak), there's not a single aspect I can take with me as an \"at least that was great\" thought. I guess the set design looks futuristic enough for a spaceship, but once again, it's nothing viewers haven't seen before.\r\n\r\nVoyagers holds a well-known, successful sci-fi formula and takes it through the most uninteresting, unsurprising, frustratingly generic development path. Neil Burger's screenplay fails to deliver a creative, captivating story with compelling characters, offering the complete opposite. From the terrible editing work to the extremely lazy plot development, passing through cringe-worthy dialogues and randomly weird, irrelevant imagery, it's tough to find a positive aspect in such a hollow movie. Even though most of the runtime is spent in a single location, the suspense levels are close to zero. The themes of the story are clear from the get-go, but the execution of almost every plot point or character action feels incredibly forced. The set design is the only technical component worthy of some appreciation. Not even a talented cast can overcome the awful scripts. A contender for one of the worst films of the year.\r\n\r\nRating: D-", "created_at": "2021-04-08T09:25:07.827Z"}, {"movie_id": 597890, "review_id": "606edddbd4fe0400572261ef", "author_rating": 4.0, "review_text": "It's always nice to watch some unpretentious and industrious Hollywood B-movie science fiction in a cinematic landscape dominated by franchise-obsessed, superhero-crazed tentpoles. Unfortunately, 'Voyagers' never transcends its derivative origins and basic thrills.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-voyagers-an-overly-familiar-journey", "created_at": "2021-04-08T10:41:31.899Z"}, {"movie_id": 597890, "review_id": "60df16bbd0b434007f0645be", "author_rating": 8.0, "review_text": "**A -HIGHLY- Intelligent & Thought 🌠 Provoking\r\nMovie , Stylistically & Visually -FANTASTIC- . . . But One That Is Somewhat \" -_DIVERGENT_- \" From Its MPAA Certified PG-13 Rating 🤷‍♂️ .**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Mini Review .\r\n______________________________________________________ \r\n\r\nChristopher : \" Maybe this is our true nature \" .\r\nRichard : \" That's  a profound thought \" .\r\n______________________________________________________ \r\n\r\nI've -actually- come across -atleast- a 100 reviews on IMDb ( -_a similar forum to this one_- ) slamming 'Voyagers' for being, in essence : \" -{ Not Much More }- than an ( outer space ) rip-off of a certain acclaimed author's novel -turned film- { \"Lord of the Flies\" ( 1954 ) }. Here is my response to that accusation , in earnest. -All- Directors , & -All- Artists , frankly... are -{ Constantly }- being \" inspired \" by prior artistic works, &  \" borrow \" from them far more often than we may 'readily' be prepared to admit. I would like to make it entirely clear that this most certainly -{ Not }- the same thing as 'ripping-off', 'plagiarizing', or 'stealing'. For the seemingly -endless- \r\ncontrarians on IMDb that have ruthlessly, even viciously, accused this undeniably -{ Enthralling }- Space 🌌 thriller's super-talented Director Neil Burger, { known best for the critically rejected yet -popularly- \"Colossal\" 'Divergent' ( 2014 ) }, of doing just that : Kindly note the 'following' . \" I'd be 'willing-to-bet' that if the bespoke 'literary late great', Author & Nobel Laureate William Golding, were somehow able to publicly opine on the \r\nmatter from the great-beyond ; he would be rather -{ Unequivocal }- in lavishing praise on -{ This }- particular iteration.... { of that age-old \" _**Darkness-Of-Man's-Heart**_ ( etc. ) \" theme } ....presented here as a grand scale \"Cinematic Thought-Experiment\" of sorts. The pointed, Unbridled critique of the frailty of human nature offered in the picture, along with its perfectly paced and -unabashed- study of how 'Serious-immorality' can rear its ugly head in literally -{ Any }- given social setting, is, in point of fact, completely & utterly **\" FASCINATING \" ,** at the very -least- . Even just as a pure work-of-Art, the film works Beautifully 💙 , 'in it's own right'. Moreover, the ( somewhat ) \"fresh-faced\" ensemble of 'Up-and-comers', led by none other than veteran actor Colin Farrell, render their ( often ) \"deliberately-Subdued\" performances, for the most part, \"To an absolute freakin' tee\" . \r\n\r\nSummary : Alas, I know in my heart of hearts that I -Must- take a -Whole- point off this ( 'ultimately' ) fiery & riveting film's overall score, & here's why, in a nutshell : { \" As a -Parent- you'd have to be a bit 'bonkers', really, to take your 'Darling-13-year'old' into this picture ( it is rated PG-13 ) \" } ; & that is -{ Not }- an exaggeration. Also, I feel that this -{ Should }- really have been atleast a -Slightly- longer- film . . . . . exploring a few **\" _KEY_ \"** aspects of the story in greater depth. So, from me, all told, that's going to be a 'pandemic-Considerate', yet nonetheless -{ decidedly }- \" Inspired, Even **INVIGORATED** \" 7.75 Marks Out Of 10.00 🚀🔥🖖 .", "created_at": "2021-07-02T13:38:03.379Z"}, {"movie_id": 597890, "review_id": "62f6ea59ae28110082ab6227", "author_rating": 1.0, "review_text": "Easily one of the worst sci-fi movies out there.\r\n\r\nSpoiler ahead:\r\nThe premise is essentially that sex hormones turn people into monsters. Period. That's it. Testosterone turns you into an asshole that wants to sexually assault and murder people. It's really as bad a movie as it sounds.", "created_at": "2022-08-13T00:03:37.797Z"}]