[{"movie_id": 49013, "review_id": "52945ccb760ee378400f9d42", "author_rating": 4.0, "review_text": "Lasseter is smart enough to tell us a completely different story than in the first movie. However, it is far from other titles like \"Toy Story\" or \"The Incredibles\".", "created_at": "2013-11-26T08:33:15.340Z"}, {"movie_id": 49013, "review_id": "5f314ac51967570039aeb3b9", "author_rating": 7.0, "review_text": "I like <em>'Cars 2'</em>.\r\n\r\nIt doesn't deserve to be held in the same bracket as 2006's <em>'Cars'</em>, but that doesn't mean there's not a good time to be had with it. The premise mixes motorsport with espionage, admittedly they don't execute it incredibly but it's still satisfactory to see unfold.\r\n\r\nOne slight negative is that they give Mater more screen time than Lightning McQueen, which is a mistake. Larry the Cable Guy as Mater is enjoyable, just not front and center as the lead. They could've done a similar plot that has Owen Wilson and McQueen at the forefront. Elsewhere, Michael Caine (Finn) is always a joy to listen to; even if his character isn't anything special.\r\n\r\nThe racing stuff is cool, with the World Grand Prix. The parts of the story involving strictly that are definitely more entertaining than the spy stuff, especially as we get to see a few different countries via animation - which come out nicely.\r\n\r\nAll in all, a weaker film than the first for sure but it's still pretty solid for a Disney animated sequel.", "created_at": "2020-08-10T13:25:25.568Z"}, {"movie_id": 49013, "review_id": "63c1b2aadf857c007cbe74b6", "author_rating": 5.0, "review_text": "**A film more adult than would be desirable, where Pixar insists on giving the stage to funnyless secondary characters.**\r\n\r\nThe “Cars” franchise was one of the great successes that Pixar masterfully capitalized on, both for commercial purposes and to cement its top status in the field of digital animation. I remember that these three films were accompanied by such incisive (not to say abusive) merchandising that it seemed that the films were being foisted on us. That explains why I preferred not to see them at the time.\r\n\r\nIf the first film seemed quite regular to me (very good from a technical point of view, but with flaws in the script), this sequel managed to at least maintain the technical level and visual quality. The film has excellent cinematography and graphic work, as is the hallmark of the studio. Realism is excellent, although I felt that it is not as impactful and grandiose as in the first film in the franchise. I also felt that the car races, which were the strong suit of the first film due to their emotion and speed, lost much of their emotion here and sounded much more monotonous. The voice actors continue to do a very good job. Owen Wilson and Larry The Cable Guy secure the most notable efforts, but are closely followed by Michael Caine (with an unmistakable voice), Emily Mortimer and John Turturro.\r\n\r\nWhere this film really failed was in the conception of the script and the story. I understand the reason why they decided to make Mater the main character: both Disney and Pixar have done this recurrently whenever a secondary character appears in the films that seem to stand out. And as in other cases, the result of the decision was extremely disappointing. Mater is not funny, more ridiculous than funny, and McQueen, who is in the shadows this time, is just another pretentious, obnoxious, arrogant driver. Dialogues don't always work well, and some jokes don't either, although most do. I also have certain reservations about the division of the film's action into two subplots (Mater's and the rivalry between McQueen and Francesco), I believe that this made the film much more adult than would be desirable.", "created_at": "2023-01-13T19:36:10.638Z"}, {"movie_id": 49013, "review_id": "6453ae7bd48cee0170262bc2", "author_rating": 7.0, "review_text": "Not as God as the 1st just slightly though. I do think it's funnier then the 1st one. Diego just bothered the hell out of me for some reason.", "created_at": "2023-05-04T13:09:15.504Z"}]