[{"movie_id": 76163, "review_id": "507af11419c29531e7000eeb", "author_rating": 2.0, "review_text": "Jokes aren't funny. Scene logic is stupid. It´s a movie about guys with plastics in action!", "created_at": "2012-10-14T17:06:28.000Z"}, {"movie_id": 76163, "review_id": "5ae7376dc3a368135d007db2", "author_rating": 8.0, "review_text": "This is a movie that you watch for two things and two things only, the action and seeing your old favourite macho-guys on the screen again. For me, it was mostly the action since some of these old guys are really…well…getting old. At least Stallone, Dolph and “Schwarzy” starts to get well past the best before date for these type of roles. Chuck Norris and Jean-Claude Van Damme actually didn’t look that old and Bruce Willis had a role where his age didn’t make him seem too misplaced.\r\n\r\nThis movie is pretty much like the first The Expendables, that is some minimal story to build a whole bunch of action against. And action there is, lots of it. All of it quite well done although not always very realistic of course.\r\n\r\nIn general it seems like the so called “critics” liked this movie more than the previous one. This I do not understand since I thought they were pretty similar and if nothing else, that the previous one was the better of them with a slightly more coherent and plausible plot. For instance, in this movie, old buddies where popping up out of nowhere saving their behinds with some pretty “magic” display of firepower which felt like the scene was just put in there to get the actor into the movie…which it probably was.\r\n\r\nI’m not complaining though. I wanted and expected an all-out action movie and that was what I got. Loads of action, macho-dialogue and cheesy jokes (I quite liked Schwarzy’s comment about that Smart crapmobile that they drove around inside the airport). Oh, and of course loads of references to other movies (Rambo, Terminator…) and stuff as well. They even managed to get a quote from Duke Nuke’m in there.\r\n\r\nI enjoyed myself immensely when watching this movie.", "created_at": "2018-04-30T15:34:05.351Z"}]