[{"movie_id": 418879, "review_id": "5d8d5a9e5b370d00298c93e5", "author_rating": 7.0, "review_text": "_**Well acted and reasonably engaging, although there's a significant disconnect between form and content**_\r\n\r\n>_The electric-lighting company with which I am connected purchased some time ago the patents for a complete alternating system, and my protest against this action can be found upon its minute-book. Up to the present time I have succeeded in inducing them not to offer this system to the public, nor will they ever do so with my consent. My personal desire would be to prohibit entirely the use of alternating currents. They are as unnecessary as they are dangerous._\r\n\r\n- Thomas Edison; \"The Dangers of Electrical Lighting\"; _North American Review_, 149:396 (November, 1889)\r\n\r\n>_Any plan of distribution involving the meshing of the mains underneath the streets, with all house wires connected directly thereto, is regarded by the majority of competent electrical engineers as in many respects radically defective; so defective, in fact, that, unless the use of alternating currents can be prohibited, it seems destined to be wholly supplanted by the more scientific and in all respects (so far as concerns the users or occupants of buildings) far safer inductive system. Apparently sensible of this, Mr. Edison does not hesitate to say: \"My personal desire would be to prohibit entirely the use of alternating currents.\"_\r\n\r\n- George Westinghouse; \"A Reply to Mr. Edison\"; _North American Review_, 149:397 (December, 1889)\r\n\r\n>_If Edison had a needle to find in a haystack, he would proceed at once with the diligence of the bee to examine straw after straw until he found the object of his search. I was a sorry witness of such doings, knowing that a little theory and calculation would have saved him ninety per cent of his labour._\r\n\r\n- Nikola Tesla; _The New York Times_ (October 19, 1931)\r\n\r\nFilmed between December 2016 and March 2017, when _The Current War_ debuted in a near-completed form at TIFF in September 2017, it was considered a major contender for the 2018 Academy Awards. Scheduled for a prime awards-season release on December 22 (shortly thereafter changed to November 24), and with a number of heavyweight producers (Timur Bekmambetov, Basil Iwanyk, Harvey Weinstein) and executive producers (Martin Scorsese, Bob Weinstein, Steven Zaillian), the film was to be distributed by The Weinstein Company, with Harvey in particular known for his ruthlessly efficient Oscar campaigns. He was overseeing the assemblage of the final cut in October when he was accused of sexual assault and rape by numerous women, and when he abandoned the project, the November release was shelved. Little more was heard of the film until October 2018, when Lantern Entertainment (which had acquired The Weinstein Company's assets) and 13 Films brokered a deal to co-distribute the film internationally in July 2019. Then, in April of this year, 101 Studios announced they would handle a limited release in North America in October, whilst director Alfonso Gomez-Rejon (_Me and Earl and the Dying Girl_) revealed he had re-edited the film, adding five additional scenes but trimming the overall run time by 10 minutes.\r\n\r\nSo is it worth the wait? Well, it's competently acted, reasonably entertaining, and moderately informative, but...it definitely won't be involved in the 2020 Oscars. It's certainly not as bad as a lot of critics (most of them reviewing the TIFF cut) have made out, but there's no denying that Gomez-Rejon over-directs the whole thing. If you listen to Paul Haggis's commentary track on _Crash_ (2004), he tells a story about a scene which was filmed to begin with an elaborate camera move via a crane transitioning into a dolly shot. In the final film, however, all of that is gone, and Haggis explains that he realised during the edit that the camera moves were unjustified, doing little but drawing attention to themselves. A _lot_ of _The Current War_'s aesthetic draws attention to itself, primarily because Gomez-Rejon's elaborate direction is so out of sync with Michael Mitnick's by-the-numbers script – like a screenplay intended for Michael Bay ended up being directed by Michael Mann. Although make no mistake, Gomez-Rejon is no Mann.\r\n\r\nTelling the story of the \"war of the currents\", the film opens in New Jersey in 1880 as the pioneer of the long-lasting electric light bulb, Thomas Edison (Benedict Cumberbatch proving once and for all that he can't do an American accent), stages a typically grandiose demonstration of the power of large-scale low-voltage direct current (DC). When Edison next illuminates five square blocks of Manhattan, George Westinghouse (an uncharacteristically non-psychotic Michael Shannon), best known as the inventor of the railway air brake, begins to consider that the way of the future is not in gas, as he previously believed, but in electricity. However, he sees flaws in DC, and so favours high-voltage alternating current (AC), using transformers to step down the voltage. Edison's is the safer of the two systems, but so too is it more expensive, with a limited range compared to AC. To highlight this very point, Westinghouse illuminates Great Barrington, Massachusetts from over a mile away. He invites Edison to discuss a partnership, but Edison, who believes Westinghouse has stolen his ideas, snubs him, and the rest of the film takes place over the next 13 years as the two men come into direct conflict with one another in the \"race to light America\". As Edison begins to lose ground to Westinghouse, he takes the decision to grossly overstate the danger of AC, whilst also surreptitiously attempting to convince the city of New York to use AC in its proposed first \"electric chair\" execution, thus tainting Westinghouse's brand. The rivalry culminates in 1893 as each attempt to secure the contract for the World's Columbian Exposition (aka the Chicago World's Fair). Along the way we meet such people as Serbian-American inventor Nikola Tesla (an underused Nicholas Hoult); Edison's loyal to a fault assistant Samuel Insull (Tom Holland); Westinghouse's chief electrical engineer Franklin Pope (Stanley Townsend); Edison's wife Mary (Tuppence Middleton); Westinghouse's wife Marguerite (Katherine Waterston); Edison's main financial backer J.P Morgan (Matthew Macfadyen); and the first man to be executed via electrocution, William Kemmler (Conor MacNeill).\r\n\r\nOriginally conceived as a stage musical by Mitnick, thematically, a great deal of _The Current War_'s concerns remain unstated; yes, it's obviously about the war of the currents, but there's more to it than that. Edison and Westinghouse are presented as opposite examples of the nature of success in an American free-market prospering during a period of immense technological innovation. Whilst Edison is driven by legacy and fame, Westinghouse simply wishes to improve people's lives and is unconcerned with celebrity. Important here is Tesla, who is essentially a foil for the two leads, as the film details his inability to remain under Edison's employment, stating his desire to \"detach power from profit\", a concept utterly alien to Edison, for whom power _is_ profit.\r\n\r\nEdison is depicted as aware of and addicted to his celebrity, a visionary enamoured of his own genius, convinced that he and he alone has the mental capacity to achieve success. He's also portrayed as a poor husband and father, and a lousy boss, who demands that his employees' dedication match his own. On the other hand, the more stable, less flamboyant Westinghouse is devoted to his wife, values his collaborators, has no interest in fame, and doesn't even see Edison as competition, believing that they should be working together. Indeed, the film goes so far as to suggest that Edison knew Westinghouse's system was the superior of the two but stubbornly refused to yield, ultimately employing baseless fear as a weapon.\r\n\r\nThe most immediately notable aspect of _The Current War_, however, is its aesthetic, specifically Gomez-Rejon's direction and the photography by Chung Chung-hoon (_Oldeuboi_; _Ahgassi_; _It: Chapter One_). Watching the film, I was reminded somewhat of Adrian Martin's 1992 article, \"_Mise-en-scène_ is dead, or the expressive, the excessive, the technical and the stylish\", in which he divides _mise-en-scène_ into three broad categories: classical (\"_in which there is a definite stylistic restraint at work_\"), expressive (\"_general strategies of colour coding, camera viewpoint, sound design and so on enhance or reinforce the general \"feel\" or meaning of the subject matter_\"), and mannerist (\"_performs out of its own trajectories, no longer working unobtrusively at the behest of the fiction_\"). Whilst I would posit that _The Current War_ lands somewhere between the expressive and mannerist styles, it definitely lies closer to the \"all style, no substance\" paradigm of mannerist _mise-en-scène_, rather than the synergy between form and content found in the work of most expressive filmmakers (one of Martin's examples of which is the aforementioned Michael Mann). \r\n\r\nSome of Gomez-Rejon's aesthetic choices are definitely justified, arising directly from the content and serving a clear thematic purpose, but a lot of the aesthetic design is in service of nothing but itself. An early example of a justified decision is when the camera pans up from Edison's New Jersey demonstration and quickly travels to Westinghouse's Pittsburgh home in what is made to appear a single shot (the unconvincing CGI is beside the point). The effect is to connect the two men, not just in terms of geography, but, more importantly, ideology. Another shot in this scene, shooting directly down on Edison's elaborate circular light demonstration, also works well, serving to instantly show us his ambition and theatricality, plus the effectiveness of the demonstration itself. Once we reach Pittsburgh, a lengthy single-take shot introduces us to Westinghouse as he weaves his way through a throng of guests at a ball, with virtually everyone trying to catch his attention. This immediately establishes him as a man of influence and considerable reach, but one who abhors the spotlight. In a later scene, Gomez-Rejon shoots Edison and his family in a train carriage, but using a very wide fisheye lens. With Edison on one seat and his wife and two children facing him, the wide lens distorts the space between them unnaturally, mirroring the important theme of Edison neglecting and moving away from his family in pursuit of his goals.\r\n\r\nOn the other hand, some of the choices are extremely hard to rationalise. That this should be important is attested by Thomas Elsaesser and Warren Buckland in their 2002 book, _Studying Contemporary American Film: A Guide to Movie Analysis_. During their analysis of Martin's tryptic division, they say of the mannerist style, \"_style is autonomous, for it is not linked to function, but draws attention to itself. In other words, style is not motivated or justified by the subject matter, but is its own justification_\". This is an apt a description of large portions of _The Current War_ as you're going to find. For example, there are more Dutch angles than I've seen in a film since Oliver Stone's _Natural Born Killers_ (1994), but unlike Stone's usage, when and how Gomez-Rejon deploys them is more often than not arbitrary. He also uses split-screen on occasion, and at one point, he even splits the screen into three. Again though, the reason why he employs such a technique is unclear (compare it with something like Darren Aronofsky's _Requiem for a Dream_ (2000), where every use of split-screen is wholly justified by the narrative). This ripped me out of the film, as I constantly found myself asking, \"_I wonder why he did that_\", rather than paying attention to the content. Ironically enough, whilst the idea was obviously to cover up for the script's inadequacies via aggressive aesthetic energy, the fact that so few of Gomez-Rejon's techniques are justified actually draws our attention to that script, as no amount of directorial gymnastics can cover the structural and pacing problems.\r\n\r\nThe handling of the characters is also problematic. Cumberbatch, for example, plays Edison as virtually identical to his portrait of Alan Turing in Morten Tyldum's _The Imitation Game_ (2014); a brilliant, driven, uncompromising innovator who's as difficult to relate to in terms of humanity as he is easy to admire for mental acumen. Elsewhere, the film has a habit of downplaying the supporting characters. For example, neither Mary Edison nor Marguerite Westinghouse are developed beyond \"supportive wife\", whilst Insull gets just one decent scene, which comes so late as to be fairly meaningless. The worst example of this is, however, is the depiction of Tesla, who is very much an afterthought, so under-developed that one wonders if it would have been better to leave him out altogether. This tendency is also found in a postscript which credits Edison, and Edison alone, with the development of the Kinetoscope (one of the first motion picture cameras), without so much as a mention of Louis Le Prince or William Kennedy Dickson. \r\n\r\nNevertheless, as serious as these problems are, I rather enjoyed _The Current War_. Granted, that may be because I've always been drawn more to expressive _mise-en-scène_, preferring _auteur_s who aren't afraid to employ an aesthetic signature, as opposed to those who are happy to disappear behind the work, _á la_ someone like Steven Spielberg, Ridley Scott, or Ron Howard. It was never going to be the kind of Oscar contender that was obviously intended, but the behind-the-scenes turmoil and the critical mauling are not necessarily indicative of an inherently bad film. Sure, the script is very weak in places, and Gomez-Rejon employs every camera trick known to man, more often than not without knowing why. But for all that, it kept me interested, and although I'd never argue it's an especially well-realised historical drama, I did, for the most part, enjoy it.", "created_at": "2019-09-27T00:41:02.987Z"}, {"movie_id": 418879, "review_id": "5e6d41d6459ad60013649837", "author_rating": 4.0, "review_text": "In another case of “when bad movies happen to great actors“, 'The Current War' has all the elements for a great picture including its exceptional cast, but lacks the base appeal for the people who have to buy a ticket. Sadly, this is a rare and unfortunate case of the sum of the film's parts being greater than the whole.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-current-war-edison-versus-westinghouse-the-ultimate-grudge-match-with-no-winner", "created_at": "2020-03-14T20:43:02.439Z"}, {"movie_id": 418879, "review_id": "5d8d5a9e5b370d00298c93e5", "author_rating": 7.0, "review_text": "_**Well acted and reasonably engaging, although there's a significant disconnect between form and content**_\r\n\r\n>_The electric-lighting company with which I am connected purchased some time ago the patents for a complete alternating system, and my protest against this action can be found upon its minute-book. Up to the present time I have succeeded in inducing them not to offer this system to the public, nor will they ever do so with my consent. My personal desire would be to prohibit entirely the use of alternating currents. They are as unnecessary as they are dangerous._\r\n\r\n- Thomas Edison; \"The Dangers of Electrical Lighting\"; _North American Review_, 149:396 (November, 1889)\r\n\r\n>_Any plan of distribution involving the meshing of the mains underneath the streets, with all house wires connected directly thereto, is regarded by the majority of competent electrical engineers as in many respects radically defective; so defective, in fact, that, unless the use of alternating currents can be prohibited, it seems destined to be wholly supplanted by the more scientific and in all respects (so far as concerns the users or occupants of buildings) far safer inductive system. Apparently sensible of this, Mr. Edison does not hesitate to say: \"My personal desire would be to prohibit entirely the use of alternating currents.\"_\r\n\r\n- George Westinghouse; \"A Reply to Mr. Edison\"; _North American Review_, 149:397 (December, 1889)\r\n\r\n>_If Edison had a needle to find in a haystack, he would proceed at once with the diligence of the bee to examine straw after straw until he found the object of his search. I was a sorry witness of such doings, knowing that a little theory and calculation would have saved him ninety per cent of his labour._\r\n\r\n- Nikola Tesla; _The New York Times_ (October 19, 1931)\r\n\r\nFilmed between December 2016 and March 2017, when _The Current War_ debuted in a near-completed form at TIFF in September 2017, it was considered a major contender for the 2018 Academy Awards. Scheduled for a prime awards-season release on December 22 (shortly thereafter changed to November 24), and with a number of heavyweight producers (Timur Bekmambetov, Basil Iwanyk, Harvey Weinstein) and executive producers (Martin Scorsese, Bob Weinstein, Steven Zaillian), the film was to be distributed by The Weinstein Company, with Harvey in particular known for his ruthlessly efficient Oscar campaigns. He was overseeing the assemblage of the final cut in October when he was accused of sexual assault and rape by numerous women, and when he abandoned the project, the November release was shelved. Little more was heard of the film until October 2018, when Lantern Entertainment (which had acquired The Weinstein Company's assets) and 13 Films brokered a deal to co-distribute the film internationally in July 2019. Then, in April of this year, 101 Studios announced they would handle a limited release in North America in October, whilst director Alfonso Gomez-Rejon (_Me and Earl and the Dying Girl_) revealed he had re-edited the film, adding five additional scenes but trimming the overall run time by 10 minutes.\r\n\r\nSo is it worth the wait? Well, it's competently acted, reasonably entertaining, and moderately informative, but...it definitely won't be involved in the 2020 Oscars. It's certainly not as bad as a lot of critics (most of them reviewing the TIFF cut) have made out, but there's no denying that Gomez-Rejon over-directs the whole thing. If you listen to Paul Haggis's commentary track on _Crash_ (2004), he tells a story about a scene which was filmed to begin with an elaborate camera move via a crane transitioning into a dolly shot. In the final film, however, all of that is gone, and Haggis explains that he realised during the edit that the camera moves were unjustified, doing little but drawing attention to themselves. A _lot_ of _The Current War_'s aesthetic draws attention to itself, primarily because Gomez-Rejon's elaborate direction is so out of sync with Michael Mitnick's by-the-numbers script – like a screenplay intended for Michael Bay ended up being directed by Michael Mann. Although make no mistake, Gomez-Rejon is no Mann.\r\n\r\nTelling the story of the \"war of the currents\", the film opens in New Jersey in 1880 as the pioneer of the long-lasting electric light bulb, Thomas Edison (Benedict Cumberbatch proving once and for all that he can't do an American accent), stages a typically grandiose demonstration of the power of large-scale low-voltage direct current (DC). When Edison next illuminates five square blocks of Manhattan, George Westinghouse (an uncharacteristically non-psychotic Michael Shannon), best known as the inventor of the railway air brake, begins to consider that the way of the future is not in gas, as he previously believed, but in electricity. However, he sees flaws in DC, and so favours high-voltage alternating current (AC), using transformers to step down the voltage. Edison's is the safer of the two systems, but so too is it more expensive, with a limited range compared to AC. To highlight this very point, Westinghouse illuminates Great Barrington, Massachusetts from over a mile away. He invites Edison to discuss a partnership, but Edison, who believes Westinghouse has stolen his ideas, snubs him, and the rest of the film takes place over the next 13 years as the two men come into direct conflict with one another in the \"race to light America\". As Edison begins to lose ground to Westinghouse, he takes the decision to grossly overstate the danger of AC, whilst also surreptitiously attempting to convince the city of New York to use AC in its proposed first \"electric chair\" execution, thus tainting Westinghouse's brand. The rivalry culminates in 1893 as each attempt to secure the contract for the World's Columbian Exposition (aka the Chicago World's Fair). Along the way we meet such people as Serbian-American inventor Nikola Tesla (an underused Nicholas Hoult); Edison's loyal to a fault assistant Samuel Insull (Tom Holland); Westinghouse's chief electrical engineer Franklin Pope (Stanley Townsend); Edison's wife Mary (Tuppence Middleton); Westinghouse's wife Marguerite (Katherine Waterston); Edison's main financial backer J.P Morgan (Matthew Macfadyen); and the first man to be executed via electrocution, William Kemmler (Conor MacNeill).\r\n\r\nOriginally conceived as a stage musical by Mitnick, thematically, a great deal of _The Current War_'s concerns remain unstated; yes, it's obviously about the war of the currents, but there's more to it than that. Edison and Westinghouse are presented as opposite examples of the nature of success in an American free-market prospering during a period of immense technological innovation. Whilst Edison is driven by legacy and fame, Westinghouse simply wishes to improve people's lives and is unconcerned with celebrity. Important here is Tesla, who is essentially a foil for the two leads, as the film details his inability to remain under Edison's employment, stating his desire to \"detach power from profit\", a concept utterly alien to Edison, for whom power _is_ profit.\r\n\r\nEdison is depicted as aware of and addicted to his celebrity, a visionary enamoured of his own genius, convinced that he and he alone has the mental capacity to achieve success. He's also portrayed as a poor husband and father, and a lousy boss, who demands that his employees' dedication match his own. On the other hand, the more stable, less flamboyant Westinghouse is devoted to his wife, values his collaborators, has no interest in fame, and doesn't even see Edison as competition, believing that they should be working together. Indeed, the film goes so far as to suggest that Edison knew Westinghouse's system was the superior of the two but stubbornly refused to yield, ultimately employing baseless fear as a weapon.\r\n\r\nThe most immediately notable aspect of _The Current War_, however, is its aesthetic, specifically Gomez-Rejon's direction and the photography by Chung Chung-hoon (_Oldeuboi_; _Ahgassi_; _It: Chapter One_). Watching the film, I was reminded somewhat of Adrian Martin's 1992 article, \"_Mise-en-scène_ is dead, or the expressive, the excessive, the technical and the stylish\", in which he divides _mise-en-scène_ into three broad categories: classical (\"_in which there is a definite stylistic restraint at work_\"), expressive (\"_general strategies of colour coding, camera viewpoint, sound design and so on enhance or reinforce the general \"feel\" or meaning of the subject matter_\"), and mannerist (\"_performs out of its own trajectories, no longer working unobtrusively at the behest of the fiction_\"). Whilst I would posit that _The Current War_ lands somewhere between the expressive and mannerist styles, it definitely lies closer to the \"all style, no substance\" paradigm of mannerist _mise-en-scène_, rather than the synergy between form and content found in the work of most expressive filmmakers (one of Martin's examples of which is the aforementioned Michael Mann). \r\n\r\nSome of Gomez-Rejon's aesthetic choices are definitely justified, arising directly from the content and serving a clear thematic purpose, but a lot of the aesthetic design is in service of nothing but itself. An early example of a justified decision is when the camera pans up from Edison's New Jersey demonstration and quickly travels to Westinghouse's Pittsburgh home in what is made to appear a single shot (the unconvincing CGI is beside the point). The effect is to connect the two men, not just in terms of geography, but, more importantly, ideology. Another shot in this scene, shooting directly down on Edison's elaborate circular light demonstration, also works well, serving to instantly show us his ambition and theatricality, plus the effectiveness of the demonstration itself. Once we reach Pittsburgh, a lengthy single-take shot introduces us to Westinghouse as he weaves his way through a throng of guests at a ball, with virtually everyone trying to catch his attention. This immediately establishes him as a man of influence and considerable reach, but one who abhors the spotlight. In a later scene, Gomez-Rejon shoots Edison and his family in a train carriage, but using a very wide fisheye lens. With Edison on one seat and his wife and two children facing him, the wide lens distorts the space between them unnaturally, mirroring the important theme of Edison neglecting and moving away from his family in pursuit of his goals.\r\n\r\nOn the other hand, some of the choices are extremely hard to rationalise. That this should be important is attested by Thomas Elsaesser and Warren Buckland in their 2002 book, _Studying Contemporary American Film: A Guide to Movie Analysis_. During their analysis of Martin's tryptic division, they say of the mannerist style, \"_style is autonomous, for it is not linked to function, but draws attention to itself. In other words, style is not motivated or justified by the subject matter, but is its own justification_\". This is an apt a description of large portions of _The Current War_ as you're going to find. For example, there are more Dutch angles than I've seen in a film since Oliver Stone's _Natural Born Killers_ (1994), but unlike Stone's usage, when and how Gomez-Rejon deploys them is more often than not arbitrary. He also uses split-screen on occasion, and at one point, he even splits the screen into three. Again though, the reason why he employs such a technique is unclear (compare it with something like Darren Aronofsky's _Requiem for a Dream_ (2000), where every use of split-screen is wholly justified by the narrative). This ripped me out of the film, as I constantly found myself asking, \"_I wonder why he did that_\", rather than paying attention to the content. Ironically enough, whilst the idea was obviously to cover up for the script's inadequacies via aggressive aesthetic energy, the fact that so few of Gomez-Rejon's techniques are justified actually draws our attention to that script, as no amount of directorial gymnastics can cover the structural and pacing problems.\r\n\r\nThe handling of the characters is also problematic. Cumberbatch, for example, plays Edison as virtually identical to his portrait of Alan Turing in Morten Tyldum's _The Imitation Game_ (2014); a brilliant, driven, uncompromising innovator who's as difficult to relate to in terms of humanity as he is easy to admire for mental acumen. Elsewhere, the film has a habit of downplaying the supporting characters. For example, neither Mary Edison nor Marguerite Westinghouse are developed beyond \"supportive wife\", whilst Insull gets just one decent scene, which comes so late as to be fairly meaningless. The worst example of this is, however, is the depiction of Tesla, who is very much an afterthought, so under-developed that one wonders if it would have been better to leave him out altogether. This tendency is also found in a postscript which credits Edison, and Edison alone, with the development of the Kinetoscope (one of the first motion picture cameras), without so much as a mention of Louis Le Prince or William Kennedy Dickson. \r\n\r\nNevertheless, as serious as these problems are, I rather enjoyed _The Current War_. Granted, that may be because I've always been drawn more to expressive _mise-en-scène_, preferring _auteur_s who aren't afraid to employ an aesthetic signature, as opposed to those who are happy to disappear behind the work, _á la_ someone like Steven Spielberg, Ridley Scott, or Ron Howard. It was never going to be the kind of Oscar contender that was obviously intended, but the behind-the-scenes turmoil and the critical mauling are not necessarily indicative of an inherently bad film. Sure, the script is very weak in places, and Gomez-Rejon employs every camera trick known to man, more often than not without knowing why. But for all that, it kept me interested, and although I'd never argue it's an especially well-realised historical drama, I did, for the most part, enjoy it.", "created_at": "2019-09-27T00:41:02.987Z"}, {"movie_id": 418879, "review_id": "5e6d41d6459ad60013649837", "author_rating": 4.0, "review_text": "In another case of “when bad movies happen to great actors“, 'The Current War' has all the elements for a great picture including its exceptional cast, but lacks the base appeal for the people who have to buy a ticket. Sadly, this is a rare and unfortunate case of the sum of the film's parts being greater than the whole.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-current-war-edison-versus-westinghouse-the-ultimate-grudge-match-with-no-winner", "created_at": "2020-03-14T20:43:02.439Z"}, {"movie_id": 418879, "review_id": "5d8d5a9e5b370d00298c93e5", "author_rating": 7.0, "review_text": "_**Well acted and reasonably engaging, although there's a significant disconnect between form and content**_\r\n\r\n>_The electric-lighting company with which I am connected purchased some time ago the patents for a complete alternating system, and my protest against this action can be found upon its minute-book. Up to the present time I have succeeded in inducing them not to offer this system to the public, nor will they ever do so with my consent. My personal desire would be to prohibit entirely the use of alternating currents. They are as unnecessary as they are dangerous._\r\n\r\n- Thomas Edison; \"The Dangers of Electrical Lighting\"; _North American Review_, 149:396 (November, 1889)\r\n\r\n>_Any plan of distribution involving the meshing of the mains underneath the streets, with all house wires connected directly thereto, is regarded by the majority of competent electrical engineers as in many respects radically defective; so defective, in fact, that, unless the use of alternating currents can be prohibited, it seems destined to be wholly supplanted by the more scientific and in all respects (so far as concerns the users or occupants of buildings) far safer inductive system. Apparently sensible of this, Mr. Edison does not hesitate to say: \"My personal desire would be to prohibit entirely the use of alternating currents.\"_\r\n\r\n- George Westinghouse; \"A Reply to Mr. Edison\"; _North American Review_, 149:397 (December, 1889)\r\n\r\n>_If Edison had a needle to find in a haystack, he would proceed at once with the diligence of the bee to examine straw after straw until he found the object of his search. I was a sorry witness of such doings, knowing that a little theory and calculation would have saved him ninety per cent of his labour._\r\n\r\n- Nikola Tesla; _The New York Times_ (October 19, 1931)\r\n\r\nFilmed between December 2016 and March 2017, when _The Current War_ debuted in a near-completed form at TIFF in September 2017, it was considered a major contender for the 2018 Academy Awards. Scheduled for a prime awards-season release on December 22 (shortly thereafter changed to November 24), and with a number of heavyweight producers (Timur Bekmambetov, Basil Iwanyk, Harvey Weinstein) and executive producers (Martin Scorsese, Bob Weinstein, Steven Zaillian), the film was to be distributed by The Weinstein Company, with Harvey in particular known for his ruthlessly efficient Oscar campaigns. He was overseeing the assemblage of the final cut in October when he was accused of sexual assault and rape by numerous women, and when he abandoned the project, the November release was shelved. Little more was heard of the film until October 2018, when Lantern Entertainment (which had acquired The Weinstein Company's assets) and 13 Films brokered a deal to co-distribute the film internationally in July 2019. Then, in April of this year, 101 Studios announced they would handle a limited release in North America in October, whilst director Alfonso Gomez-Rejon (_Me and Earl and the Dying Girl_) revealed he had re-edited the film, adding five additional scenes but trimming the overall run time by 10 minutes.\r\n\r\nSo is it worth the wait? Well, it's competently acted, reasonably entertaining, and moderately informative, but...it definitely won't be involved in the 2020 Oscars. It's certainly not as bad as a lot of critics (most of them reviewing the TIFF cut) have made out, but there's no denying that Gomez-Rejon over-directs the whole thing. If you listen to Paul Haggis's commentary track on _Crash_ (2004), he tells a story about a scene which was filmed to begin with an elaborate camera move via a crane transitioning into a dolly shot. In the final film, however, all of that is gone, and Haggis explains that he realised during the edit that the camera moves were unjustified, doing little but drawing attention to themselves. A _lot_ of _The Current War_'s aesthetic draws attention to itself, primarily because Gomez-Rejon's elaborate direction is so out of sync with Michael Mitnick's by-the-numbers script – like a screenplay intended for Michael Bay ended up being directed by Michael Mann. Although make no mistake, Gomez-Rejon is no Mann.\r\n\r\nTelling the story of the \"war of the currents\", the film opens in New Jersey in 1880 as the pioneer of the long-lasting electric light bulb, Thomas Edison (Benedict Cumberbatch proving once and for all that he can't do an American accent), stages a typically grandiose demonstration of the power of large-scale low-voltage direct current (DC). When Edison next illuminates five square blocks of Manhattan, George Westinghouse (an uncharacteristically non-psychotic Michael Shannon), best known as the inventor of the railway air brake, begins to consider that the way of the future is not in gas, as he previously believed, but in electricity. However, he sees flaws in DC, and so favours high-voltage alternating current (AC), using transformers to step down the voltage. Edison's is the safer of the two systems, but so too is it more expensive, with a limited range compared to AC. To highlight this very point, Westinghouse illuminates Great Barrington, Massachusetts from over a mile away. He invites Edison to discuss a partnership, but Edison, who believes Westinghouse has stolen his ideas, snubs him, and the rest of the film takes place over the next 13 years as the two men come into direct conflict with one another in the \"race to light America\". As Edison begins to lose ground to Westinghouse, he takes the decision to grossly overstate the danger of AC, whilst also surreptitiously attempting to convince the city of New York to use AC in its proposed first \"electric chair\" execution, thus tainting Westinghouse's brand. The rivalry culminates in 1893 as each attempt to secure the contract for the World's Columbian Exposition (aka the Chicago World's Fair). Along the way we meet such people as Serbian-American inventor Nikola Tesla (an underused Nicholas Hoult); Edison's loyal to a fault assistant Samuel Insull (Tom Holland); Westinghouse's chief electrical engineer Franklin Pope (Stanley Townsend); Edison's wife Mary (Tuppence Middleton); Westinghouse's wife Marguerite (Katherine Waterston); Edison's main financial backer J.P Morgan (Matthew Macfadyen); and the first man to be executed via electrocution, William Kemmler (Conor MacNeill).\r\n\r\nOriginally conceived as a stage musical by Mitnick, thematically, a great deal of _The Current War_'s concerns remain unstated; yes, it's obviously about the war of the currents, but there's more to it than that. Edison and Westinghouse are presented as opposite examples of the nature of success in an American free-market prospering during a period of immense technological innovation. Whilst Edison is driven by legacy and fame, Westinghouse simply wishes to improve people's lives and is unconcerned with celebrity. Important here is Tesla, who is essentially a foil for the two leads, as the film details his inability to remain under Edison's employment, stating his desire to \"detach power from profit\", a concept utterly alien to Edison, for whom power _is_ profit.\r\n\r\nEdison is depicted as aware of and addicted to his celebrity, a visionary enamoured of his own genius, convinced that he and he alone has the mental capacity to achieve success. He's also portrayed as a poor husband and father, and a lousy boss, who demands that his employees' dedication match his own. On the other hand, the more stable, less flamboyant Westinghouse is devoted to his wife, values his collaborators, has no interest in fame, and doesn't even see Edison as competition, believing that they should be working together. Indeed, the film goes so far as to suggest that Edison knew Westinghouse's system was the superior of the two but stubbornly refused to yield, ultimately employing baseless fear as a weapon.\r\n\r\nThe most immediately notable aspect of _The Current War_, however, is its aesthetic, specifically Gomez-Rejon's direction and the photography by Chung Chung-hoon (_Oldeuboi_; _Ahgassi_; _It: Chapter One_). Watching the film, I was reminded somewhat of Adrian Martin's 1992 article, \"_Mise-en-scène_ is dead, or the expressive, the excessive, the technical and the stylish\", in which he divides _mise-en-scène_ into three broad categories: classical (\"_in which there is a definite stylistic restraint at work_\"), expressive (\"_general strategies of colour coding, camera viewpoint, sound design and so on enhance or reinforce the general \"feel\" or meaning of the subject matter_\"), and mannerist (\"_performs out of its own trajectories, no longer working unobtrusively at the behest of the fiction_\"). Whilst I would posit that _The Current War_ lands somewhere between the expressive and mannerist styles, it definitely lies closer to the \"all style, no substance\" paradigm of mannerist _mise-en-scène_, rather than the synergy between form and content found in the work of most expressive filmmakers (one of Martin's examples of which is the aforementioned Michael Mann). \r\n\r\nSome of Gomez-Rejon's aesthetic choices are definitely justified, arising directly from the content and serving a clear thematic purpose, but a lot of the aesthetic design is in service of nothing but itself. An early example of a justified decision is when the camera pans up from Edison's New Jersey demonstration and quickly travels to Westinghouse's Pittsburgh home in what is made to appear a single shot (the unconvincing CGI is beside the point). The effect is to connect the two men, not just in terms of geography, but, more importantly, ideology. Another shot in this scene, shooting directly down on Edison's elaborate circular light demonstration, also works well, serving to instantly show us his ambition and theatricality, plus the effectiveness of the demonstration itself. Once we reach Pittsburgh, a lengthy single-take shot introduces us to Westinghouse as he weaves his way through a throng of guests at a ball, with virtually everyone trying to catch his attention. This immediately establishes him as a man of influence and considerable reach, but one who abhors the spotlight. In a later scene, Gomez-Rejon shoots Edison and his family in a train carriage, but using a very wide fisheye lens. With Edison on one seat and his wife and two children facing him, the wide lens distorts the space between them unnaturally, mirroring the important theme of Edison neglecting and moving away from his family in pursuit of his goals.\r\n\r\nOn the other hand, some of the choices are extremely hard to rationalise. That this should be important is attested by Thomas Elsaesser and Warren Buckland in their 2002 book, _Studying Contemporary American Film: A Guide to Movie Analysis_. During their analysis of Martin's tryptic division, they say of the mannerist style, \"_style is autonomous, for it is not linked to function, but draws attention to itself. In other words, style is not motivated or justified by the subject matter, but is its own justification_\". This is an apt a description of large portions of _The Current War_ as you're going to find. For example, there are more Dutch angles than I've seen in a film since Oliver Stone's _Natural Born Killers_ (1994), but unlike Stone's usage, when and how Gomez-Rejon deploys them is more often than not arbitrary. He also uses split-screen on occasion, and at one point, he even splits the screen into three. Again though, the reason why he employs such a technique is unclear (compare it with something like Darren Aronofsky's _Requiem for a Dream_ (2000), where every use of split-screen is wholly justified by the narrative). This ripped me out of the film, as I constantly found myself asking, \"_I wonder why he did that_\", rather than paying attention to the content. Ironically enough, whilst the idea was obviously to cover up for the script's inadequacies via aggressive aesthetic energy, the fact that so few of Gomez-Rejon's techniques are justified actually draws our attention to that script, as no amount of directorial gymnastics can cover the structural and pacing problems.\r\n\r\nThe handling of the characters is also problematic. Cumberbatch, for example, plays Edison as virtually identical to his portrait of Alan Turing in Morten Tyldum's _The Imitation Game_ (2014); a brilliant, driven, uncompromising innovator who's as difficult to relate to in terms of humanity as he is easy to admire for mental acumen. Elsewhere, the film has a habit of downplaying the supporting characters. For example, neither Mary Edison nor Marguerite Westinghouse are developed beyond \"supportive wife\", whilst Insull gets just one decent scene, which comes so late as to be fairly meaningless. The worst example of this is, however, is the depiction of Tesla, who is very much an afterthought, so under-developed that one wonders if it would have been better to leave him out altogether. This tendency is also found in a postscript which credits Edison, and Edison alone, with the development of the Kinetoscope (one of the first motion picture cameras), without so much as a mention of Louis Le Prince or William Kennedy Dickson. \r\n\r\nNevertheless, as serious as these problems are, I rather enjoyed _The Current War_. Granted, that may be because I've always been drawn more to expressive _mise-en-scène_, preferring _auteur_s who aren't afraid to employ an aesthetic signature, as opposed to those who are happy to disappear behind the work, _á la_ someone like Steven Spielberg, Ridley Scott, or Ron Howard. It was never going to be the kind of Oscar contender that was obviously intended, but the behind-the-scenes turmoil and the critical mauling are not necessarily indicative of an inherently bad film. Sure, the script is very weak in places, and Gomez-Rejon employs every camera trick known to man, more often than not without knowing why. But for all that, it kept me interested, and although I'd never argue it's an especially well-realised historical drama, I did, for the most part, enjoy it.", "created_at": "2019-09-27T00:41:02.987Z"}, {"movie_id": 418879, "review_id": "5e6d41d6459ad60013649837", "author_rating": 4.0, "review_text": "In another case of “when bad movies happen to great actors“, 'The Current War' has all the elements for a great picture including its exceptional cast, but lacks the base appeal for the people who have to buy a ticket. Sadly, this is a rare and unfortunate case of the sum of the film's parts being greater than the whole.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-current-war-edison-versus-westinghouse-the-ultimate-grudge-match-with-no-winner", "created_at": "2020-03-14T20:43:02.439Z"}, {"movie_id": 418879, "review_id": "5d8d5a9e5b370d00298c93e5", "author_rating": 7.0, "review_text": "_**Well acted and reasonably engaging, although there's a significant disconnect between form and content**_\r\n\r\n>_The electric-lighting company with which I am connected purchased some time ago the patents for a complete alternating system, and my protest against this action can be found upon its minute-book. Up to the present time I have succeeded in inducing them not to offer this system to the public, nor will they ever do so with my consent. My personal desire would be to prohibit entirely the use of alternating currents. They are as unnecessary as they are dangerous._\r\n\r\n- Thomas Edison; \"The Dangers of Electrical Lighting\"; _North American Review_, 149:396 (November, 1889)\r\n\r\n>_Any plan of distribution involving the meshing of the mains underneath the streets, with all house wires connected directly thereto, is regarded by the majority of competent electrical engineers as in many respects radically defective; so defective, in fact, that, unless the use of alternating currents can be prohibited, it seems destined to be wholly supplanted by the more scientific and in all respects (so far as concerns the users or occupants of buildings) far safer inductive system. Apparently sensible of this, Mr. Edison does not hesitate to say: \"My personal desire would be to prohibit entirely the use of alternating currents.\"_\r\n\r\n- George Westinghouse; \"A Reply to Mr. Edison\"; _North American Review_, 149:397 (December, 1889)\r\n\r\n>_If Edison had a needle to find in a haystack, he would proceed at once with the diligence of the bee to examine straw after straw until he found the object of his search. I was a sorry witness of such doings, knowing that a little theory and calculation would have saved him ninety per cent of his labour._\r\n\r\n- Nikola Tesla; _The New York Times_ (October 19, 1931)\r\n\r\nFilmed between December 2016 and March 2017, when _The Current War_ debuted in a near-completed form at TIFF in September 2017, it was considered a major contender for the 2018 Academy Awards. Scheduled for a prime awards-season release on December 22 (shortly thereafter changed to November 24), and with a number of heavyweight producers (Timur Bekmambetov, Basil Iwanyk, Harvey Weinstein) and executive producers (Martin Scorsese, Bob Weinstein, Steven Zaillian), the film was to be distributed by The Weinstein Company, with Harvey in particular known for his ruthlessly efficient Oscar campaigns. He was overseeing the assemblage of the final cut in October when he was accused of sexual assault and rape by numerous women, and when he abandoned the project, the November release was shelved. Little more was heard of the film until October 2018, when Lantern Entertainment (which had acquired The Weinstein Company's assets) and 13 Films brokered a deal to co-distribute the film internationally in July 2019. Then, in April of this year, 101 Studios announced they would handle a limited release in North America in October, whilst director Alfonso Gomez-Rejon (_Me and Earl and the Dying Girl_) revealed he had re-edited the film, adding five additional scenes but trimming the overall run time by 10 minutes.\r\n\r\nSo is it worth the wait? Well, it's competently acted, reasonably entertaining, and moderately informative, but...it definitely won't be involved in the 2020 Oscars. It's certainly not as bad as a lot of critics (most of them reviewing the TIFF cut) have made out, but there's no denying that Gomez-Rejon over-directs the whole thing. If you listen to Paul Haggis's commentary track on _Crash_ (2004), he tells a story about a scene which was filmed to begin with an elaborate camera move via a crane transitioning into a dolly shot. In the final film, however, all of that is gone, and Haggis explains that he realised during the edit that the camera moves were unjustified, doing little but drawing attention to themselves. A _lot_ of _The Current War_'s aesthetic draws attention to itself, primarily because Gomez-Rejon's elaborate direction is so out of sync with Michael Mitnick's by-the-numbers script – like a screenplay intended for Michael Bay ended up being directed by Michael Mann. Although make no mistake, Gomez-Rejon is no Mann.\r\n\r\nTelling the story of the \"war of the currents\", the film opens in New Jersey in 1880 as the pioneer of the long-lasting electric light bulb, Thomas Edison (Benedict Cumberbatch proving once and for all that he can't do an American accent), stages a typically grandiose demonstration of the power of large-scale low-voltage direct current (DC). When Edison next illuminates five square blocks of Manhattan, George Westinghouse (an uncharacteristically non-psychotic Michael Shannon), best known as the inventor of the railway air brake, begins to consider that the way of the future is not in gas, as he previously believed, but in electricity. However, he sees flaws in DC, and so favours high-voltage alternating current (AC), using transformers to step down the voltage. Edison's is the safer of the two systems, but so too is it more expensive, with a limited range compared to AC. To highlight this very point, Westinghouse illuminates Great Barrington, Massachusetts from over a mile away. He invites Edison to discuss a partnership, but Edison, who believes Westinghouse has stolen his ideas, snubs him, and the rest of the film takes place over the next 13 years as the two men come into direct conflict with one another in the \"race to light America\". As Edison begins to lose ground to Westinghouse, he takes the decision to grossly overstate the danger of AC, whilst also surreptitiously attempting to convince the city of New York to use AC in its proposed first \"electric chair\" execution, thus tainting Westinghouse's brand. The rivalry culminates in 1893 as each attempt to secure the contract for the World's Columbian Exposition (aka the Chicago World's Fair). Along the way we meet such people as Serbian-American inventor Nikola Tesla (an underused Nicholas Hoult); Edison's loyal to a fault assistant Samuel Insull (Tom Holland); Westinghouse's chief electrical engineer Franklin Pope (Stanley Townsend); Edison's wife Mary (Tuppence Middleton); Westinghouse's wife Marguerite (Katherine Waterston); Edison's main financial backer J.P Morgan (Matthew Macfadyen); and the first man to be executed via electrocution, William Kemmler (Conor MacNeill).\r\n\r\nOriginally conceived as a stage musical by Mitnick, thematically, a great deal of _The Current War_'s concerns remain unstated; yes, it's obviously about the war of the currents, but there's more to it than that. Edison and Westinghouse are presented as opposite examples of the nature of success in an American free-market prospering during a period of immense technological innovation. Whilst Edison is driven by legacy and fame, Westinghouse simply wishes to improve people's lives and is unconcerned with celebrity. Important here is Tesla, who is essentially a foil for the two leads, as the film details his inability to remain under Edison's employment, stating his desire to \"detach power from profit\", a concept utterly alien to Edison, for whom power _is_ profit.\r\n\r\nEdison is depicted as aware of and addicted to his celebrity, a visionary enamoured of his own genius, convinced that he and he alone has the mental capacity to achieve success. He's also portrayed as a poor husband and father, and a lousy boss, who demands that his employees' dedication match his own. On the other hand, the more stable, less flamboyant Westinghouse is devoted to his wife, values his collaborators, has no interest in fame, and doesn't even see Edison as competition, believing that they should be working together. Indeed, the film goes so far as to suggest that Edison knew Westinghouse's system was the superior of the two but stubbornly refused to yield, ultimately employing baseless fear as a weapon.\r\n\r\nThe most immediately notable aspect of _The Current War_, however, is its aesthetic, specifically Gomez-Rejon's direction and the photography by Chung Chung-hoon (_Oldeuboi_; _Ahgassi_; _It: Chapter One_). Watching the film, I was reminded somewhat of Adrian Martin's 1992 article, \"_Mise-en-scène_ is dead, or the expressive, the excessive, the technical and the stylish\", in which he divides _mise-en-scène_ into three broad categories: classical (\"_in which there is a definite stylistic restraint at work_\"), expressive (\"_general strategies of colour coding, camera viewpoint, sound design and so on enhance or reinforce the general \"feel\" or meaning of the subject matter_\"), and mannerist (\"_performs out of its own trajectories, no longer working unobtrusively at the behest of the fiction_\"). Whilst I would posit that _The Current War_ lands somewhere between the expressive and mannerist styles, it definitely lies closer to the \"all style, no substance\" paradigm of mannerist _mise-en-scène_, rather than the synergy between form and content found in the work of most expressive filmmakers (one of Martin's examples of which is the aforementioned Michael Mann). \r\n\r\nSome of Gomez-Rejon's aesthetic choices are definitely justified, arising directly from the content and serving a clear thematic purpose, but a lot of the aesthetic design is in service of nothing but itself. An early example of a justified decision is when the camera pans up from Edison's New Jersey demonstration and quickly travels to Westinghouse's Pittsburgh home in what is made to appear a single shot (the unconvincing CGI is beside the point). The effect is to connect the two men, not just in terms of geography, but, more importantly, ideology. Another shot in this scene, shooting directly down on Edison's elaborate circular light demonstration, also works well, serving to instantly show us his ambition and theatricality, plus the effectiveness of the demonstration itself. Once we reach Pittsburgh, a lengthy single-take shot introduces us to Westinghouse as he weaves his way through a throng of guests at a ball, with virtually everyone trying to catch his attention. This immediately establishes him as a man of influence and considerable reach, but one who abhors the spotlight. In a later scene, Gomez-Rejon shoots Edison and his family in a train carriage, but using a very wide fisheye lens. With Edison on one seat and his wife and two children facing him, the wide lens distorts the space between them unnaturally, mirroring the important theme of Edison neglecting and moving away from his family in pursuit of his goals.\r\n\r\nOn the other hand, some of the choices are extremely hard to rationalise. That this should be important is attested by Thomas Elsaesser and Warren Buckland in their 2002 book, _Studying Contemporary American Film: A Guide to Movie Analysis_. During their analysis of Martin's tryptic division, they say of the mannerist style, \"_style is autonomous, for it is not linked to function, but draws attention to itself. In other words, style is not motivated or justified by the subject matter, but is its own justification_\". This is an apt a description of large portions of _The Current War_ as you're going to find. For example, there are more Dutch angles than I've seen in a film since Oliver Stone's _Natural Born Killers_ (1994), but unlike Stone's usage, when and how Gomez-Rejon deploys them is more often than not arbitrary. He also uses split-screen on occasion, and at one point, he even splits the screen into three. Again though, the reason why he employs such a technique is unclear (compare it with something like Darren Aronofsky's _Requiem for a Dream_ (2000), where every use of split-screen is wholly justified by the narrative). This ripped me out of the film, as I constantly found myself asking, \"_I wonder why he did that_\", rather than paying attention to the content. Ironically enough, whilst the idea was obviously to cover up for the script's inadequacies via aggressive aesthetic energy, the fact that so few of Gomez-Rejon's techniques are justified actually draws our attention to that script, as no amount of directorial gymnastics can cover the structural and pacing problems.\r\n\r\nThe handling of the characters is also problematic. Cumberbatch, for example, plays Edison as virtually identical to his portrait of Alan Turing in Morten Tyldum's _The Imitation Game_ (2014); a brilliant, driven, uncompromising innovator who's as difficult to relate to in terms of humanity as he is easy to admire for mental acumen. Elsewhere, the film has a habit of downplaying the supporting characters. For example, neither Mary Edison nor Marguerite Westinghouse are developed beyond \"supportive wife\", whilst Insull gets just one decent scene, which comes so late as to be fairly meaningless. The worst example of this is, however, is the depiction of Tesla, who is very much an afterthought, so under-developed that one wonders if it would have been better to leave him out altogether. This tendency is also found in a postscript which credits Edison, and Edison alone, with the development of the Kinetoscope (one of the first motion picture cameras), without so much as a mention of Louis Le Prince or William Kennedy Dickson. \r\n\r\nNevertheless, as serious as these problems are, I rather enjoyed _The Current War_. Granted, that may be because I've always been drawn more to expressive _mise-en-scène_, preferring _auteur_s who aren't afraid to employ an aesthetic signature, as opposed to those who are happy to disappear behind the work, _á la_ someone like Steven Spielberg, Ridley Scott, or Ron Howard. It was never going to be the kind of Oscar contender that was obviously intended, but the behind-the-scenes turmoil and the critical mauling are not necessarily indicative of an inherently bad film. Sure, the script is very weak in places, and Gomez-Rejon employs every camera trick known to man, more often than not without knowing why. But for all that, it kept me interested, and although I'd never argue it's an especially well-realised historical drama, I did, for the most part, enjoy it.", "created_at": "2019-09-27T00:41:02.987Z"}, {"movie_id": 418879, "review_id": "5e6d41d6459ad60013649837", "author_rating": 4.0, "review_text": "In another case of “when bad movies happen to great actors“, 'The Current War' has all the elements for a great picture including its exceptional cast, but lacks the base appeal for the people who have to buy a ticket. Sadly, this is a rare and unfortunate case of the sum of the film's parts being greater than the whole.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-current-war-edison-versus-westinghouse-the-ultimate-grudge-match-with-no-winner", "created_at": "2020-03-14T20:43:02.439Z"}]