[{"movie_id": 43593, "review_id": "596331da9251410bfa0f30f4", "author_rating": 5.0, "review_text": "When evil, inbred, cannibal, devilish, prehistoric, underground piranha are unleashed on the tiny town of Lake Victoria during \"Spring Break\", the outcome is all rather predictable. Babes, bikinis, boobs, bums, blood, bazulco and bad acting.\r\n\r\nRun from a budget of $24M the film has almost no actors of note in lead roles. Although there is a cameo from Eli Roth (_Inglourious Basterds_), which is always cool.\r\n\r\nWhat we have here, is a virtually flawless example of stupid fun. There's no point in trying to evaluate a film like _Piranha 3D_ on factors like good taste, because it goes out of its way to smash these conventions apart. The film has this crazy energy about it from beginning to end.\r\n\r\nIt also however, is the perfect example of why 3D is so fucking unnecessary. And though I appreciate how forward the film is, that doesn't make it strictly speaking good. It's part creature-feature, part horror-comedy, but it doesn't stand up in a thrill sense to actual monster movies like _Anaconda_ or _King Kong_, and it doesn't stand up in a humour sense to actual horror comedy like _Shaun of the Dead_ or _Dead Snow_, but it sort of takes off on its own in a passable manner. Though it's kiiinda humorous, the film is mostly just \"fun\", as opposed to \"funny\".\r\n\r\nThe script seems cobbled together with a couple of different half assed plot points, but several half ass plots taped together is better than just one half assed plot trying to hold its own and ending up looking like no plot at all. Exploitation has never really been A-grade material, and even though the \"suspension of disbelief\" thing that films are supposed to have as a general rule, is sort of... not here, _Piranha 3D_ still manages to somehow get this piece of crap off the ground.\r\n\r\nI watched it at about 2am with a male friend of mine who has very similar taste and sense of humour to me, and that's pretty much got to be the best possible setting to watch it in. The CG gore is ridiculous, the 3D focus is ridiculous, the film itself is just fucking ridiculous. But brainless is great sometimes, just don't make a habit of thinking that you can get away with bad exploitation, and calling it Black Comedy, once or twice is fine, but soon it just looks like you're aiming for cult, and getting lazy.\r\n\r\n-Gimly", "created_at": "2017-07-10T07:50:50.504Z"}, {"movie_id": 43593, "review_id": "5a9eec560e0a2641cb0034a5", "author_rating": 4.0, "review_text": "This is the 2010 remake of the old classic. The original is pretty much crap so I bought this one solely based on the fact that it has been getting unusually good reviews from both critics as well as viewers.\n\nI have to say that I am at loss as to why. There are loads of much better films in the action/horror/fantasy genre’s that, at least the so called “critics” totally hammer. Why the hell this trash got so good scores is beyond me.\n\nThe female acting consists of showing off your boobs then get eaten. The male acting consists of being an asshole, get your dick eaten, then get the rest eaten. The main “event” is a contrived scene when the main asshole get his dick bitten off and the piranhas eat it and spit it out again under water. I’m sure the 3D effects made it even more ridiculous than in 2d. I usually have rather high tolerance for poor acting and bad scripts when it comes to otherwise effects and gore loaded films but most of this film I was just thinking, “what the f... is this shit!”.\n\nMost of the film was just scenes stashed on top of each other designed to show of 3D effects with boobs and various ways a human could get eaten. This is a typical example of why 3D is bad for the movie industry.", "created_at": "2018-03-06T19:30:30.166Z"}, {"movie_id": 43593, "review_id": "5bbb09afc3a368242b03545e", "author_rating": 7.0, "review_text": "Piranha hunt in packs - not for protection, but for overwhelming force.\r\n\r\nActually many of today's younger multiplex goers hunt in packs, they know what they like and they know how to have a good time with even the most crude or banal movie. I don't mean that as an insult, it's just indicative of the film market available to them, it's the reason why films like this here Piranha remake/re-imaging/re-jig exists and makes money. Even \"spawning\" a franchise on occasions.\r\n\r\nAlexandre Aja's Piranha 3D is a complete machine gun of a movie, it knew exactly how to sell tickets at the box office. Even before the 3D was used as a selling point, the word down the grapevine was the promise of lithe bodies in beach wear and loads of CGI killer fish shredding the hell out of a whole community. And that's exactly what is delivered, only with extras that see considerable nudity in the mammary areas and Elisabeth Shue and Ving Rhames kicking buttocks.\r\n\r\nIt's all very bloody, even lurid and exploitive, while it's difficult to know if you are meant to laugh, scream or do something that Russ Meyer would endorse? But, and I say this as a middle aged old fart, there is so much fun to be had here if you are prepared to unscrew your head and take out your brain. Strap yourselves in Piranha 3D haters, your grandchildren might just be enjoying in the future: Piranha 27: Sexy Mechanoid Bimbos Fight Back. But will they hate themselves in the morning? 7/10", "created_at": "2018-10-08T07:39:27.313Z"}, {"movie_id": 43593, "review_id": "6323e6e184591c0082aaaae2", "author_rating": 1.0, "review_text": "In 1975, Richard Dreyfuss starred in Jaws; 35 years later he had a cameo in Piranha. His connection to the first film is obviously the only reason he’s in the second, wherein he’s killed off before his name even appears in the opening credits. \r\n\r\nDreyfuss is not alone, though; Elisabeth Shue and Ving Rhames also get to whore themselves out. In the latter's case, there was never any danger that Piranha would result in another hand-me-down acting award for Jack Lemmon; on the other hand, Rhames has easily the best scene in the entire movie — using an outboard motor in a way that would make Ash Williams proud. \r\n\r\nBut I'm getting ahead of myself; Shue and Rhames first have to find the remains of Dreyfuss, then capture a piranha which they take to Christopher Lloyd (in full Doc Brown mode), who identifies it as a species that has been extinct for two million years (according to the subtitles, Lloyd calls it the \"regional piranha,\" but he may actually be saying \"original\"; either way it doesn’t matter because neither term makes sense). \r\n\r\nAn earthquake released the piranhas from an underground lake, or some such bullshit. Q: \"How could they survive for so long cut off from the surface?\" A: \"Cannibalism. They must have fought each other to survive.” Until, presumably, there could be only one. Piranha MacLeod? Well, that would actually explain their apparent immortality.\r\n\r\nPiranha is supposed to be a comedy — or, specifically, it's a remake of a parody of Jaws released three years after Jaws and 32 before this one. In other words, this material was so diluted it was almost homeopathic. \r\n\r\nShue and Rhames are big fish in a small pond here — kinda like those poor Sea World orcas (I know they’re mammals; you get the idea, though); as such, the only emotion they inspire in the audience is pity over their career choices. \r\n\r\nOnly Jerry O'Connell, in a role no doubt based on Joe Francis (of Girls Gone Wild infamy), moves as if he's in his own element — ​​because he is; he knows exactly, having been in several others of the same ilk, what kind of movie this is, and navigates it accordingly.", "created_at": "2022-09-16T03:00:49.626Z"}]