[{"movie_id": 87101, "review_id": "5e898b9ad207f30016984318", "author_rating": 5.0, "review_text": "Some people have said that _Terminator: Genisys_ is disrespectful to its source material (first two films) but I disagree. Out of what is clearly a massive homage to _Judgement Day_, _Genisys_ gives away the entire plot and central “twist” in its promotional material months before its release, just like _Judgement Day_ did!\r\n\r\nAll levity aside, _Terminator: Genisys_ is not great. They took some risks with their casting and it didn’t explode in their face which is nice, a lot of the effects were very visually impressive, and it was fun to see the weapons of the future be purple lasers again, but these aren’t things that make a good movie by themselves. When you mix them up with a plot that doesn’t completely make sense, a story that’s just plain not all that great, some hammy dialogue and a lacklustre ending, then you SPOIL YOUR OWN DAMN MOVIE IN THE TRAILERS **AND** POSTERS, then you’re lucky to even be coming away with a middle of the road score like this one.\r\n\r\nAt least it’s not _Rise of the Machines_.\r\n\r\n_Final rating: ★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-04-05T07:41:14.645Z"}, {"movie_id": 87101, "review_id": "63bf724523be46007cb9ae49", "author_rating": 1.0, "review_text": "Terminator Salvation was pretty bad, but this brings it to a whole new level. What we have hear is a reboot of the canon that no one actually asked for, that no one actually wanted, and that makes really no sense.\r\n\r\nHonestly, it's even worse than T3, which at least felt like a continuation of the series.\r\n\r\nHere everything is changed so much that, well, there is nothing left. It took the entire Terminator franchise, and re-worked it to kill all the canon, all the mythology, for no apparent reason whatsoever.\r\n\r\nAnd what you have left is a disheveled mess that is guaranteed to make the old fans give up and walk away because of the sheer needlessness alone.", "created_at": "2023-01-12T02:36:53.477Z"}]