[{"movie_id": 76025, "review_id": "59012820c3a3681138002f4f", "author_rating": 2.0, "review_text": "Has a good reputation among critics and film-buffs, but I thought this was duller than dullsville on a dull tuesday.\r\n\r\nFassbender has got to be one of the most overrated actors in recent times. He's got a distinctive look and his eyes pierces through the screen I'll give him that. And a well-sized johnson (as proven on numorous ocassions here) but other than that he's fairly mediocre.", "created_at": "2017-04-26T23:07:12.364Z"}, {"movie_id": 76025, "review_id": "5f2f6773417aaf0036f892a9", "author_rating": 10.0, "review_text": "Shame is nothing short of a masterpiece: every shot tells a story.\r\n\r\nSYNOPSIS: (from Google)\r\nSuccessful and handsome New Yorker Brandon (Michael Fassbender) seems to live an ordinary life, but he hides a terrible secret behind his mask of normalcy: Brandon is a sex addict. His constant need for gratification numbs him to just about everything else. But, when Sissy (Carey Mulligan), Brandon's needy sister, unexpectedly blows into town, crashes at his apartment and invades his privacy, Brandon is finally forced to confront his addiction head-on. \r\n\r\nREVIEW:\r\n\r\nI'm certain Shame will always be my personal favorite McQueen film. McQueen tells a story with the camera and with the voice. \r\n\r\nMcQueen brought on Sean Bobbitt as cinematographer for this amazing project and Bobbitt does not disappoint. Together they craft some of the most revealing and beautiful scenes in recent cinema. The lighting for this movie (also headed by Bobbitt), aids in the visual storytelling.\r\n\r\nAbi Morgan and McQueen's script really shines, bringing Brandon's addiction further into the light. \r\n\r\nHarry Escott's haunting score will never leave your brain after you see this film. Escott's use of both classical and original pieces bring the film together.\r\n\r\nMichael Fassbender gives a stunning performance as Brandon, one moment he's casually strolling about, the next he's acting on his most basic impulses, and the next he's yelling at his sister. Carey Mulligan gave a great supporting role next to Fassbender as well. Both are given several scenes to shine.\r\n\r\nThe film uses its NC-17 rating to its fullest extent, yet none of the sex feels sensationalized. It's all very real and most of the time almost disturbing to watch. McQueen delivers the entire story very artistically, including the sex scenes, which many directors could have messed up. This makes the film as a whole flow better. The movie portrays sex addiction (and addiction in general) in a very real way, while everyone is different we all feel shame after we've gotten our fix, and sometimes we'll do anything to get that fix.", "created_at": "2020-08-09T03:03:15.815Z"}]