[{"movie_id": 246087, "review_id": "53bb165c0e0a26196b000268", "author_rating": 7.0, "review_text": "It looks like Vijay has realized that he can be in mass masala films that are not only entertaining to his fan base but also to every segment in the audience. He did this earlier with films like Ghilli, Pokkiri and Thuppakki, and does it now with Jilla. This time, he shares the glory with Mohanlal, who plays his godfather in the film. The plot revolves around Sivan (Mohanlal), a don in Madurai, who brings up Sakthi (Vijay), whose father died for him, as his own son. The two are a formidable force in the city but circumstances force Sivan to ask Sakthi to become a cop. But when an accident results in the death of several innocents, Sakthi wants his father to turn over a new leaf. But the older man is not in the mood to heed his advice, and soon, the two are on opposing sides. \r\n\r\nAs far as commercial films are concerned, Jilla is definitely assured filmmaking. Neason understands that the conflict between Sivan and Sakthi is what powers his film and sets up the initial clash between these two characters very well. Sakthi's realizes the error of his ways after a horrible blast, which happens because of Sivan's decision. The scenes following this blast are quite horrific for this kind of film but they are so effective in making us understand why someone as loyal as Sakthi will shift sides and decides to take on the person who is his father figure. The confrontation scene is very well shot and the dialogues too are punchy in this scene. Vijay and Mohanlal are very good here. Vijay utters Sakthi's lines in a nonchalant way (Unakkaga enaku pidikadha khakhi potu police aanen illa, enakkaga nee ippo nallavana maaru) while Mohanlal treats Sivan's lines with seriousness, and so we get to see where each character stands — the son only wants his father to change but the latter will not give an inch from his position and is even ready to banish him from the house. When the intermission point arrives, we eagerly anticipate what might come next. \r\n\r\nNeason also keeps Sivan's character in the grey area — he never has any remorse for the blast, he even brokers for a pharma company which is banned everywhere in the world; he is so egoistic that he wants to put Sakthi in place at any cost. Which is why, we feel cheated when the director decides to bring in another antagonist who wants to bring down the father-son duo. Thankfully, our disappointment doesn't last long as this character poses a formidable challenge to Sakthi and that keeps this segment engaging. He even has a minor victory when he manages to kill a character close to Sakthi and Sivan. \r\n\r\nThe lighter portions too are done with confidence. Neason understands the irony of a guy who hates the khakhi falling in love with a woman who is a cop, and treats the romance in a playful manner. He even approaches the scene in which Sivan urges Sakthi to become a cop in a similar vein. A godfather asking his son to do something he hates is heavy duty drama material but the director sidesteps this by going for a good-humoured tone, and just to not make it appear too frivolous, makes Sakthi tell his mom that he will do anything to not see his dad tearing up again. He also manages to get away with the implausible scenario of a don's hireling becoming a cop. \r\n\r\nThe main issue with Jilla is that it is overlong. Neason, probably in an effort to make it a wholesome entertainer, keeps packing in scenes oblivious to the running time. So, we have an unwarranted sub-plot involving Sakthi's sister and forcefully fitted songs which only make the film lengthy. Also, his tendency to cut to a childhood moment every time he wants to make an emotional statement becomes gratuitous after a point — the film itself begins with Sakthi as a boy; when Sakthi is injured, he recalls a moment when Sivan rushed to him when he injured himself as a boy; when his brother talks about growing up holding Sakthi's hands, he cuts to a montage of two boys holding hands.", "created_at": "2014-07-07T21:51:24.458Z"}]