[{"movie_id": 49524, "review_id": "5a5907130e0a2634f8010021", "author_rating": 6.0, "review_text": "As far as I am concerned this is another movie that demonstrates that the rating  of the so-called “professional” critics used by Rotten Tomatoes are next to useless, at least as far as I am concerned and the official rating system at RT in general is deeply flawed. Yes I know that I have been harping about this before but I think it deserves to be repeated. Sure, this movie is not the greatest I have ever seen but come on! If you go to the movie’s page at RT you see a big rotten 13% flashing at you. That makes the unaware reader think the movie is a real turkey and that to me is just recycled bull food.\r\n\r\nAt sites like IMDb and TMDb the movies gets around 5.5 out of 10 which, although not great, is much more reasonable. Also the viewer rating says 42% which looks bad but if you look at the details you see that the average rating is 3 out of 5 stars which to me is more an “okay” rating. The RT ratings is seems to be made to make all movies except the blockbusters look bad.\r\n\r\nAnyway, with that little rant over with, let us get to the movie itself. Personally I found it a quite entertaining movie that could have been better. There are quite a few funny scenes and the special effects are not bad.\r\n\r\nJeff Bridges is quite funny as the veteran sheriff although his character is still one of the things that could have been done better. He is supposed to be the knowledgeable veteran but in many scenes it seems like the other way around. His stubborn stupidity is sometimes rather annoying.\r\n\r\nThe plot is fairly simple and straightforward. Nothing fantastic and a bit contrived perhaps but good enough to string the special effects scenes together leading up to the grand finale. The cumin nonsense and the scene where Roy is stuffing his head with spicy food to get a dead to reveal himself is a bit of a downer though.\r\n\r\nA lot of people have been claiming that it is a M.I.B. rip-off. I think that is rubbish. Yes, there are similarities but then every movie with a veteran, a rookie and a sci-fi or a fantasy theme could be said to be a rip-off in that case. There are so many movies made that one will always find similarities. Just live with it.\r\n\r\nAs I write before, on the whole I found the movie rather entertaining and me and the kids sure enjoyed our movie evening.", "created_at": "2018-01-12T19:05:55.912Z"}, {"movie_id": 49524, "review_id": "646d0aeed18572014032ef49", "author_rating": 6.0, "review_text": "Yes, ok, it's a terrible film, but in the best way. It's worth watching just to see Jeff Bridges having so much fun sending up his character and himself.", "created_at": "2023-05-23T18:50:22.155Z"}]