[{"movie_id": 62211, "review_id": "5916a50192514159c102b2f3", "author_rating": 7.0, "review_text": "Monsters University, it’s great, it’s the best thing Pixar’s brought out in the past three years leading up to it. It’s enjoyable, it’s well casted and it’s cute without being too cheesy. It’s also the third miss in a row for Pixar.\r\n\r\nMU, just like Brave (and unlike Cars 2) is filled with merit, and well worth watching. But in 1995 when Pixar came out swinging with Toy Story, people expect that sort of a trend to continue. Which it did! Right up until 2006, when they released their seventh film (Cars); the first film they’d gotten behind that didn’t blow audiences world wide out of the Goddamn water. Pixar’s limped up and down the approval ladder ever since, with MU sitting comfortably somewhere in the middle.\r\n\r\nIt is a great film. Especially for a kids’ film, especially for a prequel, all of that, but it is not the return to greatness audiences keep hoping for. It plays it safe, it lulls in the dreary, rarely well-pulled-off format of “College Comedy” (which is again, a safe area to sit in). It may not be as triumphant as the original, but it’s not all together disappointing either.\r\nThe film does what virtually any film with large amount of money behind it does: It stands in front of you for an hour and a half, does its job in the entertainment industry of “entertaining” you, then it sidles out, leaving you smiling, but not thoroughly satisfied. It takes as few risks as possible, and vehemently avoids anything new, just in case it pisses people off, and risks not making their money back.\r\n\r\nIt’s fine, people of the world are used to this, it’s a fun ride, and then it’s done. Worth your money, worth your time, but not what people have come to expect from the powerhouse of Pixar’s heyday. \r\n\r\n74%\r\n\r\n-Gimly", "created_at": "2017-05-13T06:17:37.575Z"}, {"movie_id": 62211, "review_id": "5f132674b87aec00351bdf76", "author_rating": 7.0, "review_text": "A fun prequel to <em>'Monsters, Inc.'</em>.\r\n\r\nIt isn't on the same level as the preceding film, but <em>'Monsters University'</em> is a pleasing film nonetheless. It takes a trip backwards in time to see Mike and Sully pre-Inc. and it comes out good, it doesn't have as much as heart but the comedy is still there at a strong level.\r\n\r\nJohn Goodman (Sully) and Billy Crystal (Mike) are again fantastic, while Helen Mirren comes in as a new character, Hardscrabble, and gives a pleasant performance. I don't love the other new characters, but they certainly serve a purpose and play a part.\r\n\r\nThe plot is entertaining, it drops a little bit once the competition begins but everything is still enjoyable - the 104 minute run time flies by. I think I would've preferred a sequel story featuring a grown up Boo (admittedly not sure in what way), but this production is a suitable attachment to the quality 2001 original.", "created_at": "2020-07-18T16:42:28.647Z"}, {"movie_id": 62211, "review_id": "606d046c1cc4ff0029c83d70", "author_rating": 10.0, "review_text": "This is a great movie. The quality of animation is amazing, and they captured the University feel perfectly. Lots of fun little scenes, backgrounds, and homages to the original movie.", "created_at": "2021-04-07T01:01:32.400Z"}]