[{"movie_id": 433808, "review_id": "5a83a5aa9251417599007a59", "author_rating": 7.0, "review_text": "I'm sorry, but who the fuck, with no promotional material, and with a name as generic as _The_ fuckin' _Ritual_, told this movie, it was allowed to be so good?\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-02-14T02:57:46.661Z"}, {"movie_id": 433808, "review_id": "5a84955bc3a3686207011153", "author_rating": 7.0, "review_text": "RELEASED IN 2017 and directed by David Bruckner, \"The Ritual\" is a psychological adventure/horror about four British dudes in their 30s who embark on a hike in remote northern Sweden wherein it slowly becomes evident that some THING is stalking them in the dark woods. Will any of them make it out alive? \r\n\r\nThis is basically a meshing of “The Blair Witch Project” (1999) and “Ogre” (2008), but without the tongue-in-cheekiness of the latter. There’s also a little bit of “The Wicker Man” (1973/2006). Like “Blair Witch” the foul-mouthed protagonists become increasingly horrified in the foreboding forest and eventually turn on one another. But the sylvan cinematography is leagues superior due to the spectacular Romanian locations as opposed to the pedestrian film-work of “Blair Witch” in Maryland (which is understandable since the latter is a “found-footage” flick).\r\n\r\nI’m not going to give-away the creature, which isn’t fully revealed until the last fifteen minutes, but it’s basically a hybrid of the monsters in “The Relic” (1997) and “Wendigo” (2001), albeit bigger, and superior to both. The second half deviates from the book and people complain about it, but it’s superior to the lame black metal cult of the book IMHO and you can’t beat one potent sequence that smacks of hell-on-earth. There’s also an intriguing element about achieving nigh-immortality at the price of submissive veneration. Despite these positives, the movie’s a little uneventful and humdrum, plus it's lacking in the female department.                \r\n\r\nThe movie runs 1 hour 34 minutes and was shot entirely in Romania. WRITERS: Joe Barton wrote the script based on Adam Nevill’s 2012 novel. CAST: The four protagonists are played by Rafe Spall, Arsher Ali, Robert James-Collier and Sam Troughton. \r\n\r\nGRADE: B/B- (6.5/10)", "created_at": "2018-02-14T20:00:27.760Z"}, {"movie_id": 433808, "review_id": "5a8f725e0e0a26399e007554", "author_rating": 4.0, "review_text": "The Ritual is a monster movie with psychological ambitions and seemingly a decent budget. The jötunn monster is actually quite good and so are the cyclic re-enactments of the early on liquor store trauma. Unfortunately the rest of the movie is as bland as the title and relies too much on exotism of the deep Swedish forests. Sadly even that component gets watered out and the endgame cultists seem to be some recycled wiccans from Scotland rather than pre-christians of northern Scandinavia.", "created_at": "2018-02-23T01:46:06.231Z"}]