[{"movie_id": 446021, "review_id": "5c36f3df925141531224dfc0", "author_rating": null, "review_text": "_Bad Times At The El Royale_ was exceptional. Through its preview period, I was hooked from the teaser trailer to the 24th TV Spot released. Drew Goddard knew how to make a wonderous and exciting thriller through its magnificent casting and so much more. All these trailers set high expectations which made me worry a little bit as I don’t like getting myself too excited for movies because sometimes, I get very disappointed. But with this, it exceeded my high expectations. _Bad Times At The El Royale_ just crushed it and it felt riveting the whole time which is something that is hard to find in films nowadays.\r\n\r\nThe casting was incredibly on point for this with Dakota Johnson, Jeff Bridges, Jon Hamm, Lewis Pullman, Chris Hemsworth, Cailee Spaeny and Cynthia Erivo delivering Oscar-worthy performances. Both Lewis Pullman and Cailee Spaeny deserve a lot of recognition. They just both developed so well throughout and it just astounded me at the level that they could deliver. The best thing about all these wonderful and exciting characters were the connections they all had with each other whether it be a love/hate relationship. To avoid spoilers, I will not highlight who my favourite connection was but _Bad Times At The El Royale_ knew how to deliver excellent performances and wonderful connections.\r\n\r\nThe story was captivating in itself but what really accompanied this well-made film was its soundtrack which really packed quite a punch. Songs like This Old Heart Of Mine by The Isley Brothers, which was featured in the trailer and sung incredibly well by Cynthia Erivo, and Can’t Take My Eyes Off You by Frankie Valli just fit in the most perfect ways. Movies like _Baby Driver_ and _Shaun Of The Dead_, both coincidentally directed by Edgar Wright, wouldn’t have been what it was without its soundtrack, and it’s unfortunate to say that _Bad Times At The El Royale_ would have suffered a bit without the ‘60s music. \r\n\r\nFortunately, nothing disappointed me at all with this movie because the height of intensity was just there without doing to much to establish it. Jon Hamm was most of the reason, along with Chris Hemsworth, that really helped make this such a great film. Drew Goddard produced beautiful camerawork and outstanding set design. It is truly one of the most brilliant films ever created and I’ve only ever been astounded this much by _Searching_ as I kept feeling like I didn’t know what was going to happen. And honestly, I didn’t. But the big thing that would keep certain audiences away is the level of gore that I’ve only ever seen in Tarantino films and _Brawl In Cell Block 99_. _Bad Times At The El Royale_ is a lot like Tarantino’s _The Hateful Eight_ but it was done 10x better. Everything just seemed to click with me throughout the long runtime and I’m glad I didn’t give this a miss.\r\n\r\n_Bad Times At The El Royale_ is wonderful with unpredictable plot twists, exceptional casting and chemistry, a smartly written script and high intensity levels. I expect to see a lot of Oscar nominations for this movie as it deserves a lot of recognition whether it be surprising performances from the likes of Dakota Johnson and Lewis Pullman or fantastic costumes and design. _Bad Times At The El Royale_ just clicked with me 100% and could not lose my attention from the second I saw Nick Offerman walk into his hotel room. I paid attention to every second and enjoyed it so _Bad Times At The El Royale_ deserves a thrilling 10/10.", "created_at": "2019-01-10T07:27:27.649Z"}, {"movie_id": 446021, "review_id": "5c440a76c3a3681a0c23dffc", "author_rating": 8.0, "review_text": "More often than not, the fragmented, time-jump-y form of storytelling (a la Tarantino) doesn't do it for me. But _Bad Times at the El Royale_ nails the format, and just about everything else while it's at it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-01-20T05:43:18.711Z"}, {"movie_id": 446021, "review_id": "5cf59368c3a3685c0823747f", "author_rating": 5.0, "review_text": "**_Derivative, predictable, and dull_**\r\n\r\n> _There is something about hotels that I find very romantic. You get to try on a different life in a hotel. You're usually in a new place when you're staying in a hotel. There's something about the experience that allows you to be a different person. You can think to yourself: \"Oh, this is what it would look if I were in Paris. This is what it would look like if I were in New York.\" There's something about it that transports you somewhere and that, I suppose, has always been good for creativity and imagination. I love the entire spectrum of hotels, b__ecause for a creative person, it's about trying on a new life. For the El Royale, I liked this idea of a hotel that had a shadier side to it._\r\n\r\n- Drew Goddard; \"Exclusive _Bad Times At The El Royale_ Interview With Drew Goddard\" (Simon Gallagher); _WhatCulture_ (October 9, 2018)\r\n\r\nFollowing the genre-bending, utterly insane, and extremely funny _The Cabin in the Woods_ (2011), _Bad Times at the El Royale_ is the second feature from writer/director Drew Goddard, who has also accrued writing credits for Matt Reeves's _Cloverfield_ (2008), Marc Foster's _World War Z_ (2013), and Ridley Scott's _The Martian_ (2015), as well as TV shows such as _Buffy the Vampire Slayer_ (1996-2003), _Angel_ (1999-2004), _Alias_ (2001-2006), and _Lost_ (2004-2010). In short, he has an impressive résumé. As it stands in relation to _Cabin_, _Bad Times_ is a similarly stylised cine-literate genre mash-up. However, whereas in _Cabin_, the twist upon twist upon twist had a cumulative effect, with the story getting better the longer it went on and the weirder things got, in _Bad Times_ it's a case of ever diminishing returns. By the time we reach the end of the lengthy 141-minute runtime (more on that later), with everything and everyone shoehorned into neatly explained niches, the film has been shorn of its vitality, leaving one with an overriding impression of \"meh\". If _Cabin_ was a genuinely new spin on a clichéd old story, playing with and subverting genre at every turn, _Bad Times_ is singularly unable to free itself from the most oppressively derivative of its generic constraints.\r\n\r\nSet in 1969, the film takes place almost entirely in the titular El Royale Hotel (actually a motel, and obviously inspired by the Cal Neva Lodge & Casino), a once popular but now fading novelty spot situated half in Nevada and half in California, with a line literally running down the centre of the property to delineate the border. To say too much about the plot or characters would be to ruin some of the twists (which is ultimately all the film really has going for it), but the basic set-up is that over the course of one night, seven people will encounter one another but not all seven will leave. There's Fr. Daniel Flynn (Jeff Bridges), a Catholic priest on the way to see his brother; Darlene Sweet (Cynthia Erivo), a singer travelling to a job she doesn't want; Emily (Dakota Johnson), an intensely private woman who wants nothing to do with any of the others; Laramie Seymour Sullivan (Jon Hamm), a slick vacuum cleaner salesman; Rose (Cailee Spaeny), who appears to be Emily's kidnap victim; Billy Lee (Chris Hemsworth), a cult leader obviously based on Charles Manson; and Miles Miller (Lewis Pullman), the motel's receptionist/bellhop/maid/barman/manager. As the night wears on, it becomes apparent that not only are few of these people who they claim to be, but the motel itself is hiding its own dark secrets.\r\n\r\nIf that set-up reminds you a little of James Mangold's _Identity_ (2003), you're not completely off course. _Bad Times_ shares very similar DNA, at least up to the point where _Identity_ goes totally batshit crazy; both are set in an out-of-the-way motel where a group of strangers are trapped overnight, and all, or some of them aren't who they appear, with the audience slowly filled in on their backstories via flashbacks. However, whereas _Identity_ failed because the last half-hour is patently ridiculous, completely undermining the excellent build-up of tension and mystery, _Bad Times_ has the exact opposite problem – the conclusion is decidedly underwhelming, failing to build on an excellent set-up, with the last twenty minutes or so lapsing into utter mundanity, and, most unforgivably for a mystery film, twists for twist's sake. The structure also somewhat recalls _Lost_ (a disparate group of strangers forced together at a mysterious location filled with secrets, whilst a flashback-heavy narrative fills us in on who these people are), and, perhaps more obviously, the high-concept, perspective-shifting, often achronological _Pulp Fiction_ (1994) imitators of the late 90s; films such as John Herzfeld's _2 Days in the Valley_ (1996), Peter O'Fallon's _Suicide Kings_ (1998), and Troy Duffy's _The Boondock Saints_ (1999).\r\n\r\nTo start on a positive note though, _Bad Times_ looks terrific – as you would expect from veteran cinematographer Seamus McGarvey (_The Hours_; _We Need to Talk About Kevin_; _Nocturnal Animals_), the photography is faultless, whilst the production design by Martin Whist (_Down with Love_; _Devil_; _Super 8_) and the art direction by Michael Diner (_Firewall_; _Night at the Museum_; _Redacted_) are superb, with the ultra tacky period detail dripping off the screen. Directorally, Goddard also has his moments with some eye-catching compositions, locked-off cameras, POV shots, and lengthy single-take Steadicam sequences. However, it's in relation to this last point where one of the film's most immediate problems is to be found – the solid directorial work is completely out of step with the vapid writing, as if a screenplay intended for Michael Bay ended up being directed by Michael Mann (although Goddard is certainly no Mann). The barely-there storyline seems to be nothing other than a hangar onto which to drape a tone and style, rather than generating that style.\r\n\r\nPerhaps in relation to this disparity between style and story, the film's second strongest sequence is the opening scene. Shot entirely from a fixed camera position, and looking for all the world like a stage play, the scene is completely wordless, and charts the course of several hours in one of the motel rooms, as a man whose face we never clearly see checks in, moves all of the furniture to one side of the room, pulls up the floorboards, hides a bag under them, places them back, puts all the furniture back, relaxes for a while, and is promptly shot dead. The scene is a masterclass in slow-burning tension – we know something bad is going to happen, but Goddard refuses to pull the trigger prematurely, so when the violence does erupt, it's a pseudo-cathartic moment for the audience (incidentally, the film's best sequence is similarly abstract, slowly plotted, and mostly _sans_ dialogue, but as it involves the discovery of an important and unexpected location within the motel, to say any more would be a spoiler). The problem is that the heavily stylised and brilliantly directed opening is so good, it spoils the audience, establishing a tone to which the rest of the film mostly fails to live up.\r\n\r\nIn direct contrast to the opening, the ending is both narratively and directorally formulaic, predicable, and trite, with the least compelling and well fleshed out character taking centre stage, mano-a-mano good guy/bad guy dialogue aplenty, and even a ludicrous shoot-out. The whole things smacks of \"been there, seen that a million times.\" Additionally, whereas the opening is effortlessly enthralling and distinctive, as the film lumbers on, and Goddard begins to run out of directorial tricks, there are sequences which scream \"look how cool I am.\" For example, Billy Lee whirling toward the camera, eating pie, shirt agape, hair soaking wet, dancing to the sounds of Deep Purple's cover of \"Hush\" (1968) is so desperate to become iconic that it instead comes across as self-parody.\r\n\r\nAnother significant problem is that the characters all feel like generic archetypes ripped out of other films, with none giving the impression of being a real-person, with their own agency and interiority. They are, in essence, walking plot-points. The script is also exceptionally weak in how it handles exposition (of which there is a significant amount). There seems to have been little attempt to organically introduce heavily expositional scenes, or integrate them with the surrounding material. Instead, on several occasions, the plot literally stops whilst characters explain things to one another. A particularly bad example of this is when Flynn and Sweet arrive at the motel reception. Sullivan is already there, and begins to tell them the inner workings of the establishment, having stayed there numerous times in the past. Then Miller turns up, and begins to recite a rehearsed sales pitch. Simply trading exposition from one character to another doesn't mean it's not exposition – the scene is painfully slow, dull, and pointless, telling us precious little that we actually need to know. Indeed the entire issue of the motel being bi-state is strangely pointless. Aside from the novelty value, it is never factored into the narrative, and one wonders why Goddard set the film in such a specific location if he had no plans to use that specificity thematically.\r\n\r\nA final problem which must be discussed is that 141-minute runtime. Padded, and massively self-indulgent, there is enough narrative content to barely fill a 90-minute duration. One of the most egregious missteps in this respect is Goddard's tendency to ponderously play out the same scene from multiple points of view, but in such a way as to give the audience only a smidgeon of additional information, so by the third time we're seeing a scene (which was too long even the first time around), it becomes an endurance test. Also, with this runtime and so little content, needless to say, the bottom falls out of the film entirely during the middle section, as things become unrelentingly slow and contrived. Goddard seems to equate curiosity about who the characters are with filmic suspense, meaning things take a decided turn for the mundane long before the underwhelming _dénouement_. The interesting set-up earns him a fair bit of wiggle room in relation to this, but he abuses it, pushing the audience far beyond the point where they simply give up caring about anything on screen. And when he finally does get around to wrapping things up, the last few twists are nowhere near enough of a reward. Personally, I was left feeling that the mysteries were more rewarding than the explanations.\r\n\r\nPart 1930s-style pulp fiction, part 1940s and 50s-style film noir, and part 1960s-style paranoid thriller, the film flirts with a few themes (redemption, forgiveness, karma, political corruption, the seductive nature of power), but none get off the starting grid, and ultimately, _Bad Times_ isn't really _about_ anything. Hyper self-aware, and attempting to both subvert and celebrate generic conventions, Goddard seems to think he has a bonafide epic on his hands, a portent piece of celluloid mastery which samples the best of hard-boiled crime fiction, and imparts valuable lessons in the process. He doesn't. It's more self-indulgent folly than paean of universal truth. And it's painfully dull.", "created_at": "2019-06-03T21:38:48.523Z"}, {"movie_id": 446021, "review_id": "621a90e592e55b001b6ebc50", "author_rating": 7.0, "review_text": "Although the first half presents a smart and mysterious blend of, say, ‘The Hateful Eight’ and ‘Identity’, the plot lacks the puzzle pieces to grow towards a grand solution in it's ending.\r\n\r\n7/10", "created_at": "2022-02-26T20:43:17.352Z"}, {"movie_id": 446021, "review_id": "63bf81e123be460098085ac1", "author_rating": 10.0, "review_text": "Ok, Wow, I don't think I've seen a movie like that since the 90s. Some have gotten close, but this one absolutely stinks of clever 90s independent film...\r\n\r\n...at least in that era where studios were putting serious bank behind indie films in an effort to score awards and produce something new that audiences would eat up.\r\n\r\nThe wow sort of starts with the soundtrack, which is brilliant found music that not only fits the era, but fits the film like a globe.\r\n\r\nThe casting is perfect, with a special shout out to Cynthia Erivo who sold her role as an R&B singer as if, well, she is one, but the delivery was absolutely brilliant on her end, despite the fact that she is one in real life. I guess it's where basically playing yourself pays off in spades.\r\n\r\nShe was brilliant, but then, so was absolutely everyone else.\r\n\r\nAnd this is all put together with a plot that twists and turns and situations that just move from bad to worse in the best possible Hollywood way.\r\n\r\nIt's a movie you have to see.", "created_at": "2023-01-12T03:43:29.689Z"}, {"movie_id": 446021, "review_id": "64e7aa22e894a6011ef7aed7", "author_rating": 8.0, "review_text": "**_Tarantino-esque flick about one rainy night at a dubious motel in Northern California_**\r\n\r\nIn 1969, four strangers spend the night at the El Royale hotel on the border of California & Nevada, near Lake Tahoe. These visitors consist of a priest (Jeff Bridges), a singer (Cynthia Erivo), a vacuum cleaner salesman (Jon Hamm) and an edgy young woman (Dakota Johnson). They’re going to have an unforgettable night. Lewis Pullman plays the meek manager of the motel that used to be a bustling business while Chris Hemsworth and Cailee Spaeny have key roles.\r\n\r\n“Bad Times at the El Royale” (2018) is a crime thriller that takes the milieu of the “Psycho” flicks and combines it with the dialogue-driven style of Tarantino. The later “The Virtuoso” (2021) is comparable, although this is more colorful, not to mention half an hour longer. Not only is it superior to that film, it’s also superior to the movie the writer/director is most known for, “The Cabin in the Woods” (2012).\r\n\r\nTo appreciate “El Royale” you have to be prepared for a flick that has the confidence to take its time as the characters are fleshed out and their secrets revealed. Some don’t like how things pan out in the last act revolving around Hemsworth’s character, but it worked for me and fit the times in which the story is set. Meanwhile Dakota Johnson looks great in jeans.\r\n\r\nFans of “Pulp Fiction,” “Jackie Brown,” “Inglourious Basterds” and “The Hateful Eight” should eat this up.     \r\n\r\nThe film runs 2 hours, 21 minutes, and was shot in areas east of Vancouver, British Columbia, including Pioneer Avenue in Agassiz and Mammoth Studios in Burnaby. Additional bits were done in California.\r\n\r\nGRADE: B+/A-", "created_at": "2023-08-24T19:06:10.549Z"}, {"movie_id": 446021, "review_id": "5c36f3df925141531224dfc0", "author_rating": null, "review_text": "_Bad Times At The El Royale_ was exceptional. Through its preview period, I was hooked from the teaser trailer to the 24th TV Spot released. Drew Goddard knew how to make a wonderous and exciting thriller through its magnificent casting and so much more. All these trailers set high expectations which made me worry a little bit as I don’t like getting myself too excited for movies because sometimes, I get very disappointed. But with this, it exceeded my high expectations. _Bad Times At The El Royale_ just crushed it and it felt riveting the whole time which is something that is hard to find in films nowadays.\r\n\r\nThe casting was incredibly on point for this with Dakota Johnson, Jeff Bridges, Jon Hamm, Lewis Pullman, Chris Hemsworth, Cailee Spaeny and Cynthia Erivo delivering Oscar-worthy performances. Both Lewis Pullman and Cailee Spaeny deserve a lot of recognition. They just both developed so well throughout and it just astounded me at the level that they could deliver. The best thing about all these wonderful and exciting characters were the connections they all had with each other whether it be a love/hate relationship. To avoid spoilers, I will not highlight who my favourite connection was but _Bad Times At The El Royale_ knew how to deliver excellent performances and wonderful connections.\r\n\r\nThe story was captivating in itself but what really accompanied this well-made film was its soundtrack which really packed quite a punch. Songs like This Old Heart Of Mine by The Isley Brothers, which was featured in the trailer and sung incredibly well by Cynthia Erivo, and Can’t Take My Eyes Off You by Frankie Valli just fit in the most perfect ways. Movies like _Baby Driver_ and _Shaun Of The Dead_, both coincidentally directed by Edgar Wright, wouldn’t have been what it was without its soundtrack, and it’s unfortunate to say that _Bad Times At The El Royale_ would have suffered a bit without the ‘60s music. \r\n\r\nFortunately, nothing disappointed me at all with this movie because the height of intensity was just there without doing to much to establish it. Jon Hamm was most of the reason, along with Chris Hemsworth, that really helped make this such a great film. Drew Goddard produced beautiful camerawork and outstanding set design. It is truly one of the most brilliant films ever created and I’ve only ever been astounded this much by _Searching_ as I kept feeling like I didn’t know what was going to happen. And honestly, I didn’t. But the big thing that would keep certain audiences away is the level of gore that I’ve only ever seen in Tarantino films and _Brawl In Cell Block 99_. _Bad Times At The El Royale_ is a lot like Tarantino’s _The Hateful Eight_ but it was done 10x better. Everything just seemed to click with me throughout the long runtime and I’m glad I didn’t give this a miss.\r\n\r\n_Bad Times At The El Royale_ is wonderful with unpredictable plot twists, exceptional casting and chemistry, a smartly written script and high intensity levels. I expect to see a lot of Oscar nominations for this movie as it deserves a lot of recognition whether it be surprising performances from the likes of Dakota Johnson and Lewis Pullman or fantastic costumes and design. _Bad Times At The El Royale_ just clicked with me 100% and could not lose my attention from the second I saw Nick Offerman walk into his hotel room. I paid attention to every second and enjoyed it so _Bad Times At The El Royale_ deserves a thrilling 10/10.", "created_at": "2019-01-10T07:27:27.649Z"}, {"movie_id": 446021, "review_id": "5c440a76c3a3681a0c23dffc", "author_rating": 8.0, "review_text": "More often than not, the fragmented, time-jump-y form of storytelling (a la Tarantino) doesn't do it for me. But _Bad Times at the El Royale_ nails the format, and just about everything else while it's at it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-01-20T05:43:18.711Z"}, {"movie_id": 446021, "review_id": "5cf59368c3a3685c0823747f", "author_rating": 5.0, "review_text": "**_Derivative, predictable, and dull_**\r\n\r\n> _There is something about hotels that I find very romantic. You get to try on a different life in a hotel. You're usually in a new place when you're staying in a hotel. There's something about the experience that allows you to be a different person. You can think to yourself: \"Oh, this is what it would look if I were in Paris. This is what it would look like if I were in New York.\" There's something about it that transports you somewhere and that, I suppose, has always been good for creativity and imagination. I love the entire spectrum of hotels, b__ecause for a creative person, it's about trying on a new life. For the El Royale, I liked this idea of a hotel that had a shadier side to it._\r\n\r\n- Drew Goddard; \"Exclusive _Bad Times At The El Royale_ Interview With Drew Goddard\" (Simon Gallagher); _WhatCulture_ (October 9, 2018)\r\n\r\nFollowing the genre-bending, utterly insane, and extremely funny _The Cabin in the Woods_ (2011), _Bad Times at the El Royale_ is the second feature from writer/director Drew Goddard, who has also accrued writing credits for Matt Reeves's _Cloverfield_ (2008), Marc Foster's _World War Z_ (2013), and Ridley Scott's _The Martian_ (2015), as well as TV shows such as _Buffy the Vampire Slayer_ (1996-2003), _Angel_ (1999-2004), _Alias_ (2001-2006), and _Lost_ (2004-2010). In short, he has an impressive résumé. As it stands in relation to _Cabin_, _Bad Times_ is a similarly stylised cine-literate genre mash-up. However, whereas in _Cabin_, the twist upon twist upon twist had a cumulative effect, with the story getting better the longer it went on and the weirder things got, in _Bad Times_ it's a case of ever diminishing returns. By the time we reach the end of the lengthy 141-minute runtime (more on that later), with everything and everyone shoehorned into neatly explained niches, the film has been shorn of its vitality, leaving one with an overriding impression of \"meh\". If _Cabin_ was a genuinely new spin on a clichéd old story, playing with and subverting genre at every turn, _Bad Times_ is singularly unable to free itself from the most oppressively derivative of its generic constraints.\r\n\r\nSet in 1969, the film takes place almost entirely in the titular El Royale Hotel (actually a motel, and obviously inspired by the Cal Neva Lodge & Casino), a once popular but now fading novelty spot situated half in Nevada and half in California, with a line literally running down the centre of the property to delineate the border. To say too much about the plot or characters would be to ruin some of the twists (which is ultimately all the film really has going for it), but the basic set-up is that over the course of one night, seven people will encounter one another but not all seven will leave. There's Fr. Daniel Flynn (Jeff Bridges), a Catholic priest on the way to see his brother; Darlene Sweet (Cynthia Erivo), a singer travelling to a job she doesn't want; Emily (Dakota Johnson), an intensely private woman who wants nothing to do with any of the others; Laramie Seymour Sullivan (Jon Hamm), a slick vacuum cleaner salesman; Rose (Cailee Spaeny), who appears to be Emily's kidnap victim; Billy Lee (Chris Hemsworth), a cult leader obviously based on Charles Manson; and Miles Miller (Lewis Pullman), the motel's receptionist/bellhop/maid/barman/manager. As the night wears on, it becomes apparent that not only are few of these people who they claim to be, but the motel itself is hiding its own dark secrets.\r\n\r\nIf that set-up reminds you a little of James Mangold's _Identity_ (2003), you're not completely off course. _Bad Times_ shares very similar DNA, at least up to the point where _Identity_ goes totally batshit crazy; both are set in an out-of-the-way motel where a group of strangers are trapped overnight, and all, or some of them aren't who they appear, with the audience slowly filled in on their backstories via flashbacks. However, whereas _Identity_ failed because the last half-hour is patently ridiculous, completely undermining the excellent build-up of tension and mystery, _Bad Times_ has the exact opposite problem – the conclusion is decidedly underwhelming, failing to build on an excellent set-up, with the last twenty minutes or so lapsing into utter mundanity, and, most unforgivably for a mystery film, twists for twist's sake. The structure also somewhat recalls _Lost_ (a disparate group of strangers forced together at a mysterious location filled with secrets, whilst a flashback-heavy narrative fills us in on who these people are), and, perhaps more obviously, the high-concept, perspective-shifting, often achronological _Pulp Fiction_ (1994) imitators of the late 90s; films such as John Herzfeld's _2 Days in the Valley_ (1996), Peter O'Fallon's _Suicide Kings_ (1998), and Troy Duffy's _The Boondock Saints_ (1999).\r\n\r\nTo start on a positive note though, _Bad Times_ looks terrific – as you would expect from veteran cinematographer Seamus McGarvey (_The Hours_; _We Need to Talk About Kevin_; _Nocturnal Animals_), the photography is faultless, whilst the production design by Martin Whist (_Down with Love_; _Devil_; _Super 8_) and the art direction by Michael Diner (_Firewall_; _Night at the Museum_; _Redacted_) are superb, with the ultra tacky period detail dripping off the screen. Directorally, Goddard also has his moments with some eye-catching compositions, locked-off cameras, POV shots, and lengthy single-take Steadicam sequences. However, it's in relation to this last point where one of the film's most immediate problems is to be found – the solid directorial work is completely out of step with the vapid writing, as if a screenplay intended for Michael Bay ended up being directed by Michael Mann (although Goddard is certainly no Mann). The barely-there storyline seems to be nothing other than a hangar onto which to drape a tone and style, rather than generating that style.\r\n\r\nPerhaps in relation to this disparity between style and story, the film's second strongest sequence is the opening scene. Shot entirely from a fixed camera position, and looking for all the world like a stage play, the scene is completely wordless, and charts the course of several hours in one of the motel rooms, as a man whose face we never clearly see checks in, moves all of the furniture to one side of the room, pulls up the floorboards, hides a bag under them, places them back, puts all the furniture back, relaxes for a while, and is promptly shot dead. The scene is a masterclass in slow-burning tension – we know something bad is going to happen, but Goddard refuses to pull the trigger prematurely, so when the violence does erupt, it's a pseudo-cathartic moment for the audience (incidentally, the film's best sequence is similarly abstract, slowly plotted, and mostly _sans_ dialogue, but as it involves the discovery of an important and unexpected location within the motel, to say any more would be a spoiler). The problem is that the heavily stylised and brilliantly directed opening is so good, it spoils the audience, establishing a tone to which the rest of the film mostly fails to live up.\r\n\r\nIn direct contrast to the opening, the ending is both narratively and directorally formulaic, predicable, and trite, with the least compelling and well fleshed out character taking centre stage, mano-a-mano good guy/bad guy dialogue aplenty, and even a ludicrous shoot-out. The whole things smacks of \"been there, seen that a million times.\" Additionally, whereas the opening is effortlessly enthralling and distinctive, as the film lumbers on, and Goddard begins to run out of directorial tricks, there are sequences which scream \"look how cool I am.\" For example, Billy Lee whirling toward the camera, eating pie, shirt agape, hair soaking wet, dancing to the sounds of Deep Purple's cover of \"Hush\" (1968) is so desperate to become iconic that it instead comes across as self-parody.\r\n\r\nAnother significant problem is that the characters all feel like generic archetypes ripped out of other films, with none giving the impression of being a real-person, with their own agency and interiority. They are, in essence, walking plot-points. The script is also exceptionally weak in how it handles exposition (of which there is a significant amount). There seems to have been little attempt to organically introduce heavily expositional scenes, or integrate them with the surrounding material. Instead, on several occasions, the plot literally stops whilst characters explain things to one another. A particularly bad example of this is when Flynn and Sweet arrive at the motel reception. Sullivan is already there, and begins to tell them the inner workings of the establishment, having stayed there numerous times in the past. Then Miller turns up, and begins to recite a rehearsed sales pitch. Simply trading exposition from one character to another doesn't mean it's not exposition – the scene is painfully slow, dull, and pointless, telling us precious little that we actually need to know. Indeed the entire issue of the motel being bi-state is strangely pointless. Aside from the novelty value, it is never factored into the narrative, and one wonders why Goddard set the film in such a specific location if he had no plans to use that specificity thematically.\r\n\r\nA final problem which must be discussed is that 141-minute runtime. Padded, and massively self-indulgent, there is enough narrative content to barely fill a 90-minute duration. One of the most egregious missteps in this respect is Goddard's tendency to ponderously play out the same scene from multiple points of view, but in such a way as to give the audience only a smidgeon of additional information, so by the third time we're seeing a scene (which was too long even the first time around), it becomes an endurance test. Also, with this runtime and so little content, needless to say, the bottom falls out of the film entirely during the middle section, as things become unrelentingly slow and contrived. Goddard seems to equate curiosity about who the characters are with filmic suspense, meaning things take a decided turn for the mundane long before the underwhelming _dénouement_. The interesting set-up earns him a fair bit of wiggle room in relation to this, but he abuses it, pushing the audience far beyond the point where they simply give up caring about anything on screen. And when he finally does get around to wrapping things up, the last few twists are nowhere near enough of a reward. Personally, I was left feeling that the mysteries were more rewarding than the explanations.\r\n\r\nPart 1930s-style pulp fiction, part 1940s and 50s-style film noir, and part 1960s-style paranoid thriller, the film flirts with a few themes (redemption, forgiveness, karma, political corruption, the seductive nature of power), but none get off the starting grid, and ultimately, _Bad Times_ isn't really _about_ anything. Hyper self-aware, and attempting to both subvert and celebrate generic conventions, Goddard seems to think he has a bonafide epic on his hands, a portent piece of celluloid mastery which samples the best of hard-boiled crime fiction, and imparts valuable lessons in the process. He doesn't. It's more self-indulgent folly than paean of universal truth. And it's painfully dull.", "created_at": "2019-06-03T21:38:48.523Z"}, {"movie_id": 446021, "review_id": "621a90e592e55b001b6ebc50", "author_rating": 7.0, "review_text": "Although the first half presents a smart and mysterious blend of, say, ‘The Hateful Eight’ and ‘Identity’, the plot lacks the puzzle pieces to grow towards a grand solution in it's ending.\r\n\r\n7/10", "created_at": "2022-02-26T20:43:17.352Z"}, {"movie_id": 446021, "review_id": "63bf81e123be460098085ac1", "author_rating": 10.0, "review_text": "Ok, Wow, I don't think I've seen a movie like that since the 90s. Some have gotten close, but this one absolutely stinks of clever 90s independent film...\r\n\r\n...at least in that era where studios were putting serious bank behind indie films in an effort to score awards and produce something new that audiences would eat up.\r\n\r\nThe wow sort of starts with the soundtrack, which is brilliant found music that not only fits the era, but fits the film like a globe.\r\n\r\nThe casting is perfect, with a special shout out to Cynthia Erivo who sold her role as an R&B singer as if, well, she is one, but the delivery was absolutely brilliant on her end, despite the fact that she is one in real life. I guess it's where basically playing yourself pays off in spades.\r\n\r\nShe was brilliant, but then, so was absolutely everyone else.\r\n\r\nAnd this is all put together with a plot that twists and turns and situations that just move from bad to worse in the best possible Hollywood way.\r\n\r\nIt's a movie you have to see.", "created_at": "2023-01-12T03:43:29.689Z"}, {"movie_id": 446021, "review_id": "64e7aa22e894a6011ef7aed7", "author_rating": 8.0, "review_text": "**_Tarantino-esque flick about one rainy night at a dubious motel in Northern California_**\r\n\r\nIn 1969, four strangers spend the night at the El Royale hotel on the border of California & Nevada, near Lake Tahoe. These visitors consist of a priest (Jeff Bridges), a singer (Cynthia Erivo), a vacuum cleaner salesman (Jon Hamm) and an edgy young woman (Dakota Johnson). They’re going to have an unforgettable night. Lewis Pullman plays the meek manager of the motel that used to be a bustling business while Chris Hemsworth and Cailee Spaeny have key roles.\r\n\r\n“Bad Times at the El Royale” (2018) is a crime thriller that takes the milieu of the “Psycho” flicks and combines it with the dialogue-driven style of Tarantino. The later “The Virtuoso” (2021) is comparable, although this is more colorful, not to mention half an hour longer. Not only is it superior to that film, it’s also superior to the movie the writer/director is most known for, “The Cabin in the Woods” (2012).\r\n\r\nTo appreciate “El Royale” you have to be prepared for a flick that has the confidence to take its time as the characters are fleshed out and their secrets revealed. Some don’t like how things pan out in the last act revolving around Hemsworth’s character, but it worked for me and fit the times in which the story is set. Meanwhile Dakota Johnson looks great in jeans.\r\n\r\nFans of “Pulp Fiction,” “Jackie Brown,” “Inglourious Basterds” and “The Hateful Eight” should eat this up.     \r\n\r\nThe film runs 2 hours, 21 minutes, and was shot in areas east of Vancouver, British Columbia, including Pioneer Avenue in Agassiz and Mammoth Studios in Burnaby. Additional bits were done in California.\r\n\r\nGRADE: B+/A-", "created_at": "2023-08-24T19:06:10.549Z"}, {"movie_id": 446021, "review_id": "5c36f3df925141531224dfc0", "author_rating": null, "review_text": "_Bad Times At The El Royale_ was exceptional. Through its preview period, I was hooked from the teaser trailer to the 24th TV Spot released. Drew Goddard knew how to make a wonderous and exciting thriller through its magnificent casting and so much more. All these trailers set high expectations which made me worry a little bit as I don’t like getting myself too excited for movies because sometimes, I get very disappointed. But with this, it exceeded my high expectations. _Bad Times At The El Royale_ just crushed it and it felt riveting the whole time which is something that is hard to find in films nowadays.\r\n\r\nThe casting was incredibly on point for this with Dakota Johnson, Jeff Bridges, Jon Hamm, Lewis Pullman, Chris Hemsworth, Cailee Spaeny and Cynthia Erivo delivering Oscar-worthy performances. Both Lewis Pullman and Cailee Spaeny deserve a lot of recognition. They just both developed so well throughout and it just astounded me at the level that they could deliver. The best thing about all these wonderful and exciting characters were the connections they all had with each other whether it be a love/hate relationship. To avoid spoilers, I will not highlight who my favourite connection was but _Bad Times At The El Royale_ knew how to deliver excellent performances and wonderful connections.\r\n\r\nThe story was captivating in itself but what really accompanied this well-made film was its soundtrack which really packed quite a punch. Songs like This Old Heart Of Mine by The Isley Brothers, which was featured in the trailer and sung incredibly well by Cynthia Erivo, and Can’t Take My Eyes Off You by Frankie Valli just fit in the most perfect ways. Movies like _Baby Driver_ and _Shaun Of The Dead_, both coincidentally directed by Edgar Wright, wouldn’t have been what it was without its soundtrack, and it’s unfortunate to say that _Bad Times At The El Royale_ would have suffered a bit without the ‘60s music. \r\n\r\nFortunately, nothing disappointed me at all with this movie because the height of intensity was just there without doing to much to establish it. Jon Hamm was most of the reason, along with Chris Hemsworth, that really helped make this such a great film. Drew Goddard produced beautiful camerawork and outstanding set design. It is truly one of the most brilliant films ever created and I’ve only ever been astounded this much by _Searching_ as I kept feeling like I didn’t know what was going to happen. And honestly, I didn’t. But the big thing that would keep certain audiences away is the level of gore that I’ve only ever seen in Tarantino films and _Brawl In Cell Block 99_. _Bad Times At The El Royale_ is a lot like Tarantino’s _The Hateful Eight_ but it was done 10x better. Everything just seemed to click with me throughout the long runtime and I’m glad I didn’t give this a miss.\r\n\r\n_Bad Times At The El Royale_ is wonderful with unpredictable plot twists, exceptional casting and chemistry, a smartly written script and high intensity levels. I expect to see a lot of Oscar nominations for this movie as it deserves a lot of recognition whether it be surprising performances from the likes of Dakota Johnson and Lewis Pullman or fantastic costumes and design. _Bad Times At The El Royale_ just clicked with me 100% and could not lose my attention from the second I saw Nick Offerman walk into his hotel room. I paid attention to every second and enjoyed it so _Bad Times At The El Royale_ deserves a thrilling 10/10.", "created_at": "2019-01-10T07:27:27.649Z"}, {"movie_id": 446021, "review_id": "5c440a76c3a3681a0c23dffc", "author_rating": 8.0, "review_text": "More often than not, the fragmented, time-jump-y form of storytelling (a la Tarantino) doesn't do it for me. But _Bad Times at the El Royale_ nails the format, and just about everything else while it's at it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-01-20T05:43:18.711Z"}, {"movie_id": 446021, "review_id": "5cf59368c3a3685c0823747f", "author_rating": 5.0, "review_text": "**_Derivative, predictable, and dull_**\r\n\r\n> _There is something about hotels that I find very romantic. You get to try on a different life in a hotel. You're usually in a new place when you're staying in a hotel. There's something about the experience that allows you to be a different person. You can think to yourself: \"Oh, this is what it would look if I were in Paris. This is what it would look like if I were in New York.\" There's something about it that transports you somewhere and that, I suppose, has always been good for creativity and imagination. I love the entire spectrum of hotels, b__ecause for a creative person, it's about trying on a new life. For the El Royale, I liked this idea of a hotel that had a shadier side to it._\r\n\r\n- Drew Goddard; \"Exclusive _Bad Times At The El Royale_ Interview With Drew Goddard\" (Simon Gallagher); _WhatCulture_ (October 9, 2018)\r\n\r\nFollowing the genre-bending, utterly insane, and extremely funny _The Cabin in the Woods_ (2011), _Bad Times at the El Royale_ is the second feature from writer/director Drew Goddard, who has also accrued writing credits for Matt Reeves's _Cloverfield_ (2008), Marc Foster's _World War Z_ (2013), and Ridley Scott's _The Martian_ (2015), as well as TV shows such as _Buffy the Vampire Slayer_ (1996-2003), _Angel_ (1999-2004), _Alias_ (2001-2006), and _Lost_ (2004-2010). In short, he has an impressive résumé. As it stands in relation to _Cabin_, _Bad Times_ is a similarly stylised cine-literate genre mash-up. However, whereas in _Cabin_, the twist upon twist upon twist had a cumulative effect, with the story getting better the longer it went on and the weirder things got, in _Bad Times_ it's a case of ever diminishing returns. By the time we reach the end of the lengthy 141-minute runtime (more on that later), with everything and everyone shoehorned into neatly explained niches, the film has been shorn of its vitality, leaving one with an overriding impression of \"meh\". If _Cabin_ was a genuinely new spin on a clichéd old story, playing with and subverting genre at every turn, _Bad Times_ is singularly unable to free itself from the most oppressively derivative of its generic constraints.\r\n\r\nSet in 1969, the film takes place almost entirely in the titular El Royale Hotel (actually a motel, and obviously inspired by the Cal Neva Lodge & Casino), a once popular but now fading novelty spot situated half in Nevada and half in California, with a line literally running down the centre of the property to delineate the border. To say too much about the plot or characters would be to ruin some of the twists (which is ultimately all the film really has going for it), but the basic set-up is that over the course of one night, seven people will encounter one another but not all seven will leave. There's Fr. Daniel Flynn (Jeff Bridges), a Catholic priest on the way to see his brother; Darlene Sweet (Cynthia Erivo), a singer travelling to a job she doesn't want; Emily (Dakota Johnson), an intensely private woman who wants nothing to do with any of the others; Laramie Seymour Sullivan (Jon Hamm), a slick vacuum cleaner salesman; Rose (Cailee Spaeny), who appears to be Emily's kidnap victim; Billy Lee (Chris Hemsworth), a cult leader obviously based on Charles Manson; and Miles Miller (Lewis Pullman), the motel's receptionist/bellhop/maid/barman/manager. As the night wears on, it becomes apparent that not only are few of these people who they claim to be, but the motel itself is hiding its own dark secrets.\r\n\r\nIf that set-up reminds you a little of James Mangold's _Identity_ (2003), you're not completely off course. _Bad Times_ shares very similar DNA, at least up to the point where _Identity_ goes totally batshit crazy; both are set in an out-of-the-way motel where a group of strangers are trapped overnight, and all, or some of them aren't who they appear, with the audience slowly filled in on their backstories via flashbacks. However, whereas _Identity_ failed because the last half-hour is patently ridiculous, completely undermining the excellent build-up of tension and mystery, _Bad Times_ has the exact opposite problem – the conclusion is decidedly underwhelming, failing to build on an excellent set-up, with the last twenty minutes or so lapsing into utter mundanity, and, most unforgivably for a mystery film, twists for twist's sake. The structure also somewhat recalls _Lost_ (a disparate group of strangers forced together at a mysterious location filled with secrets, whilst a flashback-heavy narrative fills us in on who these people are), and, perhaps more obviously, the high-concept, perspective-shifting, often achronological _Pulp Fiction_ (1994) imitators of the late 90s; films such as John Herzfeld's _2 Days in the Valley_ (1996), Peter O'Fallon's _Suicide Kings_ (1998), and Troy Duffy's _The Boondock Saints_ (1999).\r\n\r\nTo start on a positive note though, _Bad Times_ looks terrific – as you would expect from veteran cinematographer Seamus McGarvey (_The Hours_; _We Need to Talk About Kevin_; _Nocturnal Animals_), the photography is faultless, whilst the production design by Martin Whist (_Down with Love_; _Devil_; _Super 8_) and the art direction by Michael Diner (_Firewall_; _Night at the Museum_; _Redacted_) are superb, with the ultra tacky period detail dripping off the screen. Directorally, Goddard also has his moments with some eye-catching compositions, locked-off cameras, POV shots, and lengthy single-take Steadicam sequences. However, it's in relation to this last point where one of the film's most immediate problems is to be found – the solid directorial work is completely out of step with the vapid writing, as if a screenplay intended for Michael Bay ended up being directed by Michael Mann (although Goddard is certainly no Mann). The barely-there storyline seems to be nothing other than a hangar onto which to drape a tone and style, rather than generating that style.\r\n\r\nPerhaps in relation to this disparity between style and story, the film's second strongest sequence is the opening scene. Shot entirely from a fixed camera position, and looking for all the world like a stage play, the scene is completely wordless, and charts the course of several hours in one of the motel rooms, as a man whose face we never clearly see checks in, moves all of the furniture to one side of the room, pulls up the floorboards, hides a bag under them, places them back, puts all the furniture back, relaxes for a while, and is promptly shot dead. The scene is a masterclass in slow-burning tension – we know something bad is going to happen, but Goddard refuses to pull the trigger prematurely, so when the violence does erupt, it's a pseudo-cathartic moment for the audience (incidentally, the film's best sequence is similarly abstract, slowly plotted, and mostly _sans_ dialogue, but as it involves the discovery of an important and unexpected location within the motel, to say any more would be a spoiler). The problem is that the heavily stylised and brilliantly directed opening is so good, it spoils the audience, establishing a tone to which the rest of the film mostly fails to live up.\r\n\r\nIn direct contrast to the opening, the ending is both narratively and directorally formulaic, predicable, and trite, with the least compelling and well fleshed out character taking centre stage, mano-a-mano good guy/bad guy dialogue aplenty, and even a ludicrous shoot-out. The whole things smacks of \"been there, seen that a million times.\" Additionally, whereas the opening is effortlessly enthralling and distinctive, as the film lumbers on, and Goddard begins to run out of directorial tricks, there are sequences which scream \"look how cool I am.\" For example, Billy Lee whirling toward the camera, eating pie, shirt agape, hair soaking wet, dancing to the sounds of Deep Purple's cover of \"Hush\" (1968) is so desperate to become iconic that it instead comes across as self-parody.\r\n\r\nAnother significant problem is that the characters all feel like generic archetypes ripped out of other films, with none giving the impression of being a real-person, with their own agency and interiority. They are, in essence, walking plot-points. The script is also exceptionally weak in how it handles exposition (of which there is a significant amount). There seems to have been little attempt to organically introduce heavily expositional scenes, or integrate them with the surrounding material. Instead, on several occasions, the plot literally stops whilst characters explain things to one another. A particularly bad example of this is when Flynn and Sweet arrive at the motel reception. Sullivan is already there, and begins to tell them the inner workings of the establishment, having stayed there numerous times in the past. Then Miller turns up, and begins to recite a rehearsed sales pitch. Simply trading exposition from one character to another doesn't mean it's not exposition – the scene is painfully slow, dull, and pointless, telling us precious little that we actually need to know. Indeed the entire issue of the motel being bi-state is strangely pointless. Aside from the novelty value, it is never factored into the narrative, and one wonders why Goddard set the film in such a specific location if he had no plans to use that specificity thematically.\r\n\r\nA final problem which must be discussed is that 141-minute runtime. Padded, and massively self-indulgent, there is enough narrative content to barely fill a 90-minute duration. One of the most egregious missteps in this respect is Goddard's tendency to ponderously play out the same scene from multiple points of view, but in such a way as to give the audience only a smidgeon of additional information, so by the third time we're seeing a scene (which was too long even the first time around), it becomes an endurance test. Also, with this runtime and so little content, needless to say, the bottom falls out of the film entirely during the middle section, as things become unrelentingly slow and contrived. Goddard seems to equate curiosity about who the characters are with filmic suspense, meaning things take a decided turn for the mundane long before the underwhelming _dénouement_. The interesting set-up earns him a fair bit of wiggle room in relation to this, but he abuses it, pushing the audience far beyond the point where they simply give up caring about anything on screen. And when he finally does get around to wrapping things up, the last few twists are nowhere near enough of a reward. Personally, I was left feeling that the mysteries were more rewarding than the explanations.\r\n\r\nPart 1930s-style pulp fiction, part 1940s and 50s-style film noir, and part 1960s-style paranoid thriller, the film flirts with a few themes (redemption, forgiveness, karma, political corruption, the seductive nature of power), but none get off the starting grid, and ultimately, _Bad Times_ isn't really _about_ anything. Hyper self-aware, and attempting to both subvert and celebrate generic conventions, Goddard seems to think he has a bonafide epic on his hands, a portent piece of celluloid mastery which samples the best of hard-boiled crime fiction, and imparts valuable lessons in the process. He doesn't. It's more self-indulgent folly than paean of universal truth. And it's painfully dull.", "created_at": "2019-06-03T21:38:48.523Z"}, {"movie_id": 446021, "review_id": "621a90e592e55b001b6ebc50", "author_rating": 7.0, "review_text": "Although the first half presents a smart and mysterious blend of, say, ‘The Hateful Eight’ and ‘Identity’, the plot lacks the puzzle pieces to grow towards a grand solution in it's ending.\r\n\r\n7/10", "created_at": "2022-02-26T20:43:17.352Z"}, {"movie_id": 446021, "review_id": "63bf81e123be460098085ac1", "author_rating": 10.0, "review_text": "Ok, Wow, I don't think I've seen a movie like that since the 90s. Some have gotten close, but this one absolutely stinks of clever 90s independent film...\r\n\r\n...at least in that era where studios were putting serious bank behind indie films in an effort to score awards and produce something new that audiences would eat up.\r\n\r\nThe wow sort of starts with the soundtrack, which is brilliant found music that not only fits the era, but fits the film like a globe.\r\n\r\nThe casting is perfect, with a special shout out to Cynthia Erivo who sold her role as an R&B singer as if, well, she is one, but the delivery was absolutely brilliant on her end, despite the fact that she is one in real life. I guess it's where basically playing yourself pays off in spades.\r\n\r\nShe was brilliant, but then, so was absolutely everyone else.\r\n\r\nAnd this is all put together with a plot that twists and turns and situations that just move from bad to worse in the best possible Hollywood way.\r\n\r\nIt's a movie you have to see.", "created_at": "2023-01-12T03:43:29.689Z"}, {"movie_id": 446021, "review_id": "64e7aa22e894a6011ef7aed7", "author_rating": 8.0, "review_text": "**_Tarantino-esque flick about one rainy night at a dubious motel in Northern California_**\r\n\r\nIn 1969, four strangers spend the night at the El Royale hotel on the border of California & Nevada, near Lake Tahoe. These visitors consist of a priest (Jeff Bridges), a singer (Cynthia Erivo), a vacuum cleaner salesman (Jon Hamm) and an edgy young woman (Dakota Johnson). They’re going to have an unforgettable night. Lewis Pullman plays the meek manager of the motel that used to be a bustling business while Chris Hemsworth and Cailee Spaeny have key roles.\r\n\r\n“Bad Times at the El Royale” (2018) is a crime thriller that takes the milieu of the “Psycho” flicks and combines it with the dialogue-driven style of Tarantino. The later “The Virtuoso” (2021) is comparable, although this is more colorful, not to mention half an hour longer. Not only is it superior to that film, it’s also superior to the movie the writer/director is most known for, “The Cabin in the Woods” (2012).\r\n\r\nTo appreciate “El Royale” you have to be prepared for a flick that has the confidence to take its time as the characters are fleshed out and their secrets revealed. Some don’t like how things pan out in the last act revolving around Hemsworth’s character, but it worked for me and fit the times in which the story is set. Meanwhile Dakota Johnson looks great in jeans.\r\n\r\nFans of “Pulp Fiction,” “Jackie Brown,” “Inglourious Basterds” and “The Hateful Eight” should eat this up.     \r\n\r\nThe film runs 2 hours, 21 minutes, and was shot in areas east of Vancouver, British Columbia, including Pioneer Avenue in Agassiz and Mammoth Studios in Burnaby. Additional bits were done in California.\r\n\r\nGRADE: B+/A-", "created_at": "2023-08-24T19:06:10.549Z"}, {"movie_id": 446021, "review_id": "5c36f3df925141531224dfc0", "author_rating": null, "review_text": "_Bad Times At The El Royale_ was exceptional. Through its preview period, I was hooked from the teaser trailer to the 24th TV Spot released. Drew Goddard knew how to make a wonderous and exciting thriller through its magnificent casting and so much more. All these trailers set high expectations which made me worry a little bit as I don’t like getting myself too excited for movies because sometimes, I get very disappointed. But with this, it exceeded my high expectations. _Bad Times At The El Royale_ just crushed it and it felt riveting the whole time which is something that is hard to find in films nowadays.\r\n\r\nThe casting was incredibly on point for this with Dakota Johnson, Jeff Bridges, Jon Hamm, Lewis Pullman, Chris Hemsworth, Cailee Spaeny and Cynthia Erivo delivering Oscar-worthy performances. Both Lewis Pullman and Cailee Spaeny deserve a lot of recognition. They just both developed so well throughout and it just astounded me at the level that they could deliver. The best thing about all these wonderful and exciting characters were the connections they all had with each other whether it be a love/hate relationship. To avoid spoilers, I will not highlight who my favourite connection was but _Bad Times At The El Royale_ knew how to deliver excellent performances and wonderful connections.\r\n\r\nThe story was captivating in itself but what really accompanied this well-made film was its soundtrack which really packed quite a punch. Songs like This Old Heart Of Mine by The Isley Brothers, which was featured in the trailer and sung incredibly well by Cynthia Erivo, and Can’t Take My Eyes Off You by Frankie Valli just fit in the most perfect ways. Movies like _Baby Driver_ and _Shaun Of The Dead_, both coincidentally directed by Edgar Wright, wouldn’t have been what it was without its soundtrack, and it’s unfortunate to say that _Bad Times At The El Royale_ would have suffered a bit without the ‘60s music. \r\n\r\nFortunately, nothing disappointed me at all with this movie because the height of intensity was just there without doing to much to establish it. Jon Hamm was most of the reason, along with Chris Hemsworth, that really helped make this such a great film. Drew Goddard produced beautiful camerawork and outstanding set design. It is truly one of the most brilliant films ever created and I’ve only ever been astounded this much by _Searching_ as I kept feeling like I didn’t know what was going to happen. And honestly, I didn’t. But the big thing that would keep certain audiences away is the level of gore that I’ve only ever seen in Tarantino films and _Brawl In Cell Block 99_. _Bad Times At The El Royale_ is a lot like Tarantino’s _The Hateful Eight_ but it was done 10x better. Everything just seemed to click with me throughout the long runtime and I’m glad I didn’t give this a miss.\r\n\r\n_Bad Times At The El Royale_ is wonderful with unpredictable plot twists, exceptional casting and chemistry, a smartly written script and high intensity levels. I expect to see a lot of Oscar nominations for this movie as it deserves a lot of recognition whether it be surprising performances from the likes of Dakota Johnson and Lewis Pullman or fantastic costumes and design. _Bad Times At The El Royale_ just clicked with me 100% and could not lose my attention from the second I saw Nick Offerman walk into his hotel room. I paid attention to every second and enjoyed it so _Bad Times At The El Royale_ deserves a thrilling 10/10.", "created_at": "2019-01-10T07:27:27.649Z"}, {"movie_id": 446021, "review_id": "5c440a76c3a3681a0c23dffc", "author_rating": 8.0, "review_text": "More often than not, the fragmented, time-jump-y form of storytelling (a la Tarantino) doesn't do it for me. But _Bad Times at the El Royale_ nails the format, and just about everything else while it's at it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-01-20T05:43:18.711Z"}, {"movie_id": 446021, "review_id": "5cf59368c3a3685c0823747f", "author_rating": 5.0, "review_text": "**_Derivative, predictable, and dull_**\r\n\r\n> _There is something about hotels that I find very romantic. You get to try on a different life in a hotel. You're usually in a new place when you're staying in a hotel. There's something about the experience that allows you to be a different person. You can think to yourself: \"Oh, this is what it would look if I were in Paris. This is what it would look like if I were in New York.\" There's something about it that transports you somewhere and that, I suppose, has always been good for creativity and imagination. I love the entire spectrum of hotels, b__ecause for a creative person, it's about trying on a new life. For the El Royale, I liked this idea of a hotel that had a shadier side to it._\r\n\r\n- Drew Goddard; \"Exclusive _Bad Times At The El Royale_ Interview With Drew Goddard\" (Simon Gallagher); _WhatCulture_ (October 9, 2018)\r\n\r\nFollowing the genre-bending, utterly insane, and extremely funny _The Cabin in the Woods_ (2011), _Bad Times at the El Royale_ is the second feature from writer/director Drew Goddard, who has also accrued writing credits for Matt Reeves's _Cloverfield_ (2008), Marc Foster's _World War Z_ (2013), and Ridley Scott's _The Martian_ (2015), as well as TV shows such as _Buffy the Vampire Slayer_ (1996-2003), _Angel_ (1999-2004), _Alias_ (2001-2006), and _Lost_ (2004-2010). In short, he has an impressive résumé. As it stands in relation to _Cabin_, _Bad Times_ is a similarly stylised cine-literate genre mash-up. However, whereas in _Cabin_, the twist upon twist upon twist had a cumulative effect, with the story getting better the longer it went on and the weirder things got, in _Bad Times_ it's a case of ever diminishing returns. By the time we reach the end of the lengthy 141-minute runtime (more on that later), with everything and everyone shoehorned into neatly explained niches, the film has been shorn of its vitality, leaving one with an overriding impression of \"meh\". If _Cabin_ was a genuinely new spin on a clichéd old story, playing with and subverting genre at every turn, _Bad Times_ is singularly unable to free itself from the most oppressively derivative of its generic constraints.\r\n\r\nSet in 1969, the film takes place almost entirely in the titular El Royale Hotel (actually a motel, and obviously inspired by the Cal Neva Lodge & Casino), a once popular but now fading novelty spot situated half in Nevada and half in California, with a line literally running down the centre of the property to delineate the border. To say too much about the plot or characters would be to ruin some of the twists (which is ultimately all the film really has going for it), but the basic set-up is that over the course of one night, seven people will encounter one another but not all seven will leave. There's Fr. Daniel Flynn (Jeff Bridges), a Catholic priest on the way to see his brother; Darlene Sweet (Cynthia Erivo), a singer travelling to a job she doesn't want; Emily (Dakota Johnson), an intensely private woman who wants nothing to do with any of the others; Laramie Seymour Sullivan (Jon Hamm), a slick vacuum cleaner salesman; Rose (Cailee Spaeny), who appears to be Emily's kidnap victim; Billy Lee (Chris Hemsworth), a cult leader obviously based on Charles Manson; and Miles Miller (Lewis Pullman), the motel's receptionist/bellhop/maid/barman/manager. As the night wears on, it becomes apparent that not only are few of these people who they claim to be, but the motel itself is hiding its own dark secrets.\r\n\r\nIf that set-up reminds you a little of James Mangold's _Identity_ (2003), you're not completely off course. _Bad Times_ shares very similar DNA, at least up to the point where _Identity_ goes totally batshit crazy; both are set in an out-of-the-way motel where a group of strangers are trapped overnight, and all, or some of them aren't who they appear, with the audience slowly filled in on their backstories via flashbacks. However, whereas _Identity_ failed because the last half-hour is patently ridiculous, completely undermining the excellent build-up of tension and mystery, _Bad Times_ has the exact opposite problem – the conclusion is decidedly underwhelming, failing to build on an excellent set-up, with the last twenty minutes or so lapsing into utter mundanity, and, most unforgivably for a mystery film, twists for twist's sake. The structure also somewhat recalls _Lost_ (a disparate group of strangers forced together at a mysterious location filled with secrets, whilst a flashback-heavy narrative fills us in on who these people are), and, perhaps more obviously, the high-concept, perspective-shifting, often achronological _Pulp Fiction_ (1994) imitators of the late 90s; films such as John Herzfeld's _2 Days in the Valley_ (1996), Peter O'Fallon's _Suicide Kings_ (1998), and Troy Duffy's _The Boondock Saints_ (1999).\r\n\r\nTo start on a positive note though, _Bad Times_ looks terrific – as you would expect from veteran cinematographer Seamus McGarvey (_The Hours_; _We Need to Talk About Kevin_; _Nocturnal Animals_), the photography is faultless, whilst the production design by Martin Whist (_Down with Love_; _Devil_; _Super 8_) and the art direction by Michael Diner (_Firewall_; _Night at the Museum_; _Redacted_) are superb, with the ultra tacky period detail dripping off the screen. Directorally, Goddard also has his moments with some eye-catching compositions, locked-off cameras, POV shots, and lengthy single-take Steadicam sequences. However, it's in relation to this last point where one of the film's most immediate problems is to be found – the solid directorial work is completely out of step with the vapid writing, as if a screenplay intended for Michael Bay ended up being directed by Michael Mann (although Goddard is certainly no Mann). The barely-there storyline seems to be nothing other than a hangar onto which to drape a tone and style, rather than generating that style.\r\n\r\nPerhaps in relation to this disparity between style and story, the film's second strongest sequence is the opening scene. Shot entirely from a fixed camera position, and looking for all the world like a stage play, the scene is completely wordless, and charts the course of several hours in one of the motel rooms, as a man whose face we never clearly see checks in, moves all of the furniture to one side of the room, pulls up the floorboards, hides a bag under them, places them back, puts all the furniture back, relaxes for a while, and is promptly shot dead. The scene is a masterclass in slow-burning tension – we know something bad is going to happen, but Goddard refuses to pull the trigger prematurely, so when the violence does erupt, it's a pseudo-cathartic moment for the audience (incidentally, the film's best sequence is similarly abstract, slowly plotted, and mostly _sans_ dialogue, but as it involves the discovery of an important and unexpected location within the motel, to say any more would be a spoiler). The problem is that the heavily stylised and brilliantly directed opening is so good, it spoils the audience, establishing a tone to which the rest of the film mostly fails to live up.\r\n\r\nIn direct contrast to the opening, the ending is both narratively and directorally formulaic, predicable, and trite, with the least compelling and well fleshed out character taking centre stage, mano-a-mano good guy/bad guy dialogue aplenty, and even a ludicrous shoot-out. The whole things smacks of \"been there, seen that a million times.\" Additionally, whereas the opening is effortlessly enthralling and distinctive, as the film lumbers on, and Goddard begins to run out of directorial tricks, there are sequences which scream \"look how cool I am.\" For example, Billy Lee whirling toward the camera, eating pie, shirt agape, hair soaking wet, dancing to the sounds of Deep Purple's cover of \"Hush\" (1968) is so desperate to become iconic that it instead comes across as self-parody.\r\n\r\nAnother significant problem is that the characters all feel like generic archetypes ripped out of other films, with none giving the impression of being a real-person, with their own agency and interiority. They are, in essence, walking plot-points. The script is also exceptionally weak in how it handles exposition (of which there is a significant amount). There seems to have been little attempt to organically introduce heavily expositional scenes, or integrate them with the surrounding material. Instead, on several occasions, the plot literally stops whilst characters explain things to one another. A particularly bad example of this is when Flynn and Sweet arrive at the motel reception. Sullivan is already there, and begins to tell them the inner workings of the establishment, having stayed there numerous times in the past. Then Miller turns up, and begins to recite a rehearsed sales pitch. Simply trading exposition from one character to another doesn't mean it's not exposition – the scene is painfully slow, dull, and pointless, telling us precious little that we actually need to know. Indeed the entire issue of the motel being bi-state is strangely pointless. Aside from the novelty value, it is never factored into the narrative, and one wonders why Goddard set the film in such a specific location if he had no plans to use that specificity thematically.\r\n\r\nA final problem which must be discussed is that 141-minute runtime. Padded, and massively self-indulgent, there is enough narrative content to barely fill a 90-minute duration. One of the most egregious missteps in this respect is Goddard's tendency to ponderously play out the same scene from multiple points of view, but in such a way as to give the audience only a smidgeon of additional information, so by the third time we're seeing a scene (which was too long even the first time around), it becomes an endurance test. Also, with this runtime and so little content, needless to say, the bottom falls out of the film entirely during the middle section, as things become unrelentingly slow and contrived. Goddard seems to equate curiosity about who the characters are with filmic suspense, meaning things take a decided turn for the mundane long before the underwhelming _dénouement_. The interesting set-up earns him a fair bit of wiggle room in relation to this, but he abuses it, pushing the audience far beyond the point where they simply give up caring about anything on screen. And when he finally does get around to wrapping things up, the last few twists are nowhere near enough of a reward. Personally, I was left feeling that the mysteries were more rewarding than the explanations.\r\n\r\nPart 1930s-style pulp fiction, part 1940s and 50s-style film noir, and part 1960s-style paranoid thriller, the film flirts with a few themes (redemption, forgiveness, karma, political corruption, the seductive nature of power), but none get off the starting grid, and ultimately, _Bad Times_ isn't really _about_ anything. Hyper self-aware, and attempting to both subvert and celebrate generic conventions, Goddard seems to think he has a bonafide epic on his hands, a portent piece of celluloid mastery which samples the best of hard-boiled crime fiction, and imparts valuable lessons in the process. He doesn't. It's more self-indulgent folly than paean of universal truth. And it's painfully dull.", "created_at": "2019-06-03T21:38:48.523Z"}, {"movie_id": 446021, "review_id": "621a90e592e55b001b6ebc50", "author_rating": 7.0, "review_text": "Although the first half presents a smart and mysterious blend of, say, ‘The Hateful Eight’ and ‘Identity’, the plot lacks the puzzle pieces to grow towards a grand solution in it's ending.\r\n\r\n7/10", "created_at": "2022-02-26T20:43:17.352Z"}, {"movie_id": 446021, "review_id": "63bf81e123be460098085ac1", "author_rating": 10.0, "review_text": "Ok, Wow, I don't think I've seen a movie like that since the 90s. Some have gotten close, but this one absolutely stinks of clever 90s independent film...\r\n\r\n...at least in that era where studios were putting serious bank behind indie films in an effort to score awards and produce something new that audiences would eat up.\r\n\r\nThe wow sort of starts with the soundtrack, which is brilliant found music that not only fits the era, but fits the film like a globe.\r\n\r\nThe casting is perfect, with a special shout out to Cynthia Erivo who sold her role as an R&B singer as if, well, she is one, but the delivery was absolutely brilliant on her end, despite the fact that she is one in real life. I guess it's where basically playing yourself pays off in spades.\r\n\r\nShe was brilliant, but then, so was absolutely everyone else.\r\n\r\nAnd this is all put together with a plot that twists and turns and situations that just move from bad to worse in the best possible Hollywood way.\r\n\r\nIt's a movie you have to see.", "created_at": "2023-01-12T03:43:29.689Z"}, {"movie_id": 446021, "review_id": "64e7aa22e894a6011ef7aed7", "author_rating": 8.0, "review_text": "**_Tarantino-esque flick about one rainy night at a dubious motel in Northern California_**\r\n\r\nIn 1969, four strangers spend the night at the El Royale hotel on the border of California & Nevada, near Lake Tahoe. These visitors consist of a priest (Jeff Bridges), a singer (Cynthia Erivo), a vacuum cleaner salesman (Jon Hamm) and an edgy young woman (Dakota Johnson). They’re going to have an unforgettable night. Lewis Pullman plays the meek manager of the motel that used to be a bustling business while Chris Hemsworth and Cailee Spaeny have key roles.\r\n\r\n“Bad Times at the El Royale” (2018) is a crime thriller that takes the milieu of the “Psycho” flicks and combines it with the dialogue-driven style of Tarantino. The later “The Virtuoso” (2021) is comparable, although this is more colorful, not to mention half an hour longer. Not only is it superior to that film, it’s also superior to the movie the writer/director is most known for, “The Cabin in the Woods” (2012).\r\n\r\nTo appreciate “El Royale” you have to be prepared for a flick that has the confidence to take its time as the characters are fleshed out and their secrets revealed. Some don’t like how things pan out in the last act revolving around Hemsworth’s character, but it worked for me and fit the times in which the story is set. Meanwhile Dakota Johnson looks great in jeans.\r\n\r\nFans of “Pulp Fiction,” “Jackie Brown,” “Inglourious Basterds” and “The Hateful Eight” should eat this up.     \r\n\r\nThe film runs 2 hours, 21 minutes, and was shot in areas east of Vancouver, British Columbia, including Pioneer Avenue in Agassiz and Mammoth Studios in Burnaby. Additional bits were done in California.\r\n\r\nGRADE: B+/A-", "created_at": "2023-08-24T19:06:10.549Z"}]