[{"movie_id": 6977, "review_id": "59eb68379251415a600124b4", "author_rating": 10.0, "review_text": "No Country for Old Men (2007)\r\nAnother great one from the Coen Brothers\r\n27 January 2009 - 3 out of 3 users found this review helpful.\r\nINSTANT CLASSIC.: YES, this film is as good as the critics say. YES, the performances are as good as the Academy says. NO COUNTRY FOR OLD MEN is one of my favorite films and I have watched it many, many times. Javier Bardem, makes an excellent screen villain, this guy is really scary, you would not want him chasing you. Josh Brolin, and Tommy Lee Jones turn in Solid Performances, and Woody Harrelson also. I'm saving my praise for KELLY MACDONALD, one of my favorite actors. KELLY nails that southern accent. which is always surprising because her speaking voice is so Scottish, she does not have a lot of screen time but when she is on screen, you will know, you are watching a great performance. I absolutely give NO COUNTRY FOR OLD MEN <> Ten Stars 10**********", "created_at": "2017-10-21T15:31:03.179Z"}, {"movie_id": 6977, "review_id": "5d7c6ed0069f0e73f13220af", "author_rating": 9.0, "review_text": "I literally liked the Movie. Its story is outstanding and innovative. However, I wish the ending was more of action scenes than dialogues. \r\nNot to forget that Javier Barden's acting is breathtaking and marvelous. His smile 4:49 is petrifying!", "created_at": "2019-09-14T04:38:40.349Z"}, {"movie_id": 6977, "review_id": "5ea420345a4690001f108819", "author_rating": 9.0, "review_text": "I always figured when I got older, God would sorta come inta my life somehow. And he didn't. I don't blame him. If I was him I would have the same opinion of me that he does. \r\n\r\nNo Country for Old Men is directed by Joel Coen and Ethan Coen, and the Coen's adapt the screenplay from Cormac McCarthy's novel of the same name. It stars Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harelson, Javier Bardem and Kelly Macdonald. Music is by Carter Burwell and cinematography by Roger Deakins.  \r\n\r\nWhen a hunter stumbles upon the bloody aftermath of a drug deal gone wrong, he decides to make off with cash left at the scene, that violence and life threat will follow from here on in...\r\n\r\nNot quite the genius masterpiece some would have you believe, this is however and decidedly dark, sombre, gothic type thriller with noir shadings. The ultimate message slowly pulsing away is one of how making a fateful decision can shape the course of many people's lives, with fate ready at various junctures to trip you up. \r\n\r\nThe Coen's and McCarthy are not in it to offer hope for a better world, this really is a life stinks and is evil narrative, none more so than portrayed by Bardem's chilling psycopath. The unpredictable nature of the story keeps things on the high heat, even as Deakins brings beauty via his colour photography, his teaming with the Coen's brings visual smarts.\r\n\r\nThe screenplay is tightly formed, giving the actors something great to work with, and as they respond in kind, while we the audience are drawn in close to the slow burning madness. It definitely finds the brothers Coen returning to their best, as they take McCarthy's melancholic machismo and drip their self aware irony over proceedings. \r\n\r\nThe finale lacks a punch, and in fact it's a little boorish, while this narrative has been done well before in film noirs of the original wave - so it's not as fresh and exciting to us more mature film lovers. Yet it's still a great piece of film making, the like we could do with more regularly. 9/10 \r\n\r\n\r\n\r\n\r\n\r\n, gorgeously photographed by longtime Coen associate Roger Deakins, and genuinely smart, but its insights boil down to \"Whichever way you turn, fate sticks out a foot to trip you,\" and DETOUR (1945) got there first.", "created_at": "2020-04-25T11:34:12.542Z"}, {"movie_id": 6977, "review_id": "5f706855e4b5760039e7221e", "author_rating": 6.0, "review_text": "I watched this for the first time with a few friends as part of an ongoing movie night we shared. I think it was the most violent film we watched together. The plot is taut and somewhat riveting, with great dialogue and acting.  At the same time, for me, it seemed rather bleak. I gradually had the sense it would not end well for nearly anybody. If it weren’t for the Tommy Lee Jones character, I am not sure I would have wanted to stick with it. He provides a sort of balance in the mood of the film. I am not a big fan of movies with super criminals. You know the ones — they seem to always be one step ahead of the hero or the authorities, free to run roughshod until that are defeated at the very end of the movie, if at all. Woody Harrelson delivers another one of his stellar performances. Who knew he would be so good very early on in his career?\r\n\r\nOddly enough, No Country for Old Men caused metaphorical violence to our movie watch group, as there was an exchange that caused us to watch no more films together. Powerful stuff.", "created_at": "2020-09-27T10:24:21.810Z"}, {"movie_id": 6977, "review_id": "62ce16dae62719004f66e097", "author_rating": 7.0, "review_text": "I can't say I view this one positively. I clearly don't get it, which I'm fine with.\r\n\r\nI'm all for films that don't play it so straight that it's predictable, but at the same time I'm rarely a fan of films that are so full of themselves to end in such a derisory way. Listen, that's probably harsh as it is still a good flick no doubt, but <em>'No Country for Old Men'</em> is highly unsatisfactory and highly uninspiring for me.\r\n\r\nI will say that I have no issues with the cast whatsoever, they are all fantastic. Javier Bardem is awesome, easily the star, and Tommy Lee Jones, Josh Brolin and Woody Harrelson are all top value. Kelly Macdonald and Garret Dillahunt are also involved, I like them too. Stephen Root, Mr. 'L for Love' himself, as well. Away from the onscreen bunch, the cinematography is superb.\r\n\r\nIt's the story. I didn't get what I wanted from it, at all. All the ingredients are there for a 10/10 film, that's the level I was expecting it to reach based on the opening half or so. The second half though... super disappointing! So many underwhelming choices. Such a waste of a strong cast... <em>'The Counselor'</em>-esque. Bardem is also in that, sorry my dude!\r\n\r\nThe fact I'm still giving this what I consider to be a positive rating shows how much the conclusion frustrated me. This had top tier written all over it but it somehow messed it up as it went by... and I'm not usually one to dig out a film's ending.\r\n\r\nIn my defence, even some reviews (many, in fact) from people who love the film mention that the ending isn't perfect so I guess it just comes down to how the final moments sit with you. For me, evidently not good!", "created_at": "2022-07-13T00:50:34.535Z"}, {"movie_id": 6977, "review_id": "63001ae4b39e35007f67243f", "author_rating": 7.0, "review_text": "**Enjoyed it. Go watch it. But don't expect a masterpiece.**\r\n\r\nThere is no denying this is a very well-done film with incredible actors and storytelling. Javier Bardem's Anton Chigurh stands out immediately as a new iconic film villain full of foreboding relentless focus and cold uncaring presence. No Country is clearly a product of the Coen Brothers' unique charm and style. It boasts some tense shoot-outs, and the uncompromising pursuit of Josh Brolin's character was fantastic. Unfortunately, it drags along in some places but by design. The ending is probably supposed to be symbolic and clever, but it was sudden and lost on me (a guy that takes pretty much everything at face value). All in all, it's a good movie, but I am at a loss for why it won an Oscar for Best Picture (although I don't think it had much competition from Transformers or Shrek the Third).", "created_at": "2022-08-19T23:21:08.468Z"}, {"movie_id": 6977, "review_id": "6381d504229ae2155c52cdb0", "author_rating": 7.0, "review_text": "Javier Bardem is just great in this! He is \"Anton\", a ruthlessly efficient killer on the hunt for a missing bag of loot that has fallen into the hands of the opportunistic \"Moss\" (Josh Brolin) after a drug deal goes awry. The latter man soon cottons onto the fact that his life is now considerably more at risk and he has to figure just out how to survive long enough to escape and enjoy his cash. \"Moss\" might just have an unlikely and unwitting ally, though, in the form of the pursuing but rather unenthusiastic sheriff \"Bell\" (Tommy Lee Jones) but, well you just wouldn't want to bet against the truly menacing Bardem! It's violent and brutal, sure - but it's also darkly humorous with plenty of pithy banter and quite some degree of characterisation from both Brolin and Bardem as the denouement looms large. That conclusion is as unpredictable as the rest of this quirkily scary and entertaining crime drama that uses an oxygen cylinder with startlingly effective results in this game of lethal Russian Roulette. Nobody is safe, nobody is innocent - and it doesn't matter whose side you are, ostensibly, on either. It's perfectly paced by the Coen brothers, the characters and the story given ample opportunity to develop and to breathe and by the conclusion I was definitely rooting for someone! It has shades of the old wild-west Texan Western genre to it, it reeks of authenticity and is really well worth a watch.", "created_at": "2022-11-26T08:57:40.211Z"}, {"movie_id": 6977, "review_id": "6429a6f19cc67b06055c1816", "author_rating": 2.0, "review_text": "This is a spoiled brat Hollywood formula version of the classic film NIGHTFALL. It is so parallel to Nightfall that there is no doubt that McCarthy wrote it as a brattish rewrite of the classic film.\r\nBy \"brat\" I mean it is contrived to appease the control freak nature of the immature and spoiled American. I doubt this will fare well in the future, and if anything, it will cause a renewed interest in Nightfall, with Aldo Ray and Brian Keith.\r\nLike Nightfall, we have an investigator who feels he is in over his head in a case of money stolen from hoodlums. \r\nLike Nightfall, the hero stumbles across stolen money and is also in over his head.\r\nLike Nightfall, there is a sadist who makes a game out of killing his victims.\r\nLike Nightfall, the sadist has an ally who is repulsed by the sadist, and is killed by the sadist. \r\nThe only difference is that \"No Country\" presents the hoodlums as the \"gods\" that dorks worship so much. \r\nAlso, in total plagiarism of Nightfall, the sadistic killer entices his victims to believe there is a contest, when in reality, the killer is going to decide the fate no matter what. In \"No Country\", it's the toss of a coin, but anyuone who knows sadists knows that it's a rigged contest. \r\n\"No Country For Old Men\" presents the sadist in the usual Hollywood formula of being immortal and godlike. In \"Nightfall\", the sadist is a mortal. \"No Country\" endeavors to contrive every bit of the story to show that if you're sadistic enough, you are immortal, the true Hollywood formula since about 1965. (Godfather and other gangster movies, Leone westerns, almost all horror movies e.g.).\r\nSo, we have a total lack of risk taking in McCarthy writing the total \"safe\" Hollywood story, to join the innumerable other such Hollywood stories that fail to either inspire or instruct, meant only to make the Beavis and Butthead viewers guffaw with delight.", "created_at": "2023-04-02T16:01:53.435Z"}]