[{"movie_id": 284054, "review_id": "5a844e0fc3a36862e100c22f", "author_rating": 7.0, "review_text": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-02-14T14:56:15.274Z"}, {"movie_id": 284054, "review_id": "5a87b8550e0a26535a047632", "author_rating": 1.0, "review_text": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.", "created_at": "2018-02-17T05:06:29.941Z"}, {"movie_id": 284054, "review_id": "5a8894ba0e0a2653db05d34f", "author_rating": 10.0, "review_text": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.", "created_at": "2018-02-17T20:46:50.715Z"}, {"movie_id": 284054, "review_id": "5a8dfdcf0e0a263e6e006d75", "author_rating": null, "review_text": "Really good movie. Good story, lots of fun. This is what DC is missing.", "created_at": "2018-02-21T23:16:31.669Z"}, {"movie_id": 284054, "review_id": "5a93b14b0e0a2616c602de5e", "author_rating": 7.0, "review_text": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.", "created_at": "2018-02-26T07:03:39.064Z"}, {"movie_id": 284054, "review_id": "5ad008f6c3a36842e4004d4d", "author_rating": 9.0, "review_text": "I was really surprised how much I liked this movie.  There was so much going on; immigration concerns; the fight between saving the world and protecting your own country(sound familiar); the fear of an African country’s resources being pillaged; how best to handle the problems black people face worldwide; and many great authentic feeling cultural nods.  All this while not being heavy or preachy.  You can definitely eat popcorn to this.  The villain; Killmonger, is great.  Not great in that he is scary, though he is, but because he is more complex than some shadowy figure you should just trust is a bad guy because of visual effects or dramatic music.  \r\n\r\nThis movie isn’t just explosions and one-liners in an exotic location.  This is a great movie in general.  It’s always interesting.  There are great relationships between all the characters.  Finally; Wakanda is really a place.  It feels alive and lived in; not just impressive buildings used as a backdrop.  They did a wonderful job of worldbuilding; from the rituals, to the clothing, fancy tech, and scenery.  This movie is definitely worth a watch. \r\n\r\n☆☆☆☆-1/2\r\n\r\nI also have to add that; you get to actually see Andy Serkis!  When I saw his name I thought we was going to be some kind of CGI monster.  I’m just happy to see him get actual screen time.", "created_at": "2018-04-13T01:33:42.336Z"}, {"movie_id": 284054, "review_id": "5af0b71092514119a6000099", "author_rating": 7.0, "review_text": "The Black Panther is a fun romp, but it definitely has some issues. First, the good.\r\n\r\nThe action is fun, the emotions hit home, and the story isn't dirt-poor. \r\n\r\nWhile the CGI gets ripped on from time to time, I thought it was solid enough for a Marvel movie. The fight scenes were relatively well-choreographed, as well. The ritual combat scenes were exciting and visually appealing. The fights in Korea were also fun to see, and while I'm not a fan of car chase scenes as a whole, I did enjoy this one. It was reminiscent of a James Bond movie. \r\n\r\nIn fact, that's another appeal, at least to me. The secret technology base and the fun action scenes were a great callback to James Bond-type movies. I do think the movie would have been complemented by giving T'Challa a similar vice as Bond's, although Marvel probably wouldn't veer down that line for the seemingly morally absolute King of Wakanda.\r\n\r\nThe story, well, it's a mixed bag. Everything seemed crammed together with major emotional keys being rushed through or somewhat ignored. The concept is fine though. A long lost relative comes to challenge the new king, wins, and shows his colors, becoming something amoral. The king comes back and takes down the usurper, realizing something about themselves/their kingdom in the process. It's tired, but not so tired it damages the movie. \r\n\r\nThis is where the issues begin to rise, though. The movie is really a movie and a half or two movies crammed into one. Wakanda has a ton of wonderful mythology, but almost none of it is explained. The movie never really explains how the Wakandans used vibranium was used to make themselves wealthy. It touches on it in some exposition, but there was much more that was just glossed over. \r\n\r\nIn addition, W'Kabi became radicalized by Killmonger much too quickly for such a pivotal relationship to flip. Some of the emotional aspects of the movie fell flat because they weren't given enough screen time. \r\n\r\nDespite its flaws, Black Panther is a fun movie that adds to the Marvel Cinematic Universe. It should have been two movies, but I doubt this is the last we'll see of Wakanda.", "created_at": "2018-05-07T20:29:04.388Z"}, {"movie_id": 284054, "review_id": "5b0e0e66c3a368714d000179", "author_rating": 6.0, "review_text": "The character of T'Challa made his debut in Captain America 3: Civil War.\r\n\r\nIn Black Panther, T'Challa returns to his homeland of Wakanda after the death of his father who has been hiding a secret about his brother who lived in the USA. He now inherits the throne after a challenge from a rival.\r\n\r\nWakanda is an african country with wealth, power and immense technology that it hides from the outside world.\r\n\r\nT'Challa's uncle wanted an uprising in the USA. Now his son Killmonger comes to Wakanda and challenges T'Challa for the throne.\r\n\r\nKillmonger wins and leads the struggle for black power.\r\n\r\nBlack Panther is a well made efficient film from Marvel who really have nailed down their formula. The box office avalanche has surprised me. It simply is not that good with a very predictable story.", "created_at": "2018-05-30T02:37:26.128Z"}, {"movie_id": 284054, "review_id": "5b2039f8c3a36814900052f3", "author_rating": 6.0, "review_text": "Overrated due to political correctness; it’s noble and has its points of interest, but it’s also kinda meh\r\n\t\r\nRELEASED IN 2018 and directed by Ryan Coogler, \"Black Panther” details events when T’Challa (Chadwick Boseman) takes over kingship of the hidden African nation Wakanda after his father passes (John Kani). The kingdom is technologically advanced due to its secret resource Vibranium, a priceless, almost magical metal. Unfortunately, T’Challa’s reign is challenged by an angry American former-black ops soldier, Erik “Killmonger” (Michael B. Jordan).\r\n\r\nWith its black director and mostly black cast (with a couple of token white dudes), “Black Panther” was overhyped and overrated upon release. Critics were apparently afraid of being called “racist” by liberal fascists if they dared to be honest and say anything negative (rolling my eyes). The movie’s likable and certainly has its points of interest, but the characters are rather dull, except for Killmonger, and the story isn’t all that involving. It’s basically a mediocre superhero movie that has some blatant Bond-isms and is set apart by its primarily black cast and African locale. It fails to rise to the entertainment level of even “Ant-Man” (2015).\r\n\r\nStill, it’s respectfully noble and the story provokes interesting questions, like isolationism vs. internationalism and African-American culture vs. Native African culture. But there’s some eye-rolling bits, like when Shuri (Letitia Wright) calls CIA agent Ross (Martin Freeman) a “colonizer,” which isn’t even accurate. Maybe it was supposed to be a joke.\r\n\r\nThe waterfall fight between the Black Panther and Killmonger was an homage to the first issue of The Black Panther series in Jungle Action: Issue #6, September, 1973. At the end of that comic’s story T'Challa and Erik fight at the top of a waterfall culminating with Killmonger throwing Black Panther over the cliff. This issue was the beginning of the \"Panther's Rage\" storyline by Don McGregor (featuring artists Billy Graham, Rich Buckler and Gil Kane), which ran for over two years in 13 issues of Jungle Action #6-18 and 209 pages, including the Epilogue. Many consider it the first graphic novel. Of course, this wasn't the first appearance of the Black Panther (who debuted in 1966), but it was the first issue where he was the starring character. \r\n\r\nAnd it was this series that provided the intriguing exposition on T’Challa, Wakanda and its citizens, visitors & enemies. It’s a travesty that McGregor, who created the characters of Killmonger & W’Kabi (Daniel Kaluuya) and conceived this exposition, wasn’t acknowledged in this movie; shameful.\r\n\r\nTHE FILM RUNS 2 hours, 14 minutes and was shot in Georgia (Atlanta, Fayetteville), South Korea (Busan) and Iguazú Waterfalls, Argentina. Ironically, nothing was shot in Africa. WRITERS: Coogler and Joe Robert Cole (and, uncredited, Don McGregor).\r\n\r\nGRADE: B-", "created_at": "2018-06-12T21:24:08.105Z"}, {"movie_id": 284054, "review_id": "5b804c62c3a3687e19012e25", "author_rating": 10.0, "review_text": "Awesome movie", "created_at": "2018-08-24T18:20:18.509Z"}, {"movie_id": 284054, "review_id": "5bf85f999251415cc80f0b3e", "author_rating": 8.0, "review_text": "\"Black Panther is Marvelous (pun intended)\"\r\n\r\nT’Challa (Chadwick Boseman) returns home to his native Wakanda to be crowned king. Not long after he’s challenged for the throne and war looms over his homeland.\r\n\r\nBlack Panther isn’t your typical hero because let’s face it… He’s black. And apart from Bilbo Baggins (Martin Freeman) and Smeagol (Andy Serkis), everybody’s black. And that’s the way it should be.\r\nThe entire cast delivers. Boseman is excellent as king T’Challa who struggles with his new role. It doesn’t get any easierr when Killmonger (Michael B. Jordan) shows up. Killmonger is a mean SOB yet you care for him (some good writing right there). He’s a worthy adversary and one of the better Marvel villains. Jordan portrays him perfectly. Director Ryan Coogler and Michael B. Jordan are a match made in heaven. This is their third collaboration after ‘Fruitvale Station’ and ‘Creed’ and again they’re successful. The movie itself gets better as Jordan’s role gets bigger.\r\n\r\nThe female characters and actors are equally impressive. Especially Nakia (Lupita Nyong’o) and Okoye (Danai Gurira) steal the show.\r\n\r\nThere’s less humour in ‘Black Panther’ than we’re used to seeing in Marvel films but that’s not a bad thing. The movie doesn’t need it.\r\n\r\nThough it’s set in (fictional) Africa there wasn’t any filming done in Africa. Nonetheless the movie looks right. The makers did a great job of creating Wakanda. Huge props to costume designer Ruth E. Carter and composer Ludwig Göransson who help bring Wakanda to life.\r\nOn the downside there’s a lot of CGI. Sometimes it’s too obvious (rhinos say hi). Despite that the battle scenes are beautifully choreographed. Especially Okoye wielding her spear is a thing to behold.\r\n\r\nAll in all ‘Black Panther’ is another wonderful addition to the MCU and we can’t wait to see what role T’Challa and his sidekicks are going to play in ‘Avengers: Infinity War’.", "created_at": "2018-11-23T20:14:17.664Z"}, {"movie_id": 284054, "review_id": "5c8425630e0a26430363757a", "author_rating": 7.0, "review_text": "Black Panther will probably be remembered as a culturally significant film more so than a great one, but that shouldn't take away from the movie's deeper theme of inclusivity. This is a really good movie with heart and intelligence.\r\n\r\nThe fact that I have issues with the pacing, the generic action, or that I don't find Killmonger as complex a villain as the movie thinks is my problem. But I don't understand how people can hate on Black Panther because it integrates social and political themes into its narrative. Isn't contemporary relevance key in determining the greatness of a film?", "created_at": "2019-03-09T20:43:15.661Z"}, {"movie_id": 284054, "review_id": "5ca545850e0a261b89b4d296", "author_rating": 10.0, "review_text": "I really enjoyed this film, it was new uncharted never done before, and they delivered a marvel masterpiece. I look forward to seeing the next one...", "created_at": "2019-04-03T23:45:09.068Z"}, {"movie_id": 284054, "review_id": "5f4d29e5202e1100361ce3b7", "author_rating": null, "review_text": "overhyped before release and overrated after release, Black Panther is nothing more than another paint by numbers MCU movie, with boring characters and a lead that lacks charisma", "created_at": "2020-08-31T16:48:37.675Z"}, {"movie_id": 284054, "review_id": "5f5b56cfe93e950038823008", "author_rating": null, "review_text": "Overall Black Panther was an enjoyable movie, directed by Ryan Coogler. It is one of the biggest movies of 2018, with an outstanding cast who includes Chadwick Boseman and Michael b. jordan, amazing special effects, and a plot that leaves you on the downright edge of your seat for 2 hours and 15 minutes. After the tragic death of chadwick, had a thought about watch his movies and this one comes in my mind. This review is my tribute chadwick. This movie is pg-13, but it seems more 10 and up.  The awesome sci-fi action story about a prince of an utopian country facing the incredible truth about his family, <a href=\"https://paperhelp.nyc/\">paperhelp</a> and the mantle of the black panther, protector of the country Wakanda, was amazing, and fits in with the mcu series perfectly. I reccomend that you watch Captain america:civil war first, as it would make some elements more understandable If you like superhero action movies, fantasy, or science fiction, come see this awesome movie.", "created_at": "2020-09-11T10:51:59.010Z"}, {"movie_id": 284054, "review_id": "600b51f7cc277c003f1425ea", "author_rating": 8.0, "review_text": "Enjoyed that!\r\n\r\n<em>'Black Panther'</em>, the 18th MCU film, is very good. I really like the world building of Wakanda, as well as the cinematography and costume design. The cast are, as expected, excellent as well.\r\n\r\nChadwick Boseman is terrific as T'Challa, as I knew he would be based on the glimpse we see of him in 2016's <em>'Captain America: Civil War'</em>. He is the best actor here, but Danai Gurira runs him close. I'm a huge fan of Gurira's due to her performances in <em>'The Walking Dead'</em> so knew I'd rate her here too, she's fun to watch - it's cool to see her weapon-wielding once again.\r\n\r\nElsewhere, Lupita Nyong'o is good and so is Letitia Wright; she's great in 2015's <em>'Urban Hymn'</em>, which I had seen her in previously. It's a fairly stacked cast, with the likes of Forest Whitaker, Andy Serkis, Daniel Kaluuya and Michael B. Jordan also appearing; Jordan's character isn't the best, but he himself is more than solid.", "created_at": "2021-01-22T22:30:15.886Z"}, {"movie_id": 284054, "review_id": "636dec40f14dad008399e519", "author_rating": 7.0, "review_text": "This is quite a tough film to review objectively; at times it is as good as any from the comic-book universe; the cinematography and effects are top drawer and the pace of the action is usually well judged and enjoyable. The writing and the acting, on the other hand, are a different matter. Chadwick Boseman as \"T'Challa\" is about as wooden as they come as he returns to rule his outwardly agrarian African nation (\"Wakanda\") that secretly has some state-of-the art kit based around a rare, but enormously powerful mineral from outer space. In this particular outing he isn't much helped by Martin Freeman (\"Agent Ross\") or Forest Whitaker as the sagely \"Zuri\". Letitia Wright injects some charm as his tech-savvy little sister \"Shuri\" and for a bit at the beginning, Andy Serkis hams up nicely as South African arch villain \"Ulysses Klaue\" (pronounced claw) but once it settles down, it becomes a beautifully shot but rather bland, simplistic right vs wrong, do the right thing type of story. I do like Michael B. Jordan (\"Erik\") - here he has a screen presence that is charming, cheeky and he knows how to work an audience - and I have to say I was on his side pretty much from the outset, but sadly though, the ending is never in doubt and with neither suspense nor jeopardy to sustain it's initial promise, \"Black Panther\" just ends up being a great looking, but pretty shallow festival of colour and CGI.", "created_at": "2022-11-11T06:31:28.093Z"}, {"movie_id": 284054, "review_id": "6378f021fab3fa007fbeee6c", "author_rating": 8.0, "review_text": "I was hoping to see black revolution all over the world with cool weapons from Wakanda. Sadly that didn't happen, all weapons were destroyed before they were able to leave Wakanda", "created_at": "2022-11-19T15:02:57.369Z"}, {"movie_id": 284054, "review_id": "63c025d905a5330085a4746a", "author_rating": 8.0, "review_text": "Black Panther is a groundbreaking film that stands out among its comic book movie counterparts. With a nearly all-black cast and a unique visual experience, the film takes audiences to the technologically advanced African nation of Wakanda. The story follows T'Challa, who becomes the new Black Panther and king of Wakanda after his father's assassination, as he fights to secure the safety of his nation against the threat of Ulysses Klaue and Killmonger, an evil and ruthless enemy. The film is well-acted, visually stunning, and carries a unique and powerful message about heritage and tradition. The cast, led by Chadwick Boseman as T'Challa, delivers strong performances, and the women of Wakanda, played by Lupita Nyong'o, Danai Gurira, and Angela Bassett, are particularly fierce and impressive. Despite some inconsistencies in the CGI, the film's contained narrative and emphasis on character development make it an important, entertaining, and enjoyable movie.\r\n__________________________\r\nBlack Panther es una película innovadora que se destaca entre sus contrapartes de películas de cómics. Con un elenco casi completamente negro y una experiencia visual única, la película lleva al público a la nación africana tecnológicamente avanzada de Wakanda. La historia sigue a T'Challa, quien se convierte en el nuevo Pantera Negra y rey de Wakanda después del asesinato de su padre, mientras lucha para garantizar la seguridad de su nación contra la amenaza de Ulysses Klaue y Killmonger, un enemigo malvado y despiadado. La película está bien actuada, visualmente impresionante y transmite un mensaje único y poderoso sobre el patrimonio y la tradición. El elenco, encabezado por Chadwick Boseman como T'Challa, ofrece actuaciones sólidas, y las mujeres de Wakanda, interpretadas por Lupita Nyong'o, Danai Gurira y Angela Bassett, son particularmente feroces e impresionantes. A pesar de algunas inconsistencias en el CGI, la narración contenida de la película y el énfasis en el desarrollo del personaje la convierten en una película importante, entretenida y agradable.", "created_at": "2023-01-12T15:23:05.346Z"}, {"movie_id": 284054, "review_id": "63c2107f8efe7300c83fe486", "author_rating": 1.0, "review_text": "I could go on and on, or I can simplify it into two points.\r\n\r\n1: I liked it better when they called it Skyfall\r\n\r\n... and... \r\n\r\n2: I liked it better when they called it \"The Phantom Menace.\"\r\n\r\nMerging the two didn't work, no one in their right mind would actually rip that much of a film with The Phantom Menace's reaction from fans. \r\n\r\nBut despite that, and a lot of other points people have covered to death, you have to like it... because they say you do.", "created_at": "2023-01-14T02:16:31.969Z"}, {"movie_id": 284054, "review_id": "63e72e9a63aad200e05c8150", "author_rating": 6.0, "review_text": "**Black Panther is a good and solid entry in the MCU, but I feel like it could have been even better.**\r\n\r\nBlack Panther was a solid sup hero film with amazing characters, immaculate costumes, and an excellent cast. But I struggled with the plot giving greater focus to the villain and all the supporting cast and sidelining the Black Panther himself. After his introduction in Captain America: Civil War, little was known about this mysterious character, and while this movie introduced us to his world, it didn’t develop T’Challa as much as I had hoped. Now I know it is nitpicking, but after so many excellent standalone MCU films, I had hoped for even more for this character. That said, Chadwick Boseman plays T’Challa with incredible power and strength. In addition, Michael B. Jordan’s Killmonger was an intriguing villain. But my favorite parts of the film were any scenes with Winston Duke or Andy Serkis. They were hilarious and stole the show. Black Panther was a standout in many ways, but I still wanted more opportunities to learn more about T’Challa’s character and develop him further.", "created_at": "2023-02-11T05:58:50.842Z"}, {"movie_id": 284054, "review_id": "644e95036eecee1f6300f424", "author_rating": 6.0, "review_text": "Pretty good movie. I gave it a 6 because the black panter didn't really do much action in this movie.", "created_at": "2023-04-30T16:19:15.902Z"}, {"movie_id": 284054, "review_id": "5a844e0fc3a36862e100c22f", "author_rating": 7.0, "review_text": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-02-14T14:56:15.274Z"}, {"movie_id": 284054, "review_id": "5a87b8550e0a26535a047632", "author_rating": 1.0, "review_text": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.", "created_at": "2018-02-17T05:06:29.941Z"}, {"movie_id": 284054, "review_id": "5a8894ba0e0a2653db05d34f", "author_rating": 10.0, "review_text": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.", "created_at": "2018-02-17T20:46:50.715Z"}, {"movie_id": 284054, "review_id": "5a8dfdcf0e0a263e6e006d75", "author_rating": null, "review_text": "Really good movie. Good story, lots of fun. This is what DC is missing.", "created_at": "2018-02-21T23:16:31.669Z"}, {"movie_id": 284054, "review_id": "5a93b14b0e0a2616c602de5e", "author_rating": 7.0, "review_text": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.", "created_at": "2018-02-26T07:03:39.064Z"}, {"movie_id": 284054, "review_id": "5ad008f6c3a36842e4004d4d", "author_rating": 9.0, "review_text": "I was really surprised how much I liked this movie.  There was so much going on; immigration concerns; the fight between saving the world and protecting your own country(sound familiar); the fear of an African country’s resources being pillaged; how best to handle the problems black people face worldwide; and many great authentic feeling cultural nods.  All this while not being heavy or preachy.  You can definitely eat popcorn to this.  The villain; Killmonger, is great.  Not great in that he is scary, though he is, but because he is more complex than some shadowy figure you should just trust is a bad guy because of visual effects or dramatic music.  \r\n\r\nThis movie isn’t just explosions and one-liners in an exotic location.  This is a great movie in general.  It’s always interesting.  There are great relationships between all the characters.  Finally; Wakanda is really a place.  It feels alive and lived in; not just impressive buildings used as a backdrop.  They did a wonderful job of worldbuilding; from the rituals, to the clothing, fancy tech, and scenery.  This movie is definitely worth a watch. \r\n\r\n☆☆☆☆-1/2\r\n\r\nI also have to add that; you get to actually see Andy Serkis!  When I saw his name I thought we was going to be some kind of CGI monster.  I’m just happy to see him get actual screen time.", "created_at": "2018-04-13T01:33:42.336Z"}, {"movie_id": 284054, "review_id": "5af0b71092514119a6000099", "author_rating": 7.0, "review_text": "The Black Panther is a fun romp, but it definitely has some issues. First, the good.\r\n\r\nThe action is fun, the emotions hit home, and the story isn't dirt-poor. \r\n\r\nWhile the CGI gets ripped on from time to time, I thought it was solid enough for a Marvel movie. The fight scenes were relatively well-choreographed, as well. The ritual combat scenes were exciting and visually appealing. The fights in Korea were also fun to see, and while I'm not a fan of car chase scenes as a whole, I did enjoy this one. It was reminiscent of a James Bond movie. \r\n\r\nIn fact, that's another appeal, at least to me. The secret technology base and the fun action scenes were a great callback to James Bond-type movies. I do think the movie would have been complemented by giving T'Challa a similar vice as Bond's, although Marvel probably wouldn't veer down that line for the seemingly morally absolute King of Wakanda.\r\n\r\nThe story, well, it's a mixed bag. Everything seemed crammed together with major emotional keys being rushed through or somewhat ignored. The concept is fine though. A long lost relative comes to challenge the new king, wins, and shows his colors, becoming something amoral. The king comes back and takes down the usurper, realizing something about themselves/their kingdom in the process. It's tired, but not so tired it damages the movie. \r\n\r\nThis is where the issues begin to rise, though. The movie is really a movie and a half or two movies crammed into one. Wakanda has a ton of wonderful mythology, but almost none of it is explained. The movie never really explains how the Wakandans used vibranium was used to make themselves wealthy. It touches on it in some exposition, but there was much more that was just glossed over. \r\n\r\nIn addition, W'Kabi became radicalized by Killmonger much too quickly for such a pivotal relationship to flip. Some of the emotional aspects of the movie fell flat because they weren't given enough screen time. \r\n\r\nDespite its flaws, Black Panther is a fun movie that adds to the Marvel Cinematic Universe. It should have been two movies, but I doubt this is the last we'll see of Wakanda.", "created_at": "2018-05-07T20:29:04.388Z"}, {"movie_id": 284054, "review_id": "5b0e0e66c3a368714d000179", "author_rating": 6.0, "review_text": "The character of T'Challa made his debut in Captain America 3: Civil War.\r\n\r\nIn Black Panther, T'Challa returns to his homeland of Wakanda after the death of his father who has been hiding a secret about his brother who lived in the USA. He now inherits the throne after a challenge from a rival.\r\n\r\nWakanda is an african country with wealth, power and immense technology that it hides from the outside world.\r\n\r\nT'Challa's uncle wanted an uprising in the USA. Now his son Killmonger comes to Wakanda and challenges T'Challa for the throne.\r\n\r\nKillmonger wins and leads the struggle for black power.\r\n\r\nBlack Panther is a well made efficient film from Marvel who really have nailed down their formula. The box office avalanche has surprised me. It simply is not that good with a very predictable story.", "created_at": "2018-05-30T02:37:26.128Z"}, {"movie_id": 284054, "review_id": "5b2039f8c3a36814900052f3", "author_rating": 6.0, "review_text": "Overrated due to political correctness; it’s noble and has its points of interest, but it’s also kinda meh\r\n\t\r\nRELEASED IN 2018 and directed by Ryan Coogler, \"Black Panther” details events when T’Challa (Chadwick Boseman) takes over kingship of the hidden African nation Wakanda after his father passes (John Kani). The kingdom is technologically advanced due to its secret resource Vibranium, a priceless, almost magical metal. Unfortunately, T’Challa’s reign is challenged by an angry American former-black ops soldier, Erik “Killmonger” (Michael B. Jordan).\r\n\r\nWith its black director and mostly black cast (with a couple of token white dudes), “Black Panther” was overhyped and overrated upon release. Critics were apparently afraid of being called “racist” by liberal fascists if they dared to be honest and say anything negative (rolling my eyes). The movie’s likable and certainly has its points of interest, but the characters are rather dull, except for Killmonger, and the story isn’t all that involving. It’s basically a mediocre superhero movie that has some blatant Bond-isms and is set apart by its primarily black cast and African locale. It fails to rise to the entertainment level of even “Ant-Man” (2015).\r\n\r\nStill, it’s respectfully noble and the story provokes interesting questions, like isolationism vs. internationalism and African-American culture vs. Native African culture. But there’s some eye-rolling bits, like when Shuri (Letitia Wright) calls CIA agent Ross (Martin Freeman) a “colonizer,” which isn’t even accurate. Maybe it was supposed to be a joke.\r\n\r\nThe waterfall fight between the Black Panther and Killmonger was an homage to the first issue of The Black Panther series in Jungle Action: Issue #6, September, 1973. At the end of that comic’s story T'Challa and Erik fight at the top of a waterfall culminating with Killmonger throwing Black Panther over the cliff. This issue was the beginning of the \"Panther's Rage\" storyline by Don McGregor (featuring artists Billy Graham, Rich Buckler and Gil Kane), which ran for over two years in 13 issues of Jungle Action #6-18 and 209 pages, including the Epilogue. Many consider it the first graphic novel. Of course, this wasn't the first appearance of the Black Panther (who debuted in 1966), but it was the first issue where he was the starring character. \r\n\r\nAnd it was this series that provided the intriguing exposition on T’Challa, Wakanda and its citizens, visitors & enemies. It’s a travesty that McGregor, who created the characters of Killmonger & W’Kabi (Daniel Kaluuya) and conceived this exposition, wasn’t acknowledged in this movie; shameful.\r\n\r\nTHE FILM RUNS 2 hours, 14 minutes and was shot in Georgia (Atlanta, Fayetteville), South Korea (Busan) and Iguazú Waterfalls, Argentina. Ironically, nothing was shot in Africa. WRITERS: Coogler and Joe Robert Cole (and, uncredited, Don McGregor).\r\n\r\nGRADE: B-", "created_at": "2018-06-12T21:24:08.105Z"}, {"movie_id": 284054, "review_id": "5b804c62c3a3687e19012e25", "author_rating": 10.0, "review_text": "Awesome movie", "created_at": "2018-08-24T18:20:18.509Z"}, {"movie_id": 284054, "review_id": "5bf85f999251415cc80f0b3e", "author_rating": 8.0, "review_text": "\"Black Panther is Marvelous (pun intended)\"\r\n\r\nT’Challa (Chadwick Boseman) returns home to his native Wakanda to be crowned king. Not long after he’s challenged for the throne and war looms over his homeland.\r\n\r\nBlack Panther isn’t your typical hero because let’s face it… He’s black. And apart from Bilbo Baggins (Martin Freeman) and Smeagol (Andy Serkis), everybody’s black. And that’s the way it should be.\r\nThe entire cast delivers. Boseman is excellent as king T’Challa who struggles with his new role. It doesn’t get any easierr when Killmonger (Michael B. Jordan) shows up. Killmonger is a mean SOB yet you care for him (some good writing right there). He’s a worthy adversary and one of the better Marvel villains. Jordan portrays him perfectly. Director Ryan Coogler and Michael B. Jordan are a match made in heaven. This is their third collaboration after ‘Fruitvale Station’ and ‘Creed’ and again they’re successful. The movie itself gets better as Jordan’s role gets bigger.\r\n\r\nThe female characters and actors are equally impressive. Especially Nakia (Lupita Nyong’o) and Okoye (Danai Gurira) steal the show.\r\n\r\nThere’s less humour in ‘Black Panther’ than we’re used to seeing in Marvel films but that’s not a bad thing. The movie doesn’t need it.\r\n\r\nThough it’s set in (fictional) Africa there wasn’t any filming done in Africa. Nonetheless the movie looks right. The makers did a great job of creating Wakanda. Huge props to costume designer Ruth E. Carter and composer Ludwig Göransson who help bring Wakanda to life.\r\nOn the downside there’s a lot of CGI. Sometimes it’s too obvious (rhinos say hi). Despite that the battle scenes are beautifully choreographed. Especially Okoye wielding her spear is a thing to behold.\r\n\r\nAll in all ‘Black Panther’ is another wonderful addition to the MCU and we can’t wait to see what role T’Challa and his sidekicks are going to play in ‘Avengers: Infinity War’.", "created_at": "2018-11-23T20:14:17.664Z"}, {"movie_id": 284054, "review_id": "5c8425630e0a26430363757a", "author_rating": 7.0, "review_text": "Black Panther will probably be remembered as a culturally significant film more so than a great one, but that shouldn't take away from the movie's deeper theme of inclusivity. This is a really good movie with heart and intelligence.\r\n\r\nThe fact that I have issues with the pacing, the generic action, or that I don't find Killmonger as complex a villain as the movie thinks is my problem. But I don't understand how people can hate on Black Panther because it integrates social and political themes into its narrative. Isn't contemporary relevance key in determining the greatness of a film?", "created_at": "2019-03-09T20:43:15.661Z"}, {"movie_id": 284054, "review_id": "5ca545850e0a261b89b4d296", "author_rating": 10.0, "review_text": "I really enjoyed this film, it was new uncharted never done before, and they delivered a marvel masterpiece. I look forward to seeing the next one...", "created_at": "2019-04-03T23:45:09.068Z"}, {"movie_id": 284054, "review_id": "5f4d29e5202e1100361ce3b7", "author_rating": null, "review_text": "overhyped before release and overrated after release, Black Panther is nothing more than another paint by numbers MCU movie, with boring characters and a lead that lacks charisma", "created_at": "2020-08-31T16:48:37.675Z"}, {"movie_id": 284054, "review_id": "5f5b56cfe93e950038823008", "author_rating": null, "review_text": "Overall Black Panther was an enjoyable movie, directed by Ryan Coogler. It is one of the biggest movies of 2018, with an outstanding cast who includes Chadwick Boseman and Michael b. jordan, amazing special effects, and a plot that leaves you on the downright edge of your seat for 2 hours and 15 minutes. After the tragic death of chadwick, had a thought about watch his movies and this one comes in my mind. This review is my tribute chadwick. This movie is pg-13, but it seems more 10 and up.  The awesome sci-fi action story about a prince of an utopian country facing the incredible truth about his family, <a href=\"https://paperhelp.nyc/\">paperhelp</a> and the mantle of the black panther, protector of the country Wakanda, was amazing, and fits in with the mcu series perfectly. I reccomend that you watch Captain america:civil war first, as it would make some elements more understandable If you like superhero action movies, fantasy, or science fiction, come see this awesome movie.", "created_at": "2020-09-11T10:51:59.010Z"}, {"movie_id": 284054, "review_id": "600b51f7cc277c003f1425ea", "author_rating": 8.0, "review_text": "Enjoyed that!\r\n\r\n<em>'Black Panther'</em>, the 18th MCU film, is very good. I really like the world building of Wakanda, as well as the cinematography and costume design. The cast are, as expected, excellent as well.\r\n\r\nChadwick Boseman is terrific as T'Challa, as I knew he would be based on the glimpse we see of him in 2016's <em>'Captain America: Civil War'</em>. He is the best actor here, but Danai Gurira runs him close. I'm a huge fan of Gurira's due to her performances in <em>'The Walking Dead'</em> so knew I'd rate her here too, she's fun to watch - it's cool to see her weapon-wielding once again.\r\n\r\nElsewhere, Lupita Nyong'o is good and so is Letitia Wright; she's great in 2015's <em>'Urban Hymn'</em>, which I had seen her in previously. It's a fairly stacked cast, with the likes of Forest Whitaker, Andy Serkis, Daniel Kaluuya and Michael B. Jordan also appearing; Jordan's character isn't the best, but he himself is more than solid.", "created_at": "2021-01-22T22:30:15.886Z"}, {"movie_id": 284054, "review_id": "636dec40f14dad008399e519", "author_rating": 7.0, "review_text": "This is quite a tough film to review objectively; at times it is as good as any from the comic-book universe; the cinematography and effects are top drawer and the pace of the action is usually well judged and enjoyable. The writing and the acting, on the other hand, are a different matter. Chadwick Boseman as \"T'Challa\" is about as wooden as they come as he returns to rule his outwardly agrarian African nation (\"Wakanda\") that secretly has some state-of-the art kit based around a rare, but enormously powerful mineral from outer space. In this particular outing he isn't much helped by Martin Freeman (\"Agent Ross\") or Forest Whitaker as the sagely \"Zuri\". Letitia Wright injects some charm as his tech-savvy little sister \"Shuri\" and for a bit at the beginning, Andy Serkis hams up nicely as South African arch villain \"Ulysses Klaue\" (pronounced claw) but once it settles down, it becomes a beautifully shot but rather bland, simplistic right vs wrong, do the right thing type of story. I do like Michael B. Jordan (\"Erik\") - here he has a screen presence that is charming, cheeky and he knows how to work an audience - and I have to say I was on his side pretty much from the outset, but sadly though, the ending is never in doubt and with neither suspense nor jeopardy to sustain it's initial promise, \"Black Panther\" just ends up being a great looking, but pretty shallow festival of colour and CGI.", "created_at": "2022-11-11T06:31:28.093Z"}, {"movie_id": 284054, "review_id": "6378f021fab3fa007fbeee6c", "author_rating": 8.0, "review_text": "I was hoping to see black revolution all over the world with cool weapons from Wakanda. Sadly that didn't happen, all weapons were destroyed before they were able to leave Wakanda", "created_at": "2022-11-19T15:02:57.369Z"}, {"movie_id": 284054, "review_id": "63c025d905a5330085a4746a", "author_rating": 8.0, "review_text": "Black Panther is a groundbreaking film that stands out among its comic book movie counterparts. With a nearly all-black cast and a unique visual experience, the film takes audiences to the technologically advanced African nation of Wakanda. The story follows T'Challa, who becomes the new Black Panther and king of Wakanda after his father's assassination, as he fights to secure the safety of his nation against the threat of Ulysses Klaue and Killmonger, an evil and ruthless enemy. The film is well-acted, visually stunning, and carries a unique and powerful message about heritage and tradition. The cast, led by Chadwick Boseman as T'Challa, delivers strong performances, and the women of Wakanda, played by Lupita Nyong'o, Danai Gurira, and Angela Bassett, are particularly fierce and impressive. Despite some inconsistencies in the CGI, the film's contained narrative and emphasis on character development make it an important, entertaining, and enjoyable movie.\r\n__________________________\r\nBlack Panther es una película innovadora que se destaca entre sus contrapartes de películas de cómics. Con un elenco casi completamente negro y una experiencia visual única, la película lleva al público a la nación africana tecnológicamente avanzada de Wakanda. La historia sigue a T'Challa, quien se convierte en el nuevo Pantera Negra y rey de Wakanda después del asesinato de su padre, mientras lucha para garantizar la seguridad de su nación contra la amenaza de Ulysses Klaue y Killmonger, un enemigo malvado y despiadado. La película está bien actuada, visualmente impresionante y transmite un mensaje único y poderoso sobre el patrimonio y la tradición. El elenco, encabezado por Chadwick Boseman como T'Challa, ofrece actuaciones sólidas, y las mujeres de Wakanda, interpretadas por Lupita Nyong'o, Danai Gurira y Angela Bassett, son particularmente feroces e impresionantes. A pesar de algunas inconsistencias en el CGI, la narración contenida de la película y el énfasis en el desarrollo del personaje la convierten en una película importante, entretenida y agradable.", "created_at": "2023-01-12T15:23:05.346Z"}, {"movie_id": 284054, "review_id": "63c2107f8efe7300c83fe486", "author_rating": 1.0, "review_text": "I could go on and on, or I can simplify it into two points.\r\n\r\n1: I liked it better when they called it Skyfall\r\n\r\n... and... \r\n\r\n2: I liked it better when they called it \"The Phantom Menace.\"\r\n\r\nMerging the two didn't work, no one in their right mind would actually rip that much of a film with The Phantom Menace's reaction from fans. \r\n\r\nBut despite that, and a lot of other points people have covered to death, you have to like it... because they say you do.", "created_at": "2023-01-14T02:16:31.969Z"}, {"movie_id": 284054, "review_id": "63e72e9a63aad200e05c8150", "author_rating": 6.0, "review_text": "**Black Panther is a good and solid entry in the MCU, but I feel like it could have been even better.**\r\n\r\nBlack Panther was a solid sup hero film with amazing characters, immaculate costumes, and an excellent cast. But I struggled with the plot giving greater focus to the villain and all the supporting cast and sidelining the Black Panther himself. After his introduction in Captain America: Civil War, little was known about this mysterious character, and while this movie introduced us to his world, it didn’t develop T’Challa as much as I had hoped. Now I know it is nitpicking, but after so many excellent standalone MCU films, I had hoped for even more for this character. That said, Chadwick Boseman plays T’Challa with incredible power and strength. In addition, Michael B. Jordan’s Killmonger was an intriguing villain. But my favorite parts of the film were any scenes with Winston Duke or Andy Serkis. They were hilarious and stole the show. Black Panther was a standout in many ways, but I still wanted more opportunities to learn more about T’Challa’s character and develop him further.", "created_at": "2023-02-11T05:58:50.842Z"}, {"movie_id": 284054, "review_id": "644e95036eecee1f6300f424", "author_rating": 6.0, "review_text": "Pretty good movie. I gave it a 6 because the black panter didn't really do much action in this movie.", "created_at": "2023-04-30T16:19:15.902Z"}, {"movie_id": 284054, "review_id": "5a844e0fc3a36862e100c22f", "author_rating": 7.0, "review_text": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-02-14T14:56:15.274Z"}, {"movie_id": 284054, "review_id": "5a87b8550e0a26535a047632", "author_rating": 1.0, "review_text": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.", "created_at": "2018-02-17T05:06:29.941Z"}, {"movie_id": 284054, "review_id": "5a8894ba0e0a2653db05d34f", "author_rating": 10.0, "review_text": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.", "created_at": "2018-02-17T20:46:50.715Z"}, {"movie_id": 284054, "review_id": "5a8dfdcf0e0a263e6e006d75", "author_rating": null, "review_text": "Really good movie. Good story, lots of fun. This is what DC is missing.", "created_at": "2018-02-21T23:16:31.669Z"}, {"movie_id": 284054, "review_id": "5a93b14b0e0a2616c602de5e", "author_rating": 7.0, "review_text": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.", "created_at": "2018-02-26T07:03:39.064Z"}, {"movie_id": 284054, "review_id": "5ad008f6c3a36842e4004d4d", "author_rating": 9.0, "review_text": "I was really surprised how much I liked this movie.  There was so much going on; immigration concerns; the fight between saving the world and protecting your own country(sound familiar); the fear of an African country’s resources being pillaged; how best to handle the problems black people face worldwide; and many great authentic feeling cultural nods.  All this while not being heavy or preachy.  You can definitely eat popcorn to this.  The villain; Killmonger, is great.  Not great in that he is scary, though he is, but because he is more complex than some shadowy figure you should just trust is a bad guy because of visual effects or dramatic music.  \r\n\r\nThis movie isn’t just explosions and one-liners in an exotic location.  This is a great movie in general.  It’s always interesting.  There are great relationships between all the characters.  Finally; Wakanda is really a place.  It feels alive and lived in; not just impressive buildings used as a backdrop.  They did a wonderful job of worldbuilding; from the rituals, to the clothing, fancy tech, and scenery.  This movie is definitely worth a watch. \r\n\r\n☆☆☆☆-1/2\r\n\r\nI also have to add that; you get to actually see Andy Serkis!  When I saw his name I thought we was going to be some kind of CGI monster.  I’m just happy to see him get actual screen time.", "created_at": "2018-04-13T01:33:42.336Z"}, {"movie_id": 284054, "review_id": "5af0b71092514119a6000099", "author_rating": 7.0, "review_text": "The Black Panther is a fun romp, but it definitely has some issues. First, the good.\r\n\r\nThe action is fun, the emotions hit home, and the story isn't dirt-poor. \r\n\r\nWhile the CGI gets ripped on from time to time, I thought it was solid enough for a Marvel movie. The fight scenes were relatively well-choreographed, as well. The ritual combat scenes were exciting and visually appealing. The fights in Korea were also fun to see, and while I'm not a fan of car chase scenes as a whole, I did enjoy this one. It was reminiscent of a James Bond movie. \r\n\r\nIn fact, that's another appeal, at least to me. The secret technology base and the fun action scenes were a great callback to James Bond-type movies. I do think the movie would have been complemented by giving T'Challa a similar vice as Bond's, although Marvel probably wouldn't veer down that line for the seemingly morally absolute King of Wakanda.\r\n\r\nThe story, well, it's a mixed bag. Everything seemed crammed together with major emotional keys being rushed through or somewhat ignored. The concept is fine though. A long lost relative comes to challenge the new king, wins, and shows his colors, becoming something amoral. The king comes back and takes down the usurper, realizing something about themselves/their kingdom in the process. It's tired, but not so tired it damages the movie. \r\n\r\nThis is where the issues begin to rise, though. The movie is really a movie and a half or two movies crammed into one. Wakanda has a ton of wonderful mythology, but almost none of it is explained. The movie never really explains how the Wakandans used vibranium was used to make themselves wealthy. It touches on it in some exposition, but there was much more that was just glossed over. \r\n\r\nIn addition, W'Kabi became radicalized by Killmonger much too quickly for such a pivotal relationship to flip. Some of the emotional aspects of the movie fell flat because they weren't given enough screen time. \r\n\r\nDespite its flaws, Black Panther is a fun movie that adds to the Marvel Cinematic Universe. It should have been two movies, but I doubt this is the last we'll see of Wakanda.", "created_at": "2018-05-07T20:29:04.388Z"}, {"movie_id": 284054, "review_id": "5b0e0e66c3a368714d000179", "author_rating": 6.0, "review_text": "The character of T'Challa made his debut in Captain America 3: Civil War.\r\n\r\nIn Black Panther, T'Challa returns to his homeland of Wakanda after the death of his father who has been hiding a secret about his brother who lived in the USA. He now inherits the throne after a challenge from a rival.\r\n\r\nWakanda is an african country with wealth, power and immense technology that it hides from the outside world.\r\n\r\nT'Challa's uncle wanted an uprising in the USA. Now his son Killmonger comes to Wakanda and challenges T'Challa for the throne.\r\n\r\nKillmonger wins and leads the struggle for black power.\r\n\r\nBlack Panther is a well made efficient film from Marvel who really have nailed down their formula. The box office avalanche has surprised me. It simply is not that good with a very predictable story.", "created_at": "2018-05-30T02:37:26.128Z"}, {"movie_id": 284054, "review_id": "5b2039f8c3a36814900052f3", "author_rating": 6.0, "review_text": "Overrated due to political correctness; it’s noble and has its points of interest, but it’s also kinda meh\r\n\t\r\nRELEASED IN 2018 and directed by Ryan Coogler, \"Black Panther” details events when T’Challa (Chadwick Boseman) takes over kingship of the hidden African nation Wakanda after his father passes (John Kani). The kingdom is technologically advanced due to its secret resource Vibranium, a priceless, almost magical metal. Unfortunately, T’Challa’s reign is challenged by an angry American former-black ops soldier, Erik “Killmonger” (Michael B. Jordan).\r\n\r\nWith its black director and mostly black cast (with a couple of token white dudes), “Black Panther” was overhyped and overrated upon release. Critics were apparently afraid of being called “racist” by liberal fascists if they dared to be honest and say anything negative (rolling my eyes). The movie’s likable and certainly has its points of interest, but the characters are rather dull, except for Killmonger, and the story isn’t all that involving. It’s basically a mediocre superhero movie that has some blatant Bond-isms and is set apart by its primarily black cast and African locale. It fails to rise to the entertainment level of even “Ant-Man” (2015).\r\n\r\nStill, it’s respectfully noble and the story provokes interesting questions, like isolationism vs. internationalism and African-American culture vs. Native African culture. But there’s some eye-rolling bits, like when Shuri (Letitia Wright) calls CIA agent Ross (Martin Freeman) a “colonizer,” which isn’t even accurate. Maybe it was supposed to be a joke.\r\n\r\nThe waterfall fight between the Black Panther and Killmonger was an homage to the first issue of The Black Panther series in Jungle Action: Issue #6, September, 1973. At the end of that comic’s story T'Challa and Erik fight at the top of a waterfall culminating with Killmonger throwing Black Panther over the cliff. This issue was the beginning of the \"Panther's Rage\" storyline by Don McGregor (featuring artists Billy Graham, Rich Buckler and Gil Kane), which ran for over two years in 13 issues of Jungle Action #6-18 and 209 pages, including the Epilogue. Many consider it the first graphic novel. Of course, this wasn't the first appearance of the Black Panther (who debuted in 1966), but it was the first issue where he was the starring character. \r\n\r\nAnd it was this series that provided the intriguing exposition on T’Challa, Wakanda and its citizens, visitors & enemies. It’s a travesty that McGregor, who created the characters of Killmonger & W’Kabi (Daniel Kaluuya) and conceived this exposition, wasn’t acknowledged in this movie; shameful.\r\n\r\nTHE FILM RUNS 2 hours, 14 minutes and was shot in Georgia (Atlanta, Fayetteville), South Korea (Busan) and Iguazú Waterfalls, Argentina. Ironically, nothing was shot in Africa. WRITERS: Coogler and Joe Robert Cole (and, uncredited, Don McGregor).\r\n\r\nGRADE: B-", "created_at": "2018-06-12T21:24:08.105Z"}, {"movie_id": 284054, "review_id": "5b804c62c3a3687e19012e25", "author_rating": 10.0, "review_text": "Awesome movie", "created_at": "2018-08-24T18:20:18.509Z"}, {"movie_id": 284054, "review_id": "5bf85f999251415cc80f0b3e", "author_rating": 8.0, "review_text": "\"Black Panther is Marvelous (pun intended)\"\r\n\r\nT’Challa (Chadwick Boseman) returns home to his native Wakanda to be crowned king. Not long after he’s challenged for the throne and war looms over his homeland.\r\n\r\nBlack Panther isn’t your typical hero because let’s face it… He’s black. And apart from Bilbo Baggins (Martin Freeman) and Smeagol (Andy Serkis), everybody’s black. And that’s the way it should be.\r\nThe entire cast delivers. Boseman is excellent as king T’Challa who struggles with his new role. It doesn’t get any easierr when Killmonger (Michael B. Jordan) shows up. Killmonger is a mean SOB yet you care for him (some good writing right there). He’s a worthy adversary and one of the better Marvel villains. Jordan portrays him perfectly. Director Ryan Coogler and Michael B. Jordan are a match made in heaven. This is their third collaboration after ‘Fruitvale Station’ and ‘Creed’ and again they’re successful. The movie itself gets better as Jordan’s role gets bigger.\r\n\r\nThe female characters and actors are equally impressive. Especially Nakia (Lupita Nyong’o) and Okoye (Danai Gurira) steal the show.\r\n\r\nThere’s less humour in ‘Black Panther’ than we’re used to seeing in Marvel films but that’s not a bad thing. The movie doesn’t need it.\r\n\r\nThough it’s set in (fictional) Africa there wasn’t any filming done in Africa. Nonetheless the movie looks right. The makers did a great job of creating Wakanda. Huge props to costume designer Ruth E. Carter and composer Ludwig Göransson who help bring Wakanda to life.\r\nOn the downside there’s a lot of CGI. Sometimes it’s too obvious (rhinos say hi). Despite that the battle scenes are beautifully choreographed. Especially Okoye wielding her spear is a thing to behold.\r\n\r\nAll in all ‘Black Panther’ is another wonderful addition to the MCU and we can’t wait to see what role T’Challa and his sidekicks are going to play in ‘Avengers: Infinity War’.", "created_at": "2018-11-23T20:14:17.664Z"}, {"movie_id": 284054, "review_id": "5c8425630e0a26430363757a", "author_rating": 7.0, "review_text": "Black Panther will probably be remembered as a culturally significant film more so than a great one, but that shouldn't take away from the movie's deeper theme of inclusivity. This is a really good movie with heart and intelligence.\r\n\r\nThe fact that I have issues with the pacing, the generic action, or that I don't find Killmonger as complex a villain as the movie thinks is my problem. But I don't understand how people can hate on Black Panther because it integrates social and political themes into its narrative. Isn't contemporary relevance key in determining the greatness of a film?", "created_at": "2019-03-09T20:43:15.661Z"}, {"movie_id": 284054, "review_id": "5ca545850e0a261b89b4d296", "author_rating": 10.0, "review_text": "I really enjoyed this film, it was new uncharted never done before, and they delivered a marvel masterpiece. I look forward to seeing the next one...", "created_at": "2019-04-03T23:45:09.068Z"}, {"movie_id": 284054, "review_id": "5f4d29e5202e1100361ce3b7", "author_rating": null, "review_text": "overhyped before release and overrated after release, Black Panther is nothing more than another paint by numbers MCU movie, with boring characters and a lead that lacks charisma", "created_at": "2020-08-31T16:48:37.675Z"}, {"movie_id": 284054, "review_id": "5f5b56cfe93e950038823008", "author_rating": null, "review_text": "Overall Black Panther was an enjoyable movie, directed by Ryan Coogler. It is one of the biggest movies of 2018, with an outstanding cast who includes Chadwick Boseman and Michael b. jordan, amazing special effects, and a plot that leaves you on the downright edge of your seat for 2 hours and 15 minutes. After the tragic death of chadwick, had a thought about watch his movies and this one comes in my mind. This review is my tribute chadwick. This movie is pg-13, but it seems more 10 and up.  The awesome sci-fi action story about a prince of an utopian country facing the incredible truth about his family, <a href=\"https://paperhelp.nyc/\">paperhelp</a> and the mantle of the black panther, protector of the country Wakanda, was amazing, and fits in with the mcu series perfectly. I reccomend that you watch Captain america:civil war first, as it would make some elements more understandable If you like superhero action movies, fantasy, or science fiction, come see this awesome movie.", "created_at": "2020-09-11T10:51:59.010Z"}, {"movie_id": 284054, "review_id": "600b51f7cc277c003f1425ea", "author_rating": 8.0, "review_text": "Enjoyed that!\r\n\r\n<em>'Black Panther'</em>, the 18th MCU film, is very good. I really like the world building of Wakanda, as well as the cinematography and costume design. The cast are, as expected, excellent as well.\r\n\r\nChadwick Boseman is terrific as T'Challa, as I knew he would be based on the glimpse we see of him in 2016's <em>'Captain America: Civil War'</em>. He is the best actor here, but Danai Gurira runs him close. I'm a huge fan of Gurira's due to her performances in <em>'The Walking Dead'</em> so knew I'd rate her here too, she's fun to watch - it's cool to see her weapon-wielding once again.\r\n\r\nElsewhere, Lupita Nyong'o is good and so is Letitia Wright; she's great in 2015's <em>'Urban Hymn'</em>, which I had seen her in previously. It's a fairly stacked cast, with the likes of Forest Whitaker, Andy Serkis, Daniel Kaluuya and Michael B. Jordan also appearing; Jordan's character isn't the best, but he himself is more than solid.", "created_at": "2021-01-22T22:30:15.886Z"}, {"movie_id": 284054, "review_id": "636dec40f14dad008399e519", "author_rating": 7.0, "review_text": "This is quite a tough film to review objectively; at times it is as good as any from the comic-book universe; the cinematography and effects are top drawer and the pace of the action is usually well judged and enjoyable. The writing and the acting, on the other hand, are a different matter. Chadwick Boseman as \"T'Challa\" is about as wooden as they come as he returns to rule his outwardly agrarian African nation (\"Wakanda\") that secretly has some state-of-the art kit based around a rare, but enormously powerful mineral from outer space. In this particular outing he isn't much helped by Martin Freeman (\"Agent Ross\") or Forest Whitaker as the sagely \"Zuri\". Letitia Wright injects some charm as his tech-savvy little sister \"Shuri\" and for a bit at the beginning, Andy Serkis hams up nicely as South African arch villain \"Ulysses Klaue\" (pronounced claw) but once it settles down, it becomes a beautifully shot but rather bland, simplistic right vs wrong, do the right thing type of story. I do like Michael B. Jordan (\"Erik\") - here he has a screen presence that is charming, cheeky and he knows how to work an audience - and I have to say I was on his side pretty much from the outset, but sadly though, the ending is never in doubt and with neither suspense nor jeopardy to sustain it's initial promise, \"Black Panther\" just ends up being a great looking, but pretty shallow festival of colour and CGI.", "created_at": "2022-11-11T06:31:28.093Z"}, {"movie_id": 284054, "review_id": "6378f021fab3fa007fbeee6c", "author_rating": 8.0, "review_text": "I was hoping to see black revolution all over the world with cool weapons from Wakanda. Sadly that didn't happen, all weapons were destroyed before they were able to leave Wakanda", "created_at": "2022-11-19T15:02:57.369Z"}, {"movie_id": 284054, "review_id": "63c025d905a5330085a4746a", "author_rating": 8.0, "review_text": "Black Panther is a groundbreaking film that stands out among its comic book movie counterparts. With a nearly all-black cast and a unique visual experience, the film takes audiences to the technologically advanced African nation of Wakanda. The story follows T'Challa, who becomes the new Black Panther and king of Wakanda after his father's assassination, as he fights to secure the safety of his nation against the threat of Ulysses Klaue and Killmonger, an evil and ruthless enemy. The film is well-acted, visually stunning, and carries a unique and powerful message about heritage and tradition. The cast, led by Chadwick Boseman as T'Challa, delivers strong performances, and the women of Wakanda, played by Lupita Nyong'o, Danai Gurira, and Angela Bassett, are particularly fierce and impressive. Despite some inconsistencies in the CGI, the film's contained narrative and emphasis on character development make it an important, entertaining, and enjoyable movie.\r\n__________________________\r\nBlack Panther es una película innovadora que se destaca entre sus contrapartes de películas de cómics. Con un elenco casi completamente negro y una experiencia visual única, la película lleva al público a la nación africana tecnológicamente avanzada de Wakanda. La historia sigue a T'Challa, quien se convierte en el nuevo Pantera Negra y rey de Wakanda después del asesinato de su padre, mientras lucha para garantizar la seguridad de su nación contra la amenaza de Ulysses Klaue y Killmonger, un enemigo malvado y despiadado. La película está bien actuada, visualmente impresionante y transmite un mensaje único y poderoso sobre el patrimonio y la tradición. El elenco, encabezado por Chadwick Boseman como T'Challa, ofrece actuaciones sólidas, y las mujeres de Wakanda, interpretadas por Lupita Nyong'o, Danai Gurira y Angela Bassett, son particularmente feroces e impresionantes. A pesar de algunas inconsistencias en el CGI, la narración contenida de la película y el énfasis en el desarrollo del personaje la convierten en una película importante, entretenida y agradable.", "created_at": "2023-01-12T15:23:05.346Z"}, {"movie_id": 284054, "review_id": "63c2107f8efe7300c83fe486", "author_rating": 1.0, "review_text": "I could go on and on, or I can simplify it into two points.\r\n\r\n1: I liked it better when they called it Skyfall\r\n\r\n... and... \r\n\r\n2: I liked it better when they called it \"The Phantom Menace.\"\r\n\r\nMerging the two didn't work, no one in their right mind would actually rip that much of a film with The Phantom Menace's reaction from fans. \r\n\r\nBut despite that, and a lot of other points people have covered to death, you have to like it... because they say you do.", "created_at": "2023-01-14T02:16:31.969Z"}, {"movie_id": 284054, "review_id": "63e72e9a63aad200e05c8150", "author_rating": 6.0, "review_text": "**Black Panther is a good and solid entry in the MCU, but I feel like it could have been even better.**\r\n\r\nBlack Panther was a solid sup hero film with amazing characters, immaculate costumes, and an excellent cast. But I struggled with the plot giving greater focus to the villain and all the supporting cast and sidelining the Black Panther himself. After his introduction in Captain America: Civil War, little was known about this mysterious character, and while this movie introduced us to his world, it didn’t develop T’Challa as much as I had hoped. Now I know it is nitpicking, but after so many excellent standalone MCU films, I had hoped for even more for this character. That said, Chadwick Boseman plays T’Challa with incredible power and strength. In addition, Michael B. Jordan’s Killmonger was an intriguing villain. But my favorite parts of the film were any scenes with Winston Duke or Andy Serkis. They were hilarious and stole the show. Black Panther was a standout in many ways, but I still wanted more opportunities to learn more about T’Challa’s character and develop him further.", "created_at": "2023-02-11T05:58:50.842Z"}, {"movie_id": 284054, "review_id": "644e95036eecee1f6300f424", "author_rating": 6.0, "review_text": "Pretty good movie. I gave it a 6 because the black panter didn't really do much action in this movie.", "created_at": "2023-04-30T16:19:15.902Z"}, {"movie_id": 284054, "review_id": "5a844e0fc3a36862e100c22f", "author_rating": 7.0, "review_text": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-02-14T14:56:15.274Z"}, {"movie_id": 284054, "review_id": "5a87b8550e0a26535a047632", "author_rating": 1.0, "review_text": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.", "created_at": "2018-02-17T05:06:29.941Z"}, {"movie_id": 284054, "review_id": "5a8894ba0e0a2653db05d34f", "author_rating": 10.0, "review_text": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.", "created_at": "2018-02-17T20:46:50.715Z"}, {"movie_id": 284054, "review_id": "5a8dfdcf0e0a263e6e006d75", "author_rating": null, "review_text": "Really good movie. Good story, lots of fun. This is what DC is missing.", "created_at": "2018-02-21T23:16:31.669Z"}, {"movie_id": 284054, "review_id": "5a93b14b0e0a2616c602de5e", "author_rating": 7.0, "review_text": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.", "created_at": "2018-02-26T07:03:39.064Z"}, {"movie_id": 284054, "review_id": "5ad008f6c3a36842e4004d4d", "author_rating": 9.0, "review_text": "I was really surprised how much I liked this movie.  There was so much going on; immigration concerns; the fight between saving the world and protecting your own country(sound familiar); the fear of an African country’s resources being pillaged; how best to handle the problems black people face worldwide; and many great authentic feeling cultural nods.  All this while not being heavy or preachy.  You can definitely eat popcorn to this.  The villain; Killmonger, is great.  Not great in that he is scary, though he is, but because he is more complex than some shadowy figure you should just trust is a bad guy because of visual effects or dramatic music.  \r\n\r\nThis movie isn’t just explosions and one-liners in an exotic location.  This is a great movie in general.  It’s always interesting.  There are great relationships between all the characters.  Finally; Wakanda is really a place.  It feels alive and lived in; not just impressive buildings used as a backdrop.  They did a wonderful job of worldbuilding; from the rituals, to the clothing, fancy tech, and scenery.  This movie is definitely worth a watch. \r\n\r\n☆☆☆☆-1/2\r\n\r\nI also have to add that; you get to actually see Andy Serkis!  When I saw his name I thought we was going to be some kind of CGI monster.  I’m just happy to see him get actual screen time.", "created_at": "2018-04-13T01:33:42.336Z"}, {"movie_id": 284054, "review_id": "5af0b71092514119a6000099", "author_rating": 7.0, "review_text": "The Black Panther is a fun romp, but it definitely has some issues. First, the good.\r\n\r\nThe action is fun, the emotions hit home, and the story isn't dirt-poor. \r\n\r\nWhile the CGI gets ripped on from time to time, I thought it was solid enough for a Marvel movie. The fight scenes were relatively well-choreographed, as well. The ritual combat scenes were exciting and visually appealing. The fights in Korea were also fun to see, and while I'm not a fan of car chase scenes as a whole, I did enjoy this one. It was reminiscent of a James Bond movie. \r\n\r\nIn fact, that's another appeal, at least to me. The secret technology base and the fun action scenes were a great callback to James Bond-type movies. I do think the movie would have been complemented by giving T'Challa a similar vice as Bond's, although Marvel probably wouldn't veer down that line for the seemingly morally absolute King of Wakanda.\r\n\r\nThe story, well, it's a mixed bag. Everything seemed crammed together with major emotional keys being rushed through or somewhat ignored. The concept is fine though. A long lost relative comes to challenge the new king, wins, and shows his colors, becoming something amoral. The king comes back and takes down the usurper, realizing something about themselves/their kingdom in the process. It's tired, but not so tired it damages the movie. \r\n\r\nThis is where the issues begin to rise, though. The movie is really a movie and a half or two movies crammed into one. Wakanda has a ton of wonderful mythology, but almost none of it is explained. The movie never really explains how the Wakandans used vibranium was used to make themselves wealthy. It touches on it in some exposition, but there was much more that was just glossed over. \r\n\r\nIn addition, W'Kabi became radicalized by Killmonger much too quickly for such a pivotal relationship to flip. Some of the emotional aspects of the movie fell flat because they weren't given enough screen time. \r\n\r\nDespite its flaws, Black Panther is a fun movie that adds to the Marvel Cinematic Universe. It should have been two movies, but I doubt this is the last we'll see of Wakanda.", "created_at": "2018-05-07T20:29:04.388Z"}, {"movie_id": 284054, "review_id": "5b0e0e66c3a368714d000179", "author_rating": 6.0, "review_text": "The character of T'Challa made his debut in Captain America 3: Civil War.\r\n\r\nIn Black Panther, T'Challa returns to his homeland of Wakanda after the death of his father who has been hiding a secret about his brother who lived in the USA. He now inherits the throne after a challenge from a rival.\r\n\r\nWakanda is an african country with wealth, power and immense technology that it hides from the outside world.\r\n\r\nT'Challa's uncle wanted an uprising in the USA. Now his son Killmonger comes to Wakanda and challenges T'Challa for the throne.\r\n\r\nKillmonger wins and leads the struggle for black power.\r\n\r\nBlack Panther is a well made efficient film from Marvel who really have nailed down their formula. The box office avalanche has surprised me. It simply is not that good with a very predictable story.", "created_at": "2018-05-30T02:37:26.128Z"}, {"movie_id": 284054, "review_id": "5b2039f8c3a36814900052f3", "author_rating": 6.0, "review_text": "Overrated due to political correctness; it’s noble and has its points of interest, but it’s also kinda meh\r\n\t\r\nRELEASED IN 2018 and directed by Ryan Coogler, \"Black Panther” details events when T’Challa (Chadwick Boseman) takes over kingship of the hidden African nation Wakanda after his father passes (John Kani). The kingdom is technologically advanced due to its secret resource Vibranium, a priceless, almost magical metal. Unfortunately, T’Challa’s reign is challenged by an angry American former-black ops soldier, Erik “Killmonger” (Michael B. Jordan).\r\n\r\nWith its black director and mostly black cast (with a couple of token white dudes), “Black Panther” was overhyped and overrated upon release. Critics were apparently afraid of being called “racist” by liberal fascists if they dared to be honest and say anything negative (rolling my eyes). The movie’s likable and certainly has its points of interest, but the characters are rather dull, except for Killmonger, and the story isn’t all that involving. It’s basically a mediocre superhero movie that has some blatant Bond-isms and is set apart by its primarily black cast and African locale. It fails to rise to the entertainment level of even “Ant-Man” (2015).\r\n\r\nStill, it’s respectfully noble and the story provokes interesting questions, like isolationism vs. internationalism and African-American culture vs. Native African culture. But there’s some eye-rolling bits, like when Shuri (Letitia Wright) calls CIA agent Ross (Martin Freeman) a “colonizer,” which isn’t even accurate. Maybe it was supposed to be a joke.\r\n\r\nThe waterfall fight between the Black Panther and Killmonger was an homage to the first issue of The Black Panther series in Jungle Action: Issue #6, September, 1973. At the end of that comic’s story T'Challa and Erik fight at the top of a waterfall culminating with Killmonger throwing Black Panther over the cliff. This issue was the beginning of the \"Panther's Rage\" storyline by Don McGregor (featuring artists Billy Graham, Rich Buckler and Gil Kane), which ran for over two years in 13 issues of Jungle Action #6-18 and 209 pages, including the Epilogue. Many consider it the first graphic novel. Of course, this wasn't the first appearance of the Black Panther (who debuted in 1966), but it was the first issue where he was the starring character. \r\n\r\nAnd it was this series that provided the intriguing exposition on T’Challa, Wakanda and its citizens, visitors & enemies. It’s a travesty that McGregor, who created the characters of Killmonger & W’Kabi (Daniel Kaluuya) and conceived this exposition, wasn’t acknowledged in this movie; shameful.\r\n\r\nTHE FILM RUNS 2 hours, 14 minutes and was shot in Georgia (Atlanta, Fayetteville), South Korea (Busan) and Iguazú Waterfalls, Argentina. Ironically, nothing was shot in Africa. WRITERS: Coogler and Joe Robert Cole (and, uncredited, Don McGregor).\r\n\r\nGRADE: B-", "created_at": "2018-06-12T21:24:08.105Z"}, {"movie_id": 284054, "review_id": "5b804c62c3a3687e19012e25", "author_rating": 10.0, "review_text": "Awesome movie", "created_at": "2018-08-24T18:20:18.509Z"}, {"movie_id": 284054, "review_id": "5bf85f999251415cc80f0b3e", "author_rating": 8.0, "review_text": "\"Black Panther is Marvelous (pun intended)\"\r\n\r\nT’Challa (Chadwick Boseman) returns home to his native Wakanda to be crowned king. Not long after he’s challenged for the throne and war looms over his homeland.\r\n\r\nBlack Panther isn’t your typical hero because let’s face it… He’s black. And apart from Bilbo Baggins (Martin Freeman) and Smeagol (Andy Serkis), everybody’s black. And that’s the way it should be.\r\nThe entire cast delivers. Boseman is excellent as king T’Challa who struggles with his new role. It doesn’t get any easierr when Killmonger (Michael B. Jordan) shows up. Killmonger is a mean SOB yet you care for him (some good writing right there). He’s a worthy adversary and one of the better Marvel villains. Jordan portrays him perfectly. Director Ryan Coogler and Michael B. Jordan are a match made in heaven. This is their third collaboration after ‘Fruitvale Station’ and ‘Creed’ and again they’re successful. The movie itself gets better as Jordan’s role gets bigger.\r\n\r\nThe female characters and actors are equally impressive. Especially Nakia (Lupita Nyong’o) and Okoye (Danai Gurira) steal the show.\r\n\r\nThere’s less humour in ‘Black Panther’ than we’re used to seeing in Marvel films but that’s not a bad thing. The movie doesn’t need it.\r\n\r\nThough it’s set in (fictional) Africa there wasn’t any filming done in Africa. Nonetheless the movie looks right. The makers did a great job of creating Wakanda. Huge props to costume designer Ruth E. Carter and composer Ludwig Göransson who help bring Wakanda to life.\r\nOn the downside there’s a lot of CGI. Sometimes it’s too obvious (rhinos say hi). Despite that the battle scenes are beautifully choreographed. Especially Okoye wielding her spear is a thing to behold.\r\n\r\nAll in all ‘Black Panther’ is another wonderful addition to the MCU and we can’t wait to see what role T’Challa and his sidekicks are going to play in ‘Avengers: Infinity War’.", "created_at": "2018-11-23T20:14:17.664Z"}, {"movie_id": 284054, "review_id": "5c8425630e0a26430363757a", "author_rating": 7.0, "review_text": "Black Panther will probably be remembered as a culturally significant film more so than a great one, but that shouldn't take away from the movie's deeper theme of inclusivity. This is a really good movie with heart and intelligence.\r\n\r\nThe fact that I have issues with the pacing, the generic action, or that I don't find Killmonger as complex a villain as the movie thinks is my problem. But I don't understand how people can hate on Black Panther because it integrates social and political themes into its narrative. Isn't contemporary relevance key in determining the greatness of a film?", "created_at": "2019-03-09T20:43:15.661Z"}, {"movie_id": 284054, "review_id": "5ca545850e0a261b89b4d296", "author_rating": 10.0, "review_text": "I really enjoyed this film, it was new uncharted never done before, and they delivered a marvel masterpiece. I look forward to seeing the next one...", "created_at": "2019-04-03T23:45:09.068Z"}, {"movie_id": 284054, "review_id": "5f4d29e5202e1100361ce3b7", "author_rating": null, "review_text": "overhyped before release and overrated after release, Black Panther is nothing more than another paint by numbers MCU movie, with boring characters and a lead that lacks charisma", "created_at": "2020-08-31T16:48:37.675Z"}, {"movie_id": 284054, "review_id": "5f5b56cfe93e950038823008", "author_rating": null, "review_text": "Overall Black Panther was an enjoyable movie, directed by Ryan Coogler. It is one of the biggest movies of 2018, with an outstanding cast who includes Chadwick Boseman and Michael b. jordan, amazing special effects, and a plot that leaves you on the downright edge of your seat for 2 hours and 15 minutes. After the tragic death of chadwick, had a thought about watch his movies and this one comes in my mind. This review is my tribute chadwick. This movie is pg-13, but it seems more 10 and up.  The awesome sci-fi action story about a prince of an utopian country facing the incredible truth about his family, <a href=\"https://paperhelp.nyc/\">paperhelp</a> and the mantle of the black panther, protector of the country Wakanda, was amazing, and fits in with the mcu series perfectly. I reccomend that you watch Captain america:civil war first, as it would make some elements more understandable If you like superhero action movies, fantasy, or science fiction, come see this awesome movie.", "created_at": "2020-09-11T10:51:59.010Z"}, {"movie_id": 284054, "review_id": "600b51f7cc277c003f1425ea", "author_rating": 8.0, "review_text": "Enjoyed that!\r\n\r\n<em>'Black Panther'</em>, the 18th MCU film, is very good. I really like the world building of Wakanda, as well as the cinematography and costume design. The cast are, as expected, excellent as well.\r\n\r\nChadwick Boseman is terrific as T'Challa, as I knew he would be based on the glimpse we see of him in 2016's <em>'Captain America: Civil War'</em>. He is the best actor here, but Danai Gurira runs him close. I'm a huge fan of Gurira's due to her performances in <em>'The Walking Dead'</em> so knew I'd rate her here too, she's fun to watch - it's cool to see her weapon-wielding once again.\r\n\r\nElsewhere, Lupita Nyong'o is good and so is Letitia Wright; she's great in 2015's <em>'Urban Hymn'</em>, which I had seen her in previously. It's a fairly stacked cast, with the likes of Forest Whitaker, Andy Serkis, Daniel Kaluuya and Michael B. Jordan also appearing; Jordan's character isn't the best, but he himself is more than solid.", "created_at": "2021-01-22T22:30:15.886Z"}, {"movie_id": 284054, "review_id": "636dec40f14dad008399e519", "author_rating": 7.0, "review_text": "This is quite a tough film to review objectively; at times it is as good as any from the comic-book universe; the cinematography and effects are top drawer and the pace of the action is usually well judged and enjoyable. The writing and the acting, on the other hand, are a different matter. Chadwick Boseman as \"T'Challa\" is about as wooden as they come as he returns to rule his outwardly agrarian African nation (\"Wakanda\") that secretly has some state-of-the art kit based around a rare, but enormously powerful mineral from outer space. In this particular outing he isn't much helped by Martin Freeman (\"Agent Ross\") or Forest Whitaker as the sagely \"Zuri\". Letitia Wright injects some charm as his tech-savvy little sister \"Shuri\" and for a bit at the beginning, Andy Serkis hams up nicely as South African arch villain \"Ulysses Klaue\" (pronounced claw) but once it settles down, it becomes a beautifully shot but rather bland, simplistic right vs wrong, do the right thing type of story. I do like Michael B. Jordan (\"Erik\") - here he has a screen presence that is charming, cheeky and he knows how to work an audience - and I have to say I was on his side pretty much from the outset, but sadly though, the ending is never in doubt and with neither suspense nor jeopardy to sustain it's initial promise, \"Black Panther\" just ends up being a great looking, but pretty shallow festival of colour and CGI.", "created_at": "2022-11-11T06:31:28.093Z"}, {"movie_id": 284054, "review_id": "6378f021fab3fa007fbeee6c", "author_rating": 8.0, "review_text": "I was hoping to see black revolution all over the world with cool weapons from Wakanda. Sadly that didn't happen, all weapons were destroyed before they were able to leave Wakanda", "created_at": "2022-11-19T15:02:57.369Z"}, {"movie_id": 284054, "review_id": "63c025d905a5330085a4746a", "author_rating": 8.0, "review_text": "Black Panther is a groundbreaking film that stands out among its comic book movie counterparts. With a nearly all-black cast and a unique visual experience, the film takes audiences to the technologically advanced African nation of Wakanda. The story follows T'Challa, who becomes the new Black Panther and king of Wakanda after his father's assassination, as he fights to secure the safety of his nation against the threat of Ulysses Klaue and Killmonger, an evil and ruthless enemy. The film is well-acted, visually stunning, and carries a unique and powerful message about heritage and tradition. The cast, led by Chadwick Boseman as T'Challa, delivers strong performances, and the women of Wakanda, played by Lupita Nyong'o, Danai Gurira, and Angela Bassett, are particularly fierce and impressive. Despite some inconsistencies in the CGI, the film's contained narrative and emphasis on character development make it an important, entertaining, and enjoyable movie.\r\n__________________________\r\nBlack Panther es una película innovadora que se destaca entre sus contrapartes de películas de cómics. Con un elenco casi completamente negro y una experiencia visual única, la película lleva al público a la nación africana tecnológicamente avanzada de Wakanda. La historia sigue a T'Challa, quien se convierte en el nuevo Pantera Negra y rey de Wakanda después del asesinato de su padre, mientras lucha para garantizar la seguridad de su nación contra la amenaza de Ulysses Klaue y Killmonger, un enemigo malvado y despiadado. La película está bien actuada, visualmente impresionante y transmite un mensaje único y poderoso sobre el patrimonio y la tradición. El elenco, encabezado por Chadwick Boseman como T'Challa, ofrece actuaciones sólidas, y las mujeres de Wakanda, interpretadas por Lupita Nyong'o, Danai Gurira y Angela Bassett, son particularmente feroces e impresionantes. A pesar de algunas inconsistencias en el CGI, la narración contenida de la película y el énfasis en el desarrollo del personaje la convierten en una película importante, entretenida y agradable.", "created_at": "2023-01-12T15:23:05.346Z"}, {"movie_id": 284054, "review_id": "63c2107f8efe7300c83fe486", "author_rating": 1.0, "review_text": "I could go on and on, or I can simplify it into two points.\r\n\r\n1: I liked it better when they called it Skyfall\r\n\r\n... and... \r\n\r\n2: I liked it better when they called it \"The Phantom Menace.\"\r\n\r\nMerging the two didn't work, no one in their right mind would actually rip that much of a film with The Phantom Menace's reaction from fans. \r\n\r\nBut despite that, and a lot of other points people have covered to death, you have to like it... because they say you do.", "created_at": "2023-01-14T02:16:31.969Z"}, {"movie_id": 284054, "review_id": "63e72e9a63aad200e05c8150", "author_rating": 6.0, "review_text": "**Black Panther is a good and solid entry in the MCU, but I feel like it could have been even better.**\r\n\r\nBlack Panther was a solid sup hero film with amazing characters, immaculate costumes, and an excellent cast. But I struggled with the plot giving greater focus to the villain and all the supporting cast and sidelining the Black Panther himself. After his introduction in Captain America: Civil War, little was known about this mysterious character, and while this movie introduced us to his world, it didn’t develop T’Challa as much as I had hoped. Now I know it is nitpicking, but after so many excellent standalone MCU films, I had hoped for even more for this character. That said, Chadwick Boseman plays T’Challa with incredible power and strength. In addition, Michael B. Jordan’s Killmonger was an intriguing villain. But my favorite parts of the film were any scenes with Winston Duke or Andy Serkis. They were hilarious and stole the show. Black Panther was a standout in many ways, but I still wanted more opportunities to learn more about T’Challa’s character and develop him further.", "created_at": "2023-02-11T05:58:50.842Z"}, {"movie_id": 284054, "review_id": "644e95036eecee1f6300f424", "author_rating": 6.0, "review_text": "Pretty good movie. I gave it a 6 because the black panter didn't really do much action in this movie.", "created_at": "2023-04-30T16:19:15.902Z"}]