[{"movie_id": 263115, "review_id": "58bbf107c3a368666b032be5", "author_rating": null, "review_text": "**LOGAN REVIEW: THE WOLVERINE GETS A SUPER SEND-OFF**\r\n\r\n\"Owing to its agitated hero’s misfortunes through the ages, this is a film that’s acutely aware of the dangers of emotional exploitation, and it spares its audience a similar fate. With Logan, Mangold and co-writer Scott Frank tell the definitive story of the Wolverine, in an involving and deeply satisfying series finale. It shows the fate of mutants when age starts to weary them, with stakes that feel real, and empathy that’s earned.\"\r\n\r\nREAD THE FULL REVIEW AT SBS MOVIES: http://www.sbs.com.au/movies/review/logan-review-wolverine-gets-super-send", "created_at": "2017-03-05T11:05:43.219Z"}, {"movie_id": 263115, "review_id": "58c34453925141239c000e72", "author_rating": 4.0, "review_text": "There may be some fine performances in this movie, but I honestly think the critics overrated this latest entry in the X-Men saga. The performances of Wolverine and Prof. X by Hugh Jackman and Patrick Stewart are extraordinary. They create a believable and loving father-son bond between their characters, with Logan caring for the ninety year old leader of the X-Men after a horrible event occurs at the Xavier school the year before. Stephen Merchant takes over the role of Caliban from Tómas Lemarquis, who played the character in X-Men Apocalypse, and transforms him into an ally to Logan and Charlies. Merchant is quite good in the role. But what really dragged down the movie is its nihilism. The other X-Men are completely missing from the film and mutants have been wiped out almost completely. A sense of doom and hopelessness looms over the film. This movie completely upends the warm and hopeful epilogue of Days of Future Past, where the X-Men were restored to life and glory and mutants weren't extinct after all. Death seems to stalk Logan and Charles wherever they go. There is also a conspicuous lack of significant female characters in this movie, too. The only female of note is Laura/ X-23, and she spends most of the film mute. There is also a complete lack of any strong or memorable villains. No one ever reaches the level of greatness like other X-Men villains such as Magneto or William Stryker. So, despite some good performances, this film is a bit overrated and also a little too bleak and depressing for my taste.", "created_at": "2017-03-11T00:26:59.874Z"}, {"movie_id": 263115, "review_id": "58e21cbb925141281900a93d", "author_rating": 8.0, "review_text": "One of the best and most mature Marvel movies to date.\r\n\r\nThe first half of this movie is a huge delight and a huge thrill. Hugh Jackman and Patrick Stewart are so entertaining to watch as characters they've known for 17 years. They've taken their characters a step further here in a script that allows them to explore themselves emotionally more than ever before. This movie is strictly part-drama. Yes, that's right. Finally, a Marvel superhero movie you can confidently stamp the drama genre tag on.\r\n\r\nThe effects, stunts and gore are really quite shocking. You can really feel the weight of each character's immense power, and more importantly, the struggles that come along with them. This further fleshes out each character.\r\n\r\nThe movie starts to lose the enjoyability of its ensemble halfway through, and what happens after is what you might expect from a typical X-Men film. Action, sci-fi and more action/sci-fi. The villains are as interesting as they can be I suppose. They lack much development but are there to fuel the real story. Anyway, I can't say much else without spoiling the plot. I'll just say that I wish the movie would have taken a different direction.", "created_at": "2017-04-03T09:58:19.780Z"}, {"movie_id": 263115, "review_id": "58e3b3c8925141281901f557", "author_rating": 8.0, "review_text": "If you don't like superhero movies, this is the superhero movie for you. And if you do like superhero movies? Watch _Logan_ anyway. It's bloody brilliant.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-04-04T14:55:04.326Z"}, {"movie_id": 263115, "review_id": "595e87569251410bfa090ffb", "author_rating": null, "review_text": "**** This review may contain spoilers ****\r\n\r\nWe finally get the Wolverine we have been asking for, for the past 15 years and it's his last time. Well, I guess he couldn't have ended it in any better way as a last farewell to the fans and his signature role. Not only that but it looks like this one blows all the other superhero movies out of the water.", "created_at": "2017-07-06T18:54:14.939Z"}, {"movie_id": 263115, "review_id": "596794dd92514132e1003e64", "author_rating": 7.0, "review_text": "**A farewell and a welcome!**\r\n\r\nA perfect farewell to the only mutant who had solo films in 'X-Men' franchise. I never understood 'X-Men', I thought it was the worst superhero film series I've ever seen. But 'Wolverine' was the only reason I watched them all and particular, Hugh Jackman. There won't be Logan now onwards, though a set of new generation welcomed in this film, while saying goodbye to the old guys. So now what happens in the future of this franchise is a very suspense. Yet Logan had been the precious gem in the crown of 'X-Men', that mean it won't be the same anymore.\r\n\r\nAfter many years passed in the future, the last survivours of mutants hiding their identity and living among the humans. Logan and two others were attacked by the armed men when he decided to help a child mutant. Running away from them and looking for a place where they can be safe prioritised in the narration. More dramatised film in the franchise, but there are enough actions those who desire for that.\r\n\r\nIt's an emotional time for the hardcore fans of Logan/Hugh Jachman. One final great performance by him and the little kid was also good. A well shot film, with minimum graphics and more realistic stunt sequences. Well, not all were real, too strong fights, too bloody, despite having a child actor in it. Yeah, it is a good film, I liked it, but not a masterpiece as you might have heard of. But anyway, it is a must see for the 'Wolverine' fans.\r\n\r\n_7/10_", "created_at": "2017-07-13T15:42:21.790Z"}, {"movie_id": 263115, "review_id": "5971f2c5c3a3684bfc007502", "author_rating": 4.0, "review_text": "I believe that I am about to disagree with quite a few people now. You see, I did not like this movie.\r\n\r\nNot that this came as much of a surprise to me. What I got was pretty much what I expected. From a technical point of view the movie is quite well done. Hugh Jackman and Patrick Stewart are doing good jobs as always. The action scenes are good. The cinematography is not at all bad. If you are into tragic drama and do not mind the super hero twist of the movie then this is a movie for you. The technical qualities is why this movie gets any stars at all from me. If I would judge it by story only then it would have gotten zero, null, nada, nicths, rien, ingenting.\r\n\r\nFor me it was depressing, boring and not at all fun to watch. The only reason I watched it is because I, as a X-Men fan, simply had to watch it as well as having it in my collection but I would have been happier it this movie had never been made.\r\n\r\nWolverine is more or less an unpleasant drinking bum clad in filthy ragged clothes. Professor X is half insane and apparently dangerous to himself and the people around him. We get absolutely no explanation as to how this sad state of affairs.\r\n\r\nThe entire movie is dark in spirit with the X-Men all but died out and Wolverine and Professor X just waiting to die. Then in comes this female child who later turns out to be a female version of Wolverine. She pretty much lacks any form of charisma and she and Wolverine spends almost the entire time in a state of conflict, much due to Wolverine who seems to think everyone should go fuck themselves so that he can continue to self destruct.\r\n\r\nThe bad guys are the usual evil corporation doing experiments on X-Men, genetics etc. Supposedly they were behind the almost extermination of X-Men but of course they keep their own little army of “enhanced” humans that doggedly harasses Wolverine & Co. There are some nice action sequences but there is really no good overall boss. No one with enough Charisma to take the role of the main adversary unless you count X-24 who only took part in a few parts of the movie.\r\n\r\nBy the way, why the fuck do Wolverine, Laura as well as X-24 have to grunt like horny monkeys when they fight?\r\n\r\nThe story is rather predictable with no major surprises, little depth and low on logic. A typical Hollywood drama. Not really anything to write home about.\r\n\r\nThe movie is just so depressing from start to finish. As a last farewell to Wolverine and Professor X it is almost insulting. I know a lot of people seem to like it but I cannot understand why. At least not if you are a X-Men fan.", "created_at": "2017-07-21T12:25:41.859Z"}, {"movie_id": 263115, "review_id": "5985a90c92514143810200ed", "author_rating": 10.0, "review_text": "The Last Cut Is The Deepest!\r\n\r\nDid we need another X-Men movie? In fact did we need another Wolverine movie? Well the result is there for all to see, with Logan not only showing itself to be undoubtedly the best Wolverine venture by far, but arguably the best X-Men picture as well. If, as expected (and surely to god it's hoped so), this is the last we see of the grumpy metal clawed superhero, then what a fitting and triumphant bow out it is.\r\n\r\nJames Mangold, the director, has managed to create an adult superhero movie without it really being a superhero pic, for he has created a film noir Western that happens to be about a superhero. Mangold's love of noir and Westerns bursts from the screen, which for those who follow those wonderful stands of cinema, will come as no surprise having seen with notice his Copland and 3:10 To Yuma redux. There's a perpetual grimness to the narrative that belies the quite often stunning surrounding locales, heavy themes such as men out of time - with destinies written (cue a deft comic book movie within a comic book chunk of metaphysics) - surrogates, mental illness, human ignorance, and on it goes, the narrative strong on intelligence as much as it is in wrought emotion. Western fans will also be buoyed by the part that the 1953 classic Western Shane has to play in things, considerably so as its importance narratively, orally and visually is mightily strong.\r\n\r\nLogan's Run!\r\n\r\nAh yes, well being \"adult\" is all well and good, but is Logan thrilling? Do we get pumped up Wolverine action, blood brains, splatter and mucho muscle flexing and pained roars of anger? Oh yes! Action from the off is never far away, and wonderfully staged and choreographed it is. Lots of memorable set-pieces, while also some cleverly constructed sequences such as Xavier's mind seizures hold court and enthral. Yet the kicker with all that is we are clued in to the emotional baggage that the side-burn sporting protag carries with him. With each fight we sense the bigger picture, even as we watch in awe the emergence of Laura (ironic film noir name right there as it happens) - and her part in this very \"human\" story - the thrills and spills are propelled by a meaningful but battered heart.\r\n\r\nTech credits are superb. Acting honours go to Jackman, who after giving 17 years of his life to the character, gives it his all and this multi faceted performance, in a perfect world, deserves Oscar recognition. Patrick Stewart, also, is immense, playing the nonagenarian Charles Xavier with such class, gracefulness and storming emotion that one can only admire. Film debutante Dafne Keen as Laura is utterly engrossing, quite a debut indeed, whilst Stephen Merchant as albino mutant tracker Caliban is effective to the point we hanker for more. Although the villains fronted by Boyd Holbrook (rote henchman leader) and Richard E. Grant (smarmy scientist git) just about pass muster, there's nothing to damage the piece. Cinematography (John Mathieson) is \"A\" grade, the filters set on neo-noir, with the splendid film noir black and white version a fillip for the heart of noir lovers. All that is left is for the sound mix to boom and the director to steer with heart, brain and soul, without doubt both come up trumps.\r\n\r\nOne of 2017s best films, a genre splicer that ticks all the boxes of great film making. 10/10", "created_at": "2017-08-05T11:16:28.016Z"}, {"movie_id": 263115, "review_id": "6257b53fa6fdaa00682c5b81", "author_rating": 7.0, "review_text": "All but exhausted after years of fighting and hiding, \"Logan\" (Hugh Jackman) just wants a peaceful life. Aside from the occasional trip to Mexico to help the sun-shy \"Caliban\" (Stephen Merchant) with his medication, it's all pretty routine and low-key. That is, until \"Laura\" (Dafne Keen) pays him visit - and she has a mutation just like his. Who is she? Of course, she doesn't come alone. \"Pierce\" (Boyd Holbrook) has been charged by scientist \"Rice\" (Richard E. Grant) to track her down and capture her. It now falls to our eponymous hero to fend them off and get her to safety. What follows now are several highly polished, but frankly repetitive, escapades as their enemies close in. Sure, the effects are great and the production quality is top drawer, but the flaw with someone who has (albeit limited, by this stage) self healing powers is that the same, or slightly tweaked, scenarios happening over and over again start to get a bit dull after a while. Jackman looks as tired with the role as his character is with the relentlessness of his existence and though quite easy on the eye, Holbrook isn't up to much (I kept thinking he was Charlie Hunnam). I was never the biggest fan of this franchise once they split it out to follow \"Wolverine\". Jackman is an hugely charismatic actor but his character isn't remotely sophisticated and though there is some humour to be found, for the most part I found this an action-packed but pretty long and unremarkable piece of cinema.", "created_at": "2022-04-14T05:46:39.880Z"}, {"movie_id": 263115, "review_id": "63e709f0a2e60200932955fe", "author_rating": 7.0, "review_text": "**Logan tones down the effects and scale to focus on the emotion and pain of its characters, making it one of the best films in the X-Men saga.**\r\n\r\nJames Mangold strikes again! Logan is considered by many to be one of the greatest superhero films ever made. While I don’t feel as strongly as many about this film, its quality is undeniable. Jackman and Stewart’s performances were the best of the franchise. The story adapts the Old Man Logan comic to depict an aged weary Wolverine that is more jaded and bitter than ever. This new world where the X-Men have all perished or disappeared is more dangerous than ever for mutants. But Logan’s heart is slowly restored by a young girl on the run that seems destined to follow in his footsteps unless he finds a way to give her a new future and hope. Mangold’s vision and directing fill the film with emotion and pain. Logan’s suffering and hopelessness are tangible and felt in every moment of the film. While I missed the vibe and characters of the other X-Men movie, Logan was an excellent film that gave a meaningful conclusion to Wolverine’s long and heartbreaking journey.", "created_at": "2023-02-11T03:22:24.543Z"}, {"movie_id": 263115, "review_id": "58bbf107c3a368666b032be5", "author_rating": null, "review_text": "**LOGAN REVIEW: THE WOLVERINE GETS A SUPER SEND-OFF**\r\n\r\n\"Owing to its agitated hero’s misfortunes through the ages, this is a film that’s acutely aware of the dangers of emotional exploitation, and it spares its audience a similar fate. With Logan, Mangold and co-writer Scott Frank tell the definitive story of the Wolverine, in an involving and deeply satisfying series finale. It shows the fate of mutants when age starts to weary them, with stakes that feel real, and empathy that’s earned.\"\r\n\r\nREAD THE FULL REVIEW AT SBS MOVIES: http://www.sbs.com.au/movies/review/logan-review-wolverine-gets-super-send", "created_at": "2017-03-05T11:05:43.219Z"}, {"movie_id": 263115, "review_id": "58c34453925141239c000e72", "author_rating": 4.0, "review_text": "There may be some fine performances in this movie, but I honestly think the critics overrated this latest entry in the X-Men saga. The performances of Wolverine and Prof. X by Hugh Jackman and Patrick Stewart are extraordinary. They create a believable and loving father-son bond between their characters, with Logan caring for the ninety year old leader of the X-Men after a horrible event occurs at the Xavier school the year before. Stephen Merchant takes over the role of Caliban from Tómas Lemarquis, who played the character in X-Men Apocalypse, and transforms him into an ally to Logan and Charlies. Merchant is quite good in the role. But what really dragged down the movie is its nihilism. The other X-Men are completely missing from the film and mutants have been wiped out almost completely. A sense of doom and hopelessness looms over the film. This movie completely upends the warm and hopeful epilogue of Days of Future Past, where the X-Men were restored to life and glory and mutants weren't extinct after all. Death seems to stalk Logan and Charles wherever they go. There is also a conspicuous lack of significant female characters in this movie, too. The only female of note is Laura/ X-23, and she spends most of the film mute. There is also a complete lack of any strong or memorable villains. No one ever reaches the level of greatness like other X-Men villains such as Magneto or William Stryker. So, despite some good performances, this film is a bit overrated and also a little too bleak and depressing for my taste.", "created_at": "2017-03-11T00:26:59.874Z"}, {"movie_id": 263115, "review_id": "58e21cbb925141281900a93d", "author_rating": 8.0, "review_text": "One of the best and most mature Marvel movies to date.\r\n\r\nThe first half of this movie is a huge delight and a huge thrill. Hugh Jackman and Patrick Stewart are so entertaining to watch as characters they've known for 17 years. They've taken their characters a step further here in a script that allows them to explore themselves emotionally more than ever before. This movie is strictly part-drama. Yes, that's right. Finally, a Marvel superhero movie you can confidently stamp the drama genre tag on.\r\n\r\nThe effects, stunts and gore are really quite shocking. You can really feel the weight of each character's immense power, and more importantly, the struggles that come along with them. This further fleshes out each character.\r\n\r\nThe movie starts to lose the enjoyability of its ensemble halfway through, and what happens after is what you might expect from a typical X-Men film. Action, sci-fi and more action/sci-fi. The villains are as interesting as they can be I suppose. They lack much development but are there to fuel the real story. Anyway, I can't say much else without spoiling the plot. I'll just say that I wish the movie would have taken a different direction.", "created_at": "2017-04-03T09:58:19.780Z"}, {"movie_id": 263115, "review_id": "58e3b3c8925141281901f557", "author_rating": 8.0, "review_text": "If you don't like superhero movies, this is the superhero movie for you. And if you do like superhero movies? Watch _Logan_ anyway. It's bloody brilliant.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-04-04T14:55:04.326Z"}, {"movie_id": 263115, "review_id": "595e87569251410bfa090ffb", "author_rating": null, "review_text": "**** This review may contain spoilers ****\r\n\r\nWe finally get the Wolverine we have been asking for, for the past 15 years and it's his last time. Well, I guess he couldn't have ended it in any better way as a last farewell to the fans and his signature role. Not only that but it looks like this one blows all the other superhero movies out of the water.", "created_at": "2017-07-06T18:54:14.939Z"}, {"movie_id": 263115, "review_id": "596794dd92514132e1003e64", "author_rating": 7.0, "review_text": "**A farewell and a welcome!**\r\n\r\nA perfect farewell to the only mutant who had solo films in 'X-Men' franchise. I never understood 'X-Men', I thought it was the worst superhero film series I've ever seen. But 'Wolverine' was the only reason I watched them all and particular, Hugh Jackman. There won't be Logan now onwards, though a set of new generation welcomed in this film, while saying goodbye to the old guys. So now what happens in the future of this franchise is a very suspense. Yet Logan had been the precious gem in the crown of 'X-Men', that mean it won't be the same anymore.\r\n\r\nAfter many years passed in the future, the last survivours of mutants hiding their identity and living among the humans. Logan and two others were attacked by the armed men when he decided to help a child mutant. Running away from them and looking for a place where they can be safe prioritised in the narration. More dramatised film in the franchise, but there are enough actions those who desire for that.\r\n\r\nIt's an emotional time for the hardcore fans of Logan/Hugh Jachman. One final great performance by him and the little kid was also good. A well shot film, with minimum graphics and more realistic stunt sequences. Well, not all were real, too strong fights, too bloody, despite having a child actor in it. Yeah, it is a good film, I liked it, but not a masterpiece as you might have heard of. But anyway, it is a must see for the 'Wolverine' fans.\r\n\r\n_7/10_", "created_at": "2017-07-13T15:42:21.790Z"}, {"movie_id": 263115, "review_id": "5971f2c5c3a3684bfc007502", "author_rating": 4.0, "review_text": "I believe that I am about to disagree with quite a few people now. You see, I did not like this movie.\r\n\r\nNot that this came as much of a surprise to me. What I got was pretty much what I expected. From a technical point of view the movie is quite well done. Hugh Jackman and Patrick Stewart are doing good jobs as always. The action scenes are good. The cinematography is not at all bad. If you are into tragic drama and do not mind the super hero twist of the movie then this is a movie for you. The technical qualities is why this movie gets any stars at all from me. If I would judge it by story only then it would have gotten zero, null, nada, nicths, rien, ingenting.\r\n\r\nFor me it was depressing, boring and not at all fun to watch. The only reason I watched it is because I, as a X-Men fan, simply had to watch it as well as having it in my collection but I would have been happier it this movie had never been made.\r\n\r\nWolverine is more or less an unpleasant drinking bum clad in filthy ragged clothes. Professor X is half insane and apparently dangerous to himself and the people around him. We get absolutely no explanation as to how this sad state of affairs.\r\n\r\nThe entire movie is dark in spirit with the X-Men all but died out and Wolverine and Professor X just waiting to die. Then in comes this female child who later turns out to be a female version of Wolverine. She pretty much lacks any form of charisma and she and Wolverine spends almost the entire time in a state of conflict, much due to Wolverine who seems to think everyone should go fuck themselves so that he can continue to self destruct.\r\n\r\nThe bad guys are the usual evil corporation doing experiments on X-Men, genetics etc. Supposedly they were behind the almost extermination of X-Men but of course they keep their own little army of “enhanced” humans that doggedly harasses Wolverine & Co. There are some nice action sequences but there is really no good overall boss. No one with enough Charisma to take the role of the main adversary unless you count X-24 who only took part in a few parts of the movie.\r\n\r\nBy the way, why the fuck do Wolverine, Laura as well as X-24 have to grunt like horny monkeys when they fight?\r\n\r\nThe story is rather predictable with no major surprises, little depth and low on logic. A typical Hollywood drama. Not really anything to write home about.\r\n\r\nThe movie is just so depressing from start to finish. As a last farewell to Wolverine and Professor X it is almost insulting. I know a lot of people seem to like it but I cannot understand why. At least not if you are a X-Men fan.", "created_at": "2017-07-21T12:25:41.859Z"}, {"movie_id": 263115, "review_id": "5985a90c92514143810200ed", "author_rating": 10.0, "review_text": "The Last Cut Is The Deepest!\r\n\r\nDid we need another X-Men movie? In fact did we need another Wolverine movie? Well the result is there for all to see, with Logan not only showing itself to be undoubtedly the best Wolverine venture by far, but arguably the best X-Men picture as well. If, as expected (and surely to god it's hoped so), this is the last we see of the grumpy metal clawed superhero, then what a fitting and triumphant bow out it is.\r\n\r\nJames Mangold, the director, has managed to create an adult superhero movie without it really being a superhero pic, for he has created a film noir Western that happens to be about a superhero. Mangold's love of noir and Westerns bursts from the screen, which for those who follow those wonderful stands of cinema, will come as no surprise having seen with notice his Copland and 3:10 To Yuma redux. There's a perpetual grimness to the narrative that belies the quite often stunning surrounding locales, heavy themes such as men out of time - with destinies written (cue a deft comic book movie within a comic book chunk of metaphysics) - surrogates, mental illness, human ignorance, and on it goes, the narrative strong on intelligence as much as it is in wrought emotion. Western fans will also be buoyed by the part that the 1953 classic Western Shane has to play in things, considerably so as its importance narratively, orally and visually is mightily strong.\r\n\r\nLogan's Run!\r\n\r\nAh yes, well being \"adult\" is all well and good, but is Logan thrilling? Do we get pumped up Wolverine action, blood brains, splatter and mucho muscle flexing and pained roars of anger? Oh yes! Action from the off is never far away, and wonderfully staged and choreographed it is. Lots of memorable set-pieces, while also some cleverly constructed sequences such as Xavier's mind seizures hold court and enthral. Yet the kicker with all that is we are clued in to the emotional baggage that the side-burn sporting protag carries with him. With each fight we sense the bigger picture, even as we watch in awe the emergence of Laura (ironic film noir name right there as it happens) - and her part in this very \"human\" story - the thrills and spills are propelled by a meaningful but battered heart.\r\n\r\nTech credits are superb. Acting honours go to Jackman, who after giving 17 years of his life to the character, gives it his all and this multi faceted performance, in a perfect world, deserves Oscar recognition. Patrick Stewart, also, is immense, playing the nonagenarian Charles Xavier with such class, gracefulness and storming emotion that one can only admire. Film debutante Dafne Keen as Laura is utterly engrossing, quite a debut indeed, whilst Stephen Merchant as albino mutant tracker Caliban is effective to the point we hanker for more. Although the villains fronted by Boyd Holbrook (rote henchman leader) and Richard E. Grant (smarmy scientist git) just about pass muster, there's nothing to damage the piece. Cinematography (John Mathieson) is \"A\" grade, the filters set on neo-noir, with the splendid film noir black and white version a fillip for the heart of noir lovers. All that is left is for the sound mix to boom and the director to steer with heart, brain and soul, without doubt both come up trumps.\r\n\r\nOne of 2017s best films, a genre splicer that ticks all the boxes of great film making. 10/10", "created_at": "2017-08-05T11:16:28.016Z"}, {"movie_id": 263115, "review_id": "6257b53fa6fdaa00682c5b81", "author_rating": 7.0, "review_text": "All but exhausted after years of fighting and hiding, \"Logan\" (Hugh Jackman) just wants a peaceful life. Aside from the occasional trip to Mexico to help the sun-shy \"Caliban\" (Stephen Merchant) with his medication, it's all pretty routine and low-key. That is, until \"Laura\" (Dafne Keen) pays him visit - and she has a mutation just like his. Who is she? Of course, she doesn't come alone. \"Pierce\" (Boyd Holbrook) has been charged by scientist \"Rice\" (Richard E. Grant) to track her down and capture her. It now falls to our eponymous hero to fend them off and get her to safety. What follows now are several highly polished, but frankly repetitive, escapades as their enemies close in. Sure, the effects are great and the production quality is top drawer, but the flaw with someone who has (albeit limited, by this stage) self healing powers is that the same, or slightly tweaked, scenarios happening over and over again start to get a bit dull after a while. Jackman looks as tired with the role as his character is with the relentlessness of his existence and though quite easy on the eye, Holbrook isn't up to much (I kept thinking he was Charlie Hunnam). I was never the biggest fan of this franchise once they split it out to follow \"Wolverine\". Jackman is an hugely charismatic actor but his character isn't remotely sophisticated and though there is some humour to be found, for the most part I found this an action-packed but pretty long and unremarkable piece of cinema.", "created_at": "2022-04-14T05:46:39.880Z"}, {"movie_id": 263115, "review_id": "63e709f0a2e60200932955fe", "author_rating": 7.0, "review_text": "**Logan tones down the effects and scale to focus on the emotion and pain of its characters, making it one of the best films in the X-Men saga.**\r\n\r\nJames Mangold strikes again! Logan is considered by many to be one of the greatest superhero films ever made. While I don’t feel as strongly as many about this film, its quality is undeniable. Jackman and Stewart’s performances were the best of the franchise. The story adapts the Old Man Logan comic to depict an aged weary Wolverine that is more jaded and bitter than ever. This new world where the X-Men have all perished or disappeared is more dangerous than ever for mutants. But Logan’s heart is slowly restored by a young girl on the run that seems destined to follow in his footsteps unless he finds a way to give her a new future and hope. Mangold’s vision and directing fill the film with emotion and pain. Logan’s suffering and hopelessness are tangible and felt in every moment of the film. While I missed the vibe and characters of the other X-Men movie, Logan was an excellent film that gave a meaningful conclusion to Wolverine’s long and heartbreaking journey.", "created_at": "2023-02-11T03:22:24.543Z"}, {"movie_id": 263115, "review_id": "58bbf107c3a368666b032be5", "author_rating": null, "review_text": "**LOGAN REVIEW: THE WOLVERINE GETS A SUPER SEND-OFF**\r\n\r\n\"Owing to its agitated hero’s misfortunes through the ages, this is a film that’s acutely aware of the dangers of emotional exploitation, and it spares its audience a similar fate. With Logan, Mangold and co-writer Scott Frank tell the definitive story of the Wolverine, in an involving and deeply satisfying series finale. It shows the fate of mutants when age starts to weary them, with stakes that feel real, and empathy that’s earned.\"\r\n\r\nREAD THE FULL REVIEW AT SBS MOVIES: http://www.sbs.com.au/movies/review/logan-review-wolverine-gets-super-send", "created_at": "2017-03-05T11:05:43.219Z"}, {"movie_id": 263115, "review_id": "58c34453925141239c000e72", "author_rating": 4.0, "review_text": "There may be some fine performances in this movie, but I honestly think the critics overrated this latest entry in the X-Men saga. The performances of Wolverine and Prof. X by Hugh Jackman and Patrick Stewart are extraordinary. They create a believable and loving father-son bond between their characters, with Logan caring for the ninety year old leader of the X-Men after a horrible event occurs at the Xavier school the year before. Stephen Merchant takes over the role of Caliban from Tómas Lemarquis, who played the character in X-Men Apocalypse, and transforms him into an ally to Logan and Charlies. Merchant is quite good in the role. But what really dragged down the movie is its nihilism. The other X-Men are completely missing from the film and mutants have been wiped out almost completely. A sense of doom and hopelessness looms over the film. This movie completely upends the warm and hopeful epilogue of Days of Future Past, where the X-Men were restored to life and glory and mutants weren't extinct after all. Death seems to stalk Logan and Charles wherever they go. There is also a conspicuous lack of significant female characters in this movie, too. The only female of note is Laura/ X-23, and she spends most of the film mute. There is also a complete lack of any strong or memorable villains. No one ever reaches the level of greatness like other X-Men villains such as Magneto or William Stryker. So, despite some good performances, this film is a bit overrated and also a little too bleak and depressing for my taste.", "created_at": "2017-03-11T00:26:59.874Z"}, {"movie_id": 263115, "review_id": "58e21cbb925141281900a93d", "author_rating": 8.0, "review_text": "One of the best and most mature Marvel movies to date.\r\n\r\nThe first half of this movie is a huge delight and a huge thrill. Hugh Jackman and Patrick Stewart are so entertaining to watch as characters they've known for 17 years. They've taken their characters a step further here in a script that allows them to explore themselves emotionally more than ever before. This movie is strictly part-drama. Yes, that's right. Finally, a Marvel superhero movie you can confidently stamp the drama genre tag on.\r\n\r\nThe effects, stunts and gore are really quite shocking. You can really feel the weight of each character's immense power, and more importantly, the struggles that come along with them. This further fleshes out each character.\r\n\r\nThe movie starts to lose the enjoyability of its ensemble halfway through, and what happens after is what you might expect from a typical X-Men film. Action, sci-fi and more action/sci-fi. The villains are as interesting as they can be I suppose. They lack much development but are there to fuel the real story. Anyway, I can't say much else without spoiling the plot. I'll just say that I wish the movie would have taken a different direction.", "created_at": "2017-04-03T09:58:19.780Z"}, {"movie_id": 263115, "review_id": "58e3b3c8925141281901f557", "author_rating": 8.0, "review_text": "If you don't like superhero movies, this is the superhero movie for you. And if you do like superhero movies? Watch _Logan_ anyway. It's bloody brilliant.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-04-04T14:55:04.326Z"}, {"movie_id": 263115, "review_id": "595e87569251410bfa090ffb", "author_rating": null, "review_text": "**** This review may contain spoilers ****\r\n\r\nWe finally get the Wolverine we have been asking for, for the past 15 years and it's his last time. Well, I guess he couldn't have ended it in any better way as a last farewell to the fans and his signature role. Not only that but it looks like this one blows all the other superhero movies out of the water.", "created_at": "2017-07-06T18:54:14.939Z"}, {"movie_id": 263115, "review_id": "596794dd92514132e1003e64", "author_rating": 7.0, "review_text": "**A farewell and a welcome!**\r\n\r\nA perfect farewell to the only mutant who had solo films in 'X-Men' franchise. I never understood 'X-Men', I thought it was the worst superhero film series I've ever seen. But 'Wolverine' was the only reason I watched them all and particular, Hugh Jackman. There won't be Logan now onwards, though a set of new generation welcomed in this film, while saying goodbye to the old guys. So now what happens in the future of this franchise is a very suspense. Yet Logan had been the precious gem in the crown of 'X-Men', that mean it won't be the same anymore.\r\n\r\nAfter many years passed in the future, the last survivours of mutants hiding their identity and living among the humans. Logan and two others were attacked by the armed men when he decided to help a child mutant. Running away from them and looking for a place where they can be safe prioritised in the narration. More dramatised film in the franchise, but there are enough actions those who desire for that.\r\n\r\nIt's an emotional time for the hardcore fans of Logan/Hugh Jachman. One final great performance by him and the little kid was also good. A well shot film, with minimum graphics and more realistic stunt sequences. Well, not all were real, too strong fights, too bloody, despite having a child actor in it. Yeah, it is a good film, I liked it, but not a masterpiece as you might have heard of. But anyway, it is a must see for the 'Wolverine' fans.\r\n\r\n_7/10_", "created_at": "2017-07-13T15:42:21.790Z"}, {"movie_id": 263115, "review_id": "5971f2c5c3a3684bfc007502", "author_rating": 4.0, "review_text": "I believe that I am about to disagree with quite a few people now. You see, I did not like this movie.\r\n\r\nNot that this came as much of a surprise to me. What I got was pretty much what I expected. From a technical point of view the movie is quite well done. Hugh Jackman and Patrick Stewart are doing good jobs as always. The action scenes are good. The cinematography is not at all bad. If you are into tragic drama and do not mind the super hero twist of the movie then this is a movie for you. The technical qualities is why this movie gets any stars at all from me. If I would judge it by story only then it would have gotten zero, null, nada, nicths, rien, ingenting.\r\n\r\nFor me it was depressing, boring and not at all fun to watch. The only reason I watched it is because I, as a X-Men fan, simply had to watch it as well as having it in my collection but I would have been happier it this movie had never been made.\r\n\r\nWolverine is more or less an unpleasant drinking bum clad in filthy ragged clothes. Professor X is half insane and apparently dangerous to himself and the people around him. We get absolutely no explanation as to how this sad state of affairs.\r\n\r\nThe entire movie is dark in spirit with the X-Men all but died out and Wolverine and Professor X just waiting to die. Then in comes this female child who later turns out to be a female version of Wolverine. She pretty much lacks any form of charisma and she and Wolverine spends almost the entire time in a state of conflict, much due to Wolverine who seems to think everyone should go fuck themselves so that he can continue to self destruct.\r\n\r\nThe bad guys are the usual evil corporation doing experiments on X-Men, genetics etc. Supposedly they were behind the almost extermination of X-Men but of course they keep their own little army of “enhanced” humans that doggedly harasses Wolverine & Co. There are some nice action sequences but there is really no good overall boss. No one with enough Charisma to take the role of the main adversary unless you count X-24 who only took part in a few parts of the movie.\r\n\r\nBy the way, why the fuck do Wolverine, Laura as well as X-24 have to grunt like horny monkeys when they fight?\r\n\r\nThe story is rather predictable with no major surprises, little depth and low on logic. A typical Hollywood drama. Not really anything to write home about.\r\n\r\nThe movie is just so depressing from start to finish. As a last farewell to Wolverine and Professor X it is almost insulting. I know a lot of people seem to like it but I cannot understand why. At least not if you are a X-Men fan.", "created_at": "2017-07-21T12:25:41.859Z"}, {"movie_id": 263115, "review_id": "5985a90c92514143810200ed", "author_rating": 10.0, "review_text": "The Last Cut Is The Deepest!\r\n\r\nDid we need another X-Men movie? In fact did we need another Wolverine movie? Well the result is there for all to see, with Logan not only showing itself to be undoubtedly the best Wolverine venture by far, but arguably the best X-Men picture as well. If, as expected (and surely to god it's hoped so), this is the last we see of the grumpy metal clawed superhero, then what a fitting and triumphant bow out it is.\r\n\r\nJames Mangold, the director, has managed to create an adult superhero movie without it really being a superhero pic, for he has created a film noir Western that happens to be about a superhero. Mangold's love of noir and Westerns bursts from the screen, which for those who follow those wonderful stands of cinema, will come as no surprise having seen with notice his Copland and 3:10 To Yuma redux. There's a perpetual grimness to the narrative that belies the quite often stunning surrounding locales, heavy themes such as men out of time - with destinies written (cue a deft comic book movie within a comic book chunk of metaphysics) - surrogates, mental illness, human ignorance, and on it goes, the narrative strong on intelligence as much as it is in wrought emotion. Western fans will also be buoyed by the part that the 1953 classic Western Shane has to play in things, considerably so as its importance narratively, orally and visually is mightily strong.\r\n\r\nLogan's Run!\r\n\r\nAh yes, well being \"adult\" is all well and good, but is Logan thrilling? Do we get pumped up Wolverine action, blood brains, splatter and mucho muscle flexing and pained roars of anger? Oh yes! Action from the off is never far away, and wonderfully staged and choreographed it is. Lots of memorable set-pieces, while also some cleverly constructed sequences such as Xavier's mind seizures hold court and enthral. Yet the kicker with all that is we are clued in to the emotional baggage that the side-burn sporting protag carries with him. With each fight we sense the bigger picture, even as we watch in awe the emergence of Laura (ironic film noir name right there as it happens) - and her part in this very \"human\" story - the thrills and spills are propelled by a meaningful but battered heart.\r\n\r\nTech credits are superb. Acting honours go to Jackman, who after giving 17 years of his life to the character, gives it his all and this multi faceted performance, in a perfect world, deserves Oscar recognition. Patrick Stewart, also, is immense, playing the nonagenarian Charles Xavier with such class, gracefulness and storming emotion that one can only admire. Film debutante Dafne Keen as Laura is utterly engrossing, quite a debut indeed, whilst Stephen Merchant as albino mutant tracker Caliban is effective to the point we hanker for more. Although the villains fronted by Boyd Holbrook (rote henchman leader) and Richard E. Grant (smarmy scientist git) just about pass muster, there's nothing to damage the piece. Cinematography (John Mathieson) is \"A\" grade, the filters set on neo-noir, with the splendid film noir black and white version a fillip for the heart of noir lovers. All that is left is for the sound mix to boom and the director to steer with heart, brain and soul, without doubt both come up trumps.\r\n\r\nOne of 2017s best films, a genre splicer that ticks all the boxes of great film making. 10/10", "created_at": "2017-08-05T11:16:28.016Z"}, {"movie_id": 263115, "review_id": "6257b53fa6fdaa00682c5b81", "author_rating": 7.0, "review_text": "All but exhausted after years of fighting and hiding, \"Logan\" (Hugh Jackman) just wants a peaceful life. Aside from the occasional trip to Mexico to help the sun-shy \"Caliban\" (Stephen Merchant) with his medication, it's all pretty routine and low-key. That is, until \"Laura\" (Dafne Keen) pays him visit - and she has a mutation just like his. Who is she? Of course, she doesn't come alone. \"Pierce\" (Boyd Holbrook) has been charged by scientist \"Rice\" (Richard E. Grant) to track her down and capture her. It now falls to our eponymous hero to fend them off and get her to safety. What follows now are several highly polished, but frankly repetitive, escapades as their enemies close in. Sure, the effects are great and the production quality is top drawer, but the flaw with someone who has (albeit limited, by this stage) self healing powers is that the same, or slightly tweaked, scenarios happening over and over again start to get a bit dull after a while. Jackman looks as tired with the role as his character is with the relentlessness of his existence and though quite easy on the eye, Holbrook isn't up to much (I kept thinking he was Charlie Hunnam). I was never the biggest fan of this franchise once they split it out to follow \"Wolverine\". Jackman is an hugely charismatic actor but his character isn't remotely sophisticated and though there is some humour to be found, for the most part I found this an action-packed but pretty long and unremarkable piece of cinema.", "created_at": "2022-04-14T05:46:39.880Z"}, {"movie_id": 263115, "review_id": "63e709f0a2e60200932955fe", "author_rating": 7.0, "review_text": "**Logan tones down the effects and scale to focus on the emotion and pain of its characters, making it one of the best films in the X-Men saga.**\r\n\r\nJames Mangold strikes again! Logan is considered by many to be one of the greatest superhero films ever made. While I don’t feel as strongly as many about this film, its quality is undeniable. Jackman and Stewart’s performances were the best of the franchise. The story adapts the Old Man Logan comic to depict an aged weary Wolverine that is more jaded and bitter than ever. This new world where the X-Men have all perished or disappeared is more dangerous than ever for mutants. But Logan’s heart is slowly restored by a young girl on the run that seems destined to follow in his footsteps unless he finds a way to give her a new future and hope. Mangold’s vision and directing fill the film with emotion and pain. Logan’s suffering and hopelessness are tangible and felt in every moment of the film. While I missed the vibe and characters of the other X-Men movie, Logan was an excellent film that gave a meaningful conclusion to Wolverine’s long and heartbreaking journey.", "created_at": "2023-02-11T03:22:24.543Z"}, {"movie_id": 263115, "review_id": "58bbf107c3a368666b032be5", "author_rating": null, "review_text": "**LOGAN REVIEW: THE WOLVERINE GETS A SUPER SEND-OFF**\r\n\r\n\"Owing to its agitated hero’s misfortunes through the ages, this is a film that’s acutely aware of the dangers of emotional exploitation, and it spares its audience a similar fate. With Logan, Mangold and co-writer Scott Frank tell the definitive story of the Wolverine, in an involving and deeply satisfying series finale. It shows the fate of mutants when age starts to weary them, with stakes that feel real, and empathy that’s earned.\"\r\n\r\nREAD THE FULL REVIEW AT SBS MOVIES: http://www.sbs.com.au/movies/review/logan-review-wolverine-gets-super-send", "created_at": "2017-03-05T11:05:43.219Z"}, {"movie_id": 263115, "review_id": "58c34453925141239c000e72", "author_rating": 4.0, "review_text": "There may be some fine performances in this movie, but I honestly think the critics overrated this latest entry in the X-Men saga. The performances of Wolverine and Prof. X by Hugh Jackman and Patrick Stewart are extraordinary. They create a believable and loving father-son bond between their characters, with Logan caring for the ninety year old leader of the X-Men after a horrible event occurs at the Xavier school the year before. Stephen Merchant takes over the role of Caliban from Tómas Lemarquis, who played the character in X-Men Apocalypse, and transforms him into an ally to Logan and Charlies. Merchant is quite good in the role. But what really dragged down the movie is its nihilism. The other X-Men are completely missing from the film and mutants have been wiped out almost completely. A sense of doom and hopelessness looms over the film. This movie completely upends the warm and hopeful epilogue of Days of Future Past, where the X-Men were restored to life and glory and mutants weren't extinct after all. Death seems to stalk Logan and Charles wherever they go. There is also a conspicuous lack of significant female characters in this movie, too. The only female of note is Laura/ X-23, and she spends most of the film mute. There is also a complete lack of any strong or memorable villains. No one ever reaches the level of greatness like other X-Men villains such as Magneto or William Stryker. So, despite some good performances, this film is a bit overrated and also a little too bleak and depressing for my taste.", "created_at": "2017-03-11T00:26:59.874Z"}, {"movie_id": 263115, "review_id": "58e21cbb925141281900a93d", "author_rating": 8.0, "review_text": "One of the best and most mature Marvel movies to date.\r\n\r\nThe first half of this movie is a huge delight and a huge thrill. Hugh Jackman and Patrick Stewart are so entertaining to watch as characters they've known for 17 years. They've taken their characters a step further here in a script that allows them to explore themselves emotionally more than ever before. This movie is strictly part-drama. Yes, that's right. Finally, a Marvel superhero movie you can confidently stamp the drama genre tag on.\r\n\r\nThe effects, stunts and gore are really quite shocking. You can really feel the weight of each character's immense power, and more importantly, the struggles that come along with them. This further fleshes out each character.\r\n\r\nThe movie starts to lose the enjoyability of its ensemble halfway through, and what happens after is what you might expect from a typical X-Men film. Action, sci-fi and more action/sci-fi. The villains are as interesting as they can be I suppose. They lack much development but are there to fuel the real story. Anyway, I can't say much else without spoiling the plot. I'll just say that I wish the movie would have taken a different direction.", "created_at": "2017-04-03T09:58:19.780Z"}, {"movie_id": 263115, "review_id": "58e3b3c8925141281901f557", "author_rating": 8.0, "review_text": "If you don't like superhero movies, this is the superhero movie for you. And if you do like superhero movies? Watch _Logan_ anyway. It's bloody brilliant.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-04-04T14:55:04.326Z"}, {"movie_id": 263115, "review_id": "595e87569251410bfa090ffb", "author_rating": null, "review_text": "**** This review may contain spoilers ****\r\n\r\nWe finally get the Wolverine we have been asking for, for the past 15 years and it's his last time. Well, I guess he couldn't have ended it in any better way as a last farewell to the fans and his signature role. Not only that but it looks like this one blows all the other superhero movies out of the water.", "created_at": "2017-07-06T18:54:14.939Z"}, {"movie_id": 263115, "review_id": "596794dd92514132e1003e64", "author_rating": 7.0, "review_text": "**A farewell and a welcome!**\r\n\r\nA perfect farewell to the only mutant who had solo films in 'X-Men' franchise. I never understood 'X-Men', I thought it was the worst superhero film series I've ever seen. But 'Wolverine' was the only reason I watched them all and particular, Hugh Jackman. There won't be Logan now onwards, though a set of new generation welcomed in this film, while saying goodbye to the old guys. So now what happens in the future of this franchise is a very suspense. Yet Logan had been the precious gem in the crown of 'X-Men', that mean it won't be the same anymore.\r\n\r\nAfter many years passed in the future, the last survivours of mutants hiding their identity and living among the humans. Logan and two others were attacked by the armed men when he decided to help a child mutant. Running away from them and looking for a place where they can be safe prioritised in the narration. More dramatised film in the franchise, but there are enough actions those who desire for that.\r\n\r\nIt's an emotional time for the hardcore fans of Logan/Hugh Jachman. One final great performance by him and the little kid was also good. A well shot film, with minimum graphics and more realistic stunt sequences. Well, not all were real, too strong fights, too bloody, despite having a child actor in it. Yeah, it is a good film, I liked it, but not a masterpiece as you might have heard of. But anyway, it is a must see for the 'Wolverine' fans.\r\n\r\n_7/10_", "created_at": "2017-07-13T15:42:21.790Z"}, {"movie_id": 263115, "review_id": "5971f2c5c3a3684bfc007502", "author_rating": 4.0, "review_text": "I believe that I am about to disagree with quite a few people now. You see, I did not like this movie.\r\n\r\nNot that this came as much of a surprise to me. What I got was pretty much what I expected. From a technical point of view the movie is quite well done. Hugh Jackman and Patrick Stewart are doing good jobs as always. The action scenes are good. The cinematography is not at all bad. If you are into tragic drama and do not mind the super hero twist of the movie then this is a movie for you. The technical qualities is why this movie gets any stars at all from me. If I would judge it by story only then it would have gotten zero, null, nada, nicths, rien, ingenting.\r\n\r\nFor me it was depressing, boring and not at all fun to watch. The only reason I watched it is because I, as a X-Men fan, simply had to watch it as well as having it in my collection but I would have been happier it this movie had never been made.\r\n\r\nWolverine is more or less an unpleasant drinking bum clad in filthy ragged clothes. Professor X is half insane and apparently dangerous to himself and the people around him. We get absolutely no explanation as to how this sad state of affairs.\r\n\r\nThe entire movie is dark in spirit with the X-Men all but died out and Wolverine and Professor X just waiting to die. Then in comes this female child who later turns out to be a female version of Wolverine. She pretty much lacks any form of charisma and she and Wolverine spends almost the entire time in a state of conflict, much due to Wolverine who seems to think everyone should go fuck themselves so that he can continue to self destruct.\r\n\r\nThe bad guys are the usual evil corporation doing experiments on X-Men, genetics etc. Supposedly they were behind the almost extermination of X-Men but of course they keep their own little army of “enhanced” humans that doggedly harasses Wolverine & Co. There are some nice action sequences but there is really no good overall boss. No one with enough Charisma to take the role of the main adversary unless you count X-24 who only took part in a few parts of the movie.\r\n\r\nBy the way, why the fuck do Wolverine, Laura as well as X-24 have to grunt like horny monkeys when they fight?\r\n\r\nThe story is rather predictable with no major surprises, little depth and low on logic. A typical Hollywood drama. Not really anything to write home about.\r\n\r\nThe movie is just so depressing from start to finish. As a last farewell to Wolverine and Professor X it is almost insulting. I know a lot of people seem to like it but I cannot understand why. At least not if you are a X-Men fan.", "created_at": "2017-07-21T12:25:41.859Z"}, {"movie_id": 263115, "review_id": "5985a90c92514143810200ed", "author_rating": 10.0, "review_text": "The Last Cut Is The Deepest!\r\n\r\nDid we need another X-Men movie? In fact did we need another Wolverine movie? Well the result is there for all to see, with Logan not only showing itself to be undoubtedly the best Wolverine venture by far, but arguably the best X-Men picture as well. If, as expected (and surely to god it's hoped so), this is the last we see of the grumpy metal clawed superhero, then what a fitting and triumphant bow out it is.\r\n\r\nJames Mangold, the director, has managed to create an adult superhero movie without it really being a superhero pic, for he has created a film noir Western that happens to be about a superhero. Mangold's love of noir and Westerns bursts from the screen, which for those who follow those wonderful stands of cinema, will come as no surprise having seen with notice his Copland and 3:10 To Yuma redux. There's a perpetual grimness to the narrative that belies the quite often stunning surrounding locales, heavy themes such as men out of time - with destinies written (cue a deft comic book movie within a comic book chunk of metaphysics) - surrogates, mental illness, human ignorance, and on it goes, the narrative strong on intelligence as much as it is in wrought emotion. Western fans will also be buoyed by the part that the 1953 classic Western Shane has to play in things, considerably so as its importance narratively, orally and visually is mightily strong.\r\n\r\nLogan's Run!\r\n\r\nAh yes, well being \"adult\" is all well and good, but is Logan thrilling? Do we get pumped up Wolverine action, blood brains, splatter and mucho muscle flexing and pained roars of anger? Oh yes! Action from the off is never far away, and wonderfully staged and choreographed it is. Lots of memorable set-pieces, while also some cleverly constructed sequences such as Xavier's mind seizures hold court and enthral. Yet the kicker with all that is we are clued in to the emotional baggage that the side-burn sporting protag carries with him. With each fight we sense the bigger picture, even as we watch in awe the emergence of Laura (ironic film noir name right there as it happens) - and her part in this very \"human\" story - the thrills and spills are propelled by a meaningful but battered heart.\r\n\r\nTech credits are superb. Acting honours go to Jackman, who after giving 17 years of his life to the character, gives it his all and this multi faceted performance, in a perfect world, deserves Oscar recognition. Patrick Stewart, also, is immense, playing the nonagenarian Charles Xavier with such class, gracefulness and storming emotion that one can only admire. Film debutante Dafne Keen as Laura is utterly engrossing, quite a debut indeed, whilst Stephen Merchant as albino mutant tracker Caliban is effective to the point we hanker for more. Although the villains fronted by Boyd Holbrook (rote henchman leader) and Richard E. Grant (smarmy scientist git) just about pass muster, there's nothing to damage the piece. Cinematography (John Mathieson) is \"A\" grade, the filters set on neo-noir, with the splendid film noir black and white version a fillip for the heart of noir lovers. All that is left is for the sound mix to boom and the director to steer with heart, brain and soul, without doubt both come up trumps.\r\n\r\nOne of 2017s best films, a genre splicer that ticks all the boxes of great film making. 10/10", "created_at": "2017-08-05T11:16:28.016Z"}, {"movie_id": 263115, "review_id": "6257b53fa6fdaa00682c5b81", "author_rating": 7.0, "review_text": "All but exhausted after years of fighting and hiding, \"Logan\" (Hugh Jackman) just wants a peaceful life. Aside from the occasional trip to Mexico to help the sun-shy \"Caliban\" (Stephen Merchant) with his medication, it's all pretty routine and low-key. That is, until \"Laura\" (Dafne Keen) pays him visit - and she has a mutation just like his. Who is she? Of course, she doesn't come alone. \"Pierce\" (Boyd Holbrook) has been charged by scientist \"Rice\" (Richard E. Grant) to track her down and capture her. It now falls to our eponymous hero to fend them off and get her to safety. What follows now are several highly polished, but frankly repetitive, escapades as their enemies close in. Sure, the effects are great and the production quality is top drawer, but the flaw with someone who has (albeit limited, by this stage) self healing powers is that the same, or slightly tweaked, scenarios happening over and over again start to get a bit dull after a while. Jackman looks as tired with the role as his character is with the relentlessness of his existence and though quite easy on the eye, Holbrook isn't up to much (I kept thinking he was Charlie Hunnam). I was never the biggest fan of this franchise once they split it out to follow \"Wolverine\". Jackman is an hugely charismatic actor but his character isn't remotely sophisticated and though there is some humour to be found, for the most part I found this an action-packed but pretty long and unremarkable piece of cinema.", "created_at": "2022-04-14T05:46:39.880Z"}, {"movie_id": 263115, "review_id": "63e709f0a2e60200932955fe", "author_rating": 7.0, "review_text": "**Logan tones down the effects and scale to focus on the emotion and pain of its characters, making it one of the best films in the X-Men saga.**\r\n\r\nJames Mangold strikes again! Logan is considered by many to be one of the greatest superhero films ever made. While I don’t feel as strongly as many about this film, its quality is undeniable. Jackman and Stewart’s performances were the best of the franchise. The story adapts the Old Man Logan comic to depict an aged weary Wolverine that is more jaded and bitter than ever. This new world where the X-Men have all perished or disappeared is more dangerous than ever for mutants. But Logan’s heart is slowly restored by a young girl on the run that seems destined to follow in his footsteps unless he finds a way to give her a new future and hope. Mangold’s vision and directing fill the film with emotion and pain. Logan’s suffering and hopelessness are tangible and felt in every moment of the film. While I missed the vibe and characters of the other X-Men movie, Logan was an excellent film that gave a meaningful conclusion to Wolverine’s long and heartbreaking journey.", "created_at": "2023-02-11T03:22:24.543Z"}]