[{"movie_id": 37724, "review_id": "50bf768719c2950644000e62", "author_rating": 8.0, "review_text": "Skyfall was a solid movie in its own right but as a Bond movie, it was one of my all time favourites. Unlike Quantum of Solace, I felt like they actually took the time to tell this story and the pay off was worth it.\r\n\r\nSomething I found interesting is the idea about Bond getting old and how the job of an MI6 agent is not something you can do forever. It makes me wonder if they might explore some of these themes in the next movie.\r\n\r\nIt's true that the last 1/3 of Skyfall didn't feel like a Bond movie at all and I think that's why I loved it. The Daniel Craig Bond movies have always taken a different look at James Bond and Skyfall was no exception.\r\n\r\nLike I said, great movie. Execution on all accounts were solid like you'd expect. I hope Mendes gets a chance to do the next film.", "created_at": "2012-12-05T16:29:59.000Z"}, {"movie_id": 37724, "review_id": "514297f219c29552e70e99c7", "author_rating": 8.5, "review_text": "Skyfall is a great movie. In my opinion the best proformas by Daniel Craig I have see in all his Bond movies. The title song was not to my taste like in previous movies. The story line is one of the most compelling I have seen in a while. Silva, played by Javier Bardem was excellent and he played him very well. All in all a very good movie.", "created_at": "2013-03-15T03:39:30.913Z"}, {"movie_id": 37724, "review_id": "54a0afed925141313200b7a5", "author_rating": 3.0, "review_text": "Bond (Daniel Craig) is on another (important) mission somewhere in the big world, this time on the heels of someone who has stolen a hard drive with all the names of the British agents who work for MI6. On the mission, Mr. Bond is shot by one of his own (an agent named Eve, played by Naomie Harris) and presumed dead. However, Bond is not dead, and when he resurfaces, he jumps right into the game in the pursuit of an old agent called Silva (Javier Bardem), an old favorite of M (Judi Dench).\r\n\r\nWhile Bond is out in the world, M discovers that someone, presumably Silva, has hacked their computers and threats to expose the true names of the British agents. However, it is also clear that the enemy has other plans, plans of terrorism. Bond is now in a race against time before more agents are revealed, or worse yet, before M is killed by their mysterious enemy. Fortunately, everything works out perfectly for 007, who finds the mysterious Silva with little effort.\r\n\r\nOK, admittedly, this was a very short summary of the plot in Skyfall, but in all honesty, there isn't a big plot in this movie. I could have given some spoilers about the ending, and maybe added a bit about Mallory (Ralph fiennes), but really, this is an extremely simple plot. Not at all worthy of a big iconic character like James Bond.\r\n\r\nIt is classic 007, with everything thats part of such an adventure, like product placement (not a favorite of mine, in fact I get rather annoyed when its as obvious as the watch in the opening of the movie), car chases (in this case, more like a motorcycle chase across the roofs of some unknown city), beautiful women (which are exactly as shallow and pointless as you would expect), and lastly a total lack of emotions and realism.\r\n\r\nI am not a big Bond fan, and haven't seen all of the movies in the series, so I am probably not the right person to review this movie. I do not understand what it is that draws people into the cinema time after time, to watch yet another Bond movie… when they can watch something original with a real plot and real characters. Perhaps these people like the shallow characters, who care little for the safety of the innocent people in the world, yes, I said it. Look carefully in the opening sequence, how the female agent cares little for the people on the bridge, as she shoots after the enemy. Later in that scene, she finds it really hard to shoot the enemy, because what if she hit Bond instead. I may be wrong in this assumption, but isn't MI6 here to protect the innocent people? Perhaps these people like the almost infinite number of one-liners that made my ears bleed at one point. Why are we treated this way? Do the people who makes these movies really think we are so stupid?\r\n\r\nBefore I actually say something nice about Skyfall, because I can do that, I just want to give a small piece of advice to future Bond villains, because who are we kidding, there will be more Bond movies in the future… my advice is this: Always remember to close the door behind you, whether its an actual door, or maybe a manhole (cover). If you don't do this, Bond will surely find you. But of course, perhaps you are dying to have him on your tail, in which case, you are doing it exactly right!\r\n\r\nOK, something positive. Skyfall is a beautiful movie, in a very obvious (and superficial) way. The colors are just stunning, especially when we follow Bond swimming through the night of Shanghai, high above the streets. There is no denying the imagery and action of the movie, in every possible way, this is some of the best the world has to offer. I'd also like to give a shout out to Albert Finney, whose character (Kincade) raises the quality of the movie, and actually give it some human emotion.\r\n\r\nThe very last thing I want to say is this… why hire Sam Mendes for this movie? Why hire him when he is not allowed to use the powers that God have given him? Where are the human emotions, where are the dark humor, where are the personal stories that capture our hearts as much as our minds? If you want to watch a real Sam Mendes movie, I suggest the following American Beauty, Jarhead and even, Revolutionary Road.\r\n\r\n_Last words... only watch this movie if you have nothing to do… at all… and if you are a hardcore fan of 007 and feel forced to watch every movie in the franchise. This movie reminds me why I only rarely watch big Hollywood blockbusters._", "created_at": "2014-12-29T01:35:41.433Z"}, {"movie_id": 37724, "review_id": "58a8ef0cc3a368641c004d04", "author_rating": 10.0, "review_text": "How safe do you feel?\r\n\r\nBond 23 and 007 has to literally come back from the dead when a stolen hard-drive makes M (Dench) look bad at a time when a face from her past comes homing into blood thirsty view. \r\n\r\nThere is one sure fire fact in cinema that nobody can dispute, that of there never ever being a James Bond film that all Bondphiles will agree on. From each corner of the spectrum will come arguments that said Bond film is not gritty enough, not fun enough, not enough sex, not enough action, not enough fantastical stunts and etc etc etc. Well that's fine of course, we all have our peccadilloes we prefer in our Bond movies, but we do live in different times now, the world has changed, and so has Bond. You may not get the ultimate Bond you want, but this is a 21st Century Bond and a new era of 007 is upon us, something which makes Skyfall even the more bolder and braver because it marks the 50th anniversary by blending the old with the new and mostly achieving brilliant results. \r\n\r\nSkyfall allows us to bathe in nostalgia whilst also forcing us to re- evaluate just where we are at in terms of our beloved super secret agent. One of the great things about this Bond is that there is a bubbling under current of time's importance delicately perched on each side of James Bond's shoulders. Is he (and M etc) outdated? Or is the future still in need of such operatives/organisations? Director Mendes and his team don't take any of the easy options that were clearly available to them to answer the question, they instead build a film around Bond and M as characters, embrace the traditions of the series and hit us hard in head and heart. \r\n\r\nThe plot of Skyfall as written is simple, absolutely nailed on it is straight and true to Hollywood conventions, but what fills out the simple plot is a series of Bondian delights, thrills spills and emotionally splintered kills. The stunning pre-credits sequence sees Bond traverse the rooftops of Istanbul on a motorcycle and then fight on top of a speeding train. Only to then find himself expendable. Which leads to Daniel Kleinman's title credits sequence that is filled with ominous portents of death and blood, in turn backed by the wonderfully Bondian of old title song warbled by Adele. It's clear at this point that this Bond movie is nodding to traditional values whilst promising to deliver some emotional pain. And so it proves. \r\n\r\nA washed up Bond enters the fray, and he convinces, he's dishevelled, unshaven and unfit, but he's still a tough bastard who can drink hard and stare a scorpion down. He'll be back soon, we know this, and he will be in wonderful physical shape, and loyal to his surrogate mother for sure. Ah, but there's the adversary on the scene now, a villain to finally give Craig's Bond something to fret about. It's Javier Bardem's (perfect) Silva, a cyber terrorist with a shock of blonde hair, a nasty dental trick and a devilish sexiness that unnerves during an interrogation scene; to which Bond cheekily opens up some wink wink possibilities. There is other sexual tension in the film as well, not just a steamy shower scene, but the ongoing banter with Naomie Harris' (excellent) Eve that positively fizzes with smirking innuendo. \r\n\r\nBut ultimately this comes down to the love between a man and a woman, the kind that is so different to the type that has so often underpinned a Bond movie. Bond will kill or be killed for M, and how marvellous to see a director really able to give Judi Dench the direction she so deserves, and Bond, in Craig's magnetic and gritty hands, responds in kind to deliver a last half hour as good as any in the 50 years of Bond on film. As we know, all turf is Bond's turf, but this time it really is HIS turf, and as a little back story comes seeping out, Bond gets to exorcise some demons whilst kicking considerable ass. Get ready Bondphiles, this has the emotional wallop only seen in the best Bond movies of old. \r\n\r\nAll the Bondian trappings are still here, exotic locales, gorgeous women, speeding vehicles, fights, stupendous stunts, bizarre lairs and balls out machismo. It's also funny! I myself commented when reviewing Quantum of Solace that it was pretty ace as an action film, but for many it's not Bondian enough, and the truth of the matter is Bond still needs to have a degree of fun, no matter how grim and gritty the story line is. Thankfully Skyfall is often a blast, with Craig (surely convincing even the most stubborn of dissenters how good a Bond he is) having the confidence and skill to lace his Bond's macho broody instinct with a desert dry wit and shrug of the shoulders nonchalance. Other side of the camera the tech credits are high, with Deakins proving to be one of the aces in the pack. His capturing of vistas, be it a neon city scape or a mountainous valley, are eye delights, his colour tones are beautiful, I promise you, nobody these days does golden browns like Deakins. \r\n\r\nIt's not the masterpiece that I or gazillions of others hoped for, and it does have flaws (new Q a bit too geeky safe, finale lacks a substantial battle with the villain) and it remains simple in plot, but it's Bond's birthday and the birthday boy has been done proud by the makers. It's a new era Bond for sure, but that most definitely isn't a bad thing, it knows its past and it now knows its future, and without doubt we all still know the name. 9/10", "created_at": "2017-02-19T01:04:12.328Z"}, {"movie_id": 37724, "review_id": "5aaf94ca92514116ae036a85", "author_rating": 2.0, "review_text": "Me and my oldest son have been doing a bit of pseudo binge watching of James Bond. Every weekend we have been watching two of the movies starting with Dr. No quite a few weekends ago. Last weekend we arrived at the Daniel Craig ones. I had actually not watched those ones before. I have to, grudgingly (I am a Sean Connery fan), admit that the first two we watched were not at all bad.\r\n\r\nHowever, today we watched Skyfall. What the f…? This is not a James Bond movie! If it had been just some other movie I would probably have thought it would not be a too bad one. However, it pretends to be a James Bond movie and as such it is utter crap. It is a bloody Hollywood drama written by someone with a total lack of respect for the Franchise, not to mention the old Bond fans.\r\n\r\nJames Bond should be out hunting international villains. Villains with a good chunk of bad guy charisma I might add. What we got however was some loathsome prick having a grudge because M didn’t come to his rescue when he fucked up.\r\n\r\nThe British Secret service should also be just that, a powerful organisation protecting Britain (and the rest of the civilized world) from communists, terrorists, criminal superorganisations like Spectre or whatever.  Having scenes with M more or less on trial and having to defend herself in front of a bunch of clueless political asshats is just crap and it is definitely not the kind of crap that should be in a James Bond movie.\r\n\r\nThe whole movie is just full of sensationalist shit, politically correct crap, killing of popular characters, sentimental bullshit and other nonsens of the kind you would expect in a bloody Hollywood soap opera. And what about the new Q? A boring brat with a over-inflated ego. Not fun at all.\r\n\r\nEven the special effects are debatable. For example, if you make a subway train crash by blowing a hole in it’s path then for Christ sake put some crash test dummies or something in it to at least make some pretense of it not being an empty mock-up!\r\n\r\nThis is undoubtedly the worst Bond movie ever. My disappointment with this movie cannot be overstated.", "created_at": "2018-03-19T10:45:30.502Z"}, {"movie_id": 37724, "review_id": "5e97dedbd1444300195088f9", "author_rating": 8.0, "review_text": "Great theme song and a much more balanced movie compared to Quantum of Solace, and the story is well written, revealing Bond's background and the motherly relationship with M (contrast with a more antagonistic portrayal in the Brosnan series). Javier Bardem as the villain was fantastic, almost Joker like in his planning. The only setback is the finale, sure some nice action and explosions but not quite as thrilling versus Casino Royale. Still, one of the better in the Bond series overall. **4.0/5**", "created_at": "2020-04-16T04:28:11.927Z"}, {"movie_id": 37724, "review_id": "60b52929dd926a00294721bb", "author_rating": 8.0, "review_text": "_**Can you go home again?**_\r\n\r\nAfter 007 (Daniel Craig) is thought dead-in-action in Turkey, the computer of ‘M’ (Judi Dench) is hacked and there’s an attack on the MI6 headquarters in London. M & Bond suspect it’s an inside job, which leads James to Shanghai, Macao and a mysterious island off the coast of China, then back to London. Bond has to find sanctuary for M, but you know what they say about going home again? Javier Bardem plays a heavy and Ralph Fiennes an MI6 official.\r\n\r\n“Skyfall” (2012) thankfully includes the character depth of “Casino Royale” (2006) and fixes the confusing 4 clips-per-second action of “Quantum of Solace” (2008). Don’t get me wrong, “Quantum” can be appreciated as the action-oriented second half of “Casino Royale,” but it’s easily one of the lesser installments in the franchise. “Skyfall,” by contrast, stands with the best.\r\n\r\nThe movie saves the best for last, but I don’t want to give anything away. Let’s just say it’s a refreshing change for the series, the locations are fabulous and a classic actor unexpectedly shows up.  \r\n\r\nBesides Dench on the feminine front, there’s Bérénice Marlohe as Severine in China and Naomie Harris as MI6 agent Eve. Tonia Sotiropoulou also has a brief scene in Turkey.\r\n\r\nThe film runs 2 hours, 23 minutes, and was shot in Turkey, England, China and Scotland.\r\n\r\nGRADE: A-", "created_at": "2021-05-31T18:21:29.913Z"}, {"movie_id": 37724, "review_id": "615350b2f04d0100444f8244", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/skyfall-spoiler-free-review\r\n\r\n\"Skyfall is not only the entry that this James Bond saga needed, but it's my favorite movie of the Daniel Craig Era. From the exceptionally intriguing narrative filled with shocking developments to Javier Bardem's terrifying portrayal of a fascinating antagonist, Sam Mendes offers his remarkable directing skills to create a film worthy of much praise.\r\n\r\nThe GOAT of cinematography, Roger Deakins, makes every inch of the screen drip cinematic beauty with eyegasmic wide shots and mind-blowing lighting, making this the best-looking Bond flick ever. Technically, it's challenging to find elements less than simply perfect.\r\n\r\nPhenomenal acting all-around elevates an extraordinarily impactful character work, culminating in an emotionally powerful third act. A slightly overextended runtime doesn't stop me from considering this a flawless Bond movie.\r\n\r\nI can't endorse it more than this.\"\r\n\r\nRating: A", "created_at": "2021-09-28T17:28:18.186Z"}, {"movie_id": 37724, "review_id": "6328218553866e007d7fce01", "author_rating": 7.0, "review_text": "Ok, first things first. \"Skyfall\" and \"crumble\" do not rhyme. Sorry Adele, but they don't! Luckily, the rest of this story is almost as good as \"Casino Royale\" (2006). Daniel Craig reprises his role as \"007\", this time charged with thwarting a dastardly plan by the enigmatic \"Silva\" to avenge himself on none other than \"M\" (Dame Judi Dench) herself. He has managed to successfully infiltrate just about every system MI6 has and obtain a list of agents the world over. When he starts publishing these names, and the body count starts to rise, it falls to \"Bond\" to engage with his clever and malevolent foe. Bardem is effective as the baddie here. He has a certain, almost menacing, effeteness as he quite literally toys with his quarry. Loads of gadgets, explosions, a welcome appearance from the original Aston Martin and an action-packed pace keep this moving along well. The ending is a bit far-fetched, even by \"James Bond\" standards, and that even though it did give us chance to enjoy a suitably eclectic contribution from Albert Finney, was all just bit daft. The supporting efforts don't bode so well, either. Ralph Fiennes seems set for a larger role in future films and he doesn't really add much and though she does well enough, the role offered to Naomie Harris' \"Eve\" is just too insubstantial for her to assert herself on much of the story. That said, though, it's very much at the top end of the Craig outings for this character and it does look good on big screen,", "created_at": "2022-09-19T08:00:05.324Z"}, {"movie_id": 37724, "review_id": "6352fcf0244182007f238fc7", "author_rating": 9.0, "review_text": "**Skyfall understands, admires, and elevates Bond to excellence and mastery to an unexpected level and unmatched by its predecessors.**\r\n\r\nSkyfall is The Dark Knight of Daniel Craig’s James Bond films. Sam Mendes took all Casino Royale had built and elevated it to heights never before reached by Bond. Everything fires perfectly on all cylinders. The story is rich and delves further into the character of a bond than ever before. The action set pieces, the locales, and the cinematography are all masterpieces that establish Skyfall as an excellent James Bond film but take it further, placing it among the best movies of all time. Judi Dench’s performance as M cements her legacy as a Bond great. And the excellent supporting cast grows with the brilliant casting and performances of Naomi Harris as Moneypenny, Ralph Fiennes as Mallory, and Ben Whishaw as Q. Still, the biggest standout is Javier Bardem as the villainous Silva - one of the greatest Bond antagonists of all time. His unpredictable and menacing nature is cloaked in a slightly goofy demeanor and skewed moral code. Skyfall asks and answers questions unlike any Bond before while staying true to what makes James Bond so compelling and entertaining. Just like The Dark Knight for Batman, even people who are not traditional Bond fans will be impressed with Skyfall.", "created_at": "2022-10-21T20:11:28.906Z"}, {"movie_id": 37724, "review_id": "63be6efefa4046008757a415", "author_rating": 10.0, "review_text": "By the time Skyfall dropped my hatred of Craig Era Bond was pretty solidified. I started to realize that this was going to be the Bond that hated being Bond. That Bond was going to go down a dark hole that I was really going to loath.\r\n\r\nBut... Javier Bardem really nailed it didn't he?\r\n\r\nJavier Bardem nailed it. Judi Dench had her best showing as M... ever, in fact it was so good that it kind of made you made she was relegated to a side character in all the other Bond movies.\r\n\r\nAnd the story was great... it was so great that Disneyer ripped off huge chunks of it when they made Black Panther.\r\n\r\nBy 2012 you got the feeling that Sony was going to take the 007 down a dark and evil rabbit hole that would destroy the Franchise, but Skyfall still ranks as one of the best Bond movies in franchise history.", "created_at": "2023-01-11T08:10:38.647Z"}, {"movie_id": 37724, "review_id": "643e19bbd7a70a0507aae5a4", "author_rating": 3.0, "review_text": "Keeping the Bond series down.\r\nPoor Daniel Craig isn't at fault for these totally uninspired, unmotivated stories he appears in.\r\nMaybe his agent is at fault. But while Craig makes money, his memory will be forgotten in a hundred years, if these 007 fiascos are his high points. \r\nThey probably won't be his high points. Good for him.\r\nHere, we get more of the modern day movie making which eliminates all the exotic scenery and all the wit and all the inspiration and all the motivation.\r\nInstead, we get another demigod villain on the order of horror movies. He may as well be Freddy, Jason, or Wishmaster. That's how he's written.\r\nSo, we have the worst Bond villain in movie history. Certainly, he's the most Hollywood.\r\nWhich makes this as dull as watching a pot boil.\r\nEven the high octane action sequences can't save this flop.", "created_at": "2023-04-18T04:16:59.827Z"}, {"movie_id": 37724, "review_id": "50bf768719c2950644000e62", "author_rating": 8.0, "review_text": "Skyfall was a solid movie in its own right but as a Bond movie, it was one of my all time favourites. Unlike Quantum of Solace, I felt like they actually took the time to tell this story and the pay off was worth it.\r\n\r\nSomething I found interesting is the idea about Bond getting old and how the job of an MI6 agent is not something you can do forever. It makes me wonder if they might explore some of these themes in the next movie.\r\n\r\nIt's true that the last 1/3 of Skyfall didn't feel like a Bond movie at all and I think that's why I loved it. The Daniel Craig Bond movies have always taken a different look at James Bond and Skyfall was no exception.\r\n\r\nLike I said, great movie. Execution on all accounts were solid like you'd expect. I hope Mendes gets a chance to do the next film.", "created_at": "2012-12-05T16:29:59.000Z"}, {"movie_id": 37724, "review_id": "514297f219c29552e70e99c7", "author_rating": 8.5, "review_text": "Skyfall is a great movie. In my opinion the best proformas by Daniel Craig I have see in all his Bond movies. The title song was not to my taste like in previous movies. The story line is one of the most compelling I have seen in a while. Silva, played by Javier Bardem was excellent and he played him very well. All in all a very good movie.", "created_at": "2013-03-15T03:39:30.913Z"}, {"movie_id": 37724, "review_id": "54a0afed925141313200b7a5", "author_rating": 3.0, "review_text": "Bond (Daniel Craig) is on another (important) mission somewhere in the big world, this time on the heels of someone who has stolen a hard drive with all the names of the British agents who work for MI6. On the mission, Mr. Bond is shot by one of his own (an agent named Eve, played by Naomie Harris) and presumed dead. However, Bond is not dead, and when he resurfaces, he jumps right into the game in the pursuit of an old agent called Silva (Javier Bardem), an old favorite of M (Judi Dench).\r\n\r\nWhile Bond is out in the world, M discovers that someone, presumably Silva, has hacked their computers and threats to expose the true names of the British agents. However, it is also clear that the enemy has other plans, plans of terrorism. Bond is now in a race against time before more agents are revealed, or worse yet, before M is killed by their mysterious enemy. Fortunately, everything works out perfectly for 007, who finds the mysterious Silva with little effort.\r\n\r\nOK, admittedly, this was a very short summary of the plot in Skyfall, but in all honesty, there isn't a big plot in this movie. I could have given some spoilers about the ending, and maybe added a bit about Mallory (Ralph fiennes), but really, this is an extremely simple plot. Not at all worthy of a big iconic character like James Bond.\r\n\r\nIt is classic 007, with everything thats part of such an adventure, like product placement (not a favorite of mine, in fact I get rather annoyed when its as obvious as the watch in the opening of the movie), car chases (in this case, more like a motorcycle chase across the roofs of some unknown city), beautiful women (which are exactly as shallow and pointless as you would expect), and lastly a total lack of emotions and realism.\r\n\r\nI am not a big Bond fan, and haven't seen all of the movies in the series, so I am probably not the right person to review this movie. I do not understand what it is that draws people into the cinema time after time, to watch yet another Bond movie… when they can watch something original with a real plot and real characters. Perhaps these people like the shallow characters, who care little for the safety of the innocent people in the world, yes, I said it. Look carefully in the opening sequence, how the female agent cares little for the people on the bridge, as she shoots after the enemy. Later in that scene, she finds it really hard to shoot the enemy, because what if she hit Bond instead. I may be wrong in this assumption, but isn't MI6 here to protect the innocent people? Perhaps these people like the almost infinite number of one-liners that made my ears bleed at one point. Why are we treated this way? Do the people who makes these movies really think we are so stupid?\r\n\r\nBefore I actually say something nice about Skyfall, because I can do that, I just want to give a small piece of advice to future Bond villains, because who are we kidding, there will be more Bond movies in the future… my advice is this: Always remember to close the door behind you, whether its an actual door, or maybe a manhole (cover). If you don't do this, Bond will surely find you. But of course, perhaps you are dying to have him on your tail, in which case, you are doing it exactly right!\r\n\r\nOK, something positive. Skyfall is a beautiful movie, in a very obvious (and superficial) way. The colors are just stunning, especially when we follow Bond swimming through the night of Shanghai, high above the streets. There is no denying the imagery and action of the movie, in every possible way, this is some of the best the world has to offer. I'd also like to give a shout out to Albert Finney, whose character (Kincade) raises the quality of the movie, and actually give it some human emotion.\r\n\r\nThe very last thing I want to say is this… why hire Sam Mendes for this movie? Why hire him when he is not allowed to use the powers that God have given him? Where are the human emotions, where are the dark humor, where are the personal stories that capture our hearts as much as our minds? If you want to watch a real Sam Mendes movie, I suggest the following American Beauty, Jarhead and even, Revolutionary Road.\r\n\r\n_Last words... only watch this movie if you have nothing to do… at all… and if you are a hardcore fan of 007 and feel forced to watch every movie in the franchise. This movie reminds me why I only rarely watch big Hollywood blockbusters._", "created_at": "2014-12-29T01:35:41.433Z"}, {"movie_id": 37724, "review_id": "58a8ef0cc3a368641c004d04", "author_rating": 10.0, "review_text": "How safe do you feel?\r\n\r\nBond 23 and 007 has to literally come back from the dead when a stolen hard-drive makes M (Dench) look bad at a time when a face from her past comes homing into blood thirsty view. \r\n\r\nThere is one sure fire fact in cinema that nobody can dispute, that of there never ever being a James Bond film that all Bondphiles will agree on. From each corner of the spectrum will come arguments that said Bond film is not gritty enough, not fun enough, not enough sex, not enough action, not enough fantastical stunts and etc etc etc. Well that's fine of course, we all have our peccadilloes we prefer in our Bond movies, but we do live in different times now, the world has changed, and so has Bond. You may not get the ultimate Bond you want, but this is a 21st Century Bond and a new era of 007 is upon us, something which makes Skyfall even the more bolder and braver because it marks the 50th anniversary by blending the old with the new and mostly achieving brilliant results. \r\n\r\nSkyfall allows us to bathe in nostalgia whilst also forcing us to re- evaluate just where we are at in terms of our beloved super secret agent. One of the great things about this Bond is that there is a bubbling under current of time's importance delicately perched on each side of James Bond's shoulders. Is he (and M etc) outdated? Or is the future still in need of such operatives/organisations? Director Mendes and his team don't take any of the easy options that were clearly available to them to answer the question, they instead build a film around Bond and M as characters, embrace the traditions of the series and hit us hard in head and heart. \r\n\r\nThe plot of Skyfall as written is simple, absolutely nailed on it is straight and true to Hollywood conventions, but what fills out the simple plot is a series of Bondian delights, thrills spills and emotionally splintered kills. The stunning pre-credits sequence sees Bond traverse the rooftops of Istanbul on a motorcycle and then fight on top of a speeding train. Only to then find himself expendable. Which leads to Daniel Kleinman's title credits sequence that is filled with ominous portents of death and blood, in turn backed by the wonderfully Bondian of old title song warbled by Adele. It's clear at this point that this Bond movie is nodding to traditional values whilst promising to deliver some emotional pain. And so it proves. \r\n\r\nA washed up Bond enters the fray, and he convinces, he's dishevelled, unshaven and unfit, but he's still a tough bastard who can drink hard and stare a scorpion down. He'll be back soon, we know this, and he will be in wonderful physical shape, and loyal to his surrogate mother for sure. Ah, but there's the adversary on the scene now, a villain to finally give Craig's Bond something to fret about. It's Javier Bardem's (perfect) Silva, a cyber terrorist with a shock of blonde hair, a nasty dental trick and a devilish sexiness that unnerves during an interrogation scene; to which Bond cheekily opens up some wink wink possibilities. There is other sexual tension in the film as well, not just a steamy shower scene, but the ongoing banter with Naomie Harris' (excellent) Eve that positively fizzes with smirking innuendo. \r\n\r\nBut ultimately this comes down to the love between a man and a woman, the kind that is so different to the type that has so often underpinned a Bond movie. Bond will kill or be killed for M, and how marvellous to see a director really able to give Judi Dench the direction she so deserves, and Bond, in Craig's magnetic and gritty hands, responds in kind to deliver a last half hour as good as any in the 50 years of Bond on film. As we know, all turf is Bond's turf, but this time it really is HIS turf, and as a little back story comes seeping out, Bond gets to exorcise some demons whilst kicking considerable ass. Get ready Bondphiles, this has the emotional wallop only seen in the best Bond movies of old. \r\n\r\nAll the Bondian trappings are still here, exotic locales, gorgeous women, speeding vehicles, fights, stupendous stunts, bizarre lairs and balls out machismo. It's also funny! I myself commented when reviewing Quantum of Solace that it was pretty ace as an action film, but for many it's not Bondian enough, and the truth of the matter is Bond still needs to have a degree of fun, no matter how grim and gritty the story line is. Thankfully Skyfall is often a blast, with Craig (surely convincing even the most stubborn of dissenters how good a Bond he is) having the confidence and skill to lace his Bond's macho broody instinct with a desert dry wit and shrug of the shoulders nonchalance. Other side of the camera the tech credits are high, with Deakins proving to be one of the aces in the pack. His capturing of vistas, be it a neon city scape or a mountainous valley, are eye delights, his colour tones are beautiful, I promise you, nobody these days does golden browns like Deakins. \r\n\r\nIt's not the masterpiece that I or gazillions of others hoped for, and it does have flaws (new Q a bit too geeky safe, finale lacks a substantial battle with the villain) and it remains simple in plot, but it's Bond's birthday and the birthday boy has been done proud by the makers. It's a new era Bond for sure, but that most definitely isn't a bad thing, it knows its past and it now knows its future, and without doubt we all still know the name. 9/10", "created_at": "2017-02-19T01:04:12.328Z"}, {"movie_id": 37724, "review_id": "5aaf94ca92514116ae036a85", "author_rating": 2.0, "review_text": "Me and my oldest son have been doing a bit of pseudo binge watching of James Bond. Every weekend we have been watching two of the movies starting with Dr. No quite a few weekends ago. Last weekend we arrived at the Daniel Craig ones. I had actually not watched those ones before. I have to, grudgingly (I am a Sean Connery fan), admit that the first two we watched were not at all bad.\r\n\r\nHowever, today we watched Skyfall. What the f…? This is not a James Bond movie! If it had been just some other movie I would probably have thought it would not be a too bad one. However, it pretends to be a James Bond movie and as such it is utter crap. It is a bloody Hollywood drama written by someone with a total lack of respect for the Franchise, not to mention the old Bond fans.\r\n\r\nJames Bond should be out hunting international villains. Villains with a good chunk of bad guy charisma I might add. What we got however was some loathsome prick having a grudge because M didn’t come to his rescue when he fucked up.\r\n\r\nThe British Secret service should also be just that, a powerful organisation protecting Britain (and the rest of the civilized world) from communists, terrorists, criminal superorganisations like Spectre or whatever.  Having scenes with M more or less on trial and having to defend herself in front of a bunch of clueless political asshats is just crap and it is definitely not the kind of crap that should be in a James Bond movie.\r\n\r\nThe whole movie is just full of sensationalist shit, politically correct crap, killing of popular characters, sentimental bullshit and other nonsens of the kind you would expect in a bloody Hollywood soap opera. And what about the new Q? A boring brat with a over-inflated ego. Not fun at all.\r\n\r\nEven the special effects are debatable. For example, if you make a subway train crash by blowing a hole in it’s path then for Christ sake put some crash test dummies or something in it to at least make some pretense of it not being an empty mock-up!\r\n\r\nThis is undoubtedly the worst Bond movie ever. My disappointment with this movie cannot be overstated.", "created_at": "2018-03-19T10:45:30.502Z"}, {"movie_id": 37724, "review_id": "5e97dedbd1444300195088f9", "author_rating": 8.0, "review_text": "Great theme song and a much more balanced movie compared to Quantum of Solace, and the story is well written, revealing Bond's background and the motherly relationship with M (contrast with a more antagonistic portrayal in the Brosnan series). Javier Bardem as the villain was fantastic, almost Joker like in his planning. The only setback is the finale, sure some nice action and explosions but not quite as thrilling versus Casino Royale. Still, one of the better in the Bond series overall. **4.0/5**", "created_at": "2020-04-16T04:28:11.927Z"}, {"movie_id": 37724, "review_id": "60b52929dd926a00294721bb", "author_rating": 8.0, "review_text": "_**Can you go home again?**_\r\n\r\nAfter 007 (Daniel Craig) is thought dead-in-action in Turkey, the computer of ‘M’ (Judi Dench) is hacked and there’s an attack on the MI6 headquarters in London. M & Bond suspect it’s an inside job, which leads James to Shanghai, Macao and a mysterious island off the coast of China, then back to London. Bond has to find sanctuary for M, but you know what they say about going home again? Javier Bardem plays a heavy and Ralph Fiennes an MI6 official.\r\n\r\n“Skyfall” (2012) thankfully includes the character depth of “Casino Royale” (2006) and fixes the confusing 4 clips-per-second action of “Quantum of Solace” (2008). Don’t get me wrong, “Quantum” can be appreciated as the action-oriented second half of “Casino Royale,” but it’s easily one of the lesser installments in the franchise. “Skyfall,” by contrast, stands with the best.\r\n\r\nThe movie saves the best for last, but I don’t want to give anything away. Let’s just say it’s a refreshing change for the series, the locations are fabulous and a classic actor unexpectedly shows up.  \r\n\r\nBesides Dench on the feminine front, there’s Bérénice Marlohe as Severine in China and Naomie Harris as MI6 agent Eve. Tonia Sotiropoulou also has a brief scene in Turkey.\r\n\r\nThe film runs 2 hours, 23 minutes, and was shot in Turkey, England, China and Scotland.\r\n\r\nGRADE: A-", "created_at": "2021-05-31T18:21:29.913Z"}, {"movie_id": 37724, "review_id": "615350b2f04d0100444f8244", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/skyfall-spoiler-free-review\r\n\r\n\"Skyfall is not only the entry that this James Bond saga needed, but it's my favorite movie of the Daniel Craig Era. From the exceptionally intriguing narrative filled with shocking developments to Javier Bardem's terrifying portrayal of a fascinating antagonist, Sam Mendes offers his remarkable directing skills to create a film worthy of much praise.\r\n\r\nThe GOAT of cinematography, Roger Deakins, makes every inch of the screen drip cinematic beauty with eyegasmic wide shots and mind-blowing lighting, making this the best-looking Bond flick ever. Technically, it's challenging to find elements less than simply perfect.\r\n\r\nPhenomenal acting all-around elevates an extraordinarily impactful character work, culminating in an emotionally powerful third act. A slightly overextended runtime doesn't stop me from considering this a flawless Bond movie.\r\n\r\nI can't endorse it more than this.\"\r\n\r\nRating: A", "created_at": "2021-09-28T17:28:18.186Z"}, {"movie_id": 37724, "review_id": "6328218553866e007d7fce01", "author_rating": 7.0, "review_text": "Ok, first things first. \"Skyfall\" and \"crumble\" do not rhyme. Sorry Adele, but they don't! Luckily, the rest of this story is almost as good as \"Casino Royale\" (2006). Daniel Craig reprises his role as \"007\", this time charged with thwarting a dastardly plan by the enigmatic \"Silva\" to avenge himself on none other than \"M\" (Dame Judi Dench) herself. He has managed to successfully infiltrate just about every system MI6 has and obtain a list of agents the world over. When he starts publishing these names, and the body count starts to rise, it falls to \"Bond\" to engage with his clever and malevolent foe. Bardem is effective as the baddie here. He has a certain, almost menacing, effeteness as he quite literally toys with his quarry. Loads of gadgets, explosions, a welcome appearance from the original Aston Martin and an action-packed pace keep this moving along well. The ending is a bit far-fetched, even by \"James Bond\" standards, and that even though it did give us chance to enjoy a suitably eclectic contribution from Albert Finney, was all just bit daft. The supporting efforts don't bode so well, either. Ralph Fiennes seems set for a larger role in future films and he doesn't really add much and though she does well enough, the role offered to Naomie Harris' \"Eve\" is just too insubstantial for her to assert herself on much of the story. That said, though, it's very much at the top end of the Craig outings for this character and it does look good on big screen,", "created_at": "2022-09-19T08:00:05.324Z"}, {"movie_id": 37724, "review_id": "6352fcf0244182007f238fc7", "author_rating": 9.0, "review_text": "**Skyfall understands, admires, and elevates Bond to excellence and mastery to an unexpected level and unmatched by its predecessors.**\r\n\r\nSkyfall is The Dark Knight of Daniel Craig’s James Bond films. Sam Mendes took all Casino Royale had built and elevated it to heights never before reached by Bond. Everything fires perfectly on all cylinders. The story is rich and delves further into the character of a bond than ever before. The action set pieces, the locales, and the cinematography are all masterpieces that establish Skyfall as an excellent James Bond film but take it further, placing it among the best movies of all time. Judi Dench’s performance as M cements her legacy as a Bond great. And the excellent supporting cast grows with the brilliant casting and performances of Naomi Harris as Moneypenny, Ralph Fiennes as Mallory, and Ben Whishaw as Q. Still, the biggest standout is Javier Bardem as the villainous Silva - one of the greatest Bond antagonists of all time. His unpredictable and menacing nature is cloaked in a slightly goofy demeanor and skewed moral code. Skyfall asks and answers questions unlike any Bond before while staying true to what makes James Bond so compelling and entertaining. Just like The Dark Knight for Batman, even people who are not traditional Bond fans will be impressed with Skyfall.", "created_at": "2022-10-21T20:11:28.906Z"}, {"movie_id": 37724, "review_id": "63be6efefa4046008757a415", "author_rating": 10.0, "review_text": "By the time Skyfall dropped my hatred of Craig Era Bond was pretty solidified. I started to realize that this was going to be the Bond that hated being Bond. That Bond was going to go down a dark hole that I was really going to loath.\r\n\r\nBut... Javier Bardem really nailed it didn't he?\r\n\r\nJavier Bardem nailed it. Judi Dench had her best showing as M... ever, in fact it was so good that it kind of made you made she was relegated to a side character in all the other Bond movies.\r\n\r\nAnd the story was great... it was so great that Disneyer ripped off huge chunks of it when they made Black Panther.\r\n\r\nBy 2012 you got the feeling that Sony was going to take the 007 down a dark and evil rabbit hole that would destroy the Franchise, but Skyfall still ranks as one of the best Bond movies in franchise history.", "created_at": "2023-01-11T08:10:38.647Z"}, {"movie_id": 37724, "review_id": "643e19bbd7a70a0507aae5a4", "author_rating": 3.0, "review_text": "Keeping the Bond series down.\r\nPoor Daniel Craig isn't at fault for these totally uninspired, unmotivated stories he appears in.\r\nMaybe his agent is at fault. But while Craig makes money, his memory will be forgotten in a hundred years, if these 007 fiascos are his high points. \r\nThey probably won't be his high points. Good for him.\r\nHere, we get more of the modern day movie making which eliminates all the exotic scenery and all the wit and all the inspiration and all the motivation.\r\nInstead, we get another demigod villain on the order of horror movies. He may as well be Freddy, Jason, or Wishmaster. That's how he's written.\r\nSo, we have the worst Bond villain in movie history. Certainly, he's the most Hollywood.\r\nWhich makes this as dull as watching a pot boil.\r\nEven the high octane action sequences can't save this flop.", "created_at": "2023-04-18T04:16:59.827Z"}, {"movie_id": 37724, "review_id": "50bf768719c2950644000e62", "author_rating": 8.0, "review_text": "Skyfall was a solid movie in its own right but as a Bond movie, it was one of my all time favourites. Unlike Quantum of Solace, I felt like they actually took the time to tell this story and the pay off was worth it.\r\n\r\nSomething I found interesting is the idea about Bond getting old and how the job of an MI6 agent is not something you can do forever. It makes me wonder if they might explore some of these themes in the next movie.\r\n\r\nIt's true that the last 1/3 of Skyfall didn't feel like a Bond movie at all and I think that's why I loved it. The Daniel Craig Bond movies have always taken a different look at James Bond and Skyfall was no exception.\r\n\r\nLike I said, great movie. Execution on all accounts were solid like you'd expect. I hope Mendes gets a chance to do the next film.", "created_at": "2012-12-05T16:29:59.000Z"}, {"movie_id": 37724, "review_id": "514297f219c29552e70e99c7", "author_rating": 8.5, "review_text": "Skyfall is a great movie. In my opinion the best proformas by Daniel Craig I have see in all his Bond movies. The title song was not to my taste like in previous movies. The story line is one of the most compelling I have seen in a while. Silva, played by Javier Bardem was excellent and he played him very well. All in all a very good movie.", "created_at": "2013-03-15T03:39:30.913Z"}, {"movie_id": 37724, "review_id": "54a0afed925141313200b7a5", "author_rating": 3.0, "review_text": "Bond (Daniel Craig) is on another (important) mission somewhere in the big world, this time on the heels of someone who has stolen a hard drive with all the names of the British agents who work for MI6. On the mission, Mr. Bond is shot by one of his own (an agent named Eve, played by Naomie Harris) and presumed dead. However, Bond is not dead, and when he resurfaces, he jumps right into the game in the pursuit of an old agent called Silva (Javier Bardem), an old favorite of M (Judi Dench).\r\n\r\nWhile Bond is out in the world, M discovers that someone, presumably Silva, has hacked their computers and threats to expose the true names of the British agents. However, it is also clear that the enemy has other plans, plans of terrorism. Bond is now in a race against time before more agents are revealed, or worse yet, before M is killed by their mysterious enemy. Fortunately, everything works out perfectly for 007, who finds the mysterious Silva with little effort.\r\n\r\nOK, admittedly, this was a very short summary of the plot in Skyfall, but in all honesty, there isn't a big plot in this movie. I could have given some spoilers about the ending, and maybe added a bit about Mallory (Ralph fiennes), but really, this is an extremely simple plot. Not at all worthy of a big iconic character like James Bond.\r\n\r\nIt is classic 007, with everything thats part of such an adventure, like product placement (not a favorite of mine, in fact I get rather annoyed when its as obvious as the watch in the opening of the movie), car chases (in this case, more like a motorcycle chase across the roofs of some unknown city), beautiful women (which are exactly as shallow and pointless as you would expect), and lastly a total lack of emotions and realism.\r\n\r\nI am not a big Bond fan, and haven't seen all of the movies in the series, so I am probably not the right person to review this movie. I do not understand what it is that draws people into the cinema time after time, to watch yet another Bond movie… when they can watch something original with a real plot and real characters. Perhaps these people like the shallow characters, who care little for the safety of the innocent people in the world, yes, I said it. Look carefully in the opening sequence, how the female agent cares little for the people on the bridge, as she shoots after the enemy. Later in that scene, she finds it really hard to shoot the enemy, because what if she hit Bond instead. I may be wrong in this assumption, but isn't MI6 here to protect the innocent people? Perhaps these people like the almost infinite number of one-liners that made my ears bleed at one point. Why are we treated this way? Do the people who makes these movies really think we are so stupid?\r\n\r\nBefore I actually say something nice about Skyfall, because I can do that, I just want to give a small piece of advice to future Bond villains, because who are we kidding, there will be more Bond movies in the future… my advice is this: Always remember to close the door behind you, whether its an actual door, or maybe a manhole (cover). If you don't do this, Bond will surely find you. But of course, perhaps you are dying to have him on your tail, in which case, you are doing it exactly right!\r\n\r\nOK, something positive. Skyfall is a beautiful movie, in a very obvious (and superficial) way. The colors are just stunning, especially when we follow Bond swimming through the night of Shanghai, high above the streets. There is no denying the imagery and action of the movie, in every possible way, this is some of the best the world has to offer. I'd also like to give a shout out to Albert Finney, whose character (Kincade) raises the quality of the movie, and actually give it some human emotion.\r\n\r\nThe very last thing I want to say is this… why hire Sam Mendes for this movie? Why hire him when he is not allowed to use the powers that God have given him? Where are the human emotions, where are the dark humor, where are the personal stories that capture our hearts as much as our minds? If you want to watch a real Sam Mendes movie, I suggest the following American Beauty, Jarhead and even, Revolutionary Road.\r\n\r\n_Last words... only watch this movie if you have nothing to do… at all… and if you are a hardcore fan of 007 and feel forced to watch every movie in the franchise. This movie reminds me why I only rarely watch big Hollywood blockbusters._", "created_at": "2014-12-29T01:35:41.433Z"}, {"movie_id": 37724, "review_id": "58a8ef0cc3a368641c004d04", "author_rating": 10.0, "review_text": "How safe do you feel?\r\n\r\nBond 23 and 007 has to literally come back from the dead when a stolen hard-drive makes M (Dench) look bad at a time when a face from her past comes homing into blood thirsty view. \r\n\r\nThere is one sure fire fact in cinema that nobody can dispute, that of there never ever being a James Bond film that all Bondphiles will agree on. From each corner of the spectrum will come arguments that said Bond film is not gritty enough, not fun enough, not enough sex, not enough action, not enough fantastical stunts and etc etc etc. Well that's fine of course, we all have our peccadilloes we prefer in our Bond movies, but we do live in different times now, the world has changed, and so has Bond. You may not get the ultimate Bond you want, but this is a 21st Century Bond and a new era of 007 is upon us, something which makes Skyfall even the more bolder and braver because it marks the 50th anniversary by blending the old with the new and mostly achieving brilliant results. \r\n\r\nSkyfall allows us to bathe in nostalgia whilst also forcing us to re- evaluate just where we are at in terms of our beloved super secret agent. One of the great things about this Bond is that there is a bubbling under current of time's importance delicately perched on each side of James Bond's shoulders. Is he (and M etc) outdated? Or is the future still in need of such operatives/organisations? Director Mendes and his team don't take any of the easy options that were clearly available to them to answer the question, they instead build a film around Bond and M as characters, embrace the traditions of the series and hit us hard in head and heart. \r\n\r\nThe plot of Skyfall as written is simple, absolutely nailed on it is straight and true to Hollywood conventions, but what fills out the simple plot is a series of Bondian delights, thrills spills and emotionally splintered kills. The stunning pre-credits sequence sees Bond traverse the rooftops of Istanbul on a motorcycle and then fight on top of a speeding train. Only to then find himself expendable. Which leads to Daniel Kleinman's title credits sequence that is filled with ominous portents of death and blood, in turn backed by the wonderfully Bondian of old title song warbled by Adele. It's clear at this point that this Bond movie is nodding to traditional values whilst promising to deliver some emotional pain. And so it proves. \r\n\r\nA washed up Bond enters the fray, and he convinces, he's dishevelled, unshaven and unfit, but he's still a tough bastard who can drink hard and stare a scorpion down. He'll be back soon, we know this, and he will be in wonderful physical shape, and loyal to his surrogate mother for sure. Ah, but there's the adversary on the scene now, a villain to finally give Craig's Bond something to fret about. It's Javier Bardem's (perfect) Silva, a cyber terrorist with a shock of blonde hair, a nasty dental trick and a devilish sexiness that unnerves during an interrogation scene; to which Bond cheekily opens up some wink wink possibilities. There is other sexual tension in the film as well, not just a steamy shower scene, but the ongoing banter with Naomie Harris' (excellent) Eve that positively fizzes with smirking innuendo. \r\n\r\nBut ultimately this comes down to the love between a man and a woman, the kind that is so different to the type that has so often underpinned a Bond movie. Bond will kill or be killed for M, and how marvellous to see a director really able to give Judi Dench the direction she so deserves, and Bond, in Craig's magnetic and gritty hands, responds in kind to deliver a last half hour as good as any in the 50 years of Bond on film. As we know, all turf is Bond's turf, but this time it really is HIS turf, and as a little back story comes seeping out, Bond gets to exorcise some demons whilst kicking considerable ass. Get ready Bondphiles, this has the emotional wallop only seen in the best Bond movies of old. \r\n\r\nAll the Bondian trappings are still here, exotic locales, gorgeous women, speeding vehicles, fights, stupendous stunts, bizarre lairs and balls out machismo. It's also funny! I myself commented when reviewing Quantum of Solace that it was pretty ace as an action film, but for many it's not Bondian enough, and the truth of the matter is Bond still needs to have a degree of fun, no matter how grim and gritty the story line is. Thankfully Skyfall is often a blast, with Craig (surely convincing even the most stubborn of dissenters how good a Bond he is) having the confidence and skill to lace his Bond's macho broody instinct with a desert dry wit and shrug of the shoulders nonchalance. Other side of the camera the tech credits are high, with Deakins proving to be one of the aces in the pack. His capturing of vistas, be it a neon city scape or a mountainous valley, are eye delights, his colour tones are beautiful, I promise you, nobody these days does golden browns like Deakins. \r\n\r\nIt's not the masterpiece that I or gazillions of others hoped for, and it does have flaws (new Q a bit too geeky safe, finale lacks a substantial battle with the villain) and it remains simple in plot, but it's Bond's birthday and the birthday boy has been done proud by the makers. It's a new era Bond for sure, but that most definitely isn't a bad thing, it knows its past and it now knows its future, and without doubt we all still know the name. 9/10", "created_at": "2017-02-19T01:04:12.328Z"}, {"movie_id": 37724, "review_id": "5aaf94ca92514116ae036a85", "author_rating": 2.0, "review_text": "Me and my oldest son have been doing a bit of pseudo binge watching of James Bond. Every weekend we have been watching two of the movies starting with Dr. No quite a few weekends ago. Last weekend we arrived at the Daniel Craig ones. I had actually not watched those ones before. I have to, grudgingly (I am a Sean Connery fan), admit that the first two we watched were not at all bad.\r\n\r\nHowever, today we watched Skyfall. What the f…? This is not a James Bond movie! If it had been just some other movie I would probably have thought it would not be a too bad one. However, it pretends to be a James Bond movie and as such it is utter crap. It is a bloody Hollywood drama written by someone with a total lack of respect for the Franchise, not to mention the old Bond fans.\r\n\r\nJames Bond should be out hunting international villains. Villains with a good chunk of bad guy charisma I might add. What we got however was some loathsome prick having a grudge because M didn’t come to his rescue when he fucked up.\r\n\r\nThe British Secret service should also be just that, a powerful organisation protecting Britain (and the rest of the civilized world) from communists, terrorists, criminal superorganisations like Spectre or whatever.  Having scenes with M more or less on trial and having to defend herself in front of a bunch of clueless political asshats is just crap and it is definitely not the kind of crap that should be in a James Bond movie.\r\n\r\nThe whole movie is just full of sensationalist shit, politically correct crap, killing of popular characters, sentimental bullshit and other nonsens of the kind you would expect in a bloody Hollywood soap opera. And what about the new Q? A boring brat with a over-inflated ego. Not fun at all.\r\n\r\nEven the special effects are debatable. For example, if you make a subway train crash by blowing a hole in it’s path then for Christ sake put some crash test dummies or something in it to at least make some pretense of it not being an empty mock-up!\r\n\r\nThis is undoubtedly the worst Bond movie ever. My disappointment with this movie cannot be overstated.", "created_at": "2018-03-19T10:45:30.502Z"}, {"movie_id": 37724, "review_id": "5e97dedbd1444300195088f9", "author_rating": 8.0, "review_text": "Great theme song and a much more balanced movie compared to Quantum of Solace, and the story is well written, revealing Bond's background and the motherly relationship with M (contrast with a more antagonistic portrayal in the Brosnan series). Javier Bardem as the villain was fantastic, almost Joker like in his planning. The only setback is the finale, sure some nice action and explosions but not quite as thrilling versus Casino Royale. Still, one of the better in the Bond series overall. **4.0/5**", "created_at": "2020-04-16T04:28:11.927Z"}, {"movie_id": 37724, "review_id": "60b52929dd926a00294721bb", "author_rating": 8.0, "review_text": "_**Can you go home again?**_\r\n\r\nAfter 007 (Daniel Craig) is thought dead-in-action in Turkey, the computer of ‘M’ (Judi Dench) is hacked and there’s an attack on the MI6 headquarters in London. M & Bond suspect it’s an inside job, which leads James to Shanghai, Macao and a mysterious island off the coast of China, then back to London. Bond has to find sanctuary for M, but you know what they say about going home again? Javier Bardem plays a heavy and Ralph Fiennes an MI6 official.\r\n\r\n“Skyfall” (2012) thankfully includes the character depth of “Casino Royale” (2006) and fixes the confusing 4 clips-per-second action of “Quantum of Solace” (2008). Don’t get me wrong, “Quantum” can be appreciated as the action-oriented second half of “Casino Royale,” but it’s easily one of the lesser installments in the franchise. “Skyfall,” by contrast, stands with the best.\r\n\r\nThe movie saves the best for last, but I don’t want to give anything away. Let’s just say it’s a refreshing change for the series, the locations are fabulous and a classic actor unexpectedly shows up.  \r\n\r\nBesides Dench on the feminine front, there’s Bérénice Marlohe as Severine in China and Naomie Harris as MI6 agent Eve. Tonia Sotiropoulou also has a brief scene in Turkey.\r\n\r\nThe film runs 2 hours, 23 minutes, and was shot in Turkey, England, China and Scotland.\r\n\r\nGRADE: A-", "created_at": "2021-05-31T18:21:29.913Z"}, {"movie_id": 37724, "review_id": "615350b2f04d0100444f8244", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/skyfall-spoiler-free-review\r\n\r\n\"Skyfall is not only the entry that this James Bond saga needed, but it's my favorite movie of the Daniel Craig Era. From the exceptionally intriguing narrative filled with shocking developments to Javier Bardem's terrifying portrayal of a fascinating antagonist, Sam Mendes offers his remarkable directing skills to create a film worthy of much praise.\r\n\r\nThe GOAT of cinematography, Roger Deakins, makes every inch of the screen drip cinematic beauty with eyegasmic wide shots and mind-blowing lighting, making this the best-looking Bond flick ever. Technically, it's challenging to find elements less than simply perfect.\r\n\r\nPhenomenal acting all-around elevates an extraordinarily impactful character work, culminating in an emotionally powerful third act. A slightly overextended runtime doesn't stop me from considering this a flawless Bond movie.\r\n\r\nI can't endorse it more than this.\"\r\n\r\nRating: A", "created_at": "2021-09-28T17:28:18.186Z"}, {"movie_id": 37724, "review_id": "6328218553866e007d7fce01", "author_rating": 7.0, "review_text": "Ok, first things first. \"Skyfall\" and \"crumble\" do not rhyme. Sorry Adele, but they don't! Luckily, the rest of this story is almost as good as \"Casino Royale\" (2006). Daniel Craig reprises his role as \"007\", this time charged with thwarting a dastardly plan by the enigmatic \"Silva\" to avenge himself on none other than \"M\" (Dame Judi Dench) herself. He has managed to successfully infiltrate just about every system MI6 has and obtain a list of agents the world over. When he starts publishing these names, and the body count starts to rise, it falls to \"Bond\" to engage with his clever and malevolent foe. Bardem is effective as the baddie here. He has a certain, almost menacing, effeteness as he quite literally toys with his quarry. Loads of gadgets, explosions, a welcome appearance from the original Aston Martin and an action-packed pace keep this moving along well. The ending is a bit far-fetched, even by \"James Bond\" standards, and that even though it did give us chance to enjoy a suitably eclectic contribution from Albert Finney, was all just bit daft. The supporting efforts don't bode so well, either. Ralph Fiennes seems set for a larger role in future films and he doesn't really add much and though she does well enough, the role offered to Naomie Harris' \"Eve\" is just too insubstantial for her to assert herself on much of the story. That said, though, it's very much at the top end of the Craig outings for this character and it does look good on big screen,", "created_at": "2022-09-19T08:00:05.324Z"}, {"movie_id": 37724, "review_id": "6352fcf0244182007f238fc7", "author_rating": 9.0, "review_text": "**Skyfall understands, admires, and elevates Bond to excellence and mastery to an unexpected level and unmatched by its predecessors.**\r\n\r\nSkyfall is The Dark Knight of Daniel Craig’s James Bond films. Sam Mendes took all Casino Royale had built and elevated it to heights never before reached by Bond. Everything fires perfectly on all cylinders. The story is rich and delves further into the character of a bond than ever before. The action set pieces, the locales, and the cinematography are all masterpieces that establish Skyfall as an excellent James Bond film but take it further, placing it among the best movies of all time. Judi Dench’s performance as M cements her legacy as a Bond great. And the excellent supporting cast grows with the brilliant casting and performances of Naomi Harris as Moneypenny, Ralph Fiennes as Mallory, and Ben Whishaw as Q. Still, the biggest standout is Javier Bardem as the villainous Silva - one of the greatest Bond antagonists of all time. His unpredictable and menacing nature is cloaked in a slightly goofy demeanor and skewed moral code. Skyfall asks and answers questions unlike any Bond before while staying true to what makes James Bond so compelling and entertaining. Just like The Dark Knight for Batman, even people who are not traditional Bond fans will be impressed with Skyfall.", "created_at": "2022-10-21T20:11:28.906Z"}, {"movie_id": 37724, "review_id": "63be6efefa4046008757a415", "author_rating": 10.0, "review_text": "By the time Skyfall dropped my hatred of Craig Era Bond was pretty solidified. I started to realize that this was going to be the Bond that hated being Bond. That Bond was going to go down a dark hole that I was really going to loath.\r\n\r\nBut... Javier Bardem really nailed it didn't he?\r\n\r\nJavier Bardem nailed it. Judi Dench had her best showing as M... ever, in fact it was so good that it kind of made you made she was relegated to a side character in all the other Bond movies.\r\n\r\nAnd the story was great... it was so great that Disneyer ripped off huge chunks of it when they made Black Panther.\r\n\r\nBy 2012 you got the feeling that Sony was going to take the 007 down a dark and evil rabbit hole that would destroy the Franchise, but Skyfall still ranks as one of the best Bond movies in franchise history.", "created_at": "2023-01-11T08:10:38.647Z"}, {"movie_id": 37724, "review_id": "643e19bbd7a70a0507aae5a4", "author_rating": 3.0, "review_text": "Keeping the Bond series down.\r\nPoor Daniel Craig isn't at fault for these totally uninspired, unmotivated stories he appears in.\r\nMaybe his agent is at fault. But while Craig makes money, his memory will be forgotten in a hundred years, if these 007 fiascos are his high points. \r\nThey probably won't be his high points. Good for him.\r\nHere, we get more of the modern day movie making which eliminates all the exotic scenery and all the wit and all the inspiration and all the motivation.\r\nInstead, we get another demigod villain on the order of horror movies. He may as well be Freddy, Jason, or Wishmaster. That's how he's written.\r\nSo, we have the worst Bond villain in movie history. Certainly, he's the most Hollywood.\r\nWhich makes this as dull as watching a pot boil.\r\nEven the high octane action sequences can't save this flop.", "created_at": "2023-04-18T04:16:59.827Z"}, {"movie_id": 37724, "review_id": "50bf768719c2950644000e62", "author_rating": 8.0, "review_text": "Skyfall was a solid movie in its own right but as a Bond movie, it was one of my all time favourites. Unlike Quantum of Solace, I felt like they actually took the time to tell this story and the pay off was worth it.\r\n\r\nSomething I found interesting is the idea about Bond getting old and how the job of an MI6 agent is not something you can do forever. It makes me wonder if they might explore some of these themes in the next movie.\r\n\r\nIt's true that the last 1/3 of Skyfall didn't feel like a Bond movie at all and I think that's why I loved it. The Daniel Craig Bond movies have always taken a different look at James Bond and Skyfall was no exception.\r\n\r\nLike I said, great movie. Execution on all accounts were solid like you'd expect. I hope Mendes gets a chance to do the next film.", "created_at": "2012-12-05T16:29:59.000Z"}, {"movie_id": 37724, "review_id": "514297f219c29552e70e99c7", "author_rating": 8.5, "review_text": "Skyfall is a great movie. In my opinion the best proformas by Daniel Craig I have see in all his Bond movies. The title song was not to my taste like in previous movies. The story line is one of the most compelling I have seen in a while. Silva, played by Javier Bardem was excellent and he played him very well. All in all a very good movie.", "created_at": "2013-03-15T03:39:30.913Z"}, {"movie_id": 37724, "review_id": "54a0afed925141313200b7a5", "author_rating": 3.0, "review_text": "Bond (Daniel Craig) is on another (important) mission somewhere in the big world, this time on the heels of someone who has stolen a hard drive with all the names of the British agents who work for MI6. On the mission, Mr. Bond is shot by one of his own (an agent named Eve, played by Naomie Harris) and presumed dead. However, Bond is not dead, and when he resurfaces, he jumps right into the game in the pursuit of an old agent called Silva (Javier Bardem), an old favorite of M (Judi Dench).\r\n\r\nWhile Bond is out in the world, M discovers that someone, presumably Silva, has hacked their computers and threats to expose the true names of the British agents. However, it is also clear that the enemy has other plans, plans of terrorism. Bond is now in a race against time before more agents are revealed, or worse yet, before M is killed by their mysterious enemy. Fortunately, everything works out perfectly for 007, who finds the mysterious Silva with little effort.\r\n\r\nOK, admittedly, this was a very short summary of the plot in Skyfall, but in all honesty, there isn't a big plot in this movie. I could have given some spoilers about the ending, and maybe added a bit about Mallory (Ralph fiennes), but really, this is an extremely simple plot. Not at all worthy of a big iconic character like James Bond.\r\n\r\nIt is classic 007, with everything thats part of such an adventure, like product placement (not a favorite of mine, in fact I get rather annoyed when its as obvious as the watch in the opening of the movie), car chases (in this case, more like a motorcycle chase across the roofs of some unknown city), beautiful women (which are exactly as shallow and pointless as you would expect), and lastly a total lack of emotions and realism.\r\n\r\nI am not a big Bond fan, and haven't seen all of the movies in the series, so I am probably not the right person to review this movie. I do not understand what it is that draws people into the cinema time after time, to watch yet another Bond movie… when they can watch something original with a real plot and real characters. Perhaps these people like the shallow characters, who care little for the safety of the innocent people in the world, yes, I said it. Look carefully in the opening sequence, how the female agent cares little for the people on the bridge, as she shoots after the enemy. Later in that scene, she finds it really hard to shoot the enemy, because what if she hit Bond instead. I may be wrong in this assumption, but isn't MI6 here to protect the innocent people? Perhaps these people like the almost infinite number of one-liners that made my ears bleed at one point. Why are we treated this way? Do the people who makes these movies really think we are so stupid?\r\n\r\nBefore I actually say something nice about Skyfall, because I can do that, I just want to give a small piece of advice to future Bond villains, because who are we kidding, there will be more Bond movies in the future… my advice is this: Always remember to close the door behind you, whether its an actual door, or maybe a manhole (cover). If you don't do this, Bond will surely find you. But of course, perhaps you are dying to have him on your tail, in which case, you are doing it exactly right!\r\n\r\nOK, something positive. Skyfall is a beautiful movie, in a very obvious (and superficial) way. The colors are just stunning, especially when we follow Bond swimming through the night of Shanghai, high above the streets. There is no denying the imagery and action of the movie, in every possible way, this is some of the best the world has to offer. I'd also like to give a shout out to Albert Finney, whose character (Kincade) raises the quality of the movie, and actually give it some human emotion.\r\n\r\nThe very last thing I want to say is this… why hire Sam Mendes for this movie? Why hire him when he is not allowed to use the powers that God have given him? Where are the human emotions, where are the dark humor, where are the personal stories that capture our hearts as much as our minds? If you want to watch a real Sam Mendes movie, I suggest the following American Beauty, Jarhead and even, Revolutionary Road.\r\n\r\n_Last words... only watch this movie if you have nothing to do… at all… and if you are a hardcore fan of 007 and feel forced to watch every movie in the franchise. This movie reminds me why I only rarely watch big Hollywood blockbusters._", "created_at": "2014-12-29T01:35:41.433Z"}, {"movie_id": 37724, "review_id": "58a8ef0cc3a368641c004d04", "author_rating": 10.0, "review_text": "How safe do you feel?\r\n\r\nBond 23 and 007 has to literally come back from the dead when a stolen hard-drive makes M (Dench) look bad at a time when a face from her past comes homing into blood thirsty view. \r\n\r\nThere is one sure fire fact in cinema that nobody can dispute, that of there never ever being a James Bond film that all Bondphiles will agree on. From each corner of the spectrum will come arguments that said Bond film is not gritty enough, not fun enough, not enough sex, not enough action, not enough fantastical stunts and etc etc etc. Well that's fine of course, we all have our peccadilloes we prefer in our Bond movies, but we do live in different times now, the world has changed, and so has Bond. You may not get the ultimate Bond you want, but this is a 21st Century Bond and a new era of 007 is upon us, something which makes Skyfall even the more bolder and braver because it marks the 50th anniversary by blending the old with the new and mostly achieving brilliant results. \r\n\r\nSkyfall allows us to bathe in nostalgia whilst also forcing us to re- evaluate just where we are at in terms of our beloved super secret agent. One of the great things about this Bond is that there is a bubbling under current of time's importance delicately perched on each side of James Bond's shoulders. Is he (and M etc) outdated? Or is the future still in need of such operatives/organisations? Director Mendes and his team don't take any of the easy options that were clearly available to them to answer the question, they instead build a film around Bond and M as characters, embrace the traditions of the series and hit us hard in head and heart. \r\n\r\nThe plot of Skyfall as written is simple, absolutely nailed on it is straight and true to Hollywood conventions, but what fills out the simple plot is a series of Bondian delights, thrills spills and emotionally splintered kills. The stunning pre-credits sequence sees Bond traverse the rooftops of Istanbul on a motorcycle and then fight on top of a speeding train. Only to then find himself expendable. Which leads to Daniel Kleinman's title credits sequence that is filled with ominous portents of death and blood, in turn backed by the wonderfully Bondian of old title song warbled by Adele. It's clear at this point that this Bond movie is nodding to traditional values whilst promising to deliver some emotional pain. And so it proves. \r\n\r\nA washed up Bond enters the fray, and he convinces, he's dishevelled, unshaven and unfit, but he's still a tough bastard who can drink hard and stare a scorpion down. He'll be back soon, we know this, and he will be in wonderful physical shape, and loyal to his surrogate mother for sure. Ah, but there's the adversary on the scene now, a villain to finally give Craig's Bond something to fret about. It's Javier Bardem's (perfect) Silva, a cyber terrorist with a shock of blonde hair, a nasty dental trick and a devilish sexiness that unnerves during an interrogation scene; to which Bond cheekily opens up some wink wink possibilities. There is other sexual tension in the film as well, not just a steamy shower scene, but the ongoing banter with Naomie Harris' (excellent) Eve that positively fizzes with smirking innuendo. \r\n\r\nBut ultimately this comes down to the love between a man and a woman, the kind that is so different to the type that has so often underpinned a Bond movie. Bond will kill or be killed for M, and how marvellous to see a director really able to give Judi Dench the direction she so deserves, and Bond, in Craig's magnetic and gritty hands, responds in kind to deliver a last half hour as good as any in the 50 years of Bond on film. As we know, all turf is Bond's turf, but this time it really is HIS turf, and as a little back story comes seeping out, Bond gets to exorcise some demons whilst kicking considerable ass. Get ready Bondphiles, this has the emotional wallop only seen in the best Bond movies of old. \r\n\r\nAll the Bondian trappings are still here, exotic locales, gorgeous women, speeding vehicles, fights, stupendous stunts, bizarre lairs and balls out machismo. It's also funny! I myself commented when reviewing Quantum of Solace that it was pretty ace as an action film, but for many it's not Bondian enough, and the truth of the matter is Bond still needs to have a degree of fun, no matter how grim and gritty the story line is. Thankfully Skyfall is often a blast, with Craig (surely convincing even the most stubborn of dissenters how good a Bond he is) having the confidence and skill to lace his Bond's macho broody instinct with a desert dry wit and shrug of the shoulders nonchalance. Other side of the camera the tech credits are high, with Deakins proving to be one of the aces in the pack. His capturing of vistas, be it a neon city scape or a mountainous valley, are eye delights, his colour tones are beautiful, I promise you, nobody these days does golden browns like Deakins. \r\n\r\nIt's not the masterpiece that I or gazillions of others hoped for, and it does have flaws (new Q a bit too geeky safe, finale lacks a substantial battle with the villain) and it remains simple in plot, but it's Bond's birthday and the birthday boy has been done proud by the makers. It's a new era Bond for sure, but that most definitely isn't a bad thing, it knows its past and it now knows its future, and without doubt we all still know the name. 9/10", "created_at": "2017-02-19T01:04:12.328Z"}, {"movie_id": 37724, "review_id": "5aaf94ca92514116ae036a85", "author_rating": 2.0, "review_text": "Me and my oldest son have been doing a bit of pseudo binge watching of James Bond. Every weekend we have been watching two of the movies starting with Dr. No quite a few weekends ago. Last weekend we arrived at the Daniel Craig ones. I had actually not watched those ones before. I have to, grudgingly (I am a Sean Connery fan), admit that the first two we watched were not at all bad.\r\n\r\nHowever, today we watched Skyfall. What the f…? This is not a James Bond movie! If it had been just some other movie I would probably have thought it would not be a too bad one. However, it pretends to be a James Bond movie and as such it is utter crap. It is a bloody Hollywood drama written by someone with a total lack of respect for the Franchise, not to mention the old Bond fans.\r\n\r\nJames Bond should be out hunting international villains. Villains with a good chunk of bad guy charisma I might add. What we got however was some loathsome prick having a grudge because M didn’t come to his rescue when he fucked up.\r\n\r\nThe British Secret service should also be just that, a powerful organisation protecting Britain (and the rest of the civilized world) from communists, terrorists, criminal superorganisations like Spectre or whatever.  Having scenes with M more or less on trial and having to defend herself in front of a bunch of clueless political asshats is just crap and it is definitely not the kind of crap that should be in a James Bond movie.\r\n\r\nThe whole movie is just full of sensationalist shit, politically correct crap, killing of popular characters, sentimental bullshit and other nonsens of the kind you would expect in a bloody Hollywood soap opera. And what about the new Q? A boring brat with a over-inflated ego. Not fun at all.\r\n\r\nEven the special effects are debatable. For example, if you make a subway train crash by blowing a hole in it’s path then for Christ sake put some crash test dummies or something in it to at least make some pretense of it not being an empty mock-up!\r\n\r\nThis is undoubtedly the worst Bond movie ever. My disappointment with this movie cannot be overstated.", "created_at": "2018-03-19T10:45:30.502Z"}, {"movie_id": 37724, "review_id": "5e97dedbd1444300195088f9", "author_rating": 8.0, "review_text": "Great theme song and a much more balanced movie compared to Quantum of Solace, and the story is well written, revealing Bond's background and the motherly relationship with M (contrast with a more antagonistic portrayal in the Brosnan series). Javier Bardem as the villain was fantastic, almost Joker like in his planning. The only setback is the finale, sure some nice action and explosions but not quite as thrilling versus Casino Royale. Still, one of the better in the Bond series overall. **4.0/5**", "created_at": "2020-04-16T04:28:11.927Z"}, {"movie_id": 37724, "review_id": "60b52929dd926a00294721bb", "author_rating": 8.0, "review_text": "_**Can you go home again?**_\r\n\r\nAfter 007 (Daniel Craig) is thought dead-in-action in Turkey, the computer of ‘M’ (Judi Dench) is hacked and there’s an attack on the MI6 headquarters in London. M & Bond suspect it’s an inside job, which leads James to Shanghai, Macao and a mysterious island off the coast of China, then back to London. Bond has to find sanctuary for M, but you know what they say about going home again? Javier Bardem plays a heavy and Ralph Fiennes an MI6 official.\r\n\r\n“Skyfall” (2012) thankfully includes the character depth of “Casino Royale” (2006) and fixes the confusing 4 clips-per-second action of “Quantum of Solace” (2008). Don’t get me wrong, “Quantum” can be appreciated as the action-oriented second half of “Casino Royale,” but it’s easily one of the lesser installments in the franchise. “Skyfall,” by contrast, stands with the best.\r\n\r\nThe movie saves the best for last, but I don’t want to give anything away. Let’s just say it’s a refreshing change for the series, the locations are fabulous and a classic actor unexpectedly shows up.  \r\n\r\nBesides Dench on the feminine front, there’s Bérénice Marlohe as Severine in China and Naomie Harris as MI6 agent Eve. Tonia Sotiropoulou also has a brief scene in Turkey.\r\n\r\nThe film runs 2 hours, 23 minutes, and was shot in Turkey, England, China and Scotland.\r\n\r\nGRADE: A-", "created_at": "2021-05-31T18:21:29.913Z"}, {"movie_id": 37724, "review_id": "615350b2f04d0100444f8244", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/skyfall-spoiler-free-review\r\n\r\n\"Skyfall is not only the entry that this James Bond saga needed, but it's my favorite movie of the Daniel Craig Era. From the exceptionally intriguing narrative filled with shocking developments to Javier Bardem's terrifying portrayal of a fascinating antagonist, Sam Mendes offers his remarkable directing skills to create a film worthy of much praise.\r\n\r\nThe GOAT of cinematography, Roger Deakins, makes every inch of the screen drip cinematic beauty with eyegasmic wide shots and mind-blowing lighting, making this the best-looking Bond flick ever. Technically, it's challenging to find elements less than simply perfect.\r\n\r\nPhenomenal acting all-around elevates an extraordinarily impactful character work, culminating in an emotionally powerful third act. A slightly overextended runtime doesn't stop me from considering this a flawless Bond movie.\r\n\r\nI can't endorse it more than this.\"\r\n\r\nRating: A", "created_at": "2021-09-28T17:28:18.186Z"}, {"movie_id": 37724, "review_id": "6328218553866e007d7fce01", "author_rating": 7.0, "review_text": "Ok, first things first. \"Skyfall\" and \"crumble\" do not rhyme. Sorry Adele, but they don't! Luckily, the rest of this story is almost as good as \"Casino Royale\" (2006). Daniel Craig reprises his role as \"007\", this time charged with thwarting a dastardly plan by the enigmatic \"Silva\" to avenge himself on none other than \"M\" (Dame Judi Dench) herself. He has managed to successfully infiltrate just about every system MI6 has and obtain a list of agents the world over. When he starts publishing these names, and the body count starts to rise, it falls to \"Bond\" to engage with his clever and malevolent foe. Bardem is effective as the baddie here. He has a certain, almost menacing, effeteness as he quite literally toys with his quarry. Loads of gadgets, explosions, a welcome appearance from the original Aston Martin and an action-packed pace keep this moving along well. The ending is a bit far-fetched, even by \"James Bond\" standards, and that even though it did give us chance to enjoy a suitably eclectic contribution from Albert Finney, was all just bit daft. The supporting efforts don't bode so well, either. Ralph Fiennes seems set for a larger role in future films and he doesn't really add much and though she does well enough, the role offered to Naomie Harris' \"Eve\" is just too insubstantial for her to assert herself on much of the story. That said, though, it's very much at the top end of the Craig outings for this character and it does look good on big screen,", "created_at": "2022-09-19T08:00:05.324Z"}, {"movie_id": 37724, "review_id": "6352fcf0244182007f238fc7", "author_rating": 9.0, "review_text": "**Skyfall understands, admires, and elevates Bond to excellence and mastery to an unexpected level and unmatched by its predecessors.**\r\n\r\nSkyfall is The Dark Knight of Daniel Craig’s James Bond films. Sam Mendes took all Casino Royale had built and elevated it to heights never before reached by Bond. Everything fires perfectly on all cylinders. The story is rich and delves further into the character of a bond than ever before. The action set pieces, the locales, and the cinematography are all masterpieces that establish Skyfall as an excellent James Bond film but take it further, placing it among the best movies of all time. Judi Dench’s performance as M cements her legacy as a Bond great. And the excellent supporting cast grows with the brilliant casting and performances of Naomi Harris as Moneypenny, Ralph Fiennes as Mallory, and Ben Whishaw as Q. Still, the biggest standout is Javier Bardem as the villainous Silva - one of the greatest Bond antagonists of all time. His unpredictable and menacing nature is cloaked in a slightly goofy demeanor and skewed moral code. Skyfall asks and answers questions unlike any Bond before while staying true to what makes James Bond so compelling and entertaining. Just like The Dark Knight for Batman, even people who are not traditional Bond fans will be impressed with Skyfall.", "created_at": "2022-10-21T20:11:28.906Z"}, {"movie_id": 37724, "review_id": "63be6efefa4046008757a415", "author_rating": 10.0, "review_text": "By the time Skyfall dropped my hatred of Craig Era Bond was pretty solidified. I started to realize that this was going to be the Bond that hated being Bond. That Bond was going to go down a dark hole that I was really going to loath.\r\n\r\nBut... Javier Bardem really nailed it didn't he?\r\n\r\nJavier Bardem nailed it. Judi Dench had her best showing as M... ever, in fact it was so good that it kind of made you made she was relegated to a side character in all the other Bond movies.\r\n\r\nAnd the story was great... it was so great that Disneyer ripped off huge chunks of it when they made Black Panther.\r\n\r\nBy 2012 you got the feeling that Sony was going to take the 007 down a dark and evil rabbit hole that would destroy the Franchise, but Skyfall still ranks as one of the best Bond movies in franchise history.", "created_at": "2023-01-11T08:10:38.647Z"}, {"movie_id": 37724, "review_id": "643e19bbd7a70a0507aae5a4", "author_rating": 3.0, "review_text": "Keeping the Bond series down.\r\nPoor Daniel Craig isn't at fault for these totally uninspired, unmotivated stories he appears in.\r\nMaybe his agent is at fault. But while Craig makes money, his memory will be forgotten in a hundred years, if these 007 fiascos are his high points. \r\nThey probably won't be his high points. Good for him.\r\nHere, we get more of the modern day movie making which eliminates all the exotic scenery and all the wit and all the inspiration and all the motivation.\r\nInstead, we get another demigod villain on the order of horror movies. He may as well be Freddy, Jason, or Wishmaster. That's how he's written.\r\nSo, we have the worst Bond villain in movie history. Certainly, he's the most Hollywood.\r\nWhich makes this as dull as watching a pot boil.\r\nEven the high octane action sequences can't save this flop.", "created_at": "2023-04-18T04:16:59.827Z"}]