[{"movie_id": 24, "review_id": "593c4bb3c3a3680f42011f61", "author_rating": 10.0, "review_text": "This is the movie he made after Jackie Brown. I thought I might just point that out. A big budget, larger scale action blockbuster. This is the one that would change the direction of Tarantino's films. And honestly, it might be my favorite besides Pulp Fiction.\r\n\r\nThis movie oozes with style and beautifully choreographed action. This movie has an anime section akin to Japanese anime. That's some cool stuff. Even the non-action parts are some really good stuff. Like the guy from the old Street Fighter movies as Hatori Hanzo and making the Bride's sword. And the fantastic soundtrack. The great opening scene where the Bride gets shot and then the somber \"Bang Bang\" by Nancy Sinatra plays. \r\n\r\nBut of course, the amazingly choreographed action makes this movie. A lot of it is showcased in the Crazy 88 fight and the few fights before it. It has some brilliant uses of the style. Of course, there's black and white which was actually used to avoid an NC-17, but works very effectively. And the beautifully shot battle between the Bride and O-Ren. No music really adds a lot to it. It's quiet and oh so effective compared to the loud blood fest of the Crazy 88. \r\n\r\nBut there's also the opening hand to hand fight scene with Vernita Green which is also very well edited. Very surprising scene as it is interrupted by Green's daughter coming home and then they talk. And it starts back again as quickly as it began and then ends once again with a knife to Vernita's chest. What a brilliant tension filled scene.\r\n\r\nThe movie also never takes itself too seriously. That's for the sequel. But the fun action and style leads the whole way. Also along with Buck, and other fun scenes. Lest we forget other great scenes like the whistle scene as Elle Driver comes to kill the Bride in her sleep. Or interrogating Sophie. \"These will be things you will miss.\" I love it.\r\n\r\nHonestly, it might be the best action movie of the 2000s, at least for me. And Tarantino has a lot of my favorite movies. Maybe I enjoy his movies a bit too much. But even with that, it's one of the my favorites. Kill Bill Vol 1 gets a 10/10", "created_at": "2017-06-10T19:42:43.313Z"}, {"movie_id": 24, "review_id": "59d532869251414ba501d2b1", "author_rating": 8.0, "review_text": "Not so hush hush but very much on the QT.\r\n\r\nAfter being gunned down on her wedding day by her former colleagues, assassin Black Mamba (Uma Thurman) rouses from a four year coma with only one thing on her mind, revenge! Striking up a death list of five, she sets off for bloody retribution.\r\n\r\nQuentin Tarrantino writes and directs what is in all truth, a homage to all the cinema conventions close to his heart. Think an amalgamation of chop-socky, sexploitation, samurai, spaghetti Westerns, anime and cop shows of years past, and you get the heart of Kill Bill. A film that was so epic in scope it had to be cut into two films. What it lacks in Tarrantino dialogue dynamite it more than makes up for with action and astute visual flair. And it's bloody, very bloody. Thurman is great as the avenging Mamba/The Bride, while the inclusion of Sonny Chiba & Lucy Liu adds a touch of class as QT revels in his East meets West berserker narrative. It could have been trimmed down, particularly in the middle section where Tarrantino deals in a calm before the storm ideal, but Volume 1 was one of the most exciting movies of 2003, and most notably it shows Tarrantino to be adept at action directing. His action skills perhaps explains why the script doesn't crackle with the wit and panache of his previous offerings? You sense he wants more than the words \"fine writer\" engraved on his granite mined Curriculum Vitae.\r\n\r\nHugely enjoyable with a neat end of film cliffhanger, roll on part 2... 8/10", "created_at": "2017-10-04T19:12:06.289Z"}, {"movie_id": 24, "review_id": "5b50e8c592514112c300231f", "author_rating": 7.0, "review_text": "Uma Thurman as an anti-superheroine  \r\n\r\nRELEASED IN 2003 and written/directed by Quentin Tarantino, \"Kill Bill: Vol. 1\" is an action/thriller/fantasy starring Uma Thurman as The Bride who seeks vengeance on the team of assassins who betrayed her, a group of which she once belonged. Her journey takes her from El Paso to Pasadena to Okinawa. Vivica A. Fox, Lucy Liu, ravishing Julie Dreyfus and Michael Madsen appear as various assassins or accomplices.\r\n\r\n\"Kill Bill” is a creative mish-mash of 60s-70's Bond-isms, Spaghetti Westerns and martial arts flicks, but with modern production values. It sometimes plays like a superhero movie in that The Bride is essentially an anti-superheroine who mows down literally armies of skilled fighters, e.g. the overly drawn-out B&W fight with the Crazy 88s. I loved the inclusion of Ennio Morricone's \"Death Rides a Horse.\"\r\n\r\nOn the downside, there’s an overlong lame anime sequence and the characters lack substance and realism, but who can deny the film’s pizzazz? Sure, it’s style over substance, but it’s entertaining in a voguish, quirky way. Since both parts were meant to be ONE MOVIE, it’s mandatory to see “Vol. 2” to properly appreciate and appraise “Kill Bill.” The second part fills in the holes.\r\n\r\nTHE MOVIE RUNS 111 minutes and was shot in Texas, California, Mexico, Tokyo, Beijing and Hong Kong.\r\n\r\nGRADE: B/B- (6.5/10)", "created_at": "2018-07-19T19:38:45.512Z"}, {"movie_id": 24, "review_id": "61e86664bc8657001be063e1", "author_rating": 5.0, "review_text": "Interesting usage of anime to tell O-Ren's back-story, but I wasn't really a fan of the cartoonish blood splattering and gratuitous fight scenes.", "created_at": "2022-01-19T19:28:36.247Z"}, {"movie_id": 24, "review_id": "633833c938469a007ac47342", "author_rating": 6.0, "review_text": "Awakening from a lengthy coma, the expecting \"Bride\" (Uma Thurman) embarks on a lethal killing spree to avenge herself on those responsible for killing her fiancée and to find out just what happened to her unborn baby. She has a past - formerly a soldier in the \"Deadly Viper Assassination Squad\" - she formerly dated it's leader \"Bill\" (David Carradine) - and so in theory has her work cut out for her as she seeks her revenge. Well, except that is, that the aforementioned \"DVAA\" could not hit a barn door with an Howitzer. Despite their overwhelming numbers, their supposedly expert training and resilience, \"Bride\" mows through them as if they were wheat to her combine harvester. This film has no jeopardy whatsoever. Thurman looks great and packs quite some charisma into her performance, and Tarantino presents a quirky style to the story, but that story is hackneyed and unremarkable. The characterisations are undercooked and frankly nondescript and the fact that we know there is to be a part two, only robs this all too quickly of any sense of menace. Gory and bloody, yes but so what? A strong and feisty woman lead? Yes, but again - so what? The action scenes are well enough choreographed, but the whole thing has a relentlessness to it that really underwhelms. This director usually makes good use of his soundtrack, and the strong and powerful tones of Nancy Sinatra do tee this up well, but afterwards I'm afraid it just descends into mediocrity and I really struggled to appreciate anything different or innovative about this. Disappointing.", "created_at": "2022-10-01T12:34:17.965Z"}]