[{"movie_id": 372343, "review_id": "5ec398082dffd8002170f9f6", "author_rating": 3.0, "review_text": "Honestly, it should probably be shown in one of your early lessons in a film class. Slap on any given scene and ask the question \"Now which decisions did you spot that should never have been made in this or any movie?\"\r\n\r\nHonestly the only reason it even comes away with a whopping(!) one-and-a-half stars, is that minute to minute, _The Snowman_ is so bizarre, that it actually reaches levels of laugh-out-loud funny.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2020-05-19T08:25:44.022Z"}, {"movie_id": 372343, "review_id": "64b28c700bb07600eb28acd8", "author_rating": 3.0, "review_text": "This infamous flop is a pretty-to-look-at mess of confusion, tension, and some very good performances.  In Norway, Detective Harry Hole (Michael Fassbender) and his new bright-eyed partner Katrine (Rebeecca Ferguson) are investigating a series of disappearances that have been going on for years, some centered around philanthropist Arve Stop (J.K. Simmons).  A calling card, the titular snowman, is left at the crime scenes, and are the signature of some anonymous letters Hole is starting to receive.  Harry and Katrine go through the motions, taking advantage of the police department's new piece of technical marvel equipment.  Harry also involves himself in his former girlfriend Rakel's (Charlotte Gainsbourg) life, and the couple seem to be pining for each other once again.\r\n\r\nIt's never a good sign when your film's director admits that he only had time to shoot 85% of a screenplay he was handed after being brought on when the original director, Martin Scorsese, dropped out.  There are a couple of scenes in the trailer that didn't make the cut of the film simply because there was nowhere to insert them in this incomprehensible story.  Oscar winners Claire Simpson and Thelma Schoonmaker were credited as editors, but their expertise can't salvage this mess.  The film takes place in Norway, with travels to Bergen in Germany, but all the performers speak English.  The setting and character names are Scandinavian, try to stop laughing at the name \"Harry Hole,\" but the film makers oddly went with this cast instead of moving the setting to Canada or Alaska, or hiring a Norwegian cast.\r\n\r\nOn the positive, and I don't know how, the cast is great.  Fassbender is seen waking up from a drunken stupor a few too many times, but his performance is very good.  Ferguson is okay, but Gainsbourg turns her ex-girlfriend character into something special, and I wish we could have had more of her.  Karlsson has her new boyfriend is achingly polite and naive, not quite picking up on the chemistry between Harry and Rakel.  Aside from a few iffy special effects shots, the true locations are gorgeous, cold, and snowy.  Based on a series of novels by Jo Nesbo (why start shooting with the seventh one?), this should have been a franchise starter, but the box office returns took care of that idea.  From what I have read online, the screenplay strays from the novel on key plot points and kills off a couple of major characters who would return in later novels.\r\n\r\nIt's too bad this didn't work, I would have liked to see more of this character in less convoluted, confused cases.  \"The Snowman\" left the viewer, and apparently the film makers, cold.", "created_at": "2023-07-15T12:09:20.961Z"}]