[{"movie_id": 480105, "review_id": "5d8635d7e78e2d001874a9ac", "author_rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nSometimes, people ask me if I feel less motivated to write about a movie I didn’t like or even simply hated. Not even close. Matter of fact, it might be the exact opposite. The only films which I find hard to write a review on are those who don’t have a single aspect that is either outstanding or horrible. Those who are so “in the middle” that you forget about them less than 24h after you’ve seen it. 47 Meters Down: Uncaged could very well be this type of flick, but its ludicrous logical issues story-wise are impossible to ignore. Even the title is just a marketing scheme to attract people who liked the 2017’s original since it is entirely unrelated to it (the water depth at which the characters are is never addressed).\r\n\r\nThis is one of the worst movies of the year. It still doesn’t beat Serenity, but it made me rethink about the latter’s grade because I find it so incredibly difficult to acknowledge one single good thing about this terrible sequel. Had I scored Matthew McConaughey’s film an F, this one would probably belong there as well. However, in the same way that a film without flaws isn’t necessarily an A+, a movie with no redeeming quality isn’t instantly an F. If there’s one compliment I can give Uncaged is that there are two or three short sequences where a jump scare is effective, or the suspenseful vibe was accomplished … Nevertheless, these are still just a couple of minutes in an almost 90-min runtime.\r\n\r\nThe characters have no development whatsoever. The story follows the most pathetic path possible. The sharks (which are the reason people actually went to the theater) are not as visually realistic as in the original, reaching a point where the CGI was pretty awful. A fish screams … I mean, really?! Who the hell supervised this mess? Characters talk underwater seamlessly with no explanation on how they are effectively talking. I could sit here and write dozens of questions that defy the film’s logic, but I’ll stop here. Not because I don’t want to (if this wasn’t a spoiler-free review, I’d go crazy), but due to the fact that the main issue with the movie isn’t the atrociously illogical plot points, but the lack of entertainment.\r\n\r\nFast and Furious, Pirates of the Caribbean, Transformers … All of these are (financially) successful franchises. Audiences all over the world fill theaters and enjoy these series for what they are: popcorn entertainment. No one goes for the complex plots or layered characters. People go for the action, the explosions, the epic scores, the visual effects, and all of that stuff. Uncaged doesn’t have any of that to compensate its other problems. One or two scenes here and there aren’t enough to warrant the price of admission. Even the acting is mediocre. \r\n\r\nAll in all, 47 Meters Down: Uncaged is nothing more than a silly attempt at the start of a new franchise. Don’t be fooled by its title since it has nothing to do with the original flick. It doesn’t try to introduce compelling characters, the shark sequences fall flat for the most part, and the screenplay is filled with laughable plot points. There’s no sense of logic. For an 89-minute runtime, it astounds me how it can’t be slightly entertaining, to say the least. Undoubtedly, one of the worst films of the year. Skip it, so they don’t have enough money to try and do a third one. Who knows?! Maybe they’ll bet on original, smaller flicks from genuinely talented filmmakers who want to work hard and deliver a good movie.\r\n\r\nRating: D-", "created_at": "2019-09-21T14:38:15.290Z"}, {"movie_id": 480105, "review_id": "5dba953f54f6eb00134c415e", "author_rating": 1.0, "review_text": "‘47 Metres Down: Uncaged’ doesn’t have the inventiveness  of ‘The Shallows’, the intensity and drive of ‘Crawl’, the fun of ‘The Meg’ or the gore of ‘Piranha 3D’ but, for a few fleeting moments, it does feel vaguely like an underwater version of ‘The Descent’. If only the film would have let the characters shut the fuck up a little more and let me enjoy those aspects.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-47-metres-down-uncaged-fails-to-surface", "created_at": "2019-10-31T08:03:11.271Z"}, {"movie_id": 480105, "review_id": "5dc338bca9b9a400111c941b", "author_rating": 4.0, "review_text": "Has a few moments going for it, but this is pretty much paint-by-numbers survival-thriller with some pretty bad acting (or at least poor dialogue). The first movie wasn't very good either, but at least the characters in that one didn't get into their predicament due to their stupidity like they had here (seriously all of this got started because one of the girls got startled by a fish and knocked into a pillar).\r\n\r\nOnly notable thing about this cast is two of them are children of a famous parent actor (Jamie Foxx/Corinne Foxx, Sylvester Stallone/Sistine Stallone).\r\n\r\nNot terrible and passably watchable, but kind of feels dated even though the obsession with sharks was only a few years back. **2.0/5**", "created_at": "2019-11-06T21:18:52.073Z"}, {"movie_id": 480105, "review_id": "5e07502226dac10012708a4e", "author_rating": 5.0, "review_text": "Rare is the shark movie that actually tries, and for that, _47 Meters Down: Uncaged_ deserves ample credit. The shark effect quality varies wildly, but when it's good, it's really good (shame one of the not good times was the first time you see one). About as much originality as you can get out of this genre, but even with all that said, _Uncaged_ still can't manage to cross that threshold into \"good\". It fails to suspend disbelief, doesn't have characters you can care about, and isn't very well acted. It rises above a lot of modern-day shark movies, but it doesn't rise above many movies in a more general sense.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-28T12:52:50.434Z"}, {"movie_id": 480105, "review_id": "5f836f9969eb900038bc507c", "author_rating": 5.0, "review_text": "Less scares than the first one but still a good popcorn entertainer with the trademark emotional element (two step sisters here) and if you don't think about the details too much. 90 minutes of laid-back entertaining material to watch with your family and learn again why exploring abandoned lakes and underwater caves isn't a safe thing to do. TN.", "created_at": "2020-10-11T20:48:25.300Z"}, {"movie_id": 480105, "review_id": "62691d881967570051a3f51d", "author_rating": 4.0, "review_text": "Right, if Great White sharks have their equivalent of Equity, I'd be formulating a law suit against the producers of this nonsense for gross misrepresentation. For the most part, despite having this rather ripe collection of noisy young divers on their plates, the so-called monsters of the sea seem quite incapable of polishing them off. Initially they are isolated in the ruins of an underwater temple, then a beautiful lagoon that is nigh on impossible for them to escape from, then finally the open sea where a visiting tourist boat is pounding the blue waters with shark-tempting chum - and yet, yes - you've guessed... There is no point singling out any of the acting talent here, luckily they wear scuba-masks most of the time so the performances really only require a moderate ability to win (and, of course, to scream). There is some fine underwater photography, but the rest of this is really formulaic and so incredibly far-fetched as to be just plain daft and not in the least scary.", "created_at": "2022-04-27T10:40:08.269Z"}, {"movie_id": 480105, "review_id": "63b247281d1bf4008288fcce", "author_rating": 6.0, "review_text": "**47 Meters Down: Uncaged sets itself apart from other shark movies with the tight quarters of its setting and the panic of quickly fading oxygen tanks. It's one of the better low-budget shark films you can find.**\r\n\r\n47 Meters Down: Uncaged is one of the better low-budget shark films you will find. A group of friends explore the flooded passageways of a Mayan ruin only to discover there are blind bloodthirsty sharks that can track them from the sounds they make. There are some solid shark kills and scares throughout. As you would come to expect in a movie like this, the acting isn't mindblowing, but it is better than your average shark flick. The claustrophobic passages of the ruin add a new dimension to the terror and anxiety of the film as their oxygen supply dwindles rapidly as they frantically look for an escape. This movie adds several layers of danger to the girls' struggle for survival, making the movie feel more fresh than others of the genre. I enjoyed it much more than the original film. This doesn't mean 47 Meters Down: Uncaged is incredible, but it is certainly worth a single viewing.", "created_at": "2023-01-02T02:53:28.364Z"}]