[{"movie_id": 63492, "review_id": "5f612b251bf2660037dbbec9", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nA good sex / romance based humor from the feminine perspective, almost like \"Bad Moms\" without kids, but one single lady.\r\n\r\nTo set a low bar of expectations, imagine most of the comedians you don't want to picture having sex, and Chris Pratt in a fat suit, and that's most of the dirty humor in the movie.  It's surprisingly charming with Anna Faris and Chris Evans (Captain America, but really, Johnny Storm) helping each other with their conspiracies, and instead better there lives.\r\n\r\nYes, its the cheesy crap that rom-coms get made fun of for doing (even in this movie, I think), but it does it pretty well, it's funny, and deals with a concept that looks like an extension of the sequence in \"Just My Luck\" where she has to hunt down and kiss some dancers.\r\n\r\nIt's a stupid concept but it's fun and maybe I just like Anna Faris, but she carries the movie and when something is done well, I typically enjoy it.", "created_at": "2020-09-15T20:59:17.389Z"}, {"movie_id": 63492, "review_id": "61b015ef1e259a004122a650", "author_rating": 7.0, "review_text": "I tend to be an easy grader for romantic comedies. As long as the script isn’t too dull or insult my intelligence, with witty dialogue and good chemistry between the lead characters, I will overlook minor silliness or predictability in the name of entertainment. Let’s face it, most genre films are predictable to some extent, since they stay within the genre.\r\n\r\nOf course, I know Anna Faris from her later starring role in the excellent long-running comedy series Mom. Her performance here is quirky enough to keep it interesting, but sweet at times so that I rooted for her. This is not groundbreaking stuff here, or top ten quality filmmaking, but I enjoyed it enough to stick with it, and that is what counts with rom-coms.", "created_at": "2021-12-08T02:18:23.229Z"}]