[{"movie_id": 464502, "review_id": "5bb5ab10c3a368151000982b", "author_rating": 5.0, "review_text": "If you had just copped the line notes on _Acrimony_, you could be forgiven for assuming this was your average Lifetime movie faire, but _Acrimony_ allows for its core characters a complexity that you would never find in that sort. There are absolutely imperfections in the movie, most of which I assume come to us from budgetary constraints, and even those aside, _Acrimony_ is still not exactly breaking moulds or blazing trail - but it is decent, and not exactly like anything I personally have seen before.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T05:54:24.338Z"}, {"movie_id": 464502, "review_id": "6307efd9c39266007ac8722b", "author_rating": 1.0, "review_text": "It’s always a bad sign when the first thing we see in a movie is the dictionary definition of the title. It’s bad because it assumes that we’re too ignorant to know what the word means — in this case, ‘acrimony,’ which I would say ranks lowish in the Hemingway-Faulkner scale —, and why would we want to watch a film that underestimates, sight unseen, our intelligence? \r\n\r\nMoreover, if writer/director Tyler Perry deems his chosen title to be so obscure that he had best not even risk giving us the benefit of the doubt, why didn’t he pick another, more accesible word — one that he feels is common enough to be part of our obviously limited vocabularies? \r\n\r\nAnyway, Acrimony is the strange tale of crazy-ass Melinda (Taraji P. Henson), who puts up with deadbeat husband Robert Gayle (Lyriq Bent) for 18 years; when she finally divorces him, his cockamamie invention — a self-charging battery that he calls “Gayle Force Wind” — becomes an overnight sensation (well, not so much 'overnight,’ but you get the idea), turning Robert into a wealthy man, and Melinda into a major cunt who feels he owes her everything he’d promised her way back when — including a yacht that he was going to call the “Mrs. Gayle.” Why the “Mrs. Gayle”? I mean, what’s wrong with the 'Melinda’? But more on that later.\r\n\r\nMelinda and Robert met in college. He helps her study for a History test, which she fails nonetheless; no wonder, considering Robert is actually a Mechanical Engineering student. Clearly, he’s full of crap, and she should know better — nay, she does know better; not with the benefit of hindsight (the movie is told in flashback, complete with a voice-over narration; another very bad sign), but right then and there, or at least she makes it sound that way: “You ever get that feeling when a man is telling you something, and you know it’s [expletive deleted], but you just go with it? … Well, I knew this was [expletive deleted], and I tried to go with it.” \r\n\r\nThe question is, why does she keep going with it? To quote Stephen King, “Fool me once, shame on you. Fool me twice, shame on me. Fool me three times, shame on both of us.” Having said that, is Robert even fooling her, really?\r\n\r\nMelinda’s mother passes away (we hear about her mother exactly two times; the second time, which follows 20 seconds after the first, is the announcement of her death). Robert comes to the wake, briefly pays his respects, and then leaves. \r\n\r\nMelinda catches up to him, offers him a ride to his house — actually an RV —, and once there, invites herself in. But when they end up having sex, this is what she has to say about it: “My mother wasn’t even cold in the ground yet, and there I was. What kind of man takes advantage of a girl’s grief, huh? I’ll tell you. A low-life maggot of a mother[expletive deleted], that’s who. He had to know that grief can leave you open to not knowing yourself at all.” “He had to know that grief can leave you open to not knowing yourself at all.” But did he really have to know that, though? Does anyone, for that matter? Is that even a knowable thing? \r\n\r\nLater on, Robert is cheating on Melinda in his RV; Melinda drives over there and T-bones the RV, flipping it over. She bears the brunt of the impact, though: “I slammed my body against the steering wheel so hard. Internal bleeding. And worse, ruptured ovaries. A full hysterectomy, and I wasn’t even 21 years old. Children, never.”\r\n\r\nEven if this were possible — and given the location of the ovaries in the female body, I doubt it very much —, how exactly would it be his fault? Also, ever heard of adoption, surrogacy, etc.? There are several other ways that Robert and Melinda could have raised a family after she forgives him and marries him (which she of course does).\r\n\r\nLeaving out the impossible ovary-busting incident, this could be good material for a farce; for some reason I keep picturing something like Carl Reiner’s The Jerk. The only comedy here, however, is unintentional; for example, when Robert remarries and at last buys the yacht of his dreams, he stills names it the “Mrs. Gayle” like he promised Melinda — she’s no longer Mrs. Gayle, but the name is nevertheless technically correct. Now, if Perry had any sense of humor to speak of, Robert would have christened the boat the “Mrs. Gayle 2.”", "created_at": "2022-08-25T21:55:37.951Z"}]