[{"movie_id": 2043, "review_id": "5eee4a8fc86b3a00354523ef", "author_rating": 5.0, "review_text": "_**Good, but farfetched with an eye-rolling ‘big reveal’**_\r\n\r\nD.C. forensic psychologist Alex Cross (Morgan Freeman) investigates when a senator’s daughter is kidnapped from a private school by a man obsessed with the infamous Lindbergh abduction (Michael Wincott). A secret service agent at the school assists him on the case (Monica Potter).\r\n\r\n“Along Came a Spider” (2001) is an improbable detective thriller like its predecessor “Kiss the Girls” (1997) except that it doesn’t rip-off “Silence of the Lambs” (1991) or “Se7en” (1995). Both were based on the books by James Patterson.\r\n\r\nThe opening is great with a thrilling dam sequence. The ensuing story of the kidnapping & investigation is compelling but, like the first film, a plot wrench is thrown into the works that muddles everything. I can roll with that, but not the absurd ‘big reveal’ at the end, which comes off as a wannabe “Fooled ya” by the writers. They might’ve fooled me, but they also ruined the movie with the eye-rolling twist. \r\n\r\nLike “Kiss the Girls,” “Along Came a Spider” is worthwhile if you like proficient detective thrillers and the cast, but be prepared for a wildly unrealistic tale.      \r\n\r\nThe film runs 1 hour, 44 minutes, and was shot in the Vancouver area, British Columbia, and Owings Mills/Baltimore, Maryland (the train sequence), with establishing shots of Washington DC.\r\n\r\nGRADE: C", "created_at": "2020-06-20T17:42:39.680Z"}, {"movie_id": 2043, "review_id": "63175994ba131b0079b3b31a", "author_rating": 6.0, "review_text": "Morgan Freeman is psycho-detective \"Cross\" who has retreated from his work after an operation went awry, killing his wife. Shortly after, the daughter of a senator (Michael Moriarty) is kidnapped by one of her teachers, and when he calls \"Cross\" to lure him back into the business the game is afoot. Aided by one of the girl's now disgraced Secret Service agents \"Flannigan\" (Monica Potter) the two have to piece together a puzzle that will track down and rescue the girl. The snag with this thriller is that it is all just bit too straightforward - there are no real problems with that puzzle as the pair solidly proceed. There is precious little jeopardy, and the characters are all just too sterile - it's just lacking in anything that gives it a sense of peril before an ending that really does have you saying \"Hmmm...\". Freeman certainly has a charm to him, but that's simply not enough to ignite this by-the-numbers effort from a director who couldn't, or couldn't be bothered, to make this more interesting and challenging to watch. Television fodder, I'm afraid - and not likely fodder you will recall next week.", "created_at": "2022-09-06T14:30:44.027Z"}, {"movie_id": 2043, "review_id": "64a85a0b66a0d30100d80fae", "author_rating": 7.0, "review_text": "Easily in the top 10. Probably the best mystery thriller I've ever.", "created_at": "2023-07-07T18:31:39.817Z"}]