[{"movie_id": 9664, "review_id": "5de18acb3faba0001308f612", "author_rating": 7.0, "review_text": "***Americans volunteers become fighter pilots in France during WW1***  \r\n\r\nBefore the USA enters WW1, a young Texas cowboy (James Franco) joins the Lafayette Escadrille in France, a squadron of American fighter pilots. The volunteers are trained and soon experience the glory, anxieties and horrors that go with air combat.  \r\n\r\n“Flyboys\" (2006) was inspired by real events and comes in the tradition of similar WW1 aviation flicks “The Blue Max” (1966) and “Aces High\" (1976). Whilst not great like the exceptional “Blue Max,” the blockbuster-ish “Flyboys” is more compelling than the mundane “Aces High,” albeit a little marred by comic book storytelling (think “Legends of the Fall”). It’s also significantly superior to the curiously unabsorbing “The Red Baron” (2008). \r\n\r\nThe movie’s ambitious and nigh epic, but there are some contrived, unconvincing moments. For instance, the “German spy” part could’ve been cut with no harm done, not to mention make for a more streamlined viewing experience. Yet I’m glad that the film’s not as one-dimensional as the realistic “Aces High” (which, don’t get me wrong, is a quality WW1 fighter pilot flick). For instance, “Flyboys” throws in a good trench sequence involving ‘No Man’s Land’ that LOOKS convincing; too bad it’s not believable at all (the way so-and-so easily saves so-and-so). \r\n\r\nEugene Skinner, the black pilot, was based on the real-life Eugene Jacques Bullard (the filmmakers just changed the surname). In real life Eugene hoped to join the Lafayette Escadrille, but they stopped receiving applicants by the summer of 1916 after accepting 38 American pilots. So, a few months later, Eugene joined the Lafayette Flying Corps on November 15, 1916.\r\n\r\nAs far as strafing downed aviators goes, it was considered dishonorable, but the movie suggests that a minority of ignoble pilots did so, which is reasonable.  In the film an ignoble German pilot strafes & kills an American, which is what later spurs an honorable German pilot to make amends in a pretty powerful scene. \r\n\r\nThe film runs 2 hours, 20 minutes, and was shot in England (Buckinghamshire, Essex, Bedfordshire & Somerset House, Strand, London, with studio work done in Hertfordshire). PS: The lion, Whisky, was a real mascot for the squad, along with another named Soda.\r\n\r\nGRADE: B/B+", "created_at": "2019-11-29T21:16:59.209Z"}]