[{"movie_id": 45269, "review_id": "50b3b70e760ee30e910000de", "author_rating": 9.0, "review_text": "Round movie: good story, great cast, impressive stage and fantastic performances. It has it all.", "created_at": "2012-11-26T18:38:06.000Z"}, {"movie_id": 45269, "review_id": "5d43eec5a9117f0017ef9906", "author_rating": 10.0, "review_text": "The gift of cinema does credit to the gift of speech.\r\n\r\nThe King's Speech is directed by Tom Hooper and written by David Seidler. It stars Colin Firth, Geoffrey Rush, Helena Bonham Carter, Guy Pearce, Timothy Spall, Derek Jacobi & Michael Gambon. Music is by Alexandre Desplat and photography is by Danny Cohen. The idea for the film came about after Seidler read about how King George VI (Firth) overcame his stammer after a friendship was formed with his voice coach Lionel Logue (Rush). Having himself overcome a stutter problem in his youth, Seidler set about writing his story from informed information. A bonus came before filming started when notebooks belonging to Logue were put forward for use. These enabled Seidler to incorporate works from the books into the screenplay. Plot picks up just prior to George's brother, Edward (Pearce), abdicating the throne, thus thrusting the stammering George on to the hottest seat in England. With World War looming, George will be needed to make the speech of speeches to becalm his nation, but first he must work closely with the affable Logue and hope it brings an end to his vocal woes.\r\n\r\nI first viewed The King's Speech just a couple of days before the Academy Awards that year, so I didn't know how it was going to perform there. It would garner the Academy Award for Best Picture, Best Director (Hooper), Best Actor (Firth) and Best Original Screenplay (Seidler), with 12 nominations in total. This was a year when Oscar and BAFTA (where it won 7 of the 14 categories it was nominated for - including Best Film and Best Actor for Colin Firth) got things right. The film at that time I watched it had already made over $230 million in profit, which was a figure guaranteed to rise considerably since the film was still playing to packed theatres in the UK (which was indeed the case as the last figure put forward was $412 million).\r\n\r\nI myself ventured to the theatre on 22nd February 2011, which was over 6 weeks after it was first released in its homeland. As I approached the cinema I saw there was a queue! A queue? I haven't queued to get into a film since the halcyon days of Jaws, Star Wars and Close Encounters of the Third Kind! I noticed there was many youngsters in this line, so of course they were going to see the Yogi Bear movie, or that Gnomeo & Juliet film, Surely? Not so actually. In they went to see The King's Speech, an audience that ranged from 12 years of age to the fragile OAP day trippers. For the next two hours the only sounds I heard were that of laughter, hushed words of praise for what was on the screen, and even sobs during some of the more tender moments within. No mobile phones, no chitter chatter about acne or the boy next door, just an across the board appreciation for expert film making.\r\n\r\nThere in is the reason why The King's Speech coined it in at the box office and broke merry records as it went on its way. It has universal appeal, a film without tricks, just a simple involving story acted supremely by a cast of bona fide thespians. It beats a true heart,  whilst doling out a visual history lesson to those so inclined to matters of the British Monarchy and the political upheaval about to surface as Adolf started his surge. Even for a film so chocked full of dialogue and basic human interactions, the pace is brisk and never sags, the quieter reflective moments only bringing anticipation of the next enjoyable scene. When all is said and done, The King's Speech success snowballed because of word of mouth, it started out as an intended independent picture, to be shown in selected theatres only, and now it holds up as one of the best films of 2010/2011. Believe me, believe the hype, that if you still haven't seen it then you owe it to yourself to see this beautiful movie. 10/10", "created_at": "2019-08-02T08:05:25.418Z"}]