[{"movie_id": 38757, "review_id": "5444ebccc3a3683e0e0073e5", "author_rating": 8.0, "review_text": "Tangled main characters really remember Aladdin's. The chameleon character could have been more juicy and it also repeats with stubborn determination Disney's intent of making any other animal to behave like dogs.\r\n\r\nAll in all, it is a stereotypical Disney movie that nails the template but it does it so well that it is also really entertaining. In addition, they get to add some of the fresh characteristics brought by Shrek to the scene.", "created_at": "2014-10-20T11:02:36.098Z"}, {"movie_id": 38757, "review_id": "589c3fcb925141250a00338f", "author_rating": 8.0, "review_text": "Been wanting to watch this movie for quite some time. But then I wasn't sure if I really wanted to watch this or not because it might be just like Frog Prince (which I haven't seen completely yet). Even if I was tired (slept late the night before and woke up early when we got a phone call that Matt and Toby will come over to play Wii) and I didn't have money anymore, I wanted to watch this movie just to keep Matt entertained.\r\n\r\nI wasn't disappointed. I really like this movie. It was like a classic Disney movie: a Princess, her prince charming, animal sidekick, and the best of all, MUSIC! I liked how the Princess was not the typical Disney princess. Rapunzel was strong and active. She wasn't very timid and proper like the usual Disney princess that I grew up watching. Flynn Rider was really cute which was a big plus. He was really charming. The animal sidekicks, Mascal and Maximus, were funny. All in all, I really like this movie and I strongly recommend it to all.", "created_at": "2017-02-09T10:09:15.949Z"}, {"movie_id": 38757, "review_id": "5f3d60b2e295b40033a3a307", "author_rating": null, "review_text": "An enjoyable tale about Rapunzel.\r\n\r\n<em>'Tangled'</em> kicks off Disney's animated releases for the 2010s in very strong fashion. It's nicely created, with fun characters and a hearty storyline. It actually sets a lot of the foundations that 2013's <em>'Frozen'</em> uses, there's a fair amount of similarities between the two.\r\n\r\nMandy Moore does a terrific job in the lead role, she's brings an energetic edge to the character alongside good humour. Zachary Levi (Flynn) and Donna Murphy (Mother Gothel) are more than decent in their respective parts. You also have the amusing (non-speaking) Maximus.\r\n\r\nIt's still very much the usual fairytale/princess thing, but it manages to add a lively turn to proceedings which keeps it entertaining.", "created_at": "2020-08-19T17:26:10.324Z"}, {"movie_id": 38757, "review_id": "606d0145e04aca002ae7b685", "author_rating": 10.0, "review_text": "Might be my favorite Disney movie. My girls love it, and the hidden relationship metaphors are fun for adults to figure out.", "created_at": "2021-04-07T00:48:05.773Z"}]