[{"movie_id": 400650, "review_id": "5cec325bc3a36824971dc555", "author_rating": 8.0, "review_text": "The original Mary Poppins was one of my favorite movies when I was a kid and it kind of still is. Thus I was indeed a bit worried when I sat down to watch this one with the kids yesterday. After all there is really so many ways a incompetent writer could have screwed this one up. Especially one with an agenda.\r\n\r\nLuckily this was not the case and I have to say that I quite liked this movie. Disney actually managed to keep the ambiance of the original movie and it actually felt like a Disney movie from the good old days. The days before every easily offended retard tried to make every movie into a preaching mouth piece for their personal crusade.\r\n\r\nI think I liked the first half of the movie best. It was an explosion of song, magic and, for me, nostalgia. Apart from the hugely improved technology this movie had available to make the magic bits it actually felt like it could have been made back to back with the original. They really managed to capture the atmosphere from back then.\r\n\r\nIf I had to compare the two directly I would still go with the original as the best one. It was more imaginative and it just felt a bit better two me.\r\n\r\nThe story is a bit of a rehash of the original. They could have come up with something more original. Also, the second movie seemed to fizzle out a bit compared to the first half. I would have liked to see some more Mary Poppins coolness and magic, like we saw in the first half of the movie, instead of, mostly, conventional stuff. Also the take down of the bad guy was a bit underwhelming.\r\n\r\nApart from that I think sequel was not bad at all.", "created_at": "2019-05-27T18:54:19.233Z"}, {"movie_id": 400650, "review_id": "5e89fbd1d207f30014991056", "author_rating": 8.0, "review_text": "I enjoyed this movie just as I love the original Mary Poppins. I think it is largely a thankless task doing sequels for beloved films: Christopher Robin and Hook had to pass through a crucible of dislike by lovers of similar original flicks.  Remakes are similarly unpopular, perhaps for better reason, in my opinion. O \r\n\r\nThe makers of Mary Poppins Returns aren't trying to reinvent the wheel, just entertain by using a bit of imagination to bring the original tale to a more savvy modern audience. No reason for us to rhetorically throw our toys out of the sandbox. Okay, I may not watch this new offering as often as I have the original, but it was entertaining without being rude, profane, crude or violent. Kind of rare, that.", "created_at": "2020-04-05T15:40:01.309Z"}, {"movie_id": 400650, "review_id": "64b6b3bb0e4fc8519fece8e4", "author_rating": 5.0, "review_text": "Not any where close to as entertaining as the original. The storyline was the only good thing. Otherwise the movie was actually disappointing.", "created_at": "2023-07-18T15:46:03.513Z"}]