[{"movie_id": 425909, "review_id": "6193c4c145819900432a32af", "author_rating": null, "review_text": "Back in 1984 when big hair and neon were the norms; a movie appeared that soon became a cultural phenomenon. The movie involved a team of unlikely Paranormal Investigators and the mix of comedy, FX, and Ghosts turned the movie into a smash hit and a Pop Culture mainstay. The abundance of products that followed and the inescapable theme song and tagline soon gave rise to a sequel which while a success; did not resonate the way the original film had and thus the “Ghostbusters” film franchise became dormant.\r\n\r\nWhile a successful video game and merchandise line kept the franchise alive; the 2016 reboot with an all-female team failed to capture the magic at the box office and again put the franchise’s cinematic future in question.\r\n\r\nThankfully after several delays due to the Covid 19 Pandemic; “Ghostbusters Afterlife” has arrived and is the worthy sequel that does justice to the original film and sets the stage well for future cinematic exploits.\r\n\r\nThe film follows a down on her luck mother named Callie )Carrie Coon) and her children Trevor (Finn Wolfhard); and Phoebe (Mckenna Grace), as they are forced to move to a dilapidated farm in rural Oklahoma following the passing of Callie’s estranged father and her subsequent eviction.\r\n\r\nA series of unexplained earthquakes clues the smart and precocious Phoebe that something is up and with her new friend Podcast (Logan Kim), and teacher Mr. Grooberson (Paul Rudd); help her uncover her connection to the original Ghostbusters and the abundance and significance of the gear that her Grandfather has left on the farm.\r\n\r\nThings soon take a turn for the worse and despite skeptical locals and the emerging danger, Phoebe, Trevor, and their friends have to battle the forces of evil to save the world.\r\n\r\nThe movie takes its time getting to the action and spends plenty of time establishing the characters, their motivations, and their relationships with one another. There are abundant homages to the original film; some of which are very subtle and clever but never seem gratuitous or tacked on.\r\n\r\nThe film also does not rely on the FX to tell the tale as while there are some solid effects in the film; this is a character-driven tale and the new cast works well with some surprise guests who pop up throughout the film.\r\n\r\nDirector Jason Reitman; son of the Director of the original film; clearly knows and loves the material as he not only helped craft the story but deftly weaves a new tale into the franchise which also fits well with the first film and does not attempt to reboot but rather continue the franchise.\r\n\r\nThere are two extra scenes in the credits that you will not want to miss as not only are they great fun; but also tease of future adventures to come.\r\n\r\nThe film also has a few touching moments that caused some unexpected emotion from the audience at our Press Screening and helped establish “Ghostbusters Afterlife” as not only a winning entry into the series but also one of the most enjoyable films of the year.\r\n\r\n4.5 stars out of 5.", "created_at": "2021-11-16T14:48:33.030Z"}, {"movie_id": 425909, "review_id": "6201f308d55c3d00a0c06c6d", "author_rating": 7.0, "review_text": "More than a little heavy in the nostalgia department (not complaining as I got to see the OG there at the end), but as these sequels go I liked it enough, especially the young cast that weren't terribly obnoxious. I will admit that I almost got a tear in my eye when... I heard the Ecto-1 siren go. Not kidding. And CGI Egon wasn't bad either. Definitely better than that 2016 mistake. Chalk it up to a nightmare alternate universe. **3.5/5**", "created_at": "2022-02-08T04:35:20.291Z"}, {"movie_id": 425909, "review_id": "620cdf4dd94035006a65b035", "author_rating": 8.0, "review_text": "This wasn't bad at'all.  The kids did very well as far as acting went. The special affects were very reminiscent of the past. (It seems as if they went with the same speical effects company or at least the same format--very good decision) And the story seemed to hold water very well. \r\n\r\nPersonal critiques (possible spoilers ahead) :  I wish the kids had busted a few more ghosts.  Perhaps make that a montage, while introducing us to what the rest of the OG Ghostbusters were up to in present day.  But instead of that, the script had Dan Akroyd's Ray character explain it over the phone.  Maybe if the production had used the montage, the OGs' recognize what's going on and decide to show up to help.  Or maybe have the girl's teacher, Paul Rudd, try and find the OG's.  In short, there didn't seem like there was enough action.  The girl was a bit too egg-head smart-alecky for my taste, but that could just be the oily film of identity politics Hollywood likes to smear all over recognized franchises, affecting my view on that notion.  I also was kinda expecting Slimer to show up. lol I was a big fan of the cartoon as a kid.  \r\n\r\nAll in all they did very good with the film and honoring Harold Ramis in his passing.  Depsite my personal wish list, this was a very good film for all audience ages.  I gladly give it 4.5/5.", "created_at": "2022-02-16T11:26:05.182Z"}, {"movie_id": 425909, "review_id": "62421b66af43240047067406", "author_rating": 6.0, "review_text": "\"Callie\" (Carrie Coon) is a bit short of cash, so must retreat to her late father's dilapidated pile with her son \"Trevor\" (Finn Wolfhard) and geeky daughter \"Phoebe\" (Mckenna Grace). When the young girl discovers that she has a chess partner that she cannot see, then a \"ghost trap\" under their frequently shaking old house, she and her brother - alongside her seismologist teacher \"Gary Grooberson\" (Paul Rudd) are soon doing what it says on the tin. It takes for ever to get going, this film - far too much time is spent on character development and by the time it actually gets up to speed I was just a little bit bored. It is redeemed by the last ten minutes, to a certain extent, but I could have been doing with a bit more of Rudd's character - and quite a few more ghosts to bust. It looks ok, the effects are fine - there is just a paucity of them - and the two youngsters work well together with a decent (if wordy) script that has some amusing scientist jokes.", "created_at": "2022-03-28T20:32:38.210Z"}, {"movie_id": 425909, "review_id": "625bd95eae366800663cb3ed", "author_rating": 8.0, "review_text": "This is a film that I was on one hand looking forward to watch and on another hand feared to watch. I was really hoping that this movie would be able to reboot the franchise after that abysmal piece of woke shit Ghostbusters (2016) had totally ruined it.\r\n\r\nLooking back at my review of that movie I am actually surprised that I gave it any stars at all but in 2016 the lefts wokeness had not yet reached the psychopath levels that is has today so I guess it didn’t strike me as hard. Anyway, when it was announced that this new movie would ignore previously mentioned atrocity and be a sequel to the original(s) it, of course, became a must watch for me.\r\n\r\nSo, what about this new instalment then? Well, it is almost woke free which is a relief of course. Is it a great movie? No not really but it is good and it is a quite entertaining family movie and, frankly, it gets an added star just for burying the 2016 feminist trash. I think that one will be relegated to the same status as the famous The Scottish Play and, from now on, be referred to as The Woke Trash, if referred to at all.\r\n\r\nI have to agree with some reviews that think it was a poor choice to make the main protagonists in this movie kids. It might have worked if they had more support from some charismatic adult characters but sadly the two main adult characters are not up to that task. The teacher is somewhat fun but really quite stupid. He is also the subject of the only woke nonsense in the movie. Apparently some green fanatic had to take a stab at America’s energy independence. Now we see how well that worked out. The science hating mother is really just grating on me almost every scene she is in.\r\n\r\nThe three kids are not really bad though. Their different personalities complement them nicely. My favorite character was definitely the science geek. The fourth kid, Lucky, was not really adding much apart from giving Trevor a change to drool all over the place.\r\n\r\nI would have liked to see more ghosts and stuff though. The special effects were fairly nice when they occurred but a few more ghost rampaging around town would have been cool. The metal munching ghost was rather funny though.\r\n\r\nThe story was working but rather thin and full of stupid plot holes. Given the ease by which the kids got down to that temple or prison or whatever you would want to call it, it is just not reasonable that they would be the first to discover it. If that science hating mother would really have been married to Spengler I doubt that she would really have been as ignorant as she is. Also, when, finally, some supernatural activities happen that stupid teacher is the only one in the entire Walmart store. Seriously? Ran out of money for extras or what?\r\n\r\nStill, overall I enjoyed the movie. It had a fairly nice mix of mystery, adventure and comedy. It also tied nicely into the original with quite a few throwbacks. It was nice to see the original actors doing a last mission. Especially Bill Murray. I still cannot believe that he accepted to play that bullshit, and short lived, character in The Woke Trash.\r\n\r\nI cannot really make up my mind if I liked the mini marshmallow men though but then I thought that part was rather silly in the original movie as well. I guess it satisfied quite a few of the original fan base though.\r\n\r\nSo, bottom line, if you liked the original, I think you will probably like this one. It’s not wow great but it was fun and entertaining and, in my opinion, it is good enough to dig the franchise out of the grave that The Woke Trash put it in.", "created_at": "2022-04-17T09:09:50.453Z"}, {"movie_id": 425909, "review_id": "62dfa2cbe18e3f004e320ed8", "author_rating": 8.0, "review_text": "I'm a huge Ghostbusters fan since the first film when I was a little girl. After the all-girl cast Ghostbusters I went into this one with extreme low expectations however I was blown away by how nostalgic, heartfelt, and wonderful this movie ended up being. It felt like coming home again. This is the true sequel to the previous Ghostbusters movies.", "created_at": "2022-07-26T08:16:11.532Z"}]