[{"movie_id": 274857, "review_id": "597755b7c3a3684af60061c3", "author_rating": 5.0, "review_text": "It's hard to try and recommend this latest reimagining of the Arthurian legend. It's not very good, but it comes across as the sort of movie that might be a really cool time to see on the big screen. Unfortunately, by now it's finished its theatrical run, and because its not very good, I can't imagine it will ever get another one. So the one way I would like to see it, is a way it can no longer be seen. Because it's not very good.\r\n\r\nIt's Camelot by way of Middle Earth, and though I do enjoy these smarmy fast talkin' Brits a good deal in my films, the Guy Ritchie formula just doesn't lend itself to these sort of properties. The experiment just barely worked out in the first _Sherlock Holmes_ movie, and he's been getting further and further away from the mark ever since. Now he's lined up to hit _Aladdin_ next? I just don't see the connection. It's a shame to say it, but I really do want Guy Ritchie to get back to his wheelhouse. Or if he's over working on that British gangster vibe, to at the very least get him to move forward with some original IP.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-07-25T14:29:11.596Z"}, {"movie_id": 274857, "review_id": "5a1ec1230e0a264cbe078ee6", "author_rating": 7.0, "review_text": "**A different take on the sword in the stone!**\r\n\r\nThis one came with a little surprise. I know it was a Guy Ritchie film and I had enjoyed all his previous flicks. But for some reasons, I felt I'm not that interested in this. Even trailer looked okayish. Watching the film now I realised that I've totally misjudged it. Still not a masterpiece, but a much better entertainer. The graphics were awesome. The settings were totally encouraging to glue to it. The story, stunts, with some of the slow- motions, very detailed and muscularly enchanting.\r\n\r\nEverybody knows the basic storyline of King Arthur. In this, it opened with two brothers feud and following a young man grew up in a brothel. When the city slowly gripped with the myth that the legendary prince would return to the crown, now the king, Vortigern vows to find him first and end the threat. But what comes after him was beyond his expectation. He has to finish it off what he had failed years ago. On the other hand Arthur has all the support, particularly the legendary sword passed on to him by his father.\r\n\r\nI had liked the Disney animated film back when I was a kid. This was completely a different film. For the live-action, it stood and delivered what viewers had expected. The music was another advantage. All the actors were good. The rise of Charlie Hunnan. His recent films were pushing him to the next level. Surely a lookout star. Despite a poor box office, it is a much better film. Once again the film critics got it all wrong. Good for one time watch.\r\n\r\n**7/10**", "created_at": "2017-11-29T14:16:03.747Z"}, {"movie_id": 274857, "review_id": "5a477001925141579d009766", "author_rating": 8.0, "review_text": "These days have been a bit of a movie marathon with the kids being here since the 24th so we have made quite a dent in the to-watch shelf of my movie collection.\n\nYesterday it was time for some rehashing of the Pendragonian legends in the form of King Arthur: The Legend of the Sword. Usually I find it dangerous business to mess with classical and well proven stories. Do not fix what is not broken and all that. I did, however, find this rehash quite entertaining.\n\nThe base of the story is of course, and thankfully, the same: Uther is killed, Excalibur ends up in a stone, Arthur pulls Excalibur out of the stone, lots of swordfights, Arthur becomes king. The details of that story is rehashed quite a lot though.\n\nThe movie opens up with some fairly cool action where Uther combats Mordred (yes Mordred already in the opening scenes, as I said, rehash…) who attacks Camelot with black magic and king-sized (pun intended) combat elephants. I cannot say too much about what happens without spoiling a lot but the sword ends up in the stone and Arthur ends up…somewhere else.\n\nSo already from the start the movie asserted two things, that it is a different take on the Pendragon saga and that it is fairly heavy on action, black magic and special effects. I was a bit worried about the rehashing of the saga bit at this point but, as you have already deduced from the above, overall I quite enjoyed the movie.\n\nThe movie proceeds by showing us Arthur growing up in a bit more misery than the traditional stories do but it does so in more or less fast forward mode and we arrive rather quickly to the point were Arthur pulls out the sword from the stone.\n\nThis is were I have a bit of a gripe with the movie. This moment felt a bit anticlimactic and even disappointing. There was not big moment of awe just confusion. As the movie blurb hints at, Arthur is neither ready nor willing to become a king. So at this point everyone has to go through the hassle of convincing him. I rarely like this reluctant hero concept. Boring!\n\nLuckily Arthur has a merry band of friends to help him chose the right path and this is were the movie spends quite a bit of time. With Arthur as a bit of a Robin Hood in the woods and him and his compadres nibbling at Vortigern’s heels. Of course every so often Arthur is nudged towards his destiny and the action when he decides, well is forced is perhaps more correct, to pick up Excalibur it becomes a bit of an FX feast.\n\nIn terms of acting and characters I would say that they all made a fairly good job of it. Arthur himself is stuck with the reluctant hero role, which I am not too found of as I wrote before, but he is doing a decent enough job of it. Vortigern is not bad as the chief bad guy. I did like the mage although most of the time she was looking into the distance and flapping her eyelids. That is when things were happening though. You do NOT want this gal to flip her eyelids at you!\n\nNaturally everything was slowly building up towards the big bada boum between Arthur and Vortigern and, again, I think this was fairly well done. Lots of action, lots of magic and lots of FX. I really enjoyed how things played out at the end and all the visuals. One thing that I did like more with this version of the story, okay bit of a spoiler ahead, is that it did not end as tragically as the usual King Arthur story.\n\nBottom line, if you are set in stone as to what the Pendragon saga should be then watch another movie. If not and you’re up for some nice fantasy action adventure in the Pendragon universe you might like this movie. I did!", "created_at": "2017-12-30T10:52:49.715Z"}, {"movie_id": 274857, "review_id": "5b3cad9f92514102e200732b", "author_rating": 9.0, "review_text": "When this movie came up last year, I didn't know Guy Ritchie so I thought like why would people do such stupid movies. Then I learned about Guy Ritchie and his wonderful movies but my thoughts still continued; why would Guy Ritchie make a movie that looks so different from his style. Today, I've finally watched the movie and I regret everything I've thought. \r\nAt first 10 minutes you get bored a little bit and wonder why did he left his style. THEN the real action starts and we see typical Ritchie diaologs,  camera angles, cuts, music and everything! Again, it is a movie with high energy without excessive action. Plus, this time we get to see England in a different world and a different time.\r\nAlso, Jude Law as the devil king.... It was everything.\r\nBut if you'd like to see King Arthur in a more traditional, old and a classic way, I don't think you'd like the movie.", "created_at": "2018-07-04T11:21:03.054Z"}, {"movie_id": 274857, "review_id": "62ae7b003c434400931f7f16", "author_rating": 5.0, "review_text": "**Lots of action, lots of CGI, lots of money, lots of anachronism mistakes, little historical sense and little investment in the characters in a movie made to be forgotten.**\r\n\r\nI can't count the films that already exist about the Arthurian legends, or their characters or elements. I could cite several examples, but I believe that each of the readers will be aware of this and will have already seen at least two or three films about it. And the truth is that some of these films are memorable, remarkable. Others not so much. This particular film, I believe, will soon be forgotten. Directed by Guy Ritchie, an ambitious director who gives us satisfying films as easily as he assails us with horrors, it was supposedly the beginning of a sextet of films that will never see the light of day. In fact, this film was so absurdly expensive to produce and release that it had no scope to make a profit for Warner Bros., which, of course, canceled the project.\r\n\r\nLet's face it, the movie isn't even bad, and it's reasonably entertaining. However, I got the feeling that it didn't really bet on the Arthurian legends, taking only its core elements, and the characters names, to create a new story where the impressive CGI could shine. In fact, it is in the production values, and in the technical aspects, that the film stands out: the CGI is of high quality, it fills the screen with beautiful visual effects, and the final fight between Arthur and Vortigern is, perhaps, one of the examples more finely finished. The sound effects work wonderfully, and produce an almost immersive effect, especially if you have a good surround system available. The costumes, the design of the sets, everything is excellent and very well done. The film was expensive, but we see the money invested.\r\n\r\nAnother of the film's strengths is its lavish cast, in which Jude Law shines in a particular way. Indeed, the actor is living an excellent phase in his career, choosing his projects well and showing signs of maturity and commitment to his work. In this film, he is so skilled and good at what he does that he steals all the attention, giving his character an aura of malice and near-insanity befitting someone corrupted by power. I also really liked Djimon Hounsou's work, and even Charlie Hunnam did well, although I don't really like the way he brought Arthur to life. Eric Bana has a decent job, however he doesn't have room to do much, and neither does the rest of the cast. The film is not good for women: Astrid Frisbey is ridiculously underused, while Annabelle Wallis and Poppy Delevingne are almost reduced to extras.\r\n\r\nThis brings me to the first problem with this film: it is too contemporary to be able to make me feel the atmosphere of the 6th century BC, which is the period where Arthur is believed to have existed. Despite the scenery, the clothes, and even the presence of some elegant architectural elements that we associate with the Roman Empire (destroyed aqueducts, some arcades, some old public baths and even an amphitheatre), the characters are never really people of that time, denouncing the 21st century in the way they behave. And then we still have glaring anachronistic errors like the use of swords (and other weaponry and clothing) from the 13th and 14th century in a movie that was supposed to be set almost 700 years earlier. Another example of anachrony is the presence of the Vikings in the film, when it would be more obvious to have Picts, Angles, Jutes and even some Saxons, which are peoples that have little to do with the Vikings, whose maritime expansion would take place centuries later.\r\n\r\nAnother problem with this film is Ritchie's erratic direction. So fascinated was he by CGI and visuals that the director forgot about the rest. The filming and cinematography work is quite weak and insecure; the editing, on the other hand, seems to make random cuts and is not very effective or subtle. The soundtrack is banal and doesn't stay in the ear. In addition, the overkill in CGI and effects has led the film to feel contrived and devoid of emotion and heart, yet it still feels like an expensive film.", "created_at": "2022-06-19T01:25:20.868Z"}]