[{"movie_id": 473033, "review_id": "5dffaa3965686e00139609c5", "author_rating": 8.0, "review_text": "Adam Sandler's best performance? No. But it's indeed his best since Punch-Drunk Love, which continues to be the pinnacle of his talent.\r\n\r\nWhile the film isn't the best talking about technique, it seems to me that its style is totally focused on making the experience an exhausting one. And Uncut Gems is an overwhelming journey full of anxiety and stress. It achieved that splendidly.\r\nThat's its greatest accomplishment: To immerse you in the entire atmosphere of the environment that Sandler's character inhabits, while we witness the cascade of bad decisions he makes.\r\n\r\nPerhaps the biggest mistake is how the directors get to over-lengthen the story, which indirectly gets to a point where Sandler's character becomes obnoxious but I think that's part of the experience, because who ever in their right mind would feel more sympathy for a person like him? I mean more than the allowed sympathy anyways.\r\n\r\nIts ending, although predictable is certainly what he built and there's no learning in it and it doesn't need to be.\r\nAfter all the story was his decline while he believed that he was going to succeed. And yes for a moment he did and for a moment he savored it, but as happens many times in life, good things aren't made to last.\r\n\r\nAnother triumph for A24.\r\n\r\n9 likes", "created_at": "2019-12-22T17:39:05.199Z"}, {"movie_id": 473033, "review_id": "5e2ba36d688cd00015c80315", "author_rating": 8.0, "review_text": "**_Watching a guy screw up for two frantic hours may not sound very compelling, but this is a fine piece of work_**\r\n\r\n>_If you hold this_\r\n\r\n>_Dazzling emerald_\r\n\r\n>_Up to the sky,_\r\n\r\n>_It will shine a billion_\r\n\r\n>_Beautiful miracles_\r\n\r\n>_Painted_\r\n\r\n>_From the tears_\r\n\r\n>_Of the most High._\r\n\r\n>_Plucked_\r\n\r\n>_From the lush gardens_\r\n\r\n>_Of a yellowish-green_\r\n\r\n>_Paradise,_\r\n\r\n>_Look inside this hypnotic gem_\r\n\r\n>_And a kaleidoscope of_\r\n\r\n>_Titillating, soul-raising_\r\n\r\n>_Sights and colors_\r\n\r\n>_Will tease and seduce_\r\n\r\n>_Your eyes_\r\n\r\n>_And mind._\r\n\r\n- Suzy Kassem; \"A Jewelry Store Named India\" (2011)\r\n\r\nWritten by Ronald Bronstein, Josh Safdie, and Benny Safdie, and directed by the Safdies, _Uncut Gems_ is essentially two hours and fifteen minutes of watching a guy screw up in increasingly spectacular and catastrophic ways, make bad decision after bad decision, and give in to his addiction to gambling more and more. It's a film where you know from the first ten minutes that sooner or later, he won't be able to worm his way out of one of his mistakes, and at that point, his seemingly unshakable optimism and belief in his own delusions will prove ill-equipped to deal with the reckoning. So from the first act, you're on edge, and you remain there for the duration. It's a film that never stops moving at the chaotic breakneck speed with which it begins, a film possessed of energy nearly queasy in nature. So, two hours and fifteen minutes of rapidly-paced stress-inducing cinema about a deluded hustler screwing up? Sounds fun doesn't it? No, of course it doesn't. However, it has been made with such craft, the _mise en scène_ is so good, the dialogue so sharp, the acting so intense, that you may as well be watching a fly-on-the-wall documentary. It's a film made of pure sweat and anxiety, and it's about as stressful an experience as you can have at the movies. It's also superb, and I'd highly recommend it.\r\n\r\nThe film begins in 2010 in Welo Mine, Ethiopia, with the discovery of an ultra-rare black opal of extraordinary translucence. We then cut to New York in 2012, where Howard Ratner (Adam Sandler) is a charismatic jeweller who lives his life on the principle of robbing Peter to pay Paul. A serious gambling addict, he always has at least one hustle going, and he always owes somebody something. Soon after we meet him, it's revealed that he's currently in debt to his loan-shark brother-in-law Arno (the great Eric Bogosian) to the tune of $100,000, and Arno is having such a hard time with him, that he's had to hire two Boston thugs, Phil (Keith Williams Richards) and Nico (Tommy Kominik), to try to muscle Howard into paying the money back. Meanwhile, his jewellery business is doing well, not the least reason for which is his colleague Demany (Lakeith Stanfield), who helps bring in high-profile clients. The latest example of such is Boston Celtics' basketballer Kevin Garnett (a surprisingly strong performance by Garnett himself). As Garnett is browsing the store, it's revealed that Howard has smuggled the black opal into the country for an auction the following day, where he expects it will sell for up to $1 million. However, when Garnett sees the stone, he insists he is allowed to have it as a lucky charm, just for the match he's playing that night. Howard is reluctant but agrees to part with it when Garnett offers to leave his All-Star ring as collateral (which Howard immediately pawns for money to place a bet on Garnett's game). And, predictably, things quickly go awry.\r\n\r\nAnd all of this is to say nothing of his contemptuous wife Dinah (Idina Menzel), who has grown to loathe him over the years and considers their marriage a sham; his naïve but kindly colleague and mistress Julia (Julia Fox), with whom he shares an apartment; his father-in-law Gooey (Judd Hirsch), who always seems to see the best in him; and his children, Marcel (Noa Fisher), Eddie (Jonathan Aranbayev), and Beni (Jacob Igielski), none of whom have any illusions about who their father is.\r\n\r\nHoward is a delusional and doomed figure about whom there's a hint of Cosmo Vittelli (Ben Gazzara) – the gambling addict wannabe social climber who keeps slipping on the ladder's lowest rungs in John Cassavetes's _The Killing of a Chinese Bookie_ (1976). However, whereas Vittelli is driven to a point of despair by his own work ethic, Howard is very much the product of late capitalism; a man who genuinely believes, despite past experience to the contrary, that his big score is right around the next corner. In this respect, the film is a deconstruction of the concomitant globalised alienation; a system capable of drawing into a single self-delusional orbit such varied parties as exploited Ethiopian manual labourers, small business owners in New York, under-pressure athletes, loan-sharks, and bookies – all operating with the unshakable belief that a huge win is just within their grasp. Howard, of course, is the worst example, and is essentially a fantasist who's utterly divorced from reality, a man who believes completely that if people would get out of his way and let him turn that fabled corner, all of his worries will disappear. It's the gambling addict's fallacy – no matter how much or how often you lose, the next bet will be the big winner. The problem Howard faces is that he has made promises based on that fallacy – he owes money which he can only pay if his latest scheme works out _exactly_ as intended; such is the precarious house of cards that is his life.\r\n\r\nIn this sense, the film is an especially astute study of addiction, although this theme is never foregrounded – no one accuses Howard of being a gambling addict, and he certainly doesn't seem to think of himself as one. This is not a cautionary tale about the perils of addiction. Indeed it even goes so far as to play up (if not necessarily glamorise) the gambler's high – the precarious sense of everything being on the line, consequences be damned, the sense that if one thing goes wrong, everything collapses, but if everything goes right… However, if you're paying even the slightest bit of attention, you can't help but see just how hopelessly consumed Howard is by his addiction (never once does he give the impression that he wants to stop gambling). It has wormed its way into every facet of his life, to the point where it has become his life, or certainly a hugely important part of that life. This is why delusion is such a major component in his psychological make-up – addiction and delusion form an ever-tightening feedback loop that becomes more difficult from which to escape, the more self-sustaining they become.\r\n\r\nIn terms of aesthetics, it's worth noting that two of the three writers (Bronstein and Benny Safdie) are also credited as the editors, and this is crucial insofar as the frenetic pace of the narrative isn't achieved only by the cutting, but by the script as well – this is a film written by people with at least one eye on the editing rhythms. The first scenes in New York, for example, immediately establish the chaotic energy – Howard speaking rapidly into his mobile, dialogue overlapping almost unintelligibly as multiple characters interact and talk over one another, at least three things always happening, each one of which would occupy our complete attention in a more conventional film. Here, it's almost like everything is a background to everything else, with nothing ever given a sustained sole focus. The opening scenes establish the pace as blistering, and that never really changes. It's the kind of film where there's perpetual propulsive momentum – because the characters never stop moving, neither does the story, even if the characters never actually manage to get anywhere. The score, by Oneohtrix Point Never, is also excellent. Obviously inspired by Tangerine Dream's electronic scores for Michael Mann's early films, most notably _Thief_ (1981), it's an unexpectedly crucial element of the film, adding to the overlapping cacophony of sounds and enhancing the general sense of twitchy chaos.\r\n\r\nAs for the acting, everything you've heard about Sandler is true; he's incredible. The Safdies originally pitched him the script in 2009, but he turned it down and the project went nowhere. In 2017, after the success of _Good Time_, they resurrected the film and cast Jonah Hill as Howard, but when he dropped out, they offered it to Sandler again. And he totally and completely inhabits Howard, to the extent where it no longer even seems like acting. And sure, he's playing the same kind of volatile delusional loser that he's played in a million-and-one subpar comedies. But it's the tone of the performance, the key in which he plays Howard that makes it stand out. You could make the argument that Howard is simply Sandler dialled up to 11, and you wouldn't be wrong, but the inherent tragedy of the man, his self-delusion, his seemingly unquenchable optimism and belief in himself – Sandler draws these elements out every second he's on-screen, finding pathos in virtually everything he does, in a performance that's both subtle and broad. I'm no Sandler apologist, but he really does have to be seen here to be believed. Elsewhere, Bogosian is his usual stoically intimidating self; first-time performers Williams Richards and Kominik are each as terrifying and authentic as the other; Menzel manages some of the most withering looks ever captured on film; and Fox, another impressive debutant, imbues what could have been a clichéd bimbo-type role with real emotional nuance.\r\n\r\nAs for problems, the pace of the film will certainly put some people off. There are no down-moments here, no scenes designed to let the audience breath. This is as anxiety-inducing a film as you're likely to see, and that simply won't be to everyone's taste. Partly because of this, the tone never really varies. There are some comic beats (Howard getting dumped naked into a car trunk during his daughter's school play is particularly funny), but by and large, the tone is perpetually dark, ominous, and exhausting. Which, again, won't be for everyone. And there will, of course, be people who just can't get past the presence of Adam Sandler, which I can understand. Personally though, I loved _Uncut Gems_. It's certainly not the subtlest of films, nor the most thematically complex, but as character studies go, this is exceptionally good work from everyone involved and a genuinely unique piece of cinema.", "created_at": "2020-01-25T02:09:49.416Z"}, {"movie_id": 473033, "review_id": "5e2f2c14ac8e6b0015bcdb9e", "author_rating": 8.0, "review_text": "“This is how *I* win.”\r\n\r\nOne of the most stressful movie experiences I’ve had in awhile.\r\n\r\nThis whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.\r\n\r\nWhile I like ‘Good Time’ a little more, but man what a rush.\r\n\r\nAdam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.\r\n\r\nBenny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.\r\n\r\nI loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.\r\n\r\nKevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.\r\n\r\nOverall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.\r\n\r\nI hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy.", "created_at": "2020-01-27T18:29:40.635Z"}, {"movie_id": 473033, "review_id": "5e53ba8fa76ac50013a6d8b8", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nThe Safdie brothers are known for their anxiety-inducing films, and Uncut Gems follows that tradition. It’s definitely a movie meant to be divisive. At several points during the film, all a viewer wants is to yell “shut up” to everyone on screen. The frenetic pacing, the overwhelming dialogue, and the loud score serve as both praise and criticism. \r\n\r\nAdam Sandler gives a career-best performance, but the narrative never quite grabbed me, being too repetitive and possessing a predictable yet impactful ending.\r\n\r\nRating: B", "created_at": "2020-02-24T11:59:11.706Z"}, {"movie_id": 473033, "review_id": "5e7d56b9eec4f34267aa04aa", "author_rating": 6.0, "review_text": "Brothers and co-directors Josh and Benny Safdie are two of the most exciting names working in modern independent cinema, so their film “Uncut Gems” debuted alongside a shadow of grandiose expectations. The bottom line is that the film is good but far from great, and I’m comfortable going out on a limb and guessing those crowing the loudest about how fresh and original this movie is haven’t seen their far superior 2017 film, “Good Time.”\r\n\r\nNew York City jeweler Howard Ratner (Adam Sandler) is always on the lookout for the next big score. When he makes a series of high stakes bets that could lead to the windfall of a lifetime, Howard finds himself struggling to keep the balance between the growing list of adversaries, his business, his scams, and his home life. There isn’t much to the story other than a lot of cursing and ongoing scams, but there’s a decent sense of suspense that carries through the majority of the film.\r\n\r\nThe most shocking thing about “Uncut Gems” is that it lacks depth, especially when compared to “Good Time.” It’s not unfair to compare the two films, as each portray a gritty side of the city with antiheros who are close to completely hitting the skids. An effective crime thriller should have a lead character you can at least root for if not relate to, and Howard isn’t it. Sandler’s character is an irritating scumbag and while I guess that’s what he was going for in his performance, it’s shrill and unpleasant to spend time around this loser. I didn’t really care to see the end of Howard’s story because by the time it rolled around, I was completely worn down by his repeated poor decisions.\r\n\r\nHere’s what happens in the film: Howard lies, gets cash, gambles it away, extends himself, gets a beating / stern warning / workplace visit from goons, then lies, gets cash, gambles it away, extends himself, and gets another beat down / visit from more goons. It’s an exhausting repetition of watching a sleazy scumbag spiraling out of control by digging himself deeper into a hole. His cycle of poor decisions is coupled with an indestructible optimism of a life-changing big score. Why should I care about somebody like that?\r\n\r\nSandler is good in the lead role, but much of the praise seems to be coming from the fact that, after a career in comedy films, his performance is unexpected. He’s a talented man, but he’s been even better in other, smaller films (like Noah Baumbach’s “The Meyerowitz Stories”). Howard is a loud, crude, unpleasant man to spend time with, but Sandler inhabits the role as a shady jewelry dealer and degenerate gambler in a way that lends the slightest glimmer of humanity to an otherwise detestable character.\r\n\r\nThe film plays like a hardcore, taxing Scorsese ripoff. It’s not very exciting, and the tension that does exist feels forced. The direction is more conventional than the material suggests, but major applause to the Safdie brothers for conveying their clear vision and having the courage to stick with it. They’ve started to corner the cinematic market on adapting the gritty side of New York for a modern era. I don’t feel the Safdies are as overrated as some other critics do, but I do think this film is bloated in all the wrong ways.", "created_at": "2020-03-27T01:28:25.793Z"}, {"movie_id": 473033, "review_id": "5e98978ff6596f0014cdd414", "author_rating": 7.0, "review_text": "Decent enough drama with Adam Sandler, though really found his character a bit too obnoxious to really care about though the ending was well done and surprisingly thrilling, but I have no problem with Sandler not getting a nod, I have seen him do better work (Punch Drunk Love for instance). Still, worth checking out even if it is a bit on the lengthier side for what it is. **3.5/5**", "created_at": "2020-04-16T17:36:15.394Z"}, {"movie_id": 473033, "review_id": "5ee64951cb71b8001cb6e5d8", "author_rating": 2.0, "review_text": "Sorry, I am sure this movie had it's share of good ratings, but for me the movie was confusing coupled with a barrage of unnecessary profanity. I have always been an Adam fan of Sandler, but I couldn't get past the confusion.", "created_at": "2020-06-14T15:59:13.193Z"}, {"movie_id": 473033, "review_id": "60458ce5efea7a002df505b8", "author_rating": 9.0, "review_text": "Quality!\r\n\r\n<em>'Uncut Gems'</em> is an absolutely thoroughly thrilling watch, the plot is so chaotic and high paced that it's practically impossible to not have a fun time with it. The cast do terrific work, typified by the tremendous Adam Sandler.\r\n\r\nSandler (Howard) is unquestionably the star of the film, he gets a lot of stick for a lot of the roles he usually plays but this is far from anything I've seen him portray. He still shows his funny side no doubt, but he adds much more to make it a memorable character - which is a rarity for him.\r\n\r\nLakeith Stanfield, Julia Fox, Kevin Garnett and Eric Bogosian are all good too. The score is pretty solid, also. There isn't much more to note really, it's a crime thriller and it absolutely nails that realm. Great film.", "created_at": "2021-03-08T02:33:09.307Z"}, {"movie_id": 473033, "review_id": "6397322b79b3d4007a2d7d16", "author_rating": 3.0, "review_text": "I never seen so much profanity in any movie. Whole movie was like \"f*ck, f*ck, F*ck\" or \"n**ga, n**ga, n**ga\"... What makes this movie worst besides profanity is that it's very chaotic. A lot of people talking the same time which creates chaos and you as a watcher get overwhelmed. Story was okay, nothing special. But again very overwhelming, chaotic and full of profanity. If director wanted to impress us with those things, well, I can tell him that he clearly failed. Everyone can curse, it doesn't need talent. Profanity and chaos doesn't make a good movie. Story does and good acting does, which felt lacking in this movie.", "created_at": "2022-12-12T13:52:43.581Z"}, {"movie_id": 473033, "review_id": "5dffaa3965686e00139609c5", "author_rating": 8.0, "review_text": "Adam Sandler's best performance? No. But it's indeed his best since Punch-Drunk Love, which continues to be the pinnacle of his talent.\r\n\r\nWhile the film isn't the best talking about technique, it seems to me that its style is totally focused on making the experience an exhausting one. And Uncut Gems is an overwhelming journey full of anxiety and stress. It achieved that splendidly.\r\nThat's its greatest accomplishment: To immerse you in the entire atmosphere of the environment that Sandler's character inhabits, while we witness the cascade of bad decisions he makes.\r\n\r\nPerhaps the biggest mistake is how the directors get to over-lengthen the story, which indirectly gets to a point where Sandler's character becomes obnoxious but I think that's part of the experience, because who ever in their right mind would feel more sympathy for a person like him? I mean more than the allowed sympathy anyways.\r\n\r\nIts ending, although predictable is certainly what he built and there's no learning in it and it doesn't need to be.\r\nAfter all the story was his decline while he believed that he was going to succeed. And yes for a moment he did and for a moment he savored it, but as happens many times in life, good things aren't made to last.\r\n\r\nAnother triumph for A24.\r\n\r\n9 likes", "created_at": "2019-12-22T17:39:05.199Z"}, {"movie_id": 473033, "review_id": "5e2ba36d688cd00015c80315", "author_rating": 8.0, "review_text": "**_Watching a guy screw up for two frantic hours may not sound very compelling, but this is a fine piece of work_**\r\n\r\n>_If you hold this_\r\n\r\n>_Dazzling emerald_\r\n\r\n>_Up to the sky,_\r\n\r\n>_It will shine a billion_\r\n\r\n>_Beautiful miracles_\r\n\r\n>_Painted_\r\n\r\n>_From the tears_\r\n\r\n>_Of the most High._\r\n\r\n>_Plucked_\r\n\r\n>_From the lush gardens_\r\n\r\n>_Of a yellowish-green_\r\n\r\n>_Paradise,_\r\n\r\n>_Look inside this hypnotic gem_\r\n\r\n>_And a kaleidoscope of_\r\n\r\n>_Titillating, soul-raising_\r\n\r\n>_Sights and colors_\r\n\r\n>_Will tease and seduce_\r\n\r\n>_Your eyes_\r\n\r\n>_And mind._\r\n\r\n- Suzy Kassem; \"A Jewelry Store Named India\" (2011)\r\n\r\nWritten by Ronald Bronstein, Josh Safdie, and Benny Safdie, and directed by the Safdies, _Uncut Gems_ is essentially two hours and fifteen minutes of watching a guy screw up in increasingly spectacular and catastrophic ways, make bad decision after bad decision, and give in to his addiction to gambling more and more. It's a film where you know from the first ten minutes that sooner or later, he won't be able to worm his way out of one of his mistakes, and at that point, his seemingly unshakable optimism and belief in his own delusions will prove ill-equipped to deal with the reckoning. So from the first act, you're on edge, and you remain there for the duration. It's a film that never stops moving at the chaotic breakneck speed with which it begins, a film possessed of energy nearly queasy in nature. So, two hours and fifteen minutes of rapidly-paced stress-inducing cinema about a deluded hustler screwing up? Sounds fun doesn't it? No, of course it doesn't. However, it has been made with such craft, the _mise en scène_ is so good, the dialogue so sharp, the acting so intense, that you may as well be watching a fly-on-the-wall documentary. It's a film made of pure sweat and anxiety, and it's about as stressful an experience as you can have at the movies. It's also superb, and I'd highly recommend it.\r\n\r\nThe film begins in 2010 in Welo Mine, Ethiopia, with the discovery of an ultra-rare black opal of extraordinary translucence. We then cut to New York in 2012, where Howard Ratner (Adam Sandler) is a charismatic jeweller who lives his life on the principle of robbing Peter to pay Paul. A serious gambling addict, he always has at least one hustle going, and he always owes somebody something. Soon after we meet him, it's revealed that he's currently in debt to his loan-shark brother-in-law Arno (the great Eric Bogosian) to the tune of $100,000, and Arno is having such a hard time with him, that he's had to hire two Boston thugs, Phil (Keith Williams Richards) and Nico (Tommy Kominik), to try to muscle Howard into paying the money back. Meanwhile, his jewellery business is doing well, not the least reason for which is his colleague Demany (Lakeith Stanfield), who helps bring in high-profile clients. The latest example of such is Boston Celtics' basketballer Kevin Garnett (a surprisingly strong performance by Garnett himself). As Garnett is browsing the store, it's revealed that Howard has smuggled the black opal into the country for an auction the following day, where he expects it will sell for up to $1 million. However, when Garnett sees the stone, he insists he is allowed to have it as a lucky charm, just for the match he's playing that night. Howard is reluctant but agrees to part with it when Garnett offers to leave his All-Star ring as collateral (which Howard immediately pawns for money to place a bet on Garnett's game). And, predictably, things quickly go awry.\r\n\r\nAnd all of this is to say nothing of his contemptuous wife Dinah (Idina Menzel), who has grown to loathe him over the years and considers their marriage a sham; his naïve but kindly colleague and mistress Julia (Julia Fox), with whom he shares an apartment; his father-in-law Gooey (Judd Hirsch), who always seems to see the best in him; and his children, Marcel (Noa Fisher), Eddie (Jonathan Aranbayev), and Beni (Jacob Igielski), none of whom have any illusions about who their father is.\r\n\r\nHoward is a delusional and doomed figure about whom there's a hint of Cosmo Vittelli (Ben Gazzara) – the gambling addict wannabe social climber who keeps slipping on the ladder's lowest rungs in John Cassavetes's _The Killing of a Chinese Bookie_ (1976). However, whereas Vittelli is driven to a point of despair by his own work ethic, Howard is very much the product of late capitalism; a man who genuinely believes, despite past experience to the contrary, that his big score is right around the next corner. In this respect, the film is a deconstruction of the concomitant globalised alienation; a system capable of drawing into a single self-delusional orbit such varied parties as exploited Ethiopian manual labourers, small business owners in New York, under-pressure athletes, loan-sharks, and bookies – all operating with the unshakable belief that a huge win is just within their grasp. Howard, of course, is the worst example, and is essentially a fantasist who's utterly divorced from reality, a man who believes completely that if people would get out of his way and let him turn that fabled corner, all of his worries will disappear. It's the gambling addict's fallacy – no matter how much or how often you lose, the next bet will be the big winner. The problem Howard faces is that he has made promises based on that fallacy – he owes money which he can only pay if his latest scheme works out _exactly_ as intended; such is the precarious house of cards that is his life.\r\n\r\nIn this sense, the film is an especially astute study of addiction, although this theme is never foregrounded – no one accuses Howard of being a gambling addict, and he certainly doesn't seem to think of himself as one. This is not a cautionary tale about the perils of addiction. Indeed it even goes so far as to play up (if not necessarily glamorise) the gambler's high – the precarious sense of everything being on the line, consequences be damned, the sense that if one thing goes wrong, everything collapses, but if everything goes right… However, if you're paying even the slightest bit of attention, you can't help but see just how hopelessly consumed Howard is by his addiction (never once does he give the impression that he wants to stop gambling). It has wormed its way into every facet of his life, to the point where it has become his life, or certainly a hugely important part of that life. This is why delusion is such a major component in his psychological make-up – addiction and delusion form an ever-tightening feedback loop that becomes more difficult from which to escape, the more self-sustaining they become.\r\n\r\nIn terms of aesthetics, it's worth noting that two of the three writers (Bronstein and Benny Safdie) are also credited as the editors, and this is crucial insofar as the frenetic pace of the narrative isn't achieved only by the cutting, but by the script as well – this is a film written by people with at least one eye on the editing rhythms. The first scenes in New York, for example, immediately establish the chaotic energy – Howard speaking rapidly into his mobile, dialogue overlapping almost unintelligibly as multiple characters interact and talk over one another, at least three things always happening, each one of which would occupy our complete attention in a more conventional film. Here, it's almost like everything is a background to everything else, with nothing ever given a sustained sole focus. The opening scenes establish the pace as blistering, and that never really changes. It's the kind of film where there's perpetual propulsive momentum – because the characters never stop moving, neither does the story, even if the characters never actually manage to get anywhere. The score, by Oneohtrix Point Never, is also excellent. Obviously inspired by Tangerine Dream's electronic scores for Michael Mann's early films, most notably _Thief_ (1981), it's an unexpectedly crucial element of the film, adding to the overlapping cacophony of sounds and enhancing the general sense of twitchy chaos.\r\n\r\nAs for the acting, everything you've heard about Sandler is true; he's incredible. The Safdies originally pitched him the script in 2009, but he turned it down and the project went nowhere. In 2017, after the success of _Good Time_, they resurrected the film and cast Jonah Hill as Howard, but when he dropped out, they offered it to Sandler again. And he totally and completely inhabits Howard, to the extent where it no longer even seems like acting. And sure, he's playing the same kind of volatile delusional loser that he's played in a million-and-one subpar comedies. But it's the tone of the performance, the key in which he plays Howard that makes it stand out. You could make the argument that Howard is simply Sandler dialled up to 11, and you wouldn't be wrong, but the inherent tragedy of the man, his self-delusion, his seemingly unquenchable optimism and belief in himself – Sandler draws these elements out every second he's on-screen, finding pathos in virtually everything he does, in a performance that's both subtle and broad. I'm no Sandler apologist, but he really does have to be seen here to be believed. Elsewhere, Bogosian is his usual stoically intimidating self; first-time performers Williams Richards and Kominik are each as terrifying and authentic as the other; Menzel manages some of the most withering looks ever captured on film; and Fox, another impressive debutant, imbues what could have been a clichéd bimbo-type role with real emotional nuance.\r\n\r\nAs for problems, the pace of the film will certainly put some people off. There are no down-moments here, no scenes designed to let the audience breath. This is as anxiety-inducing a film as you're likely to see, and that simply won't be to everyone's taste. Partly because of this, the tone never really varies. There are some comic beats (Howard getting dumped naked into a car trunk during his daughter's school play is particularly funny), but by and large, the tone is perpetually dark, ominous, and exhausting. Which, again, won't be for everyone. And there will, of course, be people who just can't get past the presence of Adam Sandler, which I can understand. Personally though, I loved _Uncut Gems_. It's certainly not the subtlest of films, nor the most thematically complex, but as character studies go, this is exceptionally good work from everyone involved and a genuinely unique piece of cinema.", "created_at": "2020-01-25T02:09:49.416Z"}, {"movie_id": 473033, "review_id": "5e2f2c14ac8e6b0015bcdb9e", "author_rating": 8.0, "review_text": "“This is how *I* win.”\r\n\r\nOne of the most stressful movie experiences I’ve had in awhile.\r\n\r\nThis whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.\r\n\r\nWhile I like ‘Good Time’ a little more, but man what a rush.\r\n\r\nAdam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.\r\n\r\nBenny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.\r\n\r\nI loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.\r\n\r\nKevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.\r\n\r\nOverall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.\r\n\r\nI hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy.", "created_at": "2020-01-27T18:29:40.635Z"}, {"movie_id": 473033, "review_id": "5e53ba8fa76ac50013a6d8b8", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nThe Safdie brothers are known for their anxiety-inducing films, and Uncut Gems follows that tradition. It’s definitely a movie meant to be divisive. At several points during the film, all a viewer wants is to yell “shut up” to everyone on screen. The frenetic pacing, the overwhelming dialogue, and the loud score serve as both praise and criticism. \r\n\r\nAdam Sandler gives a career-best performance, but the narrative never quite grabbed me, being too repetitive and possessing a predictable yet impactful ending.\r\n\r\nRating: B", "created_at": "2020-02-24T11:59:11.706Z"}, {"movie_id": 473033, "review_id": "5e7d56b9eec4f34267aa04aa", "author_rating": 6.0, "review_text": "Brothers and co-directors Josh and Benny Safdie are two of the most exciting names working in modern independent cinema, so their film “Uncut Gems” debuted alongside a shadow of grandiose expectations. The bottom line is that the film is good but far from great, and I’m comfortable going out on a limb and guessing those crowing the loudest about how fresh and original this movie is haven’t seen their far superior 2017 film, “Good Time.”\r\n\r\nNew York City jeweler Howard Ratner (Adam Sandler) is always on the lookout for the next big score. When he makes a series of high stakes bets that could lead to the windfall of a lifetime, Howard finds himself struggling to keep the balance between the growing list of adversaries, his business, his scams, and his home life. There isn’t much to the story other than a lot of cursing and ongoing scams, but there’s a decent sense of suspense that carries through the majority of the film.\r\n\r\nThe most shocking thing about “Uncut Gems” is that it lacks depth, especially when compared to “Good Time.” It’s not unfair to compare the two films, as each portray a gritty side of the city with antiheros who are close to completely hitting the skids. An effective crime thriller should have a lead character you can at least root for if not relate to, and Howard isn’t it. Sandler’s character is an irritating scumbag and while I guess that’s what he was going for in his performance, it’s shrill and unpleasant to spend time around this loser. I didn’t really care to see the end of Howard’s story because by the time it rolled around, I was completely worn down by his repeated poor decisions.\r\n\r\nHere’s what happens in the film: Howard lies, gets cash, gambles it away, extends himself, gets a beating / stern warning / workplace visit from goons, then lies, gets cash, gambles it away, extends himself, and gets another beat down / visit from more goons. It’s an exhausting repetition of watching a sleazy scumbag spiraling out of control by digging himself deeper into a hole. His cycle of poor decisions is coupled with an indestructible optimism of a life-changing big score. Why should I care about somebody like that?\r\n\r\nSandler is good in the lead role, but much of the praise seems to be coming from the fact that, after a career in comedy films, his performance is unexpected. He’s a talented man, but he’s been even better in other, smaller films (like Noah Baumbach’s “The Meyerowitz Stories”). Howard is a loud, crude, unpleasant man to spend time with, but Sandler inhabits the role as a shady jewelry dealer and degenerate gambler in a way that lends the slightest glimmer of humanity to an otherwise detestable character.\r\n\r\nThe film plays like a hardcore, taxing Scorsese ripoff. It’s not very exciting, and the tension that does exist feels forced. The direction is more conventional than the material suggests, but major applause to the Safdie brothers for conveying their clear vision and having the courage to stick with it. They’ve started to corner the cinematic market on adapting the gritty side of New York for a modern era. I don’t feel the Safdies are as overrated as some other critics do, but I do think this film is bloated in all the wrong ways.", "created_at": "2020-03-27T01:28:25.793Z"}, {"movie_id": 473033, "review_id": "5e98978ff6596f0014cdd414", "author_rating": 7.0, "review_text": "Decent enough drama with Adam Sandler, though really found his character a bit too obnoxious to really care about though the ending was well done and surprisingly thrilling, but I have no problem with Sandler not getting a nod, I have seen him do better work (Punch Drunk Love for instance). Still, worth checking out even if it is a bit on the lengthier side for what it is. **3.5/5**", "created_at": "2020-04-16T17:36:15.394Z"}, {"movie_id": 473033, "review_id": "5ee64951cb71b8001cb6e5d8", "author_rating": 2.0, "review_text": "Sorry, I am sure this movie had it's share of good ratings, but for me the movie was confusing coupled with a barrage of unnecessary profanity. I have always been an Adam fan of Sandler, but I couldn't get past the confusion.", "created_at": "2020-06-14T15:59:13.193Z"}, {"movie_id": 473033, "review_id": "60458ce5efea7a002df505b8", "author_rating": 9.0, "review_text": "Quality!\r\n\r\n<em>'Uncut Gems'</em> is an absolutely thoroughly thrilling watch, the plot is so chaotic and high paced that it's practically impossible to not have a fun time with it. The cast do terrific work, typified by the tremendous Adam Sandler.\r\n\r\nSandler (Howard) is unquestionably the star of the film, he gets a lot of stick for a lot of the roles he usually plays but this is far from anything I've seen him portray. He still shows his funny side no doubt, but he adds much more to make it a memorable character - which is a rarity for him.\r\n\r\nLakeith Stanfield, Julia Fox, Kevin Garnett and Eric Bogosian are all good too. The score is pretty solid, also. There isn't much more to note really, it's a crime thriller and it absolutely nails that realm. Great film.", "created_at": "2021-03-08T02:33:09.307Z"}, {"movie_id": 473033, "review_id": "6397322b79b3d4007a2d7d16", "author_rating": 3.0, "review_text": "I never seen so much profanity in any movie. Whole movie was like \"f*ck, f*ck, F*ck\" or \"n**ga, n**ga, n**ga\"... What makes this movie worst besides profanity is that it's very chaotic. A lot of people talking the same time which creates chaos and you as a watcher get overwhelmed. Story was okay, nothing special. But again very overwhelming, chaotic and full of profanity. If director wanted to impress us with those things, well, I can tell him that he clearly failed. Everyone can curse, it doesn't need talent. Profanity and chaos doesn't make a good movie. Story does and good acting does, which felt lacking in this movie.", "created_at": "2022-12-12T13:52:43.581Z"}, {"movie_id": 473033, "review_id": "5dffaa3965686e00139609c5", "author_rating": 8.0, "review_text": "Adam Sandler's best performance? No. But it's indeed his best since Punch-Drunk Love, which continues to be the pinnacle of his talent.\r\n\r\nWhile the film isn't the best talking about technique, it seems to me that its style is totally focused on making the experience an exhausting one. And Uncut Gems is an overwhelming journey full of anxiety and stress. It achieved that splendidly.\r\nThat's its greatest accomplishment: To immerse you in the entire atmosphere of the environment that Sandler's character inhabits, while we witness the cascade of bad decisions he makes.\r\n\r\nPerhaps the biggest mistake is how the directors get to over-lengthen the story, which indirectly gets to a point where Sandler's character becomes obnoxious but I think that's part of the experience, because who ever in their right mind would feel more sympathy for a person like him? I mean more than the allowed sympathy anyways.\r\n\r\nIts ending, although predictable is certainly what he built and there's no learning in it and it doesn't need to be.\r\nAfter all the story was his decline while he believed that he was going to succeed. And yes for a moment he did and for a moment he savored it, but as happens many times in life, good things aren't made to last.\r\n\r\nAnother triumph for A24.\r\n\r\n9 likes", "created_at": "2019-12-22T17:39:05.199Z"}, {"movie_id": 473033, "review_id": "5e2ba36d688cd00015c80315", "author_rating": 8.0, "review_text": "**_Watching a guy screw up for two frantic hours may not sound very compelling, but this is a fine piece of work_**\r\n\r\n>_If you hold this_\r\n\r\n>_Dazzling emerald_\r\n\r\n>_Up to the sky,_\r\n\r\n>_It will shine a billion_\r\n\r\n>_Beautiful miracles_\r\n\r\n>_Painted_\r\n\r\n>_From the tears_\r\n\r\n>_Of the most High._\r\n\r\n>_Plucked_\r\n\r\n>_From the lush gardens_\r\n\r\n>_Of a yellowish-green_\r\n\r\n>_Paradise,_\r\n\r\n>_Look inside this hypnotic gem_\r\n\r\n>_And a kaleidoscope of_\r\n\r\n>_Titillating, soul-raising_\r\n\r\n>_Sights and colors_\r\n\r\n>_Will tease and seduce_\r\n\r\n>_Your eyes_\r\n\r\n>_And mind._\r\n\r\n- Suzy Kassem; \"A Jewelry Store Named India\" (2011)\r\n\r\nWritten by Ronald Bronstein, Josh Safdie, and Benny Safdie, and directed by the Safdies, _Uncut Gems_ is essentially two hours and fifteen minutes of watching a guy screw up in increasingly spectacular and catastrophic ways, make bad decision after bad decision, and give in to his addiction to gambling more and more. It's a film where you know from the first ten minutes that sooner or later, he won't be able to worm his way out of one of his mistakes, and at that point, his seemingly unshakable optimism and belief in his own delusions will prove ill-equipped to deal with the reckoning. So from the first act, you're on edge, and you remain there for the duration. It's a film that never stops moving at the chaotic breakneck speed with which it begins, a film possessed of energy nearly queasy in nature. So, two hours and fifteen minutes of rapidly-paced stress-inducing cinema about a deluded hustler screwing up? Sounds fun doesn't it? No, of course it doesn't. However, it has been made with such craft, the _mise en scène_ is so good, the dialogue so sharp, the acting so intense, that you may as well be watching a fly-on-the-wall documentary. It's a film made of pure sweat and anxiety, and it's about as stressful an experience as you can have at the movies. It's also superb, and I'd highly recommend it.\r\n\r\nThe film begins in 2010 in Welo Mine, Ethiopia, with the discovery of an ultra-rare black opal of extraordinary translucence. We then cut to New York in 2012, where Howard Ratner (Adam Sandler) is a charismatic jeweller who lives his life on the principle of robbing Peter to pay Paul. A serious gambling addict, he always has at least one hustle going, and he always owes somebody something. Soon after we meet him, it's revealed that he's currently in debt to his loan-shark brother-in-law Arno (the great Eric Bogosian) to the tune of $100,000, and Arno is having such a hard time with him, that he's had to hire two Boston thugs, Phil (Keith Williams Richards) and Nico (Tommy Kominik), to try to muscle Howard into paying the money back. Meanwhile, his jewellery business is doing well, not the least reason for which is his colleague Demany (Lakeith Stanfield), who helps bring in high-profile clients. The latest example of such is Boston Celtics' basketballer Kevin Garnett (a surprisingly strong performance by Garnett himself). As Garnett is browsing the store, it's revealed that Howard has smuggled the black opal into the country for an auction the following day, where he expects it will sell for up to $1 million. However, when Garnett sees the stone, he insists he is allowed to have it as a lucky charm, just for the match he's playing that night. Howard is reluctant but agrees to part with it when Garnett offers to leave his All-Star ring as collateral (which Howard immediately pawns for money to place a bet on Garnett's game). And, predictably, things quickly go awry.\r\n\r\nAnd all of this is to say nothing of his contemptuous wife Dinah (Idina Menzel), who has grown to loathe him over the years and considers their marriage a sham; his naïve but kindly colleague and mistress Julia (Julia Fox), with whom he shares an apartment; his father-in-law Gooey (Judd Hirsch), who always seems to see the best in him; and his children, Marcel (Noa Fisher), Eddie (Jonathan Aranbayev), and Beni (Jacob Igielski), none of whom have any illusions about who their father is.\r\n\r\nHoward is a delusional and doomed figure about whom there's a hint of Cosmo Vittelli (Ben Gazzara) – the gambling addict wannabe social climber who keeps slipping on the ladder's lowest rungs in John Cassavetes's _The Killing of a Chinese Bookie_ (1976). However, whereas Vittelli is driven to a point of despair by his own work ethic, Howard is very much the product of late capitalism; a man who genuinely believes, despite past experience to the contrary, that his big score is right around the next corner. In this respect, the film is a deconstruction of the concomitant globalised alienation; a system capable of drawing into a single self-delusional orbit such varied parties as exploited Ethiopian manual labourers, small business owners in New York, under-pressure athletes, loan-sharks, and bookies – all operating with the unshakable belief that a huge win is just within their grasp. Howard, of course, is the worst example, and is essentially a fantasist who's utterly divorced from reality, a man who believes completely that if people would get out of his way and let him turn that fabled corner, all of his worries will disappear. It's the gambling addict's fallacy – no matter how much or how often you lose, the next bet will be the big winner. The problem Howard faces is that he has made promises based on that fallacy – he owes money which he can only pay if his latest scheme works out _exactly_ as intended; such is the precarious house of cards that is his life.\r\n\r\nIn this sense, the film is an especially astute study of addiction, although this theme is never foregrounded – no one accuses Howard of being a gambling addict, and he certainly doesn't seem to think of himself as one. This is not a cautionary tale about the perils of addiction. Indeed it even goes so far as to play up (if not necessarily glamorise) the gambler's high – the precarious sense of everything being on the line, consequences be damned, the sense that if one thing goes wrong, everything collapses, but if everything goes right… However, if you're paying even the slightest bit of attention, you can't help but see just how hopelessly consumed Howard is by his addiction (never once does he give the impression that he wants to stop gambling). It has wormed its way into every facet of his life, to the point where it has become his life, or certainly a hugely important part of that life. This is why delusion is such a major component in his psychological make-up – addiction and delusion form an ever-tightening feedback loop that becomes more difficult from which to escape, the more self-sustaining they become.\r\n\r\nIn terms of aesthetics, it's worth noting that two of the three writers (Bronstein and Benny Safdie) are also credited as the editors, and this is crucial insofar as the frenetic pace of the narrative isn't achieved only by the cutting, but by the script as well – this is a film written by people with at least one eye on the editing rhythms. The first scenes in New York, for example, immediately establish the chaotic energy – Howard speaking rapidly into his mobile, dialogue overlapping almost unintelligibly as multiple characters interact and talk over one another, at least three things always happening, each one of which would occupy our complete attention in a more conventional film. Here, it's almost like everything is a background to everything else, with nothing ever given a sustained sole focus. The opening scenes establish the pace as blistering, and that never really changes. It's the kind of film where there's perpetual propulsive momentum – because the characters never stop moving, neither does the story, even if the characters never actually manage to get anywhere. The score, by Oneohtrix Point Never, is also excellent. Obviously inspired by Tangerine Dream's electronic scores for Michael Mann's early films, most notably _Thief_ (1981), it's an unexpectedly crucial element of the film, adding to the overlapping cacophony of sounds and enhancing the general sense of twitchy chaos.\r\n\r\nAs for the acting, everything you've heard about Sandler is true; he's incredible. The Safdies originally pitched him the script in 2009, but he turned it down and the project went nowhere. In 2017, after the success of _Good Time_, they resurrected the film and cast Jonah Hill as Howard, but when he dropped out, they offered it to Sandler again. And he totally and completely inhabits Howard, to the extent where it no longer even seems like acting. And sure, he's playing the same kind of volatile delusional loser that he's played in a million-and-one subpar comedies. But it's the tone of the performance, the key in which he plays Howard that makes it stand out. You could make the argument that Howard is simply Sandler dialled up to 11, and you wouldn't be wrong, but the inherent tragedy of the man, his self-delusion, his seemingly unquenchable optimism and belief in himself – Sandler draws these elements out every second he's on-screen, finding pathos in virtually everything he does, in a performance that's both subtle and broad. I'm no Sandler apologist, but he really does have to be seen here to be believed. Elsewhere, Bogosian is his usual stoically intimidating self; first-time performers Williams Richards and Kominik are each as terrifying and authentic as the other; Menzel manages some of the most withering looks ever captured on film; and Fox, another impressive debutant, imbues what could have been a clichéd bimbo-type role with real emotional nuance.\r\n\r\nAs for problems, the pace of the film will certainly put some people off. There are no down-moments here, no scenes designed to let the audience breath. This is as anxiety-inducing a film as you're likely to see, and that simply won't be to everyone's taste. Partly because of this, the tone never really varies. There are some comic beats (Howard getting dumped naked into a car trunk during his daughter's school play is particularly funny), but by and large, the tone is perpetually dark, ominous, and exhausting. Which, again, won't be for everyone. And there will, of course, be people who just can't get past the presence of Adam Sandler, which I can understand. Personally though, I loved _Uncut Gems_. It's certainly not the subtlest of films, nor the most thematically complex, but as character studies go, this is exceptionally good work from everyone involved and a genuinely unique piece of cinema.", "created_at": "2020-01-25T02:09:49.416Z"}, {"movie_id": 473033, "review_id": "5e2f2c14ac8e6b0015bcdb9e", "author_rating": 8.0, "review_text": "“This is how *I* win.”\r\n\r\nOne of the most stressful movie experiences I’ve had in awhile.\r\n\r\nThis whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.\r\n\r\nWhile I like ‘Good Time’ a little more, but man what a rush.\r\n\r\nAdam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.\r\n\r\nBenny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.\r\n\r\nI loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.\r\n\r\nKevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.\r\n\r\nOverall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.\r\n\r\nI hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy.", "created_at": "2020-01-27T18:29:40.635Z"}, {"movie_id": 473033, "review_id": "5e53ba8fa76ac50013a6d8b8", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nThe Safdie brothers are known for their anxiety-inducing films, and Uncut Gems follows that tradition. It’s definitely a movie meant to be divisive. At several points during the film, all a viewer wants is to yell “shut up” to everyone on screen. The frenetic pacing, the overwhelming dialogue, and the loud score serve as both praise and criticism. \r\n\r\nAdam Sandler gives a career-best performance, but the narrative never quite grabbed me, being too repetitive and possessing a predictable yet impactful ending.\r\n\r\nRating: B", "created_at": "2020-02-24T11:59:11.706Z"}, {"movie_id": 473033, "review_id": "5e7d56b9eec4f34267aa04aa", "author_rating": 6.0, "review_text": "Brothers and co-directors Josh and Benny Safdie are two of the most exciting names working in modern independent cinema, so their film “Uncut Gems” debuted alongside a shadow of grandiose expectations. The bottom line is that the film is good but far from great, and I’m comfortable going out on a limb and guessing those crowing the loudest about how fresh and original this movie is haven’t seen their far superior 2017 film, “Good Time.”\r\n\r\nNew York City jeweler Howard Ratner (Adam Sandler) is always on the lookout for the next big score. When he makes a series of high stakes bets that could lead to the windfall of a lifetime, Howard finds himself struggling to keep the balance between the growing list of adversaries, his business, his scams, and his home life. There isn’t much to the story other than a lot of cursing and ongoing scams, but there’s a decent sense of suspense that carries through the majority of the film.\r\n\r\nThe most shocking thing about “Uncut Gems” is that it lacks depth, especially when compared to “Good Time.” It’s not unfair to compare the two films, as each portray a gritty side of the city with antiheros who are close to completely hitting the skids. An effective crime thriller should have a lead character you can at least root for if not relate to, and Howard isn’t it. Sandler’s character is an irritating scumbag and while I guess that’s what he was going for in his performance, it’s shrill and unpleasant to spend time around this loser. I didn’t really care to see the end of Howard’s story because by the time it rolled around, I was completely worn down by his repeated poor decisions.\r\n\r\nHere’s what happens in the film: Howard lies, gets cash, gambles it away, extends himself, gets a beating / stern warning / workplace visit from goons, then lies, gets cash, gambles it away, extends himself, and gets another beat down / visit from more goons. It’s an exhausting repetition of watching a sleazy scumbag spiraling out of control by digging himself deeper into a hole. His cycle of poor decisions is coupled with an indestructible optimism of a life-changing big score. Why should I care about somebody like that?\r\n\r\nSandler is good in the lead role, but much of the praise seems to be coming from the fact that, after a career in comedy films, his performance is unexpected. He’s a talented man, but he’s been even better in other, smaller films (like Noah Baumbach’s “The Meyerowitz Stories”). Howard is a loud, crude, unpleasant man to spend time with, but Sandler inhabits the role as a shady jewelry dealer and degenerate gambler in a way that lends the slightest glimmer of humanity to an otherwise detestable character.\r\n\r\nThe film plays like a hardcore, taxing Scorsese ripoff. It’s not very exciting, and the tension that does exist feels forced. The direction is more conventional than the material suggests, but major applause to the Safdie brothers for conveying their clear vision and having the courage to stick with it. They’ve started to corner the cinematic market on adapting the gritty side of New York for a modern era. I don’t feel the Safdies are as overrated as some other critics do, but I do think this film is bloated in all the wrong ways.", "created_at": "2020-03-27T01:28:25.793Z"}, {"movie_id": 473033, "review_id": "5e98978ff6596f0014cdd414", "author_rating": 7.0, "review_text": "Decent enough drama with Adam Sandler, though really found his character a bit too obnoxious to really care about though the ending was well done and surprisingly thrilling, but I have no problem with Sandler not getting a nod, I have seen him do better work (Punch Drunk Love for instance). Still, worth checking out even if it is a bit on the lengthier side for what it is. **3.5/5**", "created_at": "2020-04-16T17:36:15.394Z"}, {"movie_id": 473033, "review_id": "5ee64951cb71b8001cb6e5d8", "author_rating": 2.0, "review_text": "Sorry, I am sure this movie had it's share of good ratings, but for me the movie was confusing coupled with a barrage of unnecessary profanity. I have always been an Adam fan of Sandler, but I couldn't get past the confusion.", "created_at": "2020-06-14T15:59:13.193Z"}, {"movie_id": 473033, "review_id": "60458ce5efea7a002df505b8", "author_rating": 9.0, "review_text": "Quality!\r\n\r\n<em>'Uncut Gems'</em> is an absolutely thoroughly thrilling watch, the plot is so chaotic and high paced that it's practically impossible to not have a fun time with it. The cast do terrific work, typified by the tremendous Adam Sandler.\r\n\r\nSandler (Howard) is unquestionably the star of the film, he gets a lot of stick for a lot of the roles he usually plays but this is far from anything I've seen him portray. He still shows his funny side no doubt, but he adds much more to make it a memorable character - which is a rarity for him.\r\n\r\nLakeith Stanfield, Julia Fox, Kevin Garnett and Eric Bogosian are all good too. The score is pretty solid, also. There isn't much more to note really, it's a crime thriller and it absolutely nails that realm. Great film.", "created_at": "2021-03-08T02:33:09.307Z"}, {"movie_id": 473033, "review_id": "6397322b79b3d4007a2d7d16", "author_rating": 3.0, "review_text": "I never seen so much profanity in any movie. Whole movie was like \"f*ck, f*ck, F*ck\" or \"n**ga, n**ga, n**ga\"... What makes this movie worst besides profanity is that it's very chaotic. A lot of people talking the same time which creates chaos and you as a watcher get overwhelmed. Story was okay, nothing special. But again very overwhelming, chaotic and full of profanity. If director wanted to impress us with those things, well, I can tell him that he clearly failed. Everyone can curse, it doesn't need talent. Profanity and chaos doesn't make a good movie. Story does and good acting does, which felt lacking in this movie.", "created_at": "2022-12-12T13:52:43.581Z"}, {"movie_id": 473033, "review_id": "5dffaa3965686e00139609c5", "author_rating": 8.0, "review_text": "Adam Sandler's best performance? No. But it's indeed his best since Punch-Drunk Love, which continues to be the pinnacle of his talent.\r\n\r\nWhile the film isn't the best talking about technique, it seems to me that its style is totally focused on making the experience an exhausting one. And Uncut Gems is an overwhelming journey full of anxiety and stress. It achieved that splendidly.\r\nThat's its greatest accomplishment: To immerse you in the entire atmosphere of the environment that Sandler's character inhabits, while we witness the cascade of bad decisions he makes.\r\n\r\nPerhaps the biggest mistake is how the directors get to over-lengthen the story, which indirectly gets to a point where Sandler's character becomes obnoxious but I think that's part of the experience, because who ever in their right mind would feel more sympathy for a person like him? I mean more than the allowed sympathy anyways.\r\n\r\nIts ending, although predictable is certainly what he built and there's no learning in it and it doesn't need to be.\r\nAfter all the story was his decline while he believed that he was going to succeed. And yes for a moment he did and for a moment he savored it, but as happens many times in life, good things aren't made to last.\r\n\r\nAnother triumph for A24.\r\n\r\n9 likes", "created_at": "2019-12-22T17:39:05.199Z"}, {"movie_id": 473033, "review_id": "5e2ba36d688cd00015c80315", "author_rating": 8.0, "review_text": "**_Watching a guy screw up for two frantic hours may not sound very compelling, but this is a fine piece of work_**\r\n\r\n>_If you hold this_\r\n\r\n>_Dazzling emerald_\r\n\r\n>_Up to the sky,_\r\n\r\n>_It will shine a billion_\r\n\r\n>_Beautiful miracles_\r\n\r\n>_Painted_\r\n\r\n>_From the tears_\r\n\r\n>_Of the most High._\r\n\r\n>_Plucked_\r\n\r\n>_From the lush gardens_\r\n\r\n>_Of a yellowish-green_\r\n\r\n>_Paradise,_\r\n\r\n>_Look inside this hypnotic gem_\r\n\r\n>_And a kaleidoscope of_\r\n\r\n>_Titillating, soul-raising_\r\n\r\n>_Sights and colors_\r\n\r\n>_Will tease and seduce_\r\n\r\n>_Your eyes_\r\n\r\n>_And mind._\r\n\r\n- Suzy Kassem; \"A Jewelry Store Named India\" (2011)\r\n\r\nWritten by Ronald Bronstein, Josh Safdie, and Benny Safdie, and directed by the Safdies, _Uncut Gems_ is essentially two hours and fifteen minutes of watching a guy screw up in increasingly spectacular and catastrophic ways, make bad decision after bad decision, and give in to his addiction to gambling more and more. It's a film where you know from the first ten minutes that sooner or later, he won't be able to worm his way out of one of his mistakes, and at that point, his seemingly unshakable optimism and belief in his own delusions will prove ill-equipped to deal with the reckoning. So from the first act, you're on edge, and you remain there for the duration. It's a film that never stops moving at the chaotic breakneck speed with which it begins, a film possessed of energy nearly queasy in nature. So, two hours and fifteen minutes of rapidly-paced stress-inducing cinema about a deluded hustler screwing up? Sounds fun doesn't it? No, of course it doesn't. However, it has been made with such craft, the _mise en scène_ is so good, the dialogue so sharp, the acting so intense, that you may as well be watching a fly-on-the-wall documentary. It's a film made of pure sweat and anxiety, and it's about as stressful an experience as you can have at the movies. It's also superb, and I'd highly recommend it.\r\n\r\nThe film begins in 2010 in Welo Mine, Ethiopia, with the discovery of an ultra-rare black opal of extraordinary translucence. We then cut to New York in 2012, where Howard Ratner (Adam Sandler) is a charismatic jeweller who lives his life on the principle of robbing Peter to pay Paul. A serious gambling addict, he always has at least one hustle going, and he always owes somebody something. Soon after we meet him, it's revealed that he's currently in debt to his loan-shark brother-in-law Arno (the great Eric Bogosian) to the tune of $100,000, and Arno is having such a hard time with him, that he's had to hire two Boston thugs, Phil (Keith Williams Richards) and Nico (Tommy Kominik), to try to muscle Howard into paying the money back. Meanwhile, his jewellery business is doing well, not the least reason for which is his colleague Demany (Lakeith Stanfield), who helps bring in high-profile clients. The latest example of such is Boston Celtics' basketballer Kevin Garnett (a surprisingly strong performance by Garnett himself). As Garnett is browsing the store, it's revealed that Howard has smuggled the black opal into the country for an auction the following day, where he expects it will sell for up to $1 million. However, when Garnett sees the stone, he insists he is allowed to have it as a lucky charm, just for the match he's playing that night. Howard is reluctant but agrees to part with it when Garnett offers to leave his All-Star ring as collateral (which Howard immediately pawns for money to place a bet on Garnett's game). And, predictably, things quickly go awry.\r\n\r\nAnd all of this is to say nothing of his contemptuous wife Dinah (Idina Menzel), who has grown to loathe him over the years and considers their marriage a sham; his naïve but kindly colleague and mistress Julia (Julia Fox), with whom he shares an apartment; his father-in-law Gooey (Judd Hirsch), who always seems to see the best in him; and his children, Marcel (Noa Fisher), Eddie (Jonathan Aranbayev), and Beni (Jacob Igielski), none of whom have any illusions about who their father is.\r\n\r\nHoward is a delusional and doomed figure about whom there's a hint of Cosmo Vittelli (Ben Gazzara) – the gambling addict wannabe social climber who keeps slipping on the ladder's lowest rungs in John Cassavetes's _The Killing of a Chinese Bookie_ (1976). However, whereas Vittelli is driven to a point of despair by his own work ethic, Howard is very much the product of late capitalism; a man who genuinely believes, despite past experience to the contrary, that his big score is right around the next corner. In this respect, the film is a deconstruction of the concomitant globalised alienation; a system capable of drawing into a single self-delusional orbit such varied parties as exploited Ethiopian manual labourers, small business owners in New York, under-pressure athletes, loan-sharks, and bookies – all operating with the unshakable belief that a huge win is just within their grasp. Howard, of course, is the worst example, and is essentially a fantasist who's utterly divorced from reality, a man who believes completely that if people would get out of his way and let him turn that fabled corner, all of his worries will disappear. It's the gambling addict's fallacy – no matter how much or how often you lose, the next bet will be the big winner. The problem Howard faces is that he has made promises based on that fallacy – he owes money which he can only pay if his latest scheme works out _exactly_ as intended; such is the precarious house of cards that is his life.\r\n\r\nIn this sense, the film is an especially astute study of addiction, although this theme is never foregrounded – no one accuses Howard of being a gambling addict, and he certainly doesn't seem to think of himself as one. This is not a cautionary tale about the perils of addiction. Indeed it even goes so far as to play up (if not necessarily glamorise) the gambler's high – the precarious sense of everything being on the line, consequences be damned, the sense that if one thing goes wrong, everything collapses, but if everything goes right… However, if you're paying even the slightest bit of attention, you can't help but see just how hopelessly consumed Howard is by his addiction (never once does he give the impression that he wants to stop gambling). It has wormed its way into every facet of his life, to the point where it has become his life, or certainly a hugely important part of that life. This is why delusion is such a major component in his psychological make-up – addiction and delusion form an ever-tightening feedback loop that becomes more difficult from which to escape, the more self-sustaining they become.\r\n\r\nIn terms of aesthetics, it's worth noting that two of the three writers (Bronstein and Benny Safdie) are also credited as the editors, and this is crucial insofar as the frenetic pace of the narrative isn't achieved only by the cutting, but by the script as well – this is a film written by people with at least one eye on the editing rhythms. The first scenes in New York, for example, immediately establish the chaotic energy – Howard speaking rapidly into his mobile, dialogue overlapping almost unintelligibly as multiple characters interact and talk over one another, at least three things always happening, each one of which would occupy our complete attention in a more conventional film. Here, it's almost like everything is a background to everything else, with nothing ever given a sustained sole focus. The opening scenes establish the pace as blistering, and that never really changes. It's the kind of film where there's perpetual propulsive momentum – because the characters never stop moving, neither does the story, even if the characters never actually manage to get anywhere. The score, by Oneohtrix Point Never, is also excellent. Obviously inspired by Tangerine Dream's electronic scores for Michael Mann's early films, most notably _Thief_ (1981), it's an unexpectedly crucial element of the film, adding to the overlapping cacophony of sounds and enhancing the general sense of twitchy chaos.\r\n\r\nAs for the acting, everything you've heard about Sandler is true; he's incredible. The Safdies originally pitched him the script in 2009, but he turned it down and the project went nowhere. In 2017, after the success of _Good Time_, they resurrected the film and cast Jonah Hill as Howard, but when he dropped out, they offered it to Sandler again. And he totally and completely inhabits Howard, to the extent where it no longer even seems like acting. And sure, he's playing the same kind of volatile delusional loser that he's played in a million-and-one subpar comedies. But it's the tone of the performance, the key in which he plays Howard that makes it stand out. You could make the argument that Howard is simply Sandler dialled up to 11, and you wouldn't be wrong, but the inherent tragedy of the man, his self-delusion, his seemingly unquenchable optimism and belief in himself – Sandler draws these elements out every second he's on-screen, finding pathos in virtually everything he does, in a performance that's both subtle and broad. I'm no Sandler apologist, but he really does have to be seen here to be believed. Elsewhere, Bogosian is his usual stoically intimidating self; first-time performers Williams Richards and Kominik are each as terrifying and authentic as the other; Menzel manages some of the most withering looks ever captured on film; and Fox, another impressive debutant, imbues what could have been a clichéd bimbo-type role with real emotional nuance.\r\n\r\nAs for problems, the pace of the film will certainly put some people off. There are no down-moments here, no scenes designed to let the audience breath. This is as anxiety-inducing a film as you're likely to see, and that simply won't be to everyone's taste. Partly because of this, the tone never really varies. There are some comic beats (Howard getting dumped naked into a car trunk during his daughter's school play is particularly funny), but by and large, the tone is perpetually dark, ominous, and exhausting. Which, again, won't be for everyone. And there will, of course, be people who just can't get past the presence of Adam Sandler, which I can understand. Personally though, I loved _Uncut Gems_. It's certainly not the subtlest of films, nor the most thematically complex, but as character studies go, this is exceptionally good work from everyone involved and a genuinely unique piece of cinema.", "created_at": "2020-01-25T02:09:49.416Z"}, {"movie_id": 473033, "review_id": "5e2f2c14ac8e6b0015bcdb9e", "author_rating": 8.0, "review_text": "“This is how *I* win.”\r\n\r\nOne of the most stressful movie experiences I’ve had in awhile.\r\n\r\nThis whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.\r\n\r\nWhile I like ‘Good Time’ a little more, but man what a rush.\r\n\r\nAdam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.\r\n\r\nBenny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.\r\n\r\nI loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.\r\n\r\nKevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.\r\n\r\nOverall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.\r\n\r\nI hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy.", "created_at": "2020-01-27T18:29:40.635Z"}, {"movie_id": 473033, "review_id": "5e53ba8fa76ac50013a6d8b8", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nThe Safdie brothers are known for their anxiety-inducing films, and Uncut Gems follows that tradition. It’s definitely a movie meant to be divisive. At several points during the film, all a viewer wants is to yell “shut up” to everyone on screen. The frenetic pacing, the overwhelming dialogue, and the loud score serve as both praise and criticism. \r\n\r\nAdam Sandler gives a career-best performance, but the narrative never quite grabbed me, being too repetitive and possessing a predictable yet impactful ending.\r\n\r\nRating: B", "created_at": "2020-02-24T11:59:11.706Z"}, {"movie_id": 473033, "review_id": "5e7d56b9eec4f34267aa04aa", "author_rating": 6.0, "review_text": "Brothers and co-directors Josh and Benny Safdie are two of the most exciting names working in modern independent cinema, so their film “Uncut Gems” debuted alongside a shadow of grandiose expectations. The bottom line is that the film is good but far from great, and I’m comfortable going out on a limb and guessing those crowing the loudest about how fresh and original this movie is haven’t seen their far superior 2017 film, “Good Time.”\r\n\r\nNew York City jeweler Howard Ratner (Adam Sandler) is always on the lookout for the next big score. When he makes a series of high stakes bets that could lead to the windfall of a lifetime, Howard finds himself struggling to keep the balance between the growing list of adversaries, his business, his scams, and his home life. There isn’t much to the story other than a lot of cursing and ongoing scams, but there’s a decent sense of suspense that carries through the majority of the film.\r\n\r\nThe most shocking thing about “Uncut Gems” is that it lacks depth, especially when compared to “Good Time.” It’s not unfair to compare the two films, as each portray a gritty side of the city with antiheros who are close to completely hitting the skids. An effective crime thriller should have a lead character you can at least root for if not relate to, and Howard isn’t it. Sandler’s character is an irritating scumbag and while I guess that’s what he was going for in his performance, it’s shrill and unpleasant to spend time around this loser. I didn’t really care to see the end of Howard’s story because by the time it rolled around, I was completely worn down by his repeated poor decisions.\r\n\r\nHere’s what happens in the film: Howard lies, gets cash, gambles it away, extends himself, gets a beating / stern warning / workplace visit from goons, then lies, gets cash, gambles it away, extends himself, and gets another beat down / visit from more goons. It’s an exhausting repetition of watching a sleazy scumbag spiraling out of control by digging himself deeper into a hole. His cycle of poor decisions is coupled with an indestructible optimism of a life-changing big score. Why should I care about somebody like that?\r\n\r\nSandler is good in the lead role, but much of the praise seems to be coming from the fact that, after a career in comedy films, his performance is unexpected. He’s a talented man, but he’s been even better in other, smaller films (like Noah Baumbach’s “The Meyerowitz Stories”). Howard is a loud, crude, unpleasant man to spend time with, but Sandler inhabits the role as a shady jewelry dealer and degenerate gambler in a way that lends the slightest glimmer of humanity to an otherwise detestable character.\r\n\r\nThe film plays like a hardcore, taxing Scorsese ripoff. It’s not very exciting, and the tension that does exist feels forced. The direction is more conventional than the material suggests, but major applause to the Safdie brothers for conveying their clear vision and having the courage to stick with it. They’ve started to corner the cinematic market on adapting the gritty side of New York for a modern era. I don’t feel the Safdies are as overrated as some other critics do, but I do think this film is bloated in all the wrong ways.", "created_at": "2020-03-27T01:28:25.793Z"}, {"movie_id": 473033, "review_id": "5e98978ff6596f0014cdd414", "author_rating": 7.0, "review_text": "Decent enough drama with Adam Sandler, though really found his character a bit too obnoxious to really care about though the ending was well done and surprisingly thrilling, but I have no problem with Sandler not getting a nod, I have seen him do better work (Punch Drunk Love for instance). Still, worth checking out even if it is a bit on the lengthier side for what it is. **3.5/5**", "created_at": "2020-04-16T17:36:15.394Z"}, {"movie_id": 473033, "review_id": "5ee64951cb71b8001cb6e5d8", "author_rating": 2.0, "review_text": "Sorry, I am sure this movie had it's share of good ratings, but for me the movie was confusing coupled with a barrage of unnecessary profanity. I have always been an Adam fan of Sandler, but I couldn't get past the confusion.", "created_at": "2020-06-14T15:59:13.193Z"}, {"movie_id": 473033, "review_id": "60458ce5efea7a002df505b8", "author_rating": 9.0, "review_text": "Quality!\r\n\r\n<em>'Uncut Gems'</em> is an absolutely thoroughly thrilling watch, the plot is so chaotic and high paced that it's practically impossible to not have a fun time with it. The cast do terrific work, typified by the tremendous Adam Sandler.\r\n\r\nSandler (Howard) is unquestionably the star of the film, he gets a lot of stick for a lot of the roles he usually plays but this is far from anything I've seen him portray. He still shows his funny side no doubt, but he adds much more to make it a memorable character - which is a rarity for him.\r\n\r\nLakeith Stanfield, Julia Fox, Kevin Garnett and Eric Bogosian are all good too. The score is pretty solid, also. There isn't much more to note really, it's a crime thriller and it absolutely nails that realm. Great film.", "created_at": "2021-03-08T02:33:09.307Z"}, {"movie_id": 473033, "review_id": "6397322b79b3d4007a2d7d16", "author_rating": 3.0, "review_text": "I never seen so much profanity in any movie. Whole movie was like \"f*ck, f*ck, F*ck\" or \"n**ga, n**ga, n**ga\"... What makes this movie worst besides profanity is that it's very chaotic. A lot of people talking the same time which creates chaos and you as a watcher get overwhelmed. Story was okay, nothing special. But again very overwhelming, chaotic and full of profanity. If director wanted to impress us with those things, well, I can tell him that he clearly failed. Everyone can curse, it doesn't need talent. Profanity and chaos doesn't make a good movie. Story does and good acting does, which felt lacking in this movie.", "created_at": "2022-12-12T13:52:43.581Z"}]