[{"movie_id": 194662, "review_id": "54d1f859c3a3687351001f2a", "author_rating": null, "review_text": "**mounting spontaneity** or (dumb luck)\r\n\r\nIt's not fair.\r\n\r\nI love Raymond Carver, long takes, theatre, Batman, NYC rooftops and alleyways, the blending layers of self-referential fiction, delirious fantasy, the creative process, the insane logistics of run-on cinematography, the seamless assembly of shifting environments, stepping into unresolved mental spaces, demonstrations of solitary madness and the unbearable anticipation of being, being judged, being booed, un-being, unhinging, delusional uppers, existential downers, magic surrealism, telekinetic fury, dreams of flying, throwing tantrums, the fragile yet invincible ego, immaculately constructed chaos, the recurring climax of ending it all -- where the blazes is that blasted improvisational drumming coming from? -- oh there, and there, so absurd, don't stop, the shot must go on, the show must go on, \"You are not important, get used to it,\" she said, but so much angst overwhelms him, tethered to a feathered fantasy, a nagging reminder of what once was, or could have been, refusing to believe it's too late to soar to former heights, yet grounded by time and gravity, trapped in a narrative, caged in a fabrication, \"You're an actress, honey,\" says another, \"you have no self-respect\" and all actors are game, Keaton and Stone zoned-in, knowing the pain, pretending to not care or pretending to matter, failing to be authentic, acting over acting, meta-acting meta-fiction meta-filmed with a meta-critical message: yeah, we're all messed-up and meta-fµcked, but after shooting your nose to spite the ruse, by unmasking the unexpected virtue of ignorance, peeling off layers of pretense and self-importance, you just might find a momentary strain of pure, uncomplicated innocence.\r\n\r\nIt's not fair. I love this sh*t!", "created_at": "2015-02-04T10:45:45.313Z"}, {"movie_id": 194662, "review_id": "5758fb4f92514109060014b3", "author_rating": 1.0, "review_text": "First of all, let me say, I like most of movies where Naomi Watts plays & thought this one would be good too, after all it has high ratings, but don't be fooled by famous actors which play in this movie. Don't be fooled & think that movie is good. No, not at all. This movie is complete junk. It supposed to be a comedy, but I didn't even find it funny. It's just like a big mess. I started watching it & I couldn't last longer than 30 minutes, it was so boring & uninteresting that I fell asleep. I can't believe people rate this movie so high & even worse - this movie won an Oscar. This again proves, that ratings & Oscar ain't always accurate.", "created_at": "2016-06-09T05:14:55.632Z"}, {"movie_id": 194662, "review_id": "58c14e9ec3a3687da8004a11", "author_rating": 9.0, "review_text": "This film tells the story of an over-the-hill actor called Riggan Thomson (brilliantly portrayed by Michael Keaton) who was once the star of a superhero blockbuster franchise known as 'Birdman'. We are shown his journey into making a Broadway production starting with the initial rehearsals and read-throughs. What follows is a brilliant exploration of celebrity culture in an intriguing and satirical way.\r\n\r\n'Birdman' could essentially be looked at as one continuous long shot. The camera constantly weaves around the actors and action and so the audience are completely immersed into the perspectives of the various characters (mostly Riggan's). The opening shot plays like a scene in Paul Thomas Anderson's 'Boogie Nights' as it delightfully establishes the narrative in a fluid and polished style whilst introducing the cast and their entertaining interchanges during a rehearsal with hilarious consequences. \r\n\r\nThe editing throughout the picture is almost flawless when moving from scene to scene and has a dizzying effect much like Gasper Noé's 'Irreversible'. 'Birdman' also boasts some marvellous special effects throughout such as when Riggan (Keaton) is alone and being taunted by his egotistical alter-ego. The film shows up typical blockbuster action movies by asking the audience what they want and giving it to them in a manner which embraces the excitement and epic-ness of the genre whilst also poking fun of the conventions.\r\n\r\nThe music that accompanies the film is very scarce in a lot of places adding emphasis to the dialogue and situations arising but, in some cases, an erratic and improvisational drum riff can be heard (occasionally accompanied with the drummer on the set) which completely adds to the eccentricity and spontaneity of the movie.\r\n\r\nThe screenplay is very intricately written and contains many profound philosophical speeches about art, celebrity and criticism. There are monologues and debates by characters in which they discuss the core beliefs of the film such as Riggan's speech during his performance of his Raymond Carver play \"What We Talk About When We Talk About Love\".\r\n\r\nThe whole narrative of the film is very intriguing and interesting. There is a perfect blend of comedy and poignancy. There are a lot of twists and ambiguity throughout the film which could be analysed and interpreted for a long time.\r\n\r\nMichael Keaton is fantastic as the protagonist and gives a performance that would have given his career a huge revival (his squeal is my highlight of the film). The parallels with the character's career and that of Keaton's could not have been a mistake and gives the performance that much more edge. Edward Norton plays the method actor from hell (Mike Shiner). He is annoying, snobbish and smug and played brilliantly by Norton who excels in the vileness and pomposity of the character.\r\n\r\nThe film is very much about actors. The self obsessive nature of acting is definitely highlighted by the two central performances but there is also a cast that really help to deliver the film's meaning such as Emma Stone, Zach Galifianakis, Andrea Riseborough and Naomi Watts.\r\n\r\nOverall, 'Birdman' is a fantastic film. It is filled with pathos and profound imagery whilst keeping the viewer thoroughly entertained throughout.\r\n\r\n★★★★½", "created_at": "2017-03-09T12:46:22.310Z"}, {"movie_id": 194662, "review_id": "5e2f2b4bac8e6b0015bcdb0b", "author_rating": 10.0, "review_text": "\"I'm nothing. I'm not even here.\"\r\n\r\nThe story to Birdman is about an wash up actor (Michael Keaton) - famous for portraying an iconic superhero - as he struggles to mount a Broadway play. In the days leading up to opening night, he battles his ego and attempts to recover his family, his career, and himself.\r\n\r\nOkay in my review of Whiplash I bought this movie up mid way through the review just to give a heads up of when I'm going to watch it, because Birdman was my most anticipated film of 2014. But just like every time I really wanted to see a film so baldy I have to wait for a while until I finally get a chance to watch it, story of my life really. But anywhere, I was really looking forward to this movie ever since September, and now finally seeing the film I can safely say that Birdman is one of the best movie of 2014.\r\n\r\nI always know that Micheal Keaton was the kind of movie star that will pick any random movie role just because... well he what's to be important and still show to everyone that he still got it, I guess. Early last year he was in two movies that were pretty blah, and that was The Robocop (remake) and Need for Speed, and those films just made Keaton look like he was just cashing it in just for the sake of it. Until I watched this movie and seeing Micheal Keaton's performance and thinking to myself \"Wait is Keaton giving probably his best performance I've ever seen in my life? I think he is\", because Keaton in this movie pretty much pulls of the best performance I've seen him in his all career. His character in this movie is like a washed up actor who had everything like: the love from the critics and he's fans. Yeah he still dose have that Keaton thing that he always dose in his previous movies, but the scenes where he plays his character (Which is himself if you really look at his character in this movie) but anywhere he still gives a strong and believable performance that at times give me flashbacks of the good old days when he still had roots and felt like he isn't just cashing it in. I hear a lot of Oscar buzz about his performance in this movie, and I wouldn't be surprise if he wins because he totally deserves it. Excellent work Keaton.\r\n\r\nEdward Norton is also in this movie and played a familiar character to himself has the hard to work with actor that at times doesn't follow the lines that he was given or even the direction he was told. We already know that Norton is a fantastic actor in his previous work, but in this movie his performance could be descried has stellar and insanely good.\r\n\r\nEmma Stone is this movie and of course like most of the actors I named off so far who were outstanding in this movie and well you can already guess what I'm going to say next. Emma Stone acting in this movie was just terrific and marvellous to watch. It's good to see a real break out performance from her more than the lay back ones in her other movies. Nice one Emma. The other cast in the movie like Naomi Watts, Zach Galifianakis both did good as well.\r\n\r\nThe whole movie is shot to look like it's all in one shot and my mind was just blown away by that fact. There were scenes in way I said to myself \"Oh my god is it one shot?\", well I can already imagine the stress, hard work and how many takes they had to do to get it, and boy did it pay off nicely, because I couldn't take my eyes off the screen. I dared myself to look away from the beautiful cinematography and the impressive editing used in the film.\r\n\r\nThe movie has a brilliant message about film critics today that doesn't feel like it's in your face message that you normally get in movies. There's a scene in this movie and by the way it's not a spoiler, but I really need to get this out the way first. Micheal Keaton character starts having a rant over this theater critic who is going to give a bad review to he's play when she hasn't even seen it or any of the premieres. He talks about how she only users big words that nobody will say in person and shes to lazy to come up what she really thinks about it so she users big words just to fill in the sentence. This movie probably has the best rant in movie history and Keaton in that scene shows how good of a actor that he is.\r\n\r\nFor problems in the movie: I really don't have any to be honest.\r\n\r\nI loved this movie and yes I'm coming out be saying that. This isn't just the best movie of the year and such, no this is just flawless film making right here. Birdman and Whiplash are the two films I will highly recommend to people, because those two films are my favorite films of 2014.", "created_at": "2020-01-27T18:26:19.168Z"}, {"movie_id": 194662, "review_id": "5fd9611b1d3143003dbcdd55", "author_rating": 6.0, "review_text": "I was drawn to watch this film for a couple of reasons. One, basically, was Michael Keaton. Overall I find movies are worth a look when he is in it. Also there is the play within a play, the stage production his character  is doing, based on an actual short story by Raymond a carver. When I first started writing short stories and novels decades ago, I was influenced by Carver’s spare writing style and his realistic dialogue. I guess this particular short story has been used in a few short films also.\r\n\r\nI don’t believe this movie is in any way considered an Independent Film, but it has that feel to me, the way it clings to gritty realism and comic book fantasy all at once, the philosophical musings of most of the characters, the total lack of a defined ending, all speak to me of an independent film.\r\n\r\nI didn’t come away from watching it thinking it was a great movie, merely interesting in places and well acted. Unfortunately, I disliked most of the characters, with a few exceptions such as the discarded ex-wife/girlfriend or whatever she was. However skilled the production standards and acting might be, this movie proved to me that empathy for the characters and the quality of the writing still counts for a lot. And as a writer (of lower quality admittedly) I was relieved to realize it.", "created_at": "2020-12-16T01:21:31.220Z"}, {"movie_id": 194662, "review_id": "54d1f859c3a3687351001f2a", "author_rating": null, "review_text": "**mounting spontaneity** or (dumb luck)\r\n\r\nIt's not fair.\r\n\r\nI love Raymond Carver, long takes, theatre, Batman, NYC rooftops and alleyways, the blending layers of self-referential fiction, delirious fantasy, the creative process, the insane logistics of run-on cinematography, the seamless assembly of shifting environments, stepping into unresolved mental spaces, demonstrations of solitary madness and the unbearable anticipation of being, being judged, being booed, un-being, unhinging, delusional uppers, existential downers, magic surrealism, telekinetic fury, dreams of flying, throwing tantrums, the fragile yet invincible ego, immaculately constructed chaos, the recurring climax of ending it all -- where the blazes is that blasted improvisational drumming coming from? -- oh there, and there, so absurd, don't stop, the shot must go on, the show must go on, \"You are not important, get used to it,\" she said, but so much angst overwhelms him, tethered to a feathered fantasy, a nagging reminder of what once was, or could have been, refusing to believe it's too late to soar to former heights, yet grounded by time and gravity, trapped in a narrative, caged in a fabrication, \"You're an actress, honey,\" says another, \"you have no self-respect\" and all actors are game, Keaton and Stone zoned-in, knowing the pain, pretending to not care or pretending to matter, failing to be authentic, acting over acting, meta-acting meta-fiction meta-filmed with a meta-critical message: yeah, we're all messed-up and meta-fµcked, but after shooting your nose to spite the ruse, by unmasking the unexpected virtue of ignorance, peeling off layers of pretense and self-importance, you just might find a momentary strain of pure, uncomplicated innocence.\r\n\r\nIt's not fair. I love this sh*t!", "created_at": "2015-02-04T10:45:45.313Z"}, {"movie_id": 194662, "review_id": "5758fb4f92514109060014b3", "author_rating": 1.0, "review_text": "First of all, let me say, I like most of movies where Naomi Watts plays & thought this one would be good too, after all it has high ratings, but don't be fooled by famous actors which play in this movie. Don't be fooled & think that movie is good. No, not at all. This movie is complete junk. It supposed to be a comedy, but I didn't even find it funny. It's just like a big mess. I started watching it & I couldn't last longer than 30 minutes, it was so boring & uninteresting that I fell asleep. I can't believe people rate this movie so high & even worse - this movie won an Oscar. This again proves, that ratings & Oscar ain't always accurate.", "created_at": "2016-06-09T05:14:55.632Z"}, {"movie_id": 194662, "review_id": "58c14e9ec3a3687da8004a11", "author_rating": 9.0, "review_text": "This film tells the story of an over-the-hill actor called Riggan Thomson (brilliantly portrayed by Michael Keaton) who was once the star of a superhero blockbuster franchise known as 'Birdman'. We are shown his journey into making a Broadway production starting with the initial rehearsals and read-throughs. What follows is a brilliant exploration of celebrity culture in an intriguing and satirical way.\r\n\r\n'Birdman' could essentially be looked at as one continuous long shot. The camera constantly weaves around the actors and action and so the audience are completely immersed into the perspectives of the various characters (mostly Riggan's). The opening shot plays like a scene in Paul Thomas Anderson's 'Boogie Nights' as it delightfully establishes the narrative in a fluid and polished style whilst introducing the cast and their entertaining interchanges during a rehearsal with hilarious consequences. \r\n\r\nThe editing throughout the picture is almost flawless when moving from scene to scene and has a dizzying effect much like Gasper Noé's 'Irreversible'. 'Birdman' also boasts some marvellous special effects throughout such as when Riggan (Keaton) is alone and being taunted by his egotistical alter-ego. The film shows up typical blockbuster action movies by asking the audience what they want and giving it to them in a manner which embraces the excitement and epic-ness of the genre whilst also poking fun of the conventions.\r\n\r\nThe music that accompanies the film is very scarce in a lot of places adding emphasis to the dialogue and situations arising but, in some cases, an erratic and improvisational drum riff can be heard (occasionally accompanied with the drummer on the set) which completely adds to the eccentricity and spontaneity of the movie.\r\n\r\nThe screenplay is very intricately written and contains many profound philosophical speeches about art, celebrity and criticism. There are monologues and debates by characters in which they discuss the core beliefs of the film such as Riggan's speech during his performance of his Raymond Carver play \"What We Talk About When We Talk About Love\".\r\n\r\nThe whole narrative of the film is very intriguing and interesting. There is a perfect blend of comedy and poignancy. There are a lot of twists and ambiguity throughout the film which could be analysed and interpreted for a long time.\r\n\r\nMichael Keaton is fantastic as the protagonist and gives a performance that would have given his career a huge revival (his squeal is my highlight of the film). The parallels with the character's career and that of Keaton's could not have been a mistake and gives the performance that much more edge. Edward Norton plays the method actor from hell (Mike Shiner). He is annoying, snobbish and smug and played brilliantly by Norton who excels in the vileness and pomposity of the character.\r\n\r\nThe film is very much about actors. The self obsessive nature of acting is definitely highlighted by the two central performances but there is also a cast that really help to deliver the film's meaning such as Emma Stone, Zach Galifianakis, Andrea Riseborough and Naomi Watts.\r\n\r\nOverall, 'Birdman' is a fantastic film. It is filled with pathos and profound imagery whilst keeping the viewer thoroughly entertained throughout.\r\n\r\n★★★★½", "created_at": "2017-03-09T12:46:22.310Z"}, {"movie_id": 194662, "review_id": "5e2f2b4bac8e6b0015bcdb0b", "author_rating": 10.0, "review_text": "\"I'm nothing. I'm not even here.\"\r\n\r\nThe story to Birdman is about an wash up actor (Michael Keaton) - famous for portraying an iconic superhero - as he struggles to mount a Broadway play. In the days leading up to opening night, he battles his ego and attempts to recover his family, his career, and himself.\r\n\r\nOkay in my review of Whiplash I bought this movie up mid way through the review just to give a heads up of when I'm going to watch it, because Birdman was my most anticipated film of 2014. But just like every time I really wanted to see a film so baldy I have to wait for a while until I finally get a chance to watch it, story of my life really. But anywhere, I was really looking forward to this movie ever since September, and now finally seeing the film I can safely say that Birdman is one of the best movie of 2014.\r\n\r\nI always know that Micheal Keaton was the kind of movie star that will pick any random movie role just because... well he what's to be important and still show to everyone that he still got it, I guess. Early last year he was in two movies that were pretty blah, and that was The Robocop (remake) and Need for Speed, and those films just made Keaton look like he was just cashing it in just for the sake of it. Until I watched this movie and seeing Micheal Keaton's performance and thinking to myself \"Wait is Keaton giving probably his best performance I've ever seen in my life? I think he is\", because Keaton in this movie pretty much pulls of the best performance I've seen him in his all career. His character in this movie is like a washed up actor who had everything like: the love from the critics and he's fans. Yeah he still dose have that Keaton thing that he always dose in his previous movies, but the scenes where he plays his character (Which is himself if you really look at his character in this movie) but anywhere he still gives a strong and believable performance that at times give me flashbacks of the good old days when he still had roots and felt like he isn't just cashing it in. I hear a lot of Oscar buzz about his performance in this movie, and I wouldn't be surprise if he wins because he totally deserves it. Excellent work Keaton.\r\n\r\nEdward Norton is also in this movie and played a familiar character to himself has the hard to work with actor that at times doesn't follow the lines that he was given or even the direction he was told. We already know that Norton is a fantastic actor in his previous work, but in this movie his performance could be descried has stellar and insanely good.\r\n\r\nEmma Stone is this movie and of course like most of the actors I named off so far who were outstanding in this movie and well you can already guess what I'm going to say next. Emma Stone acting in this movie was just terrific and marvellous to watch. It's good to see a real break out performance from her more than the lay back ones in her other movies. Nice one Emma. The other cast in the movie like Naomi Watts, Zach Galifianakis both did good as well.\r\n\r\nThe whole movie is shot to look like it's all in one shot and my mind was just blown away by that fact. There were scenes in way I said to myself \"Oh my god is it one shot?\", well I can already imagine the stress, hard work and how many takes they had to do to get it, and boy did it pay off nicely, because I couldn't take my eyes off the screen. I dared myself to look away from the beautiful cinematography and the impressive editing used in the film.\r\n\r\nThe movie has a brilliant message about film critics today that doesn't feel like it's in your face message that you normally get in movies. There's a scene in this movie and by the way it's not a spoiler, but I really need to get this out the way first. Micheal Keaton character starts having a rant over this theater critic who is going to give a bad review to he's play when she hasn't even seen it or any of the premieres. He talks about how she only users big words that nobody will say in person and shes to lazy to come up what she really thinks about it so she users big words just to fill in the sentence. This movie probably has the best rant in movie history and Keaton in that scene shows how good of a actor that he is.\r\n\r\nFor problems in the movie: I really don't have any to be honest.\r\n\r\nI loved this movie and yes I'm coming out be saying that. This isn't just the best movie of the year and such, no this is just flawless film making right here. Birdman and Whiplash are the two films I will highly recommend to people, because those two films are my favorite films of 2014.", "created_at": "2020-01-27T18:26:19.168Z"}, {"movie_id": 194662, "review_id": "5fd9611b1d3143003dbcdd55", "author_rating": 6.0, "review_text": "I was drawn to watch this film for a couple of reasons. One, basically, was Michael Keaton. Overall I find movies are worth a look when he is in it. Also there is the play within a play, the stage production his character  is doing, based on an actual short story by Raymond a carver. When I first started writing short stories and novels decades ago, I was influenced by Carver’s spare writing style and his realistic dialogue. I guess this particular short story has been used in a few short films also.\r\n\r\nI don’t believe this movie is in any way considered an Independent Film, but it has that feel to me, the way it clings to gritty realism and comic book fantasy all at once, the philosophical musings of most of the characters, the total lack of a defined ending, all speak to me of an independent film.\r\n\r\nI didn’t come away from watching it thinking it was a great movie, merely interesting in places and well acted. Unfortunately, I disliked most of the characters, with a few exceptions such as the discarded ex-wife/girlfriend or whatever she was. However skilled the production standards and acting might be, this movie proved to me that empathy for the characters and the quality of the writing still counts for a lot. And as a writer (of lower quality admittedly) I was relieved to realize it.", "created_at": "2020-12-16T01:21:31.220Z"}, {"movie_id": 194662, "review_id": "54d1f859c3a3687351001f2a", "author_rating": null, "review_text": "**mounting spontaneity** or (dumb luck)\r\n\r\nIt's not fair.\r\n\r\nI love Raymond Carver, long takes, theatre, Batman, NYC rooftops and alleyways, the blending layers of self-referential fiction, delirious fantasy, the creative process, the insane logistics of run-on cinematography, the seamless assembly of shifting environments, stepping into unresolved mental spaces, demonstrations of solitary madness and the unbearable anticipation of being, being judged, being booed, un-being, unhinging, delusional uppers, existential downers, magic surrealism, telekinetic fury, dreams of flying, throwing tantrums, the fragile yet invincible ego, immaculately constructed chaos, the recurring climax of ending it all -- where the blazes is that blasted improvisational drumming coming from? -- oh there, and there, so absurd, don't stop, the shot must go on, the show must go on, \"You are not important, get used to it,\" she said, but so much angst overwhelms him, tethered to a feathered fantasy, a nagging reminder of what once was, or could have been, refusing to believe it's too late to soar to former heights, yet grounded by time and gravity, trapped in a narrative, caged in a fabrication, \"You're an actress, honey,\" says another, \"you have no self-respect\" and all actors are game, Keaton and Stone zoned-in, knowing the pain, pretending to not care or pretending to matter, failing to be authentic, acting over acting, meta-acting meta-fiction meta-filmed with a meta-critical message: yeah, we're all messed-up and meta-fµcked, but after shooting your nose to spite the ruse, by unmasking the unexpected virtue of ignorance, peeling off layers of pretense and self-importance, you just might find a momentary strain of pure, uncomplicated innocence.\r\n\r\nIt's not fair. I love this sh*t!", "created_at": "2015-02-04T10:45:45.313Z"}, {"movie_id": 194662, "review_id": "5758fb4f92514109060014b3", "author_rating": 1.0, "review_text": "First of all, let me say, I like most of movies where Naomi Watts plays & thought this one would be good too, after all it has high ratings, but don't be fooled by famous actors which play in this movie. Don't be fooled & think that movie is good. No, not at all. This movie is complete junk. It supposed to be a comedy, but I didn't even find it funny. It's just like a big mess. I started watching it & I couldn't last longer than 30 minutes, it was so boring & uninteresting that I fell asleep. I can't believe people rate this movie so high & even worse - this movie won an Oscar. This again proves, that ratings & Oscar ain't always accurate.", "created_at": "2016-06-09T05:14:55.632Z"}, {"movie_id": 194662, "review_id": "58c14e9ec3a3687da8004a11", "author_rating": 9.0, "review_text": "This film tells the story of an over-the-hill actor called Riggan Thomson (brilliantly portrayed by Michael Keaton) who was once the star of a superhero blockbuster franchise known as 'Birdman'. We are shown his journey into making a Broadway production starting with the initial rehearsals and read-throughs. What follows is a brilliant exploration of celebrity culture in an intriguing and satirical way.\r\n\r\n'Birdman' could essentially be looked at as one continuous long shot. The camera constantly weaves around the actors and action and so the audience are completely immersed into the perspectives of the various characters (mostly Riggan's). The opening shot plays like a scene in Paul Thomas Anderson's 'Boogie Nights' as it delightfully establishes the narrative in a fluid and polished style whilst introducing the cast and their entertaining interchanges during a rehearsal with hilarious consequences. \r\n\r\nThe editing throughout the picture is almost flawless when moving from scene to scene and has a dizzying effect much like Gasper Noé's 'Irreversible'. 'Birdman' also boasts some marvellous special effects throughout such as when Riggan (Keaton) is alone and being taunted by his egotistical alter-ego. The film shows up typical blockbuster action movies by asking the audience what they want and giving it to them in a manner which embraces the excitement and epic-ness of the genre whilst also poking fun of the conventions.\r\n\r\nThe music that accompanies the film is very scarce in a lot of places adding emphasis to the dialogue and situations arising but, in some cases, an erratic and improvisational drum riff can be heard (occasionally accompanied with the drummer on the set) which completely adds to the eccentricity and spontaneity of the movie.\r\n\r\nThe screenplay is very intricately written and contains many profound philosophical speeches about art, celebrity and criticism. There are monologues and debates by characters in which they discuss the core beliefs of the film such as Riggan's speech during his performance of his Raymond Carver play \"What We Talk About When We Talk About Love\".\r\n\r\nThe whole narrative of the film is very intriguing and interesting. There is a perfect blend of comedy and poignancy. There are a lot of twists and ambiguity throughout the film which could be analysed and interpreted for a long time.\r\n\r\nMichael Keaton is fantastic as the protagonist and gives a performance that would have given his career a huge revival (his squeal is my highlight of the film). The parallels with the character's career and that of Keaton's could not have been a mistake and gives the performance that much more edge. Edward Norton plays the method actor from hell (Mike Shiner). He is annoying, snobbish and smug and played brilliantly by Norton who excels in the vileness and pomposity of the character.\r\n\r\nThe film is very much about actors. The self obsessive nature of acting is definitely highlighted by the two central performances but there is also a cast that really help to deliver the film's meaning such as Emma Stone, Zach Galifianakis, Andrea Riseborough and Naomi Watts.\r\n\r\nOverall, 'Birdman' is a fantastic film. It is filled with pathos and profound imagery whilst keeping the viewer thoroughly entertained throughout.\r\n\r\n★★★★½", "created_at": "2017-03-09T12:46:22.310Z"}, {"movie_id": 194662, "review_id": "5e2f2b4bac8e6b0015bcdb0b", "author_rating": 10.0, "review_text": "\"I'm nothing. I'm not even here.\"\r\n\r\nThe story to Birdman is about an wash up actor (Michael Keaton) - famous for portraying an iconic superhero - as he struggles to mount a Broadway play. In the days leading up to opening night, he battles his ego and attempts to recover his family, his career, and himself.\r\n\r\nOkay in my review of Whiplash I bought this movie up mid way through the review just to give a heads up of when I'm going to watch it, because Birdman was my most anticipated film of 2014. But just like every time I really wanted to see a film so baldy I have to wait for a while until I finally get a chance to watch it, story of my life really. But anywhere, I was really looking forward to this movie ever since September, and now finally seeing the film I can safely say that Birdman is one of the best movie of 2014.\r\n\r\nI always know that Micheal Keaton was the kind of movie star that will pick any random movie role just because... well he what's to be important and still show to everyone that he still got it, I guess. Early last year he was in two movies that were pretty blah, and that was The Robocop (remake) and Need for Speed, and those films just made Keaton look like he was just cashing it in just for the sake of it. Until I watched this movie and seeing Micheal Keaton's performance and thinking to myself \"Wait is Keaton giving probably his best performance I've ever seen in my life? I think he is\", because Keaton in this movie pretty much pulls of the best performance I've seen him in his all career. His character in this movie is like a washed up actor who had everything like: the love from the critics and he's fans. Yeah he still dose have that Keaton thing that he always dose in his previous movies, but the scenes where he plays his character (Which is himself if you really look at his character in this movie) but anywhere he still gives a strong and believable performance that at times give me flashbacks of the good old days when he still had roots and felt like he isn't just cashing it in. I hear a lot of Oscar buzz about his performance in this movie, and I wouldn't be surprise if he wins because he totally deserves it. Excellent work Keaton.\r\n\r\nEdward Norton is also in this movie and played a familiar character to himself has the hard to work with actor that at times doesn't follow the lines that he was given or even the direction he was told. We already know that Norton is a fantastic actor in his previous work, but in this movie his performance could be descried has stellar and insanely good.\r\n\r\nEmma Stone is this movie and of course like most of the actors I named off so far who were outstanding in this movie and well you can already guess what I'm going to say next. Emma Stone acting in this movie was just terrific and marvellous to watch. It's good to see a real break out performance from her more than the lay back ones in her other movies. Nice one Emma. The other cast in the movie like Naomi Watts, Zach Galifianakis both did good as well.\r\n\r\nThe whole movie is shot to look like it's all in one shot and my mind was just blown away by that fact. There were scenes in way I said to myself \"Oh my god is it one shot?\", well I can already imagine the stress, hard work and how many takes they had to do to get it, and boy did it pay off nicely, because I couldn't take my eyes off the screen. I dared myself to look away from the beautiful cinematography and the impressive editing used in the film.\r\n\r\nThe movie has a brilliant message about film critics today that doesn't feel like it's in your face message that you normally get in movies. There's a scene in this movie and by the way it's not a spoiler, but I really need to get this out the way first. Micheal Keaton character starts having a rant over this theater critic who is going to give a bad review to he's play when she hasn't even seen it or any of the premieres. He talks about how she only users big words that nobody will say in person and shes to lazy to come up what she really thinks about it so she users big words just to fill in the sentence. This movie probably has the best rant in movie history and Keaton in that scene shows how good of a actor that he is.\r\n\r\nFor problems in the movie: I really don't have any to be honest.\r\n\r\nI loved this movie and yes I'm coming out be saying that. This isn't just the best movie of the year and such, no this is just flawless film making right here. Birdman and Whiplash are the two films I will highly recommend to people, because those two films are my favorite films of 2014.", "created_at": "2020-01-27T18:26:19.168Z"}, {"movie_id": 194662, "review_id": "5fd9611b1d3143003dbcdd55", "author_rating": 6.0, "review_text": "I was drawn to watch this film for a couple of reasons. One, basically, was Michael Keaton. Overall I find movies are worth a look when he is in it. Also there is the play within a play, the stage production his character  is doing, based on an actual short story by Raymond a carver. When I first started writing short stories and novels decades ago, I was influenced by Carver’s spare writing style and his realistic dialogue. I guess this particular short story has been used in a few short films also.\r\n\r\nI don’t believe this movie is in any way considered an Independent Film, but it has that feel to me, the way it clings to gritty realism and comic book fantasy all at once, the philosophical musings of most of the characters, the total lack of a defined ending, all speak to me of an independent film.\r\n\r\nI didn’t come away from watching it thinking it was a great movie, merely interesting in places and well acted. Unfortunately, I disliked most of the characters, with a few exceptions such as the discarded ex-wife/girlfriend or whatever she was. However skilled the production standards and acting might be, this movie proved to me that empathy for the characters and the quality of the writing still counts for a lot. And as a writer (of lower quality admittedly) I was relieved to realize it.", "created_at": "2020-12-16T01:21:31.220Z"}, {"movie_id": 194662, "review_id": "54d1f859c3a3687351001f2a", "author_rating": null, "review_text": "**mounting spontaneity** or (dumb luck)\r\n\r\nIt's not fair.\r\n\r\nI love Raymond Carver, long takes, theatre, Batman, NYC rooftops and alleyways, the blending layers of self-referential fiction, delirious fantasy, the creative process, the insane logistics of run-on cinematography, the seamless assembly of shifting environments, stepping into unresolved mental spaces, demonstrations of solitary madness and the unbearable anticipation of being, being judged, being booed, un-being, unhinging, delusional uppers, existential downers, magic surrealism, telekinetic fury, dreams of flying, throwing tantrums, the fragile yet invincible ego, immaculately constructed chaos, the recurring climax of ending it all -- where the blazes is that blasted improvisational drumming coming from? -- oh there, and there, so absurd, don't stop, the shot must go on, the show must go on, \"You are not important, get used to it,\" she said, but so much angst overwhelms him, tethered to a feathered fantasy, a nagging reminder of what once was, or could have been, refusing to believe it's too late to soar to former heights, yet grounded by time and gravity, trapped in a narrative, caged in a fabrication, \"You're an actress, honey,\" says another, \"you have no self-respect\" and all actors are game, Keaton and Stone zoned-in, knowing the pain, pretending to not care or pretending to matter, failing to be authentic, acting over acting, meta-acting meta-fiction meta-filmed with a meta-critical message: yeah, we're all messed-up and meta-fµcked, but after shooting your nose to spite the ruse, by unmasking the unexpected virtue of ignorance, peeling off layers of pretense and self-importance, you just might find a momentary strain of pure, uncomplicated innocence.\r\n\r\nIt's not fair. I love this sh*t!", "created_at": "2015-02-04T10:45:45.313Z"}, {"movie_id": 194662, "review_id": "5758fb4f92514109060014b3", "author_rating": 1.0, "review_text": "First of all, let me say, I like most of movies where Naomi Watts plays & thought this one would be good too, after all it has high ratings, but don't be fooled by famous actors which play in this movie. Don't be fooled & think that movie is good. No, not at all. This movie is complete junk. It supposed to be a comedy, but I didn't even find it funny. It's just like a big mess. I started watching it & I couldn't last longer than 30 minutes, it was so boring & uninteresting that I fell asleep. I can't believe people rate this movie so high & even worse - this movie won an Oscar. This again proves, that ratings & Oscar ain't always accurate.", "created_at": "2016-06-09T05:14:55.632Z"}, {"movie_id": 194662, "review_id": "58c14e9ec3a3687da8004a11", "author_rating": 9.0, "review_text": "This film tells the story of an over-the-hill actor called Riggan Thomson (brilliantly portrayed by Michael Keaton) who was once the star of a superhero blockbuster franchise known as 'Birdman'. We are shown his journey into making a Broadway production starting with the initial rehearsals and read-throughs. What follows is a brilliant exploration of celebrity culture in an intriguing and satirical way.\r\n\r\n'Birdman' could essentially be looked at as one continuous long shot. The camera constantly weaves around the actors and action and so the audience are completely immersed into the perspectives of the various characters (mostly Riggan's). The opening shot plays like a scene in Paul Thomas Anderson's 'Boogie Nights' as it delightfully establishes the narrative in a fluid and polished style whilst introducing the cast and their entertaining interchanges during a rehearsal with hilarious consequences. \r\n\r\nThe editing throughout the picture is almost flawless when moving from scene to scene and has a dizzying effect much like Gasper Noé's 'Irreversible'. 'Birdman' also boasts some marvellous special effects throughout such as when Riggan (Keaton) is alone and being taunted by his egotistical alter-ego. The film shows up typical blockbuster action movies by asking the audience what they want and giving it to them in a manner which embraces the excitement and epic-ness of the genre whilst also poking fun of the conventions.\r\n\r\nThe music that accompanies the film is very scarce in a lot of places adding emphasis to the dialogue and situations arising but, in some cases, an erratic and improvisational drum riff can be heard (occasionally accompanied with the drummer on the set) which completely adds to the eccentricity and spontaneity of the movie.\r\n\r\nThe screenplay is very intricately written and contains many profound philosophical speeches about art, celebrity and criticism. There are monologues and debates by characters in which they discuss the core beliefs of the film such as Riggan's speech during his performance of his Raymond Carver play \"What We Talk About When We Talk About Love\".\r\n\r\nThe whole narrative of the film is very intriguing and interesting. There is a perfect blend of comedy and poignancy. There are a lot of twists and ambiguity throughout the film which could be analysed and interpreted for a long time.\r\n\r\nMichael Keaton is fantastic as the protagonist and gives a performance that would have given his career a huge revival (his squeal is my highlight of the film). The parallels with the character's career and that of Keaton's could not have been a mistake and gives the performance that much more edge. Edward Norton plays the method actor from hell (Mike Shiner). He is annoying, snobbish and smug and played brilliantly by Norton who excels in the vileness and pomposity of the character.\r\n\r\nThe film is very much about actors. The self obsessive nature of acting is definitely highlighted by the two central performances but there is also a cast that really help to deliver the film's meaning such as Emma Stone, Zach Galifianakis, Andrea Riseborough and Naomi Watts.\r\n\r\nOverall, 'Birdman' is a fantastic film. It is filled with pathos and profound imagery whilst keeping the viewer thoroughly entertained throughout.\r\n\r\n★★★★½", "created_at": "2017-03-09T12:46:22.310Z"}, {"movie_id": 194662, "review_id": "5e2f2b4bac8e6b0015bcdb0b", "author_rating": 10.0, "review_text": "\"I'm nothing. I'm not even here.\"\r\n\r\nThe story to Birdman is about an wash up actor (Michael Keaton) - famous for portraying an iconic superhero - as he struggles to mount a Broadway play. In the days leading up to opening night, he battles his ego and attempts to recover his family, his career, and himself.\r\n\r\nOkay in my review of Whiplash I bought this movie up mid way through the review just to give a heads up of when I'm going to watch it, because Birdman was my most anticipated film of 2014. But just like every time I really wanted to see a film so baldy I have to wait for a while until I finally get a chance to watch it, story of my life really. But anywhere, I was really looking forward to this movie ever since September, and now finally seeing the film I can safely say that Birdman is one of the best movie of 2014.\r\n\r\nI always know that Micheal Keaton was the kind of movie star that will pick any random movie role just because... well he what's to be important and still show to everyone that he still got it, I guess. Early last year he was in two movies that were pretty blah, and that was The Robocop (remake) and Need for Speed, and those films just made Keaton look like he was just cashing it in just for the sake of it. Until I watched this movie and seeing Micheal Keaton's performance and thinking to myself \"Wait is Keaton giving probably his best performance I've ever seen in my life? I think he is\", because Keaton in this movie pretty much pulls of the best performance I've seen him in his all career. His character in this movie is like a washed up actor who had everything like: the love from the critics and he's fans. Yeah he still dose have that Keaton thing that he always dose in his previous movies, but the scenes where he plays his character (Which is himself if you really look at his character in this movie) but anywhere he still gives a strong and believable performance that at times give me flashbacks of the good old days when he still had roots and felt like he isn't just cashing it in. I hear a lot of Oscar buzz about his performance in this movie, and I wouldn't be surprise if he wins because he totally deserves it. Excellent work Keaton.\r\n\r\nEdward Norton is also in this movie and played a familiar character to himself has the hard to work with actor that at times doesn't follow the lines that he was given or even the direction he was told. We already know that Norton is a fantastic actor in his previous work, but in this movie his performance could be descried has stellar and insanely good.\r\n\r\nEmma Stone is this movie and of course like most of the actors I named off so far who were outstanding in this movie and well you can already guess what I'm going to say next. Emma Stone acting in this movie was just terrific and marvellous to watch. It's good to see a real break out performance from her more than the lay back ones in her other movies. Nice one Emma. The other cast in the movie like Naomi Watts, Zach Galifianakis both did good as well.\r\n\r\nThe whole movie is shot to look like it's all in one shot and my mind was just blown away by that fact. There were scenes in way I said to myself \"Oh my god is it one shot?\", well I can already imagine the stress, hard work and how many takes they had to do to get it, and boy did it pay off nicely, because I couldn't take my eyes off the screen. I dared myself to look away from the beautiful cinematography and the impressive editing used in the film.\r\n\r\nThe movie has a brilliant message about film critics today that doesn't feel like it's in your face message that you normally get in movies. There's a scene in this movie and by the way it's not a spoiler, but I really need to get this out the way first. Micheal Keaton character starts having a rant over this theater critic who is going to give a bad review to he's play when she hasn't even seen it or any of the premieres. He talks about how she only users big words that nobody will say in person and shes to lazy to come up what she really thinks about it so she users big words just to fill in the sentence. This movie probably has the best rant in movie history and Keaton in that scene shows how good of a actor that he is.\r\n\r\nFor problems in the movie: I really don't have any to be honest.\r\n\r\nI loved this movie and yes I'm coming out be saying that. This isn't just the best movie of the year and such, no this is just flawless film making right here. Birdman and Whiplash are the two films I will highly recommend to people, because those two films are my favorite films of 2014.", "created_at": "2020-01-27T18:26:19.168Z"}, {"movie_id": 194662, "review_id": "5fd9611b1d3143003dbcdd55", "author_rating": 6.0, "review_text": "I was drawn to watch this film for a couple of reasons. One, basically, was Michael Keaton. Overall I find movies are worth a look when he is in it. Also there is the play within a play, the stage production his character  is doing, based on an actual short story by Raymond a carver. When I first started writing short stories and novels decades ago, I was influenced by Carver’s spare writing style and his realistic dialogue. I guess this particular short story has been used in a few short films also.\r\n\r\nI don’t believe this movie is in any way considered an Independent Film, but it has that feel to me, the way it clings to gritty realism and comic book fantasy all at once, the philosophical musings of most of the characters, the total lack of a defined ending, all speak to me of an independent film.\r\n\r\nI didn’t come away from watching it thinking it was a great movie, merely interesting in places and well acted. Unfortunately, I disliked most of the characters, with a few exceptions such as the discarded ex-wife/girlfriend or whatever she was. However skilled the production standards and acting might be, this movie proved to me that empathy for the characters and the quality of the writing still counts for a lot. And as a writer (of lower quality admittedly) I was relieved to realize it.", "created_at": "2020-12-16T01:21:31.220Z"}]