[{"movie_id": 4629, "review_id": "5bb64a9ec3a368152600f808", "author_rating": 7.0, "review_text": "_**Coming-of-age in South Australia... and tantalizing Teresa Palmer**_  \r\n\r\nI was interested in \"December Boys\" (2007) for two reasons: I like (non-raunchy) coming-of-age flicks and the fact that it takes place on the Southern coast of Australia (actually it was shot on Kangaroo Island, part of South Australia). As for Daniel Radcliffe, the star of the popular Harry Potter films, I've never seen him in a movie before and have no interest in him or Potter.\r\n\r\nThe story revolves around four boys from an Outback Catholic orphanage who get to celebrate their December birthdays by taking a Christmas holiday on the coast. They discover that a young childless couple are interested in adopting one of them, which creates a bit of rivalry, although the oldest one (Radcliffe) could care less and spends his time learning about girls and romance. Their time at the coast becomes a cornerstone experience as they ultimately discover what family means.\r\n\r\nUnless you're Australian, I encourage you to utilize the English subtitles to understand the nigh-unintelligible Australian dialect. Otherwise you'll only comprehend about half the dialogue and the story will be lost to you. No kidding.\r\n\r\nAfter seeing the film a few times I only remember two of the boys: Maps and Misty. The others might as well have been phantoms. The plot is interesting, but the story as-played-out is not very compelling (although the epilogue is slightly moving). The film tries too hard to be “magical.” Scenes come and go with largely ill-defined characters and little dialogue or explanation. This is definitely a picture where you'll have to read in between the lines to appreciate, which might make it good for repeat-viewings.\r\n\r\nOn the positive side, the Kangaroo Island locations are fabulous, especially the high shots of Remarkable Rocks in Flinders Chase National Park.\r\n\r\nThe picture really comes alive when Teresa Palmer is on screen; she plays femme fatale Lucy. The movie poster (or DVD cover) is deceiving in that Teresa looks to be about 12-13 years-old. Actually she was 20 during filming and plays an about-16 girl with curvy legs from here to New York. Lucy's scenes with Maps are the highlight of the picture (and not at all \"awkward\" as another reviewer contended). Lucy is aware of her tantalizing feminine powers and skillfully utilizes them to bewitch Maps with her spell.\r\n\r\nOther highlights include a secret cave high up on the rocks, a wild black horse who seems to fish, an Evel Knieval-type character who may not be as \"Fearless\" as he lets on, a colossal fish named Henry and the cantankerous old man fascinated by it.\r\n\r\nThe DVD feature about 10-minutes of deleted scenes that should have never been deleted. Make sure you catch 'em as they help explain the story better.\r\n\r\nIn the book the story was set in the 30s, but the filmmakers decided to switch it to the late 60s. Some people found this confusing, but I didn’t. Others complained that the children-as-adults at the end were too old considering they were kids in the late 60s, but the epilogue obviously takes place in the near future, like the 2010s or 2020s, which would put them in their 50s or 60s.\r\n\r\nBOTTOM LINE: Although the story is merely okay as far as captivating and moving cinema goes, the highlights noted above compel me to give \"December Boys\" a decent rating, in particular the scenic rocks/coast and Lucy.\r\n\r\nIf you like Teresa Palmer in this picture be sure to check her out in \"Bedtime Stories\" (2008), \"Restraint\" (2008) and \"The Grudge 2\" (2006).\r\n\r\nThe film runs 1 hour, 45 minutes.\r\n\r\nGRADE: B", "created_at": "2018-10-04T17:15:10.707Z"}]