[{"movie_id": 376659, "review_id": "581cf6f3c3a3681e5400121f", "author_rating": 6.0, "review_text": "**Moms don't quit! Quitting's for dads!**\r\n\r\nIt was more like a middle aged women's version of 'How to be Single'. So most of the younger audience won't get it, as well as the older people, because of the generation gap. I enjoyed it, but you know this is nothing close to any classic on the similar theme, just a decent entertainer though. From the director of '21 & Over', about the three moms whose children are in the high school, but it depicts those moms struggles over maintain the order in their professional and personal life.\r\n\r\nMila Kunis' character is the centre of the story, but I liked Kristen Bell and Kathryn Hahn as well. Basically, these three ruled the narration. Some of the comedies were good, though there are too much of sexual references in that. Not good as 'How to be Single', but definitely better than both the 'Bad Neighbours' films.\r\n\r\nIt got a mixed response, but a box office hit. Most of the story is predictable, though decently developed all the scenes by keeping them simple. I mean cliché wise, but at some parts it gets loud and out of control. So make sure you are not watching for any inspiration, but the middle aged people feel more familiar with this than anybody else. Therefore, I think they're the target audience, and mostly the women.\r\n\r\n_6/10_", "created_at": "2016-11-04T21:00:35.479Z"}, {"movie_id": 376659, "review_id": "6055f72b2ac49900756c1279", "author_rating": 8.0, "review_text": "I found <em>'Bad Moms'</em> entertaining.\r\n\r\nMila Kunis carries it I must say, without her I think I'd be rating this a fair chunk lower. She is amusing and keeps the film chugging along, helped by the pacing and music which also move the film along nicely. There is a good amount of gags, I certainly enjoyed watching it.\r\n\r\nAway from Kunis (Amy), you have a whole host of recognizable faces. Kristen Bell (Kiki) and Kathryn Hahn (Agath..sorry, Carla) are pleasant in their respective roles, Hahn is borderline irritating but I'd say she sticks to the right side just about. Christina Applegate (Gwendolyn) and Jada Pinkett Smith (Stacy) also feature, as does Wendell Pierce (Daryl). Shoutout, also, to <em>'The Walking Dead'</em> alum Ann Mahoney.\r\n\r\nThere are also sweet end credit scenes. It's a lot better than 2017's <em>'Fun Mom Dinner'</em> too, no doubt about it. Interested to watch the sequel.", "created_at": "2021-03-20T13:22:51.747Z"}, {"movie_id": 376659, "review_id": "6446bbb967e0f7038c30765a", "author_rating": 7.0, "review_text": "Pretty good movie. Was really funny. Probably the best chick flick movies I've ever seen.", "created_at": "2023-04-24T17:26:17.519Z"}]