[{"movie_id": 649609, "review_id": "643cf44b8ec4ab0446af68e5", "author_rating": 6.0, "review_text": "Nicholas Hoult is the eponymous vampire \"familial\" whose job it is, is to cater for the needs of his toothy master (Nicolas Cage) who is distinctly under the weather. He is gradually tiring of the relentlessness of his tasks - especially as procuring food for his boss is becoming more and more difficult; as well having to rely on his own unsavoury diet of bugs - they give him super strength for a few moments. Meantime, the ballsy police officer \"Quincy\" (Awkwafina) is trying to finally nail \"Teddy Lobo\" (Ben Schwartz) whose mother \"Bella\" (Shohreh Aghdashloo) heads up the city's most ruthless gang of drug dealing hoods and who has bribed just about every city official. Serendipity takes an hand when \"Renfield\" comes across this officer in a diner and after a lively altercation the two find themselves united in their determination to achieve their goals. To be honest, the story is pretty lightweight and just reminded me of an episode of \"Buffy\". What makes this a bit more fun is the two characterisations. Hoult joins in. He is clearly having fun with his insects and his acrobatics. Cage is also up for the task at hand. He is super-hammy and at times reminded me more of Sir Anthony Hopkin's \"Hannibal Lecter\" than of anything Christopher Lee ever did. I saw this on my own in a cinema last night which was a bid sad - it's not a great film, but it is still a mildly amusing mickey-take of this genre (and of what passes for film-noir nowadays) and though instantly forgettable, is still a well produced and enjoyable enough gore-fest.", "created_at": "2023-04-17T07:24:59.650Z"}, {"movie_id": 649609, "review_id": "643f13eb37b3a902fb42a8e5", "author_rating": 6.0, "review_text": "_Renfield_ is an okay horror comedy. It has a ton of potential with its excessive amount of blood and Nicolas Cage is worth the price of admission alone. The action sequences have all of their entertainment value sucked away by the end of the film; mostly because they all feel so similar. The humor and story reach a brick wall that the filmmakers refuse to stop pounding your face into.\r\n\r\n_Renfield_ is like the junk food version of a horror comedy. It has all the right ingredients for something that should be fantastic, but its recipe for action, comedy, and satisfying storytelling is imbalanced to the point of near disgust.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/04/18/renfield-review-bite-suck-not-laugh-repeat/", "created_at": "2023-04-18T22:04:27.502Z"}, {"movie_id": 649609, "review_id": "644052ab04863802fb115ff3", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ www.firstshowing.net/2023/review-chris-mckays-renfield-is-precisely-what-its-expected-to-be/\r\n\r\n\"Renfield is yet another movie that provides precisely what it promises - with an unbelievably ridiculous, purposefully silly story about the toxic relationship between Dracula and Renfield, expectedly elevated by the \"OTT King\" Nicolas Cage and an up-to-the-challenge Nicholas Hoult. The light, humorous environment leaves space for action sequences that are also intentionally excessive in all technical elements, which makes the entertainment levels inconsistent due to the continuous blend of quick cuts and outrageous amounts of blood. The dedication of the stunt team deserved better and much more screen time. Still, if you're a Cage fan, you won't be disappointed.\"\r\n\r\nRating: B-", "created_at": "2023-04-19T20:44:28.005Z"}, {"movie_id": 649609, "review_id": "644409c9cee2f6049f36bd9f", "author_rating": null, "review_text": "Over the decades countless movies, plays, books, comics, video games, and\r\n\r\ntelevision shows have depicted Vampires in various mythos which often\r\ninclude differences in behaviors, abilities, and, motivations. While there have been many Vampires, none have ever achieved the fabled\r\nstatus of Dracula who has been the template ever since Stokers’s book and\r\nthe classic original film as well as subsequent appearances. In the new film “Renfield” audiences are introduced to Renfield (Nicholas Holt), who recounts his past as an ambitious lawyer who ended up serving\r\nDracula (Nicolas Cage) as a Familiar when his original intention was to\r\nclose a real estate deal. After his Master is injured after another attempt by Vampire Hunters,\r\nRenfield relocates Dracula to New Orleans and looks to find suitable prey\r\nto help his master return to full power.\r\n\r\n This in turn leads Renfield to a self-help group as he plans to help the\r\npoor souls there by using their tormentors as prey for his boss which he\r\nhopes will in some way eliminate the burden that has built over the\r\ndecades from his servitude. This plan goes horribly wrong when he attempts to subdue an abusive\r\nindividual and his group lands Renfield on the radar as not only an eager\r\na police officer named Rebecca ( Awkwafina), and a drug lord named Edward\r\n(Ben Schwartz). Mixing humor, action, and gore aplenty, Renfield must also deal with his\r\nrising self-help motivations as he looks to stand up to his boss once and\r\nfor all and have his needs heard and respected which naturally does not\r\nsit Weill with Dracula.\r\n\r\nWhat follows is an amusing, chaotic, and gory adventure that while at\r\ntimes inconsistent and meandering with the story; still finds enough ways\r\nto entertain.\r\n\r\nCage hams it up to new levels in his portrayal of Dracula and he is\r\nliterally chewing the scenery in every scene in which he is featured and\r\nit is one of his most enjoyable performances in recent years.\r\n\r\nHoult, Awkfwafina, and the supporting cast work well, and while the film\r\ndoes get more than a bit loose with the story and gaps in logic even for a\r\nfilm of this type it still manages to work. Dracula talks of a big plan\r\nfor world domination but we get little more than lip service which would\r\nhave helped to make this version of Dracula a more defined character.\r\n\r\nThe focus is more on comedic action than horror and it is clear that the\r\nthe cast seemed to be having a great time with their roles so as long as you\r\nare willing to overlook issues with the plot; you may find “Renfield” one\r\nof the more enjoyable comedic outings of the year.\r\n\r\n3.5 stars out of 5", "created_at": "2023-04-22T16:22:33.216Z"}, {"movie_id": 649609, "review_id": "6444c940651fcf04889d9ef5", "author_rating": 4.0, "review_text": "If not for a trademark over-the-top Nicolas Cage performance and a truly inspired fight scene in an apartment complex, “Renfield” would be a total disaster of a movie. It’s certainly not any good and I wouldn’t recommend it to anyone, and the real horror of it all is the way director Chris McKay blows what should have been a slam-dunk premise.\r\n\r\nSet in present day, Renfield (Nicholas Hoult) is the tortured, loyal assistant to Dracula (Cage). He’s served his master for decades, taking care of everything from getting his cape dry cleaned to procuring fresh prey for dinner. After centuries of servitude, Renfield is finally ready to move on and create a life of his own.\r\n\r\nAlthough it is mostly dead in the water, the film’s pacing never feels slow. There’s plenty of entertainment, it’s just not fun enough, outrageous enough, nor twisted enough. The tone is both tongue-in-cheek and sincere, which is not cohesive as a whole. There’s a lot of action that means nothing, and characters like Awkwafina‘s police officer that are bland and forgettable.\r\n\r\nThe side plots about a crime family with a ruthless boss (Shohreh Aghdashloo) and her son (Ben Schwartz) that wants Renfield dead is half-baked, and the funny group therapy bits where Dracula’s assistant seeks help for co-dependency and dealing with his raging narcissist of a boss falls flat. The ideas all sound so good on paper, but are poorly executed across the board. That’s why the movie feels so underwhelming.\r\n\r\nCage is by far the best part of this mess, and he is an actor who is born to play Dracula. He hams it up in every scene, and his unhinged take is genuinely scary but also goofy. His manic line delivery and unhinged inflection of such dialogue gems like “Hail Satan” is absolute bliss.\r\n\r\nThe blood and gore is over-the-top and mostly used in a humorous manner, but this isn’t for the squeamish. There is graphic throat ripping, spurting blood, and abdomens slit open with internal organs visibly spilling out. McKay doesn’t shy away from the violence (and the makeup and effects are really great), which should at least delight horror fans.\r\n\r\nWith such a great idea for story, it’s a bummer that “Renfield” is disappointing in nearly every way imaginable. You’ll find yourself mourning what it could have been.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T05:59:28.773Z"}, {"movie_id": 649609, "review_id": "64548e97d48cee017026af26", "author_rating": 6.0, "review_text": "Its been a while since I've seen Nicolas Cage in a role, I feel, does him justice. Renfield gives Cage the opportunity to shine. \r\n\r\nHis comedic take on Dracula combined with the \"very English\" performance, handed in by Nicholas Hoult, makes this film work, in spite of itself. \r\n\r\nThe comedic premise behind Renfield is highly original, I'd even say, quite clever. Whats not so intelligent, however, is the handling. \r\n\r\nThe potential for comedic flair and fun is drowned, in good measure, by the over the top, often rather grotesquely visceral, blood soaked, violence. Violence that's on the cusp, of the proverbial, splatter flick. \r\n\r\nIn summary, a moderately watchable film that leaves the compelling feeling, it could have amounted to more, with subtler, less violent, treatment.", "created_at": "2023-05-05T05:05:27.354Z"}, {"movie_id": 649609, "review_id": "6456ec0f6c849200e35c905f", "author_rating": 7.0, "review_text": "Awkwafina should have been on the poster!\r\n=========================================\r\n\r\nNot knowing she was in this, is what probably made me resist watching Renfield right away. She is the most watchable part of the film.\r\n\r\nMaybe because the rest is not a revelation; everything that happens in the movie with Cage and Hoult, is just predictable vampire tropes—the trailer was enough for that.\r\n\r\nAt any moment, it was neither horror, nor comedy. Although, at the very beginning, the recovering Dracula is convincingly threatening; but not once he 'gains full power'.\r\nThe excessive, exploding blood-works would have been funny, if they were selective with it's use. But they end up using it everywhere, even the kills that are meant to invoke fear and sadness. Perhaps it was an attempt at nonsense comedy. But, didn't come across very well.\r\n\r\nBut yes, Awkwafinaaaa!", "created_at": "2023-05-07T00:08:47.836Z"}, {"movie_id": 649609, "review_id": "6463a5590f36550170b3ba29", "author_rating": 4.0, "review_text": "I was not expecting much from Renfield and it pretty much gave me exactly what I was expecting: a mediocre film that was nothing offensive but all too forgettable.\r\n\r\nThe screenplay is really all over the place. There are too many subplots and not enough time spent on the actual draw to the film, Dracula. Awkwafina's subplot was half baked and really did not go anywhere. I felt as though her character could have entirely been written out of the film to spend more time on Renfield and Dracula. The comedy is pretty bad. I do not remember laughing one time during the hour-thirty-minute runtime. There were clear jokes that they were trying to set up, but they just did not land for me.\r\n\r\nPerformances were fine. Nicholas Cage was great as Dracula, but unfortunately did not have enough screen time or material to really make a huge impact on the film. Nicholas Holt was good in his role, but again I do not think he had much to work with. Everyone else gave really average performances. Awkwafina plays literally the same style of character as she did in Shang Chi, and it was fine, but nothing that really blew me away.\r\n\r\nThe direction was pretty poor. So many action scenes had a tremendous amount of shaky cam and some weird motion blur type effect that made it really hard to see what was happening. It was brutal, don't get me wrong, and I loved what they attempted to go for, but it really just landed flat. Coming off from John Wick just a few weeks ago, the action direction was apparently bad. The gore was at an extreme, but for the love of God, why did they choose to use CGI blood? The graphics literally looked like something out of a PS2 Mortal Kombat; absolutely terrible. Which is a shame because that mixed with the poor action direction really took me out of every scene when I should have been locked in having a bloody good time.\r\n\r\nOverall, this film is a misstep in what could have been a fun, campy, cult classic. The jumbled screenplay, poor stunt choreography, and terrible effects really hold this movie back from its true potential. There is nothing truly awful that make this a bad movie, just enough there to make it an extremely average experience.\r\n\r\nScore: 44% ❌\r\nVerdict: Poor", "created_at": "2023-05-16T15:46:33.601Z"}, {"movie_id": 649609, "review_id": "643cf44b8ec4ab0446af68e5", "author_rating": 6.0, "review_text": "Nicholas Hoult is the eponymous vampire \"familial\" whose job it is, is to cater for the needs of his toothy master (Nicolas Cage) who is distinctly under the weather. He is gradually tiring of the relentlessness of his tasks - especially as procuring food for his boss is becoming more and more difficult; as well having to rely on his own unsavoury diet of bugs - they give him super strength for a few moments. Meantime, the ballsy police officer \"Quincy\" (Awkwafina) is trying to finally nail \"Teddy Lobo\" (Ben Schwartz) whose mother \"Bella\" (Shohreh Aghdashloo) heads up the city's most ruthless gang of drug dealing hoods and who has bribed just about every city official. Serendipity takes an hand when \"Renfield\" comes across this officer in a diner and after a lively altercation the two find themselves united in their determination to achieve their goals. To be honest, the story is pretty lightweight and just reminded me of an episode of \"Buffy\". What makes this a bit more fun is the two characterisations. Hoult joins in. He is clearly having fun with his insects and his acrobatics. Cage is also up for the task at hand. He is super-hammy and at times reminded me more of Sir Anthony Hopkin's \"Hannibal Lecter\" than of anything Christopher Lee ever did. I saw this on my own in a cinema last night which was a bid sad - it's not a great film, but it is still a mildly amusing mickey-take of this genre (and of what passes for film-noir nowadays) and though instantly forgettable, is still a well produced and enjoyable enough gore-fest.", "created_at": "2023-04-17T07:24:59.650Z"}, {"movie_id": 649609, "review_id": "643f13eb37b3a902fb42a8e5", "author_rating": 6.0, "review_text": "_Renfield_ is an okay horror comedy. It has a ton of potential with its excessive amount of blood and Nicolas Cage is worth the price of admission alone. The action sequences have all of their entertainment value sucked away by the end of the film; mostly because they all feel so similar. The humor and story reach a brick wall that the filmmakers refuse to stop pounding your face into.\r\n\r\n_Renfield_ is like the junk food version of a horror comedy. It has all the right ingredients for something that should be fantastic, but its recipe for action, comedy, and satisfying storytelling is imbalanced to the point of near disgust.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/04/18/renfield-review-bite-suck-not-laugh-repeat/", "created_at": "2023-04-18T22:04:27.502Z"}, {"movie_id": 649609, "review_id": "644052ab04863802fb115ff3", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ www.firstshowing.net/2023/review-chris-mckays-renfield-is-precisely-what-its-expected-to-be/\r\n\r\n\"Renfield is yet another movie that provides precisely what it promises - with an unbelievably ridiculous, purposefully silly story about the toxic relationship between Dracula and Renfield, expectedly elevated by the \"OTT King\" Nicolas Cage and an up-to-the-challenge Nicholas Hoult. The light, humorous environment leaves space for action sequences that are also intentionally excessive in all technical elements, which makes the entertainment levels inconsistent due to the continuous blend of quick cuts and outrageous amounts of blood. The dedication of the stunt team deserved better and much more screen time. Still, if you're a Cage fan, you won't be disappointed.\"\r\n\r\nRating: B-", "created_at": "2023-04-19T20:44:28.005Z"}, {"movie_id": 649609, "review_id": "644409c9cee2f6049f36bd9f", "author_rating": null, "review_text": "Over the decades countless movies, plays, books, comics, video games, and\r\n\r\ntelevision shows have depicted Vampires in various mythos which often\r\ninclude differences in behaviors, abilities, and, motivations. While there have been many Vampires, none have ever achieved the fabled\r\nstatus of Dracula who has been the template ever since Stokers’s book and\r\nthe classic original film as well as subsequent appearances. In the new film “Renfield” audiences are introduced to Renfield (Nicholas Holt), who recounts his past as an ambitious lawyer who ended up serving\r\nDracula (Nicolas Cage) as a Familiar when his original intention was to\r\nclose a real estate deal. After his Master is injured after another attempt by Vampire Hunters,\r\nRenfield relocates Dracula to New Orleans and looks to find suitable prey\r\nto help his master return to full power.\r\n\r\n This in turn leads Renfield to a self-help group as he plans to help the\r\npoor souls there by using their tormentors as prey for his boss which he\r\nhopes will in some way eliminate the burden that has built over the\r\ndecades from his servitude. This plan goes horribly wrong when he attempts to subdue an abusive\r\nindividual and his group lands Renfield on the radar as not only an eager\r\na police officer named Rebecca ( Awkwafina), and a drug lord named Edward\r\n(Ben Schwartz). Mixing humor, action, and gore aplenty, Renfield must also deal with his\r\nrising self-help motivations as he looks to stand up to his boss once and\r\nfor all and have his needs heard and respected which naturally does not\r\nsit Weill with Dracula.\r\n\r\nWhat follows is an amusing, chaotic, and gory adventure that while at\r\ntimes inconsistent and meandering with the story; still finds enough ways\r\nto entertain.\r\n\r\nCage hams it up to new levels in his portrayal of Dracula and he is\r\nliterally chewing the scenery in every scene in which he is featured and\r\nit is one of his most enjoyable performances in recent years.\r\n\r\nHoult, Awkfwafina, and the supporting cast work well, and while the film\r\ndoes get more than a bit loose with the story and gaps in logic even for a\r\nfilm of this type it still manages to work. Dracula talks of a big plan\r\nfor world domination but we get little more than lip service which would\r\nhave helped to make this version of Dracula a more defined character.\r\n\r\nThe focus is more on comedic action than horror and it is clear that the\r\nthe cast seemed to be having a great time with their roles so as long as you\r\nare willing to overlook issues with the plot; you may find “Renfield” one\r\nof the more enjoyable comedic outings of the year.\r\n\r\n3.5 stars out of 5", "created_at": "2023-04-22T16:22:33.216Z"}, {"movie_id": 649609, "review_id": "6444c940651fcf04889d9ef5", "author_rating": 4.0, "review_text": "If not for a trademark over-the-top Nicolas Cage performance and a truly inspired fight scene in an apartment complex, “Renfield” would be a total disaster of a movie. It’s certainly not any good and I wouldn’t recommend it to anyone, and the real horror of it all is the way director Chris McKay blows what should have been a slam-dunk premise.\r\n\r\nSet in present day, Renfield (Nicholas Hoult) is the tortured, loyal assistant to Dracula (Cage). He’s served his master for decades, taking care of everything from getting his cape dry cleaned to procuring fresh prey for dinner. After centuries of servitude, Renfield is finally ready to move on and create a life of his own.\r\n\r\nAlthough it is mostly dead in the water, the film’s pacing never feels slow. There’s plenty of entertainment, it’s just not fun enough, outrageous enough, nor twisted enough. The tone is both tongue-in-cheek and sincere, which is not cohesive as a whole. There’s a lot of action that means nothing, and characters like Awkwafina‘s police officer that are bland and forgettable.\r\n\r\nThe side plots about a crime family with a ruthless boss (Shohreh Aghdashloo) and her son (Ben Schwartz) that wants Renfield dead is half-baked, and the funny group therapy bits where Dracula’s assistant seeks help for co-dependency and dealing with his raging narcissist of a boss falls flat. The ideas all sound so good on paper, but are poorly executed across the board. That’s why the movie feels so underwhelming.\r\n\r\nCage is by far the best part of this mess, and he is an actor who is born to play Dracula. He hams it up in every scene, and his unhinged take is genuinely scary but also goofy. His manic line delivery and unhinged inflection of such dialogue gems like “Hail Satan” is absolute bliss.\r\n\r\nThe blood and gore is over-the-top and mostly used in a humorous manner, but this isn’t for the squeamish. There is graphic throat ripping, spurting blood, and abdomens slit open with internal organs visibly spilling out. McKay doesn’t shy away from the violence (and the makeup and effects are really great), which should at least delight horror fans.\r\n\r\nWith such a great idea for story, it’s a bummer that “Renfield” is disappointing in nearly every way imaginable. You’ll find yourself mourning what it could have been.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T05:59:28.773Z"}, {"movie_id": 649609, "review_id": "64548e97d48cee017026af26", "author_rating": 6.0, "review_text": "Its been a while since I've seen Nicolas Cage in a role, I feel, does him justice. Renfield gives Cage the opportunity to shine. \r\n\r\nHis comedic take on Dracula combined with the \"very English\" performance, handed in by Nicholas Hoult, makes this film work, in spite of itself. \r\n\r\nThe comedic premise behind Renfield is highly original, I'd even say, quite clever. Whats not so intelligent, however, is the handling. \r\n\r\nThe potential for comedic flair and fun is drowned, in good measure, by the over the top, often rather grotesquely visceral, blood soaked, violence. Violence that's on the cusp, of the proverbial, splatter flick. \r\n\r\nIn summary, a moderately watchable film that leaves the compelling feeling, it could have amounted to more, with subtler, less violent, treatment.", "created_at": "2023-05-05T05:05:27.354Z"}, {"movie_id": 649609, "review_id": "6456ec0f6c849200e35c905f", "author_rating": 7.0, "review_text": "Awkwafina should have been on the poster!\r\n=========================================\r\n\r\nNot knowing she was in this, is what probably made me resist watching Renfield right away. She is the most watchable part of the film.\r\n\r\nMaybe because the rest is not a revelation; everything that happens in the movie with Cage and Hoult, is just predictable vampire tropes—the trailer was enough for that.\r\n\r\nAt any moment, it was neither horror, nor comedy. Although, at the very beginning, the recovering Dracula is convincingly threatening; but not once he 'gains full power'.\r\nThe excessive, exploding blood-works would have been funny, if they were selective with it's use. But they end up using it everywhere, even the kills that are meant to invoke fear and sadness. Perhaps it was an attempt at nonsense comedy. But, didn't come across very well.\r\n\r\nBut yes, Awkwafinaaaa!", "created_at": "2023-05-07T00:08:47.836Z"}, {"movie_id": 649609, "review_id": "6463a5590f36550170b3ba29", "author_rating": 4.0, "review_text": "I was not expecting much from Renfield and it pretty much gave me exactly what I was expecting: a mediocre film that was nothing offensive but all too forgettable.\r\n\r\nThe screenplay is really all over the place. There are too many subplots and not enough time spent on the actual draw to the film, Dracula. Awkwafina's subplot was half baked and really did not go anywhere. I felt as though her character could have entirely been written out of the film to spend more time on Renfield and Dracula. The comedy is pretty bad. I do not remember laughing one time during the hour-thirty-minute runtime. There were clear jokes that they were trying to set up, but they just did not land for me.\r\n\r\nPerformances were fine. Nicholas Cage was great as Dracula, but unfortunately did not have enough screen time or material to really make a huge impact on the film. Nicholas Holt was good in his role, but again I do not think he had much to work with. Everyone else gave really average performances. Awkwafina plays literally the same style of character as she did in Shang Chi, and it was fine, but nothing that really blew me away.\r\n\r\nThe direction was pretty poor. So many action scenes had a tremendous amount of shaky cam and some weird motion blur type effect that made it really hard to see what was happening. It was brutal, don't get me wrong, and I loved what they attempted to go for, but it really just landed flat. Coming off from John Wick just a few weeks ago, the action direction was apparently bad. The gore was at an extreme, but for the love of God, why did they choose to use CGI blood? The graphics literally looked like something out of a PS2 Mortal Kombat; absolutely terrible. Which is a shame because that mixed with the poor action direction really took me out of every scene when I should have been locked in having a bloody good time.\r\n\r\nOverall, this film is a misstep in what could have been a fun, campy, cult classic. The jumbled screenplay, poor stunt choreography, and terrible effects really hold this movie back from its true potential. There is nothing truly awful that make this a bad movie, just enough there to make it an extremely average experience.\r\n\r\nScore: 44% ❌\r\nVerdict: Poor", "created_at": "2023-05-16T15:46:33.601Z"}, {"movie_id": 649609, "review_id": "643cf44b8ec4ab0446af68e5", "author_rating": 6.0, "review_text": "Nicholas Hoult is the eponymous vampire \"familial\" whose job it is, is to cater for the needs of his toothy master (Nicolas Cage) who is distinctly under the weather. He is gradually tiring of the relentlessness of his tasks - especially as procuring food for his boss is becoming more and more difficult; as well having to rely on his own unsavoury diet of bugs - they give him super strength for a few moments. Meantime, the ballsy police officer \"Quincy\" (Awkwafina) is trying to finally nail \"Teddy Lobo\" (Ben Schwartz) whose mother \"Bella\" (Shohreh Aghdashloo) heads up the city's most ruthless gang of drug dealing hoods and who has bribed just about every city official. Serendipity takes an hand when \"Renfield\" comes across this officer in a diner and after a lively altercation the two find themselves united in their determination to achieve their goals. To be honest, the story is pretty lightweight and just reminded me of an episode of \"Buffy\". What makes this a bit more fun is the two characterisations. Hoult joins in. He is clearly having fun with his insects and his acrobatics. Cage is also up for the task at hand. He is super-hammy and at times reminded me more of Sir Anthony Hopkin's \"Hannibal Lecter\" than of anything Christopher Lee ever did. I saw this on my own in a cinema last night which was a bid sad - it's not a great film, but it is still a mildly amusing mickey-take of this genre (and of what passes for film-noir nowadays) and though instantly forgettable, is still a well produced and enjoyable enough gore-fest.", "created_at": "2023-04-17T07:24:59.650Z"}, {"movie_id": 649609, "review_id": "643f13eb37b3a902fb42a8e5", "author_rating": 6.0, "review_text": "_Renfield_ is an okay horror comedy. It has a ton of potential with its excessive amount of blood and Nicolas Cage is worth the price of admission alone. The action sequences have all of their entertainment value sucked away by the end of the film; mostly because they all feel so similar. The humor and story reach a brick wall that the filmmakers refuse to stop pounding your face into.\r\n\r\n_Renfield_ is like the junk food version of a horror comedy. It has all the right ingredients for something that should be fantastic, but its recipe for action, comedy, and satisfying storytelling is imbalanced to the point of near disgust.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/04/18/renfield-review-bite-suck-not-laugh-repeat/", "created_at": "2023-04-18T22:04:27.502Z"}, {"movie_id": 649609, "review_id": "644052ab04863802fb115ff3", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ www.firstshowing.net/2023/review-chris-mckays-renfield-is-precisely-what-its-expected-to-be/\r\n\r\n\"Renfield is yet another movie that provides precisely what it promises - with an unbelievably ridiculous, purposefully silly story about the toxic relationship between Dracula and Renfield, expectedly elevated by the \"OTT King\" Nicolas Cage and an up-to-the-challenge Nicholas Hoult. The light, humorous environment leaves space for action sequences that are also intentionally excessive in all technical elements, which makes the entertainment levels inconsistent due to the continuous blend of quick cuts and outrageous amounts of blood. The dedication of the stunt team deserved better and much more screen time. Still, if you're a Cage fan, you won't be disappointed.\"\r\n\r\nRating: B-", "created_at": "2023-04-19T20:44:28.005Z"}, {"movie_id": 649609, "review_id": "644409c9cee2f6049f36bd9f", "author_rating": null, "review_text": "Over the decades countless movies, plays, books, comics, video games, and\r\n\r\ntelevision shows have depicted Vampires in various mythos which often\r\ninclude differences in behaviors, abilities, and, motivations. While there have been many Vampires, none have ever achieved the fabled\r\nstatus of Dracula who has been the template ever since Stokers’s book and\r\nthe classic original film as well as subsequent appearances. In the new film “Renfield” audiences are introduced to Renfield (Nicholas Holt), who recounts his past as an ambitious lawyer who ended up serving\r\nDracula (Nicolas Cage) as a Familiar when his original intention was to\r\nclose a real estate deal. After his Master is injured after another attempt by Vampire Hunters,\r\nRenfield relocates Dracula to New Orleans and looks to find suitable prey\r\nto help his master return to full power.\r\n\r\n This in turn leads Renfield to a self-help group as he plans to help the\r\npoor souls there by using their tormentors as prey for his boss which he\r\nhopes will in some way eliminate the burden that has built over the\r\ndecades from his servitude. This plan goes horribly wrong when he attempts to subdue an abusive\r\nindividual and his group lands Renfield on the radar as not only an eager\r\na police officer named Rebecca ( Awkwafina), and a drug lord named Edward\r\n(Ben Schwartz). Mixing humor, action, and gore aplenty, Renfield must also deal with his\r\nrising self-help motivations as he looks to stand up to his boss once and\r\nfor all and have his needs heard and respected which naturally does not\r\nsit Weill with Dracula.\r\n\r\nWhat follows is an amusing, chaotic, and gory adventure that while at\r\ntimes inconsistent and meandering with the story; still finds enough ways\r\nto entertain.\r\n\r\nCage hams it up to new levels in his portrayal of Dracula and he is\r\nliterally chewing the scenery in every scene in which he is featured and\r\nit is one of his most enjoyable performances in recent years.\r\n\r\nHoult, Awkfwafina, and the supporting cast work well, and while the film\r\ndoes get more than a bit loose with the story and gaps in logic even for a\r\nfilm of this type it still manages to work. Dracula talks of a big plan\r\nfor world domination but we get little more than lip service which would\r\nhave helped to make this version of Dracula a more defined character.\r\n\r\nThe focus is more on comedic action than horror and it is clear that the\r\nthe cast seemed to be having a great time with their roles so as long as you\r\nare willing to overlook issues with the plot; you may find “Renfield” one\r\nof the more enjoyable comedic outings of the year.\r\n\r\n3.5 stars out of 5", "created_at": "2023-04-22T16:22:33.216Z"}, {"movie_id": 649609, "review_id": "6444c940651fcf04889d9ef5", "author_rating": 4.0, "review_text": "If not for a trademark over-the-top Nicolas Cage performance and a truly inspired fight scene in an apartment complex, “Renfield” would be a total disaster of a movie. It’s certainly not any good and I wouldn’t recommend it to anyone, and the real horror of it all is the way director Chris McKay blows what should have been a slam-dunk premise.\r\n\r\nSet in present day, Renfield (Nicholas Hoult) is the tortured, loyal assistant to Dracula (Cage). He’s served his master for decades, taking care of everything from getting his cape dry cleaned to procuring fresh prey for dinner. After centuries of servitude, Renfield is finally ready to move on and create a life of his own.\r\n\r\nAlthough it is mostly dead in the water, the film’s pacing never feels slow. There’s plenty of entertainment, it’s just not fun enough, outrageous enough, nor twisted enough. The tone is both tongue-in-cheek and sincere, which is not cohesive as a whole. There’s a lot of action that means nothing, and characters like Awkwafina‘s police officer that are bland and forgettable.\r\n\r\nThe side plots about a crime family with a ruthless boss (Shohreh Aghdashloo) and her son (Ben Schwartz) that wants Renfield dead is half-baked, and the funny group therapy bits where Dracula’s assistant seeks help for co-dependency and dealing with his raging narcissist of a boss falls flat. The ideas all sound so good on paper, but are poorly executed across the board. That’s why the movie feels so underwhelming.\r\n\r\nCage is by far the best part of this mess, and he is an actor who is born to play Dracula. He hams it up in every scene, and his unhinged take is genuinely scary but also goofy. His manic line delivery and unhinged inflection of such dialogue gems like “Hail Satan” is absolute bliss.\r\n\r\nThe blood and gore is over-the-top and mostly used in a humorous manner, but this isn’t for the squeamish. There is graphic throat ripping, spurting blood, and abdomens slit open with internal organs visibly spilling out. McKay doesn’t shy away from the violence (and the makeup and effects are really great), which should at least delight horror fans.\r\n\r\nWith such a great idea for story, it’s a bummer that “Renfield” is disappointing in nearly every way imaginable. You’ll find yourself mourning what it could have been.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T05:59:28.773Z"}, {"movie_id": 649609, "review_id": "64548e97d48cee017026af26", "author_rating": 6.0, "review_text": "Its been a while since I've seen Nicolas Cage in a role, I feel, does him justice. Renfield gives Cage the opportunity to shine. \r\n\r\nHis comedic take on Dracula combined with the \"very English\" performance, handed in by Nicholas Hoult, makes this film work, in spite of itself. \r\n\r\nThe comedic premise behind Renfield is highly original, I'd even say, quite clever. Whats not so intelligent, however, is the handling. \r\n\r\nThe potential for comedic flair and fun is drowned, in good measure, by the over the top, often rather grotesquely visceral, blood soaked, violence. Violence that's on the cusp, of the proverbial, splatter flick. \r\n\r\nIn summary, a moderately watchable film that leaves the compelling feeling, it could have amounted to more, with subtler, less violent, treatment.", "created_at": "2023-05-05T05:05:27.354Z"}, {"movie_id": 649609, "review_id": "6456ec0f6c849200e35c905f", "author_rating": 7.0, "review_text": "Awkwafina should have been on the poster!\r\n=========================================\r\n\r\nNot knowing she was in this, is what probably made me resist watching Renfield right away. She is the most watchable part of the film.\r\n\r\nMaybe because the rest is not a revelation; everything that happens in the movie with Cage and Hoult, is just predictable vampire tropes—the trailer was enough for that.\r\n\r\nAt any moment, it was neither horror, nor comedy. Although, at the very beginning, the recovering Dracula is convincingly threatening; but not once he 'gains full power'.\r\nThe excessive, exploding blood-works would have been funny, if they were selective with it's use. But they end up using it everywhere, even the kills that are meant to invoke fear and sadness. Perhaps it was an attempt at nonsense comedy. But, didn't come across very well.\r\n\r\nBut yes, Awkwafinaaaa!", "created_at": "2023-05-07T00:08:47.836Z"}, {"movie_id": 649609, "review_id": "6463a5590f36550170b3ba29", "author_rating": 4.0, "review_text": "I was not expecting much from Renfield and it pretty much gave me exactly what I was expecting: a mediocre film that was nothing offensive but all too forgettable.\r\n\r\nThe screenplay is really all over the place. There are too many subplots and not enough time spent on the actual draw to the film, Dracula. Awkwafina's subplot was half baked and really did not go anywhere. I felt as though her character could have entirely been written out of the film to spend more time on Renfield and Dracula. The comedy is pretty bad. I do not remember laughing one time during the hour-thirty-minute runtime. There were clear jokes that they were trying to set up, but they just did not land for me.\r\n\r\nPerformances were fine. Nicholas Cage was great as Dracula, but unfortunately did not have enough screen time or material to really make a huge impact on the film. Nicholas Holt was good in his role, but again I do not think he had much to work with. Everyone else gave really average performances. Awkwafina plays literally the same style of character as she did in Shang Chi, and it was fine, but nothing that really blew me away.\r\n\r\nThe direction was pretty poor. So many action scenes had a tremendous amount of shaky cam and some weird motion blur type effect that made it really hard to see what was happening. It was brutal, don't get me wrong, and I loved what they attempted to go for, but it really just landed flat. Coming off from John Wick just a few weeks ago, the action direction was apparently bad. The gore was at an extreme, but for the love of God, why did they choose to use CGI blood? The graphics literally looked like something out of a PS2 Mortal Kombat; absolutely terrible. Which is a shame because that mixed with the poor action direction really took me out of every scene when I should have been locked in having a bloody good time.\r\n\r\nOverall, this film is a misstep in what could have been a fun, campy, cult classic. The jumbled screenplay, poor stunt choreography, and terrible effects really hold this movie back from its true potential. There is nothing truly awful that make this a bad movie, just enough there to make it an extremely average experience.\r\n\r\nScore: 44% ❌\r\nVerdict: Poor", "created_at": "2023-05-16T15:46:33.601Z"}, {"movie_id": 649609, "review_id": "643cf44b8ec4ab0446af68e5", "author_rating": 6.0, "review_text": "Nicholas Hoult is the eponymous vampire \"familial\" whose job it is, is to cater for the needs of his toothy master (Nicolas Cage) who is distinctly under the weather. He is gradually tiring of the relentlessness of his tasks - especially as procuring food for his boss is becoming more and more difficult; as well having to rely on his own unsavoury diet of bugs - they give him super strength for a few moments. Meantime, the ballsy police officer \"Quincy\" (Awkwafina) is trying to finally nail \"Teddy Lobo\" (Ben Schwartz) whose mother \"Bella\" (Shohreh Aghdashloo) heads up the city's most ruthless gang of drug dealing hoods and who has bribed just about every city official. Serendipity takes an hand when \"Renfield\" comes across this officer in a diner and after a lively altercation the two find themselves united in their determination to achieve their goals. To be honest, the story is pretty lightweight and just reminded me of an episode of \"Buffy\". What makes this a bit more fun is the two characterisations. Hoult joins in. He is clearly having fun with his insects and his acrobatics. Cage is also up for the task at hand. He is super-hammy and at times reminded me more of Sir Anthony Hopkin's \"Hannibal Lecter\" than of anything Christopher Lee ever did. I saw this on my own in a cinema last night which was a bid sad - it's not a great film, but it is still a mildly amusing mickey-take of this genre (and of what passes for film-noir nowadays) and though instantly forgettable, is still a well produced and enjoyable enough gore-fest.", "created_at": "2023-04-17T07:24:59.650Z"}, {"movie_id": 649609, "review_id": "643f13eb37b3a902fb42a8e5", "author_rating": 6.0, "review_text": "_Renfield_ is an okay horror comedy. It has a ton of potential with its excessive amount of blood and Nicolas Cage is worth the price of admission alone. The action sequences have all of their entertainment value sucked away by the end of the film; mostly because they all feel so similar. The humor and story reach a brick wall that the filmmakers refuse to stop pounding your face into.\r\n\r\n_Renfield_ is like the junk food version of a horror comedy. It has all the right ingredients for something that should be fantastic, but its recipe for action, comedy, and satisfying storytelling is imbalanced to the point of near disgust.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/04/18/renfield-review-bite-suck-not-laugh-repeat/", "created_at": "2023-04-18T22:04:27.502Z"}, {"movie_id": 649609, "review_id": "644052ab04863802fb115ff3", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ www.firstshowing.net/2023/review-chris-mckays-renfield-is-precisely-what-its-expected-to-be/\r\n\r\n\"Renfield is yet another movie that provides precisely what it promises - with an unbelievably ridiculous, purposefully silly story about the toxic relationship between Dracula and Renfield, expectedly elevated by the \"OTT King\" Nicolas Cage and an up-to-the-challenge Nicholas Hoult. The light, humorous environment leaves space for action sequences that are also intentionally excessive in all technical elements, which makes the entertainment levels inconsistent due to the continuous blend of quick cuts and outrageous amounts of blood. The dedication of the stunt team deserved better and much more screen time. Still, if you're a Cage fan, you won't be disappointed.\"\r\n\r\nRating: B-", "created_at": "2023-04-19T20:44:28.005Z"}, {"movie_id": 649609, "review_id": "644409c9cee2f6049f36bd9f", "author_rating": null, "review_text": "Over the decades countless movies, plays, books, comics, video games, and\r\n\r\ntelevision shows have depicted Vampires in various mythos which often\r\ninclude differences in behaviors, abilities, and, motivations. While there have been many Vampires, none have ever achieved the fabled\r\nstatus of Dracula who has been the template ever since Stokers’s book and\r\nthe classic original film as well as subsequent appearances. In the new film “Renfield” audiences are introduced to Renfield (Nicholas Holt), who recounts his past as an ambitious lawyer who ended up serving\r\nDracula (Nicolas Cage) as a Familiar when his original intention was to\r\nclose a real estate deal. After his Master is injured after another attempt by Vampire Hunters,\r\nRenfield relocates Dracula to New Orleans and looks to find suitable prey\r\nto help his master return to full power.\r\n\r\n This in turn leads Renfield to a self-help group as he plans to help the\r\npoor souls there by using their tormentors as prey for his boss which he\r\nhopes will in some way eliminate the burden that has built over the\r\ndecades from his servitude. This plan goes horribly wrong when he attempts to subdue an abusive\r\nindividual and his group lands Renfield on the radar as not only an eager\r\na police officer named Rebecca ( Awkwafina), and a drug lord named Edward\r\n(Ben Schwartz). Mixing humor, action, and gore aplenty, Renfield must also deal with his\r\nrising self-help motivations as he looks to stand up to his boss once and\r\nfor all and have his needs heard and respected which naturally does not\r\nsit Weill with Dracula.\r\n\r\nWhat follows is an amusing, chaotic, and gory adventure that while at\r\ntimes inconsistent and meandering with the story; still finds enough ways\r\nto entertain.\r\n\r\nCage hams it up to new levels in his portrayal of Dracula and he is\r\nliterally chewing the scenery in every scene in which he is featured and\r\nit is one of his most enjoyable performances in recent years.\r\n\r\nHoult, Awkfwafina, and the supporting cast work well, and while the film\r\ndoes get more than a bit loose with the story and gaps in logic even for a\r\nfilm of this type it still manages to work. Dracula talks of a big plan\r\nfor world domination but we get little more than lip service which would\r\nhave helped to make this version of Dracula a more defined character.\r\n\r\nThe focus is more on comedic action than horror and it is clear that the\r\nthe cast seemed to be having a great time with their roles so as long as you\r\nare willing to overlook issues with the plot; you may find “Renfield” one\r\nof the more enjoyable comedic outings of the year.\r\n\r\n3.5 stars out of 5", "created_at": "2023-04-22T16:22:33.216Z"}, {"movie_id": 649609, "review_id": "6444c940651fcf04889d9ef5", "author_rating": 4.0, "review_text": "If not for a trademark over-the-top Nicolas Cage performance and a truly inspired fight scene in an apartment complex, “Renfield” would be a total disaster of a movie. It’s certainly not any good and I wouldn’t recommend it to anyone, and the real horror of it all is the way director Chris McKay blows what should have been a slam-dunk premise.\r\n\r\nSet in present day, Renfield (Nicholas Hoult) is the tortured, loyal assistant to Dracula (Cage). He’s served his master for decades, taking care of everything from getting his cape dry cleaned to procuring fresh prey for dinner. After centuries of servitude, Renfield is finally ready to move on and create a life of his own.\r\n\r\nAlthough it is mostly dead in the water, the film’s pacing never feels slow. There’s plenty of entertainment, it’s just not fun enough, outrageous enough, nor twisted enough. The tone is both tongue-in-cheek and sincere, which is not cohesive as a whole. There’s a lot of action that means nothing, and characters like Awkwafina‘s police officer that are bland and forgettable.\r\n\r\nThe side plots about a crime family with a ruthless boss (Shohreh Aghdashloo) and her son (Ben Schwartz) that wants Renfield dead is half-baked, and the funny group therapy bits where Dracula’s assistant seeks help for co-dependency and dealing with his raging narcissist of a boss falls flat. The ideas all sound so good on paper, but are poorly executed across the board. That’s why the movie feels so underwhelming.\r\n\r\nCage is by far the best part of this mess, and he is an actor who is born to play Dracula. He hams it up in every scene, and his unhinged take is genuinely scary but also goofy. His manic line delivery and unhinged inflection of such dialogue gems like “Hail Satan” is absolute bliss.\r\n\r\nThe blood and gore is over-the-top and mostly used in a humorous manner, but this isn’t for the squeamish. There is graphic throat ripping, spurting blood, and abdomens slit open with internal organs visibly spilling out. McKay doesn’t shy away from the violence (and the makeup and effects are really great), which should at least delight horror fans.\r\n\r\nWith such a great idea for story, it’s a bummer that “Renfield” is disappointing in nearly every way imaginable. You’ll find yourself mourning what it could have been.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T05:59:28.773Z"}, {"movie_id": 649609, "review_id": "64548e97d48cee017026af26", "author_rating": 6.0, "review_text": "Its been a while since I've seen Nicolas Cage in a role, I feel, does him justice. Renfield gives Cage the opportunity to shine. \r\n\r\nHis comedic take on Dracula combined with the \"very English\" performance, handed in by Nicholas Hoult, makes this film work, in spite of itself. \r\n\r\nThe comedic premise behind Renfield is highly original, I'd even say, quite clever. Whats not so intelligent, however, is the handling. \r\n\r\nThe potential for comedic flair and fun is drowned, in good measure, by the over the top, often rather grotesquely visceral, blood soaked, violence. Violence that's on the cusp, of the proverbial, splatter flick. \r\n\r\nIn summary, a moderately watchable film that leaves the compelling feeling, it could have amounted to more, with subtler, less violent, treatment.", "created_at": "2023-05-05T05:05:27.354Z"}, {"movie_id": 649609, "review_id": "6456ec0f6c849200e35c905f", "author_rating": 7.0, "review_text": "Awkwafina should have been on the poster!\r\n=========================================\r\n\r\nNot knowing she was in this, is what probably made me resist watching Renfield right away. She is the most watchable part of the film.\r\n\r\nMaybe because the rest is not a revelation; everything that happens in the movie with Cage and Hoult, is just predictable vampire tropes—the trailer was enough for that.\r\n\r\nAt any moment, it was neither horror, nor comedy. Although, at the very beginning, the recovering Dracula is convincingly threatening; but not once he 'gains full power'.\r\nThe excessive, exploding blood-works would have been funny, if they were selective with it's use. But they end up using it everywhere, even the kills that are meant to invoke fear and sadness. Perhaps it was an attempt at nonsense comedy. But, didn't come across very well.\r\n\r\nBut yes, Awkwafinaaaa!", "created_at": "2023-05-07T00:08:47.836Z"}, {"movie_id": 649609, "review_id": "6463a5590f36550170b3ba29", "author_rating": 4.0, "review_text": "I was not expecting much from Renfield and it pretty much gave me exactly what I was expecting: a mediocre film that was nothing offensive but all too forgettable.\r\n\r\nThe screenplay is really all over the place. There are too many subplots and not enough time spent on the actual draw to the film, Dracula. Awkwafina's subplot was half baked and really did not go anywhere. I felt as though her character could have entirely been written out of the film to spend more time on Renfield and Dracula. The comedy is pretty bad. I do not remember laughing one time during the hour-thirty-minute runtime. There were clear jokes that they were trying to set up, but they just did not land for me.\r\n\r\nPerformances were fine. Nicholas Cage was great as Dracula, but unfortunately did not have enough screen time or material to really make a huge impact on the film. Nicholas Holt was good in his role, but again I do not think he had much to work with. Everyone else gave really average performances. Awkwafina plays literally the same style of character as she did in Shang Chi, and it was fine, but nothing that really blew me away.\r\n\r\nThe direction was pretty poor. So many action scenes had a tremendous amount of shaky cam and some weird motion blur type effect that made it really hard to see what was happening. It was brutal, don't get me wrong, and I loved what they attempted to go for, but it really just landed flat. Coming off from John Wick just a few weeks ago, the action direction was apparently bad. The gore was at an extreme, but for the love of God, why did they choose to use CGI blood? The graphics literally looked like something out of a PS2 Mortal Kombat; absolutely terrible. Which is a shame because that mixed with the poor action direction really took me out of every scene when I should have been locked in having a bloody good time.\r\n\r\nOverall, this film is a misstep in what could have been a fun, campy, cult classic. The jumbled screenplay, poor stunt choreography, and terrible effects really hold this movie back from its true potential. There is nothing truly awful that make this a bad movie, just enough there to make it an extremely average experience.\r\n\r\nScore: 44% ❌\r\nVerdict: Poor", "created_at": "2023-05-16T15:46:33.601Z"}]