[{"movie_id": 482712, "review_id": "5cd8a4790e0a263868ccca95", "author_rating": 5.0, "review_text": "**_Very poorly structured_**\r\n\r\n> _I had a discussion with my director of photography, Eric Gautier, before the shoot: you have to start by filming the appearances of reality to attempt to attain a state of grace, film the weight of bodies to reveal the soul. It's also why I needed to have contact with something of the chaos of the modern world to finish my film. I wanted to explore the intimate side of the topic in a wider context. I went to film in the biggest refugee camp in the Middle East on the Syrian border. This historic tragedy makes us question what we are, our values, our history, a__nd what we are prepared to do to extend a helping hand to them._\r\n\r\n- Xavier Giannoli; _L'Apparition_ Production Notes\r\n\r\n_L'Apparition_ [_The Apparition_] is a film with many of the prerequisite ingredients to produce a fine piece of work, not the least of which is an intriguing set-up with a built-in opportunity for weighty social and/or ecclesiastical commentary. However, whilst the idea is sound, the execution is poor, and due to some very basic missteps, the narrative's potential profundity is rendered singularly uninteresting.\r\n\r\nWritten and directed by Xavier Giannoli (_Marguerite_), with Marcia Romano (_Sous le Sable_; _Marguerite_) and Jacques Fieschi (_Un Cœur en hiver_; _Yves Saint Laurent_; _Mal de pierres_) credited with \"collaboration\", the hook does a fine job of drawing the audience in. Jacques Mayano (Vincent Lindon) is a French photographer just returned from an unspecified war zone where his colleague was killed in a bomb blast. As a result of the explosion, Mayano is having aural problems and suffering from PTSD. Upon returning to France, he quickly becomes directionless, until he is contacted by the Congregation for the Causes of Saints – the body within the Vatican which investigates claims of miracles, with an eye towards possible canonisation. Mayano is told that a young girl named Anna (Galatéa Bellugi) claims to have seen a Marian apparition in a field just outside a small village. However, frustrated with the Vatican asking questions, as well as their scepticism regarding the validity of Anna's claim, the local parish priest, Fr. Borrodine (Patrick d'Assumçao), has cut off contact with the Church hierarchy, and is using a not-unwilling Anna to entice pilgrimages to the area, subsequently encouraging the devout to purchase items in a spectacularly tacky gift store. In an attempt to ascertain the merit, or lack thereof, of Anna's vision, the Congregation want Mayano to head an investigative team.\r\n\r\nSo far so good. It's a fine _raison d'être_, and the first act is excellent, depicting Mayano learning the Congregation's inner workings, spending time in the Vatican Apostolic Library reviewing documents detailing both valid and invalid (as decreed by the Congregation) instances of miracles, travelling to the village, and meeting his team (a combination of secular and laity). However, once the investigation proper begins, the bottom falls out, as Giannoli seems to have no idea where to take the story.\r\n\r\nFor a start, the film is far, far too long; clocking in at 144 minutes, it could easily have lost a half-hour without compromising the central narrative drive at all. In fact, the whole thing felt like a workprint; far too much fat on its bones, so much wasted motion, and no editing rhythm within individual scenes, many of which continue for several beats after they have come to what should be their natural conclusion. In tandem with this, there are so many half-developed subplots which never integrate with the main narrative - Mayano's PTSD and hearing problems, orphans, a children's home, adoption, mysterious letters, a missing girl, possible profiteering from Anna's visions. Additionally, with so much going on at a plot level, both Mayano and Anna are extremely under-written, with virtually no character development between them; Mayano is essentially an archetypal \"atheist photographer,\" and Anna is very much a cipher.\r\n\r\nHowever, the biggest problem is that the film simply can't make up its mind as to what it wants to be - an examination of canonical doctrine or a standard mystery. And because of this pseudo-schizophrenic quality, the plot is shaky at best, with the superficial far outweighing the substance. Related to this, the film concludes with a wholly unnecessary and poorly conceived twist that plays out as relatively unrelated to what we've just spent the last two hours watching, focusing as it does on a character we haven't met up to the penultimate scene.\r\n\r\nAnother problem, given the inherently evocative nature of the subject matter, is that Giannoli misses a perfect opportunity for critique. You'd expect that a contemporary film dealing with what is increasingly looked upon as arcane dogma would engage in some way with the issues that that dogma throws up; the nature of apparitions in both a contemporary and a historical sense; the Church's attitude to instances where they were unable to debunk the claimant; their attitude to cases where they were able to prove a hoax; the process of investigating an apparition, and the Congregation's prerequisites for approving canonisation; their tendency to mix the ordained with the professional on the investigative teams, such as historians, psychologists, and scientists. None of these issues are explored in any way, as the film sets up an intriguing providential-based framework, but then fails to introduce the scrutiny with which to analyse the surrounding themes. Essentially, the film says nothing of interest about anything.\r\n\r\nFor his part, however, Giannoli certainly seems to think it does. In the film's EPK, he says of Mayano,\r\n\r\n> _he has come across a world in which proof counts for nothing and the invisible world keeps its secrets._\r\n\r\nAnd this is essentially where the problem lies; the twist simply doesn't integrate with the rest of the film, and ends up working against the presentation of faith, diluting Giannoli's thematic concerns to the point where it's difficult to tell what he is trying to say. If the film is truly about the invisible world keeping its secrets, why does he feel the need to introduce a twist which thoroughly explains all of those secrets? Similarly, of the Congregation's work, Giannoli states,\r\n\r\n> _one should not imagine that the Church hopes for and encourages the authentication of apparitions. On the contrary, I think they are a hindrance to them. Faith doesn't need proof or it's no longer faith._\r\n\r\nHowever, the film is literally about an attempt to find that proof, and once again, the twist compromises the apparent intention. Giannoli also refers to the film as\r\n\r\n> _a thorough documentary investigation into the supposed proof of the existence of God._\r\n\r\nThere's no evidence of this at all in the finished product, where perhaps some kind of engagement with the issues thrown up by, for example, agnosticism or noetics might have been interesting.\r\n\r\nAnd for evidence that films dealing with this kind of deeply esoteric/metaphysical subject matter can work, one need only compare _L'Apparition_ with films such as Jessica Hausner's _Lourdes_ (2009) or Dietrich Brüggemann's _Kreuzweg_ (2014). In _Lourdes_, a woman (Sylvie Testud) confined to a wheelchair makes a pilgrimage to the Sanctuary of Our Lady of Lourdes, hoping to regain the use of her legs, and in the process engages with issues such as the Church as a profit-centred business, the nature of divine healing, and the role of vehement scepticism contrasted with that of blind faith. _Kreuzweg_ tells the story of Maria (Lea van Acken), a fourteen-year-old girl from a fanatical Catholic family, whose only desire in life is to become a saint. With this in mind, she sets about replicating Jesus's path in Golgotha through the fourteen Stations. The film engages with a myriad of conundrums and challenges; an indictment of religious fundamentalism, the nature and power of obsessive faith, the likelihood or unlikelihood of genuine miracles, the place of divinity in the modern world, the Church's attitude to suffering, and the validity of secular interference in ecclesiastical matters. _L'Apparition_ gets nowhere near this level of analysis. Instead, it's two hours plus of serious people acting seriously, but not actually saying anything of note about anything, capped off with as ill-advised a twist as you're likely to see all year.", "created_at": "2019-05-12T22:55:53.422Z"}]