[{"movie_id": 2080, "review_id": "53f11ceec3a3685add002fbc", "author_rating": 3.0, "review_text": "Baaaad ... oh, baaaaaad.\r\n\r\nHugh Jackman is always great as the Wolverine but this story doesn't have any sense nor excuse.", "created_at": "2014-08-17T21:21:50.379Z"}, {"movie_id": 2080, "review_id": "5c842909c3a36839d4d28726", "author_rating": 3.0, "review_text": "I watched this film and felt like they shot it without an actual script, filming whatever came to mind. And what do you know, I found out later that they really didn't have a script to follow.\r\n\r\nMakes sense now why many scenes feel rushed or incomplete, most of the effects look half rendered, and \"Deadpool\" looked like an absolute disaster.\r\n\r\nAnd yet, oddly enough, it's not the worse film in the X-Men franchise. It just sets the bar exceedingly low.", "created_at": "2019-03-09T20:58:49.142Z"}, {"movie_id": 2080, "review_id": "60a70f60c2bcc6005635e71d", "author_rating": 7.0, "review_text": "Just about passable.\r\n\r\nI never felt bored while watching <em>'X-Men Origins: Wolverine'</em>, which is why I can't give it a lower rating. The action is well done and it gives the satisfactory amount of enjoyment, shame the CGI isn't quite up to scratch though. As with the preceding three <em>'X-Men'</em> releases, I really do enjoy watching Hugh Jackman as Wolverine - he is certainly the best thing about these films.\r\n\r\nWith all that noted, the film does definitely have issues. I didn't overly like the new characters and the plot didn't truly fulfil what I was expecting/wanting from an origin story, even if it is fairly fun to watch. Elsewhere, Ryan Reynolds is introduced as his well known character, I look forward to seeing more of him in the role - here, he's fine.\r\n\r\nFour films in and there's a slow decline ongoing, hopefully <em>'X-Men: First Class'</em>* at least regains footing with the opening two productions. <em>*I'm watching these in release order.</em>\r\n\r\n/copied directly from my Letterboxd review\\", "created_at": "2021-05-21T01:39:44.481Z"}, {"movie_id": 2080, "review_id": "638b98517390c000872f0b43", "author_rating": 6.0, "review_text": "I have always struggled to engage with the \"X-Men\" franchise, but had higher hopes that this - featuring the most charismatic of them - might change that. Sadly not! \"Logan\" (Hugh Jackman) has a healthy rivalry with his brother \"Creed\" (Liev Schreiber) honed after their birth in the middle of the 19th century. Many years later, though, and somewhat battle weary, they are offered the opportunity by \"Stryker\" (Danny Huston) to join his elite team of mutant commandos. Disillusioned with this, \"Logan\" drops out and tries to live a normal life with his new found love. \"Stryker\" is having none of this and so after the inevitable tragedy, battle lines are drawn as the angry \"Wolverine\" sets out for revenge. Some of the other \"X-Men\" characters feature as this meanders along, and there are a few very well-made up appearances from Ryan Reynolds (\"Wade Wilson\") but for the most part this a weakly constructed and dreary action drama with an over-reliance on CGI as the combat scenes recycle themselves all too often. Jackman tries hard, and he does impose himself on the story - but there is little sense of jeopardy and the nature of his \"quirk\" ensures that the acton scenes, though frequently at close quarters, are all rather repetitively predictable. The production standards are high, but the rest of this is immediately forgettable. Sorry.", "created_at": "2022-12-03T18:41:21.071Z"}]