[{"movie_id": 257211, "review_id": "56ed0e359251414dba00457b", "author_rating": 7.0, "review_text": "Легкий фильм посмотреть на выходных. Хорошая идея фильма, но банальный и предсказуемый сюжет. Отличная игра актеров.", "created_at": "2016-03-19T08:30:45.413Z"}, {"movie_id": 257211, "review_id": "57c8b50dc3a3685bf8000ba7", "author_rating": 8.0, "review_text": "> A film that differentiates the young and old generation.\r\n\r\nI would definitely say it is the director's best film. I have liked her other films, but this is a lot different from them. I mean it was well written screenplay with much better understood the contemporary world than just focusing on the relationships as usual. So the addition of digital world stuffs made all the difference and I completely enjoyed it. Don't think it would be another 'The Internship' as I initially thought, but slightly it is and much better everyway.\r\n\r\nYou are going to agree with me that the film's posters or the trailers were not very impressive as what the actual film did to grab our full attention. The two hours films are always a concern to me, but when a film like this runs for that long, I can even sit for another half an hour. Anyway, with this story and its runtime, the pace was incredible. When there's something interesting is going on, we forget to focus on the flaws and enjoy our time, which is what I exactly did in here.\r\n\r\nThis is not a comedy where you're going to laugh openly loud, it is a comedy in the sense of the set of characters the film has. I mean, the story is about the digital business and most of them who are into the computers are considered as geeks. So theirs world is nothing, but just hooked to their works and forgetting the actual world around them. Even for the someone in the next room, they tweet. For them to remind only they've changed, not the physical world and that's where our main character who is old and wise influence the younger generation people.\r\n\r\nSo the actors were undoubtedly the best thing apart from the direction and the story. The 73 years old Robert De Niro still impressing with his extraordinary character display. I don't know whoever was in mind when it was written, but this role perfectly fits none other than him. And then there's Anne Hathaway on the opposite side who equaled with De Niro with her part.\r\n\r\nFrom the narration point of view, it started with DeNiro's, but quickly around in the middle it took a circle to cover others as well. And then comes from the professional to the personal life topic when it was developed and brought a small family who were affected by the workaholic mother. So if you enter it expecting a comedy, probably you won't disappoint with what it delivers against your wish which is a heartwarming drama with some emotional moments. Surely recommended, especially the youngsters who're addicted to the digital world!\r\n\r\n8/10", "created_at": "2016-09-01T23:09:01.833Z"}, {"movie_id": 257211, "review_id": "5da7f7c8944a5700152494d4", "author_rating": null, "review_text": "'The Intern' is a comedy/drama movie, which was directed by Nancy Meyers in 2015. The movie takes place in Brooklyn, New-York. The first thing, which attracted me, was the cast – Anne Hathaway and Robert De Niro as the main characters. This duo seemed to me quite curious, so I wanted to find out what the plot is. Another reason why I decided to watch it was the place. A lot of movies and series are made in New-York, and I like when a movie contains breathtaking views of this city. As for me, it makes movies truly esthetic. \r\n\r\n'The Intern' is a story about Ben Wittaker (Robert De Niro), who is 70 years-old. He has a family (son and grandchildren), which live quite far from him, and he’s a widower. He has plenty of time and desire to do something new. Ben finds a vacancy in online-store of women’s clothes. There he becomes an intern, and his duty is to help Jules Ostin (Anne Hathaway), a young woman who runs this business. I think, the most fascinating thing about the plot is relationship between Jules and Ben. She’s young and not experienced, he’s wise and he has rich background in business. No matter, they have a huge age gap, they become good friends. Ben supports Jules, not only when it's about work, but in her private life. Jules's family is about to fall apart, and she thinks, if she hires a new director, her family will be fine again. It's a choice between her work, which is extremely important for her, and her family. What should she do? Can this decision save her relationship with her husband? It's a tough decision, but with Ben's help she makes a right one. \r\n\r\n‘Experience never gets old’. This is the general idea of the movie. I guess, it means that experience's always needed, it's always modern and it's always useful, no matter, what sort of experience it is. I love this idea and this movie in a whole. It's so kind and also dramatic. Acting makes you laugh, cry and then laugh again. Especially the very last scene makes you feel so calm and peaceful, and that'll be your emotions after watching the whole movie. I've seen 'The Intern' about 6 times, and every time characters make me relive these feelings.\r\n\r\n I think, if you want to watch something easy, warm and heartfelt, you should certainly watch this movie. 'One of my favorite movies this last year was Nancy Meyers’ The Intern. They’re not considering that for the Oscars even though I think Robert De Niro gave one of the best performances this year in that movie. I thought the script was actually one of her best', said Quentin Tarantino and added that it's Oscar-worthy.", "created_at": "2019-10-17T05:10:32.953Z"}, {"movie_id": 257211, "review_id": "6396328b8a88b20082dba8f4", "author_rating": 9.0, "review_text": "Well overall a nice feel-good movie. It one of those movies that you spin up and just sit back and relax. The characters are quirky and fun. Plus the plot is simply great. Had been putting it on hold for quite a long time but glad I watched it.", "created_at": "2022-12-11T19:42:03.105Z"}]