[{"movie_id": 508442, "review_id": "5fd7e15d1f3e60003db13090", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nOut of my Top15: Most Anticipated Movies of 2020, eight were removed from this year's schedule due to the current global pandemic, so I didn't have that many films for which I felt incredibly excited. I love pretty much everything that Pixar puts out, and at the start of 2020, I noticed that the studio was releasing not one but two original animated movies, something quite uncommon in their history (only happened in 2015 and 2017). Onward was yet another success, but everyone knew Soul was the studio's big gun. December release date means better chances to win an Oscar, and the highly anticipated return of Pete Docter (Monsters Inc., Up, Inside Out) to the director and writer's chairs also elevates the film's expectations.\r\n\r\nI'm no different. My expectations were high as the sky, but the main question in my mind wasn't really if Soul was going to be a great movie, but if it would be so good I'd love it more than Wolfwalkers, my favorite animated flick of the year so far? Well, let me write that it's a wonderful, beautiful, heartwarming tie. I love them both very much, and I wouldn't be surprised if I saw them in my Top10. However, this is Soul's spotlight, so let me get to it, and spit out the only minor issue I have with the film. During the first act, I couldn't feel a connection to the story nor the characters. It took me a while to really get fully invested in the narrative, and even technical aspects such as the animation style and the score (Trent Reznor, Atticus Ross) felt weirdly out-of-place and surprisingly not that enthralling.\r\n\r\nNevertheless, this slow, unconvincing beginning doesn't negatively impact the movie overall, as most of these apparently awkward components improve as time goes by. From the moment it clicked with me, I went on that emotional rollercoaster I always expect to ride in a Pixar feature. The studio is known for its extremely heartfelt, shocking, tear-inducing third acts, and even though Soul isn't an exception to that rule, it's far from being one of those mind-blowing, jaw-dropping, devastating final minutes. Its third act is astonishingly emotional, and it sends a lovely message to the audience, one that made me reflect on the entire year and a specific moment in my life.\r\n\r\nPete Docter, Mike Jones, and Kemp Powers explore the taboo subject of life's meaning in a predictable yet profound and entertaining manner. The approach on philosophical questions like \"what's my purpose?\", \"what's my spark?\", or \"what does it mean to have a soul?\" is cleverly developed and very well-written. There's a sequence with the protagonist near the end that will make tons of viewers experience it simultaneously. I found myself rewatching this scene in particular to help me remember a certain period in my life where I realized that what I thought was my destiny was, in fact, just one of those life passions that leave us with unforgettable memories.\r\n\r\nI was able to deal with that moment pretty well, but many people lose themselves once they figure out that what they thought they were meant to do/be isn't really what the future holds for them. They become lost souls, and only a spark of life can revitalize them. Soul explores this matter in such an authentic, genuine, creative way that I couldn't help but cry as I do in every Pixar film. Watching Soul will make you appreciate life a lot more, especially those tiny, little moments that we forget to remember. Living, with all its horrible phases, is the best life experience anyone can have. After a year of isolation and separation from the people we love, this movie arrives at the perfect time.\r\n\r\nTechnically, the animation style and score didn't convince me in the first few minutes, but by the end, they're part of the key aspects that made me cry like a baby. Trent Reznor and Atticus Ross are starting to become two of my favorite composers (The Social Network, Gone Girl, Mank). Pete Docter proves that his undeniable talent behind the screen remains intact, and this time, he introduces Hollywood to the debutants Kemp Powers and Mike Jones. Jamie Foxx and Tina Fey (22) deliver some terrific voice work, so expect them to receive dozens of nominations. Finally, congratulations to every single artist that worked on this film's animation. These gifted people are the real stars of Pixar.\r\n\r\nAll in all, Soul is everything I expected it to be. A classic Pixar feature, with the trademark emotionally powerful third act; a heartwarming, sweet, tear-inducing score; and a relatable, profound, well-explored story about our own soul and the meaning of life. Pete Docter delivers another award-worthy flick with the help of Kemp Powers and Mike Jones, and with the outstanding voices of Jamie Foxx and Tina Fey. It may start slow and follow a predictable path, but it's only a matter of time until every viewer connects with the main characters. Soul surpasses the barriers of cinema, becoming a healing media from which people can take away so, so much. It works seamlessly as a reflection on life, and as a motivation to truly live every single moment of it. It's the ideal movie to watch on the morning of Christmas Day with the entire family cozy and warm in the living room. I promise you: it will make you enjoy this festive season a lot more. Undoubtedly, one of the best films of the year.\r\n\r\nRating: A", "created_at": "2020-12-14T22:04:13.276Z"}, {"movie_id": 508442, "review_id": "5fe66ff3e18b97003f8bdf11", "author_rating": 10.0, "review_text": "This is my favorite Disney Pixar movie, even beating Monster's Inc!\r\n\r\nThere wasn't a minute where I wasn't enjoying the movie, there's very powerful meaning to this movie (that will go over kids' heads) and for once, it (in my opinion) tackles an issue big with teens and adults more than kids (at least more than usually).\r\n\r\nThe movie's message is (from what I understood it anyway) about anxiety, sadness, and fear of how you choose your life path. Even going as far as showing how you're so-called purpose in life may not even be correct (or real to begin with).\r\n\r\nThis is by the creators of Inside Out, which gave really good messages across about feelings. It was more kid-oriented, so Soul (in my opinion) being more about teens or adults was a surprise that I did not expect. I'm not saying this isn't a kids movie, I'm saying you shouldn't avoid it if you're not a kid.\r\n\r\nIt probably helps this movie that it's got it's messages across with Music as an instrument (get it?), as I too love music heavily including all kinds of genres (seriously, if you saw my YouTube music history you would think I'm somewhere between a 5-year-old girl, to a 101-year-old Beatles fan).\r\n\r\nI seriously recommend giving this one a watch.", "created_at": "2020-12-25T23:04:19.032Z"}, {"movie_id": 508442, "review_id": "5febbf975ff34e0040fe00bb", "author_rating": 9.0, "review_text": "In a year where most of us have been trapped indoors, the timing of 'Soul's' release can be seen as either a blessing or a curse. For some, it will act as a calming balm for a tough year; the perfect vehicle for inducing a good cry. Others, on the other hand, may reject it as yet another unnecessary mirror held up to their biggest fears exacerbated by a year where living with perceived “purpose“ has been near impossible. No matter which side of this you fall on, 'Soul' implores you to find beauty and gratitude in your circumstances. There is no doubt that is by far the best film Pixar has released in years - possibly even this decade.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-soul-pixars-finest-work-in-years", "created_at": "2020-12-29T23:45:27.459Z"}, {"movie_id": 508442, "review_id": "5ff71982097c49004098d951", "author_rating": null, "review_text": "Soul is the latest effort by Disney Pixar, a beautiful and wonderful film that will leave anyone to ponder about life, its value and the magic inherent in existence. \r\n\r\nThe film tells the story of a man who accidentally falls into a ditch and \"dies\". However, he does not accept his death and begins a journey into his own afterlife until he is able to reunite with his body, in a coma on earth. \r\n\r\nFor a children's film, Soul is surprisingly deep, perhaps even too deep, especially for a child. The film touches on various existential themes, from purpose to the meaning of life, and will make us lose ourselves in thoughts about our own life.\r\n\r\nThe characters are a marvel, especially the protagonists, because they are complete with complex layers that give us all kinds of feelings. The voices that bring them to life do an excellent job in making all the emotions that pass through them appear. \r\n\r\nWhen it comes to animation, once again Pixar exceeds itself and brings us a film that is a living work of art, each frame a beautiful picture of colours and movement that extends for two hours. It's really magical to see life on the small screen, the realism in some of the scenes will leave the audience really amazed. \r\n\r\nThe smaller ones, however, may not understand the complexity of the film, and I don't feel that this is exactly the most entertaining film that will make them pay attention in 100% of the scenes, much due to the fact that it is not necessarily as energetic as many of the most watched animated films in recent years. It is, however, a valuable lesson that is present in the film, and letting children try to understand it will be the right choice to make when viewing Soul. \r\n\r\nAll in all, this effort by Pixar is worthwhile, wonderful, beautiful and moving. The truth is, I found myself reevaluating my whole life and pondering the fact that time is money, because time is life.", "created_at": "2021-01-07T14:24:02.131Z"}, {"movie_id": 508442, "review_id": "5ffcbe116611b4003d60b289", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nI'll have to admit, I went into this thinking it would be Disney's yearly racist progressive attempt, so the bar was pretty low.\r\n\r\nThe movie is actually delightful, and shockingly deep.  The title indicates it has to do with the human soul, so I was expecting something along the lines of \"Inside\" or having to do with jazz, and while it has a rather nice combination of those two things, the attempt on the deep inner workings of the universe in the \"inbetween\" is incredible.\r\n\r\nI imagine everyone will have their own interpretations of what the movie represents mechanically, but the story itself focuses on the pursuit of dreams and happiness combined with the experience of life.\r\n\r\nThe movie animation is fantastic and the voice actors are all top shelf.  The story is awesome, and the characters are strong, deep, and interesting.  I find it hard to believe that anyone would actually not like the movie.\r\n\r\nThe structure is a little basic for something so fantastical, but I think that's by design to keep appeal to most audiences that expect a general family Disney format.", "created_at": "2021-01-11T21:07:29.469Z"}, {"movie_id": 508442, "review_id": "5ffde8ad8b959e003b417977", "author_rating": 7.0, "review_text": "Pleasant film.\r\n\r\n<em>'Soul'</em> didn't connect with me on any deep level, but it is an undoubtedly sweet film. It attempts a lot of heart and I respect that. Jamie Foxx has been in some of my favourite films and he is good as Joe here. I also like the casting of Graham Norton as Moonwind.\r\n\r\nOne thing that probably stopped me thoroughly enjoying this is the animation and character design, particularly when in the \"Great Beyond\". It's not that it looks bad, or anything close, but I just found it a bit too plain. I never felt attached to any of the characters or settings there. I did, though, enjoy the sounds and music, especially in the aforementioned afterlife area. They do do that nicely.\r\n\r\nIt's definitely a good film and one with a nice and honourable message, I just needed that something extra to enjoy it more personally.", "created_at": "2021-01-12T18:21:33.905Z"}, {"movie_id": 508442, "review_id": "6012c190458199003e237465", "author_rating": 9.0, "review_text": "I watched a cartoon with children. Kind and deep cartoon. I liked the humor, especially when the hero's soul moved into the cat. I recommend it for family viewing", "created_at": "2021-01-28T13:52:16.246Z"}, {"movie_id": 508442, "review_id": "5fd7e15d1f3e60003db13090", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nOut of my Top15: Most Anticipated Movies of 2020, eight were removed from this year's schedule due to the current global pandemic, so I didn't have that many films for which I felt incredibly excited. I love pretty much everything that Pixar puts out, and at the start of 2020, I noticed that the studio was releasing not one but two original animated movies, something quite uncommon in their history (only happened in 2015 and 2017). Onward was yet another success, but everyone knew Soul was the studio's big gun. December release date means better chances to win an Oscar, and the highly anticipated return of Pete Docter (Monsters Inc., Up, Inside Out) to the director and writer's chairs also elevates the film's expectations.\r\n\r\nI'm no different. My expectations were high as the sky, but the main question in my mind wasn't really if Soul was going to be a great movie, but if it would be so good I'd love it more than Wolfwalkers, my favorite animated flick of the year so far? Well, let me write that it's a wonderful, beautiful, heartwarming tie. I love them both very much, and I wouldn't be surprised if I saw them in my Top10. However, this is Soul's spotlight, so let me get to it, and spit out the only minor issue I have with the film. During the first act, I couldn't feel a connection to the story nor the characters. It took me a while to really get fully invested in the narrative, and even technical aspects such as the animation style and the score (Trent Reznor, Atticus Ross) felt weirdly out-of-place and surprisingly not that enthralling.\r\n\r\nNevertheless, this slow, unconvincing beginning doesn't negatively impact the movie overall, as most of these apparently awkward components improve as time goes by. From the moment it clicked with me, I went on that emotional rollercoaster I always expect to ride in a Pixar feature. The studio is known for its extremely heartfelt, shocking, tear-inducing third acts, and even though Soul isn't an exception to that rule, it's far from being one of those mind-blowing, jaw-dropping, devastating final minutes. Its third act is astonishingly emotional, and it sends a lovely message to the audience, one that made me reflect on the entire year and a specific moment in my life.\r\n\r\nPete Docter, Mike Jones, and Kemp Powers explore the taboo subject of life's meaning in a predictable yet profound and entertaining manner. The approach on philosophical questions like \"what's my purpose?\", \"what's my spark?\", or \"what does it mean to have a soul?\" is cleverly developed and very well-written. There's a sequence with the protagonist near the end that will make tons of viewers experience it simultaneously. I found myself rewatching this scene in particular to help me remember a certain period in my life where I realized that what I thought was my destiny was, in fact, just one of those life passions that leave us with unforgettable memories.\r\n\r\nI was able to deal with that moment pretty well, but many people lose themselves once they figure out that what they thought they were meant to do/be isn't really what the future holds for them. They become lost souls, and only a spark of life can revitalize them. Soul explores this matter in such an authentic, genuine, creative way that I couldn't help but cry as I do in every Pixar film. Watching Soul will make you appreciate life a lot more, especially those tiny, little moments that we forget to remember. Living, with all its horrible phases, is the best life experience anyone can have. After a year of isolation and separation from the people we love, this movie arrives at the perfect time.\r\n\r\nTechnically, the animation style and score didn't convince me in the first few minutes, but by the end, they're part of the key aspects that made me cry like a baby. Trent Reznor and Atticus Ross are starting to become two of my favorite composers (The Social Network, Gone Girl, Mank). Pete Docter proves that his undeniable talent behind the screen remains intact, and this time, he introduces Hollywood to the debutants Kemp Powers and Mike Jones. Jamie Foxx and Tina Fey (22) deliver some terrific voice work, so expect them to receive dozens of nominations. Finally, congratulations to every single artist that worked on this film's animation. These gifted people are the real stars of Pixar.\r\n\r\nAll in all, Soul is everything I expected it to be. A classic Pixar feature, with the trademark emotionally powerful third act; a heartwarming, sweet, tear-inducing score; and a relatable, profound, well-explored story about our own soul and the meaning of life. Pete Docter delivers another award-worthy flick with the help of Kemp Powers and Mike Jones, and with the outstanding voices of Jamie Foxx and Tina Fey. It may start slow and follow a predictable path, but it's only a matter of time until every viewer connects with the main characters. Soul surpasses the barriers of cinema, becoming a healing media from which people can take away so, so much. It works seamlessly as a reflection on life, and as a motivation to truly live every single moment of it. It's the ideal movie to watch on the morning of Christmas Day with the entire family cozy and warm in the living room. I promise you: it will make you enjoy this festive season a lot more. Undoubtedly, one of the best films of the year.\r\n\r\nRating: A", "created_at": "2020-12-14T22:04:13.276Z"}, {"movie_id": 508442, "review_id": "5fe66ff3e18b97003f8bdf11", "author_rating": 10.0, "review_text": "This is my favorite Disney Pixar movie, even beating Monster's Inc!\r\n\r\nThere wasn't a minute where I wasn't enjoying the movie, there's very powerful meaning to this movie (that will go over kids' heads) and for once, it (in my opinion) tackles an issue big with teens and adults more than kids (at least more than usually).\r\n\r\nThe movie's message is (from what I understood it anyway) about anxiety, sadness, and fear of how you choose your life path. Even going as far as showing how you're so-called purpose in life may not even be correct (or real to begin with).\r\n\r\nThis is by the creators of Inside Out, which gave really good messages across about feelings. It was more kid-oriented, so Soul (in my opinion) being more about teens or adults was a surprise that I did not expect. I'm not saying this isn't a kids movie, I'm saying you shouldn't avoid it if you're not a kid.\r\n\r\nIt probably helps this movie that it's got it's messages across with Music as an instrument (get it?), as I too love music heavily including all kinds of genres (seriously, if you saw my YouTube music history you would think I'm somewhere between a 5-year-old girl, to a 101-year-old Beatles fan).\r\n\r\nI seriously recommend giving this one a watch.", "created_at": "2020-12-25T23:04:19.032Z"}, {"movie_id": 508442, "review_id": "5febbf975ff34e0040fe00bb", "author_rating": 9.0, "review_text": "In a year where most of us have been trapped indoors, the timing of 'Soul's' release can be seen as either a blessing or a curse. For some, it will act as a calming balm for a tough year; the perfect vehicle for inducing a good cry. Others, on the other hand, may reject it as yet another unnecessary mirror held up to their biggest fears exacerbated by a year where living with perceived “purpose“ has been near impossible. No matter which side of this you fall on, 'Soul' implores you to find beauty and gratitude in your circumstances. There is no doubt that is by far the best film Pixar has released in years - possibly even this decade.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-soul-pixars-finest-work-in-years", "created_at": "2020-12-29T23:45:27.459Z"}, {"movie_id": 508442, "review_id": "5ff71982097c49004098d951", "author_rating": null, "review_text": "Soul is the latest effort by Disney Pixar, a beautiful and wonderful film that will leave anyone to ponder about life, its value and the magic inherent in existence. \r\n\r\nThe film tells the story of a man who accidentally falls into a ditch and \"dies\". However, he does not accept his death and begins a journey into his own afterlife until he is able to reunite with his body, in a coma on earth. \r\n\r\nFor a children's film, Soul is surprisingly deep, perhaps even too deep, especially for a child. The film touches on various existential themes, from purpose to the meaning of life, and will make us lose ourselves in thoughts about our own life.\r\n\r\nThe characters are a marvel, especially the protagonists, because they are complete with complex layers that give us all kinds of feelings. The voices that bring them to life do an excellent job in making all the emotions that pass through them appear. \r\n\r\nWhen it comes to animation, once again Pixar exceeds itself and brings us a film that is a living work of art, each frame a beautiful picture of colours and movement that extends for two hours. It's really magical to see life on the small screen, the realism in some of the scenes will leave the audience really amazed. \r\n\r\nThe smaller ones, however, may not understand the complexity of the film, and I don't feel that this is exactly the most entertaining film that will make them pay attention in 100% of the scenes, much due to the fact that it is not necessarily as energetic as many of the most watched animated films in recent years. It is, however, a valuable lesson that is present in the film, and letting children try to understand it will be the right choice to make when viewing Soul. \r\n\r\nAll in all, this effort by Pixar is worthwhile, wonderful, beautiful and moving. The truth is, I found myself reevaluating my whole life and pondering the fact that time is money, because time is life.", "created_at": "2021-01-07T14:24:02.131Z"}, {"movie_id": 508442, "review_id": "5ffcbe116611b4003d60b289", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nI'll have to admit, I went into this thinking it would be Disney's yearly racist progressive attempt, so the bar was pretty low.\r\n\r\nThe movie is actually delightful, and shockingly deep.  The title indicates it has to do with the human soul, so I was expecting something along the lines of \"Inside\" or having to do with jazz, and while it has a rather nice combination of those two things, the attempt on the deep inner workings of the universe in the \"inbetween\" is incredible.\r\n\r\nI imagine everyone will have their own interpretations of what the movie represents mechanically, but the story itself focuses on the pursuit of dreams and happiness combined with the experience of life.\r\n\r\nThe movie animation is fantastic and the voice actors are all top shelf.  The story is awesome, and the characters are strong, deep, and interesting.  I find it hard to believe that anyone would actually not like the movie.\r\n\r\nThe structure is a little basic for something so fantastical, but I think that's by design to keep appeal to most audiences that expect a general family Disney format.", "created_at": "2021-01-11T21:07:29.469Z"}, {"movie_id": 508442, "review_id": "5ffde8ad8b959e003b417977", "author_rating": 7.0, "review_text": "Pleasant film.\r\n\r\n<em>'Soul'</em> didn't connect with me on any deep level, but it is an undoubtedly sweet film. It attempts a lot of heart and I respect that. Jamie Foxx has been in some of my favourite films and he is good as Joe here. I also like the casting of Graham Norton as Moonwind.\r\n\r\nOne thing that probably stopped me thoroughly enjoying this is the animation and character design, particularly when in the \"Great Beyond\". It's not that it looks bad, or anything close, but I just found it a bit too plain. I never felt attached to any of the characters or settings there. I did, though, enjoy the sounds and music, especially in the aforementioned afterlife area. They do do that nicely.\r\n\r\nIt's definitely a good film and one with a nice and honourable message, I just needed that something extra to enjoy it more personally.", "created_at": "2021-01-12T18:21:33.905Z"}, {"movie_id": 508442, "review_id": "6012c190458199003e237465", "author_rating": 9.0, "review_text": "I watched a cartoon with children. Kind and deep cartoon. I liked the humor, especially when the hero's soul moved into the cat. I recommend it for family viewing", "created_at": "2021-01-28T13:52:16.246Z"}, {"movie_id": 508442, "review_id": "5fd7e15d1f3e60003db13090", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nOut of my Top15: Most Anticipated Movies of 2020, eight were removed from this year's schedule due to the current global pandemic, so I didn't have that many films for which I felt incredibly excited. I love pretty much everything that Pixar puts out, and at the start of 2020, I noticed that the studio was releasing not one but two original animated movies, something quite uncommon in their history (only happened in 2015 and 2017). Onward was yet another success, but everyone knew Soul was the studio's big gun. December release date means better chances to win an Oscar, and the highly anticipated return of Pete Docter (Monsters Inc., Up, Inside Out) to the director and writer's chairs also elevates the film's expectations.\r\n\r\nI'm no different. My expectations were high as the sky, but the main question in my mind wasn't really if Soul was going to be a great movie, but if it would be so good I'd love it more than Wolfwalkers, my favorite animated flick of the year so far? Well, let me write that it's a wonderful, beautiful, heartwarming tie. I love them both very much, and I wouldn't be surprised if I saw them in my Top10. However, this is Soul's spotlight, so let me get to it, and spit out the only minor issue I have with the film. During the first act, I couldn't feel a connection to the story nor the characters. It took me a while to really get fully invested in the narrative, and even technical aspects such as the animation style and the score (Trent Reznor, Atticus Ross) felt weirdly out-of-place and surprisingly not that enthralling.\r\n\r\nNevertheless, this slow, unconvincing beginning doesn't negatively impact the movie overall, as most of these apparently awkward components improve as time goes by. From the moment it clicked with me, I went on that emotional rollercoaster I always expect to ride in a Pixar feature. The studio is known for its extremely heartfelt, shocking, tear-inducing third acts, and even though Soul isn't an exception to that rule, it's far from being one of those mind-blowing, jaw-dropping, devastating final minutes. Its third act is astonishingly emotional, and it sends a lovely message to the audience, one that made me reflect on the entire year and a specific moment in my life.\r\n\r\nPete Docter, Mike Jones, and Kemp Powers explore the taboo subject of life's meaning in a predictable yet profound and entertaining manner. The approach on philosophical questions like \"what's my purpose?\", \"what's my spark?\", or \"what does it mean to have a soul?\" is cleverly developed and very well-written. There's a sequence with the protagonist near the end that will make tons of viewers experience it simultaneously. I found myself rewatching this scene in particular to help me remember a certain period in my life where I realized that what I thought was my destiny was, in fact, just one of those life passions that leave us with unforgettable memories.\r\n\r\nI was able to deal with that moment pretty well, but many people lose themselves once they figure out that what they thought they were meant to do/be isn't really what the future holds for them. They become lost souls, and only a spark of life can revitalize them. Soul explores this matter in such an authentic, genuine, creative way that I couldn't help but cry as I do in every Pixar film. Watching Soul will make you appreciate life a lot more, especially those tiny, little moments that we forget to remember. Living, with all its horrible phases, is the best life experience anyone can have. After a year of isolation and separation from the people we love, this movie arrives at the perfect time.\r\n\r\nTechnically, the animation style and score didn't convince me in the first few minutes, but by the end, they're part of the key aspects that made me cry like a baby. Trent Reznor and Atticus Ross are starting to become two of my favorite composers (The Social Network, Gone Girl, Mank). Pete Docter proves that his undeniable talent behind the screen remains intact, and this time, he introduces Hollywood to the debutants Kemp Powers and Mike Jones. Jamie Foxx and Tina Fey (22) deliver some terrific voice work, so expect them to receive dozens of nominations. Finally, congratulations to every single artist that worked on this film's animation. These gifted people are the real stars of Pixar.\r\n\r\nAll in all, Soul is everything I expected it to be. A classic Pixar feature, with the trademark emotionally powerful third act; a heartwarming, sweet, tear-inducing score; and a relatable, profound, well-explored story about our own soul and the meaning of life. Pete Docter delivers another award-worthy flick with the help of Kemp Powers and Mike Jones, and with the outstanding voices of Jamie Foxx and Tina Fey. It may start slow and follow a predictable path, but it's only a matter of time until every viewer connects with the main characters. Soul surpasses the barriers of cinema, becoming a healing media from which people can take away so, so much. It works seamlessly as a reflection on life, and as a motivation to truly live every single moment of it. It's the ideal movie to watch on the morning of Christmas Day with the entire family cozy and warm in the living room. I promise you: it will make you enjoy this festive season a lot more. Undoubtedly, one of the best films of the year.\r\n\r\nRating: A", "created_at": "2020-12-14T22:04:13.276Z"}, {"movie_id": 508442, "review_id": "5fe66ff3e18b97003f8bdf11", "author_rating": 10.0, "review_text": "This is my favorite Disney Pixar movie, even beating Monster's Inc!\r\n\r\nThere wasn't a minute where I wasn't enjoying the movie, there's very powerful meaning to this movie (that will go over kids' heads) and for once, it (in my opinion) tackles an issue big with teens and adults more than kids (at least more than usually).\r\n\r\nThe movie's message is (from what I understood it anyway) about anxiety, sadness, and fear of how you choose your life path. Even going as far as showing how you're so-called purpose in life may not even be correct (or real to begin with).\r\n\r\nThis is by the creators of Inside Out, which gave really good messages across about feelings. It was more kid-oriented, so Soul (in my opinion) being more about teens or adults was a surprise that I did not expect. I'm not saying this isn't a kids movie, I'm saying you shouldn't avoid it if you're not a kid.\r\n\r\nIt probably helps this movie that it's got it's messages across with Music as an instrument (get it?), as I too love music heavily including all kinds of genres (seriously, if you saw my YouTube music history you would think I'm somewhere between a 5-year-old girl, to a 101-year-old Beatles fan).\r\n\r\nI seriously recommend giving this one a watch.", "created_at": "2020-12-25T23:04:19.032Z"}, {"movie_id": 508442, "review_id": "5febbf975ff34e0040fe00bb", "author_rating": 9.0, "review_text": "In a year where most of us have been trapped indoors, the timing of 'Soul's' release can be seen as either a blessing or a curse. For some, it will act as a calming balm for a tough year; the perfect vehicle for inducing a good cry. Others, on the other hand, may reject it as yet another unnecessary mirror held up to their biggest fears exacerbated by a year where living with perceived “purpose“ has been near impossible. No matter which side of this you fall on, 'Soul' implores you to find beauty and gratitude in your circumstances. There is no doubt that is by far the best film Pixar has released in years - possibly even this decade.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-soul-pixars-finest-work-in-years", "created_at": "2020-12-29T23:45:27.459Z"}, {"movie_id": 508442, "review_id": "5ff71982097c49004098d951", "author_rating": null, "review_text": "Soul is the latest effort by Disney Pixar, a beautiful and wonderful film that will leave anyone to ponder about life, its value and the magic inherent in existence. \r\n\r\nThe film tells the story of a man who accidentally falls into a ditch and \"dies\". However, he does not accept his death and begins a journey into his own afterlife until he is able to reunite with his body, in a coma on earth. \r\n\r\nFor a children's film, Soul is surprisingly deep, perhaps even too deep, especially for a child. The film touches on various existential themes, from purpose to the meaning of life, and will make us lose ourselves in thoughts about our own life.\r\n\r\nThe characters are a marvel, especially the protagonists, because they are complete with complex layers that give us all kinds of feelings. The voices that bring them to life do an excellent job in making all the emotions that pass through them appear. \r\n\r\nWhen it comes to animation, once again Pixar exceeds itself and brings us a film that is a living work of art, each frame a beautiful picture of colours and movement that extends for two hours. It's really magical to see life on the small screen, the realism in some of the scenes will leave the audience really amazed. \r\n\r\nThe smaller ones, however, may not understand the complexity of the film, and I don't feel that this is exactly the most entertaining film that will make them pay attention in 100% of the scenes, much due to the fact that it is not necessarily as energetic as many of the most watched animated films in recent years. It is, however, a valuable lesson that is present in the film, and letting children try to understand it will be the right choice to make when viewing Soul. \r\n\r\nAll in all, this effort by Pixar is worthwhile, wonderful, beautiful and moving. The truth is, I found myself reevaluating my whole life and pondering the fact that time is money, because time is life.", "created_at": "2021-01-07T14:24:02.131Z"}, {"movie_id": 508442, "review_id": "5ffcbe116611b4003d60b289", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nI'll have to admit, I went into this thinking it would be Disney's yearly racist progressive attempt, so the bar was pretty low.\r\n\r\nThe movie is actually delightful, and shockingly deep.  The title indicates it has to do with the human soul, so I was expecting something along the lines of \"Inside\" or having to do with jazz, and while it has a rather nice combination of those two things, the attempt on the deep inner workings of the universe in the \"inbetween\" is incredible.\r\n\r\nI imagine everyone will have their own interpretations of what the movie represents mechanically, but the story itself focuses on the pursuit of dreams and happiness combined with the experience of life.\r\n\r\nThe movie animation is fantastic and the voice actors are all top shelf.  The story is awesome, and the characters are strong, deep, and interesting.  I find it hard to believe that anyone would actually not like the movie.\r\n\r\nThe structure is a little basic for something so fantastical, but I think that's by design to keep appeal to most audiences that expect a general family Disney format.", "created_at": "2021-01-11T21:07:29.469Z"}, {"movie_id": 508442, "review_id": "5ffde8ad8b959e003b417977", "author_rating": 7.0, "review_text": "Pleasant film.\r\n\r\n<em>'Soul'</em> didn't connect with me on any deep level, but it is an undoubtedly sweet film. It attempts a lot of heart and I respect that. Jamie Foxx has been in some of my favourite films and he is good as Joe here. I also like the casting of Graham Norton as Moonwind.\r\n\r\nOne thing that probably stopped me thoroughly enjoying this is the animation and character design, particularly when in the \"Great Beyond\". It's not that it looks bad, or anything close, but I just found it a bit too plain. I never felt attached to any of the characters or settings there. I did, though, enjoy the sounds and music, especially in the aforementioned afterlife area. They do do that nicely.\r\n\r\nIt's definitely a good film and one with a nice and honourable message, I just needed that something extra to enjoy it more personally.", "created_at": "2021-01-12T18:21:33.905Z"}, {"movie_id": 508442, "review_id": "6012c190458199003e237465", "author_rating": 9.0, "review_text": "I watched a cartoon with children. Kind and deep cartoon. I liked the humor, especially when the hero's soul moved into the cat. I recommend it for family viewing", "created_at": "2021-01-28T13:52:16.246Z"}, {"movie_id": 508442, "review_id": "5fd7e15d1f3e60003db13090", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nOut of my Top15: Most Anticipated Movies of 2020, eight were removed from this year's schedule due to the current global pandemic, so I didn't have that many films for which I felt incredibly excited. I love pretty much everything that Pixar puts out, and at the start of 2020, I noticed that the studio was releasing not one but two original animated movies, something quite uncommon in their history (only happened in 2015 and 2017). Onward was yet another success, but everyone knew Soul was the studio's big gun. December release date means better chances to win an Oscar, and the highly anticipated return of Pete Docter (Monsters Inc., Up, Inside Out) to the director and writer's chairs also elevates the film's expectations.\r\n\r\nI'm no different. My expectations were high as the sky, but the main question in my mind wasn't really if Soul was going to be a great movie, but if it would be so good I'd love it more than Wolfwalkers, my favorite animated flick of the year so far? Well, let me write that it's a wonderful, beautiful, heartwarming tie. I love them both very much, and I wouldn't be surprised if I saw them in my Top10. However, this is Soul's spotlight, so let me get to it, and spit out the only minor issue I have with the film. During the first act, I couldn't feel a connection to the story nor the characters. It took me a while to really get fully invested in the narrative, and even technical aspects such as the animation style and the score (Trent Reznor, Atticus Ross) felt weirdly out-of-place and surprisingly not that enthralling.\r\n\r\nNevertheless, this slow, unconvincing beginning doesn't negatively impact the movie overall, as most of these apparently awkward components improve as time goes by. From the moment it clicked with me, I went on that emotional rollercoaster I always expect to ride in a Pixar feature. The studio is known for its extremely heartfelt, shocking, tear-inducing third acts, and even though Soul isn't an exception to that rule, it's far from being one of those mind-blowing, jaw-dropping, devastating final minutes. Its third act is astonishingly emotional, and it sends a lovely message to the audience, one that made me reflect on the entire year and a specific moment in my life.\r\n\r\nPete Docter, Mike Jones, and Kemp Powers explore the taboo subject of life's meaning in a predictable yet profound and entertaining manner. The approach on philosophical questions like \"what's my purpose?\", \"what's my spark?\", or \"what does it mean to have a soul?\" is cleverly developed and very well-written. There's a sequence with the protagonist near the end that will make tons of viewers experience it simultaneously. I found myself rewatching this scene in particular to help me remember a certain period in my life where I realized that what I thought was my destiny was, in fact, just one of those life passions that leave us with unforgettable memories.\r\n\r\nI was able to deal with that moment pretty well, but many people lose themselves once they figure out that what they thought they were meant to do/be isn't really what the future holds for them. They become lost souls, and only a spark of life can revitalize them. Soul explores this matter in such an authentic, genuine, creative way that I couldn't help but cry as I do in every Pixar film. Watching Soul will make you appreciate life a lot more, especially those tiny, little moments that we forget to remember. Living, with all its horrible phases, is the best life experience anyone can have. After a year of isolation and separation from the people we love, this movie arrives at the perfect time.\r\n\r\nTechnically, the animation style and score didn't convince me in the first few minutes, but by the end, they're part of the key aspects that made me cry like a baby. Trent Reznor and Atticus Ross are starting to become two of my favorite composers (The Social Network, Gone Girl, Mank). Pete Docter proves that his undeniable talent behind the screen remains intact, and this time, he introduces Hollywood to the debutants Kemp Powers and Mike Jones. Jamie Foxx and Tina Fey (22) deliver some terrific voice work, so expect them to receive dozens of nominations. Finally, congratulations to every single artist that worked on this film's animation. These gifted people are the real stars of Pixar.\r\n\r\nAll in all, Soul is everything I expected it to be. A classic Pixar feature, with the trademark emotionally powerful third act; a heartwarming, sweet, tear-inducing score; and a relatable, profound, well-explored story about our own soul and the meaning of life. Pete Docter delivers another award-worthy flick with the help of Kemp Powers and Mike Jones, and with the outstanding voices of Jamie Foxx and Tina Fey. It may start slow and follow a predictable path, but it's only a matter of time until every viewer connects with the main characters. Soul surpasses the barriers of cinema, becoming a healing media from which people can take away so, so much. It works seamlessly as a reflection on life, and as a motivation to truly live every single moment of it. It's the ideal movie to watch on the morning of Christmas Day with the entire family cozy and warm in the living room. I promise you: it will make you enjoy this festive season a lot more. Undoubtedly, one of the best films of the year.\r\n\r\nRating: A", "created_at": "2020-12-14T22:04:13.276Z"}, {"movie_id": 508442, "review_id": "5fe66ff3e18b97003f8bdf11", "author_rating": 10.0, "review_text": "This is my favorite Disney Pixar movie, even beating Monster's Inc!\r\n\r\nThere wasn't a minute where I wasn't enjoying the movie, there's very powerful meaning to this movie (that will go over kids' heads) and for once, it (in my opinion) tackles an issue big with teens and adults more than kids (at least more than usually).\r\n\r\nThe movie's message is (from what I understood it anyway) about anxiety, sadness, and fear of how you choose your life path. Even going as far as showing how you're so-called purpose in life may not even be correct (or real to begin with).\r\n\r\nThis is by the creators of Inside Out, which gave really good messages across about feelings. It was more kid-oriented, so Soul (in my opinion) being more about teens or adults was a surprise that I did not expect. I'm not saying this isn't a kids movie, I'm saying you shouldn't avoid it if you're not a kid.\r\n\r\nIt probably helps this movie that it's got it's messages across with Music as an instrument (get it?), as I too love music heavily including all kinds of genres (seriously, if you saw my YouTube music history you would think I'm somewhere between a 5-year-old girl, to a 101-year-old Beatles fan).\r\n\r\nI seriously recommend giving this one a watch.", "created_at": "2020-12-25T23:04:19.032Z"}, {"movie_id": 508442, "review_id": "5febbf975ff34e0040fe00bb", "author_rating": 9.0, "review_text": "In a year where most of us have been trapped indoors, the timing of 'Soul's' release can be seen as either a blessing or a curse. For some, it will act as a calming balm for a tough year; the perfect vehicle for inducing a good cry. Others, on the other hand, may reject it as yet another unnecessary mirror held up to their biggest fears exacerbated by a year where living with perceived “purpose“ has been near impossible. No matter which side of this you fall on, 'Soul' implores you to find beauty and gratitude in your circumstances. There is no doubt that is by far the best film Pixar has released in years - possibly even this decade.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-soul-pixars-finest-work-in-years", "created_at": "2020-12-29T23:45:27.459Z"}, {"movie_id": 508442, "review_id": "5ff71982097c49004098d951", "author_rating": null, "review_text": "Soul is the latest effort by Disney Pixar, a beautiful and wonderful film that will leave anyone to ponder about life, its value and the magic inherent in existence. \r\n\r\nThe film tells the story of a man who accidentally falls into a ditch and \"dies\". However, he does not accept his death and begins a journey into his own afterlife until he is able to reunite with his body, in a coma on earth. \r\n\r\nFor a children's film, Soul is surprisingly deep, perhaps even too deep, especially for a child. The film touches on various existential themes, from purpose to the meaning of life, and will make us lose ourselves in thoughts about our own life.\r\n\r\nThe characters are a marvel, especially the protagonists, because they are complete with complex layers that give us all kinds of feelings. The voices that bring them to life do an excellent job in making all the emotions that pass through them appear. \r\n\r\nWhen it comes to animation, once again Pixar exceeds itself and brings us a film that is a living work of art, each frame a beautiful picture of colours and movement that extends for two hours. It's really magical to see life on the small screen, the realism in some of the scenes will leave the audience really amazed. \r\n\r\nThe smaller ones, however, may not understand the complexity of the film, and I don't feel that this is exactly the most entertaining film that will make them pay attention in 100% of the scenes, much due to the fact that it is not necessarily as energetic as many of the most watched animated films in recent years. It is, however, a valuable lesson that is present in the film, and letting children try to understand it will be the right choice to make when viewing Soul. \r\n\r\nAll in all, this effort by Pixar is worthwhile, wonderful, beautiful and moving. The truth is, I found myself reevaluating my whole life and pondering the fact that time is money, because time is life.", "created_at": "2021-01-07T14:24:02.131Z"}, {"movie_id": 508442, "review_id": "5ffcbe116611b4003d60b289", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nI'll have to admit, I went into this thinking it would be Disney's yearly racist progressive attempt, so the bar was pretty low.\r\n\r\nThe movie is actually delightful, and shockingly deep.  The title indicates it has to do with the human soul, so I was expecting something along the lines of \"Inside\" or having to do with jazz, and while it has a rather nice combination of those two things, the attempt on the deep inner workings of the universe in the \"inbetween\" is incredible.\r\n\r\nI imagine everyone will have their own interpretations of what the movie represents mechanically, but the story itself focuses on the pursuit of dreams and happiness combined with the experience of life.\r\n\r\nThe movie animation is fantastic and the voice actors are all top shelf.  The story is awesome, and the characters are strong, deep, and interesting.  I find it hard to believe that anyone would actually not like the movie.\r\n\r\nThe structure is a little basic for something so fantastical, but I think that's by design to keep appeal to most audiences that expect a general family Disney format.", "created_at": "2021-01-11T21:07:29.469Z"}, {"movie_id": 508442, "review_id": "5ffde8ad8b959e003b417977", "author_rating": 7.0, "review_text": "Pleasant film.\r\n\r\n<em>'Soul'</em> didn't connect with me on any deep level, but it is an undoubtedly sweet film. It attempts a lot of heart and I respect that. Jamie Foxx has been in some of my favourite films and he is good as Joe here. I also like the casting of Graham Norton as Moonwind.\r\n\r\nOne thing that probably stopped me thoroughly enjoying this is the animation and character design, particularly when in the \"Great Beyond\". It's not that it looks bad, or anything close, but I just found it a bit too plain. I never felt attached to any of the characters or settings there. I did, though, enjoy the sounds and music, especially in the aforementioned afterlife area. They do do that nicely.\r\n\r\nIt's definitely a good film and one with a nice and honourable message, I just needed that something extra to enjoy it more personally.", "created_at": "2021-01-12T18:21:33.905Z"}, {"movie_id": 508442, "review_id": "6012c190458199003e237465", "author_rating": 9.0, "review_text": "I watched a cartoon with children. Kind and deep cartoon. I liked the humor, especially when the hero's soul moved into the cat. I recommend it for family viewing", "created_at": "2021-01-28T13:52:16.246Z"}]