[{"movie_id": 415842, "review_id": "5a1df4a7c3a3680b9606fd5d", "author_rating": 3.0, "review_text": "_American Assassin_ might be the most nothing movie of the year. I was sold on the trailer, I though Michael Keating looked great (and to be fair, he kinda was), but watching the movie itself, I felt completely blank. I can't even recommend _American Assassin_ as background noise.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-28T23:43:35.834Z"}, {"movie_id": 415842, "review_id": "5a2f103e0e0a264cc8176a1a", "author_rating": 2.0, "review_text": "Don't bother watching, plot line has been so many times before. Turn off your TV and do something more productive instead !", "created_at": "2017-12-11T23:09:50.661Z"}, {"movie_id": 415842, "review_id": "5d6392abbc8abc193a252333", "author_rating": null, "review_text": "This movie has been sitting on my unwatched shelf for quite a while and yesterday I finally got around to watch it.\r\n\r\nI actually found this movie to be not too bad actually. It is far from a cinematic masterpiece but it is a pretty solid action/revenge movie. Dylan O’Brien is, unfortunately, pretty meh as the main character. Michael Keaton on the other hand is quite good in his character.\r\n\r\nIt is a reasonably action filled movie and I really like that they didn’t try to turn it into some PG-13 crap. It is sometimes fairly brutal. The story is okay. It works. It is not overly complex and some people are probably moaning about it not being original enough. Well, I say, so what? It is a good concept so why screw with it? I do like revenge movies and although this one is far from the best, it is not at all shabby.\r\n\r\nI wonder why some people seems to be claiming that this movie is just crap, one star out of ten and so on and so forth? Is it maybe because it dares bring up the subject of Islamist fanatics killing innocents? Or maybe because it doesn’t try to sugarcoat things and explain these “poor misunderstood” psychopaths but lays the blame straight on said lowlife as well as on Iran? Or maybe because it doesn’t try to blame certain of today’s political retards’ preferred boogieman Russia?\r\n\r\nI have not read the book so I guess, if it doesn’t do the book justice, I can somewhat understand not liking it. However, to me, this was a decent, not spectacular but decent, two hours of entertainment. Decent action, decent speed and (with the exception of O’Brien) decent acting.", "created_at": "2019-08-26T08:04:59.827Z"}, {"movie_id": 415842, "review_id": "636cb317d7fbda007bee7bf0", "author_rating": 6.0, "review_text": "This starts off with shades of the real Tunisian beach attacks from 2015, when \"Rapp\" (Dylan O'Brien) and his girlfriend find themselves caught up in a shooting that ends in tragedy. Determined on revenge, he attracts the attention of the CIA with whom he ends up working before being sent to the ultimate ninja training camp under the auspices of veteran \"Hurley\" (Michael Keaton). Working with local intelligence, they identify their target and after a few predictably failed attempts, they are soon on the trail of the criminal who has plans of his own to exact revenge on the American imperialists. O'Brien is easy enough on the eye but the rest of this is about as derivative as it comes. Set piece action scenes ensue as day follows night, peppered with who to trust issues and the introduction of an unlikely enemy in \"Ghost\" (Taylor Kitsch) who has his own axe to grind with \"Hurley\". This is genre-fodder, and kills just short of two hours effortlessly enough (though the CGI at the end is really poor for 2017!). You are unlikely to recall it afterwards, and the plot has virtually no jeopardy so don't expect much here.", "created_at": "2022-11-10T08:15:19.876Z"}]