[{"movie_id": 296096, "review_id": "58013bae925141300c000b0f", "author_rating": 7.0, "review_text": "**Changing one's fixed mind is not an easy task.**\r\n\r\nBased on the novel of the same name, directed by a new lady filmmaker. This British film has two young sensation Sam Claflin and Emilia Clarke in the important roles. The story of a young man who was paralysed recently meets his new caretaker. Initially they both won't fit for each other, but after some time everything changes when they together do some outdoor activities. While the film progress, it only gets more emotional. Besides, it's fun watching the first two acts, particularly the performances from both the lead strikes strongly.\r\n\r\nAfter a very long time I watched a good tearjerker, but not that strong. It is a simple story, there's no big adventure or romance in it. That's right, it is not a romance film and if you decide to watch expecting one, you will be definitely disappointed. Also slightly it delivers a bad message like the negativity for being one seriously ill and alive. This issue is only on the humanity ground, but afterall everyone entitled to do what they want, because it's their life.\r\n\r\nAnyway, the film avoids the usual cliché. Like there's no scene that you had seen in other similar theme repeats here. Deliberately avoided to make it a fresh piece. Basically, if you observe closely the both two lead characters, they had a different agenda about their life. Particularly the caretaker never ever tried anything seriously to accomplish her undertaking.\r\n\r\nOn the other hand, those parts were very realistic, but still gives us a cinematic experience due to the fancy screen presentation. Surely a good watch, I think everyone should watch it, because there's no drugs, sexes or nudes or even the strong kissing scenes. Only the main theme is something disturbing, particularly for the tender-hearted people. Other than that, I hope you watch it if you haven't yet.\r\n\r\n_7/10_", "created_at": "2016-10-14T20:10:22.732Z"}]