[{"movie_id": 10681, "review_id": "57b315fe925141182f002555", "author_rating": 10.0, "review_text": "A movie about robots and emotions? Pixar has made the unlikely combo work really well.\r\n\r\nWALL·E is the lonely robot, the last of his kind, left behind by the humans on Earth. His job - to clean up the garbage the humans have dumped. In 700 years, he seams to have developed one tiny bug - a personality.\r\nJoin WALL·E in his interstellar quest to find a partner.\r\n\r\nWALL·E is short, satirical, dialogue-free and a visual masterpiece. And the fact that it is animated does not make it any less watchable as an adult.\r\n\r\nIt is a must watch for anyone of any age.", "created_at": "2016-08-16T13:32:46.012Z"}, {"movie_id": 10681, "review_id": "5f349f8393828e00333bdcf0", "author_rating": 10.0, "review_text": "A must watch, will watch again, and definitely recommend for everyone, all ages.\r\n\r\nThe first 30 minutes or so of this movie are pure and perfect magic.  They establish the world, Wall-E, the human race with next to no dialogue.\r\n\r\nWall-E and Eve meeting is wonderfully trip of social anxiety in different personalities and a great metaphor for living together while being different.\r\n\r\nOnce on the axiom, the entire movie shifts seemlessly, and it is one heavy metaphor after the next about America and the human race without it once being the focus of the story.\r\n\r\nIf you ever needed a movie that \"does\" and not \"says\", this is your example, it's how world building should be done.\r\n\r\nWhile I think I could literally talk about this movie for hours, I don't want to spoil anything else by talking about it here other than this is a near perfect movie to me.\r\n\r\nWatch, enjoy, be well.", "created_at": "2020-08-13T02:03:47.372Z"}, {"movie_id": 10681, "review_id": "5f3842f415a4a10033fce9cb", "author_rating": 9.0, "review_text": "Wonderful.\r\n\r\n<em>'WALL·E'</em> is beautifully made, despite a relatively simple premise and no real cast to speak of. A big reason for its charm is the strong message and adorable lead characters - WALL·E (Ben Burtt) and EVE (Elissa Knight).\r\n\r\nThe run time of 98 minutes flies by, with a cool end credits coming at the conclusion. Its animation is utterly superb, while I also like the mix of real-life footage (featuring Fred Willard as Shelby Forthright) into things. Jeff Garlin and Sigourney Weaver work well in their minor roles.\r\n\r\nNot at the top of my personal Disney animated productions, but just about inside the top ten up until this point. Lovely film.", "created_at": "2020-08-15T20:17:56.034Z"}, {"movie_id": 10681, "review_id": "63b2410cc56d2d007c842e33", "author_rating": 7.0, "review_text": "**WALL·E is a surprisingly charming story that will warm your heart and make you chuckle.**\r\n\r\nWALL·E is a feel-good movie about a robot full of heart and full of love. WALL·E is the Ted Lasso of Pixar characters, puppy dog loyalty and eternally optimistic. WALL·E’s blundering kindness gives hope to so many jaded characters and inspires them to step up and care. WALL·E and EVE are delightful and adorable characters with a story told by an unbelievable screenplay that compels and engages even with such little dialogue. And with a 3-year-old who loves this movie, this parent appreciates the small amount of dialogue, making it more pleasant background noise as my daughter watches it for the 327th time. The animation is superb, and the story is fantastic. WALL·E is one of Pixar’s best in a catalog of masterpieces.", "created_at": "2023-01-02T02:27:24.039Z"}, {"movie_id": 10681, "review_id": "64637364e3fa2f0187b9cc3b", "author_rating": 7.0, "review_text": "I reckon that despite many efforts made with way more worthy tones, this is probably one of the most effective stories depicting the dangers of mankind's indifference to our planet and it's future - and it's potently and charmingly effective. Our eponymous robot spends it's time packaging up waste into cubes, stacking them, then retreating to it's home of an evening before the storms hit! The planet has been decimated - only his friendly locust survives to keep him company. One fateful day, though, another craft arrives and it's occupant \"EVE\" is soon a-scanning and making friends - after a shaky start - with her more indigenous pal. Things take quite a turn when \"EVE\" discovers what it was sent to find - a life form. In this case a tiny shoot. Alarm bells ring and shortly afterwards a spaceship arrives to collect \"EVE\" and the foliage. Not about to be left behind, the ship soon has a stowaway and we are presented with an explanation of just what happened to humanity - now, basically, a bunch of armchair-bound, boneless globules of flesh - who think they've been on an intergalactic cruise for the last seven hundred years! Can they all get back to Earth and sow the seeds of humanity's redemption? Well not without a little bit of automated interference and some fun escapades that are engaging and touching. The fate of our race is in the hands of these two mechanical creations - but the broader meaning here is clear as a bell. If we continue to treat the planet like it is our own personal garbage dump, then we will reap what we sow! Entertaining and thought-provoking without resorting to simplistic pontification, politicisation or lawlessness. Well worth a watch.", "created_at": "2023-05-16T12:13:24.537Z"}]