[{"movie_id": 27, "review_id": "630acd3663536a0077b7106a", "author_rating": 5.0, "review_text": "Lisa is an exchange student in London. Her affair with Matt has the urgency of the ephemeral. They are enjoying an extended, unofficial honeymoon; we see them dancing, drinking beer, doing drugs, hanging out, having irrelevant conversations and, above all, going to rock shows (all nine of the titular songs are performed live) and having sex (Matt and Lisa have intercourse the same way they talk; ie, like real human beings as opposed to movie characters).\r\n\r\nThere is generous nudity, and the sex is sometimes tentative and sometimes vigorous, and often uninhibited and experimental – as well as explicit and unsimulated (and, might I add, safe). At the same time, the songs, all except one by indie, garage, and punk rock bands (Black Rebel Motorcycle Club, Elbow, Primal Scream, among others), are raw and stark, as befits a live performance (the film’s short length, a little over an hour, likewise adheres to a minimalist punk ethos).\r\n\r\nThe sex scenes follow the musical numbers, in at least one case overlapping until they merge into an audiovisual orgasm, in which the sexual act and the musical act become one, fleshing out the intangible bond that has always existed between sex and rock 'n' roll. By making Matt and Lisa the only characters with dialogue and individuality, director Michael Winterbottom makes it clear that their relationship is not just about sex; as it happens when two people fall in love (or like each other a lot), the lovers feel like the only two people on the planet, a feeling that the rest of concert-goers, a nameless and faceless mass, does nothing but emphasize.\r\n\r\nMatt is a glaciologist, and the immediacy of his passion for Lisa is contrasted with the timelessness of Antarctica (“the memory of the planet”), from where he looks back on their romance. After a year, Lisa returns to the US, and the two part without long goodbyes. This is the most realistically happy ending for a relationship, since, as we all know, the honeymoon phase is untenable and, with the passage of time, even sex becomes a chore – something like playing the same song every night.\r\n\r\nAnd sure enough, after a while, despite the musical and sexual variety – the latter of which includes cunnilingus, masturbation, blindfolds, hand tying, and manual, pedal (for lack of a better term), and vaginal sex –, the film’s structure becomes repetitive towards the end, although, once again, the brief running time keeps the tedium from becoming unbearable.", "created_at": "2022-08-28T02:04:39.000Z"}]