[{"movie_id": 634, "review_id": "5e8859f3d207f300169673bd", "author_rating": 7.0, "review_text": "Great little charmer. But avoid the sequels like a bad Christmas sweater\r\n\r\nI think you need to like romantic comedies to enjoy this movie, and that eliminates a lot of guys who tolerate Rom-Coms for the sake of their ladies. And I wonder if they hadn't chosen the actors and actresses for the dozen or so lead and supporting roles so well, this film would have been more of a stinker. But they procured a fine ensemble cast and that keeps the smell down to a bare minimum. \r\n\r\nThere are awkward, cringe-worthy moments that don't make me giggle as they are supposed to - too much gray in my hair, perhaps? (And there isn't that much really!) But despite those awkward lines, to paraphrase a line in the movie, I like it just the way it is. And I think it should have been kept just the way it was. I am now referring to the sequels. Don't get me started, please. The follow-up turned into what just referred to, what the original film could have been like if they hadn't kept their eye on the proverbial ball. As for the second sequel, I just found out today that it exists and I will keep my distance. Stick to the original, I say, and let the rest of the franchise float unbidden out there, just beyond the corner of your eye.", "created_at": "2020-04-04T09:57:07.592Z"}, {"movie_id": 634, "review_id": "5f45599b99d5c3003ac15d32", "author_rating": 7.0, "review_text": "_**Edgy, cute and amusing romcom with Renée Zellweger, Hugh Grant and Colin Firth**_ \r\n\r\nA cute female in London (Renée Zellweger) is concerned about spinsterhood & other womanly issues and so starts an honest diary that narrates her misadventures catching the eye of her suave boss at a publishing company (Hugh Grant), her quirky friends and her relationship with a boring man she hates but somehow finds quietly attractive (Colin Firth).    \r\n\r\n“Bridget Jones’s Diary” (2001) is an English romcom that tries to be edgy, cute and amusing simultaneously. While it goes overboard with the cussing (less is always more) and the accents are too thick to grasp at times, the flick eventually won me over because it tries so hard and everything builds to a comical melee. It helps that Renée is adorable in a roundish way and is tastefully shown in alluring apparel, including a playboy bunny outfit.     \r\n\r\nThe film runs 1 hour, 37 minutes, and was shot London, Surrey, Gloucestershire and Hertfordshire, England.\r\n\r\nGRADE: B", "created_at": "2020-08-25T18:34:03.391Z"}]