[{"movie_id": 293167, "review_id": "58d96993925141442f028bef", "author_rating": 6.0, "review_text": "Don't let the title and promotional material fool you: Kong Skull Island is more military commentary and homage to Apocalypse Now than simply _another_ King Kong movie. In that sense it brings something new and fresh to the series, and is also very much a period piece--a period that all too recently seemed to be contemporary history, not the distant and unfamiliar past in which the film takes place.\r\n\r\nAfter a prologue set during WWII, the current setting of the film opens in the waning days of the Vietnam War. While plenty of films have explored the war in Vietnam, Kong eschewed using combat or anti-war demonstrations on the homefront as the focal point. The Draft, flag burnings, use of the term \"Charlie,\" etc are all absent from the film. Instead, it takes the unique perspective of war from an elite group of soldiers contemplating going home--back to \"The World.\" While some characters look forward to reuniting with friends and family, the contempt for the army and the war that is seen in other Vietnam movies is also absent. These guys are soldiers and they are proud of that; it means something. Their commander is portrayed as an old war horse who is contemplating a future with no war to fight. \r\n\r\nIn the midst of all this, two scientists named Bill Randa (John Goodman) and Houston Brooks (Corey Hawkins), lobby to have a military escort assist them in exploring an uncharted island. Randa and Brooks assemble their team which consists of tracker James Conrad (Tom Hiddelston) photographer Mason Weaver (Brie Larson) a geologist San (Jin Tian) and a few other scientists not fleshed out enough to even remember. \r\n\r\nThey meet up with Lt. Col. Packard (Samuel L. Jackson) and the the soldiers we met earlier in the film. With all these convenient characters in place, the movie really begins.\r\n\r\nThe film shifts gears from being a period piece that goes out of its way--sometimes with distracting effect--to showcase outdated technology (a scene in which the camera pans to a table of rotary phones and then lingers for a few seconds comes to mind), to a Tarantino-esque homage to Vietnam War movies. The cinematography is excellent. Jordan Vogt-Roberts makes good use of the physical environment (coincidentally, Vietnam) and made me realize just how in need we were of a beautiful Vietnam War movie in the age of 4K and Real 3D. \r\n\r\nComplete with Credence Clearwater Revival and Jefferson Airplane songs, equipment-laden soldiers marching through swamps, dogtags clinking together, their helmets advertising what they decided to scribble on them, the jolly Green Giant presses on through the jungle--the director's love of Vietnam War movie visuals on full display, the movie moves along with great fun.\r\n\r\nHowever, when the titular character first shows up, the action-packed visuals begin to detract very quickly from the mood Jordan Vogt-Roberts established in the first third of the movie. In the excessive age of more is better, the movie stumbles a bit, threatening to collapse under the weight of its title monster. \r\n\r\nThankfully Kong is reigned in and the human characters are able to command some attention. At this point, the camp is divided in two: Military vs. Civilian. While the Army soldiers are on a rescue mission to bring back one of their own, the civilian folks meet up with the island's native population--including a downed WWII pilot (John C. Reilly) who's been on the island for 30 years. Through him we learn that Kong is a protector of the island. That he is, in fact, not the monster at all. \r\n\r\nPackard is not having any of this, of course, because Kong killed some of his men. This is where the movie makes its statement. Kong is the combatant that fights to protect the natives--much the way Packard and his men are portrayed. Packard mentions that soldiers do the dirty work so our friends and family back home don't have to be afraid. In this, Kong and Packard have a kinship--common ground shared by all soldiers: They do the dirty work so you don't have to. Unable or unwilling to see this, Packard decides to wage a personal war against Kong.\r\n\r\nThis is unwise as Kong protects the island from \"Skullcrawlers\"--massive lizard-like creatures who would eat any living thing on the island if not for Kong's presence. \r\n\r\nThe civilians begin to see Kong as not only necessary, but as compassionate and humane. He saves a trapped water buffalo, marvels at the sight of the aurora borealis, and has a brief but tender moment with Conrad and Weaver. He is the soldier whom, during a lull in the battle, is shown as a well-rounded individual, a reminder that being a soldier is something one does; not something one is. This is also true of other soldiers in the film, such as Cole and Mills. Packard, however, has gone off the deep end. A showdown between he and Kong is inevitable, and with Kong out of commission, the Skullcrawlers are able to run amok and create problems for our heroes.\r\n\r\nAt this point Kong is miraculously resurrected to save the day because the scrip said so. And he does. And the film ends on the sappiest, corniest, and most contrived of happy Hollywood endings.\r\n\r\nWhere the film works, it works well. Its commentaries on soldiers and soldiering are interesting without being heavy handed. Despite the Vietnam backdrop, Jordan Vogt-Roberts avoids making a commentary about the Vietnam War specifically, avoiding political controversy in the process. The actors make good use of what material they have to turn in decent performances. In a movie with Brie Larson, Tom Hiddelston and Samuel L. Jackson, it's John C. Reilly, Jason Mitchell and Shea Whigham who steal the show. Also, Kong looked terrific. The CGI work is better than what the Peter Jackson remake gave us--though the Skullcrawlers looked laughably cartoonish.\r\n\r\nBut, the movie has its faults as well. Its parallels to Apocalypse Now can be distracting at times. As is common with ensemble pieces, there are too many characters on the screen for any one of them to get enough screen time to become memorable. Hiddleston in particular had the least material to work with. His character--such as it was--had no depth or personality. He was simply action movie trope. The interactions between Larson and Kong only work because we know that King Kong has always been a Beauty and the Beast tale. It's forced. Giant ape and pretty blonde get along, because it's a Kong movie. For the uninitiated, it could just feel jarring and uneven.  \r\n\r\nAll in all, the film succeeds as a blockbuster to eat popcorn to. Yet it tries, with varying degrees of success, to reach beyond that. While Kong deserves an A for effort, a B- is all it achieves in its execution. Also, the interesting and unique aspect of combining Vietnam War movies with the Kong mythos is highly rewarding for the audience.\r\n\r\nBetter than average, but still far from perfect.", "created_at": "2017-03-27T19:35:47.023Z"}, {"movie_id": 293167, "review_id": "59226c3bc3a368791205cd25", "author_rating": 6.0, "review_text": "Thought that Peter Jackson's _King_ _Kong_ movie could have done without the entire first act? Though that the _Godzilla_ movie set in the same universe should have shown their big beastie a whole lot more? Well _Skull Island_ fixes those problems, and replaces them with a whole bunch of new ones!\r\n\r\nI had a lot of fun though. So it passes into the realm of a positive review by the skin of its octopus-riddled teeth.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2017-05-22T04:42:35.161Z"}, {"movie_id": 293167, "review_id": "596c76f59251416b210013c3", "author_rating": 7.0, "review_text": "I really wanted to give this movie a better score but I just could not bring myself to overlook the stupid and crappy story.\r\n\r\nOkay, let’s start with the bad. The movie is about a group of explorers exploring this Skull Island. No surprise there. They are accompanied by a military detachment. Somewhat okay still, there is a half decent explanation for that. One of the main characters in the movie is Lieutenant Colonel Packard. At first, I quite liked him, especially when he told off the journalist informing her that they did not loose the war, it was abandoned by the politicians.\r\n\r\nHowever, from then on it goes really bad. Warning, spoilers ahead!\r\n\r\nOnce on the island Kong is revealed rather quickly. Something that I felt was a bit of a shame. There was no suspense building up for the reveal of the mighty ape. Okay, I could live with that. What I cannot live with is that these total dumb-asses, having discovered a scientific find of unprecedented magnitude, goes straight on to shooting off their guns. What the fuck? Not only that, they just keep shooting and circling around him while he trashes them one by one. That scene, while sporting some impressive action and CGI, was just so fucked up that one wondered if the author deliberately wanted to insult the audience.\r\n\r\nFrom then on I just cringed every time Colonel Packard was in the picture. He was clearly mentally unstable. He doggedly continued to want to kill Kong and used retrieving his men as a poor excuse. This is just the kind of shitty, overused and cliche’d Hollywood script that drives me nuts.\r\n\r\nNow, with that over with, the movie was technically quite good. The actors are doing a decent enough job of their roles. The story, excluding the Vietnam references and general let’s make the military look bad old bullshit, was actually not to bad. It was a different take on the King Kong history for sure.\r\n\r\nThe CGI, the action and the various monsters were very cool. Not surprisingly King Kong was not the only threat on the Island. This time they did not just throw a few dinosaurs in but was rather creative bringing in creatures from all kind of animal (and insect) families as well as some home cooked ones, the skull crawlers.\r\n\r\nThe scenery is also very enjoyable. Apart from my gripes mentioned above I did enjoy a lot of the movie. However, the military clusterfuck that the script writer threw in there severely diminished my enjoyment of the movie and I cannot really bring me to give it more that a 3+ out of 5 score.", "created_at": "2017-07-17T08:36:05.967Z"}, {"movie_id": 293167, "review_id": "598349469251416acc000006", "author_rating": 8.0, "review_text": "Yeah. That was an unconventional encounter.\r\n\r\nSo here we have it, part two of the franchise reinvention of the beloved iconic creatures of cinema lore. After the 2014 redux of Godzilla was something of a tonal misstep, it's unsurprising to find this version of the King Kong legacy going all out blockbuster popcorner, and with that it succeeds - kinda.\r\n\r\nPlot is wafer thin, bunch of humans from various professions rock up at the uncharted Skull Island, each with differing levels of interest as to what might be there. Of which they quickly find out is a whole heap of trouble - big trouble!\r\n\r\nIt's clear that the makers, fronted by director Jordan Vogt-Roberts, are trying to blend crowd pleasing mayhem with thoughtful observations of not only the period the pic is set (1973), but also of man's inherent propensity for stupidity. On the surface, the battles and creature feature carnage in general, are wholly entertaining, but it's sometimes just too ridiculous for its own good. Even worse is that it's shallow, with no real substance of note, particularly where the characters are concerned, rendering a very admirable cast as one note players in the monkey maze.\r\n\r\nHowever, irritants aside, the pic is great fun, with enough excitement and quippy dialogue to make the time spent on Skull Island worthwhile. Be it man versus beasties and the alien terrain they traverse, a popcorn muncher it be. There's some sly humour within (Tricky Dicky Nixon going down), and the nods towards Coppola and Cameron et al are pleasing as punch. You may have to lower expectation levels to not let the problems it has drag you down, and for sure it's not hard to understand why a lot of folk hate it, but it's not a disaster, far from it.\r\n\r\nOne does hope, though, that the next instalment in this series goes up another couple of notches, for Kong, Zilla and the other monster gods deserve it. 7/10", "created_at": "2017-08-03T16:03:18.987Z"}, {"movie_id": 293167, "review_id": "59fe205bc3a3686853025652", "author_rating": 6.0, "review_text": "**A new dawn. The King has arrived.**\r\n\r\nSeems I'm the only one who did not know it was not a sequel to the 2005 film. The Kong was over a 100 feet tall in this, compared to 25 feet from a decade ago. Being a big fan of that film and Peter Jackson, I hated this idea, especially for totally a fresh cast and crew. So I was not expecting it. Only while watching it, I came to know it was a new version. With a new cinematic, a new set of actors, timeline, completely a different kind of tone for a King Kong film that I have ever seen.\r\n\r\nThey wanted it to be a badass action film than a value added storyline. That does not mean I loved it. It was average. I only enjoyed the nice action-adventures. But the visuals were a more commercialised. I even confused whether did I watched a Hollywood film or an Rajamouli film. You know those terrible methods used for stunt sequences.\r\n\r\nThe most boring part of this film was the same old formula, which is a set of people enter in a dangerous enclosure and only a few come back alive. A couple of scientist escorted by a military to a mystery island hidden in the mists of the South Pacific to do some scientific research. Soon they come to realise they are in a dangerous place where giant monsters live. After losing some of the soldiers, now it becomes a survival game. But the general is obsessed with a revenge. How the rest of the story folds were told with a battle of the film.\r\n\r\nBasically, this film was created to merge two franchises, the rebooted 'Godzilla' with this one. The post end-credit scene gave some important hint about the future of the franchise. But I thought it was too similar to the comedy flick, 'Journey 2: The Mysterious Island'. Usually spoof films were made out of greatest hit films. But it looks like here a reverse case. Though all the actors were good. Nice direction, visuals, music, particularly the sound effects. This film is simply enjoyable and forgettable.\r\n\r\nThere are many things I did not like. The Peter Jackson film was so artistic. Every frame was like a classic painting. In this, the Kong standing on his two feet, walking around like a man, totally turned me off. The giant ape did not behave like a real ape. Many sequences were also borrowed from many other films, only replaced with different creatures and recreated with a fresh setting. This is a perfect time pass film to have on a weekend. Particularly, if you are a graphile (graphic+phile), you would have a nice time.\r\n\r\n_5.5/10_", "created_at": "2017-11-04T20:17:31.452Z"}, {"movie_id": 293167, "review_id": "5e9ce8a9d18fb9001d910c11", "author_rating": 7.0, "review_text": "Alright. So i like action movies. I like King Kong. So when you have this idea of having the traditional king kong story made into a action movie about monsters in the skulk island, that sounds like a fcking great idea. The best part of King Kong was all this other monsters in the island. But this film is the first one to tell the story of kong completely from that perspective. What i also really liked was that it was still very human even though its a monster movie. I personally enjoyed it very much like with any other Kong film there is the love angle which is done with brie larson character which i thought was really sweet to put into a movie that concentrates on being a fun movie. And it achieves being a fun movie. I had a lot of fun watching this film. The plot is simple. The vfx is really  done well. The action sequences where good. Is it forgettable? Kinda. You have that nice 70s nostalgia around it but it doesn't stay there because after all its all in the island of the world. It was a very fun experience and very satisfying. I didn't get bored with it. It had my attention. It was good. So overall, should you see it? Yes, if you have the time and you are in the mood for an action movie go watch it. It will entertain you for most of its run-time.", "created_at": "2020-04-20T00:11:21.047Z"}, {"movie_id": 293167, "review_id": "60635ed1a39d0b003d44894d", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAfter a pleasant revisit to Godzilla (2014), now comes the time for Kong: Skull Island, the second installment in Warner Bros. and Legendary’s shared cinematic universe. I watched this film at its original release date and never saw it again. Not because I deeply disliked it or anything of that level, but I never felt a strong desire to rewatch it. I remember feeling indifferent towards the movie since it didn't really surprise me in any aspect. If there's one thing no one can complain about MonsterVerse, it's the jaw-dropping visuals that would evolve beyond the wildest expectations as years went by, but even these didn't blow me away completely in this film. Nevertheless, a small part of me had high hopes for this rewatch…\r\n\r\nThe screenplays of these first two movies are pretty similar concerning their narrative structure. Naturally, most of the runtime is spent with human characters who, in this case, wander around an uncharted land supposedly to perform geologic studies. This time, more monsters are displayed on-screen besides Kong and his main adversary, leading to more action sequences, most in broad daylight, which is a major plus. Basically, any viewer is able to follow every fight, even the ones that happen at night since they're beautifully shot by Larry Fong (DP), who uses fire as a lighting device to produce some wallpaper-worthy images. Kong looks incredible, and the monster fights are utterly riveting.\r\n\r\nThe monsters' visuals hold up strong for most of the runtime, except when humans get involved. Despite a fantastic scene between Kong and Samuel L. Jackson's character, some of the humans vs. monsters sequences are way too weird. Several feature too noticeable green screen, mixing humans and monsters in close proximity, which didn't work as seamlessly as intended. Still, viewers who complained about the lack of Godzilla in his own flick will be more satisfied not only with the increase of action sequences but also with the main monster's sightings. Kong is a visible, powerful presence throughout the film, and Jordan Vogt-Roberts used him right when the movie needed the big monkey the most.\r\n\r\nHowever, the characters are so hollow, cliche, insignificant, and underdeveloped that the time spent with them is much heavier than in the previous film, which is by far, the biggest problem with this movie. It's true that Godzilla doesn't deliver a perfect balance between humans and monsters, but at least the former group feels like such. From clear motivations to well-defined personalities, the protagonists are quite compelling and captivating, making the third act reach greater levels of excitement and overall impact. The short period of monsters fighting each other is so efficient and feels so good that viewers left the theaters demanding more, but this feeling only arose due to the time spent with the human characters that offered bigger stakes to the last act.\r\n\r\nVogt-Roberts' film features a great cast, no doubt about it, but only John C. Reilly's character gets a decent arc. Therefore, despite spending more time with humans and seeing fewer monsters in Godzilla, Kong: Skull Island feels slower and lazier (so many unnecessary exposition dumps), ultimately transforming the higher amount of action less impactful. In addition to this, a couple of likable characters meet their end in an extremely underwhelming, embarrassingly illogical manner, which always leaves me a bit annoyed. I wish the screenwriters delved more into Kong's story through other methods besides generic exposition, but at least they keep the \"balance of nature\" overarching narrative from the cinematic universe.\r\n\r\nTechnically, I already applauded the visuals above, but I'll do it again. Kong truly is a beauty of a monster. Any wide shots of him standing up are outstanding, but the one with the sunset in the background is a gorgeous painting on the screen. Henry Jackman's score is definitely exciting, possessing a memorable Kong's theme music. Tom Hiddleston (Thor films, Avengers: Infinity War) and Brie Larson (Captain Marvel, Avengers: Endgame) make a good duo, but John C. Reilly (The Lobster, Tale of Tales) steals the spotlight. The editing (Richard Pearson) could be a lot better, but overall, it's a well-produced blockbuster, as expected.\r\n\r\nKong: Skull Island doesn't reach the level of the previous MonsterVerse's installment, but it's far from being a massive disappointment. Jordan Vogt-Roberts' sophomore movie follows a similar narrative structure to Godzilla, just with more action sequences (visible and in daylight), more monsters, and a visually stunning Kong. However, most of the runtime stills belong to the humans who, unfortunately, are nowhere near to being as compelling as in the previous film. Except for John C. Reilly's character, everyone else is incredibly hollow, annoyingly cliche, and significantly underdeveloped, making the time spent with them quite heavy. The excessive reliance on lazy exposition scenes also drags the movie, ultimately turning the monster battles less satisfying. Some narrative decisions concerning certain characters are questionable, to say the least, but overall, I believe it still offers what viewers are looking for. Huge praise to Larry Fong's beautiful cinematography and Henry Jackman's addictive score.\r\n\r\nRating: C+", "created_at": "2021-03-30T17:24:33.645Z"}]