[{"movie_id": 446807, "review_id": "5bf71e069251417c1d069ba5", "author_rating": 5.0, "review_text": "Lackluster entry in the Millennium film series:\r\n\r\nA solid performance by Claire Foy (First Man, Unsane) can't do much to elevate a weak script that, quite often, not only asks you to suspend your disbelief, but to abandon your disbelief altogether.\r\n\r\nThis film is based on the fourth of five books (to date) in the popular \"Millennium\" series of novels, which happens to be the first of the books written by author David Lagercrantz after the passing of original author Stieg Larsson. The first three books were adapted into a trilogy of films in their native Sweden (all of which were released in 2009), and the first book, The Girl with the Dragon Tattoo, was given an American adaptation helmed by David Fincher in 2011.\r\n\r\nThe story of the newest entry in the film series revolves around a top-secret program called Firefall, which would allow whoever wields it to take control of the world's nuclear weapons. The program was designed by Frans Balder (Stephen Merchant), who has a young autistic son. Balder, having come to realize that the program is too dangerous for any government to control, contacts super-hacker Lisbeth Salander (Foy), asking for her help to find and destroy the program. Unknown to them,however, a mysterious group known only as the Spiders are also after the program. Salander receives help along the way from good friend Mikael Blomkvist (Sverrir Gudnason), a journalist working for Millennium magazine (from which the book series gets its name). In the meantime, Lisbeth's attempt to acquire the Firefall program leads American National Security Agency security expert Edwin Needham (LaKeith Stanfield) to travel to Sweden in hopes of tracking her down.\r\n\r\nAction abounds, and as the film progresses we learn the identity of the leader of the Spiders, a secret tied to Salander's murky past. Eventually all parties converge on a house in the mountains that is all-too-familiar to Salander, where the film's climax plays out.\r\n\r\nThe film appears to retcon certain details from the previous films (e.g. Blomkvist is younger than he should be), which can be off-putting to those familiar with those films.. Vicky Krieps, who audiences may remember from her fantastic performance in 2017's Phantom Thread, is wasted in a brief appearance as Millennium's publisher Erika Berger. While Salander has been established as a first-class hacker in previous films (as well as in the books on which they're based), here her hacking skills often reach levels of unbelievability. An example of this: in one scene Salander hacks into a car's systems while actively pursuing in another car.\r\n\r\nIn the end we are left with a film that could have been greater than it is, but which was hobbled by a poor script filled with overly convenient contrivances. The film's one saving grace is Foy, who does the most with what she is given.", "created_at": "2018-11-22T21:22:14.424Z"}, {"movie_id": 446807, "review_id": "5c409352c3a368638a41e5f3", "author_rating": null, "review_text": "While I enjoyed this film, it was a bit of a disappointment compared to the others in this series. As noted by other reviews, the film is haunted by an incredibly poor script. On the other hand, the action is pretty good if you can tolerate the long, poorly scripted scenes in between. \r\n\r\nThe film tries too hard to surpise us with twists, some of which are predictable and others which are just flat. Some of the circumstances in the film are far-fetched. I don't mind suspending belief a bit, but this is neither a fantasy or a science fiction film, so there should be some reasonable level of reality. Several scenes are just ridiculously beyond reason and logic.\r\n\r\nClaire Foy is an excellent actress and I like watching her. She did the best she could with this script. It's unfortunate that the directors chose to portray her as a bit haggard and completely without sex appeal. Certainly, the character of Lisbeth Salander is intended to be a nonconforming ruffian, but Claire Foys' depiction of her is considerably rougher than Rooney Mara's and far less sexually-charged than Noomi Rapace's. This is a shame as Claire Foy does have sex appeal; she either chose or was not encouraged to to use it here. \r\n\r\nIt's an acceptable addition to this series, but it's mediocre in comparison to it's predecessors.", "created_at": "2019-01-17T14:38:10.507Z"}]