[{"movie_id": 49529, "review_id": "52fca6d2c3a3682ce442dc43", "author_rating": 3.0, "review_text": "Totally forgettable and full of stereotypes", "created_at": "2014-02-13T11:04:50.632Z"}, {"movie_id": 49529, "review_id": "5a111ae592514138ea0443ee", "author_rating": 8.0, "review_text": "Edgar Rice Burroughs wrote his series of John Carter novels before space flight was more than a fancy.  This movie is more adventure and romance and very little (if any) actual science.\r\n\r\nThis movie is the best production of A Princess of Mars, the first story in the series, that I've seen.\r\n\r\nIf you're a fan of the John Carter novels then you will probably get some enjoyment from John Carter.  While there are some differences you'll meet some familiar characters and recognize quite a few relevant plot points.\r\n\r\nNot a great film, but not a bad one, either.", "created_at": "2017-11-19T05:47:17.163Z"}, {"movie_id": 49529, "review_id": "5a650b850e0a2619fe02e6f0", "author_rating": 6.0, "review_text": "We sat down and watched this movie on Blu-ray yesterday evening to nicely end our little excursion day. This is a good film but it could have been (much) better.\r\n\r\nThe film itself and its special effects are quite good. I would say that the special effects are very good. The airships are very cool looking. The design nicely captures the retro atmosphere of the book without looking silly. I think they made the green men too slim though. I have always pictured them as way more bulky and monstrous. I like Woola’s appearance although him moving around at “supersonic” speeds is a bit over the top.\r\n\r\nHowever, why is it that every film-company/producer/director/whatever now thinks that he can take an old classic, slam on the name in the title, and then do what the hell he likes with the material? This film has borrowed the basic idea and the names from Edgar Rice Burroughs John Carter book but almost nothing else. At most 10% of the story of the books is in the movie. The rest is pure invention and it does not improve the story. As a matter of fact it turns what was a good story into a standard unintelligent Hollywood faire. Been there, seen that, done that.\r\n\r\nThe examples are plentiful, the white apes the size of dinosaurs, the city of Zodanga moves around (what the f…), most of the plot as I said before is invented, the Therns have a completely different role etc. etc.\r\n\r\nI especially dislike how they have made John Carter, the honorable gentleman from Virginia, into a fairly plain American guy who at first refuses to do the “right” thing. And what about these bloody wife and child flashbacks? That’s just disturbing.\r\n\r\nNone of this improves the movie. It got 6 stars, it could have gotten 9 or 10 if it had followed the books properly. It is Disney’s own fault that this movie was a disappointment at the box office, they screwed with classical material…again.", "created_at": "2018-01-21T21:52:05.227Z"}, {"movie_id": 49529, "review_id": "5facbaf990ea4b00419ced33", "author_rating": 7.0, "review_text": "Unfulfilled potential, still narrowly liked it.\r\n\r\n<em>'John Carter'</em> can feel underdeveloped and underwhelming, you could even argue it aimed to replicate <em>'Avatar'</em>, but there's enough there that allowed me to find a fair amount of enjoyment.\r\n\r\nTaylor Kitsch is alright, I rate him, but a more convincing lead performance was necessary in my opinion. The rest of the cast, despite some well known names, fail to deliver anything noteworthy. Willem Dafoe works as Tars Tarkas, though only due to his distinctive voice; none of his dialogue etc. stand outs. The likes Samantha Morton, Mark Strong and Bryan Cranston give forgettable performances; arguably not their fault.\r\n\r\nThe premise has all the possibilities to be great, sadly the film fails to make their mark with it. The ending is extremely rushed, even for a 132 minute production. Visually it's good, but that's one of very few plus points - I haven't got many truth be told, but anything less than a 7* feels harsh.", "created_at": "2020-11-12T04:32:57.717Z"}, {"movie_id": 49529, "review_id": "63c2004f23be4600d960e7b1", "author_rating": 1.0, "review_text": "Dad raised us on what he lovingly called \"Pulp Trash Novels\" and that carried over to adult life where they are proudly displayed along side academic books. Actually they take the top shelf.\r\n\r\nSo, walking into this I was scared and unfortunately I had every right to be.\r\n\r\nNow I am fine with artistic licenses, I wasn't expecting it to be exactly like any of the books.\r\n\r\nBut I was expecting it to at least follow the source material a little, something more than just the names. In short, I was expecting a John Carter movie in more than just name only.\r\n\r\nAnd, frankly, this didn't even feel like a movie based on pulp adventure novels, which for me was a key point, it could take all the liberties it wanted so long as it still played out like a pulp adventure novel. Unfortunately, it fell short on this.\r\n\r\nAnd, to make it even worse, it was boring.\r\n\r\nIf you like the source material, if you like adventure for really the sake of adventure and escapism, then stay away, stay far, far away.", "created_at": "2023-01-14T01:07:27.411Z"}]