[{"movie_id": 403119, "review_id": "594abb3b925141314b001867", "author_rating": 4.0, "review_text": "**Missed Opportunity**\r\n(Review is spoilerish)\r\n\r\nComing on the heels of last summer's surprise success _The Shallows_, comes this summer's laughable attempt to portray shark behavior. While shark movies since _Jaws_ have been scientifically inaccurate, you have to throw a movie like _Jaws_ a bone because, well, it's _Jaws_. It was a wonderfully made film, released at a time when we knew little to nothing about the nature of great white sharks. After 30 years of documentaries and Shark Week, the cinematic shark is still a mindless villain whose soul reason for existing is to move the plot forward, and eat it when it cannot.\r\n\r\nI'd like to say what _47 Meters Down_ lacks in accuracy it makes up for in plot, suspense, and characters. But that's just not true. The script seemed to be a first draft, full of plot holes and non-existent characterization. It was a typical tell-not-show movie, where characters, through dialogue, literally explained themselves to the audience, rather than establish themselves through action.\r\n\r\nThe film opens with a pretentious and symbolic shot of a spilled drink to mimic blood in the water, I guess, in case, you didn't know this was a shark movie? We narrow our focus to two American sisters vacationing in Mexico. Later in the movie, when the script necessitates it, the younger sister, Kate, is portrayed as athletic, heroic, courageous, and endowed with other noble attributes. We learn this not through 20 minutes of established characterization, but through the older sister, Lisa, lamenting about how she is the shy, boring one, while Kate is more adventurous and outgoing. \r\n\r\nInstead, the first 20 minutes of the film establishes Kate as nothing more than a party girl--making out with strange men, doing tequila shooters, dancing on the beach. We find out that Kate is kind of awesome, but only because Lisa, virtually, says to the audience, \"My sister is awesome.\" But in the 20 minutes of exposition we get on the sisters, all we really have to work with is what amounts to a music video--quick shots of drinking and dancing.\r\n\r\nLisa's characterization--while presented in the amateur way of awkward dialogue (Hey, \"sis\"--in case you didn't get that they were sisters--I'm here because of this terrible thing that's going on with my boyfriend, and that's my motivation for the next 90 minutes)--is at least presented to us. However, in tripe ripped from the most unromantic and unfunny of romantic comedies, Lisa's every action--including, apparently, kissing another man--is to impress some guy back in the States who has already left her. You know, because a woman's self worth and sense of identity is tied directly to a man (insert eye roll here).\r\n\r\nNow the movie becomes a movie. The sisters head out to sea to go shark diving, encountering a captain who goes back and forth between paternally concerned and grossly negligent, and a mate who is, for all intents a purposes, a total dick for reasons never explained.\r\n\r\nAfter we've established that Lisa has never dove (dived?) before, and that Captain Taylor is perfectly fine with that (the equivalent of taking someone who's never driven before and entrust them with a semi on our highways), and that shark cage and winch system is faulty--essentially telegraphing everything that is going to go wrong--the girls get in the water, see some sharks swimming around and then, plummet to the bottom, 47 meters down.\r\n\r\nThe film becomes both engaging and obnoxious at this point. The sharks are out there, lurking in the darkness, popping up for scares here and there to jolt the audience. At that point it becomes like a monster movie--a haunted house type movie, with our two protagonists trapped in a metaphorical basement. That's all well and dandy, as are the scenes of pure suffocating terror. There's an almost psychological horror element in some scenes, with Lisa so disoriented in the darkness, she doesn't know which way to swim to reach safety. \r\n\r\nHowever, the situational suspense wears thin quickly. Rather than using atmospheric suspense, the filmmakers relied on suspense through situations where everything goes wrong. Constantly. Putting on another tank of air takes 20 minutes. I was never sitting there saying, \"Oh my God, how are they going to get out of this situation!?\" I was going, \"Oh my God, how long is the director going to milk this scene for!?\" I wasn't in suspense; I was frustrated. \r\n\r\nFinally, we have an ending that could have--should have--saved the whole movie. It's hard to go into specifics without giving away MAJOR SPOILERS to a kind M. Night Shamaylanesque \"twist ending\" so you may want to stop reading now, though I intend to be as vague as possible.\r\n\r\nOkay, what works with the ending...\r\n\r\nIt provides a nice twist that I didn't see coming. I thought it was very clever.\r\n\r\nWhat didn't work? Well, unless you have some familiarity with diving at certain depths, it might seem as if it's coming out of left field. I understood what was happening, so I understood the ending. But for the uninformed, it might be confusing--and that confusion would ruin the impact. There simply wasn't proper information given to the audience to decipher the ending for themselves unless they familiar with things such as the so-called \"rapture-of-the-deep.\"\r\n\r\nBut where the ending really shot itself in the foot was the denouement that follows and ties everything up in a nice, safe, Hollywood ending. Basically, if the movie had ended two minutes sooner, with the camera slowing pulling back from a girl trapped in a shark cage, the rest of the movie's sins could have been over looked.\r\n\r\nOne of the drawbacks though is the same that plagued Blair Witch Project: The ending _is_ the movie. But the first 80 minutes are not strong enough to get you to the final ten more than once or twice. I'll probably never see this film again. Despite that, I didn't despise it. I'm not going to sit here and tell you that it was the worst $11 I've ever spent or that I want the last two hours of my life back. It accomplished what it set out to do in the most shallowest of terms, and I'm good.\r\n\r\nDespite it's many flaws, I was pleased with Mandy Moore's performance as Lisa. She seemed to be the only actor who was consistent in relying--through action, dialogue, demeanor and tone--exactly who her character was. Also, the film stayed away from the gratuitous T&A shots that plagued similar films like last year's _The Shallows_ (was Bake Lively's butt never _not_ in frame?) 2005's _Into the Blue_ that seemed to focus more on Paul Walker's abs and Jessica Alba's curves than the actual plot itself, and 1977's _The Deep_, best known for two hours of Jacqueline Bissett in a wet t-shirt.", "created_at": "2017-06-21T18:30:19.954Z"}, {"movie_id": 403119, "review_id": "59c09ab3c3a36804db00b18e", "author_rating": 4.0, "review_text": "I spend an inordinate amount of time watching shark movies. They're almost never good, and they're almost never well made. _47 Metres Down_ on the other hand **is** well made.\r\n\r\nIt's still not good though.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-09-19T04:18:59.491Z"}, {"movie_id": 403119, "review_id": "5a7717040e0a26642704abae", "author_rating": 6.0, "review_text": "**Let the surviving game begin in the deep and the cold ocean floor, surrounded by dangers!**\r\n\r\nObviously it is this year's 'The Shallows'. So anther shark attack film, but this time it goes down to the Mexico. Two sisters vacationing somewhere on the coast of the Mexico, decides to go cage diving to see sharks with the locals they have met in the pub. It was intentional tale, so it all goes straight to the point without wasting much time. When their turn comes to go below in the sea, something goes wrong and they end up 47 meters down on the ocean floor with the limited oxygen supply. It's a long way up and dangerous to get to the surface without proper gears. Their struggles to get out of from there safely and other adventurous events covered in the remaining film.\r\n\r\nFrom the not so famous filmmaker and the actors. But it's good to see Mandy Moore after a some time. I don't know how much realistic it is, though a decent thriller. Yeah, there are better films on this similar theme, but still this is enjoyable, especially if you are not a regular film goer. There are some fine edgy moments, but it did not maintain that till the last. The end twist was not bad. I truly did not expect that. That does not mean it was awesome. It was okay, works decently for such random films. Well made with production quality. Short runtime as well. So I think it is slightly better than what it has been rated. That means not bad for watching it once.\r\n\r\n_6/10_", "created_at": "2018-02-04T14:21:56.647Z"}, {"movie_id": 403119, "review_id": "5f821b2e91b5300037b6c75f", "author_rating": 6.0, "review_text": "47 Meters Down works on the old idea of great white sharks scaring a bunch of people (two sisters, in this case) but there's a bit of novelty (it takes place on an ocean bed) that makes the watch an enjoyable ride. While the dialogues - which seemed like they were just being spoken to help the audience understand the situation of the girls better - seemed inauthentic, everything else is pretty good here. A cool late-night watch with the family. TN.", "created_at": "2020-10-10T20:35:58.943Z"}]