[{"movie_id": 489064, "review_id": "5db928920792e10018462d4c", "author_rating": 3.0, "review_text": "Whether the ultimate failure of ‘3 From Hell’ lies in a troubled production or creative exhaustion on the part of Rob Zombie, this shambling revenant of a film is something that might only be appreciated by the most indiscriminate midnight-movie crowd and diehard fans of the series.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-3-from-hell-they-should-have-stayed-there", "created_at": "2019-10-30T06:07:14.326Z"}, {"movie_id": 489064, "review_id": "5e073a05eda4b700172baa6a", "author_rating": 6.0, "review_text": "Fans have been waiting for a _Devil's Rejects_ sequel for a very long time. Well _3 From Hell_ is finally here and it's... a bit of a letdown. Not **bad**! But, after such a great second installment, and such a wait, just... a bit of a letdown. I absolutely adore Richard Brake but his inclusion apropos of nothing and Sid Haig's early removal due to his recent sad passing, felt almost... Disrespectful? I don't know. Expecting a Rob Zombie movie to be respectful sounds silly now that I see it written in front of me - I mean, he's got his wife wearing a feather headdress front and centre on the poster. (On that, I feel it's not altogether unlikely that Zombie included that attire specifically so that people would complain about it and he could counter with \"The character is already a serial killer, why are you looking for good behaviour from her, and why is her cultural appropriation the most offensive thing she's done to you?\" Which would be... you know... A fair point.) But I digress. _3 From Hell_ a little disappointing, probably not the sequel we would have gotten if there hadn't been a 14-year gap between the second and third entries, but still, pretty decent, a fun time, especially considering that after _House of_ the subsequent films have used gross murderers as the outright protagonists. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-12-28T11:18:29.758Z"}]