[{"movie_id": 299537, "review_id": "5c786175c3a36844d117ba8e", "author_rating": null, "review_text": "I would not pay to see it. I did see it for free already...so at least, I was not cheated of my money [\"I laughed, I cried, I kissed $10 good-bye!\"--most other movies]. I saw sneak preview a few months back and it was the full-length feature but it was missing music in the end credit section and may have some added additional editing since then.  What I did see, it was on par with Thor: Dark World in quality and has higher wokeness than Han Solo and Star War: Last Jedi. Probably worst Marvel movie since the start of this universe started with the great Iron Man...only thing that could have been worse if Inhuman movie was made. So hold on to your money and maybe watch this at 2nd run theater ($1.75 each...maybe $3 at most) or online free...so you know how this added character will lessen the Avenger's End Game plot. The CGI special effects are just okay but the simpleton story, underwhelming acting and almost-no character development are at the expense to make this the tops of any recent movies with its wokeness and identity politics…And Brie Larson character is just boring with no depth…just like Disney did to current Star Wars movies' female lead. DEFINITELY do NOT spend the money to see it on IMAX or any other expensive premium screenings or waiting in line on opening weekend. Maybe newer version (a few years back) Ghostbust(-h)ers was slightly better...which is not saying much. Already seeing highly rated tweets from critics, I am sure these are the same movie critics that gave great ratings to last years movies, \"The Favourite\" and \"Sorry to Bother You\". Yeah, Don't see this either!", "created_at": "2019-02-28T22:32:21.355Z"}, {"movie_id": 299537, "review_id": "5c81db1592514127631c0ea2", "author_rating": 1.0, "review_text": "Went in not paying attention to any of the drama surrounding the movie. The movie was just like the trailers, boring. Terrible fight choreography and all in acting by Brie. Cinematography was so bad, way too many cuts. Samuel L Jackson and Goose were brilliant and Mendelsohn was incredible as Talos. \r\nThe movie relied too much in 90s nostalgia. \r\nNot great when the main actor is out done by a cat.", "created_at": "2019-03-08T03:01:41.940Z"}, {"movie_id": 299537, "review_id": "5c823eac925141277d1c885a", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nAs a fair and impartial film critic, I need to state this: I don't care about the controversy surrounding Brie Larson or the agendas this movie is trying to push or not. I'm not part of any hate group or factions that hate those hate groups. I just want to watch a good superhero origin film, that introduces me to a new character that I'm supposed to care about and root for. Read my review, sure, but make up your own mind. Go see the movie and be honest. Since that's out of the way, let's keep going ...\r\n\r\nIt was always going to be a huge risk trying to introduce such an important and powerful character like Carol Danvers into the end of Phase Three. Not only she comes from nowhere (as far as I remember, she was barely mentioned in previous films or even not mentioned at all before Infinity War), but it's the last movie before the climactic, era-ending Avengers: Endgame. She is the one who is going to take our heroes to victory against Thanos, the bad guy who I dare say easily defeated on his own pretty much every superhero we knew until that moment. So, while I was not expecting an outstanding story packed with phenomenal action, I was also hoping for more than just a simple origin film like it came from Phase One.\r\n\r\nUnfortunately, that's exactly what I got. Everything is fine. Just okay. There's no exceptional fight scene, but most of it is decent. There's no visual wonder, but it doesn't look bad. The characters' potential feels wasted, but they work for the plot. Everything is frustratingly balanced, which is something I would praise in a bunch of other movies, but this isn't 2008 anymore. Marvel isn't starting its cinematic universe, it is almost finishing a whole arc involving more than 20 installments! I'm going straight to the one character everyone wants to talk about: Goose ... Sorry, Captain Marvel! Jokes aside, this is one of the issues I was worried about going into the film theater. I escaped 99% of the marketing for this movie as I do with every other flick. I didn't watch a single clip/trailer, I know as much about the controversy surrounding this installment as my dog and I kept my expectations realistic having in mind what I truly know about the film and only the film itself. The one thing I was not able to hide from were the headlines giving tremendous praise to ... a cat.\r\n\r\nNow, follow me on this: I'm going to watch a superhero origin movie. A whole new character is waiting for me at the big screen. I'm excited to know more about her, where does she come from, what her powers are and so much more. Some headlines show up on my social media feed, and I find that a CAT \"steals the show,\" \"deserves a spin-off,\" and I don't even know what more. Granted, the cat is indeed funny. It provides some chuckles here and there. That's it. I love cats, but I honestly can't figure out why everyone is so amazed by an animal doing animal things. Maybe it's because the rest of the film isn't that entertaining ... or perhaps just because people really, really love cats. Like the movie itself, I think it's a mixture of both options.\r\n\r\nBack to what matters and to who everyone should be talking about: Brie Larson. Marvel rarely misses its casting choices, and being Larson an Academy-Award winner, her talent is undeniable. She has everything she needs to consistently deliver a strong performance, so I'm surprised that she couldn't stand out from the film's overall blandness. I repeat, the movie isn't bad, at all. However, I was expecting an actress of Brie Larson's caliber to elevate, at least, her own character, but she's like everyone else: just good enough. I don't know if her performance was limited by bad direction or by her own decisions, but the potential is there, and I'm sure the Russo brothers will give her a much more thrilling arc in Endgame.\r\n\r\nThe two best attributes of the entire film are, without a single doubt, the buddy-cop relationship that Carol and Nick Fury (Samuel L. Jackson) develop, and the groundbreaking de-aging CGI. Story-wise, the interactions between these two characters are so captivating and humorous that the pacing issues of the first act gradually start to disappear. Carol's past is often approached with quick flashes and a lot of cheap exposition, so it's a breath of fresh air to have SLJ and Larson play off of each other. Nevertheless, the de-aging technology used is absolutely astounding. My fellow readers, welcome to the future of filmmaking, where any actor/actress can portray a younger version of themselves and not be visually disturbing. I completely forgot SLJ is 70-years-old! The best visual effects/CGI are the ones you don't even know they're there and Captain Marvel succeeds in delivering mind-blowing, realistic, younger versions of well-known actors.\r\n\r\nCharacter-wise, Anna Boden and Ryan Fleck should have done way better. So much wasted potential in such a crucial moment in the MCU. Carol Danvers has a great backstory, but the way it was explored kind of diminishes its impact. Still, as Captain Marvel, she is indeed a badass woman! There are some cool action sequences, especially in the beginning, but as the movie slowly progresses on its story, the fight scenes got more sloppy, choppy and way too dark. Jude Law (Yon-Rogg) is amazing as he always is, and Ben Mendelsohn is brilliant as Talos. Both characters have interesting subplots that come together well, which is not something that can be said for the rest of the Marvel \"villains.\"\r\n\r\nTechnically ... You guessed it, it's okay! Taking away the jaw-dropping de-aging CGI, the visuals seem to lack some sort of style. Looking back at Black Panther, Captain America or Guardians of the Galaxy, each movie has a visual aesthetic that belongs to their own stories. Captain Marvel doesn't really feel like it has its own style. I truly feel that with other directors, this film could have been way better. Boden and Fleck already proved that they are capable filmmakers, but maybe they were not ready to lead such a massive blockbuster. That said, the 90s score is awesome and quite adequate to the movie's period. There are a couple of moments where the VFX regarding Carol Danvers's powers are spectacular, but everything ultimately feels like this is a Phase One film, instead of the 21st MCU installment.\r\n\r\nAll in all, Captain Marvel achieves the minimum requirements: introduce the fans to a new superhero, who is going to be extremely important in the eventual defeat of Thanos. Carol Danvers is a fascinating character with an emotional backstory, but the screenplay isn't structured or explored in the most entertaining way possible. Brie Larson delivers a strong performance, pushing aside her haters, even if I feel that under other directors, she would have reached her character's full potential. Her scenes with Samuel L .Jackson are hilarious and the best part of the whole movie, as well as the groundbreaking de-aging CGI, which is absolutely mind-blowing. The action sequences needed better editing and some more choreography (this is MCU's Phase Three and 2019, so I want to be able to actually see what's happening), but the most prominent \"issue\" is how the story blindly obeys the superhero origin film's formula. This isn't exactly a flaw or a problem, it's just that I was expecting more. A lot more.\r\n\r\nIn the end, there's not a memorable fight scene, an emotionally overwhelming moment or even a genuinely bone-chilling, epic scene. It doesn't leave you salivating for Avengers: Endgame, but it also doesn't leave you less excited. Everything is just ... fine. And there's nothing wrong with that. But there's also nothing extraordinary.\r\n\r\nRating: B-", "created_at": "2019-03-08T10:06:36.756Z"}, {"movie_id": 299537, "review_id": "5c83158b925141291919251d", "author_rating": 5.0, "review_text": "Captain Marvel is a hot mess narratively and never really knows what kind of movie it wants to be. Brie Larson is constantly fighting direction and poor writing and losing the battle in the end. The last thing the MCU needs right now is a Mary Sue with no life. The one thing this movie misses more than anything else though is heart. Without a reason or purpose for existing one is left asking…other than explaining pointless MCU plot points and creating a plethora of fresh plot holes…why was this movie made and who was it made for? Kudos must be given to the make-up artists and a lot of the tech guys behind the scenes. C-", "created_at": "2019-03-09T01:23:23.639Z"}, {"movie_id": 299537, "review_id": "5c83eadf0e0a2642fe6302be", "author_rating": 1.0, "review_text": "I wasn't going to see this movie at all based on the stupid comments made by Brie Larson but I tagged along with some friends anyway. Let me just say it was a massive mistake. I underestimated how difficult it would be to stand looking at the lead actress misogynistic and talentless face for two hours. On top of the train wreck that was her 'performance' the whole story just felt flat and bland, I don't want to spoil the plot for those who have already bought tickets and are going to see it anyway, but let's just say that it was almost as underwhelming in story as it was in acting. DO NOT RECOMMEND!\r\n\r\n1/10", "created_at": "2019-03-09T16:33:35.815Z"}, {"movie_id": 299537, "review_id": "5c842502c3a3684e98da8aa3", "author_rating": 4.0, "review_text": "Captain Marvel bored the living hell out of me. I'm tired of these special effects laden \"event films\" where every scene has to be flashy lights and fighting and explosions where nothing of real value is at stake. Not one character in this film has a personality or character arc. It's one big extended buildup to showcase how badly Captain Marvel is going to kick Thanos' ass. I like the character but I did not like what this movie does with her character. I was also shocked at how bad Brie Larson's performance was; she's an incredible actress but I feel Jennifer Lawrence put more effort into her Mystique than Larson did with Carol Danvers.\r\n\r\nAlso if your idea of female empowerment is a nasty leather jacket biker guy whistling at a girl saying \"give me a kiss\" and then the girl just goes and steals his bike, you have no clue what real female empowerment is.", "created_at": "2019-03-09T20:41:38.089Z"}, {"movie_id": 299537, "review_id": "5c8676f1c3a36813c2d325cb", "author_rating": 7.0, "review_text": "okay i wanted to see this despite the 'contravercy sexist pig like men have turned this into'so i went to my local theater picked a showtime and picked out some snacks the movie was decent not good not bad just the right amount of each to make it watchable for folks the action had a nice pace and the humor was just right and i think captain marvel herself is a beautiful badass and i adored the cat he was so cute and fluffy i say go see it dont over expect but go see it", "created_at": "2019-03-11T14:55:45.663Z"}, {"movie_id": 299537, "review_id": "5c9d166cc3a368180e271bcd", "author_rating": 10.0, "review_text": "I never watched a movie 2 time but captain marvel is one and only movie that i watched 2 time in my life.Amazing movie.", "created_at": "2019-03-28T18:46:04.615Z"}, {"movie_id": 299537, "review_id": "5ca979219251415662ff1b66", "author_rating": 7.0, "review_text": "It has good visuals, good action, and some decent humour. This movie does what it needs to do by introducing Captain Marvel, although I was hoping Marvel would do something different and unique from their other origin story.", "created_at": "2019-04-07T04:14:25.209Z"}, {"movie_id": 299537, "review_id": "5cacc2be0e0a2679dea25f82", "author_rating": 5.0, "review_text": "Look, as an actor, it is your duty to make sure that you promote your brand to the best of your ability, it's JUST as important as the work that you do shooting the film. I don't care about the political side of the events that transpired before the release of this movie, but I hope that Hollywood learns the lesson taught by Brie Larson.", "created_at": "2019-04-09T16:05:18.840Z"}, {"movie_id": 299537, "review_id": "5cb2c8c2c3a3680891ac6a20", "author_rating": 1.0, "review_text": "*  I liked the CGI special effects and a few of the plot twists they threw in keep it from being too predictable. Cons: Completely neglecting the source material, appropriating the existing character and twisting them to send a message. Capt Marvell was a male super hero and they should have ran with Ms Marvel or made a new super-hero character for this film. Breaking canon - Facts established in previous MCU films were contradicted in this film, so now I don't know which film's telling of history to believe. Handling of Nick Fury's character was poorly done. I won't see him as the gritty, battle-hardened vet that he was in previous films.\r\nAdvice - Skip this film. It causes confusion by disrupting everything that came before it. It's like a reboot of the marvel universe ... or a parallel dimension. Save your money for another movie.\r\n* Summary: Decent, but Breaks the MCU", "created_at": "2019-04-14T05:44:34.506Z"}, {"movie_id": 299537, "review_id": "5d0f8444c3a36822c320927c", "author_rating": 4.0, "review_text": "Not too bad if you didn't set high expectation.\r\nOverall is ok.\r\nAction is nice.", "created_at": "2019-06-23T13:53:08.166Z"}, {"movie_id": 299537, "review_id": "5d670830efcea90012abcb1e", "author_rating": 6.0, "review_text": "It was alright. Some entertaining scenes and the de-aging they did on Samuel L. Jackson was fantastic. Still not sure about Brie Larson in the lead but at least showed far more personality than her blank stares in Endgame. The visual effects also was fairly good, especially on Earth (vs. on Hala or w/e it was called). Worth a rental.", "created_at": "2019-08-28T23:03:12.095Z"}, {"movie_id": 299537, "review_id": "600ce2cbc433ea0040417609", "author_rating": 8.0, "review_text": "Very good, it's entertaining.\r\n\r\nI like the story that entails <em>'Captain Marvel'</em>. It's possibly not told in the most incredible way, but by the end I did enjoy how it unfolded and connected to what we've seen recently in the MCU.\r\n\r\nBrie Larson is pleasant in the lead role, a tad wooden in parts but overall I rate what she gives this film. It's cool to have Samuel L. Jackson's character get a deeper dive and bigger screen time than usual. I also liked Ben Mendelsohn as Talos. Other cast members, like Jude Law, are fine if forgettable.\r\n\r\nEverything else about this is basically what you'd normally get from an MCU production: strong action, great effects, solid humour and an interesting plot. This 21st film from the universe is a good'un!", "created_at": "2021-01-24T03:00:27.988Z"}, {"movie_id": 299537, "review_id": "63bf89d1e16e5a007ea94e42", "author_rating": 1.0, "review_text": "Well....\r\n\r\n....We have seen this before. The word \"rehashing\" has been thrown around a lot in some reviews, but really it's like a copy of a copy of a copy of a copy on a cheap circa early 80 copy machine. You've seen it before when it was a lot better.\r\n\r\nThe good news, I suppose, is that the trailers were honest, Brie Larson is honestly doing her best to imitate a block of wood and is just as animated and believable as a super hero.\r\n\r\nAnd Sam Jackson, digitally younger, is still too old to do the required action scenes as evident by the enormous amount of cuts it takes to make it vaguely resemble actual action.\r\n\r\nHowever, he still manages to outshine Larson in the action department.\r\n\r\nAnd, of course, nothing could improve it more than a killer soundtrack. Unfortunately Captain Marvel only manages to produce a cringey soundtrack and I has always been a No Doubt fan (at least until 2000'sReturn of Saturn).\r\n\r\nBut the good news is they did reduce the transparent political posturing to a minimum (compared to what people had thought) but even then it is still far more than you'd get with better super hero moves *cough*Wonder Woman*cough*", "created_at": "2023-01-12T04:17:21.386Z"}, {"movie_id": 299537, "review_id": "6452ce53d48cee0153ecc957", "author_rating": 6.0, "review_text": "Ok movie where she fights aliens and humans. They could have made more sense of the story. Captain Marvel was a man back then not a woman too.", "created_at": "2023-05-03T21:12:51.532Z"}]