[{"movie_id": 34851, "review_id": "5207b18f760ee3630b24c587", "author_rating": null, "review_text": "Disparate bunch of tough-guy types plucked from various dumb action sub-genres (a black-ops mercenary, a Spetsnaz operative, a drug cartel goon, a yakuza, a killer, a butcher, a baker, a candlestick maker), all of whom get an opportunity to do their \"thang\" at some point during the movie, get picked off one by one in typical fashion, in a setting designed to evoke the 1987 original's jungle shenanigans. Meh. Can't say that I entirely buy into Adrian Brody as an action hero lead, either. Arguably the worst leading tough-guy since Danny Glover in, um, Predator 2.\r\n\r\nSomething else bugged me about it, too. It's a petty quibble, but it irked me nonetheless:\r\n\r\nSPOILERS AHEAD:\r\n\r\nDid you ever see the trailer for Predators? At the 1.23 mark is IMO the most effective shot in the trailer: Brody's character has one of those iconic triangulated laser sights (from the predators' shoulder-mounted guns) pointed at him. It moves up his body to his head. As it does, many more sights appear, all over him. More than a dozen. He has about fifteen predators all training their guns on him. How's he going to get out of that? He's fooked. Well, no, he's not, because that scene DOESN'T HAPPEN in the film. The first laser sight happens, yes, from the ONE predator of three (?) that are chasing them, but fifteen? No. All those other sights are added in just for the trailer, to make the film look more Predator-filled than it is.\r\n\r\nAs I said, a rather petty quibble, but it's one thing to edit the best bits of a movie together into a trailer to make it look more exiting than it maybe is over the course of two hours, and quite another to lie about what one can expect to see in said movie.", "created_at": "2013-08-11T15:45:19.926Z"}, {"movie_id": 34851, "review_id": "54249b3a0e0a263b6e004479", "author_rating": 7.0, "review_text": "They can hear you. Smell you. They see you. \r\n\r\nPredators is directed by Nimród Antal and stars Adrien Brody, Topher Grace, Alice Braga, Laurence Fishburne, Oleg Taktarov & Danny Trejo. It's co-produced out of 20th Century Fox by Robert Rodriguez, John Davis & Elizabeth Avellan, with writing credits going to Michael Finch, Alex Litvak and Jim & John Thomas. It's shot on location in the Hawaiian jungle with Gyula Pados on cinematography, while John Debney reworks Alan Silvestri's score from the 1987 film Predator. \r\n\r\nThe plot sees eight former members of Earth - mercenaries, soldiers, criminals and a doctor, who are literally dropped into a jungle on an alien planet. Why or how they got there is not known, but pretty soon it is apparent they must work together for they are being hunted by an unseen enemy. Hunted, it seems, for sport. \r\n\r\nIn 1987 John McTierrnan gave the movie world Predator, a ballsy Vietnam allegory that pitted Arnold Schwarzenegger and a host of other considerably sized beefcakes against one bad ass mandible wearing alien hunter. Since then the franchise has steadily got worse (though the Danny Glover led sequel is far from a disaster), reaching a crushingly bad nadir with Aliens vs. Predator: Requiem in 2007. Enter Robert Rodriguez who in the mid 90s had done a treatment for a Predator sequel - with Schwarzenegger in mind to return. However, it didn't happen and it's only now, with the franchise at rock bottom, that his script has been reworked and funded to give us Predators, the sequel to McTiernan's 87 ball buster. \r\n\r\nThe set up is a little different but in truth the formula is exactly the same as the original movie. Macho guys and a girl in the jungle are being hunted by something very bad. Alpha male, though, is not going to take it lying down, cue deaths, explosions and much macho posturing. Here in is the main problem with Antal' s movie, it's ticking the same boxes whilst homaging for all it's worth, which is fine since it's hugely entertaining in that Saturday night popcorn way. But there's little to no braveness in the writing. Sure there's some bonuses in the form of alien pets, a predator feud arc and a bonkers midsection with the introduction of another character. Yet as the carnage unfolds, the plot doesn't go anywhere other than where we expect it to go, while there's a huge character misstep in the final third that is more laughable than being the twister it's obviously meant to be. \r\n\r\nHowever, if taken purely as a piece of salted popcorn, the film delivers enough thrills and excitement to warrant the viewing because the action comes thick and fast. From the breathtaking opening as we are literally dropped into the jungle with Adrien Brody, to the inevitable face off for the finale, we have been treated to stabs, chops, thrusts, dismemberment's, beheadings and everyones personal fave - spine ripping! All this and there's barely any blood spilt, lest the green kind counts of course? While the new look predators are awesome, more meaner in tone, with new armour and devoid of the pointless characterisation that others in the franchise have tried to give them, these are unremitting killers, lets leave them like that please! And while it lacks the dark humour of McTiernan's movie, it does have a wry sense of knowing, normally with the portrayal of Royce by Brody. \r\n\r\nBrody is just fine, it's a performance that shows that should he ever want to make the easy money available in action/adventure type movies? Then he will have no problem getting work. He's buffed up, given himself a gruffer voice and more than shows a capable hand at punching, firing and sticking the tongue firmly in cheek. The others, unsurprisingly, are walking clichés, with some obviously only there to be deathly slotted more quickly than the others. The fun here is in waiting to see who gets it first/next and etc. It has to be said, though, that Topher Grace is not only annoying, he's also very miscast, but in fairness he's not exactly helped by the writing of his character either. \r\n\r\nNot great but hugely enjoyable popcorn fodder. A sequel would be welcome, but with Rodriguez directing and a new face on the writing panel. 7/10", "created_at": "2014-09-25T22:46:18.831Z"}]