[{"movie_id": 180, "review_id": "570e72de925141161800092c", "author_rating": 9.0, "review_text": "Spielberg does Tech-Noir!\r\n\r\nThe year is 2054 and the murder rate in Washington is zero, the reason? Three Pre-Cognitives (each named after a literary great) whose combined abilities witness murders before they actually occur. Apparently faultless, it's then something of a surprise to Pre-Crime chief John Anderton (Tom Cruise) when the Pre-Cogs predict he is to murder a man named Leo Crow. Forced to go on the run, and haunted by a family tragedy, Anderton must evade the system he so perfectly executed himself. Can he find a flaw? Or is he actually about to commit a murder?\r\n\r\nEverybody Runs! That was the tag line that accompanied the explosive trailer for Steven Spielberg's, Tom Cruise starrer, Minority Report. This marketing tool indicated that the great bearded one had adapted from the Phillip K Dick short story and created an action monster? He hadn't, he had in fact created something far far better than popcorn fodder.\r\n\r\nMinority Report was the next project for Spielberg following the equally dark and intriguing AI: Artificial Intelligence, both films serving to note that Spielberg was capable of thought provoking science fiction outside of the standard crowd pleasers that many critics love to decry. In fact, it's arguable that Spielberg may have hit his creative peak with Minority Report, for the messages and crawling dystopian bleakness on show paint a picture not so much as a future far away in our lives, but of one we live in now. Big thematic points of reference dot themselves throughout the piece. Such as the changing of eye balls, or that in these post 9/11 years we yearn, and always will, to be safer.\r\n\r\nHere in this bleached shadowy world, a world of metallic tones and visual stings (ace cinematographer Janusz Kaminski on duty), we are safe under Pre-Crime. Yet still it's a world without soul, it has no heart, it's almost as if inhuman in itself, suggesting that the World's problems are not easily vanquished by technology - a total sacrifice of the World's inhabitant's souls. Spielberg of course is well served by the supreme professionals he has at his disposal, he has also managed to garner a great performance from Tom Cruise, something that critic and fan favourite directors have not managed to do previously. Believable grief, action work as strong as ever, it is however with his ability to imbue a tortured film noir protagonist where Cruise excels the most.\r\n\r\nAlongside Cruise and operating with great impact are Samantha Morton as Pre-Cog Agatha and Max Von Sydow, the latter adding that touch of experienced know how needed for his particularly important character. The odd casting choice appeared to be Colin Farrell as the meddling, almost vindictive Danny Witwer, but he plays well off of Cruise, this even if he veers dangerously close to comic book villainy at times (check out a holy smoke Batman scene). What action there is is first rate, from a jet back pack pursuit, to car jumping heroics, the sequences are crafted with Spielberg's deft eye for an action sequence. While the sick sticks (yes you read right) metal spiders and a brilliant Peter Stormare cameo should hopefully have you squirming and grinning in equal measure.\r\n\r\nWhich brings us to the finale, an ending that may not be a complete surprise (yet it still doesn't cop-out in context to Anderton's tragedy), but things are rounded off in true classic noir tradition, where it closes down a thinking man's tech-noir. Superb. 9/10", "created_at": "2016-04-13T16:25:02.659Z"}, {"movie_id": 180, "review_id": "593d6eb3c3a3680f3301cf66", "author_rating": 6.0, "review_text": "Works more on the strength of Spielberg than of Cruise.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2017-06-11T16:24:19.650Z"}, {"movie_id": 180, "review_id": "64b753a655b0c000e2cb3a2f", "author_rating": 8.0, "review_text": "Really good movie. This is one of those movies where you really gotta pay attention to it to understand it fully. Great storyline too. I'm sure our world will eventually end up this way. Hope not though!", "created_at": "2023-07-19T03:08:22.083Z"}, {"movie_id": 180, "review_id": "64f4306bcaa50800c8888ed0", "author_rating": 7.0, "review_text": "So - can you be arrested for a crime that you haven't actually committed yet? I suppose that is conspiracy - but this cleverly crafted crime drama questions even the morality of that stance. Tom Cruise is a policeman in the \"pre-crime\" unit who uses information from three people who are able to see into the future, to arrest the spiralling crime rates by intercepting the perpetrators on the cusp of their criminality. Murderers, rapists, bank robbers - you name it, and this has a profound effect on the crime rate. All looks plain sailing until Cruise \"Anderton\" becomes embroiled in a potential killing of his own, and his erstwhile colleagues - not least Colin Farrell (\"Witwer\") and Max von Sydow (\"Director Burgess') are on his trail using his own techniques against him. Steven Spielberg has concocted a plot that, though complex, is relatively easy to follow with plenty of action and thriller elements that do exactly what they are supposed to. The ending is maybe just a bit disappointing - far too tidy for my liking; but Cruise, Farrell and von Sydow combine well to generate a fair degree of menace and suspense to keep it interesting. The CGI hasn't really stood the test of time so well and I hope Bulgari (amongst others) got their money's worth - I wouldn't rush out and buy one, but I would watch the film again.", "created_at": "2023-09-03T07:06:19.140Z"}]