[{"movie_id": 353491, "review_id": "599c44069251410e21016597", "author_rating": 7.0, "review_text": "ok here are my personal thought on this movie I think you can say what you want but I really liked it this movie had a lot of action and fun you really cant go wrong here the action packed fun and enjoyment mcconihey was a pure joy as the evil villain he really knows how to excite an audience you need to see this movie", "created_at": "2017-08-22T14:47:34.091Z"}, {"movie_id": 353491, "review_id": "59a3782dc3a368227b00788e", "author_rating": 7.0, "review_text": "ok so I walked into the theater with full expectations of this one sucking however I really had a nice time watching it this was filled with action and adventure just what you want from a end of summer flick just a good time and loads of fun at the movies", "created_at": "2017-08-28T01:55:57.839Z"}, {"movie_id": 353491, "review_id": "59a841a5c3a3683c4d01807b", "author_rating": null, "review_text": "I liked the movie was really good. But yet a little disappointed that the movie missed so many things from the book.in my opinion this should of been done in a series setting..just my two cents", "created_at": "2017-08-31T17:04:37.644Z"}, {"movie_id": 353491, "review_id": "5a02bd29c3a368629600ff33", "author_rating": 3.0, "review_text": "My hard & fast rule of \"Never pay ticket price for anything with Matthew McConaughey in a leading role\" has served me well once more, because though one of the biggest problems with _The Dark Tower_ was how they tried to squeeze decades of lore into 95 minute movie, the best part about it was still somehow that it was over pretty quick.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-08T08:15:37.316Z"}, {"movie_id": 353491, "review_id": "5a7715b5925141059f045c36", "author_rating": 5.0, "review_text": "**The dark force, the dark tower and then there's heroes!**\r\n\r\nBased on the book of the same name. It is a book series, so we can expect a new franchise here. Another fantasy series, but is it worth is the real question. I don't know how famous is the original source, but I did not find the film any good. For me, it was another teen film like the majority of similarly themed films that flopped terribly. But here, an adult holds a prominent role that played by Idris Elba.\r\n\r\nMaybe this is just an introduction, but still the first impression failed. The youngsters might enjoy it better than the adults. Particularly the teenagers. A teenager having a series of strange dreams about another world is all actually comes true when he enters through a portal to one of those worlds in the same universe. Now he's tailed by a most dangerous force in the universe, but accompanied by a gunslinger, he has to find a way to stop an apocalypse that's going strike his world and to rest of the universe.\r\n\r\nBeing very simple could be the reason I did not enjoy it. Basically, there's no twist in it. What they have called twist was a cliche in this kind of theme. The cast was okay, and so the visuals. But it all points to the story. The sequel could get better, so lets wait and see. In the meantime, I've heard that a completely a new version of the television series is on the development. I hope it works out better than the film franchise. Finally, it is an average film, neither worth nor a waste of time! I hope you make the right decision regarding watching it!\r\n\r\n_5/10_", "created_at": "2018-02-04T14:16:21.128Z"}, {"movie_id": 353491, "review_id": "5ee5b57897eab4001ee65c07", "author_rating": 4.0, "review_text": "Click here for a video version of this review: https://youtu.be/V_PCAIQ7AvE\r\n\r\nI’ve not read a lot of Stephen King books, but one which I read and loved was _The Gunslinger_ which is the first book in _The Dark Tower_ series. In 2017 a movie adaptation came out and was named after the series. Starring Idris Elba and Matthew McConaughey it was hotly anticipated but was met with bad reviews on release. \r\n\r\nHaving loved _The Gunslinger_ and hearing those reviews it’s taken me a long time to get around to watching this. Having now seen it, I gotta say, I agree with those reviews. It’s not a trash movie, but it is also not even close to being a good movie. \r\n\r\nThe core problem is that there are eight books of source material, and for some reason they try to distil all that lore and world building into one 95min film. For that reason alone it was doomed from the start, but add in hilariously uncharismatic acting, shoddy CGI, and a copy pasted plot from 100 other sci-fi or fantasy films, and you have a recipe for mediocrity. \r\n\r\nNow I will say, I am not a fan of Idris Elba, but I actually thought he played the part of Roland, the Gunslinger, quite well. As for McConaughey, all this did was confirm for me that he is one of the most overrated actors of our generation. \r\n\r\nMy suggestion would be to avoid the movie and pick up the books, because the books will take you away on an epic journey much much more than this movie ever does.", "created_at": "2020-06-14T05:28:24.259Z"}, {"movie_id": 353491, "review_id": "63c218aa23be4600980977e8", "author_rating": 1.0, "review_text": "I guess the studio execs decided the American public wasn't smart enough to get Stephen King...you know, the Godfather of accessible fiction.\r\n\r\nSeriously...\r\n\r\nWhat in the wide, wide world of sports happened here?!!!!! Honestly, it's a King movie, it doesn't need to be good. I mean look at the body of work that was made that people actually would agree were good: The Dead Zone, The Green Mile, Stand By Me, Shawshank, Carrie (1976), and The Shining (arguably among fans).\r\n\r\n6 movies...that's about it. The rest are mediocre, 1408, Cat's Eyes, Misery, Firestarter.\r\n\r\nAnd the rest are low budget throw away films that can be enjoyed the same way that one can enjoy any B-Movie...and that's fine. I have a feeling that King appreciates B-Movies more than you'd think. At least that's what he wrote in \"On Writing.\" But this...what the heck is this? Honestly, the Dark Tower series is one of my least favorite things that King has ever written...and I am a huge King fan...but even then, I didn't expect it to be this bad.\r\n\r\nFor starters, it's really not the Dark Tower. I mean, the characters are the same in name...but really in name only.\r\n\r\nthe Gunslinger is chasing the Man in Black...and that is all the similarities we have.\r\n\r\nYou can't blame the actors on this one. You can't blame the source material either, they are at least readable.\r\n\r\nWhat you have here is a film that was re-written over and over and over and over again with, what I am guessing, is massive studio interference.\r\n\r\nThe series is already a big part of pulp culture, it already has a huge following...but watching this you get the feeling that some important people didn't understand that and had it rewritten a thousand time to try to make a franchise out of it, rather than use the franchise already in place. Only they wanted to make a franchise by putting the entire franchise into a single film.\r\n\r\nIn the end you can almost feel the different writers when you watch it. You can see where it was meant to go in one direction, then got taken in another, and then a third and a fourth until the actors were so confused they had no choice but to give up.\r\n\r\nIn the end, I got the impression that no one involved knew exactly what they were trying to make any longer.\r\n\r\nReally, we should be demanding an instant remake and a total refund. Fans deserve no less.", "created_at": "2023-01-14T02:51:22.355Z"}, {"movie_id": 353491, "review_id": "644ac3aafba6250358d553db", "author_rating": 4.0, "review_text": "**If we often think that a movie doesn't need to have sequels, this case is the opposite: this movie should have been thought of as the beginning of a franchise of several movies.**\r\n\r\nAs far as I could tell, after some reading, this work of cinema was based on a work by Stephen King, composed of a long series of books. I'm sure the source material is good, King is one of the best and most ingenious fantastic writers of our time and his vast literary oeuvre has already made for surprising and remarkable films. What I question is the way this adaptation was made: what are eight books converted into a two-hour film? They probably only took advantage of a handful of characters and locations and threw everything else in the trash. Works like these can only be adapted in the form of trilogies, tetralogies or, in the television market, as series. Otherwise, the source material is not properly exploited in its richness.\r\n\r\nRegardless of these issues, the film is moderately good: it all starts when the young protagonist, haunted by visions he has, finds a portal to a world he does not know, the world of his visions, and finds a Gunslinger who will help him. Deep down, he already knows the essential: the universal balance is in danger because an evil sorcerer wants to bring down the grandiose Dark Tower which, at the center of all things, harmonizes this balance and cosmic energies. I am explaining it simply and in my own words. Now the task of the two heroes is to prevent this from happening.\r\n\r\nThe best thing about this film is really the feeling of adventure, risk, the almost constant action and the way everything unfolds quickly, without dead moments. As an entertainment film, it is very good, and if we forget that it is the worst adaptation of King ever made for the cinema, we can really have a good time watching it. The big problem here is how rushed everything feels, with the film trying to do too much without having to reach its two and a half hour runtime.\r\n\r\nThe quality of the cast is another asset that makes the film work reasonably well. None of the actors are amazing, there are no great performances, but what was done is enough to push the film in the right direction: Idris Elba is charismatic and likable without ceasing to be fearsome, something his character demanded and which the actor knew to adapt. Tom Taylor also did a good job in the role of the young hero, a role where it would have been very easy to make mistakes, be superficial or ham. The villain has fallen into the shoes of Matthew McConaughey, and despite being suitably dark, he's not really a palpable threat.\r\n\r\nTechnically, the film relies heavily on CGI and effects. The film called for that, given the plot and sci-fi theme. The CGI and effects are good and work well for the most part, although there are a number of options and solutions that I would consider debatable. For example, the film never explores – nor does it have time for – the connections between parallel universes, and how there are so many people in our world who know this. The film would have gained in quality if it had been given an additional hour, or if it had been thought of as the beginning of a broader franchise, with several sequels. The cinematography is very good, the filming work is average, it has good sets, good costumes and excellent action scenes. The soundtrack, I confess, is not convincing, but it works effectively, which is already positive.", "created_at": "2023-04-27T18:49:14.456Z"}, {"movie_id": 353491, "review_id": "599c44069251410e21016597", "author_rating": 7.0, "review_text": "ok here are my personal thought on this movie I think you can say what you want but I really liked it this movie had a lot of action and fun you really cant go wrong here the action packed fun and enjoyment mcconihey was a pure joy as the evil villain he really knows how to excite an audience you need to see this movie", "created_at": "2017-08-22T14:47:34.091Z"}, {"movie_id": 353491, "review_id": "59a3782dc3a368227b00788e", "author_rating": 7.0, "review_text": "ok so I walked into the theater with full expectations of this one sucking however I really had a nice time watching it this was filled with action and adventure just what you want from a end of summer flick just a good time and loads of fun at the movies", "created_at": "2017-08-28T01:55:57.839Z"}, {"movie_id": 353491, "review_id": "59a841a5c3a3683c4d01807b", "author_rating": null, "review_text": "I liked the movie was really good. But yet a little disappointed that the movie missed so many things from the book.in my opinion this should of been done in a series setting..just my two cents", "created_at": "2017-08-31T17:04:37.644Z"}, {"movie_id": 353491, "review_id": "5a02bd29c3a368629600ff33", "author_rating": 3.0, "review_text": "My hard & fast rule of \"Never pay ticket price for anything with Matthew McConaughey in a leading role\" has served me well once more, because though one of the biggest problems with _The Dark Tower_ was how they tried to squeeze decades of lore into 95 minute movie, the best part about it was still somehow that it was over pretty quick.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-08T08:15:37.316Z"}, {"movie_id": 353491, "review_id": "5a7715b5925141059f045c36", "author_rating": 5.0, "review_text": "**The dark force, the dark tower and then there's heroes!**\r\n\r\nBased on the book of the same name. It is a book series, so we can expect a new franchise here. Another fantasy series, but is it worth is the real question. I don't know how famous is the original source, but I did not find the film any good. For me, it was another teen film like the majority of similarly themed films that flopped terribly. But here, an adult holds a prominent role that played by Idris Elba.\r\n\r\nMaybe this is just an introduction, but still the first impression failed. The youngsters might enjoy it better than the adults. Particularly the teenagers. A teenager having a series of strange dreams about another world is all actually comes true when he enters through a portal to one of those worlds in the same universe. Now he's tailed by a most dangerous force in the universe, but accompanied by a gunslinger, he has to find a way to stop an apocalypse that's going strike his world and to rest of the universe.\r\n\r\nBeing very simple could be the reason I did not enjoy it. Basically, there's no twist in it. What they have called twist was a cliche in this kind of theme. The cast was okay, and so the visuals. But it all points to the story. The sequel could get better, so lets wait and see. In the meantime, I've heard that a completely a new version of the television series is on the development. I hope it works out better than the film franchise. Finally, it is an average film, neither worth nor a waste of time! I hope you make the right decision regarding watching it!\r\n\r\n_5/10_", "created_at": "2018-02-04T14:16:21.128Z"}, {"movie_id": 353491, "review_id": "5ee5b57897eab4001ee65c07", "author_rating": 4.0, "review_text": "Click here for a video version of this review: https://youtu.be/V_PCAIQ7AvE\r\n\r\nI’ve not read a lot of Stephen King books, but one which I read and loved was _The Gunslinger_ which is the first book in _The Dark Tower_ series. In 2017 a movie adaptation came out and was named after the series. Starring Idris Elba and Matthew McConaughey it was hotly anticipated but was met with bad reviews on release. \r\n\r\nHaving loved _The Gunslinger_ and hearing those reviews it’s taken me a long time to get around to watching this. Having now seen it, I gotta say, I agree with those reviews. It’s not a trash movie, but it is also not even close to being a good movie. \r\n\r\nThe core problem is that there are eight books of source material, and for some reason they try to distil all that lore and world building into one 95min film. For that reason alone it was doomed from the start, but add in hilariously uncharismatic acting, shoddy CGI, and a copy pasted plot from 100 other sci-fi or fantasy films, and you have a recipe for mediocrity. \r\n\r\nNow I will say, I am not a fan of Idris Elba, but I actually thought he played the part of Roland, the Gunslinger, quite well. As for McConaughey, all this did was confirm for me that he is one of the most overrated actors of our generation. \r\n\r\nMy suggestion would be to avoid the movie and pick up the books, because the books will take you away on an epic journey much much more than this movie ever does.", "created_at": "2020-06-14T05:28:24.259Z"}, {"movie_id": 353491, "review_id": "63c218aa23be4600980977e8", "author_rating": 1.0, "review_text": "I guess the studio execs decided the American public wasn't smart enough to get Stephen King...you know, the Godfather of accessible fiction.\r\n\r\nSeriously...\r\n\r\nWhat in the wide, wide world of sports happened here?!!!!! Honestly, it's a King movie, it doesn't need to be good. I mean look at the body of work that was made that people actually would agree were good: The Dead Zone, The Green Mile, Stand By Me, Shawshank, Carrie (1976), and The Shining (arguably among fans).\r\n\r\n6 movies...that's about it. The rest are mediocre, 1408, Cat's Eyes, Misery, Firestarter.\r\n\r\nAnd the rest are low budget throw away films that can be enjoyed the same way that one can enjoy any B-Movie...and that's fine. I have a feeling that King appreciates B-Movies more than you'd think. At least that's what he wrote in \"On Writing.\" But this...what the heck is this? Honestly, the Dark Tower series is one of my least favorite things that King has ever written...and I am a huge King fan...but even then, I didn't expect it to be this bad.\r\n\r\nFor starters, it's really not the Dark Tower. I mean, the characters are the same in name...but really in name only.\r\n\r\nthe Gunslinger is chasing the Man in Black...and that is all the similarities we have.\r\n\r\nYou can't blame the actors on this one. You can't blame the source material either, they are at least readable.\r\n\r\nWhat you have here is a film that was re-written over and over and over and over again with, what I am guessing, is massive studio interference.\r\n\r\nThe series is already a big part of pulp culture, it already has a huge following...but watching this you get the feeling that some important people didn't understand that and had it rewritten a thousand time to try to make a franchise out of it, rather than use the franchise already in place. Only they wanted to make a franchise by putting the entire franchise into a single film.\r\n\r\nIn the end you can almost feel the different writers when you watch it. You can see where it was meant to go in one direction, then got taken in another, and then a third and a fourth until the actors were so confused they had no choice but to give up.\r\n\r\nIn the end, I got the impression that no one involved knew exactly what they were trying to make any longer.\r\n\r\nReally, we should be demanding an instant remake and a total refund. Fans deserve no less.", "created_at": "2023-01-14T02:51:22.355Z"}, {"movie_id": 353491, "review_id": "644ac3aafba6250358d553db", "author_rating": 4.0, "review_text": "**If we often think that a movie doesn't need to have sequels, this case is the opposite: this movie should have been thought of as the beginning of a franchise of several movies.**\r\n\r\nAs far as I could tell, after some reading, this work of cinema was based on a work by Stephen King, composed of a long series of books. I'm sure the source material is good, King is one of the best and most ingenious fantastic writers of our time and his vast literary oeuvre has already made for surprising and remarkable films. What I question is the way this adaptation was made: what are eight books converted into a two-hour film? They probably only took advantage of a handful of characters and locations and threw everything else in the trash. Works like these can only be adapted in the form of trilogies, tetralogies or, in the television market, as series. Otherwise, the source material is not properly exploited in its richness.\r\n\r\nRegardless of these issues, the film is moderately good: it all starts when the young protagonist, haunted by visions he has, finds a portal to a world he does not know, the world of his visions, and finds a Gunslinger who will help him. Deep down, he already knows the essential: the universal balance is in danger because an evil sorcerer wants to bring down the grandiose Dark Tower which, at the center of all things, harmonizes this balance and cosmic energies. I am explaining it simply and in my own words. Now the task of the two heroes is to prevent this from happening.\r\n\r\nThe best thing about this film is really the feeling of adventure, risk, the almost constant action and the way everything unfolds quickly, without dead moments. As an entertainment film, it is very good, and if we forget that it is the worst adaptation of King ever made for the cinema, we can really have a good time watching it. The big problem here is how rushed everything feels, with the film trying to do too much without having to reach its two and a half hour runtime.\r\n\r\nThe quality of the cast is another asset that makes the film work reasonably well. None of the actors are amazing, there are no great performances, but what was done is enough to push the film in the right direction: Idris Elba is charismatic and likable without ceasing to be fearsome, something his character demanded and which the actor knew to adapt. Tom Taylor also did a good job in the role of the young hero, a role where it would have been very easy to make mistakes, be superficial or ham. The villain has fallen into the shoes of Matthew McConaughey, and despite being suitably dark, he's not really a palpable threat.\r\n\r\nTechnically, the film relies heavily on CGI and effects. The film called for that, given the plot and sci-fi theme. The CGI and effects are good and work well for the most part, although there are a number of options and solutions that I would consider debatable. For example, the film never explores – nor does it have time for – the connections between parallel universes, and how there are so many people in our world who know this. The film would have gained in quality if it had been given an additional hour, or if it had been thought of as the beginning of a broader franchise, with several sequels. The cinematography is very good, the filming work is average, it has good sets, good costumes and excellent action scenes. The soundtrack, I confess, is not convincing, but it works effectively, which is already positive.", "created_at": "2023-04-27T18:49:14.456Z"}, {"movie_id": 353491, "review_id": "599c44069251410e21016597", "author_rating": 7.0, "review_text": "ok here are my personal thought on this movie I think you can say what you want but I really liked it this movie had a lot of action and fun you really cant go wrong here the action packed fun and enjoyment mcconihey was a pure joy as the evil villain he really knows how to excite an audience you need to see this movie", "created_at": "2017-08-22T14:47:34.091Z"}, {"movie_id": 353491, "review_id": "59a3782dc3a368227b00788e", "author_rating": 7.0, "review_text": "ok so I walked into the theater with full expectations of this one sucking however I really had a nice time watching it this was filled with action and adventure just what you want from a end of summer flick just a good time and loads of fun at the movies", "created_at": "2017-08-28T01:55:57.839Z"}, {"movie_id": 353491, "review_id": "59a841a5c3a3683c4d01807b", "author_rating": null, "review_text": "I liked the movie was really good. But yet a little disappointed that the movie missed so many things from the book.in my opinion this should of been done in a series setting..just my two cents", "created_at": "2017-08-31T17:04:37.644Z"}, {"movie_id": 353491, "review_id": "5a02bd29c3a368629600ff33", "author_rating": 3.0, "review_text": "My hard & fast rule of \"Never pay ticket price for anything with Matthew McConaughey in a leading role\" has served me well once more, because though one of the biggest problems with _The Dark Tower_ was how they tried to squeeze decades of lore into 95 minute movie, the best part about it was still somehow that it was over pretty quick.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-08T08:15:37.316Z"}, {"movie_id": 353491, "review_id": "5a7715b5925141059f045c36", "author_rating": 5.0, "review_text": "**The dark force, the dark tower and then there's heroes!**\r\n\r\nBased on the book of the same name. It is a book series, so we can expect a new franchise here. Another fantasy series, but is it worth is the real question. I don't know how famous is the original source, but I did not find the film any good. For me, it was another teen film like the majority of similarly themed films that flopped terribly. But here, an adult holds a prominent role that played by Idris Elba.\r\n\r\nMaybe this is just an introduction, but still the first impression failed. The youngsters might enjoy it better than the adults. Particularly the teenagers. A teenager having a series of strange dreams about another world is all actually comes true when he enters through a portal to one of those worlds in the same universe. Now he's tailed by a most dangerous force in the universe, but accompanied by a gunslinger, he has to find a way to stop an apocalypse that's going strike his world and to rest of the universe.\r\n\r\nBeing very simple could be the reason I did not enjoy it. Basically, there's no twist in it. What they have called twist was a cliche in this kind of theme. The cast was okay, and so the visuals. But it all points to the story. The sequel could get better, so lets wait and see. In the meantime, I've heard that a completely a new version of the television series is on the development. I hope it works out better than the film franchise. Finally, it is an average film, neither worth nor a waste of time! I hope you make the right decision regarding watching it!\r\n\r\n_5/10_", "created_at": "2018-02-04T14:16:21.128Z"}, {"movie_id": 353491, "review_id": "5ee5b57897eab4001ee65c07", "author_rating": 4.0, "review_text": "Click here for a video version of this review: https://youtu.be/V_PCAIQ7AvE\r\n\r\nI’ve not read a lot of Stephen King books, but one which I read and loved was _The Gunslinger_ which is the first book in _The Dark Tower_ series. In 2017 a movie adaptation came out and was named after the series. Starring Idris Elba and Matthew McConaughey it was hotly anticipated but was met with bad reviews on release. \r\n\r\nHaving loved _The Gunslinger_ and hearing those reviews it’s taken me a long time to get around to watching this. Having now seen it, I gotta say, I agree with those reviews. It’s not a trash movie, but it is also not even close to being a good movie. \r\n\r\nThe core problem is that there are eight books of source material, and for some reason they try to distil all that lore and world building into one 95min film. For that reason alone it was doomed from the start, but add in hilariously uncharismatic acting, shoddy CGI, and a copy pasted plot from 100 other sci-fi or fantasy films, and you have a recipe for mediocrity. \r\n\r\nNow I will say, I am not a fan of Idris Elba, but I actually thought he played the part of Roland, the Gunslinger, quite well. As for McConaughey, all this did was confirm for me that he is one of the most overrated actors of our generation. \r\n\r\nMy suggestion would be to avoid the movie and pick up the books, because the books will take you away on an epic journey much much more than this movie ever does.", "created_at": "2020-06-14T05:28:24.259Z"}, {"movie_id": 353491, "review_id": "63c218aa23be4600980977e8", "author_rating": 1.0, "review_text": "I guess the studio execs decided the American public wasn't smart enough to get Stephen King...you know, the Godfather of accessible fiction.\r\n\r\nSeriously...\r\n\r\nWhat in the wide, wide world of sports happened here?!!!!! Honestly, it's a King movie, it doesn't need to be good. I mean look at the body of work that was made that people actually would agree were good: The Dead Zone, The Green Mile, Stand By Me, Shawshank, Carrie (1976), and The Shining (arguably among fans).\r\n\r\n6 movies...that's about it. The rest are mediocre, 1408, Cat's Eyes, Misery, Firestarter.\r\n\r\nAnd the rest are low budget throw away films that can be enjoyed the same way that one can enjoy any B-Movie...and that's fine. I have a feeling that King appreciates B-Movies more than you'd think. At least that's what he wrote in \"On Writing.\" But this...what the heck is this? Honestly, the Dark Tower series is one of my least favorite things that King has ever written...and I am a huge King fan...but even then, I didn't expect it to be this bad.\r\n\r\nFor starters, it's really not the Dark Tower. I mean, the characters are the same in name...but really in name only.\r\n\r\nthe Gunslinger is chasing the Man in Black...and that is all the similarities we have.\r\n\r\nYou can't blame the actors on this one. You can't blame the source material either, they are at least readable.\r\n\r\nWhat you have here is a film that was re-written over and over and over and over again with, what I am guessing, is massive studio interference.\r\n\r\nThe series is already a big part of pulp culture, it already has a huge following...but watching this you get the feeling that some important people didn't understand that and had it rewritten a thousand time to try to make a franchise out of it, rather than use the franchise already in place. Only they wanted to make a franchise by putting the entire franchise into a single film.\r\n\r\nIn the end you can almost feel the different writers when you watch it. You can see where it was meant to go in one direction, then got taken in another, and then a third and a fourth until the actors were so confused they had no choice but to give up.\r\n\r\nIn the end, I got the impression that no one involved knew exactly what they were trying to make any longer.\r\n\r\nReally, we should be demanding an instant remake and a total refund. Fans deserve no less.", "created_at": "2023-01-14T02:51:22.355Z"}, {"movie_id": 353491, "review_id": "644ac3aafba6250358d553db", "author_rating": 4.0, "review_text": "**If we often think that a movie doesn't need to have sequels, this case is the opposite: this movie should have been thought of as the beginning of a franchise of several movies.**\r\n\r\nAs far as I could tell, after some reading, this work of cinema was based on a work by Stephen King, composed of a long series of books. I'm sure the source material is good, King is one of the best and most ingenious fantastic writers of our time and his vast literary oeuvre has already made for surprising and remarkable films. What I question is the way this adaptation was made: what are eight books converted into a two-hour film? They probably only took advantage of a handful of characters and locations and threw everything else in the trash. Works like these can only be adapted in the form of trilogies, tetralogies or, in the television market, as series. Otherwise, the source material is not properly exploited in its richness.\r\n\r\nRegardless of these issues, the film is moderately good: it all starts when the young protagonist, haunted by visions he has, finds a portal to a world he does not know, the world of his visions, and finds a Gunslinger who will help him. Deep down, he already knows the essential: the universal balance is in danger because an evil sorcerer wants to bring down the grandiose Dark Tower which, at the center of all things, harmonizes this balance and cosmic energies. I am explaining it simply and in my own words. Now the task of the two heroes is to prevent this from happening.\r\n\r\nThe best thing about this film is really the feeling of adventure, risk, the almost constant action and the way everything unfolds quickly, without dead moments. As an entertainment film, it is very good, and if we forget that it is the worst adaptation of King ever made for the cinema, we can really have a good time watching it. The big problem here is how rushed everything feels, with the film trying to do too much without having to reach its two and a half hour runtime.\r\n\r\nThe quality of the cast is another asset that makes the film work reasonably well. None of the actors are amazing, there are no great performances, but what was done is enough to push the film in the right direction: Idris Elba is charismatic and likable without ceasing to be fearsome, something his character demanded and which the actor knew to adapt. Tom Taylor also did a good job in the role of the young hero, a role where it would have been very easy to make mistakes, be superficial or ham. The villain has fallen into the shoes of Matthew McConaughey, and despite being suitably dark, he's not really a palpable threat.\r\n\r\nTechnically, the film relies heavily on CGI and effects. The film called for that, given the plot and sci-fi theme. The CGI and effects are good and work well for the most part, although there are a number of options and solutions that I would consider debatable. For example, the film never explores – nor does it have time for – the connections between parallel universes, and how there are so many people in our world who know this. The film would have gained in quality if it had been given an additional hour, or if it had been thought of as the beginning of a broader franchise, with several sequels. The cinematography is very good, the filming work is average, it has good sets, good costumes and excellent action scenes. The soundtrack, I confess, is not convincing, but it works effectively, which is already positive.", "created_at": "2023-04-27T18:49:14.456Z"}, {"movie_id": 353491, "review_id": "599c44069251410e21016597", "author_rating": 7.0, "review_text": "ok here are my personal thought on this movie I think you can say what you want but I really liked it this movie had a lot of action and fun you really cant go wrong here the action packed fun and enjoyment mcconihey was a pure joy as the evil villain he really knows how to excite an audience you need to see this movie", "created_at": "2017-08-22T14:47:34.091Z"}, {"movie_id": 353491, "review_id": "59a3782dc3a368227b00788e", "author_rating": 7.0, "review_text": "ok so I walked into the theater with full expectations of this one sucking however I really had a nice time watching it this was filled with action and adventure just what you want from a end of summer flick just a good time and loads of fun at the movies", "created_at": "2017-08-28T01:55:57.839Z"}, {"movie_id": 353491, "review_id": "59a841a5c3a3683c4d01807b", "author_rating": null, "review_text": "I liked the movie was really good. But yet a little disappointed that the movie missed so many things from the book.in my opinion this should of been done in a series setting..just my two cents", "created_at": "2017-08-31T17:04:37.644Z"}, {"movie_id": 353491, "review_id": "5a02bd29c3a368629600ff33", "author_rating": 3.0, "review_text": "My hard & fast rule of \"Never pay ticket price for anything with Matthew McConaughey in a leading role\" has served me well once more, because though one of the biggest problems with _The Dark Tower_ was how they tried to squeeze decades of lore into 95 minute movie, the best part about it was still somehow that it was over pretty quick.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-08T08:15:37.316Z"}, {"movie_id": 353491, "review_id": "5a7715b5925141059f045c36", "author_rating": 5.0, "review_text": "**The dark force, the dark tower and then there's heroes!**\r\n\r\nBased on the book of the same name. It is a book series, so we can expect a new franchise here. Another fantasy series, but is it worth is the real question. I don't know how famous is the original source, but I did not find the film any good. For me, it was another teen film like the majority of similarly themed films that flopped terribly. But here, an adult holds a prominent role that played by Idris Elba.\r\n\r\nMaybe this is just an introduction, but still the first impression failed. The youngsters might enjoy it better than the adults. Particularly the teenagers. A teenager having a series of strange dreams about another world is all actually comes true when he enters through a portal to one of those worlds in the same universe. Now he's tailed by a most dangerous force in the universe, but accompanied by a gunslinger, he has to find a way to stop an apocalypse that's going strike his world and to rest of the universe.\r\n\r\nBeing very simple could be the reason I did not enjoy it. Basically, there's no twist in it. What they have called twist was a cliche in this kind of theme. The cast was okay, and so the visuals. But it all points to the story. The sequel could get better, so lets wait and see. In the meantime, I've heard that a completely a new version of the television series is on the development. I hope it works out better than the film franchise. Finally, it is an average film, neither worth nor a waste of time! I hope you make the right decision regarding watching it!\r\n\r\n_5/10_", "created_at": "2018-02-04T14:16:21.128Z"}, {"movie_id": 353491, "review_id": "5ee5b57897eab4001ee65c07", "author_rating": 4.0, "review_text": "Click here for a video version of this review: https://youtu.be/V_PCAIQ7AvE\r\n\r\nI’ve not read a lot of Stephen King books, but one which I read and loved was _The Gunslinger_ which is the first book in _The Dark Tower_ series. In 2017 a movie adaptation came out and was named after the series. Starring Idris Elba and Matthew McConaughey it was hotly anticipated but was met with bad reviews on release. \r\n\r\nHaving loved _The Gunslinger_ and hearing those reviews it’s taken me a long time to get around to watching this. Having now seen it, I gotta say, I agree with those reviews. It’s not a trash movie, but it is also not even close to being a good movie. \r\n\r\nThe core problem is that there are eight books of source material, and for some reason they try to distil all that lore and world building into one 95min film. For that reason alone it was doomed from the start, but add in hilariously uncharismatic acting, shoddy CGI, and a copy pasted plot from 100 other sci-fi or fantasy films, and you have a recipe for mediocrity. \r\n\r\nNow I will say, I am not a fan of Idris Elba, but I actually thought he played the part of Roland, the Gunslinger, quite well. As for McConaughey, all this did was confirm for me that he is one of the most overrated actors of our generation. \r\n\r\nMy suggestion would be to avoid the movie and pick up the books, because the books will take you away on an epic journey much much more than this movie ever does.", "created_at": "2020-06-14T05:28:24.259Z"}, {"movie_id": 353491, "review_id": "63c218aa23be4600980977e8", "author_rating": 1.0, "review_text": "I guess the studio execs decided the American public wasn't smart enough to get Stephen King...you know, the Godfather of accessible fiction.\r\n\r\nSeriously...\r\n\r\nWhat in the wide, wide world of sports happened here?!!!!! Honestly, it's a King movie, it doesn't need to be good. I mean look at the body of work that was made that people actually would agree were good: The Dead Zone, The Green Mile, Stand By Me, Shawshank, Carrie (1976), and The Shining (arguably among fans).\r\n\r\n6 movies...that's about it. The rest are mediocre, 1408, Cat's Eyes, Misery, Firestarter.\r\n\r\nAnd the rest are low budget throw away films that can be enjoyed the same way that one can enjoy any B-Movie...and that's fine. I have a feeling that King appreciates B-Movies more than you'd think. At least that's what he wrote in \"On Writing.\" But this...what the heck is this? Honestly, the Dark Tower series is one of my least favorite things that King has ever written...and I am a huge King fan...but even then, I didn't expect it to be this bad.\r\n\r\nFor starters, it's really not the Dark Tower. I mean, the characters are the same in name...but really in name only.\r\n\r\nthe Gunslinger is chasing the Man in Black...and that is all the similarities we have.\r\n\r\nYou can't blame the actors on this one. You can't blame the source material either, they are at least readable.\r\n\r\nWhat you have here is a film that was re-written over and over and over and over again with, what I am guessing, is massive studio interference.\r\n\r\nThe series is already a big part of pulp culture, it already has a huge following...but watching this you get the feeling that some important people didn't understand that and had it rewritten a thousand time to try to make a franchise out of it, rather than use the franchise already in place. Only they wanted to make a franchise by putting the entire franchise into a single film.\r\n\r\nIn the end you can almost feel the different writers when you watch it. You can see where it was meant to go in one direction, then got taken in another, and then a third and a fourth until the actors were so confused they had no choice but to give up.\r\n\r\nIn the end, I got the impression that no one involved knew exactly what they were trying to make any longer.\r\n\r\nReally, we should be demanding an instant remake and a total refund. Fans deserve no less.", "created_at": "2023-01-14T02:51:22.355Z"}, {"movie_id": 353491, "review_id": "644ac3aafba6250358d553db", "author_rating": 4.0, "review_text": "**If we often think that a movie doesn't need to have sequels, this case is the opposite: this movie should have been thought of as the beginning of a franchise of several movies.**\r\n\r\nAs far as I could tell, after some reading, this work of cinema was based on a work by Stephen King, composed of a long series of books. I'm sure the source material is good, King is one of the best and most ingenious fantastic writers of our time and his vast literary oeuvre has already made for surprising and remarkable films. What I question is the way this adaptation was made: what are eight books converted into a two-hour film? They probably only took advantage of a handful of characters and locations and threw everything else in the trash. Works like these can only be adapted in the form of trilogies, tetralogies or, in the television market, as series. Otherwise, the source material is not properly exploited in its richness.\r\n\r\nRegardless of these issues, the film is moderately good: it all starts when the young protagonist, haunted by visions he has, finds a portal to a world he does not know, the world of his visions, and finds a Gunslinger who will help him. Deep down, he already knows the essential: the universal balance is in danger because an evil sorcerer wants to bring down the grandiose Dark Tower which, at the center of all things, harmonizes this balance and cosmic energies. I am explaining it simply and in my own words. Now the task of the two heroes is to prevent this from happening.\r\n\r\nThe best thing about this film is really the feeling of adventure, risk, the almost constant action and the way everything unfolds quickly, without dead moments. As an entertainment film, it is very good, and if we forget that it is the worst adaptation of King ever made for the cinema, we can really have a good time watching it. The big problem here is how rushed everything feels, with the film trying to do too much without having to reach its two and a half hour runtime.\r\n\r\nThe quality of the cast is another asset that makes the film work reasonably well. None of the actors are amazing, there are no great performances, but what was done is enough to push the film in the right direction: Idris Elba is charismatic and likable without ceasing to be fearsome, something his character demanded and which the actor knew to adapt. Tom Taylor also did a good job in the role of the young hero, a role where it would have been very easy to make mistakes, be superficial or ham. The villain has fallen into the shoes of Matthew McConaughey, and despite being suitably dark, he's not really a palpable threat.\r\n\r\nTechnically, the film relies heavily on CGI and effects. The film called for that, given the plot and sci-fi theme. The CGI and effects are good and work well for the most part, although there are a number of options and solutions that I would consider debatable. For example, the film never explores – nor does it have time for – the connections between parallel universes, and how there are so many people in our world who know this. The film would have gained in quality if it had been given an additional hour, or if it had been thought of as the beginning of a broader franchise, with several sequels. The cinematography is very good, the filming work is average, it has good sets, good costumes and excellent action scenes. The soundtrack, I confess, is not convincing, but it works effectively, which is already positive.", "created_at": "2023-04-27T18:49:14.456Z"}]