[{"movie_id": 66120, "review_id": "62adae2c312345008c78e70d", "author_rating": 7.0, "review_text": "**A good movie, with nice gothic touches, despite being tiring, slow, excessively dark and not very faithful to the original book.**\r\n\r\nI saw this movie very recently and was pleased. The film is a remake of an older work, from 1972, both of which are inspired by an older historical novel of the same name, published in 1796 by Matthew Gregory Lewis, an English playwright, perhaps still inspired by the vapors of republicanism and fanatical anticlericalism coming from neighboring Revolutionary France.\r\n\r\nThis film takes place in the early years of the 17th century, in the Spain of the ultra-Catholic Habsburg Kings. A baby, abandoned at the door of a Capuchin convent, becomes the prestigious preacher Friar Ambrósio, who draws crowds with his sermons. However, things change after the arrival of Valério, a new monk, whose burns force him to always keep his face covered. As time passes, we will discover that this new monk is not what he seems.\r\n\r\nThe plot is pleasant and has a Gothic touch, although it does not take place in the medieval period, but in the times of the Counter-Reformation. For me, as a historian, the film has too much imagination and there are very fanciful details, like the story of the pregnant nun left for dead. The original book is not so macabre, and it gives this character a better, more interesting and appealing plot, making the nun Agnes one of the heroines of the original story. And if it's true that I really enjoyed the dense environment and the pleasantly dark atmosphere, it's also true that the film is very still.\r\n\r\nBeing a French production, the cast is overwhelmingly French-speaking and delivers a restrained, elegant performance, more profound than truly dramatic. I liked the work done by the actresses Joséphine Japy and Déborah François, the latter being seductive without really having to show much of her body. Geraldine Chaplin also seemed to me to be fine in her short role. Roxane Duran and Frédéric Noaille both had very little time to show their worth. Ultimately, the film ends up being, almost, a one-actor film: the prestigious and competent Vincent Cassel sustains the film and gives us a mature, well-achieved and consistently intense work.\r\n\r\nMaking the gloomy environment even denser, the cinematography doesn't give us much space to see beyond the few points of light that exist in the scene. I understand that the director, Dominik Moll, wanted it, and saw in this cinematography, signed by Patrick Blossier, a mark of style, but for me, it was problematic and tiring. Without any exaggeration, there are scenes immersed in full darkness, with only the face of the actor or actress, partially visible in a very dim light. Along with this excessive darkness, the film's pace is exasperatingly slow: a 90-year-old woman in a walker walks faster. The music, signed by Alberto Iglesias, is good and does her job very well.", "created_at": "2022-06-18T10:51:24.996Z"}]