[{"movie_id": 49014, "review_id": "572a724c9251417e58000048", "author_rating": 8.0, "review_text": "I really enjoyed this Cronenberg film. Though my favourite films of his\r\nare the incredible ones he did in my teens, during the 80's\r\n('Videodrome', 'The Dead Zone' and 'The Fly' are nothing short of\r\noutstanding, and works that no one else could have come up with), he's\r\nreally been thinking outside of the box for the past decade (even for a\r\nconsistently interesting creature such as he), and it's only been\r\nrecently, with both Sarah Polley and Denis Villeneuve emerging as vital\r\ndirectors, that his ranking as the greatest Canadian director ever has\r\neven had suitable competition for comparison.\r\n\r\nI remembered when this came out, and I believe a critic from 'The Globe\r\nand Mail' interviewed Cronenberg at its opening at Cannes, and he was\r\nalmost apologetic about using Pattinson. It sounded like he didn't want\r\nto have to direct him. He made the excuse that he couldn't get funding\r\nfor his projects from North America anymore, which is a dirty rotten\r\nshame, and had to go to Europe and Asia any time he wanted to make a\r\nfilm in order to have it bankrolled, and the Japanese insisted on star\r\npower to put moviegoers in the seats, and said there'd only be\r\nfinancial backing if Cronenberg directed Pattinson. This was my first\r\nexperience watching the actor's work, and he did a fine job, no\r\nproblem. The supporting cast was strong, with many of my favourite\r\ncharacter actors of late, such as Paul Giamatti and Jay Baruchel. The\r\nscript, co-written by Cronenberg, was a strong statement about just how\r\nout of touch the very rich are with the other 99% of us. I docked my\r\nmark by 1/10 because I was pissed off that Cronenberg degraded one of\r\nthe finest actresses of our lifetime, Juliette Binoche here. I can't\r\neven talk about it. It was as difficult for me to tolerate as Spike Lee\r\nhaving Christopher Plummer call Jodie Foster something awful in the\r\notherwise excellent 'Inside Man'. Lee's off my Christmas card list for\r\nsure this year, but Cronenberg being a fellow Canadian (I bet you\r\nthought I was going to say white, hahaha), I'll be less angry. But he\r\nbetter look over his shoulder if he tries something like THAT again. I\r\nwas THAT close to crossing HIM off my Christmas card list too...\r\n\r\nI also remember from the time the film came out, an article and rating\r\non the film (I think it was 'The Globe and Mail' as well, and by the\r\nsame critic who had earlier interviewed him), saying that when he\r\nwatched it, he watched a few teenage girls leaving the theatre (most\r\nprobably because Pattinson was in it), saying it was the worst movie\r\nthey had ever seen. That's the only evidence you need that this is a\r\nfine movie, well worth your time.", "created_at": "2016-05-04T22:06:04.838Z"}]