[{"movie_id": 580489, "review_id": "6155c01a8e2ba6008bdb3393", "author_rating": null, "review_text": "When audiences last saw Eddie Brock (Tom Hardy); the journalist and his parasitic symbiote Venom; had just saved the day and cemented their unusual bond with one another.\r\n\r\nIn the new film “Venom: Let There Be Carnage”; Eddie and Venom are at the end of their Honeymoon phase as Venom is lingering to be free to eat bad people and do what is natural for him. Eddie meanwhile wants a more conservative approach feeding Venom chicken and chocolate as he knows the eyes of the authorities are still upon him and he has to convince the world that Venom is dead and no longer a threat.\r\n\r\nAt the same time; serial killer Cletus Kasady (Woody Harrelson) has selected Eddie to interview him in San Quentin and the two form an unusual connection as Cletus cryptically speaks to Eddie which underlines a deeper motivation.\r\n\r\nWith the help of Venom; Eddie is able to decipher clues found on the walls of Cletus’s cell which leads authorities to several of his victims. This results in a rapid rise in status for Eddie and fast tracks Cletus for execution as his main means of leverage is now gone.\r\n\r\nThis leads to a rift where Eddie and Venom split and each has to struggle to adjust to life without one another.\r\n\r\nAt this point, the film has mainly been odd bits of whimsy between Venom and Eddie around the establishment of the plot and threat. However, things go into chaos mode when Cletus becomes infected with a Symbiote and turns into a destruction spewing death machine known as “Carnage”.\r\n\r\nCletus and Carnage both have their own agendas and Cletus uses Carnage to exact his revenge as well as locate a figure from his past that is as big a danger as he is.\r\n\r\nAs any fan of films of this genre knows; this scenario leads to a showdown between the central characters which are awash in abundant CGI, loud noises, and destruction. While this is not a bad thing and certainly one of the main reasons I enjoy films of this type; the film never seemed to fully click for me and as such was not as good as I thought it could have been.\r\n\r\nIn many ways, the film reminded me of how comic-based films were done before Marvel started their own studios and their phenomenal run of hits based on their work.\r\n\r\nThere have been multiple attempts to adapt comics into films over the last few decades and many of them have not lived up to expectations or failed outright. One of the biggest reasons is in my opinion is that those behind the projects were hindered by the studio, wanted to put their own spin on the material and strayed from the source; or failed to show the attributes that made the characters so appealing to fans.\r\n\r\nWhat we often get is action sequences and CGI galore but without stories or characters that fully draw in the audience and fail to capture the essence of the comics.\r\n\r\nDirector Andy Serkis has done a great job with the visuals of the film but the tone seems off. The early part of the film is filled with comedic moments that are either hit or miss. Some of which was almost to the point where I wondered if it was supposed to be a parody.\r\n\r\nThe plot is fairly linear with nothing unexpected as it is simply bad guys get loose; bad guys cause death and destruction, can the heroes stop them. The climactic scene lacks any “wow” moments for me as it was mainly CGI characters rapidly moving around causing damage to one another and their environment. There was no real tension for me and the ultimate resolution seemed a bit anti-climactic.\r\n\r\nFor me the best moment of the film was a mid-credits scene that really popped as it sets up all sorts of interesting options and indicates that Venom may be about to graduate to bigger and better things.\r\n\r\nFor now; the cast is solid as is the CGI; I just wish the story was more engaging as it had the potential to be so much more.\r\n\r\n3 stars out of 5", "created_at": "2021-09-30T13:48:10.279Z"}, {"movie_id": 580489, "review_id": "616a1f77924ce6008d09fb70", "author_rating": 7.0, "review_text": "Let There be Carnage!\r\n\r\nIt is a not bad movie to watch.  The story regarding the birth of Carnage is different than the comic but works in the time they used to show this story.  The movie does not give a ton of back story on the dual villains in the story but they show the love they have for one another.  \r\n\r\nThe movie is short and very fast pace.  It also has plenty of comedy between the hosts and the symbiotes.  \r\n\r\nOverall the movie sets up for a Venom 3 and an inclusion of Venom into the MCU.  If the relationship between Sony & Marvel can continue to be good fans of the franchise will have a bright future ahead.", "created_at": "2021-10-16T00:40:23.907Z"}, {"movie_id": 580489, "review_id": "618b50c7d55e4d0064777c4f", "author_rating": 7.0, "review_text": "**Yes . . . This Is A Big Fun Film, Period. But Given Cletus's BARBARIC Convenience Store Murder~\r\n{ A L O N E❗} How Is It Rated \"PG13\" Or Below 😲 . . . IN -{ THESE }- MANY DARN COUNTRIES❓**\r\n\r\nA **-{ _B I G_ }-** Screen **MINI** Review ; Film Seen By Me -{ Twice }- ; First On Oct.20, And Then Nov. 04, '21.\r\n\r\n______________________________________________________ \r\n\r\nVenom : \"Time to die!!!\" ( said by him as he and Eddie verge on a full on \"War-charge\" of the -genuinely- \"Terrifying\" looking Carnage ).\r\n\r\nEddie : \" That’s the spirit ! ! \"\r\n\r\nVenom : \"I mean us. **-{ W E }-** are going to die!!!\". \r\n\r\n______________________________________________________ \r\n\r\n**A \" UPSIDES-1ST, If You Please { I write \" Exclusively Constructive ✅ \" Reviews ; Here're Some Of The Movie's Plus-Points, Right Up Front } \" :** 1 : There's a LOT of -Very- entertaining humour right the way through \"Venom: Let There Be Carnage\" ( to be referred to henceforth as 'V2' ) . . . . from 'Eddie Brock' ( Tom Hardy )'s \"Odd Couple\" style interactions with 'Venom' ( also played by -Him- , of course ) . . . . to some often tender, and occasionally even genuinely -Moving- banter, within the undeniably funny **\"Love-quadrangle\"** of Eddie and Venom , along with 'Anne Weying' and 'Dr. Dan Lewis' ( Michelle Wiilliams and Reid Scott, respectively ). 2 : Tom Hardy succeeds **-Phenomenally-** , in delivering his \"super-symbiotic\" performance ; with an -{ ABSOLUTE }- degree of credibility. How I wish more people would only appreciate how **( -Incredibly- )** difficult it is to emote for two -very- different entities, -near- simultaneously, that exist within just -{ ONE SINGLE }- body. 3 : Venom's \"Mardi-Gras Themed Nightclub Scene\". Simply stated, it's just absofreakinglutely -{ H I 💥 😂 - larious }. What's more, if you're a -passionate- progressive ( in real life ), like me, then you are almost -certain- to completely -{ Adore }- the 'horrible yet affable' Antihero's -equally- passionate appeal to stop \"Cruelty Against **ALIENS**\" . . . just a 'Glorious', ( albeit somewhat implicit ) message about the need to be -'Kinder'- to immigrants, documented or otherwise, delivered just -as- 'Gloriously' . . . ( Need I really say more ? ). \r\n\r\n**B \" ( _PLEASE_ ) , Let There Be Common Sense ! \" :** 1 : There are some -{ Extreme }- abuse & violence related thematic elements in a film that is rated 'PG-13' ( Or Below ! ) in at least -Fifteen- countries, & that's -just- on IMDb's -very limited- \"Certications\" list, -{ ALONE ! }- . 2 : In a nutshell : the ( entirety ) of the -Story- , per se , feels a little too **-{ \" SIMPLISTIC 🤷‍♂️ \" }-** ; not to mention the picture's almost -{ \"Confoundingly\" }- short, & somewhat \"Disappointing\", frankly, runtime of 97 minutes ; for what is essentially a -{ MARVEL }- cinematic offering. So here is perhaps -{ The }- most significant reason for -Why- that was the case, in my best estimation. Tom Hardy and Kelly Marcel, V2's storywriters . . . . -{ collectively }- lacked the requisite experience to rise to the indubitably -gargantuan- task of ( -Adequately- ) enthralling a whole -Planet- ; one that has now become -Altogether- used to watching 'PHENOMENALLY' entertaining Marvel fare, and there's really no other way to say it. Tom, ( whom I 'Admire To Death' as a -performer- , I definitely ought to point out here ), had only two✌ **-STORY-** writing credits to his name prior to V2 , with Kelly logging just three👌 . . . { counting 'Individual' TV Series, but -Not- counting 'Shorts' ( short films ), of course }. 3 : A \" MASSIVE \" Missed Opportunity : It is -indeed- not all that often that we see a quintessential 'Popcorn-blockbuster' flick make a -significant- effort to -Humanize- the villain by way of their -{ Early Childhood Experiences }- , no matter -how- evil they nay be shown as being. For V2 to first -very- SUCCESSFULLY achieve this with the \"Supremely\" prolific actor Woody Harrelson's 'Carnage' ...( finalé )... only to have said moment -Utterly- invalidated just a few cinematic beats later ( -you'll know when you see it- ) was quite the let down, 'Alas' 😔\r\n\r\n**C \" FINAL SUMMARY \" :** I have absolutely -{ N O }- doubt in my mind that had V2 been roughly 'a good 23 minutes' longer ( -At Least- , in order to make for a more \"Marvel-like\" runtime of Two-full-hours ) ; that I would have given it a mimimum score of '8 out of 10', without a moment's thought. -That- , in addition of course, to my \"Titular-gripe\" . . . ( me being the -Doting- parent that I like to think I am ), brings me to the conclusion that this -nonetheless- **{ Undeniably }** Fun, Exciting, \"Idiosyncratic Delight\" of a Movie is -Still- most definitely worthy of -{ 7.50 'Rock-Solid' Marks Out Of 10 }- **. . . . NOTWITHSTANDING 🔥**", "created_at": "2021-11-10T04:55:35.832Z"}, {"movie_id": 580489, "review_id": "6194bd3835c30a00227cd64d", "author_rating": 9.0, "review_text": "I liked it very much, so I add my top ten to the already existing positive reviews. The film is great in its genre. After the first viewing, it seemed to me that the second film would be stronger than the first. Duo Hardy-Harrelson = aerobatics. In the end, from the abundance of excellent jokes, my facial muscles ached (by the way, special thanks to the translators for the texts). I'm waiting for the continuation, it's very interesting to know what other capabilities Venom will demonstrate.", "created_at": "2021-11-17T08:28:40.190Z"}, {"movie_id": 580489, "review_id": "61b914c1cb75d10096f85f9a", "author_rating": 6.0, "review_text": "_Venom: Let There Be Carnage_ never tries to be anything other than a dumb superhero film, but if you hated the first film, the sequel won’t make you feel any differently about Marvel’s lethal protector.\r\n\r\nHardy, in dual roles, is what makes these films worthwhile in the slightest, as his intricately comical self-chemistry is insane. The film also boasts what feels like an accelerated pace that moves the story from action sequence to action sequence before coming to an end rather quickly, leaving _Venom: Let There Be Carnage_ to stand as one of those a special kind of stupid blockbuster endeavors that, every so often, strikes idiotic gold.\r\n\r\nThe sequel is a definite improvement over the first film in the sense that it totally embraces its stupidity resulting in a comic book film that feels light, silly, and amusingly psychotic all at the same time.\r\n\r\n**Full review:** https://boundingintocomics.com/2021/10/05/venom-let-there-be-carnage-review-idiotic-gold/", "created_at": "2021-12-14T22:03:45.696Z"}, {"movie_id": 580489, "review_id": "61ccc17841aac400422206a9", "author_rating": 7.0, "review_text": "Passably entertaining sequel that is better than the original though I found that one utterly bland. This one still has the issue of me checking out once you have a CGI character fighting another CGI character. However, the interaction between Brock and Venom was great and the effects work wasn't bad, though most of the time scenes were dimly lit. **3.25/5**", "created_at": "2021-12-29T20:13:44.313Z"}, {"movie_id": 580489, "review_id": "620ce841e21023006851d78c", "author_rating": 5.0, "review_text": "I'm gonna give this Venom movie a not so great rating.  I still love the character.  Venom is the quintissential anti-hero.  Once a bad guy (though not in this universe apparently) he now tries to do the right thing while keeping within acceptable norms to exist among humans.  \r\nThis movie was a good attempt but, it came across as contrived and a bit cookie cutter as far as the bad guys, Woody Harrelson and Naomi Harris, were portrayed.  Psychoes enjoying newfound freedom after a fail death sentence, and lifelong incarceration is soooooo....bland.  In short, \"It's been done (before).\"  \r\n\r\nThe story from there is hit 'n miss with comedy, plot, and tension.  The movie pretty much happens in that manner as well.  It jumps as if each of the scenes are little movies banded together with no smooth transitions : Hardy really needs to workout or pass the character to someone else; his age is showing.  Harrelson and Harris' characters really didn't mesh, the half deaf cop never really fit into the story, we didn't hear enough from Carnage, and Venom's night out didn't actually go anywhere.  \r\n\r\nThe vibe of the movie felt clunky.\r\n\r\nI'll always like Venom.  But this was not particularly thrilling.  There is mixed opinion on which of the two movies is better.  I'll have to fall into the camp of those who liked the first Venom movie.  The second, more than not, simply let me down.  So, I will wait and see if another company can do better with the character than its predecessors.  3/5 stars.", "created_at": "2022-02-16T12:04:17.772Z"}, {"movie_id": 580489, "review_id": "622ff655b0040a001ef8de27", "author_rating": 7.0, "review_text": "I didn't get as much entertainment from this as I did with its predecessor. Still narrowly good enough, though.\r\n\r\n<em>'Venom: Let There Be Carnage'</em> - great title, fwiw - does retain the fun performance from Tom Hardy, while the introductions of Stephen Graham, Woody Harrelson and Naomie Harris are welcomed ones in terms of the cast; even if I think their characters, particularly the latter two, are a little hit-and-miss throughout.\r\n\r\nThe action and the fact that the film only lasts for around 90 minutes mean I didn't have a negative time watching this; it is sillier this time out, which also helps. Could be a 6/10 film, but for me it inches itself into 7/10 territory.", "created_at": "2022-03-15T02:13:41.744Z"}, {"movie_id": 580489, "review_id": "6240597c706e56008bd25ee2", "author_rating": 6.0, "review_text": "I was really looking forward to this. I enjoyed the first one and the trails for this sequel looked fun... What happened? It is all over the place. It starts off promisingly enough with an enjoyable set piece with \"Eddie\" (Tom Hardy) and Michelle Williams (\"Anne\") - aided by some pithy one-liners from an unseen \"Venom\" but after we are introduced to \"Cletus\" (Woody Harrelson) the thing really hits the skids. The entertaining elements from the first film, the humour and - dare I say it, the symbiotic relationship/tolerance of man and amoeba are thrown under the bus for this angry CGI fest. Add to this pretty dry mix the rather pointless character of Harrelson's childhood sweetheart \"Frances\" (Naomie Harris) alias \"the Scream\" (remember the symbiotes don't like fire of sound), with her own agenda against copper \"Mulligan\" (Stephen Graham) and the whole thing just boils down to a very good looking film - but one with a plot that was almost non-existent, and that robbed the formidably sarcastic \"Venom\" of much of the charm that made the original work. Come to think on it - Hardy hardly features at all. I didn't hate it - it has a pace that passes 90 minutes effortlessly enough, but sorry, I was really disappointed.", "created_at": "2022-03-27T12:33:00.825Z"}, {"movie_id": 580489, "review_id": "62dfa37d5ca7040b29914866", "author_rating": 6.0, "review_text": "Let me say this... It isn't a bad movie to watch at all.\r\n\r\nFelt more like an after thought of the previous film than it's own film. It becomes messy trying to hear Venom cause he talks so fast. Carnage was bad ass... His love interest felt tacked on and cliche. Did we need Michelle Williams back? Not really. The ending... It set up a huge potential for a film I am sure fans would LOVE to see.", "created_at": "2022-07-26T08:19:10.004Z"}]