[{"movie_id": 14438, "review_id": "6307aacab042280082ea3fab", "author_rating": 4.0, "review_text": "I think Catherine Holt (Erin Bethea) sums up very well what’s wrong with her marriage to Caleb (Kirk Cameron): “You can’t expect me to work every day and get the groceries while you look at trash on the Internet dreaming about your boat.” \r\n\r\nShe has a point, or rather two. According to her, Caleb “tuck[s] away a third of [his] salary saving for a boat we don’t need. [He has] $24,000 in savings when things in our house need fixing.\" \r\n\r\nYou can’t argue with that; having a boat is after all a single guy kind of thing to do. I don’t need to tell the movie this – what with it being a \"faith-based” drama –, but “No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon.” In other words, ye cannot have a wife and a boat.\r\n\r\nAs for the “trash” that Caleb is so fond of – i.e., porn –, I could see a way to work that into a marriage, but then both parties would have to be on board, and that’s precisely the problem with this movie. \r\n\r\nTo help him save his marriage, Caleb’s father John (Harris Malcom) presents him with “The Love Dare;” a 40-day program that goes something like this: “Day one: … For the next day resolve to say nothing negative to your spouse at all. If the temptation arises, choose not to say anything … Day two: … In addition to saying nothing negative to your spouse today, do at least one unexpected gesture as an act of kindness,” and so on and so forth (on the 16th day he has to pray for her; in the movie’s funniest line, Caleb confesses “I kind of skipped that one.” This obviously happens before he relents and accepts Jesus Christ into his heart). \r\n\r\nCatherine takes her husband’s newfound attentiveness with a grain of salt (her friends advise her that “He’s trying to butter you up for a divorce,” whatever that means). \r\n\r\nCaleb calls his father and complains that “None of this means anything to her,” and he’s right, but how could it be any other way? How can something she doesn’t even know is going on mean anything to her? \r\n\r\nOddly, when John talks about his experience with the Love Dare, he speaks in plural – e.g., “There was a point when we had no hope either” –; unless he’s using the royal ‘We,’ he means himself and Caleb’s mother. Caleb, on the other hand, hides the whole thing from Catherine, which a) doesn’t seem like the best way to go about repairing your marriage and b) wouldn’t it work better if it were a two-sided effort? It’s not like she’s completely blameless, either. \r\n\r\nAnd now to give the Devil, or I guess Jesus, his due. Caleb is a firefighter, and he and his crew are called to the scene of a traffic accident. A woman is trapped inside the wrecked vehicle, which in turn is sitting on some tracks right on the path of an oncoming train. They are “currently unable to make contact with the train dispatcher,” so Caleb & Co. have no choice but to manfully push the car out of harm’s way.\r\n\r\nThis is all kinds of great. Not only does it put to shame many a newer, much more expensive film (is it an actual train? I’m not going to go out on a limb that it is, but if it’s CGI, then it’s the best damn CGI train I’ve ever seen), but it makes me care about the characters because I can believe they truly are firefighters putting their lives on the line – quite literally, in this case. \r\n\r\nNow, if only the movie had been about firefighting instead of a loveless marriage that avoids ending up in divorce thanks to a little ménage à dieu.", "created_at": "2022-08-25T17:00:58.901Z"}]