[{"movie_id": 313369, "review_id": "58e3a6a4c3a368731a0209e8", "author_rating": 5.0, "review_text": "\"To me, _La La Land_ is like religion. I see the appeal, and I would never take it away from anyone. But I would also never stand in line for it.\" \r\n- Jeff WInger, probably.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2017-04-04T13:59:00.365Z"}, {"movie_id": 313369, "review_id": "58fff29bc3a3681036004140", "author_rating": 10.0, "review_text": "A very special, memorable film that will be iconic in the years to come.", "created_at": "2017-04-26T01:06:35.565Z"}, {"movie_id": 313369, "review_id": "595e3425c3a36828fc07c036", "author_rating": 6.0, "review_text": "This is definitely not a movie that I would have chosen to watch all by myself which perhaps explain why I thought it was just surprisingly okay to watch. However my girlfriend absolutely wanted to watch it so I got it. As it turned out my girlfriend had only gone by the number of Oscars and not really looked up what kind of movie it actually was so in the end I was enjoying the movie a lot more than she did.\r\n\r\nThis movie is pretty much a quite classical Hollywood musical with a non too original story, nice music and dancing. In addition the cinematography  is simply excellent. This is the strong point of this movie. The rest of the movie is of lesser interest to me but the cinematography is really, really good. The scene, pictured on the movie poster, were Mia and Sebastian dances and everything in the scene are dark blue tones except Mia’s bright yellow dress is so simple and yet so beautiful.\r\n\r\nEverything else about this movie is…okay. Okay acting, okay story etc.  As I wrote before this is really not my kind of movie so forgive me for not being overly enthusiastic. I am sure those into these kind of movies cannot understand how anyone can give it less than a full set of stars but hey, different tastes and all that.\r\n\r\nI cannot make up my mind about ending. On one hand I am a sucker for happy endings which this one falls a wee bit short on. On the other hand I have to commend the writer/director for not taking the path of least resistance and instead putting together something a wee bit different.\r\n\r\nI did feel that a part of the movie was missing though. I would have liked to see the parts where Mia and Sebastian actually fulfilled their respective dreams. Jumping fast forward to the ending like the movie did felt a bit like they either ran out of money or they manage to misplace half the story!\r\n\r\nAnyway, I enjoyed the movie more than I thought I would.", "created_at": "2017-07-06T12:59:17.075Z"}, {"movie_id": 313369, "review_id": "597e07e0c3a3685451019402", "author_rating": 7.0, "review_text": "**They'd crossed each others life while chasing their dreams.**\r\n\r\nI am not a big fan of modern musical films. So I was not expecting it to be a great or worst. The film opened with a song that I was not happy, because I did not like the verse or the music. And again to say, the modern timeline does not suit for the musical theme, unless it is a fantasy or an Indian film. \r\n\r\nThe best part of the film was, those song fades away as the film progresses. But I kind of liked the drama/story part and the climax track with the quick flashback (kind of). Till that scene I was considering it an average film, but that one scene changed my stance. So, now I think it is a good film, but winning 6 Oscars, I don't know it deserved that.\r\n\r\nYes, the director is known for making music and musical film, but he has not made many. He's young and so his career. Yep, I loved 'Whiplash'. One of my all time favourite. If that film had won 10 Oscars, I would have not surprised at all. After that flick, the people were anticipating, to exceed that success in this film. As it was received, no doubt for those people it was a different flick, but not for me. Especially if you watch lots of Indian films. By the way the film characters were nice, and so the story, but not the songs.\r\n\r\nGosling and Stone were performed well. The chemistry between them was great. The narration was going decently until the end, which reminded me 'Vinnaithaandi Varuvaaya' ending that I was not happy about, yet something different than usual. Sometimes I am okay with cliché than this kind of conclusion, just to bring a change in storytelling. Overall an enjoyable film, most people would love it. Some like me would say it is a decent flick, but there's always a few who would never favour it. Yet worth a watch.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:22:56.642Z"}, {"movie_id": 313369, "review_id": "5fe7f8f64d0e8d003f7ae43e", "author_rating": 8.0, "review_text": "Undeniably well put together, and entertaining, even if it certainly chooses style over substance.\r\n\r\n<em>'La La Land'</em> is an absolutely gorgeous-looking film, from the costumes to the cinematography to the choreography. The musical numbers are pleasant too. It is a little light on story, not that it isn't entertaining - it is. They were, evidently to me, going for an artsy film and they nailed that. I just personally wanted more depth to the plot, rather than a song every few minutes.\r\n\r\nRyan Gosling is probably one of my favourite actors around right now, in the argument at least, and he is very good here. So is Emma Stone, who is arguably the film's standout. I wanted to watch more of Stone's work even before this, so I knew - along with Gosling - I was going to enjoy the cast. They work excellently as a duo. Elsewhere, John Legend's role is a tad out of place, even if it's good to see him.\r\n\r\n4*. It might make for lame viewing if you absolutely do not like musicals, but otherwise it's 100% worth a watch - even for someone with a mild taste for musicals, like me.", "created_at": "2020-12-27T03:01:10.242Z"}, {"movie_id": 313369, "review_id": "62b0beea3cd12c005203beaa", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/beautiful-dreamer-la-la-landnbspreview<a>\r\n\r\nLos Angeles is an easy city to deeply love and deeply hate, and it is impossible to describe that to someone who has never lived there. The closest a non-resident can come to gaining an understanding of that sensation is by watching Damien Chazelle’s _La La Land_. On the one hand, there are the warm, sun-kissed beaches, the millionaires, and the secluded canyons of the San Gabriel mountains. It’s the promised land of golden dreams for actors, musicians, and writers, where success is always right around the corner. On the other hand, you’ll find smog, traffic, and abject failure. Los Angeles, with all its promises, is a pendulum that swings widely.", "created_at": "2022-06-20T18:39:38.739Z"}, {"movie_id": 313369, "review_id": "63dc9442373ac20085d6f875", "author_rating": 8.0, "review_text": "**Really a good movie, which justifies the hype around it.**\r\n\r\nWho doesn't remember “La La Land”? It was released in theaters in 2016, and was one of the most viewed and acclaimed films of that year. It was a film that was virtually carried in the lap between festivals and awards of the seventh art, and that seemed destined to clean them all up, as “Titanic” had done two decades before. When he arrived at the Oscars, he had practically nominations in almost every category where he could be included! Of the fourteen nominations, however, it collected “only” six statuettes, with the seventh – Best Film – slipping through the fingers in what was the most absolute embarrassment in the entire history of the Hollywood Academy: the infamous but historic exchange of envelopes, that we all have in our memory. But when I said “only”, it is necessary to put things in perspective: what many producers would not have given to win six Oscars in one of their films! Like it or not, it was a great achievement and \"La La Land\" received a well-deserved accolade that night.\r\n\r\nThe film, directed by newcomer Damien Chazelle, is a worthy homage to musicals from Hollywood's golden age, and features a generally sympathetic script: an aspiring starlet trying to become an actress meets and falls in love with a purist jazz pianist. who wants to restore people's interest in the musical genre he loves, and which he feels is slowly being lost. It is their mutual passion that makes them not give up on their respective dreams, but it will also end up dictating that both follow their own paths. And indeed, the film's bittersweet and slightly too realistic ending shockingly clashes with the magic felt throughout the rest of the film. It's like having a very beautiful dream, where anything is possible with some effort and serious work, and ending up seeing that dream trampled by a heavy, raw and often unfair reality. And it must be said, although the characters seem likeable, they are selfish and only think about themselves and their interests. They seem to stick together only as long as it really benefits their individual interests.\r\n\r\nAlthough I don't like the characters very much, Emma Stone and Ryan Gosling offer us, in the film, two magnificent works of interpretation and also of singing and dancing. Gosling showed hidden talents on the keyboard of a piano, and both are very good at choreography, although singing is not particularly strong point for either. Both are young, and it is quite possible that they will give us even better dramatic performances in the future. The rest of the film's cast hardly matters, it's one of those movies where the main characters are so overwhelming and omnipresent that there's no room for anyone else.\r\n\r\nTechnically, the film has several frankly good aspects that deserve our attention and our praise. For starters, the film's honest and intelligent way of recreating and inserting scenes and dance routines from the great musicals of the past, from “Shall We Dance” to “Singing in the Rain” and “West Side Story”. The scenarios, the elements, the routines are there. The cinematography, colorful, frank, generous with light, is magnificent and a feast for the eyes. The editing was done in an excellent and very skillful way. The scenery couldn't be better, taking advantage of the Hollywood Hills or the Griffith Observatory in the best way. The soundtrack, melodies and songs are excellent.", "created_at": "2023-02-03T04:57:38.988Z"}, {"movie_id": 313369, "review_id": "6469fa49d185720120814c8f", "author_rating": 9.0, "review_text": "A fully-fledged musical of the likes we haven't seen on the big screen in decades. This move is almost perfect in every respect. It will draw a laugh, it will draw a tear and it will definitely get your foot tapping. I have to admit the reality ending crushed my enjoyment a little. I understand why the director did it but that doesn't mean I have to like it.", "created_at": "2023-05-21T11:02:33.319Z"}, {"movie_id": 313369, "review_id": "65075db68ee49c00ab5823f4", "author_rating": 10.0, "review_text": "This movie is the best movie there will ever be, Ryan and Emma did great.", "created_at": "2023-09-17T20:12:38.309Z"}, {"movie_id": 313369, "review_id": "58e3a6a4c3a368731a0209e8", "author_rating": 5.0, "review_text": "\"To me, _La La Land_ is like religion. I see the appeal, and I would never take it away from anyone. But I would also never stand in line for it.\" \r\n- Jeff WInger, probably.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2017-04-04T13:59:00.365Z"}, {"movie_id": 313369, "review_id": "58fff29bc3a3681036004140", "author_rating": 10.0, "review_text": "A very special, memorable film that will be iconic in the years to come.", "created_at": "2017-04-26T01:06:35.565Z"}, {"movie_id": 313369, "review_id": "595e3425c3a36828fc07c036", "author_rating": 6.0, "review_text": "This is definitely not a movie that I would have chosen to watch all by myself which perhaps explain why I thought it was just surprisingly okay to watch. However my girlfriend absolutely wanted to watch it so I got it. As it turned out my girlfriend had only gone by the number of Oscars and not really looked up what kind of movie it actually was so in the end I was enjoying the movie a lot more than she did.\r\n\r\nThis movie is pretty much a quite classical Hollywood musical with a non too original story, nice music and dancing. In addition the cinematography  is simply excellent. This is the strong point of this movie. The rest of the movie is of lesser interest to me but the cinematography is really, really good. The scene, pictured on the movie poster, were Mia and Sebastian dances and everything in the scene are dark blue tones except Mia’s bright yellow dress is so simple and yet so beautiful.\r\n\r\nEverything else about this movie is…okay. Okay acting, okay story etc.  As I wrote before this is really not my kind of movie so forgive me for not being overly enthusiastic. I am sure those into these kind of movies cannot understand how anyone can give it less than a full set of stars but hey, different tastes and all that.\r\n\r\nI cannot make up my mind about ending. On one hand I am a sucker for happy endings which this one falls a wee bit short on. On the other hand I have to commend the writer/director for not taking the path of least resistance and instead putting together something a wee bit different.\r\n\r\nI did feel that a part of the movie was missing though. I would have liked to see the parts where Mia and Sebastian actually fulfilled their respective dreams. Jumping fast forward to the ending like the movie did felt a bit like they either ran out of money or they manage to misplace half the story!\r\n\r\nAnyway, I enjoyed the movie more than I thought I would.", "created_at": "2017-07-06T12:59:17.075Z"}, {"movie_id": 313369, "review_id": "597e07e0c3a3685451019402", "author_rating": 7.0, "review_text": "**They'd crossed each others life while chasing their dreams.**\r\n\r\nI am not a big fan of modern musical films. So I was not expecting it to be a great or worst. The film opened with a song that I was not happy, because I did not like the verse or the music. And again to say, the modern timeline does not suit for the musical theme, unless it is a fantasy or an Indian film. \r\n\r\nThe best part of the film was, those song fades away as the film progresses. But I kind of liked the drama/story part and the climax track with the quick flashback (kind of). Till that scene I was considering it an average film, but that one scene changed my stance. So, now I think it is a good film, but winning 6 Oscars, I don't know it deserved that.\r\n\r\nYes, the director is known for making music and musical film, but he has not made many. He's young and so his career. Yep, I loved 'Whiplash'. One of my all time favourite. If that film had won 10 Oscars, I would have not surprised at all. After that flick, the people were anticipating, to exceed that success in this film. As it was received, no doubt for those people it was a different flick, but not for me. Especially if you watch lots of Indian films. By the way the film characters were nice, and so the story, but not the songs.\r\n\r\nGosling and Stone were performed well. The chemistry between them was great. The narration was going decently until the end, which reminded me 'Vinnaithaandi Varuvaaya' ending that I was not happy about, yet something different than usual. Sometimes I am okay with cliché than this kind of conclusion, just to bring a change in storytelling. Overall an enjoyable film, most people would love it. Some like me would say it is a decent flick, but there's always a few who would never favour it. Yet worth a watch.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:22:56.642Z"}, {"movie_id": 313369, "review_id": "5fe7f8f64d0e8d003f7ae43e", "author_rating": 8.0, "review_text": "Undeniably well put together, and entertaining, even if it certainly chooses style over substance.\r\n\r\n<em>'La La Land'</em> is an absolutely gorgeous-looking film, from the costumes to the cinematography to the choreography. The musical numbers are pleasant too. It is a little light on story, not that it isn't entertaining - it is. They were, evidently to me, going for an artsy film and they nailed that. I just personally wanted more depth to the plot, rather than a song every few minutes.\r\n\r\nRyan Gosling is probably one of my favourite actors around right now, in the argument at least, and he is very good here. So is Emma Stone, who is arguably the film's standout. I wanted to watch more of Stone's work even before this, so I knew - along with Gosling - I was going to enjoy the cast. They work excellently as a duo. Elsewhere, John Legend's role is a tad out of place, even if it's good to see him.\r\n\r\n4*. It might make for lame viewing if you absolutely do not like musicals, but otherwise it's 100% worth a watch - even for someone with a mild taste for musicals, like me.", "created_at": "2020-12-27T03:01:10.242Z"}, {"movie_id": 313369, "review_id": "62b0beea3cd12c005203beaa", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/beautiful-dreamer-la-la-landnbspreview<a>\r\n\r\nLos Angeles is an easy city to deeply love and deeply hate, and it is impossible to describe that to someone who has never lived there. The closest a non-resident can come to gaining an understanding of that sensation is by watching Damien Chazelle’s _La La Land_. On the one hand, there are the warm, sun-kissed beaches, the millionaires, and the secluded canyons of the San Gabriel mountains. It’s the promised land of golden dreams for actors, musicians, and writers, where success is always right around the corner. On the other hand, you’ll find smog, traffic, and abject failure. Los Angeles, with all its promises, is a pendulum that swings widely.", "created_at": "2022-06-20T18:39:38.739Z"}, {"movie_id": 313369, "review_id": "63dc9442373ac20085d6f875", "author_rating": 8.0, "review_text": "**Really a good movie, which justifies the hype around it.**\r\n\r\nWho doesn't remember “La La Land”? It was released in theaters in 2016, and was one of the most viewed and acclaimed films of that year. It was a film that was virtually carried in the lap between festivals and awards of the seventh art, and that seemed destined to clean them all up, as “Titanic” had done two decades before. When he arrived at the Oscars, he had practically nominations in almost every category where he could be included! Of the fourteen nominations, however, it collected “only” six statuettes, with the seventh – Best Film – slipping through the fingers in what was the most absolute embarrassment in the entire history of the Hollywood Academy: the infamous but historic exchange of envelopes, that we all have in our memory. But when I said “only”, it is necessary to put things in perspective: what many producers would not have given to win six Oscars in one of their films! Like it or not, it was a great achievement and \"La La Land\" received a well-deserved accolade that night.\r\n\r\nThe film, directed by newcomer Damien Chazelle, is a worthy homage to musicals from Hollywood's golden age, and features a generally sympathetic script: an aspiring starlet trying to become an actress meets and falls in love with a purist jazz pianist. who wants to restore people's interest in the musical genre he loves, and which he feels is slowly being lost. It is their mutual passion that makes them not give up on their respective dreams, but it will also end up dictating that both follow their own paths. And indeed, the film's bittersweet and slightly too realistic ending shockingly clashes with the magic felt throughout the rest of the film. It's like having a very beautiful dream, where anything is possible with some effort and serious work, and ending up seeing that dream trampled by a heavy, raw and often unfair reality. And it must be said, although the characters seem likeable, they are selfish and only think about themselves and their interests. They seem to stick together only as long as it really benefits their individual interests.\r\n\r\nAlthough I don't like the characters very much, Emma Stone and Ryan Gosling offer us, in the film, two magnificent works of interpretation and also of singing and dancing. Gosling showed hidden talents on the keyboard of a piano, and both are very good at choreography, although singing is not particularly strong point for either. Both are young, and it is quite possible that they will give us even better dramatic performances in the future. The rest of the film's cast hardly matters, it's one of those movies where the main characters are so overwhelming and omnipresent that there's no room for anyone else.\r\n\r\nTechnically, the film has several frankly good aspects that deserve our attention and our praise. For starters, the film's honest and intelligent way of recreating and inserting scenes and dance routines from the great musicals of the past, from “Shall We Dance” to “Singing in the Rain” and “West Side Story”. The scenarios, the elements, the routines are there. The cinematography, colorful, frank, generous with light, is magnificent and a feast for the eyes. The editing was done in an excellent and very skillful way. The scenery couldn't be better, taking advantage of the Hollywood Hills or the Griffith Observatory in the best way. The soundtrack, melodies and songs are excellent.", "created_at": "2023-02-03T04:57:38.988Z"}, {"movie_id": 313369, "review_id": "6469fa49d185720120814c8f", "author_rating": 9.0, "review_text": "A fully-fledged musical of the likes we haven't seen on the big screen in decades. This move is almost perfect in every respect. It will draw a laugh, it will draw a tear and it will definitely get your foot tapping. I have to admit the reality ending crushed my enjoyment a little. I understand why the director did it but that doesn't mean I have to like it.", "created_at": "2023-05-21T11:02:33.319Z"}, {"movie_id": 313369, "review_id": "65075db68ee49c00ab5823f4", "author_rating": 10.0, "review_text": "This movie is the best movie there will ever be, Ryan and Emma did great.", "created_at": "2023-09-17T20:12:38.309Z"}, {"movie_id": 313369, "review_id": "58e3a6a4c3a368731a0209e8", "author_rating": 5.0, "review_text": "\"To me, _La La Land_ is like religion. I see the appeal, and I would never take it away from anyone. But I would also never stand in line for it.\" \r\n- Jeff WInger, probably.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2017-04-04T13:59:00.365Z"}, {"movie_id": 313369, "review_id": "58fff29bc3a3681036004140", "author_rating": 10.0, "review_text": "A very special, memorable film that will be iconic in the years to come.", "created_at": "2017-04-26T01:06:35.565Z"}, {"movie_id": 313369, "review_id": "595e3425c3a36828fc07c036", "author_rating": 6.0, "review_text": "This is definitely not a movie that I would have chosen to watch all by myself which perhaps explain why I thought it was just surprisingly okay to watch. However my girlfriend absolutely wanted to watch it so I got it. As it turned out my girlfriend had only gone by the number of Oscars and not really looked up what kind of movie it actually was so in the end I was enjoying the movie a lot more than she did.\r\n\r\nThis movie is pretty much a quite classical Hollywood musical with a non too original story, nice music and dancing. In addition the cinematography  is simply excellent. This is the strong point of this movie. The rest of the movie is of lesser interest to me but the cinematography is really, really good. The scene, pictured on the movie poster, were Mia and Sebastian dances and everything in the scene are dark blue tones except Mia’s bright yellow dress is so simple and yet so beautiful.\r\n\r\nEverything else about this movie is…okay. Okay acting, okay story etc.  As I wrote before this is really not my kind of movie so forgive me for not being overly enthusiastic. I am sure those into these kind of movies cannot understand how anyone can give it less than a full set of stars but hey, different tastes and all that.\r\n\r\nI cannot make up my mind about ending. On one hand I am a sucker for happy endings which this one falls a wee bit short on. On the other hand I have to commend the writer/director for not taking the path of least resistance and instead putting together something a wee bit different.\r\n\r\nI did feel that a part of the movie was missing though. I would have liked to see the parts where Mia and Sebastian actually fulfilled their respective dreams. Jumping fast forward to the ending like the movie did felt a bit like they either ran out of money or they manage to misplace half the story!\r\n\r\nAnyway, I enjoyed the movie more than I thought I would.", "created_at": "2017-07-06T12:59:17.075Z"}, {"movie_id": 313369, "review_id": "597e07e0c3a3685451019402", "author_rating": 7.0, "review_text": "**They'd crossed each others life while chasing their dreams.**\r\n\r\nI am not a big fan of modern musical films. So I was not expecting it to be a great or worst. The film opened with a song that I was not happy, because I did not like the verse or the music. And again to say, the modern timeline does not suit for the musical theme, unless it is a fantasy or an Indian film. \r\n\r\nThe best part of the film was, those song fades away as the film progresses. But I kind of liked the drama/story part and the climax track with the quick flashback (kind of). Till that scene I was considering it an average film, but that one scene changed my stance. So, now I think it is a good film, but winning 6 Oscars, I don't know it deserved that.\r\n\r\nYes, the director is known for making music and musical film, but he has not made many. He's young and so his career. Yep, I loved 'Whiplash'. One of my all time favourite. If that film had won 10 Oscars, I would have not surprised at all. After that flick, the people were anticipating, to exceed that success in this film. As it was received, no doubt for those people it was a different flick, but not for me. Especially if you watch lots of Indian films. By the way the film characters were nice, and so the story, but not the songs.\r\n\r\nGosling and Stone were performed well. The chemistry between them was great. The narration was going decently until the end, which reminded me 'Vinnaithaandi Varuvaaya' ending that I was not happy about, yet something different than usual. Sometimes I am okay with cliché than this kind of conclusion, just to bring a change in storytelling. Overall an enjoyable film, most people would love it. Some like me would say it is a decent flick, but there's always a few who would never favour it. Yet worth a watch.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:22:56.642Z"}, {"movie_id": 313369, "review_id": "5fe7f8f64d0e8d003f7ae43e", "author_rating": 8.0, "review_text": "Undeniably well put together, and entertaining, even if it certainly chooses style over substance.\r\n\r\n<em>'La La Land'</em> is an absolutely gorgeous-looking film, from the costumes to the cinematography to the choreography. The musical numbers are pleasant too. It is a little light on story, not that it isn't entertaining - it is. They were, evidently to me, going for an artsy film and they nailed that. I just personally wanted more depth to the plot, rather than a song every few minutes.\r\n\r\nRyan Gosling is probably one of my favourite actors around right now, in the argument at least, and he is very good here. So is Emma Stone, who is arguably the film's standout. I wanted to watch more of Stone's work even before this, so I knew - along with Gosling - I was going to enjoy the cast. They work excellently as a duo. Elsewhere, John Legend's role is a tad out of place, even if it's good to see him.\r\n\r\n4*. It might make for lame viewing if you absolutely do not like musicals, but otherwise it's 100% worth a watch - even for someone with a mild taste for musicals, like me.", "created_at": "2020-12-27T03:01:10.242Z"}, {"movie_id": 313369, "review_id": "62b0beea3cd12c005203beaa", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/beautiful-dreamer-la-la-landnbspreview<a>\r\n\r\nLos Angeles is an easy city to deeply love and deeply hate, and it is impossible to describe that to someone who has never lived there. The closest a non-resident can come to gaining an understanding of that sensation is by watching Damien Chazelle’s _La La Land_. On the one hand, there are the warm, sun-kissed beaches, the millionaires, and the secluded canyons of the San Gabriel mountains. It’s the promised land of golden dreams for actors, musicians, and writers, where success is always right around the corner. On the other hand, you’ll find smog, traffic, and abject failure. Los Angeles, with all its promises, is a pendulum that swings widely.", "created_at": "2022-06-20T18:39:38.739Z"}, {"movie_id": 313369, "review_id": "63dc9442373ac20085d6f875", "author_rating": 8.0, "review_text": "**Really a good movie, which justifies the hype around it.**\r\n\r\nWho doesn't remember “La La Land”? It was released in theaters in 2016, and was one of the most viewed and acclaimed films of that year. It was a film that was virtually carried in the lap between festivals and awards of the seventh art, and that seemed destined to clean them all up, as “Titanic” had done two decades before. When he arrived at the Oscars, he had practically nominations in almost every category where he could be included! Of the fourteen nominations, however, it collected “only” six statuettes, with the seventh – Best Film – slipping through the fingers in what was the most absolute embarrassment in the entire history of the Hollywood Academy: the infamous but historic exchange of envelopes, that we all have in our memory. But when I said “only”, it is necessary to put things in perspective: what many producers would not have given to win six Oscars in one of their films! Like it or not, it was a great achievement and \"La La Land\" received a well-deserved accolade that night.\r\n\r\nThe film, directed by newcomer Damien Chazelle, is a worthy homage to musicals from Hollywood's golden age, and features a generally sympathetic script: an aspiring starlet trying to become an actress meets and falls in love with a purist jazz pianist. who wants to restore people's interest in the musical genre he loves, and which he feels is slowly being lost. It is their mutual passion that makes them not give up on their respective dreams, but it will also end up dictating that both follow their own paths. And indeed, the film's bittersweet and slightly too realistic ending shockingly clashes with the magic felt throughout the rest of the film. It's like having a very beautiful dream, where anything is possible with some effort and serious work, and ending up seeing that dream trampled by a heavy, raw and often unfair reality. And it must be said, although the characters seem likeable, they are selfish and only think about themselves and their interests. They seem to stick together only as long as it really benefits their individual interests.\r\n\r\nAlthough I don't like the characters very much, Emma Stone and Ryan Gosling offer us, in the film, two magnificent works of interpretation and also of singing and dancing. Gosling showed hidden talents on the keyboard of a piano, and both are very good at choreography, although singing is not particularly strong point for either. Both are young, and it is quite possible that they will give us even better dramatic performances in the future. The rest of the film's cast hardly matters, it's one of those movies where the main characters are so overwhelming and omnipresent that there's no room for anyone else.\r\n\r\nTechnically, the film has several frankly good aspects that deserve our attention and our praise. For starters, the film's honest and intelligent way of recreating and inserting scenes and dance routines from the great musicals of the past, from “Shall We Dance” to “Singing in the Rain” and “West Side Story”. The scenarios, the elements, the routines are there. The cinematography, colorful, frank, generous with light, is magnificent and a feast for the eyes. The editing was done in an excellent and very skillful way. The scenery couldn't be better, taking advantage of the Hollywood Hills or the Griffith Observatory in the best way. The soundtrack, melodies and songs are excellent.", "created_at": "2023-02-03T04:57:38.988Z"}, {"movie_id": 313369, "review_id": "6469fa49d185720120814c8f", "author_rating": 9.0, "review_text": "A fully-fledged musical of the likes we haven't seen on the big screen in decades. This move is almost perfect in every respect. It will draw a laugh, it will draw a tear and it will definitely get your foot tapping. I have to admit the reality ending crushed my enjoyment a little. I understand why the director did it but that doesn't mean I have to like it.", "created_at": "2023-05-21T11:02:33.319Z"}, {"movie_id": 313369, "review_id": "65075db68ee49c00ab5823f4", "author_rating": 10.0, "review_text": "This movie is the best movie there will ever be, Ryan and Emma did great.", "created_at": "2023-09-17T20:12:38.309Z"}, {"movie_id": 313369, "review_id": "58e3a6a4c3a368731a0209e8", "author_rating": 5.0, "review_text": "\"To me, _La La Land_ is like religion. I see the appeal, and I would never take it away from anyone. But I would also never stand in line for it.\" \r\n- Jeff WInger, probably.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2017-04-04T13:59:00.365Z"}, {"movie_id": 313369, "review_id": "58fff29bc3a3681036004140", "author_rating": 10.0, "review_text": "A very special, memorable film that will be iconic in the years to come.", "created_at": "2017-04-26T01:06:35.565Z"}, {"movie_id": 313369, "review_id": "595e3425c3a36828fc07c036", "author_rating": 6.0, "review_text": "This is definitely not a movie that I would have chosen to watch all by myself which perhaps explain why I thought it was just surprisingly okay to watch. However my girlfriend absolutely wanted to watch it so I got it. As it turned out my girlfriend had only gone by the number of Oscars and not really looked up what kind of movie it actually was so in the end I was enjoying the movie a lot more than she did.\r\n\r\nThis movie is pretty much a quite classical Hollywood musical with a non too original story, nice music and dancing. In addition the cinematography  is simply excellent. This is the strong point of this movie. The rest of the movie is of lesser interest to me but the cinematography is really, really good. The scene, pictured on the movie poster, were Mia and Sebastian dances and everything in the scene are dark blue tones except Mia’s bright yellow dress is so simple and yet so beautiful.\r\n\r\nEverything else about this movie is…okay. Okay acting, okay story etc.  As I wrote before this is really not my kind of movie so forgive me for not being overly enthusiastic. I am sure those into these kind of movies cannot understand how anyone can give it less than a full set of stars but hey, different tastes and all that.\r\n\r\nI cannot make up my mind about ending. On one hand I am a sucker for happy endings which this one falls a wee bit short on. On the other hand I have to commend the writer/director for not taking the path of least resistance and instead putting together something a wee bit different.\r\n\r\nI did feel that a part of the movie was missing though. I would have liked to see the parts where Mia and Sebastian actually fulfilled their respective dreams. Jumping fast forward to the ending like the movie did felt a bit like they either ran out of money or they manage to misplace half the story!\r\n\r\nAnyway, I enjoyed the movie more than I thought I would.", "created_at": "2017-07-06T12:59:17.075Z"}, {"movie_id": 313369, "review_id": "597e07e0c3a3685451019402", "author_rating": 7.0, "review_text": "**They'd crossed each others life while chasing their dreams.**\r\n\r\nI am not a big fan of modern musical films. So I was not expecting it to be a great or worst. The film opened with a song that I was not happy, because I did not like the verse or the music. And again to say, the modern timeline does not suit for the musical theme, unless it is a fantasy or an Indian film. \r\n\r\nThe best part of the film was, those song fades away as the film progresses. But I kind of liked the drama/story part and the climax track with the quick flashback (kind of). Till that scene I was considering it an average film, but that one scene changed my stance. So, now I think it is a good film, but winning 6 Oscars, I don't know it deserved that.\r\n\r\nYes, the director is known for making music and musical film, but he has not made many. He's young and so his career. Yep, I loved 'Whiplash'. One of my all time favourite. If that film had won 10 Oscars, I would have not surprised at all. After that flick, the people were anticipating, to exceed that success in this film. As it was received, no doubt for those people it was a different flick, but not for me. Especially if you watch lots of Indian films. By the way the film characters were nice, and so the story, but not the songs.\r\n\r\nGosling and Stone were performed well. The chemistry between them was great. The narration was going decently until the end, which reminded me 'Vinnaithaandi Varuvaaya' ending that I was not happy about, yet something different than usual. Sometimes I am okay with cliché than this kind of conclusion, just to bring a change in storytelling. Overall an enjoyable film, most people would love it. Some like me would say it is a decent flick, but there's always a few who would never favour it. Yet worth a watch.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:22:56.642Z"}, {"movie_id": 313369, "review_id": "5fe7f8f64d0e8d003f7ae43e", "author_rating": 8.0, "review_text": "Undeniably well put together, and entertaining, even if it certainly chooses style over substance.\r\n\r\n<em>'La La Land'</em> is an absolutely gorgeous-looking film, from the costumes to the cinematography to the choreography. The musical numbers are pleasant too. It is a little light on story, not that it isn't entertaining - it is. They were, evidently to me, going for an artsy film and they nailed that. I just personally wanted more depth to the plot, rather than a song every few minutes.\r\n\r\nRyan Gosling is probably one of my favourite actors around right now, in the argument at least, and he is very good here. So is Emma Stone, who is arguably the film's standout. I wanted to watch more of Stone's work even before this, so I knew - along with Gosling - I was going to enjoy the cast. They work excellently as a duo. Elsewhere, John Legend's role is a tad out of place, even if it's good to see him.\r\n\r\n4*. It might make for lame viewing if you absolutely do not like musicals, but otherwise it's 100% worth a watch - even for someone with a mild taste for musicals, like me.", "created_at": "2020-12-27T03:01:10.242Z"}, {"movie_id": 313369, "review_id": "62b0beea3cd12c005203beaa", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/beautiful-dreamer-la-la-landnbspreview<a>\r\n\r\nLos Angeles is an easy city to deeply love and deeply hate, and it is impossible to describe that to someone who has never lived there. The closest a non-resident can come to gaining an understanding of that sensation is by watching Damien Chazelle’s _La La Land_. On the one hand, there are the warm, sun-kissed beaches, the millionaires, and the secluded canyons of the San Gabriel mountains. It’s the promised land of golden dreams for actors, musicians, and writers, where success is always right around the corner. On the other hand, you’ll find smog, traffic, and abject failure. Los Angeles, with all its promises, is a pendulum that swings widely.", "created_at": "2022-06-20T18:39:38.739Z"}, {"movie_id": 313369, "review_id": "63dc9442373ac20085d6f875", "author_rating": 8.0, "review_text": "**Really a good movie, which justifies the hype around it.**\r\n\r\nWho doesn't remember “La La Land”? It was released in theaters in 2016, and was one of the most viewed and acclaimed films of that year. It was a film that was virtually carried in the lap between festivals and awards of the seventh art, and that seemed destined to clean them all up, as “Titanic” had done two decades before. When he arrived at the Oscars, he had practically nominations in almost every category where he could be included! Of the fourteen nominations, however, it collected “only” six statuettes, with the seventh – Best Film – slipping through the fingers in what was the most absolute embarrassment in the entire history of the Hollywood Academy: the infamous but historic exchange of envelopes, that we all have in our memory. But when I said “only”, it is necessary to put things in perspective: what many producers would not have given to win six Oscars in one of their films! Like it or not, it was a great achievement and \"La La Land\" received a well-deserved accolade that night.\r\n\r\nThe film, directed by newcomer Damien Chazelle, is a worthy homage to musicals from Hollywood's golden age, and features a generally sympathetic script: an aspiring starlet trying to become an actress meets and falls in love with a purist jazz pianist. who wants to restore people's interest in the musical genre he loves, and which he feels is slowly being lost. It is their mutual passion that makes them not give up on their respective dreams, but it will also end up dictating that both follow their own paths. And indeed, the film's bittersweet and slightly too realistic ending shockingly clashes with the magic felt throughout the rest of the film. It's like having a very beautiful dream, where anything is possible with some effort and serious work, and ending up seeing that dream trampled by a heavy, raw and often unfair reality. And it must be said, although the characters seem likeable, they are selfish and only think about themselves and their interests. They seem to stick together only as long as it really benefits their individual interests.\r\n\r\nAlthough I don't like the characters very much, Emma Stone and Ryan Gosling offer us, in the film, two magnificent works of interpretation and also of singing and dancing. Gosling showed hidden talents on the keyboard of a piano, and both are very good at choreography, although singing is not particularly strong point for either. Both are young, and it is quite possible that they will give us even better dramatic performances in the future. The rest of the film's cast hardly matters, it's one of those movies where the main characters are so overwhelming and omnipresent that there's no room for anyone else.\r\n\r\nTechnically, the film has several frankly good aspects that deserve our attention and our praise. For starters, the film's honest and intelligent way of recreating and inserting scenes and dance routines from the great musicals of the past, from “Shall We Dance” to “Singing in the Rain” and “West Side Story”. The scenarios, the elements, the routines are there. The cinematography, colorful, frank, generous with light, is magnificent and a feast for the eyes. The editing was done in an excellent and very skillful way. The scenery couldn't be better, taking advantage of the Hollywood Hills or the Griffith Observatory in the best way. The soundtrack, melodies and songs are excellent.", "created_at": "2023-02-03T04:57:38.988Z"}, {"movie_id": 313369, "review_id": "6469fa49d185720120814c8f", "author_rating": 9.0, "review_text": "A fully-fledged musical of the likes we haven't seen on the big screen in decades. This move is almost perfect in every respect. It will draw a laugh, it will draw a tear and it will definitely get your foot tapping. I have to admit the reality ending crushed my enjoyment a little. I understand why the director did it but that doesn't mean I have to like it.", "created_at": "2023-05-21T11:02:33.319Z"}, {"movie_id": 313369, "review_id": "65075db68ee49c00ab5823f4", "author_rating": 10.0, "review_text": "This movie is the best movie there will ever be, Ryan and Emma did great.", "created_at": "2023-09-17T20:12:38.309Z"}]