[{"movie_id": 97614, "review_id": "53519a2ac3a3681d87001ac3", "author_rating": 8.0, "review_text": "Like an angel come down from the storm.\r\n\r\nDeadfall is directed by Stefan Ruzowitzky and written by Zach Dean. It stars Eric Bana, Olivia Wilde, Charlie Hunnam, Kate Mara, Treat Williams, Kris Kristofferson and Sissy Spacek. Music is by Marco Beltrami and cinematography by Shane Hurlbut.\r\n\r\nSiblings Addison (Bana) and Liza (Wilde) are fleeing a casino heist that’s gone badly wrong. Deciding to split up, they arrange to meet up at a later point and go their separate ways. Liza hooks up with ex-convict Jay (Hunnam) while Addison has a date with an abusive father. All while the police, led by a father and daughter pairing who have their own family issues, close in on them along with a blizzard.\r\n\r\nRuzowitzky’s snowy neo-noir may not have the most brainiest of plots, but it makes up for that elsewhere with genuine thrills, spills and wintry chills. Shane Hurlbut photographs it in steely cold metallic blues, piercing whites and bloody reds, then laying an ethereal sheen over the night time sequences. This is perfect tonal accompaniment to the characterisations fronting the story, Addison and Liza have definite incestuous leanings, with the former capable of brutal violence when required. Jay, out of prison, is a big disappointment to his father (Kristofferson), but more pressing concerns are a deadly confrontation he is forced into, and that he’s falling for Liza, who appears to be damaged goods and whose motives are unclear.\r\n\r\nOn the supposed good side of the snowy fence is Hannah (Mara) and Becker (Williams), daughter and father cops, she strives to make her daddy proud, he resents her for not being a son, even chastising her with cold venom in front of other officers. It’s a whirlpool of troubled characters battling it out in the snowy wilds of North America. Ruzowitzky inserts some quality action sequences as the protagonists/antagonists snake towards their date with destiny, which arrives in a classy film noir trope way at Jay’s parents house. The air is pungent with fatalism and the link of all characters having kin problems gives the narrative some bite. Very well performed by the cast, this is comfortably recommended to neo-noir lovers. 7.5/10", "created_at": "2014-04-18T21:33:30.833Z"}, {"movie_id": 97614, "review_id": "60e5ea8faf58cb0047b4691c", "author_rating": 7.0, "review_text": "_**A hell of a Thanksgiving in northern Michigan**_\r\n\r\nAfter a heist in Michigan, a killer and his little sister (Eric Bana and Olivia Wilde) take different paths in the snowy wilderness just before Thanksgiving. An ex-con (Charlie Hunnam) who happens to be fleeing authorities in Detroit meets the girl on the way to his parents’ remote farmhouse (Kris Kristofferson & Sissy Spacek). Meanwhile the cops are on their trail (Treat Williams & Kate Mara). Who will survive the holiday?  \r\n\r\n“Deadfall” (2012) is a wintery crime thriller in the mold of “Fargo” (1996), “A Simple Plan” (1998) and “Wind River” (2017). It’s the least of these due to contrivances and occasional bad scripting, like the police chief’s eye-rolling verbal abuse of his daughter (I’m not saying mistreatment like this doesn’t occur, just that it could be written & executed more convincingly). \r\n\r\nYet the snowy, sylvan landscapes are great and the thrills are constant. Plus there are some interesting neo-noir dramatic threads and you can’t beat the notable cast, including the striking Olivia (who looks like she needs to eat some hamburgers).   \r\n\r\nThe film runs 1 hour, 34 minutes, and was shot in Quebec, in areas outside Montreal.\r\n\r\nGRADE: B-/B", "created_at": "2021-07-07T17:55:27.292Z"}]