[{"movie_id": 814776, "review_id": "64f7c829e0ca7f00ae3bdb3a", "author_rating": 1.0, "review_text": "I hate to admit it, but I allowed myself to be suckered in to this one as a result of its rambunctiously funny trailer only to be grossly disappointed at what I saw. This is a positively dreadful film, and I’m at a complete loss to understand how viewers have found it funny. When a pair of lesbian high school students (Rachel Sennott, Ayo Edebiri) establish a fight club (i.e., a euphemistically labeled “self-defense program”) as a means to surreptitiously bed down their cheerleader classmates (a story line that’s more than a little dubious in itself), they subsequently launch into a meandering narrative that makes little sense and plays like it was made up by a group of stoners who’ll laugh at anything when suitably smoked up. The film starts out trying way too hard and then proceeds to quickly go downhill from there. Much of the material is in questionable taste, too, such as sequences that feature unrestrained physical abuse against women, as well as other forms of sanctioned violence. How is this stuff supposed to be funny? “Bottoms” has been described by viewers and critics as a go-for-broke/anything-for-a-laugh comedy, but I found its distasteful stabs at humor cringeworthy at best. What’s more, the picture’s feeble attempts at trying to inject the narrative with a message related to women’s empowerment are completely betrayed by its many wrong-headed plot devices. To the film’s credit, it does feature some passable performances by its supporting cast (most notably Punkie Johnson, Dagmara Dominczyk and former NFL star Marshawn Lynch). But, sadly, this effort is a big step down for director Emma Seligman and writer-actor Rachel Sennott, both of whom turned in brilliant work in their raucous collaboration, “Shiva, Baby” (2020) (not to mention that Sennott’s casting represents a laughable choice for someone who’s nearly 28 attempting to portray an 18-year-old character). It’s also quite a comedown for producer Elizabeth Banks, who scored big earlier this year with the utterly hilarious “Cocaine Bear.” It occurred to me after watching this debacle that maybe I’m just getting old and losing my sense of humor, but, after thinking it over, I realized that’s genuinely not the case. This may indeed represent a case of changing movie tastes, but, if that’s so, I’m seriously troubled about the direction in which those tastes are headed.", "created_at": "2023-09-06T00:30:33.040Z"}, {"movie_id": 814776, "review_id": "654c9fd3b18f3200e2cf8cdd", "author_rating": 5.0, "review_text": "\"PJ\" (Rachel Sennott) and her best mate \"Josie\" (Ayo Edebiri) are starting the new year at school confident that they won't get laid! It's not just that they are gay, it's that they are gay, \"ugly\" and \"untalented\" - a toxic combination designed to ensure they continue to get their fun from Pornhub. Meantime, cheating school heart-throb \"Jeff\" (Nicholas Galitzine) is having a row with his girlfriend \"Isabel\" (Havana Rose Liu) that sees the latter take refuge with the girls in their car and the most minuscule of car accidents reduce this macho lad to a gibbering wreck! This is what inspires our duo to start a club at school that will ostensibly teach young women the basics of self defence whilst allowing them to maybe get some \"fun\" into the bargain! What now ensues is all rather puerile, I found. Maybe it's supposed to be satire, but that any school would allow the pupils to use the gym to beat each other up - under the supervision of a teacher - is just preposterous. The characterisations are just about as shallow as you can get and the writers need to appreciate that using the full gamut of Anglo-Saxon expletives doesn't actually make a film funny. As it lumbers on it becomes more and more cringe-worthy until a denouement that is just like something left on the cutting room floor from an edition of \"Happy Days\". I get that I'm not the demographic, but this is still a weakly constructed, over-acted and rather aggressive reinforcement of just about every stereotype there might be in an American school - and none of these people come off very well.", "created_at": "2023-11-09T09:01:07.700Z"}]