[{"movie_id": 222935, "review_id": "53befcabc3a3684cf40038b8", "author_rating": null, "review_text": "Good movie and give alot of spirits to all people who had cancer", "created_at": "2014-07-10T20:50:51.993Z"}, {"movie_id": 222935, "review_id": "5463804a0e0a267810002575", "author_rating": 8.0, "review_text": "The director might be soaring after back to back success. Interestingly, both the films dealt with writers, but the main themes were romance. He's just a two movie old and now the movie goers can expect eagerly for his next venture. This movie was based on the teen novel of the same name about a 16-years-old cancer patient.\r\n\r\n     Hazel Grace, who is battling between life and death is also a strong fighter against all the odds. When her mother sends her to attend the group therapy she meets Augustus Water, a fellow member. As she is being sarcastic, Waters finds an interesting character in her. A friendship develops and they spend more time together. Even knowing there will no future together, the relationship progress and how everything ends is the rest.\r\n\r\n     Usually cancer themed movies are called tearjerker films. Surprisingly, this movie's aim was different. Of course emotion strikes, but the story narration and character developments were the basic goal. Three-fourth of the movie was well told story about teen romance. The afterwards account begins with a twist which were portrayed in the usual manner. Like all the movies, kept sentiments in the last part. The last quarter was very predictable, but they avoided cliche as much possible.\r\n\r\n‘‘Apparently, the world is not\r\na wish-granting factory.’’\r\n\r\n     The parents' role was kind of mysterious one, that diverts viewer from their anticipation. Interesting it also creates some doubts. Compared to the previous movie 'The Spectacular Now', Shailene Woodley looked completely different. That means the physical transformed to look a perfect 16 year old was amazing. Her performance as well gives an impression that the Hollywood's future Academy award grabbing the female lead is on making. At this rate she can do that like Jennifer Lawrence did.\r\n\r\n     As for the lead actor, it is a good breakthrough and expecting the same result from his next movie as well. This movie, which runs over a 2 hour was smartly sliced the contents and organized those on the right spots. Many had agreed it was a fine cinema transformation from a book. So you can try this, but be careful because nowadays most of the teens movies are overrated because of the overwhelmed teen audience. The warning meant only for the older people. I'm sure the youngster will love this movie, I mean most of them.", "created_at": "2014-11-12T15:44:10.342Z"}]