[{"movie_id": 414906, "review_id": "621d02856b5fc2006b954bab", "author_rating": null, "review_text": "“The Batman” Is A Very Engaging And Unforgettable Tale That Is One Of The Best Adaptations Of The Character Ever\r\n\r\nIn 1989 Michael Keaton was seen as a very controversial choice to wear the Cowl of Batman but soon proved his doubters wrong by turning “Batman” and its subsequent sequel “Batman Returns” into massive Box Office success before leaving the cape behind.\r\n\r\nWhile four other actors have taken up the cinematic version of the character in the subsequent years, Keaton has remained for many the Gold Standard with Christian Bale likely being his biggest rival.\r\n\r\nWhen Robert Pattinson was named as the new Batman, there was interest but concern as an actor who is largely known for playing Edward in the “Twilight” films seemed to be an odd choice. However, I would say that anyone who has seen some of his recent work including his performance in “The Lighthouse” would be playing him a disservice by saying he was not up to the part.\r\n\r\nIn “The Batman”, audiences are given a darker and more broken Bruce Wayne, an Emo recluse who is far from the Socialite he has been portrayed as for decades and a very sullen and withdrawn individual who does not exude charm or grace and even shows issues making eye-contact.\r\n\r\nWhen the Mayor of Gotham is killed shortly before the election by a mysterious individual known as “The Riddler” (Paul Dano), the vigilante known as “The Batman” is called in to help the police by Lt. James Gordon (Jeffrey Wright).  Gordon has been working with Batman for some time but it is clear that his association with him has not won him any favors with his fellow officers, many of which openly question his use and involvement in the crime scenes.\r\n\r\nFurther complicating matters are clues left at the various crime locales that are addressed to The Batman and cause many to believe that he may be working with the very killer they are attempting to stop.\r\n\r\nAs the investigation unfolds, the seedy side of Gotham City comes to light in the form of a missing girl who was photographed with the married Mayor and may well be the key to the investigation. Her disappearance leads her friend Selina Kyle (Zoe Kravitz), to take on her Catwoman persona and delve deep into an underworld that features deadly individuals ranging from Carmine Falcone (John Turturro), and The Penguin (Colin Farrell), amongst others as she and the Batman conduct their own investigations that at times overlap and further complicate matters.\r\n\r\nAs the body count rises and Batman races to find the true method behind the madness of The Riddler, the tone becomes darker and more sinister in a deadly race against time.\r\n\r\nThe film eschews the usual abundance of action sequences and glossy special effects which are common for Comic Book related films and instead gives audiences a slow-burning murder mystery that holds your attention from start to finish over its three-hour run time.\r\n\r\nThe dark and foreboding tone of the film is brought home by the haunting and sharp piano keys of the film’s theme that permeates the film and punches home that this is a film clearly aimed at a more adult audience.\r\n\r\nPattinson does a great job showing the deeply broken individual that is behind the mask and that Batman is the only form of escape or therapy that Bruce Wayne has due to his insistence on saving a city that many argue cannot be saved. He has strained his relationship at times with Alfred (Andy Serkis), caused damage to the financial stability and reputation of the family company in his quest for vengeance and justice, and has become a bitter and broken recluse in doing so. In many ways, it could be argued that his only socialization with others is as The Batman and his single-minded obsession is chilling to watch.\r\n\r\nPattinson also handles the action sequences well as the film spaces them out to put the emphasis more on the man than the gadgets as they are kept to a minimum even during a thrilling chase with the new version of The Batmobile.\r\n\r\nThe strong supporting cast works well with the film and Paul Dano gives a very compelling and disturbing version of his character which makes the film even darker and more engrossing.\r\n\r\nDirector Matt Reeves has crafted a dark and foreboding tone and visual style as a good portion of the film takes place in the darkness and his screenplay is not afraid to take chances by putting the emphasis on the characters and their flaws versus an abundance of action and effects.\r\n\r\nI found this version of the character and interpretation more engrossing than prior versions of the film as the bold move to do a slow-burning and dark murder mystery versus an effect-laden action film reminded me of some of the better Batman stories such as Batman: The Killing Joke or Batman: The Long Halloween.\r\n\r\nThe film is not going to be for everyone, especially younger viewers and some may take issue with the casting choices, but their performances shine and as such, “The Batman” was a very engaging and unforgettable tale that for me serves as one of the best adaptations of the character ever.\r\n\r\n4 stars out of 5", "created_at": "2022-02-28T17:12:37.932Z"}, {"movie_id": 414906, "review_id": "6222823ee258600046cc75b8", "author_rating": 8.0, "review_text": "The reviews and hype for this movie were massive!  Comparisons to The Dark Knight got my expectations high... probably a little too high.  I was expecting to be blown away and was not but even with that being said The Batman is an exceptional film.  The cinematography and visuals are stunning.  Matt Reeves made some genius creative choices among which were the more reclusive rockstar grungy Bruce Wayne and the Riddler being heavily influenced by the Zodiac.  The acting was fantastic as well with Zoe Kravitz and Paul Dano offering some standout performances.  The Batman is driven with psychological and mystery focus as compared to the action comedy style of most superhero movies.  My only complaint is that the mystery felt fairly predictable.  I wasn't surprised by any of the twists and turns.  Ultimately, this was a wonderful addition to the Batman franchise and I can't wait to see where it goes next.", "created_at": "2022-03-04T21:18:54.608Z"}, {"movie_id": 414906, "review_id": "6222973641aac4006c764e55", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-batman-spoiler-free-review\r\n\r\n\"The Batman deserves all the hype it generated and then some. Matt Reeves delivers a distinctly darker, more intense, frighteningly realistic noir thriller than past adaptations, with an aggressively vengeful Bruce Wayne / Batman and a fear-inducing, mysterious, lunatic Riddler.\r\n\r\nGreig Fraser's cinematography - bone-chilling \"ins-and-outs\" of Batman and stunning footage of Gotham - and Michael Giacchino's score - genuinely addictive, elevates the entire film - make this adaptation the best-looking and best-scored cinematic version of the Batman ever.\r\n\r\nEven with the narrative focus on the detective work, the action sequences are exhilarating and beautifully shot. The entire cast is extraordinary, especially Paul Dano and Robert Pattinson - the latter destroys all skepticism around his talent.\r\n\r\nApart from a short period at the end of the second act, the three hours fly by. It's one of the best movies of the year and a fair contender in the debate of best comic book movie of all-time.\"\r\n\r\nRating: A", "created_at": "2022-03-04T22:48:22.045Z"}, {"movie_id": 414906, "review_id": "62241381b84f940045446a10", "author_rating": 5.0, "review_text": "Paul Dano and Colin Farrell are extraordinary, but _The Batman_ is a three hour slog through Gotham that culminates with an over exaggerated riddle that isn’t worth solving. Having Batman and Jim Gordon both speak in raspy, whispery grunts feels excessive as does Gordon’s insistence on calling Batman, “Chief,” every time that they’re together. The film deserves credit for prominently shining the spotlight on the underbelly of crime in Gotham, but the storytelling in _The Batman_ is a lot like Bugs Bunny meaning to have taken that left turn at Albuquerque; a meandering foray down a dark rabbit hole that isn’t entirely necessary.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Batman-2022-Review-When-is-a-Bat-Not-Quite-a-Bat", "created_at": "2022-03-06T01:50:57.237Z"}, {"movie_id": 414906, "review_id": "622a1faa63aad20018c0b378", "author_rating": 10.0, "review_text": "Masterpiece. Best DC film yet", "created_at": "2022-03-10T15:56:26.941Z"}, {"movie_id": 414906, "review_id": "62307df10ed2ab0045ed6b4d", "author_rating": 10.0, "review_text": "_**\"Our scars can destroy us, even after the physical wounds have healed. But if we survive them, they can transform us. They can give us the power to endure, and the strength to fight.\"**_\r\n\r\nEver since it was announced that Matt Reeves was going to direct The Batman after Ben Affleck stepped down for personal reasons, I had no doubt he was going to put on one hell of a masterpiece. This is the definitive live-action Batman. An epic 3-hour film noir that delves deep into comic lore of Gotham City.\r\n\r\nRobert Pattinson perfectly embodies both Bruce Wayne and Batman. I love the character arc he goes through, realizing Gotham doesn't need vengeance to heal, but hope. Zoë Kravitz plays a phenomenal Selina Kyle, you actually feel her emotions throughout the movie. Another plus is that she actually feels integral to the plot (unlike The Dark Knight Rises). Paul Dano is a terrifyingly realistic interpretation of The Riddler, using the internet to gain a fan base for his sick games. Andy Serkis plays an excellent Alfred, being Bruce's emotional support during Dark times.\r\n\r\nThe soundtrack by Michael Giacchino is absolute God-Tier. Elevating every scene with emotion and sometimes dread. Finally a score to rival Danny Elfman's iconic score. Matt Reeves direction is impeccable as always, getting some nice shots while also making it feel nice and claustrophobic around Batman.\r\n\r\nOverall, a God-Tier Batman movie that I can't wait for the Cinematic Universe that's being made around it as I type this.", "created_at": "2022-03-15T11:52:17.425Z"}, {"movie_id": 414906, "review_id": "6233ec8303bf84001c6cb00d", "author_rating": 9.0, "review_text": "It's a cracker, no doubt about it!\r\n\r\nMatt Reeves did a great job with 2022's <em>'The Batman'</em>. It's difficult not to compare this to other Batman films, though that's DC/Warner Bros. fault for featuring him so much in recent times. I'll get this out the way early: I'd say <em>'<a href=\"https://letterboxd.com/film/batman-begins/\" rel=\"nofollow\">Batman Begins</a>'</em>/'<a href=\"https://letterboxd.com/film/the-dark-knight/\" rel=\"nofollow\">The Dark Knight</a>'</em> are superior, not by much, which is a similar case for the character performances too.\r\n\r\nRobert Pattinson is a terrific Bruce Wayne, though Christian Bale still edges him out in my eyes. Zoë Kravitz is probably the best Catwoman I've seen, though the rest - from the Riddler to Penguin to Alfred - have been portrayed better; aside from Commissioner Gordon, with Jeffrey Wright being excellent. Paul Dano is the least enjoyable performer, for me, here, I found his showing to be a bit 'meh' - effective, but meh. Barry Keoghan makes a cameo, I won't say as who, but I don't hold high hopes for him in that role; though, <a href=\"https://variety.com/2022/film/news/the-batman-ending-joker-barry-keoghan-matt-reeves-1235196812/#:~:text=While%20it%20may,more%20%E2%80%9CBatman%E2%80%9D%20movies.\" rel=\"nofollow\">apparently</a> it won't be anything that happens anyway. For the best!\r\n\r\nAnyway... the above sounds <em>way</em> too negative - as I did thoroughly and absolutely enjoy this film, hence the very positive rating. The pacing is very good, the cinematography is brilliant (Gotham looks fantastically bleak!), the story is engrossing and the dialogue is on point. The scenes with Pattinson/Kravitz and Pattinson/Wright are my favourite moments. It's a film that I'd consider as 'outstanding'.\r\n\r\nIt'll be cool to see what Reeves does with this trilogy (should it happen, of course).", "created_at": "2022-03-18T02:20:51.206Z"}, {"movie_id": 414906, "review_id": "624085464cbe12005d584bd9", "author_rating": 8.0, "review_text": "I like how Batman is depicted with a naive and loser POV from his rich high tower, a rich trust fund baby called out by both sane (Catwoman) and insane (Riddler) people while he remains oblivious until the consequences are literally flooding the city. While he uses the idea of Batman as a mantle for him to process trauma, his obliviousness to his own celebrity status and image creates unintentional side effects from his parents' death hogging the spotlight away from the people that mattered to his own nebulous idea of \"vengeance\" being co-opted by the goons, a heel-turn realization that eventually changes the rack focus, ultimately leading to a wider perspective and a selfless act of cutting the cord and helping others. Hope is more important than his idea of justice, in the end, empathy being the missing piece throughout. Instead of being a voyeur like Riddler during his master plan (Riddler binoculars on the mayor, Batman binoculars on Catwoman), he switches to being on the ground to help, no longer from his high castle.\r\n\r\nIt's interesting how this arc plays out. At the beginning, it plays into this \"badass\" idea comic book fans love to gloat about Batman of striking fear into crime, but the way it's portrayed is frightening to everyone. It's a better criticism of Batman's fascism than BvS was going for, showcasing his fear to people who don't even deserve it, such as kids doing vandalism who probably believe the system is failing them, but to him at the beginning crime all looks the same.\r\n\r\nHonestly this film goes harder than Phantasm on the tragedy that is Bruce Wayne. They're inseparable by choice, to the point that Bruce basically is Batman even when not in the costume, a social recluse who can barely function in real life, listening to emo music and having rings around his eyes, a night owl to the extreme. The struggle is there even as Batman, literally smashing his face on a truck.\r\n\r\nThere are some contradictions throughout thematically, however. It's weird how it goes between \"it's the WHOLE system, all cops are pigs\" to \"it's just bad apples\" simultaneously, displaying a somewhat cringe centrism. Catwoman by the end basically points it more to systemic (and Batman and Thomas Wayne's criticism of thinking they know better and actually makings things worse isn't undercut, which by itself is also institutional criticism), although it still feels like they could've done more. Maybe out of their hands by the studio or this as far as they could get away with vs. the producers (it almost felt like a struggle for Catwoman to outline her \"eat the rich\" mentality). Gotham itself is a mess of contradictions and it's OK to let the viewer lie between it all I guess.\r\n\r\nAlso the relationship between Catwoman and Batman is kinda slimy and male-centric. Catwoman, while great as a character, functionally falls to Batman's controlling force with a forced romance in the second act. Sure they're both suffering from trauma but Batman was literally using her despite it all, it at least understands the power gap more in the third act.\r\n\r\nThe end of the second act also spins its wheels a bit too much, the mystery pace kinda suffers a bit from focus and scenes get too drawn out (Riddler just disappears for a while). The movie could've been 20 minutes shorter. Doesn't stop it from having a terrific third act since most blockbusters have kinda sucked on that note\r\nAlthough speaking of Riddler, master class. Probably my favorite villain in a Batman film. \r\n\r\nThe aesthetic was gorgeous. I love its color grading and architecture, still thinking of the Wayne tower and its metal grates, goth hallways, and insane attention to detail that gets blurred out intentionally in the frame for most of the movie by Bruce's obliviousness to the world. It also keeps a balance of evoking the black/white movies while still being colorful, more of flooded black and oranges. I think of that sequence with Penguin not mainly for the fight itself (which to me was a bit messy) but moreso the flooded orange of the fire being the only color creating a sorta gradient on the black car, and how the flare at the end matches that aesthetic, that one color illuminating Batman leading everybody else to exit the frame, like a light in the darkness. Lovely\r\n\r\nThe music.... Giacchino just beat out his Incredibles score for me, masterful work with motifs, percussion, and rhythm. His mastery of percussion and horns during the lights out Batman hallway fight and how the horns blast, how well edited the percussion beat subtly goes through the Penguin chase and other fight sequences, Batman doesn't quite have a dance like Hong Kong films but the music makes it come close. The timpani and strings are so well used!!! Great use of Ave Maria both as soundtrack and score. Catwoman's motif? Amazing.\r\n\r\nThe performances are great all around. Finally a film with Turturro that I don't hate him. He's well restrained and perfectly cast, his dickish attitude now a strong point making him very memorable with very little screen time, much like Farrell in the same film. Kravitz made me the closest to tearing up with how she visually handles conflicting emotions, I still think about that scene with the voicemail where her eyes are all over the place and has trouble keeping it all together. Dano as Riddler is terrific.\r\n\r\nYep, this is my fav Batman film now.", "created_at": "2022-03-27T15:39:50.559Z"}, {"movie_id": 414906, "review_id": "62473bdefd6fa1004e5031e7", "author_rating": 10.0, "review_text": "This film is so intricate, there's so many details, things you can obverse on multiple watches and not have noticed on your first. There's a lot of things that just aren't spoken that give this film so much substance. So many layers and nuanced story telling. Gotham City feels as it should, as it's own character and a visceral cesspool of corruption and just dirt. It feels dirty, unpolished... it's amazing.\r\n\r\nThere's so many shots in this film that are just simply breathtaking and intentionally dirty. It helps capture this visceral tone and fits substantially well with the universe of Batman.\r\n\r\nBeing a diehard fan of Batman for, like, pretty much all of my life- I have to say; Matt Reeves absolutely nailed it with a completely faithful adaptation of Batman. Not once in this movie did he do something I felt was completely out of character and Robert Pattinson solidified the performance of both Bruce Wayne and the Batman. I love Matt Reeves went to the extent to make sure this Batman doesn't kill, as other directors have seem to give less care to. Yes, even Nolan. It should have to go without saying that Batman does not kill, that's a no-brainer, but for decades this has been a problem in Batman films... and finally, it no longer is a problem. That's how you do it.\r\n\r\nBringing this review to a conclusion, this is easily my favourite Batman film. So many things about this film just feel like it's pulled straight out of a comic book. I mean, Riddler flooding the city itself is pulled straight from Zero Year and there's so many nods to comic moments and members of Batman's rouges gallery. Matt Reeves knew what he was doing, and he crafted this film for diehard Batman fans, succeeding immensely. Can't wait to see more of this universe.", "created_at": "2022-04-01T17:52:30.345Z"}, {"movie_id": 414906, "review_id": "6247dc50014325004eb6cfe2", "author_rating": 6.0, "review_text": "> Enormous mass that is per se a riddle. Forget screenplay, it's a comic storyboard; Do you remember Rorschach, from Moore's Watchmen, ruminating in the sewers?, ok, transpolate Batman and it works! No way, here I go-monologue and comic dialogues (effective and practical like instant soup, with 2 percent protein), comic narration, that is functional, utilitarian, Bentham would say, with the ellipses and any speech or reasoning that requires 2 minutes of reflection, at most!, \"\"this whole city´s gonna come apart\" says a District Attorney, scenic cuts and messy complexity...-entertaining but messy-comic, etc, ...it is a comic turned into a movie by someone who - I'm speculating, any resemblance to reality is purely by chance - was advised or made, or made comics in his life, don't you believe me? Ellipsis of all ellipses: \"Alfred, you're not my father \"At 23 minutes of tape, all the conflict of identity and belonging, as well as the purpose of the hero, under the sieve of the most selfish and mean son of millionaires, but let's forget this, let's continue. A Batman beating Kurt's velvety drum Cobain, -didn't tell the subversive c revolutionary adence of Cobain, to think like that I would have to know that grunge swept hardrock -finally in the 90s- and buried Motley Crue, Guns and Roses and others, (yes, I mentioned him, Cobain, and not Nirvana that did not exist, that's why when we die we are left without this specific type of grunge, I already digressed, anyway) but yes, this Batman is doubly omniscient, an ego the size of Gotham City authorizes him (a) not only to -his first omniscience- speaking in the first person of himself when running the plot, that is to say in the events, \"I am revenge\" he says to the subway gang members, (scene that is not better than Todd Phillips' Koker subway, for give another example) that this happened -the first person- almost in all the other versions that precede it,it is also included here -its omniscience, obviously- dominating forensic or medical terms: \"eschimia\"? ask Batman of course!, but to (b), his second omniscience, being the narrator of his exploits in the first person, this again leads us to an Alan Moore influence but, with all due respect, as a clericot of Alan's genius Moore. When Batman wants to see the Penguin, he just has to be like the Penguin, appear in the doorway and announce himself, and please, for the fun of the plot, Batman almost spouts a sentence \"please tell me you won't let me in to unfold my money in the form of weapons hidden in my suit, and get in anyway. That is to say, the theatricality and the shadows of the bat, remained in the Babyboomer Generation or Generation X when the entrance was an \"appearance\" through shadows, suspicion and myth. The film is a complex mass because it is as if The Batman, The Batman 2 and 3 had been compressed and I am not only talking about the exhausting time of almost 3 hours, but also because of the number of common threads in which it was woven into a single feature film. For example, the plot increases its complexity first with a Riddler who is an anti-hero, because he indirectly helps Batman and the supposed common good and because of the premises that justify his murders, unmasking the big shots of the underworld at high levels of government, but later, arrested as Edward Nashton, he unmasks himself, that is, he turns himself in, sitting in that cafeteria just when, then yes, we will understand his \"fine\" intentions, and he becomes a true public order villain because he incites the revenge to the uncritical masses and followers of the disorder who have suffered or have resentments for any type of discrimination or corruption that they have suffered in Gotham city, (no more and no less than similar to the end of Todd Phillips' Joker);another complexity is with the cat The cat, I will not say Catwoman, who has her own drama for Kyle and at some point Batman leans on her, to spy on the Prosecutor and at least 2 times saves her from murdering her father Carmine Falcone and the his father's henchman. On the other hand, there is the added density or complexity of transcending and publishing the videos that show that the mother of Bruce Wayne, the mother of Batman had psychiatric problems in Arkham and hospitals and comes from a family that descendants who also had these difficulties and Thomas Wayne , trying to silence the journalist, he used the biggest thug Falcone. In other words, there is a possibility that Falcone, Catwoman's stepfather, is the one who murdered the Waynes that night because Batman's father was about to pity or denounce the next day that he only wanted to silence the journalist and NOT murder him as Falcone did. . In short, it is entertaining but poorly planned for a single feature film due to the enormous amount of detail that is handled.", "created_at": "2022-04-02T05:17:04.458Z"}, {"movie_id": 414906, "review_id": "624b1ff015a4a1006381e9cc", "author_rating": 6.0, "review_text": "OK, shoot me now - but you can tell when you are watching a film at the cinema and the audience start to get a bit restless. Well mine did with this overlong, and frankly rather dreary film. The opening few, somewhat dystopian, scenes reminded me of \"Blade Runner\" (1982) and we do hit the ground running. Amidst an hotly contested mayoral election, a chap in a gas mask (\"The Riddler\", we learn later) brutally takes out the sitting candidate enticing the \"Batman\" (Robert Pattinson) to come help his policeman pal \"Gordon\" (Jeffrey Wright) to investigate. Seems that the killer wanted that to happen because he leaves our caped crusader a card with a clue. Soon the great and the good of the city are dropping like flies and a web of corruption and deceit at the top echelons of government is emerging. Personally I found this all a bit dull. It flows terribly slowly, and after a while the relentless darkness and a really pretty soporific, moody, effort from Pattinson just started to bore me. There are loads of plot holes - not least just how the \"Riddler\" manages to pull off some pretty heavy duty crimes without having to scale any tall buildings, or sneak past the heavily guarded victims of his spree. The scenes with the completely unprotected DA (Peter Sarsgaard) in a dimly lit street are just plain daft. Colin Farrell is probably my highlight as the duplicitous \"Oz\", and Zoë Kravitz (\"Cat Woman”) offers us some decent acrobatics but otherwise, this is an hugely over-rated affair that has a serious paucity of dialogue, is heavily scored and during it's almost three hours, not enough actually happens. Indeed, it is very reluctant to let us leave. I will admit that my first guess at the ending was a bit optimistic, but it could conclude at least another four times before we are finally allowed to stretch our legs. It might look better second time around, but for now it's nothing at all to write home about.", "created_at": "2022-04-04T16:42:24.863Z"}, {"movie_id": 414906, "review_id": "625dd5e19ee0ef0050f5b825", "author_rating": 8.0, "review_text": "Good albeit not great, this newest incarnation of Batman is well done if not also incredibly dark. I did like Robert Pattinson's portrayal and didn't employ the annoying voice that kind of ruined The Dark Knight and more so, The Dark Knight Rises. As a whole though I did like the plot (parts inspired by The Long Halloween) and a good supporting cast, with Paul Dano giving a creepy performance as The Riddler and looking forward to seeing more from Zoe Kravitz's Selina/Catwoman. **4.0/5**", "created_at": "2022-04-18T21:19:29.046Z"}, {"movie_id": 414906, "review_id": "6263fd340b5fd60f76b801f1", "author_rating": 7.0, "review_text": "I am so tired of superhero movies. Still, being down with a mild case of Corona, I wanted something to watch that'd go down easy, and The Batman was available, so I picked it.\r\n\r\nI have to say that this, to me, is one of the rare superhero movies that appeal to me. And that's after having seen every other Batman movie since Tim Burton's 1989 one. And, I dare say, even with me being fed up with superhero movies, I think this is the best attempt.\r\n\r\nAt three hours, it feels like binge-watching a three-part miniseries. And by that I mean both that to the extent that it is three acts, they almost perfectly align with an hour each, and also that the pacing is great, and I never got bored.\r\n\r\nThe cast is excellent. Also, for the first time ever, I'm not thinking that it's ridiculous that no one recognizes Bruce Wayne as Batman. The half-mask actually makes Bruce Wayne unrecognizable. I'm not sure if they thought of that during casting, but it's really quite impressive.\r\n\r\nIt's also nice to not have to suffer through a pathetic attempt from Batman to make his voice sound cool. Oh dear, Christian Bale trying to look and sound cool was just so cringey. Robert Pattinson is by far the best Batman I've ever seen. The almost depressive mental torment he conveys does not come off as fake or pretension, and that's a first for the Batman franchise as far as I'm concerned.\r\n\r\nThe mood is bleak without being depressive, the score is fantastic, if a bit too much, the cinematography is amazing, I really have very little to fault here. If anything, it may come off as a little pretentious and self-indulgent, but that's also part of the attraction, and if I'm being completely honest, I think it's more to do with my own \"people need to grow up and stop watching these childish things\" prejudice I have, when in fact the 15-year-old inside of me f...ing loves it, and I need to embrace that childish part of me rather than hate on it.\r\n\r\nIf there's anything I would change about this movie, it's what I feel is somewhat of a PG-ification of Batman. I would love to see this movie with all its bleak desperation and lust for vengeance on the depravity and evil in the Gotham world, but with a seriously anti-hero, all-violent, bringer-of-death Batman. I would love to see him - in a more crude outfit, with less bells and whistles, and definitely without the cape - destroy, slay and kill, with exploration of the terrible aftermath it would bring, including the impact on his psyche, rather than the beat-up-and-let-go strategy that he is using in this movie. That part just feels to not align with both the doomish mood that sets the story and the seeming existential depression of our masked protagonist. I think that would warrant yet another installment in this franchise. I'm actually surprised how much meat there is on this character.\r\n\r\nAlso, if the movie overall is consistently a bit too much, the ending takes it one notch further on that scale.\r\n\r\nRegardless, I now have two superhero movies that I keep in my movie collection. The other is Watchmen (Director's Cut).\r\n\r\n1 star deducted for Catwoman being racist without it being presented as a problem. The casting of her is perfect, by the way. Much better than Michelle Pfeiffer.", "created_at": "2022-04-23T13:20:52.161Z"}, {"movie_id": 414906, "review_id": "62690f5d38765101658093c5", "author_rating": 8.0, "review_text": "Oh boy, yet another review here on TMDB about this movie. What is it about comic books that garners so much interest? I am no longer a comic hero fan, either in movies or the source comic books. I have seen some of the Marvel series and the only one that I would watch multiple times if it came across my screen in Ant Man and the Wasp, with its wit, action and humor.\r\n\r\nI did read superhero comics as a kid, however. I stuck to DC comics. I especially liked the Legion of Superheroes, though I also read the Justice League, Superman and Batman. This was the Silver Age of comics, I believe, before they restarted and complicated the field with reimagining the comic universe (or whatever it is they did).\r\n\r\nAnyway, I was a DC boy so I gave The Batman a look see. It is a dark film, both in its themes and its camera work. No wit and humor to speak of here, just grim and introspective comic book noir. But it was intriguing and interesting enough to hold only my attention. There were a couple of interesting twists on traditional Batman villains, for example. As with a lot of current thrillers, there is quite a body count, when sometimes with violence, I think less can be more.\r\n\r\nIt is not a film I will watch multiple times or anxiously await a sequel for, but I do not regret the time spent watching it.", "created_at": "2022-04-27T09:39:42.003Z"}, {"movie_id": 414906, "review_id": "626c2f9f35811d005015ae2f", "author_rating": 10.0, "review_text": "_The Batman_ is the best live-action Batman movie yet. It's the type of Batman film I've been waiting for my whole life.\r\n\r\nIt's dark and realistic, but also stylish and large-scale. It's not limited by a commitment to realism like the Dark Knight trilogy, nor is it burdened by a shared universe like the DCEU. It is its own thing. A moody, disturbing, visually stunning, David Fincher-inspired, three hour long detective epic with some of the best interpretations of the characters ever put on screen.\r\n\r\nRobert Pattinson is fantastic as a younger, moodier, and yes, more emo Batman. Paul Dano is straight up terrifying as the Riddler. Colin Farrell is unrecognisable in more ways than one as The Penguin and Zoë Kravitz is easily my favorite live-action Catwoman. Massively underrated is john Turturro as Carmine Falcone.\r\n\r\nThis movie kept me hooked all the way through. It's almost three hours long but it feels like two.\r\n\r\nThis is the best Batman movie. The Dark Knight is good and all, but Reeves finds the perfect mix of gritty realism and style (Nolan would never even dare to have a snorricam shot of Batmam gliding over the city), and finally gives us a live-action Batman that lives up to the title of \"World's Greatest Detective\". Not that there's much competition, since he's like the only one to actually do any detective work (no, Christian Bale magically finding a fingerprint on a broken bullet doesn't count).", "created_at": "2022-04-29T18:34:07.252Z"}, {"movie_id": 414906, "review_id": "626c76a0245dbe004f431b50", "author_rating": null, "review_text": "The movie was one of the best Batman movies in my opinion, but, I honestly didn't like thus portrayal of Batman. This didn't feel like Batman, more like BatDude. Like a man in real life that grew up watching Batman and decided to fight crime under his name. Overall it is definitely worth the watch!", "created_at": "2022-04-29T23:37:04.585Z"}, {"movie_id": 414906, "review_id": "62bdfb3c8d2f8d006117ac09", "author_rating": 10.0, "review_text": "Batman returns back to its detective roots, and it is a breath of fresh air. Robert Patterson is stunning as Batman. The twists and turns the new Riddler take is a fun ride.\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-06-30T19:36:28.614Z"}, {"movie_id": 414906, "review_id": "62f8f48d258823007f6074ce", "author_rating": 4.0, "review_text": "To be honest, this is a really good movie. Hang on? So why did I only give it 2 out of 5 stars? Well, this is really personal but, to me, it is not a good Batman movie. I really had problems writing this review because it is a very good movie. I just did not like it as a Batman movie.\r\n\r\nThe movie is really dark, gritty and noir. Not really a problem. It works for some movies. But it is also quite slow at the beginning and the first quarter of the movie was actually boring. Remember, this is a three hour movie so a quarter is more than half an hour of “boringness”.\r\n\r\nThe “boringess” was broken up by a pretty cool car chase. Some people seem to not really like the batmobile and I have to say that it was not very inspired but it was not all bad either. Unfortunately the movie turned rather boring for a while again after that.\r\n\r\nThe movie tries to bring out more of the detective part of Batman than the previous movies, which is fine, but there is just too much moping around with Batman / Bruce Wayne walking around oozing sadness all around him.\r\n\r\nActually, this brings us to my main gripe with this movie. The choice of actor for the Batman is just wrong for me. He is more like a sad puppy than the Batman. The script that makes him mope around, have emotional outbreaks and, occasionally, being downright stupid like just staring dumbfounded when explosives go off in his face does not really help of course.\r\n\r\nTo me the Selina Kyle character had more charisma than the Batman, especially when the Batman was in his Bruce Wayne alter ego.\r\n\r\nAnd I really, really dislike that twist about Bruce’s parents. That was such a lazy Hollywood writer hack thing to do just to create (unwanted) drama.\r\n\r\nThen we have the Riddler. Compared to the charismatic villains that we have come to expect he is just a sad little psychopath with a bunch of equally sad fanatical internet followers.\r\n\r\nNow, all of this would have worked great if it had been a movie about some, unspecified, vigilante. The movie is really well done. The detective story, the action (especially towards the end) and the noir setting would have worked great. Even at its three hour bloated length it would have been great although cut down to two hours or a bit more would have been even better. If it had not been a Batman movie!", "created_at": "2022-08-14T13:11:41.626Z"}, {"movie_id": 414906, "review_id": "630996ce6e938a007bf1f5fe", "author_rating": 5.0, "review_text": "The Batman is not a terribly bad movie, but it would be twice as good if it were half as long. How a film that likes to take shortcuts – especially with the Riddler’s ‘riddles’ – can still take almost three hours to get to where it’s going, I haven’t the foggiest (but then this is a rather strange enterprise that gives us Andy Serkis in the flesh and covers Colin Farrell in prosthetic makeup and a fat suit). Director/co-writer Matt Reeves very wisely avoids origin stories and takes for granted relationships, which have already been well established in a decades-long canon, between certain characters; on the other hand, he allows his movie to become bogged down at the halfway point in a deluge of backstory.\r\n\r\nThe obvious problem is that there is enough material here for at least two films, and Reeves attempts to cram it all into a single one. Why? We all know there are going to be sequels, so why not save some for the next chapter? Or better yet, why not leave some of it on the cutting room floor? There is absolutely no reason for the Penguin to be in this movie; he might as well be the Imperceptible Man (an actual Batman villain, mind you) for all that he’s given to do. Catwoman has been pretty much played out, and as far as the Riddler, I can’t believe I’m going to say this, but Jim Carrey did a much better job with the role than does Paul Dano – an otherwise fine actor that inexplicably chose to play the character as the bastard child of Heath Ledger’s Joker and Tom Hardy’s Bane. That leaves Carmine Falcone (John Turturro), who provides the most intriguing plot points; why not make him the main, or even – dare I say it – only villain?\r\n\r\nNow, The Batman is long enough to try the patient of a saint, but at least it’s great to look at. Like the first Tim Burton Batman (as described by the unerring Roger Ebert), it “is a triumph of design over story, style over substance - a great-looking movie with a plot you can’t care much about.” Gotham City in particular is a winning combination of Burton’s faux noir texture and Christopher Nolan’s plausible architecture. The best scenes involve Batman (Robert Pattinson) and Jim Gordon (Jeffrey Wright) – and indeed Pattinson has an uncanny knack for playing off veteran character actors – as a sort of pre-Robin dynamic duo; their adventures are poignant because they appear to happen in the real world, or at least as real as a world can be wherein a grown man disguises himself as a giant bat (compare last year’s Zack Snyder's Justice League, with its unending CGI assault on the senses).", "created_at": "2022-08-27T04:00:14.031Z"}, {"movie_id": 414906, "review_id": "630a77c232489b007b74ba64", "author_rating": 3.0, "review_text": "This was the worst Batman I have ever seen. \r\n\r\nFirstly, Robert Pattinson was the worst choice for the Batman role. In Twilight he was alright, but in Batman he definitely failed. He was more like a sad, depressed goth kid with no emotions. He tried too much to fit the role, but in fact we got this depressive, dead and empty Batman. \r\n\r\nSecondly, there were other small things that sucked about this movie, for example, Cat Woman had a very simple and stupid mask. Even older movie versions had a better mask than here. Batman's batmobile also sucked. Looked like a downgraded version. He also rode just a simple bike and lastly, he couldn't even glide with his default Batman suit. Also, don't know why but James Gordon was played by a black actor, while in every movie and even in every game this character is white. Riddler character also seemed stupid, wearing stupid mask and acting stupid and wasn't intimidating at all, but laughable. So, in general cast and acting was disappointing in this movie.\r\n\r\nLastly, the movie itself... It was dull, boring and depressive. They tried to make it masterpiece with 3 hours long, but in reality movie became just plain boring and I almost fell asleep. \r\n\r\nOverall verdict: Disappointing.", "created_at": "2022-08-27T20:00:02.284Z"}, {"movie_id": 414906, "review_id": "631fa64258efd30084737214", "author_rating": null, "review_text": "After spending most of today struggling to edit, this was such a cool way to spend my evening. Big theater, fantastic film. \r\n\r\nOutstanding visuals, dreamy atmosphere, great cast, and pitch-perfect action. Giacchino’s amazing score is just the cherry on top. A few of its elements (mostly the central mystery) can feel too muddy at times, but if this is any sort of indication of the quality of 2022 films, color me excited.", "created_at": "2022-09-12T21:36:02.504Z"}, {"movie_id": 414906, "review_id": "648f612542bf0100c7fc1397", "author_rating": 5.0, "review_text": "Next too batman and Robin this has to be the 2nd most dumbest batman movie ever made. Robert Patterson made an alright batman but completely sucked at being Bruce Wayne. When he was Bruce Wayne it was like watching the twilight movies. I've never seen Bruce act like that all suspicious and looking like a dam criminal. Like wtf happened on this Batman it was horrible. Also like little to no action really at all. Catwoman was garbage. The penguin looked like a human almost like 2 face. And last but not least the riddler looked like the guy from my bloody valentine. Not only did they completely butcher the film but but they butchered the characters as well. I don't understand why this movie has such good ratings. It was the most boring batman I've ever seen. They should just stop making these. This is the 6th different batman actor and its getting worse. If you can't keep the same batman then just give up already. Obviously everyone hates playing batman since no one ever wants to keep playing him.", "created_at": "2023-06-18T19:55:17.389Z"}, {"movie_id": 414906, "review_id": "621d02856b5fc2006b954bab", "author_rating": null, "review_text": "“The Batman” Is A Very Engaging And Unforgettable Tale That Is One Of The Best Adaptations Of The Character Ever\r\n\r\nIn 1989 Michael Keaton was seen as a very controversial choice to wear the Cowl of Batman but soon proved his doubters wrong by turning “Batman” and its subsequent sequel “Batman Returns” into massive Box Office success before leaving the cape behind.\r\n\r\nWhile four other actors have taken up the cinematic version of the character in the subsequent years, Keaton has remained for many the Gold Standard with Christian Bale likely being his biggest rival.\r\n\r\nWhen Robert Pattinson was named as the new Batman, there was interest but concern as an actor who is largely known for playing Edward in the “Twilight” films seemed to be an odd choice. However, I would say that anyone who has seen some of his recent work including his performance in “The Lighthouse” would be playing him a disservice by saying he was not up to the part.\r\n\r\nIn “The Batman”, audiences are given a darker and more broken Bruce Wayne, an Emo recluse who is far from the Socialite he has been portrayed as for decades and a very sullen and withdrawn individual who does not exude charm or grace and even shows issues making eye-contact.\r\n\r\nWhen the Mayor of Gotham is killed shortly before the election by a mysterious individual known as “The Riddler” (Paul Dano), the vigilante known as “The Batman” is called in to help the police by Lt. James Gordon (Jeffrey Wright).  Gordon has been working with Batman for some time but it is clear that his association with him has not won him any favors with his fellow officers, many of which openly question his use and involvement in the crime scenes.\r\n\r\nFurther complicating matters are clues left at the various crime locales that are addressed to The Batman and cause many to believe that he may be working with the very killer they are attempting to stop.\r\n\r\nAs the investigation unfolds, the seedy side of Gotham City comes to light in the form of a missing girl who was photographed with the married Mayor and may well be the key to the investigation. Her disappearance leads her friend Selina Kyle (Zoe Kravitz), to take on her Catwoman persona and delve deep into an underworld that features deadly individuals ranging from Carmine Falcone (John Turturro), and The Penguin (Colin Farrell), amongst others as she and the Batman conduct their own investigations that at times overlap and further complicate matters.\r\n\r\nAs the body count rises and Batman races to find the true method behind the madness of The Riddler, the tone becomes darker and more sinister in a deadly race against time.\r\n\r\nThe film eschews the usual abundance of action sequences and glossy special effects which are common for Comic Book related films and instead gives audiences a slow-burning murder mystery that holds your attention from start to finish over its three-hour run time.\r\n\r\nThe dark and foreboding tone of the film is brought home by the haunting and sharp piano keys of the film’s theme that permeates the film and punches home that this is a film clearly aimed at a more adult audience.\r\n\r\nPattinson does a great job showing the deeply broken individual that is behind the mask and that Batman is the only form of escape or therapy that Bruce Wayne has due to his insistence on saving a city that many argue cannot be saved. He has strained his relationship at times with Alfred (Andy Serkis), caused damage to the financial stability and reputation of the family company in his quest for vengeance and justice, and has become a bitter and broken recluse in doing so. In many ways, it could be argued that his only socialization with others is as The Batman and his single-minded obsession is chilling to watch.\r\n\r\nPattinson also handles the action sequences well as the film spaces them out to put the emphasis more on the man than the gadgets as they are kept to a minimum even during a thrilling chase with the new version of The Batmobile.\r\n\r\nThe strong supporting cast works well with the film and Paul Dano gives a very compelling and disturbing version of his character which makes the film even darker and more engrossing.\r\n\r\nDirector Matt Reeves has crafted a dark and foreboding tone and visual style as a good portion of the film takes place in the darkness and his screenplay is not afraid to take chances by putting the emphasis on the characters and their flaws versus an abundance of action and effects.\r\n\r\nI found this version of the character and interpretation more engrossing than prior versions of the film as the bold move to do a slow-burning and dark murder mystery versus an effect-laden action film reminded me of some of the better Batman stories such as Batman: The Killing Joke or Batman: The Long Halloween.\r\n\r\nThe film is not going to be for everyone, especially younger viewers and some may take issue with the casting choices, but their performances shine and as such, “The Batman” was a very engaging and unforgettable tale that for me serves as one of the best adaptations of the character ever.\r\n\r\n4 stars out of 5", "created_at": "2022-02-28T17:12:37.932Z"}, {"movie_id": 414906, "review_id": "6222823ee258600046cc75b8", "author_rating": 8.0, "review_text": "The reviews and hype for this movie were massive!  Comparisons to The Dark Knight got my expectations high... probably a little too high.  I was expecting to be blown away and was not but even with that being said The Batman is an exceptional film.  The cinematography and visuals are stunning.  Matt Reeves made some genius creative choices among which were the more reclusive rockstar grungy Bruce Wayne and the Riddler being heavily influenced by the Zodiac.  The acting was fantastic as well with Zoe Kravitz and Paul Dano offering some standout performances.  The Batman is driven with psychological and mystery focus as compared to the action comedy style of most superhero movies.  My only complaint is that the mystery felt fairly predictable.  I wasn't surprised by any of the twists and turns.  Ultimately, this was a wonderful addition to the Batman franchise and I can't wait to see where it goes next.", "created_at": "2022-03-04T21:18:54.608Z"}, {"movie_id": 414906, "review_id": "6222973641aac4006c764e55", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-batman-spoiler-free-review\r\n\r\n\"The Batman deserves all the hype it generated and then some. Matt Reeves delivers a distinctly darker, more intense, frighteningly realistic noir thriller than past adaptations, with an aggressively vengeful Bruce Wayne / Batman and a fear-inducing, mysterious, lunatic Riddler.\r\n\r\nGreig Fraser's cinematography - bone-chilling \"ins-and-outs\" of Batman and stunning footage of Gotham - and Michael Giacchino's score - genuinely addictive, elevates the entire film - make this adaptation the best-looking and best-scored cinematic version of the Batman ever.\r\n\r\nEven with the narrative focus on the detective work, the action sequences are exhilarating and beautifully shot. The entire cast is extraordinary, especially Paul Dano and Robert Pattinson - the latter destroys all skepticism around his talent.\r\n\r\nApart from a short period at the end of the second act, the three hours fly by. It's one of the best movies of the year and a fair contender in the debate of best comic book movie of all-time.\"\r\n\r\nRating: A", "created_at": "2022-03-04T22:48:22.045Z"}, {"movie_id": 414906, "review_id": "62241381b84f940045446a10", "author_rating": 5.0, "review_text": "Paul Dano and Colin Farrell are extraordinary, but _The Batman_ is a three hour slog through Gotham that culminates with an over exaggerated riddle that isn’t worth solving. Having Batman and Jim Gordon both speak in raspy, whispery grunts feels excessive as does Gordon’s insistence on calling Batman, “Chief,” every time that they’re together. The film deserves credit for prominently shining the spotlight on the underbelly of crime in Gotham, but the storytelling in _The Batman_ is a lot like Bugs Bunny meaning to have taken that left turn at Albuquerque; a meandering foray down a dark rabbit hole that isn’t entirely necessary.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Batman-2022-Review-When-is-a-Bat-Not-Quite-a-Bat", "created_at": "2022-03-06T01:50:57.237Z"}, {"movie_id": 414906, "review_id": "622a1faa63aad20018c0b378", "author_rating": 10.0, "review_text": "Masterpiece. Best DC film yet", "created_at": "2022-03-10T15:56:26.941Z"}, {"movie_id": 414906, "review_id": "62307df10ed2ab0045ed6b4d", "author_rating": 10.0, "review_text": "_**\"Our scars can destroy us, even after the physical wounds have healed. But if we survive them, they can transform us. They can give us the power to endure, and the strength to fight.\"**_\r\n\r\nEver since it was announced that Matt Reeves was going to direct The Batman after Ben Affleck stepped down for personal reasons, I had no doubt he was going to put on one hell of a masterpiece. This is the definitive live-action Batman. An epic 3-hour film noir that delves deep into comic lore of Gotham City.\r\n\r\nRobert Pattinson perfectly embodies both Bruce Wayne and Batman. I love the character arc he goes through, realizing Gotham doesn't need vengeance to heal, but hope. Zoë Kravitz plays a phenomenal Selina Kyle, you actually feel her emotions throughout the movie. Another plus is that she actually feels integral to the plot (unlike The Dark Knight Rises). Paul Dano is a terrifyingly realistic interpretation of The Riddler, using the internet to gain a fan base for his sick games. Andy Serkis plays an excellent Alfred, being Bruce's emotional support during Dark times.\r\n\r\nThe soundtrack by Michael Giacchino is absolute God-Tier. Elevating every scene with emotion and sometimes dread. Finally a score to rival Danny Elfman's iconic score. Matt Reeves direction is impeccable as always, getting some nice shots while also making it feel nice and claustrophobic around Batman.\r\n\r\nOverall, a God-Tier Batman movie that I can't wait for the Cinematic Universe that's being made around it as I type this.", "created_at": "2022-03-15T11:52:17.425Z"}, {"movie_id": 414906, "review_id": "6233ec8303bf84001c6cb00d", "author_rating": 9.0, "review_text": "It's a cracker, no doubt about it!\r\n\r\nMatt Reeves did a great job with 2022's <em>'The Batman'</em>. It's difficult not to compare this to other Batman films, though that's DC/Warner Bros. fault for featuring him so much in recent times. I'll get this out the way early: I'd say <em>'<a href=\"https://letterboxd.com/film/batman-begins/\" rel=\"nofollow\">Batman Begins</a>'</em>/'<a href=\"https://letterboxd.com/film/the-dark-knight/\" rel=\"nofollow\">The Dark Knight</a>'</em> are superior, not by much, which is a similar case for the character performances too.\r\n\r\nRobert Pattinson is a terrific Bruce Wayne, though Christian Bale still edges him out in my eyes. Zoë Kravitz is probably the best Catwoman I've seen, though the rest - from the Riddler to Penguin to Alfred - have been portrayed better; aside from Commissioner Gordon, with Jeffrey Wright being excellent. Paul Dano is the least enjoyable performer, for me, here, I found his showing to be a bit 'meh' - effective, but meh. Barry Keoghan makes a cameo, I won't say as who, but I don't hold high hopes for him in that role; though, <a href=\"https://variety.com/2022/film/news/the-batman-ending-joker-barry-keoghan-matt-reeves-1235196812/#:~:text=While%20it%20may,more%20%E2%80%9CBatman%E2%80%9D%20movies.\" rel=\"nofollow\">apparently</a> it won't be anything that happens anyway. For the best!\r\n\r\nAnyway... the above sounds <em>way</em> too negative - as I did thoroughly and absolutely enjoy this film, hence the very positive rating. The pacing is very good, the cinematography is brilliant (Gotham looks fantastically bleak!), the story is engrossing and the dialogue is on point. The scenes with Pattinson/Kravitz and Pattinson/Wright are my favourite moments. It's a film that I'd consider as 'outstanding'.\r\n\r\nIt'll be cool to see what Reeves does with this trilogy (should it happen, of course).", "created_at": "2022-03-18T02:20:51.206Z"}, {"movie_id": 414906, "review_id": "624085464cbe12005d584bd9", "author_rating": 8.0, "review_text": "I like how Batman is depicted with a naive and loser POV from his rich high tower, a rich trust fund baby called out by both sane (Catwoman) and insane (Riddler) people while he remains oblivious until the consequences are literally flooding the city. While he uses the idea of Batman as a mantle for him to process trauma, his obliviousness to his own celebrity status and image creates unintentional side effects from his parents' death hogging the spotlight away from the people that mattered to his own nebulous idea of \"vengeance\" being co-opted by the goons, a heel-turn realization that eventually changes the rack focus, ultimately leading to a wider perspective and a selfless act of cutting the cord and helping others. Hope is more important than his idea of justice, in the end, empathy being the missing piece throughout. Instead of being a voyeur like Riddler during his master plan (Riddler binoculars on the mayor, Batman binoculars on Catwoman), he switches to being on the ground to help, no longer from his high castle.\r\n\r\nIt's interesting how this arc plays out. At the beginning, it plays into this \"badass\" idea comic book fans love to gloat about Batman of striking fear into crime, but the way it's portrayed is frightening to everyone. It's a better criticism of Batman's fascism than BvS was going for, showcasing his fear to people who don't even deserve it, such as kids doing vandalism who probably believe the system is failing them, but to him at the beginning crime all looks the same.\r\n\r\nHonestly this film goes harder than Phantasm on the tragedy that is Bruce Wayne. They're inseparable by choice, to the point that Bruce basically is Batman even when not in the costume, a social recluse who can barely function in real life, listening to emo music and having rings around his eyes, a night owl to the extreme. The struggle is there even as Batman, literally smashing his face on a truck.\r\n\r\nThere are some contradictions throughout thematically, however. It's weird how it goes between \"it's the WHOLE system, all cops are pigs\" to \"it's just bad apples\" simultaneously, displaying a somewhat cringe centrism. Catwoman by the end basically points it more to systemic (and Batman and Thomas Wayne's criticism of thinking they know better and actually makings things worse isn't undercut, which by itself is also institutional criticism), although it still feels like they could've done more. Maybe out of their hands by the studio or this as far as they could get away with vs. the producers (it almost felt like a struggle for Catwoman to outline her \"eat the rich\" mentality). Gotham itself is a mess of contradictions and it's OK to let the viewer lie between it all I guess.\r\n\r\nAlso the relationship between Catwoman and Batman is kinda slimy and male-centric. Catwoman, while great as a character, functionally falls to Batman's controlling force with a forced romance in the second act. Sure they're both suffering from trauma but Batman was literally using her despite it all, it at least understands the power gap more in the third act.\r\n\r\nThe end of the second act also spins its wheels a bit too much, the mystery pace kinda suffers a bit from focus and scenes get too drawn out (Riddler just disappears for a while). The movie could've been 20 minutes shorter. Doesn't stop it from having a terrific third act since most blockbusters have kinda sucked on that note\r\nAlthough speaking of Riddler, master class. Probably my favorite villain in a Batman film. \r\n\r\nThe aesthetic was gorgeous. I love its color grading and architecture, still thinking of the Wayne tower and its metal grates, goth hallways, and insane attention to detail that gets blurred out intentionally in the frame for most of the movie by Bruce's obliviousness to the world. It also keeps a balance of evoking the black/white movies while still being colorful, more of flooded black and oranges. I think of that sequence with Penguin not mainly for the fight itself (which to me was a bit messy) but moreso the flooded orange of the fire being the only color creating a sorta gradient on the black car, and how the flare at the end matches that aesthetic, that one color illuminating Batman leading everybody else to exit the frame, like a light in the darkness. Lovely\r\n\r\nThe music.... Giacchino just beat out his Incredibles score for me, masterful work with motifs, percussion, and rhythm. His mastery of percussion and horns during the lights out Batman hallway fight and how the horns blast, how well edited the percussion beat subtly goes through the Penguin chase and other fight sequences, Batman doesn't quite have a dance like Hong Kong films but the music makes it come close. The timpani and strings are so well used!!! Great use of Ave Maria both as soundtrack and score. Catwoman's motif? Amazing.\r\n\r\nThe performances are great all around. Finally a film with Turturro that I don't hate him. He's well restrained and perfectly cast, his dickish attitude now a strong point making him very memorable with very little screen time, much like Farrell in the same film. Kravitz made me the closest to tearing up with how she visually handles conflicting emotions, I still think about that scene with the voicemail where her eyes are all over the place and has trouble keeping it all together. Dano as Riddler is terrific.\r\n\r\nYep, this is my fav Batman film now.", "created_at": "2022-03-27T15:39:50.559Z"}, {"movie_id": 414906, "review_id": "62473bdefd6fa1004e5031e7", "author_rating": 10.0, "review_text": "This film is so intricate, there's so many details, things you can obverse on multiple watches and not have noticed on your first. There's a lot of things that just aren't spoken that give this film so much substance. So many layers and nuanced story telling. Gotham City feels as it should, as it's own character and a visceral cesspool of corruption and just dirt. It feels dirty, unpolished... it's amazing.\r\n\r\nThere's so many shots in this film that are just simply breathtaking and intentionally dirty. It helps capture this visceral tone and fits substantially well with the universe of Batman.\r\n\r\nBeing a diehard fan of Batman for, like, pretty much all of my life- I have to say; Matt Reeves absolutely nailed it with a completely faithful adaptation of Batman. Not once in this movie did he do something I felt was completely out of character and Robert Pattinson solidified the performance of both Bruce Wayne and the Batman. I love Matt Reeves went to the extent to make sure this Batman doesn't kill, as other directors have seem to give less care to. Yes, even Nolan. It should have to go without saying that Batman does not kill, that's a no-brainer, but for decades this has been a problem in Batman films... and finally, it no longer is a problem. That's how you do it.\r\n\r\nBringing this review to a conclusion, this is easily my favourite Batman film. So many things about this film just feel like it's pulled straight out of a comic book. I mean, Riddler flooding the city itself is pulled straight from Zero Year and there's so many nods to comic moments and members of Batman's rouges gallery. Matt Reeves knew what he was doing, and he crafted this film for diehard Batman fans, succeeding immensely. Can't wait to see more of this universe.", "created_at": "2022-04-01T17:52:30.345Z"}, {"movie_id": 414906, "review_id": "6247dc50014325004eb6cfe2", "author_rating": 6.0, "review_text": "> Enormous mass that is per se a riddle. Forget screenplay, it's a comic storyboard; Do you remember Rorschach, from Moore's Watchmen, ruminating in the sewers?, ok, transpolate Batman and it works! No way, here I go-monologue and comic dialogues (effective and practical like instant soup, with 2 percent protein), comic narration, that is functional, utilitarian, Bentham would say, with the ellipses and any speech or reasoning that requires 2 minutes of reflection, at most!, \"\"this whole city´s gonna come apart\" says a District Attorney, scenic cuts and messy complexity...-entertaining but messy-comic, etc, ...it is a comic turned into a movie by someone who - I'm speculating, any resemblance to reality is purely by chance - was advised or made, or made comics in his life, don't you believe me? Ellipsis of all ellipses: \"Alfred, you're not my father \"At 23 minutes of tape, all the conflict of identity and belonging, as well as the purpose of the hero, under the sieve of the most selfish and mean son of millionaires, but let's forget this, let's continue. A Batman beating Kurt's velvety drum Cobain, -didn't tell the subversive c revolutionary adence of Cobain, to think like that I would have to know that grunge swept hardrock -finally in the 90s- and buried Motley Crue, Guns and Roses and others, (yes, I mentioned him, Cobain, and not Nirvana that did not exist, that's why when we die we are left without this specific type of grunge, I already digressed, anyway) but yes, this Batman is doubly omniscient, an ego the size of Gotham City authorizes him (a) not only to -his first omniscience- speaking in the first person of himself when running the plot, that is to say in the events, \"I am revenge\" he says to the subway gang members, (scene that is not better than Todd Phillips' Koker subway, for give another example) that this happened -the first person- almost in all the other versions that precede it,it is also included here -its omniscience, obviously- dominating forensic or medical terms: \"eschimia\"? ask Batman of course!, but to (b), his second omniscience, being the narrator of his exploits in the first person, this again leads us to an Alan Moore influence but, with all due respect, as a clericot of Alan's genius Moore. When Batman wants to see the Penguin, he just has to be like the Penguin, appear in the doorway and announce himself, and please, for the fun of the plot, Batman almost spouts a sentence \"please tell me you won't let me in to unfold my money in the form of weapons hidden in my suit, and get in anyway. That is to say, the theatricality and the shadows of the bat, remained in the Babyboomer Generation or Generation X when the entrance was an \"appearance\" through shadows, suspicion and myth. The film is a complex mass because it is as if The Batman, The Batman 2 and 3 had been compressed and I am not only talking about the exhausting time of almost 3 hours, but also because of the number of common threads in which it was woven into a single feature film. For example, the plot increases its complexity first with a Riddler who is an anti-hero, because he indirectly helps Batman and the supposed common good and because of the premises that justify his murders, unmasking the big shots of the underworld at high levels of government, but later, arrested as Edward Nashton, he unmasks himself, that is, he turns himself in, sitting in that cafeteria just when, then yes, we will understand his \"fine\" intentions, and he becomes a true public order villain because he incites the revenge to the uncritical masses and followers of the disorder who have suffered or have resentments for any type of discrimination or corruption that they have suffered in Gotham city, (no more and no less than similar to the end of Todd Phillips' Joker);another complexity is with the cat The cat, I will not say Catwoman, who has her own drama for Kyle and at some point Batman leans on her, to spy on the Prosecutor and at least 2 times saves her from murdering her father Carmine Falcone and the his father's henchman. On the other hand, there is the added density or complexity of transcending and publishing the videos that show that the mother of Bruce Wayne, the mother of Batman had psychiatric problems in Arkham and hospitals and comes from a family that descendants who also had these difficulties and Thomas Wayne , trying to silence the journalist, he used the biggest thug Falcone. In other words, there is a possibility that Falcone, Catwoman's stepfather, is the one who murdered the Waynes that night because Batman's father was about to pity or denounce the next day that he only wanted to silence the journalist and NOT murder him as Falcone did. . In short, it is entertaining but poorly planned for a single feature film due to the enormous amount of detail that is handled.", "created_at": "2022-04-02T05:17:04.458Z"}, {"movie_id": 414906, "review_id": "624b1ff015a4a1006381e9cc", "author_rating": 6.0, "review_text": "OK, shoot me now - but you can tell when you are watching a film at the cinema and the audience start to get a bit restless. Well mine did with this overlong, and frankly rather dreary film. The opening few, somewhat dystopian, scenes reminded me of \"Blade Runner\" (1982) and we do hit the ground running. Amidst an hotly contested mayoral election, a chap in a gas mask (\"The Riddler\", we learn later) brutally takes out the sitting candidate enticing the \"Batman\" (Robert Pattinson) to come help his policeman pal \"Gordon\" (Jeffrey Wright) to investigate. Seems that the killer wanted that to happen because he leaves our caped crusader a card with a clue. Soon the great and the good of the city are dropping like flies and a web of corruption and deceit at the top echelons of government is emerging. Personally I found this all a bit dull. It flows terribly slowly, and after a while the relentless darkness and a really pretty soporific, moody, effort from Pattinson just started to bore me. There are loads of plot holes - not least just how the \"Riddler\" manages to pull off some pretty heavy duty crimes without having to scale any tall buildings, or sneak past the heavily guarded victims of his spree. The scenes with the completely unprotected DA (Peter Sarsgaard) in a dimly lit street are just plain daft. Colin Farrell is probably my highlight as the duplicitous \"Oz\", and Zoë Kravitz (\"Cat Woman”) offers us some decent acrobatics but otherwise, this is an hugely over-rated affair that has a serious paucity of dialogue, is heavily scored and during it's almost three hours, not enough actually happens. Indeed, it is very reluctant to let us leave. I will admit that my first guess at the ending was a bit optimistic, but it could conclude at least another four times before we are finally allowed to stretch our legs. It might look better second time around, but for now it's nothing at all to write home about.", "created_at": "2022-04-04T16:42:24.863Z"}, {"movie_id": 414906, "review_id": "625dd5e19ee0ef0050f5b825", "author_rating": 8.0, "review_text": "Good albeit not great, this newest incarnation of Batman is well done if not also incredibly dark. I did like Robert Pattinson's portrayal and didn't employ the annoying voice that kind of ruined The Dark Knight and more so, The Dark Knight Rises. As a whole though I did like the plot (parts inspired by The Long Halloween) and a good supporting cast, with Paul Dano giving a creepy performance as The Riddler and looking forward to seeing more from Zoe Kravitz's Selina/Catwoman. **4.0/5**", "created_at": "2022-04-18T21:19:29.046Z"}, {"movie_id": 414906, "review_id": "6263fd340b5fd60f76b801f1", "author_rating": 7.0, "review_text": "I am so tired of superhero movies. Still, being down with a mild case of Corona, I wanted something to watch that'd go down easy, and The Batman was available, so I picked it.\r\n\r\nI have to say that this, to me, is one of the rare superhero movies that appeal to me. And that's after having seen every other Batman movie since Tim Burton's 1989 one. And, I dare say, even with me being fed up with superhero movies, I think this is the best attempt.\r\n\r\nAt three hours, it feels like binge-watching a three-part miniseries. And by that I mean both that to the extent that it is three acts, they almost perfectly align with an hour each, and also that the pacing is great, and I never got bored.\r\n\r\nThe cast is excellent. Also, for the first time ever, I'm not thinking that it's ridiculous that no one recognizes Bruce Wayne as Batman. The half-mask actually makes Bruce Wayne unrecognizable. I'm not sure if they thought of that during casting, but it's really quite impressive.\r\n\r\nIt's also nice to not have to suffer through a pathetic attempt from Batman to make his voice sound cool. Oh dear, Christian Bale trying to look and sound cool was just so cringey. Robert Pattinson is by far the best Batman I've ever seen. The almost depressive mental torment he conveys does not come off as fake or pretension, and that's a first for the Batman franchise as far as I'm concerned.\r\n\r\nThe mood is bleak without being depressive, the score is fantastic, if a bit too much, the cinematography is amazing, I really have very little to fault here. If anything, it may come off as a little pretentious and self-indulgent, but that's also part of the attraction, and if I'm being completely honest, I think it's more to do with my own \"people need to grow up and stop watching these childish things\" prejudice I have, when in fact the 15-year-old inside of me f...ing loves it, and I need to embrace that childish part of me rather than hate on it.\r\n\r\nIf there's anything I would change about this movie, it's what I feel is somewhat of a PG-ification of Batman. I would love to see this movie with all its bleak desperation and lust for vengeance on the depravity and evil in the Gotham world, but with a seriously anti-hero, all-violent, bringer-of-death Batman. I would love to see him - in a more crude outfit, with less bells and whistles, and definitely without the cape - destroy, slay and kill, with exploration of the terrible aftermath it would bring, including the impact on his psyche, rather than the beat-up-and-let-go strategy that he is using in this movie. That part just feels to not align with both the doomish mood that sets the story and the seeming existential depression of our masked protagonist. I think that would warrant yet another installment in this franchise. I'm actually surprised how much meat there is on this character.\r\n\r\nAlso, if the movie overall is consistently a bit too much, the ending takes it one notch further on that scale.\r\n\r\nRegardless, I now have two superhero movies that I keep in my movie collection. The other is Watchmen (Director's Cut).\r\n\r\n1 star deducted for Catwoman being racist without it being presented as a problem. The casting of her is perfect, by the way. Much better than Michelle Pfeiffer.", "created_at": "2022-04-23T13:20:52.161Z"}, {"movie_id": 414906, "review_id": "62690f5d38765101658093c5", "author_rating": 8.0, "review_text": "Oh boy, yet another review here on TMDB about this movie. What is it about comic books that garners so much interest? I am no longer a comic hero fan, either in movies or the source comic books. I have seen some of the Marvel series and the only one that I would watch multiple times if it came across my screen in Ant Man and the Wasp, with its wit, action and humor.\r\n\r\nI did read superhero comics as a kid, however. I stuck to DC comics. I especially liked the Legion of Superheroes, though I also read the Justice League, Superman and Batman. This was the Silver Age of comics, I believe, before they restarted and complicated the field with reimagining the comic universe (or whatever it is they did).\r\n\r\nAnyway, I was a DC boy so I gave The Batman a look see. It is a dark film, both in its themes and its camera work. No wit and humor to speak of here, just grim and introspective comic book noir. But it was intriguing and interesting enough to hold only my attention. There were a couple of interesting twists on traditional Batman villains, for example. As with a lot of current thrillers, there is quite a body count, when sometimes with violence, I think less can be more.\r\n\r\nIt is not a film I will watch multiple times or anxiously await a sequel for, but I do not regret the time spent watching it.", "created_at": "2022-04-27T09:39:42.003Z"}, {"movie_id": 414906, "review_id": "626c2f9f35811d005015ae2f", "author_rating": 10.0, "review_text": "_The Batman_ is the best live-action Batman movie yet. It's the type of Batman film I've been waiting for my whole life.\r\n\r\nIt's dark and realistic, but also stylish and large-scale. It's not limited by a commitment to realism like the Dark Knight trilogy, nor is it burdened by a shared universe like the DCEU. It is its own thing. A moody, disturbing, visually stunning, David Fincher-inspired, three hour long detective epic with some of the best interpretations of the characters ever put on screen.\r\n\r\nRobert Pattinson is fantastic as a younger, moodier, and yes, more emo Batman. Paul Dano is straight up terrifying as the Riddler. Colin Farrell is unrecognisable in more ways than one as The Penguin and Zoë Kravitz is easily my favorite live-action Catwoman. Massively underrated is john Turturro as Carmine Falcone.\r\n\r\nThis movie kept me hooked all the way through. It's almost three hours long but it feels like two.\r\n\r\nThis is the best Batman movie. The Dark Knight is good and all, but Reeves finds the perfect mix of gritty realism and style (Nolan would never even dare to have a snorricam shot of Batmam gliding over the city), and finally gives us a live-action Batman that lives up to the title of \"World's Greatest Detective\". Not that there's much competition, since he's like the only one to actually do any detective work (no, Christian Bale magically finding a fingerprint on a broken bullet doesn't count).", "created_at": "2022-04-29T18:34:07.252Z"}, {"movie_id": 414906, "review_id": "626c76a0245dbe004f431b50", "author_rating": null, "review_text": "The movie was one of the best Batman movies in my opinion, but, I honestly didn't like thus portrayal of Batman. This didn't feel like Batman, more like BatDude. Like a man in real life that grew up watching Batman and decided to fight crime under his name. Overall it is definitely worth the watch!", "created_at": "2022-04-29T23:37:04.585Z"}, {"movie_id": 414906, "review_id": "62bdfb3c8d2f8d006117ac09", "author_rating": 10.0, "review_text": "Batman returns back to its detective roots, and it is a breath of fresh air. Robert Patterson is stunning as Batman. The twists and turns the new Riddler take is a fun ride.\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-06-30T19:36:28.614Z"}, {"movie_id": 414906, "review_id": "62f8f48d258823007f6074ce", "author_rating": 4.0, "review_text": "To be honest, this is a really good movie. Hang on? So why did I only give it 2 out of 5 stars? Well, this is really personal but, to me, it is not a good Batman movie. I really had problems writing this review because it is a very good movie. I just did not like it as a Batman movie.\r\n\r\nThe movie is really dark, gritty and noir. Not really a problem. It works for some movies. But it is also quite slow at the beginning and the first quarter of the movie was actually boring. Remember, this is a three hour movie so a quarter is more than half an hour of “boringness”.\r\n\r\nThe “boringess” was broken up by a pretty cool car chase. Some people seem to not really like the batmobile and I have to say that it was not very inspired but it was not all bad either. Unfortunately the movie turned rather boring for a while again after that.\r\n\r\nThe movie tries to bring out more of the detective part of Batman than the previous movies, which is fine, but there is just too much moping around with Batman / Bruce Wayne walking around oozing sadness all around him.\r\n\r\nActually, this brings us to my main gripe with this movie. The choice of actor for the Batman is just wrong for me. He is more like a sad puppy than the Batman. The script that makes him mope around, have emotional outbreaks and, occasionally, being downright stupid like just staring dumbfounded when explosives go off in his face does not really help of course.\r\n\r\nTo me the Selina Kyle character had more charisma than the Batman, especially when the Batman was in his Bruce Wayne alter ego.\r\n\r\nAnd I really, really dislike that twist about Bruce’s parents. That was such a lazy Hollywood writer hack thing to do just to create (unwanted) drama.\r\n\r\nThen we have the Riddler. Compared to the charismatic villains that we have come to expect he is just a sad little psychopath with a bunch of equally sad fanatical internet followers.\r\n\r\nNow, all of this would have worked great if it had been a movie about some, unspecified, vigilante. The movie is really well done. The detective story, the action (especially towards the end) and the noir setting would have worked great. Even at its three hour bloated length it would have been great although cut down to two hours or a bit more would have been even better. If it had not been a Batman movie!", "created_at": "2022-08-14T13:11:41.626Z"}, {"movie_id": 414906, "review_id": "630996ce6e938a007bf1f5fe", "author_rating": 5.0, "review_text": "The Batman is not a terribly bad movie, but it would be twice as good if it were half as long. How a film that likes to take shortcuts – especially with the Riddler’s ‘riddles’ – can still take almost three hours to get to where it’s going, I haven’t the foggiest (but then this is a rather strange enterprise that gives us Andy Serkis in the flesh and covers Colin Farrell in prosthetic makeup and a fat suit). Director/co-writer Matt Reeves very wisely avoids origin stories and takes for granted relationships, which have already been well established in a decades-long canon, between certain characters; on the other hand, he allows his movie to become bogged down at the halfway point in a deluge of backstory.\r\n\r\nThe obvious problem is that there is enough material here for at least two films, and Reeves attempts to cram it all into a single one. Why? We all know there are going to be sequels, so why not save some for the next chapter? Or better yet, why not leave some of it on the cutting room floor? There is absolutely no reason for the Penguin to be in this movie; he might as well be the Imperceptible Man (an actual Batman villain, mind you) for all that he’s given to do. Catwoman has been pretty much played out, and as far as the Riddler, I can’t believe I’m going to say this, but Jim Carrey did a much better job with the role than does Paul Dano – an otherwise fine actor that inexplicably chose to play the character as the bastard child of Heath Ledger’s Joker and Tom Hardy’s Bane. That leaves Carmine Falcone (John Turturro), who provides the most intriguing plot points; why not make him the main, or even – dare I say it – only villain?\r\n\r\nNow, The Batman is long enough to try the patient of a saint, but at least it’s great to look at. Like the first Tim Burton Batman (as described by the unerring Roger Ebert), it “is a triumph of design over story, style over substance - a great-looking movie with a plot you can’t care much about.” Gotham City in particular is a winning combination of Burton’s faux noir texture and Christopher Nolan’s plausible architecture. The best scenes involve Batman (Robert Pattinson) and Jim Gordon (Jeffrey Wright) – and indeed Pattinson has an uncanny knack for playing off veteran character actors – as a sort of pre-Robin dynamic duo; their adventures are poignant because they appear to happen in the real world, or at least as real as a world can be wherein a grown man disguises himself as a giant bat (compare last year’s Zack Snyder's Justice League, with its unending CGI assault on the senses).", "created_at": "2022-08-27T04:00:14.031Z"}, {"movie_id": 414906, "review_id": "630a77c232489b007b74ba64", "author_rating": 3.0, "review_text": "This was the worst Batman I have ever seen. \r\n\r\nFirstly, Robert Pattinson was the worst choice for the Batman role. In Twilight he was alright, but in Batman he definitely failed. He was more like a sad, depressed goth kid with no emotions. He tried too much to fit the role, but in fact we got this depressive, dead and empty Batman. \r\n\r\nSecondly, there were other small things that sucked about this movie, for example, Cat Woman had a very simple and stupid mask. Even older movie versions had a better mask than here. Batman's batmobile also sucked. Looked like a downgraded version. He also rode just a simple bike and lastly, he couldn't even glide with his default Batman suit. Also, don't know why but James Gordon was played by a black actor, while in every movie and even in every game this character is white. Riddler character also seemed stupid, wearing stupid mask and acting stupid and wasn't intimidating at all, but laughable. So, in general cast and acting was disappointing in this movie.\r\n\r\nLastly, the movie itself... It was dull, boring and depressive. They tried to make it masterpiece with 3 hours long, but in reality movie became just plain boring and I almost fell asleep. \r\n\r\nOverall verdict: Disappointing.", "created_at": "2022-08-27T20:00:02.284Z"}, {"movie_id": 414906, "review_id": "631fa64258efd30084737214", "author_rating": null, "review_text": "After spending most of today struggling to edit, this was such a cool way to spend my evening. Big theater, fantastic film. \r\n\r\nOutstanding visuals, dreamy atmosphere, great cast, and pitch-perfect action. Giacchino’s amazing score is just the cherry on top. A few of its elements (mostly the central mystery) can feel too muddy at times, but if this is any sort of indication of the quality of 2022 films, color me excited.", "created_at": "2022-09-12T21:36:02.504Z"}, {"movie_id": 414906, "review_id": "648f612542bf0100c7fc1397", "author_rating": 5.0, "review_text": "Next too batman and Robin this has to be the 2nd most dumbest batman movie ever made. Robert Patterson made an alright batman but completely sucked at being Bruce Wayne. When he was Bruce Wayne it was like watching the twilight movies. I've never seen Bruce act like that all suspicious and looking like a dam criminal. Like wtf happened on this Batman it was horrible. Also like little to no action really at all. Catwoman was garbage. The penguin looked like a human almost like 2 face. And last but not least the riddler looked like the guy from my bloody valentine. Not only did they completely butcher the film but but they butchered the characters as well. I don't understand why this movie has such good ratings. It was the most boring batman I've ever seen. They should just stop making these. This is the 6th different batman actor and its getting worse. If you can't keep the same batman then just give up already. Obviously everyone hates playing batman since no one ever wants to keep playing him.", "created_at": "2023-06-18T19:55:17.389Z"}, {"movie_id": 414906, "review_id": "621d02856b5fc2006b954bab", "author_rating": null, "review_text": "“The Batman” Is A Very Engaging And Unforgettable Tale That Is One Of The Best Adaptations Of The Character Ever\r\n\r\nIn 1989 Michael Keaton was seen as a very controversial choice to wear the Cowl of Batman but soon proved his doubters wrong by turning “Batman” and its subsequent sequel “Batman Returns” into massive Box Office success before leaving the cape behind.\r\n\r\nWhile four other actors have taken up the cinematic version of the character in the subsequent years, Keaton has remained for many the Gold Standard with Christian Bale likely being his biggest rival.\r\n\r\nWhen Robert Pattinson was named as the new Batman, there was interest but concern as an actor who is largely known for playing Edward in the “Twilight” films seemed to be an odd choice. However, I would say that anyone who has seen some of his recent work including his performance in “The Lighthouse” would be playing him a disservice by saying he was not up to the part.\r\n\r\nIn “The Batman”, audiences are given a darker and more broken Bruce Wayne, an Emo recluse who is far from the Socialite he has been portrayed as for decades and a very sullen and withdrawn individual who does not exude charm or grace and even shows issues making eye-contact.\r\n\r\nWhen the Mayor of Gotham is killed shortly before the election by a mysterious individual known as “The Riddler” (Paul Dano), the vigilante known as “The Batman” is called in to help the police by Lt. James Gordon (Jeffrey Wright).  Gordon has been working with Batman for some time but it is clear that his association with him has not won him any favors with his fellow officers, many of which openly question his use and involvement in the crime scenes.\r\n\r\nFurther complicating matters are clues left at the various crime locales that are addressed to The Batman and cause many to believe that he may be working with the very killer they are attempting to stop.\r\n\r\nAs the investigation unfolds, the seedy side of Gotham City comes to light in the form of a missing girl who was photographed with the married Mayor and may well be the key to the investigation. Her disappearance leads her friend Selina Kyle (Zoe Kravitz), to take on her Catwoman persona and delve deep into an underworld that features deadly individuals ranging from Carmine Falcone (John Turturro), and The Penguin (Colin Farrell), amongst others as she and the Batman conduct their own investigations that at times overlap and further complicate matters.\r\n\r\nAs the body count rises and Batman races to find the true method behind the madness of The Riddler, the tone becomes darker and more sinister in a deadly race against time.\r\n\r\nThe film eschews the usual abundance of action sequences and glossy special effects which are common for Comic Book related films and instead gives audiences a slow-burning murder mystery that holds your attention from start to finish over its three-hour run time.\r\n\r\nThe dark and foreboding tone of the film is brought home by the haunting and sharp piano keys of the film’s theme that permeates the film and punches home that this is a film clearly aimed at a more adult audience.\r\n\r\nPattinson does a great job showing the deeply broken individual that is behind the mask and that Batman is the only form of escape or therapy that Bruce Wayne has due to his insistence on saving a city that many argue cannot be saved. He has strained his relationship at times with Alfred (Andy Serkis), caused damage to the financial stability and reputation of the family company in his quest for vengeance and justice, and has become a bitter and broken recluse in doing so. In many ways, it could be argued that his only socialization with others is as The Batman and his single-minded obsession is chilling to watch.\r\n\r\nPattinson also handles the action sequences well as the film spaces them out to put the emphasis more on the man than the gadgets as they are kept to a minimum even during a thrilling chase with the new version of The Batmobile.\r\n\r\nThe strong supporting cast works well with the film and Paul Dano gives a very compelling and disturbing version of his character which makes the film even darker and more engrossing.\r\n\r\nDirector Matt Reeves has crafted a dark and foreboding tone and visual style as a good portion of the film takes place in the darkness and his screenplay is not afraid to take chances by putting the emphasis on the characters and their flaws versus an abundance of action and effects.\r\n\r\nI found this version of the character and interpretation more engrossing than prior versions of the film as the bold move to do a slow-burning and dark murder mystery versus an effect-laden action film reminded me of some of the better Batman stories such as Batman: The Killing Joke or Batman: The Long Halloween.\r\n\r\nThe film is not going to be for everyone, especially younger viewers and some may take issue with the casting choices, but their performances shine and as such, “The Batman” was a very engaging and unforgettable tale that for me serves as one of the best adaptations of the character ever.\r\n\r\n4 stars out of 5", "created_at": "2022-02-28T17:12:37.932Z"}, {"movie_id": 414906, "review_id": "6222823ee258600046cc75b8", "author_rating": 8.0, "review_text": "The reviews and hype for this movie were massive!  Comparisons to The Dark Knight got my expectations high... probably a little too high.  I was expecting to be blown away and was not but even with that being said The Batman is an exceptional film.  The cinematography and visuals are stunning.  Matt Reeves made some genius creative choices among which were the more reclusive rockstar grungy Bruce Wayne and the Riddler being heavily influenced by the Zodiac.  The acting was fantastic as well with Zoe Kravitz and Paul Dano offering some standout performances.  The Batman is driven with psychological and mystery focus as compared to the action comedy style of most superhero movies.  My only complaint is that the mystery felt fairly predictable.  I wasn't surprised by any of the twists and turns.  Ultimately, this was a wonderful addition to the Batman franchise and I can't wait to see where it goes next.", "created_at": "2022-03-04T21:18:54.608Z"}, {"movie_id": 414906, "review_id": "6222973641aac4006c764e55", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-batman-spoiler-free-review\r\n\r\n\"The Batman deserves all the hype it generated and then some. Matt Reeves delivers a distinctly darker, more intense, frighteningly realistic noir thriller than past adaptations, with an aggressively vengeful Bruce Wayne / Batman and a fear-inducing, mysterious, lunatic Riddler.\r\n\r\nGreig Fraser's cinematography - bone-chilling \"ins-and-outs\" of Batman and stunning footage of Gotham - and Michael Giacchino's score - genuinely addictive, elevates the entire film - make this adaptation the best-looking and best-scored cinematic version of the Batman ever.\r\n\r\nEven with the narrative focus on the detective work, the action sequences are exhilarating and beautifully shot. The entire cast is extraordinary, especially Paul Dano and Robert Pattinson - the latter destroys all skepticism around his talent.\r\n\r\nApart from a short period at the end of the second act, the three hours fly by. It's one of the best movies of the year and a fair contender in the debate of best comic book movie of all-time.\"\r\n\r\nRating: A", "created_at": "2022-03-04T22:48:22.045Z"}, {"movie_id": 414906, "review_id": "62241381b84f940045446a10", "author_rating": 5.0, "review_text": "Paul Dano and Colin Farrell are extraordinary, but _The Batman_ is a three hour slog through Gotham that culminates with an over exaggerated riddle that isn’t worth solving. Having Batman and Jim Gordon both speak in raspy, whispery grunts feels excessive as does Gordon’s insistence on calling Batman, “Chief,” every time that they’re together. The film deserves credit for prominently shining the spotlight on the underbelly of crime in Gotham, but the storytelling in _The Batman_ is a lot like Bugs Bunny meaning to have taken that left turn at Albuquerque; a meandering foray down a dark rabbit hole that isn’t entirely necessary.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Batman-2022-Review-When-is-a-Bat-Not-Quite-a-Bat", "created_at": "2022-03-06T01:50:57.237Z"}, {"movie_id": 414906, "review_id": "622a1faa63aad20018c0b378", "author_rating": 10.0, "review_text": "Masterpiece. Best DC film yet", "created_at": "2022-03-10T15:56:26.941Z"}, {"movie_id": 414906, "review_id": "62307df10ed2ab0045ed6b4d", "author_rating": 10.0, "review_text": "_**\"Our scars can destroy us, even after the physical wounds have healed. But if we survive them, they can transform us. They can give us the power to endure, and the strength to fight.\"**_\r\n\r\nEver since it was announced that Matt Reeves was going to direct The Batman after Ben Affleck stepped down for personal reasons, I had no doubt he was going to put on one hell of a masterpiece. This is the definitive live-action Batman. An epic 3-hour film noir that delves deep into comic lore of Gotham City.\r\n\r\nRobert Pattinson perfectly embodies both Bruce Wayne and Batman. I love the character arc he goes through, realizing Gotham doesn't need vengeance to heal, but hope. Zoë Kravitz plays a phenomenal Selina Kyle, you actually feel her emotions throughout the movie. Another plus is that she actually feels integral to the plot (unlike The Dark Knight Rises). Paul Dano is a terrifyingly realistic interpretation of The Riddler, using the internet to gain a fan base for his sick games. Andy Serkis plays an excellent Alfred, being Bruce's emotional support during Dark times.\r\n\r\nThe soundtrack by Michael Giacchino is absolute God-Tier. Elevating every scene with emotion and sometimes dread. Finally a score to rival Danny Elfman's iconic score. Matt Reeves direction is impeccable as always, getting some nice shots while also making it feel nice and claustrophobic around Batman.\r\n\r\nOverall, a God-Tier Batman movie that I can't wait for the Cinematic Universe that's being made around it as I type this.", "created_at": "2022-03-15T11:52:17.425Z"}, {"movie_id": 414906, "review_id": "6233ec8303bf84001c6cb00d", "author_rating": 9.0, "review_text": "It's a cracker, no doubt about it!\r\n\r\nMatt Reeves did a great job with 2022's <em>'The Batman'</em>. It's difficult not to compare this to other Batman films, though that's DC/Warner Bros. fault for featuring him so much in recent times. I'll get this out the way early: I'd say <em>'<a href=\"https://letterboxd.com/film/batman-begins/\" rel=\"nofollow\">Batman Begins</a>'</em>/'<a href=\"https://letterboxd.com/film/the-dark-knight/\" rel=\"nofollow\">The Dark Knight</a>'</em> are superior, not by much, which is a similar case for the character performances too.\r\n\r\nRobert Pattinson is a terrific Bruce Wayne, though Christian Bale still edges him out in my eyes. Zoë Kravitz is probably the best Catwoman I've seen, though the rest - from the Riddler to Penguin to Alfred - have been portrayed better; aside from Commissioner Gordon, with Jeffrey Wright being excellent. Paul Dano is the least enjoyable performer, for me, here, I found his showing to be a bit 'meh' - effective, but meh. Barry Keoghan makes a cameo, I won't say as who, but I don't hold high hopes for him in that role; though, <a href=\"https://variety.com/2022/film/news/the-batman-ending-joker-barry-keoghan-matt-reeves-1235196812/#:~:text=While%20it%20may,more%20%E2%80%9CBatman%E2%80%9D%20movies.\" rel=\"nofollow\">apparently</a> it won't be anything that happens anyway. For the best!\r\n\r\nAnyway... the above sounds <em>way</em> too negative - as I did thoroughly and absolutely enjoy this film, hence the very positive rating. The pacing is very good, the cinematography is brilliant (Gotham looks fantastically bleak!), the story is engrossing and the dialogue is on point. The scenes with Pattinson/Kravitz and Pattinson/Wright are my favourite moments. It's a film that I'd consider as 'outstanding'.\r\n\r\nIt'll be cool to see what Reeves does with this trilogy (should it happen, of course).", "created_at": "2022-03-18T02:20:51.206Z"}, {"movie_id": 414906, "review_id": "624085464cbe12005d584bd9", "author_rating": 8.0, "review_text": "I like how Batman is depicted with a naive and loser POV from his rich high tower, a rich trust fund baby called out by both sane (Catwoman) and insane (Riddler) people while he remains oblivious until the consequences are literally flooding the city. While he uses the idea of Batman as a mantle for him to process trauma, his obliviousness to his own celebrity status and image creates unintentional side effects from his parents' death hogging the spotlight away from the people that mattered to his own nebulous idea of \"vengeance\" being co-opted by the goons, a heel-turn realization that eventually changes the rack focus, ultimately leading to a wider perspective and a selfless act of cutting the cord and helping others. Hope is more important than his idea of justice, in the end, empathy being the missing piece throughout. Instead of being a voyeur like Riddler during his master plan (Riddler binoculars on the mayor, Batman binoculars on Catwoman), he switches to being on the ground to help, no longer from his high castle.\r\n\r\nIt's interesting how this arc plays out. At the beginning, it plays into this \"badass\" idea comic book fans love to gloat about Batman of striking fear into crime, but the way it's portrayed is frightening to everyone. It's a better criticism of Batman's fascism than BvS was going for, showcasing his fear to people who don't even deserve it, such as kids doing vandalism who probably believe the system is failing them, but to him at the beginning crime all looks the same.\r\n\r\nHonestly this film goes harder than Phantasm on the tragedy that is Bruce Wayne. They're inseparable by choice, to the point that Bruce basically is Batman even when not in the costume, a social recluse who can barely function in real life, listening to emo music and having rings around his eyes, a night owl to the extreme. The struggle is there even as Batman, literally smashing his face on a truck.\r\n\r\nThere are some contradictions throughout thematically, however. It's weird how it goes between \"it's the WHOLE system, all cops are pigs\" to \"it's just bad apples\" simultaneously, displaying a somewhat cringe centrism. Catwoman by the end basically points it more to systemic (and Batman and Thomas Wayne's criticism of thinking they know better and actually makings things worse isn't undercut, which by itself is also institutional criticism), although it still feels like they could've done more. Maybe out of their hands by the studio or this as far as they could get away with vs. the producers (it almost felt like a struggle for Catwoman to outline her \"eat the rich\" mentality). Gotham itself is a mess of contradictions and it's OK to let the viewer lie between it all I guess.\r\n\r\nAlso the relationship between Catwoman and Batman is kinda slimy and male-centric. Catwoman, while great as a character, functionally falls to Batman's controlling force with a forced romance in the second act. Sure they're both suffering from trauma but Batman was literally using her despite it all, it at least understands the power gap more in the third act.\r\n\r\nThe end of the second act also spins its wheels a bit too much, the mystery pace kinda suffers a bit from focus and scenes get too drawn out (Riddler just disappears for a while). The movie could've been 20 minutes shorter. Doesn't stop it from having a terrific third act since most blockbusters have kinda sucked on that note\r\nAlthough speaking of Riddler, master class. Probably my favorite villain in a Batman film. \r\n\r\nThe aesthetic was gorgeous. I love its color grading and architecture, still thinking of the Wayne tower and its metal grates, goth hallways, and insane attention to detail that gets blurred out intentionally in the frame for most of the movie by Bruce's obliviousness to the world. It also keeps a balance of evoking the black/white movies while still being colorful, more of flooded black and oranges. I think of that sequence with Penguin not mainly for the fight itself (which to me was a bit messy) but moreso the flooded orange of the fire being the only color creating a sorta gradient on the black car, and how the flare at the end matches that aesthetic, that one color illuminating Batman leading everybody else to exit the frame, like a light in the darkness. Lovely\r\n\r\nThe music.... Giacchino just beat out his Incredibles score for me, masterful work with motifs, percussion, and rhythm. His mastery of percussion and horns during the lights out Batman hallway fight and how the horns blast, how well edited the percussion beat subtly goes through the Penguin chase and other fight sequences, Batman doesn't quite have a dance like Hong Kong films but the music makes it come close. The timpani and strings are so well used!!! Great use of Ave Maria both as soundtrack and score. Catwoman's motif? Amazing.\r\n\r\nThe performances are great all around. Finally a film with Turturro that I don't hate him. He's well restrained and perfectly cast, his dickish attitude now a strong point making him very memorable with very little screen time, much like Farrell in the same film. Kravitz made me the closest to tearing up with how she visually handles conflicting emotions, I still think about that scene with the voicemail where her eyes are all over the place and has trouble keeping it all together. Dano as Riddler is terrific.\r\n\r\nYep, this is my fav Batman film now.", "created_at": "2022-03-27T15:39:50.559Z"}, {"movie_id": 414906, "review_id": "62473bdefd6fa1004e5031e7", "author_rating": 10.0, "review_text": "This film is so intricate, there's so many details, things you can obverse on multiple watches and not have noticed on your first. There's a lot of things that just aren't spoken that give this film so much substance. So many layers and nuanced story telling. Gotham City feels as it should, as it's own character and a visceral cesspool of corruption and just dirt. It feels dirty, unpolished... it's amazing.\r\n\r\nThere's so many shots in this film that are just simply breathtaking and intentionally dirty. It helps capture this visceral tone and fits substantially well with the universe of Batman.\r\n\r\nBeing a diehard fan of Batman for, like, pretty much all of my life- I have to say; Matt Reeves absolutely nailed it with a completely faithful adaptation of Batman. Not once in this movie did he do something I felt was completely out of character and Robert Pattinson solidified the performance of both Bruce Wayne and the Batman. I love Matt Reeves went to the extent to make sure this Batman doesn't kill, as other directors have seem to give less care to. Yes, even Nolan. It should have to go without saying that Batman does not kill, that's a no-brainer, but for decades this has been a problem in Batman films... and finally, it no longer is a problem. That's how you do it.\r\n\r\nBringing this review to a conclusion, this is easily my favourite Batman film. So many things about this film just feel like it's pulled straight out of a comic book. I mean, Riddler flooding the city itself is pulled straight from Zero Year and there's so many nods to comic moments and members of Batman's rouges gallery. Matt Reeves knew what he was doing, and he crafted this film for diehard Batman fans, succeeding immensely. Can't wait to see more of this universe.", "created_at": "2022-04-01T17:52:30.345Z"}, {"movie_id": 414906, "review_id": "6247dc50014325004eb6cfe2", "author_rating": 6.0, "review_text": "> Enormous mass that is per se a riddle. Forget screenplay, it's a comic storyboard; Do you remember Rorschach, from Moore's Watchmen, ruminating in the sewers?, ok, transpolate Batman and it works! No way, here I go-monologue and comic dialogues (effective and practical like instant soup, with 2 percent protein), comic narration, that is functional, utilitarian, Bentham would say, with the ellipses and any speech or reasoning that requires 2 minutes of reflection, at most!, \"\"this whole city´s gonna come apart\" says a District Attorney, scenic cuts and messy complexity...-entertaining but messy-comic, etc, ...it is a comic turned into a movie by someone who - I'm speculating, any resemblance to reality is purely by chance - was advised or made, or made comics in his life, don't you believe me? Ellipsis of all ellipses: \"Alfred, you're not my father \"At 23 minutes of tape, all the conflict of identity and belonging, as well as the purpose of the hero, under the sieve of the most selfish and mean son of millionaires, but let's forget this, let's continue. A Batman beating Kurt's velvety drum Cobain, -didn't tell the subversive c revolutionary adence of Cobain, to think like that I would have to know that grunge swept hardrock -finally in the 90s- and buried Motley Crue, Guns and Roses and others, (yes, I mentioned him, Cobain, and not Nirvana that did not exist, that's why when we die we are left without this specific type of grunge, I already digressed, anyway) but yes, this Batman is doubly omniscient, an ego the size of Gotham City authorizes him (a) not only to -his first omniscience- speaking in the first person of himself when running the plot, that is to say in the events, \"I am revenge\" he says to the subway gang members, (scene that is not better than Todd Phillips' Koker subway, for give another example) that this happened -the first person- almost in all the other versions that precede it,it is also included here -its omniscience, obviously- dominating forensic or medical terms: \"eschimia\"? ask Batman of course!, but to (b), his second omniscience, being the narrator of his exploits in the first person, this again leads us to an Alan Moore influence but, with all due respect, as a clericot of Alan's genius Moore. When Batman wants to see the Penguin, he just has to be like the Penguin, appear in the doorway and announce himself, and please, for the fun of the plot, Batman almost spouts a sentence \"please tell me you won't let me in to unfold my money in the form of weapons hidden in my suit, and get in anyway. That is to say, the theatricality and the shadows of the bat, remained in the Babyboomer Generation or Generation X when the entrance was an \"appearance\" through shadows, suspicion and myth. The film is a complex mass because it is as if The Batman, The Batman 2 and 3 had been compressed and I am not only talking about the exhausting time of almost 3 hours, but also because of the number of common threads in which it was woven into a single feature film. For example, the plot increases its complexity first with a Riddler who is an anti-hero, because he indirectly helps Batman and the supposed common good and because of the premises that justify his murders, unmasking the big shots of the underworld at high levels of government, but later, arrested as Edward Nashton, he unmasks himself, that is, he turns himself in, sitting in that cafeteria just when, then yes, we will understand his \"fine\" intentions, and he becomes a true public order villain because he incites the revenge to the uncritical masses and followers of the disorder who have suffered or have resentments for any type of discrimination or corruption that they have suffered in Gotham city, (no more and no less than similar to the end of Todd Phillips' Joker);another complexity is with the cat The cat, I will not say Catwoman, who has her own drama for Kyle and at some point Batman leans on her, to spy on the Prosecutor and at least 2 times saves her from murdering her father Carmine Falcone and the his father's henchman. On the other hand, there is the added density or complexity of transcending and publishing the videos that show that the mother of Bruce Wayne, the mother of Batman had psychiatric problems in Arkham and hospitals and comes from a family that descendants who also had these difficulties and Thomas Wayne , trying to silence the journalist, he used the biggest thug Falcone. In other words, there is a possibility that Falcone, Catwoman's stepfather, is the one who murdered the Waynes that night because Batman's father was about to pity or denounce the next day that he only wanted to silence the journalist and NOT murder him as Falcone did. . In short, it is entertaining but poorly planned for a single feature film due to the enormous amount of detail that is handled.", "created_at": "2022-04-02T05:17:04.458Z"}, {"movie_id": 414906, "review_id": "624b1ff015a4a1006381e9cc", "author_rating": 6.0, "review_text": "OK, shoot me now - but you can tell when you are watching a film at the cinema and the audience start to get a bit restless. Well mine did with this overlong, and frankly rather dreary film. The opening few, somewhat dystopian, scenes reminded me of \"Blade Runner\" (1982) and we do hit the ground running. Amidst an hotly contested mayoral election, a chap in a gas mask (\"The Riddler\", we learn later) brutally takes out the sitting candidate enticing the \"Batman\" (Robert Pattinson) to come help his policeman pal \"Gordon\" (Jeffrey Wright) to investigate. Seems that the killer wanted that to happen because he leaves our caped crusader a card with a clue. Soon the great and the good of the city are dropping like flies and a web of corruption and deceit at the top echelons of government is emerging. Personally I found this all a bit dull. It flows terribly slowly, and after a while the relentless darkness and a really pretty soporific, moody, effort from Pattinson just started to bore me. There are loads of plot holes - not least just how the \"Riddler\" manages to pull off some pretty heavy duty crimes without having to scale any tall buildings, or sneak past the heavily guarded victims of his spree. The scenes with the completely unprotected DA (Peter Sarsgaard) in a dimly lit street are just plain daft. Colin Farrell is probably my highlight as the duplicitous \"Oz\", and Zoë Kravitz (\"Cat Woman”) offers us some decent acrobatics but otherwise, this is an hugely over-rated affair that has a serious paucity of dialogue, is heavily scored and during it's almost three hours, not enough actually happens. Indeed, it is very reluctant to let us leave. I will admit that my first guess at the ending was a bit optimistic, but it could conclude at least another four times before we are finally allowed to stretch our legs. It might look better second time around, but for now it's nothing at all to write home about.", "created_at": "2022-04-04T16:42:24.863Z"}, {"movie_id": 414906, "review_id": "625dd5e19ee0ef0050f5b825", "author_rating": 8.0, "review_text": "Good albeit not great, this newest incarnation of Batman is well done if not also incredibly dark. I did like Robert Pattinson's portrayal and didn't employ the annoying voice that kind of ruined The Dark Knight and more so, The Dark Knight Rises. As a whole though I did like the plot (parts inspired by The Long Halloween) and a good supporting cast, with Paul Dano giving a creepy performance as The Riddler and looking forward to seeing more from Zoe Kravitz's Selina/Catwoman. **4.0/5**", "created_at": "2022-04-18T21:19:29.046Z"}, {"movie_id": 414906, "review_id": "6263fd340b5fd60f76b801f1", "author_rating": 7.0, "review_text": "I am so tired of superhero movies. Still, being down with a mild case of Corona, I wanted something to watch that'd go down easy, and The Batman was available, so I picked it.\r\n\r\nI have to say that this, to me, is one of the rare superhero movies that appeal to me. And that's after having seen every other Batman movie since Tim Burton's 1989 one. And, I dare say, even with me being fed up with superhero movies, I think this is the best attempt.\r\n\r\nAt three hours, it feels like binge-watching a three-part miniseries. And by that I mean both that to the extent that it is three acts, they almost perfectly align with an hour each, and also that the pacing is great, and I never got bored.\r\n\r\nThe cast is excellent. Also, for the first time ever, I'm not thinking that it's ridiculous that no one recognizes Bruce Wayne as Batman. The half-mask actually makes Bruce Wayne unrecognizable. I'm not sure if they thought of that during casting, but it's really quite impressive.\r\n\r\nIt's also nice to not have to suffer through a pathetic attempt from Batman to make his voice sound cool. Oh dear, Christian Bale trying to look and sound cool was just so cringey. Robert Pattinson is by far the best Batman I've ever seen. The almost depressive mental torment he conveys does not come off as fake or pretension, and that's a first for the Batman franchise as far as I'm concerned.\r\n\r\nThe mood is bleak without being depressive, the score is fantastic, if a bit too much, the cinematography is amazing, I really have very little to fault here. If anything, it may come off as a little pretentious and self-indulgent, but that's also part of the attraction, and if I'm being completely honest, I think it's more to do with my own \"people need to grow up and stop watching these childish things\" prejudice I have, when in fact the 15-year-old inside of me f...ing loves it, and I need to embrace that childish part of me rather than hate on it.\r\n\r\nIf there's anything I would change about this movie, it's what I feel is somewhat of a PG-ification of Batman. I would love to see this movie with all its bleak desperation and lust for vengeance on the depravity and evil in the Gotham world, but with a seriously anti-hero, all-violent, bringer-of-death Batman. I would love to see him - in a more crude outfit, with less bells and whistles, and definitely without the cape - destroy, slay and kill, with exploration of the terrible aftermath it would bring, including the impact on his psyche, rather than the beat-up-and-let-go strategy that he is using in this movie. That part just feels to not align with both the doomish mood that sets the story and the seeming existential depression of our masked protagonist. I think that would warrant yet another installment in this franchise. I'm actually surprised how much meat there is on this character.\r\n\r\nAlso, if the movie overall is consistently a bit too much, the ending takes it one notch further on that scale.\r\n\r\nRegardless, I now have two superhero movies that I keep in my movie collection. The other is Watchmen (Director's Cut).\r\n\r\n1 star deducted for Catwoman being racist without it being presented as a problem. The casting of her is perfect, by the way. Much better than Michelle Pfeiffer.", "created_at": "2022-04-23T13:20:52.161Z"}, {"movie_id": 414906, "review_id": "62690f5d38765101658093c5", "author_rating": 8.0, "review_text": "Oh boy, yet another review here on TMDB about this movie. What is it about comic books that garners so much interest? I am no longer a comic hero fan, either in movies or the source comic books. I have seen some of the Marvel series and the only one that I would watch multiple times if it came across my screen in Ant Man and the Wasp, with its wit, action and humor.\r\n\r\nI did read superhero comics as a kid, however. I stuck to DC comics. I especially liked the Legion of Superheroes, though I also read the Justice League, Superman and Batman. This was the Silver Age of comics, I believe, before they restarted and complicated the field with reimagining the comic universe (or whatever it is they did).\r\n\r\nAnyway, I was a DC boy so I gave The Batman a look see. It is a dark film, both in its themes and its camera work. No wit and humor to speak of here, just grim and introspective comic book noir. But it was intriguing and interesting enough to hold only my attention. There were a couple of interesting twists on traditional Batman villains, for example. As with a lot of current thrillers, there is quite a body count, when sometimes with violence, I think less can be more.\r\n\r\nIt is not a film I will watch multiple times or anxiously await a sequel for, but I do not regret the time spent watching it.", "created_at": "2022-04-27T09:39:42.003Z"}, {"movie_id": 414906, "review_id": "626c2f9f35811d005015ae2f", "author_rating": 10.0, "review_text": "_The Batman_ is the best live-action Batman movie yet. It's the type of Batman film I've been waiting for my whole life.\r\n\r\nIt's dark and realistic, but also stylish and large-scale. It's not limited by a commitment to realism like the Dark Knight trilogy, nor is it burdened by a shared universe like the DCEU. It is its own thing. A moody, disturbing, visually stunning, David Fincher-inspired, three hour long detective epic with some of the best interpretations of the characters ever put on screen.\r\n\r\nRobert Pattinson is fantastic as a younger, moodier, and yes, more emo Batman. Paul Dano is straight up terrifying as the Riddler. Colin Farrell is unrecognisable in more ways than one as The Penguin and Zoë Kravitz is easily my favorite live-action Catwoman. Massively underrated is john Turturro as Carmine Falcone.\r\n\r\nThis movie kept me hooked all the way through. It's almost three hours long but it feels like two.\r\n\r\nThis is the best Batman movie. The Dark Knight is good and all, but Reeves finds the perfect mix of gritty realism and style (Nolan would never even dare to have a snorricam shot of Batmam gliding over the city), and finally gives us a live-action Batman that lives up to the title of \"World's Greatest Detective\". Not that there's much competition, since he's like the only one to actually do any detective work (no, Christian Bale magically finding a fingerprint on a broken bullet doesn't count).", "created_at": "2022-04-29T18:34:07.252Z"}, {"movie_id": 414906, "review_id": "626c76a0245dbe004f431b50", "author_rating": null, "review_text": "The movie was one of the best Batman movies in my opinion, but, I honestly didn't like thus portrayal of Batman. This didn't feel like Batman, more like BatDude. Like a man in real life that grew up watching Batman and decided to fight crime under his name. Overall it is definitely worth the watch!", "created_at": "2022-04-29T23:37:04.585Z"}, {"movie_id": 414906, "review_id": "62bdfb3c8d2f8d006117ac09", "author_rating": 10.0, "review_text": "Batman returns back to its detective roots, and it is a breath of fresh air. Robert Patterson is stunning as Batman. The twists and turns the new Riddler take is a fun ride.\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-06-30T19:36:28.614Z"}, {"movie_id": 414906, "review_id": "62f8f48d258823007f6074ce", "author_rating": 4.0, "review_text": "To be honest, this is a really good movie. Hang on? So why did I only give it 2 out of 5 stars? Well, this is really personal but, to me, it is not a good Batman movie. I really had problems writing this review because it is a very good movie. I just did not like it as a Batman movie.\r\n\r\nThe movie is really dark, gritty and noir. Not really a problem. It works for some movies. But it is also quite slow at the beginning and the first quarter of the movie was actually boring. Remember, this is a three hour movie so a quarter is more than half an hour of “boringness”.\r\n\r\nThe “boringess” was broken up by a pretty cool car chase. Some people seem to not really like the batmobile and I have to say that it was not very inspired but it was not all bad either. Unfortunately the movie turned rather boring for a while again after that.\r\n\r\nThe movie tries to bring out more of the detective part of Batman than the previous movies, which is fine, but there is just too much moping around with Batman / Bruce Wayne walking around oozing sadness all around him.\r\n\r\nActually, this brings us to my main gripe with this movie. The choice of actor for the Batman is just wrong for me. He is more like a sad puppy than the Batman. The script that makes him mope around, have emotional outbreaks and, occasionally, being downright stupid like just staring dumbfounded when explosives go off in his face does not really help of course.\r\n\r\nTo me the Selina Kyle character had more charisma than the Batman, especially when the Batman was in his Bruce Wayne alter ego.\r\n\r\nAnd I really, really dislike that twist about Bruce’s parents. That was such a lazy Hollywood writer hack thing to do just to create (unwanted) drama.\r\n\r\nThen we have the Riddler. Compared to the charismatic villains that we have come to expect he is just a sad little psychopath with a bunch of equally sad fanatical internet followers.\r\n\r\nNow, all of this would have worked great if it had been a movie about some, unspecified, vigilante. The movie is really well done. The detective story, the action (especially towards the end) and the noir setting would have worked great. Even at its three hour bloated length it would have been great although cut down to two hours or a bit more would have been even better. If it had not been a Batman movie!", "created_at": "2022-08-14T13:11:41.626Z"}, {"movie_id": 414906, "review_id": "630996ce6e938a007bf1f5fe", "author_rating": 5.0, "review_text": "The Batman is not a terribly bad movie, but it would be twice as good if it were half as long. How a film that likes to take shortcuts – especially with the Riddler’s ‘riddles’ – can still take almost three hours to get to where it’s going, I haven’t the foggiest (but then this is a rather strange enterprise that gives us Andy Serkis in the flesh and covers Colin Farrell in prosthetic makeup and a fat suit). Director/co-writer Matt Reeves very wisely avoids origin stories and takes for granted relationships, which have already been well established in a decades-long canon, between certain characters; on the other hand, he allows his movie to become bogged down at the halfway point in a deluge of backstory.\r\n\r\nThe obvious problem is that there is enough material here for at least two films, and Reeves attempts to cram it all into a single one. Why? We all know there are going to be sequels, so why not save some for the next chapter? Or better yet, why not leave some of it on the cutting room floor? There is absolutely no reason for the Penguin to be in this movie; he might as well be the Imperceptible Man (an actual Batman villain, mind you) for all that he’s given to do. Catwoman has been pretty much played out, and as far as the Riddler, I can’t believe I’m going to say this, but Jim Carrey did a much better job with the role than does Paul Dano – an otherwise fine actor that inexplicably chose to play the character as the bastard child of Heath Ledger’s Joker and Tom Hardy’s Bane. That leaves Carmine Falcone (John Turturro), who provides the most intriguing plot points; why not make him the main, or even – dare I say it – only villain?\r\n\r\nNow, The Batman is long enough to try the patient of a saint, but at least it’s great to look at. Like the first Tim Burton Batman (as described by the unerring Roger Ebert), it “is a triumph of design over story, style over substance - a great-looking movie with a plot you can’t care much about.” Gotham City in particular is a winning combination of Burton’s faux noir texture and Christopher Nolan’s plausible architecture. The best scenes involve Batman (Robert Pattinson) and Jim Gordon (Jeffrey Wright) – and indeed Pattinson has an uncanny knack for playing off veteran character actors – as a sort of pre-Robin dynamic duo; their adventures are poignant because they appear to happen in the real world, or at least as real as a world can be wherein a grown man disguises himself as a giant bat (compare last year’s Zack Snyder's Justice League, with its unending CGI assault on the senses).", "created_at": "2022-08-27T04:00:14.031Z"}, {"movie_id": 414906, "review_id": "630a77c232489b007b74ba64", "author_rating": 3.0, "review_text": "This was the worst Batman I have ever seen. \r\n\r\nFirstly, Robert Pattinson was the worst choice for the Batman role. In Twilight he was alright, but in Batman he definitely failed. He was more like a sad, depressed goth kid with no emotions. He tried too much to fit the role, but in fact we got this depressive, dead and empty Batman. \r\n\r\nSecondly, there were other small things that sucked about this movie, for example, Cat Woman had a very simple and stupid mask. Even older movie versions had a better mask than here. Batman's batmobile also sucked. Looked like a downgraded version. He also rode just a simple bike and lastly, he couldn't even glide with his default Batman suit. Also, don't know why but James Gordon was played by a black actor, while in every movie and even in every game this character is white. Riddler character also seemed stupid, wearing stupid mask and acting stupid and wasn't intimidating at all, but laughable. So, in general cast and acting was disappointing in this movie.\r\n\r\nLastly, the movie itself... It was dull, boring and depressive. They tried to make it masterpiece with 3 hours long, but in reality movie became just plain boring and I almost fell asleep. \r\n\r\nOverall verdict: Disappointing.", "created_at": "2022-08-27T20:00:02.284Z"}, {"movie_id": 414906, "review_id": "631fa64258efd30084737214", "author_rating": null, "review_text": "After spending most of today struggling to edit, this was such a cool way to spend my evening. Big theater, fantastic film. \r\n\r\nOutstanding visuals, dreamy atmosphere, great cast, and pitch-perfect action. Giacchino’s amazing score is just the cherry on top. A few of its elements (mostly the central mystery) can feel too muddy at times, but if this is any sort of indication of the quality of 2022 films, color me excited.", "created_at": "2022-09-12T21:36:02.504Z"}, {"movie_id": 414906, "review_id": "648f612542bf0100c7fc1397", "author_rating": 5.0, "review_text": "Next too batman and Robin this has to be the 2nd most dumbest batman movie ever made. Robert Patterson made an alright batman but completely sucked at being Bruce Wayne. When he was Bruce Wayne it was like watching the twilight movies. I've never seen Bruce act like that all suspicious and looking like a dam criminal. Like wtf happened on this Batman it was horrible. Also like little to no action really at all. Catwoman was garbage. The penguin looked like a human almost like 2 face. And last but not least the riddler looked like the guy from my bloody valentine. Not only did they completely butcher the film but but they butchered the characters as well. I don't understand why this movie has such good ratings. It was the most boring batman I've ever seen. They should just stop making these. This is the 6th different batman actor and its getting worse. If you can't keep the same batman then just give up already. Obviously everyone hates playing batman since no one ever wants to keep playing him.", "created_at": "2023-06-18T19:55:17.389Z"}, {"movie_id": 414906, "review_id": "621d02856b5fc2006b954bab", "author_rating": null, "review_text": "“The Batman” Is A Very Engaging And Unforgettable Tale That Is One Of The Best Adaptations Of The Character Ever\r\n\r\nIn 1989 Michael Keaton was seen as a very controversial choice to wear the Cowl of Batman but soon proved his doubters wrong by turning “Batman” and its subsequent sequel “Batman Returns” into massive Box Office success before leaving the cape behind.\r\n\r\nWhile four other actors have taken up the cinematic version of the character in the subsequent years, Keaton has remained for many the Gold Standard with Christian Bale likely being his biggest rival.\r\n\r\nWhen Robert Pattinson was named as the new Batman, there was interest but concern as an actor who is largely known for playing Edward in the “Twilight” films seemed to be an odd choice. However, I would say that anyone who has seen some of his recent work including his performance in “The Lighthouse” would be playing him a disservice by saying he was not up to the part.\r\n\r\nIn “The Batman”, audiences are given a darker and more broken Bruce Wayne, an Emo recluse who is far from the Socialite he has been portrayed as for decades and a very sullen and withdrawn individual who does not exude charm or grace and even shows issues making eye-contact.\r\n\r\nWhen the Mayor of Gotham is killed shortly before the election by a mysterious individual known as “The Riddler” (Paul Dano), the vigilante known as “The Batman” is called in to help the police by Lt. James Gordon (Jeffrey Wright).  Gordon has been working with Batman for some time but it is clear that his association with him has not won him any favors with his fellow officers, many of which openly question his use and involvement in the crime scenes.\r\n\r\nFurther complicating matters are clues left at the various crime locales that are addressed to The Batman and cause many to believe that he may be working with the very killer they are attempting to stop.\r\n\r\nAs the investigation unfolds, the seedy side of Gotham City comes to light in the form of a missing girl who was photographed with the married Mayor and may well be the key to the investigation. Her disappearance leads her friend Selina Kyle (Zoe Kravitz), to take on her Catwoman persona and delve deep into an underworld that features deadly individuals ranging from Carmine Falcone (John Turturro), and The Penguin (Colin Farrell), amongst others as she and the Batman conduct their own investigations that at times overlap and further complicate matters.\r\n\r\nAs the body count rises and Batman races to find the true method behind the madness of The Riddler, the tone becomes darker and more sinister in a deadly race against time.\r\n\r\nThe film eschews the usual abundance of action sequences and glossy special effects which are common for Comic Book related films and instead gives audiences a slow-burning murder mystery that holds your attention from start to finish over its three-hour run time.\r\n\r\nThe dark and foreboding tone of the film is brought home by the haunting and sharp piano keys of the film’s theme that permeates the film and punches home that this is a film clearly aimed at a more adult audience.\r\n\r\nPattinson does a great job showing the deeply broken individual that is behind the mask and that Batman is the only form of escape or therapy that Bruce Wayne has due to his insistence on saving a city that many argue cannot be saved. He has strained his relationship at times with Alfred (Andy Serkis), caused damage to the financial stability and reputation of the family company in his quest for vengeance and justice, and has become a bitter and broken recluse in doing so. In many ways, it could be argued that his only socialization with others is as The Batman and his single-minded obsession is chilling to watch.\r\n\r\nPattinson also handles the action sequences well as the film spaces them out to put the emphasis more on the man than the gadgets as they are kept to a minimum even during a thrilling chase with the new version of The Batmobile.\r\n\r\nThe strong supporting cast works well with the film and Paul Dano gives a very compelling and disturbing version of his character which makes the film even darker and more engrossing.\r\n\r\nDirector Matt Reeves has crafted a dark and foreboding tone and visual style as a good portion of the film takes place in the darkness and his screenplay is not afraid to take chances by putting the emphasis on the characters and their flaws versus an abundance of action and effects.\r\n\r\nI found this version of the character and interpretation more engrossing than prior versions of the film as the bold move to do a slow-burning and dark murder mystery versus an effect-laden action film reminded me of some of the better Batman stories such as Batman: The Killing Joke or Batman: The Long Halloween.\r\n\r\nThe film is not going to be for everyone, especially younger viewers and some may take issue with the casting choices, but their performances shine and as such, “The Batman” was a very engaging and unforgettable tale that for me serves as one of the best adaptations of the character ever.\r\n\r\n4 stars out of 5", "created_at": "2022-02-28T17:12:37.932Z"}, {"movie_id": 414906, "review_id": "6222823ee258600046cc75b8", "author_rating": 8.0, "review_text": "The reviews and hype for this movie were massive!  Comparisons to The Dark Knight got my expectations high... probably a little too high.  I was expecting to be blown away and was not but even with that being said The Batman is an exceptional film.  The cinematography and visuals are stunning.  Matt Reeves made some genius creative choices among which were the more reclusive rockstar grungy Bruce Wayne and the Riddler being heavily influenced by the Zodiac.  The acting was fantastic as well with Zoe Kravitz and Paul Dano offering some standout performances.  The Batman is driven with psychological and mystery focus as compared to the action comedy style of most superhero movies.  My only complaint is that the mystery felt fairly predictable.  I wasn't surprised by any of the twists and turns.  Ultimately, this was a wonderful addition to the Batman franchise and I can't wait to see where it goes next.", "created_at": "2022-03-04T21:18:54.608Z"}, {"movie_id": 414906, "review_id": "6222973641aac4006c764e55", "author_rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-batman-spoiler-free-review\r\n\r\n\"The Batman deserves all the hype it generated and then some. Matt Reeves delivers a distinctly darker, more intense, frighteningly realistic noir thriller than past adaptations, with an aggressively vengeful Bruce Wayne / Batman and a fear-inducing, mysterious, lunatic Riddler.\r\n\r\nGreig Fraser's cinematography - bone-chilling \"ins-and-outs\" of Batman and stunning footage of Gotham - and Michael Giacchino's score - genuinely addictive, elevates the entire film - make this adaptation the best-looking and best-scored cinematic version of the Batman ever.\r\n\r\nEven with the narrative focus on the detective work, the action sequences are exhilarating and beautifully shot. The entire cast is extraordinary, especially Paul Dano and Robert Pattinson - the latter destroys all skepticism around his talent.\r\n\r\nApart from a short period at the end of the second act, the three hours fly by. It's one of the best movies of the year and a fair contender in the debate of best comic book movie of all-time.\"\r\n\r\nRating: A", "created_at": "2022-03-04T22:48:22.045Z"}, {"movie_id": 414906, "review_id": "62241381b84f940045446a10", "author_rating": 5.0, "review_text": "Paul Dano and Colin Farrell are extraordinary, but _The Batman_ is a three hour slog through Gotham that culminates with an over exaggerated riddle that isn’t worth solving. Having Batman and Jim Gordon both speak in raspy, whispery grunts feels excessive as does Gordon’s insistence on calling Batman, “Chief,” every time that they’re together. The film deserves credit for prominently shining the spotlight on the underbelly of crime in Gotham, but the storytelling in _The Batman_ is a lot like Bugs Bunny meaning to have taken that left turn at Albuquerque; a meandering foray down a dark rabbit hole that isn’t entirely necessary.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Batman-2022-Review-When-is-a-Bat-Not-Quite-a-Bat", "created_at": "2022-03-06T01:50:57.237Z"}, {"movie_id": 414906, "review_id": "622a1faa63aad20018c0b378", "author_rating": 10.0, "review_text": "Masterpiece. Best DC film yet", "created_at": "2022-03-10T15:56:26.941Z"}, {"movie_id": 414906, "review_id": "62307df10ed2ab0045ed6b4d", "author_rating": 10.0, "review_text": "_**\"Our scars can destroy us, even after the physical wounds have healed. But if we survive them, they can transform us. They can give us the power to endure, and the strength to fight.\"**_\r\n\r\nEver since it was announced that Matt Reeves was going to direct The Batman after Ben Affleck stepped down for personal reasons, I had no doubt he was going to put on one hell of a masterpiece. This is the definitive live-action Batman. An epic 3-hour film noir that delves deep into comic lore of Gotham City.\r\n\r\nRobert Pattinson perfectly embodies both Bruce Wayne and Batman. I love the character arc he goes through, realizing Gotham doesn't need vengeance to heal, but hope. Zoë Kravitz plays a phenomenal Selina Kyle, you actually feel her emotions throughout the movie. Another plus is that she actually feels integral to the plot (unlike The Dark Knight Rises). Paul Dano is a terrifyingly realistic interpretation of The Riddler, using the internet to gain a fan base for his sick games. Andy Serkis plays an excellent Alfred, being Bruce's emotional support during Dark times.\r\n\r\nThe soundtrack by Michael Giacchino is absolute God-Tier. Elevating every scene with emotion and sometimes dread. Finally a score to rival Danny Elfman's iconic score. Matt Reeves direction is impeccable as always, getting some nice shots while also making it feel nice and claustrophobic around Batman.\r\n\r\nOverall, a God-Tier Batman movie that I can't wait for the Cinematic Universe that's being made around it as I type this.", "created_at": "2022-03-15T11:52:17.425Z"}, {"movie_id": 414906, "review_id": "6233ec8303bf84001c6cb00d", "author_rating": 9.0, "review_text": "It's a cracker, no doubt about it!\r\n\r\nMatt Reeves did a great job with 2022's <em>'The Batman'</em>. It's difficult not to compare this to other Batman films, though that's DC/Warner Bros. fault for featuring him so much in recent times. I'll get this out the way early: I'd say <em>'<a href=\"https://letterboxd.com/film/batman-begins/\" rel=\"nofollow\">Batman Begins</a>'</em>/'<a href=\"https://letterboxd.com/film/the-dark-knight/\" rel=\"nofollow\">The Dark Knight</a>'</em> are superior, not by much, which is a similar case for the character performances too.\r\n\r\nRobert Pattinson is a terrific Bruce Wayne, though Christian Bale still edges him out in my eyes. Zoë Kravitz is probably the best Catwoman I've seen, though the rest - from the Riddler to Penguin to Alfred - have been portrayed better; aside from Commissioner Gordon, with Jeffrey Wright being excellent. Paul Dano is the least enjoyable performer, for me, here, I found his showing to be a bit 'meh' - effective, but meh. Barry Keoghan makes a cameo, I won't say as who, but I don't hold high hopes for him in that role; though, <a href=\"https://variety.com/2022/film/news/the-batman-ending-joker-barry-keoghan-matt-reeves-1235196812/#:~:text=While%20it%20may,more%20%E2%80%9CBatman%E2%80%9D%20movies.\" rel=\"nofollow\">apparently</a> it won't be anything that happens anyway. For the best!\r\n\r\nAnyway... the above sounds <em>way</em> too negative - as I did thoroughly and absolutely enjoy this film, hence the very positive rating. The pacing is very good, the cinematography is brilliant (Gotham looks fantastically bleak!), the story is engrossing and the dialogue is on point. The scenes with Pattinson/Kravitz and Pattinson/Wright are my favourite moments. It's a film that I'd consider as 'outstanding'.\r\n\r\nIt'll be cool to see what Reeves does with this trilogy (should it happen, of course).", "created_at": "2022-03-18T02:20:51.206Z"}, {"movie_id": 414906, "review_id": "624085464cbe12005d584bd9", "author_rating": 8.0, "review_text": "I like how Batman is depicted with a naive and loser POV from his rich high tower, a rich trust fund baby called out by both sane (Catwoman) and insane (Riddler) people while he remains oblivious until the consequences are literally flooding the city. While he uses the idea of Batman as a mantle for him to process trauma, his obliviousness to his own celebrity status and image creates unintentional side effects from his parents' death hogging the spotlight away from the people that mattered to his own nebulous idea of \"vengeance\" being co-opted by the goons, a heel-turn realization that eventually changes the rack focus, ultimately leading to a wider perspective and a selfless act of cutting the cord and helping others. Hope is more important than his idea of justice, in the end, empathy being the missing piece throughout. Instead of being a voyeur like Riddler during his master plan (Riddler binoculars on the mayor, Batman binoculars on Catwoman), he switches to being on the ground to help, no longer from his high castle.\r\n\r\nIt's interesting how this arc plays out. At the beginning, it plays into this \"badass\" idea comic book fans love to gloat about Batman of striking fear into crime, but the way it's portrayed is frightening to everyone. It's a better criticism of Batman's fascism than BvS was going for, showcasing his fear to people who don't even deserve it, such as kids doing vandalism who probably believe the system is failing them, but to him at the beginning crime all looks the same.\r\n\r\nHonestly this film goes harder than Phantasm on the tragedy that is Bruce Wayne. They're inseparable by choice, to the point that Bruce basically is Batman even when not in the costume, a social recluse who can barely function in real life, listening to emo music and having rings around his eyes, a night owl to the extreme. The struggle is there even as Batman, literally smashing his face on a truck.\r\n\r\nThere are some contradictions throughout thematically, however. It's weird how it goes between \"it's the WHOLE system, all cops are pigs\" to \"it's just bad apples\" simultaneously, displaying a somewhat cringe centrism. Catwoman by the end basically points it more to systemic (and Batman and Thomas Wayne's criticism of thinking they know better and actually makings things worse isn't undercut, which by itself is also institutional criticism), although it still feels like they could've done more. Maybe out of their hands by the studio or this as far as they could get away with vs. the producers (it almost felt like a struggle for Catwoman to outline her \"eat the rich\" mentality). Gotham itself is a mess of contradictions and it's OK to let the viewer lie between it all I guess.\r\n\r\nAlso the relationship between Catwoman and Batman is kinda slimy and male-centric. Catwoman, while great as a character, functionally falls to Batman's controlling force with a forced romance in the second act. Sure they're both suffering from trauma but Batman was literally using her despite it all, it at least understands the power gap more in the third act.\r\n\r\nThe end of the second act also spins its wheels a bit too much, the mystery pace kinda suffers a bit from focus and scenes get too drawn out (Riddler just disappears for a while). The movie could've been 20 minutes shorter. Doesn't stop it from having a terrific third act since most blockbusters have kinda sucked on that note\r\nAlthough speaking of Riddler, master class. Probably my favorite villain in a Batman film. \r\n\r\nThe aesthetic was gorgeous. I love its color grading and architecture, still thinking of the Wayne tower and its metal grates, goth hallways, and insane attention to detail that gets blurred out intentionally in the frame for most of the movie by Bruce's obliviousness to the world. It also keeps a balance of evoking the black/white movies while still being colorful, more of flooded black and oranges. I think of that sequence with Penguin not mainly for the fight itself (which to me was a bit messy) but moreso the flooded orange of the fire being the only color creating a sorta gradient on the black car, and how the flare at the end matches that aesthetic, that one color illuminating Batman leading everybody else to exit the frame, like a light in the darkness. Lovely\r\n\r\nThe music.... Giacchino just beat out his Incredibles score for me, masterful work with motifs, percussion, and rhythm. His mastery of percussion and horns during the lights out Batman hallway fight and how the horns blast, how well edited the percussion beat subtly goes through the Penguin chase and other fight sequences, Batman doesn't quite have a dance like Hong Kong films but the music makes it come close. The timpani and strings are so well used!!! Great use of Ave Maria both as soundtrack and score. Catwoman's motif? Amazing.\r\n\r\nThe performances are great all around. Finally a film with Turturro that I don't hate him. He's well restrained and perfectly cast, his dickish attitude now a strong point making him very memorable with very little screen time, much like Farrell in the same film. Kravitz made me the closest to tearing up with how she visually handles conflicting emotions, I still think about that scene with the voicemail where her eyes are all over the place and has trouble keeping it all together. Dano as Riddler is terrific.\r\n\r\nYep, this is my fav Batman film now.", "created_at": "2022-03-27T15:39:50.559Z"}, {"movie_id": 414906, "review_id": "62473bdefd6fa1004e5031e7", "author_rating": 10.0, "review_text": "This film is so intricate, there's so many details, things you can obverse on multiple watches and not have noticed on your first. There's a lot of things that just aren't spoken that give this film so much substance. So many layers and nuanced story telling. Gotham City feels as it should, as it's own character and a visceral cesspool of corruption and just dirt. It feels dirty, unpolished... it's amazing.\r\n\r\nThere's so many shots in this film that are just simply breathtaking and intentionally dirty. It helps capture this visceral tone and fits substantially well with the universe of Batman.\r\n\r\nBeing a diehard fan of Batman for, like, pretty much all of my life- I have to say; Matt Reeves absolutely nailed it with a completely faithful adaptation of Batman. Not once in this movie did he do something I felt was completely out of character and Robert Pattinson solidified the performance of both Bruce Wayne and the Batman. I love Matt Reeves went to the extent to make sure this Batman doesn't kill, as other directors have seem to give less care to. Yes, even Nolan. It should have to go without saying that Batman does not kill, that's a no-brainer, but for decades this has been a problem in Batman films... and finally, it no longer is a problem. That's how you do it.\r\n\r\nBringing this review to a conclusion, this is easily my favourite Batman film. So many things about this film just feel like it's pulled straight out of a comic book. I mean, Riddler flooding the city itself is pulled straight from Zero Year and there's so many nods to comic moments and members of Batman's rouges gallery. Matt Reeves knew what he was doing, and he crafted this film for diehard Batman fans, succeeding immensely. Can't wait to see more of this universe.", "created_at": "2022-04-01T17:52:30.345Z"}, {"movie_id": 414906, "review_id": "6247dc50014325004eb6cfe2", "author_rating": 6.0, "review_text": "> Enormous mass that is per se a riddle. Forget screenplay, it's a comic storyboard; Do you remember Rorschach, from Moore's Watchmen, ruminating in the sewers?, ok, transpolate Batman and it works! No way, here I go-monologue and comic dialogues (effective and practical like instant soup, with 2 percent protein), comic narration, that is functional, utilitarian, Bentham would say, with the ellipses and any speech or reasoning that requires 2 minutes of reflection, at most!, \"\"this whole city´s gonna come apart\" says a District Attorney, scenic cuts and messy complexity...-entertaining but messy-comic, etc, ...it is a comic turned into a movie by someone who - I'm speculating, any resemblance to reality is purely by chance - was advised or made, or made comics in his life, don't you believe me? Ellipsis of all ellipses: \"Alfred, you're not my father \"At 23 minutes of tape, all the conflict of identity and belonging, as well as the purpose of the hero, under the sieve of the most selfish and mean son of millionaires, but let's forget this, let's continue. A Batman beating Kurt's velvety drum Cobain, -didn't tell the subversive c revolutionary adence of Cobain, to think like that I would have to know that grunge swept hardrock -finally in the 90s- and buried Motley Crue, Guns and Roses and others, (yes, I mentioned him, Cobain, and not Nirvana that did not exist, that's why when we die we are left without this specific type of grunge, I already digressed, anyway) but yes, this Batman is doubly omniscient, an ego the size of Gotham City authorizes him (a) not only to -his first omniscience- speaking in the first person of himself when running the plot, that is to say in the events, \"I am revenge\" he says to the subway gang members, (scene that is not better than Todd Phillips' Koker subway, for give another example) that this happened -the first person- almost in all the other versions that precede it,it is also included here -its omniscience, obviously- dominating forensic or medical terms: \"eschimia\"? ask Batman of course!, but to (b), his second omniscience, being the narrator of his exploits in the first person, this again leads us to an Alan Moore influence but, with all due respect, as a clericot of Alan's genius Moore. When Batman wants to see the Penguin, he just has to be like the Penguin, appear in the doorway and announce himself, and please, for the fun of the plot, Batman almost spouts a sentence \"please tell me you won't let me in to unfold my money in the form of weapons hidden in my suit, and get in anyway. That is to say, the theatricality and the shadows of the bat, remained in the Babyboomer Generation or Generation X when the entrance was an \"appearance\" through shadows, suspicion and myth. The film is a complex mass because it is as if The Batman, The Batman 2 and 3 had been compressed and I am not only talking about the exhausting time of almost 3 hours, but also because of the number of common threads in which it was woven into a single feature film. For example, the plot increases its complexity first with a Riddler who is an anti-hero, because he indirectly helps Batman and the supposed common good and because of the premises that justify his murders, unmasking the big shots of the underworld at high levels of government, but later, arrested as Edward Nashton, he unmasks himself, that is, he turns himself in, sitting in that cafeteria just when, then yes, we will understand his \"fine\" intentions, and he becomes a true public order villain because he incites the revenge to the uncritical masses and followers of the disorder who have suffered or have resentments for any type of discrimination or corruption that they have suffered in Gotham city, (no more and no less than similar to the end of Todd Phillips' Joker);another complexity is with the cat The cat, I will not say Catwoman, who has her own drama for Kyle and at some point Batman leans on her, to spy on the Prosecutor and at least 2 times saves her from murdering her father Carmine Falcone and the his father's henchman. On the other hand, there is the added density or complexity of transcending and publishing the videos that show that the mother of Bruce Wayne, the mother of Batman had psychiatric problems in Arkham and hospitals and comes from a family that descendants who also had these difficulties and Thomas Wayne , trying to silence the journalist, he used the biggest thug Falcone. In other words, there is a possibility that Falcone, Catwoman's stepfather, is the one who murdered the Waynes that night because Batman's father was about to pity or denounce the next day that he only wanted to silence the journalist and NOT murder him as Falcone did. . In short, it is entertaining but poorly planned for a single feature film due to the enormous amount of detail that is handled.", "created_at": "2022-04-02T05:17:04.458Z"}, {"movie_id": 414906, "review_id": "624b1ff015a4a1006381e9cc", "author_rating": 6.0, "review_text": "OK, shoot me now - but you can tell when you are watching a film at the cinema and the audience start to get a bit restless. Well mine did with this overlong, and frankly rather dreary film. The opening few, somewhat dystopian, scenes reminded me of \"Blade Runner\" (1982) and we do hit the ground running. Amidst an hotly contested mayoral election, a chap in a gas mask (\"The Riddler\", we learn later) brutally takes out the sitting candidate enticing the \"Batman\" (Robert Pattinson) to come help his policeman pal \"Gordon\" (Jeffrey Wright) to investigate. Seems that the killer wanted that to happen because he leaves our caped crusader a card with a clue. Soon the great and the good of the city are dropping like flies and a web of corruption and deceit at the top echelons of government is emerging. Personally I found this all a bit dull. It flows terribly slowly, and after a while the relentless darkness and a really pretty soporific, moody, effort from Pattinson just started to bore me. There are loads of plot holes - not least just how the \"Riddler\" manages to pull off some pretty heavy duty crimes without having to scale any tall buildings, or sneak past the heavily guarded victims of his spree. The scenes with the completely unprotected DA (Peter Sarsgaard) in a dimly lit street are just plain daft. Colin Farrell is probably my highlight as the duplicitous \"Oz\", and Zoë Kravitz (\"Cat Woman”) offers us some decent acrobatics but otherwise, this is an hugely over-rated affair that has a serious paucity of dialogue, is heavily scored and during it's almost three hours, not enough actually happens. Indeed, it is very reluctant to let us leave. I will admit that my first guess at the ending was a bit optimistic, but it could conclude at least another four times before we are finally allowed to stretch our legs. It might look better second time around, but for now it's nothing at all to write home about.", "created_at": "2022-04-04T16:42:24.863Z"}, {"movie_id": 414906, "review_id": "625dd5e19ee0ef0050f5b825", "author_rating": 8.0, "review_text": "Good albeit not great, this newest incarnation of Batman is well done if not also incredibly dark. I did like Robert Pattinson's portrayal and didn't employ the annoying voice that kind of ruined The Dark Knight and more so, The Dark Knight Rises. As a whole though I did like the plot (parts inspired by The Long Halloween) and a good supporting cast, with Paul Dano giving a creepy performance as The Riddler and looking forward to seeing more from Zoe Kravitz's Selina/Catwoman. **4.0/5**", "created_at": "2022-04-18T21:19:29.046Z"}, {"movie_id": 414906, "review_id": "6263fd340b5fd60f76b801f1", "author_rating": 7.0, "review_text": "I am so tired of superhero movies. Still, being down with a mild case of Corona, I wanted something to watch that'd go down easy, and The Batman was available, so I picked it.\r\n\r\nI have to say that this, to me, is one of the rare superhero movies that appeal to me. And that's after having seen every other Batman movie since Tim Burton's 1989 one. And, I dare say, even with me being fed up with superhero movies, I think this is the best attempt.\r\n\r\nAt three hours, it feels like binge-watching a three-part miniseries. And by that I mean both that to the extent that it is three acts, they almost perfectly align with an hour each, and also that the pacing is great, and I never got bored.\r\n\r\nThe cast is excellent. Also, for the first time ever, I'm not thinking that it's ridiculous that no one recognizes Bruce Wayne as Batman. The half-mask actually makes Bruce Wayne unrecognizable. I'm not sure if they thought of that during casting, but it's really quite impressive.\r\n\r\nIt's also nice to not have to suffer through a pathetic attempt from Batman to make his voice sound cool. Oh dear, Christian Bale trying to look and sound cool was just so cringey. Robert Pattinson is by far the best Batman I've ever seen. The almost depressive mental torment he conveys does not come off as fake or pretension, and that's a first for the Batman franchise as far as I'm concerned.\r\n\r\nThe mood is bleak without being depressive, the score is fantastic, if a bit too much, the cinematography is amazing, I really have very little to fault here. If anything, it may come off as a little pretentious and self-indulgent, but that's also part of the attraction, and if I'm being completely honest, I think it's more to do with my own \"people need to grow up and stop watching these childish things\" prejudice I have, when in fact the 15-year-old inside of me f...ing loves it, and I need to embrace that childish part of me rather than hate on it.\r\n\r\nIf there's anything I would change about this movie, it's what I feel is somewhat of a PG-ification of Batman. I would love to see this movie with all its bleak desperation and lust for vengeance on the depravity and evil in the Gotham world, but with a seriously anti-hero, all-violent, bringer-of-death Batman. I would love to see him - in a more crude outfit, with less bells and whistles, and definitely without the cape - destroy, slay and kill, with exploration of the terrible aftermath it would bring, including the impact on his psyche, rather than the beat-up-and-let-go strategy that he is using in this movie. That part just feels to not align with both the doomish mood that sets the story and the seeming existential depression of our masked protagonist. I think that would warrant yet another installment in this franchise. I'm actually surprised how much meat there is on this character.\r\n\r\nAlso, if the movie overall is consistently a bit too much, the ending takes it one notch further on that scale.\r\n\r\nRegardless, I now have two superhero movies that I keep in my movie collection. The other is Watchmen (Director's Cut).\r\n\r\n1 star deducted for Catwoman being racist without it being presented as a problem. The casting of her is perfect, by the way. Much better than Michelle Pfeiffer.", "created_at": "2022-04-23T13:20:52.161Z"}, {"movie_id": 414906, "review_id": "62690f5d38765101658093c5", "author_rating": 8.0, "review_text": "Oh boy, yet another review here on TMDB about this movie. What is it about comic books that garners so much interest? I am no longer a comic hero fan, either in movies or the source comic books. I have seen some of the Marvel series and the only one that I would watch multiple times if it came across my screen in Ant Man and the Wasp, with its wit, action and humor.\r\n\r\nI did read superhero comics as a kid, however. I stuck to DC comics. I especially liked the Legion of Superheroes, though I also read the Justice League, Superman and Batman. This was the Silver Age of comics, I believe, before they restarted and complicated the field with reimagining the comic universe (or whatever it is they did).\r\n\r\nAnyway, I was a DC boy so I gave The Batman a look see. It is a dark film, both in its themes and its camera work. No wit and humor to speak of here, just grim and introspective comic book noir. But it was intriguing and interesting enough to hold only my attention. There were a couple of interesting twists on traditional Batman villains, for example. As with a lot of current thrillers, there is quite a body count, when sometimes with violence, I think less can be more.\r\n\r\nIt is not a film I will watch multiple times or anxiously await a sequel for, but I do not regret the time spent watching it.", "created_at": "2022-04-27T09:39:42.003Z"}, {"movie_id": 414906, "review_id": "626c2f9f35811d005015ae2f", "author_rating": 10.0, "review_text": "_The Batman_ is the best live-action Batman movie yet. It's the type of Batman film I've been waiting for my whole life.\r\n\r\nIt's dark and realistic, but also stylish and large-scale. It's not limited by a commitment to realism like the Dark Knight trilogy, nor is it burdened by a shared universe like the DCEU. It is its own thing. A moody, disturbing, visually stunning, David Fincher-inspired, three hour long detective epic with some of the best interpretations of the characters ever put on screen.\r\n\r\nRobert Pattinson is fantastic as a younger, moodier, and yes, more emo Batman. Paul Dano is straight up terrifying as the Riddler. Colin Farrell is unrecognisable in more ways than one as The Penguin and Zoë Kravitz is easily my favorite live-action Catwoman. Massively underrated is john Turturro as Carmine Falcone.\r\n\r\nThis movie kept me hooked all the way through. It's almost three hours long but it feels like two.\r\n\r\nThis is the best Batman movie. The Dark Knight is good and all, but Reeves finds the perfect mix of gritty realism and style (Nolan would never even dare to have a snorricam shot of Batmam gliding over the city), and finally gives us a live-action Batman that lives up to the title of \"World's Greatest Detective\". Not that there's much competition, since he's like the only one to actually do any detective work (no, Christian Bale magically finding a fingerprint on a broken bullet doesn't count).", "created_at": "2022-04-29T18:34:07.252Z"}, {"movie_id": 414906, "review_id": "626c76a0245dbe004f431b50", "author_rating": null, "review_text": "The movie was one of the best Batman movies in my opinion, but, I honestly didn't like thus portrayal of Batman. This didn't feel like Batman, more like BatDude. Like a man in real life that grew up watching Batman and decided to fight crime under his name. Overall it is definitely worth the watch!", "created_at": "2022-04-29T23:37:04.585Z"}, {"movie_id": 414906, "review_id": "62bdfb3c8d2f8d006117ac09", "author_rating": 10.0, "review_text": "Batman returns back to its detective roots, and it is a breath of fresh air. Robert Patterson is stunning as Batman. The twists and turns the new Riddler take is a fun ride.\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-06-30T19:36:28.614Z"}, {"movie_id": 414906, "review_id": "62f8f48d258823007f6074ce", "author_rating": 4.0, "review_text": "To be honest, this is a really good movie. Hang on? So why did I only give it 2 out of 5 stars? Well, this is really personal but, to me, it is not a good Batman movie. I really had problems writing this review because it is a very good movie. I just did not like it as a Batman movie.\r\n\r\nThe movie is really dark, gritty and noir. Not really a problem. It works for some movies. But it is also quite slow at the beginning and the first quarter of the movie was actually boring. Remember, this is a three hour movie so a quarter is more than half an hour of “boringness”.\r\n\r\nThe “boringess” was broken up by a pretty cool car chase. Some people seem to not really like the batmobile and I have to say that it was not very inspired but it was not all bad either. Unfortunately the movie turned rather boring for a while again after that.\r\n\r\nThe movie tries to bring out more of the detective part of Batman than the previous movies, which is fine, but there is just too much moping around with Batman / Bruce Wayne walking around oozing sadness all around him.\r\n\r\nActually, this brings us to my main gripe with this movie. The choice of actor for the Batman is just wrong for me. He is more like a sad puppy than the Batman. The script that makes him mope around, have emotional outbreaks and, occasionally, being downright stupid like just staring dumbfounded when explosives go off in his face does not really help of course.\r\n\r\nTo me the Selina Kyle character had more charisma than the Batman, especially when the Batman was in his Bruce Wayne alter ego.\r\n\r\nAnd I really, really dislike that twist about Bruce’s parents. That was such a lazy Hollywood writer hack thing to do just to create (unwanted) drama.\r\n\r\nThen we have the Riddler. Compared to the charismatic villains that we have come to expect he is just a sad little psychopath with a bunch of equally sad fanatical internet followers.\r\n\r\nNow, all of this would have worked great if it had been a movie about some, unspecified, vigilante. The movie is really well done. The detective story, the action (especially towards the end) and the noir setting would have worked great. Even at its three hour bloated length it would have been great although cut down to two hours or a bit more would have been even better. If it had not been a Batman movie!", "created_at": "2022-08-14T13:11:41.626Z"}, {"movie_id": 414906, "review_id": "630996ce6e938a007bf1f5fe", "author_rating": 5.0, "review_text": "The Batman is not a terribly bad movie, but it would be twice as good if it were half as long. How a film that likes to take shortcuts – especially with the Riddler’s ‘riddles’ – can still take almost three hours to get to where it’s going, I haven’t the foggiest (but then this is a rather strange enterprise that gives us Andy Serkis in the flesh and covers Colin Farrell in prosthetic makeup and a fat suit). Director/co-writer Matt Reeves very wisely avoids origin stories and takes for granted relationships, which have already been well established in a decades-long canon, between certain characters; on the other hand, he allows his movie to become bogged down at the halfway point in a deluge of backstory.\r\n\r\nThe obvious problem is that there is enough material here for at least two films, and Reeves attempts to cram it all into a single one. Why? We all know there are going to be sequels, so why not save some for the next chapter? Or better yet, why not leave some of it on the cutting room floor? There is absolutely no reason for the Penguin to be in this movie; he might as well be the Imperceptible Man (an actual Batman villain, mind you) for all that he’s given to do. Catwoman has been pretty much played out, and as far as the Riddler, I can’t believe I’m going to say this, but Jim Carrey did a much better job with the role than does Paul Dano – an otherwise fine actor that inexplicably chose to play the character as the bastard child of Heath Ledger’s Joker and Tom Hardy’s Bane. That leaves Carmine Falcone (John Turturro), who provides the most intriguing plot points; why not make him the main, or even – dare I say it – only villain?\r\n\r\nNow, The Batman is long enough to try the patient of a saint, but at least it’s great to look at. Like the first Tim Burton Batman (as described by the unerring Roger Ebert), it “is a triumph of design over story, style over substance - a great-looking movie with a plot you can’t care much about.” Gotham City in particular is a winning combination of Burton’s faux noir texture and Christopher Nolan’s plausible architecture. The best scenes involve Batman (Robert Pattinson) and Jim Gordon (Jeffrey Wright) – and indeed Pattinson has an uncanny knack for playing off veteran character actors – as a sort of pre-Robin dynamic duo; their adventures are poignant because they appear to happen in the real world, or at least as real as a world can be wherein a grown man disguises himself as a giant bat (compare last year’s Zack Snyder's Justice League, with its unending CGI assault on the senses).", "created_at": "2022-08-27T04:00:14.031Z"}, {"movie_id": 414906, "review_id": "630a77c232489b007b74ba64", "author_rating": 3.0, "review_text": "This was the worst Batman I have ever seen. \r\n\r\nFirstly, Robert Pattinson was the worst choice for the Batman role. In Twilight he was alright, but in Batman he definitely failed. He was more like a sad, depressed goth kid with no emotions. He tried too much to fit the role, but in fact we got this depressive, dead and empty Batman. \r\n\r\nSecondly, there were other small things that sucked about this movie, for example, Cat Woman had a very simple and stupid mask. Even older movie versions had a better mask than here. Batman's batmobile also sucked. Looked like a downgraded version. He also rode just a simple bike and lastly, he couldn't even glide with his default Batman suit. Also, don't know why but James Gordon was played by a black actor, while in every movie and even in every game this character is white. Riddler character also seemed stupid, wearing stupid mask and acting stupid and wasn't intimidating at all, but laughable. So, in general cast and acting was disappointing in this movie.\r\n\r\nLastly, the movie itself... It was dull, boring and depressive. They tried to make it masterpiece with 3 hours long, but in reality movie became just plain boring and I almost fell asleep. \r\n\r\nOverall verdict: Disappointing.", "created_at": "2022-08-27T20:00:02.284Z"}, {"movie_id": 414906, "review_id": "631fa64258efd30084737214", "author_rating": null, "review_text": "After spending most of today struggling to edit, this was such a cool way to spend my evening. Big theater, fantastic film. \r\n\r\nOutstanding visuals, dreamy atmosphere, great cast, and pitch-perfect action. Giacchino’s amazing score is just the cherry on top. A few of its elements (mostly the central mystery) can feel too muddy at times, but if this is any sort of indication of the quality of 2022 films, color me excited.", "created_at": "2022-09-12T21:36:02.504Z"}, {"movie_id": 414906, "review_id": "648f612542bf0100c7fc1397", "author_rating": 5.0, "review_text": "Next too batman and Robin this has to be the 2nd most dumbest batman movie ever made. Robert Patterson made an alright batman but completely sucked at being Bruce Wayne. When he was Bruce Wayne it was like watching the twilight movies. I've never seen Bruce act like that all suspicious and looking like a dam criminal. Like wtf happened on this Batman it was horrible. Also like little to no action really at all. Catwoman was garbage. The penguin looked like a human almost like 2 face. And last but not least the riddler looked like the guy from my bloody valentine. Not only did they completely butcher the film but but they butchered the characters as well. I don't understand why this movie has such good ratings. It was the most boring batman I've ever seen. They should just stop making these. This is the 6th different batman actor and its getting worse. If you can't keep the same batman then just give up already. Obviously everyone hates playing batman since no one ever wants to keep playing him.", "created_at": "2023-06-18T19:55:17.389Z"}]