[{"movie_id": 333352, "review_id": "5787cfc8c3a36839300013cd", "author_rating": 8.0, "review_text": "> The modern warfare, and its advantages as well as drawbacks.\r\n\r\nA new kind of war. When everyone is worried about robots might take over our jobs, it meant military as well. There was not robots in this, but a war fought from a safe distance and soldiers don't have to be physically trained so well, even the geeks with the gaming knowledge can take over. So a film about the modern warfare where the casualty rate is very minimum and can be accomplished before any major assault take place.\r\n\r\nFrom the South African director of 'Ender's Game' fame. This is slightly a similar theme, but a real world affair and a real time presentation. Initially I thought it was a remake of the Hong Kong film of the same name. We had seen drone attacks in the films, but they won't last for a few minutes. This film was entirely about how drone missions work that told with detail.\r\n\r\n\"Never tell a soldier that he does not know the cost of war.\"\r\n\r\nThis was a very good film and they must make a sequel to it. This film will get a special status going towards the future. There were no physically exceptional performances, the stars' presence and their verbal expressions were stronger. So there many thrilling scenes with great lines, especially Alan Rickman's final dialogue. This film was his final film and he was excellent like the usual. Even the Abdi's role was small, but powerful and so Helen Mirren's, but Aaron Paul and the rest were decent.\r\n\r\nThe story was good, but I did not like the too much sentimentalised. Because all's fair in love and war. You won't make a film to please the terrorists and their sympathisers. Other than that it is a masterpiece. Surely worth a watch.\r\n\r\n8/10", "created_at": "2016-07-14T17:45:44.910Z"}, {"movie_id": 333352, "review_id": "5aa04645c3a3680a3001af09", "author_rating": 4.0, "review_text": "Eye in the Sky wants to explore the question of drone warfare.\r\n\r\nAn operation to capture a terrorist cell in Kenya. Helen Mirren plays Colonel who is rather gung ho and wants to take out the bad guys before they do more harm.\r\n\r\nAaron Paul is a drone pilot who is dithering because of the risk to civilian casualties.\r\n\r\nThe film pursues the human touch of a young girl selling bread in the market place, being at the wrong place as that is where the drone aims to strike.\r\n\r\nEye in the Sky is an oddly structured film, it is tense as the audience wonders of the little girl will be safe. It also wants to have an open and even debate on the morals and perils of drone warfare but it all feels rather undercooked and underwhelming.\r\n\r\nThis was Alan Rickman's final film, he rightly has the last line: 'Never tell a soldier they don't know the cost of war.'", "created_at": "2018-03-07T20:06:29.960Z"}, {"movie_id": 333352, "review_id": "5edc231bf36a32002087f2a0", "author_rating": 9.0, "review_text": "I was looking for a film to watch. Being a big Helen Mirren fan, I decided to give this one a go. What a great choice it was!\r\n\r\nThe fact that the entire film is in real time, meaning we watch the event as they unfold in real time, makes it a true edge-of-the-seat stuff. Acting was nothing to brag about but the story was great. As you watch it, you keep finding yourself arguing with yourself, trying to decide what you would actually do if you were one of the characters in the film.\r\n\r\nIf you’re looking for something to watch and have access to this film, don’t even think for a second and press that play button.\r\n\r\nWould I watch it again? Yes! Would I make my friends watch it? Absolutely!", "created_at": "2020-06-06T23:13:31.917Z"}]