[{"movie_id": 497698, "review_id": "60db454f0b73160045632c08", "author_rating": null, "review_text": "After a delay lasting 19 months; the Marvel Cinematic Universe (MCU) has returned to the big screen with “Black Widow”. The film takes place between “Captain America: Civil War” and “Avengers: Infinity War”; audiences get more of the backstory of Natasha Romanoff (Scarlett Johansson), as we are introduced to her early life before the Red Room.\r\n\r\nThis is not to say that the film is an origin story as it uses her backstory through a clever introduction that establishes her “family” as sleeper agents in Ohio before they escape and she and her cover sister are tuned over for conditioning and training.\r\n\r\nSince Natasha is on the run from the authorities; she finds a remote location in Norway to bide her time. This does not last as a dangerous adversary known as the Taskmaster arrives and sets a chain of events into motion.\r\n\r\nNatasha has been sent a package from her cover sister Yelena (Florence Pugh) who also went through the Red Room and became a top assassin in the years since she and Natasha last saw one another.\r\n\r\nDespite her mixed feelings; Natasha ventures to Budapest and confronts Yelena who in turn reveals the package she sent her contains a compound that can free the other Black Widows from the control of the Red Room which despite Natasha’s insistence is still very much alive as is the head of the institute which she is convinced she killed long ago.\r\n\r\nWith Taskmaster and other Widows hot on their trail, Natasha and Yelena are forced to seek the help of their former “Father” the imprisoned hero Red Guardian (David Harbour), and their cover Mother Melina (Rachel Weisz), to find the location of the new Red Room; free the Widows, and end the program once and for all.\r\n\r\nWhat follows is an engaging story with solid action and effects that remains at its core a character story as Natasha attempts to reconcile her cover family with her new Avengers family and the pain of her upbringing and conditioning.\r\n\r\nMarvel resisted calls from some to release the film on Disney+ last year when the Pandemic caused multiple delays to the planned release dates. This decision to me was very wise as this is a film that needs to be seen and heard on the big screen as it is an experience that is best experienced in a cinema with others.\r\n\r\nWhile many attempts were made over the decades to adapt comic heroes to film and television; most of them came up lacking and disappointed fans of the source material. Marvel for over a decade has continued to succeed as they have a clear plan, cast well, and have engaging characters that develop over time.\r\n\r\n“Black Widow” fills in a missing gap of time in the MCU well and also sets up future adventures as a scene in the credits clearly links two of the live-action Disney+ series and shows that the long-term plan for the MCU continues and incorporates the film and television series well.\r\n\r\nFrom the moment the Marvel intro and music appeared on the screen until the very end; “Black Widow” was a very enjoyable and engaging blockbuster adventure that shows Marvel at the top of their game; and why they continue to set event-level movies not to miss.\r\n4 stars out of 5", "created_at": "2021-06-29T16:07:43.200Z"}, {"movie_id": 497698, "review_id": "60e74284b76cbb0073e80020", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-widow-spoiler-free-review\r\n\r\n\"Black Widow beautifully honors the iconic Natasha Romanoff, who finally receives the respectful, worthy solo film that her unforgettable legacy always deserved. Cate Shortland and Eric Pearson put together an MCU installment that doesn't really compare to any of the other origin flicks, profoundly examining the protagonist's dark past and her complex \"family\" through distinctly compelling storytelling. Scarlett Johansson shines one last time, interpreting the most impactful role of her career, but Florence Pugh comes close to stealing the spotlight by giving an absolutely phenomenal display. Boasting highly entertaining, mostly well-filmed action sequences, the main narrative follows a path with no surprises, as well as a generic villain, but the emotionally investing storylines regarding Natasha's personal motivations and Yelena's complex feelings keep the film remarkably captivating. The ending is as satisfying as I could have ever wished for. A loving farewell to a hero that inspired millions of viewers.\"\r\n\r\nRating: A-", "created_at": "2021-07-08T18:23:00.947Z"}, {"movie_id": 497698, "review_id": "60efa51fa44d09002d44c33a", "author_rating": null, "review_text": "The first half of black widow was very strong and emotional. Florence Pugh was stellar in this movie. She was brilliant in action sequences and I like the fun elements in her character. Yelena and Natasha's chemistry was too good. David Harbour also performed very well. \r\n\r\nThe action sequences were good but CGI was too weak in the 3d act. Also, I didn't like the changes in Natasha's character. She has no superpowers like other avengers. Her strong brain and mind combine to make her a lethal weapon but they showed her over powerful in this movie. \r\n\r\nThe inner wounds of Natasha were beautifully delivered in this movie. I liked the movie but because of Florence only.", "created_at": "2021-07-15T03:01:51.424Z"}, {"movie_id": 497698, "review_id": "60f90db0df857c0045b1f522", "author_rating": 10.0, "review_text": "**This Is A Thrilling , Beautiful &  VERY , VERY , VERY FUNNY Journey . . . BUT ALAS 😢 . . . It Will Of Course, -{ _INEVITABLY_ }- Be A \" Short-Lived \" One For S.J⚘. Welcome To The Age Of The Super🦸‍♀️ ANACHRONISTIC , Er , \" Prequel \"**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Full Length Review . \r\n\r\n____________________________________________________ \r\n\r\n Yelena Belova : { about Natasha Rommanoff.. and in -JEST- } \" ... You're such a _Poser_❗\" ⬜⬜⬜⬜\r\n\r\n____________________________________________________ \r\n\r\n**1. \" I Absolutely, Positively Loved It \" :** And I'm going to say that right off the bat. For what it's worth, I actually had to go see Black Widow, ( 'B.W' for short ), -twice- as I wasn't able to catch the beginning the first time around . . & ended up appreciating it -{ So }- much more the second time ; because, being a person with a difficult past myself . . the -Superb- , Intricate, ( and often super - Hilarious 🤣🤣🤣 - ) drama between the lead characters -{ Really }- hit home for me. So much so . . . That inasmuch as ( - I - ) was concerned atleast, just about the -{ Only }- flaw with this film for me, if any, was the altogether \"glaring\" fact that it is now all but -Certain- . . . That we -{ Won't }- see Scarlett Johansson ( 'S.J' for short ) . . . Reprise her fascinatingly complex, and truly \"Glorious\" role as -{ _THE_ }- Black Widow. No spoiler here b.t.w ...this \"Prequel\"-movie's place in the overall 'M.C.U' ( Marvel Cinematic Universe ) timeline has always been made -{ CRYSTAL 💎 }- clear by 'MARVEL STUDIOS'... from the very Get-go. I invite you in earnest, { -Especially- if you're somewhat new to the whole \"M.C.U-thing\" }, to view one particular -Official- trailer by them, the one -still- entitled \"New Trailer\", ( YouTube, Apr.03, 2021 ), where the, 'rationale' ( -if you will- ) for B.W is explained, um, \"Super\"-well . . and is narrated by -none- other than, you guessed it, the \"Hopelessly-Vivacious and yes, genuinely-Affable . . Ms. Johansson herself .\r\n\r\n**2. \" Loose Ends Are Tied Nicely \" :** Here's a small { but undeniably significant } example. The 'aforementioned' Ms. Johansson's seemingly -{ \"Random\" }- & generally inexplicable \"Suddenly-Blonde\" hair in 'Infinity War' . . . . . { a look that frankly, I never -Could- quite warm up to at the time, having ...( along with Millions-&-Millions of -Other- 'M.C.U afficionados', I'm sure )... come to entirely -Adore- her trademark \" Fiery Red-tresses Look 🔥 \" , over the years } . . . . . Was \" Finally \" explained to us. Looking to the 'bigger' things : Basically, the picture filled in a -{ Whole }- bunch of gaps and 'story-holes' for me { that would often -totally- have me headscratching for \"Answers\" in the unbearably -Long- spells between each successive new ( & 'ever More Madly' ) anticipated \"Massive\" New Marvel-release. And it managed to -Achieve- this by essentially showcasing a \"Wide\", ( frankly ), and previously -Unknown- array of intertwined \" Backstories 📚 \" ...( not to mention giving us a satisfyingly -thorough- insight into the smattering of \"badly damaged relationships left in the B.W's wake\" )... that occurred -{ Well before }- & indeed, leading up to, her \"very, very, very\" high-priced and hard-won \"Formal-entry Into Shield\" { and concomitant defection from the Russian Secret Service, the 'F.S.B' ( formerly the 'K.G.B' ) }. Hence, a big, loud { \" Kudos \" } to the wonderfully gifted -Miz- Jac Schaeffer and Ned Benson ( the story-writers ), as well as Eric Pearson ( the movie's screenwriter ) . \r\n\r\n**3. \" A Veritable -Explosion- . . . Of Talent \" :** A HUGE 👊💥, HEARTY PAT on the back is -{ Completely }- in order for **CATE SHORTLAND,** the Australian Directress of this U.S.D 200 Million cinematic 'Powder-keg\". Although she may have been \"hitherto\" -{ Relatively }- unknown to -many- , this tremendously accomplished native of Temora, New South Wales actually has, get this -{ Two Full Decades }- of both T.V, as well as Film direction Credits under her belt, with 2012's War-romance-drama 'Lore' being her highest earning movie to date ( until -Black Widow- of course, that is to say 😉 ). Not only has she very successfully managed to bring together a tremendously -Cohesive- Principal Cast just 'gushing' with absolutely -{ Stellar }- Talent, let's be clear ...( a quick, special \"Mention-of-note\" is altogether warranted here for the -Charmingly- bubbly & ever \"tenacious\" ( newcomer to -MARVEL- ) Florence Pugh, who well & truly excels in her portrayal of 'Yelena Belova' )... but the film-crew that she's \"assembled\" have -{ Also }- well & truly outdone themseves in -Every Single- aspect of the Production . . . With the mega-Stylistic & \"Dazzling\" fight choreography employed in the \"Widows training scene\", ( -trailers, also- ), featuring an F.S.B 'mini-battalion' of \" Spectacularly Luminescent 🖲 \" Black-&-Red clad 'elite Girl-assassins' . . . Being the one that stood out for me -{ Visually }- , more than -any- other, in the film. And last, but most definitely -Not- least ; a quick 'Special-mention' of the fact that the 5 -Individual- Russian accents performed by 5 of \"most\" important Principal actors, ( -each to its Very specific, varying degree- ), were pulled off, rather -{ \"Immaculately\" }- I might add, by 5 different actors from, well, -get this- **. . . . _the U.K, & the U.S.A_ { 👏❗ } .**\r\n\r\n**SUMMATION : -{ JUST AS LONG }-** as you go and see Black Widow with a \"Free and Open-mind\", prepared to be _Really, Really_ -{ Entertained }- . In 'my-specific' case, the ( obvious ) \"Anachronistic\" aspect of said movie . . .  -{ _D I D_ }- . . . in fact make the prospect of watching it ( in the days leading up to B.W's release ) feel a tad bit strange, if you will. However, once I was actually -{ in }- my seat, the -\"fabulous, Even Bond-esque\"- intro sequence started to work its 'Insta' magic on me . . . . and then . . . . when that ever familiar, ever Dramatic, and yes, ever -Beloved- Marvel theme roared through the massive cinema hall I was in, it all just \"Snapped\" into place . An -Unabashed- , \"Explosive\" **13.00 MARKS OUT OF 10.00 MARKS** From Me . Oh and yes, Scarlett Johansson, you will be \" sorely , but Surely , & Dearly \" . . . _M I S S E D_ . . . as \" _T H E_ \" Black Widow . **->-{ • W • O • W • }->- , \"1 POST-CREDITS APPEARANCE\" , AND 8 \"FULL-BLOWN\" STARRING ROLES LATER ( A WHOPPING -_NINE_- FILMS IN TOTAL ) . . . . WHAT A \" _SPECTACULARLY MEMORABLE_ \" JOURNEY IT'S BEEN ❤❗.**", "created_at": "2021-07-22T06:18:24.643Z"}, {"movie_id": 497698, "review_id": "610526f4ee43e80027c25bc3", "author_rating": 2.0, "review_text": "Subpar Bond that believes it has emotional stakes isn't exactly a very winning formula. Far too much bad MCU banter to go with something that wants to be grounded and quite frankly none of the actors are quite adapt at those sitcomy whedonisms that these movies made mainstream (Pugh in particular is terrible at those bits). Some of the mid section action is better than average as far as those movies goes but anything with Taskmasker is very bad and the big end is terrible. Winstone villain made me miss when people like Lonsdale and Lee made lousy Moore Bond plots half watchable. The major limitation is that far too much of the emotional beats depend on what characters talk about their time together when they were a pretend family and altough Johansson and Pugh have good chemistry and Weisz and Harbour do as good job as possible under the circunstances of selling their regrets, there just isn't enough downtime between plot needs to anything of it truly land. I can get what Shortland was hoping to import into one of those but little actually works even with the benefit of a far more standalone movie than most of them. Also, strange how after a decade of postponing giving Johansson her movie, they did one in which she so often feels like a witness/connective MCU tissue for the main supporting characters family drama that they had to give her an extra subplot with her guilty over \"killing\" Winstone's daughter so it can feel like she has more material to work with. She is both the lead and the most extraneous part of her own movie", "created_at": "2021-07-31T10:33:24.408Z"}, {"movie_id": 497698, "review_id": "612025512e0697005da5a605", "author_rating": 8.0, "review_text": "Honestly, if Black Widow opened Marvel’s Phase 4, I would have been even more impressed. However, after seeing the deep dives into characters that had been on the sidelines for years, this movie felt very surface level of the complexity of Natasha Romanoff. She was taken as a child to learn how to be an assassin, she had to sacrifice her morals to leave her past behind, she basically remained an assassin for a different organization that turned out to be run by similarly bad people as those she left, and she is now on the run from the government that once hailed her a hero because she didn’t fall in line. Oh, and she is reconnecting with her past fake family that gave her and Yelena back to the Red Room as soon as the mission was over. The trauma this character endured would’ve been better explored as a mini series, rather than a movie that’s trying to simultaneously remind us of where Natasha was five years ago and also trying not to acknowledge that Natasha has no risk posed to her in this movie because we know she lives on past these events. However, very excited to see where Yelena goes in the future.", "created_at": "2021-08-20T21:57:37.514Z"}, {"movie_id": 497698, "review_id": "61397ca566a0d30042b56554", "author_rating": null, "review_text": "It was okay", "created_at": "2021-09-09T03:16:53.429Z"}, {"movie_id": 497698, "review_id": "6149fdd9cf9ba30067f39c1a", "author_rating": 1.0, "review_text": "It's crap, really. Nothing works in this movie.", "created_at": "2021-09-21T15:44:25.614Z"}, {"movie_id": 497698, "review_id": "615d92848e2ba6008beb8349", "author_rating": 6.0, "review_text": "Black Widow is worth seeing for Florence Pugh, the free-fall action sequence, and anything involving Taskmaster before it’s revealed who is under the mask. Everything else about Black Widow feels like it was done better by the films it was supposedly influenced by and mostly feels like a diluted imitation of Captain America: The Winter Soldier. It’s fantastic that women are getting more opportunities in big summer blockbusters like this one, but it’s also disheartening since their filmmaking skills are shackled to formulaic superfluity that obviously stands in the way of creating extraordinary cinema. \r\n\r\nFull review: https://geekshavegame.com/black-widow-review-espionage-exhaustion/", "created_at": "2021-10-06T12:11:48.151Z"}, {"movie_id": 497698, "review_id": "61eb80b74df29100435cc066", "author_rating": 9.0, "review_text": "Waited so long for this movie to come out and I was loaded with anticipation. \r\nWhen it finally landed I was so excited to watch it!\r\nI must say, it didn't go in the direction that I was expecting (based on the on the other solo movies)... but I was very pleasantly surprised, and it was way better than I was expecting it to be.\r\nI thoroughly enjoyed this movie, and it was a fitting tribute yo one of my favourite Marvel Universe characters.", "created_at": "2022-01-22T03:57:43.822Z"}, {"movie_id": 497698, "review_id": "6352fc01f8e98200817b13df", "author_rating": 6.0, "review_text": "**Black Widow is a decent MCU film with excellent entertaining characters but an average to disappointing story.**\r\n\r\nBlack Widow faced steep expectations as Marvel's first female-led film focused on a cherished MCU favorite. Black Widow's past was always shrouded in mystery and pain, but she was finally receiving the attention the hero deserved to dive into her past and celebrate Scarlett Johansson's super spy. With hopes high and fans wanting a Captain America: The Winter Soldier-type superhero espionage film, Black Widow, unfortunately, fell short. Nothing was particularly disappointing about the film. I had just hoped for so much more for the character and Scarlett Johansson at this point in the MCU's journey. The effects and action were decent. The villain was forgettable. The big defining Budapest incident was passed by with hardly any impact or emotional weight. Black Widow gets lost in all of the chaos of the film. The best part of the movie by far was the new characters played by Florence Pugh and David Harbor. They were highly entertaining, funny, and endearing. I hope to see Florence Pugh's Yelena Belova in many more Marvel films. Black Widow really was a decent entry in the Marvel universe and one of the better Phase 4 movies. Still, it didn't do Natasha Romanoff the justice she deserved leaving the character's best moments in other Marvel films that focused on other heroes.", "created_at": "2022-10-21T20:07:29.550Z"}, {"movie_id": 497698, "review_id": "63bb02f9fc31d300a8de1cff", "author_rating": 6.0, "review_text": "This is a self-contained origin story of Natasha Romanoff / Black Widow (Scarlett Johansson). No knowledge of the Avengers is required to watch this film, although, in a Marvel context, it happens after the civil war breaks up the Avengers of which Natasha was a part of. Effects and tension are amazing to watch and edge of seat but there's a payoff with plot. A familiar action film formula – _get and protect the MacGuffin while getting to the evil megalomaniac before he takes over the world_. The formula acts as a vehicle for pretty much non-stop action. If that’s enough for you then this is might be your perfect film.  The familial relationships and confronting her dark past promised in the advert don’t really deliver (although Natasha’s sister, Yelena is essential to this film) but if two hours of Scarlett Johansson kicking high-octane butt is your thing then you’re in for a treat. Too heavy on the action but fun to watch. 6/10", "created_at": "2023-01-08T17:52:57.738Z"}, {"movie_id": 497698, "review_id": "644ecc2e23168c030654e335", "author_rating": 7.0, "review_text": "There wasn't much about black widows history and background. So I really liked this movie. See how the character became her.", "created_at": "2023-04-30T20:14:38.289Z"}, {"movie_id": 497698, "review_id": "64bfa45b6d4c9700c5e3723f", "author_rating": 4.0, "review_text": "Black Widow ist der Beweis, dass auch weiblicher Regisseur nicht unbedingt mit starken Frauenfiguren umzugehen weiß. Der Beweis, dass auch mit einer interessanten MCU-Figur ein uninteressanter Film entstehen kann. Der Film zeigt auch, dass das MCU immer und immer wieder mit schwachen Antagonisten zu kämpfen hat, was bei einem Film, der weniger von seiner coolen Action, als vielmehr von seiner Story lebt einfach noch mehr ins Gewicht fällt. Ja, die Actionszenen des Films sind gut. Florence Pugh fügt sich als Schwester von Black Widow gut in das Universum ein und es ist auch schön mehr über die Vorgeschichte von Black Widow zu erfahren. Am Ende muss man allerdings auch sagen, dass Black Widow kein guter Film ist. Dafür überwiegen leider die genannten Schwächen zu sehr und Marvel hat zuletzt mit seinen starken Serien bewiesen, dass sie auch storylastigere Geschichten packend erzählen können. [Sneakfilm.de]", "created_at": "2023-07-25T10:30:51.934Z"}, {"movie_id": 497698, "review_id": "60db454f0b73160045632c08", "author_rating": null, "review_text": "After a delay lasting 19 months; the Marvel Cinematic Universe (MCU) has returned to the big screen with “Black Widow”. The film takes place between “Captain America: Civil War” and “Avengers: Infinity War”; audiences get more of the backstory of Natasha Romanoff (Scarlett Johansson), as we are introduced to her early life before the Red Room.\r\n\r\nThis is not to say that the film is an origin story as it uses her backstory through a clever introduction that establishes her “family” as sleeper agents in Ohio before they escape and she and her cover sister are tuned over for conditioning and training.\r\n\r\nSince Natasha is on the run from the authorities; she finds a remote location in Norway to bide her time. This does not last as a dangerous adversary known as the Taskmaster arrives and sets a chain of events into motion.\r\n\r\nNatasha has been sent a package from her cover sister Yelena (Florence Pugh) who also went through the Red Room and became a top assassin in the years since she and Natasha last saw one another.\r\n\r\nDespite her mixed feelings; Natasha ventures to Budapest and confronts Yelena who in turn reveals the package she sent her contains a compound that can free the other Black Widows from the control of the Red Room which despite Natasha’s insistence is still very much alive as is the head of the institute which she is convinced she killed long ago.\r\n\r\nWith Taskmaster and other Widows hot on their trail, Natasha and Yelena are forced to seek the help of their former “Father” the imprisoned hero Red Guardian (David Harbour), and their cover Mother Melina (Rachel Weisz), to find the location of the new Red Room; free the Widows, and end the program once and for all.\r\n\r\nWhat follows is an engaging story with solid action and effects that remains at its core a character story as Natasha attempts to reconcile her cover family with her new Avengers family and the pain of her upbringing and conditioning.\r\n\r\nMarvel resisted calls from some to release the film on Disney+ last year when the Pandemic caused multiple delays to the planned release dates. This decision to me was very wise as this is a film that needs to be seen and heard on the big screen as it is an experience that is best experienced in a cinema with others.\r\n\r\nWhile many attempts were made over the decades to adapt comic heroes to film and television; most of them came up lacking and disappointed fans of the source material. Marvel for over a decade has continued to succeed as they have a clear plan, cast well, and have engaging characters that develop over time.\r\n\r\n“Black Widow” fills in a missing gap of time in the MCU well and also sets up future adventures as a scene in the credits clearly links two of the live-action Disney+ series and shows that the long-term plan for the MCU continues and incorporates the film and television series well.\r\n\r\nFrom the moment the Marvel intro and music appeared on the screen until the very end; “Black Widow” was a very enjoyable and engaging blockbuster adventure that shows Marvel at the top of their game; and why they continue to set event-level movies not to miss.\r\n4 stars out of 5", "created_at": "2021-06-29T16:07:43.200Z"}, {"movie_id": 497698, "review_id": "60e74284b76cbb0073e80020", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-widow-spoiler-free-review\r\n\r\n\"Black Widow beautifully honors the iconic Natasha Romanoff, who finally receives the respectful, worthy solo film that her unforgettable legacy always deserved. Cate Shortland and Eric Pearson put together an MCU installment that doesn't really compare to any of the other origin flicks, profoundly examining the protagonist's dark past and her complex \"family\" through distinctly compelling storytelling. Scarlett Johansson shines one last time, interpreting the most impactful role of her career, but Florence Pugh comes close to stealing the spotlight by giving an absolutely phenomenal display. Boasting highly entertaining, mostly well-filmed action sequences, the main narrative follows a path with no surprises, as well as a generic villain, but the emotionally investing storylines regarding Natasha's personal motivations and Yelena's complex feelings keep the film remarkably captivating. The ending is as satisfying as I could have ever wished for. A loving farewell to a hero that inspired millions of viewers.\"\r\n\r\nRating: A-", "created_at": "2021-07-08T18:23:00.947Z"}, {"movie_id": 497698, "review_id": "60efa51fa44d09002d44c33a", "author_rating": null, "review_text": "The first half of black widow was very strong and emotional. Florence Pugh was stellar in this movie. She was brilliant in action sequences and I like the fun elements in her character. Yelena and Natasha's chemistry was too good. David Harbour also performed very well. \r\n\r\nThe action sequences were good but CGI was too weak in the 3d act. Also, I didn't like the changes in Natasha's character. She has no superpowers like other avengers. Her strong brain and mind combine to make her a lethal weapon but they showed her over powerful in this movie. \r\n\r\nThe inner wounds of Natasha were beautifully delivered in this movie. I liked the movie but because of Florence only.", "created_at": "2021-07-15T03:01:51.424Z"}, {"movie_id": 497698, "review_id": "60f90db0df857c0045b1f522", "author_rating": 10.0, "review_text": "**This Is A Thrilling , Beautiful &  VERY , VERY , VERY FUNNY Journey . . . BUT ALAS 😢 . . . It Will Of Course, -{ _INEVITABLY_ }- Be A \" Short-Lived \" One For S.J⚘. Welcome To The Age Of The Super🦸‍♀️ ANACHRONISTIC , Er , \" Prequel \"**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Full Length Review . \r\n\r\n____________________________________________________ \r\n\r\n Yelena Belova : { about Natasha Rommanoff.. and in -JEST- } \" ... You're such a _Poser_❗\" ⬜⬜⬜⬜\r\n\r\n____________________________________________________ \r\n\r\n**1. \" I Absolutely, Positively Loved It \" :** And I'm going to say that right off the bat. For what it's worth, I actually had to go see Black Widow, ( 'B.W' for short ), -twice- as I wasn't able to catch the beginning the first time around . . & ended up appreciating it -{ So }- much more the second time ; because, being a person with a difficult past myself . . the -Superb- , Intricate, ( and often super - Hilarious 🤣🤣🤣 - ) drama between the lead characters -{ Really }- hit home for me. So much so . . . That inasmuch as ( - I - ) was concerned atleast, just about the -{ Only }- flaw with this film for me, if any, was the altogether \"glaring\" fact that it is now all but -Certain- . . . That we -{ Won't }- see Scarlett Johansson ( 'S.J' for short ) . . . Reprise her fascinatingly complex, and truly \"Glorious\" role as -{ _THE_ }- Black Widow. No spoiler here b.t.w ...this \"Prequel\"-movie's place in the overall 'M.C.U' ( Marvel Cinematic Universe ) timeline has always been made -{ CRYSTAL 💎 }- clear by 'MARVEL STUDIOS'... from the very Get-go. I invite you in earnest, { -Especially- if you're somewhat new to the whole \"M.C.U-thing\" }, to view one particular -Official- trailer by them, the one -still- entitled \"New Trailer\", ( YouTube, Apr.03, 2021 ), where the, 'rationale' ( -if you will- ) for B.W is explained, um, \"Super\"-well . . and is narrated by -none- other than, you guessed it, the \"Hopelessly-Vivacious and yes, genuinely-Affable . . Ms. Johansson herself .\r\n\r\n**2. \" Loose Ends Are Tied Nicely \" :** Here's a small { but undeniably significant } example. The 'aforementioned' Ms. Johansson's seemingly -{ \"Random\" }- & generally inexplicable \"Suddenly-Blonde\" hair in 'Infinity War' . . . . . { a look that frankly, I never -Could- quite warm up to at the time, having ...( along with Millions-&-Millions of -Other- 'M.C.U afficionados', I'm sure )... come to entirely -Adore- her trademark \" Fiery Red-tresses Look 🔥 \" , over the years } . . . . . Was \" Finally \" explained to us. Looking to the 'bigger' things : Basically, the picture filled in a -{ Whole }- bunch of gaps and 'story-holes' for me { that would often -totally- have me headscratching for \"Answers\" in the unbearably -Long- spells between each successive new ( & 'ever More Madly' ) anticipated \"Massive\" New Marvel-release. And it managed to -Achieve- this by essentially showcasing a \"Wide\", ( frankly ), and previously -Unknown- array of intertwined \" Backstories 📚 \" ...( not to mention giving us a satisfyingly -thorough- insight into the smattering of \"badly damaged relationships left in the B.W's wake\" )... that occurred -{ Well before }- & indeed, leading up to, her \"very, very, very\" high-priced and hard-won \"Formal-entry Into Shield\" { and concomitant defection from the Russian Secret Service, the 'F.S.B' ( formerly the 'K.G.B' ) }. Hence, a big, loud { \" Kudos \" } to the wonderfully gifted -Miz- Jac Schaeffer and Ned Benson ( the story-writers ), as well as Eric Pearson ( the movie's screenwriter ) . \r\n\r\n**3. \" A Veritable -Explosion- . . . Of Talent \" :** A HUGE 👊💥, HEARTY PAT on the back is -{ Completely }- in order for **CATE SHORTLAND,** the Australian Directress of this U.S.D 200 Million cinematic 'Powder-keg\". Although she may have been \"hitherto\" -{ Relatively }- unknown to -many- , this tremendously accomplished native of Temora, New South Wales actually has, get this -{ Two Full Decades }- of both T.V, as well as Film direction Credits under her belt, with 2012's War-romance-drama 'Lore' being her highest earning movie to date ( until -Black Widow- of course, that is to say 😉 ). Not only has she very successfully managed to bring together a tremendously -Cohesive- Principal Cast just 'gushing' with absolutely -{ Stellar }- Talent, let's be clear ...( a quick, special \"Mention-of-note\" is altogether warranted here for the -Charmingly- bubbly & ever \"tenacious\" ( newcomer to -MARVEL- ) Florence Pugh, who well & truly excels in her portrayal of 'Yelena Belova' )... but the film-crew that she's \"assembled\" have -{ Also }- well & truly outdone themseves in -Every Single- aspect of the Production . . . With the mega-Stylistic & \"Dazzling\" fight choreography employed in the \"Widows training scene\", ( -trailers, also- ), featuring an F.S.B 'mini-battalion' of \" Spectacularly Luminescent 🖲 \" Black-&-Red clad 'elite Girl-assassins' . . . Being the one that stood out for me -{ Visually }- , more than -any- other, in the film. And last, but most definitely -Not- least ; a quick 'Special-mention' of the fact that the 5 -Individual- Russian accents performed by 5 of \"most\" important Principal actors, ( -each to its Very specific, varying degree- ), were pulled off, rather -{ \"Immaculately\" }- I might add, by 5 different actors from, well, -get this- **. . . . _the U.K, & the U.S.A_ { 👏❗ } .**\r\n\r\n**SUMMATION : -{ JUST AS LONG }-** as you go and see Black Widow with a \"Free and Open-mind\", prepared to be _Really, Really_ -{ Entertained }- . In 'my-specific' case, the ( obvious ) \"Anachronistic\" aspect of said movie . . .  -{ _D I D_ }- . . . in fact make the prospect of watching it ( in the days leading up to B.W's release ) feel a tad bit strange, if you will. However, once I was actually -{ in }- my seat, the -\"fabulous, Even Bond-esque\"- intro sequence started to work its 'Insta' magic on me . . . . and then . . . . when that ever familiar, ever Dramatic, and yes, ever -Beloved- Marvel theme roared through the massive cinema hall I was in, it all just \"Snapped\" into place . An -Unabashed- , \"Explosive\" **13.00 MARKS OUT OF 10.00 MARKS** From Me . Oh and yes, Scarlett Johansson, you will be \" sorely , but Surely , & Dearly \" . . . _M I S S E D_ . . . as \" _T H E_ \" Black Widow . **->-{ • W • O • W • }->- , \"1 POST-CREDITS APPEARANCE\" , AND 8 \"FULL-BLOWN\" STARRING ROLES LATER ( A WHOPPING -_NINE_- FILMS IN TOTAL ) . . . . WHAT A \" _SPECTACULARLY MEMORABLE_ \" JOURNEY IT'S BEEN ❤❗.**", "created_at": "2021-07-22T06:18:24.643Z"}, {"movie_id": 497698, "review_id": "610526f4ee43e80027c25bc3", "author_rating": 2.0, "review_text": "Subpar Bond that believes it has emotional stakes isn't exactly a very winning formula. Far too much bad MCU banter to go with something that wants to be grounded and quite frankly none of the actors are quite adapt at those sitcomy whedonisms that these movies made mainstream (Pugh in particular is terrible at those bits). Some of the mid section action is better than average as far as those movies goes but anything with Taskmasker is very bad and the big end is terrible. Winstone villain made me miss when people like Lonsdale and Lee made lousy Moore Bond plots half watchable. The major limitation is that far too much of the emotional beats depend on what characters talk about their time together when they were a pretend family and altough Johansson and Pugh have good chemistry and Weisz and Harbour do as good job as possible under the circunstances of selling their regrets, there just isn't enough downtime between plot needs to anything of it truly land. I can get what Shortland was hoping to import into one of those but little actually works even with the benefit of a far more standalone movie than most of them. Also, strange how after a decade of postponing giving Johansson her movie, they did one in which she so often feels like a witness/connective MCU tissue for the main supporting characters family drama that they had to give her an extra subplot with her guilty over \"killing\" Winstone's daughter so it can feel like she has more material to work with. She is both the lead and the most extraneous part of her own movie", "created_at": "2021-07-31T10:33:24.408Z"}, {"movie_id": 497698, "review_id": "612025512e0697005da5a605", "author_rating": 8.0, "review_text": "Honestly, if Black Widow opened Marvel’s Phase 4, I would have been even more impressed. However, after seeing the deep dives into characters that had been on the sidelines for years, this movie felt very surface level of the complexity of Natasha Romanoff. She was taken as a child to learn how to be an assassin, she had to sacrifice her morals to leave her past behind, she basically remained an assassin for a different organization that turned out to be run by similarly bad people as those she left, and she is now on the run from the government that once hailed her a hero because she didn’t fall in line. Oh, and she is reconnecting with her past fake family that gave her and Yelena back to the Red Room as soon as the mission was over. The trauma this character endured would’ve been better explored as a mini series, rather than a movie that’s trying to simultaneously remind us of where Natasha was five years ago and also trying not to acknowledge that Natasha has no risk posed to her in this movie because we know she lives on past these events. However, very excited to see where Yelena goes in the future.", "created_at": "2021-08-20T21:57:37.514Z"}, {"movie_id": 497698, "review_id": "61397ca566a0d30042b56554", "author_rating": null, "review_text": "It was okay", "created_at": "2021-09-09T03:16:53.429Z"}, {"movie_id": 497698, "review_id": "6149fdd9cf9ba30067f39c1a", "author_rating": 1.0, "review_text": "It's crap, really. Nothing works in this movie.", "created_at": "2021-09-21T15:44:25.614Z"}, {"movie_id": 497698, "review_id": "615d92848e2ba6008beb8349", "author_rating": 6.0, "review_text": "Black Widow is worth seeing for Florence Pugh, the free-fall action sequence, and anything involving Taskmaster before it’s revealed who is under the mask. Everything else about Black Widow feels like it was done better by the films it was supposedly influenced by and mostly feels like a diluted imitation of Captain America: The Winter Soldier. It’s fantastic that women are getting more opportunities in big summer blockbusters like this one, but it’s also disheartening since their filmmaking skills are shackled to formulaic superfluity that obviously stands in the way of creating extraordinary cinema. \r\n\r\nFull review: https://geekshavegame.com/black-widow-review-espionage-exhaustion/", "created_at": "2021-10-06T12:11:48.151Z"}, {"movie_id": 497698, "review_id": "61eb80b74df29100435cc066", "author_rating": 9.0, "review_text": "Waited so long for this movie to come out and I was loaded with anticipation. \r\nWhen it finally landed I was so excited to watch it!\r\nI must say, it didn't go in the direction that I was expecting (based on the on the other solo movies)... but I was very pleasantly surprised, and it was way better than I was expecting it to be.\r\nI thoroughly enjoyed this movie, and it was a fitting tribute yo one of my favourite Marvel Universe characters.", "created_at": "2022-01-22T03:57:43.822Z"}, {"movie_id": 497698, "review_id": "6352fc01f8e98200817b13df", "author_rating": 6.0, "review_text": "**Black Widow is a decent MCU film with excellent entertaining characters but an average to disappointing story.**\r\n\r\nBlack Widow faced steep expectations as Marvel's first female-led film focused on a cherished MCU favorite. Black Widow's past was always shrouded in mystery and pain, but she was finally receiving the attention the hero deserved to dive into her past and celebrate Scarlett Johansson's super spy. With hopes high and fans wanting a Captain America: The Winter Soldier-type superhero espionage film, Black Widow, unfortunately, fell short. Nothing was particularly disappointing about the film. I had just hoped for so much more for the character and Scarlett Johansson at this point in the MCU's journey. The effects and action were decent. The villain was forgettable. The big defining Budapest incident was passed by with hardly any impact or emotional weight. Black Widow gets lost in all of the chaos of the film. The best part of the movie by far was the new characters played by Florence Pugh and David Harbor. They were highly entertaining, funny, and endearing. I hope to see Florence Pugh's Yelena Belova in many more Marvel films. Black Widow really was a decent entry in the Marvel universe and one of the better Phase 4 movies. Still, it didn't do Natasha Romanoff the justice she deserved leaving the character's best moments in other Marvel films that focused on other heroes.", "created_at": "2022-10-21T20:07:29.550Z"}, {"movie_id": 497698, "review_id": "63bb02f9fc31d300a8de1cff", "author_rating": 6.0, "review_text": "This is a self-contained origin story of Natasha Romanoff / Black Widow (Scarlett Johansson). No knowledge of the Avengers is required to watch this film, although, in a Marvel context, it happens after the civil war breaks up the Avengers of which Natasha was a part of. Effects and tension are amazing to watch and edge of seat but there's a payoff with plot. A familiar action film formula – _get and protect the MacGuffin while getting to the evil megalomaniac before he takes over the world_. The formula acts as a vehicle for pretty much non-stop action. If that’s enough for you then this is might be your perfect film.  The familial relationships and confronting her dark past promised in the advert don’t really deliver (although Natasha’s sister, Yelena is essential to this film) but if two hours of Scarlett Johansson kicking high-octane butt is your thing then you’re in for a treat. Too heavy on the action but fun to watch. 6/10", "created_at": "2023-01-08T17:52:57.738Z"}, {"movie_id": 497698, "review_id": "644ecc2e23168c030654e335", "author_rating": 7.0, "review_text": "There wasn't much about black widows history and background. So I really liked this movie. See how the character became her.", "created_at": "2023-04-30T20:14:38.289Z"}, {"movie_id": 497698, "review_id": "64bfa45b6d4c9700c5e3723f", "author_rating": 4.0, "review_text": "Black Widow ist der Beweis, dass auch weiblicher Regisseur nicht unbedingt mit starken Frauenfiguren umzugehen weiß. Der Beweis, dass auch mit einer interessanten MCU-Figur ein uninteressanter Film entstehen kann. Der Film zeigt auch, dass das MCU immer und immer wieder mit schwachen Antagonisten zu kämpfen hat, was bei einem Film, der weniger von seiner coolen Action, als vielmehr von seiner Story lebt einfach noch mehr ins Gewicht fällt. Ja, die Actionszenen des Films sind gut. Florence Pugh fügt sich als Schwester von Black Widow gut in das Universum ein und es ist auch schön mehr über die Vorgeschichte von Black Widow zu erfahren. Am Ende muss man allerdings auch sagen, dass Black Widow kein guter Film ist. Dafür überwiegen leider die genannten Schwächen zu sehr und Marvel hat zuletzt mit seinen starken Serien bewiesen, dass sie auch storylastigere Geschichten packend erzählen können. [Sneakfilm.de]", "created_at": "2023-07-25T10:30:51.934Z"}, {"movie_id": 497698, "review_id": "60db454f0b73160045632c08", "author_rating": null, "review_text": "After a delay lasting 19 months; the Marvel Cinematic Universe (MCU) has returned to the big screen with “Black Widow”. The film takes place between “Captain America: Civil War” and “Avengers: Infinity War”; audiences get more of the backstory of Natasha Romanoff (Scarlett Johansson), as we are introduced to her early life before the Red Room.\r\n\r\nThis is not to say that the film is an origin story as it uses her backstory through a clever introduction that establishes her “family” as sleeper agents in Ohio before they escape and she and her cover sister are tuned over for conditioning and training.\r\n\r\nSince Natasha is on the run from the authorities; she finds a remote location in Norway to bide her time. This does not last as a dangerous adversary known as the Taskmaster arrives and sets a chain of events into motion.\r\n\r\nNatasha has been sent a package from her cover sister Yelena (Florence Pugh) who also went through the Red Room and became a top assassin in the years since she and Natasha last saw one another.\r\n\r\nDespite her mixed feelings; Natasha ventures to Budapest and confronts Yelena who in turn reveals the package she sent her contains a compound that can free the other Black Widows from the control of the Red Room which despite Natasha’s insistence is still very much alive as is the head of the institute which she is convinced she killed long ago.\r\n\r\nWith Taskmaster and other Widows hot on their trail, Natasha and Yelena are forced to seek the help of their former “Father” the imprisoned hero Red Guardian (David Harbour), and their cover Mother Melina (Rachel Weisz), to find the location of the new Red Room; free the Widows, and end the program once and for all.\r\n\r\nWhat follows is an engaging story with solid action and effects that remains at its core a character story as Natasha attempts to reconcile her cover family with her new Avengers family and the pain of her upbringing and conditioning.\r\n\r\nMarvel resisted calls from some to release the film on Disney+ last year when the Pandemic caused multiple delays to the planned release dates. This decision to me was very wise as this is a film that needs to be seen and heard on the big screen as it is an experience that is best experienced in a cinema with others.\r\n\r\nWhile many attempts were made over the decades to adapt comic heroes to film and television; most of them came up lacking and disappointed fans of the source material. Marvel for over a decade has continued to succeed as they have a clear plan, cast well, and have engaging characters that develop over time.\r\n\r\n“Black Widow” fills in a missing gap of time in the MCU well and also sets up future adventures as a scene in the credits clearly links two of the live-action Disney+ series and shows that the long-term plan for the MCU continues and incorporates the film and television series well.\r\n\r\nFrom the moment the Marvel intro and music appeared on the screen until the very end; “Black Widow” was a very enjoyable and engaging blockbuster adventure that shows Marvel at the top of their game; and why they continue to set event-level movies not to miss.\r\n4 stars out of 5", "created_at": "2021-06-29T16:07:43.200Z"}, {"movie_id": 497698, "review_id": "60e74284b76cbb0073e80020", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-widow-spoiler-free-review\r\n\r\n\"Black Widow beautifully honors the iconic Natasha Romanoff, who finally receives the respectful, worthy solo film that her unforgettable legacy always deserved. Cate Shortland and Eric Pearson put together an MCU installment that doesn't really compare to any of the other origin flicks, profoundly examining the protagonist's dark past and her complex \"family\" through distinctly compelling storytelling. Scarlett Johansson shines one last time, interpreting the most impactful role of her career, but Florence Pugh comes close to stealing the spotlight by giving an absolutely phenomenal display. Boasting highly entertaining, mostly well-filmed action sequences, the main narrative follows a path with no surprises, as well as a generic villain, but the emotionally investing storylines regarding Natasha's personal motivations and Yelena's complex feelings keep the film remarkably captivating. The ending is as satisfying as I could have ever wished for. A loving farewell to a hero that inspired millions of viewers.\"\r\n\r\nRating: A-", "created_at": "2021-07-08T18:23:00.947Z"}, {"movie_id": 497698, "review_id": "60efa51fa44d09002d44c33a", "author_rating": null, "review_text": "The first half of black widow was very strong and emotional. Florence Pugh was stellar in this movie. She was brilliant in action sequences and I like the fun elements in her character. Yelena and Natasha's chemistry was too good. David Harbour also performed very well. \r\n\r\nThe action sequences were good but CGI was too weak in the 3d act. Also, I didn't like the changes in Natasha's character. She has no superpowers like other avengers. Her strong brain and mind combine to make her a lethal weapon but they showed her over powerful in this movie. \r\n\r\nThe inner wounds of Natasha were beautifully delivered in this movie. I liked the movie but because of Florence only.", "created_at": "2021-07-15T03:01:51.424Z"}, {"movie_id": 497698, "review_id": "60f90db0df857c0045b1f522", "author_rating": 10.0, "review_text": "**This Is A Thrilling , Beautiful &  VERY , VERY , VERY FUNNY Journey . . . BUT ALAS 😢 . . . It Will Of Course, -{ _INEVITABLY_ }- Be A \" Short-Lived \" One For S.J⚘. Welcome To The Age Of The Super🦸‍♀️ ANACHRONISTIC , Er , \" Prequel \"**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Full Length Review . \r\n\r\n____________________________________________________ \r\n\r\n Yelena Belova : { about Natasha Rommanoff.. and in -JEST- } \" ... You're such a _Poser_❗\" ⬜⬜⬜⬜\r\n\r\n____________________________________________________ \r\n\r\n**1. \" I Absolutely, Positively Loved It \" :** And I'm going to say that right off the bat. For what it's worth, I actually had to go see Black Widow, ( 'B.W' for short ), -twice- as I wasn't able to catch the beginning the first time around . . & ended up appreciating it -{ So }- much more the second time ; because, being a person with a difficult past myself . . the -Superb- , Intricate, ( and often super - Hilarious 🤣🤣🤣 - ) drama between the lead characters -{ Really }- hit home for me. So much so . . . That inasmuch as ( - I - ) was concerned atleast, just about the -{ Only }- flaw with this film for me, if any, was the altogether \"glaring\" fact that it is now all but -Certain- . . . That we -{ Won't }- see Scarlett Johansson ( 'S.J' for short ) . . . Reprise her fascinatingly complex, and truly \"Glorious\" role as -{ _THE_ }- Black Widow. No spoiler here b.t.w ...this \"Prequel\"-movie's place in the overall 'M.C.U' ( Marvel Cinematic Universe ) timeline has always been made -{ CRYSTAL 💎 }- clear by 'MARVEL STUDIOS'... from the very Get-go. I invite you in earnest, { -Especially- if you're somewhat new to the whole \"M.C.U-thing\" }, to view one particular -Official- trailer by them, the one -still- entitled \"New Trailer\", ( YouTube, Apr.03, 2021 ), where the, 'rationale' ( -if you will- ) for B.W is explained, um, \"Super\"-well . . and is narrated by -none- other than, you guessed it, the \"Hopelessly-Vivacious and yes, genuinely-Affable . . Ms. Johansson herself .\r\n\r\n**2. \" Loose Ends Are Tied Nicely \" :** Here's a small { but undeniably significant } example. The 'aforementioned' Ms. Johansson's seemingly -{ \"Random\" }- & generally inexplicable \"Suddenly-Blonde\" hair in 'Infinity War' . . . . . { a look that frankly, I never -Could- quite warm up to at the time, having ...( along with Millions-&-Millions of -Other- 'M.C.U afficionados', I'm sure )... come to entirely -Adore- her trademark \" Fiery Red-tresses Look 🔥 \" , over the years } . . . . . Was \" Finally \" explained to us. Looking to the 'bigger' things : Basically, the picture filled in a -{ Whole }- bunch of gaps and 'story-holes' for me { that would often -totally- have me headscratching for \"Answers\" in the unbearably -Long- spells between each successive new ( & 'ever More Madly' ) anticipated \"Massive\" New Marvel-release. And it managed to -Achieve- this by essentially showcasing a \"Wide\", ( frankly ), and previously -Unknown- array of intertwined \" Backstories 📚 \" ...( not to mention giving us a satisfyingly -thorough- insight into the smattering of \"badly damaged relationships left in the B.W's wake\" )... that occurred -{ Well before }- & indeed, leading up to, her \"very, very, very\" high-priced and hard-won \"Formal-entry Into Shield\" { and concomitant defection from the Russian Secret Service, the 'F.S.B' ( formerly the 'K.G.B' ) }. Hence, a big, loud { \" Kudos \" } to the wonderfully gifted -Miz- Jac Schaeffer and Ned Benson ( the story-writers ), as well as Eric Pearson ( the movie's screenwriter ) . \r\n\r\n**3. \" A Veritable -Explosion- . . . Of Talent \" :** A HUGE 👊💥, HEARTY PAT on the back is -{ Completely }- in order for **CATE SHORTLAND,** the Australian Directress of this U.S.D 200 Million cinematic 'Powder-keg\". Although she may have been \"hitherto\" -{ Relatively }- unknown to -many- , this tremendously accomplished native of Temora, New South Wales actually has, get this -{ Two Full Decades }- of both T.V, as well as Film direction Credits under her belt, with 2012's War-romance-drama 'Lore' being her highest earning movie to date ( until -Black Widow- of course, that is to say 😉 ). Not only has she very successfully managed to bring together a tremendously -Cohesive- Principal Cast just 'gushing' with absolutely -{ Stellar }- Talent, let's be clear ...( a quick, special \"Mention-of-note\" is altogether warranted here for the -Charmingly- bubbly & ever \"tenacious\" ( newcomer to -MARVEL- ) Florence Pugh, who well & truly excels in her portrayal of 'Yelena Belova' )... but the film-crew that she's \"assembled\" have -{ Also }- well & truly outdone themseves in -Every Single- aspect of the Production . . . With the mega-Stylistic & \"Dazzling\" fight choreography employed in the \"Widows training scene\", ( -trailers, also- ), featuring an F.S.B 'mini-battalion' of \" Spectacularly Luminescent 🖲 \" Black-&-Red clad 'elite Girl-assassins' . . . Being the one that stood out for me -{ Visually }- , more than -any- other, in the film. And last, but most definitely -Not- least ; a quick 'Special-mention' of the fact that the 5 -Individual- Russian accents performed by 5 of \"most\" important Principal actors, ( -each to its Very specific, varying degree- ), were pulled off, rather -{ \"Immaculately\" }- I might add, by 5 different actors from, well, -get this- **. . . . _the U.K, & the U.S.A_ { 👏❗ } .**\r\n\r\n**SUMMATION : -{ JUST AS LONG }-** as you go and see Black Widow with a \"Free and Open-mind\", prepared to be _Really, Really_ -{ Entertained }- . In 'my-specific' case, the ( obvious ) \"Anachronistic\" aspect of said movie . . .  -{ _D I D_ }- . . . in fact make the prospect of watching it ( in the days leading up to B.W's release ) feel a tad bit strange, if you will. However, once I was actually -{ in }- my seat, the -\"fabulous, Even Bond-esque\"- intro sequence started to work its 'Insta' magic on me . . . . and then . . . . when that ever familiar, ever Dramatic, and yes, ever -Beloved- Marvel theme roared through the massive cinema hall I was in, it all just \"Snapped\" into place . An -Unabashed- , \"Explosive\" **13.00 MARKS OUT OF 10.00 MARKS** From Me . Oh and yes, Scarlett Johansson, you will be \" sorely , but Surely , & Dearly \" . . . _M I S S E D_ . . . as \" _T H E_ \" Black Widow . **->-{ • W • O • W • }->- , \"1 POST-CREDITS APPEARANCE\" , AND 8 \"FULL-BLOWN\" STARRING ROLES LATER ( A WHOPPING -_NINE_- FILMS IN TOTAL ) . . . . WHAT A \" _SPECTACULARLY MEMORABLE_ \" JOURNEY IT'S BEEN ❤❗.**", "created_at": "2021-07-22T06:18:24.643Z"}, {"movie_id": 497698, "review_id": "610526f4ee43e80027c25bc3", "author_rating": 2.0, "review_text": "Subpar Bond that believes it has emotional stakes isn't exactly a very winning formula. Far too much bad MCU banter to go with something that wants to be grounded and quite frankly none of the actors are quite adapt at those sitcomy whedonisms that these movies made mainstream (Pugh in particular is terrible at those bits). Some of the mid section action is better than average as far as those movies goes but anything with Taskmasker is very bad and the big end is terrible. Winstone villain made me miss when people like Lonsdale and Lee made lousy Moore Bond plots half watchable. The major limitation is that far too much of the emotional beats depend on what characters talk about their time together when they were a pretend family and altough Johansson and Pugh have good chemistry and Weisz and Harbour do as good job as possible under the circunstances of selling their regrets, there just isn't enough downtime between plot needs to anything of it truly land. I can get what Shortland was hoping to import into one of those but little actually works even with the benefit of a far more standalone movie than most of them. Also, strange how after a decade of postponing giving Johansson her movie, they did one in which she so often feels like a witness/connective MCU tissue for the main supporting characters family drama that they had to give her an extra subplot with her guilty over \"killing\" Winstone's daughter so it can feel like she has more material to work with. She is both the lead and the most extraneous part of her own movie", "created_at": "2021-07-31T10:33:24.408Z"}, {"movie_id": 497698, "review_id": "612025512e0697005da5a605", "author_rating": 8.0, "review_text": "Honestly, if Black Widow opened Marvel’s Phase 4, I would have been even more impressed. However, after seeing the deep dives into characters that had been on the sidelines for years, this movie felt very surface level of the complexity of Natasha Romanoff. She was taken as a child to learn how to be an assassin, she had to sacrifice her morals to leave her past behind, she basically remained an assassin for a different organization that turned out to be run by similarly bad people as those she left, and she is now on the run from the government that once hailed her a hero because she didn’t fall in line. Oh, and she is reconnecting with her past fake family that gave her and Yelena back to the Red Room as soon as the mission was over. The trauma this character endured would’ve been better explored as a mini series, rather than a movie that’s trying to simultaneously remind us of where Natasha was five years ago and also trying not to acknowledge that Natasha has no risk posed to her in this movie because we know she lives on past these events. However, very excited to see where Yelena goes in the future.", "created_at": "2021-08-20T21:57:37.514Z"}, {"movie_id": 497698, "review_id": "61397ca566a0d30042b56554", "author_rating": null, "review_text": "It was okay", "created_at": "2021-09-09T03:16:53.429Z"}, {"movie_id": 497698, "review_id": "6149fdd9cf9ba30067f39c1a", "author_rating": 1.0, "review_text": "It's crap, really. Nothing works in this movie.", "created_at": "2021-09-21T15:44:25.614Z"}, {"movie_id": 497698, "review_id": "615d92848e2ba6008beb8349", "author_rating": 6.0, "review_text": "Black Widow is worth seeing for Florence Pugh, the free-fall action sequence, and anything involving Taskmaster before it’s revealed who is under the mask. Everything else about Black Widow feels like it was done better by the films it was supposedly influenced by and mostly feels like a diluted imitation of Captain America: The Winter Soldier. It’s fantastic that women are getting more opportunities in big summer blockbusters like this one, but it’s also disheartening since their filmmaking skills are shackled to formulaic superfluity that obviously stands in the way of creating extraordinary cinema. \r\n\r\nFull review: https://geekshavegame.com/black-widow-review-espionage-exhaustion/", "created_at": "2021-10-06T12:11:48.151Z"}, {"movie_id": 497698, "review_id": "61eb80b74df29100435cc066", "author_rating": 9.0, "review_text": "Waited so long for this movie to come out and I was loaded with anticipation. \r\nWhen it finally landed I was so excited to watch it!\r\nI must say, it didn't go in the direction that I was expecting (based on the on the other solo movies)... but I was very pleasantly surprised, and it was way better than I was expecting it to be.\r\nI thoroughly enjoyed this movie, and it was a fitting tribute yo one of my favourite Marvel Universe characters.", "created_at": "2022-01-22T03:57:43.822Z"}, {"movie_id": 497698, "review_id": "6352fc01f8e98200817b13df", "author_rating": 6.0, "review_text": "**Black Widow is a decent MCU film with excellent entertaining characters but an average to disappointing story.**\r\n\r\nBlack Widow faced steep expectations as Marvel's first female-led film focused on a cherished MCU favorite. Black Widow's past was always shrouded in mystery and pain, but she was finally receiving the attention the hero deserved to dive into her past and celebrate Scarlett Johansson's super spy. With hopes high and fans wanting a Captain America: The Winter Soldier-type superhero espionage film, Black Widow, unfortunately, fell short. Nothing was particularly disappointing about the film. I had just hoped for so much more for the character and Scarlett Johansson at this point in the MCU's journey. The effects and action were decent. The villain was forgettable. The big defining Budapest incident was passed by with hardly any impact or emotional weight. Black Widow gets lost in all of the chaos of the film. The best part of the movie by far was the new characters played by Florence Pugh and David Harbor. They were highly entertaining, funny, and endearing. I hope to see Florence Pugh's Yelena Belova in many more Marvel films. Black Widow really was a decent entry in the Marvel universe and one of the better Phase 4 movies. Still, it didn't do Natasha Romanoff the justice she deserved leaving the character's best moments in other Marvel films that focused on other heroes.", "created_at": "2022-10-21T20:07:29.550Z"}, {"movie_id": 497698, "review_id": "63bb02f9fc31d300a8de1cff", "author_rating": 6.0, "review_text": "This is a self-contained origin story of Natasha Romanoff / Black Widow (Scarlett Johansson). No knowledge of the Avengers is required to watch this film, although, in a Marvel context, it happens after the civil war breaks up the Avengers of which Natasha was a part of. Effects and tension are amazing to watch and edge of seat but there's a payoff with plot. A familiar action film formula – _get and protect the MacGuffin while getting to the evil megalomaniac before he takes over the world_. The formula acts as a vehicle for pretty much non-stop action. If that’s enough for you then this is might be your perfect film.  The familial relationships and confronting her dark past promised in the advert don’t really deliver (although Natasha’s sister, Yelena is essential to this film) but if two hours of Scarlett Johansson kicking high-octane butt is your thing then you’re in for a treat. Too heavy on the action but fun to watch. 6/10", "created_at": "2023-01-08T17:52:57.738Z"}, {"movie_id": 497698, "review_id": "644ecc2e23168c030654e335", "author_rating": 7.0, "review_text": "There wasn't much about black widows history and background. So I really liked this movie. See how the character became her.", "created_at": "2023-04-30T20:14:38.289Z"}, {"movie_id": 497698, "review_id": "64bfa45b6d4c9700c5e3723f", "author_rating": 4.0, "review_text": "Black Widow ist der Beweis, dass auch weiblicher Regisseur nicht unbedingt mit starken Frauenfiguren umzugehen weiß. Der Beweis, dass auch mit einer interessanten MCU-Figur ein uninteressanter Film entstehen kann. Der Film zeigt auch, dass das MCU immer und immer wieder mit schwachen Antagonisten zu kämpfen hat, was bei einem Film, der weniger von seiner coolen Action, als vielmehr von seiner Story lebt einfach noch mehr ins Gewicht fällt. Ja, die Actionszenen des Films sind gut. Florence Pugh fügt sich als Schwester von Black Widow gut in das Universum ein und es ist auch schön mehr über die Vorgeschichte von Black Widow zu erfahren. Am Ende muss man allerdings auch sagen, dass Black Widow kein guter Film ist. Dafür überwiegen leider die genannten Schwächen zu sehr und Marvel hat zuletzt mit seinen starken Serien bewiesen, dass sie auch storylastigere Geschichten packend erzählen können. [Sneakfilm.de]", "created_at": "2023-07-25T10:30:51.934Z"}, {"movie_id": 497698, "review_id": "60db454f0b73160045632c08", "author_rating": null, "review_text": "After a delay lasting 19 months; the Marvel Cinematic Universe (MCU) has returned to the big screen with “Black Widow”. The film takes place between “Captain America: Civil War” and “Avengers: Infinity War”; audiences get more of the backstory of Natasha Romanoff (Scarlett Johansson), as we are introduced to her early life before the Red Room.\r\n\r\nThis is not to say that the film is an origin story as it uses her backstory through a clever introduction that establishes her “family” as sleeper agents in Ohio before they escape and she and her cover sister are tuned over for conditioning and training.\r\n\r\nSince Natasha is on the run from the authorities; she finds a remote location in Norway to bide her time. This does not last as a dangerous adversary known as the Taskmaster arrives and sets a chain of events into motion.\r\n\r\nNatasha has been sent a package from her cover sister Yelena (Florence Pugh) who also went through the Red Room and became a top assassin in the years since she and Natasha last saw one another.\r\n\r\nDespite her mixed feelings; Natasha ventures to Budapest and confronts Yelena who in turn reveals the package she sent her contains a compound that can free the other Black Widows from the control of the Red Room which despite Natasha’s insistence is still very much alive as is the head of the institute which she is convinced she killed long ago.\r\n\r\nWith Taskmaster and other Widows hot on their trail, Natasha and Yelena are forced to seek the help of their former “Father” the imprisoned hero Red Guardian (David Harbour), and their cover Mother Melina (Rachel Weisz), to find the location of the new Red Room; free the Widows, and end the program once and for all.\r\n\r\nWhat follows is an engaging story with solid action and effects that remains at its core a character story as Natasha attempts to reconcile her cover family with her new Avengers family and the pain of her upbringing and conditioning.\r\n\r\nMarvel resisted calls from some to release the film on Disney+ last year when the Pandemic caused multiple delays to the planned release dates. This decision to me was very wise as this is a film that needs to be seen and heard on the big screen as it is an experience that is best experienced in a cinema with others.\r\n\r\nWhile many attempts were made over the decades to adapt comic heroes to film and television; most of them came up lacking and disappointed fans of the source material. Marvel for over a decade has continued to succeed as they have a clear plan, cast well, and have engaging characters that develop over time.\r\n\r\n“Black Widow” fills in a missing gap of time in the MCU well and also sets up future adventures as a scene in the credits clearly links two of the live-action Disney+ series and shows that the long-term plan for the MCU continues and incorporates the film and television series well.\r\n\r\nFrom the moment the Marvel intro and music appeared on the screen until the very end; “Black Widow” was a very enjoyable and engaging blockbuster adventure that shows Marvel at the top of their game; and why they continue to set event-level movies not to miss.\r\n4 stars out of 5", "created_at": "2021-06-29T16:07:43.200Z"}, {"movie_id": 497698, "review_id": "60e74284b76cbb0073e80020", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-widow-spoiler-free-review\r\n\r\n\"Black Widow beautifully honors the iconic Natasha Romanoff, who finally receives the respectful, worthy solo film that her unforgettable legacy always deserved. Cate Shortland and Eric Pearson put together an MCU installment that doesn't really compare to any of the other origin flicks, profoundly examining the protagonist's dark past and her complex \"family\" through distinctly compelling storytelling. Scarlett Johansson shines one last time, interpreting the most impactful role of her career, but Florence Pugh comes close to stealing the spotlight by giving an absolutely phenomenal display. Boasting highly entertaining, mostly well-filmed action sequences, the main narrative follows a path with no surprises, as well as a generic villain, but the emotionally investing storylines regarding Natasha's personal motivations and Yelena's complex feelings keep the film remarkably captivating. The ending is as satisfying as I could have ever wished for. A loving farewell to a hero that inspired millions of viewers.\"\r\n\r\nRating: A-", "created_at": "2021-07-08T18:23:00.947Z"}, {"movie_id": 497698, "review_id": "60efa51fa44d09002d44c33a", "author_rating": null, "review_text": "The first half of black widow was very strong and emotional. Florence Pugh was stellar in this movie. She was brilliant in action sequences and I like the fun elements in her character. Yelena and Natasha's chemistry was too good. David Harbour also performed very well. \r\n\r\nThe action sequences were good but CGI was too weak in the 3d act. Also, I didn't like the changes in Natasha's character. She has no superpowers like other avengers. Her strong brain and mind combine to make her a lethal weapon but they showed her over powerful in this movie. \r\n\r\nThe inner wounds of Natasha were beautifully delivered in this movie. I liked the movie but because of Florence only.", "created_at": "2021-07-15T03:01:51.424Z"}, {"movie_id": 497698, "review_id": "60f90db0df857c0045b1f522", "author_rating": 10.0, "review_text": "**This Is A Thrilling , Beautiful &  VERY , VERY , VERY FUNNY Journey . . . BUT ALAS 😢 . . . It Will Of Course, -{ _INEVITABLY_ }- Be A \" Short-Lived \" One For S.J⚘. Welcome To The Age Of The Super🦸‍♀️ ANACHRONISTIC , Er , \" Prequel \"**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Full Length Review . \r\n\r\n____________________________________________________ \r\n\r\n Yelena Belova : { about Natasha Rommanoff.. and in -JEST- } \" ... You're such a _Poser_❗\" ⬜⬜⬜⬜\r\n\r\n____________________________________________________ \r\n\r\n**1. \" I Absolutely, Positively Loved It \" :** And I'm going to say that right off the bat. For what it's worth, I actually had to go see Black Widow, ( 'B.W' for short ), -twice- as I wasn't able to catch the beginning the first time around . . & ended up appreciating it -{ So }- much more the second time ; because, being a person with a difficult past myself . . the -Superb- , Intricate, ( and often super - Hilarious 🤣🤣🤣 - ) drama between the lead characters -{ Really }- hit home for me. So much so . . . That inasmuch as ( - I - ) was concerned atleast, just about the -{ Only }- flaw with this film for me, if any, was the altogether \"glaring\" fact that it is now all but -Certain- . . . That we -{ Won't }- see Scarlett Johansson ( 'S.J' for short ) . . . Reprise her fascinatingly complex, and truly \"Glorious\" role as -{ _THE_ }- Black Widow. No spoiler here b.t.w ...this \"Prequel\"-movie's place in the overall 'M.C.U' ( Marvel Cinematic Universe ) timeline has always been made -{ CRYSTAL 💎 }- clear by 'MARVEL STUDIOS'... from the very Get-go. I invite you in earnest, { -Especially- if you're somewhat new to the whole \"M.C.U-thing\" }, to view one particular -Official- trailer by them, the one -still- entitled \"New Trailer\", ( YouTube, Apr.03, 2021 ), where the, 'rationale' ( -if you will- ) for B.W is explained, um, \"Super\"-well . . and is narrated by -none- other than, you guessed it, the \"Hopelessly-Vivacious and yes, genuinely-Affable . . Ms. Johansson herself .\r\n\r\n**2. \" Loose Ends Are Tied Nicely \" :** Here's a small { but undeniably significant } example. The 'aforementioned' Ms. Johansson's seemingly -{ \"Random\" }- & generally inexplicable \"Suddenly-Blonde\" hair in 'Infinity War' . . . . . { a look that frankly, I never -Could- quite warm up to at the time, having ...( along with Millions-&-Millions of -Other- 'M.C.U afficionados', I'm sure )... come to entirely -Adore- her trademark \" Fiery Red-tresses Look 🔥 \" , over the years } . . . . . Was \" Finally \" explained to us. Looking to the 'bigger' things : Basically, the picture filled in a -{ Whole }- bunch of gaps and 'story-holes' for me { that would often -totally- have me headscratching for \"Answers\" in the unbearably -Long- spells between each successive new ( & 'ever More Madly' ) anticipated \"Massive\" New Marvel-release. And it managed to -Achieve- this by essentially showcasing a \"Wide\", ( frankly ), and previously -Unknown- array of intertwined \" Backstories 📚 \" ...( not to mention giving us a satisfyingly -thorough- insight into the smattering of \"badly damaged relationships left in the B.W's wake\" )... that occurred -{ Well before }- & indeed, leading up to, her \"very, very, very\" high-priced and hard-won \"Formal-entry Into Shield\" { and concomitant defection from the Russian Secret Service, the 'F.S.B' ( formerly the 'K.G.B' ) }. Hence, a big, loud { \" Kudos \" } to the wonderfully gifted -Miz- Jac Schaeffer and Ned Benson ( the story-writers ), as well as Eric Pearson ( the movie's screenwriter ) . \r\n\r\n**3. \" A Veritable -Explosion- . . . Of Talent \" :** A HUGE 👊💥, HEARTY PAT on the back is -{ Completely }- in order for **CATE SHORTLAND,** the Australian Directress of this U.S.D 200 Million cinematic 'Powder-keg\". Although she may have been \"hitherto\" -{ Relatively }- unknown to -many- , this tremendously accomplished native of Temora, New South Wales actually has, get this -{ Two Full Decades }- of both T.V, as well as Film direction Credits under her belt, with 2012's War-romance-drama 'Lore' being her highest earning movie to date ( until -Black Widow- of course, that is to say 😉 ). Not only has she very successfully managed to bring together a tremendously -Cohesive- Principal Cast just 'gushing' with absolutely -{ Stellar }- Talent, let's be clear ...( a quick, special \"Mention-of-note\" is altogether warranted here for the -Charmingly- bubbly & ever \"tenacious\" ( newcomer to -MARVEL- ) Florence Pugh, who well & truly excels in her portrayal of 'Yelena Belova' )... but the film-crew that she's \"assembled\" have -{ Also }- well & truly outdone themseves in -Every Single- aspect of the Production . . . With the mega-Stylistic & \"Dazzling\" fight choreography employed in the \"Widows training scene\", ( -trailers, also- ), featuring an F.S.B 'mini-battalion' of \" Spectacularly Luminescent 🖲 \" Black-&-Red clad 'elite Girl-assassins' . . . Being the one that stood out for me -{ Visually }- , more than -any- other, in the film. And last, but most definitely -Not- least ; a quick 'Special-mention' of the fact that the 5 -Individual- Russian accents performed by 5 of \"most\" important Principal actors, ( -each to its Very specific, varying degree- ), were pulled off, rather -{ \"Immaculately\" }- I might add, by 5 different actors from, well, -get this- **. . . . _the U.K, & the U.S.A_ { 👏❗ } .**\r\n\r\n**SUMMATION : -{ JUST AS LONG }-** as you go and see Black Widow with a \"Free and Open-mind\", prepared to be _Really, Really_ -{ Entertained }- . In 'my-specific' case, the ( obvious ) \"Anachronistic\" aspect of said movie . . .  -{ _D I D_ }- . . . in fact make the prospect of watching it ( in the days leading up to B.W's release ) feel a tad bit strange, if you will. However, once I was actually -{ in }- my seat, the -\"fabulous, Even Bond-esque\"- intro sequence started to work its 'Insta' magic on me . . . . and then . . . . when that ever familiar, ever Dramatic, and yes, ever -Beloved- Marvel theme roared through the massive cinema hall I was in, it all just \"Snapped\" into place . An -Unabashed- , \"Explosive\" **13.00 MARKS OUT OF 10.00 MARKS** From Me . Oh and yes, Scarlett Johansson, you will be \" sorely , but Surely , & Dearly \" . . . _M I S S E D_ . . . as \" _T H E_ \" Black Widow . **->-{ • W • O • W • }->- , \"1 POST-CREDITS APPEARANCE\" , AND 8 \"FULL-BLOWN\" STARRING ROLES LATER ( A WHOPPING -_NINE_- FILMS IN TOTAL ) . . . . WHAT A \" _SPECTACULARLY MEMORABLE_ \" JOURNEY IT'S BEEN ❤❗.**", "created_at": "2021-07-22T06:18:24.643Z"}, {"movie_id": 497698, "review_id": "610526f4ee43e80027c25bc3", "author_rating": 2.0, "review_text": "Subpar Bond that believes it has emotional stakes isn't exactly a very winning formula. Far too much bad MCU banter to go with something that wants to be grounded and quite frankly none of the actors are quite adapt at those sitcomy whedonisms that these movies made mainstream (Pugh in particular is terrible at those bits). Some of the mid section action is better than average as far as those movies goes but anything with Taskmasker is very bad and the big end is terrible. Winstone villain made me miss when people like Lonsdale and Lee made lousy Moore Bond plots half watchable. The major limitation is that far too much of the emotional beats depend on what characters talk about their time together when they were a pretend family and altough Johansson and Pugh have good chemistry and Weisz and Harbour do as good job as possible under the circunstances of selling their regrets, there just isn't enough downtime between plot needs to anything of it truly land. I can get what Shortland was hoping to import into one of those but little actually works even with the benefit of a far more standalone movie than most of them. Also, strange how after a decade of postponing giving Johansson her movie, they did one in which she so often feels like a witness/connective MCU tissue for the main supporting characters family drama that they had to give her an extra subplot with her guilty over \"killing\" Winstone's daughter so it can feel like she has more material to work with. She is both the lead and the most extraneous part of her own movie", "created_at": "2021-07-31T10:33:24.408Z"}, {"movie_id": 497698, "review_id": "612025512e0697005da5a605", "author_rating": 8.0, "review_text": "Honestly, if Black Widow opened Marvel’s Phase 4, I would have been even more impressed. However, after seeing the deep dives into characters that had been on the sidelines for years, this movie felt very surface level of the complexity of Natasha Romanoff. She was taken as a child to learn how to be an assassin, she had to sacrifice her morals to leave her past behind, she basically remained an assassin for a different organization that turned out to be run by similarly bad people as those she left, and she is now on the run from the government that once hailed her a hero because she didn’t fall in line. Oh, and she is reconnecting with her past fake family that gave her and Yelena back to the Red Room as soon as the mission was over. The trauma this character endured would’ve been better explored as a mini series, rather than a movie that’s trying to simultaneously remind us of where Natasha was five years ago and also trying not to acknowledge that Natasha has no risk posed to her in this movie because we know she lives on past these events. However, very excited to see where Yelena goes in the future.", "created_at": "2021-08-20T21:57:37.514Z"}, {"movie_id": 497698, "review_id": "61397ca566a0d30042b56554", "author_rating": null, "review_text": "It was okay", "created_at": "2021-09-09T03:16:53.429Z"}, {"movie_id": 497698, "review_id": "6149fdd9cf9ba30067f39c1a", "author_rating": 1.0, "review_text": "It's crap, really. Nothing works in this movie.", "created_at": "2021-09-21T15:44:25.614Z"}, {"movie_id": 497698, "review_id": "615d92848e2ba6008beb8349", "author_rating": 6.0, "review_text": "Black Widow is worth seeing for Florence Pugh, the free-fall action sequence, and anything involving Taskmaster before it’s revealed who is under the mask. Everything else about Black Widow feels like it was done better by the films it was supposedly influenced by and mostly feels like a diluted imitation of Captain America: The Winter Soldier. It’s fantastic that women are getting more opportunities in big summer blockbusters like this one, but it’s also disheartening since their filmmaking skills are shackled to formulaic superfluity that obviously stands in the way of creating extraordinary cinema. \r\n\r\nFull review: https://geekshavegame.com/black-widow-review-espionage-exhaustion/", "created_at": "2021-10-06T12:11:48.151Z"}, {"movie_id": 497698, "review_id": "61eb80b74df29100435cc066", "author_rating": 9.0, "review_text": "Waited so long for this movie to come out and I was loaded with anticipation. \r\nWhen it finally landed I was so excited to watch it!\r\nI must say, it didn't go in the direction that I was expecting (based on the on the other solo movies)... but I was very pleasantly surprised, and it was way better than I was expecting it to be.\r\nI thoroughly enjoyed this movie, and it was a fitting tribute yo one of my favourite Marvel Universe characters.", "created_at": "2022-01-22T03:57:43.822Z"}, {"movie_id": 497698, "review_id": "6352fc01f8e98200817b13df", "author_rating": 6.0, "review_text": "**Black Widow is a decent MCU film with excellent entertaining characters but an average to disappointing story.**\r\n\r\nBlack Widow faced steep expectations as Marvel's first female-led film focused on a cherished MCU favorite. Black Widow's past was always shrouded in mystery and pain, but she was finally receiving the attention the hero deserved to dive into her past and celebrate Scarlett Johansson's super spy. With hopes high and fans wanting a Captain America: The Winter Soldier-type superhero espionage film, Black Widow, unfortunately, fell short. Nothing was particularly disappointing about the film. I had just hoped for so much more for the character and Scarlett Johansson at this point in the MCU's journey. The effects and action were decent. The villain was forgettable. The big defining Budapest incident was passed by with hardly any impact or emotional weight. Black Widow gets lost in all of the chaos of the film. The best part of the movie by far was the new characters played by Florence Pugh and David Harbor. They were highly entertaining, funny, and endearing. I hope to see Florence Pugh's Yelena Belova in many more Marvel films. Black Widow really was a decent entry in the Marvel universe and one of the better Phase 4 movies. Still, it didn't do Natasha Romanoff the justice she deserved leaving the character's best moments in other Marvel films that focused on other heroes.", "created_at": "2022-10-21T20:07:29.550Z"}, {"movie_id": 497698, "review_id": "63bb02f9fc31d300a8de1cff", "author_rating": 6.0, "review_text": "This is a self-contained origin story of Natasha Romanoff / Black Widow (Scarlett Johansson). No knowledge of the Avengers is required to watch this film, although, in a Marvel context, it happens after the civil war breaks up the Avengers of which Natasha was a part of. Effects and tension are amazing to watch and edge of seat but there's a payoff with plot. A familiar action film formula – _get and protect the MacGuffin while getting to the evil megalomaniac before he takes over the world_. The formula acts as a vehicle for pretty much non-stop action. If that’s enough for you then this is might be your perfect film.  The familial relationships and confronting her dark past promised in the advert don’t really deliver (although Natasha’s sister, Yelena is essential to this film) but if two hours of Scarlett Johansson kicking high-octane butt is your thing then you’re in for a treat. Too heavy on the action but fun to watch. 6/10", "created_at": "2023-01-08T17:52:57.738Z"}, {"movie_id": 497698, "review_id": "644ecc2e23168c030654e335", "author_rating": 7.0, "review_text": "There wasn't much about black widows history and background. So I really liked this movie. See how the character became her.", "created_at": "2023-04-30T20:14:38.289Z"}, {"movie_id": 497698, "review_id": "64bfa45b6d4c9700c5e3723f", "author_rating": 4.0, "review_text": "Black Widow ist der Beweis, dass auch weiblicher Regisseur nicht unbedingt mit starken Frauenfiguren umzugehen weiß. Der Beweis, dass auch mit einer interessanten MCU-Figur ein uninteressanter Film entstehen kann. Der Film zeigt auch, dass das MCU immer und immer wieder mit schwachen Antagonisten zu kämpfen hat, was bei einem Film, der weniger von seiner coolen Action, als vielmehr von seiner Story lebt einfach noch mehr ins Gewicht fällt. Ja, die Actionszenen des Films sind gut. Florence Pugh fügt sich als Schwester von Black Widow gut in das Universum ein und es ist auch schön mehr über die Vorgeschichte von Black Widow zu erfahren. Am Ende muss man allerdings auch sagen, dass Black Widow kein guter Film ist. Dafür überwiegen leider die genannten Schwächen zu sehr und Marvel hat zuletzt mit seinen starken Serien bewiesen, dass sie auch storylastigere Geschichten packend erzählen können. [Sneakfilm.de]", "created_at": "2023-07-25T10:30:51.934Z"}]