[{"movie_id": 333484, "review_id": "57e8d5e9c3a3687c180059c9", "author_rating": null, "review_text": "The western genre has gradually been making its way back into the cinematic fold. Recent dusty trail ditties such as David McKenzie's modern-day _Hell or High Water_ or Quentin Tarantino's _The Hateful Eight_ have proven to be recent saddle-tested gems that enthusiastically put cowpoke enthusiasts in movie theater seats. Furthermore, what would Hollywood do if it did not predictably invite yet another remake of a classic film into the moviegoers' mindset? Hence, director Antoine Fuqua takes a challenging stab at generating interest in his latest workman-like western shoot 'em up in the millennium-made version of **The Magnificent Seven**. \r\n\r\nNaturally, Fuqua's chaotic and calculating gun-toting actioner is an updated remake of director John Sturges's 1960 film that starred late iconic box office big stars such as Yul Brynner, Steve McQueen, Charles Bronson and Eli Wallach. Of course in return Sturges's borrowed his artistic gun-for-hire gumption from legendary Japanese auteur Akiro Kurosawa's vintage and influential _Seven Samurai_. Fuqua, whose gritty urban police drama _Training Day_ secured a Best Actor Oscar for his **The Magnificent Seven** leading man in two-time Academy Award winner Denzel Washington, takes on the retelling of his particular _Seven_ with feisty fury. One would not necessary anoint Fuqua's outlaw tale as a superior successor to Sturges's borrowed blueprint from Kurosawa. However, Fuqua's array of blazing bullets from his bunch of rag tag bad boys has its own distinctive sense of decorative dare and destruction that feels authentic.\r\n\r\nScreenwriters Nic Pizzolatto (\"True Detective\")and Richard Wenk deliver an unapologetic script that calls for high body counts, old-fashioned showdowns and a wild west waywardness that swaggers courtesy of Fuqua's corrosive crew. The popcorn entertainment in **The Magnificent Seven** is strictly in guilty pleasure territory so there is no need to tighten up your holsters for all you little buckaroos that are eager to wallow in Fuqua's cutthroat corral of gunslingers.   \r\n\r\nMustached bounty hunter Sam Chisolm (Washington) is the all-dressed-in-black avenger whose mission is to provide protection for the town of Rose Creek, New Mexico. In his ambitious bid to save the jeopardized Rose Creek he must assembled a group of skilled gunmen able to stand up to the diabolical powers-that-be that look to foster the on-going havoc that prevails. \r\n\r\nSpecifically, Rose Creek is under the dastardly control of the diabolical Bartholomew Bogue (Peter Sarsgaard) that rules the town with an iron fist. The opening scene demonstrates how nefarious Bogue is at heart because he has no qualms about seizing land from its vulnerable owners or quieting down his critics with intimidating force. Basically, Bogue and his hideous henchmen are not to be reckoned with at all--unless you are willing to match wicked-minded wits with the raw and rough Chisolm and his gun-wielding renegades.\r\n\r\nRose Creek resident Emma Cullen (Haley Bennett, \"Music in Lyrics\", \"The Girl on the Train\") steps up to the plate in her effort to confront the nasty Bogue the only best way she knows how--hiring the capable and crafty collection of the Seven to contain this intimidating menace.\r\n\r\nJoining Chisolm in his bloody quest to rescue Rose Creek from Bogue's disturbing clutches are explosives expert gambler Josh Farraday (Chris Pratt), and conflicted sharpshooter Goodnight Robicheaux (Ethan Hawke reuniting with his \"Training Day\" director and co-star Fuqua and Washington). The rest of the tag-a-longs include the outlandishly bearded Jack Horne (Vincent D'Onofrio from TV's \"Law & Order: Criminal Intent\"), Billy Rocks (Byung-hun Lee), Vasquez (Manuel Garcia-Rulfo) and Red Harvest (Martin Seinsmeier). Together, the anti-heroes known as the Magnificent Seven hope to meet the expectations of Emma's (and the town's) cause and eradicate the villainous Bogue by any means necessary.    \r\n\r\n**The Magnificent Seven** certainly does not have any pretensions about posing as a conscious-minded, revisionist western as it definitely does not have the prolific pedigree such as Clint Eastwood's _Unforgiven_ for instance. Nevertheless, the film does have a devilish impishness as its main function is to echo an exaggerated rustic feel to its throwback acknowledgement when westerns of yesteryear were just plain frivolous and furious without any particular rhyme or reason.\r\n\r\nSure, the characters have really no inside depth beyond their taste for roughshod recklessness and wild tumbleweed theatrics. This is not necessarily a bad thing to consider in Fuqua's **The Magnificent Seven** because the name of the game is serving up an escapist need for its giddy-up rush for the senses. Indeed, Washington and company will not make anybody forget the aforementioned Brynner and his squad from nearly six decades ago. Still, this particular _Seven_ has its own kind of favorable punch to savor. \r\n\r\nThe notable names in _Seven_ do rise to the occasion within the context of this otherwise basic story of the wannabe borderline good guys versus the bombastic bad guys. Washington's Chisolm is solidly smooth as charismatic as the leader of the pack. Pratt's Farraday is a charming hoot as the roguish gambling cad. Hawke's Goodnight does a decent job portraying the talented gun handler simply trying to get his groove back due to his shaken confidence from a prior incident (yes, the catchy movie moniker of Goodnight Robicheaux is a keeper to say the least). And D'Onofrio's amusing Horne is deliciously irreverent. The always adventurous Sarsgaard comes to life as the vile wonder whose presence inspires the Seven to tap into vengeance mode. \r\n\r\nAt the end of the roundup it is quite clear that **The Magnificent Seven** wants to lasso its penchant for resembling a showy Hollywood western even if it is at the expense of lifting its rowdy roots from the likes of its highly regarded predecessors from golden cinema's treasured past.    \r\n\r\n**The Magnificent Seven** (2016)\r\n\r\nSony Pictures\r\n\r\n2 hrs. 12 mins.\r\n\r\nStarring: Denzel Washington, Chris Pratt, Ethan Hawke, Peter Sarsgaard, Haley Bennett, Vincent D'Onofrio, Byung-hun Lee, Maunel Garcia Rulfo, Martin Sensmeier\r\n\r\nDirected by: Antoine Fuqua\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Western/Drama/Action and Adventure\r\n\r\nCritic's rating: ** 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-09-26T08:01:45.062Z"}, {"movie_id": 333484, "review_id": "57eb62e9c3a36836f10021c8", "author_rating": null, "review_text": "In 1879, degenerate industrialist Bartholomew Bogue (Peter Sarsgaard) blockades the mining town of Rose Creek, and butchers a gathering of local people drove by Matthew Cullen (Matt Bomer) when they endeavor to confront him. Matthew's better half, Emma Cullen (Haley Bennett), and her companion, Teddy Q (Luke Grimes), ride to the closest town looking for somebody who can help them and happen upon abundance seeker Sam Chisolm (Denzel Washington), who at first decays their proposition until he learns of Bogue's contribution. \r\n\r\nChisolm embarks to enlist a gathering of gunslingers who can help him, beginning with card shark Josh Faraday (Chris Pratt).Watch and download \"The Megneficent Seven\" here _**movies watch free**_ They are later joined by sharpshooter Goodnight Robicheaux (Ethan Hawke), blade employing professional killer Billy Rocks (Byung-hun Lee), gifted tracker Jack Horne, Comanche warrior Red Harvest and famous Mexican criminal Vasquez (Manuel Garcia-Rulfo). \r\n\r\nTouching base in Rose Creek, the seven take part in a gunfight with Bogue's implementer McCann (Cam Gigandet) and his men and push them away with a notice to allow Rose Creek to sit unbothered. Construing that Bogue and his strengths will return in seven days, the seven and Cullen train the sportspeople to guard their home and become attached to them. Watch and download \"The Megneficent Seven\" here **movies watch free** Robicheaux, frequented by the abhorrences of the Civil War and dreading the unavoidable executing he will be a piece of, forsakes the gathering and is supplanted by Cullen. \r\n\r\nBogue touches base with his strengths and assaults the city, however the desperados are trapped by the townspeople, prompting a shootout amid which Robicheaux rejoins the gathering, McCann is murdered by Vasquez, and Horne is executed by Bogue's Comanche professional killer Denali (Jonathan Joss), who is later slaughtered by Red Harvest. Watch and download \"The Megneficent Seven\" here _movies watch free_. Bogue then divulges his mystery weapon, a Gatling firearm, with which he executes various innocents. Acknowledging they're outgunned, the seven push the townspeople away and mount their last stand. \r\n\r\nRobicheaux and Rocks are killed by a second round of gunfire as Faraday penances himself to demolish the Gatling firearm and whatever is left of Bogue's men, riding up to them in a last charge and afterward exploding a stick of explosive right beside the weapon. Bogue escapes into town, where he is faced by Chisolm, who incapacitates and wounds Bogue. Watch and download \"The Megneficent Seven\" here <a href=\"https://internetmovies4free.blogspot.com/\">movies watch free</a>. As Chisolm is choking Bogue, he uncovers that Bogue and his men assaulted and killed his mom and sister amid an attack quite a long while prior, in which he himself survived being hanged. Bogue is then lethally shot by Cullen while going after a shrouded weapon in his boot. \r\n\r\nIn the fallout, Faraday, Robicheaux, Rocks and Horne are covered around the local area and respected by the general population of Rose Creek as saints, while Chisolm, Vasquez and Red Harvest ride off, with Cullen commenting that their gallantry made them legends. Watch and download \"The Megneficent Seven\" here _movies watch free_.", "created_at": "2016-09-28T06:27:53.349Z"}, {"movie_id": 333484, "review_id": "585ed858c3a3681a7701240e", "author_rating": 7.0, "review_text": "**The new seven, all unique and diversified!**\r\n\r\nBasically, people watch it for either those actors and the director or for an entertertainment. But we all know the story, how it begins and how it ends, since it was the remake of the 1960 film. Actually, it was a successful remake, but not as magnificent as the original. Maybe the youngsters might like this one better.\r\n\r\nThe director's favourite, Denzel Washington in one of the main characters. Not much change in the theme, except the screenplay was little altered, especially diversity in the film characters and their developments. Because nowadays that's a big issue in Hollywood cinema. So it was led by Denzel and possibly there will be a sequel like the 'Ocean's' trilogy.\r\n\r\nThe people from a small mining town decides to hire men with guns to fight the villainous businessman who slaughtered their loved ones. The unusual seven men come together and form a team with a plan to defend the town. So what comes next is the battle between the good and the bad that lasts for the whole final act.\r\n\r\nThe setting was completely refreshing, but slightly disappointing action sequences. All the seven characters were unique and awesome, but the film lacked the great battle scene that defines each one of them. Surely I favour it just for once watch that told from the todays imagination of the 1870s era. Feels like it should have been better, but in the end it is a satisfying film.\r\n\r\n_6.5/10_", "created_at": "2016-12-24T20:19:36.972Z"}, {"movie_id": 333484, "review_id": "58972859c3a368627c014267", "author_rating": 9.0, "review_text": "I seek righteousness. But I'll take revenge.\r\n\r\nDirected by Antoine Fuqua and written by Nic Pizzolatto and Richard Wenk. Starring Denzel Washington, Chris Pratt, Ethan Hawke, Vincent D'Onofrio, Byung-hun Lee, Manuel Garcia-Rulfo, Martin Sensmeier, Haley Bennett and Peter Sarsgard. Music is by Simon Franglen (also working from a James Horner template) and cinematography by Mauro Fiore.\r\n\r\nSeven gunmen band together to aid the town of Rose Creek whose inhabitants are being driven out by ruthless capitalist Bartholomew Bogue.\r\n\r\nWe are now in an age of film making where \"tagged classics\" are no longer sacrosanct. Any number of these \"tagged classics\" have been and will become viable for remake - reboot - reimaging for newer audiences. It's here, it happens and really there's nothing we can do about it but moan amongst ourselves. John Sturges' 1960 The Magnificent Seven (itself a remake of Kurosawa pic Yojimbo) is a much loved film, and not just in Western lovers circles, it's a film that non Western fans are known to enjoy - and rightly so, it deserves its place as a \"tagged classic\" and still enthrals over 50 years since its release. So the big studio big wigs and Antoine Fuqua were taking a major gamble remaking a classic remake with their own remake!\r\n\r\nUndeniably the shadows loom large over the 2016 version, so much weight of expectation, in fact to some it was a stinker of a film even before it was released! Well, as those who have seen it will attest, both the fans and the dissenters, it hasn't raised the bar for the \"Seven\" formula, but, and this is very key here, the makers wasn't setting out to make a film that down the line would be perceived as a \"tagged classic\", and this is evident in the ream of extras available on the Blu-ray releases. They achieved what they set out to do, to make a blunderbuss Oater for the modern era to sample, and they have done it with much love, much cool and lashings of technical greatness. Add in a cast clearly enjoying themselves and not letting anyone down, and it's a tasty plate of beans.\r\n\r\nFuqua updates things by having his seven as a row of differing ethnicities, which works a treat, and crucially he and his writers are respectful of those characterisations, even if a bit more fleshing out wouldn't have gone amiss. Yet nothing is at a cost to honouring the great Westerns of old. Beautiful landscapes envelope the players, the musical score bouncing around man and nature with homaged sweetness. There's closeups, silhouetted slices of panache, superb stunt work (man and beast), glorious set design, and then there's the action. The fight sequences are excellently constructed, a feast for the eyes and ears, death and slaughter unfurled in brutal but hunger appeasing strokes. There's comic relief about the place, and while much of the dialogue wouldn't have the great poets of yore troubled, there is deepness to be found. Intelligence, too, the addition of PTSD to one of the main players is a notable piece of worth, while how wonderful to find a Western lady character of great substance (Bennett excellent), so good in fact she could have been one of the seven!\r\n\r\nIt's a bare bones story, with a pointless motive revelation tagged on for the finale, while some anachronisms will irritate those bothered by such. But if you are able to judge it on its own terms, as a Western entertainment for this era, and to accept it isn't trying to outdo the source of its inspiration, then a good time can readily be had. 8/10", "created_at": "2017-02-05T13:27:53.874Z"}, {"movie_id": 333484, "review_id": "5898527b9251417a91007dfc", "author_rating": 6.0, "review_text": "Ditches all the cerebral factors in favour of dumb fun, but hey, it works.\r\n\r\nFinal rating:★★★ - I personally recommend you give it a go.", "created_at": "2017-02-06T10:39:55.110Z"}, {"movie_id": 333484, "review_id": "58dced44c3a368223e009dba", "author_rating": 10.0, "review_text": "This is indeed a very good remake of an old classic. As always I am a bit worried when they make a remake of old classics that I liked. This remake is well worth watching though. Despite having a few minor gripes I went for 5 out of 5 stars on this one.\r\n\r\nMost of you are probably familiar with the story of The Magnificent Seven. Gunslinger gets hired to protect a village from the evil industrialist, he picks 6 buddies to help him, trains the villagers, digs in and sits down and waits for the bad guys to arrive. A simple and well suited story for a bit of Western entertainment. I guess I should mention as well that the original Western is actually not the “real” original. That honor befalls Shichinin no samurai, or Seven Samurai in English, which is a Samurai movie by Akira Kurosawa and with Toshirô Mifune in the lead role. That is the movie from which the plot originates.\r\n\r\nAnyway, history lesson is over, back to this movie. The movie starts of by introducing the main characters. The bad industrialist is a nasty piece of thug and quickly demonstrates that, although by no means being a blood splatter movie, it is definitely more cruel than what I remember from the original. Next in line is the movies hero played by Denzel Washington and I have to say that he plays the role very well. I liked him as the calm, fairly silent, but oh so deadly gunslinger from the first frame to the last.\r\n\r\nThe other characters fit quite well into their roles as well. I cannot make up my mind about Jack Horne though. I did like the character but at the same time I felt that he was a wee bit to comical at times. I also liked Goodnight Robicheaux quite a lot but the writer really went a bit over the top as far as I am concerned when he actually left.\r\n\r\nOf course the entire movie plays out as a build up to the final big fight and it is a big fight, that has to be said. However there are plenty of things happening during this build up. Both things involving chemically propelled slugs flying around and things slightly less noisy.\r\n\r\nSam Chisolm has to pick up his buddies of course, each one being an opportunity for some cool movie story telling. Then we have the training of the villagers which, as expected, becomes a wee bit comical at times. Oh, and I almost forget that there is a nice little shootout when Chisolm and his buddies introduces themselves to Bogue’s thugs in the village. Said thugs includes the local Sheriff. To no ones surprise I believe. So much for law and order. Time for a new management.\r\n\r\nSo, fast forward to the end and the big fight. It is big, it is well done and it involves plenty of things that go boom. It is plenty of action but it is also the part of the movie where I have the biggest gripe. Okay folks there are going to be a mild spoiler now. With that out of the way, let’s go to the Gatling gun. It is always cool to see a Gatling gun let loose. However can we keep it a bit more realistic please? They fire thousands of bullets without reloading (they make a fuss about reloading later in the movie). Also they position the gun out in the open where it would have been relatively easy to shoot the men operating it. An idea that they finally get much later and manage to goof up. The final solution to taking out the gun is dramatic but quite convoluted. This is the part of the movie that made me go a bit what the fuck!\r\n\r\nApart from that I really enjoyed this movie. A good remake of an old classic.", "created_at": "2017-03-30T11:34:28.474Z"}, {"movie_id": 333484, "review_id": "5c7ecb08c3a3684e8cd2567e", "author_rating": null, "review_text": "My only objection with this version is the use of the Gatling gun. Though I know it's only a movie and it creates more excitement, the gun never fired that many rounds per load. That said, I still enjoyed the movie.", "created_at": "2019-03-05T19:16:25.001Z"}, {"movie_id": 333484, "review_id": "5cc0a2c7c3a368694c8baf2d", "author_rating": 7.0, "review_text": "***Muscular Western headed by Denzel Washington is superior to the hokey original***\r\n\r\nA woman (Haley Bennett) seeking justice after the murder of her husband enlists a bounty hunter (Denzel Washington), who gathers six others, to defend the woman’s southwestern town against a ruthless army hired by a destructive industrialist (Peter Sarsgaard). Chris Pratt, Ethan Hawke, Vincent D'Onofrio, Byung-Hun Lee, Manuel Garcia-Rulfo and Martin Sensmeier play the other six gunfighters.\r\n\r\n\"The Magnificent Seven\" (2016) is a reimagining of the 1960 Western, which itself was based on Kurosawa's \"Seven Samurai\" (1954). While the plot is contrived the original version had a stellar cast, a magnificent score and great locations, but it was ruined by hokey script flaws. For instance, the teen Chico (Buchholz) was able to effortlessly infiltrate Calvera's bandits, utterly fooling them, even though there were only 32 of them by this point (rolling my eyes). Even if Calvera & his brigands failed to make out Chico's face, which is a big IF, his dialogue & accent would've given him away. Keep in mind that Chico was just an unseasoned teen.\r\n\r\nAnother example is the villagers' sudden cowardly turnaround (betrayal), which totally contradicted their earlier resolve. Yes, I realize they learned that the bandits weren't run-off and that they were going to return to the village out of desperation, but there were only like 30-32 bandits left at this juncture and the combined forces of the seven gunmen and the fighting villagers now had the opportunity to annihilate the thugs for good.\r\n\r\nThis version of course eliminates such idiotic writing and ups the ante with the action. The movie's bloody, but no more so than recent Westerns like \"3:10 to Yuma\" (2007) and \"Django Unchained\" (2012). If you like those ones, as well as oldies like “Duel at Diablo” (1966) and “The Outlaw Josey Wales” (1976), you’ll like this one. Washington stands tall in the main role while Jennifer Lawrence lookalike Haley Bennett is stunning and superior to Lawrence. \r\n\r\nThe movie runs 2 hours, 12 minutes and was shot in Arizona, New Mexico and one shot in Colorado (Miller Mesa, Ridgway) with the main set being in Jackson, Louisiana.\r\n\r\nGRADE: B", "created_at": "2019-04-24T17:54:15.580Z"}, {"movie_id": 333484, "review_id": "6434af8fa6ddcb00b6d428f1", "author_rating": 8.0, "review_text": "**These magnificent seven are politically correct and historically inaccurate, but still far more fun than any sequel to the first film.**\r\n\r\n“Magnificent Seven” – the original film – was a remake of a Japanese production, and ended up being followed by an unnecessary and rather poor succession of sequels. Only the Japanese original and the early American film remain for posterity, which is a classic in its own right. What we have here turns out to be a remake of the remake, and despite its many merits, it doesn't make us forget our first love.\r\n\r\nThe film has two big points in its favor: the production, luxurious and detailed, and the quality of the cast involved. The script presents the same story that we already know, but structured differently and with different types of actors, in addition to being entirely in the USA, and not in Mexico. That was another point in its favor, as the story of the first film had already been virtually copied, chewed up and dismantled by the sequels that followed.\r\n\r\nI liked the work of Denzel Washington, an impeccable actor and perfectly comfortable with action movies. Ethan Hawke is very supportive and does some quality solo work as well. Haley Bennett is also excellent. Chris Pratt, Vincent d'Onofrio, Lee Byung-Hun and all the others help, but they don't capture our interest or really stand out. Peter Sarsgaard, the villain, did a good job considering the weaknesses of the material received: the character appears little, has almost nothing to do and, in the end, inside the church, he has a behavior that does not match anything that had happened so far. there.\r\n\r\nTechnically, the film features a huge amount of effects-laden action and high-quality CGI. Antoine Fuqua knew how to understand how the film should be, honoring its predecessor without, however, copying it. The film has excellent effects, good costumes and good sets. The production paid attention to the period details, which does not prevent some minor anachronisms, which were not a substantial problem. The action scenes were well executed and the film will certainly please fans of the genre, and the soundtrack has a certain epic flavor that goes well and harmonizes well with the (already historic) musical theme of the film, which was rerecorded for the new production.\r\n\r\nThese are all qualities, and minor flaws. Where I really feel that the film failed was in the casting of some of the actors. After the recent controversies in the industry (which involved not only the infamous accusations of harassment, but also the discrimination of professionals based on color or ethnicity), there was an effort to counteract bad publicity with actors who were black, Native American or Latinos in all sorts of characters. I'm not against it, but I think there are characters better suited to it than others, and I doubt, for example, that a Native American would pair well with a group of mostly white gunslingers in the late 19th century. As much as political correctness is appeased, it is an idea that goes against historical verisimilitude. Another problem with this film is the attempts to introduce humor, both in the situations and in the dialogues: they are so bad and so shaky that it would be better if they had removed them from the final version.", "created_at": "2023-04-11T00:53:35.882Z"}]