[{"movie_id": 776503, "review_id": "6014ae3a1b70ae003c5fa7ea", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI know Sundance is one of those festivals that carry dozens of impressive, impactful films from writer-directors that really throw themselves into the art of filmmaking and storytelling. I anticipated being blown away by many movies that I knew nothing about or didn't recognize the crew and cast involved. I expected some films to emotionally impact me so much that I'd save them close to my heart until the very end of the year. With this said, I was unbelievably far from imagining that the very first viewing would be a heavy contender for my absolute favorite movie of the entire festival.\r\n\r\nCODA (Child Of Deaf Adults) is the first film I watch by Siân Heder, and after this session, I can't wait to see what she did so far and what she's going to do in the future. The clearly interesting premise is developed through a much more emotional narrative than I expected. From rich visual storytelling to exceptional use of sign language, Heder is able to capture something unique and deeply important to transmit to the audience and to today's society. The world was fortunate enough to get Sound of Metal last year, and CODA reinforces the essential message that being deaf must not be seen as a massive disability or a brutal handicap.\r\n\r\nAs the movie cleverly communicates through its impeccable screenplay, having some sort of \"limitation\" doesn't automatically characterize someone as weird, different, or that the respective family members don't love each other as much or more than the so-called \"normal\" families. Except for a somewhat insignificant love relationship featuring the main character (that could have brought up an entirely different, unnecessary, and even distracting topic to the film's central, vital themes), I was incredibly invested in every single storyline.\r\n\r\nIn fact, I find every interaction within the deaf family much more compelling and captivating than any other dialogue in the movie, and this is mostly due to the amazing performances from the cast. Leaving the protagonist to the end, Daniel Durant (Leo Rossi, brother) and Marlee Matlin (Jackie Rossi, mother) are great as supporting characters, but Troy Kotsur (Frank Rossi, father) and Eugenio Derbez (Bernardo Villalobos, music teacher) literally left me in tears with their heartfelt displays. I could feel the outstanding commitment to their roles, and I'm delighted that Bernardo Villalobos isn't just another stereotypical, cliche, hysterical choir adult.\r\n\r\nHowever, the biggest praise in my bag must go to powerful glue that holds everything together, elevating the whole film to a whole other level: Emilia Jones as the only hearing member of the family, Ruby Rossi. First of all, I love music, and Pentatonix is actually my favorite group (acapella or not), so hearing so many wonderful voices singing together would always be a massive plus for CODA in my review. Nevertheless, not only Jones' voice is sumptuously heartwarming, but her performance has everything an actor needs to receive acting nominations. I can't remember the last time I was fully invested in a single character in such an emotionally powerful manner, and Jones is definitely a major reason.\r\n\r\nA final praise to Paula Huidobro's visually grabbing camera work and Marius de Vries, who composed the movie's subtle yet efficient score and who I'm guessing had a hand in the song choices. Either way, terrific job.\r\n\r\nCODA may very well end up as my favorite film of the 2021's edition of the Sundance Film Festival, and it will undoubtedly become a must-watch movie when it's available worldwide. Siân Heder offers her impeccable direction and beautifully written screenplay, which is packed with emotionally powerful moments that left me tearing up for the last forty-five minutes. Boasting an educative, meaningful message regarding the deaf community and what our society perceives as a tremendous handicap/disability, the characteristic visual storytelling and the captivating interactions within the deaf family prove to be incredibly investing, deeply elevating the overall piece. With the help of heartfelt, genuine performances from the supporting cast (mainly Troy Kotsur and Eugenio Derbez), Emilia Jones takes off and lands one of my favorite female performances in a long, long time. A tear-inducing, thoughtful film that I hope will conquer audiences all around the world.\r\n\r\nRating: A", "created_at": "2021-01-30T00:54:18.985Z"}, {"movie_id": 776503, "review_id": "6046fd88d8e2250025dd9283", "author_rating": 9.0, "review_text": "I cannot think of one person to whom I wouldn’t recommend “CODA,” an uplifting, emotionally rich movie from writer / director Sian Heder. This crowd-pleasing film is one of the first real gems to debut at this year’s Sundance Film Festival, and I’m still riding the wave of good vibes hours later.\r\n\r\nBeing a teenager is difficult enough, but try being Ruby (Emilia Jones). The 17-year-old is the only hearing member of a deaf family, and she spends most of her spare time working on her parents’ (Marlee Matlin, Troy Kotsur) fishing boat along with her older brother, Leo (Daniel Durant). and serving as their sign language interpreter. Ruby juggles her family responsibilities, her schoolwork, and a newfound passion for her high school’s choir club (and her cute duet partner, Miles (Ferdia Walsh-Peelo)). When her music teacher (Eugenio Derbez) hears that special something in Ruby’s voice, he encourages her to think about a life beyond fishing and supports her in applying to a prestigious music school. This unfairly puts the responsibility of the household on Ruby’s shoulders, and she must choose between keeping her family afloat or pursuing her dreams.\r\n\r\nThis very funny and very honest story has a universal appeal, with charming performances and a likeable family that you’ll want to spend time with. Kotsur and Matlin are terrific as Ruby’s randy parents, and Derbez brings a genuine charisma to his role as the young woman’s mentor. The cast includes three deaf actors, so much of the dialogue is expressed in sign language — and everything about that feels normal. This film goes a long way in shattering stereotypes about people who are hearing impaired, and that is to be commended.\r\n\r\nHeder has created a film that’s filled with insight, refreshingly direct dialogue, and a fully developed cast of characters that all add up to solid storytelling all around. Not only is this a coming-of-age story for Ruby, but it’s one for her family, too. The four of them struggle through the disappointment that life throws their way, hoping to work together to emerge stronger than ever.\r\n\r\nHeartfelt but never corny, “CODA” is a really special movie about unwavering support, unconditional love, and what it means to be a family.", "created_at": "2021-03-09T04:46:00.633Z"}, {"movie_id": 776503, "review_id": "614e3665140bad008c8bcc29", "author_rating": 8.0, "review_text": "**Full Review and Analysis at SpotaMovie.com**\r\nProduced and released by Apple in 2021, CODA is an inspiring movie. It delivers music and voice to deaf people, highlighting important topics. **The Story:** Ruby is the only hearing person in her deaf family. They run a small business as fishermen, and she helps and supports them, mainly translating everything to her family in the deaf signs language. As a result, she splits her life between her family and her dreams.\r\nRuby discovers an incredible talent, something that makes her feel alive and happy. But the two worlds are not easily manageable for her because society and her parents are not ready to understand each other. Ruby’s role becomes crucial for her family, especially when a new law threatens their business and future. Therefore to keep her dreams moving forward, she will need to fight, sacrifice and change the reality around her story. Fortunately, Ruby meets an incredible character during her journey and something powerful will happen. It’s an engaging story. **Opinion**: It’s a film of revolution, passion, family and friendships. It teaches us about integration and shows us the difficulty deaf people face every day. The pieces of music are perfect, and the film has pace and rhythm. The performance delivered by the actors is incredible and makes the movie more engaging. It's a must watch in our opinion because it makes us better person.", "created_at": "2021-09-24T20:34:45.280Z"}, {"movie_id": 776503, "review_id": "624ac77aa3b5e60097066a06", "author_rating": 6.0, "review_text": "Whilst I did quite enjoy this, I am struggling to see what all the fuss is about. Emilia Jones is \"Ruby\", a talented young singer who is keen to attend music college. Her family live in a maritime town where the local fishermen are finding it harder and harder to make ends meet. When her father's business looks doomed, she has to choose between staying at home or fulfilling her dream. What makes the film interesting is that she is the only one in her family who can hear. Her parents (Troy Kotsur and Marlee Matlin) as well as her brother \"Leo\" (Daniel Durant) are all deaf. Whilst that certainly adds an extra dimension to the narrative, the story itself is really nothing much to write home about. Their deafness is in no way the cause of the family woes, and much of the narrative is taken up with this family struggling to survive the decline of their livelihood, whilst she has boyfriend issues and her demanding music teacher (Eugenio Derbez) is constantly challenging to do her best. It does feature an haunting version of Joni Mitchell's \"Both Sides Now\" and, on occasion, we are presented with an audio appreciation from her family's perspective which does resonate well, giving us an inkling of how sounds sound (or not) to people who are deaf. It is a fine looking production, is enjoyable to watch and the dynamic between the parents and their daughter is frequently amusing and touching. It ought to raise awareness, but as a piece of cinema is nothing particularly special.", "created_at": "2022-04-04T10:24:58.205Z"}, {"movie_id": 776503, "review_id": "630fd50f7fcab30091db568a", "author_rating": 8.0, "review_text": "Admittedly, there is nothing brilliantly creative about the script, which is why I gave it only 8 stars. The elevator story: a teenager trying to find, and assert, herself in the world and her family, who itself is struggling to remain commercially viable in an industry that's been devastated by commercialism and global warming. The wrinkle in the story is that the protagonist's parents and brother are all deaf. (CODA = Child of Deaf Adults.)\r\n\r\nThat's where ho-hum departs, and I have two things to say about it: First, this film deserves all the accolades and awards it's received. Second, this may the first time I've known a remake to exceed by far the original.\r\n\r\nThe acting from nearly everyone in the cast is unbelievably great. The production values are fantastic. The film is incredibly hilarious (thanks to brilliant performance by Troy Kotsur), and also, surprisingly emotional. In what could have been \"just another meh coming-of-age story\", Emilia Jones worked super hard to create a character that draws the audience in.\r\n\r\nTo Siân Heder's credit, everything about this production shines.", "created_at": "2022-08-31T21:39:27.129Z"}, {"movie_id": 776503, "review_id": "6014ae3a1b70ae003c5fa7ea", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI know Sundance is one of those festivals that carry dozens of impressive, impactful films from writer-directors that really throw themselves into the art of filmmaking and storytelling. I anticipated being blown away by many movies that I knew nothing about or didn't recognize the crew and cast involved. I expected some films to emotionally impact me so much that I'd save them close to my heart until the very end of the year. With this said, I was unbelievably far from imagining that the very first viewing would be a heavy contender for my absolute favorite movie of the entire festival.\r\n\r\nCODA (Child Of Deaf Adults) is the first film I watch by Siân Heder, and after this session, I can't wait to see what she did so far and what she's going to do in the future. The clearly interesting premise is developed through a much more emotional narrative than I expected. From rich visual storytelling to exceptional use of sign language, Heder is able to capture something unique and deeply important to transmit to the audience and to today's society. The world was fortunate enough to get Sound of Metal last year, and CODA reinforces the essential message that being deaf must not be seen as a massive disability or a brutal handicap.\r\n\r\nAs the movie cleverly communicates through its impeccable screenplay, having some sort of \"limitation\" doesn't automatically characterize someone as weird, different, or that the respective family members don't love each other as much or more than the so-called \"normal\" families. Except for a somewhat insignificant love relationship featuring the main character (that could have brought up an entirely different, unnecessary, and even distracting topic to the film's central, vital themes), I was incredibly invested in every single storyline.\r\n\r\nIn fact, I find every interaction within the deaf family much more compelling and captivating than any other dialogue in the movie, and this is mostly due to the amazing performances from the cast. Leaving the protagonist to the end, Daniel Durant (Leo Rossi, brother) and Marlee Matlin (Jackie Rossi, mother) are great as supporting characters, but Troy Kotsur (Frank Rossi, father) and Eugenio Derbez (Bernardo Villalobos, music teacher) literally left me in tears with their heartfelt displays. I could feel the outstanding commitment to their roles, and I'm delighted that Bernardo Villalobos isn't just another stereotypical, cliche, hysterical choir adult.\r\n\r\nHowever, the biggest praise in my bag must go to powerful glue that holds everything together, elevating the whole film to a whole other level: Emilia Jones as the only hearing member of the family, Ruby Rossi. First of all, I love music, and Pentatonix is actually my favorite group (acapella or not), so hearing so many wonderful voices singing together would always be a massive plus for CODA in my review. Nevertheless, not only Jones' voice is sumptuously heartwarming, but her performance has everything an actor needs to receive acting nominations. I can't remember the last time I was fully invested in a single character in such an emotionally powerful manner, and Jones is definitely a major reason.\r\n\r\nA final praise to Paula Huidobro's visually grabbing camera work and Marius de Vries, who composed the movie's subtle yet efficient score and who I'm guessing had a hand in the song choices. Either way, terrific job.\r\n\r\nCODA may very well end up as my favorite film of the 2021's edition of the Sundance Film Festival, and it will undoubtedly become a must-watch movie when it's available worldwide. Siân Heder offers her impeccable direction and beautifully written screenplay, which is packed with emotionally powerful moments that left me tearing up for the last forty-five minutes. Boasting an educative, meaningful message regarding the deaf community and what our society perceives as a tremendous handicap/disability, the characteristic visual storytelling and the captivating interactions within the deaf family prove to be incredibly investing, deeply elevating the overall piece. With the help of heartfelt, genuine performances from the supporting cast (mainly Troy Kotsur and Eugenio Derbez), Emilia Jones takes off and lands one of my favorite female performances in a long, long time. A tear-inducing, thoughtful film that I hope will conquer audiences all around the world.\r\n\r\nRating: A", "created_at": "2021-01-30T00:54:18.985Z"}, {"movie_id": 776503, "review_id": "6046fd88d8e2250025dd9283", "author_rating": 9.0, "review_text": "I cannot think of one person to whom I wouldn’t recommend “CODA,” an uplifting, emotionally rich movie from writer / director Sian Heder. This crowd-pleasing film is one of the first real gems to debut at this year’s Sundance Film Festival, and I’m still riding the wave of good vibes hours later.\r\n\r\nBeing a teenager is difficult enough, but try being Ruby (Emilia Jones). The 17-year-old is the only hearing member of a deaf family, and she spends most of her spare time working on her parents’ (Marlee Matlin, Troy Kotsur) fishing boat along with her older brother, Leo (Daniel Durant). and serving as their sign language interpreter. Ruby juggles her family responsibilities, her schoolwork, and a newfound passion for her high school’s choir club (and her cute duet partner, Miles (Ferdia Walsh-Peelo)). When her music teacher (Eugenio Derbez) hears that special something in Ruby’s voice, he encourages her to think about a life beyond fishing and supports her in applying to a prestigious music school. This unfairly puts the responsibility of the household on Ruby’s shoulders, and she must choose between keeping her family afloat or pursuing her dreams.\r\n\r\nThis very funny and very honest story has a universal appeal, with charming performances and a likeable family that you’ll want to spend time with. Kotsur and Matlin are terrific as Ruby’s randy parents, and Derbez brings a genuine charisma to his role as the young woman’s mentor. The cast includes three deaf actors, so much of the dialogue is expressed in sign language — and everything about that feels normal. This film goes a long way in shattering stereotypes about people who are hearing impaired, and that is to be commended.\r\n\r\nHeder has created a film that’s filled with insight, refreshingly direct dialogue, and a fully developed cast of characters that all add up to solid storytelling all around. Not only is this a coming-of-age story for Ruby, but it’s one for her family, too. The four of them struggle through the disappointment that life throws their way, hoping to work together to emerge stronger than ever.\r\n\r\nHeartfelt but never corny, “CODA” is a really special movie about unwavering support, unconditional love, and what it means to be a family.", "created_at": "2021-03-09T04:46:00.633Z"}, {"movie_id": 776503, "review_id": "614e3665140bad008c8bcc29", "author_rating": 8.0, "review_text": "**Full Review and Analysis at SpotaMovie.com**\r\nProduced and released by Apple in 2021, CODA is an inspiring movie. It delivers music and voice to deaf people, highlighting important topics. **The Story:** Ruby is the only hearing person in her deaf family. They run a small business as fishermen, and she helps and supports them, mainly translating everything to her family in the deaf signs language. As a result, she splits her life between her family and her dreams.\r\nRuby discovers an incredible talent, something that makes her feel alive and happy. But the two worlds are not easily manageable for her because society and her parents are not ready to understand each other. Ruby’s role becomes crucial for her family, especially when a new law threatens their business and future. Therefore to keep her dreams moving forward, she will need to fight, sacrifice and change the reality around her story. Fortunately, Ruby meets an incredible character during her journey and something powerful will happen. It’s an engaging story. **Opinion**: It’s a film of revolution, passion, family and friendships. It teaches us about integration and shows us the difficulty deaf people face every day. The pieces of music are perfect, and the film has pace and rhythm. The performance delivered by the actors is incredible and makes the movie more engaging. It's a must watch in our opinion because it makes us better person.", "created_at": "2021-09-24T20:34:45.280Z"}, {"movie_id": 776503, "review_id": "624ac77aa3b5e60097066a06", "author_rating": 6.0, "review_text": "Whilst I did quite enjoy this, I am struggling to see what all the fuss is about. Emilia Jones is \"Ruby\", a talented young singer who is keen to attend music college. Her family live in a maritime town where the local fishermen are finding it harder and harder to make ends meet. When her father's business looks doomed, she has to choose between staying at home or fulfilling her dream. What makes the film interesting is that she is the only one in her family who can hear. Her parents (Troy Kotsur and Marlee Matlin) as well as her brother \"Leo\" (Daniel Durant) are all deaf. Whilst that certainly adds an extra dimension to the narrative, the story itself is really nothing much to write home about. Their deafness is in no way the cause of the family woes, and much of the narrative is taken up with this family struggling to survive the decline of their livelihood, whilst she has boyfriend issues and her demanding music teacher (Eugenio Derbez) is constantly challenging to do her best. It does feature an haunting version of Joni Mitchell's \"Both Sides Now\" and, on occasion, we are presented with an audio appreciation from her family's perspective which does resonate well, giving us an inkling of how sounds sound (or not) to people who are deaf. It is a fine looking production, is enjoyable to watch and the dynamic between the parents and their daughter is frequently amusing and touching. It ought to raise awareness, but as a piece of cinema is nothing particularly special.", "created_at": "2022-04-04T10:24:58.205Z"}, {"movie_id": 776503, "review_id": "630fd50f7fcab30091db568a", "author_rating": 8.0, "review_text": "Admittedly, there is nothing brilliantly creative about the script, which is why I gave it only 8 stars. The elevator story: a teenager trying to find, and assert, herself in the world and her family, who itself is struggling to remain commercially viable in an industry that's been devastated by commercialism and global warming. The wrinkle in the story is that the protagonist's parents and brother are all deaf. (CODA = Child of Deaf Adults.)\r\n\r\nThat's where ho-hum departs, and I have two things to say about it: First, this film deserves all the accolades and awards it's received. Second, this may the first time I've known a remake to exceed by far the original.\r\n\r\nThe acting from nearly everyone in the cast is unbelievably great. The production values are fantastic. The film is incredibly hilarious (thanks to brilliant performance by Troy Kotsur), and also, surprisingly emotional. In what could have been \"just another meh coming-of-age story\", Emilia Jones worked super hard to create a character that draws the audience in.\r\n\r\nTo Siân Heder's credit, everything about this production shines.", "created_at": "2022-08-31T21:39:27.129Z"}, {"movie_id": 776503, "review_id": "6014ae3a1b70ae003c5fa7ea", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI know Sundance is one of those festivals that carry dozens of impressive, impactful films from writer-directors that really throw themselves into the art of filmmaking and storytelling. I anticipated being blown away by many movies that I knew nothing about or didn't recognize the crew and cast involved. I expected some films to emotionally impact me so much that I'd save them close to my heart until the very end of the year. With this said, I was unbelievably far from imagining that the very first viewing would be a heavy contender for my absolute favorite movie of the entire festival.\r\n\r\nCODA (Child Of Deaf Adults) is the first film I watch by Siân Heder, and after this session, I can't wait to see what she did so far and what she's going to do in the future. The clearly interesting premise is developed through a much more emotional narrative than I expected. From rich visual storytelling to exceptional use of sign language, Heder is able to capture something unique and deeply important to transmit to the audience and to today's society. The world was fortunate enough to get Sound of Metal last year, and CODA reinforces the essential message that being deaf must not be seen as a massive disability or a brutal handicap.\r\n\r\nAs the movie cleverly communicates through its impeccable screenplay, having some sort of \"limitation\" doesn't automatically characterize someone as weird, different, or that the respective family members don't love each other as much or more than the so-called \"normal\" families. Except for a somewhat insignificant love relationship featuring the main character (that could have brought up an entirely different, unnecessary, and even distracting topic to the film's central, vital themes), I was incredibly invested in every single storyline.\r\n\r\nIn fact, I find every interaction within the deaf family much more compelling and captivating than any other dialogue in the movie, and this is mostly due to the amazing performances from the cast. Leaving the protagonist to the end, Daniel Durant (Leo Rossi, brother) and Marlee Matlin (Jackie Rossi, mother) are great as supporting characters, but Troy Kotsur (Frank Rossi, father) and Eugenio Derbez (Bernardo Villalobos, music teacher) literally left me in tears with their heartfelt displays. I could feel the outstanding commitment to their roles, and I'm delighted that Bernardo Villalobos isn't just another stereotypical, cliche, hysterical choir adult.\r\n\r\nHowever, the biggest praise in my bag must go to powerful glue that holds everything together, elevating the whole film to a whole other level: Emilia Jones as the only hearing member of the family, Ruby Rossi. First of all, I love music, and Pentatonix is actually my favorite group (acapella or not), so hearing so many wonderful voices singing together would always be a massive plus for CODA in my review. Nevertheless, not only Jones' voice is sumptuously heartwarming, but her performance has everything an actor needs to receive acting nominations. I can't remember the last time I was fully invested in a single character in such an emotionally powerful manner, and Jones is definitely a major reason.\r\n\r\nA final praise to Paula Huidobro's visually grabbing camera work and Marius de Vries, who composed the movie's subtle yet efficient score and who I'm guessing had a hand in the song choices. Either way, terrific job.\r\n\r\nCODA may very well end up as my favorite film of the 2021's edition of the Sundance Film Festival, and it will undoubtedly become a must-watch movie when it's available worldwide. Siân Heder offers her impeccable direction and beautifully written screenplay, which is packed with emotionally powerful moments that left me tearing up for the last forty-five minutes. Boasting an educative, meaningful message regarding the deaf community and what our society perceives as a tremendous handicap/disability, the characteristic visual storytelling and the captivating interactions within the deaf family prove to be incredibly investing, deeply elevating the overall piece. With the help of heartfelt, genuine performances from the supporting cast (mainly Troy Kotsur and Eugenio Derbez), Emilia Jones takes off and lands one of my favorite female performances in a long, long time. A tear-inducing, thoughtful film that I hope will conquer audiences all around the world.\r\n\r\nRating: A", "created_at": "2021-01-30T00:54:18.985Z"}, {"movie_id": 776503, "review_id": "6046fd88d8e2250025dd9283", "author_rating": 9.0, "review_text": "I cannot think of one person to whom I wouldn’t recommend “CODA,” an uplifting, emotionally rich movie from writer / director Sian Heder. This crowd-pleasing film is one of the first real gems to debut at this year’s Sundance Film Festival, and I’m still riding the wave of good vibes hours later.\r\n\r\nBeing a teenager is difficult enough, but try being Ruby (Emilia Jones). The 17-year-old is the only hearing member of a deaf family, and she spends most of her spare time working on her parents’ (Marlee Matlin, Troy Kotsur) fishing boat along with her older brother, Leo (Daniel Durant). and serving as their sign language interpreter. Ruby juggles her family responsibilities, her schoolwork, and a newfound passion for her high school’s choir club (and her cute duet partner, Miles (Ferdia Walsh-Peelo)). When her music teacher (Eugenio Derbez) hears that special something in Ruby’s voice, he encourages her to think about a life beyond fishing and supports her in applying to a prestigious music school. This unfairly puts the responsibility of the household on Ruby’s shoulders, and she must choose between keeping her family afloat or pursuing her dreams.\r\n\r\nThis very funny and very honest story has a universal appeal, with charming performances and a likeable family that you’ll want to spend time with. Kotsur and Matlin are terrific as Ruby’s randy parents, and Derbez brings a genuine charisma to his role as the young woman’s mentor. The cast includes three deaf actors, so much of the dialogue is expressed in sign language — and everything about that feels normal. This film goes a long way in shattering stereotypes about people who are hearing impaired, and that is to be commended.\r\n\r\nHeder has created a film that’s filled with insight, refreshingly direct dialogue, and a fully developed cast of characters that all add up to solid storytelling all around. Not only is this a coming-of-age story for Ruby, but it’s one for her family, too. The four of them struggle through the disappointment that life throws their way, hoping to work together to emerge stronger than ever.\r\n\r\nHeartfelt but never corny, “CODA” is a really special movie about unwavering support, unconditional love, and what it means to be a family.", "created_at": "2021-03-09T04:46:00.633Z"}, {"movie_id": 776503, "review_id": "614e3665140bad008c8bcc29", "author_rating": 8.0, "review_text": "**Full Review and Analysis at SpotaMovie.com**\r\nProduced and released by Apple in 2021, CODA is an inspiring movie. It delivers music and voice to deaf people, highlighting important topics. **The Story:** Ruby is the only hearing person in her deaf family. They run a small business as fishermen, and she helps and supports them, mainly translating everything to her family in the deaf signs language. As a result, she splits her life between her family and her dreams.\r\nRuby discovers an incredible talent, something that makes her feel alive and happy. But the two worlds are not easily manageable for her because society and her parents are not ready to understand each other. Ruby’s role becomes crucial for her family, especially when a new law threatens their business and future. Therefore to keep her dreams moving forward, she will need to fight, sacrifice and change the reality around her story. Fortunately, Ruby meets an incredible character during her journey and something powerful will happen. It’s an engaging story. **Opinion**: It’s a film of revolution, passion, family and friendships. It teaches us about integration and shows us the difficulty deaf people face every day. The pieces of music are perfect, and the film has pace and rhythm. The performance delivered by the actors is incredible and makes the movie more engaging. It's a must watch in our opinion because it makes us better person.", "created_at": "2021-09-24T20:34:45.280Z"}, {"movie_id": 776503, "review_id": "624ac77aa3b5e60097066a06", "author_rating": 6.0, "review_text": "Whilst I did quite enjoy this, I am struggling to see what all the fuss is about. Emilia Jones is \"Ruby\", a talented young singer who is keen to attend music college. Her family live in a maritime town where the local fishermen are finding it harder and harder to make ends meet. When her father's business looks doomed, she has to choose between staying at home or fulfilling her dream. What makes the film interesting is that she is the only one in her family who can hear. Her parents (Troy Kotsur and Marlee Matlin) as well as her brother \"Leo\" (Daniel Durant) are all deaf. Whilst that certainly adds an extra dimension to the narrative, the story itself is really nothing much to write home about. Their deafness is in no way the cause of the family woes, and much of the narrative is taken up with this family struggling to survive the decline of their livelihood, whilst she has boyfriend issues and her demanding music teacher (Eugenio Derbez) is constantly challenging to do her best. It does feature an haunting version of Joni Mitchell's \"Both Sides Now\" and, on occasion, we are presented with an audio appreciation from her family's perspective which does resonate well, giving us an inkling of how sounds sound (or not) to people who are deaf. It is a fine looking production, is enjoyable to watch and the dynamic between the parents and their daughter is frequently amusing and touching. It ought to raise awareness, but as a piece of cinema is nothing particularly special.", "created_at": "2022-04-04T10:24:58.205Z"}, {"movie_id": 776503, "review_id": "630fd50f7fcab30091db568a", "author_rating": 8.0, "review_text": "Admittedly, there is nothing brilliantly creative about the script, which is why I gave it only 8 stars. The elevator story: a teenager trying to find, and assert, herself in the world and her family, who itself is struggling to remain commercially viable in an industry that's been devastated by commercialism and global warming. The wrinkle in the story is that the protagonist's parents and brother are all deaf. (CODA = Child of Deaf Adults.)\r\n\r\nThat's where ho-hum departs, and I have two things to say about it: First, this film deserves all the accolades and awards it's received. Second, this may the first time I've known a remake to exceed by far the original.\r\n\r\nThe acting from nearly everyone in the cast is unbelievably great. The production values are fantastic. The film is incredibly hilarious (thanks to brilliant performance by Troy Kotsur), and also, surprisingly emotional. In what could have been \"just another meh coming-of-age story\", Emilia Jones worked super hard to create a character that draws the audience in.\r\n\r\nTo Siân Heder's credit, everything about this production shines.", "created_at": "2022-08-31T21:39:27.129Z"}, {"movie_id": 776503, "review_id": "6014ae3a1b70ae003c5fa7ea", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI know Sundance is one of those festivals that carry dozens of impressive, impactful films from writer-directors that really throw themselves into the art of filmmaking and storytelling. I anticipated being blown away by many movies that I knew nothing about or didn't recognize the crew and cast involved. I expected some films to emotionally impact me so much that I'd save them close to my heart until the very end of the year. With this said, I was unbelievably far from imagining that the very first viewing would be a heavy contender for my absolute favorite movie of the entire festival.\r\n\r\nCODA (Child Of Deaf Adults) is the first film I watch by Siân Heder, and after this session, I can't wait to see what she did so far and what she's going to do in the future. The clearly interesting premise is developed through a much more emotional narrative than I expected. From rich visual storytelling to exceptional use of sign language, Heder is able to capture something unique and deeply important to transmit to the audience and to today's society. The world was fortunate enough to get Sound of Metal last year, and CODA reinforces the essential message that being deaf must not be seen as a massive disability or a brutal handicap.\r\n\r\nAs the movie cleverly communicates through its impeccable screenplay, having some sort of \"limitation\" doesn't automatically characterize someone as weird, different, or that the respective family members don't love each other as much or more than the so-called \"normal\" families. Except for a somewhat insignificant love relationship featuring the main character (that could have brought up an entirely different, unnecessary, and even distracting topic to the film's central, vital themes), I was incredibly invested in every single storyline.\r\n\r\nIn fact, I find every interaction within the deaf family much more compelling and captivating than any other dialogue in the movie, and this is mostly due to the amazing performances from the cast. Leaving the protagonist to the end, Daniel Durant (Leo Rossi, brother) and Marlee Matlin (Jackie Rossi, mother) are great as supporting characters, but Troy Kotsur (Frank Rossi, father) and Eugenio Derbez (Bernardo Villalobos, music teacher) literally left me in tears with their heartfelt displays. I could feel the outstanding commitment to their roles, and I'm delighted that Bernardo Villalobos isn't just another stereotypical, cliche, hysterical choir adult.\r\n\r\nHowever, the biggest praise in my bag must go to powerful glue that holds everything together, elevating the whole film to a whole other level: Emilia Jones as the only hearing member of the family, Ruby Rossi. First of all, I love music, and Pentatonix is actually my favorite group (acapella or not), so hearing so many wonderful voices singing together would always be a massive plus for CODA in my review. Nevertheless, not only Jones' voice is sumptuously heartwarming, but her performance has everything an actor needs to receive acting nominations. I can't remember the last time I was fully invested in a single character in such an emotionally powerful manner, and Jones is definitely a major reason.\r\n\r\nA final praise to Paula Huidobro's visually grabbing camera work and Marius de Vries, who composed the movie's subtle yet efficient score and who I'm guessing had a hand in the song choices. Either way, terrific job.\r\n\r\nCODA may very well end up as my favorite film of the 2021's edition of the Sundance Film Festival, and it will undoubtedly become a must-watch movie when it's available worldwide. Siân Heder offers her impeccable direction and beautifully written screenplay, which is packed with emotionally powerful moments that left me tearing up for the last forty-five minutes. Boasting an educative, meaningful message regarding the deaf community and what our society perceives as a tremendous handicap/disability, the characteristic visual storytelling and the captivating interactions within the deaf family prove to be incredibly investing, deeply elevating the overall piece. With the help of heartfelt, genuine performances from the supporting cast (mainly Troy Kotsur and Eugenio Derbez), Emilia Jones takes off and lands one of my favorite female performances in a long, long time. A tear-inducing, thoughtful film that I hope will conquer audiences all around the world.\r\n\r\nRating: A", "created_at": "2021-01-30T00:54:18.985Z"}, {"movie_id": 776503, "review_id": "6046fd88d8e2250025dd9283", "author_rating": 9.0, "review_text": "I cannot think of one person to whom I wouldn’t recommend “CODA,” an uplifting, emotionally rich movie from writer / director Sian Heder. This crowd-pleasing film is one of the first real gems to debut at this year’s Sundance Film Festival, and I’m still riding the wave of good vibes hours later.\r\n\r\nBeing a teenager is difficult enough, but try being Ruby (Emilia Jones). The 17-year-old is the only hearing member of a deaf family, and she spends most of her spare time working on her parents’ (Marlee Matlin, Troy Kotsur) fishing boat along with her older brother, Leo (Daniel Durant). and serving as their sign language interpreter. Ruby juggles her family responsibilities, her schoolwork, and a newfound passion for her high school’s choir club (and her cute duet partner, Miles (Ferdia Walsh-Peelo)). When her music teacher (Eugenio Derbez) hears that special something in Ruby’s voice, he encourages her to think about a life beyond fishing and supports her in applying to a prestigious music school. This unfairly puts the responsibility of the household on Ruby’s shoulders, and she must choose between keeping her family afloat or pursuing her dreams.\r\n\r\nThis very funny and very honest story has a universal appeal, with charming performances and a likeable family that you’ll want to spend time with. Kotsur and Matlin are terrific as Ruby’s randy parents, and Derbez brings a genuine charisma to his role as the young woman’s mentor. The cast includes three deaf actors, so much of the dialogue is expressed in sign language — and everything about that feels normal. This film goes a long way in shattering stereotypes about people who are hearing impaired, and that is to be commended.\r\n\r\nHeder has created a film that’s filled with insight, refreshingly direct dialogue, and a fully developed cast of characters that all add up to solid storytelling all around. Not only is this a coming-of-age story for Ruby, but it’s one for her family, too. The four of them struggle through the disappointment that life throws their way, hoping to work together to emerge stronger than ever.\r\n\r\nHeartfelt but never corny, “CODA” is a really special movie about unwavering support, unconditional love, and what it means to be a family.", "created_at": "2021-03-09T04:46:00.633Z"}, {"movie_id": 776503, "review_id": "614e3665140bad008c8bcc29", "author_rating": 8.0, "review_text": "**Full Review and Analysis at SpotaMovie.com**\r\nProduced and released by Apple in 2021, CODA is an inspiring movie. It delivers music and voice to deaf people, highlighting important topics. **The Story:** Ruby is the only hearing person in her deaf family. They run a small business as fishermen, and she helps and supports them, mainly translating everything to her family in the deaf signs language. As a result, she splits her life between her family and her dreams.\r\nRuby discovers an incredible talent, something that makes her feel alive and happy. But the two worlds are not easily manageable for her because society and her parents are not ready to understand each other. Ruby’s role becomes crucial for her family, especially when a new law threatens their business and future. Therefore to keep her dreams moving forward, she will need to fight, sacrifice and change the reality around her story. Fortunately, Ruby meets an incredible character during her journey and something powerful will happen. It’s an engaging story. **Opinion**: It’s a film of revolution, passion, family and friendships. It teaches us about integration and shows us the difficulty deaf people face every day. The pieces of music are perfect, and the film has pace and rhythm. The performance delivered by the actors is incredible and makes the movie more engaging. It's a must watch in our opinion because it makes us better person.", "created_at": "2021-09-24T20:34:45.280Z"}, {"movie_id": 776503, "review_id": "624ac77aa3b5e60097066a06", "author_rating": 6.0, "review_text": "Whilst I did quite enjoy this, I am struggling to see what all the fuss is about. Emilia Jones is \"Ruby\", a talented young singer who is keen to attend music college. Her family live in a maritime town where the local fishermen are finding it harder and harder to make ends meet. When her father's business looks doomed, she has to choose between staying at home or fulfilling her dream. What makes the film interesting is that she is the only one in her family who can hear. Her parents (Troy Kotsur and Marlee Matlin) as well as her brother \"Leo\" (Daniel Durant) are all deaf. Whilst that certainly adds an extra dimension to the narrative, the story itself is really nothing much to write home about. Their deafness is in no way the cause of the family woes, and much of the narrative is taken up with this family struggling to survive the decline of their livelihood, whilst she has boyfriend issues and her demanding music teacher (Eugenio Derbez) is constantly challenging to do her best. It does feature an haunting version of Joni Mitchell's \"Both Sides Now\" and, on occasion, we are presented with an audio appreciation from her family's perspective which does resonate well, giving us an inkling of how sounds sound (or not) to people who are deaf. It is a fine looking production, is enjoyable to watch and the dynamic between the parents and their daughter is frequently amusing and touching. It ought to raise awareness, but as a piece of cinema is nothing particularly special.", "created_at": "2022-04-04T10:24:58.205Z"}, {"movie_id": 776503, "review_id": "630fd50f7fcab30091db568a", "author_rating": 8.0, "review_text": "Admittedly, there is nothing brilliantly creative about the script, which is why I gave it only 8 stars. The elevator story: a teenager trying to find, and assert, herself in the world and her family, who itself is struggling to remain commercially viable in an industry that's been devastated by commercialism and global warming. The wrinkle in the story is that the protagonist's parents and brother are all deaf. (CODA = Child of Deaf Adults.)\r\n\r\nThat's where ho-hum departs, and I have two things to say about it: First, this film deserves all the accolades and awards it's received. Second, this may the first time I've known a remake to exceed by far the original.\r\n\r\nThe acting from nearly everyone in the cast is unbelievably great. The production values are fantastic. The film is incredibly hilarious (thanks to brilliant performance by Troy Kotsur), and also, surprisingly emotional. In what could have been \"just another meh coming-of-age story\", Emilia Jones worked super hard to create a character that draws the audience in.\r\n\r\nTo Siân Heder's credit, everything about this production shines.", "created_at": "2022-08-31T21:39:27.129Z"}]