[{"movie_id": 7347, "review_id": "561272a1c3a3686814016662", "author_rating": 7.0, "review_text": "Decent movie with lots of strongly violent action. It stands up because it is staged in Rio and created by Brazilians.\r\n\r\nThe plot is not very surprising but good enough.", "created_at": "2015-10-05T12:52:49.757Z"}, {"movie_id": 7347, "review_id": "639ac7dda4af8f007d05bd93", "author_rating": 8.0, "review_text": "**One of the best films that Brazil exported internationally.**\r\n\r\nBeing Portuguese, I believe that I know the realities of Brazil reasonably better than most foreigners. After all, historical and cultural ties connect the two countries to this day. For this reason, I am not at all surprised by the portrait that this film leaves us, about a world that rarely appears in the tourist magazines of Rio de Janeiro: the poor areas that, from the top of the hills, observe the noblest neighborhoods of the city.\r\nI could talk a little more about these slums, called “favelas”, but the truth is that I don't know much about them. Until the first decades of the 20th century, the visitor walking the streets of Rio de Janeiro, São Paulo or other cities would observe that the poorest generally lived in very compartmentalized buildings, called “cortiços”, scattered throughout the old neighbourhoods of the city. From the middle of the century, however, we witnessed the renewal and gentrification of the urban centers, with the demolition of large degraded areas and the building of modern structures and even skyscrapers. Pushed to the periphery, the marginalized ended up building their homes freely, without a plan or project, using leased or unowned land, giving rise to chaotic and disorderly urban tissues that climbed the hills. Total poverty, which has always driven Man to crime, was soon associated with drug trafficking and consumption, and other crimes such as illegal gambling, arms dealing and prostitution, and led to the birth of criminal mafias, heavily armed, which took advantage of the geography and difficulty of entering some of these “favelas” to transform them into fortresses, where not even the regular police dare to enter.\r\n\r\nThus, the issue of favelas was, and still is, a serious social, urbanistic and human problem for Brazilian cities. I don't have reliable data, but as far as I know, there is a long way to go to solve issues such as the lack of infrastructure, the lack of security of the land and the construction of houses in unstable lands. I know that measures have been taken to resolve them, and above all to combat crime (the film reveals this, taking advantage of Pope Benedict XVI's visit), but to what extent are they effective? What I can say is that, for now, Rio and São Paulo are off the list of the most dangerous cities in Brazil, but there is much to be done in other cities such as João Pessoa, Fortaleza, São Salvador or Natal.\r\n\r\nIn this film, we follow the journey of two recruits on a course for an elite police force, trained to intervene in the most complicated scenarios: the BOPE. Each is guided by their own reasons, but they are united by a feeling of weariness at the impunity of criminals. The head of the recruit, Captain Nascimento, is also at the center of the plot, as he is discreetly looking for a replacement in order to retire and be able to dedicate the rest of his time to his family, and the little psychological sanity he has left. It is a very raw portrayal of the extremely violent training of these units which, however, prepares them for the authentic urban warfare they have to face. It also lets us foresee a little of the gravity of the problem itself: armie-like bandits who commit brutalities without thinking twice, and a police force that could go to war if needed.\r\n\r\nWith this film, Wagner Moura achieves one of the most outstanding and important works of his career. He was not, until this film, one of the great Brazilian actors, one of those that we always remember when we think of Brazilian drama. However, I had already been appreciating his quality in some TV works he did, and even so, it was quite impressive to see him here. And although the film features other talented actors, such as André Ramiro and Caio Junqueira, it is Moura who stands out and dominates the film. I also liked the work of Fernanda Machado who, in a much more discreet way, shows the somewhat utopian and dreamy way in which upper-class youngsters seek to cultivate a sense of social justice without knowing, however, how to solve the problems at their root.\r\n\r\nTechnically, the film stands out for its enormous realism. It's a work of fiction, the characters and situations are invented, but everything was thought to seem true and authentic as in a documentary. We observe this, for example, in the enormous amount of profanity and slang used in the dialogues, or in the careful selection of the filming locations used, which include some “favelas” in Rio. Another point of praise is the quality of the action scenes, worthy of a big-budget American film and filled with good special effects and sound. It is a film inappropriate for children or to watch with that narrow-minded granny, but very good, one of the best films that Brazil managed to export internationally.", "created_at": "2022-12-15T07:08:13.967Z"}]