[{"movie_id": 435615, "review_id": "5f9039fed9f4a60038d83740", "author_rating": 8.0, "review_text": "The Cronenberg name is tightly associated with the body horror genre, and rightfully so. 'Possessor' feels like a fever dream, delivering unsettling violence, thought-provoking creativity and remorseless direction. Its revelations about the monsters within, summed up in its shockingly grim climax, have a lasting resonance.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-possessor-engrossingly-gross-cronenbergian-body-horror", "created_at": "2020-10-21T13:39:10.415Z"}, {"movie_id": 435615, "review_id": "5fa772e91d820f0041c2eb6d", "author_rating": 7.0, "review_text": "I just wrote a review about how mainstream critics don't \"get\" horror, elevating attempts at filmmaking \"art\" over the basics that horror fans love. \"Possessor\" is an exception where critics (72 Metacritic Score) and users (7.6 Metacritic Score) agree that it's a pretty damn good flick. \r\n\r\nThe acting is excellent. Andrea Riseborough from \"Mandy\" is creepy odd (again) as a mind-possessing assassin, and Christopher Abbott from \"It Comes at Night\" is a depressed AND possessed soul for the next assassination. \r\n\r\nThere are too many adjectives to list to give the film justice, so here's just a few: disturbing, violent, bloody, mind-bending, visual, provocative, \r\n\r\nWhile Brandon Cronenberg may have a similar interest in melding technology and horror as his father David Cronenberg, he is introducing his own style and originality. Very much like like Joe Hill has done with father Stephen King. \r\n\r\nAll of which is nothing but a bonus for horror fans.", "created_at": "2020-11-08T04:24:09.137Z"}, {"movie_id": 435615, "review_id": "5fecace6c4ad590041e81b20", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIn a year where the horror genre didn't have that many great representatives, Brandon Cronenberg's remarkably captivating concept is an instant attention-grabber. Boasting two phenomenal performances from Andrea Riseborough and Christopher Abbott (Colin Tate), Possessor is one of the most visually shocking films of 2020.\r\n\r\nFrom the extreme gore to the unrestrained depiction of insanely violent murders, Cronenberg fills his movie with creepy imagery that will definitely trigger many viewers to simply give up. Its slow pace helps establish the never-ending suspenseful atmosphere, which ultimately delivers some of the most intense sequences I've seen in a long time.\r\n\r\nDespite the interesting narrative and its eye-opening developments, Possessor fails to keep the momentum going throughout the entire runtime. The weird imagery helps with visual storytelling, but it reaches a point where it becomes too distracting and unnecessary. The third act is also quite predictable, contrasting with the somewhat surprising first half.\r\n\r\nIn the end, it's still one of my favorite horror films of the year.\r\n\r\nRating: B+", "created_at": "2020-12-30T16:37:58.293Z"}]