[{"movie_id": 1495, "review_id": "5baaa15492514150ff009293", "author_rating": 6.0, "review_text": "Good start and ending, weak middle, but magnificent photography and haunting score  \r\n\r\n\"Kingdom of Heaven\" (2005) isn’t as good as contemporaneous sword & sandal flicks \"Troy\" (one of my favorites) and \"King Arthur\" (very good), but it's not bad either.\r\n\r\nTHE PLOT: After the death of his child and suicide of his wife, Balian (Orlando Bloom) meets his long, lost father (Liam Neeson) who encourages him to go to Jerusalem and start a new life. After a long eventful trip, Balian arrives in Jerusalem and is introduced to Princess Sibylla (Eva Green), the leprous King Baldwin and other VIPs. The political maneuverings of these key personnel is mindboggling (I suggest using the subtitles to keep track of who’s who) but, when all is said and done, Balian must rise to the challenge of defending the city against Saladin (Ghassan Massoud) and his great Muslim army.\r\n\r\nLike \"Lawrence of Arabia\" (1962), \"Kingdom of Heaven\" is a film that can be enjoyed just for the visuals and soundtrack. The film was shot in Morocco where a vast replica of ancient Jerusalem was built in the desert with the backgrounds enhanced by CGI effects, and so on.\r\n\r\nStory-wise, the beginning and ending are strong while the convoluted soap operatics of Jerusalem aren't very compelling, but Eva Green's awesome eyes help.\r\n\r\nI'm no connoisseur of the crusades but I realize the filmmakers put a modern spin on the events and ideology of the characters. So what else is new? In any case, I was impressed that all the main players are based on real-life people and that the gist of the story is accurate.\r\n\r\nThe Theatrical Cut runs 144 minutes and the Director's Cut about 48 minutes longer. The DC is heralded as one of the best DCs ever, like \"Daredevil\" (2003).\r\n\r\nBOTTOM LINE: \"Kingdom of Heaven\" is worth it just for the magnificent visuals and soundtrack. The story starts strong and ends strong while the dramatics of the lengthy mid-section are complicated and not very compelling. But story drive and interesting characters were never director Ridley Scott’s strong suit. Nevertheless, Orlando Bloom is likable as the protagonist and Massoud makes for a striking Saladin, who doesn’t appear till the halfway point.\r\n\r\nGRADE: C+/B-", "created_at": "2018-09-25T20:57:56.450Z"}]