[{"movie_id": 49026, "review_id": "5010553819c2952d1b000451", "author_rating": 9.0, "review_text": "I felt like this was a tremendous end to Nolan's Batman trilogy. The Dark Knight Rises may very well have been the weakest of all 3 films but when you're talking about a scale of this magnitude, it still makes this one of the best movies I've seen in the past few years.\r\n\r\nI expected a little more _Batman_ than we got (especially with a runtime of 2:45) but while the story around the fall of Bruce Wayne and Gotham City was good I didn't find it amazing. This might be in fact, one of my only criticisms—it was a long movie but still, maybe too short for the story I felt was really being told. I feel confident in saying this big of a story could have been split into two movies.\r\n\r\nThe acting, editing, pacing, soundtrack and overall theme were the same 'as-close-to-perfect' as ever with any of Christopher Nolan's other films. Man does this guy know how to make a movie!\r\n\r\nYou don't have to be a Batman fan to enjoy these movies and I hope any of you who feel this way re-consider. These 3 movies are without a doubt in my mind, the finest display of comic mythology ever told on the big screen. They are damn near perfect.", "created_at": "2012-07-25T20:21:12.000Z"}, {"movie_id": 49026, "review_id": "5013bc76760ee372cb00253e", "author_rating": 10.0, "review_text": "I personally thought this film is on par if not better than the Dark Knight.\r\n\r\nWhilst some think the film is too long for the story I didn't find this. The length of the film is longer than some (but doesn't feel it), I liked that the film took it's time rather than shoving more elements in it - I think this contributed to the dramatic ending (much like a classical piece of music will be relaxed and calm before the final crescendo).\r\n\r\nAt the end of the day whether you like this film will boil down to if you like films Christopher Nolan has directed and/or you like the Christopher Nolan Batman series so far.\r\n\r\nStupendously good film in my opinion.", "created_at": "2012-07-28T10:18:30.000Z"}, {"movie_id": 49026, "review_id": "51429a7519c29552e10eba16", "author_rating": 9.5, "review_text": "The Dark Knight Rises is one of the best movies to come out in 2012. The story compels you to watch it time and time again. It also has I of, I my opinion, the best bad guys in any movie, Bane! Batman was well played as all ways and the cast where well selected. I think this movie is the best batman to see the light of day or the darkest nights (pun intended).", "created_at": "2013-03-15T03:50:13.579Z"}, {"movie_id": 49026, "review_id": "56b9e195c3a3681e6d0023b1", "author_rating": null, "review_text": "No doubt that the movie is one of the best movies of this era.\r\nThe film doesn't lack in whatever it try to do.It has Simple narration with extraordinary Direction,Acting,Music,Cinematography and a lot of qualities.\r\nChristian Bale is supremely entertaining for sure.\r\nThe person behind the scenes is actually the real core creater of the film yes! The Director Christopher Nolan ❤ .\r\nThe film ofcorse completes with philosophical quality loaded with Lots of Sacrifices.\r\nThis one is the one you surely can't afford to miss.\r\nGo watch The Dark Knight.Go now.", "created_at": "2016-02-09T12:54:45.510Z"}, {"movie_id": 49026, "review_id": "57463d409251415e6c000310", "author_rating": 10.0, "review_text": "While it's clearly not as superlative as its famous predecessor, it's simply because of both Heath Ledger's outstanding and Oscar-winning performance, and the character of the Joker's etching in our collective unconscious as the greatest comic-book villain ever created (with Lex Luthor a very distant second place). This is still a masterwork, and is an excellent coda to the finest filmic trilogy ever made. As great as Christopher Nolan is as a director, and as fine a film as 'Interstellar' is, I really don't know if he'll ever be able to top his work here, on these three films. But I, for one, am certainly looking forward to finding out...", "created_at": "2016-05-26T00:03:12.494Z"}, {"movie_id": 49026, "review_id": "58ac509892514158bc0151ca", "author_rating": 10.0, "review_text": "So here we have it. The end of a trilogy, the end of an era of the universe of Batman through the eyes of Christopher Nolan. And baby, it goes out with a bang...\r\n\r\nGoing into the theatre tonight I actually wasn't sure what I was up for. I loved Batman Begins, but I didn't actually care that much for The Dark Knight. So the big question was, will TDKR actually be more like the first or the second film? The answer is: neither.\r\n\r\nThis third instalment of the Nolan-franchise carries its weight all on its own merits. Despite the lack of any kind of intro or opening credits, there actually is plenty of build-up (partly thanks to the insane opening scene). The foundation for a proper, action-packed story is laid down perfectly, explaining things just enough whilst keeping the viewer intrigued to find out more. But if you thought that Nolan couldn't surpass his previous work, you will be pleasantly deceived.\r\n\r\nChristian Bale as Batman is terrific. Never before was a superhero so human, so vulnerable. As his mask of intangibility and anonymity slowly starts to crumble, this is a man who questions his reasons to keep being who he is, and he must figure it out before it is too late. Because somebody’s preparing to take him and Gotham down, and he might just be too strong for the Batman...\r\n\r\nThis somebody is a character called Bane. As a character, an actor and a performance it must be incredibly hard to follow Heath Ledger's The Joker, which was easily one of the greatest villains to ever appear on the silver screen. But tonight, Tom Hardy took a swing for the fence... and made it. His performance is thrilling and actually frightening, in the sense that you don't just *know* you're supposed to be afraid of this character, you actually FEEL it. He instils a feeling of horror and discomfort that is not rivalled by many other film villains. What I actually liked about his character the most is the fact that unlike Scarecrow, who grew into being a villain, and the Joker, who was just a raving maniac, Bane was actually (literally) born from evil. Born in hell, as it is said in the film. This is not a man, this is a creature. A living, breathing manifestation of evil that cannot be reasoned or negotiated with. Hardy's performance is masterful. Since his creepy mask is never removed, he, like only a few actors before him, must act without the use of any facial expressions, making his voice is main tool. His manner of speech (and the sound of it through his mask) is enough to send chills down your spine. This is more than just a another villain from a superhero flick, this is a character that just got torpedoed into the top 10 of the greatest antagonists in the history of film. Now I realise that's a bold statement to make, but you just go and watch TDKR and prove me wrong.\r\n\r\nI would say a slight downside to this film is the overflow of characters, both new and old. Aside from the already familiar characters, three new major ones are introduced. And there are also many characters running along in the margin which may seem not important enough to pay attention to, but actually they are so you need to stay focused.\r\n\r\nI understand the character of Joseph Gordon-Levitt, Blake, was written in specifically for him because Nolan wanted him in it. And although as a character he works just fine, it does feel like it was at the expense of Gary Oldman. As a cop, Levitt does everything that Oldman's character could've done, but he spends most of his screen time in the hospital, almost like they wanted to get him out of the way, and that's really too bad.\r\n\r\nNow, I was extremely excited to see what Nolan had done with Catwoman, because she is one of my favourite film characters. When I heard that she would be played by Anne Hathaway, I had my doubts. I thought she was just way too sweet to pull this off. But I must say, Ms Hathaway did a pretty good job. She is actually much more sly and devious than I thought she could be. The Nolan brothers, on the other hand, disappointed me here. Catwoman isn't really Catwoman, she's just a sexy girl in a spandex suit who can kick your ass. Her movements aren't even typically cat-like... So that was a bit of a letdown.\r\n\r\nI would also like to make a note on Michael Caine. I think his performance here was so much deeper and more character-driven than the other two films. In fact, there is one scene in particular, where he confesses something to Bruce, that almost moved me to tears. And this is actually TDKR’s greatest strength; unlike the other two films, this one deals much more with actual human emotions, it gives us an insight into what actually drives these characters, both heroes and villains alike. \r\n\r\nAs much as I would love to, the word-limit restricts me from elaborating more on the characters, so I'll just move on to the technical stuff. And in that department, actually pretty much everything was perfect. The pacing was very well balanced, and during those 2 ½ hours I didn't get bored once. Great action scenes alternate with more quiet moments, and the special effects are absolutely awesome. Hans Zimmer once again delivered a terrific score and there was some high quality dialogue. Also in store: a couple of great plot twists and two very cool cameos... There are a few plot holes, but everything else easily makes up for it. \r\n\r\nI highly recommend The Dark Knight Rises. It is a worthy conclusion to the trilogy, and it far exceeded my expectations.\r\n_(July 2012)_", "created_at": "2017-02-21T14:37:13.000Z"}, {"movie_id": 49026, "review_id": "5a851c500e0a2640110241d9", "author_rating": 5.0, "review_text": "Batman was one of my childhood heroes from the Comic magazines even though the Swedish plonkers, in their infinite stupidity, had renamed him to something as ridiculous “Läderlappen” which basically translates into “patch of leather”.\r\n\r\nThus, when Christopher Nolan brought us Batman Begins and steered away from the ridiculous comic shows that the previous batman movies (except the first one) had turned into I was thrilled. Unfortunately I was equally disappointed with this one.\r\n\r\nI think the title of the movie is quite misleading since Batman isn’t exactly rising at all but rather sinking. If this would have been a movie about some other “guy” it would probably have been excellent but it isn’t. It’s about Batman and as such I had expected him to be the hero going around beating up the bad guys.\r\n\r\nInstead the movie starts downright boring with Batman having dug himself down into a swamp of melancholy and closed himself off from the world. When he finally starts to appear again he gets pretty much beaten at every turn not to mention conned out of the Wayne fortune. What the f… is that? It isn’t until the end that he starts to be the real Batman and even then it’s not very exciting.\r\n\r\nActually Batman, as in Batman and not Wayne, is not really in the movie for a good chunk of the time and the real hero in this movie is really the young cop and he sure isn’t a particularly good substitute for the superhero Batman that I was expecting to watch.\r\n\r\nI was struggling with what to give this movie but in the end, since I probably would have thought it to be a good movie if it had not been labelled as a Batman movie, I gave it 5 out 10 stars. At least the special effects where quite okay.", "created_at": "2018-02-15T05:36:16.624Z"}, {"movie_id": 49026, "review_id": "5f5dc55d63d9370038b86aeb", "author_rating": 10.0, "review_text": "\"And when it is done, and Gotham is in ashes, then you have my permission to die.\" - Bane, the Dark Knight Rises.\r\n\r\nAn epic, amazing end to the Dark Knight trilogy, with great acting, numerous complex subplots, a creepy villain, amazing action scenes and a heart-thumping score. I really love this film and consider it one of Nolan's better works, and I wish more people on the Internet would start giving it more respect.\r\n\r\nOh, also, I really don't care about the small plot holes like the magic mechanical leg and Bruce appearing in Gotham when he was at the desert shortly before - do you really want to see ten minutes of Bruce using plastic surgery to fix his bone, or him in a airport going to Gotham?", "created_at": "2020-09-13T07:08:13.259Z"}, {"movie_id": 49026, "review_id": "61e3265207a8080041b32a23", "author_rating": 9.0, "review_text": "Even though the plot feels messier than the previous two installments, one cannot resist a smile after the unexpected twist and final scenes, which make ‘The Dark Knight Rises’ a worthy final chapter of Nolan's epical trilogy.\r\n\r\n9/10", "created_at": "2022-01-15T19:53:54.332Z"}, {"movie_id": 49026, "review_id": "63133b9f564ec700915d096b", "author_rating": 7.0, "review_text": "Tom Hardy is superb in this denouement to Christopher Nolan's \"Batman\" trilogy. His depiction of the clever and malevolent \"Bane\" is intricate and terrifying in equal measure. Christian Bale also has the role very much under control now as he joins forces with his old pal \"Gordon\" (Gary Oldman) and jewel thief turned \"Catwoman\" (Anne Hathaway) to rise to his biggest challenge yet... What's great about this film is that is ties up all of the loose ends from the first two; it dots some i's and crosses the t's as the story neatly, and frequently quite subtly, introduces new threads to an old suit of clothes. This is an hugely characterful outing for all concerned - especially Sir Michael Caine as the wonderfully underplayed \"Alfred\" and Morgan Freeman as the arch-inventor \"Fox\". The plot takes it's time to develop, there is plenty of to-ing and fro-ing as they battle for the upper hand; new allies must learn to trust and to rely on each other. I found myself drawn to the \"Bane\" cause more than I ought to admit - a sign of a great baddie; you empathise with the evil (I think of \"Darth Vader\") especially once the story unveils traits in his character and elements of his history that, to a certain extent, justify his behaviour. The dialogue is sparing and potent and photography is really effective: the light and shade are used creatively with the Hans Zimmer score an huge improvement on his last outing. This is certainly one for a big screen - there is loads to see each time you watch, and though \"Batman\" was never my favourite super-hero, this has to be up there as one of the darkest and best super-hero films.", "created_at": "2022-09-03T11:33:51.974Z"}, {"movie_id": 49026, "review_id": "64484e450e4fc80509fe89bb", "author_rating": 8.0, "review_text": "I enjoyed watching the Dark Knight. They were at least able to keep the same batman from the the last one made too.", "created_at": "2023-04-25T22:03:49.460Z"}, {"movie_id": 49026, "review_id": "5010553819c2952d1b000451", "author_rating": 9.0, "review_text": "I felt like this was a tremendous end to Nolan's Batman trilogy. The Dark Knight Rises may very well have been the weakest of all 3 films but when you're talking about a scale of this magnitude, it still makes this one of the best movies I've seen in the past few years.\r\n\r\nI expected a little more _Batman_ than we got (especially with a runtime of 2:45) but while the story around the fall of Bruce Wayne and Gotham City was good I didn't find it amazing. This might be in fact, one of my only criticisms—it was a long movie but still, maybe too short for the story I felt was really being told. I feel confident in saying this big of a story could have been split into two movies.\r\n\r\nThe acting, editing, pacing, soundtrack and overall theme were the same 'as-close-to-perfect' as ever with any of Christopher Nolan's other films. Man does this guy know how to make a movie!\r\n\r\nYou don't have to be a Batman fan to enjoy these movies and I hope any of you who feel this way re-consider. These 3 movies are without a doubt in my mind, the finest display of comic mythology ever told on the big screen. They are damn near perfect.", "created_at": "2012-07-25T20:21:12.000Z"}, {"movie_id": 49026, "review_id": "5013bc76760ee372cb00253e", "author_rating": 10.0, "review_text": "I personally thought this film is on par if not better than the Dark Knight.\r\n\r\nWhilst some think the film is too long for the story I didn't find this. The length of the film is longer than some (but doesn't feel it), I liked that the film took it's time rather than shoving more elements in it - I think this contributed to the dramatic ending (much like a classical piece of music will be relaxed and calm before the final crescendo).\r\n\r\nAt the end of the day whether you like this film will boil down to if you like films Christopher Nolan has directed and/or you like the Christopher Nolan Batman series so far.\r\n\r\nStupendously good film in my opinion.", "created_at": "2012-07-28T10:18:30.000Z"}, {"movie_id": 49026, "review_id": "51429a7519c29552e10eba16", "author_rating": 9.5, "review_text": "The Dark Knight Rises is one of the best movies to come out in 2012. The story compels you to watch it time and time again. It also has I of, I my opinion, the best bad guys in any movie, Bane! Batman was well played as all ways and the cast where well selected. I think this movie is the best batman to see the light of day or the darkest nights (pun intended).", "created_at": "2013-03-15T03:50:13.579Z"}, {"movie_id": 49026, "review_id": "56b9e195c3a3681e6d0023b1", "author_rating": null, "review_text": "No doubt that the movie is one of the best movies of this era.\r\nThe film doesn't lack in whatever it try to do.It has Simple narration with extraordinary Direction,Acting,Music,Cinematography and a lot of qualities.\r\nChristian Bale is supremely entertaining for sure.\r\nThe person behind the scenes is actually the real core creater of the film yes! The Director Christopher Nolan ❤ .\r\nThe film ofcorse completes with philosophical quality loaded with Lots of Sacrifices.\r\nThis one is the one you surely can't afford to miss.\r\nGo watch The Dark Knight.Go now.", "created_at": "2016-02-09T12:54:45.510Z"}, {"movie_id": 49026, "review_id": "57463d409251415e6c000310", "author_rating": 10.0, "review_text": "While it's clearly not as superlative as its famous predecessor, it's simply because of both Heath Ledger's outstanding and Oscar-winning performance, and the character of the Joker's etching in our collective unconscious as the greatest comic-book villain ever created (with Lex Luthor a very distant second place). This is still a masterwork, and is an excellent coda to the finest filmic trilogy ever made. As great as Christopher Nolan is as a director, and as fine a film as 'Interstellar' is, I really don't know if he'll ever be able to top his work here, on these three films. But I, for one, am certainly looking forward to finding out...", "created_at": "2016-05-26T00:03:12.494Z"}, {"movie_id": 49026, "review_id": "58ac509892514158bc0151ca", "author_rating": 10.0, "review_text": "So here we have it. The end of a trilogy, the end of an era of the universe of Batman through the eyes of Christopher Nolan. And baby, it goes out with a bang...\r\n\r\nGoing into the theatre tonight I actually wasn't sure what I was up for. I loved Batman Begins, but I didn't actually care that much for The Dark Knight. So the big question was, will TDKR actually be more like the first or the second film? The answer is: neither.\r\n\r\nThis third instalment of the Nolan-franchise carries its weight all on its own merits. Despite the lack of any kind of intro or opening credits, there actually is plenty of build-up (partly thanks to the insane opening scene). The foundation for a proper, action-packed story is laid down perfectly, explaining things just enough whilst keeping the viewer intrigued to find out more. But if you thought that Nolan couldn't surpass his previous work, you will be pleasantly deceived.\r\n\r\nChristian Bale as Batman is terrific. Never before was a superhero so human, so vulnerable. As his mask of intangibility and anonymity slowly starts to crumble, this is a man who questions his reasons to keep being who he is, and he must figure it out before it is too late. Because somebody’s preparing to take him and Gotham down, and he might just be too strong for the Batman...\r\n\r\nThis somebody is a character called Bane. As a character, an actor and a performance it must be incredibly hard to follow Heath Ledger's The Joker, which was easily one of the greatest villains to ever appear on the silver screen. But tonight, Tom Hardy took a swing for the fence... and made it. His performance is thrilling and actually frightening, in the sense that you don't just *know* you're supposed to be afraid of this character, you actually FEEL it. He instils a feeling of horror and discomfort that is not rivalled by many other film villains. What I actually liked about his character the most is the fact that unlike Scarecrow, who grew into being a villain, and the Joker, who was just a raving maniac, Bane was actually (literally) born from evil. Born in hell, as it is said in the film. This is not a man, this is a creature. A living, breathing manifestation of evil that cannot be reasoned or negotiated with. Hardy's performance is masterful. Since his creepy mask is never removed, he, like only a few actors before him, must act without the use of any facial expressions, making his voice is main tool. His manner of speech (and the sound of it through his mask) is enough to send chills down your spine. This is more than just a another villain from a superhero flick, this is a character that just got torpedoed into the top 10 of the greatest antagonists in the history of film. Now I realise that's a bold statement to make, but you just go and watch TDKR and prove me wrong.\r\n\r\nI would say a slight downside to this film is the overflow of characters, both new and old. Aside from the already familiar characters, three new major ones are introduced. And there are also many characters running along in the margin which may seem not important enough to pay attention to, but actually they are so you need to stay focused.\r\n\r\nI understand the character of Joseph Gordon-Levitt, Blake, was written in specifically for him because Nolan wanted him in it. And although as a character he works just fine, it does feel like it was at the expense of Gary Oldman. As a cop, Levitt does everything that Oldman's character could've done, but he spends most of his screen time in the hospital, almost like they wanted to get him out of the way, and that's really too bad.\r\n\r\nNow, I was extremely excited to see what Nolan had done with Catwoman, because she is one of my favourite film characters. When I heard that she would be played by Anne Hathaway, I had my doubts. I thought she was just way too sweet to pull this off. But I must say, Ms Hathaway did a pretty good job. She is actually much more sly and devious than I thought she could be. The Nolan brothers, on the other hand, disappointed me here. Catwoman isn't really Catwoman, she's just a sexy girl in a spandex suit who can kick your ass. Her movements aren't even typically cat-like... So that was a bit of a letdown.\r\n\r\nI would also like to make a note on Michael Caine. I think his performance here was so much deeper and more character-driven than the other two films. In fact, there is one scene in particular, where he confesses something to Bruce, that almost moved me to tears. And this is actually TDKR’s greatest strength; unlike the other two films, this one deals much more with actual human emotions, it gives us an insight into what actually drives these characters, both heroes and villains alike. \r\n\r\nAs much as I would love to, the word-limit restricts me from elaborating more on the characters, so I'll just move on to the technical stuff. And in that department, actually pretty much everything was perfect. The pacing was very well balanced, and during those 2 ½ hours I didn't get bored once. Great action scenes alternate with more quiet moments, and the special effects are absolutely awesome. Hans Zimmer once again delivered a terrific score and there was some high quality dialogue. Also in store: a couple of great plot twists and two very cool cameos... There are a few plot holes, but everything else easily makes up for it. \r\n\r\nI highly recommend The Dark Knight Rises. It is a worthy conclusion to the trilogy, and it far exceeded my expectations.\r\n_(July 2012)_", "created_at": "2017-02-21T14:37:13.000Z"}, {"movie_id": 49026, "review_id": "5a851c500e0a2640110241d9", "author_rating": 5.0, "review_text": "Batman was one of my childhood heroes from the Comic magazines even though the Swedish plonkers, in their infinite stupidity, had renamed him to something as ridiculous “Läderlappen” which basically translates into “patch of leather”.\r\n\r\nThus, when Christopher Nolan brought us Batman Begins and steered away from the ridiculous comic shows that the previous batman movies (except the first one) had turned into I was thrilled. Unfortunately I was equally disappointed with this one.\r\n\r\nI think the title of the movie is quite misleading since Batman isn’t exactly rising at all but rather sinking. If this would have been a movie about some other “guy” it would probably have been excellent but it isn’t. It’s about Batman and as such I had expected him to be the hero going around beating up the bad guys.\r\n\r\nInstead the movie starts downright boring with Batman having dug himself down into a swamp of melancholy and closed himself off from the world. When he finally starts to appear again he gets pretty much beaten at every turn not to mention conned out of the Wayne fortune. What the f… is that? It isn’t until the end that he starts to be the real Batman and even then it’s not very exciting.\r\n\r\nActually Batman, as in Batman and not Wayne, is not really in the movie for a good chunk of the time and the real hero in this movie is really the young cop and he sure isn’t a particularly good substitute for the superhero Batman that I was expecting to watch.\r\n\r\nI was struggling with what to give this movie but in the end, since I probably would have thought it to be a good movie if it had not been labelled as a Batman movie, I gave it 5 out 10 stars. At least the special effects where quite okay.", "created_at": "2018-02-15T05:36:16.624Z"}, {"movie_id": 49026, "review_id": "5f5dc55d63d9370038b86aeb", "author_rating": 10.0, "review_text": "\"And when it is done, and Gotham is in ashes, then you have my permission to die.\" - Bane, the Dark Knight Rises.\r\n\r\nAn epic, amazing end to the Dark Knight trilogy, with great acting, numerous complex subplots, a creepy villain, amazing action scenes and a heart-thumping score. I really love this film and consider it one of Nolan's better works, and I wish more people on the Internet would start giving it more respect.\r\n\r\nOh, also, I really don't care about the small plot holes like the magic mechanical leg and Bruce appearing in Gotham when he was at the desert shortly before - do you really want to see ten minutes of Bruce using plastic surgery to fix his bone, or him in a airport going to Gotham?", "created_at": "2020-09-13T07:08:13.259Z"}, {"movie_id": 49026, "review_id": "61e3265207a8080041b32a23", "author_rating": 9.0, "review_text": "Even though the plot feels messier than the previous two installments, one cannot resist a smile after the unexpected twist and final scenes, which make ‘The Dark Knight Rises’ a worthy final chapter of Nolan's epical trilogy.\r\n\r\n9/10", "created_at": "2022-01-15T19:53:54.332Z"}, {"movie_id": 49026, "review_id": "63133b9f564ec700915d096b", "author_rating": 7.0, "review_text": "Tom Hardy is superb in this denouement to Christopher Nolan's \"Batman\" trilogy. His depiction of the clever and malevolent \"Bane\" is intricate and terrifying in equal measure. Christian Bale also has the role very much under control now as he joins forces with his old pal \"Gordon\" (Gary Oldman) and jewel thief turned \"Catwoman\" (Anne Hathaway) to rise to his biggest challenge yet... What's great about this film is that is ties up all of the loose ends from the first two; it dots some i's and crosses the t's as the story neatly, and frequently quite subtly, introduces new threads to an old suit of clothes. This is an hugely characterful outing for all concerned - especially Sir Michael Caine as the wonderfully underplayed \"Alfred\" and Morgan Freeman as the arch-inventor \"Fox\". The plot takes it's time to develop, there is plenty of to-ing and fro-ing as they battle for the upper hand; new allies must learn to trust and to rely on each other. I found myself drawn to the \"Bane\" cause more than I ought to admit - a sign of a great baddie; you empathise with the evil (I think of \"Darth Vader\") especially once the story unveils traits in his character and elements of his history that, to a certain extent, justify his behaviour. The dialogue is sparing and potent and photography is really effective: the light and shade are used creatively with the Hans Zimmer score an huge improvement on his last outing. This is certainly one for a big screen - there is loads to see each time you watch, and though \"Batman\" was never my favourite super-hero, this has to be up there as one of the darkest and best super-hero films.", "created_at": "2022-09-03T11:33:51.974Z"}, {"movie_id": 49026, "review_id": "64484e450e4fc80509fe89bb", "author_rating": 8.0, "review_text": "I enjoyed watching the Dark Knight. They were at least able to keep the same batman from the the last one made too.", "created_at": "2023-04-25T22:03:49.460Z"}, {"movie_id": 49026, "review_id": "5010553819c2952d1b000451", "author_rating": 9.0, "review_text": "I felt like this was a tremendous end to Nolan's Batman trilogy. The Dark Knight Rises may very well have been the weakest of all 3 films but when you're talking about a scale of this magnitude, it still makes this one of the best movies I've seen in the past few years.\r\n\r\nI expected a little more _Batman_ than we got (especially with a runtime of 2:45) but while the story around the fall of Bruce Wayne and Gotham City was good I didn't find it amazing. This might be in fact, one of my only criticisms—it was a long movie but still, maybe too short for the story I felt was really being told. I feel confident in saying this big of a story could have been split into two movies.\r\n\r\nThe acting, editing, pacing, soundtrack and overall theme were the same 'as-close-to-perfect' as ever with any of Christopher Nolan's other films. Man does this guy know how to make a movie!\r\n\r\nYou don't have to be a Batman fan to enjoy these movies and I hope any of you who feel this way re-consider. These 3 movies are without a doubt in my mind, the finest display of comic mythology ever told on the big screen. They are damn near perfect.", "created_at": "2012-07-25T20:21:12.000Z"}, {"movie_id": 49026, "review_id": "5013bc76760ee372cb00253e", "author_rating": 10.0, "review_text": "I personally thought this film is on par if not better than the Dark Knight.\r\n\r\nWhilst some think the film is too long for the story I didn't find this. The length of the film is longer than some (but doesn't feel it), I liked that the film took it's time rather than shoving more elements in it - I think this contributed to the dramatic ending (much like a classical piece of music will be relaxed and calm before the final crescendo).\r\n\r\nAt the end of the day whether you like this film will boil down to if you like films Christopher Nolan has directed and/or you like the Christopher Nolan Batman series so far.\r\n\r\nStupendously good film in my opinion.", "created_at": "2012-07-28T10:18:30.000Z"}, {"movie_id": 49026, "review_id": "51429a7519c29552e10eba16", "author_rating": 9.5, "review_text": "The Dark Knight Rises is one of the best movies to come out in 2012. The story compels you to watch it time and time again. It also has I of, I my opinion, the best bad guys in any movie, Bane! Batman was well played as all ways and the cast where well selected. I think this movie is the best batman to see the light of day or the darkest nights (pun intended).", "created_at": "2013-03-15T03:50:13.579Z"}, {"movie_id": 49026, "review_id": "56b9e195c3a3681e6d0023b1", "author_rating": null, "review_text": "No doubt that the movie is one of the best movies of this era.\r\nThe film doesn't lack in whatever it try to do.It has Simple narration with extraordinary Direction,Acting,Music,Cinematography and a lot of qualities.\r\nChristian Bale is supremely entertaining for sure.\r\nThe person behind the scenes is actually the real core creater of the film yes! The Director Christopher Nolan ❤ .\r\nThe film ofcorse completes with philosophical quality loaded with Lots of Sacrifices.\r\nThis one is the one you surely can't afford to miss.\r\nGo watch The Dark Knight.Go now.", "created_at": "2016-02-09T12:54:45.510Z"}, {"movie_id": 49026, "review_id": "57463d409251415e6c000310", "author_rating": 10.0, "review_text": "While it's clearly not as superlative as its famous predecessor, it's simply because of both Heath Ledger's outstanding and Oscar-winning performance, and the character of the Joker's etching in our collective unconscious as the greatest comic-book villain ever created (with Lex Luthor a very distant second place). This is still a masterwork, and is an excellent coda to the finest filmic trilogy ever made. As great as Christopher Nolan is as a director, and as fine a film as 'Interstellar' is, I really don't know if he'll ever be able to top his work here, on these three films. But I, for one, am certainly looking forward to finding out...", "created_at": "2016-05-26T00:03:12.494Z"}, {"movie_id": 49026, "review_id": "58ac509892514158bc0151ca", "author_rating": 10.0, "review_text": "So here we have it. The end of a trilogy, the end of an era of the universe of Batman through the eyes of Christopher Nolan. And baby, it goes out with a bang...\r\n\r\nGoing into the theatre tonight I actually wasn't sure what I was up for. I loved Batman Begins, but I didn't actually care that much for The Dark Knight. So the big question was, will TDKR actually be more like the first or the second film? The answer is: neither.\r\n\r\nThis third instalment of the Nolan-franchise carries its weight all on its own merits. Despite the lack of any kind of intro or opening credits, there actually is plenty of build-up (partly thanks to the insane opening scene). The foundation for a proper, action-packed story is laid down perfectly, explaining things just enough whilst keeping the viewer intrigued to find out more. But if you thought that Nolan couldn't surpass his previous work, you will be pleasantly deceived.\r\n\r\nChristian Bale as Batman is terrific. Never before was a superhero so human, so vulnerable. As his mask of intangibility and anonymity slowly starts to crumble, this is a man who questions his reasons to keep being who he is, and he must figure it out before it is too late. Because somebody’s preparing to take him and Gotham down, and he might just be too strong for the Batman...\r\n\r\nThis somebody is a character called Bane. As a character, an actor and a performance it must be incredibly hard to follow Heath Ledger's The Joker, which was easily one of the greatest villains to ever appear on the silver screen. But tonight, Tom Hardy took a swing for the fence... and made it. His performance is thrilling and actually frightening, in the sense that you don't just *know* you're supposed to be afraid of this character, you actually FEEL it. He instils a feeling of horror and discomfort that is not rivalled by many other film villains. What I actually liked about his character the most is the fact that unlike Scarecrow, who grew into being a villain, and the Joker, who was just a raving maniac, Bane was actually (literally) born from evil. Born in hell, as it is said in the film. This is not a man, this is a creature. A living, breathing manifestation of evil that cannot be reasoned or negotiated with. Hardy's performance is masterful. Since his creepy mask is never removed, he, like only a few actors before him, must act without the use of any facial expressions, making his voice is main tool. His manner of speech (and the sound of it through his mask) is enough to send chills down your spine. This is more than just a another villain from a superhero flick, this is a character that just got torpedoed into the top 10 of the greatest antagonists in the history of film. Now I realise that's a bold statement to make, but you just go and watch TDKR and prove me wrong.\r\n\r\nI would say a slight downside to this film is the overflow of characters, both new and old. Aside from the already familiar characters, three new major ones are introduced. And there are also many characters running along in the margin which may seem not important enough to pay attention to, but actually they are so you need to stay focused.\r\n\r\nI understand the character of Joseph Gordon-Levitt, Blake, was written in specifically for him because Nolan wanted him in it. And although as a character he works just fine, it does feel like it was at the expense of Gary Oldman. As a cop, Levitt does everything that Oldman's character could've done, but he spends most of his screen time in the hospital, almost like they wanted to get him out of the way, and that's really too bad.\r\n\r\nNow, I was extremely excited to see what Nolan had done with Catwoman, because she is one of my favourite film characters. When I heard that she would be played by Anne Hathaway, I had my doubts. I thought she was just way too sweet to pull this off. But I must say, Ms Hathaway did a pretty good job. She is actually much more sly and devious than I thought she could be. The Nolan brothers, on the other hand, disappointed me here. Catwoman isn't really Catwoman, she's just a sexy girl in a spandex suit who can kick your ass. Her movements aren't even typically cat-like... So that was a bit of a letdown.\r\n\r\nI would also like to make a note on Michael Caine. I think his performance here was so much deeper and more character-driven than the other two films. In fact, there is one scene in particular, where he confesses something to Bruce, that almost moved me to tears. And this is actually TDKR’s greatest strength; unlike the other two films, this one deals much more with actual human emotions, it gives us an insight into what actually drives these characters, both heroes and villains alike. \r\n\r\nAs much as I would love to, the word-limit restricts me from elaborating more on the characters, so I'll just move on to the technical stuff. And in that department, actually pretty much everything was perfect. The pacing was very well balanced, and during those 2 ½ hours I didn't get bored once. Great action scenes alternate with more quiet moments, and the special effects are absolutely awesome. Hans Zimmer once again delivered a terrific score and there was some high quality dialogue. Also in store: a couple of great plot twists and two very cool cameos... There are a few plot holes, but everything else easily makes up for it. \r\n\r\nI highly recommend The Dark Knight Rises. It is a worthy conclusion to the trilogy, and it far exceeded my expectations.\r\n_(July 2012)_", "created_at": "2017-02-21T14:37:13.000Z"}, {"movie_id": 49026, "review_id": "5a851c500e0a2640110241d9", "author_rating": 5.0, "review_text": "Batman was one of my childhood heroes from the Comic magazines even though the Swedish plonkers, in their infinite stupidity, had renamed him to something as ridiculous “Läderlappen” which basically translates into “patch of leather”.\r\n\r\nThus, when Christopher Nolan brought us Batman Begins and steered away from the ridiculous comic shows that the previous batman movies (except the first one) had turned into I was thrilled. Unfortunately I was equally disappointed with this one.\r\n\r\nI think the title of the movie is quite misleading since Batman isn’t exactly rising at all but rather sinking. If this would have been a movie about some other “guy” it would probably have been excellent but it isn’t. It’s about Batman and as such I had expected him to be the hero going around beating up the bad guys.\r\n\r\nInstead the movie starts downright boring with Batman having dug himself down into a swamp of melancholy and closed himself off from the world. When he finally starts to appear again he gets pretty much beaten at every turn not to mention conned out of the Wayne fortune. What the f… is that? It isn’t until the end that he starts to be the real Batman and even then it’s not very exciting.\r\n\r\nActually Batman, as in Batman and not Wayne, is not really in the movie for a good chunk of the time and the real hero in this movie is really the young cop and he sure isn’t a particularly good substitute for the superhero Batman that I was expecting to watch.\r\n\r\nI was struggling with what to give this movie but in the end, since I probably would have thought it to be a good movie if it had not been labelled as a Batman movie, I gave it 5 out 10 stars. At least the special effects where quite okay.", "created_at": "2018-02-15T05:36:16.624Z"}, {"movie_id": 49026, "review_id": "5f5dc55d63d9370038b86aeb", "author_rating": 10.0, "review_text": "\"And when it is done, and Gotham is in ashes, then you have my permission to die.\" - Bane, the Dark Knight Rises.\r\n\r\nAn epic, amazing end to the Dark Knight trilogy, with great acting, numerous complex subplots, a creepy villain, amazing action scenes and a heart-thumping score. I really love this film and consider it one of Nolan's better works, and I wish more people on the Internet would start giving it more respect.\r\n\r\nOh, also, I really don't care about the small plot holes like the magic mechanical leg and Bruce appearing in Gotham when he was at the desert shortly before - do you really want to see ten minutes of Bruce using plastic surgery to fix his bone, or him in a airport going to Gotham?", "created_at": "2020-09-13T07:08:13.259Z"}, {"movie_id": 49026, "review_id": "61e3265207a8080041b32a23", "author_rating": 9.0, "review_text": "Even though the plot feels messier than the previous two installments, one cannot resist a smile after the unexpected twist and final scenes, which make ‘The Dark Knight Rises’ a worthy final chapter of Nolan's epical trilogy.\r\n\r\n9/10", "created_at": "2022-01-15T19:53:54.332Z"}, {"movie_id": 49026, "review_id": "63133b9f564ec700915d096b", "author_rating": 7.0, "review_text": "Tom Hardy is superb in this denouement to Christopher Nolan's \"Batman\" trilogy. His depiction of the clever and malevolent \"Bane\" is intricate and terrifying in equal measure. Christian Bale also has the role very much under control now as he joins forces with his old pal \"Gordon\" (Gary Oldman) and jewel thief turned \"Catwoman\" (Anne Hathaway) to rise to his biggest challenge yet... What's great about this film is that is ties up all of the loose ends from the first two; it dots some i's and crosses the t's as the story neatly, and frequently quite subtly, introduces new threads to an old suit of clothes. This is an hugely characterful outing for all concerned - especially Sir Michael Caine as the wonderfully underplayed \"Alfred\" and Morgan Freeman as the arch-inventor \"Fox\". The plot takes it's time to develop, there is plenty of to-ing and fro-ing as they battle for the upper hand; new allies must learn to trust and to rely on each other. I found myself drawn to the \"Bane\" cause more than I ought to admit - a sign of a great baddie; you empathise with the evil (I think of \"Darth Vader\") especially once the story unveils traits in his character and elements of his history that, to a certain extent, justify his behaviour. The dialogue is sparing and potent and photography is really effective: the light and shade are used creatively with the Hans Zimmer score an huge improvement on his last outing. This is certainly one for a big screen - there is loads to see each time you watch, and though \"Batman\" was never my favourite super-hero, this has to be up there as one of the darkest and best super-hero films.", "created_at": "2022-09-03T11:33:51.974Z"}, {"movie_id": 49026, "review_id": "64484e450e4fc80509fe89bb", "author_rating": 8.0, "review_text": "I enjoyed watching the Dark Knight. They were at least able to keep the same batman from the the last one made too.", "created_at": "2023-04-25T22:03:49.460Z"}, {"movie_id": 49026, "review_id": "5010553819c2952d1b000451", "author_rating": 9.0, "review_text": "I felt like this was a tremendous end to Nolan's Batman trilogy. The Dark Knight Rises may very well have been the weakest of all 3 films but when you're talking about a scale of this magnitude, it still makes this one of the best movies I've seen in the past few years.\r\n\r\nI expected a little more _Batman_ than we got (especially with a runtime of 2:45) but while the story around the fall of Bruce Wayne and Gotham City was good I didn't find it amazing. This might be in fact, one of my only criticisms—it was a long movie but still, maybe too short for the story I felt was really being told. I feel confident in saying this big of a story could have been split into two movies.\r\n\r\nThe acting, editing, pacing, soundtrack and overall theme were the same 'as-close-to-perfect' as ever with any of Christopher Nolan's other films. Man does this guy know how to make a movie!\r\n\r\nYou don't have to be a Batman fan to enjoy these movies and I hope any of you who feel this way re-consider. These 3 movies are without a doubt in my mind, the finest display of comic mythology ever told on the big screen. They are damn near perfect.", "created_at": "2012-07-25T20:21:12.000Z"}, {"movie_id": 49026, "review_id": "5013bc76760ee372cb00253e", "author_rating": 10.0, "review_text": "I personally thought this film is on par if not better than the Dark Knight.\r\n\r\nWhilst some think the film is too long for the story I didn't find this. The length of the film is longer than some (but doesn't feel it), I liked that the film took it's time rather than shoving more elements in it - I think this contributed to the dramatic ending (much like a classical piece of music will be relaxed and calm before the final crescendo).\r\n\r\nAt the end of the day whether you like this film will boil down to if you like films Christopher Nolan has directed and/or you like the Christopher Nolan Batman series so far.\r\n\r\nStupendously good film in my opinion.", "created_at": "2012-07-28T10:18:30.000Z"}, {"movie_id": 49026, "review_id": "51429a7519c29552e10eba16", "author_rating": 9.5, "review_text": "The Dark Knight Rises is one of the best movies to come out in 2012. The story compels you to watch it time and time again. It also has I of, I my opinion, the best bad guys in any movie, Bane! Batman was well played as all ways and the cast where well selected. I think this movie is the best batman to see the light of day or the darkest nights (pun intended).", "created_at": "2013-03-15T03:50:13.579Z"}, {"movie_id": 49026, "review_id": "56b9e195c3a3681e6d0023b1", "author_rating": null, "review_text": "No doubt that the movie is one of the best movies of this era.\r\nThe film doesn't lack in whatever it try to do.It has Simple narration with extraordinary Direction,Acting,Music,Cinematography and a lot of qualities.\r\nChristian Bale is supremely entertaining for sure.\r\nThe person behind the scenes is actually the real core creater of the film yes! The Director Christopher Nolan ❤ .\r\nThe film ofcorse completes with philosophical quality loaded with Lots of Sacrifices.\r\nThis one is the one you surely can't afford to miss.\r\nGo watch The Dark Knight.Go now.", "created_at": "2016-02-09T12:54:45.510Z"}, {"movie_id": 49026, "review_id": "57463d409251415e6c000310", "author_rating": 10.0, "review_text": "While it's clearly not as superlative as its famous predecessor, it's simply because of both Heath Ledger's outstanding and Oscar-winning performance, and the character of the Joker's etching in our collective unconscious as the greatest comic-book villain ever created (with Lex Luthor a very distant second place). This is still a masterwork, and is an excellent coda to the finest filmic trilogy ever made. As great as Christopher Nolan is as a director, and as fine a film as 'Interstellar' is, I really don't know if he'll ever be able to top his work here, on these three films. But I, for one, am certainly looking forward to finding out...", "created_at": "2016-05-26T00:03:12.494Z"}, {"movie_id": 49026, "review_id": "58ac509892514158bc0151ca", "author_rating": 10.0, "review_text": "So here we have it. The end of a trilogy, the end of an era of the universe of Batman through the eyes of Christopher Nolan. And baby, it goes out with a bang...\r\n\r\nGoing into the theatre tonight I actually wasn't sure what I was up for. I loved Batman Begins, but I didn't actually care that much for The Dark Knight. So the big question was, will TDKR actually be more like the first or the second film? The answer is: neither.\r\n\r\nThis third instalment of the Nolan-franchise carries its weight all on its own merits. Despite the lack of any kind of intro or opening credits, there actually is plenty of build-up (partly thanks to the insane opening scene). The foundation for a proper, action-packed story is laid down perfectly, explaining things just enough whilst keeping the viewer intrigued to find out more. But if you thought that Nolan couldn't surpass his previous work, you will be pleasantly deceived.\r\n\r\nChristian Bale as Batman is terrific. Never before was a superhero so human, so vulnerable. As his mask of intangibility and anonymity slowly starts to crumble, this is a man who questions his reasons to keep being who he is, and he must figure it out before it is too late. Because somebody’s preparing to take him and Gotham down, and he might just be too strong for the Batman...\r\n\r\nThis somebody is a character called Bane. As a character, an actor and a performance it must be incredibly hard to follow Heath Ledger's The Joker, which was easily one of the greatest villains to ever appear on the silver screen. But tonight, Tom Hardy took a swing for the fence... and made it. His performance is thrilling and actually frightening, in the sense that you don't just *know* you're supposed to be afraid of this character, you actually FEEL it. He instils a feeling of horror and discomfort that is not rivalled by many other film villains. What I actually liked about his character the most is the fact that unlike Scarecrow, who grew into being a villain, and the Joker, who was just a raving maniac, Bane was actually (literally) born from evil. Born in hell, as it is said in the film. This is not a man, this is a creature. A living, breathing manifestation of evil that cannot be reasoned or negotiated with. Hardy's performance is masterful. Since his creepy mask is never removed, he, like only a few actors before him, must act without the use of any facial expressions, making his voice is main tool. His manner of speech (and the sound of it through his mask) is enough to send chills down your spine. This is more than just a another villain from a superhero flick, this is a character that just got torpedoed into the top 10 of the greatest antagonists in the history of film. Now I realise that's a bold statement to make, but you just go and watch TDKR and prove me wrong.\r\n\r\nI would say a slight downside to this film is the overflow of characters, both new and old. Aside from the already familiar characters, three new major ones are introduced. And there are also many characters running along in the margin which may seem not important enough to pay attention to, but actually they are so you need to stay focused.\r\n\r\nI understand the character of Joseph Gordon-Levitt, Blake, was written in specifically for him because Nolan wanted him in it. And although as a character he works just fine, it does feel like it was at the expense of Gary Oldman. As a cop, Levitt does everything that Oldman's character could've done, but he spends most of his screen time in the hospital, almost like they wanted to get him out of the way, and that's really too bad.\r\n\r\nNow, I was extremely excited to see what Nolan had done with Catwoman, because she is one of my favourite film characters. When I heard that she would be played by Anne Hathaway, I had my doubts. I thought she was just way too sweet to pull this off. But I must say, Ms Hathaway did a pretty good job. She is actually much more sly and devious than I thought she could be. The Nolan brothers, on the other hand, disappointed me here. Catwoman isn't really Catwoman, she's just a sexy girl in a spandex suit who can kick your ass. Her movements aren't even typically cat-like... So that was a bit of a letdown.\r\n\r\nI would also like to make a note on Michael Caine. I think his performance here was so much deeper and more character-driven than the other two films. In fact, there is one scene in particular, where he confesses something to Bruce, that almost moved me to tears. And this is actually TDKR’s greatest strength; unlike the other two films, this one deals much more with actual human emotions, it gives us an insight into what actually drives these characters, both heroes and villains alike. \r\n\r\nAs much as I would love to, the word-limit restricts me from elaborating more on the characters, so I'll just move on to the technical stuff. And in that department, actually pretty much everything was perfect. The pacing was very well balanced, and during those 2 ½ hours I didn't get bored once. Great action scenes alternate with more quiet moments, and the special effects are absolutely awesome. Hans Zimmer once again delivered a terrific score and there was some high quality dialogue. Also in store: a couple of great plot twists and two very cool cameos... There are a few plot holes, but everything else easily makes up for it. \r\n\r\nI highly recommend The Dark Knight Rises. It is a worthy conclusion to the trilogy, and it far exceeded my expectations.\r\n_(July 2012)_", "created_at": "2017-02-21T14:37:13.000Z"}, {"movie_id": 49026, "review_id": "5a851c500e0a2640110241d9", "author_rating": 5.0, "review_text": "Batman was one of my childhood heroes from the Comic magazines even though the Swedish plonkers, in their infinite stupidity, had renamed him to something as ridiculous “Läderlappen” which basically translates into “patch of leather”.\r\n\r\nThus, when Christopher Nolan brought us Batman Begins and steered away from the ridiculous comic shows that the previous batman movies (except the first one) had turned into I was thrilled. Unfortunately I was equally disappointed with this one.\r\n\r\nI think the title of the movie is quite misleading since Batman isn’t exactly rising at all but rather sinking. If this would have been a movie about some other “guy” it would probably have been excellent but it isn’t. It’s about Batman and as such I had expected him to be the hero going around beating up the bad guys.\r\n\r\nInstead the movie starts downright boring with Batman having dug himself down into a swamp of melancholy and closed himself off from the world. When he finally starts to appear again he gets pretty much beaten at every turn not to mention conned out of the Wayne fortune. What the f… is that? It isn’t until the end that he starts to be the real Batman and even then it’s not very exciting.\r\n\r\nActually Batman, as in Batman and not Wayne, is not really in the movie for a good chunk of the time and the real hero in this movie is really the young cop and he sure isn’t a particularly good substitute for the superhero Batman that I was expecting to watch.\r\n\r\nI was struggling with what to give this movie but in the end, since I probably would have thought it to be a good movie if it had not been labelled as a Batman movie, I gave it 5 out 10 stars. At least the special effects where quite okay.", "created_at": "2018-02-15T05:36:16.624Z"}, {"movie_id": 49026, "review_id": "5f5dc55d63d9370038b86aeb", "author_rating": 10.0, "review_text": "\"And when it is done, and Gotham is in ashes, then you have my permission to die.\" - Bane, the Dark Knight Rises.\r\n\r\nAn epic, amazing end to the Dark Knight trilogy, with great acting, numerous complex subplots, a creepy villain, amazing action scenes and a heart-thumping score. I really love this film and consider it one of Nolan's better works, and I wish more people on the Internet would start giving it more respect.\r\n\r\nOh, also, I really don't care about the small plot holes like the magic mechanical leg and Bruce appearing in Gotham when he was at the desert shortly before - do you really want to see ten minutes of Bruce using plastic surgery to fix his bone, or him in a airport going to Gotham?", "created_at": "2020-09-13T07:08:13.259Z"}, {"movie_id": 49026, "review_id": "61e3265207a8080041b32a23", "author_rating": 9.0, "review_text": "Even though the plot feels messier than the previous two installments, one cannot resist a smile after the unexpected twist and final scenes, which make ‘The Dark Knight Rises’ a worthy final chapter of Nolan's epical trilogy.\r\n\r\n9/10", "created_at": "2022-01-15T19:53:54.332Z"}, {"movie_id": 49026, "review_id": "63133b9f564ec700915d096b", "author_rating": 7.0, "review_text": "Tom Hardy is superb in this denouement to Christopher Nolan's \"Batman\" trilogy. His depiction of the clever and malevolent \"Bane\" is intricate and terrifying in equal measure. Christian Bale also has the role very much under control now as he joins forces with his old pal \"Gordon\" (Gary Oldman) and jewel thief turned \"Catwoman\" (Anne Hathaway) to rise to his biggest challenge yet... What's great about this film is that is ties up all of the loose ends from the first two; it dots some i's and crosses the t's as the story neatly, and frequently quite subtly, introduces new threads to an old suit of clothes. This is an hugely characterful outing for all concerned - especially Sir Michael Caine as the wonderfully underplayed \"Alfred\" and Morgan Freeman as the arch-inventor \"Fox\". The plot takes it's time to develop, there is plenty of to-ing and fro-ing as they battle for the upper hand; new allies must learn to trust and to rely on each other. I found myself drawn to the \"Bane\" cause more than I ought to admit - a sign of a great baddie; you empathise with the evil (I think of \"Darth Vader\") especially once the story unveils traits in his character and elements of his history that, to a certain extent, justify his behaviour. The dialogue is sparing and potent and photography is really effective: the light and shade are used creatively with the Hans Zimmer score an huge improvement on his last outing. This is certainly one for a big screen - there is loads to see each time you watch, and though \"Batman\" was never my favourite super-hero, this has to be up there as one of the darkest and best super-hero films.", "created_at": "2022-09-03T11:33:51.974Z"}, {"movie_id": 49026, "review_id": "64484e450e4fc80509fe89bb", "author_rating": 8.0, "review_text": "I enjoyed watching the Dark Knight. They were at least able to keep the same batman from the the last one made too.", "created_at": "2023-04-25T22:03:49.460Z"}]