[{"movie_id": 2048, "review_id": "54249c880e0a26457600008a", "author_rating": 7.0, "review_text": "I, Robot (2004), holding it's own in the genre pantheon?\r\n\r\nI, Robot has a fan base that I'm glad to say has kept this film from drifting down into the depths of bad blockbuster sci-fi ratingville. I remember upon the film's release how so many people were wary of if Will Smith could carry the film? The concerns from Isaac Asimov's fans about a sacrilegious take on his legacy etc etc. Truth is is that I, Robot is an amalgamation of sci-fi ideas, from the suggestion of Asimov to the novel of the same name from Eando Binder, it's a mix that ultimately gives us a cop versus sci-fi conspiracy picture, that is sure as hell entertaining if taken on popcorn terms.\r\n\r\nHaving just watched this again for the first time in a year or so, I found that it still hits the mark to me as a real tidy genre piece with a solid heart beat to keep it thought provoking. A futuristic mystery is smartly realised by Alex Proyas' directing in the manner befitting the subject, and of course Will Smith handles the entertaining action lead role with much ease. However, the main triumph (outside of the story) is Alan Tudyk as our computer generated protagonist Sonny, the voice and humanist movements are brilliantly brought to life by him and it's a real pleasure to observe.\r\n\r\nGreat visuals (Oscar nominated), top story, kinetic action, better than average acting (though Bridget Moynahan struggles to convince as a boffin at times), and we get a perfect nights entertainment for someone looking for a rental that safely delivers what it says on the robotic shaped tin. 7.5/10", "created_at": "2014-09-25T22:51:52.981Z"}, {"movie_id": 2048, "review_id": "645bf529fe077a5cafbe0f27", "author_rating": 8.0, "review_text": "Will Smith does paranoid and grumpy, and he does it very well. But then he does pretty much every role he plays very well. A vision of the future we're all expecting to happen, and the only nice people are robots.", "created_at": "2023-05-10T19:48:57.846Z"}, {"movie_id": 2048, "review_id": "64f563015f2b8d011b4ecd57", "author_rating": 7.0, "review_text": "Will Smith is a cop who detests artificial intelligence with a vengeance; despite the fact that he has a substantial part of his body made up of enhanced prosthetics after a car accident. When an executive from the world's largest robot production company commits suicide, he has to investigate and soon discovers a plot to take subjugate humanity. \"I Robot\" is a clever exposé on how AI could take over the world; largely by capitalising on the indifference of people, our obsession with convenience and reliance on technology. Smith and Bridget Moynahan - and Alan Tudyk as \"Sonny\" a rogue robot designed to reveal the plot - turn in good fun performances as we try to stop the robot revolution. It's quite a well written, stylishly presented and pacily directed couple of hours.", "created_at": "2023-09-04T04:54:25.405Z"}]