[{"movie_id": 163, "review_id": "550ca9b0c3a368487d0045d7", "author_rating": 4.0, "review_text": "Convoluted Cack!\r\n\r\nOcean's 11 was a slick movie, ultra cool and up there with the best as regards superior remakes. Ocean's Twelve is a waste, a film coasting on star appeal, a picture desperately trying to cram as much into its screenplay for fear of failing.\r\n\r\nThe plot shoots off in a number of directions, yet incredibly it still wastes most of the cast who have all been held over from Ocean's 11. This time Catherine Zeta-Jones joins in for some weighty dressage and Vincent Cassel is along as some sort of break-dancing Raffles dude. There's the odd in-joke that works, while the by-ply between the principal players (Clooney/Pitt/Damon) holds a modicum of entertainment value. However, once the dust settles on the myriad of schemes and scrapes, you are left with a sequel of a remake that is almost everything the other film was not. Boo. 4/10", "created_at": "2015-03-20T23:13:52.789Z"}, {"movie_id": 163, "review_id": "5f4b13a453f8330034bd6e41", "author_rating": 6.0, "review_text": "Good watch, could watch again, and can recommend, at least for fans of heist movies.\r\n\r\nThis is a refreshing twist on heist movies, actually a combination of twists: payback revenge and criminal vs criminal.  This qualifies alternative motive to the crimes and because of the high stakes of competing thieves, we certainly get a complex heist.\r\n\r\nThe problem with this movie is that Benedict's move against them is the most interesting part, but is relegated to the beginning of the movie.  Most of the thief vs thief action is obscured to hide information from the audience, causing the movie to explain and even re-explain things that have, are, or will happen in the movie which, honestly, just pads the run time without making the movie more entertaining.\r\n\r\nWithout a doubt, the movie is still good, but not nearly as good as the first in the series.", "created_at": "2020-08-30T02:49:08.198Z"}, {"movie_id": 163, "review_id": "63be060af85958007d373931", "author_rating": 1.0, "review_text": "No it's not good. I guess a lot of people like it, a lot of people hate it... and I fall into the hate it camp.\r\n\r\nThe problem is the plot, as so many others have no doubt pointed out. It makes sense on the surface level... and is so absolutely surface that when they try to add a twist or two it come across as an insult to the viewers.\r\n\r\nIt is one of those films where the entire responsibility is left on the writers, the plot just doesn't work for an Ocean's movie. The twists don't work. They tried to re-capture the magic of the first one, and, although the 3rd was able to do it well enough, 12 fell flat.\r\n\r\nSo, watch it to be a completionist and then forget it was ever made.", "created_at": "2023-01-11T00:42:50.604Z"}, {"movie_id": 163, "review_id": "64f569f1f29d66011d357b50", "author_rating": 6.0, "review_text": "Yikes, but this is not a patch on \"Ocean's 11\" (2001). Though many of the same cast have re-assembled, the story is lacking in just about everything that made the first one good. Somehow, \"Benedict\" (Andy Garcia), whom they royally fleeced last time, has tracked them all down and wants his cash back, or else! The gang realise that are about $100m short, so devise a cunning new robbery to make up the shortfall. Thing is, after their usual meticulous planing and execution, they discover that someone has beaten them to it. Same next time, and the next - who is this genius? Well, it turns out to be a rather confident French fellow \"Toulour\" (Vincent Cassel) who basically offers them duel. The theft of a Fabergé egg from Paris. He wins, they the are toast; they win and he will pay off \"Benedict\". All of this thievery has not gone unnoticed by Europol, however, and soon they have their own agent \"Lahiri\" (Catherine Zeta-Jones) on the case too. Problems here for me are - the story, though quite quirky, is poorly executed and there are just far too many people involved in the plot and sub-plots that after a while just become a bit dull. There's quite a fun scene with Julia Roberts as herself with Bruce Willis, but otherwise this is just an overlong sequel that really just smacked of people making more money at the expense of the style, characterisation and charm of the first in the series. As you'd expect, the production standards are great - the film looks really good, but the rest of it is just a bit underwhelming.", "created_at": "2023-09-04T05:24:01.061Z"}]