[{"movie_id": 551271, "review_id": "636eff24ca4f67009b546ff1", "author_rating": 5.0, "review_text": "Medieval? Mediocre.\r\n\r\nThere is a grand tale to be told about the historic Jan Žižka, his times and all that goes with it - the social, religious, political atmosphere, the power-play, the backstabbing, the wars.\r\n\r\nAnd parts of this tale have been told well.\r\n\r\nBut not in this movie. It has good actors, wonderful locations, competent crew, and the biggest budget a Czech movie ever had so far - but it fails. The overall dramaturgy, the pacing, the direction and even the cut fail. This movie has many troubles, and the script is at the core of them.\r\n\r\nThe start is promising - it introduces us into the situation, where no-one is \"good\"; Zizka and his mercenaries are for hire, and who is your enemy today can be your comrade tomorrow. The powerful keep changing sides, nothing is certain, except for the low-born will be suffering either way.\r\n\r\nBut where to go from here? There could have been a wild romp through many of the stations of Zizka's life. Or it could have been a character study, how Zizka came to be the Czech national hero he is. But the movie fails to do that, too - it also burdens us with an unnecessary (and most likely a-historical) love story, and draws out things for long, long, long.\r\nThe battles appear fierce, close up, bloody; if you don't look close, it gives the rough impression of good fighting scenes.\r\n\r\nToo many cliches, too many wide-eyed pained looks from the good lady, and TOO MUCH TIME WASTED.\r\n\r\nThis bit could've been told in a quarter of the time, without skipping anything - and we'd get to see much more of the Czech history (plus more battles, intrigues, and if unavoidable, also love stories).\r\n\r\n**TL;DR: A waste of talent, money, and time.** No need to waste yours, unless you have an lazy time to while away.\r\n\r\n\r\nPS: The few token PoC they have to squeeze in these days have been cast as Cumars, plus some vaguely asian-mongolian looking extras. The actual Cumars were from Turkey, but fair-skinned and -haired, and known (as well named) for this aspect of their appearance. But mooks are mooks, right?", "created_at": "2022-11-12T02:04:20.646Z"}]