[{"movie_id": 2140, "review_id": "60a6b2388dbc330028295a86", "author_rating": 6.0, "review_text": "_**Jet Li flick in Paris with Bridget Fonda**_\r\n\r\nAn expert Chinese intelligence agent (Jet Li) is sent to Paris to help the head inspector (Tchéky Karyo) in apprehending a Chinese mob boss at a ritzy hotel, unaware that it’s a set-up. Bridget Fonda plays an American prostitute that “Johnny” (Li) develops a relationship with during the misadventure.\r\n\r\n\"Kiss of the Dragon\" (2001) is a big city crime thriller with the expected overdone martial arts action due to Li. It’s a modern mixing of “From Russia with Love” (1963) with the preposterous action of “The Gauntlet” (1977) and the martial arts of “Enter the Dragon” (1973).  It was Bridget’s second to last theatrical movie before calling it a day (although she also did some TV work in 2001-2002, like her final piece “Snow Queen”).\r\n\r\nI like the fact that the protagonist, Liu Jian (Li), is confident and an expert fighter, but also very human, even meek, as a stranger in a strange land (being his first visit to Paris). The action is thrilling with a sense of style counterbalanced by some quality drama with Fonda’s character and her situation.\r\n \r\nIf I were to nitpick, some eye-rolling elements bring down the film’s quality. For instance, Liu Jian storms a police building, opens a door and suddenly enters a dojo full of martial arts guys ready to take him down. Why Sure!  Earlier, a British pilot grabs not one, but two Uzis to kill Liu Jian in the swank lobby, shooting up the entire place. Did he really need to cause mass devastation to kill one Chinese man? I'm sure the corrupt Inspector (Tchéky Karyo) wouldn't enjoy explaining the wholesale desolation to the mayor.   \r\n\r\nMoreover, there are too many hip-hop songs on the soundtrack. I could see one or two (at the most), but they overdid it. It smacked of trying to be too ‘hip.’\r\n\r\nThe film runs 1 hour, 38 minutes and was shot entirely in Paris & nearby Seine-Saint-Denis, France.\r\n\r\nGRADE: B-", "created_at": "2021-05-20T19:02:16.391Z"}]