[{"movie_id": 296099, "review_id": "5835e06f9251416c630199aa", "author_rating": 7.0, "review_text": "**When the family vacation turns into a nightmare!**\r\n\r\nHaving not seen any previous films in this series, I had nothing to compare with it and to blame for. Though I have seen many similar films, but it was not as bad as they say. In this kind of theme, the basic storyline always remains same, the remaining parts like the characters, locations and the diversions in the story developments are the key. I think they did that decently, the two new directors who also penned the screenplay.\r\n\r\nWell, this is the story of the Griswold family of a couple and their two teen sons. After realising his family is spiritless with the normal life, the husband surprises his wife and the children to go a vacation. The trip is supposed to have fun, but they find hard to come along in a single mood as a family. Meanwhile, their journey begins to face many hurdles, though they are not giving up. So how memorable their adventure becomes is what unfolds in the remaining section.\r\n\r\nThe cast was good. Both, Ed Helms and Chritina Applegate was impressive, though the film is not laudable. Not all the jokes, but some of them were really cool and most of them were adult stuffs. Yep, this is an R rating film, not a family film, despite the impression you get from its posters. So for the grown ups, this is not a bad film to give a try. I can't suggest or reject on the merit of its previous installments, because I've already given the reason. People like me can definitely have a good time with it.\r\n\r\n_6.5/10_", "created_at": "2016-11-23T18:31:11.045Z"}, {"movie_id": 296099, "review_id": "5a529b49c3a36875340252b6", "author_rating": 9.0, "review_text": "As one theres has seeing the originals, I have feared it was a complete rip-off, but yes there is many smilarities, but they have actual succefull made a movie with so much fun and new spins.", "created_at": "2018-01-07T22:12:25.150Z"}]