[{"movie_id": 34769, "review_id": "58a9ba4f92514173ee009844", "author_rating": 7.0, "review_text": "Sometimes a film can turn out to be nothing like you expected, and it can be a real challenge not to be completely disappointed, but rather try and keep an open mind about what you're watching instead of dismissing it just because it's not what you thought it would be. Because every now and then, you just need to let something surprise you. Defendor is just such a film.\r\n\r\nAt first glance, everything about this film just screams 'hilarious comedy' (trailers can be so misleading...). Perhaps it was the production company's intention to promote it as such, but it is nothing of the sort. But then again, if they were afraid a dramatic film about a sympathetic loser who thinks he's a superhero wasn't going to fly with the audience, they shouldn't have made it in the first place. But they did and here it is, and it's no surprise it wasn't a big box office success. That's bad promotion for you.\r\n\r\nNevertheless, Defendor certainly has its charm, mostly, if not completely, thanks to Woody Harrelson. I've personally never seen him fail, and there's something about the way he plays this character that just makes him instantly lovable. He plays a really sweet, 'intellectually challenged' man named Arthur Poppington who prefers to be addressed as his vigilante alter-ego Defendor (with an O!), blindly convinced of his duty to defend the needy. The fact that he has no real skills, hardly any physical strength and relies on marbles, angry wasps and lemon juice as his weapons of choice, never deter him in any way. In fact, they're exactly the ingredients that make up his identity. \"Guns are for cowards!\" is his credo.\r\n\r\nBut it's only fun and games until he assaults the owner of a dry cleaner's and is placed under court-ordered psychiatric supervision. Here his story slowly unravels and it becomes apparent that there's much more to this silly, troubled superhero wannabe than meets the eye. In conversations with his psychiatrist we learn of his friendship with a young hooker named Kat and his obsession with catching his arch enemy, Captain Industry, whom he holds responsible for a traumatising experience in his childhood.\r\n\r\nLet me start with the films plus points. First of all, the cast is great. Like I said, Woody Harrelson never fails and his portrayal of Defendor is charming, sympathetic and just plain sweet. He is a simple man, but his intentions are genuinely heartfelt and righteous. When he's not fighting crime (with marbles...) he tries to help this girl Kat to kick her habit of drug use. And of course, he ends up needing her just as much as she needs him. This character is played by Kat Dennings, who is not yet very well known, but I have a feeling she definitely will be. I think she has more personality and talent than most \"glamorous\" young actresses that you see in every magazine these days, and she's very pretty, so that should work in her favour. Her character in this film is a tough, streetwise young woman, who has seen more and done more than any girl her age should, and she plays her role with style. Actually, the film mostly revolves around the chemistry between these two characters, and that chemistry is great.\r\n\r\nElias Koteas plays an undercover cop, Dooney, who keeps getting in Defendor's way. Although he is a good actor, his role here isn't very memorable. The same goes for Sandra Oh, who plays Arthur's psychiatrist. Not bad, but not irreplaceable. Basically, these characters could have been played by anybody. But that has more to do with the fact that these characters simply weren't written interestingly enough.\r\n\r\nAlthough Defendor is said to be a comedy, the funny moments are few and far in between, and although these moments are pretty hilarious here and there, there really aren't enough of them for this film to qualify as a full-fledged comedy. And that's not a bad thing, but if you're going to watch it, you should understand that this film is more of a drama film than a comedy, it's simply too dark and heavy for that. Thematically, Defendor focuses more on the main characters' issues than on the silly things they do. Though it must be said that Defendor's actions against his enemies make for some of the film's best moments, although said actions are actually more endearing than they are effective.\r\n\r\nSomething about this film that could have definitely used some improvement is the pacing. It takes too long for the story to really take off, and when it does it continues to just kind of meander along, without properly working towards a decent climax. Also, the ending isn't really satisfying. Actually, it is quite weak. This falls in line with the overall fluctuating quality of the story, which never really engages you much at any point, and then at the end just leaves you feeling kind of puzzled and somewhat disappointed.\r\n\r\nIn conclusion, Defendor is a charming little film, not strong enough to garner its own cult-following like some films in this genre have, but definitely nice enough to watch at least once.\r\n_(February 2012)_", "created_at": "2017-02-19T15:31:27.811Z"}]