[{"movie_id": 369972, "review_id": "5bca354c925141561a01915c", "author_rating": 10.0, "review_text": "Damien Chazelle has already proven himself to be one of the freshest new directors of the decade so far. Even after delivering the hard-hitting Whiplash and the emotionally-wrecking and whimsical La La Land, he still knows how to surprise fans of his work, returning to the silver screen with grace. Combining every element of his previous outings that made him a household name, Chazelle makes sure the audience feels every ounce of power that he's thrown into his latest directorial effort. Oddly enough, it's his first foray into biopic territory, a zone where many revered filmmakers have failed to capture the reality of the moment they're attempting to bring to life.\r\n\r\nGoing in, you'll already know how the movie ends, which is the problem most directors encounter when making a biopic. Finding a way to transfer the actuality of the moment while still feeling original and never appearing boring is a hard task that very few have been able to truly accomplish. With First Man, Chazelle manages to land a spot on that list of directors, and for good reason. He keeps true to the true story with a film that's so intense and fully realized that you might forget that it actually happened.\r\n\r\nSpace movies have always been a highlight of cinema. From Georges Méliès' 1902 silent film A Trip to the Moon and Stanley Kubrick's 2001: A Space Odyssey to the Star Wars and Alien franchises, films taking place in the farthest reaches of the universe prove to be some of the most intriguing and original creations brought to viewers' eyes (even by today's standards). It's the true stories that really prove to be some of the most effective, however. Sure, fictional ones show us what could be possible; but it's the depictions of true events that show us what was possible, creating a harrowing story of patriotism in the process.\r\n\r\nFrom a technical perspective, First Man is a marvel on all fronts. Linus Sandgren, the cinematographer who won an Academy Award for his work on La La Land, returns to collaborate with Chazelle and once again delivers a grand spectacle that should not be missed out on while in theaters. The cinematography is stunning. Hues of yellow and blue pop, lighting a path towards the characters and showing no sign of stopping once they've started. Certain scenes are given an extra boost from the home-video-style camerawork, beautifully grainy and shaky in all of the right ways.\r\n\r\nJustin Hurwitz (Chazelle's roommate in college), another frequent collaborator, also returns to score the film and knocks it out of the park as expected. Hurwitz obviously knows how to write music, but its how his compositions fit in with the scenes and themes they're tied to that make them so worthwhile. Hurwitz invests you in the midst of all the chaos with all of the orchestral beauty surrounding his pieces. That's the thing about his scores, though: it's hard to objectively rank them because of how different they all are. Chazelle is a unique director because he never sticks to the same formula over an over again, and the same can be said for the accompanying music for each of them.\r\n\r\nActing is on point here; Ryan Gosling hits a huge emotional nerve with incredibly investing performance as Neil Armstrong. He keeps to himself (namely, his personal life) but is willing to risk it all for the mission. Nothing from Gosling is single-layered; everything is complex and detailed to the point that you might as well be in the room with him.\r\n\r\nClaire Foy also delivers an amazing portrayal as Janet Armstrong, Neil's wife. Foy topples every housewife stereotype that embodied this specific time period, giving a strong, contained, and free-willed performance of a woman who is certainly not afraid to share her thoughts on issues concerning her husband.\r\n\r\nThe flag controversy is totally stupid. The moon landing scene doesn't need the image of Armstrong planting the flag on the moon to dish up a heavily emotional response from the audience. If you get a chance to screen it in IMAX, definitely do. The expanded aspect ratio only comes into play during this specific scene but it is utterly transfixing.\r\n\r\nFirst Man is one of the best films of the year, no doubt about it. Every shot is perfection. Every sound is excellence. There is no comparison to what Damien Chazelle and co. have accomplished here; even iconic films like Apollo 13 can't live up to the new bar of quality Chazelle has set for the space drama subgenre. A harrowing journey from start-to-finish, and a true masterwork in many respects, First Man is one film that delivers upon its promise and then some. Performances and technicalities are perfect, but that's what Chazelle will continue to be known for: perfection.", "created_at": "2018-10-19T19:49:32.275Z"}, {"movie_id": 369972, "review_id": "5bfacdf492514104d802c459", "author_rating": 9.0, "review_text": "A really encouraging film for a historic event. The music and silence are playing so well with each other. I am glad that the directors and actors did not waste a wonderful story. Though I always think the leading actor's appearance is significantly different from origin Neil, it does not affect the intense feelings.", "created_at": "2018-11-25T16:29:40.234Z"}, {"movie_id": 369972, "review_id": "5c6b7d8e0e0a261e069c8a40", "author_rating": 5.0, "review_text": "Every time that someone's on a spacecraft, I was into _First Man_. It might genuinely be the first time I didn't hate scenes shot with continual use of shaky cam, which is noteworthy. But by and large _First Man_ was not for me, biopics often aren't, and _First Man_ is absolutely a biopic. It's not about NASA, or the Space Race, or landing on the moon, on astronauts, those things are present, but it's about Armstrong. I know that, because he is the only person, place or thing we get any real insight into.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-02-19T03:52:46.341Z"}, {"movie_id": 369972, "review_id": "5cfad9c10e0a2606a2c9ee40", "author_rating": 6.0, "review_text": "**_Aesthetically laudable, emotionally vapid_**\r\n\r\n> _I am comfortable with my level of public discourse._\r\n\r\n- Neil Armstrong declining to be interviewed for \"Armstrong's Code\" (Kathy Sawyer); _The Washington Post_ (July 11, 1999)\r\n\r\nMore an intimate character drama than a grandiose examination of man's place in the cosmos, _First Man_ is far more concerned with domesticity than the actual journey to the moon, attempting to demonstrate that behind the great moments of history exist personal demons and private motivations. Nothing wrong with that of course – contextualising small character beats against a larger historical canvas can produce excellent cinema. Terrence Malick's _The Thin Red Line_ (1998), for example, uses the Battle of Guadalcanal as the background against which to engage all manner of personalised existential Heideggerian philosophical conundrums, whilst Michael Mann's _Ali_ (2001) is more interested in Ali's private struggles outside the ring than his public bouts within it. However, for this kind of storytelling to work, one thing is essential – emotional connection. The audience must, in some way, care about the people on screen, otherwise their introspective problems are more than likely to feel like they are just getting in the way of the larger story. And that is exactly what happens in _First Man_ – there is a lifelessness at the film's core, an emotional vapidity that can't be filled by exceptional technical achievements and laudable craft. The film attempts to celebrate Project Gemini and the Apollo Program, whilst also working as a character study of a man known for his emotional taciturnity. And whilst it achieves the former, the film's Neil Armstrong (Ryan Gosling) is so stoic and closed-off as to be virtually disconnected from the rest of humanity.\r\n\r\nBased on James R. Hansen's 2005 biography, _First Man: The Life of Neil A. Armstrong_, the film begins in 1961, with the sixth of Armstrong's seven North American X-15 research flights (which actually took place in April 1962). Ascending to 207,000 ft., when Armstrong attempts to turn the aircraft back towards the landing strip at Edwards Air Force Base, a control malfunction causes him to hold the nose up for too long, and he accidentally bounces off the atmosphere, forcing him to take drastic action to land. From there, the film hits all the beats you would expect in the lead up to the Apollo 11 mission in 1969; the death of his daughter, Karen (Lucy Stafford) from a brain tumour; his acceptance into Project Gemini; his friendships with Elliot See (Patrick Fugit) and Ed White (Jason Clarke); NASA's shock at the Soviet's successes in the Space Race, particularly Alexy Leonov's EVA; Armstrong's selection as commander of Gemini 8; See's death in a Northrop T-38 Talon crash; Gemini 8's calamitous docking with the Agena Target Vehicle; the death of White, Gus Grissom (Shea Whigham), and Roger B. Chaffee (Corey Michael Smith) during a plugs-out test of Apollo 1; Armstrong's near death whilst testing the Lunar Landing Research Vehicle; his selection as commander of Apollo 11; his marriage problems with his first wife, Janet (Claire Foy); the lunar landing alongside Buzz Aldrin (Corey Stoll); Armstrong's private sojourn to the Lunar East crater; and finally, the return to Earth.\r\n\r\nWithin this framework, the film remains tied almost exclusively to Armstrong's perspective, with the occasional shift to Janet. This sets up something of a problem, as the real-life Armstrong was very much a reluctant celebrity/national hero, and despite his extraordinary accomplishments, he was not the most interesting, relatable, or easy-to-empathise-with-individual. Never one for the spotlight, when Hansen's biography was published, Armstrong was living unassumingly in a quiet Cincinnati suburb, whilst in a famous 2001 comment, when asked in an interview for the Johnson Space Center Oral History Project if he had ever gazed at the moon prior to the Apollo 11 mission, he replied, \"_No, I never did that_.\"\r\n\r\nWith this in mind, the film sets itself the task of attempting to penetrate this most private of men, explaining why he was so singularly driven, even to the detriment of his family, to the point where not only did he plan not to tell his children he may not return from the Apollo 11 mission, he intended to leave without saying goodbye at all, until Janet changed his mind. And herein lies perhaps the film's most egregious failing. It's almost as if director Damien Chazelle (_Whiplash_; _La La Land_) and screenwriter Josh Singer (_Spotlight_; _The Post_) think the Apollo 11 mission isn't interesting enough by itself – there needs to be some kind of deeper \"why\" behind the whole enterprise. Armstrong can't simply be a driven individual, his heroism isn't enough, there must be some kind of psychological motivating factor.\r\n\r\nIn any case, the attempts to tease out the inner workings of Armstrong's mind don't really work, as he remains very much in his own world, impenetrable to both the other characters in the film, and the audience – no matter what Gosling, Chazelle, and Singer do to dress him up, Armstrong comes across as aloof and interiorised. Partly at fault here is Gosling's performance, with its fulcrum of emotionless stoic masculinity. This is a performance we've seen him give several times before – Henry Bean's _The Believer_ (2001), Nicholas Winding Refn's _Drive_ (2011), and, especially, Denis Villeneuve's _Blade Runner 2049_ (2017) all spring to mind - and this familiarity doesn't help matters. Instead of giving the character hidden depth, the few discernible traits he possesses make him something of a cardboard cut-out, a 21st-century screenwriter's idea of what an American man who grew up in the 40s and 50s should be (complete with retconned political correctness).\r\n\r\nAnother issue is that the filmmakers choose to locate Armstrong's primary motivation in Karen's death, which is presented with a mawkish sentimentality that, at best, fails to convince, and, at worst, actively distracts. With the lunar mission presented as much about advancing mankind as it is dealing with personal trauma, Chazelle goes to great lengths to link Karen's death with Armstrong's determination – as she is dying, he holds her and looks wistfully into the sky (indeed, whilst the real-life Armstrong attests to never gazing profoundly at the moon, the film's Armstrong never stops looking at the thing); after her funeral, he slips her bracelet into a drawer; later, he has an hallucinatory vision of her playing with other children; and on the moon's surface, he drops the bracelet into the Lunar East crater and cries a few tears for her. At one point, Janet reveals that Armstrong never mentioned Karen after the funeral, and that's a believable, and deeply emotional, detail. The problem lies in the overkill surrounding it, detracting from whatever genuine emotion such details should evoke. Every time we see Gosling stare yearningly into the sky, the potency of the film is diluted just a little bit more.\r\n\r\nA big question in all of this, of course, is whether Armstrong really dropped the bracelet into the crater, had a vision of his daughter, and shed a few manly tears, or is this Hollywood romanticising history? The answer is, we don't know. During his interviews with Armstrong and Janet for the biography, Hansen formulated the theory that maybe Neil left something for Karen on the surface. However, when Hansen asked Armstrong if he could see the manifest for the mission, Armstrong told him he had lost it, something which would have been highly out of character for such a fastidious record-keeper. In fact, he hadn't lost it, he had donated it to the Purdue University Archives, but it is under seal until 2020. However, when Hansen asked Armstrong's sister June if it was possible he had left something of Karen's, she said that it was. So, the fact is we don't know what Armstrong did when he wandered over to the crater (his sojourn there was literally the only part of the landing that wasn't by-the-book). However, for me, the whole thing comes across as far too syrupy, an amateur psychological profiling of a man who was intensely private. Personally, I would have much preferred the Lunar East trip to remain a mystery – by showing us what they think might have happened, Hansen, Singer, and Chazelle cheapen the intensely personal nature of the moment, which Armstrong obviously chose to keep secret for a reason.\r\n\r\nA good example of the film's attempts to shoehorn everything into a writer's conception of the story concerns Armstrong's training on the MASTIF (Multiple Axis Space Test Inertia Facility). The film shows him passing out, before coming to, and asking to go again. This pays off later when the Gemini 8-Agena docking goes wrong, and Armstrong experiences the same forces as he did in the MASTIF. However, because of his experience, he remains conscious, and is able to retrieve the situation. Except Armstrong never trained on the MASTIF. The device was abandoned after Project Mercury as NASA felt it was unrealistic, and didn't prepare the pilots for anything they would ever experience in reality. It's one of the ironies of NASA history that the man who experienced what the MASTIF simulated never trained on the machine itself. The problem here is that the real story (Armstrong's sheer force of will helps him overcome the odds) is infinitely better than the invented one (Armstrong's training helped him overcome the odds), which is indicative of a larger problem – the film always seems like someone's idea of what happened.\r\n\r\nAesthetically, Chazelle wastes absolutely no time in letting us know that this is Armstrong's film, with the excellent opening sequence taking place primarily from his POV. However, the scene also introduces the first example of Chazelle's pungent romanticism. As the shaking of Armstrong's X-15 momentarily stops, and the noise dies away, a majestic sense of calm descends. However, rather than trust the audience to extract their own interpretation of the moment, Chazelle can't resist a BCU of Gosling's eyes, with the curvature of the earth reflecting on his visor. On the other hand, a well-handled aspect of this technique is that because the film adheres so rigidly to Armstrong's perspective, very little of what he himself can't see is shown. So, for example, instead of depicting the vast infinite expanses of space, Chazelle keeps the audience tucked tightly inside the _Eagle_ landing module (at least up to the point of the descent to Tranquility Base).\r\n\r\nIndeed, make no mistake, the lunar landing itself is beyond spectacular, with the incredible score by Justin Hurwitz and the superb cinematography of Linus Sandgren (_American Hustle_; _Joy_) coming into their own. The sequence was shot in 70mm IMAX, and it makes extraordinary use of the larger frame, with the first panorama of the lunar surface as awe-inspiring as anything in Stanley Kubrick's _2001: A Space Odyssey_ (1968) or Terrence Malick's _The Tree of Life_ (2011). An especially well-directed part of the lunar descent is that rather than lay down a busy foley track, Chazelle pulls out the sound out altogether, creating an eerie, otherworldly moment that literally gave me goosebumps.\r\n\r\nThematically, as with all three of Chazelle's previous films, the clash between the domestic and the professional is front-and-centre. _Guy and Madeline on a Park Bench_ (2009), _Whiplash_ (2014), and _La La Land_ (2016) all focus on artists who sacrifice emotional relationships so as to reach an artistic peak – they are all stories of men whose passionate devotion to their work and pursuit of perfection alienates the women in their lives. In this sense, _First Man_ very much fits Chazelle's _oeuvre_, he seems as obsessed with how men attempt to balance work and home-life as is Michael Mann. Armstrong is not an artist, of course, but he is a perfectionist, and the pursuit of his craft does make the woman who loves him unhappy. To this end, Chazelle utilises various methods, such as having NASA radio chatter play over scenes of Jan at home alone. The film's ending is also extremely low-key and private, stripping away the finery of the Apollo mission, and leaving us instead with two people attempting to re-connect.\r\n\r\nHowever, despite the magisterial last 30 minutes, and some sporadically well-handled moments, _First Man_ is underwhelming, and, for long portions, interminably dull. As good as that final sequence is, it's no compensation for the plodding and lifeless two hours that precede it. And overall, the film isn't a patch on Philip Kaufman's _The Right Stuff_.", "created_at": "2019-06-07T21:40:17.993Z"}, {"movie_id": 369972, "review_id": "61e328b86aa8e00069eeb3dc", "author_rating": 9.0, "review_text": "Showing us the physical and emotional challenges Armstrong had to endure, the first half is already impressive, but the exciting landing scene and stunning moon scenes near the ending make ‘First Man’ a true and rare experience.\r\n\r\n9/10", "created_at": "2022-01-15T20:04:08.066Z"}]