[{"movie_id": 257423, "review_id": "53bb195e0e0a26197c0002d5", "author_rating": 6.0, "review_text": "Thegidi is the latest in the list of new-age Tamil films that are popping up at regular intervals since Karthik Subbaraj's trendsetting Pizza. It has all the elements that characterize these films —relatively new but familiar actors, impressive cinematography, likable music, competent direction, recognizable locations, and a little of envelope pushing (though nothing radical). There is even a Pizza-like post-climatic twist here that leaves the film an open-ended mystery.\r\n\r\nSo, it comes as no surprise that the film works. The plot has the feel of a 80s Rajesh Kumar/Subha/Pattukottai Prabhakar potboiler, in which an intrepid detective finds himself in an intriguing situation and solves a mystery with his daring and (a little bit of) cleverness. Here, Vettri, a young criminology graduate, lands a job in a private detective agency (Radical Detective Service), and is given a few subjects to track, observe and report. Like any beginner, Vettri is enthusiastic and passionate about his work and does a flawless job, impressing his employers Sadagopan and Sailesh. But when he given the task of observing Madhusree, Vettri breaks the rules of his work, and falls in love with her. She too reciprocates and everything seems to be going smooth until one day, Vettri discovers that two of the subjects have died under mysterious circumstances. He senses that something is amiss and tries to warn a couple of them but they too are murdered in front of his eyes. Now, he becomes convinced of a sinister plot and tries to save Madhu, who doesn't know the actual nature of his work.\r\n\r\nWhat's refreshing about Thegidi is how director Ramesh manages to keep things understated even when the situations seem to turn overwhelming. Barring a couple of scenes, there is a matter-of-factness in the approach that keeps the movie from turning into a bombastic thriller in which everything is at stake. This is the film's plus and also its weakness. While this low-key approach helps to keep the events realistic and believable, it also takes away the nail-biting quality (even the fight that you get is more of a scuffle than a choreographed action scene) that we expect from films in this genre. But the earnestness in the actors' performances helps sidestep this flaw to an extent.\r\n\r\nOf course, there are some developments which are baffling. Despite realizing that Madhu's life is in danger, Vettri doesn't immediately try to inform her of the threat. Even when she walks out on him after coming to know of his true identity, he doesn't explain the situation to her. And, we can't help but question his bravado when he goes snooping inside an antagonist's house, after having taken the issue to the police. He even puts his life in danger at this point, which only makes the character seem like a rash person. And, given that he has only a handful of characters, it becomes easy for us to guess the master brain behind the antagonists' scheme, while the final twist is just rug-pulling for the sake of a twist.", "created_at": "2014-07-07T22:04:14.590Z"}]