[{"movie_id": 507086, "review_id": "62a6fceb7f6c8d77b97d440e", "author_rating": 6.0, "review_text": "\"Owen\" (Chris Pratt) and \"Claire\" (Bryce Dallas Howard) are living in the remote wilderness with \"Maisie\" (Isabella Sermon), whom they are desperate to protect. From what? Well it turns out she is a bit of a miraculous conception from the \"Lockwood\" dynasty that co-founded the original park with \"Hammond\" and is very much on the radar of corporate megalomanic \"Dodgson\" (Campbell Scott) whose company is devising super-engineered locusts to devour great swathes of crops across the United States that are not grown from their own brand of seed. This is where \"Sattler\" (Laura Dern) comes in. She is convinced of this dastardly plan, but must compare the DNA of one from his lab with one they secured in the wild so she can prove it. Her plan enlists the help of old pal \"Grant\" (Sam Neill) and with the help of their intellectual nemesis \"Malcolm\" (a suitably contrarian effort from Jeff Goldblum) they secure an invitation to the company's sanctuary in the Italian Dolomites. Meantime, the young girl is abducted from her wintry home, as is the baby of velociraptor \"Blue\" and so Pratt and Howard have to track them down, and that takes them on some quickly paced, but hardly original, set piece adventures where they meet pilot \"Kayla\" (DeWanda Wise). She chips in to help them in what now reminded me of aspects of the Brendan Fraser \"Mummy\" films, before they also end up in the Italian mountains. Can they team up and thwart the cunning plan? The problem with this, is that there are just way too many characters and too many weakly constructed threads to the story going on. It's all too diffuse and serendipity in the last hour or so just takes far too great a hand in the way the narrative combines and develops. The dinosaur effects are still amazing, but oddly enough I felt them less effective than in previous iterations - there just aren't enough scenes that feature them and when they do, they are just under-used. Pratt is always good value for me, but here he looks out of sorts and hardly features at all; Scott just doesn't cut it as the malevolent baddie (though could his character be the same guy who tried to buy the specimens in the first film?) and Sam Neill relies too much on his bemused facial expressions - indeed his best work on this is pretty much all included in the trailers. It looks great on big screen, includes a few bars now and again from John Williams masterful 1993 score, but for the main part this is a pretty mediocre conclusion to a great franchise with an ending that is rushed and entirely predictable.", "created_at": "2022-06-13T09:01:31.965Z"}, {"movie_id": 507086, "review_id": "62a8f4a1875d1a31ec5f9412", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/jurassic-world-dominion-spoiler-free-review\r\n\r\n\"Jurassic World Dominion is a massive disappointment on virtually every level. With an incredibly captivating premise, Colin Trevorrow ignores the fascinating years of mankind trying to deal with the chaos of dinosaurs repopulating Earth, opting instead to write a generic, formulaic, surprisingly tedious screenplay.\r\n\r\nIn addition to the lousy character treatment, the cast is divided into two storylines focused on nonsensical, bland rescue and espionage missions, placing dinosaurs on the back burner during the excessively long runtime.\r\n\r\nAction sequences reach drastically low entertainment levels, sometimes imperceptible due to erratic camera work and choppy editing.\r\n\r\nThe cast, visuals, and score might save this from being a complete trainwreck, but not from miserably failing to deliver an epic conclusion to a saga that deserved nothing less than that.\"\r\n\r\nRating: D", "created_at": "2022-06-14T20:50:41.062Z"}, {"movie_id": 507086, "review_id": "62ab3776134d5800998353d7", "author_rating": 4.0, "review_text": "With _Jurassic World Dominion_, a _Jurassic World_ film where dinosaurs are now free and interacting with the modern world shouldn’t feel this long-winded or this tiresome. There are a few action sequences that are worthwhile and Jeff Goldblum has a few great one-liners (“You made a promise to a dinosaur?”), but the film is a monumental disappointment overall.\r\n\r\nThe film has already made over $415 million at the worldwide box office, so the interest in the franchise is still there. But the chemistry between the cast is almost non-existent and it feels like the film is running on fumes as it tries to offer something new from what is otherwise dried up fossil fuel. If the _Jurassic Park/Jurassic World_ franchise is to continue, it desperately needs to go in a refreshing and unseen direction. Now that all of the nostalgia is out of the way, fans deserve a refreshing and unique adventure over what is otherwise a glorified rehash.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Jurassic-World-Dominion-2022-Review-You-Cant-Squeeze-Fun-From-a-Fossil", "created_at": "2022-06-16T14:00:22.575Z"}, {"movie_id": 507086, "review_id": "62cef4538a84d200502b989c", "author_rating": 7.0, "review_text": "<em>'Jurassic World Dominion'</em> is far from perfect, if just about entertaining to watch... kinda.\r\n\r\nI'm not fully convinced by it but I do think there's enough in there that's worth watching. There are too many characters, even main characters with the original trio and the newer duo both involved equally. With that said, I do like 'em. It's pleasant to see Sam Neill, Laura Dern and Jeff Goldblum, while Chris Pratt and Bryce Dallas Howard are a good pairing.\r\n\r\nStill, I wouldn't say any one character stands out here. They all make their presence known, though I'm struggling to remember any great moments individually - that's due to the aforementioned surplus. The rest of the cast, fwiw, are all fine - Mamoudou Athie sticks out most in that regard.\r\n\r\nThe run time is overlong, in my opinion. I personally could've done without 30 or so minutes and I wouldn't have felt it was missing anything. The story itself isn't all that fresh, as in I feel like I've seen this sorta thing before (I mean, Biosyn... how creative!), but the barrage of dinosaur-centric action probably just abouts tips it over into a positive rating for yours truly. Could easily be lower, though.\r\n\r\nI'd love for this to be the end of the Jurassic franchise (is there much more to tell?) but there ain't no way Amblin/Universal are leaving this IP to collect dust, let's be honest.", "created_at": "2022-07-13T16:35:31.330Z"}, {"movie_id": 507086, "review_id": "62efd1217d5504007e4b6dc7", "author_rating": 6.0, "review_text": "So after watching the first four movies in this franchise (three of which I had seen more than once, I finally watched this most recent effort. There are similarities and differences between Dominion and the earlier ones.\r\n\r\nIt held some of the usual elements: a child for us to care when they placed her in danger; the ability of the heroes (even the child) to outrun dinosaurs under a blind panic; walking dinosaur food, also known as bad guys; and references to the original theme park that started it all. They outdid themselves this time - keep an eye out for the Barbasol shaving cream canister.\r\n\r\nOf course, there are plenty of differences also. Parts of it weren’t even recognizable as part of the franchise. They juggle plot lines around the dinosaurs, the ethics of genetic engineering, a child clone kidnapping, industrial malfeasance, and what for me was the most interesting subplot and most closely tied to the original film: the struggle for humans and dinosaurs to co-exist under the new planetary paradigm. \r\n\r\nAnother difference is that there are two romances developing throughout the film.\r\n\r\nAn improvement is the return of characters we know well: Ellie Sattler and Alan Grant are back, and Ian Malcolm is present long enough to get in a few of his witticisms, unlike in the last movie.\r\n\r\nSo ultimately I found Dominion to be entertaining enough to stick with it, though the aspects that might have been intended to make me think just sort of got in the way.", "created_at": "2022-08-07T14:50:09.229Z"}, {"movie_id": 507086, "review_id": "63002a643e6f2b007d2719ad", "author_rating": 7.0, "review_text": "**Not as bad as reviews say, but go in with reasonable expectations.**\r\n\r\nAs the conclusion of the Jurassic World trilogy, it, unfortunately, had similarities to Rise of Skywalker. A lot of things were going on. Some fun moments. Great nostalgia with the legacy cast. Lots of dino action. But it also felt like they had so much going on that they ran out of time to highlight characters and make us care. I will always love Jurassic Park, so this movie got a little boost in rating because of nostalgia from me.", "created_at": "2022-08-20T00:27:16.145Z"}, {"movie_id": 507086, "review_id": "63071d8cb04228007f4abb8e", "author_rating": 2.0, "review_text": "Wow. Genetically modified locusts. I hope Universal got a discount on the screenwriters... On the plus side, some of the effects were okay. The hero shots of the two franchises (Jurassic Park and Jurassic World) looked good. Otherwise this was a slug to get through and felt like the old guard and new guard were phoning it in. I didn't like Lost Kingdom very much but at least it was entertainingly dumb. **1.25/5**", "created_at": "2022-08-25T06:58:20.490Z"}, {"movie_id": 507086, "review_id": "6355353c880c9200796de089", "author_rating": 4.0, "review_text": "Well, the dinosaur special effects are quite decent. Unfortunately that is more or less the only reason to watch this movie.\r\n\r\nI really do not understand how the Hollywood idiots can decide to spend loads of money on special effects but not bother to get a decent story/script writer? I mean come on, the story of this movie is just another thirteen on a dozen “big companies are bad” story with dinosaurs thrown in.\r\n\r\nThe story is convoluted to say the least and there is as much logic in it as you would expect from a Hollywood writer hack. Things more or less just happen and the “heroes” fight off one dinosaur attack after another on their way to the bad gay without ever tiring. And why the hell can Hollywood never produce a movie where the “heroes” doesn’t just stare like idiots at something until they are screwed?\r\n\r\nIdiotic nonsens like being able to train a dinosaur to home in on someone like a heat seeking missile and chase them forever after having pointed a laser marker on them for a couple of seconds is also the usual unintelligent Hollywood nonsense that just ruins a movie for anyone with anything like average intelligence.\r\n\r\nThey brough back some of the old characters but they do not really help. The mostly act like they cannot wait to get paid and get out of there. Jeff Goldblum is his usual climate cult procelyte. I did not really like him in the first movie and he is even worse in this one. The bad guy totally lacks charisma. The only character I really liked was DeWanda Wise as Kyle Watts.\r\n\r\nIt is really a shame to see another franchise destroyed by today’s Hollywood morons. I’ve been a dinosaur fan since I was a kid and when the first Jurassic Parc came out with real, life like dinosaurs it was just wow. But now, not even the special effects can save this movie. It is not a good movie, plain and simple.", "created_at": "2022-10-23T12:36:12.701Z"}, {"movie_id": 507086, "review_id": "63ad5ed7c56d2d0089b08416", "author_rating": 6.0, "review_text": "**_The Jurassic Park protagonists come together in Marvel’s Savage Land, minus Ka-Zar_**\r\n\r\nAs dinosaurs freely roam the Earth, Owen & Claire (Chris Pratt and Bryce Dallas Howard) seek to find their kidnapped adopted daughter (Isabella Sermon), which takes them to Malta and then a remote dinosaur preserve in the Dolomite Mountains of northeastern Italy. Meanwhile Ellie Sattler and Alan Grant (Laura Dern and Sam Neill) have serious concerns about the remote facility wherein they reunite with Ian Malcolm (Jeff Goldblum).\r\n   \r\n\"Jurassic World: Dominion\" (2022) isn’t great like the previous “Fallen Kingdom” (2018) and is arguably the least of the second trilogy. There are some Indiana Jones elements in the Malta segment and James Bond bits at the technologically advanced lair in the mountains, both of which I appreciate.\r\n\r\nYet I strangely never bought the characters as real people. They always struck me as actors performing according to a contrived script, which tries too hard to check the diversity boxes. Still, there’s certainly enough here to entertain if you’re interested in a dinosaur-oriented sci-fi adventure.  \r\n\r\nThe film runs 2 hours, 27 minutes, with the Extended Version running just over 12 minutes longer (I viewed the latter). The primary shooting locations include British Columbia, Malta, Hawaii and the UK (Pinewood Studios).\r\n\r\nGRADE: B-/C+", "created_at": "2022-12-29T09:33:11.856Z"}, {"movie_id": 507086, "review_id": "64078c81ae26be00d84727c3", "author_rating": 5.0, "review_text": "Jurassic World Dominion fails to impress as a dinosaur movie, as the plot seems to be a poor choice. The dinosaurs are present but not the main focus, giving the impression that they are only there to extend the franchise. Even the inclusion of Alan Grant seems to be more for nostalgic purposes than contributing to the story. Chris Pratt's character also appears to be underutilized and serves more as a prop rather than a leading character.\r\n\r\nThe camera work in the movie is particularly shoddy, with cuts from one angle to another creating confusion, especially in fast-paced scenes like the one in Malta. The depiction of Malta in the movie is also disappointing, with the country portrayed as a dirty, third-world Arabic nation covered in desert sand, which is not an accurate representation of the country. The use of Arabic style music in the background also seems out of place and unnecessary.\r\n\r\nOverall, Jurassic World Dominion seems to be a movie that was made to extend the franchise rather than being a well-planned and executed story. It is disappointing that a franchise that should have stopped by the third installment continues to churn out mediocre movies. Although the movie is not a complete disaster, it falls short of being an enjoyable watch. \r\n\r\nAdditionally, the length of the movie seems to be excessive, and the dragging plot does not help in holding the audience's attention. The story's predictability adds to the monotony, leaving little to surprise or engage the viewers.\r\n\r\nAs if to acknowledge the franchise's overreliance on gimmicks and sequels, Ian Malcolm's line, \"Jurassic World? Not a fan,\" serves as a meta-commentary on the movie itself. It is a nod to the fans who have been disappointed by the franchise's recent offerings, and unfortunately, Jurassic World Dominion does little to change that sentiment. 5/10", "created_at": "2023-03-07T19:12:01.467Z"}, {"movie_id": 507086, "review_id": "64a66e090398ab010c545cc3", "author_rating": 4.0, "review_text": "The course of the modern series of Jurassic Park films has become completely different from the old series, lost in the wind and far from the path of success. The story has become weak and lacks events that attract the viewer, and illogical imagination has been introduced excessively, which we are not used to in the old series.", "created_at": "2023-07-06T07:32:25.425Z"}]