[{"movie_id": 1271, "review_id": "5b948b0dc3a368567c0172e3", "author_rating": 3.0, "review_text": "<i>300</i>, the 2007 story of the three hundred Spartans who held off a massive Persian offensive in Ancient Greece, proved a disappointing film. In spite of my Classics degree, I won't complain about the divergences from recorded fact. The film is clearly meant to be a fantasy on historical themes instead of a faithful account of the event. Rather, what irked me was the hammy dialogue. There were the tropes of recent Hollywood battle scenes: warriors on the good guys' side defending themselves with little exertion as they trade silly quips about how they've got each other's backs. A queen gives an address to a council that is all melodrama -- are we back in George Lucas' \"Star Wars\" prequels?\r\n\r\nHaving enjoyed <i>Sin City</i>, a film with a similar green screen approach, I thought that <i>300</i> would be enjoyable on the basis of its special effects, but alas it wasn't. For one, the cinematography is claustrophobic. All outdoor scenes but one were filmed with a green screen, and the digital backdrops add no depth. Even when supposedly standing on the Greek coast under a big sky, everyone seems like they are just standing around in a fairly small room. Also, the fight scenes seem more primitive than considering that this film followed years after <i>The Matrix Reloaded</i>.\r\n\r\nThe little I can recommend <i>300</i> for is the variety of demonic monsters and exotic costumed assassins that fill the Persian army. As I said, this is a fantasy on historical themes, and the additions are often interesting. Still, I had a hard time sitting through the whole film.", "created_at": "2018-09-09T02:53:01.231Z"}, {"movie_id": 1271, "review_id": "5bb5c44b0e0a263397009bf8", "author_rating": 7.0, "review_text": "Leather underwear and a cape is honestly such a Look™.\r\n\r\n_300_ cops a lot of flak for being all style and no substance, and I'm not gonna stand here and lie to you by refuting that. What I will say however, is that style over substance does not inherently make a movie bad. _300_ is a lot of fun, you get what's going on, and there's some genuine rewatch value.\r\n\r\nFinal rating:★★★½ - I really liked it. Would strongly recommend you give it your time.", "created_at": "2018-10-04T07:42:03.153Z"}, {"movie_id": 1271, "review_id": "5f73c0178c22c00038cc56ad", "author_rating": 6.0, "review_text": "Only the third time seeing this one, first time was in the theaters and then I think on DVD. Didn't care a whole lot in either viewing. So with the 4K being released, decided enough time had passed to give it another shot and... it was okay, a bit too stylized for my taste (and yes I know that's Snyder's thing) and lacks the emotional impact Snyder was going for, but there are some bad ass moments, including just Gerard Butler's overall performance, but didn't really do much for me otherwise.\r\n\r\nProbably my least favorite of Snyder's movies, though haven't watched Sucker Punch in a long time. 3.0/5", "created_at": "2020-09-29T23:15:35.434Z"}, {"movie_id": 1271, "review_id": "64569f18fe077a0156754f4f", "author_rating": 7.0, "review_text": "A mesmerizing visual style to this movie. An epic adventure everyone should watch. A Greek myth on the big screen. Yes thankyou!", "created_at": "2023-05-06T18:40:24.753Z"}]