[{"movie_id": 527774, "review_id": "603d201b33a533004bd1906e", "author_rating": null, "review_text": "In a magical land known as Kumandra; Humans and Dragons co-exist in harmony. When a threat in the form of creatures known as Druun arrive and threaten to destroy everything; the Dragons combine their power to defeat them but in doing so all but one of the Dragons remains.\r\n\r\nIn the new Disney animated film “Raya and the Last Dragon”; audiences are introduced to the narrative of the story by Raya (Kelly Marie Tran), who tells that the world has become fractured and she is to blame. A sacred relic that the Dragons used to Defeat the Druun has given her kingdom prosperity but the surrounding kingdoms all named after various parts of a Dragon are envious of their position.\r\n\r\nWhen Raya’s father Chief Benja (Daniel Dae Kim); attempts to unite the other kingdoms, a tragic betrayal results in the relic becoming fractured with each kingdom taking a fragment. As if this situation was not bad enough; the fracturing of the relic ushers in the return of the Druun and they quickly resume turning everything not protected by a barrier of water to stone.\r\n\r\nThe story then jumps years into the future where Raya and her faithful companion Tuk Tuk (Alan TudyK) are searching the rivers of the kingdoms in an effort to find the location where the last Dragon Sisu (Awkwafina) is rumored to have been sleeping for 500 years.\r\n\r\nRaya is eventually able to locate Sisu who is a very playful and animated creature and the two set off to save the day by obtaining the missing fragments through any means necessary. Naturally, their journey will be filled with dangers, adventure, and humor, as the various kingdoms have their own unique visual style and characters; some of whom join with Raya on her quest to provide much-needed support, perspective, and at times; humor.\r\n\r\nThe movie is visually amazing as the artists clearly were inspired to create a world that combines elements of many Asian cultures yet has its own unique traits. I marveled at the details of the water and ripples and how the railings on a boat showed uneven discoloration and wear in just a casual scene where the characters talked. It is this attention to detail that really adds to the magic of the film as well as the immersion into fantasy.\r\n\r\nThe supporting cast was great and there are some characters I do not wish to spoil who practically steals every scene in which they are in.  My wife and I were captivated from the very start as Disney has created a film that embodies much of their classic themes and yet expands upon them to create a film the entire family will enjoy.\r\n\r\nThe movie will be released in cinemas and via a paid option for Disney+ subscribers. We attended a press screening at a cinema; our first in almost a year and found the setup to be very safe and it was amazing to see such visual splendor on a big screen.\r\n\r\nDisney has once again created a new classic and has given audiences the magic that they are known for at a time when it is most needed.\r\n\r\n4 stars out of 5.", "created_at": "2021-03-01T17:10:51.977Z"}, {"movie_id": 527774, "review_id": "603d20a3e267de005151480c", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nDisney purchased Pixar way back in 2006, and many incredible animated films have been released under both banners. Therefore, it’s quite understandable that many people don’t recognize the difference between Walt Disney Animation Studios and Pixar itself. The latter studio released two movies just last year (Onward, Soul), while the former’s latest original film dates back to 2016’s Moana. So, there was a lot of anticipation for a new animated movie from the studio that gave us classics such as Aladdin, The Lion King, Mulan, and more recently, the Frozen saga. With Don Hall (Big Hero 6) and Carlos López Estrada (Blindspotting) at the helm, and Adele Lim (Crazy Rich Asians) and Qui Nguyen (feature-film debut) tackling the screenplay, did they succeed in delivering a good film?\r\n\r\nWell, if I must answer “yes” or “no”, I’ll go with the first one. Let’s start with the positives. The one thing everyone expects from a Disney animated movie is beautiful animation, and Raya and the Last Dragon features tons of gorgeous, creative, jaw-dropping sceneries. The different lands that the story takes the viewers through look impressively realistic, some of them clearly drawing inspiration from real Asian places and culture. The character drawings also look excellent, even though they’re not too far from what we’ve seen from 3D animation in the last few years. \r\n\r\nTechnically though, my standout goes to James Newton Howard’s addictive, chill-inducing score. From the emotional tracks to the riveting tones that elevate every action sequence, it’s a score that I’ll struggle to get out of my head for the next couple of weeks, especially its main theme. In fact, I’m actually listening to it while writing this review, and I’m feeling full of energy. The sound effects for the Druun monsters are pretty eerie, it’s hard not to feel the weight of their threatening presence, but the inspirational, tear-inducing soundtracks leave me floored. The action scenes are wonderfully shot and animated, bringing high levels of entertainment and excitement to a partially adventure-driven narrative. Raya’s sword fighting is indisputably the most captivating type of battle seen throughout the entire runtime.\r\n\r\nStory-wise is where things get a little disappointing, to be completely honest. While the visuals share outstanding imagination and creativity, Adele Lim and Qui Nguyen’s formulaic screenplay is much more straightforward and unsurprising than expected. I knew Raya and the Last Dragon wasn’t going to deliver a groundbreaking narrative, but a videogame-style script is far from being a good alternative. The third act tries to challenge its story’s predictability with one little unexpected moment that I undoubtedly love, but besides not changing the outcome predicted in the first ten minutes of the film, it severely damages a secondary character.\r\n\r\nRegarding this last issue, I can’t deny that it’s my main problem with the movie, but I would have to go into spoiler territory to fully explain it. Therefore, I’ll only address the character’s inconsistency, which unfortunately affects the film’s primary message. The main themes revolve around trust and how if we treat other people kindly, they’ll treat us in the same way. A lovely note that parents will surely want to transmit to their kids, without the shadow of a doubt. However, the character in question spends the movie not knowing where to stand, constantly betraying everyone, and even blaming others for something that same character triggered in the first place.\r\n\r\nDespite having a significantly negative impact on my enjoyment of the film, the ending does work quite well and compensates for my problem with the said character. Kelly Marie Tran lends her voice to Raya, a protagonist easy to root for due to her clear motivations and important mission, while Awkwafina is very funny as Sisu, a goofy dragon with more depth than what the viewers might expect from the first impression. Everyone in the cast delivers extraordinary voice work, and every character has some sort of captivating trait that makes the audience support them, except for you know who. Having in mind that kids are indeed the target audience, I’m positive all will feel delighted with this movie.\r\n\r\nBoasting a predominantly Asian American cast, all delivering exceptional voice work, Raya and the Last Dragon follows a partially disappointing, formulaic narrative but compensates it with stunning animation, a chill-inducing score, and quite a nice ending. Walt Disney Animation Studios returns with an original story that lacks surprising elements, lending all the creativity and imagination to its entertaining, fast-paced adventure packed with undeniably impactful visuals and incredibly riveting action sequences. Despite a significant problem with an inconsistent character that profoundly affects my enjoyment of the film, all other characters are extremely likable, goofy, and well-written. A delightful message about trust and treating others kindly is ultimately well-transmitted to the viewers, which I hope parents will show their kids. Final remark: James Newton Howard’s score will not leave your minds for a long, long time.\r\n\r\nRating: B", "created_at": "2021-03-01T17:13:07.315Z"}, {"movie_id": 527774, "review_id": "604589ebca0e17007648b76b", "author_rating": 7.0, "review_text": "'Raya and the Last Dragon' is a solid step back in the right direction for Walt Disney Animation Studios. Over the past 20 years, they've struggled to find their confidence and voice as a studio, certainly due to complicated changes of leadership and the rise of genuine artistic and financial competitors, but 'Raya' is the kind of film in which they do their best work - an entertaining and exciting experience built on a strong protagonist with a clear motivation and a powerful internal conflict. The legacy of Disney animation has been to speak to the deep emotional truths of the human experience in a way that is accessible to anyone, and with its themes of self-belief, moving through grief and trauma, and finding the trust in others and ourselves, 'Raya and the Last Dragon' is a worthy part of that legacy.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-raya-and-the-last-dragon-a-solid-return-to-form-for-walt-disney-animation-studios", "created_at": "2021-03-08T02:20:27.149Z"}, {"movie_id": 527774, "review_id": "604797d0ea37e00045400a6b", "author_rating": 8.0, "review_text": "It’s terrific to see the animated movies continuing to evolve, and “Raya and the Last Dragon” is the latest film that takes the traditional idea of a Disney heroine and makes a huge leap into a welcome new direction. This magical fantasy / adventure tale features inspired characters, beautiful animation, and a culturally accurate representation of Asian mythology. It’s a terrific movie on all levels.\r\n\r\nLong ago in the make-believe world of Kumandra, humans and dragons lived together in harmony. There was a complete balance to the world until an evil force known as the Druun began to threaten the land. This sinister tribe of shadow monsters rose to power by feeding off the discord of humans, and the dragons decided to sacrifice themselves to save all of humanity. New unrest nearly 500 years later has resulted in the five divided lands of the kingdom refusing to co-exist in peace, giving rise to the Druun once again. Determined to preserve the world she loves, lone warrior Raya (voiced by Kelly Marie Tran) decides to track down the last living dragon and use its magic to save Kumandra.\r\n\r\nRaya is a trailblazing heroine, and she’s one that’s easy to admire and love. Her determination never falters as she learns the value of teamwork and trust along her journey. The film’s main characters are all female, from the last dragon Sisu (voiced by Awkwafina) to Raya’s adversary Namaari (voiced by Gemma Chan). There’s a magical relationship between Sisu and Raya, two unlikely friends that discover in each other that exactly little spark that each of their lives were missing. Even better, Raya collects a group of misfits along her journey, reinforcing the idea that heroes can come from the most unlikely places.\r\n\r\nThe film’s group of directors (Don Hall, Carlos López Estrada, Paul Briggs, and John Ripa) has created original characters that are unlike others you’ve seen before, and the beautiful animation brings them to life. Sisu is a gorgeous pastel-hued dragon with a personality to match (Awkwafina is the MVP in the cast). Raya is a new kind of Disney “princess,” one who knows how to take charge and can kick butt. There’s so much for everyone to love here, even if some of the goofier gags (like a thieving baby who is far more irritating than cute) may take viewers out of the overall experience.\r\n\r\nThe story is exciting and the elements of mythical adventure are spirited, making “Raya and the Last Dragon” one of the more interesting films to come out of Disney in a while. It’s an animated feature with a positive, sincere message, lively action scenes, and a sweet tale of friendship that can be enjoyed by the entire family.", "created_at": "2021-03-09T15:44:16.569Z"}, {"movie_id": 527774, "review_id": "607fa1ae8b959e00581a45eb", "author_rating": null, "review_text": "Disney, like many studios, have been under a lot of pressure to produce not only a large quantity of content but it also needs a higher level of quality. There was a clear need for something new under the Disney brand that wasn’t just a remake from something in the 90s and I believe Raya was a ray of sunshine to the studio. The ability to maintain the same family friendly message while still allowing animation to touch the hearts of any viewer was such an amazing feat. In order to avoid any spoilers I’ll just say the journey of Raya is not only inspirational but empowering. This is certainly a win for the studio and for any viewer that gives it a chance.", "created_at": "2021-04-21T03:53:18.339Z"}, {"movie_id": 527774, "review_id": "60c6507448333a0057570e7f", "author_rating": 8.0, "review_text": "Great watch, would watch again, and do recommend.\r\n\r\nI heard a lot of noise about it being a rip off of this, or a rip off of that, long short that it was a non-original cash-grab.\r\n\r\nI honestly don't see what people were talking about, other than it was an Asian-ish themed animation, and those people are just unfamiliar with Eastern anime, poor things.\r\n\r\nThis feels like an untold, if not unique, world, mythology, and great characters.\r\n\r\nMy big problem with this movie is that it is fueled by stupid.  I honestly expected them to fight over the magic thing, but the incompetence of stealing a thing that keeps the world from ending, let alone breaking it into pieces is a bit much.  It actually pushes it over into a horror movie territory, and it shows at one point.\r\n\r\nThere was also the bit where they show us a movie they skipped before this one, but it may not have been the best to start a franchise.\r\n\r\nThis movie feels like an old timey fable, it gets dark, and there is a lesson to be learned.\r\n\r\nI found it full of fun, adventure and action, not to mention top quality animation.  It is well worth the watch.", "created_at": "2021-06-13T18:37:40.495Z"}, {"movie_id": 527774, "review_id": "610e7d32dcf8750060754f8d", "author_rating": 8.0, "review_text": "Me and the kids watched this movie, one of the latest works of Disney, the other evening. I am pleased to be able to write that we found it quite good actually.\r\n\r\nIt is always with some worry that I approach anything that comes from Disney these days given how their woke brigade have screwed things over lately. This movie however, seems to be more or less back to old and working recipes and free from (too much) woke nonsense. Maybe Disney execs have finally realized that letting the woke brigade, SJW’s and cancel culture have any say whatsoever in the creative processes hurts the bottom line.\r\n\r\nIt is a good adventure story surrounded by lots of colorful characters, great scenery and lovely animated creatures. Just how a animated Disney movie should be. Some, probably self proclaimed, culture elite called it a “mediocre and repetitive story”. That is just such a load of bullshit but unfortunately the stupid algorithms on IMDb’s website calls it a “top review” and puts it on the front page of the movie (which is why I noticed it). Given that the movie currently hold a 7.4 rating on IMDb, 81% on TMDb and even the usually useless Rotten Tomatoes gave it a rating well above 90% I’d say this bloke is a minority.\r\n\r\nRaya herself was quite likable but her main adversary was rather bland in my opinion. However, the characters surrounding Raya was making up for this. I quite liked Boun, I definitely liked Tong and I just loved the baby and the three small rascals causing mischief everywhere they went.\r\n\r\nThe dragons where okay, Sisu was rather fun but they were all more like cuddly pets than real dragons with any real powers except for some parlor tricks. I did like the ending with all the Dragons being back though.\r\n\r\nIn good Disney tradition there were plenty of side characters and environmental gadgets etc… that threw in some additional laughs here and there.\r\n\r\nAs I wrote above, this was pretty much what would expect from Disney, the good Disney that we used to know that made fun movies for all ages.", "created_at": "2021-08-07T12:31:46.200Z"}, {"movie_id": 527774, "review_id": "612b7bc2a1d332001ed44a0d", "author_rating": 8.0, "review_text": "**Introduction by SpotaMovie.com**\r\nDisney delivers another movie f**ull of adventure, colours and essential messages. Raya and the last Dragon, released in 2021 and produced by Disney, is entertaining, powerful but not excellent.** The film received a Nominee at the “Hollywood Critics Association” in 2021 for the Best Picture. **It’s a must-watch for all generations, and let us explain to you why in our movie analysis at SpotaMovie.com**\r\n\r\n**Raya and the Last Dragon – The Story**\r\nFive hundred years ago, there was a happy place where everyone was living harmoniously and united. **Its name was Kumandra, protected by Dragons, and was an inspiring world for future generations.** However, the Druun, diabolic creatures that turn people into stone, attacked Kumandra.\r\nSo the Dragons put their powers together, risking their lives to defeat the Druun. Therefore, something magical will happen but not easily understandable for humans.\r\nHowever, **the world without Dragons is not the same. The people of Kumandra created five different lands, constantly fighting each other to protect or to steal the “sacred” gem.**\r\nTherefore, after five hundred years, **Raya and her father, Chief Benja, dream of recreating Kumandra. **An impossible mission that will bring us adventures, actions and inspiring moments to enjoy.\r\n\r\n1. - Will Raya achieve her goal?\r\n2. - What will she learn?\r\n3. - And what will she teach us?", "created_at": "2021-08-29T12:21:22.117Z"}]