[{"movie_id": 844417, "review_id": "64619656dbbb4200fc87e30d", "author_rating": 6.0, "review_text": "I have watched a few movies based on Raymond Chandler’s Philip Marlowe, and I can’t say that any of them dazzled me, even though they were usually played by actors I liked. This version struck me the same way. I really like Liam Neeson and feel that he has elevated a few B quality movies I have seen him in. But either he couldn’t or wasn’t allowed to work similar magic here. \r\n\r\nThe characters don’t mumble exactly, but the overall effect to me is that they might as well have been. The dialogue isn’t exactly electric and they seem to deliver them rather matter of factly. When Marlow beats up a few guys and says, “I am getting too old for this,” it comes out sounding like the tired cliche it is rather than a heartfelt observation by a jaded private eye.\r\n\r\nSo I can’t help but label this as a missed opportunity; I mean, it’s Liam Neeson for goodness sake. Write the man some better lines and action sequences.", "created_at": "2023-05-15T02:17:58.089Z"}, {"movie_id": 844417, "review_id": "64f33a06e0ca7f00ae3a2f45", "author_rating": 7.0, "review_text": "Regardless of what a lot of people claim, this is a quite good old-fashioned murder mystery and private investigator story. It is quite well done in the style one would expect when implementing a story where the main character is the famous Philip Marlowe.\r\n\r\nThis kind of story should not be filled with insane action, psychopathic outbursts or any other of the other stuff that Hollywood (as well as probably the younger audience) seems to think that every movie needs.\r\n\r\nIs it slow as many people say. Sure if you compare with John Wick it is slow. For a Philip Marlowe movie it is just right.\r\n\r\nWhen watching this movie I was really quite happy that this was not another movie (and character) that Hollywood felt they had to “modernize” like the remake abominations where Hercule Poirot runs on top of train cars and chases murderers waving guns.\r\n\r\nIt is a good mystery story. It is a good implementation. Liam Neeson, whom I generally like as an actor, is quite a good fit for the role of Philip Marlowe. Overall I quite enjoyed this movie.\r\n\r\nThe fact that the so called “critics” at Woke (Rotten) Tomatoes gave this movie 25% Rotten of course destroyed any credibility these woke hacks might have had left. If I move does not project the right agenda it is rotten by their standards, or rather lack thereof.", "created_at": "2023-09-02T13:35:02.156Z"}]