[{"movie_id": 11631, "review_id": "5207afdf760ee3630e234173", "author_rating": null, "review_text": "To Mamma Mia! then, a movie easily slipping in past Coyote Ugly as the second-worst film I've ever seen (behind The Rocky Horror Picture Show). My eyes. I can't unsee it.\r\n\r\nFrom what I could gather (and that's not because the plot is difficult - Christ, no - or because I wasn't really paying attention, it's because the film seemed to be not sinking in, not digesting in my brain. I think my brain was trying to reject it, like a foreign object) - an airy-fairy middle-aged bohemian tart (Meryl Streep, The Iron Lady) prances and dances around her primary-coloured villa on an unspecified Greek (I think) island. Her equally airy-fairy \"Barbie Princess\" daughter (Amanda Seyfried, Les Misérables) prances and dances around with her. That seems to be what they do. I mean, for a living, like. They're not on holiday. This is the summation of their lives. Idyllic and unrealistic prancery and dancery, around a villa apparently coloured in by over-enthusiastic first-graders. They have two friends each who escort them everywhere - even to the sh!tter perhaps, I dunno - who exist exclusively to orbit like satellites around this main pair. In fact, everybody in this movie exist purely to serve the life stories of Streep and Seyfried. It's that sort of film, where everybody on-screen is wondering, \"Oh! Will Streep eat a tangerine next? Or a satsuma? Will Seyfried brush her hair with a soft brush, or a slightly-softer-than-that brush? Oh, the agony!\" Anyway, the daughter's getting wed - the next day, I think - to some impossibly perfect young lad (to suit her impossibly perfect everything else), but, oh noes! She never knew who her dad was, because her mum was a dirty old stropper back in the eighties, and they've both been too busy prancing and dancing for two straight decades to even have brought it up, ever! So, who will give her away tomorrow? Oh noes!\r\n\r\nWell she prances and dances her way to her mum's secret diary (with her two conjoined mates, obvs) and, equally \"obvs\", it's all in there. Ta-daa! Except, there are three possible \"daddies\" and of course, they are Colin Firth (The King's Speech), Pierce Brosnan (Goldeneye) and Stellan Skarsgård (Pirates of the Caribbean: Dead Man's Chest). So she invites all three to the wedding under the pretense of being her own mum and of course all three drop whatever they've been doing for twenty years and turbo their way, immediately, to this island, all arriving together, on the same boat, which also belongs to one of them. Hurrah. From there, much \"hilarity\" ensues as the airy-fairy daughter tries to suss which one's her dad while her airy-fairy tart mother spends the rest of the film - with HER conjoined mates, obvs - wondering whether to let Brosnan \"tap dat ass\" one more time.\r\n\r\n**********\r\n\r\nSPOILER ALERT (LIKE ANYONE GIVES A DRY, UNYIELDING BUMPLOP): They don't find out who the daddy is: the three pinhead blokes all agree that they now already love this silly airy-fairy daughter so much that they agree to be one-thirds daddy each. Then, out of the clear ****ing sky, the airy-fairy daughter tells her groom at the altar that the wedding's off, and they should just prance and dance around the world instead. Fantastic! And not to waste a wedding full of perfect ****ing strangers anyway, but Brosnan decides to marry Streep while they're there. Well of course. And Skarsgård hooks up with Julie \"Isn't she dead yet?\" Walters - one of Streep's conjoined mates - and Firth, who as it happens was a left-footer all along who was just experimenting with Streep back in the day, cops off with a waiter in traditional Greek island fashion. Hurrah for everything! Let's have another ABBA song, eh?\r\n\r\n**********\r\n\r\nOh, the ABBA songs. I mean, there are musicals. Then, there are musical musicals. And then, way past any of that, there is Mamma Mia!. A quick Wiki-up shows me that, excluding reprises and a deleted scene, there are twenty songs performed in Mamma Mia!. So, say, four minutes per song, that's eighty minutes. Wiki (again) tells me that the film is 109 minutes in length, so let's knock off ten minutes-worth of credits, and you're looking at eighty minutes of singing in a 99 minute film. That sounds about right. A 19-minute story - a p!ss-poor one, at that - stretched over an hour-and-a-half by the soothing tunes of Agnetha, Benny, Bjorn and Anni-Frid. Looking at those numbers I'm now somewhat impressed that whilst watching this pile of pooey bum-leavings I didn't stand up, lose the plot, smash my house to rubble and wander off to live in the woods as a sasquatch. It was ceaseless. An ABBA song, three lines of dialogue (if you were lucky, which wasn't often), another ABBA song. Over and over. And... well, the songs were all sung in-camera by the actors. And whilst I wouldn't call any of them good singers, they could all at least hold a note (only just in Streep's case, but she managed to stumble over that line).\r\n\r\nAll except Pierce Brosnan.\r\n\r\nOh, Pierce. Pierce! Why didn't someone tell him? Did no one care enough? Is he THAT unlikeable? Why couldn't he hear it himself? I don't want to come across as either xenophobic or stereotypical when I suggest that he sounded like a drunken Irishman preparing to fight, but that IS what he sounded like. And who knows, maybe that's what was really happening with him at that time. He IS an Irishman, perhaps he needed to get good and liquored up before the singing - I know I would - and perhaps he was wondering whether or not to attack the first person on the set who dared laugh. Sounds perfectly plausible.\r\n\r\nAnyway, the whole thing's a travesty, top-to-toe. Most closely resembled one of those straight-to-video Barbie movies, beloved of six-year-old girls and nobody else on the entire planet. If you ever have an opportunity to see it, DO NOT take that opportunity. SPURN that opportunity. Spurn as though your very life depended on it. That's all the advice I can give. Don't do what I did, and watch Mamma Mia!. Only madness lies that way.", "created_at": "2013-08-11T15:38:07.031Z"}, {"movie_id": 11631, "review_id": "5921f2f09251414a5705af2c", "author_rating": 8.0, "review_text": "Really enjoyable film, with a lot of funny one-liners, and despite the fact that a lot of them are rubbish singers, that partly adds to the humour, and obviously, Amanda, Meryl, Colin and others do have good voices :)", "created_at": "2017-05-21T20:05:04.137Z"}, {"movie_id": 11631, "review_id": "5b3c31400e0a2623fb004e20", "author_rating": 8.0, "review_text": "***SPOILERS AHEAD***\r\n\r\n_Mamma Mia!_ is an American-British romantic comedy musical directed by Phyllida Lloyd. The movie is loosely based on the original London musical also directed by Lloyd, and was the brain child of Judy Craymer who was convinced ABBA songs could be used in a theatrical production, especially after hearing the love ballad _The Winner Takes It All_. Craymer along with British playwright Catherine Johnson also worked on this film. Johnson being the original musical's scriptwriter wrote the movie's script, Craymer was an executive producer alongside Gary Goetzman as well as Tom Hanks and Rita Wilson.\r\n\r\nThe film stars Meryl Streep, Pierce Brosnan, Colin Firth, Stellan Skarsgård, Julie Walters, Dominic Cooper, Amanda Seyfried, and Christine Baranski.\r\n\r\nSet on the idyllic Greek island of Kalokairi it tells the story of Donna Sheridan (Streep) an independent manageress and owner of her own hotel. Donna has a 20 year-old daughter by the name of Sophie (Seyfried) who is getting married to Sky (Cooper). Upon finding Donna's old diary Sophie discovers that there were three men: Sam Carmichael (Brosnan), Harry Bright (Firth) and Bill Anderson (Skarsgård) and learns that one of them could be her father. She decides to invite all three of them to her wedding. \r\n\r\nSophie later reveals this to her friends Ali (Rachel MacDowall) and Lisa (Ashley Lilley) who have agreed to be her bridesmaids. Donna has invited her old friends/bandmates Rosie (Walters) and Tanya (Baranski) to the wedding to help her out. She is however completely unaware of what Sophie has done and is taken by surprise when Sam, Harry and Bill arrive on the island. This causes Donna to have a mid-life crisis, and it is up to Rosie and Tanya to lift her spirits. While at the same time Sophie bonds with the three men, and discovers she has a trait from each of them. Things get complicated when all three men agree to give Sophie away, and realizing the mess she created she faints at her own bachelorette party.\r\n\r\nThe next day Sophie runs into Donna who is convinced that she wants the wedding called off. This causes Sophie to yell at Donna, and openly states she wants to avoid all the mistakes Donna has made in her life. At the same time Donna is pursued by Sam, the two realize they still love each other but are too busy for each other. Meanwhile, Tanya is courted by Sky's friend and best man Pepper (Philip Michael) despite the fact that he is old enough to be her son. Sophie then runs to Sky and admits what she did, angry and hurt Sky runs off. At the same time Sam tells Sophie that marriage is not always a happy thing.\r\n\r\nSophie then runs back to her mother and asks her to help her dress for the wedding, Donna is delighted and they mend their relationship. Sophie then learns that Donna was disowned by her mother when she got pregnant, she then proceeds to ask Donna to give her away. Donna happily agrees and as the two prepare to go to the chapel she finds herself accosted by Sam. Sam demands to know why Donna will not explain why she won't talk about their relationship. Donna then says she still loves him despite her better judgement and the fact that he broke her heart by being engaged.\r\n\r\nDonna then proceeds to run into the chapel where the wedding finally begins. As the ceremony begins Donna realizes that she can't hide the fact that the men are there. She then introduces Sophie's dad, but then learns that Sophie invited all three of them. They then all decide to be a third of her father, Sophie surprised decides to call off the wedding. Prompting Sky to run away with her and sail the world. Sam meanwhile decides that the wedding should not go to waste, despite Donna's protest at bigamy. After revealing his divorce Sam pops the question, hesitant Donna accepts it. At the wedding reception Rosie falls in love with Bill, who at first rejects her advances but then ends up loving her too.\r\n\r\nThe movie closes with Donna and Sam alongside Bill and Harry bidding Sophie and Sky farewell as they sail away from Kalokairi. Donna, Tanya and Rosie then reprise _Dancing Queen_ during the end credits, and then the rest of the cast appears and they all sing the song _Waterloo_. The movie then finally ends with Sophie singing _Thank You For the Music_ during the end credits.\r\n\r\nTold using several popular ABBA songs including_ Honey, Honey, Honey_, _Dancing Queen_ and the iconic titular song _Mamma Mia_ this movie soundtrack is responsible for making ABBA's music hit the charts again. Albeit some bad singing (cough)Pierce Brosnan(cough) the soundtrack is wonderful. The movie has some references to other films including _Dirty Dancing_ and _Grease._ Meryl Streep's performance of Donna Sheridan is an amazing example of her versatility especially when she sings the love ballad \"The Winner Takes It All.\" \"S.O.S\" is an interesting scene Brosnan's voice is flat but judging by his body language he is enjoying himself.\r\n\r\nIf you ignore the bad singing, you will be able to enjoy this film. I highly recommend it and the soundtrack. However, due to royalties and disagreements with UNICEF UMG and Decca Records could not secure the rights to the song _Chiquitita_ which explains why it is not on the CD.\r\n\r\nIf you have not seen this movie, then what are you waiting for?! Stream it or buy it and do it before July 20 because that is when it's highly anticipated sequel hits theaters!\r\n\r\n> It's very Greek! - Rosie", "created_at": "2018-07-04T02:30:24.202Z"}, {"movie_id": 11631, "review_id": "62edb55d9369a2007afaea4a", "author_rating": 5.0, "review_text": "**With a good cast and an enviable and appealing soundtrack, the film promised to be excellent… but it turned out to be much more average than I imagined.**\r\n\r\nFirst of all, I think I need to make a note: I can't say that I'm an ABBA fan, but the truth is that I have a great affection for the band and their songs, because they were songs that I remember hearing on TV when I was a kid. It is a childhood memory, which has a sentimental charge, and which cannot be evaluated in a completely neutral way (childhood memories never leave us neutral).\r\n\r\nI have yet to say that I had high expectations for the film. I'm not just talking about the music and the various songs I remember listening to, but also the enormous quality of the cast selected for the project, and the active participation of elements of the former band in the production. It was something that promised to have great quality. Well, the film has its qualities, it's undeniable, but the truth is that I noticed some laziness and sloppiness in the production, in several aspects.\r\n\r\nThe film's biggest problem was the absence of a well-written script that could support the action and songs. In addition to the slew of summer movie clichés, the script copied an old Italian movie called _Buona Sera Mrs. Campbell_, whose action is based on the dubious parenting of the protagonist's daughter, played by Gina Lollobrigida. I cannot say that we are in a situation of plagiarism because there are many films about children that do not know their parents, but the lack of originality is remarkable. Also, the film seems to almost make the apology of sexual promiscuity! In the midst of an uncomplicated, light, “hippie” environment, the film puts the main character’s mother in an embarrassing situation: she is the single mother of a daughter who grew up not knowing her father because there are three possible “candidates”, with whom she got involved almost simultaneously! And I'd rather not talk about that scene where a mature woman flirts with a guy much younger than her!\r\n\r\nJumping from Broadway to Hollywood, Phyllida Lloyd assured a sincere, but not excellent, effort at the direction. She was not able to demand more from her crew, she allowed a very poor conception of the characters and the choice of actors was not at all happy from the moment they had to sing. The best choices were Amanda Seyfried and Meryl Streep, two solid, charismatic, expressive actresses with an excellent voice. The scenes in which the two are protagonists, speaking or singing, are among the best in the film, which was an excellent bet that Seyfried made in her career. Stellan Skarsgard did reasonably well, but I felt he had little to do, and so Colin Firth... in fact, this English actor, whose voice is not particularly pleasant, already seemed to me to be a dubious choice for a musical. However, he looked like an opera diva when compared to Pierce Brosnan or Julie Walters. The ex-Bond has great difficulty with the treble and sings almost in falsetto, and Walters can't sing without starting to scream.\r\n\r\nTechnically, the film isn't brilliant either. On the positive side, we have the elegant cinematography, with the sun, the sea and the scenic beauty of the Greek islands favoring the visuals (we have to agree that the filming locations were wonderfully used), as well as the well-conceived sets and costumes. But the film's strong point is the soundtrack, of course, with an abundant list of ABBA songs, so famous that we can sing the entire movie. However, the insertion of each song in the film leaves a lot to be desired, something that, along with somewhat artificial choreography, leaves us with the feeling that the film is almost a gigantic music video clip, with the script being just an excuse for the songs to appear successively.", "created_at": "2022-08-06T00:27:09.040Z"}, {"movie_id": 11631, "review_id": "5207afdf760ee3630e234173", "author_rating": null, "review_text": "To Mamma Mia! then, a movie easily slipping in past Coyote Ugly as the second-worst film I've ever seen (behind The Rocky Horror Picture Show). My eyes. I can't unsee it.\r\n\r\nFrom what I could gather (and that's not because the plot is difficult - Christ, no - or because I wasn't really paying attention, it's because the film seemed to be not sinking in, not digesting in my brain. I think my brain was trying to reject it, like a foreign object) - an airy-fairy middle-aged bohemian tart (Meryl Streep, The Iron Lady) prances and dances around her primary-coloured villa on an unspecified Greek (I think) island. Her equally airy-fairy \"Barbie Princess\" daughter (Amanda Seyfried, Les Misérables) prances and dances around with her. That seems to be what they do. I mean, for a living, like. They're not on holiday. This is the summation of their lives. Idyllic and unrealistic prancery and dancery, around a villa apparently coloured in by over-enthusiastic first-graders. They have two friends each who escort them everywhere - even to the sh!tter perhaps, I dunno - who exist exclusively to orbit like satellites around this main pair. In fact, everybody in this movie exist purely to serve the life stories of Streep and Seyfried. It's that sort of film, where everybody on-screen is wondering, \"Oh! Will Streep eat a tangerine next? Or a satsuma? Will Seyfried brush her hair with a soft brush, or a slightly-softer-than-that brush? Oh, the agony!\" Anyway, the daughter's getting wed - the next day, I think - to some impossibly perfect young lad (to suit her impossibly perfect everything else), but, oh noes! She never knew who her dad was, because her mum was a dirty old stropper back in the eighties, and they've both been too busy prancing and dancing for two straight decades to even have brought it up, ever! So, who will give her away tomorrow? Oh noes!\r\n\r\nWell she prances and dances her way to her mum's secret diary (with her two conjoined mates, obvs) and, equally \"obvs\", it's all in there. Ta-daa! Except, there are three possible \"daddies\" and of course, they are Colin Firth (The King's Speech), Pierce Brosnan (Goldeneye) and Stellan Skarsgård (Pirates of the Caribbean: Dead Man's Chest). So she invites all three to the wedding under the pretense of being her own mum and of course all three drop whatever they've been doing for twenty years and turbo their way, immediately, to this island, all arriving together, on the same boat, which also belongs to one of them. Hurrah. From there, much \"hilarity\" ensues as the airy-fairy daughter tries to suss which one's her dad while her airy-fairy tart mother spends the rest of the film - with HER conjoined mates, obvs - wondering whether to let Brosnan \"tap dat ass\" one more time.\r\n\r\n**********\r\n\r\nSPOILER ALERT (LIKE ANYONE GIVES A DRY, UNYIELDING BUMPLOP): They don't find out who the daddy is: the three pinhead blokes all agree that they now already love this silly airy-fairy daughter so much that they agree to be one-thirds daddy each. Then, out of the clear ****ing sky, the airy-fairy daughter tells her groom at the altar that the wedding's off, and they should just prance and dance around the world instead. Fantastic! And not to waste a wedding full of perfect ****ing strangers anyway, but Brosnan decides to marry Streep while they're there. Well of course. And Skarsgård hooks up with Julie \"Isn't she dead yet?\" Walters - one of Streep's conjoined mates - and Firth, who as it happens was a left-footer all along who was just experimenting with Streep back in the day, cops off with a waiter in traditional Greek island fashion. Hurrah for everything! Let's have another ABBA song, eh?\r\n\r\n**********\r\n\r\nOh, the ABBA songs. I mean, there are musicals. Then, there are musical musicals. And then, way past any of that, there is Mamma Mia!. A quick Wiki-up shows me that, excluding reprises and a deleted scene, there are twenty songs performed in Mamma Mia!. So, say, four minutes per song, that's eighty minutes. Wiki (again) tells me that the film is 109 minutes in length, so let's knock off ten minutes-worth of credits, and you're looking at eighty minutes of singing in a 99 minute film. That sounds about right. A 19-minute story - a p!ss-poor one, at that - stretched over an hour-and-a-half by the soothing tunes of Agnetha, Benny, Bjorn and Anni-Frid. Looking at those numbers I'm now somewhat impressed that whilst watching this pile of pooey bum-leavings I didn't stand up, lose the plot, smash my house to rubble and wander off to live in the woods as a sasquatch. It was ceaseless. An ABBA song, three lines of dialogue (if you were lucky, which wasn't often), another ABBA song. Over and over. And... well, the songs were all sung in-camera by the actors. And whilst I wouldn't call any of them good singers, they could all at least hold a note (only just in Streep's case, but she managed to stumble over that line).\r\n\r\nAll except Pierce Brosnan.\r\n\r\nOh, Pierce. Pierce! Why didn't someone tell him? Did no one care enough? Is he THAT unlikeable? Why couldn't he hear it himself? I don't want to come across as either xenophobic or stereotypical when I suggest that he sounded like a drunken Irishman preparing to fight, but that IS what he sounded like. And who knows, maybe that's what was really happening with him at that time. He IS an Irishman, perhaps he needed to get good and liquored up before the singing - I know I would - and perhaps he was wondering whether or not to attack the first person on the set who dared laugh. Sounds perfectly plausible.\r\n\r\nAnyway, the whole thing's a travesty, top-to-toe. Most closely resembled one of those straight-to-video Barbie movies, beloved of six-year-old girls and nobody else on the entire planet. If you ever have an opportunity to see it, DO NOT take that opportunity. SPURN that opportunity. Spurn as though your very life depended on it. That's all the advice I can give. Don't do what I did, and watch Mamma Mia!. Only madness lies that way.", "created_at": "2013-08-11T15:38:07.031Z"}, {"movie_id": 11631, "review_id": "5921f2f09251414a5705af2c", "author_rating": 8.0, "review_text": "Really enjoyable film, with a lot of funny one-liners, and despite the fact that a lot of them are rubbish singers, that partly adds to the humour, and obviously, Amanda, Meryl, Colin and others do have good voices :)", "created_at": "2017-05-21T20:05:04.137Z"}, {"movie_id": 11631, "review_id": "5b3c31400e0a2623fb004e20", "author_rating": 8.0, "review_text": "***SPOILERS AHEAD***\r\n\r\n_Mamma Mia!_ is an American-British romantic comedy musical directed by Phyllida Lloyd. The movie is loosely based on the original London musical also directed by Lloyd, and was the brain child of Judy Craymer who was convinced ABBA songs could be used in a theatrical production, especially after hearing the love ballad _The Winner Takes It All_. Craymer along with British playwright Catherine Johnson also worked on this film. Johnson being the original musical's scriptwriter wrote the movie's script, Craymer was an executive producer alongside Gary Goetzman as well as Tom Hanks and Rita Wilson.\r\n\r\nThe film stars Meryl Streep, Pierce Brosnan, Colin Firth, Stellan Skarsgård, Julie Walters, Dominic Cooper, Amanda Seyfried, and Christine Baranski.\r\n\r\nSet on the idyllic Greek island of Kalokairi it tells the story of Donna Sheridan (Streep) an independent manageress and owner of her own hotel. Donna has a 20 year-old daughter by the name of Sophie (Seyfried) who is getting married to Sky (Cooper). Upon finding Donna's old diary Sophie discovers that there were three men: Sam Carmichael (Brosnan), Harry Bright (Firth) and Bill Anderson (Skarsgård) and learns that one of them could be her father. She decides to invite all three of them to her wedding. \r\n\r\nSophie later reveals this to her friends Ali (Rachel MacDowall) and Lisa (Ashley Lilley) who have agreed to be her bridesmaids. Donna has invited her old friends/bandmates Rosie (Walters) and Tanya (Baranski) to the wedding to help her out. She is however completely unaware of what Sophie has done and is taken by surprise when Sam, Harry and Bill arrive on the island. This causes Donna to have a mid-life crisis, and it is up to Rosie and Tanya to lift her spirits. While at the same time Sophie bonds with the three men, and discovers she has a trait from each of them. Things get complicated when all three men agree to give Sophie away, and realizing the mess she created she faints at her own bachelorette party.\r\n\r\nThe next day Sophie runs into Donna who is convinced that she wants the wedding called off. This causes Sophie to yell at Donna, and openly states she wants to avoid all the mistakes Donna has made in her life. At the same time Donna is pursued by Sam, the two realize they still love each other but are too busy for each other. Meanwhile, Tanya is courted by Sky's friend and best man Pepper (Philip Michael) despite the fact that he is old enough to be her son. Sophie then runs to Sky and admits what she did, angry and hurt Sky runs off. At the same time Sam tells Sophie that marriage is not always a happy thing.\r\n\r\nSophie then runs back to her mother and asks her to help her dress for the wedding, Donna is delighted and they mend their relationship. Sophie then learns that Donna was disowned by her mother when she got pregnant, she then proceeds to ask Donna to give her away. Donna happily agrees and as the two prepare to go to the chapel she finds herself accosted by Sam. Sam demands to know why Donna will not explain why she won't talk about their relationship. Donna then says she still loves him despite her better judgement and the fact that he broke her heart by being engaged.\r\n\r\nDonna then proceeds to run into the chapel where the wedding finally begins. As the ceremony begins Donna realizes that she can't hide the fact that the men are there. She then introduces Sophie's dad, but then learns that Sophie invited all three of them. They then all decide to be a third of her father, Sophie surprised decides to call off the wedding. Prompting Sky to run away with her and sail the world. Sam meanwhile decides that the wedding should not go to waste, despite Donna's protest at bigamy. After revealing his divorce Sam pops the question, hesitant Donna accepts it. At the wedding reception Rosie falls in love with Bill, who at first rejects her advances but then ends up loving her too.\r\n\r\nThe movie closes with Donna and Sam alongside Bill and Harry bidding Sophie and Sky farewell as they sail away from Kalokairi. Donna, Tanya and Rosie then reprise _Dancing Queen_ during the end credits, and then the rest of the cast appears and they all sing the song _Waterloo_. The movie then finally ends with Sophie singing _Thank You For the Music_ during the end credits.\r\n\r\nTold using several popular ABBA songs including_ Honey, Honey, Honey_, _Dancing Queen_ and the iconic titular song _Mamma Mia_ this movie soundtrack is responsible for making ABBA's music hit the charts again. Albeit some bad singing (cough)Pierce Brosnan(cough) the soundtrack is wonderful. The movie has some references to other films including _Dirty Dancing_ and _Grease._ Meryl Streep's performance of Donna Sheridan is an amazing example of her versatility especially when she sings the love ballad \"The Winner Takes It All.\" \"S.O.S\" is an interesting scene Brosnan's voice is flat but judging by his body language he is enjoying himself.\r\n\r\nIf you ignore the bad singing, you will be able to enjoy this film. I highly recommend it and the soundtrack. However, due to royalties and disagreements with UNICEF UMG and Decca Records could not secure the rights to the song _Chiquitita_ which explains why it is not on the CD.\r\n\r\nIf you have not seen this movie, then what are you waiting for?! Stream it or buy it and do it before July 20 because that is when it's highly anticipated sequel hits theaters!\r\n\r\n> It's very Greek! - Rosie", "created_at": "2018-07-04T02:30:24.202Z"}, {"movie_id": 11631, "review_id": "62edb55d9369a2007afaea4a", "author_rating": 5.0, "review_text": "**With a good cast and an enviable and appealing soundtrack, the film promised to be excellent… but it turned out to be much more average than I imagined.**\r\n\r\nFirst of all, I think I need to make a note: I can't say that I'm an ABBA fan, but the truth is that I have a great affection for the band and their songs, because they were songs that I remember hearing on TV when I was a kid. It is a childhood memory, which has a sentimental charge, and which cannot be evaluated in a completely neutral way (childhood memories never leave us neutral).\r\n\r\nI have yet to say that I had high expectations for the film. I'm not just talking about the music and the various songs I remember listening to, but also the enormous quality of the cast selected for the project, and the active participation of elements of the former band in the production. It was something that promised to have great quality. Well, the film has its qualities, it's undeniable, but the truth is that I noticed some laziness and sloppiness in the production, in several aspects.\r\n\r\nThe film's biggest problem was the absence of a well-written script that could support the action and songs. In addition to the slew of summer movie clichés, the script copied an old Italian movie called _Buona Sera Mrs. Campbell_, whose action is based on the dubious parenting of the protagonist's daughter, played by Gina Lollobrigida. I cannot say that we are in a situation of plagiarism because there are many films about children that do not know their parents, but the lack of originality is remarkable. Also, the film seems to almost make the apology of sexual promiscuity! In the midst of an uncomplicated, light, “hippie” environment, the film puts the main character’s mother in an embarrassing situation: she is the single mother of a daughter who grew up not knowing her father because there are three possible “candidates”, with whom she got involved almost simultaneously! And I'd rather not talk about that scene where a mature woman flirts with a guy much younger than her!\r\n\r\nJumping from Broadway to Hollywood, Phyllida Lloyd assured a sincere, but not excellent, effort at the direction. She was not able to demand more from her crew, she allowed a very poor conception of the characters and the choice of actors was not at all happy from the moment they had to sing. The best choices were Amanda Seyfried and Meryl Streep, two solid, charismatic, expressive actresses with an excellent voice. The scenes in which the two are protagonists, speaking or singing, are among the best in the film, which was an excellent bet that Seyfried made in her career. Stellan Skarsgard did reasonably well, but I felt he had little to do, and so Colin Firth... in fact, this English actor, whose voice is not particularly pleasant, already seemed to me to be a dubious choice for a musical. However, he looked like an opera diva when compared to Pierce Brosnan or Julie Walters. The ex-Bond has great difficulty with the treble and sings almost in falsetto, and Walters can't sing without starting to scream.\r\n\r\nTechnically, the film isn't brilliant either. On the positive side, we have the elegant cinematography, with the sun, the sea and the scenic beauty of the Greek islands favoring the visuals (we have to agree that the filming locations were wonderfully used), as well as the well-conceived sets and costumes. But the film's strong point is the soundtrack, of course, with an abundant list of ABBA songs, so famous that we can sing the entire movie. However, the insertion of each song in the film leaves a lot to be desired, something that, along with somewhat artificial choreography, leaves us with the feeling that the film is almost a gigantic music video clip, with the script being just an excuse for the songs to appear successively.", "created_at": "2022-08-06T00:27:09.040Z"}, {"movie_id": 11631, "review_id": "5207afdf760ee3630e234173", "author_rating": null, "review_text": "To Mamma Mia! then, a movie easily slipping in past Coyote Ugly as the second-worst film I've ever seen (behind The Rocky Horror Picture Show). My eyes. I can't unsee it.\r\n\r\nFrom what I could gather (and that's not because the plot is difficult - Christ, no - or because I wasn't really paying attention, it's because the film seemed to be not sinking in, not digesting in my brain. I think my brain was trying to reject it, like a foreign object) - an airy-fairy middle-aged bohemian tart (Meryl Streep, The Iron Lady) prances and dances around her primary-coloured villa on an unspecified Greek (I think) island. Her equally airy-fairy \"Barbie Princess\" daughter (Amanda Seyfried, Les Misérables) prances and dances around with her. That seems to be what they do. I mean, for a living, like. They're not on holiday. This is the summation of their lives. Idyllic and unrealistic prancery and dancery, around a villa apparently coloured in by over-enthusiastic first-graders. They have two friends each who escort them everywhere - even to the sh!tter perhaps, I dunno - who exist exclusively to orbit like satellites around this main pair. In fact, everybody in this movie exist purely to serve the life stories of Streep and Seyfried. It's that sort of film, where everybody on-screen is wondering, \"Oh! Will Streep eat a tangerine next? Or a satsuma? Will Seyfried brush her hair with a soft brush, or a slightly-softer-than-that brush? Oh, the agony!\" Anyway, the daughter's getting wed - the next day, I think - to some impossibly perfect young lad (to suit her impossibly perfect everything else), but, oh noes! She never knew who her dad was, because her mum was a dirty old stropper back in the eighties, and they've both been too busy prancing and dancing for two straight decades to even have brought it up, ever! So, who will give her away tomorrow? Oh noes!\r\n\r\nWell she prances and dances her way to her mum's secret diary (with her two conjoined mates, obvs) and, equally \"obvs\", it's all in there. Ta-daa! Except, there are three possible \"daddies\" and of course, they are Colin Firth (The King's Speech), Pierce Brosnan (Goldeneye) and Stellan Skarsgård (Pirates of the Caribbean: Dead Man's Chest). So she invites all three to the wedding under the pretense of being her own mum and of course all three drop whatever they've been doing for twenty years and turbo their way, immediately, to this island, all arriving together, on the same boat, which also belongs to one of them. Hurrah. From there, much \"hilarity\" ensues as the airy-fairy daughter tries to suss which one's her dad while her airy-fairy tart mother spends the rest of the film - with HER conjoined mates, obvs - wondering whether to let Brosnan \"tap dat ass\" one more time.\r\n\r\n**********\r\n\r\nSPOILER ALERT (LIKE ANYONE GIVES A DRY, UNYIELDING BUMPLOP): They don't find out who the daddy is: the three pinhead blokes all agree that they now already love this silly airy-fairy daughter so much that they agree to be one-thirds daddy each. Then, out of the clear ****ing sky, the airy-fairy daughter tells her groom at the altar that the wedding's off, and they should just prance and dance around the world instead. Fantastic! And not to waste a wedding full of perfect ****ing strangers anyway, but Brosnan decides to marry Streep while they're there. Well of course. And Skarsgård hooks up with Julie \"Isn't she dead yet?\" Walters - one of Streep's conjoined mates - and Firth, who as it happens was a left-footer all along who was just experimenting with Streep back in the day, cops off with a waiter in traditional Greek island fashion. Hurrah for everything! Let's have another ABBA song, eh?\r\n\r\n**********\r\n\r\nOh, the ABBA songs. I mean, there are musicals. Then, there are musical musicals. And then, way past any of that, there is Mamma Mia!. A quick Wiki-up shows me that, excluding reprises and a deleted scene, there are twenty songs performed in Mamma Mia!. So, say, four minutes per song, that's eighty minutes. Wiki (again) tells me that the film is 109 minutes in length, so let's knock off ten minutes-worth of credits, and you're looking at eighty minutes of singing in a 99 minute film. That sounds about right. A 19-minute story - a p!ss-poor one, at that - stretched over an hour-and-a-half by the soothing tunes of Agnetha, Benny, Bjorn and Anni-Frid. Looking at those numbers I'm now somewhat impressed that whilst watching this pile of pooey bum-leavings I didn't stand up, lose the plot, smash my house to rubble and wander off to live in the woods as a sasquatch. It was ceaseless. An ABBA song, three lines of dialogue (if you were lucky, which wasn't often), another ABBA song. Over and over. And... well, the songs were all sung in-camera by the actors. And whilst I wouldn't call any of them good singers, they could all at least hold a note (only just in Streep's case, but she managed to stumble over that line).\r\n\r\nAll except Pierce Brosnan.\r\n\r\nOh, Pierce. Pierce! Why didn't someone tell him? Did no one care enough? Is he THAT unlikeable? Why couldn't he hear it himself? I don't want to come across as either xenophobic or stereotypical when I suggest that he sounded like a drunken Irishman preparing to fight, but that IS what he sounded like. And who knows, maybe that's what was really happening with him at that time. He IS an Irishman, perhaps he needed to get good and liquored up before the singing - I know I would - and perhaps he was wondering whether or not to attack the first person on the set who dared laugh. Sounds perfectly plausible.\r\n\r\nAnyway, the whole thing's a travesty, top-to-toe. Most closely resembled one of those straight-to-video Barbie movies, beloved of six-year-old girls and nobody else on the entire planet. If you ever have an opportunity to see it, DO NOT take that opportunity. SPURN that opportunity. Spurn as though your very life depended on it. That's all the advice I can give. Don't do what I did, and watch Mamma Mia!. Only madness lies that way.", "created_at": "2013-08-11T15:38:07.031Z"}, {"movie_id": 11631, "review_id": "5921f2f09251414a5705af2c", "author_rating": 8.0, "review_text": "Really enjoyable film, with a lot of funny one-liners, and despite the fact that a lot of them are rubbish singers, that partly adds to the humour, and obviously, Amanda, Meryl, Colin and others do have good voices :)", "created_at": "2017-05-21T20:05:04.137Z"}, {"movie_id": 11631, "review_id": "5b3c31400e0a2623fb004e20", "author_rating": 8.0, "review_text": "***SPOILERS AHEAD***\r\n\r\n_Mamma Mia!_ is an American-British romantic comedy musical directed by Phyllida Lloyd. The movie is loosely based on the original London musical also directed by Lloyd, and was the brain child of Judy Craymer who was convinced ABBA songs could be used in a theatrical production, especially after hearing the love ballad _The Winner Takes It All_. Craymer along with British playwright Catherine Johnson also worked on this film. Johnson being the original musical's scriptwriter wrote the movie's script, Craymer was an executive producer alongside Gary Goetzman as well as Tom Hanks and Rita Wilson.\r\n\r\nThe film stars Meryl Streep, Pierce Brosnan, Colin Firth, Stellan Skarsgård, Julie Walters, Dominic Cooper, Amanda Seyfried, and Christine Baranski.\r\n\r\nSet on the idyllic Greek island of Kalokairi it tells the story of Donna Sheridan (Streep) an independent manageress and owner of her own hotel. Donna has a 20 year-old daughter by the name of Sophie (Seyfried) who is getting married to Sky (Cooper). Upon finding Donna's old diary Sophie discovers that there were three men: Sam Carmichael (Brosnan), Harry Bright (Firth) and Bill Anderson (Skarsgård) and learns that one of them could be her father. She decides to invite all three of them to her wedding. \r\n\r\nSophie later reveals this to her friends Ali (Rachel MacDowall) and Lisa (Ashley Lilley) who have agreed to be her bridesmaids. Donna has invited her old friends/bandmates Rosie (Walters) and Tanya (Baranski) to the wedding to help her out. She is however completely unaware of what Sophie has done and is taken by surprise when Sam, Harry and Bill arrive on the island. This causes Donna to have a mid-life crisis, and it is up to Rosie and Tanya to lift her spirits. While at the same time Sophie bonds with the three men, and discovers she has a trait from each of them. Things get complicated when all three men agree to give Sophie away, and realizing the mess she created she faints at her own bachelorette party.\r\n\r\nThe next day Sophie runs into Donna who is convinced that she wants the wedding called off. This causes Sophie to yell at Donna, and openly states she wants to avoid all the mistakes Donna has made in her life. At the same time Donna is pursued by Sam, the two realize they still love each other but are too busy for each other. Meanwhile, Tanya is courted by Sky's friend and best man Pepper (Philip Michael) despite the fact that he is old enough to be her son. Sophie then runs to Sky and admits what she did, angry and hurt Sky runs off. At the same time Sam tells Sophie that marriage is not always a happy thing.\r\n\r\nSophie then runs back to her mother and asks her to help her dress for the wedding, Donna is delighted and they mend their relationship. Sophie then learns that Donna was disowned by her mother when she got pregnant, she then proceeds to ask Donna to give her away. Donna happily agrees and as the two prepare to go to the chapel she finds herself accosted by Sam. Sam demands to know why Donna will not explain why she won't talk about their relationship. Donna then says she still loves him despite her better judgement and the fact that he broke her heart by being engaged.\r\n\r\nDonna then proceeds to run into the chapel where the wedding finally begins. As the ceremony begins Donna realizes that she can't hide the fact that the men are there. She then introduces Sophie's dad, but then learns that Sophie invited all three of them. They then all decide to be a third of her father, Sophie surprised decides to call off the wedding. Prompting Sky to run away with her and sail the world. Sam meanwhile decides that the wedding should not go to waste, despite Donna's protest at bigamy. After revealing his divorce Sam pops the question, hesitant Donna accepts it. At the wedding reception Rosie falls in love with Bill, who at first rejects her advances but then ends up loving her too.\r\n\r\nThe movie closes with Donna and Sam alongside Bill and Harry bidding Sophie and Sky farewell as they sail away from Kalokairi. Donna, Tanya and Rosie then reprise _Dancing Queen_ during the end credits, and then the rest of the cast appears and they all sing the song _Waterloo_. The movie then finally ends with Sophie singing _Thank You For the Music_ during the end credits.\r\n\r\nTold using several popular ABBA songs including_ Honey, Honey, Honey_, _Dancing Queen_ and the iconic titular song _Mamma Mia_ this movie soundtrack is responsible for making ABBA's music hit the charts again. Albeit some bad singing (cough)Pierce Brosnan(cough) the soundtrack is wonderful. The movie has some references to other films including _Dirty Dancing_ and _Grease._ Meryl Streep's performance of Donna Sheridan is an amazing example of her versatility especially when she sings the love ballad \"The Winner Takes It All.\" \"S.O.S\" is an interesting scene Brosnan's voice is flat but judging by his body language he is enjoying himself.\r\n\r\nIf you ignore the bad singing, you will be able to enjoy this film. I highly recommend it and the soundtrack. However, due to royalties and disagreements with UNICEF UMG and Decca Records could not secure the rights to the song _Chiquitita_ which explains why it is not on the CD.\r\n\r\nIf you have not seen this movie, then what are you waiting for?! Stream it or buy it and do it before July 20 because that is when it's highly anticipated sequel hits theaters!\r\n\r\n> It's very Greek! - Rosie", "created_at": "2018-07-04T02:30:24.202Z"}, {"movie_id": 11631, "review_id": "62edb55d9369a2007afaea4a", "author_rating": 5.0, "review_text": "**With a good cast and an enviable and appealing soundtrack, the film promised to be excellent… but it turned out to be much more average than I imagined.**\r\n\r\nFirst of all, I think I need to make a note: I can't say that I'm an ABBA fan, but the truth is that I have a great affection for the band and their songs, because they were songs that I remember hearing on TV when I was a kid. It is a childhood memory, which has a sentimental charge, and which cannot be evaluated in a completely neutral way (childhood memories never leave us neutral).\r\n\r\nI have yet to say that I had high expectations for the film. I'm not just talking about the music and the various songs I remember listening to, but also the enormous quality of the cast selected for the project, and the active participation of elements of the former band in the production. It was something that promised to have great quality. Well, the film has its qualities, it's undeniable, but the truth is that I noticed some laziness and sloppiness in the production, in several aspects.\r\n\r\nThe film's biggest problem was the absence of a well-written script that could support the action and songs. In addition to the slew of summer movie clichés, the script copied an old Italian movie called _Buona Sera Mrs. Campbell_, whose action is based on the dubious parenting of the protagonist's daughter, played by Gina Lollobrigida. I cannot say that we are in a situation of plagiarism because there are many films about children that do not know their parents, but the lack of originality is remarkable. Also, the film seems to almost make the apology of sexual promiscuity! In the midst of an uncomplicated, light, “hippie” environment, the film puts the main character’s mother in an embarrassing situation: she is the single mother of a daughter who grew up not knowing her father because there are three possible “candidates”, with whom she got involved almost simultaneously! And I'd rather not talk about that scene where a mature woman flirts with a guy much younger than her!\r\n\r\nJumping from Broadway to Hollywood, Phyllida Lloyd assured a sincere, but not excellent, effort at the direction. She was not able to demand more from her crew, she allowed a very poor conception of the characters and the choice of actors was not at all happy from the moment they had to sing. The best choices were Amanda Seyfried and Meryl Streep, two solid, charismatic, expressive actresses with an excellent voice. The scenes in which the two are protagonists, speaking or singing, are among the best in the film, which was an excellent bet that Seyfried made in her career. Stellan Skarsgard did reasonably well, but I felt he had little to do, and so Colin Firth... in fact, this English actor, whose voice is not particularly pleasant, already seemed to me to be a dubious choice for a musical. However, he looked like an opera diva when compared to Pierce Brosnan or Julie Walters. The ex-Bond has great difficulty with the treble and sings almost in falsetto, and Walters can't sing without starting to scream.\r\n\r\nTechnically, the film isn't brilliant either. On the positive side, we have the elegant cinematography, with the sun, the sea and the scenic beauty of the Greek islands favoring the visuals (we have to agree that the filming locations were wonderfully used), as well as the well-conceived sets and costumes. But the film's strong point is the soundtrack, of course, with an abundant list of ABBA songs, so famous that we can sing the entire movie. However, the insertion of each song in the film leaves a lot to be desired, something that, along with somewhat artificial choreography, leaves us with the feeling that the film is almost a gigantic music video clip, with the script being just an excuse for the songs to appear successively.", "created_at": "2022-08-06T00:27:09.040Z"}, {"movie_id": 11631, "review_id": "5207afdf760ee3630e234173", "author_rating": null, "review_text": "To Mamma Mia! then, a movie easily slipping in past Coyote Ugly as the second-worst film I've ever seen (behind The Rocky Horror Picture Show). My eyes. I can't unsee it.\r\n\r\nFrom what I could gather (and that's not because the plot is difficult - Christ, no - or because I wasn't really paying attention, it's because the film seemed to be not sinking in, not digesting in my brain. I think my brain was trying to reject it, like a foreign object) - an airy-fairy middle-aged bohemian tart (Meryl Streep, The Iron Lady) prances and dances around her primary-coloured villa on an unspecified Greek (I think) island. Her equally airy-fairy \"Barbie Princess\" daughter (Amanda Seyfried, Les Misérables) prances and dances around with her. That seems to be what they do. I mean, for a living, like. They're not on holiday. This is the summation of their lives. Idyllic and unrealistic prancery and dancery, around a villa apparently coloured in by over-enthusiastic first-graders. They have two friends each who escort them everywhere - even to the sh!tter perhaps, I dunno - who exist exclusively to orbit like satellites around this main pair. In fact, everybody in this movie exist purely to serve the life stories of Streep and Seyfried. It's that sort of film, where everybody on-screen is wondering, \"Oh! Will Streep eat a tangerine next? Or a satsuma? Will Seyfried brush her hair with a soft brush, or a slightly-softer-than-that brush? Oh, the agony!\" Anyway, the daughter's getting wed - the next day, I think - to some impossibly perfect young lad (to suit her impossibly perfect everything else), but, oh noes! She never knew who her dad was, because her mum was a dirty old stropper back in the eighties, and they've both been too busy prancing and dancing for two straight decades to even have brought it up, ever! So, who will give her away tomorrow? Oh noes!\r\n\r\nWell she prances and dances her way to her mum's secret diary (with her two conjoined mates, obvs) and, equally \"obvs\", it's all in there. Ta-daa! Except, there are three possible \"daddies\" and of course, they are Colin Firth (The King's Speech), Pierce Brosnan (Goldeneye) and Stellan Skarsgård (Pirates of the Caribbean: Dead Man's Chest). So she invites all three to the wedding under the pretense of being her own mum and of course all three drop whatever they've been doing for twenty years and turbo their way, immediately, to this island, all arriving together, on the same boat, which also belongs to one of them. Hurrah. From there, much \"hilarity\" ensues as the airy-fairy daughter tries to suss which one's her dad while her airy-fairy tart mother spends the rest of the film - with HER conjoined mates, obvs - wondering whether to let Brosnan \"tap dat ass\" one more time.\r\n\r\n**********\r\n\r\nSPOILER ALERT (LIKE ANYONE GIVES A DRY, UNYIELDING BUMPLOP): They don't find out who the daddy is: the three pinhead blokes all agree that they now already love this silly airy-fairy daughter so much that they agree to be one-thirds daddy each. Then, out of the clear ****ing sky, the airy-fairy daughter tells her groom at the altar that the wedding's off, and they should just prance and dance around the world instead. Fantastic! And not to waste a wedding full of perfect ****ing strangers anyway, but Brosnan decides to marry Streep while they're there. Well of course. And Skarsgård hooks up with Julie \"Isn't she dead yet?\" Walters - one of Streep's conjoined mates - and Firth, who as it happens was a left-footer all along who was just experimenting with Streep back in the day, cops off with a waiter in traditional Greek island fashion. Hurrah for everything! Let's have another ABBA song, eh?\r\n\r\n**********\r\n\r\nOh, the ABBA songs. I mean, there are musicals. Then, there are musical musicals. And then, way past any of that, there is Mamma Mia!. A quick Wiki-up shows me that, excluding reprises and a deleted scene, there are twenty songs performed in Mamma Mia!. So, say, four minutes per song, that's eighty minutes. Wiki (again) tells me that the film is 109 minutes in length, so let's knock off ten minutes-worth of credits, and you're looking at eighty minutes of singing in a 99 minute film. That sounds about right. A 19-minute story - a p!ss-poor one, at that - stretched over an hour-and-a-half by the soothing tunes of Agnetha, Benny, Bjorn and Anni-Frid. Looking at those numbers I'm now somewhat impressed that whilst watching this pile of pooey bum-leavings I didn't stand up, lose the plot, smash my house to rubble and wander off to live in the woods as a sasquatch. It was ceaseless. An ABBA song, three lines of dialogue (if you were lucky, which wasn't often), another ABBA song. Over and over. And... well, the songs were all sung in-camera by the actors. And whilst I wouldn't call any of them good singers, they could all at least hold a note (only just in Streep's case, but she managed to stumble over that line).\r\n\r\nAll except Pierce Brosnan.\r\n\r\nOh, Pierce. Pierce! Why didn't someone tell him? Did no one care enough? Is he THAT unlikeable? Why couldn't he hear it himself? I don't want to come across as either xenophobic or stereotypical when I suggest that he sounded like a drunken Irishman preparing to fight, but that IS what he sounded like. And who knows, maybe that's what was really happening with him at that time. He IS an Irishman, perhaps he needed to get good and liquored up before the singing - I know I would - and perhaps he was wondering whether or not to attack the first person on the set who dared laugh. Sounds perfectly plausible.\r\n\r\nAnyway, the whole thing's a travesty, top-to-toe. Most closely resembled one of those straight-to-video Barbie movies, beloved of six-year-old girls and nobody else on the entire planet. If you ever have an opportunity to see it, DO NOT take that opportunity. SPURN that opportunity. Spurn as though your very life depended on it. That's all the advice I can give. Don't do what I did, and watch Mamma Mia!. Only madness lies that way.", "created_at": "2013-08-11T15:38:07.031Z"}, {"movie_id": 11631, "review_id": "5921f2f09251414a5705af2c", "author_rating": 8.0, "review_text": "Really enjoyable film, with a lot of funny one-liners, and despite the fact that a lot of them are rubbish singers, that partly adds to the humour, and obviously, Amanda, Meryl, Colin and others do have good voices :)", "created_at": "2017-05-21T20:05:04.137Z"}, {"movie_id": 11631, "review_id": "5b3c31400e0a2623fb004e20", "author_rating": 8.0, "review_text": "***SPOILERS AHEAD***\r\n\r\n_Mamma Mia!_ is an American-British romantic comedy musical directed by Phyllida Lloyd. The movie is loosely based on the original London musical also directed by Lloyd, and was the brain child of Judy Craymer who was convinced ABBA songs could be used in a theatrical production, especially after hearing the love ballad _The Winner Takes It All_. Craymer along with British playwright Catherine Johnson also worked on this film. Johnson being the original musical's scriptwriter wrote the movie's script, Craymer was an executive producer alongside Gary Goetzman as well as Tom Hanks and Rita Wilson.\r\n\r\nThe film stars Meryl Streep, Pierce Brosnan, Colin Firth, Stellan Skarsgård, Julie Walters, Dominic Cooper, Amanda Seyfried, and Christine Baranski.\r\n\r\nSet on the idyllic Greek island of Kalokairi it tells the story of Donna Sheridan (Streep) an independent manageress and owner of her own hotel. Donna has a 20 year-old daughter by the name of Sophie (Seyfried) who is getting married to Sky (Cooper). Upon finding Donna's old diary Sophie discovers that there were three men: Sam Carmichael (Brosnan), Harry Bright (Firth) and Bill Anderson (Skarsgård) and learns that one of them could be her father. She decides to invite all three of them to her wedding. \r\n\r\nSophie later reveals this to her friends Ali (Rachel MacDowall) and Lisa (Ashley Lilley) who have agreed to be her bridesmaids. Donna has invited her old friends/bandmates Rosie (Walters) and Tanya (Baranski) to the wedding to help her out. She is however completely unaware of what Sophie has done and is taken by surprise when Sam, Harry and Bill arrive on the island. This causes Donna to have a mid-life crisis, and it is up to Rosie and Tanya to lift her spirits. While at the same time Sophie bonds with the three men, and discovers she has a trait from each of them. Things get complicated when all three men agree to give Sophie away, and realizing the mess she created she faints at her own bachelorette party.\r\n\r\nThe next day Sophie runs into Donna who is convinced that she wants the wedding called off. This causes Sophie to yell at Donna, and openly states she wants to avoid all the mistakes Donna has made in her life. At the same time Donna is pursued by Sam, the two realize they still love each other but are too busy for each other. Meanwhile, Tanya is courted by Sky's friend and best man Pepper (Philip Michael) despite the fact that he is old enough to be her son. Sophie then runs to Sky and admits what she did, angry and hurt Sky runs off. At the same time Sam tells Sophie that marriage is not always a happy thing.\r\n\r\nSophie then runs back to her mother and asks her to help her dress for the wedding, Donna is delighted and they mend their relationship. Sophie then learns that Donna was disowned by her mother when she got pregnant, she then proceeds to ask Donna to give her away. Donna happily agrees and as the two prepare to go to the chapel she finds herself accosted by Sam. Sam demands to know why Donna will not explain why she won't talk about their relationship. Donna then says she still loves him despite her better judgement and the fact that he broke her heart by being engaged.\r\n\r\nDonna then proceeds to run into the chapel where the wedding finally begins. As the ceremony begins Donna realizes that she can't hide the fact that the men are there. She then introduces Sophie's dad, but then learns that Sophie invited all three of them. They then all decide to be a third of her father, Sophie surprised decides to call off the wedding. Prompting Sky to run away with her and sail the world. Sam meanwhile decides that the wedding should not go to waste, despite Donna's protest at bigamy. After revealing his divorce Sam pops the question, hesitant Donna accepts it. At the wedding reception Rosie falls in love with Bill, who at first rejects her advances but then ends up loving her too.\r\n\r\nThe movie closes with Donna and Sam alongside Bill and Harry bidding Sophie and Sky farewell as they sail away from Kalokairi. Donna, Tanya and Rosie then reprise _Dancing Queen_ during the end credits, and then the rest of the cast appears and they all sing the song _Waterloo_. The movie then finally ends with Sophie singing _Thank You For the Music_ during the end credits.\r\n\r\nTold using several popular ABBA songs including_ Honey, Honey, Honey_, _Dancing Queen_ and the iconic titular song _Mamma Mia_ this movie soundtrack is responsible for making ABBA's music hit the charts again. Albeit some bad singing (cough)Pierce Brosnan(cough) the soundtrack is wonderful. The movie has some references to other films including _Dirty Dancing_ and _Grease._ Meryl Streep's performance of Donna Sheridan is an amazing example of her versatility especially when she sings the love ballad \"The Winner Takes It All.\" \"S.O.S\" is an interesting scene Brosnan's voice is flat but judging by his body language he is enjoying himself.\r\n\r\nIf you ignore the bad singing, you will be able to enjoy this film. I highly recommend it and the soundtrack. However, due to royalties and disagreements with UNICEF UMG and Decca Records could not secure the rights to the song _Chiquitita_ which explains why it is not on the CD.\r\n\r\nIf you have not seen this movie, then what are you waiting for?! Stream it or buy it and do it before July 20 because that is when it's highly anticipated sequel hits theaters!\r\n\r\n> It's very Greek! - Rosie", "created_at": "2018-07-04T02:30:24.202Z"}, {"movie_id": 11631, "review_id": "62edb55d9369a2007afaea4a", "author_rating": 5.0, "review_text": "**With a good cast and an enviable and appealing soundtrack, the film promised to be excellent… but it turned out to be much more average than I imagined.**\r\n\r\nFirst of all, I think I need to make a note: I can't say that I'm an ABBA fan, but the truth is that I have a great affection for the band and their songs, because they were songs that I remember hearing on TV when I was a kid. It is a childhood memory, which has a sentimental charge, and which cannot be evaluated in a completely neutral way (childhood memories never leave us neutral).\r\n\r\nI have yet to say that I had high expectations for the film. I'm not just talking about the music and the various songs I remember listening to, but also the enormous quality of the cast selected for the project, and the active participation of elements of the former band in the production. It was something that promised to have great quality. Well, the film has its qualities, it's undeniable, but the truth is that I noticed some laziness and sloppiness in the production, in several aspects.\r\n\r\nThe film's biggest problem was the absence of a well-written script that could support the action and songs. In addition to the slew of summer movie clichés, the script copied an old Italian movie called _Buona Sera Mrs. Campbell_, whose action is based on the dubious parenting of the protagonist's daughter, played by Gina Lollobrigida. I cannot say that we are in a situation of plagiarism because there are many films about children that do not know their parents, but the lack of originality is remarkable. Also, the film seems to almost make the apology of sexual promiscuity! In the midst of an uncomplicated, light, “hippie” environment, the film puts the main character’s mother in an embarrassing situation: she is the single mother of a daughter who grew up not knowing her father because there are three possible “candidates”, with whom she got involved almost simultaneously! And I'd rather not talk about that scene where a mature woman flirts with a guy much younger than her!\r\n\r\nJumping from Broadway to Hollywood, Phyllida Lloyd assured a sincere, but not excellent, effort at the direction. She was not able to demand more from her crew, she allowed a very poor conception of the characters and the choice of actors was not at all happy from the moment they had to sing. The best choices were Amanda Seyfried and Meryl Streep, two solid, charismatic, expressive actresses with an excellent voice. The scenes in which the two are protagonists, speaking or singing, are among the best in the film, which was an excellent bet that Seyfried made in her career. Stellan Skarsgard did reasonably well, but I felt he had little to do, and so Colin Firth... in fact, this English actor, whose voice is not particularly pleasant, already seemed to me to be a dubious choice for a musical. However, he looked like an opera diva when compared to Pierce Brosnan or Julie Walters. The ex-Bond has great difficulty with the treble and sings almost in falsetto, and Walters can't sing without starting to scream.\r\n\r\nTechnically, the film isn't brilliant either. On the positive side, we have the elegant cinematography, with the sun, the sea and the scenic beauty of the Greek islands favoring the visuals (we have to agree that the filming locations were wonderfully used), as well as the well-conceived sets and costumes. But the film's strong point is the soundtrack, of course, with an abundant list of ABBA songs, so famous that we can sing the entire movie. However, the insertion of each song in the film leaves a lot to be desired, something that, along with somewhat artificial choreography, leaves us with the feeling that the film is almost a gigantic music video clip, with the script being just an excuse for the songs to appear successively.", "created_at": "2022-08-06T00:27:09.040Z"}]