[{"movie_id": 587792, "review_id": "5eff72de9dee580038d24559", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me for a while, you know I'm not the biggest fan of rom-coms. It's not that I don't like the genre (I appreciate and enjoy every single one), but I find its movies tremendously difficult to *really* love. The massive majority follow the genre's formulas and cliches to such an extent that I rarely end up truly loving one of these films. Some are way too cheesy. Others are way too unrealistic and dream-like. But the aspect that throws me off the most is the lack of originality. I can't remember the last rom-com I watched that didn't borrow from countless other installments. I didn't know a thing about Palm Springs: no trailers, no knowledge of critics/audience's opinion, nothing... And I'm extremely happy about that!\r\n\r\nI usually watch the main trailer for every film I review *after* I've seen the actual movie. I ignore all other trailers, clips, images, and so on. I do this so I can have some sort of knowledge regarding how far I can take my spoiler-free reviews. This way, I'm sure that I don't write about something I shouldn't. The official trailer for this film doesn't ruin the experience in any way, but it does tell its viewers the most relevant aspect of its screenplay. So, I could address it in this review, but I won't... because I enjoyed this movie a lot more, not knowing a thing about it than if I knew how it developed its story.\r\n\r\nTherefore, I'll keep it really vague, and just write that Andy Siara's first feature-film screenplay can easily snatch a couple of nominations when the awards season comes around. This is a rom-com like no other due to its refreshingly unique concept. It's true that it's not an entirely new method of storytelling. Many other movies also employ this idea, but Siara holds so many surprises within his narrative and so few of the genre's common traits that the whole film is elevated by his outstanding writing.\r\n\r\nIt's one of the most entertaining movies of the year. With a short runtime and a fast pace, Palm Springs is constantly being genuinely fun, engaging, and even mysteriously intriguing. Its original plot makes the viewer think and remember previous lines that take a whole different meaning a few minutes later. There are no predictably dumb narrative decisions, and its characters escape the cheesy and forced relationships that these films usually insert them in. The dialogues are hilariously captivating. Almost every single plot point packs an emotional punch, a jaw-dropping revelation that never crossed the viewer's mind.\r\n\r\nAndy Samberg and Cristin Milioti share such great chemistry. Their characters are exceptionally developed, and their relationship feels incredibly real. I'm rarely that viewer who requires the main characters to be together, kiss, fall in love, and all that, but Nyles and Sarah are two wonderful protagonists I can definitely root for. Both carry an interesting \"baggage\", which is also explored at a deep level. They deal very differently with the \"situation\" that the story puts them in, and it's so much fun to watch them go through it and evolve as characters. Oh, and J.K. Simmons (Roy)... this man doesn't know how not to be utterly remarkable!\r\n\r\nMax Barbakow (directorial debut) demonstrates his talents as well, by allowing Siara's screenplay to shine under impeccable direction. Tonally, it never loses its balance. It keeps its comedy pretty grounded, considering the craziness of its premise. It never relies on the genre's formulas, cliches, and cheesy outcomes. It really separates itself from the majority of modern rom-coms. I don't really have any flaws to point out... The ending does have a \"just accept it\" narrative component, and there are a couple of unnecessary scenes, but I'm nitpicking here.\r\n\r\nI can't believe I'm going to write this, but Palm Springs is not only one of the best rom-coms I've ever seen, but it's also one of the best (if not *the* best) movies of 2020, so far. With the help of their first-time director (Max Barbakow), Andy Samberg and Cristin Milioti spread their extraordinary chemistry all over the innovative, original narrative, written by the also debutant, Andy Siara. The latter is undoubtedly the main responsible for such an entertaining film. Siara takes an imaginative concept and develops it in the most captivating, fun, hilarious, and even intriguing way possible. A surprising screenplay packed with emotionally impactful plot points, revelations, and twists that keep the enjoyment levels extremely high. The two protagonists are exceptionally developed, as well as their compelling relationship. With a fast pace and a perfect balance of its tone, Palm Springs sets itself apart from the other movies of the genre, staying away from all of the cliches, formulas, and stereotypes associated with it. J.K. Simmons also lends his awesomeness because why not? Whether you're a fan of rom-coms or not, I definitely suggest giving this one a look. You won't be disappointed!\r\n\r\nRating: A", "created_at": "2020-07-03T18:03:10.275Z"}, {"movie_id": 587792, "review_id": "5f15f01251e6ab0038c560de", "author_rating": null, "review_text": "If you're looking for a wholesome heartwarming movie, This is the movie you're looking for.", "created_at": "2020-07-20T19:27:14.923Z"}, {"movie_id": 587792, "review_id": "5f182e21db952d0035916ebd", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend, especially for fans of \"time shifting\" tropes.\r\n\r\nTime shifting is where your mind goes back in time, but not your body.  Essentially everything resets like a save point, except your have all this knowledge.\r\n\r\n\"Time shifting\" was made popular by \"Groundhog's Day\" and there have been several movies that mainly consist of dying / sleeping and repeating like a video game, and this isn't THAT different with a few exceptions that make all the difference in the experience.\r\n\r\nAndy Samberg (Brooklyn Nine-Nine) finally steps up and shows everyone that he can do a somewhat serious role, and not just a straight man.  Cristin Milioti (How I Met Your Mother) does an excellent job in her lead role, with a great supporting cast, to include J.K. Simmons (Cave Johnson) leading a wonderful supporting cast, except for Tyler Hoechlin (CW Superman: \"Supergirl\", \"Flash\", etc.), who I might just not like because he was Superman, but it's supposed to be an disliked character...so....good job?\r\n\r\nThe medium of the transfer being shown is an interesting option as we saw in the \"Happy Death Day\" movies, but it does allow for a reasoning of how it works, can it be broken / manipulated as opposed to divine will.  Most importantly, it allows for more than just one subject being affected, which is really where it gets set apart.\r\n\r\nThe trope bleeds a little when you have multiple people trapped in the loop: you have multiple people trapped in a thing: you have multiple people trapped in a prison.  When multiple people are trapped in a environment together, they tend to get a little strange, and we get that sort of thing a plenty.  Because we have multiple story threads to follow, we're almost seeing 3 stories all overlapping, and the movie does a great job of showing those, whether or not their in chronological order, or happening at the same time.\r\n\r\nWhether you see it as a prison break movie, or a time loop movie, this movie has a lot of fun in it, along with deep metaphysical philosophy, so there is something for everyone.", "created_at": "2020-07-22T12:16:33.276Z"}, {"movie_id": 587792, "review_id": "5f2b1ce6d8cc4a0038210f5e", "author_rating": 7.0, "review_text": "This is a reimagining of Groundhog Day, but I think it stands pretty well on its own merits. Groundhog Day did not attempt to explain what was going on, but in Palm Springs, some talk of physics and what might happen if they tried - well, never mind. Who am I to give anything away?\r\n\r\nThe plot is more complicated than it seemed, and that is a good thing. There is humor, of course, and good chemistry between the two leads, I thought. There was enough difference between each of the replays of the day that it didn’t feel like, here we go again with 90% of the same stuff happening with a slight change thrown in.\r\n\r\nSo it was an entertaining movie overall. It isn’t one that I will watch multiple times, but if the opportunity arises to watch it again, say with someone who hasn’t seen it, I wouldn’t hesitate. We all love to spoil movies for people by telling them what is coming up! (Just kidding. I don’t like it when it is done to me, so I just sit and let them experience it the same way I did.)", "created_at": "2020-08-05T20:56:06.544Z"}, {"movie_id": 587792, "review_id": "5f4d2700c392660037d5c683", "author_rating": 6.0, "review_text": "The multi-genre “Palm Springs” is an oddball, sci-fi rom-com about loneliness and love, a thoughtful story of existential consternation with a sharp-witted joke library. The film, written by Andy Siara and directed by Max Barbakow, is a weird hipster version of “Groundhog Day,” with a story about two semi-dorks stuck in an infinite loop where they must relive the same sunrise to sunset over and over again.\r\n\r\nNovember 9th is the perfect date for a Palm Springs destination wedding, and Sarah (Cristin Milioti) is there for her younger sister’s big day. The elder sibling has a real chip on her shoulder, reluctant to serve as the maid of honor and not a big fan of formal events. At the reception, she meets Nyles (Andy Samberg), a carefree dude who is trapped with his shallow, cheating, bridesmaid girlfriend Misty (Meredith Hagner).\r\n\r\nSarah and Nyles hit it off with their shared offbeat sense of humor, and the duo sneak off into the desert for a late-night rendezvous. Something really, really weird interrupts their plans, turning the two into a powerhouse of cynical anarchy when they discover they’re able to endlessly reprise that day.\r\n\r\nIt’s a fun idea that’s given a refresh with smart-aleck humor from Milioti and Samberg. They’re a charismatic pair, even if they’re not the easiest couple to root for. The film has a jaded, “too cool for school” angle that may turn off some viewers, but it tries to remain lighthearted. An all-too-brief supporting turn from J.K. Simmons adds a bizarre but unexpectedly touching side plot, lending a lot of heart to the story.\r\n\r\nAs is the case with many films that premiere at Sundance, “Palm Springs” doesn’t come close to living up to the initial film festival audience reaction. The dark comedy is entertaining, but it’s not as funny as it could be, and it’s not as clever as it wishes it was.", "created_at": "2020-08-31T16:36:16.722Z"}, {"movie_id": 587792, "review_id": "62bdf9009bcd0f0051dbaf15", "author_rating": 9.0, "review_text": "Palm Springs puts a new spin on the old time loop story, and I am surprised at how well it works. Andy Samberg is fantastic as ever and shows off a little more acting chops than I give him credit for with the more emotional scenes in the film. The chemistry that he and Christin Milloti share is spectacular and felt so incredibly genuine. I felt so many things during this movie ranging from happiness, sadness, and laughter, it really takes you for a ride and it is such a fantastic one at that. This is such an underrated film and I cannot recommend this enough.\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-06-30T19:26:56.939Z"}, {"movie_id": 587792, "review_id": "5eff72de9dee580038d24559", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me for a while, you know I'm not the biggest fan of rom-coms. It's not that I don't like the genre (I appreciate and enjoy every single one), but I find its movies tremendously difficult to *really* love. The massive majority follow the genre's formulas and cliches to such an extent that I rarely end up truly loving one of these films. Some are way too cheesy. Others are way too unrealistic and dream-like. But the aspect that throws me off the most is the lack of originality. I can't remember the last rom-com I watched that didn't borrow from countless other installments. I didn't know a thing about Palm Springs: no trailers, no knowledge of critics/audience's opinion, nothing... And I'm extremely happy about that!\r\n\r\nI usually watch the main trailer for every film I review *after* I've seen the actual movie. I ignore all other trailers, clips, images, and so on. I do this so I can have some sort of knowledge regarding how far I can take my spoiler-free reviews. This way, I'm sure that I don't write about something I shouldn't. The official trailer for this film doesn't ruin the experience in any way, but it does tell its viewers the most relevant aspect of its screenplay. So, I could address it in this review, but I won't... because I enjoyed this movie a lot more, not knowing a thing about it than if I knew how it developed its story.\r\n\r\nTherefore, I'll keep it really vague, and just write that Andy Siara's first feature-film screenplay can easily snatch a couple of nominations when the awards season comes around. This is a rom-com like no other due to its refreshingly unique concept. It's true that it's not an entirely new method of storytelling. Many other movies also employ this idea, but Siara holds so many surprises within his narrative and so few of the genre's common traits that the whole film is elevated by his outstanding writing.\r\n\r\nIt's one of the most entertaining movies of the year. With a short runtime and a fast pace, Palm Springs is constantly being genuinely fun, engaging, and even mysteriously intriguing. Its original plot makes the viewer think and remember previous lines that take a whole different meaning a few minutes later. There are no predictably dumb narrative decisions, and its characters escape the cheesy and forced relationships that these films usually insert them in. The dialogues are hilariously captivating. Almost every single plot point packs an emotional punch, a jaw-dropping revelation that never crossed the viewer's mind.\r\n\r\nAndy Samberg and Cristin Milioti share such great chemistry. Their characters are exceptionally developed, and their relationship feels incredibly real. I'm rarely that viewer who requires the main characters to be together, kiss, fall in love, and all that, but Nyles and Sarah are two wonderful protagonists I can definitely root for. Both carry an interesting \"baggage\", which is also explored at a deep level. They deal very differently with the \"situation\" that the story puts them in, and it's so much fun to watch them go through it and evolve as characters. Oh, and J.K. Simmons (Roy)... this man doesn't know how not to be utterly remarkable!\r\n\r\nMax Barbakow (directorial debut) demonstrates his talents as well, by allowing Siara's screenplay to shine under impeccable direction. Tonally, it never loses its balance. It keeps its comedy pretty grounded, considering the craziness of its premise. It never relies on the genre's formulas, cliches, and cheesy outcomes. It really separates itself from the majority of modern rom-coms. I don't really have any flaws to point out... The ending does have a \"just accept it\" narrative component, and there are a couple of unnecessary scenes, but I'm nitpicking here.\r\n\r\nI can't believe I'm going to write this, but Palm Springs is not only one of the best rom-coms I've ever seen, but it's also one of the best (if not *the* best) movies of 2020, so far. With the help of their first-time director (Max Barbakow), Andy Samberg and Cristin Milioti spread their extraordinary chemistry all over the innovative, original narrative, written by the also debutant, Andy Siara. The latter is undoubtedly the main responsible for such an entertaining film. Siara takes an imaginative concept and develops it in the most captivating, fun, hilarious, and even intriguing way possible. A surprising screenplay packed with emotionally impactful plot points, revelations, and twists that keep the enjoyment levels extremely high. The two protagonists are exceptionally developed, as well as their compelling relationship. With a fast pace and a perfect balance of its tone, Palm Springs sets itself apart from the other movies of the genre, staying away from all of the cliches, formulas, and stereotypes associated with it. J.K. Simmons also lends his awesomeness because why not? Whether you're a fan of rom-coms or not, I definitely suggest giving this one a look. You won't be disappointed!\r\n\r\nRating: A", "created_at": "2020-07-03T18:03:10.275Z"}, {"movie_id": 587792, "review_id": "5f15f01251e6ab0038c560de", "author_rating": null, "review_text": "If you're looking for a wholesome heartwarming movie, This is the movie you're looking for.", "created_at": "2020-07-20T19:27:14.923Z"}, {"movie_id": 587792, "review_id": "5f182e21db952d0035916ebd", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend, especially for fans of \"time shifting\" tropes.\r\n\r\nTime shifting is where your mind goes back in time, but not your body.  Essentially everything resets like a save point, except your have all this knowledge.\r\n\r\n\"Time shifting\" was made popular by \"Groundhog's Day\" and there have been several movies that mainly consist of dying / sleeping and repeating like a video game, and this isn't THAT different with a few exceptions that make all the difference in the experience.\r\n\r\nAndy Samberg (Brooklyn Nine-Nine) finally steps up and shows everyone that he can do a somewhat serious role, and not just a straight man.  Cristin Milioti (How I Met Your Mother) does an excellent job in her lead role, with a great supporting cast, to include J.K. Simmons (Cave Johnson) leading a wonderful supporting cast, except for Tyler Hoechlin (CW Superman: \"Supergirl\", \"Flash\", etc.), who I might just not like because he was Superman, but it's supposed to be an disliked character...so....good job?\r\n\r\nThe medium of the transfer being shown is an interesting option as we saw in the \"Happy Death Day\" movies, but it does allow for a reasoning of how it works, can it be broken / manipulated as opposed to divine will.  Most importantly, it allows for more than just one subject being affected, which is really where it gets set apart.\r\n\r\nThe trope bleeds a little when you have multiple people trapped in the loop: you have multiple people trapped in a thing: you have multiple people trapped in a prison.  When multiple people are trapped in a environment together, they tend to get a little strange, and we get that sort of thing a plenty.  Because we have multiple story threads to follow, we're almost seeing 3 stories all overlapping, and the movie does a great job of showing those, whether or not their in chronological order, or happening at the same time.\r\n\r\nWhether you see it as a prison break movie, or a time loop movie, this movie has a lot of fun in it, along with deep metaphysical philosophy, so there is something for everyone.", "created_at": "2020-07-22T12:16:33.276Z"}, {"movie_id": 587792, "review_id": "5f2b1ce6d8cc4a0038210f5e", "author_rating": 7.0, "review_text": "This is a reimagining of Groundhog Day, but I think it stands pretty well on its own merits. Groundhog Day did not attempt to explain what was going on, but in Palm Springs, some talk of physics and what might happen if they tried - well, never mind. Who am I to give anything away?\r\n\r\nThe plot is more complicated than it seemed, and that is a good thing. There is humor, of course, and good chemistry between the two leads, I thought. There was enough difference between each of the replays of the day that it didn’t feel like, here we go again with 90% of the same stuff happening with a slight change thrown in.\r\n\r\nSo it was an entertaining movie overall. It isn’t one that I will watch multiple times, but if the opportunity arises to watch it again, say with someone who hasn’t seen it, I wouldn’t hesitate. We all love to spoil movies for people by telling them what is coming up! (Just kidding. I don’t like it when it is done to me, so I just sit and let them experience it the same way I did.)", "created_at": "2020-08-05T20:56:06.544Z"}, {"movie_id": 587792, "review_id": "5f4d2700c392660037d5c683", "author_rating": 6.0, "review_text": "The multi-genre “Palm Springs” is an oddball, sci-fi rom-com about loneliness and love, a thoughtful story of existential consternation with a sharp-witted joke library. The film, written by Andy Siara and directed by Max Barbakow, is a weird hipster version of “Groundhog Day,” with a story about two semi-dorks stuck in an infinite loop where they must relive the same sunrise to sunset over and over again.\r\n\r\nNovember 9th is the perfect date for a Palm Springs destination wedding, and Sarah (Cristin Milioti) is there for her younger sister’s big day. The elder sibling has a real chip on her shoulder, reluctant to serve as the maid of honor and not a big fan of formal events. At the reception, she meets Nyles (Andy Samberg), a carefree dude who is trapped with his shallow, cheating, bridesmaid girlfriend Misty (Meredith Hagner).\r\n\r\nSarah and Nyles hit it off with their shared offbeat sense of humor, and the duo sneak off into the desert for a late-night rendezvous. Something really, really weird interrupts their plans, turning the two into a powerhouse of cynical anarchy when they discover they’re able to endlessly reprise that day.\r\n\r\nIt’s a fun idea that’s given a refresh with smart-aleck humor from Milioti and Samberg. They’re a charismatic pair, even if they’re not the easiest couple to root for. The film has a jaded, “too cool for school” angle that may turn off some viewers, but it tries to remain lighthearted. An all-too-brief supporting turn from J.K. Simmons adds a bizarre but unexpectedly touching side plot, lending a lot of heart to the story.\r\n\r\nAs is the case with many films that premiere at Sundance, “Palm Springs” doesn’t come close to living up to the initial film festival audience reaction. The dark comedy is entertaining, but it’s not as funny as it could be, and it’s not as clever as it wishes it was.", "created_at": "2020-08-31T16:36:16.722Z"}, {"movie_id": 587792, "review_id": "62bdf9009bcd0f0051dbaf15", "author_rating": 9.0, "review_text": "Palm Springs puts a new spin on the old time loop story, and I am surprised at how well it works. Andy Samberg is fantastic as ever and shows off a little more acting chops than I give him credit for with the more emotional scenes in the film. The chemistry that he and Christin Milloti share is spectacular and felt so incredibly genuine. I felt so many things during this movie ranging from happiness, sadness, and laughter, it really takes you for a ride and it is such a fantastic one at that. This is such an underrated film and I cannot recommend this enough.\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-06-30T19:26:56.939Z"}, {"movie_id": 587792, "review_id": "5eff72de9dee580038d24559", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me for a while, you know I'm not the biggest fan of rom-coms. It's not that I don't like the genre (I appreciate and enjoy every single one), but I find its movies tremendously difficult to *really* love. The massive majority follow the genre's formulas and cliches to such an extent that I rarely end up truly loving one of these films. Some are way too cheesy. Others are way too unrealistic and dream-like. But the aspect that throws me off the most is the lack of originality. I can't remember the last rom-com I watched that didn't borrow from countless other installments. I didn't know a thing about Palm Springs: no trailers, no knowledge of critics/audience's opinion, nothing... And I'm extremely happy about that!\r\n\r\nI usually watch the main trailer for every film I review *after* I've seen the actual movie. I ignore all other trailers, clips, images, and so on. I do this so I can have some sort of knowledge regarding how far I can take my spoiler-free reviews. This way, I'm sure that I don't write about something I shouldn't. The official trailer for this film doesn't ruin the experience in any way, but it does tell its viewers the most relevant aspect of its screenplay. So, I could address it in this review, but I won't... because I enjoyed this movie a lot more, not knowing a thing about it than if I knew how it developed its story.\r\n\r\nTherefore, I'll keep it really vague, and just write that Andy Siara's first feature-film screenplay can easily snatch a couple of nominations when the awards season comes around. This is a rom-com like no other due to its refreshingly unique concept. It's true that it's not an entirely new method of storytelling. Many other movies also employ this idea, but Siara holds so many surprises within his narrative and so few of the genre's common traits that the whole film is elevated by his outstanding writing.\r\n\r\nIt's one of the most entertaining movies of the year. With a short runtime and a fast pace, Palm Springs is constantly being genuinely fun, engaging, and even mysteriously intriguing. Its original plot makes the viewer think and remember previous lines that take a whole different meaning a few minutes later. There are no predictably dumb narrative decisions, and its characters escape the cheesy and forced relationships that these films usually insert them in. The dialogues are hilariously captivating. Almost every single plot point packs an emotional punch, a jaw-dropping revelation that never crossed the viewer's mind.\r\n\r\nAndy Samberg and Cristin Milioti share such great chemistry. Their characters are exceptionally developed, and their relationship feels incredibly real. I'm rarely that viewer who requires the main characters to be together, kiss, fall in love, and all that, but Nyles and Sarah are two wonderful protagonists I can definitely root for. Both carry an interesting \"baggage\", which is also explored at a deep level. They deal very differently with the \"situation\" that the story puts them in, and it's so much fun to watch them go through it and evolve as characters. Oh, and J.K. Simmons (Roy)... this man doesn't know how not to be utterly remarkable!\r\n\r\nMax Barbakow (directorial debut) demonstrates his talents as well, by allowing Siara's screenplay to shine under impeccable direction. Tonally, it never loses its balance. It keeps its comedy pretty grounded, considering the craziness of its premise. It never relies on the genre's formulas, cliches, and cheesy outcomes. It really separates itself from the majority of modern rom-coms. I don't really have any flaws to point out... The ending does have a \"just accept it\" narrative component, and there are a couple of unnecessary scenes, but I'm nitpicking here.\r\n\r\nI can't believe I'm going to write this, but Palm Springs is not only one of the best rom-coms I've ever seen, but it's also one of the best (if not *the* best) movies of 2020, so far. With the help of their first-time director (Max Barbakow), Andy Samberg and Cristin Milioti spread their extraordinary chemistry all over the innovative, original narrative, written by the also debutant, Andy Siara. The latter is undoubtedly the main responsible for such an entertaining film. Siara takes an imaginative concept and develops it in the most captivating, fun, hilarious, and even intriguing way possible. A surprising screenplay packed with emotionally impactful plot points, revelations, and twists that keep the enjoyment levels extremely high. The two protagonists are exceptionally developed, as well as their compelling relationship. With a fast pace and a perfect balance of its tone, Palm Springs sets itself apart from the other movies of the genre, staying away from all of the cliches, formulas, and stereotypes associated with it. J.K. Simmons also lends his awesomeness because why not? Whether you're a fan of rom-coms or not, I definitely suggest giving this one a look. You won't be disappointed!\r\n\r\nRating: A", "created_at": "2020-07-03T18:03:10.275Z"}, {"movie_id": 587792, "review_id": "5f15f01251e6ab0038c560de", "author_rating": null, "review_text": "If you're looking for a wholesome heartwarming movie, This is the movie you're looking for.", "created_at": "2020-07-20T19:27:14.923Z"}, {"movie_id": 587792, "review_id": "5f182e21db952d0035916ebd", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend, especially for fans of \"time shifting\" tropes.\r\n\r\nTime shifting is where your mind goes back in time, but not your body.  Essentially everything resets like a save point, except your have all this knowledge.\r\n\r\n\"Time shifting\" was made popular by \"Groundhog's Day\" and there have been several movies that mainly consist of dying / sleeping and repeating like a video game, and this isn't THAT different with a few exceptions that make all the difference in the experience.\r\n\r\nAndy Samberg (Brooklyn Nine-Nine) finally steps up and shows everyone that he can do a somewhat serious role, and not just a straight man.  Cristin Milioti (How I Met Your Mother) does an excellent job in her lead role, with a great supporting cast, to include J.K. Simmons (Cave Johnson) leading a wonderful supporting cast, except for Tyler Hoechlin (CW Superman: \"Supergirl\", \"Flash\", etc.), who I might just not like because he was Superman, but it's supposed to be an disliked character...so....good job?\r\n\r\nThe medium of the transfer being shown is an interesting option as we saw in the \"Happy Death Day\" movies, but it does allow for a reasoning of how it works, can it be broken / manipulated as opposed to divine will.  Most importantly, it allows for more than just one subject being affected, which is really where it gets set apart.\r\n\r\nThe trope bleeds a little when you have multiple people trapped in the loop: you have multiple people trapped in a thing: you have multiple people trapped in a prison.  When multiple people are trapped in a environment together, they tend to get a little strange, and we get that sort of thing a plenty.  Because we have multiple story threads to follow, we're almost seeing 3 stories all overlapping, and the movie does a great job of showing those, whether or not their in chronological order, or happening at the same time.\r\n\r\nWhether you see it as a prison break movie, or a time loop movie, this movie has a lot of fun in it, along with deep metaphysical philosophy, so there is something for everyone.", "created_at": "2020-07-22T12:16:33.276Z"}, {"movie_id": 587792, "review_id": "5f2b1ce6d8cc4a0038210f5e", "author_rating": 7.0, "review_text": "This is a reimagining of Groundhog Day, but I think it stands pretty well on its own merits. Groundhog Day did not attempt to explain what was going on, but in Palm Springs, some talk of physics and what might happen if they tried - well, never mind. Who am I to give anything away?\r\n\r\nThe plot is more complicated than it seemed, and that is a good thing. There is humor, of course, and good chemistry between the two leads, I thought. There was enough difference between each of the replays of the day that it didn’t feel like, here we go again with 90% of the same stuff happening with a slight change thrown in.\r\n\r\nSo it was an entertaining movie overall. It isn’t one that I will watch multiple times, but if the opportunity arises to watch it again, say with someone who hasn’t seen it, I wouldn’t hesitate. We all love to spoil movies for people by telling them what is coming up! (Just kidding. I don’t like it when it is done to me, so I just sit and let them experience it the same way I did.)", "created_at": "2020-08-05T20:56:06.544Z"}, {"movie_id": 587792, "review_id": "5f4d2700c392660037d5c683", "author_rating": 6.0, "review_text": "The multi-genre “Palm Springs” is an oddball, sci-fi rom-com about loneliness and love, a thoughtful story of existential consternation with a sharp-witted joke library. The film, written by Andy Siara and directed by Max Barbakow, is a weird hipster version of “Groundhog Day,” with a story about two semi-dorks stuck in an infinite loop where they must relive the same sunrise to sunset over and over again.\r\n\r\nNovember 9th is the perfect date for a Palm Springs destination wedding, and Sarah (Cristin Milioti) is there for her younger sister’s big day. The elder sibling has a real chip on her shoulder, reluctant to serve as the maid of honor and not a big fan of formal events. At the reception, she meets Nyles (Andy Samberg), a carefree dude who is trapped with his shallow, cheating, bridesmaid girlfriend Misty (Meredith Hagner).\r\n\r\nSarah and Nyles hit it off with their shared offbeat sense of humor, and the duo sneak off into the desert for a late-night rendezvous. Something really, really weird interrupts their plans, turning the two into a powerhouse of cynical anarchy when they discover they’re able to endlessly reprise that day.\r\n\r\nIt’s a fun idea that’s given a refresh with smart-aleck humor from Milioti and Samberg. They’re a charismatic pair, even if they’re not the easiest couple to root for. The film has a jaded, “too cool for school” angle that may turn off some viewers, but it tries to remain lighthearted. An all-too-brief supporting turn from J.K. Simmons adds a bizarre but unexpectedly touching side plot, lending a lot of heart to the story.\r\n\r\nAs is the case with many films that premiere at Sundance, “Palm Springs” doesn’t come close to living up to the initial film festival audience reaction. The dark comedy is entertaining, but it’s not as funny as it could be, and it’s not as clever as it wishes it was.", "created_at": "2020-08-31T16:36:16.722Z"}, {"movie_id": 587792, "review_id": "62bdf9009bcd0f0051dbaf15", "author_rating": 9.0, "review_text": "Palm Springs puts a new spin on the old time loop story, and I am surprised at how well it works. Andy Samberg is fantastic as ever and shows off a little more acting chops than I give him credit for with the more emotional scenes in the film. The chemistry that he and Christin Milloti share is spectacular and felt so incredibly genuine. I felt so many things during this movie ranging from happiness, sadness, and laughter, it really takes you for a ride and it is such a fantastic one at that. This is such an underrated film and I cannot recommend this enough.\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-06-30T19:26:56.939Z"}, {"movie_id": 587792, "review_id": "5eff72de9dee580038d24559", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you've been following me for a while, you know I'm not the biggest fan of rom-coms. It's not that I don't like the genre (I appreciate and enjoy every single one), but I find its movies tremendously difficult to *really* love. The massive majority follow the genre's formulas and cliches to such an extent that I rarely end up truly loving one of these films. Some are way too cheesy. Others are way too unrealistic and dream-like. But the aspect that throws me off the most is the lack of originality. I can't remember the last rom-com I watched that didn't borrow from countless other installments. I didn't know a thing about Palm Springs: no trailers, no knowledge of critics/audience's opinion, nothing... And I'm extremely happy about that!\r\n\r\nI usually watch the main trailer for every film I review *after* I've seen the actual movie. I ignore all other trailers, clips, images, and so on. I do this so I can have some sort of knowledge regarding how far I can take my spoiler-free reviews. This way, I'm sure that I don't write about something I shouldn't. The official trailer for this film doesn't ruin the experience in any way, but it does tell its viewers the most relevant aspect of its screenplay. So, I could address it in this review, but I won't... because I enjoyed this movie a lot more, not knowing a thing about it than if I knew how it developed its story.\r\n\r\nTherefore, I'll keep it really vague, and just write that Andy Siara's first feature-film screenplay can easily snatch a couple of nominations when the awards season comes around. This is a rom-com like no other due to its refreshingly unique concept. It's true that it's not an entirely new method of storytelling. Many other movies also employ this idea, but Siara holds so many surprises within his narrative and so few of the genre's common traits that the whole film is elevated by his outstanding writing.\r\n\r\nIt's one of the most entertaining movies of the year. With a short runtime and a fast pace, Palm Springs is constantly being genuinely fun, engaging, and even mysteriously intriguing. Its original plot makes the viewer think and remember previous lines that take a whole different meaning a few minutes later. There are no predictably dumb narrative decisions, and its characters escape the cheesy and forced relationships that these films usually insert them in. The dialogues are hilariously captivating. Almost every single plot point packs an emotional punch, a jaw-dropping revelation that never crossed the viewer's mind.\r\n\r\nAndy Samberg and Cristin Milioti share such great chemistry. Their characters are exceptionally developed, and their relationship feels incredibly real. I'm rarely that viewer who requires the main characters to be together, kiss, fall in love, and all that, but Nyles and Sarah are two wonderful protagonists I can definitely root for. Both carry an interesting \"baggage\", which is also explored at a deep level. They deal very differently with the \"situation\" that the story puts them in, and it's so much fun to watch them go through it and evolve as characters. Oh, and J.K. Simmons (Roy)... this man doesn't know how not to be utterly remarkable!\r\n\r\nMax Barbakow (directorial debut) demonstrates his talents as well, by allowing Siara's screenplay to shine under impeccable direction. Tonally, it never loses its balance. It keeps its comedy pretty grounded, considering the craziness of its premise. It never relies on the genre's formulas, cliches, and cheesy outcomes. It really separates itself from the majority of modern rom-coms. I don't really have any flaws to point out... The ending does have a \"just accept it\" narrative component, and there are a couple of unnecessary scenes, but I'm nitpicking here.\r\n\r\nI can't believe I'm going to write this, but Palm Springs is not only one of the best rom-coms I've ever seen, but it's also one of the best (if not *the* best) movies of 2020, so far. With the help of their first-time director (Max Barbakow), Andy Samberg and Cristin Milioti spread their extraordinary chemistry all over the innovative, original narrative, written by the also debutant, Andy Siara. The latter is undoubtedly the main responsible for such an entertaining film. Siara takes an imaginative concept and develops it in the most captivating, fun, hilarious, and even intriguing way possible. A surprising screenplay packed with emotionally impactful plot points, revelations, and twists that keep the enjoyment levels extremely high. The two protagonists are exceptionally developed, as well as their compelling relationship. With a fast pace and a perfect balance of its tone, Palm Springs sets itself apart from the other movies of the genre, staying away from all of the cliches, formulas, and stereotypes associated with it. J.K. Simmons also lends his awesomeness because why not? Whether you're a fan of rom-coms or not, I definitely suggest giving this one a look. You won't be disappointed!\r\n\r\nRating: A", "created_at": "2020-07-03T18:03:10.275Z"}, {"movie_id": 587792, "review_id": "5f15f01251e6ab0038c560de", "author_rating": null, "review_text": "If you're looking for a wholesome heartwarming movie, This is the movie you're looking for.", "created_at": "2020-07-20T19:27:14.923Z"}, {"movie_id": 587792, "review_id": "5f182e21db952d0035916ebd", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend, especially for fans of \"time shifting\" tropes.\r\n\r\nTime shifting is where your mind goes back in time, but not your body.  Essentially everything resets like a save point, except your have all this knowledge.\r\n\r\n\"Time shifting\" was made popular by \"Groundhog's Day\" and there have been several movies that mainly consist of dying / sleeping and repeating like a video game, and this isn't THAT different with a few exceptions that make all the difference in the experience.\r\n\r\nAndy Samberg (Brooklyn Nine-Nine) finally steps up and shows everyone that he can do a somewhat serious role, and not just a straight man.  Cristin Milioti (How I Met Your Mother) does an excellent job in her lead role, with a great supporting cast, to include J.K. Simmons (Cave Johnson) leading a wonderful supporting cast, except for Tyler Hoechlin (CW Superman: \"Supergirl\", \"Flash\", etc.), who I might just not like because he was Superman, but it's supposed to be an disliked character...so....good job?\r\n\r\nThe medium of the transfer being shown is an interesting option as we saw in the \"Happy Death Day\" movies, but it does allow for a reasoning of how it works, can it be broken / manipulated as opposed to divine will.  Most importantly, it allows for more than just one subject being affected, which is really where it gets set apart.\r\n\r\nThe trope bleeds a little when you have multiple people trapped in the loop: you have multiple people trapped in a thing: you have multiple people trapped in a prison.  When multiple people are trapped in a environment together, they tend to get a little strange, and we get that sort of thing a plenty.  Because we have multiple story threads to follow, we're almost seeing 3 stories all overlapping, and the movie does a great job of showing those, whether or not their in chronological order, or happening at the same time.\r\n\r\nWhether you see it as a prison break movie, or a time loop movie, this movie has a lot of fun in it, along with deep metaphysical philosophy, so there is something for everyone.", "created_at": "2020-07-22T12:16:33.276Z"}, {"movie_id": 587792, "review_id": "5f2b1ce6d8cc4a0038210f5e", "author_rating": 7.0, "review_text": "This is a reimagining of Groundhog Day, but I think it stands pretty well on its own merits. Groundhog Day did not attempt to explain what was going on, but in Palm Springs, some talk of physics and what might happen if they tried - well, never mind. Who am I to give anything away?\r\n\r\nThe plot is more complicated than it seemed, and that is a good thing. There is humor, of course, and good chemistry between the two leads, I thought. There was enough difference between each of the replays of the day that it didn’t feel like, here we go again with 90% of the same stuff happening with a slight change thrown in.\r\n\r\nSo it was an entertaining movie overall. It isn’t one that I will watch multiple times, but if the opportunity arises to watch it again, say with someone who hasn’t seen it, I wouldn’t hesitate. We all love to spoil movies for people by telling them what is coming up! (Just kidding. I don’t like it when it is done to me, so I just sit and let them experience it the same way I did.)", "created_at": "2020-08-05T20:56:06.544Z"}, {"movie_id": 587792, "review_id": "5f4d2700c392660037d5c683", "author_rating": 6.0, "review_text": "The multi-genre “Palm Springs” is an oddball, sci-fi rom-com about loneliness and love, a thoughtful story of existential consternation with a sharp-witted joke library. The film, written by Andy Siara and directed by Max Barbakow, is a weird hipster version of “Groundhog Day,” with a story about two semi-dorks stuck in an infinite loop where they must relive the same sunrise to sunset over and over again.\r\n\r\nNovember 9th is the perfect date for a Palm Springs destination wedding, and Sarah (Cristin Milioti) is there for her younger sister’s big day. The elder sibling has a real chip on her shoulder, reluctant to serve as the maid of honor and not a big fan of formal events. At the reception, she meets Nyles (Andy Samberg), a carefree dude who is trapped with his shallow, cheating, bridesmaid girlfriend Misty (Meredith Hagner).\r\n\r\nSarah and Nyles hit it off with their shared offbeat sense of humor, and the duo sneak off into the desert for a late-night rendezvous. Something really, really weird interrupts their plans, turning the two into a powerhouse of cynical anarchy when they discover they’re able to endlessly reprise that day.\r\n\r\nIt’s a fun idea that’s given a refresh with smart-aleck humor from Milioti and Samberg. They’re a charismatic pair, even if they’re not the easiest couple to root for. The film has a jaded, “too cool for school” angle that may turn off some viewers, but it tries to remain lighthearted. An all-too-brief supporting turn from J.K. Simmons adds a bizarre but unexpectedly touching side plot, lending a lot of heart to the story.\r\n\r\nAs is the case with many films that premiere at Sundance, “Palm Springs” doesn’t come close to living up to the initial film festival audience reaction. The dark comedy is entertaining, but it’s not as funny as it could be, and it’s not as clever as it wishes it was.", "created_at": "2020-08-31T16:36:16.722Z"}, {"movie_id": 587792, "review_id": "62bdf9009bcd0f0051dbaf15", "author_rating": 9.0, "review_text": "Palm Springs puts a new spin on the old time loop story, and I am surprised at how well it works. Andy Samberg is fantastic as ever and shows off a little more acting chops than I give him credit for with the more emotional scenes in the film. The chemistry that he and Christin Milloti share is spectacular and felt so incredibly genuine. I felt so many things during this movie ranging from happiness, sadness, and laughter, it really takes you for a ride and it is such a fantastic one at that. This is such an underrated film and I cannot recommend this enough.\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-06-30T19:26:56.939Z"}]