[{"movie_id": 17473, "review_id": "5a45a517c3a36858e4065b8b", "author_rating": 1.0, "review_text": "Everybody knows _The Room_ is bad. That's like, the whole thing. But anybody who says its badness is self-aware is a liar. It's regular bad. It's regular fucking awful. Genuinely, the movies my peers in film class were making when I was **fifteen** are better than _The Room_. Before you say it, yes I did watch The Room in a group, and no I didn't enjoy it.\r\n\r\n_Final rating:½ - So bad it’s offensive. I may never fully recover._", "created_at": "2017-12-29T02:14:47.492Z"}, {"movie_id": 17473, "review_id": "5b8d93c80e0a261d70053508", "author_rating": null, "review_text": "After seeing the Disaster Artist, I had to see this movie! HORRIBLE! Laughing my ass off but HORRIBLE! Good for you Tommy! Live thendream!!! Still laughing that I'm really watching this! Kind of like a porn movie without the porn!!!", "created_at": "2018-09-03T20:04:24.289Z"}, {"movie_id": 17473, "review_id": "602b2412a336120041086a09", "author_rating": 2.0, "review_text": "Brought to us by Wiseau-Films working with Chloe Productions and TPW Films is probably one of the worst films I have seen recently as I have discussed the film with others in my own podcast on Inside Movies Galore and I’m still on the fence whether I actually like the film. I watched this film twice once for my podcast and once for another that is enough and I will probably never watch this film again in my life if I don’t have to.\r\n\r\nThis is Tommy Wiseau’s debut film from 2003 where he plays a man named Johnny who has a beautiful blonde hair girlfriend named Lisa played by Juliette Danielle whom is actually kind of a bitch. Johnny has a working class job as a banker, takes care of a teenager named Denny, who insists almost on being a peeping Tom on their sex life, comes home to his woman Lisa and over time finds out she is cheating on him with his best friend Mark played by Greg Sestero then offs himself… on a budget of six million how can you film something like this?\r\n\r\nDenny a young teenager is not entirely living with Johnny but is more like a son to him is caught up in the mix and gets into trouble with a drug dealer but you also see some kind of turmoil that Mark Goes through as he does feel guilty sleeping with Lisa but he enjoys it but is probably the most annoying actor on the set with his high pitched squeals. Also the fact of Lisa’s friends whom just can’t keep from fucking, started story plots that weren’t entirely needed and felt they were an after thought.\r\n\r\nThe Music behind the film feels like it should be in one of those older 80’s Canon fairy tales or something like Masterpiece Theater, but also elicit’s the feel of soft core love scenes like that what you would see on HBO after dark when it comes to the passionate scenes between Mark and Johnny. I also feel that when Johnny taped the phone calls Lisa made on one of those old tape machine’s feels slightly dated as this was a film done in 2003. I feel like the balcony scene was the worst scene as when they were up there you could tell that there was a stage wall behind them as the cast was talking as I understand this was called a green room.\r\n\r\nThough I love dubbed films in Martial arts type films and Toho productions I think that having the actors and actress’s including Tommy Dub their voices in was absolutely awful, mixed with his geriatrics of getting angry at Lisa, Tommy was annoyingly eccentric, there wasn’t a line in the film that was even remotely original. It’s all been said before but I do have to say are quotable. I feel like I should love this movie but I’ve decided that I do not and only mildly enjoy the film as it is just that bad and even then I’m not sure that enjoyment can be the word decribing how I feel about the film. I don’t understand the reason behind why people enjoy the film but point blank it’s terrible. Terribly edited, basically a film you can probably take to a film class and say here’s what not to do.\r\n\r\nI didn’t enjoy watching this film. I watched it for the purpose of discussing it on podcasts. I’ll definitely not recommend it to others either but I will say it paved the way to “the Disaster Artist” which looks like it could be an even better film than this piece of trash. I’m sorry to shit on film growing a cult standing but this was not a good film at all. Sorry ladies and gentlemen. Though I own it you go ahead and enjoy it not me.\r\n\r\nAs I understand it Tommy Wiseau at least in Greg Sestero’s book had actually not been a nice person to his cast in fact he’d actually been quite abusive so those whom are actually on his side you have to wonder at their sense of morality in believing this film was remotely good. I guess I’d say this was one of those films where Tommy had the money to buy his film haters the ones that find it just that enjoyable to hate movie goers.\r\n\r\nI understand that he, Tommy Wiseau, probably took the films he knew growing up which probably had more to do with those soft core roughies you saw at the peepshows after midnight but ladies and gentlemen I’m not into belly porn… Enjoy the film if you must just don’t lie and say it was a great film…\r\n\r\nThree positives that I can say about the film is I loved that beginning shot of that cool looking Architecture, The part where the friends have fucked and dude comes back for his underwear and I guess the fact that all the lines are quotable in the same accent that Tommy has.\r\n\r\nStarring Tommy Wiseau as Johnny, Greg Sestero as Mark, Juliette Danielle as Lisa, Philip Haldiman as Denny (as Phillip Haldiman), Carilyn Minnott as Claudette (as Carolyn Minnot) Robyn Paris as Michelle, Mike Holmes as Mike (as Mike Scott), Dan Janjigian as Chris-R, Kyle Vogt as Peter, Greg Ellery as Steven, Kari McDermott as Party Member #2 (as Kari Mcdermont), Jennifer Vanderbliek as Party member #3 (as Jen Vanderbliek), Daron Jennings as Barista #2, Frank Willey as Coffeshop #4, Bennett Dunn as Partygoer (as Bennet Dunn).", "created_at": "2021-02-16T01:46:58.590Z"}, {"movie_id": 17473, "review_id": "64f4c9dee0ca7f012eb416c7", "author_rating": 4.0, "review_text": "I suppose that you just have to leave your brain at the door for this nonsense. Sadly, at this most recent showing in London, we were not permitted to throw spoons (nor in theory, to call out - but, hey - good luck with that!). Anyway the somewhat unattractive \"Johnny\" (Tommy Wiseau) is living with pretty fiancée \"Lisa\" (Juliette Danielle) who decides that she'd probably rather hook up with the rather handsome \"Mark\" (Greg Sestero)... Will they get rumbled? Will things ever be the same again? Of course, the dialogue is abysmal, the sex scenes filmed in an out of focus fashion that we can only ever be truly thankful for, and the soundtrack is so cheesy that the whole thing just engenders audience participation on quite an unprecedented scale. This is garbage; there is no other word for it - yet it is eminently watchable (after three bottles of wine and some i/v gin). Carolyn Minnott is wonderfully earnest as mother \"Claudette\", too. It's amateur in just about every way, but funnily enough that might just be the reason it has achieved cult status. Aim very low, and you will still be setting your sights too high!", "created_at": "2023-09-03T18:01:02.734Z"}, {"movie_id": 17473, "review_id": "6547c5ab924ce6011ec530af", "author_rating": 6.0, "review_text": "A cult classic of \"so bad that it's good\" filmmaking, the story of how The Room was created has become as legendary as the film itself. Watching The Room gave me the impression I was watching a film written and directed by an extra-terrestrial being who'd never seen a movie before, nor seen real humans interact. \r\n\r\nTommy Wiseau's acting has to be seen to be believed. It is not what one might consider \"good\", to put it mildly. There are way too many boring and cringeworthy sex scenes in this, which definitely drags its rating down. Many aspects of the story and lore are truly baffling, which actually adds to the entertainment value of the film. \r\n\r\nHowever, I do not find The Room as entertaining as any of Neil Breen's work (Breen is a filmmaker often mentioned for comparison when discussions of Tommy Wiseau as an artist crop up). Despite its flaws, and a harsh critic might say that there's more flaw than film here, The Room still has more entertainment value than many soulless big-budget Hollywood efforts, made with maximum cynicism as money-making machines.", "created_at": "2023-11-05T16:41:15.146Z"}]