[{"movie_id": 13249, "review_id": "5bb10e0f0e0a2633a40027c3", "author_rating": 7.0, "review_text": "Grim, relentless pursuit Western turns mystical in the last act\r\n\r\nA vengeful former Confederate colonel (Liam Neeson) leads a small group of hirelings in an unyielding hunt for the former Union officer who horribly wronged him three years earlier (Pierce Brosnan). The only problem is that the latter is an expert fighter and survivalist.\r\n\r\nThis is a well done revenge Western with spectacular and varied remote Western locations (detailed below). If you thought Brosnan was a pretty boy as James Bond this movie will change your mind as he’s virtually unrecognizable as the skilled Rambo-like militarist. The tone is similar to contemporaneous Westerns like “The Missing” (2003) and “September Dawn” (2007), but with a revenge-chase plot. The final act throws in supernatural elements with characters like Mr. Charon (Wes Studi) and Louise C. Fair (Angelica Huston). You don’t have to think too hard to figure out who they really are. \r\n\r\nThe movie runs 1 hour, 55 minutes and was shot in Oregon (McKenzie River, Sahalie Falls and Koosah Falls), New Mexico (Lordsburg, Taos, Bramlett and Santa Fe), Arizona (Willcox Playa, Pirtleville, San Bernardino Valley and Chiricahua National Monument) and Death Valley National Park, California.\r\n\r\nGRADE: B/B-", "created_at": "2018-09-30T17:55:27.483Z"}, {"movie_id": 13249, "review_id": "5d5cb4c4a3d02700140b2e34", "author_rating": 8.0, "review_text": "Go as you wish. That which is yours will always return to you. That which you take will always be taken from you.\r\n\r\nSeraphim Falls is directed by David Von Ancken who also co-writes with Abby Everett Jaques. It stars Liam Neeson, Pierce Brosnan, Michael Wincott, Xander Berkeley, Tom Noonan, Kevin J. O'Connor, John Robinson, Ed Lauter, Wes Studi and Anjelica Huston. Music is by Harry Gregson-Williams and cinematography by John Toll.\r\n\r\nIt's post American Civil War, 1868, the Rocky Mountains, and Gideon (Brosnan) is being hunted by Colonel Morsman Carver (Neeson) and his hired killers. The reason why is not yet known, but it's the beginning of a relentless pursuit that's propelled by rage and hatred, a pursuit that will force both men to the day of reckoning.\r\n\r\nThe premise is as simple as it gets and on the surface the film holds no surprises until the divisive ending. However, before taking in the thematics of the story, it's refreshing to find a film of this genre type utilising the scenery to the max, whilst simultaneously playing out with sparse dialogue as two grizzled actors tell the story. An obvious forebear to \"The Outlaw Josey Wales\", Seraphim Falls is ultimately a meditation on revenge and remorse. Moments of violence flit in and out of proceedings, these moments cloaked magnificently by natural surroundings, where the expansive wilderness plays host to the intimate human drama unfolding. It's also a film that pulses with mythical atmosphere, where Carver's pursuit of Gideon plays out like that of the Grim Reaper and his charges sent to capture the soul of the fleeing man. The falls of the title clearly indicates man's decent into hell, because it's not for nothing that the finale is played out on a blistering plain, which as you cast your eyes upon it, it is indeed hellish.\r\n\r\nIt's also worth noting that we the viewers are never sure who we should be rooting for - if either of them!? Gideon is out on his own, but he is an immensely skilled mountain man, one who is seemingly out skilling his pursuers. Is he the bad guy here? Or is it Neeson's Carver? One is ex Union, the other Confederate, this gives added spice to what then develops into a most intriguing journey. Where the film has irked some critics is with the ending, with some calling it pretentious and a very weak pay off. It's true enough to say that Ancken has slackened the grip slightly, as the tight gritty tone gives way to something more open and even airy. Yet I personally like it a lot, it helps to round out the supernatural feel that appears to loom as we have headed towards the day of reckoning. It lacks dramatic impact for sure, but thematically and for tonal bedfellow process, it pays off on what had gone before it.\r\n\r\nBrosnan (stepping in when Richard Gere bailed out) and Neeson revel in the roles, seemingly enjoying the complexities and war torn burdens that their characters carry. Their scenes together are as professional as one could wish, both men comfortably doing world weary characterisations. Wincott is on hand for gravel voiced villain duties, his portrayal of Hayes is cold and in keeping with the movie. The other notable names in the cast drop in and out of the narrative, each important, and in the case of Huston and Studi, suitably weird. But the real star of the show is John Toll (Braveheart/Legends of the Fall), whose photography is pristine and  always remaining atmospheric, he captures the natural beauty of Oregon and New Mexico with great keen eyed skill. Switiching seamlessly from the blue, grey and whites of the mountain pursuit to the browns and yellows of the salt flats, we witness a master cinematographer at work. \r\n\r\nLikely to infuriate as much as it enthrals, one just hopes that it's the latter that anyone reading this does indeed find to be the case. 8/10", "created_at": "2019-08-21T03:04:36.670Z"}]