[{"movie_id": 955, "review_id": "56863ac592514132db01c0f5", "author_rating": 5.0, "review_text": "This is a decent enough mindless action movie with a lot of over the top action but it is not really a Mission Impossible movie. The movie starts of reasonably well being somewhat intelligent with a bit of Mission Impossible feel to it. It is actually almost a bit slow at times. However, for the second half of the movie it really degrades into a classical John Woo, over the top, action feast with all pretense of intelligence and any true Mission Impossible feel gone. John Woo is not the right person to make a Mission Impossible movie.\r\n\r\nAs with the first movie if it would not have been labelled Mission Impossible I would probably have given it a higher rating since it is a decent enough, mostly braindead though, Hollywood action movie. However, I have higher expectations from a movie labelled Mission Impossible.\r\n\r\nTom Cruise is quite okay as Ethan Hunt. Dougray Scott is okayish as the bad guy. Sometimes he projects the right big bad and mad bad-guy attitude but sometimes he is just silly and just as over the top as the action scenes. He is supposed to be a mastermind but he comes out as a thug a’ la a not so intelligent drug baron in many scenes.\r\n\r\nThe action scenes? Well, they are classical John Woo material. Fast paced with a lot of stunts and things that go boom. They are also, as expected, hugely over the top and unbelievable. They provide a enjoyable visual experience but, as I wrote above, they are not really what I would expect from a Mission Impossible movie.\r\n\r\nThe romance between Hunt and Nyah is the typical Hollywood, let’s throw in a sexy girl and some superficial attraction, which develops from get lost to I love you in the matter of a few hours of contact, between the lead character and the girl. Meh!\r\n\r\nI get the impression that the people that have created these movies so far have not really watched a single full season of Mission Impossible.", "created_at": "2016-01-01T08:37:25.082Z"}, {"movie_id": 955, "review_id": "57b2d23dc3a36837d7000b14", "author_rating": 3.0, "review_text": "The first underwhelmed me, but this one straight-up bored me. Again, of course seeing Hunt climb a mountain without a harness is impressive sure. And I even quite liked the idea behind the villain of the piece (though even that angle was woefully underdeveloped).\r\n\r\nEven setting it in predominantly Australia was enough to grab my attention, and that's saying something cause I'm pretty biased when it comes to that. I hear tell that _Mission: Impossible II_ is the low point in the series, and that at least is encouraging, because if anything afterwards is much worse than this one, I don't know if I'll be able to make it through to Rogue Nation.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2016-08-16T08:43:41.296Z"}, {"movie_id": 955, "review_id": "5e9120963679a10018375490", "author_rating": 2.0, "review_text": "After quite entertainign Mission Impossible I the second installment turned out ... terrible. As if the screenwriters didn't know how to fill the 2 hrs with action the overuse of heroic slow motion scenes is horrible. You almost might need a barf bag if you can't stand slo-mo every five seconds... for 15 seconds. I am amazed they did decide to push on with more M:I movies after this one, then again, these turned out much much better even if it would be hard to beat that lousy piece of crap of a movie.", "created_at": "2020-04-11T01:42:46.016Z"}, {"movie_id": 955, "review_id": "62bf2a4a28723c004c808206", "author_rating": 5.0, "review_text": "\"Ambrose\" (Dougray Scott) is a disavowed IMF agent with a grudge. He is determined to procure and release a deadly hybrid \"chimera\" virus onto the streets of Sydney so he can push up the share price of the company that wins his auction to acquire it; and that can also manufacture the antidote \"Bellerophon\". It falls to \"Ethan\" (Tom Cruise) and his inventive gang of regulars to come up with a way to thwart this plot. To that end, he recruits the brassy thief \"Nyah\" (Thandiwe Newton) who gets to play a real love interest with \"Ethan\" whilst feigning one with \"Ambrose\" to get close to him and learn his plans. On the face of it, this is an ideal screenplay for this franchise, a sort of \"James Bond\" theme with plenty of location cinematography, action scenes and the odd gadget. Sadly, though, Scott is just not very menacing as the baddie and the story is really under-developed. The characters appear to be almost grinning their way through the unremarkable dialogue, and John Woo creates then recreates the action scenes as if it were just some sort of cartoon feature. The standard of the production is high, the staging of those action scenes is strong and well photographed, but the story just doesn't ever really get into gear and at over two hours, it's a pretty weak and insipid outing for just about everyone. Not a patch on the first film.", "created_at": "2022-07-01T17:09:30.256Z"}]