[{"movie_id": 12246, "review_id": "5f9db356bd990c003b475f17", "author_rating": 8.0, "review_text": "_**The Origins of the Great Khan**_\r\n\r\nAs a boy, I had a bit of a fascination with Genghis Khan (meaning Great King) and even drew a picture of him titled, naturally, \"Temujin,\" his actual name. I don't know what it was that attracted me; likely his cool-sounding title and world-conquering exploits. With the exception of Iron Maiden's great instrumental, \"Genghis Khan,\" that ended my flirtation with this historical figure. That is, until I saw the Russian-made \"Mongol: The Rise of Genghis Khan\" (2007) yesterday.\r\n\r\nAs the title suggests, the film explores Temujin's origins and what led to him becoming the great king of the Mongols and world-terrorizer. Despite being a foreign film with subtitles the movie successfully pulled me into its world and characters. The Mongols on the vast Asian steppes lived similar to American plains Indians. I've seen numerous photos of Mongols living on the steppes with their yurts, etc. over the years, but I could never relate to them as people. Just as, say, \"Dances With Wolves\" made American Natives come alive to the viewer so this film does with Mongols.\r\n\r\n\"Mongol\" eschews the American \"blockbuster\" syndrome and simply tells the story of Temujin from his early boyhood to his crowning as the great Khan. Although there's a steady amount of action throughout, there are a lot of quiet lulls with Temujin calmly waiting-out his various imprisonments and seeking Tengri, the god of the blue skies. Regardless, I found myself drawn into the characters and simple story.\r\n\r\nI liked the fact that a monk was able to \"see\" Temujin's greatness and future world-conquering potential even though he was only a lowly slave, which others understandably couldn't see. I also liked the low-key commentary on people choosing their leaders and forsaking the less worthy, and the resulting strife, as well as the focus on Temujin's many quiet times in the wilderness seeking the Divine for wisdom and power to walk in his greatness and fulfill his dream, not that I'm suggesting Genghis Khan was God-ordained, of course. The lead actors are all great, especially Honglei Sun as Jamukha, Temujin's \"brother\" and then greatest enemy in Mongolia. Despite all this, people who require constant eye-rolling action and explosions will likely find \"Mongol\" boring.\r\n\r\nSpeaking of \"constant eye-rolling action,\" this was the very thing that ruined the 2011 version of \"Conan the Barbarian\" with Jason Momoa, who was excellent in the role. That film needed more downtime, realism and depth, similar to the original 1982 version (not that that version didn't have its share of cartoony-ness), the filmmakers instead pushed for overkill action with minimal dramatic weight. The result? A mediocre Conan flick that looked great but was ultimately too shallow and goofy, in the \"action-packed blockbuster\" sense.\r\n\r\nInterestingly, \"Mongol\" reminded me of John Milius' version of \"Conan\" and of Robert E. Howard's Conan in general, albeit without the sorcery. I believe if the 2011 remake of \"Conan\" shot for the realism and seriousness of \"Mongol,\" as REH himself portrayed the character and the Hyborian Age, it would have been a more worthy Conan film. It goes without saying, if you like REH and Conan you'll probably appreciate \"Mongol.\"\r\n\r\nThe soundtrack is simple but effective, often just an eerie-sounding violin/cello, reminiscent of parts of \"Apocalypse Now\" (1979). I found it interesting that when the credits hit a great epic metal riff kicked in for a few bars before morphing into the expected Eastern-styled credits soundtrack. It was a pleasant surprise.\r\n\r\nThe film runs 2 hours, 6 minutes, and was shot on the remote and godly landscapes of Inner Mongolia, China, and Kazakhstan.\r\n\r\nGRADE: A-/B+", "created_at": "2020-10-31T18:56:22.838Z"}]