[{"movie_id": 9902, "review_id": "6310cd9f0d29440079597c22", "author_rating": 8.0, "review_text": "I feel that Wrong Turn is an underrated and underappreciated horror movie. Yes, it’s bloody. Yes, the bad guys are inbred cannibals. But the cast is great, and the effects are also great for its time. You feel for these characters and their predicament.\r\n\r\nPLOT\r\n\r\nFive friends and a stranger, after a car crash, must survive in the woods while being hunted by inbred cannibals.\r\n\r\nMY THOUGHTS\r\n\r\nThere’s roughly ten kills. I say roughly because “supposedly” two of the killers are killed, but since there are several sequels, we can assume they may have not died. The kills, the ones that are shown on screen, are bloody and good. Unfortunately there are a few that are shown off screen. I would say my favorite would have to be either Francine’s barbed wire death (to include the dismemberment later on) or Carly’s beheading.\r\n\r\nThe boring death would have to be either Evan’s, which is ear sliced off and Scott’s where he is just shot three times in the back with arrows. Neither were that interesting. I did feel bad for Scott since I actually like him. I could care less about Evan. He was annoying.\r\n\r\nAs far as acting goes, I think it was pretty decent. I found Eliza Dushku, Jeremy Sisto, Emmanuelle Chriqui, and Desmond Harrington did a good job with their characters, and I really felt for their characters.\r\n\r\nEliza Dushku (known for Soul Survivor, Buffy the Vampire Slayer, and Tru Calling) plays Jessie, a woman who recently ended a relationship. Her friends brought her out hiking to take her mind off of the breakup. Emmanuelle Chriqui (known for Crow: Wicked Prayer and Forever Knight) plays Carly, engaged to Scott, with wedding plans running through her head.\r\n\r\nJeremy Sisto (known for May, Nightmare and Dreamscapes, and Dead & Breakfast) plays Scott, Carly’s fiancee. And Desmond Harrington (known for The Hole, Taken, Ghost Ship, and the Neon Demon) plays Chris, the man late for a job interview who regrets taking a shortcut.\r\n\r\nWe start Wrong Turn with two college students rock climbing. When the young man gets to the top we hear what sounds like a struggle and then his body is thrown over the cliff. The girl’s rope is being pulled up so she cuts the rope and falls to the ground. She tries to get away, but is caught and killed off camera.\r\n\r\nNext we meet Chris who is driving to what we assume is a job interview. He’s running late and there is a chemical spill on the road. He then decides to use a shortcut. He distracts himself and crashes into a jeep that is sitting on the side of the road. Here he meets 5 more people: Evan, Francine, Scott, Carly, and Jessie.\r\n\r\nJessie and her friends are on a hiking trip when they realize that their flat was caused by barbed wire that was purposely layed out in the road. Chris, Jessie, Carly, and Scott take off to find help, leaving Evan and Francine with the vehicles.\r\n\r\nAfter messing around for a bit, Evan hears a noise and goes to investigate. After realizing he’s missing, Francine goes and looks for him. She doesn’t find him but she finds his shoe and his severed ear. She screams and tries to run off but is quickly captured and a barbed wire is stretched over her mouth and pulled. This causes her mouth to tear open, killing her.\r\n\r\nMeanwhile the other four find a cabin and go in to investigate. They find various items, old and new, as well as body parts. Before they can leave, three people show up, so they hide. Chris and Jessie hide under a bed and Carly and Scott hide in a room with junk in it.\r\n\r\nThe three carry Carly’s body in and put it on the table and start dismembering and eating her! Their friends are horrified but are quiet until the three fall asleep. As they escape, Chris tries to distract the killers and they shoot him. So then Scott decides to distract the inbreds so Jessie and Carly can get Chris and steal the killer’s truck. They drive down a path hoping to find Scott. They see him and as he’s running to the truck the killers shoot him with three arrows, killing him.\r\n\r\nThe three drive off as the killers take Scotts body with them. They keep driving and find a ranger’s station/tower. They climb it, hoping for a radio and they find one but nobody answers when they call for help. Unfortunately for them, the killers see them and follow. When someone finally responds on the radio, the killers try to get into the room.\r\nUnable to get to them they set fire to the tower. This causes Jessie, Chris, and Carly to have to climb out onto the tall trees. As they climb down, Carly is too scared to move, is caught by surprise and her head is chopped off with an ax!\r\n\r\nOur final two, Chris and Jessie are able to cause one of the killers to get hit by a branch, and fall from the tree. They are able to escape, and hide in a cave until morning. They head out the next morning and finally see a road. Just then, the killers show up and push Chris down the hill. Jessie is captured and taken back to the cabin. She is chained to the bed, unable to escape.\r\n\r\nChris survives the fall and see’s a police officer. Before he can explain what is going on, the officer is shot with an arrow. Chris tries to take the vehicle but can’t find the keys. Instead, he hides under the killer’s truck, holding on while they leave to go back to the cabin with the officer’s body in the back.\r\n\r\nJust before Jessie is killed, the front of the cabin is busted open when a vehicle bursts through, setting the cabin on fire. There’s a fight, but in the end Chris is able to blow up the cabin with the two killers inside. Jessie and Chris drive off.\r\n\r\nAs a note, there’s an end credit scene, so stay and watch it.\r\n\r\nOverall, I think this is a great movie and a good cast. One of those kinds of movies that’s, yes bloody, and there’s killing, but you actually like the characters. You feel bad when some die or get hurt. I can’t say the same for the sequels though. So if you haven’t seen Wrong Turn, then you definitely should watch this.\r\n\r\nAnd now for your Forever Final Girl Exclusive…Did you know?:\r\n\r\nEmmanuelle Chriqui dislocated her shoulder performing her fall through the trees. You can hear her shoulder pop on the production track in the theatrical sound mix.\r\n\r\nSeveral of the cast and crew were covered in poison ivy throughout the filming of the movie, this was due to the chairs being placed in what was first thought to be a group of weeds only later to be discovered as a patch of the rash causing plants.\r\n\r\nDuring one of the last scenes in the movie, Eliza Dushku actually set actor Julian Richings (Three Finger) on fire.\r\n\r\nWhen the four were running from the cabin after awakening the mountain men, Desmond Harrington broke his right ankle after landing on the opposite side of a log. This made it very difficult to shoot some of the scenes after his left leg is “shot” and he has to limp on his right leg.\r\n\r\nDespite only being credited for his producing, Make-up master Stan Winston was pivotal in the key design of the Mountain Men, in particular now postmodern horror icon Three-Finger. This marks the second last major horror film he has been involved before his death in 2008 at age 62 and the third slasher horror film he had been involved in following unaccredited work in Friday The 13th Part II and III, the latter of which he had been a core designer on the original hockey mask of also horror icon Jason Voorhees and the respective mongoloid appearance of Jason for those two parts.\r\n\r\nScreenwriter Alan B. McElroy also penned the script for the reboot Wrong Turn (2021).\r\n\r\nDirector Rob Schmidt said in the commentary that he considers this film to be his own personal tribute to the classics like Texas Chainsaw Massacre (1974) and Hills Have Eyes (1977).\r\n\r\nKevin Zegers and Lindy Booth also appear together in the 2004 remake of Dawn of the Dead. In this film their characters are in a relationship and both die, however, in Dawn of the Dead their characters both survive and are assumed to have started a relationship by the end.\r\n\r\nThe only film in the series that does not contain any sex or nudity.\r\n\r\nThe female lead character, Jessie Burlingame, was named after the heroine in Stephen King’s novel, “Gerald’s Game”.\r\n\r\nThere’s an additional scene halfway through the end credits, showing the fate of a state trooper who discovers a body in the burned-down cabin.\r\n\r\nEliza Dushku did a lot of her own stunts for the movie.\r\n\r\nCheck out my other reviews here: Forever Final Girl\r\n\r\nLet’s get into the rankings:\r\n\r\nKills/Blood/Gore: 4/5\r\nSex/Nudity: 0/5\r\nScare factor: 4/5\r\nEnjoyment factor: 5/5\r\nMy Rank: 4/5", "created_at": "2022-09-01T15:19:59.475Z"}]