[{"movie_id": 9539, "review_id": "5309d697c3a3684208003cd2", "author_rating": 5.0, "review_text": "Rated this 5/10 due to large amounts of repeated and gratuitous violence.\r\n\r\nIs it worth torturing people to find out if there is life after death?\r\nThis movie's answer seems to be \"Keep doubting\".", "created_at": "2014-02-23T11:08:07.423Z"}, {"movie_id": 9539, "review_id": "5326f7ce92514115440034f7", "author_rating": 10.0, "review_text": "Martyrs: Greek for Witness.\r\n\r\nMartyrs is written and directed by Pascal Laugier. It stars Morjana Alaoui and Mylene Jampanoi.\r\n\r\nThe New French Extremity Movement had its bar raised considerably by Pascal Laugier’s brutal but thought provoking horror. It’s a film as uncompromising as it is confrontational, a picture guaranteed to get a response for better or worse. Once viewed it simply will not be forgotten, the images, the twisty narrative thematics and the bloodshed that flows consistently throughout the story, Laugier and his two brilliant lead actresses assault the senses, magnificently so.\r\n\r\nStory is unfurled as a three tiered structure, each one devastating, but it’s with the final third where the picture goes up through the stratosphere, stopping briefly at the café weird just to further tickle our craniums. Some of the violence here is tough to watch, and it’s no surprise to find it was met with the inevitable charges of misogyny. Yet the culmination of it all puts some perspective on the violence witnessed, leading to a strangely profound and moving climax.\r\n\r\nThe less you know about it going in for the first time the better. A strong stomach is required, as is an open mind, if you have these things then awaiting you is a visceral masterwork, one of the finest horror film’s to have ever come out of France. Yes, it’s that astonishing. 10/10", "created_at": "2014-03-17T13:25:34.770Z"}, {"movie_id": 9539, "review_id": "5f910c3f7646fd00362af805", "author_rating": 8.0, "review_text": "I wrote this once to describe my philosophy on what movies/TV I like: \r\n\r\n\"Ravenous fan of dark, edgy movies & TV. They should glue you to the screen and stay in your dreams.\"\r\n\r\nMartyrs is one of a handful that describes that perspective to the T, and it is the kind of horror movie that you should go in completely clueless about the plot to enjoy the many twists that you won't see coming. \r\n\r\nA big caveat: this is \"advanced\" horror -- gut-wrenching, gory and very disturbing. Definitely not for everybody.", "created_at": "2020-10-22T04:36:15.747Z"}, {"movie_id": 9539, "review_id": "651d9f14ea84c7010c1516e1", "author_rating": 6.0, "review_text": "<b>64/100</b>\r\n\r\n<i>Martyrs</i> delivers an intriguing and original concept but doesn't quite reach its full potential. It borrows a page from <i>Terrifier</i>'s playbook by dispatching the superior actress early which leaves a noticeable performance void. The third act hits a bit of a lull, but rebounds with a gripping and shocking climax that's sure to leave an impression. While it may not fully flesh out (no pun intended) its premise, <i>Martyrs</i> is worth a watch for horror fans looking for a unique and unsettling experience.", "created_at": "2023-10-04T17:21:24.219Z"}]