[{"movie_id": 271718, "review_id": "564778259251413ae1003dc2", "author_rating": 5.0, "review_text": "> The same old romance formula, but a woman's version.\r\n\r\nI never saw the trailer, but I thought it was Rebel Wilson's film, that's who I saw on the poster and decided to go for it. In the movie she never came, then realised I was tricked or I failed to pay attention while choosing the film. So then, who the heck was this actress. Never seen or heard before, Not so romantic or funny, totally boring. I thought She might be Will Ferrell's sister. I'm kind of frustrated because of either the movie or the actors were not excited to keep going with my watch.\r\n\r\nThis is the same old story, but instead it's a woman's version. A playgirl loses the someone who loves her sincerely for what she's and later finds the one true love of her life, but it ends in a disaster due to her past. So how everything is going to be fixed is what brings curtain to the narration.\r\n\r\nIt might be a well known plot, but a well crafted movie as well by one of the best comedy filmmaker who has given many awesome ones. Despite his effort to make it big it is also his bottom of the list from his filmography. Well, not all the actors were so bad, John Cena was so funny with his gay jokes, but lot like in a guest appearance. The basketball superstar that I don't know him. Definitely better than average only if a quality movie like this would have had a proper lead actress. I think some people would find it hilarious, but not to me and I wanted to like it, but I couldn't.\r\n\r\n5/10", "created_at": "2015-11-14T18:06:29.585Z"}, {"movie_id": 271718, "review_id": "5d51d9120102c949657602f6", "author_rating": 7.0, "review_text": "A relatively basic rom-com plot, elevated by Amy Schumer and Bill Hader. Schumer injects humour and reality to her character, even if you can see every story beat coming a mile a way. Not the best nor the worst Apatow film, it is heavy handed at times and a little too long. I also hate how these characters always completely quit drinking and partying for their partner, can't there be a happy medium?\r\n\r\nStill, I laughed out loud on multiple occasions, and you can't ask for much more with a rom-com", "created_at": "2019-08-12T21:24:34.146Z"}]