[{"movie_id": 467660, "review_id": "5c9b6c88c3a368349f39a12d", "author_rating": 6.0, "review_text": "Divisive Dilemas.\r\n\r\nHave to be honest, I had no idea this was filmed on an iPhone 7 or that it was directed by Steven Soderbergh. I was stuck for something to watch on cable the other night and I liked the sound of the plot premise. So unburdened by expectation of a searing horror classic I settled in to see what unfolds.\r\n\r\nPlot has Claire Foy as Sawyer Valentini who inadvertently commits herself to a mental health institution. Once inside things being to unravel and the threat of her one time stalker now being even close to her opens up the book of terror - but is it real?\r\n\r\nFirstly you have to say that the mental health authorities must have had kittens when they saw this, much of what is on screen is utterly ridiculous and paints the system in a damning light. Secondly you really have to jump on board with the improbability of it all, this really is made for dramatic entertainment purpose and not as a viable horror of the real world.\r\n\r\nAs a thriller it worked for me, the constant question of what is real or not keeps things on the slow burn. Either way, real or not, it's thought provoking enough to warrant staying till pics end. The psychological angle is pungent enough to say there's some thought in the writing, though this is undone by utter nonsense as things spiral into the impossible for the final quarter of film.\r\n\r\nFoy is good value up front and the fulcrum of it all, while elsewhere good work comes from Nate Hoffman and it's nice to see Juno Temple in a spicy role. Ultimately this is no blood letting horror picture, and certainly it's no One Flew Over The Cuckoo's Nest, Girl Interrupted etc etc. \r\n\r\nThe iPhone experiment is a gimmick that works here due to the confines of the location for story, but as a genre piece of worth it is unlikely to have legs. However, even though I enjoyed this as a one time only viewing experience, I perfectly understand why it has become divisive. So for those who haven't seen it yet then it is advised you understand this is no terrifying thrill a minute piece. It's tricky to recommend with any sort of confidence, and thus I feel the internet ratings of about 6.5/10 is just about right. 6.5/10", "created_at": "2019-03-27T12:28:56.414Z"}, {"movie_id": 467660, "review_id": "5f339835e194b00036c5bf74", "author_rating": 5.0, "review_text": "Every time Claire Foy is not on the screen, the calibre of acting in _Unsane_ drops to laughable. I'm glad that Soderbergh is able to put together films for the seven-figure price range, but the fact of the matter is that the camera on an iPhone just isn't that good. It's decent enough to (in most scenes) get the visuals across, but never decent enough to not be a distraction. _Unsane's_ tale is relatively well told, but also something that's been done before, and considering the man in the director's chair, something that probably should have been done better too.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-08-12T07:20:21.887Z"}]