[{"movie_id": 12096, "review_id": "55782205c3a36842ee0014cf", "author_rating": null, "review_text": "From the beginning I knew a prequel to the PINK PANTHER series would be an abomination. I did not, however, think it would be worse than I expected. I went to see the movie because I am a fan of Steve Martin and his writing. His attempt at either imitating or recreating the Clouseau role (whichever it was) was, in the very least, a failed accomplishment. The beauty of the Sellers \"Clouseau\" was the subtlety that Sellers brought to the character. He was clumsy as opposed to stupid. The real humor in the originals is that Clouseau would solve the case, more or less, by accident through his faults. Thus when he received acclaim it was that much more humorous. Martin's \"Clouseau\" is stupid and vain and has no likable traits. He actually has some police skills that help him in the end, but are not in the vain of Clouseau. He is NOT Clouseau. Why would anyone want to recreate a character that was perfect?", "created_at": "2015-06-10T11:39:49.189Z"}, {"movie_id": 12096, "review_id": "62adb0e055c1f400519112be", "author_rating": 5.0, "review_text": "**A decent film, which has what it takes to entertain us minimally, but which is still far from the quality we would like to see.**\r\n\r\nAfter many years dormant, the \"Pink Panther\" franchise was entitled to a very brief resurrection with two films starring Steve Martin. I saw the original films, from the 60s, 70s and 80s, in which Peter Sellers played the infamous Inspector Clouseau. With the death of Sellers, the franchise continued, with some absolutely bad films that dictated its end. This new film was heavily criticized by critics and was not able to give the public everything they wanted, but the truth is that it was a box office success and that, even today, it has the right to recurring exhibitions on TV channels, something that the original movies don't have it anymore.\r\n\r\nThe choice of Steve Martin for the protagonist, I believe, was quite wise, insofar as the actor knew how to do a job that respects and seeks to honor the legacy of Sellers (an actor that Martin himself admitted that he admired a lot). Martin is good at what he does, and he's a well-known comic actor, but the humor he bets on is more predictable and idiotic than Sellers' humor, and the truth is, he's not particularly funny. Jean Reno was a welcome addition, as the actor is quite comfortable with the role and the kind of humor that is reserved for him. Emily Mortimer works very well as a platonic love interest. I found her much funnier than the protagonist himself. Kevin Kline doesn't work very well as Dreyfus: the actor gave him a seriousness that takes away all the fun. In turn, Beyoncé seems to have been chosen only for her physical beauty and ability to mobilize her fans to see the film. She can't play a character, she's just being herself.\r\n\r\nThe screenplay is part of the problem with this film, with a far-fetched and rocambolesque story in which the pink diamond is stolen almost in plain sight, shortly after the death of its owner, a famous football coach. The story is simply weak and unappealing. And while the cinematography is decent, the filming locations are well-chosen and well-used, and the animated opening credits are pretty well done, the rest limps a lot: editing and visual effects work are the film's weak points, the pacing seems uneven and unbalanced and the soundtrack seems to be limited to a series of variations on top of the leitmotif given by the tone of Mancini's original music.", "created_at": "2022-06-18T11:02:56.322Z"}]