[{"movie_id": 49521, "review_id": "51d7d7a719c295166c12e886", "author_rating": 8.0, "review_text": "Overall this movie is great! It has flaws but it still delivered.  For instance, they didn't really explore the loving side of Superman that is the reason for saving humans.  But i get it that this could just be a different interpretation of his motives. The relationship between Clark and Lois was almost spontaneous and didn't really develop. Not to mention there was so much action! Sure this is Superman and he deserves a big movie, but that action is just so mind numbing and distracts from the plot. I really did like how they explored Clarks childhood just enough to give justification to his emotions. Although there are criticism about the ending, I thought it was well made. Clark spent his entire youth listening to his father to control himself and he had to learn to make a tough decision. I think this movie has a lot of potential for a sequel if they do it right. I look forward to being able to look back on this and watch it as part of a trilogy and not a stand alone film.", "created_at": "2013-07-06T08:39:03.466Z"}, {"movie_id": 49521, "review_id": "544e166fc3a36824290019ba", "author_rating": null, "review_text": "The cast is well chosen but the Amy Adams as Lois Lane. Not that she performances bad but she is just not Lois Lane.\r\n\r\nSmart choosing to focus in Krypton. Probably, the less repeated story told about Superman.\r\n\r\nYou can really feel Christopher Nolan's touch in the script and, probably, that's the problem. It is just too similar to Batman Begins. Also, the script repeats Batman's stupidities like the way in which Klark Kent father dies or feeling that Crowe, Superman's father, has everything under control, even his own stupid death.\r\n\r\nTons of FX with incredible fights that may feel exhausting for some but that I think are totally justified in this character.\r\n\r\nThe OST is again in the hands of Hans Zimmer that keeps abusing of the drumming and grave sounds.\r\n\r\nAll in all, still looking forward for the next movie of this reboot.", "created_at": "2014-10-27T09:54:55.114Z"}, {"movie_id": 49521, "review_id": "5a6380910e0a2619f801176e", "author_rating": 6.0, "review_text": "I guess I am being stubbornly traditional here but this was not really the Superman that I grow up with. I am sure that a lot of people are not going to agree with me on this one but personally I was not overly thrilled with this movie.\r\n\r\nSure, if what you wanted was a wild action ride and unchecked destruction then this movie will most likely satisfy you. However, as a “Superman” movie it just did not feel right to me.\r\n\r\nThe original story is tweaked and tinkered with too much. The Kryptonians, not only General Zod and his minions, are portrayed in a quite negative light. Superman himself project a hugely negative aura. Lois Lane gets to meet Superman and learn who he really is before he even starts to work for The Daily Planet. And so on and so forth…\r\n\r\nThe first part of the movie with the back-flashes, with Kal-El just trying to hide, getting bullied etc. is just sad and even boring. It is not until General Zod arrives that things starts to get going. However even then they continue to tinker with things. Apparently it is now enough to breathe Krypton-like air for him to lose his powers. This is just so wrong. Actually, the entire bla bla when they try to “explain” his powers is just dumb. There is an established story behind Superman. Even though it is fantastic and unscientific just stick to it. It is a fantasy comic character after all. Leave it at that. The story itself is not bad but it is not Superman.\r\n\r\nHaving said all that, when the fighting starts, the special effects and the action definitely have a high “coolness factor”. Superman and General Zod wrecks more havoc than half a dozen Godzillas with a bad case of hangover. Actually the level of mayhem is bordering on the ridiculous but it was fun to watch. Unfortunately I have to admit that this was my enjoyment of this movie, to watch the special effects.", "created_at": "2018-01-20T17:46:57.535Z"}, {"movie_id": 49521, "review_id": "605087884ca6760054f62daf", "author_rating": 9.0, "review_text": "When I first saw the trailer, I was a little excited.\r\n\r\nMan of Steel is the first of many films of what would now be known as DCEU. \r\n\r\nZack Snyder did a really brilliant job directing this movie - it was amazing! Henry Cavill was superb as Superman and Michael Shannon was brilliant as Zod. And a hat tip to Russell Crowe's performance.\r\n\r\nThe best superhero film in 2013.", "created_at": "2021-03-16T10:25:12.376Z"}, {"movie_id": 49521, "review_id": "628fdcc331644b009e88ff21", "author_rating": 8.0, "review_text": "Reading other reviews, I can understand how people that grew up with the comics didn't like it.  I never grew up with the comics.  I thoroughly enjoyed this movie.  It gets a lot of hate.  I thought the story, pacing, acting, and special effects were all excellent.  The scene where he learns to fly is one of the greatest scenes in modern cinema, in my opinion.  Gives me goosebumps every time.", "created_at": "2022-05-26T20:02:11.043Z"}, {"movie_id": 49521, "review_id": "63bdf09c8138310080468862", "author_rating": 2.0, "review_text": "Yeah... I have an issue with Superman Dark, I'm sorry, it just doesn't work for me. Batman, yeah, you can make him dark. Batman can be brooding. Batman can be extremely serious.\r\n\r\nIn fact, with the exception of Mayor Adam West's Batman, making the character light and fun doesn't really work.\r\n\r\nBut this is Superman, and he is a light character. You can make serious Superman stories, you can make dark superman stories, and they work... but not when you make Superman a dark and brooding character.\r\n\r\nWhen that happens, it feels like Man of Steel, a superman movie that is trying really hard to be Batman.", "created_at": "2023-01-10T23:11:24.813Z"}]