[{"movie_id": 330457, "review_id": "5dd831ab3faba00015f96deb", "author_rating": 7.0, "review_text": "The kingdom of Arendelle needs to be evacuated when the forces of nature threaten to destroy it. Elsa, Anna, Olaf and Kristoff set off to find some answers. But Elsa has been distracted. She has been hearing an unfamiliar voice calling out to her in a strange tune. Led by her, the group follows the melody to find themselves at the edge of an Enchanted Forest with untold mysteries and dangers.\r\n\r\nRather than retracing the steps of its record-breaking predecessor, ‘Frozen 2’ tries some new thematic tricks. This time around, the surprisingly mature plot focuses on transformation and growing up. The film’s setup leading up to the climax appears to be promising, but its third act doesn’t quite live up to expectations. The conflict resolution lacks a sense of impact and feels rushed. This is particularly baffling since the first half tends to meander, focusing on songs than on purposefully furthering the plot. Additionally, the tracks are far too many and certainly not as catchy as the first film. Which isn’t to say they are bad – the compositions are layered, but it is yet to be seen if they have enough sing-along power to become as popular as ‘Let It Go’. Still, the picturizations of the music is incredibly captivating.\r\n\r\nThis extends to the rest of the film’s animation too, and some vibrant colors combine with photo-realistic visuals to create quite a spectacle. Minor details are noticeable as they enhance the essence of each character. While each of the group gets their moments, Elsa and Anna continue to be the focal points. The uncontainable chemistry of Idina Menzel and Kristen Bell, respectively, picks up where they left off without missing a beat. Olaf provides ample humor, either in visual slapstick or by Josh Gad’s endearing yet tongue-in-cheek, almost self-aware delivery. An interesting new character played by Sterling K. Brown is an immediate standout. However, a subplot involving Kristoff and Anna feels shoed in to give Jonathan Groff something to do besides singing probably the most amusing song in the soundtrack.\r\n\r\nIt’s a tall order to expect this sequel to capture the lightning-in-a-bottle magic of the original, but Frozen 2’s stunning eye-candy and humor will be enjoyable enough for its younger core audience.", "created_at": "2019-11-22T19:06:19.410Z"}, {"movie_id": 330457, "review_id": "5ddb52473faba00013ff93b2", "author_rating": 6.0, "review_text": "While ‘Frozen 2’ isn’t as strong a film as I had hoped it would be, I wouldn’t go so far as to call it a disappointment. It’s still incredibly entertaining and I found myself engaged throughout. These films do have an undeniable charm, and outside of the now-completed ‘How to Train Your Dragon’ trilogy, ‘Moana’ and Laika’s ‘Missing Link’, these are the only major American animated films attempting the use the form to create a cinematic experience. It is a pity that the story never finds its feet; a combination of this level of craft and a real ripper of a yarn would have made this a slam-dunk. As it stands though, the magic of the ‘Frozen’ franchise is still there - dimmed, but there nonetheless.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-frozen-2-elsa-and-anna-return-with-the-magic-mostly-intact", "created_at": "2019-11-25T04:02:15.441Z"}, {"movie_id": 330457, "review_id": "5ddcebbea80673001212bb00", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nAs you should know by now, I enjoyed Frozen more than I expected. Therefore, I was genuinely excited about its six-year sequel. It’s one of the few movies in 2019 to which I went in 99% blind. I didn’t watch a single trailer, I barely saw any images or small clips, and I didn’t know anything about where the story was going. So, with my expectations moderately high, how did it perform? Very, very well. I’m going to write it straight away: I enjoy this sequel more than the original. For one simple reason: it possesses a more emotionally complex narrative, one which I think the target audience (basically kids) won’t even fully understand.\r\n\r\nIt’s really hard to create an animated flick with a story that works for both adults and children. The best of the best are the ones that are able to almost tell two different narratives: one simpler for kids with basic life lessons, and another for adults with more profound themes. Frozen II doesn’t reach this last level, but its layered screenplay allows for an exploration of Elsa’s powers that I genuinely didn’t expect. However, there’s an evident downside to the extreme focus on Elsa’s journey… The other characters are put aside with irrelevant subplots that only stretch the runtime a bit too much, and unfortunately, reach a certain point where out-of-character actions occur.\r\n\r\nThere’s even a period of time where a particular character simply vanishes from the story because Jennifer Lee and Chris Buck couldn’t figure out what to do with it during the last act. Despite the subplots not being impactful or not being able to further develop its characters, I can’t deny some sequences are entertaining and funny as hell. Olaf is the absolute MVP of the film, and just like in the original, he doesn’t exactly have an arc. Nevertheless, he has one of the most hilarious sequences of the year. I cried from so much laughter. His song and a couple of scenes where Josh Gad goes all out are some of the funniest of the whole movie.\r\n\r\nThe voice cast is once again perfect. Anna, Kristoff, and Sven are sort of along for the ride, with the trio only doing something useful in the last 15-20 minutes. Elsa is the real star of the show. From the opening shot to the last, it’s all about her, and her powers’ origin. It might get too convoluted for kids, but despite a few minor missteps, it’s an extremely well-developed screenplay. With a remarkable build-up and some truly amazing songs, Elsa goes through several action moments where she showcases all that her magic can do. And it’s visually mind-blowing. Like in the first film, the animation quality is extraordinary.\r\n\r\nThey really put 200% effort into Elsa’s magic sequences. From her running against a tide of waves to fighting against the four elements (water, fire, earth, and air), there are imaginative and incredibly entertaining scenes, which give the movie a level of entertainment superior to its predecessor. Put this together with the wonderful, powerful score, and you get a pretty epic film, scale-wise. I mean, Into the Unknown is not going to reach Let It Go’s level of worldwide craziness, but it’s a phenomenal song. It’s even better hearing it while watching the actual scene play out. Both this one and Show Yourself have a build-up worthy of sending chills down your spine.\r\n\r\nAll Is Found is also a memorable lullaby that a lot of parents are going to sing for their kids. When I Am Older is Olaf’s hilarious musical moment that left me laughing throughout its entire run. I love Frozen II’s score, more than the original’s. That’s something I genuinely wasn’t expecting at all. Looking back, I now think the first installment doesn’t even have enough significant songs. This sequel has tons of songs that are either extremely important for the characters or funny parodies. All are very captivating, catchy, and emotionally resonant. My advice: please, don’t listen to the soundtrack before watching the movie. Not only the titles and lyrics offer plot spoilers, but they ruin that “first experience” feeling. I got chills during a couple of them precisely because I watched besides only hearing them.\r\n\r\nAll in all, Frozen II compensates the six-year wait with a follow-up worthy of standing up to its original, which in my opinion, surpasses it. With an emotionally complex narrative, Elsa’s powers are explored and developed in a captivating, creative, fun, and entertaining way. Disney really put their best animators on this because the quality of animation has never been as visually impressive as this. It really feels like a magical film. Elsa’s magic demonstration plus the powerful, chill-inducing original score are two aspects that together provide some truly epic moments. However, Olaf is the MVP with a lot more screentime than in the original, and with a couple of the most hilarious scenes of the year. It’s a shame that the focus on Elsa’s arc pushed every other character aside, making them feel useless and with no exciting or impactful subplot. Runtime feels a bit stretched due to their side adventures, and exposition is pretty heavy throughout the entire duration. In the end, it’s still a contender for Best Animated Feature Film of 2019.\r\n\r\nRating: B+", "created_at": "2019-11-26T09:09:18.407Z"}, {"movie_id": 330457, "review_id": "5e5ad12966ae4d001984cafb", "author_rating": 7.0, "review_text": "Better than the first film which I found lackluster in almost every area outside the animation, this one had a stronger story and character development and while I can't say there was one highly memorable song, it did flow a bit better in the sequel. **3.75/5**", "created_at": "2020-02-29T21:01:29.105Z"}, {"movie_id": 330457, "review_id": "5e7d5a9e6c74b94ca5cac987", "author_rating": 4.0, "review_text": "Making a quality sequel can be tough, and even moreso when it’s a follow-up to a beloved modern classic. “Frozen II” has huge shoes to fill from the outset, and this second installment of the Disney animated tale of two sisters is a mostly unsuccessful adventure. Even the dazzling animation can’t make up for what’s lacking, including the absence of an instant hit song (nothing here even comes close to the brilliance of “Let It Go”), dry voice performances, and a mediocre story.\r\n\r\nWhen ice queen Elsa (Idina Menzel) begins hearing a strange voice calling her, she and sister Anna (Kristen Bell), Kristoff (Jonathan Groff), snowman Olaf (Josh Gad) and reindeer Sven set out on a perilous journey to discover why Elsa was born with magical powers. It’s a surprisingly dark adventure that, despite beautiful set pieces, is generic. The plot is confusing yet somehow predictable, and everything is Disney-fied and wrapped up with a nice little bow by the final credits.\r\n\r\nMost disappointing are the bland songs (by Robert Lopez and Kristen Anderson-Lopez). There isn’t one number that stands out. It’s a particularly huge letdown after the timeless toe-tappers of “Frozen.”\r\n\r\nThe movie feels like it’s made more for adults than kids, and there are some scary moments (like Olaf wandering through a deep, dark forest and flashbacks to the death of Anna and Elsa’s parents) that may frighten a few children. The idea of an action-adventure animated film with two strong female leads is commendable, but the potential to be something special instead of merely adequate is frittered away.\r\n\r\nWhile the magic doesn’t reach the highs of the first film, “Frozen II” is beautifully animated and visually impressive enough to recommend only to those who love animation as an art form. Everyone else would be smart to skip it.", "created_at": "2020-03-27T01:45:02.694Z"}, {"movie_id": 330457, "review_id": "5f238d40eea34d00373953a3", "author_rating": 4.0, "review_text": "Exactly what one can expect from a Disney princess movie.", "created_at": "2020-07-31T03:17:20.532Z"}, {"movie_id": 330457, "review_id": "5f4d33abfea0d700343bfbfa", "author_rating": 9.0, "review_text": "Away from the <em>'Toy Story'</em> franchise - Disney's greatest sequel to date? I believe so.\r\n\r\n<em>'Frozen II'</em> is quality. I'd argue <em>'Frozen'</em> is the better film, but this 2019 production is terrific. It isn't as funny (though still has its moments) as it is a more darker, deeper story. Considering this premise only really exists in this film, it is impressive how well it comes out and pays off. The score is improved, though the musical numbers aren't quite as memorable as 2013's.\r\n\r\nAll the cast reprise their original roles and are again very good; props to Idina Menzel (Elsa) and Kristen Bell (Anna). Josh Gad remains very amusing as Olaf, there's one recap scene in particular that stands out.\r\n\r\nEntertaining, once more. No complaints from me.", "created_at": "2020-08-31T17:30:19.739Z"}, {"movie_id": 330457, "review_id": "646544500f2ae100e2bb87b0", "author_rating": 8.0, "review_text": "Way better than the first. I still didn't like all the singing. The story was great. You get to see what she can do more with her powers.", "created_at": "2023-05-17T21:17:04.706Z"}, {"movie_id": 330457, "review_id": "6482b2b999259c01392a5452", "author_rating": 6.0, "review_text": "I suppose a sequel was inevitable, but I can't help wondering if maybe they could have spent just a little longer on the substance of the story? This time around, \"Elsa\" has lost her powers and so, with the kingdom in peril - again - she, \"Anna\", \"Kristoff\", \"Sven\" and the scene-stealing \"Olaf\" are lured by a mysterious voice to a forest far away so they can find out what's gone wrong for \"Elsa\" and to try and restore her powers before her people - and those in the neighbouring \"Northuldra\" fall foul of an evil power that could destroy a dam and wash everything away. The animation is pristine, if not especially imaginative, and it's got a couple of belting power ballads - notably \"Into the Unknown\" and \"Show Yourself\" to help the soundtrack augment the pretty sentimental dialogue, that I found a bit wordy and quite dull. It's an Ok film, this - it was always going to be hard to follow the charm and the innovation of the first one. Plonk the kinds in front of it and no harm will be done. Plonk an adult in front of it and ennui might just set in.", "created_at": "2023-06-09T05:03:53.886Z"}]