[{"movie_id": 13515, "review_id": "560ef359c3a368681f00c317", "author_rating": 7.5, "review_text": "The mirrors. They're so clean.\r\n\r\nMirrors is the American remake of a little known Korean film called Into the Mirror. The plot has Kiefer Sutherland as a recovering alcoholic cop, who whilst on suspension is taken to working as a security guard at a large burnt out department store and starts to see terrifying images in the many mirrors about the place... \r\n\r\nYou would think that Mirrors was a flop. The critics hated it and the horror hordes were very much divided on it, the latter of which is to be fair the norm for any big horror movie release. Yet it didn't flop, it did very well at the box offices of the world and has a decent 6.2 average on IMDb, which for a divisive horror film is well above average.\r\n\r\nMirrors overstays its welcome, there really was no need for it to run to just under two hours in length. While elsewhere there's some pretty poor dialogue, parts of the screenplay are pointlessly soap opera in nature, while some thinking will make you scratch your head in bewilderment at events outside of the brilliantly monolithic department store.\r\n\r\nHowever, does Mirrors create a genuinely spooky atmosphere (the interiors of the store are creep fest nirvana), insert some shock moments to jolt you out your seat? Is it visually stylish, with sound work to match? And does Sutherland (and to a degree Paula Patton as his wife) overcome the trite parts of the script and give effective and committed performances? The answer to those questions is yes.\r\n\r\nDoes the ending cop out in any way? Insult the audience? No! It doesn't do that either.\r\n\r\nIt has flaws, but they are not insurmountable for the horror fan who's just looking for some good scares, atmospheric dread and some stylish touches from the director (Alexandre Aja). If you haven't seen it then give it a try, judge for yourself, you might be pleasantly surprised at what you find. 7.5/10", "created_at": "2015-10-02T21:12:57.033Z"}]