[{"movie_id": 549053, "review_id": "5dee1ef4dc86470011c535c8", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI'm not the biggest fan of straight-up romantic comedies (rom-coms). I don't think I absolutely love a film from this genre, and if I do, it probably doesn't solely belong to the rom-com's list (they could also be musicals, dramas, etc). Most of the times, I appreciate them enough to feel fulfilled. Very rarely, I feel totally disappointed or with a hate feeling towards one. Paul Feig delivered a couple of great comedies during his career (Bridesmaids, Spy), and the underrated/overlooked A Simple Favor, which I enjoyed very much. With Emma Thompson (Adelia) as both supporting actress and screenwriter, Emilia Clarke and Henry Golding as protagonists, Last Christmas grew on me in the week of its premiere, making me genuinely excited for its session.\r\n\r\nThis Christmas' movie sort of falls in the middle. I don't exactly \"like\" it that much, but I still left the theater happy and reasonably entertained. It actually possesses a dramatic tone deep within, but it never fully explores it, maintaining the lighthearted and festive vibe throughout most of its runtime. Clarke and Golding share amazing chemistry, and their scenes are very romantic, sweet, and emotional. However, it's more of the same. Last Christmas doesn't bring anything new since it follows the same cliches every other rom-com does.\r\n\r\nIts only bold and different take on the story is a plot twist that raises too many logical questions. Instead of carrying an emotionally powerful impact, it merely delivers an initial shock that goes away once people start to really think about it. Nevertheless, I praise this storytelling choice. It's never easy to pull off a twist, but the truth is that if Emma Thompson and Bryony Kimmings didn't take this missed shot, I wouldn't have spent the whole trip back home thinking about the film. I would have probably forgotten it as soon as I got into the car. So, congrats on trying something different, even if it didn't quite work for me.\r\n\r\nThompson ultimately shines as Kate's mom, though. No missteps here. She's hilarious, and she has some of the funniest lines of the whole thing. Michelle Yeoh (Santa) also has a couple of fun moments, but her subplot feels a bit strained. Emilia Clarke incorporates the clumsiness and awkwardness of her character seamlessly. If you're familiar with Clarke's interviews and public persona, then you know that Kate is basically the over-the-top reflection of Clarke. Despite her lack of luck, she's still charming and a good person that went through a traumatic event that changed her life (duh). Golding is glamorous and perfect as expected, especially since his character needed precisely these attributes.\r\n\r\nTheir relationship grows in a not-so-realistic way, and while this might be justified by the last act's twist, other plot points are not. My main issue with the movie is really those last 20 minutes. In addition to the twist, every single subplot is closed like nothing happened. From a particular family situation regarding sexual orientation to Yeoh's entire side story, all are either solved off-screen or way too easily. It's a rollercoaster of good and bad writing decisions. It has a couple of exciting downwards slopes and tight turns, but most of it is a slow ride with nothing truly thrilling or astonishing.\r\n\r\nLast Christmas tries to be \"the next big thing\" concerning Christmas classics, but it falls short of its goal. Boasting a fantastic cast, with two charming, compelling leads in Emilia Clarke and Henry Golding, Paul Feig delivers a lighthearted, festive film, but stuffed with cliches and a twist that doesn't quite work. Emma Thompson shines as a supporting character but has some missteps in co-writing the story with Bryony Kimmings, showing significant struggles in tying up the loose threads left by the side stories. Despite its storytelling issues, it's a flick I recommend to anyone who loves seasonal movies with a beautiful message, some fun moments, and a score packed with our favorite George Michael's songs.\r\n\r\nRating: C+", "created_at": "2019-12-09T10:16:20.900Z"}, {"movie_id": 549053, "review_id": "5e39c040d1a893001ad06364", "author_rating": 6.0, "review_text": "Some nice moments and I did like the cast as Emilia Clarke and Henry Golding had some nice chemistry. The twist felt forced but I guess I should expect it from a sappy Christmas movie. IDK, I enjoyed parts of this mostly for the core cast though doubt I'd have much desire to watch again (also feels odd watching a Christmas movie like this in February). **3.25/5**", "created_at": "2020-02-04T19:04:32.792Z"}, {"movie_id": 549053, "review_id": "61bc935aa44d0900428a3a07", "author_rating": 9.0, "review_text": "I will freely admit to being a fairly easy grader when it comes to sci-if movies and romantic comedies. If the dialogue is realistic and sharp and the plot doesn’t insult my intelligence, I am in.\r\n\r\nI enjoyed Last Christmas on that basis and because of what I saw as a good group of actors. The script was co-written by Emma Thompson and her spouse, Greg Wise (Willoughby in Sense and Sensibility, also written by Thompson. Hmm.) I found Kate’s character development from being a rather selfish slacker to a decent person fairly believable as it was tackled gradually and partly based on events happening all around her, not just on her developing feelings for bike-riding Tom. \r\n\r\nThe Yugoslav family history and cultural influences felt odd and somehow not related to the plot until the midpoint or so of the movie, where it gradually began to feel like a relevant side plot to the story. I must say that I saw the climactic plot twist revelation coming a mile away, but I do   write novels in my spare time, so I tend to wonder about where a story is going rather than merely enjoying having it wash over me like I should.\r\n\r\nThis movie may not become annual holiday viewing for me, but I will definitely watch it again next Christmas and give it at least a shot of becoming a seasonal viewing ritual.", "created_at": "2021-12-17T13:40:42.136Z"}, {"movie_id": 549053, "review_id": "624048c697a4e6005bd28850", "author_rating": 6.0, "review_text": "This is quite a joyous little Christmas film with an interesting twist at the end and a gentle reminder for us to consider those less fortunate at this time of year. Emilia Clarke carries off her role as a slightly self-destructive elf quite charismatically - though the script is a touch wordy at times. Emma Thompson and Michelle Yeoh steal their scenes and the Wham/George Michael soundtrack adds a soupçon of nostalgia to the proceedings. The hero is, however, a bit of a drip. Easy on the eye, but he is still a bit of a wet blanket. That said, they all look like they had fun making this, and that does come across. At any other time of year, I probably wouldn't recommend this at a cinema, but it does put a smile on your face so go on, give it a go!", "created_at": "2022-03-27T11:21:42.870Z"}]