[{"movie_id": 15268, "review_id": "5a562104c3a3685ebf022c43", "author_rating": 6.0, "review_text": "**_I'd rather watch this than any of the Iron Man films__**\r\n\r\nNo, it's not amazing and no the story is not an emotional journey that makes you both laugh and cry... but.\r\n\r\nIt's a video-game adaption, and you really can't go in to them thinking they are gonna blow your socks off because really, most of them aren't that great.\r\n\r\nThe 1994 Jean Claude Van Damme adaption was genuinely awful and that was pretty true to the (no) plot of the video-game so of course they had to do something different here, which I am glad they did, not just fighting all the time but an actual story.\r\n\r\nNow of course the story does have a bunch of plot holes (but honestly what video-game adaption that doesn't?) and Chris Klein's acting in particular is pretty dodgy, he plays a tough guy cop which he tried to do again in CAUGHT IN THE CROSSFIRE (2012) but he fails every time.\r\n\r\nI like him fine usually but yeah he's not at all believable as a 'bad ass'.\r\n\r\nBetter is Kristin Kreuk in the lead and Michael Clarke Duncan and Neal McDonough are pretty cool as the bad guys.\r\n\r\nAnd most of the fight-scenes are pretty well orchestrated (except perhaps the dance-club scene) and the cinematography is good and keeps at a good pace plus a pretty good soundtrack as well.\r\n\r\nAll in all, not a 'great film' but perfectly watchable if you leave your thinking cap on the shelves and just take it for what it is, if you enjoyed ELEKTRA (2005) you should be able to enjoy this... If you didn't (which granted many didn't) then tread carefully I suppose.\r\n", "created_at": "2018-01-10T14:19:48.723Z"}, {"movie_id": 15268, "review_id": "63c5cfb770b44400b669d50f", "author_rating": 4.0, "review_text": "**It's impressive how this terrible movie makes the outrageous cheese of the 1994 Van Damme film look like a masterpiece.**\r\n\r\nTwo stars might be generous for this one, but I had a fun theater experience laughing with my friends at how unabashedly awful this movie was. Movies like this are why video game adaptations have such a bad reputation. Street Fighter: The Legend of Chun-Li tried to make a gritty, more realistic version of the games while simultaneously using every cheesy cliche they could imagine. I can go down the list from there on how bad the acting, stunts, fighting, and costumes were. This movie felt like a bad straight-to-TV movie directed by the B-team at the CW. The crazy thing is that Capcom was heavily involved in this film and still let this disaster see the light of day. Hopefully, it's been long enough for a Street Fighter reboot to make its way to the silver screen once again.", "created_at": "2023-01-16T22:29:11.713Z"}]