[{"movie_id": 37686, "review_id": "50c3e6cf760ee33d5a000a64", "author_rating": 5.0, "review_text": "Unsuccessful children movie trying to follow the tradition of The Goonies or E.T. from overrated J.J. Abrams.\r\n\r\nTons of money are wasted on FX trying to hide a weak story and a set of terrible dialogues supposedly coming from children that are totally overacted and annoyingly always shouting.\r\n\r\nYou don't miss anything if you skip Super 8.", "created_at": "2012-12-09T01:18:07.000Z"}, {"movie_id": 37686, "review_id": "5c4450469251412bf4dda110", "author_rating": 5.0, "review_text": "I kind of liked the making-a-movie-within-the-movie aspect of _Super 8_ a lot more than the chief plot with the monster and the train and the badman government and the blah blah blah. Which isn't ideal, but saying that obviously means I liked something about it.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T10:41:10.712Z"}, {"movie_id": 37686, "review_id": "5d66627b58361b0011221400", "author_rating": 9.0, "review_text": "And I just knew then that I was there, that I existed.\r\n\r\nSuper 8 is written and directed by J. J. Abrams. It stars Joel Courtney, Elle Fanning, Kyle Chandler, Ron Eldard and Riley Griffiths. Music is scored by Michael Giacchino and cinematography by Larry Fong. The film tells the story of a group of young teenagers in Lillian, Ohio, 1979, who are filming their own Super 8 zombie movie when a train derails and crashes, releasing an unknown being into their midst. As the town is threatened and mysteries start to mount up, the youngsters must come to terms with not only that, but also growing up mentally and physically.\r\n\r\nIt's feels nigh on impossible to come across a review for Super 8 that doesn't contain the name Spielberg. With the film overtly Spiebergian in themes and production, and the bearded maestro of the film geek masses on producer duties here, his name hangs over Abrams' movie like a watchful father figure. If that bothers Abrams, or indeed if it detracts from the quality of his movie? Then that's up for debate by those not enamoured with Spielberg's movies of the late 70s and early 80s. But to my mind it's a blessing, a triumph of sorts to be mentioned in the same breath as the beard and those wonderful movies of his. Part homage, part nostalgia harking, Super 8 is still one great, sweet and affecting J.J. Abrams movie.\r\n\r\nAbrams himself is on record as saying that Super 8 is born out of two movie ideas he had, this while also being drawn from his own recollections in childhood, and the two movie idea shows. It's very much a two part picture in structure, part Stand by Me coming of ager, part Goonie like monster hunt. Nothing wrong with that, mind. However, with that comes some form of irritation to those who venture in expecting a big ole alien attack movie. Oh for sure he exists, and he is big and mean, although he has just cause, but the creature is not the centre piece of the movie. It's the human characters that form the basis of Super 8, be it the kids adjusting to their changing emotions and hormones, or the single parent fathers coming to terms with absence of love and grief, Super 8 is brimming with human heart. Yet never is it schmaltzy.\r\n\r\nPRODUCTION VALUE!\r\n\r\nAided by Fong's warm metallic hued photography and Giacchino's beautiful heart tugging score (both energised in Blu-ray), Super 8 always carries a magical mysticism to it. The warm glow of nostalgia cloaks the proceedings, never cloying, always smile inducing, offering comfort as the narrative deals out observations about the need to let go while playing out as a deft, if unsubtle, meditation on grief and growing pains. The cast do wonders for their director, Fanning and Courtney are exemplary, so much raw emotion and energy, it's unfussy and believable acting. Griffith's, too, is wonderful as the booming voiced wannabe director, a tender nod of the head to the many young amateur directors out there; of which Abrams was once one himself. While Eldard and Chandler as the two fathers are most affecting, the pangs of juggling single parenting with loss are deeply portrayed.\r\n\r\nOf the director himself? He crafts it with care and precision, a knowing of the pulse beat of the thematics to drive it forward. His attention to period details are admirable, from the dialogue sparks involving Walkman's and Soviet paranoia, to the items located within the bedrooms and houses of our young protagonists, he is a man who knows his late 70s and early 80s onions. Spielberg was far from finished as a film maker of note at the time of Super 8's release, but it did feel then that the torch was deftly being passed sideways. After the excellence of Star Trek he followed up with this most delightful of movies, where Abrams showed in his work a love of cinema that's wholly infectious. 9/10", "created_at": "2019-08-28T11:16:11.328Z"}, {"movie_id": 37686, "review_id": "5e885cf7d55c3d001a5130fc", "author_rating": 10.0, "review_text": "Sometimes I feel like my interests and taste really follow the road less traveled. This is to say that Super 8 surprised me by becoming one of my Favorite.Movies.Ever. There I said it.\r\n\r\nIt seems to merge genres slightly: science fiction, of course, a bit of coming of age, a slice of movie-within-a-movie - is that all?  \r\n \r\nI think I have watched this movie three times, and probably will again. It reminds me of Monsters, another low key sci-fi/monster movie I really like. The train scene about twenty minutes into Super 8 is a blockbuster scene, so much so that I believe most movies wouldn't be able to keep the rest of the film from being anti-climactic. Usually a tremendous scene like that is saved for the end of a movie, but the plot required to be right where it was. But although the action and suspense ramps down a bit following it, the movie goes to work on building up the rest of the plot and growing the characters.\r\n\r\nThe young actors starring in this movie are terrific, in my opinion, which may place me in an unfortunate minority. But judge for yourself, and try not to set the bar of excellence higher than we do for adult actors. They are smart and witty at times, but are clearly kids with kid behavior at other times, rather than miniature adults with adult lines. \r\n\r\nSo you notice I used the words 'favorite movie,' not best. I am sure there are hundreds of movies better made than this one, but I doubt I would want to watch too many of them multiple times like I have watched Super 8.", "created_at": "2020-04-04T10:09:59.587Z"}, {"movie_id": 37686, "review_id": "639f9872223e2000a8b4b16a", "author_rating": 7.0, "review_text": "Film of the events of a group of boys who enjoy filming with super 8. Their aim is to make a film since they love the magic of cinema. At first the train wreck is more scenic than realistic. Both the plot at certain points and the setting are very reminiscent of the Stranger Things series. I think the creators of the TV series were also inspired by this film. This is a film that is also suitable for children to watch. The end didn’t convince me much. It’s a pleasant film but in some points it could have been developed better. Film that I recommend to lovers of the late 70s and lovers of stories about a group of friends. A typically American movie.", "created_at": "2022-12-18T22:47:14.039Z"}]