[{"movie_id": 566927, "review_id": "5ef3e54fd6819b0036746bd6", "author_rating": 6.0, "review_text": "Some skits/challenges held together with a thin storyline - the guys going to Miami to hang with Paula Abdul who they had a run-in with back in 1999. The scripted segments were fine even though their talents are made for that sort of thing and the skits did have me rolling, though I am a fan. That said, of the 90-minute running time, I think about half the movie are the challenges. But if you're a fan of the show, it's fine for one viewing, but I'll stick with the episodes. **3.0/5**\r\n\r\nAs a side, the Blu-ray release has no bonus material and one would think there are deleted scenes or even some behind-the-scenes footage or something.", "created_at": "2020-06-24T23:44:15.750Z"}, {"movie_id": 566927, "review_id": "5f4d291c223a8b0035b0abc1", "author_rating": 7.0, "review_text": "I went into “Impractical Jokers: the Movie” knowing absolutely nothing about the concept or the group of four comedians, who have a popular television show of the same name on truTV. I left the theater with tears in my eyes from laughing so heartily. Think of this as a hybrid between classic episodes of “Candid Camera” mixed with a not-as-gross version of “Jackass.”\r\n\r\nTheir shtick is that the four lifelong friends (Joe Gatto, James Murray, Brian Quinn and Sal Vulcano, also known as The Tenderloins) compete in a serious of outrageous dares with the final goal of embarrassing each other. Aided by hidden cameras and microphones, the guys challenge each other to say or do something and if they refuse, they lose. If you think that sounds funny, or if you frequent the website Funny or Die, you’ll probably enjoy this movie.\r\n\r\nThe film takes this idea and wraps it around a very loose plot. It tells the story of a humiliating high school mishap from the early 1990s that sends the Jokers on an epic road trip from New York to Miami, competing in hidden camera challenges along the way. Almost every gag hits and hits big, and I haven’t laughed this much in a movie theater in a long, long time.\r\n\r\nThere are some obvious one-liners that only fans of the show will get (like the repeated jokes about the 5th season; wow that must’ve been bad!), but it was easy for me to be thrust right into the gang of forty-something gagsters. Maybe it worked for me because I had no prior background. But I immediately liked all of these guys, and there’s something satisfying and entertaining about watching grown men endlessly goofing around. I really enjoyed spending time with them.", "created_at": "2020-08-31T16:45:16.782Z"}]