[{"movie_id": 375262, "review_id": "5c43fb4b0e0a266d66d26929", "author_rating": 6.0, "review_text": "Overrated? Most assuredly, but utterly engaging from beginning to end. Not Yorgos' most humorous piece, but technically sound and brilliantly acted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:38:35.310Z"}, {"movie_id": 375262, "review_id": "5c5dbecdc3a3683cdb8c413c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThe Favourite is one of the most acclaimed movies of last year, receiving multiple nominations at dozens of awards shows and winning a whole bunch of them (2nd most awarded film of 2018, behind Roma). Being a fan of Yorgos Lanthimos’ style, I couldn’t be happier for him, and I was now even more excited to watch what he produced and directed. This movie is a classic example of an Oscars’ tradition of sorts. A lot of audience members make their mission to watch every Best Picture nominee before the big night, and there’s always one film that people fail to grasp on why did it get so much praise? Why are critics all around the world absolutely loving what audiences perceive as an “okay” time at the theater, but which contains a long, weird and maybe even dull (for some) story?\r\n\r\nWell, first of all, this is technically a masterpiece. I mean, every single technical aspect is worthy of recognition. The production and set design are gorgeously eyegasmic. The score is unusual for a period piece like this, but it weirdly works, as it continuously elevates the tension between the three main characters and helps the story flow with an always conspicuous, treacherous feeling. Even the cinematography and the plays with candlelight offer some pretty neat scenes. However, and prepare to be surprised, the costume design steals the show from all the other achievements. This is coming from a guy who has utterly no interest in this particular matter and who rarely talks about it, so I’m as surprised as you are. \r\n\r\nIt’s not due to the costumes being pretty or appropriate to the time period. Almost every movie that tackles these times nail the costume design, but only a few can tell a character arc through it. Even less are capable of embodying the whole screenplay like this Oscar-bait does. Our protagonists have distinct journeys, but their ends all have similarities. One way of understanding the story is through what they wear, which seamlessly represent the arc that each character takes to get where they eventually end up. These layers of storytelling keep the film intriguing, but Lanthimos’ uncommon methods plus McNamara and Davis’ script will displease some audience members.  \r\n\r\nThe Favourite is that movie that audiences are going to be perplexed about why do critics adore it. There’s no secret, really. Audience members don’t care about the technical part of films. They couldn’t care less about costume design, cinematography, score or how the screenplay is written. They want to be entertained and have a good time at the theater, so I find reasonable if people leave a bit disappointed with one of the most critically acclaimed movies of 2018. Lanthimos doesn’t deliver formulaic stories, and he certainly doesn’t film them in a regular fashion, so I firmly believe the general public isn’t really going to enjoy this one. His unique style brings a very different tone, pace and filming techniques that people aren’t used to experiencing. Fortunately, there’s more than just technical attributes to this film. Three magnificent and powerful performances from Olivia Colman, Emma Stone, and Rachel Weisz, carry the whole thing to safe harbor.\r\n\r\nThese three actresses deserve every single nomination they got so far. Colman delivers both a hilarious and emotionally heavy display, as Anne. An incredibly fragile Queen with a shockingly traumatic past, whose love and affection is being fought for between Abigail and Sarah. Most of the laughs this movie gives are through Anne and her petty behavior towards her servants. Colman delivers her body and soul to her role, adding yet another fantastic performance to her splendid career. Weisz is just flawless. Sarah‘s arc is Abigail‘s opposite in almost every way, and Rachel is remarkably sharp. She doesn’t really have a definite shining moment like Stone or Colman have, but it’s a consistent and robust display from an actress who needed a return to the spotlight.\r\n\r\nNevertheless, it’s Emma Stone who shines through with an unbelievable range of emotions and expressions. Her performance in La La Land is great, but as Abigail she is outstanding! She handles her character’s personality change with an impeccable transition regarding her acting and the only reason why she’s probably not getting the Oscar win, is due to the campaign supporting Regina King (If Beale Street Could Talk). Abigail is the character that moves the plot forward by trying to steal Sarah‘s place near the Queen. Her intelligent and manipulative moves are extremely captivating, as well as her will to gain Anne‘s love.\r\n\r\nYorgos Lanthimos knows his craft and his weird yet unparalleled style is something that will surely deliver even more divisive and confusing films in the future. From the camera angles to his methods of storytelling, he’s one hell of a director-writer-producer! Technically, The Favourite is undoubtedly one of the best movies of the last year. The impressive production and set design plus the addictive score definitely raise the film, but the costume design tells a whole story through what the characters dress during the whole runtime. The screenplay is remarkably-written, filled with complex dialogues and several twists and turns, which lead our characters through eventful arcs. \r\n\r\nOlivia Colman and Rachel Weisz deliver compelling performances, but Emma Stone is in another level. Her range is mind-boggling, and she carries a big responsibility by portraying the character who changes the whole story. Nevertheless, the movie feels a bit too long, and the story drops its interest levels during the transition from the second to the third act. Basically, I’ll put it like this: if you’re just a regular audience member who only goes to the theater to eat popcorn while being entertained, The Favourite isn’t going to make you eat your whole bucket; if you watch films through a more in-depth look, then you’ll be as marveled as I was by the end of it.\r\n\r\nRating: A-", "created_at": "2019-02-08T17:39:25.463Z"}, {"movie_id": 375262, "review_id": "5ce734fb9251412cecc43189", "author_rating": 10.0, "review_text": "Hugely entertaining film from start to finish, with amazing performances from the three lead women. Emma Stone proves that once again she's not just a pretty face as the conniving and troubled Abigail, Rachel Weisz is always on form as the controlling and vindictive Sarah and Olivia Coleman deserved the Oscar as the childish and sickly Queen Anne. Nicholas Hoult's foppish rogue Harley steals every scene he is in.\r\n\r\nYorgos Lanthimos once again has made a beautifully shot film using  mostly natural light. I can't overstate that this film looks gorgeous. Many times over I thought of Barry Lyndon, but with tonnes of humour, foul language, and no Ryan O'Neal to destroy the soul of the film.\r\n\r\nI originally gave this 9/10 because I didn't like the use of fish-eye lens, but I couldn't stop thinking of how much I enjoyed it so I bumped it up to 10.\r\n\r\nBest film I have seen in a very long time.", "created_at": "2019-05-24T00:04:11.329Z"}, {"movie_id": 375262, "review_id": "5d1fc6c315c6361729f3c567", "author_rating": 7.0, "review_text": "**_Fans of Yorgos Lanthimos will love it_**\r\n\r\n> _A setback for women? How can it set women back to prove that women fart and vomit and hate and love and do all the things men do? All human beings are the same. We're all multifaceted, many-layered, disgusting and gorgeous and powerful and weak and filthy and brilliant. That's what's nice. It doesn't make women an old-fashioned thing of delicacy._\r\n\r\n- Olivia Colman; \"_The Favourite_ Blows Up Gender Politics With the Year's Most Outrageous Love Triangle\" (Tatiana Siegel); _The Hollywood Reporter_ (November 14, 2018)\r\n\r\n_The Favourite_, the seventh feature from Greek auteur Yorgos Lanthimos, is a film that eschews both convention and expectation. On the other hand, it's also Lanthimos's most accessible by a country mile. Imagine, if you will, a narrative combining Joseph L. Mankiewicz's _All About Eve_ (1950), Ingmar Bergman's _Viskningar och rop_ (1975), and Mark Waters's _Mean Girls_ (2004) filtered through the aesthetic sensibilities of Stanley Kubrick's _Barry Lyndon_ (1975), Peter Greenaway's _The Draughtsman's Contract_ (1992), and Stephen Frears's _Dangerous Liaisons_ (1988), topped off with a dash of Luis Buñuel at his most socially satirical, and you'll be some way towards imagining this bizarre and uncategorisable film from a director with as unique and distinctive a voice as you're likely to find in world cinema. A savage morality play, a camp comedy of manners, a Baroque tragedy, an allegorical study of the corruptive nature of power – it's all of these and yet none of them. I haven't seen Lanthimos's first two films, _O kalyteros mou filos_ (2001) and _Kinetta_ (2005), but I adored _Kynodontas_ (2009), as difficult as it was to watch. I was a little indifferent to _Alpeis_ (2011), but I loved _The Lobster_ (2015), his blackest comedy thus far. His last film, however, _The Killing of a Sacred Deer_ (2017) did very little for me, as I felt it offered nothing we hadn't seen in his previous work. So I came to _The Favourite_ wanting to like it, but ready to dislike it. And I find myself somewhere in the middle. On the one hand, it's too long, the plot too threadbare, and the metaphors and allegories too ill-defined. On the other, the acting is flawless, it looks amazing, the first half is very, very funny, and the end is very, very dark, with the last shot one of the most haunting/disturbing images I've seen in a long time.\r\n\r\nEngland, 1708. Queen Anne (an absolutely mesmerising Olivia Colman) has been on the throne for six years, with Great Britain finding itself enmeshed in the War of the Spanish Succession. In poor health, Anne has little interest in politics, with the real power lying with her friend, adviser, and secret lover Sarah Churchill, Duchess of Marlborough (an icy Rachel Weisz). Sarah and Prime Minister Sidney Godolphin (James Smith) plan to finance the war effort by doubling property taxes, but are opposed by the leader of the opposition – Robert Harley, Earl of Oxford (Nicholas Hoult). Meanwhile, Sarah's impoverished younger cousin, Abigail Hill (Emma Stone, charting a course from doe-eyed _ingénue_ to vicious Machiavellian _intrigant_), arrives at Court looking for work. Sarah secures her a position as a scullery maid, but when Abigail learns that Anne is suffering from gout, she uses a herbal remedy on the sleeping Queen without asking permission. Sarah has her whipped for her presumption, but Anne sees a noticeable improvement in her condition, and by way of apology, Sarah gives Abigail a position closer to the Queen. With Harley hoping to use Abigail as a spy to find out what Sarah is planning, and Samuel Masham (Joe Alwyn), a foppish courtier, attempting to woo her, Abigail must quickly adapt to courtly life. Learning of the lesbian relationship between Anne and Sarah, Abigail begins to ingratiate herself with the Queen, leading to a bitter contest between herself and Sarah, as each attempt to establish themselves as Anne's favourite.\r\n\r\n_The Favourite_ is the first film Lanthimos has directed which neither he nor Efthymis Filippou wrote. Although it deals with real historical personages and events, historians probably won't be too thrilled to learn that Lanthimos and his screenwriters Deborah Davis and Tony McNamara are relatively uninterested in either historical actuality or socio-political contextualisation (to say nothing of the slam dancing and frequently anachronistic dialogue). For example, there's no reference to the Glorious Revolution (1688), which saw James II, the last Catholic monarch of England, overthrown; or to the Treaty of Union (1707), which formally brought the state of Great Britain into existence. Similarly, it is never mentioned that Anne was the last Stuart monarch or that Abigail was appointed Keeper of the Privy Purse in 1711. The nature of the political antagonism between the Tories and the Whigs, although often referred to and occasionally witnessed, is kept vague, with little in the way of an historical frame of reference. For example, the film never addresses the fact that Godolphin and Harley were both Tories, with Godolphin heading an administration dominated by leading Whigs (the Whig Junto), and Harley leading a coalition of Country Whigs and Tories in opposition.\r\n\r\nOn the other hand, there's no evidence whatsoever that Anne and Sarah were lovers. On the contrary, Sarah is known to have found lesbianism abhorrent, commissioning the politician Arthur Maynwaring to write scurrilous poems about Abigail which intimated that she might be gay. Additionally, Anne was devoted to her husband, Prince George of Denmark, who doesn't even warrant a mention, let alone an appearance, despite being alive and well at the time of Abigail's arrival at Court. However, it's also important to note that the film makes no claim to be a history lecture. This is a story about a love triangle, with everything else just the background noise against which that triangle plays out.\r\n\r\nBut although it may not be historically accurate, it is most definitely a Yorgos Lanthimos film, with his peculiar _Weltanschauung_ omnipresent. The emotionless and monotone delivery of dialogue has been scaled back considerably from _The Lobster_ and _Sacred Deer_, but everything else you'd expect is here – the pseudo-omniscient judgemental glare; the dark absurdist sense of humour; the formal rigidity; the emotional isolation of the characters; the surrealism; the games of psychological one-upmanship; the alienation of the audience; the thematic centrality of shifting power relations; the lack of distinction between poignancy and joviality; the use of self-contained and closed off pocket universes where characters must play by rules differing from those of the outside world; intimate familial conflict (except in bigger rooms than in his previous films); and a disorienting score, which mixes pieces by Purcell, Vivaldi, Handel, and Bach with more contemporary work from the likes of Olivier Messiaen, Luc Ferrari, and Anna Meredith, whilst the closing credits feature Elton John's \"Skyline Pigeon\" (really). Similarly, whilst _The Lobster_ was a savage dystopian-set allegory for discipline and conformity, _The Favourite_ is a merciless satire of decadence and pettiness, taking in such additional themes as class, gender, love, lust, duty, loyalty, partisan politics, patriarchal hegemony, and women behaving just as appallingly as men.\r\n\r\nAs one would expect from Lanthimos, the film is aesthetically flawless, with many of the compositions having the appearance of a _fête galante_ painting, so meticulously integrated are the costume design by Sandy Powell (_Interview with the Vampire_; _Shakespeare in Love_; _Carol_), the production design by Fiona Crombie (_Snowtown_; _Truth_; _Mary Magdalene_), and the cinematography by Robbie Ryan (_Fish Tank_; _Philomena_; _American Honey_). Powell's costumes are historically inaccurate, but thematically revealing, with the situation of the characters at any given moment directly influencing the design. For example, speaking to _Entertainment Weekly_, Powell says of Abigail and her rise to a position of influence,\r\n\r\n> _I wanted to give her that vulgarity of the_ nouveau riche_, and her dresses get a little bolder and showier. There's more pattern involved and there are black-and-white stripes. I wanted her to stand out from everybody else as trying too hard._\r\n\r\nIn a more general sense, the black-and-white colour scheme of much of the wardrobe contrasts magnificently with Crombie's predominantly brown production design, with the actors effortlessly standing out from the backgrounds. The occasional use of black-and-white stripes is also worth mentioning, as it subliminally intimates that the characters are imprisoned, not so much by their physical _milieu_, but rather within the hypocrisy, pettiness, and forced politeness of the Royal Court.\r\n\r\nOf Ryan's photography, perhaps the most impressive feat is that, despite the many scenes tracking characters through rooms, up stairs, and out doorways, there's not a single Steadicam shot anywhere in the film. He also makes copious use of 6mm fish-eye lenses, which distort the spaces the characters occupy whilst also showing much more of the environment than a normal lens, creating the sense of characters lost within an overload of background visual detail. Combined with the whip pans seen throughout the film, the cumulative effect is a world rendered strange, a place of distortion and unnatural compositions. As Ryan explains to _Deadline_,\r\n\r\n> _by the nature of being able to see everything in front of you, you then get a sense that the characters are almost imprisoned in the location. Even though they have all this luxury and power, they are a little bit isolated in this world. By showing you the whole room and also isolating the character in a small space you get a feeling of no escape._\r\n\r\nAs with most of Lanthimos' work, the film also uses natural light, which makes for some stunning candle-lit night-time compositions, partially recalling the paintings of someone like Jean-Antoine Watteau or, even moreso, Georges de La Tour.\r\n\r\nIn terms of acting, there really are no words to describe just how good Colman is. Utterly inhabiting the character, she is able to elicit empathy mere moments after behaving thoroughly shamefully, communicating a sense of both tragic inevitability and a childlike refusal to accept reality. The character could easily have been a grotesque villain or a pitiful broken shell, but Colman finds a nobler middle ground, straddling both interpretations without fully committing to either, moving from one to the other seamlessly throughout the film. Yes, she can be a horrible person with appalling manners and questionable hygiene, but she is also deeply lonely, a survivor who has lost 17 children in childbirth, a woman whose health has made her old before her time, a deeply tragic figure too naïve to see how badly she is being manipulated by Sarah and Abigail, something encapsulated brilliantly in the haunting last shot. Rather than trying to downplay the contradictory facets of the character, Colman leans into them, illuminating Anne's humanity amongst her least appealing characteristics, and finding both wit and pathos in a character whose mercurial nature and excessive neediness could easily have rendered her the film's antagonist. It truly is one of the finest on-screen performances in a long time.\r\n\r\nWeisz and Stone are also both excellent. Weisz plays Sarah as a clinical manipulator, highly intelligent and relatively emotionless, whereas Stone's Abigail grows from a guileless chambermaid to a vindictive Janus-faced usurper. However, even at her most outrageous, there remains always something of the innocent girl we met earlier in the film.\r\n\r\nThe film's most salient theme, one could argue its very _raison d'être_, is the dynamic of gender politics. For starters, it's headlined by three actresses (something which is still rare enough as to be notable), whilst the only two male characters of any significance (Godolphin and Harley) are both portrayed as petty, vainglorious idiots. Indeed, men in general are background players, existing only to be mocked, exploited, and duped – with their ridiculous wigs and heavy makeup, they exist only to support the women. Speaking to _Entertainment Weekly_, Powell explains that Lanthimos wanted the women to have natural hair and light makeup, and the men to wear gaudy makeup and ridiculous wigs;\r\n\r\n> _normally films are filled with men, and the women are the decoration in the background, and I've done many of those, so it was quite nice for it to be reversed this time where the women are the centre of the film and the men are the decoration in the background._\r\n\r\nSimilarly, speaking to the _Hollywood Reporter_, Weisz explains,\r\n\r\n> _what's interesting to me is that the men in_ The Favourite _are wearing lots of makeup and blusher and lipstick and high heels. That they're peripheral characters who are slightly ridiculous. They're an afterthought. That may not be unusual in life, but it's unusual to see in films._\r\n\r\nHowever, what's especially interesting about the film's depiction of gender is that the world of women is anything but a utopia. Yes, it's relatively free of toxic masculinity and the male gaze, but in most other aspects, there's no real difference between the matriarchy and the patriarchy. Sure, the women are much smarter than the men who surround them, but they are no less greedy or cruel. At the film's post-première press conference at the Venice Film Festival, Lanthimos explained,\r\n\r\n> _what we tried to do is portray women as human beings. Because of the prevalent male gaze in cinema, women are portrayed as housewives, girlfriends...Our small contribution is we're just trying to show them as complex and wonderful and horrific as they are, like other human beings._\r\n\r\nThe preening and pettiness of the men, of course, is purposely overdone (Harley proclaims at one point that \"_a man must look pretty_\"), creating a _milieu_ where it is men, not women, who tend to be judged by their appearance, objectified, and used. Just look at the hilarious scene where Abigail coldly gives Masham a hand-job as she ruminates about more important matters – once she has gotten what she wants from him (his hand in marriage), she is no longer interested in him whatsoever, a direct reversal of traditional filmic gender roles, where it is usually men who use women. Men, in _The Favourite_, are utterly disposable.\r\n\r\nAs regards criticisms, although I personally wouldn't class them as flaws, some people will probably dislike the same things that many have disliked in Lanthimos's previous work – cold formal rigidity, perverse sense of humour, and irredeemable characters being irredeemably horrible to one another. There will be those who find the obviously intentional anachronisms too much, whilst others will take umbrage with the disregard for historical authenticity. For me, whilst I admire Lanthimos for trying to bring something new to his _oeuvre_, especially when compared to _Sacred Deer_, I felt the film was oftentimes trying to work its way through an identity crisis, unsure of exactly what kind of tone to settle on. I had similar feelings about the allegories that run throughout, but are never what you would call fully fleshed out. Obviously, it's a treatise on power and the ridiculous opulence of royalty, but that's not exactly an untapped issue in cinema. Additionally, one of my biggest problems with _Sacred Deer_ was how utterly pointless it felt, and although I got a lot more out of _The Favourite_, I had something of the same reaction to it. It could also be argued that the characters are a little two dimensional, and filmgoers who need a protagonist to latch onto, someone to root for, will be left rudderless.\r\n\r\n_The Favourite_ will probably attract a sizable unprepared audience because of awards buzz, positive reviews, and excellent trailer. Undoubtedly, for a lot of people, this will be their first exposure to Lanthimos, and I can only imagine what people expecting a Merchant-Ivory costume drama will make of it all. Neither morally enlightening nor historically respectful, _The Favourite_ offers a bleak assessment of humanity's core drives; not Lanthimos's bleakest, but a hell of a lot more nihilistic than an average multiplex goer will be used to. The characters within the film live in a _milieu_ of egotism, narcissism, sexual cruelty, psychological bullying, greed, and hunger for power. There's barely a hint of sentimentality, and very little that could be called morally righteous. I would have liked it to have more meat on its bones, but at the same time, one cannot deny that it presents something of a faithful looking-glass, as Lanthimos continues to corner the market in pointing out not just humanity's worst foibles, but its most egregious eccentricities and lamentable character defects.", "created_at": "2019-07-05T21:53:07.868Z"}, {"movie_id": 375262, "review_id": "5e76b130a055ef00182d497f", "author_rating": 7.0, "review_text": "Some wounds do not close; I have many such. One just walks around with them and sometimes one can feel them filling with blood. \r\n\r\nThe Favourite is directed by Yorgos Lanthimos and written by Deborah Davis and Tony McNamara. It stars Olivia Colman, Rachael Weisz, Emma Stone, Faye Daveney, James Smith, Mark Gatiss, Willem Dalby and Nicholas Hoult.     \r\n\r\nIn early 18th century England, a frail Queen Anne (Colman) occupies the throne and her close friend, Lady Sarah (Weisz), governs the country in her stead. When a new servant, Abigail (Stone), arrives, her charm endears her to Sarah. \r\n\r\nA critical darling with awards and nominations to match, The Favourite, to me at least, is something of an acquired taste. Firstly it should be noted that as a history lesson it's pure bunkum, so much so I wondered if Lanthimos is actually Mel Gibson. Though to be fair to Lanthimos, he never hid from the fact he and his writers were pretty much making it up for entertainment purpose.\r\n\r\nThe craft on show is top level, with three high quality lead lady performances giving their all for the director. Lanthimos also has some nifty camera tricks up his sleeve, it's clear that this is a talent to follow for those so inclined to his off kilter type of film making. Helps, too, that the costuming and set designs are also from the top draw. It's hard to fault from a production standpoint.\r\n\r\nNarratively the pic is pulsing with parliamentary politics that blends with royal shenanigans. Yet ultimately the prime concern is about the battle for Queen Anne's soul between Sarah and Abigail. This consistently remains fascinating, even as Lanthimos continues to sex things up and pitches black comedy alongside the tragic thrum at the core. \r\n\r\nIt's an odd mix of a film that I personally don't think works as a whole, and with the finale a crushing disappointment, it leaves one in awe and yet also unsatisfied. 7/10", "created_at": "2020-03-22T00:28:32.835Z"}, {"movie_id": 375262, "review_id": "5c43fb4b0e0a266d66d26929", "author_rating": 6.0, "review_text": "Overrated? Most assuredly, but utterly engaging from beginning to end. Not Yorgos' most humorous piece, but technically sound and brilliantly acted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:38:35.310Z"}, {"movie_id": 375262, "review_id": "5c5dbecdc3a3683cdb8c413c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThe Favourite is one of the most acclaimed movies of last year, receiving multiple nominations at dozens of awards shows and winning a whole bunch of them (2nd most awarded film of 2018, behind Roma). Being a fan of Yorgos Lanthimos’ style, I couldn’t be happier for him, and I was now even more excited to watch what he produced and directed. This movie is a classic example of an Oscars’ tradition of sorts. A lot of audience members make their mission to watch every Best Picture nominee before the big night, and there’s always one film that people fail to grasp on why did it get so much praise? Why are critics all around the world absolutely loving what audiences perceive as an “okay” time at the theater, but which contains a long, weird and maybe even dull (for some) story?\r\n\r\nWell, first of all, this is technically a masterpiece. I mean, every single technical aspect is worthy of recognition. The production and set design are gorgeously eyegasmic. The score is unusual for a period piece like this, but it weirdly works, as it continuously elevates the tension between the three main characters and helps the story flow with an always conspicuous, treacherous feeling. Even the cinematography and the plays with candlelight offer some pretty neat scenes. However, and prepare to be surprised, the costume design steals the show from all the other achievements. This is coming from a guy who has utterly no interest in this particular matter and who rarely talks about it, so I’m as surprised as you are. \r\n\r\nIt’s not due to the costumes being pretty or appropriate to the time period. Almost every movie that tackles these times nail the costume design, but only a few can tell a character arc through it. Even less are capable of embodying the whole screenplay like this Oscar-bait does. Our protagonists have distinct journeys, but their ends all have similarities. One way of understanding the story is through what they wear, which seamlessly represent the arc that each character takes to get where they eventually end up. These layers of storytelling keep the film intriguing, but Lanthimos’ uncommon methods plus McNamara and Davis’ script will displease some audience members.  \r\n\r\nThe Favourite is that movie that audiences are going to be perplexed about why do critics adore it. There’s no secret, really. Audience members don’t care about the technical part of films. They couldn’t care less about costume design, cinematography, score or how the screenplay is written. They want to be entertained and have a good time at the theater, so I find reasonable if people leave a bit disappointed with one of the most critically acclaimed movies of 2018. Lanthimos doesn’t deliver formulaic stories, and he certainly doesn’t film them in a regular fashion, so I firmly believe the general public isn’t really going to enjoy this one. His unique style brings a very different tone, pace and filming techniques that people aren’t used to experiencing. Fortunately, there’s more than just technical attributes to this film. Three magnificent and powerful performances from Olivia Colman, Emma Stone, and Rachel Weisz, carry the whole thing to safe harbor.\r\n\r\nThese three actresses deserve every single nomination they got so far. Colman delivers both a hilarious and emotionally heavy display, as Anne. An incredibly fragile Queen with a shockingly traumatic past, whose love and affection is being fought for between Abigail and Sarah. Most of the laughs this movie gives are through Anne and her petty behavior towards her servants. Colman delivers her body and soul to her role, adding yet another fantastic performance to her splendid career. Weisz is just flawless. Sarah‘s arc is Abigail‘s opposite in almost every way, and Rachel is remarkably sharp. She doesn’t really have a definite shining moment like Stone or Colman have, but it’s a consistent and robust display from an actress who needed a return to the spotlight.\r\n\r\nNevertheless, it’s Emma Stone who shines through with an unbelievable range of emotions and expressions. Her performance in La La Land is great, but as Abigail she is outstanding! She handles her character’s personality change with an impeccable transition regarding her acting and the only reason why she’s probably not getting the Oscar win, is due to the campaign supporting Regina King (If Beale Street Could Talk). Abigail is the character that moves the plot forward by trying to steal Sarah‘s place near the Queen. Her intelligent and manipulative moves are extremely captivating, as well as her will to gain Anne‘s love.\r\n\r\nYorgos Lanthimos knows his craft and his weird yet unparalleled style is something that will surely deliver even more divisive and confusing films in the future. From the camera angles to his methods of storytelling, he’s one hell of a director-writer-producer! Technically, The Favourite is undoubtedly one of the best movies of the last year. The impressive production and set design plus the addictive score definitely raise the film, but the costume design tells a whole story through what the characters dress during the whole runtime. The screenplay is remarkably-written, filled with complex dialogues and several twists and turns, which lead our characters through eventful arcs. \r\n\r\nOlivia Colman and Rachel Weisz deliver compelling performances, but Emma Stone is in another level. Her range is mind-boggling, and she carries a big responsibility by portraying the character who changes the whole story. Nevertheless, the movie feels a bit too long, and the story drops its interest levels during the transition from the second to the third act. Basically, I’ll put it like this: if you’re just a regular audience member who only goes to the theater to eat popcorn while being entertained, The Favourite isn’t going to make you eat your whole bucket; if you watch films through a more in-depth look, then you’ll be as marveled as I was by the end of it.\r\n\r\nRating: A-", "created_at": "2019-02-08T17:39:25.463Z"}, {"movie_id": 375262, "review_id": "5ce734fb9251412cecc43189", "author_rating": 10.0, "review_text": "Hugely entertaining film from start to finish, with amazing performances from the three lead women. Emma Stone proves that once again she's not just a pretty face as the conniving and troubled Abigail, Rachel Weisz is always on form as the controlling and vindictive Sarah and Olivia Coleman deserved the Oscar as the childish and sickly Queen Anne. Nicholas Hoult's foppish rogue Harley steals every scene he is in.\r\n\r\nYorgos Lanthimos once again has made a beautifully shot film using  mostly natural light. I can't overstate that this film looks gorgeous. Many times over I thought of Barry Lyndon, but with tonnes of humour, foul language, and no Ryan O'Neal to destroy the soul of the film.\r\n\r\nI originally gave this 9/10 because I didn't like the use of fish-eye lens, but I couldn't stop thinking of how much I enjoyed it so I bumped it up to 10.\r\n\r\nBest film I have seen in a very long time.", "created_at": "2019-05-24T00:04:11.329Z"}, {"movie_id": 375262, "review_id": "5d1fc6c315c6361729f3c567", "author_rating": 7.0, "review_text": "**_Fans of Yorgos Lanthimos will love it_**\r\n\r\n> _A setback for women? How can it set women back to prove that women fart and vomit and hate and love and do all the things men do? All human beings are the same. We're all multifaceted, many-layered, disgusting and gorgeous and powerful and weak and filthy and brilliant. That's what's nice. It doesn't make women an old-fashioned thing of delicacy._\r\n\r\n- Olivia Colman; \"_The Favourite_ Blows Up Gender Politics With the Year's Most Outrageous Love Triangle\" (Tatiana Siegel); _The Hollywood Reporter_ (November 14, 2018)\r\n\r\n_The Favourite_, the seventh feature from Greek auteur Yorgos Lanthimos, is a film that eschews both convention and expectation. On the other hand, it's also Lanthimos's most accessible by a country mile. Imagine, if you will, a narrative combining Joseph L. Mankiewicz's _All About Eve_ (1950), Ingmar Bergman's _Viskningar och rop_ (1975), and Mark Waters's _Mean Girls_ (2004) filtered through the aesthetic sensibilities of Stanley Kubrick's _Barry Lyndon_ (1975), Peter Greenaway's _The Draughtsman's Contract_ (1992), and Stephen Frears's _Dangerous Liaisons_ (1988), topped off with a dash of Luis Buñuel at his most socially satirical, and you'll be some way towards imagining this bizarre and uncategorisable film from a director with as unique and distinctive a voice as you're likely to find in world cinema. A savage morality play, a camp comedy of manners, a Baroque tragedy, an allegorical study of the corruptive nature of power – it's all of these and yet none of them. I haven't seen Lanthimos's first two films, _O kalyteros mou filos_ (2001) and _Kinetta_ (2005), but I adored _Kynodontas_ (2009), as difficult as it was to watch. I was a little indifferent to _Alpeis_ (2011), but I loved _The Lobster_ (2015), his blackest comedy thus far. His last film, however, _The Killing of a Sacred Deer_ (2017) did very little for me, as I felt it offered nothing we hadn't seen in his previous work. So I came to _The Favourite_ wanting to like it, but ready to dislike it. And I find myself somewhere in the middle. On the one hand, it's too long, the plot too threadbare, and the metaphors and allegories too ill-defined. On the other, the acting is flawless, it looks amazing, the first half is very, very funny, and the end is very, very dark, with the last shot one of the most haunting/disturbing images I've seen in a long time.\r\n\r\nEngland, 1708. Queen Anne (an absolutely mesmerising Olivia Colman) has been on the throne for six years, with Great Britain finding itself enmeshed in the War of the Spanish Succession. In poor health, Anne has little interest in politics, with the real power lying with her friend, adviser, and secret lover Sarah Churchill, Duchess of Marlborough (an icy Rachel Weisz). Sarah and Prime Minister Sidney Godolphin (James Smith) plan to finance the war effort by doubling property taxes, but are opposed by the leader of the opposition – Robert Harley, Earl of Oxford (Nicholas Hoult). Meanwhile, Sarah's impoverished younger cousin, Abigail Hill (Emma Stone, charting a course from doe-eyed _ingénue_ to vicious Machiavellian _intrigant_), arrives at Court looking for work. Sarah secures her a position as a scullery maid, but when Abigail learns that Anne is suffering from gout, she uses a herbal remedy on the sleeping Queen without asking permission. Sarah has her whipped for her presumption, but Anne sees a noticeable improvement in her condition, and by way of apology, Sarah gives Abigail a position closer to the Queen. With Harley hoping to use Abigail as a spy to find out what Sarah is planning, and Samuel Masham (Joe Alwyn), a foppish courtier, attempting to woo her, Abigail must quickly adapt to courtly life. Learning of the lesbian relationship between Anne and Sarah, Abigail begins to ingratiate herself with the Queen, leading to a bitter contest between herself and Sarah, as each attempt to establish themselves as Anne's favourite.\r\n\r\n_The Favourite_ is the first film Lanthimos has directed which neither he nor Efthymis Filippou wrote. Although it deals with real historical personages and events, historians probably won't be too thrilled to learn that Lanthimos and his screenwriters Deborah Davis and Tony McNamara are relatively uninterested in either historical actuality or socio-political contextualisation (to say nothing of the slam dancing and frequently anachronistic dialogue). For example, there's no reference to the Glorious Revolution (1688), which saw James II, the last Catholic monarch of England, overthrown; or to the Treaty of Union (1707), which formally brought the state of Great Britain into existence. Similarly, it is never mentioned that Anne was the last Stuart monarch or that Abigail was appointed Keeper of the Privy Purse in 1711. The nature of the political antagonism between the Tories and the Whigs, although often referred to and occasionally witnessed, is kept vague, with little in the way of an historical frame of reference. For example, the film never addresses the fact that Godolphin and Harley were both Tories, with Godolphin heading an administration dominated by leading Whigs (the Whig Junto), and Harley leading a coalition of Country Whigs and Tories in opposition.\r\n\r\nOn the other hand, there's no evidence whatsoever that Anne and Sarah were lovers. On the contrary, Sarah is known to have found lesbianism abhorrent, commissioning the politician Arthur Maynwaring to write scurrilous poems about Abigail which intimated that she might be gay. Additionally, Anne was devoted to her husband, Prince George of Denmark, who doesn't even warrant a mention, let alone an appearance, despite being alive and well at the time of Abigail's arrival at Court. However, it's also important to note that the film makes no claim to be a history lecture. This is a story about a love triangle, with everything else just the background noise against which that triangle plays out.\r\n\r\nBut although it may not be historically accurate, it is most definitely a Yorgos Lanthimos film, with his peculiar _Weltanschauung_ omnipresent. The emotionless and monotone delivery of dialogue has been scaled back considerably from _The Lobster_ and _Sacred Deer_, but everything else you'd expect is here – the pseudo-omniscient judgemental glare; the dark absurdist sense of humour; the formal rigidity; the emotional isolation of the characters; the surrealism; the games of psychological one-upmanship; the alienation of the audience; the thematic centrality of shifting power relations; the lack of distinction between poignancy and joviality; the use of self-contained and closed off pocket universes where characters must play by rules differing from those of the outside world; intimate familial conflict (except in bigger rooms than in his previous films); and a disorienting score, which mixes pieces by Purcell, Vivaldi, Handel, and Bach with more contemporary work from the likes of Olivier Messiaen, Luc Ferrari, and Anna Meredith, whilst the closing credits feature Elton John's \"Skyline Pigeon\" (really). Similarly, whilst _The Lobster_ was a savage dystopian-set allegory for discipline and conformity, _The Favourite_ is a merciless satire of decadence and pettiness, taking in such additional themes as class, gender, love, lust, duty, loyalty, partisan politics, patriarchal hegemony, and women behaving just as appallingly as men.\r\n\r\nAs one would expect from Lanthimos, the film is aesthetically flawless, with many of the compositions having the appearance of a _fête galante_ painting, so meticulously integrated are the costume design by Sandy Powell (_Interview with the Vampire_; _Shakespeare in Love_; _Carol_), the production design by Fiona Crombie (_Snowtown_; _Truth_; _Mary Magdalene_), and the cinematography by Robbie Ryan (_Fish Tank_; _Philomena_; _American Honey_). Powell's costumes are historically inaccurate, but thematically revealing, with the situation of the characters at any given moment directly influencing the design. For example, speaking to _Entertainment Weekly_, Powell says of Abigail and her rise to a position of influence,\r\n\r\n> _I wanted to give her that vulgarity of the_ nouveau riche_, and her dresses get a little bolder and showier. There's more pattern involved and there are black-and-white stripes. I wanted her to stand out from everybody else as trying too hard._\r\n\r\nIn a more general sense, the black-and-white colour scheme of much of the wardrobe contrasts magnificently with Crombie's predominantly brown production design, with the actors effortlessly standing out from the backgrounds. The occasional use of black-and-white stripes is also worth mentioning, as it subliminally intimates that the characters are imprisoned, not so much by their physical _milieu_, but rather within the hypocrisy, pettiness, and forced politeness of the Royal Court.\r\n\r\nOf Ryan's photography, perhaps the most impressive feat is that, despite the many scenes tracking characters through rooms, up stairs, and out doorways, there's not a single Steadicam shot anywhere in the film. He also makes copious use of 6mm fish-eye lenses, which distort the spaces the characters occupy whilst also showing much more of the environment than a normal lens, creating the sense of characters lost within an overload of background visual detail. Combined with the whip pans seen throughout the film, the cumulative effect is a world rendered strange, a place of distortion and unnatural compositions. As Ryan explains to _Deadline_,\r\n\r\n> _by the nature of being able to see everything in front of you, you then get a sense that the characters are almost imprisoned in the location. Even though they have all this luxury and power, they are a little bit isolated in this world. By showing you the whole room and also isolating the character in a small space you get a feeling of no escape._\r\n\r\nAs with most of Lanthimos' work, the film also uses natural light, which makes for some stunning candle-lit night-time compositions, partially recalling the paintings of someone like Jean-Antoine Watteau or, even moreso, Georges de La Tour.\r\n\r\nIn terms of acting, there really are no words to describe just how good Colman is. Utterly inhabiting the character, she is able to elicit empathy mere moments after behaving thoroughly shamefully, communicating a sense of both tragic inevitability and a childlike refusal to accept reality. The character could easily have been a grotesque villain or a pitiful broken shell, but Colman finds a nobler middle ground, straddling both interpretations without fully committing to either, moving from one to the other seamlessly throughout the film. Yes, she can be a horrible person with appalling manners and questionable hygiene, but she is also deeply lonely, a survivor who has lost 17 children in childbirth, a woman whose health has made her old before her time, a deeply tragic figure too naïve to see how badly she is being manipulated by Sarah and Abigail, something encapsulated brilliantly in the haunting last shot. Rather than trying to downplay the contradictory facets of the character, Colman leans into them, illuminating Anne's humanity amongst her least appealing characteristics, and finding both wit and pathos in a character whose mercurial nature and excessive neediness could easily have rendered her the film's antagonist. It truly is one of the finest on-screen performances in a long time.\r\n\r\nWeisz and Stone are also both excellent. Weisz plays Sarah as a clinical manipulator, highly intelligent and relatively emotionless, whereas Stone's Abigail grows from a guileless chambermaid to a vindictive Janus-faced usurper. However, even at her most outrageous, there remains always something of the innocent girl we met earlier in the film.\r\n\r\nThe film's most salient theme, one could argue its very _raison d'être_, is the dynamic of gender politics. For starters, it's headlined by three actresses (something which is still rare enough as to be notable), whilst the only two male characters of any significance (Godolphin and Harley) are both portrayed as petty, vainglorious idiots. Indeed, men in general are background players, existing only to be mocked, exploited, and duped – with their ridiculous wigs and heavy makeup, they exist only to support the women. Speaking to _Entertainment Weekly_, Powell explains that Lanthimos wanted the women to have natural hair and light makeup, and the men to wear gaudy makeup and ridiculous wigs;\r\n\r\n> _normally films are filled with men, and the women are the decoration in the background, and I've done many of those, so it was quite nice for it to be reversed this time where the women are the centre of the film and the men are the decoration in the background._\r\n\r\nSimilarly, speaking to the _Hollywood Reporter_, Weisz explains,\r\n\r\n> _what's interesting to me is that the men in_ The Favourite _are wearing lots of makeup and blusher and lipstick and high heels. That they're peripheral characters who are slightly ridiculous. They're an afterthought. That may not be unusual in life, but it's unusual to see in films._\r\n\r\nHowever, what's especially interesting about the film's depiction of gender is that the world of women is anything but a utopia. Yes, it's relatively free of toxic masculinity and the male gaze, but in most other aspects, there's no real difference between the matriarchy and the patriarchy. Sure, the women are much smarter than the men who surround them, but they are no less greedy or cruel. At the film's post-première press conference at the Venice Film Festival, Lanthimos explained,\r\n\r\n> _what we tried to do is portray women as human beings. Because of the prevalent male gaze in cinema, women are portrayed as housewives, girlfriends...Our small contribution is we're just trying to show them as complex and wonderful and horrific as they are, like other human beings._\r\n\r\nThe preening and pettiness of the men, of course, is purposely overdone (Harley proclaims at one point that \"_a man must look pretty_\"), creating a _milieu_ where it is men, not women, who tend to be judged by their appearance, objectified, and used. Just look at the hilarious scene where Abigail coldly gives Masham a hand-job as she ruminates about more important matters – once she has gotten what she wants from him (his hand in marriage), she is no longer interested in him whatsoever, a direct reversal of traditional filmic gender roles, where it is usually men who use women. Men, in _The Favourite_, are utterly disposable.\r\n\r\nAs regards criticisms, although I personally wouldn't class them as flaws, some people will probably dislike the same things that many have disliked in Lanthimos's previous work – cold formal rigidity, perverse sense of humour, and irredeemable characters being irredeemably horrible to one another. There will be those who find the obviously intentional anachronisms too much, whilst others will take umbrage with the disregard for historical authenticity. For me, whilst I admire Lanthimos for trying to bring something new to his _oeuvre_, especially when compared to _Sacred Deer_, I felt the film was oftentimes trying to work its way through an identity crisis, unsure of exactly what kind of tone to settle on. I had similar feelings about the allegories that run throughout, but are never what you would call fully fleshed out. Obviously, it's a treatise on power and the ridiculous opulence of royalty, but that's not exactly an untapped issue in cinema. Additionally, one of my biggest problems with _Sacred Deer_ was how utterly pointless it felt, and although I got a lot more out of _The Favourite_, I had something of the same reaction to it. It could also be argued that the characters are a little two dimensional, and filmgoers who need a protagonist to latch onto, someone to root for, will be left rudderless.\r\n\r\n_The Favourite_ will probably attract a sizable unprepared audience because of awards buzz, positive reviews, and excellent trailer. Undoubtedly, for a lot of people, this will be their first exposure to Lanthimos, and I can only imagine what people expecting a Merchant-Ivory costume drama will make of it all. Neither morally enlightening nor historically respectful, _The Favourite_ offers a bleak assessment of humanity's core drives; not Lanthimos's bleakest, but a hell of a lot more nihilistic than an average multiplex goer will be used to. The characters within the film live in a _milieu_ of egotism, narcissism, sexual cruelty, psychological bullying, greed, and hunger for power. There's barely a hint of sentimentality, and very little that could be called morally righteous. I would have liked it to have more meat on its bones, but at the same time, one cannot deny that it presents something of a faithful looking-glass, as Lanthimos continues to corner the market in pointing out not just humanity's worst foibles, but its most egregious eccentricities and lamentable character defects.", "created_at": "2019-07-05T21:53:07.868Z"}, {"movie_id": 375262, "review_id": "5e76b130a055ef00182d497f", "author_rating": 7.0, "review_text": "Some wounds do not close; I have many such. One just walks around with them and sometimes one can feel them filling with blood. \r\n\r\nThe Favourite is directed by Yorgos Lanthimos and written by Deborah Davis and Tony McNamara. It stars Olivia Colman, Rachael Weisz, Emma Stone, Faye Daveney, James Smith, Mark Gatiss, Willem Dalby and Nicholas Hoult.     \r\n\r\nIn early 18th century England, a frail Queen Anne (Colman) occupies the throne and her close friend, Lady Sarah (Weisz), governs the country in her stead. When a new servant, Abigail (Stone), arrives, her charm endears her to Sarah. \r\n\r\nA critical darling with awards and nominations to match, The Favourite, to me at least, is something of an acquired taste. Firstly it should be noted that as a history lesson it's pure bunkum, so much so I wondered if Lanthimos is actually Mel Gibson. Though to be fair to Lanthimos, he never hid from the fact he and his writers were pretty much making it up for entertainment purpose.\r\n\r\nThe craft on show is top level, with three high quality lead lady performances giving their all for the director. Lanthimos also has some nifty camera tricks up his sleeve, it's clear that this is a talent to follow for those so inclined to his off kilter type of film making. Helps, too, that the costuming and set designs are also from the top draw. It's hard to fault from a production standpoint.\r\n\r\nNarratively the pic is pulsing with parliamentary politics that blends with royal shenanigans. Yet ultimately the prime concern is about the battle for Queen Anne's soul between Sarah and Abigail. This consistently remains fascinating, even as Lanthimos continues to sex things up and pitches black comedy alongside the tragic thrum at the core. \r\n\r\nIt's an odd mix of a film that I personally don't think works as a whole, and with the finale a crushing disappointment, it leaves one in awe and yet also unsatisfied. 7/10", "created_at": "2020-03-22T00:28:32.835Z"}, {"movie_id": 375262, "review_id": "5c43fb4b0e0a266d66d26929", "author_rating": 6.0, "review_text": "Overrated? Most assuredly, but utterly engaging from beginning to end. Not Yorgos' most humorous piece, but technically sound and brilliantly acted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:38:35.310Z"}, {"movie_id": 375262, "review_id": "5c5dbecdc3a3683cdb8c413c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThe Favourite is one of the most acclaimed movies of last year, receiving multiple nominations at dozens of awards shows and winning a whole bunch of them (2nd most awarded film of 2018, behind Roma). Being a fan of Yorgos Lanthimos’ style, I couldn’t be happier for him, and I was now even more excited to watch what he produced and directed. This movie is a classic example of an Oscars’ tradition of sorts. A lot of audience members make their mission to watch every Best Picture nominee before the big night, and there’s always one film that people fail to grasp on why did it get so much praise? Why are critics all around the world absolutely loving what audiences perceive as an “okay” time at the theater, but which contains a long, weird and maybe even dull (for some) story?\r\n\r\nWell, first of all, this is technically a masterpiece. I mean, every single technical aspect is worthy of recognition. The production and set design are gorgeously eyegasmic. The score is unusual for a period piece like this, but it weirdly works, as it continuously elevates the tension between the three main characters and helps the story flow with an always conspicuous, treacherous feeling. Even the cinematography and the plays with candlelight offer some pretty neat scenes. However, and prepare to be surprised, the costume design steals the show from all the other achievements. This is coming from a guy who has utterly no interest in this particular matter and who rarely talks about it, so I’m as surprised as you are. \r\n\r\nIt’s not due to the costumes being pretty or appropriate to the time period. Almost every movie that tackles these times nail the costume design, but only a few can tell a character arc through it. Even less are capable of embodying the whole screenplay like this Oscar-bait does. Our protagonists have distinct journeys, but their ends all have similarities. One way of understanding the story is through what they wear, which seamlessly represent the arc that each character takes to get where they eventually end up. These layers of storytelling keep the film intriguing, but Lanthimos’ uncommon methods plus McNamara and Davis’ script will displease some audience members.  \r\n\r\nThe Favourite is that movie that audiences are going to be perplexed about why do critics adore it. There’s no secret, really. Audience members don’t care about the technical part of films. They couldn’t care less about costume design, cinematography, score or how the screenplay is written. They want to be entertained and have a good time at the theater, so I find reasonable if people leave a bit disappointed with one of the most critically acclaimed movies of 2018. Lanthimos doesn’t deliver formulaic stories, and he certainly doesn’t film them in a regular fashion, so I firmly believe the general public isn’t really going to enjoy this one. His unique style brings a very different tone, pace and filming techniques that people aren’t used to experiencing. Fortunately, there’s more than just technical attributes to this film. Three magnificent and powerful performances from Olivia Colman, Emma Stone, and Rachel Weisz, carry the whole thing to safe harbor.\r\n\r\nThese three actresses deserve every single nomination they got so far. Colman delivers both a hilarious and emotionally heavy display, as Anne. An incredibly fragile Queen with a shockingly traumatic past, whose love and affection is being fought for between Abigail and Sarah. Most of the laughs this movie gives are through Anne and her petty behavior towards her servants. Colman delivers her body and soul to her role, adding yet another fantastic performance to her splendid career. Weisz is just flawless. Sarah‘s arc is Abigail‘s opposite in almost every way, and Rachel is remarkably sharp. She doesn’t really have a definite shining moment like Stone or Colman have, but it’s a consistent and robust display from an actress who needed a return to the spotlight.\r\n\r\nNevertheless, it’s Emma Stone who shines through with an unbelievable range of emotions and expressions. Her performance in La La Land is great, but as Abigail she is outstanding! She handles her character’s personality change with an impeccable transition regarding her acting and the only reason why she’s probably not getting the Oscar win, is due to the campaign supporting Regina King (If Beale Street Could Talk). Abigail is the character that moves the plot forward by trying to steal Sarah‘s place near the Queen. Her intelligent and manipulative moves are extremely captivating, as well as her will to gain Anne‘s love.\r\n\r\nYorgos Lanthimos knows his craft and his weird yet unparalleled style is something that will surely deliver even more divisive and confusing films in the future. From the camera angles to his methods of storytelling, he’s one hell of a director-writer-producer! Technically, The Favourite is undoubtedly one of the best movies of the last year. The impressive production and set design plus the addictive score definitely raise the film, but the costume design tells a whole story through what the characters dress during the whole runtime. The screenplay is remarkably-written, filled with complex dialogues and several twists and turns, which lead our characters through eventful arcs. \r\n\r\nOlivia Colman and Rachel Weisz deliver compelling performances, but Emma Stone is in another level. Her range is mind-boggling, and she carries a big responsibility by portraying the character who changes the whole story. Nevertheless, the movie feels a bit too long, and the story drops its interest levels during the transition from the second to the third act. Basically, I’ll put it like this: if you’re just a regular audience member who only goes to the theater to eat popcorn while being entertained, The Favourite isn’t going to make you eat your whole bucket; if you watch films through a more in-depth look, then you’ll be as marveled as I was by the end of it.\r\n\r\nRating: A-", "created_at": "2019-02-08T17:39:25.463Z"}, {"movie_id": 375262, "review_id": "5ce734fb9251412cecc43189", "author_rating": 10.0, "review_text": "Hugely entertaining film from start to finish, with amazing performances from the three lead women. Emma Stone proves that once again she's not just a pretty face as the conniving and troubled Abigail, Rachel Weisz is always on form as the controlling and vindictive Sarah and Olivia Coleman deserved the Oscar as the childish and sickly Queen Anne. Nicholas Hoult's foppish rogue Harley steals every scene he is in.\r\n\r\nYorgos Lanthimos once again has made a beautifully shot film using  mostly natural light. I can't overstate that this film looks gorgeous. Many times over I thought of Barry Lyndon, but with tonnes of humour, foul language, and no Ryan O'Neal to destroy the soul of the film.\r\n\r\nI originally gave this 9/10 because I didn't like the use of fish-eye lens, but I couldn't stop thinking of how much I enjoyed it so I bumped it up to 10.\r\n\r\nBest film I have seen in a very long time.", "created_at": "2019-05-24T00:04:11.329Z"}, {"movie_id": 375262, "review_id": "5d1fc6c315c6361729f3c567", "author_rating": 7.0, "review_text": "**_Fans of Yorgos Lanthimos will love it_**\r\n\r\n> _A setback for women? How can it set women back to prove that women fart and vomit and hate and love and do all the things men do? All human beings are the same. We're all multifaceted, many-layered, disgusting and gorgeous and powerful and weak and filthy and brilliant. That's what's nice. It doesn't make women an old-fashioned thing of delicacy._\r\n\r\n- Olivia Colman; \"_The Favourite_ Blows Up Gender Politics With the Year's Most Outrageous Love Triangle\" (Tatiana Siegel); _The Hollywood Reporter_ (November 14, 2018)\r\n\r\n_The Favourite_, the seventh feature from Greek auteur Yorgos Lanthimos, is a film that eschews both convention and expectation. On the other hand, it's also Lanthimos's most accessible by a country mile. Imagine, if you will, a narrative combining Joseph L. Mankiewicz's _All About Eve_ (1950), Ingmar Bergman's _Viskningar och rop_ (1975), and Mark Waters's _Mean Girls_ (2004) filtered through the aesthetic sensibilities of Stanley Kubrick's _Barry Lyndon_ (1975), Peter Greenaway's _The Draughtsman's Contract_ (1992), and Stephen Frears's _Dangerous Liaisons_ (1988), topped off with a dash of Luis Buñuel at his most socially satirical, and you'll be some way towards imagining this bizarre and uncategorisable film from a director with as unique and distinctive a voice as you're likely to find in world cinema. A savage morality play, a camp comedy of manners, a Baroque tragedy, an allegorical study of the corruptive nature of power – it's all of these and yet none of them. I haven't seen Lanthimos's first two films, _O kalyteros mou filos_ (2001) and _Kinetta_ (2005), but I adored _Kynodontas_ (2009), as difficult as it was to watch. I was a little indifferent to _Alpeis_ (2011), but I loved _The Lobster_ (2015), his blackest comedy thus far. His last film, however, _The Killing of a Sacred Deer_ (2017) did very little for me, as I felt it offered nothing we hadn't seen in his previous work. So I came to _The Favourite_ wanting to like it, but ready to dislike it. And I find myself somewhere in the middle. On the one hand, it's too long, the plot too threadbare, and the metaphors and allegories too ill-defined. On the other, the acting is flawless, it looks amazing, the first half is very, very funny, and the end is very, very dark, with the last shot one of the most haunting/disturbing images I've seen in a long time.\r\n\r\nEngland, 1708. Queen Anne (an absolutely mesmerising Olivia Colman) has been on the throne for six years, with Great Britain finding itself enmeshed in the War of the Spanish Succession. In poor health, Anne has little interest in politics, with the real power lying with her friend, adviser, and secret lover Sarah Churchill, Duchess of Marlborough (an icy Rachel Weisz). Sarah and Prime Minister Sidney Godolphin (James Smith) plan to finance the war effort by doubling property taxes, but are opposed by the leader of the opposition – Robert Harley, Earl of Oxford (Nicholas Hoult). Meanwhile, Sarah's impoverished younger cousin, Abigail Hill (Emma Stone, charting a course from doe-eyed _ingénue_ to vicious Machiavellian _intrigant_), arrives at Court looking for work. Sarah secures her a position as a scullery maid, but when Abigail learns that Anne is suffering from gout, she uses a herbal remedy on the sleeping Queen without asking permission. Sarah has her whipped for her presumption, but Anne sees a noticeable improvement in her condition, and by way of apology, Sarah gives Abigail a position closer to the Queen. With Harley hoping to use Abigail as a spy to find out what Sarah is planning, and Samuel Masham (Joe Alwyn), a foppish courtier, attempting to woo her, Abigail must quickly adapt to courtly life. Learning of the lesbian relationship between Anne and Sarah, Abigail begins to ingratiate herself with the Queen, leading to a bitter contest between herself and Sarah, as each attempt to establish themselves as Anne's favourite.\r\n\r\n_The Favourite_ is the first film Lanthimos has directed which neither he nor Efthymis Filippou wrote. Although it deals with real historical personages and events, historians probably won't be too thrilled to learn that Lanthimos and his screenwriters Deborah Davis and Tony McNamara are relatively uninterested in either historical actuality or socio-political contextualisation (to say nothing of the slam dancing and frequently anachronistic dialogue). For example, there's no reference to the Glorious Revolution (1688), which saw James II, the last Catholic monarch of England, overthrown; or to the Treaty of Union (1707), which formally brought the state of Great Britain into existence. Similarly, it is never mentioned that Anne was the last Stuart monarch or that Abigail was appointed Keeper of the Privy Purse in 1711. The nature of the political antagonism between the Tories and the Whigs, although often referred to and occasionally witnessed, is kept vague, with little in the way of an historical frame of reference. For example, the film never addresses the fact that Godolphin and Harley were both Tories, with Godolphin heading an administration dominated by leading Whigs (the Whig Junto), and Harley leading a coalition of Country Whigs and Tories in opposition.\r\n\r\nOn the other hand, there's no evidence whatsoever that Anne and Sarah were lovers. On the contrary, Sarah is known to have found lesbianism abhorrent, commissioning the politician Arthur Maynwaring to write scurrilous poems about Abigail which intimated that she might be gay. Additionally, Anne was devoted to her husband, Prince George of Denmark, who doesn't even warrant a mention, let alone an appearance, despite being alive and well at the time of Abigail's arrival at Court. However, it's also important to note that the film makes no claim to be a history lecture. This is a story about a love triangle, with everything else just the background noise against which that triangle plays out.\r\n\r\nBut although it may not be historically accurate, it is most definitely a Yorgos Lanthimos film, with his peculiar _Weltanschauung_ omnipresent. The emotionless and monotone delivery of dialogue has been scaled back considerably from _The Lobster_ and _Sacred Deer_, but everything else you'd expect is here – the pseudo-omniscient judgemental glare; the dark absurdist sense of humour; the formal rigidity; the emotional isolation of the characters; the surrealism; the games of psychological one-upmanship; the alienation of the audience; the thematic centrality of shifting power relations; the lack of distinction between poignancy and joviality; the use of self-contained and closed off pocket universes where characters must play by rules differing from those of the outside world; intimate familial conflict (except in bigger rooms than in his previous films); and a disorienting score, which mixes pieces by Purcell, Vivaldi, Handel, and Bach with more contemporary work from the likes of Olivier Messiaen, Luc Ferrari, and Anna Meredith, whilst the closing credits feature Elton John's \"Skyline Pigeon\" (really). Similarly, whilst _The Lobster_ was a savage dystopian-set allegory for discipline and conformity, _The Favourite_ is a merciless satire of decadence and pettiness, taking in such additional themes as class, gender, love, lust, duty, loyalty, partisan politics, patriarchal hegemony, and women behaving just as appallingly as men.\r\n\r\nAs one would expect from Lanthimos, the film is aesthetically flawless, with many of the compositions having the appearance of a _fête galante_ painting, so meticulously integrated are the costume design by Sandy Powell (_Interview with the Vampire_; _Shakespeare in Love_; _Carol_), the production design by Fiona Crombie (_Snowtown_; _Truth_; _Mary Magdalene_), and the cinematography by Robbie Ryan (_Fish Tank_; _Philomena_; _American Honey_). Powell's costumes are historically inaccurate, but thematically revealing, with the situation of the characters at any given moment directly influencing the design. For example, speaking to _Entertainment Weekly_, Powell says of Abigail and her rise to a position of influence,\r\n\r\n> _I wanted to give her that vulgarity of the_ nouveau riche_, and her dresses get a little bolder and showier. There's more pattern involved and there are black-and-white stripes. I wanted her to stand out from everybody else as trying too hard._\r\n\r\nIn a more general sense, the black-and-white colour scheme of much of the wardrobe contrasts magnificently with Crombie's predominantly brown production design, with the actors effortlessly standing out from the backgrounds. The occasional use of black-and-white stripes is also worth mentioning, as it subliminally intimates that the characters are imprisoned, not so much by their physical _milieu_, but rather within the hypocrisy, pettiness, and forced politeness of the Royal Court.\r\n\r\nOf Ryan's photography, perhaps the most impressive feat is that, despite the many scenes tracking characters through rooms, up stairs, and out doorways, there's not a single Steadicam shot anywhere in the film. He also makes copious use of 6mm fish-eye lenses, which distort the spaces the characters occupy whilst also showing much more of the environment than a normal lens, creating the sense of characters lost within an overload of background visual detail. Combined with the whip pans seen throughout the film, the cumulative effect is a world rendered strange, a place of distortion and unnatural compositions. As Ryan explains to _Deadline_,\r\n\r\n> _by the nature of being able to see everything in front of you, you then get a sense that the characters are almost imprisoned in the location. Even though they have all this luxury and power, they are a little bit isolated in this world. By showing you the whole room and also isolating the character in a small space you get a feeling of no escape._\r\n\r\nAs with most of Lanthimos' work, the film also uses natural light, which makes for some stunning candle-lit night-time compositions, partially recalling the paintings of someone like Jean-Antoine Watteau or, even moreso, Georges de La Tour.\r\n\r\nIn terms of acting, there really are no words to describe just how good Colman is. Utterly inhabiting the character, she is able to elicit empathy mere moments after behaving thoroughly shamefully, communicating a sense of both tragic inevitability and a childlike refusal to accept reality. The character could easily have been a grotesque villain or a pitiful broken shell, but Colman finds a nobler middle ground, straddling both interpretations without fully committing to either, moving from one to the other seamlessly throughout the film. Yes, she can be a horrible person with appalling manners and questionable hygiene, but she is also deeply lonely, a survivor who has lost 17 children in childbirth, a woman whose health has made her old before her time, a deeply tragic figure too naïve to see how badly she is being manipulated by Sarah and Abigail, something encapsulated brilliantly in the haunting last shot. Rather than trying to downplay the contradictory facets of the character, Colman leans into them, illuminating Anne's humanity amongst her least appealing characteristics, and finding both wit and pathos in a character whose mercurial nature and excessive neediness could easily have rendered her the film's antagonist. It truly is one of the finest on-screen performances in a long time.\r\n\r\nWeisz and Stone are also both excellent. Weisz plays Sarah as a clinical manipulator, highly intelligent and relatively emotionless, whereas Stone's Abigail grows from a guileless chambermaid to a vindictive Janus-faced usurper. However, even at her most outrageous, there remains always something of the innocent girl we met earlier in the film.\r\n\r\nThe film's most salient theme, one could argue its very _raison d'être_, is the dynamic of gender politics. For starters, it's headlined by three actresses (something which is still rare enough as to be notable), whilst the only two male characters of any significance (Godolphin and Harley) are both portrayed as petty, vainglorious idiots. Indeed, men in general are background players, existing only to be mocked, exploited, and duped – with their ridiculous wigs and heavy makeup, they exist only to support the women. Speaking to _Entertainment Weekly_, Powell explains that Lanthimos wanted the women to have natural hair and light makeup, and the men to wear gaudy makeup and ridiculous wigs;\r\n\r\n> _normally films are filled with men, and the women are the decoration in the background, and I've done many of those, so it was quite nice for it to be reversed this time where the women are the centre of the film and the men are the decoration in the background._\r\n\r\nSimilarly, speaking to the _Hollywood Reporter_, Weisz explains,\r\n\r\n> _what's interesting to me is that the men in_ The Favourite _are wearing lots of makeup and blusher and lipstick and high heels. That they're peripheral characters who are slightly ridiculous. They're an afterthought. That may not be unusual in life, but it's unusual to see in films._\r\n\r\nHowever, what's especially interesting about the film's depiction of gender is that the world of women is anything but a utopia. Yes, it's relatively free of toxic masculinity and the male gaze, but in most other aspects, there's no real difference between the matriarchy and the patriarchy. Sure, the women are much smarter than the men who surround them, but they are no less greedy or cruel. At the film's post-première press conference at the Venice Film Festival, Lanthimos explained,\r\n\r\n> _what we tried to do is portray women as human beings. Because of the prevalent male gaze in cinema, women are portrayed as housewives, girlfriends...Our small contribution is we're just trying to show them as complex and wonderful and horrific as they are, like other human beings._\r\n\r\nThe preening and pettiness of the men, of course, is purposely overdone (Harley proclaims at one point that \"_a man must look pretty_\"), creating a _milieu_ where it is men, not women, who tend to be judged by their appearance, objectified, and used. Just look at the hilarious scene where Abigail coldly gives Masham a hand-job as she ruminates about more important matters – once she has gotten what she wants from him (his hand in marriage), she is no longer interested in him whatsoever, a direct reversal of traditional filmic gender roles, where it is usually men who use women. Men, in _The Favourite_, are utterly disposable.\r\n\r\nAs regards criticisms, although I personally wouldn't class them as flaws, some people will probably dislike the same things that many have disliked in Lanthimos's previous work – cold formal rigidity, perverse sense of humour, and irredeemable characters being irredeemably horrible to one another. There will be those who find the obviously intentional anachronisms too much, whilst others will take umbrage with the disregard for historical authenticity. For me, whilst I admire Lanthimos for trying to bring something new to his _oeuvre_, especially when compared to _Sacred Deer_, I felt the film was oftentimes trying to work its way through an identity crisis, unsure of exactly what kind of tone to settle on. I had similar feelings about the allegories that run throughout, but are never what you would call fully fleshed out. Obviously, it's a treatise on power and the ridiculous opulence of royalty, but that's not exactly an untapped issue in cinema. Additionally, one of my biggest problems with _Sacred Deer_ was how utterly pointless it felt, and although I got a lot more out of _The Favourite_, I had something of the same reaction to it. It could also be argued that the characters are a little two dimensional, and filmgoers who need a protagonist to latch onto, someone to root for, will be left rudderless.\r\n\r\n_The Favourite_ will probably attract a sizable unprepared audience because of awards buzz, positive reviews, and excellent trailer. Undoubtedly, for a lot of people, this will be their first exposure to Lanthimos, and I can only imagine what people expecting a Merchant-Ivory costume drama will make of it all. Neither morally enlightening nor historically respectful, _The Favourite_ offers a bleak assessment of humanity's core drives; not Lanthimos's bleakest, but a hell of a lot more nihilistic than an average multiplex goer will be used to. The characters within the film live in a _milieu_ of egotism, narcissism, sexual cruelty, psychological bullying, greed, and hunger for power. There's barely a hint of sentimentality, and very little that could be called morally righteous. I would have liked it to have more meat on its bones, but at the same time, one cannot deny that it presents something of a faithful looking-glass, as Lanthimos continues to corner the market in pointing out not just humanity's worst foibles, but its most egregious eccentricities and lamentable character defects.", "created_at": "2019-07-05T21:53:07.868Z"}, {"movie_id": 375262, "review_id": "5e76b130a055ef00182d497f", "author_rating": 7.0, "review_text": "Some wounds do not close; I have many such. One just walks around with them and sometimes one can feel them filling with blood. \r\n\r\nThe Favourite is directed by Yorgos Lanthimos and written by Deborah Davis and Tony McNamara. It stars Olivia Colman, Rachael Weisz, Emma Stone, Faye Daveney, James Smith, Mark Gatiss, Willem Dalby and Nicholas Hoult.     \r\n\r\nIn early 18th century England, a frail Queen Anne (Colman) occupies the throne and her close friend, Lady Sarah (Weisz), governs the country in her stead. When a new servant, Abigail (Stone), arrives, her charm endears her to Sarah. \r\n\r\nA critical darling with awards and nominations to match, The Favourite, to me at least, is something of an acquired taste. Firstly it should be noted that as a history lesson it's pure bunkum, so much so I wondered if Lanthimos is actually Mel Gibson. Though to be fair to Lanthimos, he never hid from the fact he and his writers were pretty much making it up for entertainment purpose.\r\n\r\nThe craft on show is top level, with three high quality lead lady performances giving their all for the director. Lanthimos also has some nifty camera tricks up his sleeve, it's clear that this is a talent to follow for those so inclined to his off kilter type of film making. Helps, too, that the costuming and set designs are also from the top draw. It's hard to fault from a production standpoint.\r\n\r\nNarratively the pic is pulsing with parliamentary politics that blends with royal shenanigans. Yet ultimately the prime concern is about the battle for Queen Anne's soul between Sarah and Abigail. This consistently remains fascinating, even as Lanthimos continues to sex things up and pitches black comedy alongside the tragic thrum at the core. \r\n\r\nIt's an odd mix of a film that I personally don't think works as a whole, and with the finale a crushing disappointment, it leaves one in awe and yet also unsatisfied. 7/10", "created_at": "2020-03-22T00:28:32.835Z"}, {"movie_id": 375262, "review_id": "5c43fb4b0e0a266d66d26929", "author_rating": 6.0, "review_text": "Overrated? Most assuredly, but utterly engaging from beginning to end. Not Yorgos' most humorous piece, but technically sound and brilliantly acted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:38:35.310Z"}, {"movie_id": 375262, "review_id": "5c5dbecdc3a3683cdb8c413c", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThe Favourite is one of the most acclaimed movies of last year, receiving multiple nominations at dozens of awards shows and winning a whole bunch of them (2nd most awarded film of 2018, behind Roma). Being a fan of Yorgos Lanthimos’ style, I couldn’t be happier for him, and I was now even more excited to watch what he produced and directed. This movie is a classic example of an Oscars’ tradition of sorts. A lot of audience members make their mission to watch every Best Picture nominee before the big night, and there’s always one film that people fail to grasp on why did it get so much praise? Why are critics all around the world absolutely loving what audiences perceive as an “okay” time at the theater, but which contains a long, weird and maybe even dull (for some) story?\r\n\r\nWell, first of all, this is technically a masterpiece. I mean, every single technical aspect is worthy of recognition. The production and set design are gorgeously eyegasmic. The score is unusual for a period piece like this, but it weirdly works, as it continuously elevates the tension between the three main characters and helps the story flow with an always conspicuous, treacherous feeling. Even the cinematography and the plays with candlelight offer some pretty neat scenes. However, and prepare to be surprised, the costume design steals the show from all the other achievements. This is coming from a guy who has utterly no interest in this particular matter and who rarely talks about it, so I’m as surprised as you are. \r\n\r\nIt’s not due to the costumes being pretty or appropriate to the time period. Almost every movie that tackles these times nail the costume design, but only a few can tell a character arc through it. Even less are capable of embodying the whole screenplay like this Oscar-bait does. Our protagonists have distinct journeys, but their ends all have similarities. One way of understanding the story is through what they wear, which seamlessly represent the arc that each character takes to get where they eventually end up. These layers of storytelling keep the film intriguing, but Lanthimos’ uncommon methods plus McNamara and Davis’ script will displease some audience members.  \r\n\r\nThe Favourite is that movie that audiences are going to be perplexed about why do critics adore it. There’s no secret, really. Audience members don’t care about the technical part of films. They couldn’t care less about costume design, cinematography, score or how the screenplay is written. They want to be entertained and have a good time at the theater, so I find reasonable if people leave a bit disappointed with one of the most critically acclaimed movies of 2018. Lanthimos doesn’t deliver formulaic stories, and he certainly doesn’t film them in a regular fashion, so I firmly believe the general public isn’t really going to enjoy this one. His unique style brings a very different tone, pace and filming techniques that people aren’t used to experiencing. Fortunately, there’s more than just technical attributes to this film. Three magnificent and powerful performances from Olivia Colman, Emma Stone, and Rachel Weisz, carry the whole thing to safe harbor.\r\n\r\nThese three actresses deserve every single nomination they got so far. Colman delivers both a hilarious and emotionally heavy display, as Anne. An incredibly fragile Queen with a shockingly traumatic past, whose love and affection is being fought for between Abigail and Sarah. Most of the laughs this movie gives are through Anne and her petty behavior towards her servants. Colman delivers her body and soul to her role, adding yet another fantastic performance to her splendid career. Weisz is just flawless. Sarah‘s arc is Abigail‘s opposite in almost every way, and Rachel is remarkably sharp. She doesn’t really have a definite shining moment like Stone or Colman have, but it’s a consistent and robust display from an actress who needed a return to the spotlight.\r\n\r\nNevertheless, it’s Emma Stone who shines through with an unbelievable range of emotions and expressions. Her performance in La La Land is great, but as Abigail she is outstanding! She handles her character’s personality change with an impeccable transition regarding her acting and the only reason why she’s probably not getting the Oscar win, is due to the campaign supporting Regina King (If Beale Street Could Talk). Abigail is the character that moves the plot forward by trying to steal Sarah‘s place near the Queen. Her intelligent and manipulative moves are extremely captivating, as well as her will to gain Anne‘s love.\r\n\r\nYorgos Lanthimos knows his craft and his weird yet unparalleled style is something that will surely deliver even more divisive and confusing films in the future. From the camera angles to his methods of storytelling, he’s one hell of a director-writer-producer! Technically, The Favourite is undoubtedly one of the best movies of the last year. The impressive production and set design plus the addictive score definitely raise the film, but the costume design tells a whole story through what the characters dress during the whole runtime. The screenplay is remarkably-written, filled with complex dialogues and several twists and turns, which lead our characters through eventful arcs. \r\n\r\nOlivia Colman and Rachel Weisz deliver compelling performances, but Emma Stone is in another level. Her range is mind-boggling, and she carries a big responsibility by portraying the character who changes the whole story. Nevertheless, the movie feels a bit too long, and the story drops its interest levels during the transition from the second to the third act. Basically, I’ll put it like this: if you’re just a regular audience member who only goes to the theater to eat popcorn while being entertained, The Favourite isn’t going to make you eat your whole bucket; if you watch films through a more in-depth look, then you’ll be as marveled as I was by the end of it.\r\n\r\nRating: A-", "created_at": "2019-02-08T17:39:25.463Z"}, {"movie_id": 375262, "review_id": "5ce734fb9251412cecc43189", "author_rating": 10.0, "review_text": "Hugely entertaining film from start to finish, with amazing performances from the three lead women. Emma Stone proves that once again she's not just a pretty face as the conniving and troubled Abigail, Rachel Weisz is always on form as the controlling and vindictive Sarah and Olivia Coleman deserved the Oscar as the childish and sickly Queen Anne. Nicholas Hoult's foppish rogue Harley steals every scene he is in.\r\n\r\nYorgos Lanthimos once again has made a beautifully shot film using  mostly natural light. I can't overstate that this film looks gorgeous. Many times over I thought of Barry Lyndon, but with tonnes of humour, foul language, and no Ryan O'Neal to destroy the soul of the film.\r\n\r\nI originally gave this 9/10 because I didn't like the use of fish-eye lens, but I couldn't stop thinking of how much I enjoyed it so I bumped it up to 10.\r\n\r\nBest film I have seen in a very long time.", "created_at": "2019-05-24T00:04:11.329Z"}, {"movie_id": 375262, "review_id": "5d1fc6c315c6361729f3c567", "author_rating": 7.0, "review_text": "**_Fans of Yorgos Lanthimos will love it_**\r\n\r\n> _A setback for women? How can it set women back to prove that women fart and vomit and hate and love and do all the things men do? All human beings are the same. We're all multifaceted, many-layered, disgusting and gorgeous and powerful and weak and filthy and brilliant. That's what's nice. It doesn't make women an old-fashioned thing of delicacy._\r\n\r\n- Olivia Colman; \"_The Favourite_ Blows Up Gender Politics With the Year's Most Outrageous Love Triangle\" (Tatiana Siegel); _The Hollywood Reporter_ (November 14, 2018)\r\n\r\n_The Favourite_, the seventh feature from Greek auteur Yorgos Lanthimos, is a film that eschews both convention and expectation. On the other hand, it's also Lanthimos's most accessible by a country mile. Imagine, if you will, a narrative combining Joseph L. Mankiewicz's _All About Eve_ (1950), Ingmar Bergman's _Viskningar och rop_ (1975), and Mark Waters's _Mean Girls_ (2004) filtered through the aesthetic sensibilities of Stanley Kubrick's _Barry Lyndon_ (1975), Peter Greenaway's _The Draughtsman's Contract_ (1992), and Stephen Frears's _Dangerous Liaisons_ (1988), topped off with a dash of Luis Buñuel at his most socially satirical, and you'll be some way towards imagining this bizarre and uncategorisable film from a director with as unique and distinctive a voice as you're likely to find in world cinema. A savage morality play, a camp comedy of manners, a Baroque tragedy, an allegorical study of the corruptive nature of power – it's all of these and yet none of them. I haven't seen Lanthimos's first two films, _O kalyteros mou filos_ (2001) and _Kinetta_ (2005), but I adored _Kynodontas_ (2009), as difficult as it was to watch. I was a little indifferent to _Alpeis_ (2011), but I loved _The Lobster_ (2015), his blackest comedy thus far. His last film, however, _The Killing of a Sacred Deer_ (2017) did very little for me, as I felt it offered nothing we hadn't seen in his previous work. So I came to _The Favourite_ wanting to like it, but ready to dislike it. And I find myself somewhere in the middle. On the one hand, it's too long, the plot too threadbare, and the metaphors and allegories too ill-defined. On the other, the acting is flawless, it looks amazing, the first half is very, very funny, and the end is very, very dark, with the last shot one of the most haunting/disturbing images I've seen in a long time.\r\n\r\nEngland, 1708. Queen Anne (an absolutely mesmerising Olivia Colman) has been on the throne for six years, with Great Britain finding itself enmeshed in the War of the Spanish Succession. In poor health, Anne has little interest in politics, with the real power lying with her friend, adviser, and secret lover Sarah Churchill, Duchess of Marlborough (an icy Rachel Weisz). Sarah and Prime Minister Sidney Godolphin (James Smith) plan to finance the war effort by doubling property taxes, but are opposed by the leader of the opposition – Robert Harley, Earl of Oxford (Nicholas Hoult). Meanwhile, Sarah's impoverished younger cousin, Abigail Hill (Emma Stone, charting a course from doe-eyed _ingénue_ to vicious Machiavellian _intrigant_), arrives at Court looking for work. Sarah secures her a position as a scullery maid, but when Abigail learns that Anne is suffering from gout, she uses a herbal remedy on the sleeping Queen without asking permission. Sarah has her whipped for her presumption, but Anne sees a noticeable improvement in her condition, and by way of apology, Sarah gives Abigail a position closer to the Queen. With Harley hoping to use Abigail as a spy to find out what Sarah is planning, and Samuel Masham (Joe Alwyn), a foppish courtier, attempting to woo her, Abigail must quickly adapt to courtly life. Learning of the lesbian relationship between Anne and Sarah, Abigail begins to ingratiate herself with the Queen, leading to a bitter contest between herself and Sarah, as each attempt to establish themselves as Anne's favourite.\r\n\r\n_The Favourite_ is the first film Lanthimos has directed which neither he nor Efthymis Filippou wrote. Although it deals with real historical personages and events, historians probably won't be too thrilled to learn that Lanthimos and his screenwriters Deborah Davis and Tony McNamara are relatively uninterested in either historical actuality or socio-political contextualisation (to say nothing of the slam dancing and frequently anachronistic dialogue). For example, there's no reference to the Glorious Revolution (1688), which saw James II, the last Catholic monarch of England, overthrown; or to the Treaty of Union (1707), which formally brought the state of Great Britain into existence. Similarly, it is never mentioned that Anne was the last Stuart monarch or that Abigail was appointed Keeper of the Privy Purse in 1711. The nature of the political antagonism between the Tories and the Whigs, although often referred to and occasionally witnessed, is kept vague, with little in the way of an historical frame of reference. For example, the film never addresses the fact that Godolphin and Harley were both Tories, with Godolphin heading an administration dominated by leading Whigs (the Whig Junto), and Harley leading a coalition of Country Whigs and Tories in opposition.\r\n\r\nOn the other hand, there's no evidence whatsoever that Anne and Sarah were lovers. On the contrary, Sarah is known to have found lesbianism abhorrent, commissioning the politician Arthur Maynwaring to write scurrilous poems about Abigail which intimated that she might be gay. Additionally, Anne was devoted to her husband, Prince George of Denmark, who doesn't even warrant a mention, let alone an appearance, despite being alive and well at the time of Abigail's arrival at Court. However, it's also important to note that the film makes no claim to be a history lecture. This is a story about a love triangle, with everything else just the background noise against which that triangle plays out.\r\n\r\nBut although it may not be historically accurate, it is most definitely a Yorgos Lanthimos film, with his peculiar _Weltanschauung_ omnipresent. The emotionless and monotone delivery of dialogue has been scaled back considerably from _The Lobster_ and _Sacred Deer_, but everything else you'd expect is here – the pseudo-omniscient judgemental glare; the dark absurdist sense of humour; the formal rigidity; the emotional isolation of the characters; the surrealism; the games of psychological one-upmanship; the alienation of the audience; the thematic centrality of shifting power relations; the lack of distinction between poignancy and joviality; the use of self-contained and closed off pocket universes where characters must play by rules differing from those of the outside world; intimate familial conflict (except in bigger rooms than in his previous films); and a disorienting score, which mixes pieces by Purcell, Vivaldi, Handel, and Bach with more contemporary work from the likes of Olivier Messiaen, Luc Ferrari, and Anna Meredith, whilst the closing credits feature Elton John's \"Skyline Pigeon\" (really). Similarly, whilst _The Lobster_ was a savage dystopian-set allegory for discipline and conformity, _The Favourite_ is a merciless satire of decadence and pettiness, taking in such additional themes as class, gender, love, lust, duty, loyalty, partisan politics, patriarchal hegemony, and women behaving just as appallingly as men.\r\n\r\nAs one would expect from Lanthimos, the film is aesthetically flawless, with many of the compositions having the appearance of a _fête galante_ painting, so meticulously integrated are the costume design by Sandy Powell (_Interview with the Vampire_; _Shakespeare in Love_; _Carol_), the production design by Fiona Crombie (_Snowtown_; _Truth_; _Mary Magdalene_), and the cinematography by Robbie Ryan (_Fish Tank_; _Philomena_; _American Honey_). Powell's costumes are historically inaccurate, but thematically revealing, with the situation of the characters at any given moment directly influencing the design. For example, speaking to _Entertainment Weekly_, Powell says of Abigail and her rise to a position of influence,\r\n\r\n> _I wanted to give her that vulgarity of the_ nouveau riche_, and her dresses get a little bolder and showier. There's more pattern involved and there are black-and-white stripes. I wanted her to stand out from everybody else as trying too hard._\r\n\r\nIn a more general sense, the black-and-white colour scheme of much of the wardrobe contrasts magnificently with Crombie's predominantly brown production design, with the actors effortlessly standing out from the backgrounds. The occasional use of black-and-white stripes is also worth mentioning, as it subliminally intimates that the characters are imprisoned, not so much by their physical _milieu_, but rather within the hypocrisy, pettiness, and forced politeness of the Royal Court.\r\n\r\nOf Ryan's photography, perhaps the most impressive feat is that, despite the many scenes tracking characters through rooms, up stairs, and out doorways, there's not a single Steadicam shot anywhere in the film. He also makes copious use of 6mm fish-eye lenses, which distort the spaces the characters occupy whilst also showing much more of the environment than a normal lens, creating the sense of characters lost within an overload of background visual detail. Combined with the whip pans seen throughout the film, the cumulative effect is a world rendered strange, a place of distortion and unnatural compositions. As Ryan explains to _Deadline_,\r\n\r\n> _by the nature of being able to see everything in front of you, you then get a sense that the characters are almost imprisoned in the location. Even though they have all this luxury and power, they are a little bit isolated in this world. By showing you the whole room and also isolating the character in a small space you get a feeling of no escape._\r\n\r\nAs with most of Lanthimos' work, the film also uses natural light, which makes for some stunning candle-lit night-time compositions, partially recalling the paintings of someone like Jean-Antoine Watteau or, even moreso, Georges de La Tour.\r\n\r\nIn terms of acting, there really are no words to describe just how good Colman is. Utterly inhabiting the character, she is able to elicit empathy mere moments after behaving thoroughly shamefully, communicating a sense of both tragic inevitability and a childlike refusal to accept reality. The character could easily have been a grotesque villain or a pitiful broken shell, but Colman finds a nobler middle ground, straddling both interpretations without fully committing to either, moving from one to the other seamlessly throughout the film. Yes, she can be a horrible person with appalling manners and questionable hygiene, but she is also deeply lonely, a survivor who has lost 17 children in childbirth, a woman whose health has made her old before her time, a deeply tragic figure too naïve to see how badly she is being manipulated by Sarah and Abigail, something encapsulated brilliantly in the haunting last shot. Rather than trying to downplay the contradictory facets of the character, Colman leans into them, illuminating Anne's humanity amongst her least appealing characteristics, and finding both wit and pathos in a character whose mercurial nature and excessive neediness could easily have rendered her the film's antagonist. It truly is one of the finest on-screen performances in a long time.\r\n\r\nWeisz and Stone are also both excellent. Weisz plays Sarah as a clinical manipulator, highly intelligent and relatively emotionless, whereas Stone's Abigail grows from a guileless chambermaid to a vindictive Janus-faced usurper. However, even at her most outrageous, there remains always something of the innocent girl we met earlier in the film.\r\n\r\nThe film's most salient theme, one could argue its very _raison d'être_, is the dynamic of gender politics. For starters, it's headlined by three actresses (something which is still rare enough as to be notable), whilst the only two male characters of any significance (Godolphin and Harley) are both portrayed as petty, vainglorious idiots. Indeed, men in general are background players, existing only to be mocked, exploited, and duped – with their ridiculous wigs and heavy makeup, they exist only to support the women. Speaking to _Entertainment Weekly_, Powell explains that Lanthimos wanted the women to have natural hair and light makeup, and the men to wear gaudy makeup and ridiculous wigs;\r\n\r\n> _normally films are filled with men, and the women are the decoration in the background, and I've done many of those, so it was quite nice for it to be reversed this time where the women are the centre of the film and the men are the decoration in the background._\r\n\r\nSimilarly, speaking to the _Hollywood Reporter_, Weisz explains,\r\n\r\n> _what's interesting to me is that the men in_ The Favourite _are wearing lots of makeup and blusher and lipstick and high heels. That they're peripheral characters who are slightly ridiculous. They're an afterthought. That may not be unusual in life, but it's unusual to see in films._\r\n\r\nHowever, what's especially interesting about the film's depiction of gender is that the world of women is anything but a utopia. Yes, it's relatively free of toxic masculinity and the male gaze, but in most other aspects, there's no real difference between the matriarchy and the patriarchy. Sure, the women are much smarter than the men who surround them, but they are no less greedy or cruel. At the film's post-première press conference at the Venice Film Festival, Lanthimos explained,\r\n\r\n> _what we tried to do is portray women as human beings. Because of the prevalent male gaze in cinema, women are portrayed as housewives, girlfriends...Our small contribution is we're just trying to show them as complex and wonderful and horrific as they are, like other human beings._\r\n\r\nThe preening and pettiness of the men, of course, is purposely overdone (Harley proclaims at one point that \"_a man must look pretty_\"), creating a _milieu_ where it is men, not women, who tend to be judged by their appearance, objectified, and used. Just look at the hilarious scene where Abigail coldly gives Masham a hand-job as she ruminates about more important matters – once she has gotten what she wants from him (his hand in marriage), she is no longer interested in him whatsoever, a direct reversal of traditional filmic gender roles, where it is usually men who use women. Men, in _The Favourite_, are utterly disposable.\r\n\r\nAs regards criticisms, although I personally wouldn't class them as flaws, some people will probably dislike the same things that many have disliked in Lanthimos's previous work – cold formal rigidity, perverse sense of humour, and irredeemable characters being irredeemably horrible to one another. There will be those who find the obviously intentional anachronisms too much, whilst others will take umbrage with the disregard for historical authenticity. For me, whilst I admire Lanthimos for trying to bring something new to his _oeuvre_, especially when compared to _Sacred Deer_, I felt the film was oftentimes trying to work its way through an identity crisis, unsure of exactly what kind of tone to settle on. I had similar feelings about the allegories that run throughout, but are never what you would call fully fleshed out. Obviously, it's a treatise on power and the ridiculous opulence of royalty, but that's not exactly an untapped issue in cinema. Additionally, one of my biggest problems with _Sacred Deer_ was how utterly pointless it felt, and although I got a lot more out of _The Favourite_, I had something of the same reaction to it. It could also be argued that the characters are a little two dimensional, and filmgoers who need a protagonist to latch onto, someone to root for, will be left rudderless.\r\n\r\n_The Favourite_ will probably attract a sizable unprepared audience because of awards buzz, positive reviews, and excellent trailer. Undoubtedly, for a lot of people, this will be their first exposure to Lanthimos, and I can only imagine what people expecting a Merchant-Ivory costume drama will make of it all. Neither morally enlightening nor historically respectful, _The Favourite_ offers a bleak assessment of humanity's core drives; not Lanthimos's bleakest, but a hell of a lot more nihilistic than an average multiplex goer will be used to. The characters within the film live in a _milieu_ of egotism, narcissism, sexual cruelty, psychological bullying, greed, and hunger for power. There's barely a hint of sentimentality, and very little that could be called morally righteous. I would have liked it to have more meat on its bones, but at the same time, one cannot deny that it presents something of a faithful looking-glass, as Lanthimos continues to corner the market in pointing out not just humanity's worst foibles, but its most egregious eccentricities and lamentable character defects.", "created_at": "2019-07-05T21:53:07.868Z"}, {"movie_id": 375262, "review_id": "5e76b130a055ef00182d497f", "author_rating": 7.0, "review_text": "Some wounds do not close; I have many such. One just walks around with them and sometimes one can feel them filling with blood. \r\n\r\nThe Favourite is directed by Yorgos Lanthimos and written by Deborah Davis and Tony McNamara. It stars Olivia Colman, Rachael Weisz, Emma Stone, Faye Daveney, James Smith, Mark Gatiss, Willem Dalby and Nicholas Hoult.     \r\n\r\nIn early 18th century England, a frail Queen Anne (Colman) occupies the throne and her close friend, Lady Sarah (Weisz), governs the country in her stead. When a new servant, Abigail (Stone), arrives, her charm endears her to Sarah. \r\n\r\nA critical darling with awards and nominations to match, The Favourite, to me at least, is something of an acquired taste. Firstly it should be noted that as a history lesson it's pure bunkum, so much so I wondered if Lanthimos is actually Mel Gibson. Though to be fair to Lanthimos, he never hid from the fact he and his writers were pretty much making it up for entertainment purpose.\r\n\r\nThe craft on show is top level, with three high quality lead lady performances giving their all for the director. Lanthimos also has some nifty camera tricks up his sleeve, it's clear that this is a talent to follow for those so inclined to his off kilter type of film making. Helps, too, that the costuming and set designs are also from the top draw. It's hard to fault from a production standpoint.\r\n\r\nNarratively the pic is pulsing with parliamentary politics that blends with royal shenanigans. Yet ultimately the prime concern is about the battle for Queen Anne's soul between Sarah and Abigail. This consistently remains fascinating, even as Lanthimos continues to sex things up and pitches black comedy alongside the tragic thrum at the core. \r\n\r\nIt's an odd mix of a film that I personally don't think works as a whole, and with the finale a crushing disappointment, it leaves one in awe and yet also unsatisfied. 7/10", "created_at": "2020-03-22T00:28:32.835Z"}]