[{"movie_id": 13183, "review_id": "5d0f39529251413945be3d4a", "author_rating": 8.0, "review_text": "The comic book geek blockbuster for adults only.\r\n\r\nWatchmen is directed by Zack Snyder and adapted to screenplay by David Hayter and Alex Tse from the Alan Moore/David Gibbons graphic novel. It stars Patrick Wilson, Malin Ackerman, Billy Crudup, Jackie Earle Haley, Jeffrey Dean Morgan, Carla Gugino and Matt Frewer. Music is by Tyler Bates and cinematography by Larry Fong.\r\n\r\n1985 and someone is killing all our superheroes. Time for the remaining super heroes to band together - but what they find as they fight the good fight is potential annihilation for everyone.\r\n\r\nIt was quite a battle getting Watchmen onto the screen, over twenty years of legal wrangling and controversies, it got to the point where fans of the source material doubted it would ever happen - and even if it did it was sure to be a monstrous failure. How pleasing to find that not only did it make it to the screen, but it is also a genre bending winner - well to some of us of course...\r\n\r\nOne has to take into context just how potent and original the graphic novel was back in 1986/7, we are dealing with very mature themes, superheroes with serious psychological baggage. Alan Moore lit the touch paper in the comic book kingdom that the rest have since followed to keep the torch burning well into the new millennium. Snyder has achieved top line results in getting both the feel and look of the source, even if some of Moore's cunning cynicism has been lost in translation.\r\n\r\nStory is set right in the middle of nuclear paranoia and the fear of the Soviets in 85, the America we view is dank and depressing, noirish in vibe (aided by Rorschach's clobber and detective inclinations), it's a world on the road to nowhere. We are also at a time in the alternate world where superheroes are banned from operating, forcing The Watchmen to become vigilantes - that is if they can get along and shunt their psycho discord to one side. The back stories of the main protagonists are fully formed, and these are not jolly characters, so much so you worry the fate of mankind is doomed if these are who we rely on to save us.\r\n\r\nThere was in no way that Snyder would be able to produce a comic book filmic adaptation that would be as worshipped in that sphere, to rival that of the worship the novel has in its own. However, coming at it as someone who only sought out the source material after seeing the film, it shines bright for newcomers who are ironically seeking darker tints in superhero tales. Oh it has the requisite nifty twists (a clinical mystery to be unearthed), booming visuals, excellent effects work and smartly constructed action set-pieces, but narratively it's moody and calls for the utmost attention on dialogue passages (I have found it gets better on repeat viewings).\r\n\r\nSnyder clearly cared about the project and that love is evident in the movie. It was never going to appease all and sundry, but at worst to hardcore Moore fans it's at least an honourable failure, to many others it's a smart and stylishly refreshing genre booster. 8/10", "created_at": "2019-06-23T08:33:22.671Z"}, {"movie_id": 13183, "review_id": "5db71ff70792e1001343a0a9", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this review is based on the theatrical version of Watchmen. Usually, Director's Cuts or Ultimate Editions are not preferred over the original release. Few films benefit from them, and most are simply an extended cut with a bunch of deleted scenes. It's only fair and rational that a reviewer watches the version which the whole world saw at the theaters at the respective time. With that said, despite knowing the story of the source material, I never indeed read it. Having in mind that most of the \"hate\" that this Zack Snyder's movie received is from comic-book purists (basically, every book/comic/game/whatever-lover who defends that any cinematic adaptations of any of these sources MUST be 100% the same, with no modifications whatsoever), I'm certain an unbiased perspective is the way to go.\r\n\r\nAnd overall, this is a good feature. Watchmen isn't just another CBM (comic-book movie). It doesn't just follow one hero vs. one villain. It's a whole world (in today's standards, it's really a cinematic universe) of \"superheroes\" meant to be explored in fine detail (hence the release of a TV show today... reviewing that later). It's an extremely complex world that needs to be thoroughly explained in order to deeply understand how it works, and what's everyone's role in it. This is the film's main problem: it struggles to juggle all of its different storylines and distinct characters. Even with 163min of runtime, it's impossible to squeeze in all of the necessary information.\r\n\r\nSo, as expected, Snyder and his team of screenwriters had to simplify, shorten, or even wholly dismiss some story elements that would only stretch the runtime to an unfathomable length. Some of the adaptations work brilliantly, but some fail to give a character its importance or offer no interest to a subplot. However, it's still easy to understand everything, and how the ending is going to unravel, which leads me to my second issue with the movie: its final act's heavy exposition.\r\n\r\nLike I wrote above, there is a lot of information to deliver. What Snyder did very well was to tell most of it through flashbacks or captivating conversations, but in the final act, where everything was self-explanatory and in no need of more exposition, there is an excess of redundant dialogue that doesn't really add anything relevant. What the characters are saying is significant, yes, but we, as the audience, already know all of that way before the film's climax. It's ironic how they make a joke about villains telling their masterplan to the hero and how this villain isn't dumb enough to do it, but then proceed to carefully explain everything (that we know already) through exposition.\r\n\r\nSincerely, these are the major problems that I have with the movie. However, I love so much about everything else. From the appropriated and fun soundtracks to the beautiful production design, Zack Snyder and his crew really do a fantastic work technically. Snyder's style captures Watchmen's world perfectly. It's one of those films that carry a \"feel\" due to its stylish cinematography. I love how little CGI is actually applied (I'm obviously ignoring the big blue guy), and the abundance of practical effects and real sets that are used. The action sequences look spectacular, way better than a lot of blockbusters nowadays (10 years later!).\r\n\r\nDespite the terrific technical achievements, my main compliment is actually connected to my number one problem. Even though the storylines are incredibly hard to balance, characters like Rorschach, Nite Owl, Silk Spectre, and The Comedian (Jeffrey Dean Morgan) have extraordinarily captivating and entertaining stories. There might be a few missteps here and there, but Snyder made ONE movie from a material that's worth a whole TV show or at least two films. And he delivered a GOOD one! Probably a better job than 80% of the directors working today could ever achieve. Finally, the social commentary is still quite relevant for this new generation, and if the so-called \"source-material-purists\" didn't exist, this movie would be a lot more appreciated.\r\n\r\nAll in all, Watchmen is as good as it could be, having in mind it's just one film with already a long runtime. Its narrative was always going to be extremely difficult to tell in a solid yet compelling manner, and Zack Snyder does struggle with balancing all of the storylines and its characters. However, he and his phenomenal team still delivered a good flick. Technically sublime, with a distinct style, brilliant production design, and gorgeous cinematography. Characters like Rorschach and Nite Owl have amazing moments, filled with excellent action sequences, but also with emotionally powerful scenes. If it could be better? Maybe. If it could be split into two or three movies. As it stands, as one and only film, it's really impressive even with its flaws.\r\n\r\nRating: B", "created_at": "2019-10-28T17:05:59.705Z"}, {"movie_id": 13183, "review_id": "5e3fd66c9603310017ed0b20", "author_rating": 10.0, "review_text": "As humans, we are drawn to what inspires us, interests us, and tickles our fancy. Human opinion can be a fickle thing, especially when it comes to film, books, and music, due to this the message that is interwoven through these mediums are missed by all of us simply because we won't take the time to watch, read or listen to what is being said to us.\r\n\r\nThe message throughout Watchman and Tales of The Black Freighter in film and more importantly in graphic novel form is that we as humans try so hard to make the world a better place, but being pushed so far while trying to rid the world of evil we become the very thing we're fighting against, sometimes this a fact we do not see, or we do when it's too late. When Alan Moore wrote the story for the graphic novel, he did so at the height of this planet's greatest threat of nuclear annihilation; The Cold War, The U.S. and Russia at a stalemate over nuclear arms, and Russia's invasion of Afghanistan, had meant that at any moment millions of people on this planet could have met a brutal end.\r\n\r\nAs far as the story goes, this is a concept that has been warped, and manipulated into a alternate universe where in 1985 Richard Nixon has changed the constitution of the USA and made it allowable for him to serve more than 2 terms of Presidency, it's also a universe where in the times after WWII ordinary citizens decided that crime and corruption throughout America, and especially New York had gotten to levels beyond the control of authorities that they would suit up as masked vigilantes, and fight crime head on. By 1985 masked heroes are outlawed, and former \"heroes\" were forced to reveal themselves, or stay hidden, but give up their lifestyle.\r\n\r\nThe story of the most part is told through the eyes of one character Rorschach (Haley) as he investigates the murder of a fellow vigilante, The Comedian (Morgan). Rorschach is the only vigilante who has not given up the lifestyle, and is wanted by the F.B.I. Rorschach tries to re-engage the remaining \"heroes\" to help him find the murderer, and get to the heart of why he was murdered. The other \"heroes\" are Night Owl II (Wilson); an aging recluse who inherited a fortune from his father and used it to engage in vigilante activities, Silk Spectre II (Ackerman); daughter of an original Minutewoman (Cugino), Ozymandias (Goode), a self made millionaire who has modeled himself and his life on Alexander the Great, and Dr. Manhattan (Crudup), the only real superhero due an accident in a atomic chamber in a lab when he was a physicist.\r\n\r\nThe film follows pretty closely the themes and tone of the book, much more than any comic related movie before it, thanks mostly to the dedication of director Zack Snyder. The look and feel of the film to date it in 1985 was very well handled, and can certainly be called a period piece due to the level of exact detail through-out. Performances are in general pretty well done, and reflect the emotions of the characters in the book, as this is the Ultimate Cut, the extended scenes, plus the interwoven story of the comic book within a comic book; \"Tales of The Black Freighter\" make for a film that is worthy of its 215 minute length. Having said that they leave well and truly enough of the story in the theatrical cut where the message still shines through.\r\n\r\nThe credits for this film are the best I have ever seen, using the Bob Dylan song \"The Times They Are A-Changing\", and features snapshots of the highs and lows of the Minutemen and Watchmen from the 1940's through to the 1980's against the backdrop of important cultural and political icons and events.\r\n\r\nThis movie is easily one of my favourites of the modern age of film, because of the well delivered message, and the uncompromised approach to bring the graphic novel to life.", "created_at": "2020-02-09T09:52:44.329Z"}, {"movie_id": 13183, "review_id": "5ec47bcf28723c0021489870", "author_rating": 8.0, "review_text": "Click here for a video version of this review: youtu.be/2tkzmGjXfdE\r\n\r\n_Watchmen_ polarised audiences when it arrived in theatres in 2009. Coming not long after Marvel's _Iron Man_ many were expecting a fun action oriented super hero movie. _Watchmen_ however, is not that kind of movie. Just like the source material it comes from, this is a dark and brooding film that deals with some complicated questions.\r\n\r\nHere is the official description:\r\n\r\n_In a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so uncover a sinister plot that puts all of humanity in grave danger._\r\n\r\nStarting off with a fantastic montage that, with barely a word, fills you in on the alternate history of the movie, and the timeline of things leading up to the start of the main story, Watchmen does a great job of building this world you are about to inhabit for two hours and 45 minutes. The characters are strong, and develop logically over the course of the film, and you can really feel their sense of despair or feeling of not belonging. I think of all the comic book movies I've seen, this one captures best those feelings the characters have of being lonely outsiders. Rorschach's commitment to the truth in the movie leads to a brilliant defining moment was where it all just bursts out from him. It was very well done. He, as a character, is so good that I think he deserves his own movie in the same noir-ish style.\r\n\r\nThe length and style of this will turn a lot of people off, it is much more of a character piece than a big explosive action extravaganza. In my opinion, it's one of the better comic book movies out there.\r\n\r\nTop all that off with a fantastic sound track of 1980s music and this is a pretty good package. If you like bright lights and shiny tights, this is not the comic book movie for you. If however you like a super hero movie with some depth and that deals with some philosophical questions this will give you a lot more to chew over than some other DC adaptations.", "created_at": "2020-05-20T00:37:35.411Z"}, {"movie_id": 13183, "review_id": "60f322f1635e78007cbfbf1d", "author_rating": 9.0, "review_text": "_**The \"Apocalypse Now\" of superhero films**_\r\n\r\nBased on Alan Moore's graphic novel, 2009's \"Watchmen\" takes place in an alternative 1985 where Nixon is serving his fifth term and costumed vigilantism is illegal. A former masked crimefighter named The Comedian is murdered, prompting his previous teammates to investigate the crime. Things get complicated as the backstories of most of the Watchmen are revealed and worldwide nuclear war looms.\r\n\r\nFor some reason I was never interested in the Watchmen and therefore never read the graphic novel, even though I had the opportunity. Why? The fact that it took place in an alternative reality turned me off, as did the peculiarities of the team members which, I later discovered, Moore intended as satire. That said, this is mind-blowing. \"Watchmen\" is an adult-oriented superhero flick with a convoluted plot, strong characters and total originality. The latter two score high marks with me any day.\r\n\r\nRorschach (Jackie Earle Haley) stands out with his gravelly voice and right-wing ideology, although he's not very likable. He's impressive yet, at the same time, kind of pathetic. The character was based on Steve Ditko's The Question.\r\n\r\nThe Comedian (Jeffrey Dean Morgan) exudes great charisma and is reminiscent of The Punisher, if he were a jokester. Unfortunately, The Comedian's arrogant & hotheaded and has a weakness towards the ladies, not to mention cold-blooded murder.\r\n\r\nNight Owl (Patrick Wilson) is another strong character, obviously based on Batman or Blue Beetle. Unlike the previous two he's very likable. I always thought his costume looked really lame in the graphic novel but, as depicted in the film, it kicks axx.\r\n\r\nDr. Manhattan (Greg Plitt), named for the Manhattan Project and based on Captain Atom with a dash of Mr. Fantastic, is an almost God-like being who can do pretty much anything. He's so detached from the human experience that he walks around totally nude and has no time for his woman, Silk Spectre II. He'd rather hang out on Mars -- literally!\r\n\r\nSilk Spectre II (Malin Akerman) stands out due to her sexy costume more than anything else, not to mention Akerman's drop-dead-gorgeous looks. The character was based on Phantom Lady and Black Canary. Silk can't handle Dr. Manhattan's increasing aloofness and consequently diverts to Night Owl for human warmth.\r\n\r\nSilk Spectre (Carla Gugino) is Silk Spectre II's mother and has a pretty significant part. Like her daughter, she's hot, albeit in a whole different way.\r\n\r\nOzzyosbourne, whoops, I mean Ozymandias (Matthew Goode) is the least developed character and loosely based on Charlton Comic's Thunderbolt. He's ultra-smart, ultra-quick and kinda foppish.\r\n\r\nAnother highlight is the hypnotic score by Tyler Bates mixed with a quality soundtrack (e.g. \"The Sound of Silence,\" \"All Along the Watchtower,\" etc.)\r\n\r\nBOTTOM LINE: The film is long, dark, mature, dialogue-driven and convoluted, but the strong characters and originality win the day. No moronic \"blockbuster\" trash here. Not to mention Silk Spectre II and her mother are extremely easy on the eyes. As far as superhero flicks go, there's really nothing else like \"Watchmen.\" It's even more atypical than the X-Men and easily one of my favorite superhero flicks, maybe even THE favorite. \"Watchmen\" is like the \"Apocalypse Now\" of superhero films!\r\n\r\nRUNTIME: Theatrical Cut: 162 minutes; Director's Cut: 186 minutes; The Ultimate Cut: 215 minutes\r\n\r\nCOMPARING CUTS: I own both the theatrical cut and Director's Cut. Although the theatrical version is just fine, the DC is worthwhile for extended dialogue to existing scenes in the theatrical cut; the biggest addition is an attack on Night Owl's Mentor, Hollis Mason, at the hands of a thug gang and Night Owl's subsequent brutal revenge at a bar. Despite the convoluted plot, I had no problem following the story in the theatrical cut, even though I've never read the graphic novel. The filmmakers did an excellent job cutting out the fat in the theatrical version. So don't think you'll need to purchase the DC to understand the story; it's not necessary. My recommendation is to check out the theatrical version first and only purchase the DC if the theatrical cut left you wanting even more, which is what it did for me. Even so, I PREFER the theatrical cut; it's leaner and just all-around better.\r\n\r\nGRADE: A", "created_at": "2021-07-17T18:35:29.493Z"}, {"movie_id": 13183, "review_id": "5d0f39529251413945be3d4a", "author_rating": 8.0, "review_text": "The comic book geek blockbuster for adults only.\r\n\r\nWatchmen is directed by Zack Snyder and adapted to screenplay by David Hayter and Alex Tse from the Alan Moore/David Gibbons graphic novel. It stars Patrick Wilson, Malin Ackerman, Billy Crudup, Jackie Earle Haley, Jeffrey Dean Morgan, Carla Gugino and Matt Frewer. Music is by Tyler Bates and cinematography by Larry Fong.\r\n\r\n1985 and someone is killing all our superheroes. Time for the remaining super heroes to band together - but what they find as they fight the good fight is potential annihilation for everyone.\r\n\r\nIt was quite a battle getting Watchmen onto the screen, over twenty years of legal wrangling and controversies, it got to the point where fans of the source material doubted it would ever happen - and even if it did it was sure to be a monstrous failure. How pleasing to find that not only did it make it to the screen, but it is also a genre bending winner - well to some of us of course...\r\n\r\nOne has to take into context just how potent and original the graphic novel was back in 1986/7, we are dealing with very mature themes, superheroes with serious psychological baggage. Alan Moore lit the touch paper in the comic book kingdom that the rest have since followed to keep the torch burning well into the new millennium. Snyder has achieved top line results in getting both the feel and look of the source, even if some of Moore's cunning cynicism has been lost in translation.\r\n\r\nStory is set right in the middle of nuclear paranoia and the fear of the Soviets in 85, the America we view is dank and depressing, noirish in vibe (aided by Rorschach's clobber and detective inclinations), it's a world on the road to nowhere. We are also at a time in the alternate world where superheroes are banned from operating, forcing The Watchmen to become vigilantes - that is if they can get along and shunt their psycho discord to one side. The back stories of the main protagonists are fully formed, and these are not jolly characters, so much so you worry the fate of mankind is doomed if these are who we rely on to save us.\r\n\r\nThere was in no way that Snyder would be able to produce a comic book filmic adaptation that would be as worshipped in that sphere, to rival that of the worship the novel has in its own. However, coming at it as someone who only sought out the source material after seeing the film, it shines bright for newcomers who are ironically seeking darker tints in superhero tales. Oh it has the requisite nifty twists (a clinical mystery to be unearthed), booming visuals, excellent effects work and smartly constructed action set-pieces, but narratively it's moody and calls for the utmost attention on dialogue passages (I have found it gets better on repeat viewings).\r\n\r\nSnyder clearly cared about the project and that love is evident in the movie. It was never going to appease all and sundry, but at worst to hardcore Moore fans it's at least an honourable failure, to many others it's a smart and stylishly refreshing genre booster. 8/10", "created_at": "2019-06-23T08:33:22.671Z"}, {"movie_id": 13183, "review_id": "5db71ff70792e1001343a0a9", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this review is based on the theatrical version of Watchmen. Usually, Director's Cuts or Ultimate Editions are not preferred over the original release. Few films benefit from them, and most are simply an extended cut with a bunch of deleted scenes. It's only fair and rational that a reviewer watches the version which the whole world saw at the theaters at the respective time. With that said, despite knowing the story of the source material, I never indeed read it. Having in mind that most of the \"hate\" that this Zack Snyder's movie received is from comic-book purists (basically, every book/comic/game/whatever-lover who defends that any cinematic adaptations of any of these sources MUST be 100% the same, with no modifications whatsoever), I'm certain an unbiased perspective is the way to go.\r\n\r\nAnd overall, this is a good feature. Watchmen isn't just another CBM (comic-book movie). It doesn't just follow one hero vs. one villain. It's a whole world (in today's standards, it's really a cinematic universe) of \"superheroes\" meant to be explored in fine detail (hence the release of a TV show today... reviewing that later). It's an extremely complex world that needs to be thoroughly explained in order to deeply understand how it works, and what's everyone's role in it. This is the film's main problem: it struggles to juggle all of its different storylines and distinct characters. Even with 163min of runtime, it's impossible to squeeze in all of the necessary information.\r\n\r\nSo, as expected, Snyder and his team of screenwriters had to simplify, shorten, or even wholly dismiss some story elements that would only stretch the runtime to an unfathomable length. Some of the adaptations work brilliantly, but some fail to give a character its importance or offer no interest to a subplot. However, it's still easy to understand everything, and how the ending is going to unravel, which leads me to my second issue with the movie: its final act's heavy exposition.\r\n\r\nLike I wrote above, there is a lot of information to deliver. What Snyder did very well was to tell most of it through flashbacks or captivating conversations, but in the final act, where everything was self-explanatory and in no need of more exposition, there is an excess of redundant dialogue that doesn't really add anything relevant. What the characters are saying is significant, yes, but we, as the audience, already know all of that way before the film's climax. It's ironic how they make a joke about villains telling their masterplan to the hero and how this villain isn't dumb enough to do it, but then proceed to carefully explain everything (that we know already) through exposition.\r\n\r\nSincerely, these are the major problems that I have with the movie. However, I love so much about everything else. From the appropriated and fun soundtracks to the beautiful production design, Zack Snyder and his crew really do a fantastic work technically. Snyder's style captures Watchmen's world perfectly. It's one of those films that carry a \"feel\" due to its stylish cinematography. I love how little CGI is actually applied (I'm obviously ignoring the big blue guy), and the abundance of practical effects and real sets that are used. The action sequences look spectacular, way better than a lot of blockbusters nowadays (10 years later!).\r\n\r\nDespite the terrific technical achievements, my main compliment is actually connected to my number one problem. Even though the storylines are incredibly hard to balance, characters like Rorschach, Nite Owl, Silk Spectre, and The Comedian (Jeffrey Dean Morgan) have extraordinarily captivating and entertaining stories. There might be a few missteps here and there, but Snyder made ONE movie from a material that's worth a whole TV show or at least two films. And he delivered a GOOD one! Probably a better job than 80% of the directors working today could ever achieve. Finally, the social commentary is still quite relevant for this new generation, and if the so-called \"source-material-purists\" didn't exist, this movie would be a lot more appreciated.\r\n\r\nAll in all, Watchmen is as good as it could be, having in mind it's just one film with already a long runtime. Its narrative was always going to be extremely difficult to tell in a solid yet compelling manner, and Zack Snyder does struggle with balancing all of the storylines and its characters. However, he and his phenomenal team still delivered a good flick. Technically sublime, with a distinct style, brilliant production design, and gorgeous cinematography. Characters like Rorschach and Nite Owl have amazing moments, filled with excellent action sequences, but also with emotionally powerful scenes. If it could be better? Maybe. If it could be split into two or three movies. As it stands, as one and only film, it's really impressive even with its flaws.\r\n\r\nRating: B", "created_at": "2019-10-28T17:05:59.705Z"}, {"movie_id": 13183, "review_id": "5e3fd66c9603310017ed0b20", "author_rating": 10.0, "review_text": "As humans, we are drawn to what inspires us, interests us, and tickles our fancy. Human opinion can be a fickle thing, especially when it comes to film, books, and music, due to this the message that is interwoven through these mediums are missed by all of us simply because we won't take the time to watch, read or listen to what is being said to us.\r\n\r\nThe message throughout Watchman and Tales of The Black Freighter in film and more importantly in graphic novel form is that we as humans try so hard to make the world a better place, but being pushed so far while trying to rid the world of evil we become the very thing we're fighting against, sometimes this a fact we do not see, or we do when it's too late. When Alan Moore wrote the story for the graphic novel, he did so at the height of this planet's greatest threat of nuclear annihilation; The Cold War, The U.S. and Russia at a stalemate over nuclear arms, and Russia's invasion of Afghanistan, had meant that at any moment millions of people on this planet could have met a brutal end.\r\n\r\nAs far as the story goes, this is a concept that has been warped, and manipulated into a alternate universe where in 1985 Richard Nixon has changed the constitution of the USA and made it allowable for him to serve more than 2 terms of Presidency, it's also a universe where in the times after WWII ordinary citizens decided that crime and corruption throughout America, and especially New York had gotten to levels beyond the control of authorities that they would suit up as masked vigilantes, and fight crime head on. By 1985 masked heroes are outlawed, and former \"heroes\" were forced to reveal themselves, or stay hidden, but give up their lifestyle.\r\n\r\nThe story of the most part is told through the eyes of one character Rorschach (Haley) as he investigates the murder of a fellow vigilante, The Comedian (Morgan). Rorschach is the only vigilante who has not given up the lifestyle, and is wanted by the F.B.I. Rorschach tries to re-engage the remaining \"heroes\" to help him find the murderer, and get to the heart of why he was murdered. The other \"heroes\" are Night Owl II (Wilson); an aging recluse who inherited a fortune from his father and used it to engage in vigilante activities, Silk Spectre II (Ackerman); daughter of an original Minutewoman (Cugino), Ozymandias (Goode), a self made millionaire who has modeled himself and his life on Alexander the Great, and Dr. Manhattan (Crudup), the only real superhero due an accident in a atomic chamber in a lab when he was a physicist.\r\n\r\nThe film follows pretty closely the themes and tone of the book, much more than any comic related movie before it, thanks mostly to the dedication of director Zack Snyder. The look and feel of the film to date it in 1985 was very well handled, and can certainly be called a period piece due to the level of exact detail through-out. Performances are in general pretty well done, and reflect the emotions of the characters in the book, as this is the Ultimate Cut, the extended scenes, plus the interwoven story of the comic book within a comic book; \"Tales of The Black Freighter\" make for a film that is worthy of its 215 minute length. Having said that they leave well and truly enough of the story in the theatrical cut where the message still shines through.\r\n\r\nThe credits for this film are the best I have ever seen, using the Bob Dylan song \"The Times They Are A-Changing\", and features snapshots of the highs and lows of the Minutemen and Watchmen from the 1940's through to the 1980's against the backdrop of important cultural and political icons and events.\r\n\r\nThis movie is easily one of my favourites of the modern age of film, because of the well delivered message, and the uncompromised approach to bring the graphic novel to life.", "created_at": "2020-02-09T09:52:44.329Z"}, {"movie_id": 13183, "review_id": "5ec47bcf28723c0021489870", "author_rating": 8.0, "review_text": "Click here for a video version of this review: youtu.be/2tkzmGjXfdE\r\n\r\n_Watchmen_ polarised audiences when it arrived in theatres in 2009. Coming not long after Marvel's _Iron Man_ many were expecting a fun action oriented super hero movie. _Watchmen_ however, is not that kind of movie. Just like the source material it comes from, this is a dark and brooding film that deals with some complicated questions.\r\n\r\nHere is the official description:\r\n\r\n_In a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so uncover a sinister plot that puts all of humanity in grave danger._\r\n\r\nStarting off with a fantastic montage that, with barely a word, fills you in on the alternate history of the movie, and the timeline of things leading up to the start of the main story, Watchmen does a great job of building this world you are about to inhabit for two hours and 45 minutes. The characters are strong, and develop logically over the course of the film, and you can really feel their sense of despair or feeling of not belonging. I think of all the comic book movies I've seen, this one captures best those feelings the characters have of being lonely outsiders. Rorschach's commitment to the truth in the movie leads to a brilliant defining moment was where it all just bursts out from him. It was very well done. He, as a character, is so good that I think he deserves his own movie in the same noir-ish style.\r\n\r\nThe length and style of this will turn a lot of people off, it is much more of a character piece than a big explosive action extravaganza. In my opinion, it's one of the better comic book movies out there.\r\n\r\nTop all that off with a fantastic sound track of 1980s music and this is a pretty good package. If you like bright lights and shiny tights, this is not the comic book movie for you. If however you like a super hero movie with some depth and that deals with some philosophical questions this will give you a lot more to chew over than some other DC adaptations.", "created_at": "2020-05-20T00:37:35.411Z"}, {"movie_id": 13183, "review_id": "60f322f1635e78007cbfbf1d", "author_rating": 9.0, "review_text": "_**The \"Apocalypse Now\" of superhero films**_\r\n\r\nBased on Alan Moore's graphic novel, 2009's \"Watchmen\" takes place in an alternative 1985 where Nixon is serving his fifth term and costumed vigilantism is illegal. A former masked crimefighter named The Comedian is murdered, prompting his previous teammates to investigate the crime. Things get complicated as the backstories of most of the Watchmen are revealed and worldwide nuclear war looms.\r\n\r\nFor some reason I was never interested in the Watchmen and therefore never read the graphic novel, even though I had the opportunity. Why? The fact that it took place in an alternative reality turned me off, as did the peculiarities of the team members which, I later discovered, Moore intended as satire. That said, this is mind-blowing. \"Watchmen\" is an adult-oriented superhero flick with a convoluted plot, strong characters and total originality. The latter two score high marks with me any day.\r\n\r\nRorschach (Jackie Earle Haley) stands out with his gravelly voice and right-wing ideology, although he's not very likable. He's impressive yet, at the same time, kind of pathetic. The character was based on Steve Ditko's The Question.\r\n\r\nThe Comedian (Jeffrey Dean Morgan) exudes great charisma and is reminiscent of The Punisher, if he were a jokester. Unfortunately, The Comedian's arrogant & hotheaded and has a weakness towards the ladies, not to mention cold-blooded murder.\r\n\r\nNight Owl (Patrick Wilson) is another strong character, obviously based on Batman or Blue Beetle. Unlike the previous two he's very likable. I always thought his costume looked really lame in the graphic novel but, as depicted in the film, it kicks axx.\r\n\r\nDr. Manhattan (Greg Plitt), named for the Manhattan Project and based on Captain Atom with a dash of Mr. Fantastic, is an almost God-like being who can do pretty much anything. He's so detached from the human experience that he walks around totally nude and has no time for his woman, Silk Spectre II. He'd rather hang out on Mars -- literally!\r\n\r\nSilk Spectre II (Malin Akerman) stands out due to her sexy costume more than anything else, not to mention Akerman's drop-dead-gorgeous looks. The character was based on Phantom Lady and Black Canary. Silk can't handle Dr. Manhattan's increasing aloofness and consequently diverts to Night Owl for human warmth.\r\n\r\nSilk Spectre (Carla Gugino) is Silk Spectre II's mother and has a pretty significant part. Like her daughter, she's hot, albeit in a whole different way.\r\n\r\nOzzyosbourne, whoops, I mean Ozymandias (Matthew Goode) is the least developed character and loosely based on Charlton Comic's Thunderbolt. He's ultra-smart, ultra-quick and kinda foppish.\r\n\r\nAnother highlight is the hypnotic score by Tyler Bates mixed with a quality soundtrack (e.g. \"The Sound of Silence,\" \"All Along the Watchtower,\" etc.)\r\n\r\nBOTTOM LINE: The film is long, dark, mature, dialogue-driven and convoluted, but the strong characters and originality win the day. No moronic \"blockbuster\" trash here. Not to mention Silk Spectre II and her mother are extremely easy on the eyes. As far as superhero flicks go, there's really nothing else like \"Watchmen.\" It's even more atypical than the X-Men and easily one of my favorite superhero flicks, maybe even THE favorite. \"Watchmen\" is like the \"Apocalypse Now\" of superhero films!\r\n\r\nRUNTIME: Theatrical Cut: 162 minutes; Director's Cut: 186 minutes; The Ultimate Cut: 215 minutes\r\n\r\nCOMPARING CUTS: I own both the theatrical cut and Director's Cut. Although the theatrical version is just fine, the DC is worthwhile for extended dialogue to existing scenes in the theatrical cut; the biggest addition is an attack on Night Owl's Mentor, Hollis Mason, at the hands of a thug gang and Night Owl's subsequent brutal revenge at a bar. Despite the convoluted plot, I had no problem following the story in the theatrical cut, even though I've never read the graphic novel. The filmmakers did an excellent job cutting out the fat in the theatrical version. So don't think you'll need to purchase the DC to understand the story; it's not necessary. My recommendation is to check out the theatrical version first and only purchase the DC if the theatrical cut left you wanting even more, which is what it did for me. Even so, I PREFER the theatrical cut; it's leaner and just all-around better.\r\n\r\nGRADE: A", "created_at": "2021-07-17T18:35:29.493Z"}, {"movie_id": 13183, "review_id": "5d0f39529251413945be3d4a", "author_rating": 8.0, "review_text": "The comic book geek blockbuster for adults only.\r\n\r\nWatchmen is directed by Zack Snyder and adapted to screenplay by David Hayter and Alex Tse from the Alan Moore/David Gibbons graphic novel. It stars Patrick Wilson, Malin Ackerman, Billy Crudup, Jackie Earle Haley, Jeffrey Dean Morgan, Carla Gugino and Matt Frewer. Music is by Tyler Bates and cinematography by Larry Fong.\r\n\r\n1985 and someone is killing all our superheroes. Time for the remaining super heroes to band together - but what they find as they fight the good fight is potential annihilation for everyone.\r\n\r\nIt was quite a battle getting Watchmen onto the screen, over twenty years of legal wrangling and controversies, it got to the point where fans of the source material doubted it would ever happen - and even if it did it was sure to be a monstrous failure. How pleasing to find that not only did it make it to the screen, but it is also a genre bending winner - well to some of us of course...\r\n\r\nOne has to take into context just how potent and original the graphic novel was back in 1986/7, we are dealing with very mature themes, superheroes with serious psychological baggage. Alan Moore lit the touch paper in the comic book kingdom that the rest have since followed to keep the torch burning well into the new millennium. Snyder has achieved top line results in getting both the feel and look of the source, even if some of Moore's cunning cynicism has been lost in translation.\r\n\r\nStory is set right in the middle of nuclear paranoia and the fear of the Soviets in 85, the America we view is dank and depressing, noirish in vibe (aided by Rorschach's clobber and detective inclinations), it's a world on the road to nowhere. We are also at a time in the alternate world where superheroes are banned from operating, forcing The Watchmen to become vigilantes - that is if they can get along and shunt their psycho discord to one side. The back stories of the main protagonists are fully formed, and these are not jolly characters, so much so you worry the fate of mankind is doomed if these are who we rely on to save us.\r\n\r\nThere was in no way that Snyder would be able to produce a comic book filmic adaptation that would be as worshipped in that sphere, to rival that of the worship the novel has in its own. However, coming at it as someone who only sought out the source material after seeing the film, it shines bright for newcomers who are ironically seeking darker tints in superhero tales. Oh it has the requisite nifty twists (a clinical mystery to be unearthed), booming visuals, excellent effects work and smartly constructed action set-pieces, but narratively it's moody and calls for the utmost attention on dialogue passages (I have found it gets better on repeat viewings).\r\n\r\nSnyder clearly cared about the project and that love is evident in the movie. It was never going to appease all and sundry, but at worst to hardcore Moore fans it's at least an honourable failure, to many others it's a smart and stylishly refreshing genre booster. 8/10", "created_at": "2019-06-23T08:33:22.671Z"}, {"movie_id": 13183, "review_id": "5db71ff70792e1001343a0a9", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this review is based on the theatrical version of Watchmen. Usually, Director's Cuts or Ultimate Editions are not preferred over the original release. Few films benefit from them, and most are simply an extended cut with a bunch of deleted scenes. It's only fair and rational that a reviewer watches the version which the whole world saw at the theaters at the respective time. With that said, despite knowing the story of the source material, I never indeed read it. Having in mind that most of the \"hate\" that this Zack Snyder's movie received is from comic-book purists (basically, every book/comic/game/whatever-lover who defends that any cinematic adaptations of any of these sources MUST be 100% the same, with no modifications whatsoever), I'm certain an unbiased perspective is the way to go.\r\n\r\nAnd overall, this is a good feature. Watchmen isn't just another CBM (comic-book movie). It doesn't just follow one hero vs. one villain. It's a whole world (in today's standards, it's really a cinematic universe) of \"superheroes\" meant to be explored in fine detail (hence the release of a TV show today... reviewing that later). It's an extremely complex world that needs to be thoroughly explained in order to deeply understand how it works, and what's everyone's role in it. This is the film's main problem: it struggles to juggle all of its different storylines and distinct characters. Even with 163min of runtime, it's impossible to squeeze in all of the necessary information.\r\n\r\nSo, as expected, Snyder and his team of screenwriters had to simplify, shorten, or even wholly dismiss some story elements that would only stretch the runtime to an unfathomable length. Some of the adaptations work brilliantly, but some fail to give a character its importance or offer no interest to a subplot. However, it's still easy to understand everything, and how the ending is going to unravel, which leads me to my second issue with the movie: its final act's heavy exposition.\r\n\r\nLike I wrote above, there is a lot of information to deliver. What Snyder did very well was to tell most of it through flashbacks or captivating conversations, but in the final act, where everything was self-explanatory and in no need of more exposition, there is an excess of redundant dialogue that doesn't really add anything relevant. What the characters are saying is significant, yes, but we, as the audience, already know all of that way before the film's climax. It's ironic how they make a joke about villains telling their masterplan to the hero and how this villain isn't dumb enough to do it, but then proceed to carefully explain everything (that we know already) through exposition.\r\n\r\nSincerely, these are the major problems that I have with the movie. However, I love so much about everything else. From the appropriated and fun soundtracks to the beautiful production design, Zack Snyder and his crew really do a fantastic work technically. Snyder's style captures Watchmen's world perfectly. It's one of those films that carry a \"feel\" due to its stylish cinematography. I love how little CGI is actually applied (I'm obviously ignoring the big blue guy), and the abundance of practical effects and real sets that are used. The action sequences look spectacular, way better than a lot of blockbusters nowadays (10 years later!).\r\n\r\nDespite the terrific technical achievements, my main compliment is actually connected to my number one problem. Even though the storylines are incredibly hard to balance, characters like Rorschach, Nite Owl, Silk Spectre, and The Comedian (Jeffrey Dean Morgan) have extraordinarily captivating and entertaining stories. There might be a few missteps here and there, but Snyder made ONE movie from a material that's worth a whole TV show or at least two films. And he delivered a GOOD one! Probably a better job than 80% of the directors working today could ever achieve. Finally, the social commentary is still quite relevant for this new generation, and if the so-called \"source-material-purists\" didn't exist, this movie would be a lot more appreciated.\r\n\r\nAll in all, Watchmen is as good as it could be, having in mind it's just one film with already a long runtime. Its narrative was always going to be extremely difficult to tell in a solid yet compelling manner, and Zack Snyder does struggle with balancing all of the storylines and its characters. However, he and his phenomenal team still delivered a good flick. Technically sublime, with a distinct style, brilliant production design, and gorgeous cinematography. Characters like Rorschach and Nite Owl have amazing moments, filled with excellent action sequences, but also with emotionally powerful scenes. If it could be better? Maybe. If it could be split into two or three movies. As it stands, as one and only film, it's really impressive even with its flaws.\r\n\r\nRating: B", "created_at": "2019-10-28T17:05:59.705Z"}, {"movie_id": 13183, "review_id": "5e3fd66c9603310017ed0b20", "author_rating": 10.0, "review_text": "As humans, we are drawn to what inspires us, interests us, and tickles our fancy. Human opinion can be a fickle thing, especially when it comes to film, books, and music, due to this the message that is interwoven through these mediums are missed by all of us simply because we won't take the time to watch, read or listen to what is being said to us.\r\n\r\nThe message throughout Watchman and Tales of The Black Freighter in film and more importantly in graphic novel form is that we as humans try so hard to make the world a better place, but being pushed so far while trying to rid the world of evil we become the very thing we're fighting against, sometimes this a fact we do not see, or we do when it's too late. When Alan Moore wrote the story for the graphic novel, he did so at the height of this planet's greatest threat of nuclear annihilation; The Cold War, The U.S. and Russia at a stalemate over nuclear arms, and Russia's invasion of Afghanistan, had meant that at any moment millions of people on this planet could have met a brutal end.\r\n\r\nAs far as the story goes, this is a concept that has been warped, and manipulated into a alternate universe where in 1985 Richard Nixon has changed the constitution of the USA and made it allowable for him to serve more than 2 terms of Presidency, it's also a universe where in the times after WWII ordinary citizens decided that crime and corruption throughout America, and especially New York had gotten to levels beyond the control of authorities that they would suit up as masked vigilantes, and fight crime head on. By 1985 masked heroes are outlawed, and former \"heroes\" were forced to reveal themselves, or stay hidden, but give up their lifestyle.\r\n\r\nThe story of the most part is told through the eyes of one character Rorschach (Haley) as he investigates the murder of a fellow vigilante, The Comedian (Morgan). Rorschach is the only vigilante who has not given up the lifestyle, and is wanted by the F.B.I. Rorschach tries to re-engage the remaining \"heroes\" to help him find the murderer, and get to the heart of why he was murdered. The other \"heroes\" are Night Owl II (Wilson); an aging recluse who inherited a fortune from his father and used it to engage in vigilante activities, Silk Spectre II (Ackerman); daughter of an original Minutewoman (Cugino), Ozymandias (Goode), a self made millionaire who has modeled himself and his life on Alexander the Great, and Dr. Manhattan (Crudup), the only real superhero due an accident in a atomic chamber in a lab when he was a physicist.\r\n\r\nThe film follows pretty closely the themes and tone of the book, much more than any comic related movie before it, thanks mostly to the dedication of director Zack Snyder. The look and feel of the film to date it in 1985 was very well handled, and can certainly be called a period piece due to the level of exact detail through-out. Performances are in general pretty well done, and reflect the emotions of the characters in the book, as this is the Ultimate Cut, the extended scenes, plus the interwoven story of the comic book within a comic book; \"Tales of The Black Freighter\" make for a film that is worthy of its 215 minute length. Having said that they leave well and truly enough of the story in the theatrical cut where the message still shines through.\r\n\r\nThe credits for this film are the best I have ever seen, using the Bob Dylan song \"The Times They Are A-Changing\", and features snapshots of the highs and lows of the Minutemen and Watchmen from the 1940's through to the 1980's against the backdrop of important cultural and political icons and events.\r\n\r\nThis movie is easily one of my favourites of the modern age of film, because of the well delivered message, and the uncompromised approach to bring the graphic novel to life.", "created_at": "2020-02-09T09:52:44.329Z"}, {"movie_id": 13183, "review_id": "5ec47bcf28723c0021489870", "author_rating": 8.0, "review_text": "Click here for a video version of this review: youtu.be/2tkzmGjXfdE\r\n\r\n_Watchmen_ polarised audiences when it arrived in theatres in 2009. Coming not long after Marvel's _Iron Man_ many were expecting a fun action oriented super hero movie. _Watchmen_ however, is not that kind of movie. Just like the source material it comes from, this is a dark and brooding film that deals with some complicated questions.\r\n\r\nHere is the official description:\r\n\r\n_In a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so uncover a sinister plot that puts all of humanity in grave danger._\r\n\r\nStarting off with a fantastic montage that, with barely a word, fills you in on the alternate history of the movie, and the timeline of things leading up to the start of the main story, Watchmen does a great job of building this world you are about to inhabit for two hours and 45 minutes. The characters are strong, and develop logically over the course of the film, and you can really feel their sense of despair or feeling of not belonging. I think of all the comic book movies I've seen, this one captures best those feelings the characters have of being lonely outsiders. Rorschach's commitment to the truth in the movie leads to a brilliant defining moment was where it all just bursts out from him. It was very well done. He, as a character, is so good that I think he deserves his own movie in the same noir-ish style.\r\n\r\nThe length and style of this will turn a lot of people off, it is much more of a character piece than a big explosive action extravaganza. In my opinion, it's one of the better comic book movies out there.\r\n\r\nTop all that off with a fantastic sound track of 1980s music and this is a pretty good package. If you like bright lights and shiny tights, this is not the comic book movie for you. If however you like a super hero movie with some depth and that deals with some philosophical questions this will give you a lot more to chew over than some other DC adaptations.", "created_at": "2020-05-20T00:37:35.411Z"}, {"movie_id": 13183, "review_id": "60f322f1635e78007cbfbf1d", "author_rating": 9.0, "review_text": "_**The \"Apocalypse Now\" of superhero films**_\r\n\r\nBased on Alan Moore's graphic novel, 2009's \"Watchmen\" takes place in an alternative 1985 where Nixon is serving his fifth term and costumed vigilantism is illegal. A former masked crimefighter named The Comedian is murdered, prompting his previous teammates to investigate the crime. Things get complicated as the backstories of most of the Watchmen are revealed and worldwide nuclear war looms.\r\n\r\nFor some reason I was never interested in the Watchmen and therefore never read the graphic novel, even though I had the opportunity. Why? The fact that it took place in an alternative reality turned me off, as did the peculiarities of the team members which, I later discovered, Moore intended as satire. That said, this is mind-blowing. \"Watchmen\" is an adult-oriented superhero flick with a convoluted plot, strong characters and total originality. The latter two score high marks with me any day.\r\n\r\nRorschach (Jackie Earle Haley) stands out with his gravelly voice and right-wing ideology, although he's not very likable. He's impressive yet, at the same time, kind of pathetic. The character was based on Steve Ditko's The Question.\r\n\r\nThe Comedian (Jeffrey Dean Morgan) exudes great charisma and is reminiscent of The Punisher, if he were a jokester. Unfortunately, The Comedian's arrogant & hotheaded and has a weakness towards the ladies, not to mention cold-blooded murder.\r\n\r\nNight Owl (Patrick Wilson) is another strong character, obviously based on Batman or Blue Beetle. Unlike the previous two he's very likable. I always thought his costume looked really lame in the graphic novel but, as depicted in the film, it kicks axx.\r\n\r\nDr. Manhattan (Greg Plitt), named for the Manhattan Project and based on Captain Atom with a dash of Mr. Fantastic, is an almost God-like being who can do pretty much anything. He's so detached from the human experience that he walks around totally nude and has no time for his woman, Silk Spectre II. He'd rather hang out on Mars -- literally!\r\n\r\nSilk Spectre II (Malin Akerman) stands out due to her sexy costume more than anything else, not to mention Akerman's drop-dead-gorgeous looks. The character was based on Phantom Lady and Black Canary. Silk can't handle Dr. Manhattan's increasing aloofness and consequently diverts to Night Owl for human warmth.\r\n\r\nSilk Spectre (Carla Gugino) is Silk Spectre II's mother and has a pretty significant part. Like her daughter, she's hot, albeit in a whole different way.\r\n\r\nOzzyosbourne, whoops, I mean Ozymandias (Matthew Goode) is the least developed character and loosely based on Charlton Comic's Thunderbolt. He's ultra-smart, ultra-quick and kinda foppish.\r\n\r\nAnother highlight is the hypnotic score by Tyler Bates mixed with a quality soundtrack (e.g. \"The Sound of Silence,\" \"All Along the Watchtower,\" etc.)\r\n\r\nBOTTOM LINE: The film is long, dark, mature, dialogue-driven and convoluted, but the strong characters and originality win the day. No moronic \"blockbuster\" trash here. Not to mention Silk Spectre II and her mother are extremely easy on the eyes. As far as superhero flicks go, there's really nothing else like \"Watchmen.\" It's even more atypical than the X-Men and easily one of my favorite superhero flicks, maybe even THE favorite. \"Watchmen\" is like the \"Apocalypse Now\" of superhero films!\r\n\r\nRUNTIME: Theatrical Cut: 162 minutes; Director's Cut: 186 minutes; The Ultimate Cut: 215 minutes\r\n\r\nCOMPARING CUTS: I own both the theatrical cut and Director's Cut. Although the theatrical version is just fine, the DC is worthwhile for extended dialogue to existing scenes in the theatrical cut; the biggest addition is an attack on Night Owl's Mentor, Hollis Mason, at the hands of a thug gang and Night Owl's subsequent brutal revenge at a bar. Despite the convoluted plot, I had no problem following the story in the theatrical cut, even though I've never read the graphic novel. The filmmakers did an excellent job cutting out the fat in the theatrical version. So don't think you'll need to purchase the DC to understand the story; it's not necessary. My recommendation is to check out the theatrical version first and only purchase the DC if the theatrical cut left you wanting even more, which is what it did for me. Even so, I PREFER the theatrical cut; it's leaner and just all-around better.\r\n\r\nGRADE: A", "created_at": "2021-07-17T18:35:29.493Z"}, {"movie_id": 13183, "review_id": "5d0f39529251413945be3d4a", "author_rating": 8.0, "review_text": "The comic book geek blockbuster for adults only.\r\n\r\nWatchmen is directed by Zack Snyder and adapted to screenplay by David Hayter and Alex Tse from the Alan Moore/David Gibbons graphic novel. It stars Patrick Wilson, Malin Ackerman, Billy Crudup, Jackie Earle Haley, Jeffrey Dean Morgan, Carla Gugino and Matt Frewer. Music is by Tyler Bates and cinematography by Larry Fong.\r\n\r\n1985 and someone is killing all our superheroes. Time for the remaining super heroes to band together - but what they find as they fight the good fight is potential annihilation for everyone.\r\n\r\nIt was quite a battle getting Watchmen onto the screen, over twenty years of legal wrangling and controversies, it got to the point where fans of the source material doubted it would ever happen - and even if it did it was sure to be a monstrous failure. How pleasing to find that not only did it make it to the screen, but it is also a genre bending winner - well to some of us of course...\r\n\r\nOne has to take into context just how potent and original the graphic novel was back in 1986/7, we are dealing with very mature themes, superheroes with serious psychological baggage. Alan Moore lit the touch paper in the comic book kingdom that the rest have since followed to keep the torch burning well into the new millennium. Snyder has achieved top line results in getting both the feel and look of the source, even if some of Moore's cunning cynicism has been lost in translation.\r\n\r\nStory is set right in the middle of nuclear paranoia and the fear of the Soviets in 85, the America we view is dank and depressing, noirish in vibe (aided by Rorschach's clobber and detective inclinations), it's a world on the road to nowhere. We are also at a time in the alternate world where superheroes are banned from operating, forcing The Watchmen to become vigilantes - that is if they can get along and shunt their psycho discord to one side. The back stories of the main protagonists are fully formed, and these are not jolly characters, so much so you worry the fate of mankind is doomed if these are who we rely on to save us.\r\n\r\nThere was in no way that Snyder would be able to produce a comic book filmic adaptation that would be as worshipped in that sphere, to rival that of the worship the novel has in its own. However, coming at it as someone who only sought out the source material after seeing the film, it shines bright for newcomers who are ironically seeking darker tints in superhero tales. Oh it has the requisite nifty twists (a clinical mystery to be unearthed), booming visuals, excellent effects work and smartly constructed action set-pieces, but narratively it's moody and calls for the utmost attention on dialogue passages (I have found it gets better on repeat viewings).\r\n\r\nSnyder clearly cared about the project and that love is evident in the movie. It was never going to appease all and sundry, but at worst to hardcore Moore fans it's at least an honourable failure, to many others it's a smart and stylishly refreshing genre booster. 8/10", "created_at": "2019-06-23T08:33:22.671Z"}, {"movie_id": 13183, "review_id": "5db71ff70792e1001343a0a9", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this review is based on the theatrical version of Watchmen. Usually, Director's Cuts or Ultimate Editions are not preferred over the original release. Few films benefit from them, and most are simply an extended cut with a bunch of deleted scenes. It's only fair and rational that a reviewer watches the version which the whole world saw at the theaters at the respective time. With that said, despite knowing the story of the source material, I never indeed read it. Having in mind that most of the \"hate\" that this Zack Snyder's movie received is from comic-book purists (basically, every book/comic/game/whatever-lover who defends that any cinematic adaptations of any of these sources MUST be 100% the same, with no modifications whatsoever), I'm certain an unbiased perspective is the way to go.\r\n\r\nAnd overall, this is a good feature. Watchmen isn't just another CBM (comic-book movie). It doesn't just follow one hero vs. one villain. It's a whole world (in today's standards, it's really a cinematic universe) of \"superheroes\" meant to be explored in fine detail (hence the release of a TV show today... reviewing that later). It's an extremely complex world that needs to be thoroughly explained in order to deeply understand how it works, and what's everyone's role in it. This is the film's main problem: it struggles to juggle all of its different storylines and distinct characters. Even with 163min of runtime, it's impossible to squeeze in all of the necessary information.\r\n\r\nSo, as expected, Snyder and his team of screenwriters had to simplify, shorten, or even wholly dismiss some story elements that would only stretch the runtime to an unfathomable length. Some of the adaptations work brilliantly, but some fail to give a character its importance or offer no interest to a subplot. However, it's still easy to understand everything, and how the ending is going to unravel, which leads me to my second issue with the movie: its final act's heavy exposition.\r\n\r\nLike I wrote above, there is a lot of information to deliver. What Snyder did very well was to tell most of it through flashbacks or captivating conversations, but in the final act, where everything was self-explanatory and in no need of more exposition, there is an excess of redundant dialogue that doesn't really add anything relevant. What the characters are saying is significant, yes, but we, as the audience, already know all of that way before the film's climax. It's ironic how they make a joke about villains telling their masterplan to the hero and how this villain isn't dumb enough to do it, but then proceed to carefully explain everything (that we know already) through exposition.\r\n\r\nSincerely, these are the major problems that I have with the movie. However, I love so much about everything else. From the appropriated and fun soundtracks to the beautiful production design, Zack Snyder and his crew really do a fantastic work technically. Snyder's style captures Watchmen's world perfectly. It's one of those films that carry a \"feel\" due to its stylish cinematography. I love how little CGI is actually applied (I'm obviously ignoring the big blue guy), and the abundance of practical effects and real sets that are used. The action sequences look spectacular, way better than a lot of blockbusters nowadays (10 years later!).\r\n\r\nDespite the terrific technical achievements, my main compliment is actually connected to my number one problem. Even though the storylines are incredibly hard to balance, characters like Rorschach, Nite Owl, Silk Spectre, and The Comedian (Jeffrey Dean Morgan) have extraordinarily captivating and entertaining stories. There might be a few missteps here and there, but Snyder made ONE movie from a material that's worth a whole TV show or at least two films. And he delivered a GOOD one! Probably a better job than 80% of the directors working today could ever achieve. Finally, the social commentary is still quite relevant for this new generation, and if the so-called \"source-material-purists\" didn't exist, this movie would be a lot more appreciated.\r\n\r\nAll in all, Watchmen is as good as it could be, having in mind it's just one film with already a long runtime. Its narrative was always going to be extremely difficult to tell in a solid yet compelling manner, and Zack Snyder does struggle with balancing all of the storylines and its characters. However, he and his phenomenal team still delivered a good flick. Technically sublime, with a distinct style, brilliant production design, and gorgeous cinematography. Characters like Rorschach and Nite Owl have amazing moments, filled with excellent action sequences, but also with emotionally powerful scenes. If it could be better? Maybe. If it could be split into two or three movies. As it stands, as one and only film, it's really impressive even with its flaws.\r\n\r\nRating: B", "created_at": "2019-10-28T17:05:59.705Z"}, {"movie_id": 13183, "review_id": "5e3fd66c9603310017ed0b20", "author_rating": 10.0, "review_text": "As humans, we are drawn to what inspires us, interests us, and tickles our fancy. Human opinion can be a fickle thing, especially when it comes to film, books, and music, due to this the message that is interwoven through these mediums are missed by all of us simply because we won't take the time to watch, read or listen to what is being said to us.\r\n\r\nThe message throughout Watchman and Tales of The Black Freighter in film and more importantly in graphic novel form is that we as humans try so hard to make the world a better place, but being pushed so far while trying to rid the world of evil we become the very thing we're fighting against, sometimes this a fact we do not see, or we do when it's too late. When Alan Moore wrote the story for the graphic novel, he did so at the height of this planet's greatest threat of nuclear annihilation; The Cold War, The U.S. and Russia at a stalemate over nuclear arms, and Russia's invasion of Afghanistan, had meant that at any moment millions of people on this planet could have met a brutal end.\r\n\r\nAs far as the story goes, this is a concept that has been warped, and manipulated into a alternate universe where in 1985 Richard Nixon has changed the constitution of the USA and made it allowable for him to serve more than 2 terms of Presidency, it's also a universe where in the times after WWII ordinary citizens decided that crime and corruption throughout America, and especially New York had gotten to levels beyond the control of authorities that they would suit up as masked vigilantes, and fight crime head on. By 1985 masked heroes are outlawed, and former \"heroes\" were forced to reveal themselves, or stay hidden, but give up their lifestyle.\r\n\r\nThe story of the most part is told through the eyes of one character Rorschach (Haley) as he investigates the murder of a fellow vigilante, The Comedian (Morgan). Rorschach is the only vigilante who has not given up the lifestyle, and is wanted by the F.B.I. Rorschach tries to re-engage the remaining \"heroes\" to help him find the murderer, and get to the heart of why he was murdered. The other \"heroes\" are Night Owl II (Wilson); an aging recluse who inherited a fortune from his father and used it to engage in vigilante activities, Silk Spectre II (Ackerman); daughter of an original Minutewoman (Cugino), Ozymandias (Goode), a self made millionaire who has modeled himself and his life on Alexander the Great, and Dr. Manhattan (Crudup), the only real superhero due an accident in a atomic chamber in a lab when he was a physicist.\r\n\r\nThe film follows pretty closely the themes and tone of the book, much more than any comic related movie before it, thanks mostly to the dedication of director Zack Snyder. The look and feel of the film to date it in 1985 was very well handled, and can certainly be called a period piece due to the level of exact detail through-out. Performances are in general pretty well done, and reflect the emotions of the characters in the book, as this is the Ultimate Cut, the extended scenes, plus the interwoven story of the comic book within a comic book; \"Tales of The Black Freighter\" make for a film that is worthy of its 215 minute length. Having said that they leave well and truly enough of the story in the theatrical cut where the message still shines through.\r\n\r\nThe credits for this film are the best I have ever seen, using the Bob Dylan song \"The Times They Are A-Changing\", and features snapshots of the highs and lows of the Minutemen and Watchmen from the 1940's through to the 1980's against the backdrop of important cultural and political icons and events.\r\n\r\nThis movie is easily one of my favourites of the modern age of film, because of the well delivered message, and the uncompromised approach to bring the graphic novel to life.", "created_at": "2020-02-09T09:52:44.329Z"}, {"movie_id": 13183, "review_id": "5ec47bcf28723c0021489870", "author_rating": 8.0, "review_text": "Click here for a video version of this review: youtu.be/2tkzmGjXfdE\r\n\r\n_Watchmen_ polarised audiences when it arrived in theatres in 2009. Coming not long after Marvel's _Iron Man_ many were expecting a fun action oriented super hero movie. _Watchmen_ however, is not that kind of movie. Just like the source material it comes from, this is a dark and brooding film that deals with some complicated questions.\r\n\r\nHere is the official description:\r\n\r\n_In a gritty and alternate 1985 the glory days of costumed vigilantes have been brought to a close by a government crackdown, but after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so uncover a sinister plot that puts all of humanity in grave danger._\r\n\r\nStarting off with a fantastic montage that, with barely a word, fills you in on the alternate history of the movie, and the timeline of things leading up to the start of the main story, Watchmen does a great job of building this world you are about to inhabit for two hours and 45 minutes. The characters are strong, and develop logically over the course of the film, and you can really feel their sense of despair or feeling of not belonging. I think of all the comic book movies I've seen, this one captures best those feelings the characters have of being lonely outsiders. Rorschach's commitment to the truth in the movie leads to a brilliant defining moment was where it all just bursts out from him. It was very well done. He, as a character, is so good that I think he deserves his own movie in the same noir-ish style.\r\n\r\nThe length and style of this will turn a lot of people off, it is much more of a character piece than a big explosive action extravaganza. In my opinion, it's one of the better comic book movies out there.\r\n\r\nTop all that off with a fantastic sound track of 1980s music and this is a pretty good package. If you like bright lights and shiny tights, this is not the comic book movie for you. If however you like a super hero movie with some depth and that deals with some philosophical questions this will give you a lot more to chew over than some other DC adaptations.", "created_at": "2020-05-20T00:37:35.411Z"}, {"movie_id": 13183, "review_id": "60f322f1635e78007cbfbf1d", "author_rating": 9.0, "review_text": "_**The \"Apocalypse Now\" of superhero films**_\r\n\r\nBased on Alan Moore's graphic novel, 2009's \"Watchmen\" takes place in an alternative 1985 where Nixon is serving his fifth term and costumed vigilantism is illegal. A former masked crimefighter named The Comedian is murdered, prompting his previous teammates to investigate the crime. Things get complicated as the backstories of most of the Watchmen are revealed and worldwide nuclear war looms.\r\n\r\nFor some reason I was never interested in the Watchmen and therefore never read the graphic novel, even though I had the opportunity. Why? The fact that it took place in an alternative reality turned me off, as did the peculiarities of the team members which, I later discovered, Moore intended as satire. That said, this is mind-blowing. \"Watchmen\" is an adult-oriented superhero flick with a convoluted plot, strong characters and total originality. The latter two score high marks with me any day.\r\n\r\nRorschach (Jackie Earle Haley) stands out with his gravelly voice and right-wing ideology, although he's not very likable. He's impressive yet, at the same time, kind of pathetic. The character was based on Steve Ditko's The Question.\r\n\r\nThe Comedian (Jeffrey Dean Morgan) exudes great charisma and is reminiscent of The Punisher, if he were a jokester. Unfortunately, The Comedian's arrogant & hotheaded and has a weakness towards the ladies, not to mention cold-blooded murder.\r\n\r\nNight Owl (Patrick Wilson) is another strong character, obviously based on Batman or Blue Beetle. Unlike the previous two he's very likable. I always thought his costume looked really lame in the graphic novel but, as depicted in the film, it kicks axx.\r\n\r\nDr. Manhattan (Greg Plitt), named for the Manhattan Project and based on Captain Atom with a dash of Mr. Fantastic, is an almost God-like being who can do pretty much anything. He's so detached from the human experience that he walks around totally nude and has no time for his woman, Silk Spectre II. He'd rather hang out on Mars -- literally!\r\n\r\nSilk Spectre II (Malin Akerman) stands out due to her sexy costume more than anything else, not to mention Akerman's drop-dead-gorgeous looks. The character was based on Phantom Lady and Black Canary. Silk can't handle Dr. Manhattan's increasing aloofness and consequently diverts to Night Owl for human warmth.\r\n\r\nSilk Spectre (Carla Gugino) is Silk Spectre II's mother and has a pretty significant part. Like her daughter, she's hot, albeit in a whole different way.\r\n\r\nOzzyosbourne, whoops, I mean Ozymandias (Matthew Goode) is the least developed character and loosely based on Charlton Comic's Thunderbolt. He's ultra-smart, ultra-quick and kinda foppish.\r\n\r\nAnother highlight is the hypnotic score by Tyler Bates mixed with a quality soundtrack (e.g. \"The Sound of Silence,\" \"All Along the Watchtower,\" etc.)\r\n\r\nBOTTOM LINE: The film is long, dark, mature, dialogue-driven and convoluted, but the strong characters and originality win the day. No moronic \"blockbuster\" trash here. Not to mention Silk Spectre II and her mother are extremely easy on the eyes. As far as superhero flicks go, there's really nothing else like \"Watchmen.\" It's even more atypical than the X-Men and easily one of my favorite superhero flicks, maybe even THE favorite. \"Watchmen\" is like the \"Apocalypse Now\" of superhero films!\r\n\r\nRUNTIME: Theatrical Cut: 162 minutes; Director's Cut: 186 minutes; The Ultimate Cut: 215 minutes\r\n\r\nCOMPARING CUTS: I own both the theatrical cut and Director's Cut. Although the theatrical version is just fine, the DC is worthwhile for extended dialogue to existing scenes in the theatrical cut; the biggest addition is an attack on Night Owl's Mentor, Hollis Mason, at the hands of a thug gang and Night Owl's subsequent brutal revenge at a bar. Despite the convoluted plot, I had no problem following the story in the theatrical cut, even though I've never read the graphic novel. The filmmakers did an excellent job cutting out the fat in the theatrical version. So don't think you'll need to purchase the DC to understand the story; it's not necessary. My recommendation is to check out the theatrical version first and only purchase the DC if the theatrical cut left you wanting even more, which is what it did for me. Even so, I PREFER the theatrical cut; it's leaner and just all-around better.\r\n\r\nGRADE: A", "created_at": "2021-07-17T18:35:29.493Z"}]