[{"movie_id": 507089, "review_id": "653a4ad08a0e9b010b29016c", "author_rating": 9.0, "review_text": "FNAF was great, Kinda wish it had blood, Every kill was offscreen or really dark and you cant really see the kill.", "created_at": "2023-10-26T11:17:37.038Z"}, {"movie_id": 507089, "review_id": "653c0b22564ec700e5fa4168", "author_rating": 7.0, "review_text": "I don't really get what all the negative reviews are about.\r\nIt's not the best movie ever or that I've seen this year, but I still had a good time watching it. The story was interesting, it had some scary parts, some humorous parts, lots of tension, was well-acted, well-shot, and the effects (both practical and CGI) were well-done. Also, the production design and creature design was great.\r\n\r\nA movie doesn't have to be restricted to either being \"the best\" or \"horrible.\" The theater I saw it in was packed, the audience was responsive and seemed to be loving it, and I myself enjoyed it.\r\n\r\nI didn't really play the games, but I was definitely engaged in the lore of some of the MatPat Game Theory videos I saw. And I could tell from audience reactions that there were some cool things in the movie if you knew the games. That's not a negative, to be clear. It's always really cool when filmmakers put things in movies that true fans would catch and geek-out about.\r\n\r\nAs far as being a viewer who didn't really play the games, I enjoyed the movie. And while I think knowing the games/lore would have definitely enhanced my enjoyment and enthusiasm, I wouldn't say it lacks as a movie or that the games are \"required viewing\" for those who haven't played them. Everything's explained pretty well.\r\n\r\nAs far as the horror aspect goes, it is PG-13; I saw some reviews complaining about the lack of gore... It's PG-13. C'mon guys.\r\nBut, that being said, I thought they still did a good job with the horror elements that were present.\r\n\r\nI also really liked the trio of main characters. I thought Josh Hutcherson, Piper Rubio, and Elizabeth Lail all did a good job.\r\nAlso, I'm glad Josh Hutcherson is back. I hope he'll continue to be in more movies.", "created_at": "2023-10-27T19:10:26.626Z"}, {"movie_id": 507089, "review_id": "65436d2741a561336b763051", "author_rating": 5.0, "review_text": "Didn't Josh Hutcherson used to be famous? Well here he is reduced to the role of the struggling brother of \"Abby\" (Piper Rubio). Their aunt (Mary Stuart Masterson) is determined that this hapless bag of bones isn't fit to look after the young girl - after he takes out a visiting father in the fountain of a shopping mall and gets fired; so \"Mike\" has to get another job! Opportunities are thin on the ground, but there is a vacancy doing the security night shift and an old, derelict, pizza parlour. How hard can it be? Well a meeting with the enigmatic police officer \"Vanessa\" (Elizabeth Lail) should have rung alarm bells, and when he has to take \"Abby\" there for one overnight shift - well it's soon clear that this place has secrets to keep and that it knows how to manipulate the hopes and fears of \"Mike\" and his sister. Can they stay sane and focussed long enough to survive this maze of malevolent mechanical bunnies? I'm afraid the presence of Matthew Lillard never helps a film, and here is no different - this is just a rather nonsensical attempt at a spooky mystery that certainly has nothing to make you jump. Rubio is actually quite decent, but there's isn't enough else happening to compensate for the very slow build up, surfeit of dialogue and frankly rather silly underlying premiss. I suppose as Halloween gets bigger and bigger, we are going to get more and more of these mediocre offerings - but despite it's more prominent cast, this just belongs on the Horror channel at 2am.", "created_at": "2023-11-02T09:34:31.341Z"}]