[{"movie_id": 659959, "review_id": "6052fb76447f9c0074e23643", "author_rating": 7.0, "review_text": "Francois Ozon's 'Summer of 85' is a bittersweet film, one that ultimately encourages its audience to embrace the joy and the heartache of first love, along with the ephemerality of having a life-changing presence in your life.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-summer-of-85-a-refreshingly-nuanced-coming-of-age-story", "created_at": "2021-03-18T07:04:22.987Z"}, {"movie_id": 659959, "review_id": "62405ded223a8b00941b49ba", "author_rating": 7.0, "review_text": "Félix Lefebvre (who reminded me, here, of a young Charlie Hunnam in \"Queer as Folk\" (1999)) is sixteen year old \"Alex\" who takes his friend's dinghy out for a sail and gets caught in a thunderstorm that capsizes his boat. Luckily for him, Benjamin Voisin (\"David\") is nearby and tows him ashore and into his mother's recuperative bathtub! The next six weeks are now depicted in a cleverly interwoven mix of current and recent storylines as we realise that a tragedy has occurred and that the two young men had something of a relationship during the intervening period. On the face of it - it's just a gay coming of age drama, but Levebvre has an intensity and innocence about him. His performance as the young man who falls so completely and utterly in love is heart-rending, sincere and stylishly captured by the photography - and must remind all of us of that first, inexplicable, \"love\" that we may well still recall to this day. To be fair, it is easy to see why he fell for the charismatic, exciting \"David\" - who offers him profound changes to his life, and to the rather linear options that most of us faced at 16 - job or school - but the story is more nuanced than that and though it is certainly not without some fairly substantial holes and inconsistencies, it sort of works. The Cure's \"In Between Days\" and an oddly effective \"Sailing\" from Rod Stewart provide a remarkably potent soundtrack that resonates not just the moment, but the sentiment too. Not, maybe, Ozon's finest work but I suspect we may see more roles from his young star in the future.", "created_at": "2022-03-27T12:51:57.854Z"}]