[{"movie_id": 7873, "review_id": "5d8406a87aecc6022008d398", "author_rating": 8.0, "review_text": "I'm a soldier of the apocalypse, man! \r\n\r\nHarsh Times is written and directed by David Ayer. It stars Christian Bale, Freddy Rodriguez, Eva Longoria, Chaka Forman, Tammy Trull, J.K. Simmons and Michael Monks. Music is by Graeme Revell and cinematography by Steve Mason. \r\n\r\nSouth Central Los Angeles, and best friends Jim Luther Davis (Bale) and Mike Alonzo (Rodriguez) begin hurtling into violence that threatens to derail their respective future plans.\r\n\r\nThis was to be David Ayer's directorial debut, and with him already boasting the writing credit for Training Day, the comparisons between the two are hard to ignore - but that's ok right?! Bale goes full tilt as the unpredictable and unnerving Jim Davis, a scarred Gulf War Veteran on a road to self destruction. Question is, will he take his best friend with him?\r\n\r\nThis is very much about Bale's barn storming show, which while it  thrills us greatly, it also hinders the Rodriguez characterisation of Lopez, making the pic a bit lop-sided. Narrative threads focus on the scrapes the pair get into, whilst in the background their love partners are waiting for their men to wake up and commit. Another features Davis suffering bad dreams from the war, all while he is head hunted by Homeland Security after he had failed to get into the LAPD. Davis firmly believes he belongs in the protection business, if only his habit for finding trouble wasn't so prevalent...\r\n\r\nThe violent action scenes are brisk and bloody, marking this out as a hard movie for sure, a hard movie with dialogue to match. Yet it's also a pic laced with black comedy, where there's a perverse pleasure in watching Davis and his not very bright cohort being bad boys. Longoria is not done any favours in the writing, but it's kind of ok since this really is about a friendship spiralling towards a day of reckoning that we obviously know is coming. Which when it comes to us, does not disappoint at all and leaves us some reflecting to do as the adrenaline finally slows down. 7.5/10", "created_at": "2019-09-19T22:52:24.394Z"}]