[{"movie_id": 353070, "review_id": "59fe1481c3a36868a701f049", "author_rating": 7.0, "review_text": "**In an alternative way, against all the odds, they fought it!**\r\n\r\nThis was a remake of the 1979 film of the same name. I haven't seen that, but I enjoyed this version. I did not say I liked, but very entertaining. From 'Grandma Gangster' to 'Stand Up Guys', there you could find a few more that all these films have commonalities. The old fellows try to do something out of their age and strength can cope. So, for fun, this film will do just fine.\r\n\r\nThe poster says it all, but the film reveals much detail, like with small twist and turns. Three lifelong friends suddenly feeling the heat after their pensions got messed up. Apart from that, serious health condition and other financial struggle force them to rob a bank. The film is going to tell us their preparations for the action and post heist developments with some close encounters.\r\n\r\nNo one particular, but all the three veteran actors were good. Good to see them in such energetic film, other than supporting roles in other big flicks. Zack Braff too was good at his direction. I did not like that much his previous feature film. This is a commercial film, but well done. He says it is a reboot, not a remake. And seeing decent success, there could be a sequel. Simply watch it and have fun, but don't analyse deeply, which might only disappoint you.\r\n\r\n_6.5/10_", "created_at": "2017-11-04T19:26:57.527Z"}, {"movie_id": 353070, "review_id": "64643c6fd05a030153abc35f", "author_rating": 8.0, "review_text": "<em>'Going in Style'</em> is a fun one!\r\n\r\nI got more entertainment than I was expecting, given I had anticipated a somewhat half-arsed 90 minute comedy with potentially half-arsed showings from stars of yesteryear. Pleasantly, I was wrong. The more it went on, the move I enjoyed it. The one lame scene comes at the supermarket, but even that saves itself really with the addition of Kenan Thompson.\r\n\r\nIt made me laugh at a few moments, namely with the <em>'E.T. the Extra-Terrestrial'</em> 'homage' and when Josh Pais' character does the cat thing the second time (it's barely visible, just about in shot) - both funny! The masks were a nice touch, too. And that last scene with Annabelle Chow & Nancy Sun is so dumb but I'm totally here for it.\r\n\r\nIt's paced well, has a strong second half and, also, features a well done bit with John Ortiz's character in there too. A swell surprise, all in all. I would happily rewatch it. Michael Caine, Morgan Freeman and Alan Arkin make for a great trio!", "created_at": "2023-05-17T02:31:11.214Z"}]