[{"movie_id": 652, "review_id": "5dc6e3177d2bc10011434879", "author_rating": 10.0, "review_text": "***\"Where does it end?\" -- \"It never ends.\"***\r\n\r\nIf Homer's mythical epic \"The Iliad\" is based on a factual story, that story is magnificently depicted in Wolfgang Petersen's 2004 epic \"Troy.\" In other words, don't expect any goofy 'gods' or 'goddesses' like Athena popping out of thin air because \"Troy\" is a realistic portrayal of the Trojan war.\r\n\r\nMore than that, \"Troy\" is arguably the best sword & sandal epic ever put to film. You name the picture -- \"Samson and Delilah,\" \"Spartacus,\" \"Ben-Hur,\" \"Ulysses,\" \"The Viking Queen,\" “Conan the Barbarian,” \"Braveheart,\" \"Attila,\" \"The Odyssey,\" \"Gladiator,\" etc. -- \"Troy\" is superior. At the very least it’s as good as some of the better flicks just noted, like \"Ben-Hur,\" and far edges out \"Spartacus\" and \"Samson and Delilah.\" As for more recent sword & sandal epics, like the overrated \"Braveheart\" or \"Gladiator,\" \"Troy\" blows 'em out of the water. \r\n\r\nRoger Ebert is a great writer and critic, but his mediocre review of \"Troy\" is all wrong. Ebert's major criticisms, believe it or not, are the main reasons I have such high respect for this film: He complains that Petersen omitted the many Greek 'gods' & 'goddesses' and gripes that the actors perform their roles as believable people and not larger-than-life caricatures. This can, of course, be respectably done, as in the 1955 film \"Ulysses,\" but this is not what Petersen was shooting for in \"Troy.\" His goal, as already noted, was to depict the actual Trojan War on which Homer's myth is based. (Even if it never really took place, wars LIKE IT did).\r\n\r\nRegarding Brad Pitt's heavily criticized performance as Achilles, I couldn’t care less about Pitt until seeing this movie as he does an outstanding job portraying Greece's greatest warrior. No, he's not the bulkiest warrior to ever grace the earth, but he's fast as lightning, confident, expertly skilled and deadly accurate. Even his voice completely fits the role. Eric Bana (from \"Hulk\") is also great as Hector, Achilles' Trojan counterpart, who's sick of war and just wants to live a life of peace with his family. These two have a showdown in the film and it is without a doubt the greatest mano-a-mano sword & sandal duel ever filmed.\r\n\r\nWhat's interesting about the picture is that you never really end up rooting for one side or the other. When Achilles and Hector have their powerful face-off, my wife and I couldn't decide for whom to root. Maybe that's the point. Don't get me wrong, Agamemnon could be viewed as the villain in this picture, and I wasn't rooting for Menelaus when he fights Paris (Orlando Bloom, who seduces Helen, Menelaus' wife), but neither the Greeks nor the Trojans are painted as the 'good guys' or 'bad guys.' They're just people at war, and in war there's no real glory, as Hector points out... and it never ends, as Achilles states. An additional point is that living in a state of war is a JOYLESS existence. And both Bana and Pitt get this across well.\r\n\r\nAs for beautiful women, there are only a couple mentionable: Diane Kruger plays Helen, \"the face that launched a thousand ships.\" Some have complained that she's too plain for the role, but I disagree. I’m not a fan of hers or anything, but she looks pretty dang sharp to me (not to mention has an impressive behind shot). Besides, beauty is in the eyes of the beholder. If Paris deems her worthy of starting a war, who are we to disagree? Also on hand is cutie Rose Byrne who plays Briseis, the virgin priestess whom Achilles converts to the pleasures of the flesh.\r\n\r\nI should point out that \"Troy\" was one of the most expensive pictures ever made at the time and it definitely SHOWS on the screen. Make no mistake, \"Troy\" is breath-taking just to WATCH -- the colossal armies, ships and battles are awe-inspiring to behold, not to mention the Maltan and Mexican locations. And the CGI effects are outstanding for the time, not fake-looking like the Rome & Coliseum scenes in \"Gladiator.\" \r\n\r\nAnother complaint by Ebert is that the dialogue is lousy; nothing could be further from the truth. There are great pieces of dialogue interspersed throughout, including Achilles' comment that the 'gods' envy people because we're mortal and \"Everything's beautiful because we're doomed.\" Thankfully, there's not one goofy one-liner anywhere to be found.\r\n\r\nJames Horner's score should also be mentioned. If you enjoyed the soundtrack of \"The Passion of the Christ\" you'll love this one because it's just as good/serious/reverent/powerful. For instance, the intense percussion during Achilles and Hector's showdown is magnificent.\r\n\r\nInterestingly, Brad Pitt, who plays Achilles, injured his Achilles tendon during shooting. Fitting, no? \r\n\r\nFINAL WORD: If you're in the mood for a sword & sandal epic, \"Troy\" more than fills the bill. The story captivates from the get-to and never lets up the entire 2.5 hour runtime (technically 2 hours, 42 minutes, with credits). It extravagantly visualizes the Trojan War for you, something I never did until seeing this mind-blowing, outstanding piece of cinema.\r\n\r\nGRADE: A+", "created_at": "2019-11-09T16:02:31.734Z"}, {"movie_id": 652, "review_id": "5e80ba0daf85de0019603497", "author_rating": null, "review_text": "It's yours, take it. \r\n\r\nTrojan prince Paris is not only having an affair with Spartan Menelaus' woman, Helen. He also lures her away to live with him in Troy. Thus giving the global domination obsessed King Agamenon the launch pad to war with Troy. Which in turn brings into conflict Spartan hero Achilles and Hector of Troy, two of the greatest warriors that ever lived.\r\n\r\nTroy, budgeted at $175 million, and given to director Wolfgang Petersen with orders to craft a swordplay epic based on Homer's Illiad, is not the truly great picture it really should have been. It is, however, a spectacle of sorts, that by way of the extended directors cut, becomes a fine enough addition to the genre it so clearly wanted to crown.\r\n\r\nThe problems are evident from the off. The casting of Brad Pitt as Achilles always looked to have been based purely on looks. Nicely toned body and brooding close ups do not a warrior make, and thus, as good an actor as Pitt definitely is, this is a role (and genre) too far. Diane Kruger as Helen is under written, which since at the time was a poor actress yet to bloom turns out to be a bonus here, and Orlando Bloom playing the wimp like Lothario Paris the way he should do - still gets out acted and swamped by all around him. The other main problem is how uneven the story telling is. Petersen looks confused as how to condense the Trojan war in the running time, whilst also juggling the emphasis of the two great warriors at its core. That Eric Bana's excellent portrayal of Hector comes through the jumble is a testament to Bana's ability and nothing else.\r\n\r\nThe good is, well, rather good though. Agamemnon, courtesy of a nasty turn from Brian Cox, is well formed. It gives the picture a reason for being outside of it being a war about some bloke stealing a woman from another bloke. Imperial cravings and a genuine thirst for blood helps lift Troy out of the rocky waters it had found itself in. Peter O'Toole, Brendan Gleeson and Sean Bean do fine work with what little they have got, and the production values on offer are hugely impressive. The fight sequences impact and are full of gusto. The fight off between Hector and Achilles is superbly choreographed (fought out to a score that James Horner has lifted from the one Danny Elfman used for Planet Of The Apes three years earlier) and the battle between the armies outside the walls of troy sits with the best in the genre. CGI is often called the bane of cinema, but when used so well as it is here (see the ships approaching Troy for instance) it proves to be an effective and entertaining tool.\r\n\r\nTroy has problems, of that there is no doubt. But come the end one knows that it has been entertained, one knows that this was a time of heroes. So with that, and the knowledge that the film made a profit of just over £320 million worldwide, Petersen can smugly sit in his chair musing it was job done. 7/10", "created_at": "2020-03-29T15:09:01.572Z"}, {"movie_id": 652, "review_id": "5fbef8cb57530e003f3c5b9c", "author_rating": 8.0, "review_text": "A long watch, but just about a worthwhile one.\r\n\r\nI enjoyed <em>'Troy'</em>, in short. A film, interestingly given his recent exploits, written by a certain David Benioff. It definitely has more than a few pacing issues, but they only affect the enjoyment factor minorly - at least to me. The score is a little lacklustre, mind.\r\n\r\nThe casting is outstanding, even if I don't think all the performances are anything to truly shout about. I found Brad Pitt and Eric Bana, although entertaining, a bit wooden in parts.\r\n\r\nElsewhere, Orlando Bloom and Sean Bean are arguably underused from an acting viewpoint - though their characters play huge parts, of course. You also have a load of other familiar faces, from Peter O'Toole to Brendan Gleeson to Rose Byrne to Diane Kruger. The definition of an ensemble.\r\n\r\nThe action helps keep things moving, the battle sequences are very nicely done. The film takes an age to reach the event that everyone knows about, but when it finally does it's excellent.\r\n\r\nThe cast and the action are my big takeaways from this. I couldn't comment on its accuracy on the original work. As a film, for me, it's very good.", "created_at": "2020-11-26T00:37:31.695Z"}, {"movie_id": 652, "review_id": "642b5dfd8de0ae011350b203", "author_rating": 9.0, "review_text": "It took a while, but Brad Pitt finally did some great films.\r\nThis and Fury stick out on Pitt's resume as his masterpieces thus far.\r\nHere, we have the most \"credible\" and \"least Hollywood\" look at the Iliad and the Trojan War. \r\nThe characters are very likely as they were, if they really existed, with motivations explained quite well, save for one motivation.\r\nIt is hard to see Achilles as someone who tells a kid that living dangerously will make you famous a thousand years into the future. Even if Achilles is that introspective, it's hard to see that point of view being something someone would believe in, especially in an ancient world where few names are remembered after death, and certainly not for thousands of years.\r\nAside from that, we get very credible explanations for all the recorded events, without the brown nosing of Homer, although the brown nosing of Odysseus still exists even in this story.\r\nThis is quite easily, and I say undeniably, the most exciting, the most credible, and the best depiction of the Trojan War and the Iliad ever out of a major studio.", "created_at": "2023-04-03T23:15:09.845Z"}, {"movie_id": 652, "review_id": "64f567915f2b8d00e12c7741", "author_rating": 6.0, "review_text": "Now then, where do we start? On the plus side, this is one of the more intelligent applications of CGI in an historical drama setting. The film delivers lots of epic grandeur; the at sea-scenes/battles are classily produced and the attention to detail across the costume and prop departments is outstanding. Sadly, though, the acting isn't at all joined up. At bit like the Dutch football team of the 1980s, we have lots of individual stars but relatively little cohesion between them. Peter O'Toole brings some gravitas as Priam, bit otherwise it's a loose collection of A-lister performances that try their best with a staccato script and some fairly clunky direction. As an end-to-end adventure film, it isn't as bad as it has been accused of being, but it definitely could have done with a deal more emphasis on the characterisation - Brian Cox is dreadful as Agamemnon; Brad Pitt (Achilles), and particularly Eric Bana (Hector) are shockingly wooden; Orlando Bloom (Paris) & Garrett Hedlund (Patroclus) appear there merely as eye-candy and Diane Kruger as the one who launched the thousand ships sounded more like Celine Dion every time she spoke. This is undoubtedly a story that could have made Cecil B De Mille proud, instead I suspect he's have nodded off...", "created_at": "2023-09-04T05:13:53.146Z"}]