[{"movie_id": 505600, "review_id": "5ccaebf6c3a36836abd92f3e", "author_rating": 9.0, "review_text": "Anybody who thinks that this is just a female <i>Superbad</i> would be wrong, because it's so much more than that. This is a film about friendship, and in some respects it feels more of the same compared to other coming-of-age films, but it delivers past that expectation with the help of Olivia Wilde's excellent direction and the strength of Kaitlyn Dever and Beanie Feldstein. This is a film about friendship, but it's also about a celebration of youth and empowerment of one’s own life. Dever and Feldstein are perfection but Billie Lourd is hilarious as well! But seriously, it’s also the hardest i’ve laughed in a long time and it'll sadly probably get snubbed come awards season but this deserves Best Picture and i will love and cherish this movie until I die.", "created_at": "2019-05-02T13:09:10.837Z"}, {"movie_id": 505600, "review_id": "5cf24007c3a368735b225e29", "author_rating": 9.0, "review_text": "‘Booksmart’ is a fun, hilarious, and instantly and infinitely quotable film, making it a must-see for all ages and sexes. But most importantly, it’s exciting. Olivia Wilde has here proven herself to be a fantastic new voice in filmmaking, and she’s brought along screenwriters Susanna Fogel, Emily Halpern, Sarah Haskins and Katie Silberman for the ride. One can only imagine the excellence they’ll produce in the future and if they keep discovering new onscreen talent as well, there’s no stopping them. Girl power!\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-booksmart-say-hello-to-the-next-great-voice-in-female-filmmaking\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-01T09:06:15.931Z"}, {"movie_id": 505600, "review_id": "5d2ea5e76a300b0010a686de", "author_rating": 7.0, "review_text": "I like the leads but I **love** the supporting cast.\r\n\r\n_Booksmart_ had me dubious. In the past couple of years beforehand, I'd heard great (and virtually identical) things about three female-led coming of age films: _Edge of Seventeen, Lady Bird,_ and _Eighth Grade_. In my opinion, one of these movies is great, one of these movies is good, and one of these movies is... not. So when I started hearing the exact same chatter around _Booksmart_, I was not certain what I should expect. Now, having seen it, it might actually be the best of the bunch. Certainly the funniest. Might well end up being my only non-Action movie of the year I go in for a rewatch on.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-07-17T04:36:55.149Z"}, {"movie_id": 505600, "review_id": "5d91e36d66a7c300198cc6c5", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nLast year, I missed A Vigilante from Olivia Wilde, and I still haven’t watched it. Over time, I gradually lost interest, and I might have even forgotten about its existence. However, after watching Booksmart (which arrived late as hell to my country), I’m definitely watching the former soon. I was never that big of a fan of the young-adult, high-school, coming-of-age type of movies, but some of my favorite films of the last few years (Lady Bird, The Edge of Seventeen) actually belong to that genre. Why am I enjoying these low-budget flicks more than others?\r\n\r\nWell, it can’t be a coincidence that every director that tackled these movies is either tremendously talented or shows incredible potential. In addition to this, all of these films (all directed by a woman) address a teenage story starring one or more female main characters. Now, hang on to your horses: no, these movies aren’t good because they’re made by women. No, the story isn’t captivating or entertaining due to the protagonists being women. These films are great simply because they’re made by filmmakers who know what to do with a camera and a story, besides starring brilliant actors… It just happens that all of these persons are women.\r\n\r\nI’m not part of any movement or hate group. I don’t care about politics. I hate people that let their reviews be influenced by external themes, ultimately being unfair to the movie. That said, I have no doubts that these films are better because they have women producing, directing, writing, and starring in it. Booksmart is extremely funny while being as realistic as possible at the same time. Tonally, Wilde seamlessly balances her movie, flowing through each plot point with no major missteps. Although, some occasional detours unnecessarily stretch the runtime, namely a few subplots that didn’t really offer anything worth the time, besides being a bit exaggerated.\r\n\r\nNevertheless, the main storyline never loses its focus. Amy and Molly smoothly drive the screenplay through entertaining moments as well as grounded, pretty dramatic scenes. Beanie Feldstein and Kaitlyn Dever are spectacular! I can’t remember the last time I watched such a phenomenal duo of protagonists, especially when it comes to young actors/actresses. They have impeccable chemistry, and it’s quite noticeable that some sequences are undoubtedly improvised. They also deliver one of the best one-on-one verbal confrontations ever put to screen. Just one long take with both giving their all. Outstanding acting, fantastic filmmaking.\r\n\r\nWith these two actresses carrying the story forward, every single scene is elevated. The comedy bits are amusing, but the romantic drama surrounding them is addressed in such a genuine manner. Kudos to each and every screenwriter that worked on the scripts. To Olivia Wilde, I leave my wish of seeing her in more features. She has her own style, and she definitely has a lot to say, so I can’t wait for her next films. Booksmart carries enough sweet messages that will surely connect with audiences all over the world, whether you’re young, old, men or women. It still carries some cliches from the genre (not trusting your BFF, even though it’s clear you’re wrong), but it’s the play on stereotypes (not everyone seems what they show) that wins at the end.\r\n\r\nAll in all, Olivia Wilde places her name on the list of directors to watch closely for the next few years. Booksmart is a wonderful addition to the coming-of-age genre, one that possesses two astonishing protagonists. Beanie Feldstein and Kaitlyn Dever might become superstars in the future if they continue to display such remarkable performances. With the help of a great supporting cast as well, Wilde shows the exciting and entertaining side of graduating high-school, but also all of the real dramas that teenagers go through, with no restraints. It’s a character-driven story, and Amy and Molly are two persons that we should learn a lot from. It’s one of the best movies of the genre, even though it still contains some of its famous cliches and a few subplots that don’t quite come together. Definitely, give it a watch!\r\n\r\nRating: B+", "created_at": "2019-09-30T11:13:49.009Z"}, {"movie_id": 505600, "review_id": "6078cc07fbe36f00587a5c64", "author_rating": 6.0, "review_text": "I know, I know. I should love this.\r\n\r\nAnd yes, the good parts are really good. But the bad parts are REALLY bad. I guess I'll round up to 3 stars, just to be fair.", "created_at": "2021-04-15T23:28:07.440Z"}, {"movie_id": 505600, "review_id": "6188de3966a7c30092c84917", "author_rating": 8.0, "review_text": "I found this movie to be enjoyable and engaging in most ways. The script is intelligent except for one flaw, the young leads do a great job, and there is a sort of group chemistry amongst the student body. And it is witty and fun.\r\n\r\nNow, as someone who is over 60, I was a little saddened to find that the writers had killed off the world’s older generation and populated the movie with only the young. And I was disappointed that hardly anyone in the movie could make it through a sentence without dropping an f-bomb. Of course I am inured to the use of this catch-all word in film and cable tv, but when everyone, even two intelligent women who gave up fun while they studied their way through high school, can only manage using the f-word as adjectives, adverbs, verbs, etc., it makes you shudder for all the elite universities about to receive this influx of new talent.", "created_at": "2021-11-08T08:22:17.709Z"}, {"movie_id": 505600, "review_id": "62b0bdda5a5ed0005210c95e", "author_rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/one-night-only-booksmart-review<a>\r\n\r\nWhat makes _Booksmart_ so one of a kind is that it finally gives an honest voice to the smart girl. Not a pretentious voice, but a voice that feels genuine and sincere. It is an ode to the magical feeling of being young, of friendship, and of taking steps toward becoming the person you were destined to be. How to grow up and not lose childhood friendships when things don’t turn out the way you expected them to.", "created_at": "2022-06-20T18:35:06.435Z"}, {"movie_id": 505600, "review_id": "62d6aa55e93e95095cbe3288", "author_rating": 9.0, "review_text": "_Booksmart_ is a hilarious coming of age story that has a surprising amount of heart. I loved everything about this film, from the raunchy jokes to the real existential fears of moving on to college. The cast is amazing, both Feldstein and Kaitlyn Dever do an excellent job and the supporting cast is top notch. The comedy in this movie is done so right, the lines are delivered in realistic ways and the jokes hit quite often, my fiancé and I were completely cracking up at certain sections. All in all, I had a incredible time with this film!\r\n\r\n**Score:** _88%_\r\n**Verdict:** _Excellent_", "created_at": "2022-07-19T12:57:57.798Z"}, {"movie_id": 505600, "review_id": "63cabb230398ab00af0667d4", "author_rating": 6.0, "review_text": "Decent repurposing of the _Superbad_ story. Found the main character hard to like.", "created_at": "2023-01-20T16:02:43.805Z"}]