[{"movie_id": 44943, "review_id": "5a4815220e0a26488c00775e", "author_rating": null, "review_text": "When it comes to violent film - I'm divided.  \r\nI don't go out of my way to watch movies about actual, historical battles, because I know that real people died (or were physically or mentally crippled); sons and daughters, sisters and brothers, mothers and fathers . . . even children.  The prospect of of reliving those tragic (even if heroic) deaths is too painful for me.  \r\n\r\nAnd yet, give me an alien invasion and I'm \"all up in that\".  \r\nI find the fantasy of war exciting, and yet I have to be aware of how such films glorify violence; glorify war.  I'm conflicted, enjoying this guilty pleasure.   \r\n\r\nI'm a little surprised by the low rating.  \r\nHave there been too many movies of this sort? a burnout by the viewing public?  A burnout - when it comes to war?  Another sign that we might be a war-weary nation / world?\r\n\r\nAs for me, I don't watch a lot of flicks, so I'm not \"burnt out\" when it comes to military action films.  So, this was not \"same-o, same-o\" for me.  \r\n\r\nI thought the script was impressively tight.  That applies to character development as well; quick snap-shot profiles; a glance, a nod and you had pretty much all you needed to know about this or that character.  \r\n\r\nI'm not a fan of the \"shaky-cam\", but I thought it was well employed in some of the battle scenes.  I've never been in such a situation, but I think the camera gave us that sense of heart-pounding, out of control terror that being shot at and bombed can produce; often no knowing even where the fire is coming from as you hunker down and question your very soul.  \r\n\r\nYes, this is a familiar theme - seasoned tough old lifer in charge of a bunch of kids - typical of many such films (Heartbreak Ridge comes to mind; many more).  \r\n\r\nI wonder, also, if there is more of a connection with military vets; something the civilian population can never really get (no offense; just fact; I served but never got shot at)? \r\nFrom my experience, I thought the military portrayal was pretty spot on (military gear, tactics, fallibility, rank, age differences, rancor, \"I got your 6\", sense of duty and dedication to mission; never give up, never surrender).  \r\n\r\nPredictable formula script?  sure, in some ways, but I found plenty of surprises as well.  \r\nMaybe if I watched this sort of film all the time, I'd be as cynical as many here.\r\n\r\nI really enjoyed this film (gave it 8/10; probably would have given it 7 1/2, but it deserves better than what I see others giving it).  \r\n\r\nRecent revelations from sources such Bigelow and Elizondo, have all but confirmed that we are being visited by aliens.  And, who knows, maybe they will decide to harvest our water before we contaminate it any further, as we creep and crawl closer and closer to our own nuclear annihilation.", "created_at": "2017-12-30T22:37:22.161Z"}, {"movie_id": 44943, "review_id": "5ecb0188e635710022d513a3", "author_rating": 8.0, "review_text": "Click here for a video version of this review: https://youtu.be/kdUtKcM4rJA\r\n\r\n_Battle: Los Angeles_ is a 2011 film that Wikipedia describes as a “military science fiction apocalyptic action film”. That’s a lot of genres mashed into one movie, but boy do they pull it off. So what’s this all about then? Here’s the official description:\r\n\r\n_The Earth is attacked by unknown forces. As people everywhere watch the world's great cities fall, Los Angeles becomes the last stand for mankind in a battle no one expected. It's up to a Marine staff sergeant and his new platoon to draw a line in the sand as they take on an enemy unlike any they've ever encountered before._\r\n\r\nI originally saw this in a theatre when it came out, and just like back then, this second viewing was a real good time. What I think makes this so good is that while this is basically a sci-fi movie about an alien invasion, what makes it stand out from the crowd is that it's put together like a war movie. Much like _Monsters: Dark Continent_ and _Dog Soldiers_ this is a soldier movie with aliens, not an alien movie with soldiers. This is quite a big difference. \r\n\r\nThere are some familiar faces in this, there's Aaron Eckhart, Michelle Rodriguez, Michael Pena, and a very young Joey King. Everyone is in good form, but this isn't a star power movie, its a blow your hair back action film.\r\n\r\nThe story itself is pretty simple. Their first mission is to get to a police station and rescue some civilians. On the way there its full of urban warfare like you’ve seen on many videos from overseas in YouTube videos, but this time it’s in America amongst a very familiar looking urban environment. The focus then shifts to a search and destroy mission and it all winds up to an action packed finale. Adding to the chaos all along the way was the film-makers choice to not give you a super clear look at the enemy. It adds another level of tension to it all.\r\n\r\nThis is a great turn off your brain type movie that cracks along at a good pace and has lots to entertain you all the way through.", "created_at": "2020-05-24T23:21:44.952Z"}, {"movie_id": 44943, "review_id": "63c5d03d255dba00918142d3", "author_rating": 8.0, "review_text": "**Battle: Los Angeles is a grounded and well-done invasion movie that tells its story with a realism unique to the genre.**\r\n\r\nBattle: Los Angeles is excellent! I am baffled by the low Rotten Tomatoes score and bad reviews. Battle: Los Angeles tells a gritty and realistic story of what it might actually look like if otherworldly extraterrestrials invaded. There aren’t any larger-than-life characters like in Independence Day - just courageous soldiers fighting to save the lives of everyone they hold dear. The realism makes this movie feel like Black Hawk Down with aliens. Even with this film being over a decade old, the clever use of CGI doesn’t feel overly dated and looks better than many films today. Aaron Eckhart leads these heroic marines with a strong, authentic, powerful performance anchoring the rest of the cast and the movie. Battle: Los Angeles has its flaws, but this war/sci-fi blend is done in a way, unlike any other invasion film. Don’t get caught up in the reviews. If you enjoy alien movies and invasion films, give this movie a shot.", "created_at": "2023-01-16T22:31:25.602Z"}]