[{"movie_id": 13922, "review_id": "650b3589cadb6b00fe445e74", "author_rating": 7.0, "review_text": "**_The most successful rescue mission in American history_**\r\n\r\nOn January 30, 1945, the United States Army Rangers, Alamo Scouts, and Filipino guerrillas saved more than 500 POWs in the Japanese camp in the Philippines from certain death as the Japanese were ordered to \"liquidate\" all prisoners before evacuating in the face of MacArthur's advance. Benjamin Bratt, James Franco, Max Martini, Joseph Fiennes, Connie Nielsen and Marton Csokas star.\r\n\r\n\"The Great Raid\" was based on the books \"The Great Raid on Cabanatuan\" and \"Ghost Soldiers.\" I've read the latter and it's interesting seeing the film for live-action visuals of what I saw in my head.\r\n\r\nThe rescue, along with the liberation of Camp O'Donnell the same day, allowed the POWs to share the truth about the Bataan and Corregidor atrocities. While the raid had no strategic value, as far as winning the war goes, it sparked a new wave of resolve in the war against Japan. Not to mention, it remains the most successful rescue mission in USA history.\r\n\r\nAlthough the movie was shot in 2002, it was pulled from release schedule on several occasions before finally having a limited released in August, 2005, with little-to-no marketing. Was it any wonder it failed to garner an audience and box office success?\r\n\r\nBe that as it may, this is a solid WW2 flick based on a true story. The prisoners of the camp are the survivors of the infamous 60-mile Bataan Death March of April, 1942. The movie's not politically correct in that it shows the truth of the brutal savagery of the Japanese military. The actual raid doesn't take place until the 95-minute mark, but it's worth the wait; the build-up is informational and keeps your attention.\r\n\r\nWhile I wouldn't call it great, it's a well-done and informative war flick for those interested in the subject. It's even better if you've read either of the books on which it's based.\r\n\r\nThe film runs 2 hours, 12 minutes, and was shot in Bribie Island, Queensland, Australia, with the Manila sequences shot in Shanghai, China.\r\n\r\nGRADE: B", "created_at": "2023-09-20T18:10:17.967Z"}]