[{"movie_id": 44048, "review_id": "5d74d3522ea6b90012bf87cd", "author_rating": 8.0, "review_text": "Tony and Denzel get back on track. \r\n\r\nUnstoppable is directed by Tony Scott and written by Mark Bomback. It stars Denzel Washington, Chris Pine, Rosario Dawson, Ethan Suplee & Kevin Dunn. Cinematographer is Ben Seresin and the music is scored by Harry Gregson-Williams. Plot finds Washington and Pine as Pennsylvania rail yard workers at the opposite ends of their working careers. Whilst working on their first job together, and not exactly hitting it off, the two men are thrust into a frantic pursuit of a runaway train. The runaway (coaster) is pulling tankers containing highly explosive material, and hurtling along at 70mph it has to be stopped before it hits civilisation.\r\n\r\nAlmost as if to atone for the misfire that was The Taking of Pelham 1 2 3, Scott and Washington jump on board another type of train movie and literally let it rip. The film is as simple as its plot synopsis suggests, it's a disaster movie on the railway, but with Scott cranking it up as much as he can, it's as much fun as you can hope to have with a modern day popcorner. Carrying all the trade mark licks of its director; roving camera, scattergun editing and ear splitting sound mix, it's also nice to report that unlike Pelham, the pace never sags. Even as the principal characters hang ups and back stories are unfolded in the narrative, Unstoppable literally doesn't pause for breath. Sure the \"Bromance\" development is signposted at the first stop, and yes, are we ever in doubt about where this will end up? But if you are going into Unstoppable for wry social commentary or an expose on the political shenanigans involved in today's rail yards? Well you deserve all the disappointment you will undoubtedly get.\r\n\r\nA runaway train pursued by Captain Kirk and Malcolm X, directed by the man who brought us Top Gun. Yeah baby, it's a thrill ride for sure. 8/10", "created_at": "2019-09-08T10:09:22.069Z"}]