[{"movie_id": 281957, "review_id": "568bbeaec3a3680e01007bb7", "author_rating": 8.0, "review_text": "The Revenant, a ravishingly violent Western survival yarn from Alejandro González Iñárritu, has a healthy few, scattered like acorns across its two-and-a-half-hour canvas..... no matter how extended, the film’s tense story is under the director’s complete control...DiCaprio’s performance is an astonishing testament to his commitment to a role. cinematographer Emmanuel Lubezki done a great job..as a supporting actor tom hardy is brilliant..must watch...", "created_at": "2016-01-05T13:01:34.290Z"}, {"movie_id": 281957, "review_id": "56c13be79251410d6700071d", "author_rating": null, "review_text": "I thought this was a great movie. Seemed like it was a very physically demanding role for Leo.", "created_at": "2016-02-15T02:45:59.492Z"}, {"movie_id": 281957, "review_id": "56de01df92514134f40003bb", "author_rating": 7.0, "review_text": "Good performances by DiCaprio and, even more, Hardy.\r\n\r\nGood directing, specially the initial attack, photography, landscapes and soundtrack but the story is, at some points, unnecessarily violent and the action scenes are, sometimes, somehow stupid; people letting others to kill them, or ignoring foes close by ...\r\n\r\nA good movie all in all, but not one of the greatests.", "created_at": "2016-03-07T22:34:07.557Z"}, {"movie_id": 281957, "review_id": "5729f349c3a36808f000288a", "author_rating": 7.0, "review_text": "> The one who came back from the dead to avenge.\r\n\r\nThe movie was inspired by the real event that sets in the year 1823, United States. When one of the crew members of the hunters left behind after he was severely hurt from a bear attack, he desperately looks for a way to get back to the camp alive, especially to avenge for the death of his close one. The whole film was about survival in the wilderness and to avoid the native Americans. But the introduction in the opening was very brief and in the final act, it was another brief man hunt. Overall, it was an enjoyable movie for adults with some gruesome scenes.\r\n\r\nThe movie was made on a grand scale. Well written screenplay, good direction, the cast, music and the locations, but it would have been even awesome if it was true to the original occurrence. I felt it was cinematically overdosed, especially for the commercial purpose. The fans of Leonardo Dicaprio's overwhelming celebration created a huge buzz. In fact, it looks like the entire Hollywood is his fan and the Oscars given to him out of sympathy, because I have seen his best performances better than this in the past.\r\n\r\nThe length of the movie was a big concern, should have been at least 15 minutes shorter. But the visuals were fantastic, the CGI bear was almost flawless. There are plenty of reasons why this should not be missed, at a time the narration lacks the realism. Otherwise, it would have made a wonderful semi-documentary film. So don't have high hope on this, especially if you're no ones fans, but just love watching movies like me. A little bit overrated everywhere, but still this movie is good, just good, that's it, not a masterpiece.\r\n\r\n7/10", "created_at": "2016-05-04T13:04:09.887Z"}, {"movie_id": 281957, "review_id": "57acf230925141588c000379", "author_rating": null, "review_text": "There's nothing really to complain about the acting but their praise and this movie is overrated. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews//therevenant", "created_at": "2016-08-11T21:46:24.605Z"}, {"movie_id": 281957, "review_id": "58c172189251411d7b0066e5", "author_rating": 9.0, "review_text": "This is the best film I have seen all year (since 'Birdman', in fact, the previous film by Innaritu). It was expertly directed. The use of natural light really adds to the danger of the environment that surrounds Hugh Glass (Leonardo DiCaprio). Innaritu loves the camera to pan around objects and people to create a sense of awe and spectacle.\r\n\r\nLeonardo DiCaprio really did deserve all the awards that he got for this role. I thought it was his best film by far. The realism and intensity of his performance really comes through.\r\n\r\nThe story was gripping throughout the whole film and I found the twists and turns very interesting.\r\n\r\n★★★★½", "created_at": "2017-03-09T15:17:44.360Z"}, {"movie_id": 281957, "review_id": "5cb08d739251412fb023d90d", "author_rating": 7.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nFrom a technical point of view, _The Revenant_ is one of the most masterful pieces of cinema I've ever seen. This made its one technical failure all the more jarring. The ADR. I don't know how or why this was allowed to happen, but the dubbing of the Native Americans is some 70's style shit, it's awful, and it's awful every single time. In your average film this would be only a minor annoyance, but in _The Revenant_ which A) pretty much nails everything else in the AV department, and B) Takes itself so goddamn seriously, this issue is painfully distracting.\r\n\r\nI also found myself continuously rooting for the antagonists (first the bear, and later Hardy) subconsciously, and scolding myself for it. The good aspect of this is that it was rooted in the fact that all the characters are humanised (even the bear) and fallible, which I like, but the flip-side to that is I was less sympathetic to Leo's character, which takes up the majority of the screen time, and thusly I did not feel fully engaged for a large portion of the movie.\r\n\r\nIn fact the whole second and third acts underwhelmed me in that exact way. That's not to say that they were bad, but they were invariably weaker than the first act. After its end the rest of the film did feel like it was stretched a mite thin.\r\n\r\nThat all said, I knew within about 90 seconds that I was going to give _The Revenant_ a favourable review. Visually, it has this ethereal effect. It feels **too** real. So real that it must be a trick, the world of _The Revenant_ is alien in its realness. A bizarre contradictory nature that struck a chord with me immediately. For the average cinema-goer, I would say _The Revenant_ is worth your time, but for a movie aficionado or film student, I would say _The Revenant_ isn't anything short of a must.\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:06:59.686Z"}, {"movie_id": 281957, "review_id": "5e2f2b0d1685da0011e9cd5e", "author_rating": 10.0, "review_text": "\"My heart bleeds. But revenge is in the creator's hands\".\r\n\r\nThe Revenant is set in the 1820s, in the uncharted wilderness of America, Hugh Glass set out with a hunting party on an expedition. Glass was mauled by a bear and left for dead but through sheer will and to get back to his family, Glass survived - but that wasn't the only thing on his mind as he set out to payback the men who left him behind.\r\n\r\nI remember last year around January time when I saw the two images for The Revenant, with Leo holding a Kentucky Flintlock Rifle looking like he's not playing around. Those two images straight away caught my interest. I then found out it was directed by the magnificent Alejandro González Iñárritu who did the Oscar wining \"Birdman\" (a movie that I personally loved). The Revenant quickly became my most anticipated movie of 2015, as I was looking forward to this movie more than Star Wars, and yes I said it. And after finally seeing the movie myself, I can safely say that I was not disappointed. The Revenant is one of the most stunning, brutal, intense, grizzly movie experience I've ever had. The movie isn't for everyone, but I loved it.\r\n\r\nAlejandro González Iñárritu is starting to become my 3rd favorite director working today, because he's such an old school director when it comes to storytelling by the use of art. There's been a lot of drama happening behind the scenes of this movie, with the weather stopping the production or if someone made a mistake while filming, the crew must stop for the day and wait until tomorrow, because one mistake could lose a lot of day light for a scene (It was shot in natural lighting). One of the studios suggested that the movie should be shot using computer generated to make things much easier, but luckily Iñárritu said no to the idea by stating, \"If we ended up in greenscreen with coffee and everybody having a good time, everybody will be happy, but most likely the film would be a piece of shit.\" And after seeing the movie I gotta say that it was the perfect decision, because it's very rare for a director today to take that risk and avoid what the studio says. Yes there are some CGI scenes, but the way that the animated effect's blended together with the practical effect's is handled incredibly well. This is one of the best directed movies I've seen in 2015 and I know Iñárritu already won an Oscar already, but I hope he wins another one for this, because never before have I seen a revenge tale presented so unique and utterly magnificent.\r\n\r\nI respect Leonardo DiCaprio as an actor, but in this movie, he sleeps inside of a dead horse naked and eats raw food from animals, now if this doesn't get him an Oscar, nothing will. He's performance in this movie is what a call 'a silent performance', because Leo barley has that much lines in the movie and the only time he dose get to talk is in a different language (which Leo has said it was tricky to learn the language). DiCaprio has proven time and time again that he's more than a pretty face, but in this movie I only saw Hugh Glass, not DiCaprio. That's my biggest praise I have to give to Leo, as he had to deliver all the emotions, the pain and the tortured soul that Hugh Glass. All of that was all through his face and eyes and trust me when I say this, but it's not easy as you think. We are so use to seeing Leo as the angry, pretty boy billionaire in every movie he's in, but in this movie I thought he was fantastic. He played the man who lost everything. With very little lines he had, he still manages to make a powerful performance that's so far his best. I really hope Leo gets an Oscar for this.\r\n\r\nTom Hardy also gave an Oscar worthy performance in this movie. I've heard that some people had trouble understanding him in this movie (or just in everything that he's in really). Sometimes I didn't understand what he said but for the most part I did. But all that a side, I still think he was fantastic in the movie. He really added a lot to his character, because sometimes you understand the things that he dose in movie and yes the things he dose in the movie are wrong, but in a rough environment that these people are in, you would likely do the same. I'm not sure if he would get in for best supporting actor, but I hope he dose.\r\n\r\nI'm running out of things to say about Emmanuel Lubezki breathtaking cinematography. The camera work and how he makes the camera feel like a character of it's own is seriously impressive. Lubezki captures nature on film, that shows it's beauty and it's unpredictable surprises. The people running the Oscars should just give Lubezki his third Oscar right now, because he's going to take that third trophy home.\r\n\r\nFor flaws I had with the film it that some of the character logic towards the end of the movie didn't make that much senses to me. And that's it.\r\n\r\nOverall rating: \"The Revenant\" is one of most intense and stunning movies I've seen in 2015. The score is haunting, the editing was top notch and that bear attack scene was just terrifying. I mean how the hell did they do that? I don't know about you, but I honestly can't stop thinking about this movie. It's one of those movies that sticks with you after it's over and it isn't going away anytime soon.", "created_at": "2020-01-27T18:25:17.439Z"}, {"movie_id": 281957, "review_id": "5f306a83cdf2e6003922b65e", "author_rating": 9.0, "review_text": "Utterly riveting.\r\n\r\nIt's no surprise this one got/gets rave reviews - it's outstanding! <em>'The Revenant'</em> isn't necessarily edge-of-your-seat viewing, though it's still a massively impactful watch as you feel every hit of Hugh Glass' journey. It's rather gruesome and bloody, while it also has a few top notch action sequences.\r\n\r\nLeonardo DiCaprio is easily one of my favourite actors of all-time, the man is simply a sensational actor - I'm yet to see an anything less than tremendous film involving him. I wouldn't even say this is his greatest performance, and that's saying something as DiCaprio is absolutely superb here.\r\n\r\nAway from the main man, Tom Hardy is also part of this film. He is great, as I always expect from him. He and DiCaprio are fantastic actors. Hardy portrays John Fitzgerald, brilliantly. However, his character isn't written perfectly - not poorly by any stretch, he's just a bit flip-floppy at the beginning. The way the story creates itself involving Fitzgerald being where he is isn't as amazing as it could've been - very minor criticism, mind.\r\n\r\nAnother small complaint is the ending, there's nothing truly wrong with it at all but I, personally, would've concluded things about 10-15 minutes prior - there's a quality, almost Quentin Tarantino-esque, scene involving horses that would've made for a more thrilling end shot.\r\n\r\nTo finish, everything's beautifully crafted together visually, from a filmmaker's viewpoint, too. A marvellous film no doubt, certainly a must-watch!", "created_at": "2020-08-09T21:28:35.129Z"}, {"movie_id": 281957, "review_id": "568bbeaec3a3680e01007bb7", "author_rating": 8.0, "review_text": "The Revenant, a ravishingly violent Western survival yarn from Alejandro González Iñárritu, has a healthy few, scattered like acorns across its two-and-a-half-hour canvas..... no matter how extended, the film’s tense story is under the director’s complete control...DiCaprio’s performance is an astonishing testament to his commitment to a role. cinematographer Emmanuel Lubezki done a great job..as a supporting actor tom hardy is brilliant..must watch...", "created_at": "2016-01-05T13:01:34.290Z"}, {"movie_id": 281957, "review_id": "56c13be79251410d6700071d", "author_rating": null, "review_text": "I thought this was a great movie. Seemed like it was a very physically demanding role for Leo.", "created_at": "2016-02-15T02:45:59.492Z"}, {"movie_id": 281957, "review_id": "56de01df92514134f40003bb", "author_rating": 7.0, "review_text": "Good performances by DiCaprio and, even more, Hardy.\r\n\r\nGood directing, specially the initial attack, photography, landscapes and soundtrack but the story is, at some points, unnecessarily violent and the action scenes are, sometimes, somehow stupid; people letting others to kill them, or ignoring foes close by ...\r\n\r\nA good movie all in all, but not one of the greatests.", "created_at": "2016-03-07T22:34:07.557Z"}, {"movie_id": 281957, "review_id": "5729f349c3a36808f000288a", "author_rating": 7.0, "review_text": "> The one who came back from the dead to avenge.\r\n\r\nThe movie was inspired by the real event that sets in the year 1823, United States. When one of the crew members of the hunters left behind after he was severely hurt from a bear attack, he desperately looks for a way to get back to the camp alive, especially to avenge for the death of his close one. The whole film was about survival in the wilderness and to avoid the native Americans. But the introduction in the opening was very brief and in the final act, it was another brief man hunt. Overall, it was an enjoyable movie for adults with some gruesome scenes.\r\n\r\nThe movie was made on a grand scale. Well written screenplay, good direction, the cast, music and the locations, but it would have been even awesome if it was true to the original occurrence. I felt it was cinematically overdosed, especially for the commercial purpose. The fans of Leonardo Dicaprio's overwhelming celebration created a huge buzz. In fact, it looks like the entire Hollywood is his fan and the Oscars given to him out of sympathy, because I have seen his best performances better than this in the past.\r\n\r\nThe length of the movie was a big concern, should have been at least 15 minutes shorter. But the visuals were fantastic, the CGI bear was almost flawless. There are plenty of reasons why this should not be missed, at a time the narration lacks the realism. Otherwise, it would have made a wonderful semi-documentary film. So don't have high hope on this, especially if you're no ones fans, but just love watching movies like me. A little bit overrated everywhere, but still this movie is good, just good, that's it, not a masterpiece.\r\n\r\n7/10", "created_at": "2016-05-04T13:04:09.887Z"}, {"movie_id": 281957, "review_id": "57acf230925141588c000379", "author_rating": null, "review_text": "There's nothing really to complain about the acting but their praise and this movie is overrated. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews//therevenant", "created_at": "2016-08-11T21:46:24.605Z"}, {"movie_id": 281957, "review_id": "58c172189251411d7b0066e5", "author_rating": 9.0, "review_text": "This is the best film I have seen all year (since 'Birdman', in fact, the previous film by Innaritu). It was expertly directed. The use of natural light really adds to the danger of the environment that surrounds Hugh Glass (Leonardo DiCaprio). Innaritu loves the camera to pan around objects and people to create a sense of awe and spectacle.\r\n\r\nLeonardo DiCaprio really did deserve all the awards that he got for this role. I thought it was his best film by far. The realism and intensity of his performance really comes through.\r\n\r\nThe story was gripping throughout the whole film and I found the twists and turns very interesting.\r\n\r\n★★★★½", "created_at": "2017-03-09T15:17:44.360Z"}, {"movie_id": 281957, "review_id": "5cb08d739251412fb023d90d", "author_rating": 7.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nFrom a technical point of view, _The Revenant_ is one of the most masterful pieces of cinema I've ever seen. This made its one technical failure all the more jarring. The ADR. I don't know how or why this was allowed to happen, but the dubbing of the Native Americans is some 70's style shit, it's awful, and it's awful every single time. In your average film this would be only a minor annoyance, but in _The Revenant_ which A) pretty much nails everything else in the AV department, and B) Takes itself so goddamn seriously, this issue is painfully distracting.\r\n\r\nI also found myself continuously rooting for the antagonists (first the bear, and later Hardy) subconsciously, and scolding myself for it. The good aspect of this is that it was rooted in the fact that all the characters are humanised (even the bear) and fallible, which I like, but the flip-side to that is I was less sympathetic to Leo's character, which takes up the majority of the screen time, and thusly I did not feel fully engaged for a large portion of the movie.\r\n\r\nIn fact the whole second and third acts underwhelmed me in that exact way. That's not to say that they were bad, but they were invariably weaker than the first act. After its end the rest of the film did feel like it was stretched a mite thin.\r\n\r\nThat all said, I knew within about 90 seconds that I was going to give _The Revenant_ a favourable review. Visually, it has this ethereal effect. It feels **too** real. So real that it must be a trick, the world of _The Revenant_ is alien in its realness. A bizarre contradictory nature that struck a chord with me immediately. For the average cinema-goer, I would say _The Revenant_ is worth your time, but for a movie aficionado or film student, I would say _The Revenant_ isn't anything short of a must.\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:06:59.686Z"}, {"movie_id": 281957, "review_id": "5e2f2b0d1685da0011e9cd5e", "author_rating": 10.0, "review_text": "\"My heart bleeds. But revenge is in the creator's hands\".\r\n\r\nThe Revenant is set in the 1820s, in the uncharted wilderness of America, Hugh Glass set out with a hunting party on an expedition. Glass was mauled by a bear and left for dead but through sheer will and to get back to his family, Glass survived - but that wasn't the only thing on his mind as he set out to payback the men who left him behind.\r\n\r\nI remember last year around January time when I saw the two images for The Revenant, with Leo holding a Kentucky Flintlock Rifle looking like he's not playing around. Those two images straight away caught my interest. I then found out it was directed by the magnificent Alejandro González Iñárritu who did the Oscar wining \"Birdman\" (a movie that I personally loved). The Revenant quickly became my most anticipated movie of 2015, as I was looking forward to this movie more than Star Wars, and yes I said it. And after finally seeing the movie myself, I can safely say that I was not disappointed. The Revenant is one of the most stunning, brutal, intense, grizzly movie experience I've ever had. The movie isn't for everyone, but I loved it.\r\n\r\nAlejandro González Iñárritu is starting to become my 3rd favorite director working today, because he's such an old school director when it comes to storytelling by the use of art. There's been a lot of drama happening behind the scenes of this movie, with the weather stopping the production or if someone made a mistake while filming, the crew must stop for the day and wait until tomorrow, because one mistake could lose a lot of day light for a scene (It was shot in natural lighting). One of the studios suggested that the movie should be shot using computer generated to make things much easier, but luckily Iñárritu said no to the idea by stating, \"If we ended up in greenscreen with coffee and everybody having a good time, everybody will be happy, but most likely the film would be a piece of shit.\" And after seeing the movie I gotta say that it was the perfect decision, because it's very rare for a director today to take that risk and avoid what the studio says. Yes there are some CGI scenes, but the way that the animated effect's blended together with the practical effect's is handled incredibly well. This is one of the best directed movies I've seen in 2015 and I know Iñárritu already won an Oscar already, but I hope he wins another one for this, because never before have I seen a revenge tale presented so unique and utterly magnificent.\r\n\r\nI respect Leonardo DiCaprio as an actor, but in this movie, he sleeps inside of a dead horse naked and eats raw food from animals, now if this doesn't get him an Oscar, nothing will. He's performance in this movie is what a call 'a silent performance', because Leo barley has that much lines in the movie and the only time he dose get to talk is in a different language (which Leo has said it was tricky to learn the language). DiCaprio has proven time and time again that he's more than a pretty face, but in this movie I only saw Hugh Glass, not DiCaprio. That's my biggest praise I have to give to Leo, as he had to deliver all the emotions, the pain and the tortured soul that Hugh Glass. All of that was all through his face and eyes and trust me when I say this, but it's not easy as you think. We are so use to seeing Leo as the angry, pretty boy billionaire in every movie he's in, but in this movie I thought he was fantastic. He played the man who lost everything. With very little lines he had, he still manages to make a powerful performance that's so far his best. I really hope Leo gets an Oscar for this.\r\n\r\nTom Hardy also gave an Oscar worthy performance in this movie. I've heard that some people had trouble understanding him in this movie (or just in everything that he's in really). Sometimes I didn't understand what he said but for the most part I did. But all that a side, I still think he was fantastic in the movie. He really added a lot to his character, because sometimes you understand the things that he dose in movie and yes the things he dose in the movie are wrong, but in a rough environment that these people are in, you would likely do the same. I'm not sure if he would get in for best supporting actor, but I hope he dose.\r\n\r\nI'm running out of things to say about Emmanuel Lubezki breathtaking cinematography. The camera work and how he makes the camera feel like a character of it's own is seriously impressive. Lubezki captures nature on film, that shows it's beauty and it's unpredictable surprises. The people running the Oscars should just give Lubezki his third Oscar right now, because he's going to take that third trophy home.\r\n\r\nFor flaws I had with the film it that some of the character logic towards the end of the movie didn't make that much senses to me. And that's it.\r\n\r\nOverall rating: \"The Revenant\" is one of most intense and stunning movies I've seen in 2015. The score is haunting, the editing was top notch and that bear attack scene was just terrifying. I mean how the hell did they do that? I don't know about you, but I honestly can't stop thinking about this movie. It's one of those movies that sticks with you after it's over and it isn't going away anytime soon.", "created_at": "2020-01-27T18:25:17.439Z"}, {"movie_id": 281957, "review_id": "5f306a83cdf2e6003922b65e", "author_rating": 9.0, "review_text": "Utterly riveting.\r\n\r\nIt's no surprise this one got/gets rave reviews - it's outstanding! <em>'The Revenant'</em> isn't necessarily edge-of-your-seat viewing, though it's still a massively impactful watch as you feel every hit of Hugh Glass' journey. It's rather gruesome and bloody, while it also has a few top notch action sequences.\r\n\r\nLeonardo DiCaprio is easily one of my favourite actors of all-time, the man is simply a sensational actor - I'm yet to see an anything less than tremendous film involving him. I wouldn't even say this is his greatest performance, and that's saying something as DiCaprio is absolutely superb here.\r\n\r\nAway from the main man, Tom Hardy is also part of this film. He is great, as I always expect from him. He and DiCaprio are fantastic actors. Hardy portrays John Fitzgerald, brilliantly. However, his character isn't written perfectly - not poorly by any stretch, he's just a bit flip-floppy at the beginning. The way the story creates itself involving Fitzgerald being where he is isn't as amazing as it could've been - very minor criticism, mind.\r\n\r\nAnother small complaint is the ending, there's nothing truly wrong with it at all but I, personally, would've concluded things about 10-15 minutes prior - there's a quality, almost Quentin Tarantino-esque, scene involving horses that would've made for a more thrilling end shot.\r\n\r\nTo finish, everything's beautifully crafted together visually, from a filmmaker's viewpoint, too. A marvellous film no doubt, certainly a must-watch!", "created_at": "2020-08-09T21:28:35.129Z"}, {"movie_id": 281957, "review_id": "568bbeaec3a3680e01007bb7", "author_rating": 8.0, "review_text": "The Revenant, a ravishingly violent Western survival yarn from Alejandro González Iñárritu, has a healthy few, scattered like acorns across its two-and-a-half-hour canvas..... no matter how extended, the film’s tense story is under the director’s complete control...DiCaprio’s performance is an astonishing testament to his commitment to a role. cinematographer Emmanuel Lubezki done a great job..as a supporting actor tom hardy is brilliant..must watch...", "created_at": "2016-01-05T13:01:34.290Z"}, {"movie_id": 281957, "review_id": "56c13be79251410d6700071d", "author_rating": null, "review_text": "I thought this was a great movie. Seemed like it was a very physically demanding role for Leo.", "created_at": "2016-02-15T02:45:59.492Z"}, {"movie_id": 281957, "review_id": "56de01df92514134f40003bb", "author_rating": 7.0, "review_text": "Good performances by DiCaprio and, even more, Hardy.\r\n\r\nGood directing, specially the initial attack, photography, landscapes and soundtrack but the story is, at some points, unnecessarily violent and the action scenes are, sometimes, somehow stupid; people letting others to kill them, or ignoring foes close by ...\r\n\r\nA good movie all in all, but not one of the greatests.", "created_at": "2016-03-07T22:34:07.557Z"}, {"movie_id": 281957, "review_id": "5729f349c3a36808f000288a", "author_rating": 7.0, "review_text": "> The one who came back from the dead to avenge.\r\n\r\nThe movie was inspired by the real event that sets in the year 1823, United States. When one of the crew members of the hunters left behind after he was severely hurt from a bear attack, he desperately looks for a way to get back to the camp alive, especially to avenge for the death of his close one. The whole film was about survival in the wilderness and to avoid the native Americans. But the introduction in the opening was very brief and in the final act, it was another brief man hunt. Overall, it was an enjoyable movie for adults with some gruesome scenes.\r\n\r\nThe movie was made on a grand scale. Well written screenplay, good direction, the cast, music and the locations, but it would have been even awesome if it was true to the original occurrence. I felt it was cinematically overdosed, especially for the commercial purpose. The fans of Leonardo Dicaprio's overwhelming celebration created a huge buzz. In fact, it looks like the entire Hollywood is his fan and the Oscars given to him out of sympathy, because I have seen his best performances better than this in the past.\r\n\r\nThe length of the movie was a big concern, should have been at least 15 minutes shorter. But the visuals were fantastic, the CGI bear was almost flawless. There are plenty of reasons why this should not be missed, at a time the narration lacks the realism. Otherwise, it would have made a wonderful semi-documentary film. So don't have high hope on this, especially if you're no ones fans, but just love watching movies like me. A little bit overrated everywhere, but still this movie is good, just good, that's it, not a masterpiece.\r\n\r\n7/10", "created_at": "2016-05-04T13:04:09.887Z"}, {"movie_id": 281957, "review_id": "57acf230925141588c000379", "author_rating": null, "review_text": "There's nothing really to complain about the acting but their praise and this movie is overrated. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews//therevenant", "created_at": "2016-08-11T21:46:24.605Z"}, {"movie_id": 281957, "review_id": "58c172189251411d7b0066e5", "author_rating": 9.0, "review_text": "This is the best film I have seen all year (since 'Birdman', in fact, the previous film by Innaritu). It was expertly directed. The use of natural light really adds to the danger of the environment that surrounds Hugh Glass (Leonardo DiCaprio). Innaritu loves the camera to pan around objects and people to create a sense of awe and spectacle.\r\n\r\nLeonardo DiCaprio really did deserve all the awards that he got for this role. I thought it was his best film by far. The realism and intensity of his performance really comes through.\r\n\r\nThe story was gripping throughout the whole film and I found the twists and turns very interesting.\r\n\r\n★★★★½", "created_at": "2017-03-09T15:17:44.360Z"}, {"movie_id": 281957, "review_id": "5cb08d739251412fb023d90d", "author_rating": 7.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nFrom a technical point of view, _The Revenant_ is one of the most masterful pieces of cinema I've ever seen. This made its one technical failure all the more jarring. The ADR. I don't know how or why this was allowed to happen, but the dubbing of the Native Americans is some 70's style shit, it's awful, and it's awful every single time. In your average film this would be only a minor annoyance, but in _The Revenant_ which A) pretty much nails everything else in the AV department, and B) Takes itself so goddamn seriously, this issue is painfully distracting.\r\n\r\nI also found myself continuously rooting for the antagonists (first the bear, and later Hardy) subconsciously, and scolding myself for it. The good aspect of this is that it was rooted in the fact that all the characters are humanised (even the bear) and fallible, which I like, but the flip-side to that is I was less sympathetic to Leo's character, which takes up the majority of the screen time, and thusly I did not feel fully engaged for a large portion of the movie.\r\n\r\nIn fact the whole second and third acts underwhelmed me in that exact way. That's not to say that they were bad, but they were invariably weaker than the first act. After its end the rest of the film did feel like it was stretched a mite thin.\r\n\r\nThat all said, I knew within about 90 seconds that I was going to give _The Revenant_ a favourable review. Visually, it has this ethereal effect. It feels **too** real. So real that it must be a trick, the world of _The Revenant_ is alien in its realness. A bizarre contradictory nature that struck a chord with me immediately. For the average cinema-goer, I would say _The Revenant_ is worth your time, but for a movie aficionado or film student, I would say _The Revenant_ isn't anything short of a must.\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:06:59.686Z"}, {"movie_id": 281957, "review_id": "5e2f2b0d1685da0011e9cd5e", "author_rating": 10.0, "review_text": "\"My heart bleeds. But revenge is in the creator's hands\".\r\n\r\nThe Revenant is set in the 1820s, in the uncharted wilderness of America, Hugh Glass set out with a hunting party on an expedition. Glass was mauled by a bear and left for dead but through sheer will and to get back to his family, Glass survived - but that wasn't the only thing on his mind as he set out to payback the men who left him behind.\r\n\r\nI remember last year around January time when I saw the two images for The Revenant, with Leo holding a Kentucky Flintlock Rifle looking like he's not playing around. Those two images straight away caught my interest. I then found out it was directed by the magnificent Alejandro González Iñárritu who did the Oscar wining \"Birdman\" (a movie that I personally loved). The Revenant quickly became my most anticipated movie of 2015, as I was looking forward to this movie more than Star Wars, and yes I said it. And after finally seeing the movie myself, I can safely say that I was not disappointed. The Revenant is one of the most stunning, brutal, intense, grizzly movie experience I've ever had. The movie isn't for everyone, but I loved it.\r\n\r\nAlejandro González Iñárritu is starting to become my 3rd favorite director working today, because he's such an old school director when it comes to storytelling by the use of art. There's been a lot of drama happening behind the scenes of this movie, with the weather stopping the production or if someone made a mistake while filming, the crew must stop for the day and wait until tomorrow, because one mistake could lose a lot of day light for a scene (It was shot in natural lighting). One of the studios suggested that the movie should be shot using computer generated to make things much easier, but luckily Iñárritu said no to the idea by stating, \"If we ended up in greenscreen with coffee and everybody having a good time, everybody will be happy, but most likely the film would be a piece of shit.\" And after seeing the movie I gotta say that it was the perfect decision, because it's very rare for a director today to take that risk and avoid what the studio says. Yes there are some CGI scenes, but the way that the animated effect's blended together with the practical effect's is handled incredibly well. This is one of the best directed movies I've seen in 2015 and I know Iñárritu already won an Oscar already, but I hope he wins another one for this, because never before have I seen a revenge tale presented so unique and utterly magnificent.\r\n\r\nI respect Leonardo DiCaprio as an actor, but in this movie, he sleeps inside of a dead horse naked and eats raw food from animals, now if this doesn't get him an Oscar, nothing will. He's performance in this movie is what a call 'a silent performance', because Leo barley has that much lines in the movie and the only time he dose get to talk is in a different language (which Leo has said it was tricky to learn the language). DiCaprio has proven time and time again that he's more than a pretty face, but in this movie I only saw Hugh Glass, not DiCaprio. That's my biggest praise I have to give to Leo, as he had to deliver all the emotions, the pain and the tortured soul that Hugh Glass. All of that was all through his face and eyes and trust me when I say this, but it's not easy as you think. We are so use to seeing Leo as the angry, pretty boy billionaire in every movie he's in, but in this movie I thought he was fantastic. He played the man who lost everything. With very little lines he had, he still manages to make a powerful performance that's so far his best. I really hope Leo gets an Oscar for this.\r\n\r\nTom Hardy also gave an Oscar worthy performance in this movie. I've heard that some people had trouble understanding him in this movie (or just in everything that he's in really). Sometimes I didn't understand what he said but for the most part I did. But all that a side, I still think he was fantastic in the movie. He really added a lot to his character, because sometimes you understand the things that he dose in movie and yes the things he dose in the movie are wrong, but in a rough environment that these people are in, you would likely do the same. I'm not sure if he would get in for best supporting actor, but I hope he dose.\r\n\r\nI'm running out of things to say about Emmanuel Lubezki breathtaking cinematography. The camera work and how he makes the camera feel like a character of it's own is seriously impressive. Lubezki captures nature on film, that shows it's beauty and it's unpredictable surprises. The people running the Oscars should just give Lubezki his third Oscar right now, because he's going to take that third trophy home.\r\n\r\nFor flaws I had with the film it that some of the character logic towards the end of the movie didn't make that much senses to me. And that's it.\r\n\r\nOverall rating: \"The Revenant\" is one of most intense and stunning movies I've seen in 2015. The score is haunting, the editing was top notch and that bear attack scene was just terrifying. I mean how the hell did they do that? I don't know about you, but I honestly can't stop thinking about this movie. It's one of those movies that sticks with you after it's over and it isn't going away anytime soon.", "created_at": "2020-01-27T18:25:17.439Z"}, {"movie_id": 281957, "review_id": "5f306a83cdf2e6003922b65e", "author_rating": 9.0, "review_text": "Utterly riveting.\r\n\r\nIt's no surprise this one got/gets rave reviews - it's outstanding! <em>'The Revenant'</em> isn't necessarily edge-of-your-seat viewing, though it's still a massively impactful watch as you feel every hit of Hugh Glass' journey. It's rather gruesome and bloody, while it also has a few top notch action sequences.\r\n\r\nLeonardo DiCaprio is easily one of my favourite actors of all-time, the man is simply a sensational actor - I'm yet to see an anything less than tremendous film involving him. I wouldn't even say this is his greatest performance, and that's saying something as DiCaprio is absolutely superb here.\r\n\r\nAway from the main man, Tom Hardy is also part of this film. He is great, as I always expect from him. He and DiCaprio are fantastic actors. Hardy portrays John Fitzgerald, brilliantly. However, his character isn't written perfectly - not poorly by any stretch, he's just a bit flip-floppy at the beginning. The way the story creates itself involving Fitzgerald being where he is isn't as amazing as it could've been - very minor criticism, mind.\r\n\r\nAnother small complaint is the ending, there's nothing truly wrong with it at all but I, personally, would've concluded things about 10-15 minutes prior - there's a quality, almost Quentin Tarantino-esque, scene involving horses that would've made for a more thrilling end shot.\r\n\r\nTo finish, everything's beautifully crafted together visually, from a filmmaker's viewpoint, too. A marvellous film no doubt, certainly a must-watch!", "created_at": "2020-08-09T21:28:35.129Z"}, {"movie_id": 281957, "review_id": "568bbeaec3a3680e01007bb7", "author_rating": 8.0, "review_text": "The Revenant, a ravishingly violent Western survival yarn from Alejandro González Iñárritu, has a healthy few, scattered like acorns across its two-and-a-half-hour canvas..... no matter how extended, the film’s tense story is under the director’s complete control...DiCaprio’s performance is an astonishing testament to his commitment to a role. cinematographer Emmanuel Lubezki done a great job..as a supporting actor tom hardy is brilliant..must watch...", "created_at": "2016-01-05T13:01:34.290Z"}, {"movie_id": 281957, "review_id": "56c13be79251410d6700071d", "author_rating": null, "review_text": "I thought this was a great movie. Seemed like it was a very physically demanding role for Leo.", "created_at": "2016-02-15T02:45:59.492Z"}, {"movie_id": 281957, "review_id": "56de01df92514134f40003bb", "author_rating": 7.0, "review_text": "Good performances by DiCaprio and, even more, Hardy.\r\n\r\nGood directing, specially the initial attack, photography, landscapes and soundtrack but the story is, at some points, unnecessarily violent and the action scenes are, sometimes, somehow stupid; people letting others to kill them, or ignoring foes close by ...\r\n\r\nA good movie all in all, but not one of the greatests.", "created_at": "2016-03-07T22:34:07.557Z"}, {"movie_id": 281957, "review_id": "5729f349c3a36808f000288a", "author_rating": 7.0, "review_text": "> The one who came back from the dead to avenge.\r\n\r\nThe movie was inspired by the real event that sets in the year 1823, United States. When one of the crew members of the hunters left behind after he was severely hurt from a bear attack, he desperately looks for a way to get back to the camp alive, especially to avenge for the death of his close one. The whole film was about survival in the wilderness and to avoid the native Americans. But the introduction in the opening was very brief and in the final act, it was another brief man hunt. Overall, it was an enjoyable movie for adults with some gruesome scenes.\r\n\r\nThe movie was made on a grand scale. Well written screenplay, good direction, the cast, music and the locations, but it would have been even awesome if it was true to the original occurrence. I felt it was cinematically overdosed, especially for the commercial purpose. The fans of Leonardo Dicaprio's overwhelming celebration created a huge buzz. In fact, it looks like the entire Hollywood is his fan and the Oscars given to him out of sympathy, because I have seen his best performances better than this in the past.\r\n\r\nThe length of the movie was a big concern, should have been at least 15 minutes shorter. But the visuals were fantastic, the CGI bear was almost flawless. There are plenty of reasons why this should not be missed, at a time the narration lacks the realism. Otherwise, it would have made a wonderful semi-documentary film. So don't have high hope on this, especially if you're no ones fans, but just love watching movies like me. A little bit overrated everywhere, but still this movie is good, just good, that's it, not a masterpiece.\r\n\r\n7/10", "created_at": "2016-05-04T13:04:09.887Z"}, {"movie_id": 281957, "review_id": "57acf230925141588c000379", "author_rating": null, "review_text": "There's nothing really to complain about the acting but their praise and this movie is overrated. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews//therevenant", "created_at": "2016-08-11T21:46:24.605Z"}, {"movie_id": 281957, "review_id": "58c172189251411d7b0066e5", "author_rating": 9.0, "review_text": "This is the best film I have seen all year (since 'Birdman', in fact, the previous film by Innaritu). It was expertly directed. The use of natural light really adds to the danger of the environment that surrounds Hugh Glass (Leonardo DiCaprio). Innaritu loves the camera to pan around objects and people to create a sense of awe and spectacle.\r\n\r\nLeonardo DiCaprio really did deserve all the awards that he got for this role. I thought it was his best film by far. The realism and intensity of his performance really comes through.\r\n\r\nThe story was gripping throughout the whole film and I found the twists and turns very interesting.\r\n\r\n★★★★½", "created_at": "2017-03-09T15:17:44.360Z"}, {"movie_id": 281957, "review_id": "5cb08d739251412fb023d90d", "author_rating": 7.0, "review_text": "**The following is a long form review that I originally wrote in 2015.**\r\n\r\nFrom a technical point of view, _The Revenant_ is one of the most masterful pieces of cinema I've ever seen. This made its one technical failure all the more jarring. The ADR. I don't know how or why this was allowed to happen, but the dubbing of the Native Americans is some 70's style shit, it's awful, and it's awful every single time. In your average film this would be only a minor annoyance, but in _The Revenant_ which A) pretty much nails everything else in the AV department, and B) Takes itself so goddamn seriously, this issue is painfully distracting.\r\n\r\nI also found myself continuously rooting for the antagonists (first the bear, and later Hardy) subconsciously, and scolding myself for it. The good aspect of this is that it was rooted in the fact that all the characters are humanised (even the bear) and fallible, which I like, but the flip-side to that is I was less sympathetic to Leo's character, which takes up the majority of the screen time, and thusly I did not feel fully engaged for a large portion of the movie.\r\n\r\nIn fact the whole second and third acts underwhelmed me in that exact way. That's not to say that they were bad, but they were invariably weaker than the first act. After its end the rest of the film did feel like it was stretched a mite thin.\r\n\r\nThat all said, I knew within about 90 seconds that I was going to give _The Revenant_ a favourable review. Visually, it has this ethereal effect. It feels **too** real. So real that it must be a trick, the world of _The Revenant_ is alien in its realness. A bizarre contradictory nature that struck a chord with me immediately. For the average cinema-goer, I would say _The Revenant_ is worth your time, but for a movie aficionado or film student, I would say _The Revenant_ isn't anything short of a must.\r\n\r\n75%\r\n\r\n-_Gimly_", "created_at": "2019-04-12T13:06:59.686Z"}, {"movie_id": 281957, "review_id": "5e2f2b0d1685da0011e9cd5e", "author_rating": 10.0, "review_text": "\"My heart bleeds. But revenge is in the creator's hands\".\r\n\r\nThe Revenant is set in the 1820s, in the uncharted wilderness of America, Hugh Glass set out with a hunting party on an expedition. Glass was mauled by a bear and left for dead but through sheer will and to get back to his family, Glass survived - but that wasn't the only thing on his mind as he set out to payback the men who left him behind.\r\n\r\nI remember last year around January time when I saw the two images for The Revenant, with Leo holding a Kentucky Flintlock Rifle looking like he's not playing around. Those two images straight away caught my interest. I then found out it was directed by the magnificent Alejandro González Iñárritu who did the Oscar wining \"Birdman\" (a movie that I personally loved). The Revenant quickly became my most anticipated movie of 2015, as I was looking forward to this movie more than Star Wars, and yes I said it. And after finally seeing the movie myself, I can safely say that I was not disappointed. The Revenant is one of the most stunning, brutal, intense, grizzly movie experience I've ever had. The movie isn't for everyone, but I loved it.\r\n\r\nAlejandro González Iñárritu is starting to become my 3rd favorite director working today, because he's such an old school director when it comes to storytelling by the use of art. There's been a lot of drama happening behind the scenes of this movie, with the weather stopping the production or if someone made a mistake while filming, the crew must stop for the day and wait until tomorrow, because one mistake could lose a lot of day light for a scene (It was shot in natural lighting). One of the studios suggested that the movie should be shot using computer generated to make things much easier, but luckily Iñárritu said no to the idea by stating, \"If we ended up in greenscreen with coffee and everybody having a good time, everybody will be happy, but most likely the film would be a piece of shit.\" And after seeing the movie I gotta say that it was the perfect decision, because it's very rare for a director today to take that risk and avoid what the studio says. Yes there are some CGI scenes, but the way that the animated effect's blended together with the practical effect's is handled incredibly well. This is one of the best directed movies I've seen in 2015 and I know Iñárritu already won an Oscar already, but I hope he wins another one for this, because never before have I seen a revenge tale presented so unique and utterly magnificent.\r\n\r\nI respect Leonardo DiCaprio as an actor, but in this movie, he sleeps inside of a dead horse naked and eats raw food from animals, now if this doesn't get him an Oscar, nothing will. He's performance in this movie is what a call 'a silent performance', because Leo barley has that much lines in the movie and the only time he dose get to talk is in a different language (which Leo has said it was tricky to learn the language). DiCaprio has proven time and time again that he's more than a pretty face, but in this movie I only saw Hugh Glass, not DiCaprio. That's my biggest praise I have to give to Leo, as he had to deliver all the emotions, the pain and the tortured soul that Hugh Glass. All of that was all through his face and eyes and trust me when I say this, but it's not easy as you think. We are so use to seeing Leo as the angry, pretty boy billionaire in every movie he's in, but in this movie I thought he was fantastic. He played the man who lost everything. With very little lines he had, he still manages to make a powerful performance that's so far his best. I really hope Leo gets an Oscar for this.\r\n\r\nTom Hardy also gave an Oscar worthy performance in this movie. I've heard that some people had trouble understanding him in this movie (or just in everything that he's in really). Sometimes I didn't understand what he said but for the most part I did. But all that a side, I still think he was fantastic in the movie. He really added a lot to his character, because sometimes you understand the things that he dose in movie and yes the things he dose in the movie are wrong, but in a rough environment that these people are in, you would likely do the same. I'm not sure if he would get in for best supporting actor, but I hope he dose.\r\n\r\nI'm running out of things to say about Emmanuel Lubezki breathtaking cinematography. The camera work and how he makes the camera feel like a character of it's own is seriously impressive. Lubezki captures nature on film, that shows it's beauty and it's unpredictable surprises. The people running the Oscars should just give Lubezki his third Oscar right now, because he's going to take that third trophy home.\r\n\r\nFor flaws I had with the film it that some of the character logic towards the end of the movie didn't make that much senses to me. And that's it.\r\n\r\nOverall rating: \"The Revenant\" is one of most intense and stunning movies I've seen in 2015. The score is haunting, the editing was top notch and that bear attack scene was just terrifying. I mean how the hell did they do that? I don't know about you, but I honestly can't stop thinking about this movie. It's one of those movies that sticks with you after it's over and it isn't going away anytime soon.", "created_at": "2020-01-27T18:25:17.439Z"}, {"movie_id": 281957, "review_id": "5f306a83cdf2e6003922b65e", "author_rating": 9.0, "review_text": "Utterly riveting.\r\n\r\nIt's no surprise this one got/gets rave reviews - it's outstanding! <em>'The Revenant'</em> isn't necessarily edge-of-your-seat viewing, though it's still a massively impactful watch as you feel every hit of Hugh Glass' journey. It's rather gruesome and bloody, while it also has a few top notch action sequences.\r\n\r\nLeonardo DiCaprio is easily one of my favourite actors of all-time, the man is simply a sensational actor - I'm yet to see an anything less than tremendous film involving him. I wouldn't even say this is his greatest performance, and that's saying something as DiCaprio is absolutely superb here.\r\n\r\nAway from the main man, Tom Hardy is also part of this film. He is great, as I always expect from him. He and DiCaprio are fantastic actors. Hardy portrays John Fitzgerald, brilliantly. However, his character isn't written perfectly - not poorly by any stretch, he's just a bit flip-floppy at the beginning. The way the story creates itself involving Fitzgerald being where he is isn't as amazing as it could've been - very minor criticism, mind.\r\n\r\nAnother small complaint is the ending, there's nothing truly wrong with it at all but I, personally, would've concluded things about 10-15 minutes prior - there's a quality, almost Quentin Tarantino-esque, scene involving horses that would've made for a more thrilling end shot.\r\n\r\nTo finish, everything's beautifully crafted together visually, from a filmmaker's viewpoint, too. A marvellous film no doubt, certainly a must-watch!", "created_at": "2020-08-09T21:28:35.129Z"}]