[{"movie_id": 22970, "review_id": "5098fa2619c295201100089f", "author_rating": 8.0, "review_text": "Hilarious and frightened: shaken, not stirred.\r\n\r\nGreat movie, one of the best in this \"genre\" for quite a while.", "created_at": "2012-11-06T11:53:10.000Z"}, {"movie_id": 22970, "review_id": "5207b394760ee3630522e11f", "author_rating": null, "review_text": "Finally got around to The Cabin in the Woods. 8/10, great fun. A Joss Whedon-(co)written (also co-written and directed by Drew Goddard, who wrote Cloverfield) take on an old horror staple in which 5 stereotypical teenagers (an academic, a jock, a stoner, a slut and a \"nice\" girl) venture out into the woods for a dirty weekend. It's no spoiler to say that these unfortunate young naïfs appear to have been cherry-picked and are being heavily monitored all the way into the woods by some very (very) high-tech manner of... what? Government agency? It's with these fellows that we visit first, before we ever meet our protagonists; two middle-aged, white collar I.T. types, a little brow-beaten by what appears to be a fairly monotonous job (although it really ****ing isn't) but full of typical office cameraderie and essentially confident in their own competence and that of the numerous other departments that make up this rather large-scale operation. Whoever is watching our heroes/heroines, they're big-time. So, what's happening? To say more would be to start giving things away, but those kids are very deliberate archetypes, placed in a very deliberately typical horror scenario. Because it's an American film set in America, it's called The Cabin in the Woods as is befitting the conventions of God-knows-how-many American horror flicks. Were it a J-Horror set in Tokyo, it would be called The Freaky Long-Haired Schoolgirl Ghost, an assertion ably illustrated in the film itself to great and rather humourous effect.\r\n\r\nDecent performances all-round, even the deliberately irritating characters are kind-of likeable. A pre-Thor Chris Hemsworth is particularly good as is Richard Jenkins (Nathaniel \"The Dead Patriarch\" Fisher from Six Feet Under). It threw me a bit, this film, because in purposely not looking too deeply at what it was about prior to seeing it, I mistakenly thought I was about to watch a seriously scary and effective horror, and this isn't the case at all. It's a slick product with what looks like a decent budget as you'd expect from a Joss Whedon project (in case you've been under a rock somewhere, he of Buffy/Angel and latterly of The Avengers fame) and it's loaded with nods to other horror literary and cinematic classics (The Evil Dead, Hellraiser, The Strangers and HP Lovecraft's Cthulhu Mythos are all fairly explicitly referenced), but it's not especially gory, it's intentionally funny more often than it's intentionally scary and it's a real thrill-ride, a slice of fun. It's not quite there, but it's a damn site closer to \"Horror-Comedy\" than it is to balls-out \"Horror\". It's not perfect by a long way - it instills bags of concerned curiosity in the viewer, but provokes almost zero real tension whatsoever. And late-on a special effects extravaganza treads clumsily into Night at the Museum-for-grown-ups territory. But it remains a great way to spend a couple of hours.", "created_at": "2013-08-11T15:53:56.959Z"}, {"movie_id": 22970, "review_id": "5a95aaa8c3a3681173002360", "author_rating": 5.0, "review_text": "This is another one of those movies where I cannot understand why so many people give it so high scores. Sure it’s not a really bad movie but, personally, I found it only moderately good. I’m not sure whether the movie was intended to be scary or funny or both. It wasn’t very funny though and only moderately scary.\n\nIt has been presented as a not-your-usual-teenage-slasher-horror movie. Well, it sure has an interesting twist but…it is still a teenage slasher horror movie. The twist could really have lifted the movie but unfortunately this good idea is pretty much wasted in a poor implementation.\n\nInstead of holding on to the surprise it’s spoiled right away with that eagle flying in to the force field (since when did we learn to build force fields by the way?). Another thing that really drags down the film are these utter morons in the control room. If this was really a matter of survival of mankind then you would have thought that it would have been left to professional people and not these jerks.\n\nThe movie isn’t all bad though. With the exception of these major flaws it does pass as a decent slasher/horror movie and makes for a reasonably entertaining hour and a half of not too intelligent movie watching. The part nearing the end where all the monsters goes on a rampage is rather fun to watch. I was not very impressed by the end itself though. That was rather uninspired I would say.", "created_at": "2018-02-27T18:59:52.330Z"}, {"movie_id": 22970, "review_id": "5ec384f418b751001fc9d65c", "author_rating": 9.0, "review_text": "**The following is a long-form review that I originally wrote in 2012.**\r\n\r\nJesus Christ. What just happened to my brain?\r\n\r\nI was worried that _Cabin in the Woods_ was gonna be a letdown, ‘cause I had built it up so much in my head, and it seemed such a ridiculous concept that it would have been nearly impossible to pull off flawlessly. And maybe it won’t go to join the ranks of my favourite films in existence, but it was… So. Fucking. Good.\r\n\r\nDrew Goddard (who wrote _Cloverfield_) is no stranger to working with Joss Whedon (_Buffy the Vampire Slayer, The Avengers_) and my God do they ever make a team. Joss Whedon is my unopposed all-time favourite person involved in the film industry in any way, shape, or form. Which is quite the claim, given my interests. He’s had a couple of fuck ups, and been fucked around a few times too, but all in all, nobody captures me quite the way he does.\r\n\r\nI’ll try and aim for not-spoilers, if you watch the trailer you’ll get that this isn’t a typical horror movie. You’ll also pick up on that if you watch the first 5 minutes of the damn thing. I won’t go into the finer details, but let me just reiterate, it is NOT a slasher film. There’s a fair amount of horror, some action, some sci-fi, a bit of fantasy, some short but sweet comedy, a bunch of thriller, a little monster-movie, a bit of homage and a healthy (but not overdone) dose of parody. Joss Whedon tends to do that, his work is usually less in the horror genre and more in the… Genre genre. If that makes sense.\r\n\r\nI seem to recall it performing kind of averagely at the box office, but critical reception was fantastic. And rightfully so. And fan-aimed movies as good as this always manage to fall into their cult, so there’s a pretty avid group of people who are super keen on it, too. Again, rightly so. I think the best (as well as most important) thing about _Cabin in the Woods_, is that it pumps some new blood into horror. Sure, it wasn’t 100% original, but then it never claimed to be. At least it wasn’t a sequel or another bloody remake.\r\n\r\nSeriously, I hate on remakes much, much less than most, but come on people! This is all rather ridiculous. Imagine if the Wachowskis had said “Hey, we’ve got this great idea for a dystopian, industrial sci-fi type thing called _The Matrix_… Actually, you know what? That sounds like an awful lot of effort. Let’s do an over the top American remake of _The Castle_ instead!” Yeah, sounds like a great world to live in. Fuckin’… Lazy ‘n shit…\r\n\r\nLost track there, anyway! _Cabin in the Woods_! Fuck! Good! Watch that shit! Make up your own mind of course, but I really dig it. There’s something to be said for being fucked up and going with it. I’m sure some people will dismiss _Cabin_ entirely, because it’s so out there. And I’m sure even more people will get pissy about the ending. But if you have no expectations, and just try enjoy the ride, then I think you damn well might.\r\n\r\n87%\r\n\r\n-_Gimly_", "created_at": "2020-05-19T07:04:20.994Z"}]