[{"movie_id": 223485, "review_id": "55f715069251414f6d005825", "author_rating": 8.0, "review_text": "> Going across the Atlantic to find the lost love.\r\n\r\nA western movie set in the 1870 United States, but entirely shot in the New Zealand. The story of a 16 year old boy, Jay, from Scotland embarks a journey in the New World in search of his love, Rose. Later a bounty hunter joins him and makes sure his safe travel. Technically, it was a road movie, but reveals the plot from the other angles as well in the spare times like during camping at the nights.\r\n\r\nThe narration was too slow and the story was ordinary, but it was enough for me to get engaged. If you wait until the final scene, especially till you figure out the puzzle of the romance theme, you may like it better. The end was so good, just like what a western movie fan looking for, a gunfight. Interestingly, that was not to be heroic, except all the earlier disasters pushed for the finale and the post finale. It is rated R, because it is so brutal in some way and for being faithful to the genre.\r\n\r\nIt might not be a dream debut for the director like the big cast, the high budget and a great commercial success, but giving a satisfying movie in a simple way was his accomplishment in his first attempt. Kodi Smith-McPhee is almost 20 and he's yet to play his independent and powerful enough character that will bring acknowledgement. It was a close one, the narration started like it was his, and he was everywhere in the movie. Then going further, especially when it nears the end, he was kind of fading. But he was awesome, along with Michael Fassbender. Not a must see, as well as not refusable if you get a chance to see it.\r\n\r\n7.5/10", "created_at": "2015-09-14T18:42:14.150Z"}, {"movie_id": 223485, "review_id": "56dc3020c3a368689d0023db", "author_rating": 9.0, "review_text": "One's a falling angel - the other one's a rising devil.\r\n\r\nSlow West is written and directed by John Maclean. It stars Kodi Smit-McPhee, Michael Fassbender, Ben Mendelsohn, Caren Pistorius and Rory McCann. Music is by Jed Kurzel and cinematography by Robbie Ryan.\r\n\r\nIt's the late 1800s and a teenage Scottish aristocrat travels to the American West to track down the girl he loves with all his heart...\r\n\r\nThere has been a number of modern day directors who have not only refused to let the Western genre die, but also to not be afraid to take it to a harshness of the West level. They have chosen to strip it back to a sense of realism, with no frills and bunting, just a show of tough times populated by tough people and people tough out of luck. Slow West is one such Oater.\r\n\r\nFor his first full length feature, John Maclean has chosen to make a genre of film he clearly knows something about. It's got some familiar tropes - greenhorn, grizzled bounty hunter, deadly gang et al, but Maclean has still made a fresh picture, one that not only intrigues and excites, but also humours by way of some black comedy inserts.\r\n\r\nEssentially it's a travelogue piece, McPhee's lovelorn Jay Cavendish ends up being escorted on his journey by Fassbender's mysterious tough guy Silas Selleck. It's an odd yet engaging pairing, and as they are pursued by Selleck's old gang, and they come across a number of eccentric or devious characters, you may find yourself hoping that all the hidden agendas - the secrets bubbling away in the background - do not shatter the surrogate relationship neither was looking for.\r\n\r\nHis heart was in the wrong place.\r\n\r\nAh, but yes! Maclean shows gumption to go all mud and blood on our butts, building everything to a quite terrific final quarter of film that has rode in on a black stallion straight from noirville. No printing the legend here, it's a bitter commentary on the romanticised view of the Old West. Western fans keen of ear will pick up on some historically spiky dialogue exchanges, whilst also noting the nods towards the immigration angles, where Maclean doesn't pull punches as to how desperate the Old West was for many of those who travelled hoping for a better life.\r\n\r\nPredominantly filmed in New Zealand (superbly standing in for the American West), the panoramic cinematography is stunning, while it's great to see the backdrops are not just mountainous desert scapes, this journey goes through forestry as well. Cast are on prime form, Fassbender seems to be a given these days and it's hoped he will do a Western again, and McPhee plays off of him with genuine conviction. Then there's Mendelsohn, who has to be one of the finest Australian character actors working today, he's perfectly cast here, so his fans know exactly what they will be getting.\r\n\r\nThe poster art is hugely frustrating, showing Caren Pistorius with a big beaming smile on her face, that is very much a bum steer. You would be wise to take more note of the faces of Messrs McPhee, Fassbender and Mendelsohn on that poster, for their facial portraits are more in keeping with this cracker-jack Western. 9/10", "created_at": "2016-03-06T13:26:56.851Z"}]