[{"movie_id": 348350, "review_id": "5afc39c9c3a36807270066ad", "author_rating": null, "review_text": "Back in 1977 I remember going into the original Cine Capri to see “Star Wars” with some friends. I was very young but little did I know that movie would change my life and put me on the path that I am now. Over the decades that have followed I have read the books and comics, played with the toys, played the video games, and eagerly watched any new film or television show related to the franchise.\n\nThe fact that Disney has put out a new film every years since “Star Wars: The Force Awakens” is great for fans like me as those three year waits; to say nothing of the 17+ years between the Original and Prequel Trilogies were tough.\n\nThrough it all my favorite character has always been Han Solo. I do not know what it is but the brash, cocky, money loving; scoundrel who gets in and out of trouble yet does the right thing in the end has always connected with me.\nSo when news came that there would be a new movie based on the early years of the title characters I was excited but concerned as Harrison Ford is so iconic in that role I could not see how anyone could measure up.\n\nCombine that with original Directors Phil Lord and Christopher Miller being removed from the film after shooting a significant number of weeks, there was ample concern to go around.\n\nFortunately for fans, Director Ron Howard has crafted a very enjoyable film as “Han Solo: A Star Wars Story” deftly combines the action, visuals, and humor that made the films cinematic legends and in doing so introduces new characters and expands the lore of the Star Wars Universe.\n\nThe film follows a young Han (Alden Ehrenreich), who hustles to survive and get off the world of Corrilia.\n\nHan like many kids on the street pull all sorts of scams under the control of various criminals and he plots to escape with his friend Qi’ra (Emilia Clarke).\nWhen an opportunity arises, Han takes it, but finds himself in the Imperial Navy which does not bode well for a person with strong opinions and a mind of his own. \nFate steps in once again and introduces Han to Chewbacca (Joonas Suotamo), and a mentor figure in the form of a man named Beckett (Woody Harrelson).   Han attempts to prove himself to his new crew as he sees this as his way out to a better life. However with things take a turn for the worse, he must work with his new associates to clear the slate with a deadly crime boss named Dry’den Vos (Paul Bettany).  \nAs anyone who follows the series knows Han has a way of escalating a situation and this leads the crew to recruiting Lando Calrissian (Donald Glover), into the crew as they set off to pull off a risky and dangerous mission to get the much needed resources to save their lives.\n\nWhat follows is a very enjoyable film that has an appropriate amount of humor and character building as well as plenty of good action and effects which should keep fans of the series happy. The new characters were very enjoyable and added a new depth to Han as well as the Star Wars mythos but what really impressed me was that at no time did I find myself comparing Ehrenreich to Harrison Ford. He was charismatic and enjoyable in the role and I easily believed that this was Han before life, the universe, and circumstances turned him into the man we would know years later.\nGlover is uncanny with his version of Lando and he at times almost sounded like Billy Dee Williams and had many of the mannerisms of the character down His back and forth with Han was great to see and we got a much deeper understand of both the characters and their complicated history with one another.\n\nClark and Harrelson round things out well as they provide a great balance to Han. One is a mentor and one is the link to the life he had and the dreams he wants to achieve.   Ron Howard moves things along well without rushing things as while it does take a bit of time getting up to speed, it happens at a natural pace without seeming rushed. Howard also does not rely on an abundance of effects to carry the film. There are plenty of practical FX and makeup creations to make you well aware that this is a vast and diverse galaxy but he uses them and the CGI to enhance the story rather than carry it.\n\nThere are numerous nods throughout to past films as well both visual and verbal and a few great surprises along the way. It is believed that more adventures of the younger Han will be coming in the future and I cannot wait for them to arrive as this was a very fun film. Now the only hard part will be the 19 month wait for Episode IX as the five month wait from the last film already seems like ages ago and I cannot wait for more.\n\n4.5 stars out of 5", "created_at": "2018-05-16T14:01:45.529Z"}, {"movie_id": 348350, "review_id": "5b09f2559251411d8900005e", "author_rating": 6.0, "review_text": "Not a bad movie, but you cannot replace H. Ford. The new Solo tries to be too much like the old Solo. Also, Lando is way too cool. Fav character was L3.", "created_at": "2018-05-26T23:48:37.169Z"}, {"movie_id": 348350, "review_id": "5b0ad5609251411e6a008396", "author_rating": 7.0, "review_text": "I have been a Star Wars fan since childhood. In fact, Star Wars: A New Hope was one of the first movies I ever saw in a theater. And I really enjoyed this movie. Don't believe the naysayers. There has been a lot of bad press surrounding the movie since the directors got fired and had to be replaced by Ron Howard. There was also some controversy of whether the lead actor was any good as Han Solo. The movie is not the mess we were led to believe. It works pretty well. Good action and special effects and lots of interesting alien creatures, as we would expect from a Star Wars movie. Alden Ehrenreich does a good job to make the role his own instead of doing an impression of Harrison Ford. Woody Harrelson, Phoebe Walter-Bridge, Donald Glover, and Paul Bettany also do good work in the film. Recommended for Star Wars fans.", "created_at": "2018-05-27T15:57:20.730Z"}, {"movie_id": 348350, "review_id": "5b0b38f79251411d8900eb9a", "author_rating": 6.0, "review_text": "Things happen because they're supposed to happen, and not because they would benefit the story. This is well-made but it feels perfunctory, fragmented, and, most importantly, entirely unnecessary. This movie is what happens when you work back from a foregone conclusion that's three decades old. Solo is tired, and it made me feel tired. It should never have been made. P.S. This is the first movie in which I didn't dislike Emilia Clarke! She's improving.", "created_at": "2018-05-27T23:02:15.109Z"}, {"movie_id": 348350, "review_id": "5b91fec20e0a26609c0059e5", "author_rating": 7.0, "review_text": "The public's backlash against _Solo_ has been **severely** diminished when compared to _The Last Jedi_, unfortunately however, so did the box office numbers. Best case scenario, this thing breaks even, and even that is looking unlikely. But I did actually quite enjoy _Solo_. It's not perfect, there are a decent number of problems I had with both the movie itself, and with its connection to the story overall, but I actually had a really good time watching _Solo_ (and seeing as I was probably the most sick I've ever been in my life when I watched it, that's saying something).\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time_.", "created_at": "2018-09-07T04:29:54.314Z"}, {"movie_id": 348350, "review_id": "5bddb79e0e0a260593010bd7", "author_rating": 7.0, "review_text": "I have to admit that I was a bit hesitant about watching this movie since it seems to have received quite a bit of flak. But then so did The Last Jedi and I liked that one a lot so a few days ago me and the kids sat down to watch Solo on my home cinema rig.\r\n\r\nWhat I found was a quite enjoyable action adventure movie. Yes, the story is simple and quite predictable but that is fine by me. What I wanted was a simple and straightforward action roller coaster and that was pretty much what I got. I did not want some deep crap with a lot of social pointers all over the place. It is Star Wars, it is meant to just entertain. Action and special effects “über alles” plain and simple.\r\n\r\nPortraying Han Solo when he was young is of course a quite tall order for any actor. Everyone is going to compare him with Harrison Ford and that is pretty much a recipe for failure. Personally I am happy that they picked an actor that was not especially well known from other movies, at least not to me. If they had not done that I would have compared him not only to Harrison Ford but also to whatever character he had played before. I think Alden Ehrenreich did a fairly good job of portraying a young Han Solo.\r\n\r\nActually, I think most of the actors was fairly okay. It’s not a Shakespeare play after all. It did sadden me that Woody turned out to be such an asshole in the end though. For most of the movie I quite liked the guy.\r\n\r\nThe story was, as I already wrote, simple and straightforward. Predictable as hell of course but then, in these kind of movies the story is more or less only a means to tie together the action. It worked for me. I am so glad that they actually did tie up a certain loose end at the end of the movie though. If Solo hadn’t been in that last game of cards with Lando and the outcome not been what it was I would have been seriously miffed about the entire movie. Probably one of the scenes I liked the most actually.\r\n\r\nAs I am writing this the movie has a rating of 7 out of 10 on IMDb and I think that is pretty much spot on. I have to say that I am quite sad about Disney’s knee-jerk reaction to pull the brakes on the Star Wars movies. This is so typical of the Hollywood bean counters nowadays. If a movie is not making an insane amount of money the first couple of weeks it is considered a failure and the standard response is to pull the franchise. That is essentially saying that there is something wrong with the audience. We made a good movie but you did not like it so we kill the franchise way of thinking. Well, news flash dumb asses, if the movie didn’t sell as well as you estimated either there is something wrong with your over-inflated estimates or with the movie you did. It’s your fault, not the audience. Make a better one or fix your estimates! Okay, as a Star Wars fan I am perhaps biased but I am so tired of dumbass bean counters, not just where movie making is concerned.", "created_at": "2018-11-03T14:58:38.751Z"}, {"movie_id": 348350, "review_id": "5d3d5f64ede1b00013ed4be1", "author_rating": 8.0, "review_text": "Let me give you some advice. Assume everyone will betray you. And you will never be disappointed.\r\n\r\nSo the latest in what is becoming a long running sci-fi franchise sees Han Solo (Alden Ehrenreich) get his prequel movie. Unsurprisingly, such is the ferocious core fan base of the Star Wars series, it has been met with a mixture of outright hatred to pats on the back appreciation. It really is a case here of jumping in to view it on its own terms to at least give it a chance. The truth is, is that if this was a stand alone movie being judged purely as a science fiction action movie, then it would be better appreciated. For this is cracker jack entertainment in that sphere, with superbly constructed worlds inhabited by delirious looking aliens species, feisty droids hold court, and the humans are daring, cheeky and even sexy. It is in short quality and fantastical sci-fi, even if in truth as per the Solo character trajectory it's safe film making.\r\n\r\nWe, as in the royal Star Wars fans we, all have our card carrying belief that our opinion on any Star Wars film is correct, but really the only advice I can honestly give here is that if you haven't seen it yet then at least give it a chance. Those that have seen it have their minds made up either way, so personally I can only say how much fun I had watching it - twice! All the dots are joined towards the Solo character I love so dear, from back when with childhood eyes in the late 70s I was transfixed on that big screen. How great to see how Han met Chewbacca (Joonas Suotamo) and how their brilliant friendship begins. To witness the birth of the Han/Lando Calrissian (Donald Glover excellent) friendly rivalry - and all that that entails as regards our favourite spaceship - The Millennium Falcon. Yes, I like it well enough for sure, maybe you will as well? 7.5/10", "created_at": "2019-07-28T08:40:04.464Z"}, {"movie_id": 348350, "review_id": "5dcbdc851d78f200142419f4", "author_rating": 4.0, "review_text": "My, how the mighty have fallen! It used to be that Star Wars could do no wrong. People were even forgiving of the prequel trilogy (eventually) and its many, many flaws to accept them in the multi-billion dollar franchise. There was some trepidation over the whole “Star Wars Story” side story films, but that seemed to be allayed by the excellent “Rogue One.” Then comes “Solo,” and I’m sorry to say that our fears have now been realized.\r\n\r\nStarting with Han growing up as a youth on Corellia, we see how each aspect of his character comes into being. Each. Aspect. Even how he gets the name Solo. I mean, seriously! They create a checklist, from his relationships to Chewie and Lando, right down to his blaster, and shows how each one comes to pass or be in his possession.\r\n\r\nIt’s actually kind of...well, sad. It turns out that every iconic aspect of this character we’ve loved all sprang out of one single caper in his career. Talk about peaking early! They even recreate some famous scenes, but they’re still the same scenes just with a new coat of paint. And paint is a very apt metaphor. “Solo” is very much a paint by numbers Star Wars film. No surprises. Purely for fans, and even then there’s some issues. Even the cameo at the end felt ridiculously overdone. Star Wars fatigue definitely seems to be setting in. Still, as a Star Wars fan, I’m probably being more forgiving even though I rate this movie as just “Okay.”", "created_at": "2019-11-13T10:35:49.299Z"}, {"movie_id": 348350, "review_id": "601ccc6e13a320003fa572ad", "author_rating": 7.0, "review_text": "Yet another story squeezed into the timeline of this franchise. <em>'Solo: A Star Wars Story'</em> is a good one, though.\r\n\r\nThe casting is well done, they are all satisfactory in what they give to the film. Alden Ehrenreich is a solid cast as the titular character, I found him enjoyable. Woody Harrelson, Emilia Clarke, Donald Glover and Paul Bettany, meanwhile, are all positive additions.\r\n\r\nI like how it connects into its position in the <em>'Star Wars'</em> universe, sometimes you can tell they jumped through quite a few hoops just to make certain things work but I think they did an admirable job.\r\n\r\nThe film looks and sounds the part, it's certainly up to the standard that I expect from these productions. I wouldn't say it is anything all that sensational or anything, but I came away from watching in a pleasant mood.", "created_at": "2021-02-05T04:41:18.183Z"}]