[{"movie_id": 438674, "review_id": "5d25cc2e37b3a9001153b1f1", "author_rating": 8.0, "review_text": "With its moral ambiguity and explicit violence, ‘Dragged Across Concrete’ is ugly, bleak, brutal and vile in the best ways possible. The film’s true target audience, though, is patient connoisseurs of highbrow-lowbrow combo platters who are eager to watch a cast of bad men navigate a slow-motion descent into hell. Understandably, it’s not everybody’s cup of tea, but if you’re already a fan of S. Craig Zahler’s oeuvre, elaborate dialogue and exploding heads, you’re in for a treat.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-dragged-across-concrete-a-hypnotically-violent-and-excessive-crime-flick", "created_at": "2019-07-10T11:29:50.550Z"}, {"movie_id": 438674, "review_id": "5d670ff5b5bc2100126f17ed", "author_rating": 8.0, "review_text": "**_Ugly, crude, morally repugnant, thoroughly enjoyable_**\r\n\r\n> **Tom Grater**: _The film has quite a complicated relationship with race, there are moments in it that make the viewer feel uncomfortable. Can you talk about that approach?_\r\n\r\n> **S. Craig Zahler**: _I don't try to put out a socio-political message. I've publicly railed against 'message' movies, I think they're didactic. For me, it's about a bunch of people from different walks of lives who get pushed into certain corners. We have had plenty of films that say \"war is bad\", \"racism is bad\", \"love is good\". That's what blogging is_ _for. The effects of being a police officer, carrying prejudice within you, and the damage that can come with it - that's stuff I wanted to play with. I think there will be people who watch this movie and find the two cops repellent and people who find them relatable and sympathetic. That's by design._\r\n\r\n- \"Venice Q&A: _Dragged Across Concrete_ director S. Craig Zahler - \"I don't think US cinema is in a good place\"\" (Tom Grater); _Screen Daily_ (September 7, 2018)\r\n\r\n> **Nick Schager**: _Some critics consider your films conservative-oriented, and_ Dragged Across Concrete _has only reinforced that view. Do you agree with those assessments about your work's politics?_\r\n\r\n> **S. Craig Zahler**: _I'm not politically driven; I'm not very politically interested. None of the stuff I write comes from the point of view that I want to push an agenda, or have a piece that is subservient to a single thesis statement that I hope will enlighten the world. I think_ Bone Tomahawk _and_ Dragged Across Concrete _have multiple characters and viewpoints, and I write all of my stuff from the viewpoint of the characters. If you watch_ Bone Tomahawk _and say, well, what the author really thinks is what Brooder (Matthew Fox) thinks, then you're going to come away with one point of view. If you think the author thinks what Arthur (Patrick Wilson) thinks, then clearly the author is Christian and pushing that forward - which is probably not the case with a Jew-turned-atheist such as myself. And that's something I've seen in a bunch of pieces, that it was a Christian movie._\r\n\r\n> _This is a thing I do as a writer: I put what the characters are doing and thinking on the line and in the piece much more than me putting out a single idea or a philosophy for people to latch hold of. Now at this point in time, people are falling all over themselves to make sure they aren't labelled this or that, and I'm fine with whatever anyone wants to take away from my movies. I think with_ Dragged Across Concrete _and_ Bone Tomahawk_, it's pretty hard to step away and say there's this singular viewpoint from all these characters, and that all these scenes reflect it. In fact, I think it's impossible. I think one needs to ignore a lot of what certain characters do, and then say, well, what these characters are doing and saying, that's what the author really feels. So then what you're doing is bringing in your judgment of the author, and looking for evidence to support it, rather than looking at the material that's at hand._\r\n\r\n> _In the case of_ Dragged Across Concrete_, I think it's a very complex world; there are a lot of differing viewpoints that show a lot of different people have different struggles. I understand why some people would say that my films are conservative - because there isn't a clear didactic, if not pedantic, agenda at the fore of these pictures. But I'm writing stuff that I find compelling, and I'm not going to stop writing a scene, or change a character's ethnicity, or remove a line of dialogue, because I think someone might interpret it in a certain way, or be offended by it. I'm writing what I find compelling, and I think in the case of the first and third movies, you really get a lot of different viewpoints._\r\n\r\n- \"The Hollywood Filmmaker Making Movies for the MAGA Crowd\" (Nick Schager); _Daily Beast_ (March 18, 2019)\r\n\r\n> _I'm not making movies and writing books and doing all these things to become popular or for people to like me. I hope people enjoy them, but I'm not going to make different creative choices so that more of them do. If you come into a movie and you're very focused on one thing - like you're very interested in how people of this ethnicity or people with this belief system or women or children or people from Canada are treated in this movie, that's your viewpoint, and you're entitled to it. If the most important thing for you to get out of the movie experience is to see a reflection of your personal beliefs, you probably won't get that with any of my movies because they don't even consistently line up with themselves._\r\n[...]\r\n> _I am not looking for films to express values. That's getting dangerously closer to an 'agenda movie', which is a movie in support of its thesis statement. My characters drive my movies._\r\n\r\n- S. Craig Zahler\r\n\"The Director Who Doesn't Care What You Think of His Movies\" (Scott Tobias); _The Ringer_ (March 22, 2019)\r\n\r\nIn writer/director S. Craig Zahler's superb feature debut, the horror-western _Bone Tomahawk_ (2015), a man is held upside-down, literally split down the middle with a machete, and his body pulled apart by his legs; another man has a hot metal flask pushed into a gaping wound in his stomach; and a group of pregnant women have their eyes gouged out and their four appendages removed (off-camera, thankfully). In his second film, the fatalistic but excellent prison drama _Brawl in Cell Block 99_ (2017), a man has his face dragged along a concrete floor, until the skin quite literally rips away from his skull. In his third film, the epic crime drama _Dragged Across Concrete_, a man has his innards pulled apart and examined in an effort to find something he has swallowed. I guess the fact that he's already dead when it happens represents a degree of artistic maturation on the part of Zahler.\r\n\r\nOkay, so I'm being flippant. The fact is that I loved both of Zahler's previous films, so much so that I sought out a few of his novels. And I loved them too. Apart from the technical proficiency with which his films are made, I admire how they represent a throwback to true Grindhouse, embodying the phrase, \"_they don't make 'em like that anymore_\". Synthesising several disparate genres, and featuring sudden and extreme violence, both _Tomahawk_ and _Brawl_ have an air of self-seriousness bordering on narcissism, and methodically paced narratives (they each run 132 minutes). In _Dragged_, the gore has been toned down considerably (although not the violence), the nihilistic worldview is even more apparent (the fictional _milieu_ in which the film is set makes the Baltimore of _The Wire_ look like Beverly Hills), the genre mashup is more complex, and the pace is even more languorous, with the film running a whopping 159 minutes. Not so much about the horrific things that can happen to you on the street (although it is certainly partly about that), _Dragged_ is more concerned with the horrific things you have to do to survive, and how in such circumstances, you can rationalise and justify pretty much anything. And make no mistake; this is a morally repugnant piece of utter trash cinema, ugly and stoical in equal measure. However, it has also been made with extraordinary craft and a tacit disregard for prevailing taste. Sure, it's crude, exploitative, and demoralising, but it's also immensely enjoyable.\r\n\r\nSet in the fictional city of Bulwark, the film begins with Henry Johns (an excellent Tory Kittles), recently released from prison, returning home to find his drug-addicted mother Jennifer (Vanessa Bell Calloway) turning tricks in her bedroom, whilst his wheel-chair-confined younger brother Ethan (Myles Truitt) is kept quiet with PlayStation videogames. Disgusted with the situation, Johns determines to get his family out of Bulwark, and asks his old friend Biscuit (Michael Jai White) if there is any work going, the kind that pays cash and doesn't ask questions. Meanwhile, Det. Brett Ridgeman (Mel Gibson) and Det. Anthony Lurasetti (Vince Vaughan) bust a Latino drug dealer, with Ridgeman standing on the man's head, unbeknownst that he is being filmed by a neighbour. Called before their boss, and Ridgeman's former partner, Chief Calvert (Don Johnson, still effortlessly cool), he has little choice but to suspend them without pay until the media lose interest in the story. However, this couldn't have come at a worse time for either man; Lurasetti is trying to save up money in preparation to propose to his girlfriend Denise (Tattiawna Jones), whilst Ridgeman wants to move his family out of the bad part of town in which they live, where his daughter Sara (Jordyn Ashley Olson) is being harassed by a local gang, and his wife Melanie (Laurie Holden), a former cop now suffering from MS, is miserable. In desperate need of money, and bitter about being suspended, Ridgeman contacts Friderich (Udo Kier), a criminal fixer, who puts him onto an upcoming score being run by Lorentz Vogelmann (Thomas Kretschmann). Telling Lurasetti he plans to rob the crew once they've carried out the job, Lurasetti says he's on-board. Meanwhile, Kelly Summer (a heart-breaking Jennifer Carpenter) is reluctantly returning to work after maternity leave. Suffering from severe separation anxiety, however, Summer's husband literally has to lock her out of their apartment to get her to leave. How these three storylines (Johns, Ridgeman/Lurasetti, and Summer) collide is what makes up the majority of the narrative.\r\n\r\nIn North America, _Dragged Across Concrete_ opened in only a few theatres on the same day it was made available for streaming, and with next-to-no advertising (it doesn't have an official website and its Facebook page has only a few posts), it earned a paltry $144,000 against a $15 million budget. Rumours at the time suggested that Lionsgate, who distributed the film theatrically through their Summit Entertainment subsidiary, had demanded Zahler cut the film to an \"audience friendly\" 130 minutes. As he had final cut, however, he refused, and they cancelled plans for a wide theatrical release (not entirely unlike what happened with _Snowpiercer_ (2013), when director Bong Joon-ho refused Harvey Weinstein's demands to cut the film by 20 minutes).\r\n\r\nNarratively, although Dragged is easily Zahler's most densely plotted film thus far, much like his previous work, it's predicated on character rather than story. Spending considerable time on relatively inconsequential conversations that do little to advance the plot, but add layer upon layer of character information (think the \"_royale with cheese_\" scene from _Pulp Fiction_), Zahler takes this style directly from hardboiled crime fiction. Traditionally the first scenes to go after the assembly edit, it's an easy technique to misuse (just look at all the failed attempts to emulate Quentin Tarantino post-_Pulp Fiction_), but Zahler knows when and how to employ it, and he's in no rush to get from one scene to the next. One particular example depicts Lurasetti eating an egg salad sandwich in near real-time, as Ridgeman becomes more and more irritated by the noise of masticating, eventually growling, \"_a single red ant could have eaten it faster_\".\r\n\r\nNo spoilers, but one plot strand in particular benefits greatly from the accumulation of slowly-revealed background information, so when it erupts in sickening violence, the emotional impact is all the stronger, because we've gotten to know this person; think of the character of Breedan (Dennis Haysbert) in Michael Mann's _Heat_ (1995), think of how soul-destroying it is when we see his girlfriend Lillian (Kim Staunton) watch the news report about the score, a scene that works as well as it does because Mann spent time introducing us to the characters despite them seemingly having nothing to do with the rest of the film. Zahler takes it much further than Mann, however. If the Breedan subplot was a pseudo-novelistic detail, Zahler seems to have edited in something from another movie entirely, an altogether more surreal film where people are overly friendly to one another, completely at odds with the world inhabited by the rest of the cast. He drags these scenes out to the point where they almost become infuriating (almost) - but when he lets the hammer fall, its impact is earth-shattering, and probably the emotional highpoint of the film (and by highpoint, I do, of course, mean low-point; there are no highpoints in Zahler's films).\r\n\r\nThe script is also dynamite from start to finish, with some fantastic lines sounding like they were ripped directly from Michael Mann; Johns, for example, tells Biscuit, \"_before I consider that kind of vocation, I need to get myself acclimated_\", whilst he reminds Ethan, \"_pops is a yesterday who ain't worth words_\". This kind of highly expressive overly literal way of speaking is exactly the way the aforementioned Breedan speaks (\"_there ain't a hard time been invented that I cannot handle_\") or Frank (James Caan) in _Thief_ (\"_I got some A-B-C type information for you, lady. I was state-raised, and this is a dead place. A child in eight-by-four green walls, after a while you tell the walls \"my life is yours\"._\"). This kind of dialogue has two main functions; obviously, it keeps things lively (not easy to do when you have so many long dialogue scenes), but it also illuminates character; Lurasetti, for example, is easily the more laidback of the two cops, saying things like, \"_it's bad like lasagne in a can_\", which is not the kind of simile one would image Ridgeman coming up with.\r\n\r\nAesthetically, _Dragged_ is exceptionally accomplished. Working with his regular cinematographer, Benji Bakshi, Zahler stages most of the film either at night, or in shadows (or both), so much so that a central scene in a well-lit building in the middle of the day seems completely washed out and garish by comparison. Brian Davie's production design is also worth mentioning, with the characters' living spaces completely soulless, all muted neutralising colours and generic furnishings, like they've moved into a showroom and haven't bothered to bring their own stuff or repaint; the places that are supposed to be the most personal and intimate are instead completely anonymous (it's telling, for example, that Calvert's office gives off a warmer vibe that either the Ridgeman or the Johns apartments).\r\n\r\nWearing his influences very much on his sleeve (directors such as Jules Dassin, Don Siegel, Jean-Pierre Melville, Arthur Penn, Sidney Lumet, Michael Mann, and Quentin Tarantino; and novelists such as Charles Willeford, Elmore Leonard, Donald E. Westlake, and George V. Higgins), and given what his films say about masculinity, violence, revenge, and justice, it's no surprise that Zahler is often singled out as a quintessential right-wing filmmaker in a very left-leaning Hollywood. Although he claims he's not especially interested in politics, and asserts that he didn't vote for Donald Trump in 2016, nor does he plan to do so in 2020, the _Daily Beast_ still referred to him as \"the Hollywood filmmaker making movies for the MAGA crowd\", which is not only unhelpful and reductionist, it's not even accurate, as there is nothing in his films to suggest he subscribes to Trump's hateful and divisive rhetoric (it is possible, after all, for one to be a right-wing conservative without being an advocate of Trump's self-serving politics).\r\n\r\nThat said, with _Dragged_, if Zahler isn't explicitly engaging in socio-political commentary, then he is epically trolling the left and baiting outrage culture. This is a film partly about two racist cops who complain about political correctness, trial by social media, and metrosexuality (amongst other things), and who use (gun) violence to try to set their world to rights. And who plays these two cops but noted Hollywood conservatives Mel Gibson (still somewhat under the cloud of his 2006 anti-Semitic rant and his 2010 \"raped by a pack of niggers\" comment and domestic violence charge), and Vince Vaughan, who rather amusingly believes the way to tackle gun violence in the US, is to introduce more guns as \"_deterrents_\". This casting seems like provocation in and of itself (one assumes Clint Eastwood, James Woods, Roseanne Barr, Tim Allen, and Hulk Hogan were busy), and one can picture Zahler getting not inconsiderable satisfaction from watching SJWs losing their minds trying to parse the metatextuality of casting Mel Gibson, of all people, as a violent racist; as, probably by design, it's legitimately difficult to tell where Gibson ends and Ridgeman begins.\r\n\r\nHowever, to be completely fair, it's in relation to this point where _Dragged_ is most open to divergent interpretations. Namely, does Zahler simply depict the characters' racist and misogynistic antics, or does he sympathise with and therefore condone their toxic mindset? Either the film confirms what Zahler's previous work only hinted at, that he's a far-right reactionary, or it demonstrates his satirical flair, ridiculing such accusations by leaning into and foregrounding the tropes of an ideologically to-the-right paradigm. Of course, many will have made their minds up on this issue without even seeing the film, especially given Gibson's involvement, whose casting is either a stroke of ironic genius or a tell-tale sign of an inherent retroactive conservatism.\r\n\r\nWhich brings us to the film's socio-political stance, or lack thereof. Despite Zahler's claims that it's not political in any way, it's hard to deny that some of the dialogue and events seem to have a political flavour (and, as some have argued, if Mel Gibson is playing a racist in your movie, then your movie, by default, cannot be apolitical). So, for example, racism is played for casual humour when Lurasetti proclaims, \"_I'm not racist. Every Martin Luther King Day, I order a cup of dark roast_\". Even more telling is Calvert's claim that\r\n\r\n> _being branded a racist in today's public forum is like being accused of being a communist in the 50s, whether it's a possibly racist remark made in a private phone call or the indelicate treatment of a minority who sells drugs to children. The entertainment industry, formerly known as the news, needs villains._\r\n\r\nThis comment will instantly call to mind Trump's never-ending refrain of \"fake news\", and it returns us to the question of Zahler's personal stance. True, he certainly doesn't outright condone Ridgeman and Lurasetti's behaviour and opinions, but neither does he outright condemn them. Neither man is presented as a hero, but neither is presented as a villain. Indeed, the case could credibly be made that this is Johns's story before it is Ridgeman or Lurasetti's, and were Kittles a bigger star, one assumes he would have had top billing. But this doesn't change the fact that the two are unapologetically cruel to non-Caucasians - seen most clearly when they throw a drug dealer's partially deaf girlfriend into a cold shower and refuse to give her a towel. In relation to the area in which the Ridgemans live, in an early scene, we are shown a gang of black youths cruelly hassling Sara, and later, Melanie says, \"_I never thought I was a racist before living in this area_\". That's a hell of a loaded statement in a film that's apparently not interested in issues such as race relations.\r\n\r\nMoving away from racial issues, as Ridgeman and Lurasetti sit in a diner, Ridgeman is listening to the song on the radio, and they have this exchange;\r\n\r\n>**BR**: _Is that a guy or a girl singing that song?_\r\n\r\n>**AL**: _Can't tell._\r\n\r\n>**BR**: _Not that there's much of a difference these days._\r\n\r\n>**AL**: _I think that line was obliterated the day men started saying \"we're pregnant\" when their wives were._\r\n\r\nAnd then there's this statement by Ridgeman to Calvert about the broken system in which they find themselves (a system to which Calvert has adapted, whereas Ridgeman has not);\r\n\r\n>_for a lot of years I believed that the quality of my work, what we do together, what I did with my previous partners, would get me what I deserved. But I don't politic and I don't change with the times, and it turns out that shit's more important than good honest work. So yesterday, after we stop a massive amount of drugs from getting into the school system, we get suspended because we didn't do it politely._\r\n\r\nIt's hard not to hear Zahler himself behind an impassioned sentiment like this, someone who may believe (and may be correct) that PC culture has gotten to a point of unworkable absurdity. This, in turn, raises the most difficult interpretive conundrum of the film - does he endorse old-fashioned _Dirty Harry_-style anti-authoritarianism, where hatred for politicking is equalled only by the belief that guns are a necessary part of life? Does he lament the fact that the traditional patriarchal aggression of white conservative America finds itself at odds with the rest of the world, or does he just understand people who feel that way?\r\n\r\nRunning parallel to ambiguities concerning racism and political correctness is a perceived misogyny in his work. All three of his films depict relatively helpless women who must be saved from evil men by righteous men. However, what the female characters experience in _Dragged_ is much harsher than in his previous work; not only are they again presented as victims who need saving, they are brutalised and murdered without much of an afterthought. So again, is Zahler himself part of a patriarchy that thinks of women in this way, as inherent victims who require men's protection, or is he simply in a position to understand such a mindset? In relation to all three ambiguities (race, political correctness, misogyny), I don't have an answer, but the line between critical commentary and ideological endorsement is razor thin, and it's a line that Zahler walks throughout. Which is one of the things that makes the film so fascinating. The first film he's made that is more likely to alienate audiences because of its perceived ideology than its violence, Zahler takes risks that other filmmakers would never dream of, and whereas most artists would be falling all over themselves to ensure there's not a hint of racism or misogyny about their work, Zahler's \"death-of-the-author\"-style tactic and refusal to do so makes this his most politically interesting and ideologically complex film thus far.\r\n\r\nOf course, there are a few formal problems. For starters, although this is ostensibly Johns's story, compared to either Ridgeman and Lurasetti, he receives a relatively light backstory. The two cops are simply better-written characters; their dialogue is sharper and more revealing, their arcs more thought-out and interesting, their motivations more complex and relatable. You could say that this is because of the strength of the actors; Gibson brings a brooding cynicism to Ridgeman - he never even hints at smiling – that's virtually metatextual, and Vaughan is all sarcasm and one-liners. Kittles, on the other hand, is essentially reprising his role as Laroy from _Sons of Anarchy_. But the fact is that Gibson and Vaughan have a lot better material with which to work - they're written as people, whereas Johns is written as an archetype, void of much in the way of interiority. Another problem is that because of the way the script is written, no one is ever put in a position of challenging Ridgeman and Lurasetti's prejudiced views; so there's never a scene, for example, where Johns calls them out on their casually racist language, forcing them to justify it. With their views unchallenged, and Johns not actually in possession of much of a worldview, there's a sizable imbalance in the film, an imbalance which doesn't equate with endorsement, but doesn't encourage criticism either.\r\n\r\nThat said, however, I thoroughly enjoyed _Dragged Across Concrete_, and much like _Bone Tomahawk_ and _Brawl in Cell Block 99_, the fact that I enjoyed it so much left me wanting to have a shower afterwards. It's not Zahler's best, but it is his most complex, and his most socio-politically interesting (and whether he likes it or not, his films are going to be read through a political lens). Easily dismissible as a right-wing manifesto, a championing of a bigoted worldview in which white men backed into a corner must use violence to reassert their dominance, there is much more going on in the film than such binary politics would suggest. It's certainly more to the right than the vast majority of Hollywood output, and there is a case to be made that Zahler is positioning himself as a conservative ideologue railing against cookie-cutter Hollywood political correctness. That doesn't necessarily mean, however, that he's avowing a white supremacist doctrine, or that the film is a hate-filled, alt-right diatribe, a paean to intolerance. Instead, both in terms of content and style, there's a lot more going on, which is exactly what makes it so fascinating and so engaging. It's not a message movie; it's a Grindhouse B-movie character piece, with terrific dialogue, a trio of strong central performances, and a rising sense of dread that gets into your bones. Is it self-indulgent? To an extent, yes. Is it unapologetically incendiary? Absolutely. Will you find it offensive? Possibly. You may see it as shining a not unwelcome light on a culture of inherent racial intolerance in law enforcement. You may see it as commenting on a world where women are expected to be mothers and full-time workers. You may find it appallingly racist itself. You may shake your head at its endemic misogyny. You may refuse to engage with it at all because of Gibson's presence. And that ambiguity, more than anything else, speaks to its quality as a provocative work of art.", "created_at": "2019-08-28T23:36:21.759Z"}]