[{"movie_id": 1640, "review_id": "5f8557f3a1a9ba003645288a", "author_rating": 9.0, "review_text": "_**Provocative psychological drama**_\r\n\r\nPeoples of differing ethnicities and social-economic levels 'crash' into each other in Los Angeles over a day or so at Christmas time. These people include: \r\n\r\nA white cop who's angry over the downside of affirmative action and so abuses his authority (Matt Dillon); his young white partner who objects to the abuse and actively tries to counteract it (Ryan Phillipe); a black TV director who feels emasculated over the racism he experiences and ultimately blows up (Terrence Howard); his light-skinned wife who doesn't know when to shutteth up (Thandie Newton); an Hispanic locksmith (Michael Peña) and his young daughter with an ‘impenetrable invisible cloak’; a Persian shopkeeper who needs a scapegoat after his store is horribly vandalized, not to mention his daughter and wife; two black car thieves (Ludacris and Larenz Tate), the latter the younger brother of a detective, Graham (Don Cheadle); Graham's beautiful partner and girlfriend, Ria (Jennifer Esposito), and her mother, a maid to the District Attorney (Brendan Fraser) and his wife (Sandra Bullock); an Asian man who’s hospitalized and his frantic wife racing to see whether he's alive or dead. \r\n\r\n\"Crash\" is reminiscent of another L.A. drama, the 1991 masterpiece \"Grand Canyon,\" but has enough nuances to stand on its own. For one thing, \"Crash\" is even more serious and dark. \r\n\r\nThis is an involved story with several interwoven story lines; it ain't no mindless popcorn 'blockbuster.' A casual viewing won't cut it. It's not that kind of picture. Most of the negative criticisms about the film are by people who didn't watch closely and then lambaste it with criticisms that aren't even legitimate.\r\n\r\nFor one thing, the film is about more than racism; it's about stereotypes, hypocrites, abuse of power, the capacity for good or bad in every human soul, second chances, passive correction and shame, self-sacrifice, redemption, forgiveness, the last straw, manhood & emasculation, giving someone a break, true friendship, misunderstandings, favoritism and more. \r\n\r\n*** SPOILER ALERT *** \r\n\r\nNot every character is racist as some critics insist. Brendan Fraser's character never shows any racism and the only reason his wife (Bullock) blows up with racially-charged statements concerning the locksmith is because she just got robbed and shoved to the pavement at gunpoint by two young black guys. How would you or I react after such an experience? Also, the cop partner of Matt Dillon's character never displays racism in the truest sense; why else would he radically come to the defense of the director who has a fit or pick up a young black male hitchhiking? (What happens later is a misunderstanding not real racism). What about the detectives Graham & Ria and Ria's housemaid mother? (Yes, Graham makes one derogatory statement about Hispanics, but that's it; he's hardly racist). These are all main characters. \r\n\r\nThen there's the criticism that all the protagonists are \"essentially one-dimensional racial stereotypes.\" This is completely untrue. Graham and Ria (black and Latino) are successful detectives; Cameron is a successful black TV director; and the Hispanic locksmith is a family-oriented working man, not a criminal or gangbanger. Yes, there are some people who fit the stereotypes, like the two young black male thieves and the racist/abusive white cop, but one of the thieves becomes shamed for his lifestyle & hypocrisy and the racist cop is willing to risk his life for a woman of color, thus redeeming himself (from the guilt he felt over abusing his power the night before), besides his white partner is anything but a white racist who abuses his authority.\r\n\r\nOne critic criticized the film with this multiple-choice question: \"You are involved in a car accident on a busy street. The other driver is Asian. Do you: (a) Wait for the police to arrive and see if the other driver is okay; (b) Exchange insurance information with the other driver; (c) Scream and yell, \"damn chinks don't know how to drive!\" \r\n\r\n\"If you picked ‘c’ you'd love Crash.\" \r\n\r\nThis car-crash scenario DOES take place in the story, but he's leaving out some important details: A woman & man are rear-ended by an Asian lady. Why don't they call the cops? Because they ARE cops and there are other cops on the scene. Why does the lady detective talk back to the Asian woman? Because the latter is having a fit and throwing racial slurs at her. This is WHY she talks back to the Asian woman, not to mention she's a cop and therefore in a position of authority. Why does the Asian woman have a fit anyway? Because she's rushing to the hospital to see if her husband's alive. So, you see, the witty little multiple-choice question doesn't actually fit the reality of the film. \r\n\r\n*** END SPOILER *** \r\n\r\nAnother criticism is that the racism in the story is not subtle like it is in real life. Well, haven't you ever seen anyone blow up like in the movie? I have. In a city as big as L.A. how many such blow ups happen over any 36-hour period? \r\n\r\nThere's a lot of raw emotion and hard-to-watch scenes, but there are undeniable glimpses of love, hope, redemption and forgiveness as well. If you're in the mood for a well-made psychological drama with numerous insights to the human condition, don't miss out.\r\n\r\nThe film runs 1 hour, 54 minutes, and was shot in the Los Angeles area.\r\n\r\nGRADE: A", "created_at": "2020-10-13T07:32:03.893Z"}]