[{"movie_id": 181808, "review_id": "5a3d22cd0e0a264cbe2375e7", "author_rating": null, "review_text": "I got so high before going in to see \"The Last Jedi\" it's a wonder I figured out how to get into the theater. We started rocking the shatter bong hardcore, just pump it, pump it, till you can actually feel your brain melting, then hit that nail and do it again and again. At some point somebody asked the question \"where are we?\" and while I was reflecting philosophically on the matter, somebody else pointed out that we were parked in a lot by the cineplex and we slowly realized that we were here to see 'The Last Jedi'! I could barely function at all, so I went to my old go-to routine of donning dark glasses and a white cane to help disguise my complete stonification by pretending I was just some poor blind guy stumbling around and knocking things over. I usually do this to get past security at rock concerts and it never crossed my mind that a blind guy wouldn't be able to see a movie in the first place, but it worked anyway and soon enough we were in our seats. There were these fucking kids sitting right behind us and they kept kicking my seat like little retards, kicking, kicking, kicking.... so I took the lid off my extra-large Coke and just tossed it over my shoulder. Bingo! Direct hit! The little creeps shuffled off all pissed and whining, covered in sticky cola, us laughing at them, calling them losers, it was great! \r\n\r\nThen the movie started. The sound was awesome and everything but the screen was pretty freakin' dark I thought, could hardly make out anything. I started chanting \"Turn up the brightness! Turn up the brightness!\", expecting the rest of the audience to join in to my righteous chant of outrage, but then I realized I still had my Blind Guy Glasses on. Took 'em off and yup, cleared right up. There was some kind of big space battle going on so we took out our vape pens and started hoofing back lungfuls of sweet sweet shatter vapor. My girlfriend started texting me, bitching at me to pick her up some vag pads on the way home. WTF?? Get up off your fat ass and get 'em yourself I texted back. A barrage of bitchtexts followed, I was a jerk, I was an asshole and bla bla bla... I took a picture of my bare ass and sent it to her as a reply, fuckin bitch, anyway, apparently, this was considered 'indecent exposure' according to the usher-dork who wouldn't shut up about it so we had to leave the movie. We saw those stupid kids in the lobby as we were being escorted out, laughing at US, calling US 'losers'... I wanted to get back at them when they came out, even formed this elaborate plan where we would swoop down on them and soak them with freezing water this time, but we ended up just getting high again then went to Burger King.", "created_at": "2017-12-22T15:20:45.869Z"}, {"movie_id": 181808, "review_id": "5a43b0320e0a264f7704e83a", "author_rating": 10.0, "review_text": "My oldest son, as well as myself of course, wanted to watch this movie already before Christmas when it went up Geneva but it was pretty much sold out (unless you wanted to sit at the very edge of the theatre). I manage to book tickets for yesterday though so…here’s my ramblings about the movie.\n\nAs usual with these kind of movies, where there is a large following of fans, there is also many dissenting voices. Some people apparently are going as far as to want this movie to be undone. Well, my take on that is that these people need to grow up or let go or both. Luke is no longer a young farm boy running around saving the universe. The Star Wars universe and its characters are evolving and that is the way it should be and the way it is. Time for the next generation to pick up the torch.\nBoth me and my son really liked this movie. After the abysmal episodes I to III (Jar Jar Binks still haunts me in my dreams) I have really enjoyed the Star Wars movies.\n\nI quite liked The Force Awakens but it is true that it felt a bit like a rehash of A New Hope. Not only does this one not feel like it is reusing old material (too much) but it also feels like it is opening a new chapter in the Star Wars universe.\nThe FX is as good as you have the right to expect from a Star Wars movie. The story is fresh and well developed. It will not win any Oscars of course but I liked it. It makes things evolve while at the same time giving enough room for action and a wee bit of humor.\n\nThe characters are almost all good and well played. I am looking forward to seeing more of most of them, especially, Rey and Poe. I’m not 100% convinced about Finn and Rose but I can live with them.  Kylo Ren do not yet fill up the shoes of Darth Vader but he is showing promise. Contrary to Snoke I do feel he should put on a mask though.\n\nThe two characters I did not really like was General Hux and DJ. The first one was just incompetent. I’m not sure if he was supposed to be a bit of comical relief or not but, as far as I am concerned, we can do without him. DJ, well I guess he was supposed to not be liked so he did a good job of that but these kinds of assholes just frustrate me to no end. We never saw him actually meet his demise in this movie so if he is brought back I hope it will be for the sole purpose of rectifying that oversight…as violently and painfully as possible.\n\nOf course, we saw a few new ships as well and as usual with the Empire bigger is better…or maybe not. Not sure what to say about these new designs. At least they did not look like a enlarged (except for the bridge) Star Destroyer like Darth Vader’s Super Star Destroyer.\n\nOne thing that really bugged me in the first battle though was the rebels’ so called “bombers”. What kind of bloody moron designed those? They were just so wrong in so many ways. The design itself was just silly looking. They were slower than a flee on a patch of tar. Seriously, a space bomber that crawls along? Actually, why make a “bomber” in space at all? That brings us to the biggest gripe of them all with this ludicrous design…dropping bombs vertically? In space? How the fuck do they fall?\n\nSure they looked somewhat cool when they dropped their bombs…if your knowledge of physics is on the level of your average politician (and obviously a few Hollywood employees as well).\n\nAnyway, on the whole me and my son had two and a half hours of great fun watching The Last Jedi. I hope the next movie expands on the threads this one started. I have to say that I was a bit sorry about the feeble state of the resistance at the end, so I do hope the next writer will not let this drag on. One way to ruin Star Wars for me would be to turn Star Wars into some Battlestar Galactica variant with resistance survivors on constant run from the empire. Now it is time for the resistance to strike back, and for Rey to evolve her Jedi powers.", "created_at": "2017-12-27T14:37:38.066Z"}, {"movie_id": 181808, "review_id": "5a45ab9b0e0a264f39076887", "author_rating": 5.0, "review_text": "There is so much to love about _The Last Jedi_. I was very entertained watching this 8th _Star Wars_ saga film, I'll see it again, there's some truly beautiful scenes, all that jazz. But I am not fully on board with _The Last Jedi_. The film is a fun watch, and if you were to take it as a whole, then place it in a bubble, it's a pretty good movie too, but a lot about it is... Pointless. I'm not saying the movie was pointless, it has a lot to offer, and deserves its place as Episode VIII, but there are moments started within _The Last Jedi_ that end up being pointless by the time the credits roll, and more than that, it goes back to ideas from the _Star Wars_ saga as a whole, and makes them pointless too.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-12-29T02:42:35.660Z"}, {"movie_id": 181808, "review_id": "5a4934a89251415c8f0013cb", "author_rating": 2.0, "review_text": "Really disappointing. Our heroes of Star Wars have essentially wasted their lives and achieved nothing. \r\n\r\nWe were promised sequels and got a retread. I for one would have loved to see the building of the Galactic Republic against terrorists of the Imperial Remnant. Instead, we got Failure Luke, Failure Leah, gone nowhere Chewie and a rebel alliance that appeared to entirely fail to do anything meaningful after episode 6. \r\n\r\nI actually have less difficulty accepting 1,2 and 3 into canon then I do this pap. My headcanon has already decided, these movies do not count.", "created_at": "2017-12-31T19:04:08.047Z"}, {"movie_id": 181808, "review_id": "5a58d3870e0a2634ef00be10", "author_rating": 8.0, "review_text": "The Last Jedi started with a very tense emotion, capturing all viewers' attention tightly including mine (I've seen all movie episodes of Star Wars series so this type of scenario should look familiar to me).\r\n\r\nThis tense and epic feeling filled the entire film, so even it is a bit lengthy, people won't sleep over :) however, the scenes involving Rey and Luke on the isolated island planet look super quiet and mindful. It was similar to the scene in previous episode when Luke was seeking help from the Yoda Master. However, it felt more complex, because never had Yoda been described being evil, not a bit.\r\n\r\nOne tiny detail that I felt redundant and unconvincing was the reincarnation of Leia Princess. How did she fly back to the ship? As far as I can tell, no reason is given in the film. This lets you suspect whether she was going to be who can command the Force like a Jedi, but well all you can do is just suspecting.\r\n\r\nAnother critical option that I had to express was about the role of Kylo Ren. He is a complex character, and I am not sure that he believed in until the very end of the story. The climax of this complexity arrived at the scene when he killed Snoke and fought along with Rey, trying to persuading her to come for *a new world*. But this complexity simply came and disappeared. The story continued in the old way and our powerless always furious Ben Solo kept playing a simpleton role of any typical bad guy. The role is depicted as, adequately complex, but not consistent and lively enough (compared to the former Lord Darth Vader).", "created_at": "2018-01-12T15:26:00.004Z"}, {"movie_id": 181808, "review_id": "5a9595d30e0a262efb00036b", "author_rating": null, "review_text": "Star Wars: The Last Jedi – This Is Not The Film You’re Looking For\r\n\r\nStar Wars: The Force Awakens kicked off the Sequel Trilogy and many proclaimed the movie has returned Star Wars back to form. Though the plot of the movie is literally the same as A New Hope, The Force Awakens invoked mysticism of the characters and plot elements and raised numerous unanswered questions that would hopefully be answered in the next installment. Star Wars: The Last Jedi follows directly after the events of Star Wars: The Force Awakens and though the film attempts to hurl the Star Wars franchise into newer territory, the Last Jedi is a visually stunning spectacle that managed to undermine everything established in The Force Awakens and does great deal of disservice to our legacy characters. \r\n\r\nRey – Overpowered?\r\n\r\nOne of the biggest gripes I had with The Force Awakens was that Rey was insanely good at just about everything. She beat Kylo Ren, an experienced Force user, with no Force/lightsaber training, performed a Jedi mind trick with ease, flew the Millennium Falcon with little trouble, and managed to stop Kylo Ren from probing her mind. We were introduced to the mystery of Rey’s parents and her strength with the Force, neither of which are addressed in The Last Jedi. A relatively short passage of time occurs between films and Rey is even more overpowered than ever, receiving absolutely no training from Luke and she bests him (a Jedi Master!) in combat with no explanation as to how she is so strong with the Force. Luke in the Original Trilogy started off as a farm boy who has no knowledge of the Force until Obi-Wan teaches him about it. He received training by Yoda and failed miserably at combating Darth Vader, losing a hand and his lightsaber in the process. By the time of Return of the Jedi, Luke is established as being an experienced Force user who constructed a new lightsaber and is able to perform Jedi mind tricks. Rey, on the other hand, shows no signs of struggle and easily manages to lift boulders by the end of the film (Luke struggled to even concentrate and lift a small amount of rocks when training with Yoda). The film offers no attempt to address Rey’s Force strength and we’re left with having to accept she’s strong for no reason. Had there been a much longer passage of time between films, then it would be a bit more acceptable. However, her unanswered strength in the Force further solidifies the fact that she is overpowered. Rian Johnson has set her overpowered nature in stone and doesn’t leave much room for her character to grow and develop in Episode IX. All that we can expect for Episode IX is another showdown between Kylo Ren and Rey and it’s obvious that Rey will win.\r\n\r\nFinn & Rose – The Canto Bight Tales\r\n\r\nFinn was established in The Force Awakens as a former First Order Stormtrooper that became disillusioned with the First Order and decides to flee, getting as far away from the First Order as possible. Finn decides to stop running away when Rey gets captured by Kylo Ren, overcoming his fears and decides to take charge in rescuing her. He even directly battles Kylo Ren at the end, though he is easily defeated and severely injured. His character (and his arc) is tossed aside in The Last Jedi, delegated to being just a side character of no importance to the film’s plot. Finn is paired up with Rose (who’s just as bad as Jar Jar Binks) and go on a mission to Canto Bight to look for a master codebreaker to disable the First Order’s hyperspace tracker. The Canto Bight segment is easily the worst portion of the film that drives the pacing to a screeching halt, offers nothing of importance to the overall plot and results in no actual payoff. Finn and Rose conveniently find a hacker (DJ) when jailed for a parking ticket and manage to escape, freeing numerous abused horse-like animals in the process but leaving the slave children behind. When on board Snoke’s flagship, they are caught by the First Order and DJ reveals he tipped the First Order to save his own skin and for a monetary reward (So unexpected!). Finn battles with Captain Phasma, who is quickly discarded and they steal a transport to Crait. During the Battle of Crait, Finn is given a tremendous moment to shine as a hero when he decides to sacrifice himself by flying the vessel directly into the Death Star-like battering ram, but is pushed out of the way by Rose who delivers a cringe-worthy line of “saving what we love.” This moment will forever solidify Rose as the worst Star Wars character and steals Finn’s moment of glory. His sacrifice would have given Finn a solid character arc from a cowardly First Order deserter to being a heroic figure who gave his life to save others. Rose’s idiotic choice could have resulted in the First Order wiping out the Resistance and she will always be remembered as the character that managed to be worse than Jar Jar Binks.\r\n\r\nPoe v Holdo – Dawn of the SJW\r\n\r\nPoe Dameron is an exceptionally skilled pilot that planned a calculated attack on the First Order Dreadnought and though his plan to destroy the Dreadnought resulted in numerous Resistance casualties, Poe is successful at destroying the Dreadnought, but is immediately demoted by General Organa (Leia) and command is given to Vice Admiral Holdo (Purple Haired SJW). Poe knew the risks of war and deemed it necessary at the moment to destroy the Dreadnought and had he not acted on his gut instinct, the Resistance would have been completely obliterated. Instead, he is treated like he’s a bumbling idiot and Holdo refused to even notify Poe of the plan with the escape pods. It honestly feels as if this film has an SJW/Feminist agenda that strongly attempts to make the male characters (Poe, Hux, Kylo Ren, etc.) as nothing but idiots and elevates the women to a level of superiority. Politics will always have a place in the Star Wars franchise (the Prequels were built upon a politically driven foundation), but not in this shape or form. Even though Poe’s plan of destroying the Dreadnought was successful and allowed for the Resistance to escape, he is seen as unhinged and acting out of line by Holdo, never once acknowledging Poe for his heroic action of practically saving the Resistance. Poe is denied the opportunity of being the heroic figure, but it was perfectly acceptable for Holdo to sacrifice herself by flying the Resistance cruiser through Snoke’s ship. Holdo did nothing memorable to deserve a heroic sacrifice and it’s absolutely disgraceful that Poe’s character is painted as this unhinged, reckless pilot who is made out to be an idiot for his actions. Poe deserved a much better character progression in this film. As for Holdo, she was placed in this film for the sake of having a woman be in charge for no apparent reason other than to drive the fact that the man (Poe) is an “idiot” and the woman (Holdo) is the “superior, intelligent figure.”\r\n\r\nSnoke – In The End, It Doesn’t Matter\r\n\r\nSupreme Leader Snoke was set up to be the mastermind pulling the strings of the First Order and the next main villain after Palpatine. He is portrayed as a mysterious, disfigured individual who’s strong with the Force and swayed Ben Solo to the Dark Side. In The Last Jedi, he is seen dressed in golden robes in a red throne room and his royal Praetorian Guards protecting him. He displays a tremendous amount of strength in the Force by conjuring Force lighting directly into the ground and sending Kylo Ren flying back and suspending Rey in the air in an intensely painful Force grip. He even was able to merge the minds of Kylo Ren and Rey together across the galaxy using the Force. He was set up to be this figure who’s just as powerful and intimidating as Palpatine. But alas, Snoke is immediately discarded in the film and dies in a very unsatisfying manner. Who he is, where he came from and how he rose to power no longer matter: He’s just an extremely powerful and disfigured individual with no provided background information. Snoke decides it’s smart to place Luke’s lightsaber on the throne’s arm rest and continues to taunt and insult Kylo Ren with Rey on the floor. He orders Kylo Ren to kill Rey and gloats that he knows what Kylo Ren is thinking. However, Kylo Ren slowly moves Luke’s lightsaber towards Snoke with the Force (How Snoke or none of the Praetorian Guards notice is beyond comprehension). He then ignites the lightsaber, which impales Snoke and is then cut in half, the top half of his body tumbling to the floor. His death also puts the numerous fan theories to death. Snoke no longer matters. \r\n\r\nKylo Ren – Still Throwing Tantrums\r\n\r\nOne of the best aspects of the film is not Luke Skywalker: it’s Kylo Ren. Right off from the start, Kylo Ren is insulted and scolded by Snoke, which causes Kylo Ren to leave the throne room and smash his mask into pieces. Kylo Ren is still shown to struggle with the Dark Side and when the opportunity comes to blow up the command bridge Leia is on, he hesitates and decides against killing his own mother. Kylo Ren seemed to solidify his status as a villain in The Force Awakens when he killed Han Solo and in this film, he questions his own intentions and through his Force communication with Rey, the idea that Kylo Ren could be redeemed is brought into question. It’s a very interesting idea seeing Kylo Ren possibly turning back to the Light Side. The team-up between Rey and Kylo Ren was also another well-done idea that showed Rey realizing that she could possibly bring Kylo Ren back to the Light. Rey decides to see Kylo Ren in an attempt to turn him away from the Dark Side, then it’s revealed that Snoke manipulated the Force between them to lure Rey to him. After Kylo Ren kills Snoke with Luke’s lightsaber, Rey and Kylo Ren team up with each other and take on the Praetorian Guards in one of the greatest combat sequences in all of Star Wars. Kylo Ren is able to easily defeat many of the Praetorian Guards and when it seems that Kylo Ren will turn away from the Dark Side, he asks Rey to join him by his side. Disillusioned by the fact that Kylo Ren just wanted to overthrow Snoke and assume leadership of the First Order, Rey and Kylo Ren engage in battle and destroy Luke’s lightsaber in the process. The idea of establishing Kylo Ren as the main villain of the Sequel Trilogy is quite intriguing and allows for more room to develop Kylo Ren into the ultimate villain, though it came at the cost of killing off Snoke. Overall, Kylo Ren is a very solid character with a more defined vision of being the leader of the First Order.\r\n\r\nLeia Organa-Skywalker – I’m Mary Poppins, Y’all!\r\n\r\nSadly, this film marks Carrie Fisher’s final film appearance due to her death in late 2016. It was great to see more Leia in this film, though her role is largely downplayed and does not get a moment to shine like Luke and Han. Leia has been shown in past films to be Force-sensitive, but the way this film portrays her Force abilities is beyond terrible. After the command ship’s bridge is blown up, Leia gets sucked out into the vacuum of space and is assumed to be dead. However, she opens her eyes and is shown to have actually survived. She reaches out her hand and proceeds to literally fly towards the main Resistance cruiser that makes her Mary Poppins in space. We all knew Leia was Force-sensitive, but the way her Force abilities were portrayed was executed horribly. No one talks about or brings up Leia surviving while in space and Leia herself doesn’t even speak about it at all for the remainder of the film. She is hospitalized on the ship and command is then given not to Poe, but to Vice Admiral Purple Hair. Prior to her Mary Poppins moment, Leia berates Poe for his successful plan in destroying the Dreadnought and demotes him on the spot. Why is Leia so upset over Poe’s plan? Poe knew the risks in launching the attack and his plan resulted in the destruction of the Dreadnought and possibly killed thousands of First Order members. Leia and Holdo seemed to just team up on Poe, labeling him an idiot for launching a successful attack. Despite these issues, Leia should have been the one to fly the cruiser directly through Snoke’s flagship, it would have been the honorable way to send off Leia, allowing her to have a truly shining moment. Her Mary Poppins Force moment absolutely defies how the Force works. With the death of Carrie Fisher, her final performance as Leia ends on a quite dim note and she deserved a much better send-off.\r\n\r\nLuke Skywalker – This Isn’t The Jedi You’re Looking For\r\n\r\nAfter the cliffhanger of Rey handing Luke his blue lightsaber on Ahch-To, the fan base was eager with joy on what direction the story will go with the reveal of Luke Skywalker. Luke holds his original lightsaber and has a look of mixed emotions, then the unexpected happens: Luke throws the lightsaber over his shoulder and storms off. What should have been an epic moment in Star Wars history was turned into a moment for a cheap laugh. I take this scene as a metaphor for The Last Jedi: J.J. Abrams handing over The Force Awakens to Rian Johnson, who proceeds to throw out just about everything established in The Force Awakens for the sake of being “different” just because. Though I praise Mark Hamill’s epic performance as Luke Skywalker and honestly love Luke’s portrayal, the direction they placed for Luke was severely underwhelming. Luke reveals he traveled to Ahch-To for the sole purpose of wanting to die, which goes against what Han said about him seeking out the first Jedi Temple. So what was the point of the map in the previous film if he didn’t want to be found? Then in a flashback, he actually considered killing his own nephew at night by creepily sneaking into his hut and probing his mind, then discovers a lot of darkness and corruption by Snoke. So instead of confronting his nephew during the day, he considers killing him in his sleep? This is the same Luke that sensed the good in his father Darth Vader and personally went on a mission to bring his father back to the Light, of which he ultimately succeeds. Yet, because he probed Ben Solo’s mind and saw darkness, Luke deemed it necessary to just flat-out murder his nephew? This felt extremely out of character for Luke to even consider doing such a thing. This is also the same Luke that went out of his way to save the Rebellion, fought alongside the Rebellion, and played a major role in the Empire’s defeat. Then in this Sequel Trilogy, he gives up and lives in isolation after the massacre of his Jedi Academy, doesn’t seem to care at all about the rising threat of the First Order, and shuts himself off from the Force. Later in the movie, he has a change of heart and appears on Crait, walking directly towards the army of AT-M6s, AT-ATs, and AT-STs. He and Kylo Ren duel, though Luke doesn’t swing his lightsaber once and simply dodges all of Kylo Ren’s hits. Kylo Ren impales and slices Luke, but nothing happens and in a “twist”, Luke is revealed to be Force projecting himself and did not leave Ahch-To at all. He fades away from the battle, leaving behind a furious Kylo Ren. At the end of the film, Luke stumbles over on the rocks he was sitting on and looks out into the horizon, sees two suns (reminiscent of A New Hope) and dies, becoming one with the Force. Though I praise the idea of using a Force projection, it does a great disservice to Luke Skywalker’s character and undermines his character’s growth from the Original Trilogy. Luke should have physically appeared on Crait and demonstrated his vast strength in the Force by easily destroying the artillery and engaging in a fierce duel with Kylo Ren, but ultimately loses and is struck down by his nephew. That would have given tremendous emotional depth to Luke and be a showcase on how far along Luke has grown with the Force. \r\n\r\nOther Bad Moments In The Last Jedi\r\n\r\nLike all Star Wars films, The Last Jedi features a lot of flaws and some very questionable moments that don’t do this movie any justice:\r\n- Humor has a place in Star Wars, but not to the point of distorting the tone of the film, making it seem like a Marvel film (ex. Poe trolling Hux at the beginning of the film was cringe-worthy and feels out-of-place).\r\n- General Hux was honestly a sinister figure in The Force Awakens. He is turned into a complete incompetent fool in this film and is oblivious to the fact he’s being prank called by Poe. \r\n- Captain Phasma was again underutilized and despite putting up a strong fight against Finn, she is quickly killed off. What was the point of bringing back Phasma?\r\n- Canto Bight killed the pacing of the film and resulted in no beneficial pay-off to the movie’s overall plot. \r\n- Rose preaches about the rich being bad people for selling weapons to the First Order and feels the need to preach about the abuse the race animals face, yet offers no sympathy at all to the slave children.\r\n- The final scene featuring the young slave child using the Force to pull the broom gives the idea that anyone can use the Force with no training whatsoever. \r\n- Luke doesn’t seem to react at all when he learns of Han Solo’s death.\r\n- No Knights of Ren in this film, not even a mention or any clue as to their whereabouts.\r\n\r\nOther Great Moments In The Last Jedi\r\n\r\nDespite the numerous issues that plague this film, The Last Jedi features a lot of great moments that truly shine:\r\n- The opening scene and subsequent assault on the Dreadnought was very action-packed and felt like a true Star Wars film\r\n- The final battle on Crait, though highly reminiscent of the Battle of Hoth, was phenomenal and the idea of using a Death Star-like battering ram was well-executed. \r\n- Snoke’s throne room battle between the Praetorian Guards against Rey and Kylo Ren is honestly one of the greatest battles in all of Star Wars. It was well-choreographed, tense, and demonstrated how powerful a team Rey and Kylo Ren make.\r\n- Finn and Captain Phasma’s battle was spectacular and seeing Phasma deflect a blaster shot with her armor was amazing.\r\n- Rey and Kylo Ren’s Force communication added much needed development to both characters and added a layer of depth to their own motivations.\r\n- Luke’s interactions with Rey were well-done, especially when Rey literally reaches her hand out to the Force, Luke plays along and brushes a leaf against her hand.\r\n- Chewbacca feasting on a Porg and a group of Porgs look at him with fear in their eyes.\r\n- Luke seeing R2-D2 on board the Millennium Falcon and R2-D2 plays the original message by Leia.\r\n- Yoda’s appearance as a Force ghost and knocking some sense into Luke.\r\n- Holdo flying the Resistance cruiser through hyperspace at Snoke’s flagship, resulting in the destruction of numerous First Order ships.\r\n- Luke confronting the First Order on Crait, of which Kylo Ren orders them to fire at Luke with all their artillery. Luke walks out of the smoke undamaged and dusts his shoulder off.\r\n\r\nClosing Comments \r\n\r\nDespite the film having moments of greatness scattered throughout its runtime, The Last Jedi is heavy on flaws that are magnified as the film progresses. The film seems to take the quote “Let the past die, kill it if you have to” to heart and literally kills the history of what’s came before, especially The Force Awakens. Just about everything established in The Force Awakens is simply swept under the rug. The end of the film places the Resistance back to the same state the Rebellion was at in A New Hope. Why is this new trilogy just simply repeating the past? Though Rian Johnson is a fantastic director, he simply does not work for Star Wars and proves with The Last Jedi he has no understanding of how Star Wars works, especially with regards to the Force. The Force is treated more like a superpower that anyone can attain with no training required. The Last Jedi is far from being the worst Star Wars film, but is still far from being the best. J.J. Abrams is slated to return to the franchise to direct Episode IX and will attempt to fix the mess that Rian Johnson left behind with this new trilogy. Help us, J.J. Abrams. You’re our only hope.\r\n\r\nRating: 6/10", "created_at": "2018-02-27T17:30:59.778Z"}, {"movie_id": 181808, "review_id": "5ab85289925141395e025996", "author_rating": 4.0, "review_text": "Completely obliterates established Star Wars lore. \r\n\r\nThe writers of this film have no respect for Star Wars nor do they have an imaginative bone in their body. I felt like I was watching a shonen jump anime with the overuse of comic relief and usually placed in the most awkward moments. It was a desperate attempt to copy Marvel movie writers and failing miserably. The way they presented Luke Skywalker was an abomination and the story of the film was just plain boring and didn't make sense in so many places that listing it here would be so long that it would put you to sleep. I had to watch the film in 3 sittings it was so bad. Disney has now properly fucked Star Wars.", "created_at": "2018-03-26T01:53:13.221Z"}, {"movie_id": 181808, "review_id": "5ab8a28e925141395b02a32f", "author_rating": 1.0, "review_text": "The last jedi is clearly the last SW movie I`ll ever see. Everything was bad. Story, casting, acting, CGI, everything..  I just want my 2 hours back.. please..", "created_at": "2018-03-26T07:34:38.718Z"}, {"movie_id": 181808, "review_id": "5bf85e340e0a261ac208d94d", "author_rating": 7.0, "review_text": "\"Not the best but certainly the most overhyped\"\r\n\r\nAs the Rebellion tries to evade The First Order, Rey asks Luke Skywalker to teach her the ways of the Force. Meanwhile Kylo Ren is still a whiny POS.\r\n\r\nDirector/writer Rian Johnson faced a gargantuan task. Two years ago J.J. Abrams did the impossible by making a successful sequel to ‘Star Wars’. Johnson had to follow that up with something more creative because let’s be honest, ‘The Force Awakens’ (TFA) was a copy. He succeeds partially.\r\n\r\nWhen the movie started there were cheers. It doesn’t get any better than the iconic opening crawl with John Williams’ score. Although there’s a certain resemblance to ‘The Empire Strikes Back’ (opening scene, Luke on the remote planet) ‘The last Jedi’ isn’t a copy. Johnson has came up with a more or less original story with new characters and some twists.\r\nHowever, the problem with some of the new characters is that they get too much screen time while contributing nothing to the story. In some cases up to the point where they’re just plain annoying. Benicio Del Toro anyone? Meanwhile we find out nothing new about the characters we got to know in ‘TFA’. Rey, Finn & Dameron still feel new.\r\n\r\nThe villains are another problem. The most iconic part about ‘Star Wars’ has always been the villains. Darth Vader is an icon. Emperor Palpatine and Darth Maul were also quite impressive. Without spoiling anything I think it’s safe to say Kylo Ren (who’s still suffering from huge mommy and daddy issues), Supreme Leader Snoke & General Hux are terribly underwhelming.\r\n\r\nThat of course doesn’t mean it’s a bad movie. Although it runs too long it entertains. The effects and choreography are top notch and the overall look of the film is stunning. DOP Steve Yedlin does a fine job. The final battle looks amazing ( the red stripes on the salt plains). Although there’s a bit too much humor for our liking, there’s some genuine funny moments. The Porgs have a bright future ahead of them marketingwise.\r\nOf course there’s the nostalgia factor. It’s great to see those familiar faces again and the sound of lightsabres and TIE fighters are music to our ears.\r\n\r\nOn the other hand it’s obvious Johnson and Disney want to go down a new path. Whether that path is the right one remains to be seen. With the announcement of a new trilogy coming up it feels like they’re milking it. And you can take that literally. What’s up with that milk scene? Cringeworthy.\r\n\r\nThe biggest problem is that ‘The Last Jedi’ is incredibly hyped. There are reviews that say the movie is dark and that it’s the best since ‘The Empire Strikes Back’. I know opinions can differ but it doesn’t come close to any of the original trilogy.", "created_at": "2018-11-23T20:08:20.923Z"}, {"movie_id": 181808, "review_id": "5c15a5c8c3a36866cc370c2c", "author_rating": 1.0, "review_text": "This one killed the franchise!  I have been watching Star Wars movies since they started literally, going to the theater and enjoying the fun.  Love the original three.  Liked the prequels well enough.  I even enjoyed the cute little Ewok movies, with the kids.  \r\n\r\nThese later films have been a mixed bag.  Most were watchable enough, though not really the caliber of the old films  Sure, the effects are great, but a good movie needs more than special effects and cool alien makeup and some fun droids.\r\n\r\nThis movie was seriously disappointing.  Everything about familiar characters was changed, and the plot was so busy with pushing some weird agenda that it failed to deliver any of what we go to a Star Wars movie to see.  At this stage, I couldn't care less about the newer characters, and the whole \"Mary Sue\" aspect to the one main girl (see, I can't even recall her name!) is just annoying.  This film w bad enough that the dedicated SW fanboy in my household just quit watching, and actualy, for the first time ever, skipped the following movie entirely.  \r\n\r\nSo, congrats, Disney; you killed one of the most successful franchises ever.", "created_at": "2018-12-16T01:09:28.138Z"}, {"movie_id": 181808, "review_id": "5df9384c65686e00158a23de", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nFinally, I managed to watch one of my most anticipated movies of 2017! I am an authentic fanboy of the Star Wars saga and I loved its return two years ago when The Force Awakens was released. Everything looked better, sounded better and the story certainly didn't disappoint me. So, obviously, I was extremely looking forward to The Last Jedi.\r\n\r\nApparently, critics love Episode VIII but fans not so much. Me, well ... I don't LOVE it, but I do enjoy it very much. I do think it is a bit below the previous film's overall quality since it definitely has some issues the first one did not. I am also confident that I know why the fans are not loving this movie and I will explain that after a few paragraphs.\r\n\r\nThis time, I am going to start at the other side of the spectrum. I will begin my review with the film's problems because I do need to get them out of my mind, especially this one ... The subplot involving Finn (John Boyega), Rose (Kelly Marie Tran) and DJ (Benicio Del Toro), some of the few new characters added to the franchise, completely ruins the movie's pacing and its narrative is such a tremendous deviation from the main story. It is, by far, the worst issue I have with the screenplay because it does not work as one single problem ... It creates a whole other set of them.\r\n\r\nThe first act's pacing is really fast since it starts with tons of action sequences. However, the second act decreases the rhythm and it is more story-driven, full of mystery-unlocking and character-development scenes. Finn and Rose's nonsense adventure just turns everything slower and even strange. It ends up needlessly extending the runtime (the film could have easily been 15min shorter) and worse ... Possibly creating a love triangle with Rey (I am not even going to discuss this).\r\n\r\nApart from this major issue(s), I have some minor problems. General Hux (Domhnall Gleeson) is a strong candidate to become the most annoying character in this new-generation trilogy. Gleeson is fine, he actually achieves a good over-the-top performance, but his character is just tumbling off the rails. Also, on a more technical aspect, the writing does not flow as well as it did on J.J. Abrams' screenplay. There are a lot more exposition scenes which also does not help the pacing at all.\r\n\r\nI wrote earlier about the fans' reasons for them to be disappointed and well, the marketing for the movie did not lie: they do take a lot of chances with this one. Rian Johnson delivers a lot of twists and shocks throughout the whole runtime and it is impossible to assume that every single one of them is going to be mind-blowing and unanimously accepted. I do not want to give anything away from the plot, so I am just going to write that most of the choices and paths they choose for each character, I either simply accept them or I truly love them. As for the rest, I am, at most, underwhelmed (yet, I trust and understand the decisions they went with).\r\n\r\nPeople need to learn how to deal with their own expectations. If you expect something utterly absurd and nonsensical to occur and then it does not, you can't blame the film for not following your crazy idea. So, please, don't start blabbing any movie is bad or disappointing because it didn't fulfill your ridiculously high expectations. Even if they are grounded and thoughtful, you have to embrace the production's approach to the character/story. If it makes sense, then it is as valid as any other theory. It might be underwhelming if you have high expectations, but it is still a serious take on whatever you are thinking.\r\n\r\nThis is why I think fans are not loving The Last Jedi. The production takes a lot of risks and some of them don't work with everyone, mostly due to fans' radical theories that don't have a place in the film. I think most people might change their initial opinion after a second viewing, myself included. Some things just need more time to process or even a whole rewatch. Since I do not have time to do it before the year's end, I am going with what I have.\r\n\r\nSwitching to the light side (hehe), I do enjoy this movie a lot. Every cast member that was great in Episode VII, transcends themselves in this one. Daisy Ridley is superb as Rey. She has such a massive range of expressions and I am sure her successful future as an actress is surely guaranteed. From the most emotional and somber moments to the most epic action scenes, she is awesome. Her character's mysterious backstory reaches a whole new extent and her interactions with Kylo Ren (Adam Driver) and Luke Skywalker inflict chills all over my body.\r\n\r\nMark Hamill's comeback can't be any more amazing than it is. He delivers a fantastic, emotion-full and very compelling performance. It is even more unbelievable knowing that Hamill had strong personal arguments against the director's interpretation of what was better for Luke. If he is this astounding working against his own idea of who his character really is, then I must praise his exemplary working principles.\r\n\r\nLuke and Rey spend a big chunk of the runtime training on an unknown island and I love every single second filmed on that piece of land. I have to admit that I am a bit frustrated because I think the film should have more time with these two, but due to the issues mentioned in the beginning of my review, the runtime can't be much more stretched. I love what they did with Luke, even if some fans are going to go insane with his journey.\r\n\r\nAdam Driver as Kylo Ren ... The undoubtful star of the whole show. Driver is becoming a menace to every actor working today because he is flawless. He has a powerful, dark, mysterious, compelling and commanding display as one of the most complex and multi-layered characters of the Star Wars saga. Ren's conflict inside his mind and heart is the most captivating feature of his story and his interactions with Rey are so jaw-dropping spectacular that I can't even describe them properly.\r\n\r\nJohn Boyega is once again great as Finn, even though he is part of that horrible subplot. Boyega delivers a convincing performance and Finn shines through some awesome action set pieces. Kelly Marie Tran is actually good as Rose, it is just a pity that her character suffers from the narrative, even though her backstory is pretty touching. Chewbacca (Joonas Suotamo) and the Porgs, the new cute animals implemented in the Star Wars universe, have all the funny scenes plus some action here and there.\r\n\r\nOscar Isaac is quite lucky because Poe Dameron unquestionably has the best subplot of the movie. Isaac offers a very passionate display as Poe goes through some significant character development. His impulsive instincts to attack the bad guys always have consequences and he is put in check by Leia (Carrie Fisher) during the whole time. It is a very interesting and twistful story that elevates the film's main plot.\r\n\r\nCarrie Fisher is elegant and beautiful as Leia, a character that has a lot more screentime than what I expected. I always love seeing Fisher on the screen and she makes everything a bit more realistic to me. Andy Serkis is remarkable as Supreme Leader Snoke, but his character is yet another plot's detail that fans are not going to appreciate so much. I still feel underwhelmed by Snoke in this movie for several reasons, but after some thinking, I do understand his role in the film and his moments are indeed intimidating and dominant.\r\n\r\nRian Johnson work as the director is better than him as the writer. The visuals effects continue to be wonderful and the practical settings are beautiful, once again, there is a lot less CGI than you probably think. Excellent cinematography and the John Williams' score induces enormous levels of nostalgia and excitement. The action sequences are mind-blowing, the stunt work is phenomenal and there are tons of pure epic and awesome scenes.\r\n\r\nThe main plot includes a very dark and mysterious side to it that I thoroughly love. A lot of unexpected twists and turns make The Last Jedi more original than The Force Awakens, even if one or two plot points might be underwhelming, and it also has a very well balanced tone. Finally, a thrilling, breathtaking, action-heavy third act ends the film with magnificent glory and with many heartfelt moments.\r\n\r\nAll in all, Star Wars: The Last Jedi delivers something that I can be proud of experiencing. Terrific performances from the cast, but a flawlessly powerful display from Adam Driver as Kylo Ren steals the spotlight. Rian Johnson takes a lot of risks with decisions that will make the fanbase debate for years and while I find most of them truly jaw-dropping, a few left me underwhelmed. The main story keeps its obscure mystery while packing some jaw-dropping, epic action sequences and excellent character-development scenes. Nevertheless, it departs from JJ’s visual storytelling, delivering a more exposition-heavy screenplay and some pacing issues bring the movie down, largely due to the unnecessary detour of the subplot involving Finn and Rose. In the end, it still belongs to my top half of the saga, fighting for the 4th spot with Return Of The Jedi and Rogue One.\r\n\r\nRating: B+", "created_at": "2019-12-17T20:19:24.851Z"}, {"movie_id": 181808, "review_id": "601ca3a91108a8003fc4d46f", "author_rating": 9.0, "review_text": "Excellent, one of my favourites from the franchise so far.\r\n\r\n<em>'Star Wars: The Last Jedi'</em> makes for an exciting 152 minutes! Sure it probably could've been a little shorter, but at no point did I personally feel it drag. The cast give great performances, while the music and whole look of the film is extremely pleasant.\r\n\r\nDaisy Ridley and John Boyega do their thing and are enjoyable once again, Ridley particularly impressed me. I also like Adam Driver in this, while it's always pleasing to see Mark Hamill and Carrie Fisher involved. As for newcomers, Benicio del Toro and Kelly Marie Tran stand out.\r\n\r\nThere are also some incredible shots, the entire sequence at the end thrilled me - there's a particular part involving Laura Dern (even if her character, overall, isn't all that good) that looks utterly superb.\r\n\r\nAll in all, I felt very satisfied and very entertained after watching this. Quality film, in my eyes anyway.", "created_at": "2021-02-05T01:47:21.918Z"}, {"movie_id": 181808, "review_id": "60bae3c58d2f8d0079606d31", "author_rating": 1.0, "review_text": "Can't get much worse than this apparently the clown that directed this directed a good episode of Breaking Bad something tells me there was a lot of editing after they kicked this clown off the site because if this is his style he is plainly clueless about Star Wars mainly but also on how to tell a coherent story. The only good thing about this garbage was the visuals but that's it don't bother you will just get pissed off watching this mess in the end like the rest of the theater we were in have never seen so many people booing in a theater.", "created_at": "2021-06-05T02:39:01.753Z"}, {"movie_id": 181808, "review_id": "63c20b9117b5ef00a7fbad33", "author_rating": 1.0, "review_text": "Some of the praise, at least from the fans is because of the deviation from Star Wars tradition which, honestly, I have an issue with out the door. We are watching it because we want to see a Star Wars film.\r\n\r\nAnd the deviation from Star Wars tradition seems especially ridiculous given how hard it tries--like The Force Awakens--to rely on nostalgia to keep the fans that felt alienated when Rey turned out to be, well, absolutely flawless, absolutely loved and trusted by absolutely everyone, and faced no real challenges or struggles...\r\n\r\n...so, bank on nostalgia because giving the primary character a real literary struggle to add to a sense of character and plot is still seemingly out of the question.\r\n\r\nAnd that kind of seems like a troupe now days of characters that are diverse for the state of diversity. It seems like their creator and political fans feel that adding any struggle for said character to overcome would somehow take away from the political importance of the character.\r\n\r\nAnd that holds true for The Last Jedi. Rey still has no real struggles that can create even the slightest bit of dramatic tension for the audience. It is understood that she is the best and can easily overcome anything the story throws at her...and she does.\r\n\r\nAnd that is the reason her character is rejected by fans. It doesn't make for good cinema. Skywalker had the same issues in I-III, but at least it was understood that he was going to fail at the end of his story arc only to be redeemed in Luke's.\r\n\r\nRey is still so perfect there is no dramatic tension where she is involved.\r\n\r\nBut, don't let that be the only thing that kills it for you. Poe's initial radio play with the new faux Empire sets the entire movie up for one long eye roll. Those jokes seemed so out of place for science-fiction that it killed the movie from the start.\r\n\r\nBut then the bad humor of your lame aunt that only think's she's funny is also a new troupe for movies for movies like this.\r\n\r\nSo the films have to rely on nostalgia to market it to fans of the last two trilogies...and in this case it doesn't really work. The nostalgia is more along the lines of \"Remember when Luke Skywalker was a thing\" variety. The sort of nostalgia that references the old beloved franchise, without really understanding the dynamic of it.\r\n\r\nThey did the same \"Remember when this happened\" nostalgic ploy in The Force Awakens and, like then they didn't have the background and understanding to pull it off. Solo wasn't really the cynical untrusting scoundrel that made him so beloved. And in this one Luke isn't the whiny flawed but blindly moral hero that gets in over his head.\r\n\r\nThe result is a nostalgia that is just an empty reference. A nostalgia that has no real idea what it is referencing, or at least not one that runs any deeper than the surface.\r\n\r\nSo the jokes don't land. So hero doesn't struggle and... ...the film has no real drama because of the lack of struggle. So the nostalgia is only skin deep and... ...it results in a nostalgia that is more of an insult to the older fan base that it tries to appeal to.\r\n\r\nDisney didn't listen to the fans that complained about The Force Awakens. They were too busy calling them names for not loving the film. All the fans wanted was a story, that is all, they wanted a struggle, they wanted real drama. They wanted the characters they loved to be the characters they loved.\r\n\r\nWhat they got instead was a character easily walks into every situation and beats every adversity with ease still...despite that being the main complaint.\r\n\r\nWhat they got was old heroes acting like different people again.\r\n\r\nWhat they got was another bad movie.", "created_at": "2023-01-14T01:55:29.174Z"}]