[{"movie_id": 43074, "review_id": "57846b3792514121bd003696", "author_rating": null, "review_text": "\"While it falls short of nailing the anarchic spirit and character chemistry of Ivan Reitman’s beloved 1984 blockbuster, Feig and his cast of game comediennes deliver enough thrills and giggles to both justify the long-in-development franchise-starter and smother the internet’s white noise of negativity...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/7/12/ghostbusters.html", "created_at": "2016-07-12T03:59:51.631Z"}, {"movie_id": 43074, "review_id": "5789be5892514163c4000747", "author_rating": null, "review_text": "Filmmaker Paul Feig's **Ghostbusters** reboot pretty much followed the characteristic aspects of his previous films (\"Bridesmaids\", \"The Heat\", \"Spy\") all incorporating a self-awareness of female-oriented friendship and the estrogen-driven escapades rooted in inspired goofiness. So given this familiar foundation of Feig's big screen blueprint one would expect that his creative input into the continued Ghostbusters franchise for the millennium moviegoers would result in the heralded hype his film project is now enjoying at large. Sure, the feminine-charged **Ghostbusters** seemed like a radical concept and would obviously trigger the nostalgic sentiments (and comparisons) of the classic 80's comedy spearheaded by beloved on-screen paranormal hucksters Bill Murray, Dan Aykroyd, Harold Ramis and Ernie Hudson. Nevertheless, singer Ray Parker Jr.'s lyrical catchphrase \"Who you gonna call?\" within the Ghostbusters theme song needs to be addressed accordingly. The answer: the handlers behind the original **Ghostbusters** film that could uplift the disjointed high jinks and synthetic silliness of Feig's current comedic ghostly she-power schlockfest.\r\n\r\nIt is only natural that **Ghostbusters** had high expectations for Sony Pictures to perform well given the aggressive marketing tactics, early release of the Ghostbusters movie trailer (which was heavily panned online) and the aforementioned cinematic legacy of the original film's fanatical following and reputation. However, this third installation of **Ghostbusters** feels curiously flat and strained in its stillborn witticism. The creep factor borders on campy and cheesy (although this effectively worked for Ivan Reitman's 32-year old spook-ridden farce in the eighties) for which in today's cinematic circle is inexcusable due to the edgier and challenging special effects that could have played up the whimsy and wonderment of this breezy, bubble-gum colored romp with seemingly low-grade spark and sizzle.\r\n\r\nFeig's interpretation of the **Ghostbusters** universe could have been fresh and favorable especially with the colorful casting of his capable four female principals in the Emmy-winning and Oscar-nominated Melissa McCarthy along with Saturday Night Live personalities Kristen Wiig, Kate McKinnon and Leslie Jones. Unfortunately for these noted funny ladies they were saddled (or slimmed if you will) by a transparent script almost as invisible as the pesky ghosts they are trying to pacify. The recycled by-the-numbers hilarity and hysteria does not make this brand of ghost-busting quite distinguishing. Chemistry-wise, the Ghostbuster gals seem to revel in the collective merry-minded mischievousness and genuinely try to bring energy and outrageous antics to this flaccid frightfest. Still, the mixture of Ghostbusters' gooey gumption with a dash of egghead feisty femininity never seems to translate into anything beyond the tired gimmick of promoting another excuse to tap into yesteryear's profitable fun and frolic that made the wise-cracking Murray and his klutzy cohorts so amusing and welcomed in their rollicking ghostly gem from the Reagan-era.\r\n\r\nQuite frankly the notion that **Ghostbusters** is unfairly being knocked for its misogynistic overtones fueled by bias Internet-based fanboys not accepting that nerdy womanly scientists cannot fill the shoes of their revered male counterparts from the previous two predecessors is somewhat misleading. Sure, the decision to cast an all-female **Ghostbusters** team turned some curious heads but for the most part many thought this to be rather intriguing and experimental. The actual disdain can be pinpointed to the fact that Feig's flimsy boo-spewing fable is grounded in cliched and forced chuckles, weak-kneed jokes and gags, lazy writing and uninspired visual neon lighting techniques that look like a cheapened explosion from a vintage late 70's New York discotheque.\r\n\r\nUnfortunately, **Ghostbusters** wallows in mediocrity and fails to capture the acquired giddiness and imagination so pronounced in the prior entertaining installments. Even if the original actors in Murray, Aykroyd, the late Ramis and Hudson had decided to reprise their roles under Feig's problematic production the results would be the same--an aimless reboot without any definitive bite or backbone for a cobbled comedy that is slight and stretched thin to its toothless core. Amazingly, **Ghostbusters** cannot decide if it should remain faithful to its humble roots (it does help trivially that iconic Ghostbuster notables make scattered cameos--sans Rick Moranis--including that glorified scene-stealer in the Stay Puft Marshmallow Man as well as hot dog gulper Slimer) or venture off into something resembling its own goofy identity and distinction. Either way the third time around simply meanders in over-produced, noisy emptiness.\r\n\r\nThe so-called plot in **Ghostbusters** focuses on college professor Erin Gilbert (Wiig presumably in the Murray/Dr. Peter Venkman role) and her fascination with ghost activities that end up costing her an academic career in the process. Specifically, Erin's controversial book that she wrote along with co-author Abby Yates (McCarthy) served as the basis for her firing. Abby's obsession with ghosts still has her invested with this spirit phenomenon that she researches defiantly with her kooky associate Jillian Holtzman (McKinnon) in tow. Eventually, it would take the trio's status of joblessness (not to mention a run-in with a slim-spewing ghost that loves soaking humans with its sticky green goo) to collaborate on going into business as paranormal exterminators out to showcase their expertise in \"busting ghosts\".\r\n\r\nIn the meanwhile, there is something brewing in the twisted mind of supernatural-loving freak Rowan North (Neil Casey). After all, he is the lost soul responsible for unleashing the onslaught of riff-raffish apparitions upon New York City courtesy of his miserable, lonely existence. Now it is up to Erin, Abby and Jillian to eliminate Rowan's sinister agenda and eradicate the spooky pests that he has manipulated to cause the city-wide panic. As Internet sensational darlings, the Ghostbusters are committed to step up to the plate as the sassy saviors they were meant to be since going into the ghost-busting industry.\r\n\r\nThe later arrival of street-wise transit worker Patty Tolan (Jones) completes the Ghostbusters' quartet. Patty, whose run in with one of the slimy ghosts in the subway tunnel was pivotal to joining the three scientists, has something to offer the ghost-chasing brainiacs--a.) her knowledge of the city's whereabouts and b.) her funeral director uncle's hearse that serves as the official transportation for the Ghostbusters.\r\n\r\nOverall, the third outing regarding this toothless entry **Ghostbusters** notoriously lacks the robust impishness and rapport of the male character counterparts that were devilishly drawn together and cemented by Murray's droll humor. Here, the ladies come off as bland and indifferent--at least for the Paul McCartney and John Lennon of the team in Wiig's Erin Gilbert and McCarthy's Abby Yates. McKinnon's Jillian Holtzman is the only truly spry Ghostbuster who is credible as an off-kilter genius ditz with off-the-wall likability. Some may gravitate towards Jones's stereotypical brassy black chick with the brash quips and animated overreactions. Although Jones brings in the high-wire urbanized smirks in contrast to her quieter, geekier counterparts it is cringe-worthy watching her play an over-the-top, towering, mouthy cultural exaggeration that is woefully embarrassing for the sake of this dismissive. hedonistic hoot.\r\n\r\nIronically it is the hunky Chris Hemsworth that fares decently as the handsome himbo Kevin, the dim-witted **Ghostbusters'** male assistant that serves as the doltish eye candy for the cerebral lasses, particularly for the smitten Erin. Another SNL alum, Cecily Strong, checks in as the menacing mouthpiece from the Mayor's office that tries to discredit the popular ghost-busting technicians as \"sad, thrill-seeking women\".\r\n\r\nFeig, serving as both the film's director and co-screenwriter (along with \"The Heat\" scriber Katie Dippold) has no cohesive vision for the listless **Ghostbusters** and could have used some critical pointers in studying the proven anatomy of what made Reitman's nostalgic vehicle so engaging that still thrives after three decades since coming into the movie audience's consciousness. From the lame and limping laughs dipped in cartoonish crudeness (i.e. a male ghost gets a rousing jolt to his \"junk\" courtesy of his heroic ghost-busting detractors) to musical acts Fall Out Boy's/Missy Elliott's relentlessly unrecognizable, erratic and choppy remake of the aforementioned Parker's infectious **Ghostbusters'** theme song in this regurgitated comedy that has no excuse for catering to a lackluster rebirth while die hard and casual fans patiently waited for a festive follow-up from Murray and crew for thirty-plus years.\r\n\r\nTo randomly quote a classic **Ghostbusters'** lyrical line: \"I ain't afraid of no ghosts\". This may be the case but one should be very afraid of this heavy-handed banal boofest for wasting their time, anticipation and consideration.\r\n\r\n**Ghostbusters (2016)**\r\n\r\nSony Pictures\r\n\r\n1 hr. 44 mins.\r\n\r\nStarring: Melissa McCarthy, Kristen Wiig, Leslie Jones, Kate McKinnon, Chris Hemsworth, Neil Casey, Cecily Strong, Charles Dance, Michael Kenneth Williams, Matt Walsh, Ed Begley, Jr.\r\n\r\nDirected and Co-Written by: Paul Feig\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comedy/Supernatural/Science Fiction/Action and Adventure\r\n\r\nCritic's rating: ** stars (out of 4 stars)\r\n\r\n--Frank Ochieng (c) 2016", "created_at": "2016-07-16T04:55:52.129Z"}, {"movie_id": 43074, "review_id": "578a69c5c3a36866a800203f", "author_rating": 10.0, "review_text": "I was determined to see this movie on opening day. Female cast, Paul Feig (a Michiganian who included a Michigan line in the film), a couple fistfuls of ridiculousity on social media. When the movie started, I was one-eyeing the screen. Waiting for it. Oh oh. Fart joke. Oh oh. Kristen Wiig still can't make her eyes look interested. Then Charles Dance shows up with his serious comic tongue stuck in his cheek to admonish Prof. Gilbert that if she is serious about tenure, she needs to find a more prestigious university recommendation. \"More prestigious? Than Princeton?\" Now I know the deadpan eye comic genius of Wiig, too. From that point on, I was in love with the story. Katie Dippold cowrote the film. She has a bit part as the real estate agent showing the team the 1984 movie's fire station to rent. I want more of her screenwriting. The dialogue is witty, sharp, real. While I liked the 1984 Ghostbusters, it's a buddy movie. Dudes in the treehouse with no girls allowed spelled wrong nailed to the door. Smug, chirpy, guybonics. Venkman electrocuting rivals in the lab: using paranormal research to get dates. Annie Potts drooling over Spengler. Sigourney Weaver in a diaphanous dress, draped on a parapet waiting for the Gatekeeper. The sore spots in 1984 are sprayed away in 2016 without gender disrespect. Gilbert gets to drool over the pretty doofus administrative assistant. When you see this movie, watch all the credits. Chris Hemsworth is a clearly confident actor - he dives pelvis-first into the Kevin role, and it's hilarious. I'm still searching for the creator of the titles and end credits. Excellent art. The poster? Not so much. Hemsworth needs to be behind the four leads. Geez. Casting hit a lick with Kate McKinnon as Holzmann. She is fantastic bringing Harold Ramis' genius back to life. Leslie Jones as Patty: so good, and she has some of the juiciest lines, delivered with haute sass. There are really well-placed cameos by 1984's cast, including birthing one of the movie's best lines \"safety lights are for dudes.\" 2016 Ghostbusters is a great fun movie, and I'll watch it more than once again. One of the brilliant visuals that I was thrilled with - the stream from the proton packs tied up the ghosts. Wrapped, pinned, contained lassoed. Genius analogy for what to do with obsolete stereotype. There's a lassoed line in the film while the Ghostbusters are reading the internet reaction to their first catch. \"Ain't no bitches gonna catch no ghosts.\" Yeah. Watch this.", "created_at": "2016-07-16T17:07:17.612Z"}, {"movie_id": 43074, "review_id": "579a84729251414cd00015f5", "author_rating": 8.0, "review_text": "Unfortunately this has become because of political correctness and its backlash almost impossible to rate objectively. In the 2016 North American wish to either redo every successful film ever made and present every conceivable variant in the process, for what could be deemed the lack of any possible originality of ideas, I still tried to enter this with an open mind, and see this as if the two films from the 80's (which I enjoyed very much the one time I saw each of them) had never existed. I should state I saw this in 3D (which I hardly ever do), with my lady and our respective sons.\r\n\r\nI felt that it was quite funny and that the special effects were excellent. Next to 'Avatar', the use of 3D was the best I have ever seen. It's a popcorn flick well-worth seeing. Though I haven't seen any other movies by Feig or starring McCarthy, it made me want to go back and give them a shot at some time in the near future. There was something for everyone--both my lady and I enjoyed it very much--and the boys, three and thirteen years-old respectively, loved it as well. Give it a shot.", "created_at": "2016-07-28T22:17:22.890Z"}, {"movie_id": 43074, "review_id": "579d0343c3a3683870001101", "author_rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nThere’s an arbitrary sense of nostalgia that unfairly permeates audience perceptions of the new female-centric “Ghostbusters” reboot. I love the original 1984 film too; I wore out my VHS cassette when I was a kid and I’ve probably seen the movie dozens of times, including special theatrical re-releases and anniversary screenings. It’s almost as if all of this animosity is seen as a badge of honor for ‘serious movie fans.’\r\n\r\nAll of this badmouthing is truly unwarranted, especially if you actually go back and rewatch the original. Sure, the movie has comedy legend Bill Murray, the hilarious Rick Moranis, and memorable performances from Harold Ramis, Sigourney Weaver and Dan Aykroyd. It introduced us to the characters we all still love decades later, and made lines like “tell him about the Twinkie” a permanent part of movie nerd vocabulary. But to all the haters I say this: you are being very, very unfair. The 1980s era film has a lot of boring sequences and lags quite a bit, and as is the case with many movies, sometimes our nostalgia creates pretty thick rose colored glasses. We tend to only remember the good in our childhood favorites.\r\n\r\nPut aside your bias: the new “Ghostbusters” honors the legacy of the original, is a fun retelling of the classic story, and it does not disappoint. THIS MOVIE IS FUNNY! THIS MOVIE IS ACTUALLY GOOD!\r\n\r\nThere are a couple of minor hiccups along the way (as with most comedies, not every joke sticks, and the ghastly Missy Elliott / Fall Out Boy remake of the already awful Ray Parker Jr. song “Ghostbusters” makes an unwelcome appearance), but overall the movie is a success. At first it may feel weird to see women Ghostbusters but any skepticism will quickly fade (there’s a new generation of young girls who will undoubtedly be inspired by these characters).\r\n\r\nWhen estranged childhood friends and paranormal enthusiasts Erin (Kristen Wiig) and Abby (Melissa McCarthy) reunite, sparks are rekindled and they decide to get back to their ghost chasing roots. The smartypants duo is joined by weirdo nuclear engineer Holtzmann (Kate McKinnon) and subway worker Patty (Leslie Jones). When Manhattan starts to experience boatloads of specter activity, the friends get started on some good old fashioned poltergeist hunting.\r\n\r\nA big part of why this movie works is the comedic talent of these women; their chemistry is evident and they play well off each other, and the positive themes of loyalty and friendship never once feel fake. All of the actors are proficient at physical comedy and all have impeccable timing. This movie is very funny and the jokes had (and kept) me laughing from the beginning (there’s a particularly hilarious sequence at a heavy metal concert that’s worth the price of admission).\r\n\r\nRounding out the amusing performances is Chris Hemsworth as Kevin, a completely clueless stud muffin who is hired as the women’s receptionist solely based on his beefcake good looks. This feminist spin on the dumb secretary stereotype is exactly the type of lampoon I was hoping for here. In fact, the film doesn’t shy away from all of the lady haters either: there are lots of self-referential bits that directly address all of the critics (my favorite being Holtzmann’s ‘One of the Boys‘ t-shirt). Girl power!\r\n\r\nFans of the original will also appreciate several in-jokes and references, and there’s a long line of fun cameos (which I won’t spoil here: just keep your eyes open and be sure to stay through the end credits)! The special effects have been given a serious upgrade as well: these ghosts look real, feel real, and are appropriately scary-yet-funny. When the ladies first fired up their proton packs, I began cheering internally.\r\n\r\n“Ghostbusters” is exactly what a summer movie is supposed to be. It’s big in scope, it’s full of hearty laughs, it’s filled with terrific performances from all of the leads, it’s stuffed with stunning special effects, and it’s something the entire family can enjoy. All of you naysayers really need to lighten up because this is a really, really fun movie.\r\n\r\n**A SCREEN ZEALOTS REVIEW www.screenzealots.com**", "created_at": "2016-07-30T19:42:59.664Z"}, {"movie_id": 43074, "review_id": "580e45179251416e100018d5", "author_rating": 6.0, "review_text": "**The ghosts are real and the scientists are hunting them down!**\r\n\r\nFirst of all I am not a fan of the original film, but I enjoyed watching them. So I anticipated this film for the updates to deliver what I'm looking for, including some good jokes, but I found it an average film. I am very interested to have the women's version of hit the films and vice versa, but there are not many films in this category. All I wanted was 'The Expendables', but they made this one. I think it was a great idea, though the execution was really impressive.\r\n\r\nThe story was okay type, they kept it very simple. No big developments, except two main characters. But all the four women were good, along with Chris Hemsworth as a worthy sidekick. The director whose favourite casting actress, Melissa McCarthy's fourth film with him in four years and he did his job well, but the screenplay lets the film down.\r\n\r\nThere's no major comparison with the original, because this is a reboot and obviously has similar appeal from visual to comedies. Except they talk too much science thing because of todays advanced science. The disappointments are the ghosts, the film did not give preference for them to show their atrocities. I mean the perspective was always from the women gang who fights them. Definitely a one time watchable film, for its decent graphics, performances and some good comedies.\r\n\r\n_6/10_", "created_at": "2016-10-24T17:29:59.118Z"}, {"movie_id": 43074, "review_id": "580e4601c3a36859a40019a2", "author_rating": 6.0, "review_text": "**The ghosts are real and the scientists are hunting them down!**\r\n\r\nFirst of all I am not a fan of the original film, but I enjoyed watching them. So I anticipated this film for the updates to deliver what I'm looking for, including some good jokes, but I found it an average film. I am very interested to have the women's version of hit the films and vice versa, but there are not many films in this category. All I wanted was 'The Expendables', but they made this one. I think it was a great idea, though the execution was really impressive.\r\n\r\nThe story was okay type, they kept it very simple. No big developments, except two main characters. But all the four women were good, along with Chris Hemsworth as a worthy sidekick. The director whose favourite casting actress, Melissa McCarthy's fourth film with him in four years and he did his job well, but the screenplay lets the film down.\r\n\r\nThere's no major comparison with the original, because this is a reboot and obviously has similar appeal from visual to comedies. Except they talk too much science thing because of todays advanced science. The disappointments are the ghosts, the film did not give preference for them to show their atrocities. I mean the perspective was always from the women gang who fights them. Definitely a one time watchable film, for its decent graphics, performances and some good comedies.\r\n\r\n_6/10_", "created_at": "2016-10-24T17:33:53.082Z"}, {"movie_id": 43074, "review_id": "586641c99251412b8402c5a3", "author_rating": 2.0, "review_text": "This movie was a huge disappointment! The only positive thing I can say about it is that the special effects where not half bad. The movie itself was childish, unfunny, unintelligent and generally really bad.\r\n\r\nSome reviews giving this movie 9 or 10 stars (which is just ludicrous) are saying that people cannot handle the feminism in the movie. What feminism? Replacing the original actors with women is not feminism as far as I am concerned and anyway, if you care about such things should it not have been two women and two men to be politically correct? Also, the supposedly intelligent women in this movie behave in a typical old-fashioned Hollywood stereotype of women way. They are mostly downright silly. If I were a feminist I would actually have been insulted by this movie.\r\n\r\nThen we have the male clerk that is dummer than a piece of rock. If someone had stacked four supposedly intelligent men and a single blond bimbo that is totally devoid of any trace of intelligence together in a movie the social justice warriors would have cried foul so loud that you could hear it across the planet. But since it is four women and a stupid male it is okay (not really). It is even feminism according to some people. What a load of bollocks.\r\n\r\nThere is actually a story in the movie although it is well hidden under the silly jokes and silly behavior. It is paper thin and rather silly in itself but it could have worked if the rest of the movie was up to snuff but sadly it is not.\r\n\r\nAs I wrote above the only good thing about this movie is the special effects. The few scenes that I actually enjoyed was during the big shoot out at the end which had some cool moments. I especially liked when Jillian pulls a pair of pistols out of her Ghostbuster suit and goes on a ghost killing spray.\r\n\r\nApart from that this movie is best forgotten.", "created_at": "2016-12-30T11:15:21.142Z"}, {"movie_id": 43074, "review_id": "58a8fd0c9251410a16005984", "author_rating": 1.0, "review_text": "This movie is horrible. It plays like an overly long SNL sketch. The only saving grace is that this lost so much money that there will not be a sequel. Unfortunately for the fans, this means that the franchise is likely dead in the water for a long time.", "created_at": "2017-02-19T02:03:56.262Z"}, {"movie_id": 43074, "review_id": "58c8bc19c3a36875e8001902", "author_rating": 1.0, "review_text": "This movie is a disaster. The casting is way off. The special effects are mediocre. The story is merely a retread from the original... and they shoot the original logo in the crotch. There is nothing good about this production. What a waste of a perfectly good franchise.", "created_at": "2017-03-15T03:59:21.737Z"}, {"movie_id": 43074, "review_id": "58d2ac829251411faa000c49", "author_rating": 7.0, "review_text": "As a male nerd who grew up in the 1980's watching both original movies and the cartoon, running around with my toy proton pack and catching imaginary ghosts in my basement, I should be of the demographic complaining about how this ruins my childhood or that a cast of all women is just a stunt in the name of political correctness, or whatever their issue is. But the truth is, I REALLY enjoyed this movie. \r\n\r\nThe four female leads were absolutely hilarious--especially Kate McKinnon who steals every scene she is in. The other three characters have more growth, more of a story arc, and are more fleshed out as people in general. But McKinnon makes the most out of the available material and creates a very fun and memorable character.\r\n\r\nThe comedy of the 2016 version, while equally effective, is completely different from the dry humor of the original. The absence of Dan Aykroyd's and Harold Ramis's ludicrously funny lines delivered with a straight face, and the deadpan humor of Bill Murray has been switched out with a more over-the-top and in-your-face style of humor. It's not as subtle. Ghostbusters (1984) made me chuckle; Ghostbusters (2016) made me laugh out loud.\r\n\r\nWhile a lot of the original's comedy came from the ghosts themselves, i.e. that they're funny instead of legitimately scary, the new version reverses that. There is some very creepy imagery involving things like old timey parade balloons, ghosts pushing against mirrors, and other things that seemed inspired by American Horror Story. Plus, there were some good jump scares, boo moments, that actually caught me off guard. \r\n\r\nMuch like a guitar amp out of Spinal Tap, this film turns both the scares and the comedy up to 11 with great results. \r\n\r\nI haven't had this much fun at a movie in a long time. The trailer is NOT a valid way to judge this film. The trailer seemed to splice together all the ineffective moments and jokes of the film. But those were the exceptions and not the rule. The rule here is fun, entertainment, laughs, and the occasional scare. When the film works, it works remarkably.\r\n\r\nThe only real misstep was Chris Hemsworth's character. While the gender role reversal of the hot blonde ditz secretary was brilliant and long overdue in a mainstream summer movie, he was just too dumb to be believable. The character of Kevin belonged in a cartoon and not a legitimate movie. \r\n\r\nThe best line in the movie references Jaws and Annie Potts' cameo made me cheer. \r\n\r\nHowever...\r\n\r\nIf you've already decided you hate this movie without even seeing it, you probably won't like it. That's how these things usually work. But, if you have an open mind and are reserving judgement, I suggest you see it. You will be pleasantly surprised.", "created_at": "2017-03-22T16:55:30.218Z"}, {"movie_id": 43074, "review_id": "5d6253306dea3a00119538e8", "author_rating": 3.0, "review_text": "I didn't watch this for quite a while because I heard so many bad things about it. \"What do they know?\" I thought to myself. I figured _Ghostbusters_ had already had a bad sequel I sort of enjoyed, a bad remake should be sort of enjoyable too. Besides, you just **know** that so many of the complaints were exclusively because the cast had been of the dreaded ~~fEmaLe VeRsiOn~~ variety. But I just watched it, and... Oh man you guys, this really did suck. I'm devastated.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-08-25T09:21:52.582Z"}, {"movie_id": 43074, "review_id": "5f8d0e5517c4430037da71ee", "author_rating": 6.0, "review_text": "First things first, the following is worth noting: I have no attachment to the 1984 film, nor do I particularly like it; I rated it and its sequel 2½*. I'm not saying it's overrated or anything, I just personally don't enjoy it that's all.\r\n\r\nWith that said, I'd class 2016's <em>'Ghostbusters'</em> better than the original. However, as you tell by my rating, that's not me saying this is a good film. I don't believe it is. It's incredibly slow paced, with a very forgettable and untidy plot. It felt longer than a 116 minute run time, that's for sure.\r\n\r\nIt's not all bad, though. I actually rate the casting. Melissa McCarthy can be hit-and-miss, but this is one of her more solid performances. Kristen Wiig, great in <em>'Bridesmaids'</em> alongside McCarthy, is a decent performer too. Leslie Jones and Kate McKinnon are alright, while Chris Hemsworth is pretty amusing.\r\n\r\nI, despite not being a fan of it, still enjoyed the callbacks to the '84 film; as well as the use of the superb theme song. As for the special effects, they look good but none of the ghosts stick in my memory; both visually, but also in terms of the story. It would've been nice to have a standout ghost. Likewise with the film's villain, who is ridiculously plain.\r\n\r\nIn conclusion, it does positive things but there are certainly negatives. All in all, I think the latter just outweighs the former unfortunately. 3*.", "created_at": "2020-10-19T03:56:05.616Z"}]