[{"movie_id": 639933, "review_id": "625d3ba5229ae2321982ffcc", "author_rating": 7.0, "review_text": "First things first - there is virtually nothing original with the plot here. A young prince \"Amleth\" (Oscar Novak who later morphs into an effective Alexander Skarsgård) witnesses the murder of his father \"King Aurvandil\" (Ethan Hawke) and the capture of his mother \"Gudrún\" (Nicole Kidman) by his treacherous uncle \"Fjölnir\" (Claes Bang). Lucky to escape with his life, he escapes to the land of the Rus where he is soon a capable and powerful warrior. When he learns that the traitor was, himself, deposed and now lives in the inhospitable Iceland, he decides to impersonate one of a group of slaves being sent to his farm so as to wreak his revenge. There are a few twists to the otherwise largely predictable plot - he meets the enigmatic \"Olga\" (Anya Taylor-Joy) and comes into possession of a deadly sword that can only be drawn at night; but what really makes this stand out is the gritty, dark and enthralling production. The headlines actors actually feature pretty sparingly, though we get a little more Kidman towards the end, and that's no bad thing. It leaves us to enjoy a storyline that draws heavily on the compelling Norse mythology. Not just of Odin, Freya, Valhallah and the like, but of the whole cult of nature; of animalistic behaviour amongst man and beast alike. It draws on a symbiotic relationship with the environment that tests the faith of pagan and Christian alike. It is brutal, but somehow not gratuitous. That's how man treated man; women were little better than breeding chattels and children were even further down the food chain. Robert Eggers has put much more meat on the bones than almost any similar depiction from this hugely rich and enthralling vein of mythology that mixes fact, fiction, fantasy, mysticism and fear very well. It's 2¼ of well paced adventure that looks stunning on a big screen and is well worth a watch there before it loses much of it's grand scale potency on a telly.", "created_at": "2022-04-18T10:21:25.684Z"}, {"movie_id": 639933, "review_id": "626980231f98d100664653ea", "author_rating": 9.0, "review_text": "It took me a little while to get into it, but by its conclusion <em>'The Northman'</em> had fully entertained me. Great film!\r\n\r\nFirst and foremost, I'm delighted that I did indeed enjoy this film as my only previous experience of director Robert Eggers was the - in my opinion, and apparently my opinion only! - severely unsatisfying <em>'<a href=\"https://letterboxd.com/film/the-lighthouse-2019/\" rel=\"nofollow\">The Lighthouse</a>'</em>. It's unmistakable that this 2022 flick is made by the same person, but happily the outcome is far greater.\r\n\r\nThe cast are top notch. Alexander Skarsgård and Anya Taylor-Joy are the two standouts, the latter of which is doing big things lately; she is excellent in the most recent season of television show <em>'Peaky Blinders'</em>, fwiw. Claes Bang, Ethan Hawke and Nicole Kidman are all very good. Willem Dafoe too, naturally.\r\n\r\nThe story is super absorbing, even early on when I was a tad unsure I was still very invested in what was happening onscreen. The dialogue is a big reason for that, as is the thumping score. At times it can feel like it might become too talky and full of itself in regards to its own mythology and all that, though thankfully it never strays into those realms. It also delivers plenty of action, alongside some good ol' violence as well - the ending is quality in that regard, among other reasons too.\r\n\r\nGo watch!", "created_at": "2022-04-27T17:40:51.300Z"}, {"movie_id": 639933, "review_id": "626ca99d2ac499004fe1138a", "author_rating": 8.0, "review_text": "_The Northman_ is a bloody and ferocious battle cry of a revenge film. The action is brutal and the performances are extraordinary. This is Robert Eggers at his most savage and masterful.\r\n\r\nFull review: https://boundingintocomics.com/2022/04/25/the-northman-review-a-gory-viking-epic-forged-in-boisterous-greatness/", "created_at": "2022-04-30T03:14:37.865Z"}, {"movie_id": 639933, "review_id": "628b40189a64350065ac8b37", "author_rating": 3.0, "review_text": "I was expecting more from this movie, but it turned out to be a big disappointment.\r\n\r\nFirst of all Vikings in this movie were represented more like an animals, acting like a rabid animals rather than humans and Vikings we have seen in popular TV shows, but the reason why I'm giving such a low score to this movie is simple - boredom. \r\n\r\nCharacter development was poor. I didn't care for any of them. Story was a typical vengeance story, nothing special or unique and the movie itself was very slow, lacking action and I almost fell a sleep. At first it seemed a realistic movie, but then they started putting supernatural things, so it wasn't realistic, but wasn't a typical unrealistic movie (like Marvel and DC) either. It was just a poor attempt of mixed jumble. It's sad to see such a great actors wasted in this boring movie, but even they couldn't save it if script was so poorly written and executed.", "created_at": "2022-05-23T08:04:40.589Z"}, {"movie_id": 639933, "review_id": "6292471a209f1812c4b0cd35", "author_rating": 1.0, "review_text": "It's was a terrible movie", "created_at": "2022-05-28T16:00:26.400Z"}, {"movie_id": 639933, "review_id": "62abc1718805510092b025ef", "author_rating": 6.0, "review_text": "Visually arresting with great sound design and respectable production design has its moments (many downright bizarre), the film also features good performances from Alexander Skarsgard and Anya Taylor-Joy, however I wasn't fully immersed with the story but that has more to do with having little interest in Viking-centric stories. That said, it's worth one watch at least. **3.0/5**", "created_at": "2022-06-16T23:49:05.390Z"}, {"movie_id": 639933, "review_id": "62c36796c525c4004b876c2c", "author_rating": 9.0, "review_text": "**Full analysis at Spotamovie.com** - **Intro** - The Northman is one of the best movies of 2022. It’s a masterpiece of photography and cinematography. And probably it’s the closest film about the Vikings era and culture. Is it perfect? Almost. But we will tell you more in our analysis. - **The Story** - In the North Atlantic of the 895 a.d., a story of betrayals and revenge happened. The protagonist is a little prince, Amleth, who will live his existence in the shadow of vengeance. His life's goal is to fulfil his desire to take back what someone else stole from him: a father, a mother and a kingdom. But, unfortunately, pain and revenge can transform a boy into a brutal wolve. Therefore, Amleth begins his journey, guided by Odin, because justice is what moves our God's desires. But what happened to Amleth? Where is this journey lead him? And what are we going to take back with us after this incredible adventure? - **FULL ANALYSIS AT https://www.spotamovie.com/the-northman-review-and-explanation-movie-2022/**", "created_at": "2022-07-04T22:20:06.940Z"}, {"movie_id": 639933, "review_id": "62dbe3d6c439c00069b217c5", "author_rating": 1.0, "review_text": "One of the worst movies I've ever seen this year. A pretty dumb story that full of random illogical moments and nothing more.", "created_at": "2022-07-23T12:04:38.464Z"}, {"movie_id": 639933, "review_id": "62fd26d275110d0081bea262", "author_rating": 9.0, "review_text": "Even though the story is very bare bones, Robert Eggers brings in fantastic visuals with great details that it is still a joy to watch. There are so many interesting shots that leave the viewer questioning what reality is. Although that can lead to a bit of confusion, I was still able to keep up with the ideas presented. The acting in this film was amazing all around. I really enjoyed Nicole Kidman and Alexander Skarsgård performances. The romantic relationship between Alexander Skarsgård and Anya Taylor-Joy did feel a little half baked and underdeveloped though. The action in this movie is few and far between, but when it does peak its head out it in brutal and visceral leaving audiences gasping at the bloody details and gore. The action was done really well, with not many cuts and incredible choreography. Overall, this film was really great and I wish I would have watched it in the theaters.\r\n\r\n**Score:** _87%_\r\n**Verdict:** _Excellent_", "created_at": "2022-08-17T17:35:14.048Z"}, {"movie_id": 639933, "review_id": "63001bd53e6f2b007a9d7039", "author_rating": 3.0, "review_text": "**So so so so bad. Spare yourself.**\r\n\r\n“I feel like I’m taking crazy pills!” I keep reading all these reviews that claim this movie is gruesomely violent, action-packed, and well-paced. Did we see the same movie? This movie was the furthest from those three things! The Northam is dreadfully slow, with hardly anything happening, and when the few action scenes did happen, they were very poorly done! The only cool part was him catching and throwing back the spear, and I saw that in the trailer. I will say that the visuals and atmosphere of the movie were super well done, but that was it. Do not waste your time!", "created_at": "2022-08-19T23:25:09.273Z"}, {"movie_id": 639933, "review_id": "6352870ba843c1007d882d22", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"The Northman boasts a brutal score worthy of the biggest blockbusters, tremendously elevating a revenge journey filled with Norse mythology and impressive one-take sequences. The typical heavy slow-burn that will bore many audiences hoping for an action extravaganza - it's indeed too long and uneventful - but it remains a must-see of 2022.\r\n\r\nA strong contender for best cinematography (Jarin Blaschke) of the year. Robert Eggers remains on the right path to becoming a renowned filmmaker. Alexander Skarsgård completely transforms himself into one of the best roles of his career.\r\n\r\nHighly recommended!\"\r\n\r\nRating: B+", "created_at": "2022-10-21T11:48:27.039Z"}, {"movie_id": 639933, "review_id": "641ed47ad6dbba00d708cab9", "author_rating": 7.0, "review_text": "It is a movie based on a Scandinavian legend called Amleth, and it was a major source of inspiration for Shakespeare the day he wrote the story of Hamlet. The movie tells the story of a young Viking prince who seeks revenge for his father's murder.\r\n\r\nNorthman's movie is one of the most beautiful and best movies I've seen in 2022. This movie is amazing in the full sense of the word, despite the negative opinions about the movie.\r\n\r\nThe atmosphere of the film and the way the story was presented was interesting. I enjoyed the stages of revenge that Prince Amleth did. I immersed myself in the world of The Northman from the first 10 minutes and forgot myself due to my vision of a brutal, miserable, cruel, barbaric and cold world, in addition to a strange mixture between realism, fantasy and hallucinations.\r\n\r\nThe nice stuff about the movie is the mention of Norse mythology from Northsimology. If you want these characters, they are in the game The Lord of War.\r\n\r\nDirector Robert Eggers, when he directs any movie, you find his touch and personality in the films he directs, such as The Witch 2015 and The Night House 2019. Robert paid great attention to details, and he wrote the characters beautifully and the dialogues that he writes in his films in a literary form, forming a rich dialogue, but at the same time You find it interesting.\r\n\r\n\r\nThe combat scenes were wonderful and were directed beautifully. I have seen many long scenes, scenes that you see as very violent and bloody, and these scenes are difficult for the director to produce in a manner that calls for perfection, given that they require replaying dozens of times. The director knew how to attract the viewers' attention to the furthest limits.\r\n\r\nThe acting of Alexander Skarsgård was excellent. I felt his psychological suffering, in addition to Anna Taylor. She is ingenious and is good at playing any role. If you ask her, if you give her to act as a standing tree, she will do it very well.", "created_at": "2023-03-25T11:01:14.427Z"}]