[{"movie_id": 558, "review_id": "54afa069c3a3682e40001674", "author_rating": 8.5, "review_text": "**Superheroes Anonymous**\r\n\r\nTragically I am a Batman. An obsessive Caped Crusader comic-book collector until 1972 when my evil mother tossed the entire bunch in the garbage. My cousin was Spider-man. His noble mother preserved his collection with plastic envelopes and to this day they remain in pristine condition. \r\n\r\nWhat's truly tragic about being a Batman is that, despite Nolan's recent attempts (and questionable sincerity), the best Batman movie hasn't been made yet. As far as we know, with Batman's fate resting with Warner Bros, David Goyer, Zak Snider and Ben Affleck, the best Batman movie will not be possible for another decade or two, maybe three. I await thee Dark Knight.\r\n\r\nAgain to my cousin's good fortune, the best movie about Spider-man has been established for quite some time. In fact, as a benchmark, it is arguably the best comic-book super-hero movie ever made. I didn't much love Sam Raimi's first Spider-man, and wished my mother could have disposed of his last entry, but _Spider-Man 2_ was, and is, the ultimate movie adaptation from comic-books to the movie screen. \r\n\r\nI was living in Shanghai in the summer of 2004 where I had to commute 3 hours on a hot and dizzy day to see it in English, and was fully rewarded for the effort. I was thrust into a imaginary super-hero world far more pleasing than anything I could remember since childhood. The 3 hour commute back home seemed like a breeze because Spider-man 2 awoke the wonder-struck boy inside me. It reminded me of a happy youth I forgot I had. It felt like Spidey was on the subway with me and would protect me from any harm. And he was just a boy himself! Batman? Who's that?\r\n\r\nFor a super-hero story, nearly everything is perfect in this movie. Doc Ock couldn't have been better. He looked exactly the way he did, at the height of Stan Lee's eminence, in the brightly coloured panels fighting Spider-man in 1968. And sounded just like I imagined he would. Peter and Mary Jane were in their element and their friendship and romantic undertaking actually mattered. The story and action played out the way a comic book should. It was both intimate and fantastic. Trippy, wonderful and scary. It was like growing up all over again. The climax was a bit too flashy, loud and over-the-top at that time, but by today's standards, when compared to climactic train-wrecks in _Man of Steel_, _Iron Man 3_ and _The Avengers_, it's perfectly splendid.\r\n\r\nWe are now being helplessly bombarded with comic book movies attacking us from every direction, all of them trying to out-do each other, jumping one shark after another. Every marginal superhero from Dr Strange to Shazam is being dusted off and hurled onto the big screen for our insatiable happy-childhood-appeasing appetite. The Marvel of Disney is launching at us one theme-park roller-coaster ride after another. Sony, with their Amazing Spider-man abominations, has completely lost it. Fox's X-Men and Fantastic Four proliferations hit the wall long ago. And DC, under the reigns of Warner Bros, has transfigured into its own worst enemy. A wretched mutation not even the Joker finds amusing.\r\n\r\nTurns out Sam Raimi's _Spider-Man 2_ is the gold standard by which all comic-book movies, certainly those of the super-hero variety, are and, evidently, will be set. Lucky cousin.", "created_at": "2015-01-09T09:33:29.092Z"}, {"movie_id": 558, "review_id": "5c8429660e0a26430562cce2", "author_rating": 8.0, "review_text": "I don't think anyone can review this movie better than what Roger Ebert said about it back in 2004: \"It's a real movie, full-blooded and smart, with qualities even for those who have no idea who Stan Lee is. It's a superhero movie for people who don't go to superhero movies, and for those who do, it's the one they've been yearning for.\"\r\n\r\nI also don't think any film has so eloquently defined a hero the way Aunt May does in a wonderfully heartfelt and poignant scene half way through the film.\r\n\r\nI do think the villain of Doctor Octopus is underdeveloped in both logic and motivation (although Alfred Molina is great), Mary Jane Watson is too dependent on the men in her life, and the friendship arc between Peter and Harry is a bit contrived, but none of these flaws affect what is otherwise a beautifully constructed film and a worthy sequel to the original.", "created_at": "2019-03-09T21:00:22.030Z"}, {"movie_id": 558, "review_id": "5dc330b89d893900183427f4", "author_rating": null, "review_text": "Sony did a great job of focusing on what really matters in this movie - the character. Here we see a relatable Peter Parker who can't seem to catch a break and when he does it just feels so satisfying to watch him rise up from all the challenges he faced.", "created_at": "2019-11-06T20:44:40.492Z"}, {"movie_id": 558, "review_id": "5dc38a728d22fc00143d1eb2", "author_rating": null, "review_text": "It was amazing to see what they did to Harry's character. He went from being Peter's best friend to mortal enemy. I can't blame him though cause what do you expect would happen if you found out your best friend was the one who killed your father?", "created_at": "2019-11-07T03:07:30.472Z"}, {"movie_id": 558, "review_id": "5dc393b77d2bc100113c8ed1", "author_rating": null, "review_text": "Is it me or does MJ get more and more annoying with every film? Still a 10/10 film for me because I'm not here for her, I'm here for my boy, Peter Parker!", "created_at": "2019-11-07T03:47:03.135Z"}, {"movie_id": 558, "review_id": "5dc56f667d2bc1001740b1b3", "author_rating": null, "review_text": "To me, it felt like what Uncle Ben imparted to Peter in the first film - with great power comes great responsibility - was the very essence of this film. He had too much power, too much responsibility, and he needed to find a way to balance all of that.", "created_at": "2019-11-08T13:36:38.552Z"}, {"movie_id": 558, "review_id": "5dc57a4d6f8d950013c2f477", "author_rating": null, "review_text": "You're not a real Spider-Man fan if you haven't watched this.", "created_at": "2019-11-08T14:23:09.200Z"}, {"movie_id": 558, "review_id": "5e00ef25d236e60016918cfc", "author_rating": null, "review_text": "I was completely blown away! The 11-year-old in me definitely connected with this film on another level and made me remember just how much I loved superheroes.", "created_at": "2019-12-23T16:45:25.265Z"}, {"movie_id": 558, "review_id": "5e011b9175110d0011d89295", "author_rating": null, "review_text": "Big shoutout to Tobey Maguire for giving so much life and soul to Peter Parker. I can't imagine anyone else doing so well like he did.", "created_at": "2019-12-23T19:54:57.363Z"}, {"movie_id": 558, "review_id": "5e028690c5840d0015093f3e", "author_rating": null, "review_text": "You can definitely feel the effort that the studio put into every scene in the movie.", "created_at": "2019-12-24T21:43:44.438Z"}, {"movie_id": 558, "review_id": "5e0923de2fccee00105da017", "author_rating": null, "review_text": "Tobey Maguire did a great job making Peter Parker a young man that you would feel for, wince with, and watch slowly as he turns from this young boy into a man.", "created_at": "2019-12-29T22:08:30.976Z"}, {"movie_id": 558, "review_id": "5e09c241d35dea00162112d8", "author_rating": null, "review_text": "This is one of the OG films that paved the way for the superhero films of today. I can't express how thankful I am for Tobey Maguire for being the pioneer!", "created_at": "2019-12-30T09:24:17.469Z"}, {"movie_id": 558, "review_id": "5e0e0cc56dc6c000184cff71", "author_rating": null, "review_text": "Definitely a fan's dream-come-true! Studios of today should take notes from films like this if they want to produce a successful superhero film.", "created_at": "2020-01-02T15:31:17.662Z"}, {"movie_id": 558, "review_id": "5e0e16dd6dc6c000134d2120", "author_rating": null, "review_text": "Here in this movie, we see more of the human side of Spider-Man and saw how this boy turned into a man trying his best to fulfill his responsibilities being a human and superhero at the same time.", "created_at": "2020-01-02T16:14:21.022Z"}, {"movie_id": 558, "review_id": "5e0e210c6dc6c000154cce74", "author_rating": null, "review_text": "I thoroughly enjoyed it and I think it's one of the most engrossing superhero movies there is.", "created_at": "2020-01-02T16:57:48.857Z"}, {"movie_id": 558, "review_id": "5e0e2b9668b1ea00137fc7b1", "author_rating": null, "review_text": "I really, really appreciate that they highlight character development and storyline more than the fight scenes.", "created_at": "2020-01-02T17:42:46.232Z"}, {"movie_id": 558, "review_id": "5e0e47cec2f44b0011305e99", "author_rating": null, "review_text": "A surprisingly outstanding sequel to the first Spider-Man film.", "created_at": "2020-01-02T19:43:10.557Z"}, {"movie_id": 558, "review_id": "5e0e53069974ee0015a6c692", "author_rating": null, "review_text": "All the action, comedy, and drama had such a delicate balance. It's pretty amazing to see such a precise blend of these emotions in a superhero film.", "created_at": "2020-01-02T20:31:02.617Z"}, {"movie_id": 558, "review_id": "5e0f0ce26818880012594d53", "author_rating": null, "review_text": "If you ask me, this is leaps and bounds better than the Superhero films - even the Batman films. Spider-Man is that person anyone can relate to. He has such a big human side to him that it's hard not to resonate with him.", "created_at": "2020-01-03T09:44:02.186Z"}, {"movie_id": 558, "review_id": "5e0f409658361b0015bfd5a5", "author_rating": null, "review_text": "Wanna see what a flawless film looks like? Go see this one now!", "created_at": "2020-01-03T13:24:38.466Z"}, {"movie_id": 558, "review_id": "5e107dd85907de0012da5c19", "author_rating": null, "review_text": "More than just a comic book hero, Spider Man is a person with human problems, responsibilities, and the same human struggles each of us go through. This is exactly the reason why a lot of people like him so much.", "created_at": "2020-01-04T11:58:16.998Z"}, {"movie_id": 558, "review_id": "5e1219d9d8af670014bcdb03", "author_rating": null, "review_text": "Sequels usually have this thing where they end up being total garbage compared to the first, but surprisingly, Spider Man 2 was on point. Same quality, same amazing plot, and same award-winning performance by Tobey Maguire.", "created_at": "2020-01-05T17:16:09.078Z"}, {"movie_id": 558, "review_id": "5e124c17fc5f0600198f81d8", "author_rating": null, "review_text": "Rather than trying to top the first film, Spider Man 2 builds upon each of the elements of it. Better fight scenes, better effects, better script, better acting, etc.", "created_at": "2020-01-05T20:50:31.864Z"}, {"movie_id": 558, "review_id": "5e1267aad8af670014bd672b", "author_rating": null, "review_text": "Spider Man 2 has it all - a great story line, action that'll leave you at the edge of your seats, more romance, humor, fine acting, and excellent pacing.", "created_at": "2020-01-05T22:48:10.822Z"}, {"movie_id": 558, "review_id": "5e12c6215907de0017df98ac", "author_rating": null, "review_text": "Not only did they have great storytelling and scriptwriting, but they also had amazing actors as well! They definitely brought so much emotions out of every scene.", "created_at": "2020-01-06T05:31:13.695Z"}, {"movie_id": 558, "review_id": "5e12ca38fc5f0600179086c1", "author_rating": null, "review_text": "Never have I seen so much realism in a film, let alone a superhero film. Amazing director!", "created_at": "2020-01-06T05:48:40.324Z"}, {"movie_id": 558, "review_id": "5e12ce36d64ac200146501e5", "author_rating": null, "review_text": "Read the comic book and you'll appreciate more how they stayed true to the book!", "created_at": "2020-01-06T06:05:42.092Z"}, {"movie_id": 558, "review_id": "5e12ce36fc5f060017908d7b", "author_rating": null, "review_text": "Read the comic book and you'll appreciate more how they stayed true to the book!", "created_at": "2020-01-06T06:05:42.390Z"}, {"movie_id": 558, "review_id": "5e12d2a9d64ac20014651719", "author_rating": null, "review_text": "One of the nearly-flawless superhero movies we have and is a definite must-watch for all generations.", "created_at": "2020-01-06T06:24:41.046Z"}, {"movie_id": 558, "review_id": "5e20d701397df00012964cae", "author_rating": null, "review_text": "Alfred Molina delivered a top performance in this film! Even with the short screen time, he made such a great impact on the overall quality of the movie.", "created_at": "2020-01-16T21:34:57.371Z"}, {"movie_id": 558, "review_id": "5e20e072cf4b8b0017ef20fa", "author_rating": null, "review_text": "Full of action, plenty of adventure, and  even with the technology back then, this still has award winning special effects for its time.", "created_at": "2020-01-16T22:15:14.958Z"}]