[{"movie_id": 363088, "review_id": "5b99caa7c3a368278b0006a6", "author_rating": 6.0, "review_text": "It's fun to see big stuff get real little and little stuff get real big, but _Ant-Man and the Wasp_ suffers the same problems of its predecessor, except this time with an added issue, one that effects many movies (and even more TV shows), the problem of \"The entire movie didn't have to happen if people would just have had normal human conversations with one another\".\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-09-13T02:25:43.416Z"}, {"movie_id": 363088, "review_id": "5bc243310e0a266e6b035e11", "author_rating": 7.0, "review_text": "Actually quite good! It's like a less-weird, but more fun version of a Deadpool - in the sense that it is both filled with action but also with fun acting.\r\n\r\nI recommend it for a Saturday evening. It is quite wholesome.", "created_at": "2018-10-13T19:10:41.725Z"}, {"movie_id": 363088, "review_id": "5bfa580592514104cc022459", "author_rating": 5.0, "review_text": "I did indeed enjoy this movie…somewhat. However I cannot say that I was overly impressed.\r\n\r\nThe story was okay. I would not expect a deep and thought provoking story from a super hero movie nor would I want it. It served as a decent enough vehicle for moving things forward.\r\n\r\nMost of the actors did a good enough job of the role they were given which in some cases was pretty much mission impossible given some of the overly silly characters in the movie. In particular I got tired of Luis almost before the first scenes he was in had finished. He was just so silly that you started to wonder what age the target audience was. Jimmy Woo was not far behind.\r\n\r\nI think this leads to my main gripe with the movie. I expected a super hero movie but what I got was a fairly lame comedy with super heroes in it. It was just too much comic elements in it for me. I could probably have liked it if the jokes were somewhat intelligent but, for me, they were not. They alternated between overly silly and stupid characters, slap-stick and simple fall-on-your ass jokes.\r\n\r\nWhat about the bad guy? Well, first off, there was not really a distinct bad guy but a hole bunch of them. Unfortunately none of them had any real bad guy charisma. I assume that Sonny was supposed to be the main bad guy and he certainly had enough evil lunatic air about him to fit that but again…too silly. Then we have the lame Jimmy Woo who was just annoying. The Ghost was probably the best one but then she was not really a bad guy was she?\r\n\r\nI did like most of the action and the special effects though. The playing around with shrinking and returning to normal size, or greater, was both cool and funny. This shrinking business is of course a difficult theme to work with from a science and logic point of view. For instance, if you shrink a car to the size of a toy car it still weighs like a full size one and you cannot just pick it up. And what about the lab popping up and down all the time? Why weren’t everything shaken to bits inside when they started to run around with it? And don’t get me started about electricity and plumbing. But then, in this kind of movie I would say just just have to turn off that part of your brain. It made for some cool scenes after all.\r\n\r\nI also did like that the story was more of a down to Earth story. No overall galactic plot, no snapping of fingers to make…well you know what. Okay, there was the post credit scenes which was a bit of an annoying tie in. Perhaps best of all though, I could not really feel much SJW or other form of politically correct preaching being showed down my throat. Today that is a great plus for any movie.\r\n\r\nSo, to sum up, I did enjoy it but it was not great and I was indeed a little bit disappointed at the end.", "created_at": "2018-11-25T08:06:29.438Z"}, {"movie_id": 363088, "review_id": "5c842521c3a3684e98da8ab5", "author_rating": 6.0, "review_text": "For fans of the first one, which includes me, Ant-Man and the Wasp is more of what you like. More heisting. More car chases. More Giant Man. More of the three wombats. More humour. More mediocre villains. More romance between Scott and Hope. More family bonding. And of course, more quantum realm. It's fun. It's light hearted. It works.\r\n\r\nThat post credit scene though .... 😲", "created_at": "2019-03-09T20:42:09.270Z"}, {"movie_id": 363088, "review_id": "5e7d5602eec4f34267aa0368", "author_rating": null, "review_text": "“Ant-Man and the Wasp” is a really weird Marvel movie.\r\n\r\nLike its pint-sized superhero, the film doesn’t quite fit in with the typical MCU big screen canon and is a laid back yet thoroughly forgettable entry into the fatigued superhero genre. The story doesn’t try to tie too much together (save for a mid-credits scene), there’s not an over-dependence on rambunctious CGI effects, and the attempts at humor feel oddly forced (I’d estimate only 30% of the jokes land successfully). Despite the lame title characters and the ever-likeable Paul Rudd‘s offhand charisma, this film gives the impression that it’s an average C student trying desperately to overcome underdog status and achieve a place on the honor roll.\r\n\r\nThe best part of the film besides Rudd (he makes this one, just like every movie he’s cast in, impossible not to enjoy at least a little), are the special effects. Sure, they’re all computer generated, but they’re some of the most creative since 2016’s “Doctor Strange.” The worst part of the film is its contrived humor. It’s stiff, often cringe-worthy, and sticks out like a sore thumb as it grows increasingly desperate. The film’s multiple writers couldn’t have helped things, and the barrage of thoughtless, lazy jokes quickly wore me down.\r\n\r\nAlso lacking is suspense and a viable antagonist. There’s the oddly disturbing Ghost (Hannah John-Kamen), a woman who is living in unbearable pain and appears to be a formidable foe for Ant-Man (Rudd), The Wasp (Evangeline Lilly), and Hank Pym (Michael Douglas). But then she suddenly finds her heart and the evil disappears. The same goes for Dr. Foster (Laurence Fishburne), a professor who also has a near immediate change of heart. The thin rescue mission premise of extracting Hank’s wife Janet (Michelle Pfeiffer) from the Quantum Realm after being trapped there for the last 30 years also means there’s not too much else to root for.\r\n\r\nThe quantum rules change on a whim to fit the action sequences, with a sometimes shrinking and sometimes growing super suit. And cars. And buildings. The exposition dialogue is long-winded and repetitive, and the ill-advised “comic” relief from Michael Peña is not snarky enough to feel fresh or new (see “Thor: Ragnarok“).\r\n\r\nThis is a shallow, pointless film that becomes an exhausting bore.", "created_at": "2020-03-27T01:25:22.051Z"}, {"movie_id": 363088, "review_id": "5f2bb7628e8702003732e1cd", "author_rating": 10.0, "review_text": "I have the impression that this movie is not a favorite of the hardcore Marvel community, which makes sense, as I am not part of that community and this is flat out my favorite entry into the Marvel line. In fact, it is the only Marvel film I have recommended my wife watch with me. (She hasn’t taken me up on it yet.)\r\n\r\nI like the humor from the Scott Lang character and its self-deprecating tendency. Perhaps it would be over the top in a more serious entry like the infinity movies, but it works here. I really enjoy the chemistry between him and his daughter and I even appreciate the Luis character, which apparently separates me from the serious Marvel viewers. It is a fun ride and is not so much fueled by the violence of the other entries in the genre. \r\n\r\nIn fact, the only thing I didn’t like is the bittersweet way this movie is tied into the Infinity universe, regarding Scott (Ant-Man) and his daughter. And since that happens off in a different film altogether, it allows the story within this movie to stand on its own. If the reason you haven’t watched this is because you aren’t into the rest of the Marvel series or are worried about not getting it out of sequence, don’t worry. It stands on its own.", "created_at": "2020-08-06T07:55:14.611Z"}, {"movie_id": 363088, "review_id": "5fa5b15f1b7294003e8f695c", "author_rating": 6.0, "review_text": "The Ant-man and Wasp is simple, silly movie with some redeeming features.  It grew on me despite the silly acting and twisting plot that had a few unnecessary scenes. The special effects were pretty good, and I liked most of the combat scenes. They went a little overboard with CGI, which broke through my suspension of disbelief on a few occasions. \r\n\r\nThere were too many characters who played a weak villain. None of them felt like a real threat to any of the heroes. That gave the movie a very cartoonish feel. \r\n\r\nWhat was weird that Ant-man's love interest Wasp, played by Evangeline Lilly, looked like she could have been his mother! Every time they showed affection for each other, like when they kissed, I recoils with a mental \"ewww, this is gross!\". Wasp was like a cougar hunting Paul Rudd.\r\n\r\nOverall, the movie was enjoyable as long as you don't question its science, since it wouldn't work even if you believe their explanation of the quantum realm. \r\n\r\nFinal note, skip the credits and there is a scene in there to tie it into the rest of the MCU. The scene is entirely unecessary, and it ruins the actual ending of the movie. They should have left it out.", "created_at": "2020-11-06T20:26:07.243Z"}, {"movie_id": 363088, "review_id": "600cb54f0b5fd6003f5b4a69", "author_rating": 7.0, "review_text": "A fine watch, but the novelty and freshness that the first film had has dissipated.\r\n\r\nI enjoyed <em>'Ant-Man and the Wasp'</em> just about enough. It's the MCU's weakest film, up until this point at least, so far. I rate the 2015 film quite a bit, it's entertaining and something different, but this sequel kinda felt flat to me for the majority. There's marginally enough there to like though.\r\n\r\nPaul Rudd is satisfactory as the lead, while Evangeline Lilly, Michael Douglas and Michael Peña remain as solid as before. Michelle Pfeiffer and Laurence Fishburne are cool additions, but I can't say their characters are all that memorable - still passable, mind you.\r\n\r\nThe action is the film's biggest plus. The shrinking stuff always looks good, too. The humour is at a suitable level. Overall, it's an OK watch.", "created_at": "2021-01-23T23:46:23.940Z"}, {"movie_id": 363088, "review_id": "63c1f49c8efe73007d8f7c93", "author_rating": 10.0, "review_text": "As with the last one...Michael Peña is still the best part of the movie. He's the heart and soul of the Ant-Man movies. Unfortunately this time his stories aren't made with the same hysterical blunt finesse they were in the past. But that doesn't take away from his delivery.\r\n\r\nAnd unfortunately that goes with the rest of the movie.\r\n\r\nIt's fun to watch and entertaining, and that is what matters, but the wind was sort of out of the sails here. Blame it on the script, the acting and direction were fine, they just didn't have a lot to work with.", "created_at": "2023-01-14T00:17:32.353Z"}, {"movie_id": 363088, "review_id": "63e72ee263aad2008f85094a", "author_rating": 8.0, "review_text": "**Ant-Man and the Wasp takes everything that was wonderful about the first film and makes it even better.**\r\n\r\nThe Ant-Man franchise is so delightfully entertaining and lighthearted. Ant-Man and The Wasp takes all the fun and goofiness of the first movie and cranks it up a notch while adding the heartfelt plot of uniting a long-broken family. Paul Rudd’s lovable buffoon and Evangeline Lilly’s serious and driven heroine make a hilarious combination. I found myself laughing so hard that tears were in my eyes multiple times in this movie. Hannah John-Kamen’s Ghost is one of the better villains in the MCU due to a clearer and more sympathetic backstory. It’s easy to overlook how excellent the cast is in this movie, but it is a true all-star lineup with Laurence Fishburne, Michelle Pfeiffer, and Walton Goggins joining the already fantastic team from the first film. Ant-Man and the Wasp was a genius follow-up in the MCU timeline - after the severe and sobering Avengers: Infinity War, the franchise needed a laugh. Ant-Man is a fun series that doesn’t take itself too seriously while making the audience really care for its characters. I can’t wait to see what comes next!", "created_at": "2023-02-11T06:00:02.039Z"}, {"movie_id": 363088, "review_id": "6444084dcee2f667e736c5a1", "author_rating": 6.0, "review_text": "Not as good as the first. Hardly any action at all. More comedy this time then anything. It was just an ok movie.", "created_at": "2023-04-22T16:16:13.425Z"}, {"movie_id": 363088, "review_id": "5b99caa7c3a368278b0006a6", "author_rating": 6.0, "review_text": "It's fun to see big stuff get real little and little stuff get real big, but _Ant-Man and the Wasp_ suffers the same problems of its predecessor, except this time with an added issue, one that effects many movies (and even more TV shows), the problem of \"The entire movie didn't have to happen if people would just have had normal human conversations with one another\".\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-09-13T02:25:43.416Z"}, {"movie_id": 363088, "review_id": "5bc243310e0a266e6b035e11", "author_rating": 7.0, "review_text": "Actually quite good! It's like a less-weird, but more fun version of a Deadpool - in the sense that it is both filled with action but also with fun acting.\r\n\r\nI recommend it for a Saturday evening. It is quite wholesome.", "created_at": "2018-10-13T19:10:41.725Z"}, {"movie_id": 363088, "review_id": "5bfa580592514104cc022459", "author_rating": 5.0, "review_text": "I did indeed enjoy this movie…somewhat. However I cannot say that I was overly impressed.\r\n\r\nThe story was okay. I would not expect a deep and thought provoking story from a super hero movie nor would I want it. It served as a decent enough vehicle for moving things forward.\r\n\r\nMost of the actors did a good enough job of the role they were given which in some cases was pretty much mission impossible given some of the overly silly characters in the movie. In particular I got tired of Luis almost before the first scenes he was in had finished. He was just so silly that you started to wonder what age the target audience was. Jimmy Woo was not far behind.\r\n\r\nI think this leads to my main gripe with the movie. I expected a super hero movie but what I got was a fairly lame comedy with super heroes in it. It was just too much comic elements in it for me. I could probably have liked it if the jokes were somewhat intelligent but, for me, they were not. They alternated between overly silly and stupid characters, slap-stick and simple fall-on-your ass jokes.\r\n\r\nWhat about the bad guy? Well, first off, there was not really a distinct bad guy but a hole bunch of them. Unfortunately none of them had any real bad guy charisma. I assume that Sonny was supposed to be the main bad guy and he certainly had enough evil lunatic air about him to fit that but again…too silly. Then we have the lame Jimmy Woo who was just annoying. The Ghost was probably the best one but then she was not really a bad guy was she?\r\n\r\nI did like most of the action and the special effects though. The playing around with shrinking and returning to normal size, or greater, was both cool and funny. This shrinking business is of course a difficult theme to work with from a science and logic point of view. For instance, if you shrink a car to the size of a toy car it still weighs like a full size one and you cannot just pick it up. And what about the lab popping up and down all the time? Why weren’t everything shaken to bits inside when they started to run around with it? And don’t get me started about electricity and plumbing. But then, in this kind of movie I would say just just have to turn off that part of your brain. It made for some cool scenes after all.\r\n\r\nI also did like that the story was more of a down to Earth story. No overall galactic plot, no snapping of fingers to make…well you know what. Okay, there was the post credit scenes which was a bit of an annoying tie in. Perhaps best of all though, I could not really feel much SJW or other form of politically correct preaching being showed down my throat. Today that is a great plus for any movie.\r\n\r\nSo, to sum up, I did enjoy it but it was not great and I was indeed a little bit disappointed at the end.", "created_at": "2018-11-25T08:06:29.438Z"}, {"movie_id": 363088, "review_id": "5c842521c3a3684e98da8ab5", "author_rating": 6.0, "review_text": "For fans of the first one, which includes me, Ant-Man and the Wasp is more of what you like. More heisting. More car chases. More Giant Man. More of the three wombats. More humour. More mediocre villains. More romance between Scott and Hope. More family bonding. And of course, more quantum realm. It's fun. It's light hearted. It works.\r\n\r\nThat post credit scene though .... 😲", "created_at": "2019-03-09T20:42:09.270Z"}, {"movie_id": 363088, "review_id": "5e7d5602eec4f34267aa0368", "author_rating": null, "review_text": "“Ant-Man and the Wasp” is a really weird Marvel movie.\r\n\r\nLike its pint-sized superhero, the film doesn’t quite fit in with the typical MCU big screen canon and is a laid back yet thoroughly forgettable entry into the fatigued superhero genre. The story doesn’t try to tie too much together (save for a mid-credits scene), there’s not an over-dependence on rambunctious CGI effects, and the attempts at humor feel oddly forced (I’d estimate only 30% of the jokes land successfully). Despite the lame title characters and the ever-likeable Paul Rudd‘s offhand charisma, this film gives the impression that it’s an average C student trying desperately to overcome underdog status and achieve a place on the honor roll.\r\n\r\nThe best part of the film besides Rudd (he makes this one, just like every movie he’s cast in, impossible not to enjoy at least a little), are the special effects. Sure, they’re all computer generated, but they’re some of the most creative since 2016’s “Doctor Strange.” The worst part of the film is its contrived humor. It’s stiff, often cringe-worthy, and sticks out like a sore thumb as it grows increasingly desperate. The film’s multiple writers couldn’t have helped things, and the barrage of thoughtless, lazy jokes quickly wore me down.\r\n\r\nAlso lacking is suspense and a viable antagonist. There’s the oddly disturbing Ghost (Hannah John-Kamen), a woman who is living in unbearable pain and appears to be a formidable foe for Ant-Man (Rudd), The Wasp (Evangeline Lilly), and Hank Pym (Michael Douglas). But then she suddenly finds her heart and the evil disappears. The same goes for Dr. Foster (Laurence Fishburne), a professor who also has a near immediate change of heart. The thin rescue mission premise of extracting Hank’s wife Janet (Michelle Pfeiffer) from the Quantum Realm after being trapped there for the last 30 years also means there’s not too much else to root for.\r\n\r\nThe quantum rules change on a whim to fit the action sequences, with a sometimes shrinking and sometimes growing super suit. And cars. And buildings. The exposition dialogue is long-winded and repetitive, and the ill-advised “comic” relief from Michael Peña is not snarky enough to feel fresh or new (see “Thor: Ragnarok“).\r\n\r\nThis is a shallow, pointless film that becomes an exhausting bore.", "created_at": "2020-03-27T01:25:22.051Z"}, {"movie_id": 363088, "review_id": "5f2bb7628e8702003732e1cd", "author_rating": 10.0, "review_text": "I have the impression that this movie is not a favorite of the hardcore Marvel community, which makes sense, as I am not part of that community and this is flat out my favorite entry into the Marvel line. In fact, it is the only Marvel film I have recommended my wife watch with me. (She hasn’t taken me up on it yet.)\r\n\r\nI like the humor from the Scott Lang character and its self-deprecating tendency. Perhaps it would be over the top in a more serious entry like the infinity movies, but it works here. I really enjoy the chemistry between him and his daughter and I even appreciate the Luis character, which apparently separates me from the serious Marvel viewers. It is a fun ride and is not so much fueled by the violence of the other entries in the genre. \r\n\r\nIn fact, the only thing I didn’t like is the bittersweet way this movie is tied into the Infinity universe, regarding Scott (Ant-Man) and his daughter. And since that happens off in a different film altogether, it allows the story within this movie to stand on its own. If the reason you haven’t watched this is because you aren’t into the rest of the Marvel series or are worried about not getting it out of sequence, don’t worry. It stands on its own.", "created_at": "2020-08-06T07:55:14.611Z"}, {"movie_id": 363088, "review_id": "5fa5b15f1b7294003e8f695c", "author_rating": 6.0, "review_text": "The Ant-man and Wasp is simple, silly movie with some redeeming features.  It grew on me despite the silly acting and twisting plot that had a few unnecessary scenes. The special effects were pretty good, and I liked most of the combat scenes. They went a little overboard with CGI, which broke through my suspension of disbelief on a few occasions. \r\n\r\nThere were too many characters who played a weak villain. None of them felt like a real threat to any of the heroes. That gave the movie a very cartoonish feel. \r\n\r\nWhat was weird that Ant-man's love interest Wasp, played by Evangeline Lilly, looked like she could have been his mother! Every time they showed affection for each other, like when they kissed, I recoils with a mental \"ewww, this is gross!\". Wasp was like a cougar hunting Paul Rudd.\r\n\r\nOverall, the movie was enjoyable as long as you don't question its science, since it wouldn't work even if you believe their explanation of the quantum realm. \r\n\r\nFinal note, skip the credits and there is a scene in there to tie it into the rest of the MCU. The scene is entirely unecessary, and it ruins the actual ending of the movie. They should have left it out.", "created_at": "2020-11-06T20:26:07.243Z"}, {"movie_id": 363088, "review_id": "600cb54f0b5fd6003f5b4a69", "author_rating": 7.0, "review_text": "A fine watch, but the novelty and freshness that the first film had has dissipated.\r\n\r\nI enjoyed <em>'Ant-Man and the Wasp'</em> just about enough. It's the MCU's weakest film, up until this point at least, so far. I rate the 2015 film quite a bit, it's entertaining and something different, but this sequel kinda felt flat to me for the majority. There's marginally enough there to like though.\r\n\r\nPaul Rudd is satisfactory as the lead, while Evangeline Lilly, Michael Douglas and Michael Peña remain as solid as before. Michelle Pfeiffer and Laurence Fishburne are cool additions, but I can't say their characters are all that memorable - still passable, mind you.\r\n\r\nThe action is the film's biggest plus. The shrinking stuff always looks good, too. The humour is at a suitable level. Overall, it's an OK watch.", "created_at": "2021-01-23T23:46:23.940Z"}, {"movie_id": 363088, "review_id": "63c1f49c8efe73007d8f7c93", "author_rating": 10.0, "review_text": "As with the last one...Michael Peña is still the best part of the movie. He's the heart and soul of the Ant-Man movies. Unfortunately this time his stories aren't made with the same hysterical blunt finesse they were in the past. But that doesn't take away from his delivery.\r\n\r\nAnd unfortunately that goes with the rest of the movie.\r\n\r\nIt's fun to watch and entertaining, and that is what matters, but the wind was sort of out of the sails here. Blame it on the script, the acting and direction were fine, they just didn't have a lot to work with.", "created_at": "2023-01-14T00:17:32.353Z"}, {"movie_id": 363088, "review_id": "63e72ee263aad2008f85094a", "author_rating": 8.0, "review_text": "**Ant-Man and the Wasp takes everything that was wonderful about the first film and makes it even better.**\r\n\r\nThe Ant-Man franchise is so delightfully entertaining and lighthearted. Ant-Man and The Wasp takes all the fun and goofiness of the first movie and cranks it up a notch while adding the heartfelt plot of uniting a long-broken family. Paul Rudd’s lovable buffoon and Evangeline Lilly’s serious and driven heroine make a hilarious combination. I found myself laughing so hard that tears were in my eyes multiple times in this movie. Hannah John-Kamen’s Ghost is one of the better villains in the MCU due to a clearer and more sympathetic backstory. It’s easy to overlook how excellent the cast is in this movie, but it is a true all-star lineup with Laurence Fishburne, Michelle Pfeiffer, and Walton Goggins joining the already fantastic team from the first film. Ant-Man and the Wasp was a genius follow-up in the MCU timeline - after the severe and sobering Avengers: Infinity War, the franchise needed a laugh. Ant-Man is a fun series that doesn’t take itself too seriously while making the audience really care for its characters. I can’t wait to see what comes next!", "created_at": "2023-02-11T06:00:02.039Z"}, {"movie_id": 363088, "review_id": "6444084dcee2f667e736c5a1", "author_rating": 6.0, "review_text": "Not as good as the first. Hardly any action at all. More comedy this time then anything. It was just an ok movie.", "created_at": "2023-04-22T16:16:13.425Z"}, {"movie_id": 363088, "review_id": "5b99caa7c3a368278b0006a6", "author_rating": 6.0, "review_text": "It's fun to see big stuff get real little and little stuff get real big, but _Ant-Man and the Wasp_ suffers the same problems of its predecessor, except this time with an added issue, one that effects many movies (and even more TV shows), the problem of \"The entire movie didn't have to happen if people would just have had normal human conversations with one another\".\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-09-13T02:25:43.416Z"}, {"movie_id": 363088, "review_id": "5bc243310e0a266e6b035e11", "author_rating": 7.0, "review_text": "Actually quite good! It's like a less-weird, but more fun version of a Deadpool - in the sense that it is both filled with action but also with fun acting.\r\n\r\nI recommend it for a Saturday evening. It is quite wholesome.", "created_at": "2018-10-13T19:10:41.725Z"}, {"movie_id": 363088, "review_id": "5bfa580592514104cc022459", "author_rating": 5.0, "review_text": "I did indeed enjoy this movie…somewhat. However I cannot say that I was overly impressed.\r\n\r\nThe story was okay. I would not expect a deep and thought provoking story from a super hero movie nor would I want it. It served as a decent enough vehicle for moving things forward.\r\n\r\nMost of the actors did a good enough job of the role they were given which in some cases was pretty much mission impossible given some of the overly silly characters in the movie. In particular I got tired of Luis almost before the first scenes he was in had finished. He was just so silly that you started to wonder what age the target audience was. Jimmy Woo was not far behind.\r\n\r\nI think this leads to my main gripe with the movie. I expected a super hero movie but what I got was a fairly lame comedy with super heroes in it. It was just too much comic elements in it for me. I could probably have liked it if the jokes were somewhat intelligent but, for me, they were not. They alternated between overly silly and stupid characters, slap-stick and simple fall-on-your ass jokes.\r\n\r\nWhat about the bad guy? Well, first off, there was not really a distinct bad guy but a hole bunch of them. Unfortunately none of them had any real bad guy charisma. I assume that Sonny was supposed to be the main bad guy and he certainly had enough evil lunatic air about him to fit that but again…too silly. Then we have the lame Jimmy Woo who was just annoying. The Ghost was probably the best one but then she was not really a bad guy was she?\r\n\r\nI did like most of the action and the special effects though. The playing around with shrinking and returning to normal size, or greater, was both cool and funny. This shrinking business is of course a difficult theme to work with from a science and logic point of view. For instance, if you shrink a car to the size of a toy car it still weighs like a full size one and you cannot just pick it up. And what about the lab popping up and down all the time? Why weren’t everything shaken to bits inside when they started to run around with it? And don’t get me started about electricity and plumbing. But then, in this kind of movie I would say just just have to turn off that part of your brain. It made for some cool scenes after all.\r\n\r\nI also did like that the story was more of a down to Earth story. No overall galactic plot, no snapping of fingers to make…well you know what. Okay, there was the post credit scenes which was a bit of an annoying tie in. Perhaps best of all though, I could not really feel much SJW or other form of politically correct preaching being showed down my throat. Today that is a great plus for any movie.\r\n\r\nSo, to sum up, I did enjoy it but it was not great and I was indeed a little bit disappointed at the end.", "created_at": "2018-11-25T08:06:29.438Z"}, {"movie_id": 363088, "review_id": "5c842521c3a3684e98da8ab5", "author_rating": 6.0, "review_text": "For fans of the first one, which includes me, Ant-Man and the Wasp is more of what you like. More heisting. More car chases. More Giant Man. More of the three wombats. More humour. More mediocre villains. More romance between Scott and Hope. More family bonding. And of course, more quantum realm. It's fun. It's light hearted. It works.\r\n\r\nThat post credit scene though .... 😲", "created_at": "2019-03-09T20:42:09.270Z"}, {"movie_id": 363088, "review_id": "5e7d5602eec4f34267aa0368", "author_rating": null, "review_text": "“Ant-Man and the Wasp” is a really weird Marvel movie.\r\n\r\nLike its pint-sized superhero, the film doesn’t quite fit in with the typical MCU big screen canon and is a laid back yet thoroughly forgettable entry into the fatigued superhero genre. The story doesn’t try to tie too much together (save for a mid-credits scene), there’s not an over-dependence on rambunctious CGI effects, and the attempts at humor feel oddly forced (I’d estimate only 30% of the jokes land successfully). Despite the lame title characters and the ever-likeable Paul Rudd‘s offhand charisma, this film gives the impression that it’s an average C student trying desperately to overcome underdog status and achieve a place on the honor roll.\r\n\r\nThe best part of the film besides Rudd (he makes this one, just like every movie he’s cast in, impossible not to enjoy at least a little), are the special effects. Sure, they’re all computer generated, but they’re some of the most creative since 2016’s “Doctor Strange.” The worst part of the film is its contrived humor. It’s stiff, often cringe-worthy, and sticks out like a sore thumb as it grows increasingly desperate. The film’s multiple writers couldn’t have helped things, and the barrage of thoughtless, lazy jokes quickly wore me down.\r\n\r\nAlso lacking is suspense and a viable antagonist. There’s the oddly disturbing Ghost (Hannah John-Kamen), a woman who is living in unbearable pain and appears to be a formidable foe for Ant-Man (Rudd), The Wasp (Evangeline Lilly), and Hank Pym (Michael Douglas). But then she suddenly finds her heart and the evil disappears. The same goes for Dr. Foster (Laurence Fishburne), a professor who also has a near immediate change of heart. The thin rescue mission premise of extracting Hank’s wife Janet (Michelle Pfeiffer) from the Quantum Realm after being trapped there for the last 30 years also means there’s not too much else to root for.\r\n\r\nThe quantum rules change on a whim to fit the action sequences, with a sometimes shrinking and sometimes growing super suit. And cars. And buildings. The exposition dialogue is long-winded and repetitive, and the ill-advised “comic” relief from Michael Peña is not snarky enough to feel fresh or new (see “Thor: Ragnarok“).\r\n\r\nThis is a shallow, pointless film that becomes an exhausting bore.", "created_at": "2020-03-27T01:25:22.051Z"}, {"movie_id": 363088, "review_id": "5f2bb7628e8702003732e1cd", "author_rating": 10.0, "review_text": "I have the impression that this movie is not a favorite of the hardcore Marvel community, which makes sense, as I am not part of that community and this is flat out my favorite entry into the Marvel line. In fact, it is the only Marvel film I have recommended my wife watch with me. (She hasn’t taken me up on it yet.)\r\n\r\nI like the humor from the Scott Lang character and its self-deprecating tendency. Perhaps it would be over the top in a more serious entry like the infinity movies, but it works here. I really enjoy the chemistry between him and his daughter and I even appreciate the Luis character, which apparently separates me from the serious Marvel viewers. It is a fun ride and is not so much fueled by the violence of the other entries in the genre. \r\n\r\nIn fact, the only thing I didn’t like is the bittersweet way this movie is tied into the Infinity universe, regarding Scott (Ant-Man) and his daughter. And since that happens off in a different film altogether, it allows the story within this movie to stand on its own. If the reason you haven’t watched this is because you aren’t into the rest of the Marvel series or are worried about not getting it out of sequence, don’t worry. It stands on its own.", "created_at": "2020-08-06T07:55:14.611Z"}, {"movie_id": 363088, "review_id": "5fa5b15f1b7294003e8f695c", "author_rating": 6.0, "review_text": "The Ant-man and Wasp is simple, silly movie with some redeeming features.  It grew on me despite the silly acting and twisting plot that had a few unnecessary scenes. The special effects were pretty good, and I liked most of the combat scenes. They went a little overboard with CGI, which broke through my suspension of disbelief on a few occasions. \r\n\r\nThere were too many characters who played a weak villain. None of them felt like a real threat to any of the heroes. That gave the movie a very cartoonish feel. \r\n\r\nWhat was weird that Ant-man's love interest Wasp, played by Evangeline Lilly, looked like she could have been his mother! Every time they showed affection for each other, like when they kissed, I recoils with a mental \"ewww, this is gross!\". Wasp was like a cougar hunting Paul Rudd.\r\n\r\nOverall, the movie was enjoyable as long as you don't question its science, since it wouldn't work even if you believe their explanation of the quantum realm. \r\n\r\nFinal note, skip the credits and there is a scene in there to tie it into the rest of the MCU. The scene is entirely unecessary, and it ruins the actual ending of the movie. They should have left it out.", "created_at": "2020-11-06T20:26:07.243Z"}, {"movie_id": 363088, "review_id": "600cb54f0b5fd6003f5b4a69", "author_rating": 7.0, "review_text": "A fine watch, but the novelty and freshness that the first film had has dissipated.\r\n\r\nI enjoyed <em>'Ant-Man and the Wasp'</em> just about enough. It's the MCU's weakest film, up until this point at least, so far. I rate the 2015 film quite a bit, it's entertaining and something different, but this sequel kinda felt flat to me for the majority. There's marginally enough there to like though.\r\n\r\nPaul Rudd is satisfactory as the lead, while Evangeline Lilly, Michael Douglas and Michael Peña remain as solid as before. Michelle Pfeiffer and Laurence Fishburne are cool additions, but I can't say their characters are all that memorable - still passable, mind you.\r\n\r\nThe action is the film's biggest plus. The shrinking stuff always looks good, too. The humour is at a suitable level. Overall, it's an OK watch.", "created_at": "2021-01-23T23:46:23.940Z"}, {"movie_id": 363088, "review_id": "63c1f49c8efe73007d8f7c93", "author_rating": 10.0, "review_text": "As with the last one...Michael Peña is still the best part of the movie. He's the heart and soul of the Ant-Man movies. Unfortunately this time his stories aren't made with the same hysterical blunt finesse they were in the past. But that doesn't take away from his delivery.\r\n\r\nAnd unfortunately that goes with the rest of the movie.\r\n\r\nIt's fun to watch and entertaining, and that is what matters, but the wind was sort of out of the sails here. Blame it on the script, the acting and direction were fine, they just didn't have a lot to work with.", "created_at": "2023-01-14T00:17:32.353Z"}, {"movie_id": 363088, "review_id": "63e72ee263aad2008f85094a", "author_rating": 8.0, "review_text": "**Ant-Man and the Wasp takes everything that was wonderful about the first film and makes it even better.**\r\n\r\nThe Ant-Man franchise is so delightfully entertaining and lighthearted. Ant-Man and The Wasp takes all the fun and goofiness of the first movie and cranks it up a notch while adding the heartfelt plot of uniting a long-broken family. Paul Rudd’s lovable buffoon and Evangeline Lilly’s serious and driven heroine make a hilarious combination. I found myself laughing so hard that tears were in my eyes multiple times in this movie. Hannah John-Kamen’s Ghost is one of the better villains in the MCU due to a clearer and more sympathetic backstory. It’s easy to overlook how excellent the cast is in this movie, but it is a true all-star lineup with Laurence Fishburne, Michelle Pfeiffer, and Walton Goggins joining the already fantastic team from the first film. Ant-Man and the Wasp was a genius follow-up in the MCU timeline - after the severe and sobering Avengers: Infinity War, the franchise needed a laugh. Ant-Man is a fun series that doesn’t take itself too seriously while making the audience really care for its characters. I can’t wait to see what comes next!", "created_at": "2023-02-11T06:00:02.039Z"}, {"movie_id": 363088, "review_id": "6444084dcee2f667e736c5a1", "author_rating": 6.0, "review_text": "Not as good as the first. Hardly any action at all. More comedy this time then anything. It was just an ok movie.", "created_at": "2023-04-22T16:16:13.425Z"}, {"movie_id": 363088, "review_id": "5b99caa7c3a368278b0006a6", "author_rating": 6.0, "review_text": "It's fun to see big stuff get real little and little stuff get real big, but _Ant-Man and the Wasp_ suffers the same problems of its predecessor, except this time with an added issue, one that effects many movies (and even more TV shows), the problem of \"The entire movie didn't have to happen if people would just have had normal human conversations with one another\".\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-09-13T02:25:43.416Z"}, {"movie_id": 363088, "review_id": "5bc243310e0a266e6b035e11", "author_rating": 7.0, "review_text": "Actually quite good! It's like a less-weird, but more fun version of a Deadpool - in the sense that it is both filled with action but also with fun acting.\r\n\r\nI recommend it for a Saturday evening. It is quite wholesome.", "created_at": "2018-10-13T19:10:41.725Z"}, {"movie_id": 363088, "review_id": "5bfa580592514104cc022459", "author_rating": 5.0, "review_text": "I did indeed enjoy this movie…somewhat. However I cannot say that I was overly impressed.\r\n\r\nThe story was okay. I would not expect a deep and thought provoking story from a super hero movie nor would I want it. It served as a decent enough vehicle for moving things forward.\r\n\r\nMost of the actors did a good enough job of the role they were given which in some cases was pretty much mission impossible given some of the overly silly characters in the movie. In particular I got tired of Luis almost before the first scenes he was in had finished. He was just so silly that you started to wonder what age the target audience was. Jimmy Woo was not far behind.\r\n\r\nI think this leads to my main gripe with the movie. I expected a super hero movie but what I got was a fairly lame comedy with super heroes in it. It was just too much comic elements in it for me. I could probably have liked it if the jokes were somewhat intelligent but, for me, they were not. They alternated between overly silly and stupid characters, slap-stick and simple fall-on-your ass jokes.\r\n\r\nWhat about the bad guy? Well, first off, there was not really a distinct bad guy but a hole bunch of them. Unfortunately none of them had any real bad guy charisma. I assume that Sonny was supposed to be the main bad guy and he certainly had enough evil lunatic air about him to fit that but again…too silly. Then we have the lame Jimmy Woo who was just annoying. The Ghost was probably the best one but then she was not really a bad guy was she?\r\n\r\nI did like most of the action and the special effects though. The playing around with shrinking and returning to normal size, or greater, was both cool and funny. This shrinking business is of course a difficult theme to work with from a science and logic point of view. For instance, if you shrink a car to the size of a toy car it still weighs like a full size one and you cannot just pick it up. And what about the lab popping up and down all the time? Why weren’t everything shaken to bits inside when they started to run around with it? And don’t get me started about electricity and plumbing. But then, in this kind of movie I would say just just have to turn off that part of your brain. It made for some cool scenes after all.\r\n\r\nI also did like that the story was more of a down to Earth story. No overall galactic plot, no snapping of fingers to make…well you know what. Okay, there was the post credit scenes which was a bit of an annoying tie in. Perhaps best of all though, I could not really feel much SJW or other form of politically correct preaching being showed down my throat. Today that is a great plus for any movie.\r\n\r\nSo, to sum up, I did enjoy it but it was not great and I was indeed a little bit disappointed at the end.", "created_at": "2018-11-25T08:06:29.438Z"}, {"movie_id": 363088, "review_id": "5c842521c3a3684e98da8ab5", "author_rating": 6.0, "review_text": "For fans of the first one, which includes me, Ant-Man and the Wasp is more of what you like. More heisting. More car chases. More Giant Man. More of the three wombats. More humour. More mediocre villains. More romance between Scott and Hope. More family bonding. And of course, more quantum realm. It's fun. It's light hearted. It works.\r\n\r\nThat post credit scene though .... 😲", "created_at": "2019-03-09T20:42:09.270Z"}, {"movie_id": 363088, "review_id": "5e7d5602eec4f34267aa0368", "author_rating": null, "review_text": "“Ant-Man and the Wasp” is a really weird Marvel movie.\r\n\r\nLike its pint-sized superhero, the film doesn’t quite fit in with the typical MCU big screen canon and is a laid back yet thoroughly forgettable entry into the fatigued superhero genre. The story doesn’t try to tie too much together (save for a mid-credits scene), there’s not an over-dependence on rambunctious CGI effects, and the attempts at humor feel oddly forced (I’d estimate only 30% of the jokes land successfully). Despite the lame title characters and the ever-likeable Paul Rudd‘s offhand charisma, this film gives the impression that it’s an average C student trying desperately to overcome underdog status and achieve a place on the honor roll.\r\n\r\nThe best part of the film besides Rudd (he makes this one, just like every movie he’s cast in, impossible not to enjoy at least a little), are the special effects. Sure, they’re all computer generated, but they’re some of the most creative since 2016’s “Doctor Strange.” The worst part of the film is its contrived humor. It’s stiff, often cringe-worthy, and sticks out like a sore thumb as it grows increasingly desperate. The film’s multiple writers couldn’t have helped things, and the barrage of thoughtless, lazy jokes quickly wore me down.\r\n\r\nAlso lacking is suspense and a viable antagonist. There’s the oddly disturbing Ghost (Hannah John-Kamen), a woman who is living in unbearable pain and appears to be a formidable foe for Ant-Man (Rudd), The Wasp (Evangeline Lilly), and Hank Pym (Michael Douglas). But then she suddenly finds her heart and the evil disappears. The same goes for Dr. Foster (Laurence Fishburne), a professor who also has a near immediate change of heart. The thin rescue mission premise of extracting Hank’s wife Janet (Michelle Pfeiffer) from the Quantum Realm after being trapped there for the last 30 years also means there’s not too much else to root for.\r\n\r\nThe quantum rules change on a whim to fit the action sequences, with a sometimes shrinking and sometimes growing super suit. And cars. And buildings. The exposition dialogue is long-winded and repetitive, and the ill-advised “comic” relief from Michael Peña is not snarky enough to feel fresh or new (see “Thor: Ragnarok“).\r\n\r\nThis is a shallow, pointless film that becomes an exhausting bore.", "created_at": "2020-03-27T01:25:22.051Z"}, {"movie_id": 363088, "review_id": "5f2bb7628e8702003732e1cd", "author_rating": 10.0, "review_text": "I have the impression that this movie is not a favorite of the hardcore Marvel community, which makes sense, as I am not part of that community and this is flat out my favorite entry into the Marvel line. In fact, it is the only Marvel film I have recommended my wife watch with me. (She hasn’t taken me up on it yet.)\r\n\r\nI like the humor from the Scott Lang character and its self-deprecating tendency. Perhaps it would be over the top in a more serious entry like the infinity movies, but it works here. I really enjoy the chemistry between him and his daughter and I even appreciate the Luis character, which apparently separates me from the serious Marvel viewers. It is a fun ride and is not so much fueled by the violence of the other entries in the genre. \r\n\r\nIn fact, the only thing I didn’t like is the bittersweet way this movie is tied into the Infinity universe, regarding Scott (Ant-Man) and his daughter. And since that happens off in a different film altogether, it allows the story within this movie to stand on its own. If the reason you haven’t watched this is because you aren’t into the rest of the Marvel series or are worried about not getting it out of sequence, don’t worry. It stands on its own.", "created_at": "2020-08-06T07:55:14.611Z"}, {"movie_id": 363088, "review_id": "5fa5b15f1b7294003e8f695c", "author_rating": 6.0, "review_text": "The Ant-man and Wasp is simple, silly movie with some redeeming features.  It grew on me despite the silly acting and twisting plot that had a few unnecessary scenes. The special effects were pretty good, and I liked most of the combat scenes. They went a little overboard with CGI, which broke through my suspension of disbelief on a few occasions. \r\n\r\nThere were too many characters who played a weak villain. None of them felt like a real threat to any of the heroes. That gave the movie a very cartoonish feel. \r\n\r\nWhat was weird that Ant-man's love interest Wasp, played by Evangeline Lilly, looked like she could have been his mother! Every time they showed affection for each other, like when they kissed, I recoils with a mental \"ewww, this is gross!\". Wasp was like a cougar hunting Paul Rudd.\r\n\r\nOverall, the movie was enjoyable as long as you don't question its science, since it wouldn't work even if you believe their explanation of the quantum realm. \r\n\r\nFinal note, skip the credits and there is a scene in there to tie it into the rest of the MCU. The scene is entirely unecessary, and it ruins the actual ending of the movie. They should have left it out.", "created_at": "2020-11-06T20:26:07.243Z"}, {"movie_id": 363088, "review_id": "600cb54f0b5fd6003f5b4a69", "author_rating": 7.0, "review_text": "A fine watch, but the novelty and freshness that the first film had has dissipated.\r\n\r\nI enjoyed <em>'Ant-Man and the Wasp'</em> just about enough. It's the MCU's weakest film, up until this point at least, so far. I rate the 2015 film quite a bit, it's entertaining and something different, but this sequel kinda felt flat to me for the majority. There's marginally enough there to like though.\r\n\r\nPaul Rudd is satisfactory as the lead, while Evangeline Lilly, Michael Douglas and Michael Peña remain as solid as before. Michelle Pfeiffer and Laurence Fishburne are cool additions, but I can't say their characters are all that memorable - still passable, mind you.\r\n\r\nThe action is the film's biggest plus. The shrinking stuff always looks good, too. The humour is at a suitable level. Overall, it's an OK watch.", "created_at": "2021-01-23T23:46:23.940Z"}, {"movie_id": 363088, "review_id": "63c1f49c8efe73007d8f7c93", "author_rating": 10.0, "review_text": "As with the last one...Michael Peña is still the best part of the movie. He's the heart and soul of the Ant-Man movies. Unfortunately this time his stories aren't made with the same hysterical blunt finesse they were in the past. But that doesn't take away from his delivery.\r\n\r\nAnd unfortunately that goes with the rest of the movie.\r\n\r\nIt's fun to watch and entertaining, and that is what matters, but the wind was sort of out of the sails here. Blame it on the script, the acting and direction were fine, they just didn't have a lot to work with.", "created_at": "2023-01-14T00:17:32.353Z"}, {"movie_id": 363088, "review_id": "63e72ee263aad2008f85094a", "author_rating": 8.0, "review_text": "**Ant-Man and the Wasp takes everything that was wonderful about the first film and makes it even better.**\r\n\r\nThe Ant-Man franchise is so delightfully entertaining and lighthearted. Ant-Man and The Wasp takes all the fun and goofiness of the first movie and cranks it up a notch while adding the heartfelt plot of uniting a long-broken family. Paul Rudd’s lovable buffoon and Evangeline Lilly’s serious and driven heroine make a hilarious combination. I found myself laughing so hard that tears were in my eyes multiple times in this movie. Hannah John-Kamen’s Ghost is one of the better villains in the MCU due to a clearer and more sympathetic backstory. It’s easy to overlook how excellent the cast is in this movie, but it is a true all-star lineup with Laurence Fishburne, Michelle Pfeiffer, and Walton Goggins joining the already fantastic team from the first film. Ant-Man and the Wasp was a genius follow-up in the MCU timeline - after the severe and sobering Avengers: Infinity War, the franchise needed a laugh. Ant-Man is a fun series that doesn’t take itself too seriously while making the audience really care for its characters. I can’t wait to see what comes next!", "created_at": "2023-02-11T06:00:02.039Z"}, {"movie_id": 363088, "review_id": "6444084dcee2f667e736c5a1", "author_rating": 6.0, "review_text": "Not as good as the first. Hardly any action at all. More comedy this time then anything. It was just an ok movie.", "created_at": "2023-04-22T16:16:13.425Z"}]