[{"movie_id": 4638, "review_id": "53fe9fdc0e0a262ddc00316e", "author_rating": 10.0, "review_text": "Homage or parody, Hot Fuzz is the best of modern British comedy.\r\n\r\nPolice Constable Nicholas Angel is the pride of the London Service, trouble is is that he is making everybody else look bad, so much so his superiors promote him to Sergeant in the sleepy village of Sandford, Gloucestershire. Yet all is not right with Sandford as the locals start meeting grizzly deaths, thus thrusting Angel into his biggest case so far.\r\n\r\nThe biggest question on most film goers lips was could the pairing of Edgar Wright and Simon Pegg triumphantly follow the monster cult success of Shaun Of The Dead? Well the plot premise for Hot Fuzz hardly leaps out as something to grab the attention span of many, but they have crafted a tremendously funny film that winks at the action genre with genuine love and admiration.\r\n\r\nSimon Pegg and his trusty sidekick, Nick Frost, clearly have an earthbound appeal that many (even outside of Britain) can warm too, not pretty or over svelt, these guys are fans of movies making movies purely for the fans, and it shows. Neither Pegg or Frost try to steal scenes from each other, both men after over a decade of working together are clearly comfortable with their coupling and thus manage to fine tune their working chemistry.\r\n\r\nOnce Angel (Pegg) lands at Sandford Village we are introduced to a ream of British Village stereotypes (archetypes actually), all characters ripe for hilarious scenarios that our fish out water (big city cop) Sergeant struggles to comprehend. We observe as he is dumb struck at the ineptitude of the Village Police Force (erm service actually) and is then forced to work alongside dough eyed Constable Butterman (a film stealing Frost). Angel's exasperation at where he finds himself is mirthful joy to us the viewers. The dialogue is priceless, one liners and hat tipping nods to the action genre come thick and fast, in fact you can watch Hot Fuzz repeatedly and play spot the homage each time. I mean come on people, we got both James Bond (a delicious turn from Timothy Dalton) and Belloq in here strutting their stuff. The action set pieces are not found wanting either, director Wright having the time of his life with the crash bang wallop that flows in the final third.\r\n\r\nThe test of a great comedy is how it stands up to repeat viewings, to me Hot Fuzz delivers no matter how many times it is viewed. For even when you know what is coming up next, the smile on your face is already there before the event, wonderful, wonderful film made by guys who love movies as much as ourselves. 10/10", "created_at": "2014-08-28T03:19:56.154Z"}, {"movie_id": 4638, "review_id": "5461fbc20e0a2672a0001fe5", "author_rating": 8.0, "review_text": "I was not sure what to expect from this movie that I found on Netflix a while ago while browsing through the catalog. The movie poster makes it look like a hard-boiled police action movie but reading the reviews it became clear that it was more of a comedy. I had not heard of the movie before but it generally got good reviews so the other evening me and the boys sat down to watch it.\r\n\r\nThis is a fun movie. A good, old-fashioned British comedy. The core story could very well have been a serious crime story but the way it is implemented makes it so incredibly silly in a fun way. It starts off pretty much right away when PC Angel is told that he will be promoted but moved, because he makes the rest if the bunch of the dimwits at the precinct look bad, to a small British town where the most fun you can have is to watch the grass grow or get drunk and from there it goes downhill for Angel.\r\n\r\nHis new colleagues are somewhat weird not to mention more or less useless when it comes to police work. The by-the-book Angel is getting more and more frustrated and his only friend is the son of his new boss, whom he arrested on the first day by the way. When the grizzly “accidents” starts to happen the movie, in particular the explanations as to why they are “accidents” and not crimes, become more and more absurd. The special effects guys seems to have learned a trick or two from the Monty Python gang when it comes to over the top gory blood splattered scenes by the way.\r\n\r\nIn the final showdown between Angel and the totally whacko gang that keeps the town “clean” by deadly serious methods is short references to great many action movies. The amount of shots fired and the ratio of misses versus actual hits is nothing short of ludicrous. It was just so absurdly funny that it is difficult to describe.\r\n\r\nIf you are in the mood for some good solid British comedy then I can recommend this one. It is a very well done comedy and a lot more enjoyable than the get drunk and/or fall on your arse and/or and puke all over the place “comedies” that comes thirteen to the dozen today.", "created_at": "2014-11-11T12:06:26.685Z"}]