[{"movie_id": 2024, "review_id": "5e557b46a93d2500174fcd83", "author_rating": 6.0, "review_text": "Here's Mel to give the Brits an inaccurate historical thrashing, again... \r\n\r\nThe Patriot is based around one Benjamin Martin, an ex-soldier, who now happily living as a family man finds himself thrust into conflict at the break of the American Revolution.\r\n\r\nHe loves the Brits does Mel Gibson, \"Gallipoli\", \"Braveheart\" and here with \"The Patriot\", see the pattern anyone? As with the aforementioned \"Gallipoli\" and \"Braveheart\", certain liberties have also been taken with events in \"The Patriot\" so as to glossy up for the eager Hollywood contingent. It's not my want to scribble about the facts of Benjamin Martin (Re: Francis Marion), or William Wallace for that matter, information as such is but a mere click away on the world wide web.\r\n\r\nSo casting aside the artistic licence factors, is \"The Patriot\" any good? Well nearly it is -- nearly. Gibson is fine, he shoulders the burden of the film with great gusto and no shortage of emotional depth. It's very easy to accept him as a staunch family man who transforms into a blood thirsty warrior. The problems, acting wise, lay away from Gibbo's central performance. Surrounded by caricature villains (though Jason Isaacs' Tavington is deliciously vile) and underwritten characters (Chris Cooper wasted and Joely Richardson is but a mere prop), Gibson has no choice but to hog the screen. So much so it ultimately turns into a one man star vehicle, which for a costume war epic isn't a great thing really.\r\n\r\nRoland Emmerich (\"Independence Day\" and \"Godzilla\") directs and handles the battle sequences very well, there's lashings of blood as men line up to shoot and dismember one and other. While cannonball's whizz, bang and tear off body parts, it's grim, yet oddly rousing stuff. Not even the overtly flag waving and sloganeering on show can off set the impact of the well constructed battles. There is of course lots of tragedy to be found in the film, and these are some what surprisingly, tenderly handled by Emmerich, but mostly it's via an on song Gibson, who remains one of the few modern day male actors capable of believable grief. All of this is given a John Williams score that suitably flits between rousing and ethereal, and things are further boosted by the sumptuous photography from Caleb Deschanel.\r\n\r\nThere should have been more thought given to the racial (slaves) aspects in the conflict, and this coupled with the bad errors of under developed characters hurts \"The Patriot\" as a filmic exercise, not so as to stop it being entertaining, but more to stop it being a one man show. But as it is, thanks in the main to Gibson, and in spite of the overtly evident faults, it's an above average drama. 6/10", "created_at": "2020-02-25T19:53:42.639Z"}]