[{"movie_id": 303858, "review_id": "573641bcc3a3680ac0000cc0", "author_rating": null, "review_text": "\"A slick and satisfying vehicle for the capital-M/capital-S charisma of two of Hollywood’s most reliable Movie Stars...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/5/13/money-monster.html", "created_at": "2016-05-13T21:06:04.473Z"}, {"movie_id": 303858, "review_id": "57d3091cc3a3681ff7000797", "author_rating": 6.0, "review_text": "**What if the experts are wrong! And how it affects the common man!**\r\n\r\nJodie Foster did wonderfully as a captain of the ship. She could have acted in it, instead concentrate only on the direction, so that opportunity went to Julia Robers. With George Clooney onboard for one of the main roles, this was one of the best team to work together, as well the film was very enjoyable. So better than what I thought of it and I feel I should have given a better rating. But one thing is for sure that it was made for the people to have a good time, not for the critics morons.\r\n\r\nA real time narration, takes place in one normal morning is a newsroom studio where the financial expert Lee Gates, going to give his advice to the investor where to put their money. But the show suddenly got hit by an intruder when he takes the host as a hostage. He demands some answers from him regarding what he'd said a week ago in the same show, which led him to lose all his money. With this kind of complication how its going to conclude was nicely told with some edgy scenes towards the end.\r\n\r\nBoth, Clooney and Julia was good, but it was Jack O'Connell who hand upper hand. He has done some great films lately and now this, I hope he continues his good work. It was inspired by the real glitch that saw in the stock market, but altered to suit the cinematic, especially turning it into a crime-thriller with some powerful characters to deal such an interesting situation made big differences in its success.\r\n\r\nThe writing was good, because, it was kind of realistic like what a common man do and his intentions are when he can't understand the terms the experts speak or give the reason for the loss. So there are some pauses like 'what next' kind of stuffs that intentionally did. Despite a serious thriller, there are some funs. Whom you're going to cheer is up to you, but it keeps your head up all the time with its fine pace and developments. This is not the best among you find from this year, but surely a good watch if your purpose is entertainment or timepass,\r\n\r\n6/10", "created_at": "2016-09-09T19:10:20.443Z"}]