[{"movie_id": 613504, "review_id": "5f5ac7335bce9e0036c3281e", "author_rating": 3.0, "review_text": "I've sat through much more painful slogs, but 'After we Collided' gave me two hours of insane plot - and while I forgot everything as soon as I left, I'll be back over the next couple of years just to enjoy my cheesy mess in this strange unnecessary franchise. \r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-after-we-collided-wattpad-returns-to-the-screen-for-slightly-better-still-dumb-results", "created_at": "2020-09-11T00:39:15.456Z"}, {"movie_id": 613504, "review_id": "63167e45fab3fa007f3e3910", "author_rating": 1.0, "review_text": "After We Collided is fond of quoting Wuthering Heights, but it owes more to Twilight and 50 Shades of Grey (the novel, called After, whose film adaptation this is the sequel to, originally appeared on Wattpad, where every asshole can publish regardless of whether or not they should).\r\n\r\nUnlike Heathcliff and Catherine (and by extension Romeo and Juliet, begetters of all modern star-crossed lovers), though, Tessa (Josephine Langford) and Hardin (Hero Fiennes Tiffin) have absolutely no impediment to their being together other than that they are totally wrong for each other.\r\n\r\nThe only chemistry between the two is sexual; After We Collided is much more lubricious than Twilight, but a lot less risqué than 50 Shades — that is, there’s lots of implied sex but very little nudity. Since there is no reason for these two to be together, we don't give two craps if they aren't.\r\n\r\nNot that the movie doesn’t try to manufacture such a reason; for example, Emotionally Scarred Bad Boy Hardin (Tiffin may be Ralph Fiennes’s nephew, but comes across more as a young, Brittish-accented Joshua Jackson) has nightmares, but they stop when he starts dating Tessa. This is is total nonsense; sleeping with someone doesn’t equal sleeping better.\r\n\r\nBut that’s the film’s naïve Love Conques All mentality. Love may indeed conquer many things, but an inert, lethargic plot is not one of them. The only part of the script that doesn't ring hollow is the title, which is very appropriate because the action, such as it is, completely lacks urgency. Nothing is resolved now, everything is left for later — to the point that two sequels were in the works at the time of this one’s release.", "created_at": "2022-09-05T22:55:01.602Z"}]