[{"movie_id": 399566, "review_id": "605bbb20988afd003d996bb3", "author_rating": 8.0, "review_text": "As pure popcorn entertainment and the culmination of the Monsterverse saga, 'Godzilla vs. Kong' delivers the goods in an unexpectedly big way. This film is essential viewing for those who might like to watch a lizard punch an ape.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-vs-kong-hugely-entertaining", "created_at": "2021-03-24T22:20:16.047Z"}, {"movie_id": 399566, "review_id": "6064cf562476f20057ced28c", "author_rating": 7.0, "review_text": "Satisfying through and through. Also they seemed to learn from the past mistakes (with Godzilla and Godzilla: King of the Monsters) of doing too much with the human characters, here they are thankfully just window dressing for the battle between the two titans. **3.75/5**", "created_at": "2021-03-31T19:36:54.492Z"}, {"movie_id": 399566, "review_id": "6065ad5db84f94006f4b9363", "author_rating": 8.0, "review_text": "Oh Yeah!  \r\nTHE monster movie of the year is here and just how good is it!  \r\n\r\nIs the plot predictable?  Yep - I'd guessed 80% of it 2 months ago.  \r\nIs it silly?  You bet. \r\n\r\nAre the humans essential? Nah, but we didnt come here for them.\r\nWe came to see Kong and Godzilla slug it out.  And we got that!  \r\n\r\nThe scenes with the Kaiju are well thought out and choreographed (can we say that for digital fights?).  And do they ever deck it out.  \r\nThe devastation you see on the poster gives away how much of Hong Kong gets destroyed (there will be extra land available for building now). \r\n\r\nThe movie is directed and paced well - the first half sets things up for the multiple confrontation between the Kaiju; and the second half lets loose.  \r\n\r\nNone of the actors are given much to do and most seem to sleepwalk through it, but Rebecca Hall is easily the best (she is always a delight to watch), Kyle Chandler channels Coach Taylor for a couple of scenes, Julian Dennison (from Hunt for the Wilderpeople) gets some good lines and Demian Bichir is having fun as the evil rich dude (never trust rich people...in movies or real life). \r\n\r\nThe sound design and score are both on point, but everything here subsides when the Kaiju are around.  The CGI is great - and like Peter Jackson's Kong, you actually feel for the great big monkey.  \r\n\r\nThis movie is some first class popcorn, needing to be enjoyed on the biggest screen you can find.", "created_at": "2021-04-01T11:24:13.690Z"}, {"movie_id": 399566, "review_id": "6067a779924ce600292c3daf", "author_rating": 6.0, "review_text": "Godzilla vs. Kong suffers from what other versus films such as Freddy vs. Jason or the Alien vs. Predator films also suffered from. These films put too much value in humans when the audience just wants to see more of the on-screen monsters they either paid hard money or chose to stream to see. That’s why if Legendary chooses to keep this franchise going they should do All Monsters Attack or something involving Monster Island next where humans can be spectators at best and monsters wreak havoc for up to two straight hours. Stop feeding fans unbearable human excretion and trying to pass it off as Godzilla gold. \r\n\r\nFull review: https://godhatesgeeks.com/godzilla-vs-kong-review-monkey-good-humans-bad/", "created_at": "2021-04-02T23:23:37.433Z"}, {"movie_id": 399566, "review_id": "60784c751b1f3c002941ef20", "author_rating": 5.0, "review_text": "The worst part about this? Alexander Skarsgård delivering a career-low performance, over-acting (or maybe being over-directed??) nearly every single line.", "created_at": "2021-04-15T14:23:49.142Z"}, {"movie_id": 399566, "review_id": "60a614169a64c1002963ab0c", "author_rating": 10.0, "review_text": "The REAL Clash of the Titans!\r\n\r\nIt was spectacular! The two iconic monsters in Hollywood go head-to-head in an updated remake. Both a sequel AND a crossover!\r\n\r\nThe best part was when Godzilla and Kong fought in the city, with all them tall buildings. Talk about classic monster fight! Am I right?!\r\nThe second best part was when Kong came to Godzilla's aid and the two fought together against MechaGodzilla, right up to the end where Kong gave the final blow!\r\nAnd yes, I am aware that I am putting a lot of exclamation marks in my review, but only because I really enjoyed this movie and they're my way of expressing of how frickin' awesome this film was for me! Especially for personal reason...\r\nIt has been 4 months since the third lockdown here in the UK, 4 months of cinemas everywhere closed. And in the week that every cinemas reopened the first film I wanted to see was Godzilla vs Kong.\r\n\r\nI admit that there were a couple of bits that would've improved; like more screen time from Kyle Chandler.\r\nAnd that other guy was supposed to be Serizawa's estranged son, but that was never acknowledged, despite the casting.\r\nBut other than that, not only was Godzilla vs Kong the first film I've seen since the cinemas reopened but also the best film I have seen, so far!", "created_at": "2021-05-20T07:47:34.928Z"}, {"movie_id": 399566, "review_id": "60c8f35648333a002a3cabf1", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/godzilla-vs-kong-spoiler-free-review\r\n\r\n\"Godzilla vs. Kong is the return to form from the divisive MonsterVerse. Max Borenstein and Eric Pearson manage to write an uncomplicated screenplay without absurd plot points or extremely dumb character decisions, which is all I ever asked for in this franchise, even if it carries tons of formulas and cliches. No one expects an Oscar-worthy script, but something that can serve as a companion piece to the massive battles between the Titans. Adam Wingard struggles to balance the unnecessary, irrelevant side stories that unfortunately affect the film's pacing and tone, but ultimately he's able to set up each fighting sequence nicely. Action-wise, it's the best entry of the saga, by far. From the genuinely impressive, eyegasmic CGI work to the exciting, adrenaline-pumping monster fights that will leave you at the edge of your seat, this movie is the definition of pure blockbuster entertainment. Extraordinary production value, as expected, and a perfect Junkie XL's score make this a clear recommendation.\"\r\n\r\nRating: B", "created_at": "2021-06-15T18:37:10.394Z"}, {"movie_id": 399566, "review_id": "60e75115bcf8c9002f98eb38", "author_rating": 8.0, "review_text": "So after many years of flukes and alright and great movies over a decade we officially get a face off between the 2 and it kicked ass. buildings came down people died and these 2 fought a mechanical version. it is the end to a good red vs blue kinda movie.", "created_at": "2021-07-08T19:25:09.413Z"}, {"movie_id": 399566, "review_id": "60f582e1af58cb002f3abb74", "author_rating": 8.0, "review_text": "I have to admit that I expected not to like this movie. When Hollywood decides to pitch two characters, whether it’s superheroes or monsters, that are essentially good against each other it usually turns into crap. Take the absolutely abysmal Batman vs Superman for instance. Then we have Kong Skull Island which, while still being watchable, had a really lousy script.\r\n\r\nBut to my surprise I quite liked this movie. I really got worried when the movie started off with some nutcase activist that Hollywood likes to glorify. Then they had to kiss up to Communist News Network as well by giving them some product placement. Don’t use a real world news network in fiction movies please. Especially not a well known fake news and far left propaganda machine.\r\n\r\nHowever, in the end it all turned out nicely. The nutcase activist was really a nutcase and really really annoying but he still turned out to be on the side of the good guys.\r\n\r\nThe story was not altogether bad and although this story of the hollow earth is really far out fantasy more than anything else, even more than the idea of Kong and Godzilla themselves, I liked it. It was quite cool actually and it allowed for some nice special effects other than just Godzilla and Kong beating each other up and wrecking a few cities in the process.\r\n\r\nSpeaking of special effects. They are really why you watch these kind of movies. Sure a half decent story and passable acting helps but the special effects are the bulk of the enjoyment. For me the movie didn’t disappoint in this area.\r\n\r\nThey were overall very good and actually quite balanced. Well balanced considering the kind of movie. You cannot have a Godzilla movie without at least a couple of city blocks getting demolished after all. Having an actual wet navy battleship showing up I do ascribe to the usual Hollywood writer stupidity of course but for the rest it was really cool. I especially liked the hollow earth scenes and the strange landscape with all the weird creatures.\r\n\r\nWarning, spoiler ahead: The thing I really liked with the movie was that the writers didn’t go down the route of killing either Godzilla or Kong. Something I really feared and which would have reduced the movie to a rubbish rating as far as I am concerned. Instead they threw in Mechagodzilla which was quite cool albeit predictable at this point in the movie and one which united Godzilla and Kong. Also this weird, completely devoid of any (even fictional) science, link to Gidorah was quite a bit of a stretch.\r\n\r\nOverall, watching this movie was two hours well spent as far as I am concerned.", "created_at": "2021-07-19T13:49:21.496Z"}, {"movie_id": 399566, "review_id": "616c5013136545002cc45c59", "author_rating": 9.0, "review_text": "If you liked the movies with Kong and Godzilla, you will enjoy this, complete with CGI and monsters against humans. Get your popcorn and soda and put your feet up, this is entertainment in every sense of the word. ⭐⭐⭐⭐", "created_at": "2021-10-17T16:32:19.890Z"}, {"movie_id": 399566, "review_id": "630bf0eecaa508007fdd42bb", "author_rating": 1.0, "review_text": "Godzilla vs. Kong is the biggest scam since Batman v Superman: Dawn of Justice. It promises a battle of epic proportions, but doesn't have the balls to give us a winner. The late introduction of Mechagodzilla is meant to give the titular characters a common enemy, allowing them to put their differences – whatever these may be – aside and work together. They want to have their cake and eat it too.\r\n\r\nThe film tries to sell us on the idea that Earth is too small for two “alpha titans.” It doesn't occur to anyone that it might be too small for just one; then again, given that both Kong’s and Godzilla’s presence lacks weight, mass, volume, and depth, neither of them can be said to take up physical space on the planet (not to mention that most of the ‘real world’ surrounding them has been as unconvincingly rendered as they have).\r\n\r\nIt is, however, during an expedition to the so-called Hollow Earth that the VFX department really blows its CGI wad. There is no excess they won’t indulge in, and yet it’s not enough to hide the fact that Earth isn't the only hollow thing here – so is the script, which is unable to give us a single good reason why we should care about the skirmishes between a giant lizard and a giant gorilla.\r\n\r\nYou can't have two characters fight each other just because, no matter how ‘cool’ it might seem in theory; they must have a compelling motive, lest the audience loses interest in the outcome. This is such a basic concept that even the later, lesser Rocky installments understand it. But here, Godzilla and Kong just don't seem to like each other very much; even Tom and Jerry, who at least are natural enemies, have a better excuse for their enmity.\r\n\r\nTo sum up, 1) we don't know why a primate and a reptile would want to fight to the death; 2) the explanation the movie provides doesn’t make sense (I mean, Hollow Earth? Puh-lease!); 3) Kong and Godzilla are so phony-looking there is never any concern that they will hurt one another, however much they try; and 4) it's a foregone conclusion that neither is going to take a dive, needed as they are for the inevitable sequels. All things considered, why watch this movie when you can see Peter Griffin fight a giant chicken on YouTube?", "created_at": "2022-08-28T22:49:18.753Z"}, {"movie_id": 399566, "review_id": "64f7db0e5f2b8d00abcc33ad", "author_rating": 10.0, "review_text": "Godzilla vs Kong a rematch 60 years in the making . I think this is the movie a lot of people wanted to see especially seeing that the last time is to where in a movie together was in 1962.\r\n\r\nThe fights in the movie are amazing the standout being the fight in Hong Kong between Godzilla and King Kong but the boat battle and the mechagodzilla Fight are also very well done as well.  \r\n\r\nThe characters are fine noting amazing but noting awful my favorite being the mom and the daughter their relationship was very well done  overall, this movie just gave me what I wanted, which was a rematch between the two most iconic movie monsters, Godzilla and King Kong", "created_at": "2023-09-06T01:51:10.801Z"}, {"movie_id": 399566, "review_id": "605bbb20988afd003d996bb3", "author_rating": 8.0, "review_text": "As pure popcorn entertainment and the culmination of the Monsterverse saga, 'Godzilla vs. Kong' delivers the goods in an unexpectedly big way. This film is essential viewing for those who might like to watch a lizard punch an ape.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-vs-kong-hugely-entertaining", "created_at": "2021-03-24T22:20:16.047Z"}, {"movie_id": 399566, "review_id": "6064cf562476f20057ced28c", "author_rating": 7.0, "review_text": "Satisfying through and through. Also they seemed to learn from the past mistakes (with Godzilla and Godzilla: King of the Monsters) of doing too much with the human characters, here they are thankfully just window dressing for the battle between the two titans. **3.75/5**", "created_at": "2021-03-31T19:36:54.492Z"}, {"movie_id": 399566, "review_id": "6065ad5db84f94006f4b9363", "author_rating": 8.0, "review_text": "Oh Yeah!  \r\nTHE monster movie of the year is here and just how good is it!  \r\n\r\nIs the plot predictable?  Yep - I'd guessed 80% of it 2 months ago.  \r\nIs it silly?  You bet. \r\n\r\nAre the humans essential? Nah, but we didnt come here for them.\r\nWe came to see Kong and Godzilla slug it out.  And we got that!  \r\n\r\nThe scenes with the Kaiju are well thought out and choreographed (can we say that for digital fights?).  And do they ever deck it out.  \r\nThe devastation you see on the poster gives away how much of Hong Kong gets destroyed (there will be extra land available for building now). \r\n\r\nThe movie is directed and paced well - the first half sets things up for the multiple confrontation between the Kaiju; and the second half lets loose.  \r\n\r\nNone of the actors are given much to do and most seem to sleepwalk through it, but Rebecca Hall is easily the best (she is always a delight to watch), Kyle Chandler channels Coach Taylor for a couple of scenes, Julian Dennison (from Hunt for the Wilderpeople) gets some good lines and Demian Bichir is having fun as the evil rich dude (never trust rich people...in movies or real life). \r\n\r\nThe sound design and score are both on point, but everything here subsides when the Kaiju are around.  The CGI is great - and like Peter Jackson's Kong, you actually feel for the great big monkey.  \r\n\r\nThis movie is some first class popcorn, needing to be enjoyed on the biggest screen you can find.", "created_at": "2021-04-01T11:24:13.690Z"}, {"movie_id": 399566, "review_id": "6067a779924ce600292c3daf", "author_rating": 6.0, "review_text": "Godzilla vs. Kong suffers from what other versus films such as Freddy vs. Jason or the Alien vs. Predator films also suffered from. These films put too much value in humans when the audience just wants to see more of the on-screen monsters they either paid hard money or chose to stream to see. That’s why if Legendary chooses to keep this franchise going they should do All Monsters Attack or something involving Monster Island next where humans can be spectators at best and monsters wreak havoc for up to two straight hours. Stop feeding fans unbearable human excretion and trying to pass it off as Godzilla gold. \r\n\r\nFull review: https://godhatesgeeks.com/godzilla-vs-kong-review-monkey-good-humans-bad/", "created_at": "2021-04-02T23:23:37.433Z"}, {"movie_id": 399566, "review_id": "60784c751b1f3c002941ef20", "author_rating": 5.0, "review_text": "The worst part about this? Alexander Skarsgård delivering a career-low performance, over-acting (or maybe being over-directed??) nearly every single line.", "created_at": "2021-04-15T14:23:49.142Z"}, {"movie_id": 399566, "review_id": "60a614169a64c1002963ab0c", "author_rating": 10.0, "review_text": "The REAL Clash of the Titans!\r\n\r\nIt was spectacular! The two iconic monsters in Hollywood go head-to-head in an updated remake. Both a sequel AND a crossover!\r\n\r\nThe best part was when Godzilla and Kong fought in the city, with all them tall buildings. Talk about classic monster fight! Am I right?!\r\nThe second best part was when Kong came to Godzilla's aid and the two fought together against MechaGodzilla, right up to the end where Kong gave the final blow!\r\nAnd yes, I am aware that I am putting a lot of exclamation marks in my review, but only because I really enjoyed this movie and they're my way of expressing of how frickin' awesome this film was for me! Especially for personal reason...\r\nIt has been 4 months since the third lockdown here in the UK, 4 months of cinemas everywhere closed. And in the week that every cinemas reopened the first film I wanted to see was Godzilla vs Kong.\r\n\r\nI admit that there were a couple of bits that would've improved; like more screen time from Kyle Chandler.\r\nAnd that other guy was supposed to be Serizawa's estranged son, but that was never acknowledged, despite the casting.\r\nBut other than that, not only was Godzilla vs Kong the first film I've seen since the cinemas reopened but also the best film I have seen, so far!", "created_at": "2021-05-20T07:47:34.928Z"}, {"movie_id": 399566, "review_id": "60c8f35648333a002a3cabf1", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/godzilla-vs-kong-spoiler-free-review\r\n\r\n\"Godzilla vs. Kong is the return to form from the divisive MonsterVerse. Max Borenstein and Eric Pearson manage to write an uncomplicated screenplay without absurd plot points or extremely dumb character decisions, which is all I ever asked for in this franchise, even if it carries tons of formulas and cliches. No one expects an Oscar-worthy script, but something that can serve as a companion piece to the massive battles between the Titans. Adam Wingard struggles to balance the unnecessary, irrelevant side stories that unfortunately affect the film's pacing and tone, but ultimately he's able to set up each fighting sequence nicely. Action-wise, it's the best entry of the saga, by far. From the genuinely impressive, eyegasmic CGI work to the exciting, adrenaline-pumping monster fights that will leave you at the edge of your seat, this movie is the definition of pure blockbuster entertainment. Extraordinary production value, as expected, and a perfect Junkie XL's score make this a clear recommendation.\"\r\n\r\nRating: B", "created_at": "2021-06-15T18:37:10.394Z"}, {"movie_id": 399566, "review_id": "60e75115bcf8c9002f98eb38", "author_rating": 8.0, "review_text": "So after many years of flukes and alright and great movies over a decade we officially get a face off between the 2 and it kicked ass. buildings came down people died and these 2 fought a mechanical version. it is the end to a good red vs blue kinda movie.", "created_at": "2021-07-08T19:25:09.413Z"}, {"movie_id": 399566, "review_id": "60f582e1af58cb002f3abb74", "author_rating": 8.0, "review_text": "I have to admit that I expected not to like this movie. When Hollywood decides to pitch two characters, whether it’s superheroes or monsters, that are essentially good against each other it usually turns into crap. Take the absolutely abysmal Batman vs Superman for instance. Then we have Kong Skull Island which, while still being watchable, had a really lousy script.\r\n\r\nBut to my surprise I quite liked this movie. I really got worried when the movie started off with some nutcase activist that Hollywood likes to glorify. Then they had to kiss up to Communist News Network as well by giving them some product placement. Don’t use a real world news network in fiction movies please. Especially not a well known fake news and far left propaganda machine.\r\n\r\nHowever, in the end it all turned out nicely. The nutcase activist was really a nutcase and really really annoying but he still turned out to be on the side of the good guys.\r\n\r\nThe story was not altogether bad and although this story of the hollow earth is really far out fantasy more than anything else, even more than the idea of Kong and Godzilla themselves, I liked it. It was quite cool actually and it allowed for some nice special effects other than just Godzilla and Kong beating each other up and wrecking a few cities in the process.\r\n\r\nSpeaking of special effects. They are really why you watch these kind of movies. Sure a half decent story and passable acting helps but the special effects are the bulk of the enjoyment. For me the movie didn’t disappoint in this area.\r\n\r\nThey were overall very good and actually quite balanced. Well balanced considering the kind of movie. You cannot have a Godzilla movie without at least a couple of city blocks getting demolished after all. Having an actual wet navy battleship showing up I do ascribe to the usual Hollywood writer stupidity of course but for the rest it was really cool. I especially liked the hollow earth scenes and the strange landscape with all the weird creatures.\r\n\r\nWarning, spoiler ahead: The thing I really liked with the movie was that the writers didn’t go down the route of killing either Godzilla or Kong. Something I really feared and which would have reduced the movie to a rubbish rating as far as I am concerned. Instead they threw in Mechagodzilla which was quite cool albeit predictable at this point in the movie and one which united Godzilla and Kong. Also this weird, completely devoid of any (even fictional) science, link to Gidorah was quite a bit of a stretch.\r\n\r\nOverall, watching this movie was two hours well spent as far as I am concerned.", "created_at": "2021-07-19T13:49:21.496Z"}, {"movie_id": 399566, "review_id": "616c5013136545002cc45c59", "author_rating": 9.0, "review_text": "If you liked the movies with Kong and Godzilla, you will enjoy this, complete with CGI and monsters against humans. Get your popcorn and soda and put your feet up, this is entertainment in every sense of the word. ⭐⭐⭐⭐", "created_at": "2021-10-17T16:32:19.890Z"}, {"movie_id": 399566, "review_id": "630bf0eecaa508007fdd42bb", "author_rating": 1.0, "review_text": "Godzilla vs. Kong is the biggest scam since Batman v Superman: Dawn of Justice. It promises a battle of epic proportions, but doesn't have the balls to give us a winner. The late introduction of Mechagodzilla is meant to give the titular characters a common enemy, allowing them to put their differences – whatever these may be – aside and work together. They want to have their cake and eat it too.\r\n\r\nThe film tries to sell us on the idea that Earth is too small for two “alpha titans.” It doesn't occur to anyone that it might be too small for just one; then again, given that both Kong’s and Godzilla’s presence lacks weight, mass, volume, and depth, neither of them can be said to take up physical space on the planet (not to mention that most of the ‘real world’ surrounding them has been as unconvincingly rendered as they have).\r\n\r\nIt is, however, during an expedition to the so-called Hollow Earth that the VFX department really blows its CGI wad. There is no excess they won’t indulge in, and yet it’s not enough to hide the fact that Earth isn't the only hollow thing here – so is the script, which is unable to give us a single good reason why we should care about the skirmishes between a giant lizard and a giant gorilla.\r\n\r\nYou can't have two characters fight each other just because, no matter how ‘cool’ it might seem in theory; they must have a compelling motive, lest the audience loses interest in the outcome. This is such a basic concept that even the later, lesser Rocky installments understand it. But here, Godzilla and Kong just don't seem to like each other very much; even Tom and Jerry, who at least are natural enemies, have a better excuse for their enmity.\r\n\r\nTo sum up, 1) we don't know why a primate and a reptile would want to fight to the death; 2) the explanation the movie provides doesn’t make sense (I mean, Hollow Earth? Puh-lease!); 3) Kong and Godzilla are so phony-looking there is never any concern that they will hurt one another, however much they try; and 4) it's a foregone conclusion that neither is going to take a dive, needed as they are for the inevitable sequels. All things considered, why watch this movie when you can see Peter Griffin fight a giant chicken on YouTube?", "created_at": "2022-08-28T22:49:18.753Z"}, {"movie_id": 399566, "review_id": "64f7db0e5f2b8d00abcc33ad", "author_rating": 10.0, "review_text": "Godzilla vs Kong a rematch 60 years in the making . I think this is the movie a lot of people wanted to see especially seeing that the last time is to where in a movie together was in 1962.\r\n\r\nThe fights in the movie are amazing the standout being the fight in Hong Kong between Godzilla and King Kong but the boat battle and the mechagodzilla Fight are also very well done as well.  \r\n\r\nThe characters are fine noting amazing but noting awful my favorite being the mom and the daughter their relationship was very well done  overall, this movie just gave me what I wanted, which was a rematch between the two most iconic movie monsters, Godzilla and King Kong", "created_at": "2023-09-06T01:51:10.801Z"}, {"movie_id": 399566, "review_id": "605bbb20988afd003d996bb3", "author_rating": 8.0, "review_text": "As pure popcorn entertainment and the culmination of the Monsterverse saga, 'Godzilla vs. Kong' delivers the goods in an unexpectedly big way. This film is essential viewing for those who might like to watch a lizard punch an ape.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-vs-kong-hugely-entertaining", "created_at": "2021-03-24T22:20:16.047Z"}, {"movie_id": 399566, "review_id": "6064cf562476f20057ced28c", "author_rating": 7.0, "review_text": "Satisfying through and through. Also they seemed to learn from the past mistakes (with Godzilla and Godzilla: King of the Monsters) of doing too much with the human characters, here they are thankfully just window dressing for the battle between the two titans. **3.75/5**", "created_at": "2021-03-31T19:36:54.492Z"}, {"movie_id": 399566, "review_id": "6065ad5db84f94006f4b9363", "author_rating": 8.0, "review_text": "Oh Yeah!  \r\nTHE monster movie of the year is here and just how good is it!  \r\n\r\nIs the plot predictable?  Yep - I'd guessed 80% of it 2 months ago.  \r\nIs it silly?  You bet. \r\n\r\nAre the humans essential? Nah, but we didnt come here for them.\r\nWe came to see Kong and Godzilla slug it out.  And we got that!  \r\n\r\nThe scenes with the Kaiju are well thought out and choreographed (can we say that for digital fights?).  And do they ever deck it out.  \r\nThe devastation you see on the poster gives away how much of Hong Kong gets destroyed (there will be extra land available for building now). \r\n\r\nThe movie is directed and paced well - the first half sets things up for the multiple confrontation between the Kaiju; and the second half lets loose.  \r\n\r\nNone of the actors are given much to do and most seem to sleepwalk through it, but Rebecca Hall is easily the best (she is always a delight to watch), Kyle Chandler channels Coach Taylor for a couple of scenes, Julian Dennison (from Hunt for the Wilderpeople) gets some good lines and Demian Bichir is having fun as the evil rich dude (never trust rich people...in movies or real life). \r\n\r\nThe sound design and score are both on point, but everything here subsides when the Kaiju are around.  The CGI is great - and like Peter Jackson's Kong, you actually feel for the great big monkey.  \r\n\r\nThis movie is some first class popcorn, needing to be enjoyed on the biggest screen you can find.", "created_at": "2021-04-01T11:24:13.690Z"}, {"movie_id": 399566, "review_id": "6067a779924ce600292c3daf", "author_rating": 6.0, "review_text": "Godzilla vs. Kong suffers from what other versus films such as Freddy vs. Jason or the Alien vs. Predator films also suffered from. These films put too much value in humans when the audience just wants to see more of the on-screen monsters they either paid hard money or chose to stream to see. That’s why if Legendary chooses to keep this franchise going they should do All Monsters Attack or something involving Monster Island next where humans can be spectators at best and monsters wreak havoc for up to two straight hours. Stop feeding fans unbearable human excretion and trying to pass it off as Godzilla gold. \r\n\r\nFull review: https://godhatesgeeks.com/godzilla-vs-kong-review-monkey-good-humans-bad/", "created_at": "2021-04-02T23:23:37.433Z"}, {"movie_id": 399566, "review_id": "60784c751b1f3c002941ef20", "author_rating": 5.0, "review_text": "The worst part about this? Alexander Skarsgård delivering a career-low performance, over-acting (or maybe being over-directed??) nearly every single line.", "created_at": "2021-04-15T14:23:49.142Z"}, {"movie_id": 399566, "review_id": "60a614169a64c1002963ab0c", "author_rating": 10.0, "review_text": "The REAL Clash of the Titans!\r\n\r\nIt was spectacular! The two iconic monsters in Hollywood go head-to-head in an updated remake. Both a sequel AND a crossover!\r\n\r\nThe best part was when Godzilla and Kong fought in the city, with all them tall buildings. Talk about classic monster fight! Am I right?!\r\nThe second best part was when Kong came to Godzilla's aid and the two fought together against MechaGodzilla, right up to the end where Kong gave the final blow!\r\nAnd yes, I am aware that I am putting a lot of exclamation marks in my review, but only because I really enjoyed this movie and they're my way of expressing of how frickin' awesome this film was for me! Especially for personal reason...\r\nIt has been 4 months since the third lockdown here in the UK, 4 months of cinemas everywhere closed. And in the week that every cinemas reopened the first film I wanted to see was Godzilla vs Kong.\r\n\r\nI admit that there were a couple of bits that would've improved; like more screen time from Kyle Chandler.\r\nAnd that other guy was supposed to be Serizawa's estranged son, but that was never acknowledged, despite the casting.\r\nBut other than that, not only was Godzilla vs Kong the first film I've seen since the cinemas reopened but also the best film I have seen, so far!", "created_at": "2021-05-20T07:47:34.928Z"}, {"movie_id": 399566, "review_id": "60c8f35648333a002a3cabf1", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/godzilla-vs-kong-spoiler-free-review\r\n\r\n\"Godzilla vs. Kong is the return to form from the divisive MonsterVerse. Max Borenstein and Eric Pearson manage to write an uncomplicated screenplay without absurd plot points or extremely dumb character decisions, which is all I ever asked for in this franchise, even if it carries tons of formulas and cliches. No one expects an Oscar-worthy script, but something that can serve as a companion piece to the massive battles between the Titans. Adam Wingard struggles to balance the unnecessary, irrelevant side stories that unfortunately affect the film's pacing and tone, but ultimately he's able to set up each fighting sequence nicely. Action-wise, it's the best entry of the saga, by far. From the genuinely impressive, eyegasmic CGI work to the exciting, adrenaline-pumping monster fights that will leave you at the edge of your seat, this movie is the definition of pure blockbuster entertainment. Extraordinary production value, as expected, and a perfect Junkie XL's score make this a clear recommendation.\"\r\n\r\nRating: B", "created_at": "2021-06-15T18:37:10.394Z"}, {"movie_id": 399566, "review_id": "60e75115bcf8c9002f98eb38", "author_rating": 8.0, "review_text": "So after many years of flukes and alright and great movies over a decade we officially get a face off between the 2 and it kicked ass. buildings came down people died and these 2 fought a mechanical version. it is the end to a good red vs blue kinda movie.", "created_at": "2021-07-08T19:25:09.413Z"}, {"movie_id": 399566, "review_id": "60f582e1af58cb002f3abb74", "author_rating": 8.0, "review_text": "I have to admit that I expected not to like this movie. When Hollywood decides to pitch two characters, whether it’s superheroes or monsters, that are essentially good against each other it usually turns into crap. Take the absolutely abysmal Batman vs Superman for instance. Then we have Kong Skull Island which, while still being watchable, had a really lousy script.\r\n\r\nBut to my surprise I quite liked this movie. I really got worried when the movie started off with some nutcase activist that Hollywood likes to glorify. Then they had to kiss up to Communist News Network as well by giving them some product placement. Don’t use a real world news network in fiction movies please. Especially not a well known fake news and far left propaganda machine.\r\n\r\nHowever, in the end it all turned out nicely. The nutcase activist was really a nutcase and really really annoying but he still turned out to be on the side of the good guys.\r\n\r\nThe story was not altogether bad and although this story of the hollow earth is really far out fantasy more than anything else, even more than the idea of Kong and Godzilla themselves, I liked it. It was quite cool actually and it allowed for some nice special effects other than just Godzilla and Kong beating each other up and wrecking a few cities in the process.\r\n\r\nSpeaking of special effects. They are really why you watch these kind of movies. Sure a half decent story and passable acting helps but the special effects are the bulk of the enjoyment. For me the movie didn’t disappoint in this area.\r\n\r\nThey were overall very good and actually quite balanced. Well balanced considering the kind of movie. You cannot have a Godzilla movie without at least a couple of city blocks getting demolished after all. Having an actual wet navy battleship showing up I do ascribe to the usual Hollywood writer stupidity of course but for the rest it was really cool. I especially liked the hollow earth scenes and the strange landscape with all the weird creatures.\r\n\r\nWarning, spoiler ahead: The thing I really liked with the movie was that the writers didn’t go down the route of killing either Godzilla or Kong. Something I really feared and which would have reduced the movie to a rubbish rating as far as I am concerned. Instead they threw in Mechagodzilla which was quite cool albeit predictable at this point in the movie and one which united Godzilla and Kong. Also this weird, completely devoid of any (even fictional) science, link to Gidorah was quite a bit of a stretch.\r\n\r\nOverall, watching this movie was two hours well spent as far as I am concerned.", "created_at": "2021-07-19T13:49:21.496Z"}, {"movie_id": 399566, "review_id": "616c5013136545002cc45c59", "author_rating": 9.0, "review_text": "If you liked the movies with Kong and Godzilla, you will enjoy this, complete with CGI and monsters against humans. Get your popcorn and soda and put your feet up, this is entertainment in every sense of the word. ⭐⭐⭐⭐", "created_at": "2021-10-17T16:32:19.890Z"}, {"movie_id": 399566, "review_id": "630bf0eecaa508007fdd42bb", "author_rating": 1.0, "review_text": "Godzilla vs. Kong is the biggest scam since Batman v Superman: Dawn of Justice. It promises a battle of epic proportions, but doesn't have the balls to give us a winner. The late introduction of Mechagodzilla is meant to give the titular characters a common enemy, allowing them to put their differences – whatever these may be – aside and work together. They want to have their cake and eat it too.\r\n\r\nThe film tries to sell us on the idea that Earth is too small for two “alpha titans.” It doesn't occur to anyone that it might be too small for just one; then again, given that both Kong’s and Godzilla’s presence lacks weight, mass, volume, and depth, neither of them can be said to take up physical space on the planet (not to mention that most of the ‘real world’ surrounding them has been as unconvincingly rendered as they have).\r\n\r\nIt is, however, during an expedition to the so-called Hollow Earth that the VFX department really blows its CGI wad. There is no excess they won’t indulge in, and yet it’s not enough to hide the fact that Earth isn't the only hollow thing here – so is the script, which is unable to give us a single good reason why we should care about the skirmishes between a giant lizard and a giant gorilla.\r\n\r\nYou can't have two characters fight each other just because, no matter how ‘cool’ it might seem in theory; they must have a compelling motive, lest the audience loses interest in the outcome. This is such a basic concept that even the later, lesser Rocky installments understand it. But here, Godzilla and Kong just don't seem to like each other very much; even Tom and Jerry, who at least are natural enemies, have a better excuse for their enmity.\r\n\r\nTo sum up, 1) we don't know why a primate and a reptile would want to fight to the death; 2) the explanation the movie provides doesn’t make sense (I mean, Hollow Earth? Puh-lease!); 3) Kong and Godzilla are so phony-looking there is never any concern that they will hurt one another, however much they try; and 4) it's a foregone conclusion that neither is going to take a dive, needed as they are for the inevitable sequels. All things considered, why watch this movie when you can see Peter Griffin fight a giant chicken on YouTube?", "created_at": "2022-08-28T22:49:18.753Z"}, {"movie_id": 399566, "review_id": "64f7db0e5f2b8d00abcc33ad", "author_rating": 10.0, "review_text": "Godzilla vs Kong a rematch 60 years in the making . I think this is the movie a lot of people wanted to see especially seeing that the last time is to where in a movie together was in 1962.\r\n\r\nThe fights in the movie are amazing the standout being the fight in Hong Kong between Godzilla and King Kong but the boat battle and the mechagodzilla Fight are also very well done as well.  \r\n\r\nThe characters are fine noting amazing but noting awful my favorite being the mom and the daughter their relationship was very well done  overall, this movie just gave me what I wanted, which was a rematch between the two most iconic movie monsters, Godzilla and King Kong", "created_at": "2023-09-06T01:51:10.801Z"}, {"movie_id": 399566, "review_id": "605bbb20988afd003d996bb3", "author_rating": 8.0, "review_text": "As pure popcorn entertainment and the culmination of the Monsterverse saga, 'Godzilla vs. Kong' delivers the goods in an unexpectedly big way. This film is essential viewing for those who might like to watch a lizard punch an ape.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-vs-kong-hugely-entertaining", "created_at": "2021-03-24T22:20:16.047Z"}, {"movie_id": 399566, "review_id": "6064cf562476f20057ced28c", "author_rating": 7.0, "review_text": "Satisfying through and through. Also they seemed to learn from the past mistakes (with Godzilla and Godzilla: King of the Monsters) of doing too much with the human characters, here they are thankfully just window dressing for the battle between the two titans. **3.75/5**", "created_at": "2021-03-31T19:36:54.492Z"}, {"movie_id": 399566, "review_id": "6065ad5db84f94006f4b9363", "author_rating": 8.0, "review_text": "Oh Yeah!  \r\nTHE monster movie of the year is here and just how good is it!  \r\n\r\nIs the plot predictable?  Yep - I'd guessed 80% of it 2 months ago.  \r\nIs it silly?  You bet. \r\n\r\nAre the humans essential? Nah, but we didnt come here for them.\r\nWe came to see Kong and Godzilla slug it out.  And we got that!  \r\n\r\nThe scenes with the Kaiju are well thought out and choreographed (can we say that for digital fights?).  And do they ever deck it out.  \r\nThe devastation you see on the poster gives away how much of Hong Kong gets destroyed (there will be extra land available for building now). \r\n\r\nThe movie is directed and paced well - the first half sets things up for the multiple confrontation between the Kaiju; and the second half lets loose.  \r\n\r\nNone of the actors are given much to do and most seem to sleepwalk through it, but Rebecca Hall is easily the best (she is always a delight to watch), Kyle Chandler channels Coach Taylor for a couple of scenes, Julian Dennison (from Hunt for the Wilderpeople) gets some good lines and Demian Bichir is having fun as the evil rich dude (never trust rich people...in movies or real life). \r\n\r\nThe sound design and score are both on point, but everything here subsides when the Kaiju are around.  The CGI is great - and like Peter Jackson's Kong, you actually feel for the great big monkey.  \r\n\r\nThis movie is some first class popcorn, needing to be enjoyed on the biggest screen you can find.", "created_at": "2021-04-01T11:24:13.690Z"}, {"movie_id": 399566, "review_id": "6067a779924ce600292c3daf", "author_rating": 6.0, "review_text": "Godzilla vs. Kong suffers from what other versus films such as Freddy vs. Jason or the Alien vs. Predator films also suffered from. These films put too much value in humans when the audience just wants to see more of the on-screen monsters they either paid hard money or chose to stream to see. That’s why if Legendary chooses to keep this franchise going they should do All Monsters Attack or something involving Monster Island next where humans can be spectators at best and monsters wreak havoc for up to two straight hours. Stop feeding fans unbearable human excretion and trying to pass it off as Godzilla gold. \r\n\r\nFull review: https://godhatesgeeks.com/godzilla-vs-kong-review-monkey-good-humans-bad/", "created_at": "2021-04-02T23:23:37.433Z"}, {"movie_id": 399566, "review_id": "60784c751b1f3c002941ef20", "author_rating": 5.0, "review_text": "The worst part about this? Alexander Skarsgård delivering a career-low performance, over-acting (or maybe being over-directed??) nearly every single line.", "created_at": "2021-04-15T14:23:49.142Z"}, {"movie_id": 399566, "review_id": "60a614169a64c1002963ab0c", "author_rating": 10.0, "review_text": "The REAL Clash of the Titans!\r\n\r\nIt was spectacular! The two iconic monsters in Hollywood go head-to-head in an updated remake. Both a sequel AND a crossover!\r\n\r\nThe best part was when Godzilla and Kong fought in the city, with all them tall buildings. Talk about classic monster fight! Am I right?!\r\nThe second best part was when Kong came to Godzilla's aid and the two fought together against MechaGodzilla, right up to the end where Kong gave the final blow!\r\nAnd yes, I am aware that I am putting a lot of exclamation marks in my review, but only because I really enjoyed this movie and they're my way of expressing of how frickin' awesome this film was for me! Especially for personal reason...\r\nIt has been 4 months since the third lockdown here in the UK, 4 months of cinemas everywhere closed. And in the week that every cinemas reopened the first film I wanted to see was Godzilla vs Kong.\r\n\r\nI admit that there were a couple of bits that would've improved; like more screen time from Kyle Chandler.\r\nAnd that other guy was supposed to be Serizawa's estranged son, but that was never acknowledged, despite the casting.\r\nBut other than that, not only was Godzilla vs Kong the first film I've seen since the cinemas reopened but also the best film I have seen, so far!", "created_at": "2021-05-20T07:47:34.928Z"}, {"movie_id": 399566, "review_id": "60c8f35648333a002a3cabf1", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/godzilla-vs-kong-spoiler-free-review\r\n\r\n\"Godzilla vs. Kong is the return to form from the divisive MonsterVerse. Max Borenstein and Eric Pearson manage to write an uncomplicated screenplay without absurd plot points or extremely dumb character decisions, which is all I ever asked for in this franchise, even if it carries tons of formulas and cliches. No one expects an Oscar-worthy script, but something that can serve as a companion piece to the massive battles between the Titans. Adam Wingard struggles to balance the unnecessary, irrelevant side stories that unfortunately affect the film's pacing and tone, but ultimately he's able to set up each fighting sequence nicely. Action-wise, it's the best entry of the saga, by far. From the genuinely impressive, eyegasmic CGI work to the exciting, adrenaline-pumping monster fights that will leave you at the edge of your seat, this movie is the definition of pure blockbuster entertainment. Extraordinary production value, as expected, and a perfect Junkie XL's score make this a clear recommendation.\"\r\n\r\nRating: B", "created_at": "2021-06-15T18:37:10.394Z"}, {"movie_id": 399566, "review_id": "60e75115bcf8c9002f98eb38", "author_rating": 8.0, "review_text": "So after many years of flukes and alright and great movies over a decade we officially get a face off between the 2 and it kicked ass. buildings came down people died and these 2 fought a mechanical version. it is the end to a good red vs blue kinda movie.", "created_at": "2021-07-08T19:25:09.413Z"}, {"movie_id": 399566, "review_id": "60f582e1af58cb002f3abb74", "author_rating": 8.0, "review_text": "I have to admit that I expected not to like this movie. When Hollywood decides to pitch two characters, whether it’s superheroes or monsters, that are essentially good against each other it usually turns into crap. Take the absolutely abysmal Batman vs Superman for instance. Then we have Kong Skull Island which, while still being watchable, had a really lousy script.\r\n\r\nBut to my surprise I quite liked this movie. I really got worried when the movie started off with some nutcase activist that Hollywood likes to glorify. Then they had to kiss up to Communist News Network as well by giving them some product placement. Don’t use a real world news network in fiction movies please. Especially not a well known fake news and far left propaganda machine.\r\n\r\nHowever, in the end it all turned out nicely. The nutcase activist was really a nutcase and really really annoying but he still turned out to be on the side of the good guys.\r\n\r\nThe story was not altogether bad and although this story of the hollow earth is really far out fantasy more than anything else, even more than the idea of Kong and Godzilla themselves, I liked it. It was quite cool actually and it allowed for some nice special effects other than just Godzilla and Kong beating each other up and wrecking a few cities in the process.\r\n\r\nSpeaking of special effects. They are really why you watch these kind of movies. Sure a half decent story and passable acting helps but the special effects are the bulk of the enjoyment. For me the movie didn’t disappoint in this area.\r\n\r\nThey were overall very good and actually quite balanced. Well balanced considering the kind of movie. You cannot have a Godzilla movie without at least a couple of city blocks getting demolished after all. Having an actual wet navy battleship showing up I do ascribe to the usual Hollywood writer stupidity of course but for the rest it was really cool. I especially liked the hollow earth scenes and the strange landscape with all the weird creatures.\r\n\r\nWarning, spoiler ahead: The thing I really liked with the movie was that the writers didn’t go down the route of killing either Godzilla or Kong. Something I really feared and which would have reduced the movie to a rubbish rating as far as I am concerned. Instead they threw in Mechagodzilla which was quite cool albeit predictable at this point in the movie and one which united Godzilla and Kong. Also this weird, completely devoid of any (even fictional) science, link to Gidorah was quite a bit of a stretch.\r\n\r\nOverall, watching this movie was two hours well spent as far as I am concerned.", "created_at": "2021-07-19T13:49:21.496Z"}, {"movie_id": 399566, "review_id": "616c5013136545002cc45c59", "author_rating": 9.0, "review_text": "If you liked the movies with Kong and Godzilla, you will enjoy this, complete with CGI and monsters against humans. Get your popcorn and soda and put your feet up, this is entertainment in every sense of the word. ⭐⭐⭐⭐", "created_at": "2021-10-17T16:32:19.890Z"}, {"movie_id": 399566, "review_id": "630bf0eecaa508007fdd42bb", "author_rating": 1.0, "review_text": "Godzilla vs. Kong is the biggest scam since Batman v Superman: Dawn of Justice. It promises a battle of epic proportions, but doesn't have the balls to give us a winner. The late introduction of Mechagodzilla is meant to give the titular characters a common enemy, allowing them to put their differences – whatever these may be – aside and work together. They want to have their cake and eat it too.\r\n\r\nThe film tries to sell us on the idea that Earth is too small for two “alpha titans.” It doesn't occur to anyone that it might be too small for just one; then again, given that both Kong’s and Godzilla’s presence lacks weight, mass, volume, and depth, neither of them can be said to take up physical space on the planet (not to mention that most of the ‘real world’ surrounding them has been as unconvincingly rendered as they have).\r\n\r\nIt is, however, during an expedition to the so-called Hollow Earth that the VFX department really blows its CGI wad. There is no excess they won’t indulge in, and yet it’s not enough to hide the fact that Earth isn't the only hollow thing here – so is the script, which is unable to give us a single good reason why we should care about the skirmishes between a giant lizard and a giant gorilla.\r\n\r\nYou can't have two characters fight each other just because, no matter how ‘cool’ it might seem in theory; they must have a compelling motive, lest the audience loses interest in the outcome. This is such a basic concept that even the later, lesser Rocky installments understand it. But here, Godzilla and Kong just don't seem to like each other very much; even Tom and Jerry, who at least are natural enemies, have a better excuse for their enmity.\r\n\r\nTo sum up, 1) we don't know why a primate and a reptile would want to fight to the death; 2) the explanation the movie provides doesn’t make sense (I mean, Hollow Earth? Puh-lease!); 3) Kong and Godzilla are so phony-looking there is never any concern that they will hurt one another, however much they try; and 4) it's a foregone conclusion that neither is going to take a dive, needed as they are for the inevitable sequels. All things considered, why watch this movie when you can see Peter Griffin fight a giant chicken on YouTube?", "created_at": "2022-08-28T22:49:18.753Z"}, {"movie_id": 399566, "review_id": "64f7db0e5f2b8d00abcc33ad", "author_rating": 10.0, "review_text": "Godzilla vs Kong a rematch 60 years in the making . I think this is the movie a lot of people wanted to see especially seeing that the last time is to where in a movie together was in 1962.\r\n\r\nThe fights in the movie are amazing the standout being the fight in Hong Kong between Godzilla and King Kong but the boat battle and the mechagodzilla Fight are also very well done as well.  \r\n\r\nThe characters are fine noting amazing but noting awful my favorite being the mom and the daughter their relationship was very well done  overall, this movie just gave me what I wanted, which was a rematch between the two most iconic movie monsters, Godzilla and King Kong", "created_at": "2023-09-06T01:51:10.801Z"}]