[{"movie_id": 15720, "review_id": "630b081adcb6a3008359aec8", "author_rating": 4.0, "review_text": "At a relatively modest 106 minutes The Man from Elysian Fields is still a little too long – and yet I can see why director George Hickenlooper would hesitate to edit out the scenes where Mick Jagger shares screen time with Anjelica Huston. \r\n\r\nThese scenes add nothing and lead nowhere, but darn it, they have Mick Jagger and Anjelica Huston in them. The problem is that the Jagger character is little more than a narrator, and should exist only to introduce Andy García into the world of male escorting; whatever he does in his spare time, and with whom he does it, has no bearing whatsoever on the plot and is therefore of zero interest to the audience.\r\n\r\nAnyway, luckily for Andy, though rather unbelievably in general, his experience as a glorified gigolo involves one single solitary customer who, as expected, is rich and lonely, but also very beautiful and about his same age, and to cap it all, married to his hero, played by James Coburn, who not only is quite at peace with his wife procuring herself a sexual surrogate, but also willing to let García help him rewrite his next novel. Uh huh.\r\n\r\nImprobabilities aside, the whole triangle business is the best part of the movie (with Coburn effortlessly evoking a rugged, Hemingway-esque manliness), and its potential for both dramatic and comedic material renders García’s previously established domestic life disposable were it not that the script needs it to provide the sappy happy ending (and that Hickenlooper couldn’t bear to part even with Julianna Margulies goes a long way in explaining his attachment to Jagger and Huston).\r\n\r\nThe time devoted to either sub-plot would have been better spent monitoring Garcia's progress as a writer. No doubt his bittersweet experiences with Coburn and the latter's wife would provide him with much better material (not to mention a solid tree to lean against, in terms of professional learning) than his previous novel, a sub-Ira Levin thriller called Hitler's Child; however, the characters are authors only nominally, and the extent of their literary collaboration is reduced to substituting one \"microcosm\" for another (migrant workers instead of Roman slaves).", "created_at": "2022-08-28T06:15:54.265Z"}]