[{"movie_id": 1576, "review_id": "5fa75fa89ac535003fb737f2", "author_rating": 8.0, "review_text": "I originally watched \"Resident Evil\" at a movie theater when it was first released in 2002. I hadn't played the games. There was no Rotten Tomatoes and I didn't read reviews back then so I went in blind. And I utterly enjoyed the movie: the story, the action sequences, the underground \"Hive,\" Mila Jovovich and Michelle Rodriguez kicking serious ass, and more. \r\n\r\nPanned by critics (36% RT) but liked by users (67% RT), Resident Evil was one of the first examples of how mainstream critics just don't \"get\" horror. Movies that try to be artsy get great reviews even as key elements fall flat for the rest of us. The recent \"Beach House\" is a perfect example of this -- it was loved by critics (81% RT) and panned by users (28%). \r\n\r\nUnfortunately, the rest of the \"Resident Evil\" sequels except for a few moments, rarely captured that first movie's originality and allure.  Instead, check out the writer/director's excellent previous outing \"Event Horizon.\"", "created_at": "2020-11-08T03:02:00.320Z"}, {"movie_id": 1576, "review_id": "5fb31e50ec4552003df97b0e", "author_rating": 6.0, "review_text": "Been several years since I last watched this one and I guess it's passable but not very scary (I personally don't find zombies all that frightening) and the CGI creatures, while okay for its time, didn't add to the tension either. At least some of the action was alright and not bad following around Milla Jovovich. **2.75/5**", "created_at": "2020-11-17T00:50:24.338Z"}, {"movie_id": 1576, "review_id": "60dd14ee2d3721002c4ee9e2", "author_rating": 8.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nI understand that zombies have been done to death by the time I wrote this, but I've always enjoyed them, and I understand that, as a movie franchise, \"Resident Evil\" is fairly laughed at, but the first movie was somewhat promising, even if it didn't REALLY have anything to do with the video game.\r\n\r\nIf nothing else, Milla Jojovich and Michelle Rodriguez are quality actors and carry the movie very well, though I honestly think the cast does well.\r\n\r\nI'm all for unique movies, and, at the time, this felt like one.  It is well remembered for a particular death scene.\r\n\r\nIf you like zombies, then you should like this one.  It just has this evil corporation trope looming in the background.\r\n\r\nIt does a great job of slowly escalating the situation, if in a slightly absurd way.", "created_at": "2021-07-01T01:05:50.886Z"}, {"movie_id": 1576, "review_id": "63001a8c532acb00844c93b0", "author_rating": 8.0, "review_text": "**While not a perfect movie, Resident Evil stands above many other entries in the zombie and video game genres.**\r\n\r\nThe first of a 6-movie series, Resident Evil stays grounded in its horror roots more than the rest. This movie takes every opportunity to keep the audience tense and on edge with zombies, monsters, deadly lasers, and jump scares. When most video game adaptations result in embarrassing movies that should have gone straight to streaming, Resident Evil put together a solid storyline with great action, fun characters, gross zombies, and entertaining horror.", "created_at": "2022-08-19T23:19:40.854Z"}, {"movie_id": 1576, "review_id": "64d195736d4c97012e8c383a", "author_rating": 7.0, "review_text": "Good movie brought the video game game to life. Could have been better. I was glad to see this movie made though. Always thought this would be good for a movie series.", "created_at": "2023-08-08T01:08:03.746Z"}]