[{"movie_id": 46838, "review_id": "51a43c93760ee33bdc0c0ec3", "author_rating": null, "review_text": "A bit of a breath of fresh air is this in a low budget and yet well produced comedy horror that gives Død Snø and the likes a run for their money. Tucker & Dale Vs Evil follows two redneck hillbillies- Tucker (Alan Tudyk) and Dale (Tyler Labine) who head into the woods in the Appellation Mountains so that they can drink some beers, do some fishing and fix up a worn down cabin to turn it into the holiday home of their dreams.\r\n\r\nAt the same time a group of preppy college kids are on a camping trip into the same woods also to have a good time. After a couple of run ins with the hillbillies, they assume that they must be your stereotypical inbred manic chainsaw wielding killers right out of Deliverance or The Texas Chainsaw Massacre. So when one of the kids Allison (Katrina Bowden) is rescued from drowning by the hillbillies, prejudice and paranoia reign supreme with the others mistaking it as her being hauled away in a kidnapping attempt. So they embark on a mission to rescue her from her saviours with hilarious consequences.\r\n\r\nDespite the premise of the movie being based on one long running joke of a massive misunderstanding, the story remains fresh and the scenes extremely funny for the majority. I'm not aware of any other movie that has done this type of role reversal with hillbillies in this type of scenario and managed to blend in the right amount of comedy with horror and gore. In fact across all the genres, it is not often that you get to see the perspective of the 'bad guys' (far from it in this film).\r\n\r\nThe best moments come from the writing as we follow the bickering between Tucker and Dale as a bromance emerges on screen. Both Tudyk (aka Steve the Pirate from Dodgeball) and Labine impress making the characters extremely likeable and charming so that by the end you really do care what happens to them. Bowden plays her part solidly as well and definitely brings some eye candy to the film!\r\n\r\nMost of these types of films tend to lose their drama element but this keeps the anticipation and as I said, you end up really caring about what is going to happen to the characters. However, the only major fault that I can pick out is that despite all this, it does begin to fade as a spectacle in the last 15 minutes as they focus a bit too much on the back story and tying up loose ends when what they were doing up to that point was more than enough in my books.\r\n\r\nIt's usually hard to combine the right amount of comedy and horror without creating a somewhat tacky result so credit must go to the new guy on the block- director and co-writer Eli Craig. If you are looking for a unique comedy horror that has a chance of hitting cult status/settling in nicely behind Shaun of the Dead then you need look no further than this.\r\n\r\nFor more reviews, visit www.ireviewfilms.com", "created_at": "2013-05-28T05:11:47.482Z"}, {"movie_id": 46838, "review_id": "5d09d0e7c3a3681ddc1e4d72", "author_rating": 9.0, "review_text": "Bloody and Bloody Hilarious.\r\n\r\nTucker & Dale vs Evil is directed by Eli Craig who also co-writes the screenplay with Morgan Jurgenson. It stars Alan Tudyk, Tyler Labine, Katrina Bowden and Jesse Moss. Music is by Michael Shields and Andrew Kaiser and cinematography by David Geddes. Plot has Tudyk and Labine as two harmless mountain/country men who head to their newly acquired vacation home in the woods to fix it up and get some R & R. But after a misunderstanding at a roadside store with some college kids, who think Tucker & Dale are hillbilly psychopaths, the wheels are set in motion for a bloody battle for survival, but who for?!\r\n\r\nIn 1996 Scream came slashing forward to inject witty life into a fading horror genre, with freshness and inventive splinters from the slasher formula, Wes Craven's movie rocked the horror faithful's world. Tucker & Dale vs Evil will not have the same impact, its limited release and low budget worth ensured it never had a chance of being a big thing, but still it's the freshest horror/comedy to have come out since Scream made its bloody bow at the box office.\r\n\r\nIt's such a simple idea at the core, you have to wonder why it wasn't thought of before? Craig and Jurgenson have flipped the age old Hillbilly Killers vs Preppy College Kids idea on its head, and in the process smothered it gleefully with dark humour, laugh out loud moments and inventive deaths. There's also some social comedy nestled nicely in the narrative, big points about first impressions and ideas of stereotypes, and hell yes! There's even an opposites attract arc - though that admittedly helps to bog the picture down as the central joke premise runs out of steam towards the end. In fact were it not for a relatively sloppy finale, this would surely be falling into sub-genre classic status. Thankfully all that comes before it is so full of vim and vigour, blood and bluff and fun and frolics, it's not hard to forgive the debut director his one misstep.\r\n\r\nThe neat trick is having the film unfold from the Hillbillies viewpoint, where the carnage that unspools gets increasingly difficult for them to explain, this in spite of their innocence. Each death is logical to the college kids who go on the attack when one of their number, they think, is kidnapped. And it's logical to us the audience as well, were it not for us being privy to these wonderfully funny sequence of events, we too would have them hung, drawn and quartered after a guilty verdict was reached in 10 seconds. This is the ultimate horror/comedy flip-flop movie. So many funny sequences light up the picture, with a chainsaw scene one of the finest moments to have ever graced a horror comedy movie, but the dialogue, too, is not found wanting in the fun and charming department. Cast are on top form, with Tudyk & Labine a most agreeable double act, where their comedy timing is impeccable, and Bowden & Moss are more than just pretty faces.\r\n\r\nCraig (Sally Field's son) has started with a bang, if he can top this then he is a name to really get excited about. If he can't top it? Well he will at least always have one of the best horror comedy movies on his CV. Yes it's that good, fans of Scream, Severance, Shaun of the Dead and Zombieland should seek it out post haste. 8.5/10", "created_at": "2019-06-19T06:06:31.053Z"}, {"movie_id": 46838, "review_id": "6300175a7d41aa007e386f29", "author_rating": 8.0, "review_text": "**Overall : a self-aware satire that takes joy in ridiculing overused horror movie tropes in hilarious and, at times, heartwarming ways.**\r\n\r\nTucker and Dale vs. Evil is a delightful satire of stereotypical teens trying to survive an attacker in the woods horror movies. I laughed nonstop from start to finish. This dark comedy hilariously mocks horror trope after horror trope producing a wonderfully funny film that horror and cinema fans will most appreciate. Still, anyone who has ever seen a slasher movie would also find it entertaining and amusing. Even with its dumb fun, Tucker and Dale somehow finds a way to make you care for the main characters and root for their survival. This movie is a hidden gem for any movie fan.", "created_at": "2022-08-19T23:06:02.879Z"}]