[{"movie_id": 232572, "review_id": "5697ae95c3a3683af0002472", "author_rating": 8.0, "review_text": "> Rediscovering the old friendship in a long walk.\r\n\r\nI am very impressed for the recent films of Robert Redford, but the timing was really bad. His one man show, 'All is Lost' that overlapped with the popular flick 'Life of Pi', and now this with 'Tracks' and 'Wild'. People tend to choose the big one and forget the small one, or simply point the finger to the other one for having similarity. Anyway, I wanted to see it, and I did that.\r\n\r\nLike the Pacific Crest Trail from the movie 'Wild' which's from the western part of the Unites States, this one is from the east called Appalachian Trail and both these are the biographical films. The six month trail to cover approximately 2,000 kilometers. Even learning the odds are not in their favour, the two old men embark their journey with the fixed mind to achieve the goal.\r\n\r\nI did not know it was a screen adaptation of the real event. I won't consider it a great movie, not even for the year 2015, but it was fun to watch. A sweet little movie that I expected something, but it delivered another thing, overall it satisfied me. Maybe the reason I'm showing concern for this is it is a comedy, so looked lot like an entertainment product than the inspiring theme. But you can't deny the seriousness apart from those fun bits that it was based on someone's memoir. Especially knowing those two men are in the twilight of their lives, the attempt was admirable.\r\n\r\n> \"No, writers don't retire. We either drink ourselves\r\n> to death or blow our brains out.\"\r\n\r\nI always love the children and elder people movies with quality narration. Children's films are fun to watch and elder's teaches us their experiences, sometimes sympathy wins for their struggles. There were a couple big female star characters who are the part of the story, but not in the main narration. This film centres only two characters that wonderfully played by the 80 year-old Robert Redford as a 60 year-old Bill Bryson and the other one was Nick Nolte as Katz who actually stole the show. Yep, I must agree Nick Nolte is the backbone of the movie, otherwise the people would have turned away without showing any interest in this including myself.\r\n\r\nThis film was not all about the hiking or achieving something out of all the sudden in their old age. It let's us a few glimpses of the beautiful landscapes like those we saw in the 17th, 18th century paintings. Despite it being a comedy, mostly it dealt with the facts. Rediscovering the lost friendship and uncovering the old memories. Like the entire life was brought back for a few minutes in the words for us with their sweet recalls.\r\n\r\nIt is an R rated flick, because the majority of the jokes were adult's. If you decide to watch it, I suggest to give a try with your best friend, because you both might be seeing the future of yourselves. My finishing statement is, it is definitely not a must see, but it won't disappoint either if you're not anticipating in a large scale adventure, that includes emotions and severeness. If it was from before the 90s, probably considered as a good film, but in this modern CGI world, movies about life and self-discovery is fading away from the young people's mind. All they want is superheroes, loud music, fancy costumes, and of course violence.\r\n\r\n7/10", "created_at": "2016-01-14T14:20:05.907Z"}]