[{"movie_id": 853, "review_id": "5b353c659251413c5802717f", "author_rating": 7.0, "review_text": "***War of the rats in crumbling Stalingrad during WWII***\r\n\r\nRELEASED IN 2001 and directed by Jean-Jacques Annaud, \"Enemy at the Gates\" takes place in the last four months of 1942 during the pivotal Battle of Stalingrad. Russian troops are carted in by the literal trainloads as the Germans attack/bomb the city. Once the dust clears the situation settles into a more personal battle of sharpshooting wills. A lowly young Russian soldier named Vassili (Jude Law) distinguishes himself for his shooting skills and is promoted as a national hero to motivate the Russian cause. After numerous German officers are assassinated, Major König (Ed Harris), the top German sniper, is assigned to seek out and eliminate Vassili.\r\n\r\nMost WWII films take place on the Western Front whereas \"Enemy\" is one of only two mainline films I can think of that address the Eastern front, the other being Sam Peckinpah's underrated \"Cross of Iron\" (1977).\r\n\r\nThree things stuck in my mind after seeing “Enemy at the Gates” years ago: (1.) The opening sequence where the Russian troops are boated across the Volga to join the fight is extremely harrowing, not far removed from the opening D-Day invasion in “Saving Private Ryan” (1998), but different. “Enemy” is worth viewing for this sequence alone. (2.) The city-in-rubble sets with bodies strewn everywhere had a lasting impression on me as did the scurrying-like-rats-through-the-rubble warfare. (3.) Some may find this weird, but I always remembered the discreet lovemaking scene while the soldiers lain in the rubble trying to sleep. I'm not sure why this left an impression, maybe because it struck me as so real: Men & women would be drawn to one another and mate even in the worst possible scenarios.\r\n\r\nThe film was based on the book \"War of the Rats\" by David L. Robbins and thus intentionally provokes the imagery of human rats scurrying through the debris. The cast also includes Joseph Fiennes as the political officer who elevates Vassili to hero status via his pamphlets and articles, while Rachel Weisz plays the romantic interest between the two. Ron Perlman is also on hand in a limited role as Vassili's sharpshooting comrade.\r\n\r\nAs with any film based on historical events there are facts-obsessed critics who decry the lack of authenticity in this or that detail (e.g. \"The zippers on the trousers aren't right, blasphemy!!\"), but \"Enemy\" gets the gist correct and, besides, it motivates the viewer to research the actual Battle of Stalingrad. What more can you ask for? \r\n\r\nThe fact is Vassili had 260 verified Nazi kills and played a key role in motivating the Russians to victory in the Battle of Stalingrad, the largest and bloodiest battle in the history of warfare (with roughly 2 million killed, wounded or captured). The movie effectively shows how the Russian combatants weren't necessarily professionally trained soldiers; many of them were peasants, workers, teachers, mailmen, farmers, etc. They knew they could die the next morning hence they celebrated (and made love) while they could. Stalingrad was one of the major turning points of World War II; from then on it was all downhill for Germany.\r\n\r\nFINAL WORD: \"Enemy at the Gates\" details an oft-ignored important aspect of WWII, the Eastern front. It has several memorable scenes, especially the opening crossing of the Volga and also a clever sequence involving a large shard of reflective glass.\r\n\r\nTHE FILM RUNS 2 hours, 11 minutes and was shot entirely in Germany (Brandenburg and Bavaria).\r\n\r\nGRADE: B+", "created_at": "2018-06-28T19:52:05.190Z"}]