[{"movie_id": 153, "review_id": "52f31fe5925141132708e326", "author_rating": null, "review_text": "Ok movie Lovers. If you didn't like The Life Aquatic with Steve Zissou, then don't even bother with Lost in Translation. The jokes are dry and the dialogue is weak. At least in Life Aquatic they wore funny outfits. Being a world traveler myself I could appreciate the jet lag and overall moping around thru out the whole film. You will definatly feel lost. Although I found myself laughing out loud a few times at Bill Murray and his quips, BY NO MEANS should the average movie fans think this is a comedy. It is an independent art film and should be treated as so.", "created_at": "2014-02-06T05:38:45.682Z"}, {"movie_id": 153, "review_id": "5abaed2e9251411e9a0089e3", "author_rating": 9.0, "review_text": "True love transcends sexual expression\r\n\r\nRELEASED IN 2003 and written & directed by Sofia Coppola, \"Lost in Translation\" was a big hit in 2003-2004. It's about an aging actor, Bob Harris (Bill Murray), who's in Tokyo doing commercials for a week. His home-life is mundane and he's experiencing a bit of the mid-life crisis. He runs into an attractive 20 year-old something woman, Charlotte (Scarlett Johansson), who's in Tokyo with her photog husband (), but he's gone most of the time and takes her for granted.\r\n\r\nThis is a mature, semi-arty film and you have to be in the right mode/maturity level to appreciate it. I said \"maturity level\" and not \"age\" because some people are pretty mature at 16 while others are completely immature at 50. For me, the story, music and visuals pulled me into these characters’ temporary world for the 102-minute runtime.\r\n\r\nThe film succeeds as an amusing social commentary and a deep love story, as well as a visual/musical delight. I'll only focus on the deep love element. It's been noted that the story originated from Sofia's experience with an aging actor when she was younger, possibly Harrison Ford. Sofia is obviously Charlotte, while Charlotte's husband is Sofia's ex and Anna Faris plays the role of the other woman, which would be Cameron Diaz in real life. So there's a lot of reality in the picture.\r\n\r\nBut it's not just a cathartic piece. Sofia has some potent insights to offer on the nature of true romantic love. For one, love transcends age difference (Bob is about 35 years older than Charlotte). For another, it's possible to be married and experience romantic love for another. Not that this ever justifies adultery, it's just a fact. As the story progresses you'll see how comfortable Bob and Charlotte are with each other, how they look into each other's eyes, the windows of the soul, in a profoundly naked sense. This can happen in the flash of a moment where the two people just KNOW, or it can take place over a period of time, as is the case with Bob and Charlotte (which is a handful of days). They see the same things and speak the same language, and I don't mean English. But this presents a conundrum for Bob. Bob COULD take advantage of Charlotte because she's so lonely in a sea of people, which is one of the movie's themes; she's also inexperienced and vulnerable. Will he or won't he take advantage? \r\n\r\n***SPOILER ALERT*** Don't read further if you haven't seen the film.\r\n\r\nIf Bob loves Charlotte so much, not to mention his wife & kids, why does he have a one-night stand with the lounge singer (Catherine Lambert)? Bob slept with her to release sexual tension that had been building up between him and Charlotte. This was a moral failure, but keep in mind he was drunk (another failure but, have pity, he was going through a mid-life crisis). While all this is obvious, it goes deeper...\r\n\r\nBob could have taken advantage of Charlotte if he wanted to but didn't because he genuinely loved her, which is revealed at the end. Bob could sleep with the singer because he didn't love her (not that it justifies his actions). Simply put, true love transcends sexual expression and sexual union does not equal love.\r\n\r\nThe ending is powerful and tear-inducing. No CGI, explosion or action stunt can compare. It's just an older man and a too-young woman embracing in the midst of 20 million strangers. Tears flow, kisses are given and unheard words are whispered. They could never be a couple, even if they weren't married, and they know they'll never see each other again, at least on this physical plane, but their love has been expressed and will be treasured for eternity.\r\n\r\nGRADE: A", "created_at": "2018-03-28T01:17:34.619Z"}, {"movie_id": 153, "review_id": "5d6778d16743fa0011d62249", "author_rating": 10.0, "review_text": "Lost in Translation is one of my all-time favorite movies. The film grabbed me when I first saw it in the theater (unusual for back then, but my cineplex got this one in) and since I've watched it dozens of times. Bill Murray and Scarlet Johansson are both great and Sofia Coppola's direction taking in the sights and sounds of Tokyo (a city I've always been curious about and wanted to visit) was amazing.", "created_at": "2019-08-29T07:03:45.821Z"}, {"movie_id": 153, "review_id": "5f499e8337b3a90036dfd7ba", "author_rating": 7.0, "review_text": "The first time I watched Lost in Translation, many years ago, I really liked it. I am partial to quiet movies, which feature a good ensemble cast, wit and good dialogue. Often, as with this movie, the story is told simply from start to finish without complex bounces  back and forth with flashbacks, or made complicated with multiple perspectives. And in fact, I bought a used copy of Lost in Translation on DVD.\r\n\r\nAfter all this time I finally watched it again recently. I still like the movie. I love watching Bill Murray and he gives a fine restrained performance of an actor past his prime and riding on name recognition. Scarlett Johansson does great also. They are witty and display a subtle sense of humor.\r\n\r\nStill, I did not like it as much as I remember from before; something seemed lacking. Then I watched the Behind the Scenes extra video. You know, The Making of...  and I realized I likedjust as much as I did the movie itself.  It made me think that maybe the movie was too laid back. When Scarlett’s character Charlotte spoke to her husband, they were quiet and civil, when she spoke to Bill Murray as Bob, they were quiet and civil, and when Bob spoke to his wife on the phone back home they were quiet and civil, even when she was clearly getting irritated.  Perhaps the film would have benefited from a little passion, a little more intensity here and there. \r\n\r\nI am glad I watched it a second time, but I don’t expect I will hold onto the DVD for a future viewing.", "created_at": "2020-08-29T00:17:07.616Z"}]