[{"movie_id": 643586, "review_id": "604796630102c90044f0d70c", "author_rating": 8.0, "review_text": "As it goes in the film world, there will be plenty of critics who will think they are “too good” for a ridiculous movie like “Willy’s Wonderland,” an outrageous, audience-pleasing popcorn flick with an 80s slasher vibe. This film is one that feels like it’s made expressly for fans of the horror-comedy genre, and its terrific premise, badass hero, and throwback grindhouse sentiment check all the boxes for a successful journey to becoming a midnight cult classic.\r\n\r\nA quiet loner (Nicolas Cage) becomes stranded in a remote town when his car breaks down. Unable to pay for the needed repairs, he agrees to spend the night cleaning up the local abandoned family fun center known as Willy’s Wonderland. Little does he know that he has just signed up to be the janitor for a place believed to be haunted. Things haven’t been the same since the rumors about missing children (and evil animatronics) took over the town. As the night progresses, the man discovers that the life-sized fuzzy mascots have minds of their own, and he must fight to the death in order to survive to see the sun rise.\r\n\r\nThe story is solid all around and if you suspend disbelief, the plot is actually plausible. There are supernatural elements and lots of humor, and the Janitor is the horror hero we didn’t know we needed. Kevin Lewis has a terrific eye for direction, a natural at knowing exactly what the audience wants to see and how they want to see it (and delivering just that). The pacing is excellent, too. The film ends with a set-up for an eventual sequel that I really, really hope happens.\r\n\r\nThe most appropriate word I can find to describe this movie, and one that fits in almost any discussion of the film, is “rad.” The awesome, primitive puppet costumes for Willy the Weasel and his tribe of murderous pals (Tito the Turtle, Siren Sara, Ozzie the Ostrich, and Knighty Knight, to name a few) are absolutely hysterical, the perfect pair for the equally amusing low budget horror effects. Even better is Cage, who brings that certain je ne sais quoi to his character, a soda-guzzling, pinball-loving man of few words (the actor doesn’t speak any dialogue in the movie).\r\n\r\nThis isn’t a movie that you’re supposed to take seriously, and that’s what adds to its charm. “Willy’s Wonderland” is tons of bloody fun, especially if you want to watch Nic Cage beat the shit out of possessed serial killer animatronics. And quite frankly, isn’t that all of us?", "created_at": "2021-03-09T15:38:11.269Z"}]