[{"movie_id": 13022, "review_id": "5d43e771a9117f0016ef8a13", "author_rating": 8.0, "review_text": "Never smile at a crocodile. Don't be taken in by his welcome grin.\r\n\r\nRogue is co-produced, written and directed by Greg Mclean (Wolf Creek). It stars Michael Vartan, Radha Mitchell, Sam Worthington & John Jarratt. The film is inspired by the true story of \"Sweetheart\", a giant Australian crocodile that terrorised boats in a 5 year period between 1974 & 1979. Plot sees travel journalist Pete McKell (Vartan) in the Northern Territory of Australia finishing off his latest feature. With time to kill he joins a river boat cruise led by spunky local lass Kate Ryan (Mitchell). So along with assorted other tourists, they set off up river. Where after a tricky encounter with a couple of local nuisances, one of the tourists spies a distress flare further up stream, then another, and another. As captain of the boat, Kate is duty bound to respond to aid anyone who may be in distress on the waters. However, this means straying into \"sacred waters\" and before they know it, they are in the middle of the hunting ground of a gigantic crocodile - who promptly attacks the boat and forces the group onto the nearest mini island, an island that is in tidal waters and the tide is coming in...\r\n\r\nUpon viewing Rouge it would seem that it may be one of the most unfortunate horror releases of the time. It barely got a theatrical release outside of its own country (practically one week in selected cinemas in America & Europe), and it came out at a time when killer-croc movies were appearing almost every other month; Primeval, Black Water and Lake Placid 2 (good grief) all \"surfaced\" (hrr hrr hrr) during 2007 to take a \"chomp\" (ok I'll stop now) of the movie watching public. This following on from the sub-genre of aquatic reptile horror movies already being well served by Steve Miner's Lake Placid (1999) & Lewis Teague's Alligator (1980), both of which have huge fan bases. It's all relevant because Rogue happens to be the best of the bunch, a snappy (sorry, couldn't resist), scary, fun and slickly produced Aussie movie. It's sickening that reams of sub-standard horror remakes get wide distribution whilst something like this, that deserves the chance at least, can't. The Weinstein Bothers should be ashamed of themselves for the treatment of Mclean's film.\r\n\r\nStraight away we should make clear that, as its certification suggests, Rouge is not particularly bloody. Those in need of sequence after sequence of a crocodile tearing humans limb from limb need not seek this film out. While it is in no way able to live with Lake Placid in terms of being \"intentionally\" humorous, thus comedy seekers should approach with caution, what Rogue does offer is a movie that's tightly structured and paced to precision. Packed with suspense, Mclean affords the characters some time to actually impact on the story. The first half hour is technically sublime, as we get to know the various folk on board the boat, we are treated to gorgeous cinematography from Will Gibson (location the estuaries of the Northern Territory), accompanied by one of the most pleasingly orchestral scores ever laid down for a creature feature (François Tetaz - with the nods to Jaws being just fine). All of this of course serves to offer up the calm before the inevitable storm, from where Mclean then follows the marker set by Jaws by not giving us full sight of the croc. It's the ultimate tease until the attacks start, but even then its mostly teasing suggestion, so the tension mounts as we couple it with our own imagination.\r\n\r\nWhat unfolds from here is a series of set pieces as our stranded group try to avoid becoming crocodile lunch. Here normally a film of this ilk shows dumb people doing dumb things, but Mclean shows respect to the genre and its fans by having some of these folk do silly yet understandable things, thus the scares are elicited by way of believable reactions. And of course the situation brings out the best and worst from most of them since peril has a funny way of doing this to a human being. Also of note here is that Mclean doesn't make the croc a monster, this is merely a hungry animal protecting its territory. A quick piece of dialogue earlier in the story had pointed to hunters possibly being the ones who fired the distress flares, as croc goes about his snarly way, it doesn't hurt to remember this pertinent fact. The cast all give credible performances, notably the handsome hero in waiting Vartan, Mitchell (who was becoming something of a screen queen darling back then) & Jarratt, who shows us a different string to his acting bow than the one he played as loony Mick Taylor in Wolf Creek.\r\n\r\nThe movie has flaws, but they are few and far between. The croc on appearance will irk some people, so it's true that Mclean could have done better there, while one \"WTF\" turn of events loses impact as the director isn't as bold to follow through like he did in Wolf Creek, but they are forgivable irks. For as we find ourselves holding our breaths during the creepy and practically silent finale, that culminates in a fine \"B\" movie bit of outrageousness, we realise that above all else it's been the suspense and ominous foreboding that made this one damn effective thriller. Mclean appeared to be holding a grudge against his native country, his first two films back then were hardly enticing the tourists to explore the gorgeous lands of Australia! What ever his means or motivation, long may it continue if he keeps producing films like this. Lets hope that his future projects are not as ignored as this one was, because for sure there is a very good director here and it would be tragic should a talent be burned by how his movie was handled.\r\n\r\nEvocative beauty blends with \"B\" movie thrills for a devilishly great time. 8/10", "created_at": "2019-08-02T07:34:09.494Z"}]