[{"movie_id": 493529, "review_id": "64271aa09cc67b05796af5e8", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-dungeons-dragons-honor-among-thieves-is-a-delightful-surprise/\r\n\r\n\"DUNGEONS & DRAGONS: HONOR AMONG THIEVES is one of the best fantasy films of the most recent years. Chris Pine is the MVP of an incredibly charming cast with such natural chemistry that the comedic moments become truly hilarious - the graveyard scene will be replayed over and over again. An adventure blockbuster in all its purity, containing action set pieces filled with fantastical elements and accompanied by remarkable visual effects and score. One of the most fun, enjoyable, surprising theater experiences of the year so far. Impossible not to recommend it to any type of viewer.\"\r\n\r\nRating: B+", "created_at": "2023-03-31T17:38:40.603Z"}, {"movie_id": 493529, "review_id": "642a8ec79cc67b059cc4f97d", "author_rating": 7.0, "review_text": "Now I really did enjoy this, but let's not for a moment pretend that it has much originality to it. We start with a scene borrowed from \"Jurassic Park\" (1993) before getting introduced to the wise-cracking \"Edgin\" (Chris Pine) who has been incarcerated in an impregnable prison with his pal \"Holga\" (Michelle Rodriguez). They're at a sort of parole board hearing awaiting the arrival of \"Jarnathan\" for whom they have a rather surprising use! What now follows in an exciting and quickly paced series of escapades that sees our escapees try to reconcile with his daughter \"Kira\" (Chloe Coleman) whom they left in the capable - they thought - hands of their pal \"Forge\" (Hugh Grant). It turns out that he has his own agenda, and together with the mysterious \"Sofina\" (Daisy Head) is working on a plan to garner untold riches. That latter creature, though, has her own agenda too - a much more malevolent and dastardly one. \"Edgin\" and \"Holga\" have to find a magical helmet in order to spring his daughter and so recruiting the rather hapless sorceror \"Simon\" (Justice Smith) and the shape-shifting \"Doric\" (Sophia Lillis) set off in search of the legendary warrior \"Xenk\" (Regé-Jean Page) and perilous adventures beckon. This actually works well as an entertaining, episodic, collection of short stories that pitch our heroes agains a wonderfully chubby dragon, some dead but undead soldiers and along the way treats us to bits of \"Journey to the Centre of the Earth\" by way of \"Maze Runner\". \"Robin Hood\" and some stunningly presented magical duels worthy of Edgar Allan Poe. There is plenty of pith in the script - a bit of sarcasm never goes wrong; the cast genuinely seem to be having fun as their quest lurches from the frying pan to the fire each time and there is a suitably conniving effort from Grant to top it all off and keep us interested. I was a little disappointed in Page. He doesn't really have so much to do, and features rather sparingly - but Pine shows something of his versatility as an actor (perhaps not so much with his lute) and the whole thing delivers an amusing ensemble effort that passes 2¼ hours predictably, but nonetheless enjoyably. I could have done with more dragons and sorcery, but the visual effects are still put to good use to support a character-led, light-hearted, drama that is really only worth seeing on a big screen. This is good fun - and they even spelled \"honour\" properly in the title!", "created_at": "2023-04-03T08:31:03.580Z"}, {"movie_id": 493529, "review_id": "643fad9bdd471607c1811bcc", "author_rating": 8.0, "review_text": "The numerous manuals on my shelves for 1st to 5e speak volumes of my familiarity with the game, as does the novels I own, and the numerous D&D computer games I've played, so I was ecstatic seeing the places, people, and creatures I know very well. I've heard others who have played the game say they wished they had done a movie about characters like Elminster, Drizzt Do'Urden, or Alias instead. While they would have been nice to see, those characters are from the lore not the game. What I was more hoping for was that the characters in this movie felt like the characters the players play, the adventures they go on, and the antics they get themselves into. This movie felt like that in spades, and it was an absolute joy to see. I watched this and was constantly reminded of the crazy things I did as a player or watched others do as their DM, and more importantly the fun we had playing the game we all loved. This is why I give it my highest recommendation to all others who have played the game, and especially to those who have not so they may see for themselves what Dungeons & Dragons is really about. 8/10", "created_at": "2023-04-19T09:00:11.203Z"}, {"movie_id": 493529, "review_id": "6444c91fa06efe05c4a53b5c", "author_rating": 8.0, "review_text": "Based on the legendary role-playing game, “Dungeons & Dragons: Honor Among Thieves” is nothing like what I anticipated and much better than I expected. This irresistible fantasy adventure has a healthy dose of good humor, playful charm, and is easily accessible to all who love imaginary worlds filled with wizards, sorcerers, warlocks, knights, and fire-breathing dragons.\r\n\r\nCharismatic thief Edgin (Chris Pine) and his band of unlikely adventurers (including Holga (Michelle Rodriguez) the barbarian) undertake an epic heist to retrieve a lost relic and to liberate his daughter (Chloe Coleman) from Forge’s (Hugh Grant) castle. Things go dangerously awry when they run afoul of the wrong people, but the group must work together to overcome seemingly never-ending obstacles as they continue their important quest.\r\n\r\nWhile directors John Francis Daley and Jonathan Goldstein stay true to the origins of the game, prior knowledge of Dungeons & Dragons isn’t necessary. The film explains everything you need to know, making this an action adventure that’s appropriate for everyone. It’s surprising just how accessible this movie is. You don’t have to know the rules of the game to get a real kick out of this one. I’m sure there are plenty of Easter eggs hidden around for the gamers, but it’s not so insider that the uninitiated can’t understand what’s going on. This is definitely one of the film’s greatest strengths.\r\n\r\nThe story (with a script by Goldstein, Daley, and Michael Gilio) is solid too, with well-developed characters and irreverent humor that keeps the movie from becoming just another based-on-a-game throwaway. There’s a ton of heart and genuine emotion, which is elevated by the terrific cast. The actors play off each other well, giving a human element to what thankfully is not just a bunch of dumb CGI. You can feel the real connection between Edgin and Holga, best friends who always have each other’s backs, and Rodriguez and Pine’s chemistry finds the perfect groove. Grant, who is having a career resurgence lately, is as delightful as ever as the rogue Forge Fitzwilliam, as is Justice Smith as amateur sorcerer Simon and Sophia Lillis as shape shifting tiefling druid Doric. Most shocking is that Pine isn’t doing yet another version of his annoying shtick here, which in itself is a massive achievement.\r\n\r\nThe pacing is brisk and the special effects are well done, even if the finale is stretched a little thin. I found it easy to become engrossed in the mythical world of D&D not only because the movie looks great visually, but the characters are appealing, too. There’s plenty to root for.\r\n\r\nEven if you think you aren’t a fan of the fantasy genre, I suggest you give “Dungeons & Dragons: Honor Among Thieves” a try. This playful, character-driven adventure offers a ton of magical fun at the movies.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / www.ScreenZealots.com**", "created_at": "2023-04-23T05:58:55.912Z"}, {"movie_id": 493529, "review_id": "6463a2470f365500e20cd102", "author_rating": 8.0, "review_text": "Dungeons & Dragons: Honor Among Thieves is a great movie that strikes a perfect balance between high fantasy and comedy.\r\n\r\nThe screenplay for the movie was pretty average in terms of the overall plot, but the individual story beats and set pieces really carried the movie forward. What makes the screenplay stand out is the creativity behind each character, giving them interesting scenes and moments to shine. The dialogue was sharp and witty, filled with great laughs throughout. However, some of the comedy was very generic, with jokes and physical comedy that have been done a dozen times over.\r\n\r\nThe performances in the film were very solid, with Chris Pine stealing the show as the lead. Pine was extremely witty and charismatic, with excellent comedic timing. Michelle Rodriguez, while playing a pretty flat character, had incredible action scenes. Rege-Jean Page was a standout in every scene he was in, with over-the-top and hilarious moments that left me in stitches. Justice Smith, who hasn't been one of my favorite actors, did well here as a great comedic character. Sophia Lillis, while not getting a ton of time to shine in terms of her acting chops, was amazing in her action set pieces, especially in the long sequence where her character shape shifts while escaping from the castle.\r\n\r\nThe direction of Dungeons & Dragons: Honor Among Thieves was surprisingly stellar. The action was sharp and well-choreographed, with minimal cuts allowing the audience to really get a larger grasp of what was happening. The film balanced comedy and high fantasy elements really well. While the shots weren't overly creative, the movie looked fantastic with beautiful landscapes and above-average CGI.\r\n\r\nIn conclusion, Dungeons & Dragons: Honor Among Thieves is a great movie that exceeded my expectations. With a creative screenplay, solid performances, and fantastic direction, it deserves to be seen on the big screen.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-05-16T15:33:27.274Z"}, {"movie_id": 493529, "review_id": "646bba8154a09801728ad7c9", "author_rating": 6.0, "review_text": "**_Rebooting the sword & sorcery series with Chris Pine and Michelle Rodriguez_** \r\n\r\nA former member of the Harpers turned thief (Pine) amasses a group of unique individuals in order to acquire a magic relic, The Helm of Disjunction, and get his daughter back from a conman Lord (Hugh Grant) and his Red Wizard accomplice (Daisy Head). The adventurers include a barbarian (Rodriguez), an amateur sorcerer (Justice Smith), a shape-changing tiefling (Sophia Lillis) and a noble paladin (Regé-Jean Page).\r\n\r\n\"Dungeons & Dragons: Honor Among Thieves” (2023) reboots the trilogy that ran from 2000-2012. It’s easily the best film on a technical level but, story-wise, I prefer the previous two, “Wrath of the Dragon God” (2005) and “The Book of Vile Darkness” (2012), which are more serious.\r\n\r\nLike the first one from 2000, it telegraphs from the get-go that it's not to be taken too seriously. If you can roll with the campy air, it’s an amusing throwaway fantasy flick. Imagine the gaudiness of \"Star Wars\" (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you'd have a good idea of what this movie has to offer.\r\n\r\nSo, it’s a fun, entertaining adventure-fantasy with a good cast and the highlight of petite Sophia Lillis as the elf-like tiefling, but it’s overlong and needed more depth. Plus, there are too many glaring borrowings from other movies, like the frozen-land prison from “Star Trek VI: The Undiscovered Country,” the bald witch-sorceress from “Conan the Barbarian” (2011), Magneto’s helmet from the “X-Men” flicks, bits from the “Thor” and “Guardians of the Galaxy” movies, etc.\r\n\r\nThe film runs 2 hours, 14 minutes, and was shot in Iceland and Northern Ireland.\r\n\r\nGRADE: B-/C+", "created_at": "2023-05-22T18:54:57.210Z"}, {"movie_id": 493529, "review_id": "649102dac3c891010ca658ed", "author_rating": 7.0, "review_text": "Entertaining enough fantasy/adventure that features a fun script and seems accessible to both fans of D&D and those, like myself, who know very little about it. Also enjoyed the cast with Chris Pine showing his usual charisma and worked nicely opposite Michelle Rodriguez. Did lag a bit in the middle but the finale was good. **3.5/5**", "created_at": "2023-06-20T01:37:30.533Z"}, {"movie_id": 493529, "review_id": "64271aa09cc67b05796af5e8", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-dungeons-dragons-honor-among-thieves-is-a-delightful-surprise/\r\n\r\n\"DUNGEONS & DRAGONS: HONOR AMONG THIEVES is one of the best fantasy films of the most recent years. Chris Pine is the MVP of an incredibly charming cast with such natural chemistry that the comedic moments become truly hilarious - the graveyard scene will be replayed over and over again. An adventure blockbuster in all its purity, containing action set pieces filled with fantastical elements and accompanied by remarkable visual effects and score. One of the most fun, enjoyable, surprising theater experiences of the year so far. Impossible not to recommend it to any type of viewer.\"\r\n\r\nRating: B+", "created_at": "2023-03-31T17:38:40.603Z"}, {"movie_id": 493529, "review_id": "642a8ec79cc67b059cc4f97d", "author_rating": 7.0, "review_text": "Now I really did enjoy this, but let's not for a moment pretend that it has much originality to it. We start with a scene borrowed from \"Jurassic Park\" (1993) before getting introduced to the wise-cracking \"Edgin\" (Chris Pine) who has been incarcerated in an impregnable prison with his pal \"Holga\" (Michelle Rodriguez). They're at a sort of parole board hearing awaiting the arrival of \"Jarnathan\" for whom they have a rather surprising use! What now follows in an exciting and quickly paced series of escapades that sees our escapees try to reconcile with his daughter \"Kira\" (Chloe Coleman) whom they left in the capable - they thought - hands of their pal \"Forge\" (Hugh Grant). It turns out that he has his own agenda, and together with the mysterious \"Sofina\" (Daisy Head) is working on a plan to garner untold riches. That latter creature, though, has her own agenda too - a much more malevolent and dastardly one. \"Edgin\" and \"Holga\" have to find a magical helmet in order to spring his daughter and so recruiting the rather hapless sorceror \"Simon\" (Justice Smith) and the shape-shifting \"Doric\" (Sophia Lillis) set off in search of the legendary warrior \"Xenk\" (Regé-Jean Page) and perilous adventures beckon. This actually works well as an entertaining, episodic, collection of short stories that pitch our heroes agains a wonderfully chubby dragon, some dead but undead soldiers and along the way treats us to bits of \"Journey to the Centre of the Earth\" by way of \"Maze Runner\". \"Robin Hood\" and some stunningly presented magical duels worthy of Edgar Allan Poe. There is plenty of pith in the script - a bit of sarcasm never goes wrong; the cast genuinely seem to be having fun as their quest lurches from the frying pan to the fire each time and there is a suitably conniving effort from Grant to top it all off and keep us interested. I was a little disappointed in Page. He doesn't really have so much to do, and features rather sparingly - but Pine shows something of his versatility as an actor (perhaps not so much with his lute) and the whole thing delivers an amusing ensemble effort that passes 2¼ hours predictably, but nonetheless enjoyably. I could have done with more dragons and sorcery, but the visual effects are still put to good use to support a character-led, light-hearted, drama that is really only worth seeing on a big screen. This is good fun - and they even spelled \"honour\" properly in the title!", "created_at": "2023-04-03T08:31:03.580Z"}, {"movie_id": 493529, "review_id": "643fad9bdd471607c1811bcc", "author_rating": 8.0, "review_text": "The numerous manuals on my shelves for 1st to 5e speak volumes of my familiarity with the game, as does the novels I own, and the numerous D&D computer games I've played, so I was ecstatic seeing the places, people, and creatures I know very well. I've heard others who have played the game say they wished they had done a movie about characters like Elminster, Drizzt Do'Urden, or Alias instead. While they would have been nice to see, those characters are from the lore not the game. What I was more hoping for was that the characters in this movie felt like the characters the players play, the adventures they go on, and the antics they get themselves into. This movie felt like that in spades, and it was an absolute joy to see. I watched this and was constantly reminded of the crazy things I did as a player or watched others do as their DM, and more importantly the fun we had playing the game we all loved. This is why I give it my highest recommendation to all others who have played the game, and especially to those who have not so they may see for themselves what Dungeons & Dragons is really about. 8/10", "created_at": "2023-04-19T09:00:11.203Z"}, {"movie_id": 493529, "review_id": "6444c91fa06efe05c4a53b5c", "author_rating": 8.0, "review_text": "Based on the legendary role-playing game, “Dungeons & Dragons: Honor Among Thieves” is nothing like what I anticipated and much better than I expected. This irresistible fantasy adventure has a healthy dose of good humor, playful charm, and is easily accessible to all who love imaginary worlds filled with wizards, sorcerers, warlocks, knights, and fire-breathing dragons.\r\n\r\nCharismatic thief Edgin (Chris Pine) and his band of unlikely adventurers (including Holga (Michelle Rodriguez) the barbarian) undertake an epic heist to retrieve a lost relic and to liberate his daughter (Chloe Coleman) from Forge’s (Hugh Grant) castle. Things go dangerously awry when they run afoul of the wrong people, but the group must work together to overcome seemingly never-ending obstacles as they continue their important quest.\r\n\r\nWhile directors John Francis Daley and Jonathan Goldstein stay true to the origins of the game, prior knowledge of Dungeons & Dragons isn’t necessary. The film explains everything you need to know, making this an action adventure that’s appropriate for everyone. It’s surprising just how accessible this movie is. You don’t have to know the rules of the game to get a real kick out of this one. I’m sure there are plenty of Easter eggs hidden around for the gamers, but it’s not so insider that the uninitiated can’t understand what’s going on. This is definitely one of the film’s greatest strengths.\r\n\r\nThe story (with a script by Goldstein, Daley, and Michael Gilio) is solid too, with well-developed characters and irreverent humor that keeps the movie from becoming just another based-on-a-game throwaway. There’s a ton of heart and genuine emotion, which is elevated by the terrific cast. The actors play off each other well, giving a human element to what thankfully is not just a bunch of dumb CGI. You can feel the real connection between Edgin and Holga, best friends who always have each other’s backs, and Rodriguez and Pine’s chemistry finds the perfect groove. Grant, who is having a career resurgence lately, is as delightful as ever as the rogue Forge Fitzwilliam, as is Justice Smith as amateur sorcerer Simon and Sophia Lillis as shape shifting tiefling druid Doric. Most shocking is that Pine isn’t doing yet another version of his annoying shtick here, which in itself is a massive achievement.\r\n\r\nThe pacing is brisk and the special effects are well done, even if the finale is stretched a little thin. I found it easy to become engrossed in the mythical world of D&D not only because the movie looks great visually, but the characters are appealing, too. There’s plenty to root for.\r\n\r\nEven if you think you aren’t a fan of the fantasy genre, I suggest you give “Dungeons & Dragons: Honor Among Thieves” a try. This playful, character-driven adventure offers a ton of magical fun at the movies.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / www.ScreenZealots.com**", "created_at": "2023-04-23T05:58:55.912Z"}, {"movie_id": 493529, "review_id": "6463a2470f365500e20cd102", "author_rating": 8.0, "review_text": "Dungeons & Dragons: Honor Among Thieves is a great movie that strikes a perfect balance between high fantasy and comedy.\r\n\r\nThe screenplay for the movie was pretty average in terms of the overall plot, but the individual story beats and set pieces really carried the movie forward. What makes the screenplay stand out is the creativity behind each character, giving them interesting scenes and moments to shine. The dialogue was sharp and witty, filled with great laughs throughout. However, some of the comedy was very generic, with jokes and physical comedy that have been done a dozen times over.\r\n\r\nThe performances in the film were very solid, with Chris Pine stealing the show as the lead. Pine was extremely witty and charismatic, with excellent comedic timing. Michelle Rodriguez, while playing a pretty flat character, had incredible action scenes. Rege-Jean Page was a standout in every scene he was in, with over-the-top and hilarious moments that left me in stitches. Justice Smith, who hasn't been one of my favorite actors, did well here as a great comedic character. Sophia Lillis, while not getting a ton of time to shine in terms of her acting chops, was amazing in her action set pieces, especially in the long sequence where her character shape shifts while escaping from the castle.\r\n\r\nThe direction of Dungeons & Dragons: Honor Among Thieves was surprisingly stellar. The action was sharp and well-choreographed, with minimal cuts allowing the audience to really get a larger grasp of what was happening. The film balanced comedy and high fantasy elements really well. While the shots weren't overly creative, the movie looked fantastic with beautiful landscapes and above-average CGI.\r\n\r\nIn conclusion, Dungeons & Dragons: Honor Among Thieves is a great movie that exceeded my expectations. With a creative screenplay, solid performances, and fantastic direction, it deserves to be seen on the big screen.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-05-16T15:33:27.274Z"}, {"movie_id": 493529, "review_id": "646bba8154a09801728ad7c9", "author_rating": 6.0, "review_text": "**_Rebooting the sword & sorcery series with Chris Pine and Michelle Rodriguez_** \r\n\r\nA former member of the Harpers turned thief (Pine) amasses a group of unique individuals in order to acquire a magic relic, The Helm of Disjunction, and get his daughter back from a conman Lord (Hugh Grant) and his Red Wizard accomplice (Daisy Head). The adventurers include a barbarian (Rodriguez), an amateur sorcerer (Justice Smith), a shape-changing tiefling (Sophia Lillis) and a noble paladin (Regé-Jean Page).\r\n\r\n\"Dungeons & Dragons: Honor Among Thieves” (2023) reboots the trilogy that ran from 2000-2012. It’s easily the best film on a technical level but, story-wise, I prefer the previous two, “Wrath of the Dragon God” (2005) and “The Book of Vile Darkness” (2012), which are more serious.\r\n\r\nLike the first one from 2000, it telegraphs from the get-go that it's not to be taken too seriously. If you can roll with the campy air, it’s an amusing throwaway fantasy flick. Imagine the gaudiness of \"Star Wars\" (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you'd have a good idea of what this movie has to offer.\r\n\r\nSo, it’s a fun, entertaining adventure-fantasy with a good cast and the highlight of petite Sophia Lillis as the elf-like tiefling, but it’s overlong and needed more depth. Plus, there are too many glaring borrowings from other movies, like the frozen-land prison from “Star Trek VI: The Undiscovered Country,” the bald witch-sorceress from “Conan the Barbarian” (2011), Magneto’s helmet from the “X-Men” flicks, bits from the “Thor” and “Guardians of the Galaxy” movies, etc.\r\n\r\nThe film runs 2 hours, 14 minutes, and was shot in Iceland and Northern Ireland.\r\n\r\nGRADE: B-/C+", "created_at": "2023-05-22T18:54:57.210Z"}, {"movie_id": 493529, "review_id": "649102dac3c891010ca658ed", "author_rating": 7.0, "review_text": "Entertaining enough fantasy/adventure that features a fun script and seems accessible to both fans of D&D and those, like myself, who know very little about it. Also enjoyed the cast with Chris Pine showing his usual charisma and worked nicely opposite Michelle Rodriguez. Did lag a bit in the middle but the finale was good. **3.5/5**", "created_at": "2023-06-20T01:37:30.533Z"}, {"movie_id": 493529, "review_id": "64271aa09cc67b05796af5e8", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-dungeons-dragons-honor-among-thieves-is-a-delightful-surprise/\r\n\r\n\"DUNGEONS & DRAGONS: HONOR AMONG THIEVES is one of the best fantasy films of the most recent years. Chris Pine is the MVP of an incredibly charming cast with such natural chemistry that the comedic moments become truly hilarious - the graveyard scene will be replayed over and over again. An adventure blockbuster in all its purity, containing action set pieces filled with fantastical elements and accompanied by remarkable visual effects and score. One of the most fun, enjoyable, surprising theater experiences of the year so far. Impossible not to recommend it to any type of viewer.\"\r\n\r\nRating: B+", "created_at": "2023-03-31T17:38:40.603Z"}, {"movie_id": 493529, "review_id": "642a8ec79cc67b059cc4f97d", "author_rating": 7.0, "review_text": "Now I really did enjoy this, but let's not for a moment pretend that it has much originality to it. We start with a scene borrowed from \"Jurassic Park\" (1993) before getting introduced to the wise-cracking \"Edgin\" (Chris Pine) who has been incarcerated in an impregnable prison with his pal \"Holga\" (Michelle Rodriguez). They're at a sort of parole board hearing awaiting the arrival of \"Jarnathan\" for whom they have a rather surprising use! What now follows in an exciting and quickly paced series of escapades that sees our escapees try to reconcile with his daughter \"Kira\" (Chloe Coleman) whom they left in the capable - they thought - hands of their pal \"Forge\" (Hugh Grant). It turns out that he has his own agenda, and together with the mysterious \"Sofina\" (Daisy Head) is working on a plan to garner untold riches. That latter creature, though, has her own agenda too - a much more malevolent and dastardly one. \"Edgin\" and \"Holga\" have to find a magical helmet in order to spring his daughter and so recruiting the rather hapless sorceror \"Simon\" (Justice Smith) and the shape-shifting \"Doric\" (Sophia Lillis) set off in search of the legendary warrior \"Xenk\" (Regé-Jean Page) and perilous adventures beckon. This actually works well as an entertaining, episodic, collection of short stories that pitch our heroes agains a wonderfully chubby dragon, some dead but undead soldiers and along the way treats us to bits of \"Journey to the Centre of the Earth\" by way of \"Maze Runner\". \"Robin Hood\" and some stunningly presented magical duels worthy of Edgar Allan Poe. There is plenty of pith in the script - a bit of sarcasm never goes wrong; the cast genuinely seem to be having fun as their quest lurches from the frying pan to the fire each time and there is a suitably conniving effort from Grant to top it all off and keep us interested. I was a little disappointed in Page. He doesn't really have so much to do, and features rather sparingly - but Pine shows something of his versatility as an actor (perhaps not so much with his lute) and the whole thing delivers an amusing ensemble effort that passes 2¼ hours predictably, but nonetheless enjoyably. I could have done with more dragons and sorcery, but the visual effects are still put to good use to support a character-led, light-hearted, drama that is really only worth seeing on a big screen. This is good fun - and they even spelled \"honour\" properly in the title!", "created_at": "2023-04-03T08:31:03.580Z"}, {"movie_id": 493529, "review_id": "643fad9bdd471607c1811bcc", "author_rating": 8.0, "review_text": "The numerous manuals on my shelves for 1st to 5e speak volumes of my familiarity with the game, as does the novels I own, and the numerous D&D computer games I've played, so I was ecstatic seeing the places, people, and creatures I know very well. I've heard others who have played the game say they wished they had done a movie about characters like Elminster, Drizzt Do'Urden, or Alias instead. While they would have been nice to see, those characters are from the lore not the game. What I was more hoping for was that the characters in this movie felt like the characters the players play, the adventures they go on, and the antics they get themselves into. This movie felt like that in spades, and it was an absolute joy to see. I watched this and was constantly reminded of the crazy things I did as a player or watched others do as their DM, and more importantly the fun we had playing the game we all loved. This is why I give it my highest recommendation to all others who have played the game, and especially to those who have not so they may see for themselves what Dungeons & Dragons is really about. 8/10", "created_at": "2023-04-19T09:00:11.203Z"}, {"movie_id": 493529, "review_id": "6444c91fa06efe05c4a53b5c", "author_rating": 8.0, "review_text": "Based on the legendary role-playing game, “Dungeons & Dragons: Honor Among Thieves” is nothing like what I anticipated and much better than I expected. This irresistible fantasy adventure has a healthy dose of good humor, playful charm, and is easily accessible to all who love imaginary worlds filled with wizards, sorcerers, warlocks, knights, and fire-breathing dragons.\r\n\r\nCharismatic thief Edgin (Chris Pine) and his band of unlikely adventurers (including Holga (Michelle Rodriguez) the barbarian) undertake an epic heist to retrieve a lost relic and to liberate his daughter (Chloe Coleman) from Forge’s (Hugh Grant) castle. Things go dangerously awry when they run afoul of the wrong people, but the group must work together to overcome seemingly never-ending obstacles as they continue their important quest.\r\n\r\nWhile directors John Francis Daley and Jonathan Goldstein stay true to the origins of the game, prior knowledge of Dungeons & Dragons isn’t necessary. The film explains everything you need to know, making this an action adventure that’s appropriate for everyone. It’s surprising just how accessible this movie is. You don’t have to know the rules of the game to get a real kick out of this one. I’m sure there are plenty of Easter eggs hidden around for the gamers, but it’s not so insider that the uninitiated can’t understand what’s going on. This is definitely one of the film’s greatest strengths.\r\n\r\nThe story (with a script by Goldstein, Daley, and Michael Gilio) is solid too, with well-developed characters and irreverent humor that keeps the movie from becoming just another based-on-a-game throwaway. There’s a ton of heart and genuine emotion, which is elevated by the terrific cast. The actors play off each other well, giving a human element to what thankfully is not just a bunch of dumb CGI. You can feel the real connection between Edgin and Holga, best friends who always have each other’s backs, and Rodriguez and Pine’s chemistry finds the perfect groove. Grant, who is having a career resurgence lately, is as delightful as ever as the rogue Forge Fitzwilliam, as is Justice Smith as amateur sorcerer Simon and Sophia Lillis as shape shifting tiefling druid Doric. Most shocking is that Pine isn’t doing yet another version of his annoying shtick here, which in itself is a massive achievement.\r\n\r\nThe pacing is brisk and the special effects are well done, even if the finale is stretched a little thin. I found it easy to become engrossed in the mythical world of D&D not only because the movie looks great visually, but the characters are appealing, too. There’s plenty to root for.\r\n\r\nEven if you think you aren’t a fan of the fantasy genre, I suggest you give “Dungeons & Dragons: Honor Among Thieves” a try. This playful, character-driven adventure offers a ton of magical fun at the movies.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / www.ScreenZealots.com**", "created_at": "2023-04-23T05:58:55.912Z"}, {"movie_id": 493529, "review_id": "6463a2470f365500e20cd102", "author_rating": 8.0, "review_text": "Dungeons & Dragons: Honor Among Thieves is a great movie that strikes a perfect balance between high fantasy and comedy.\r\n\r\nThe screenplay for the movie was pretty average in terms of the overall plot, but the individual story beats and set pieces really carried the movie forward. What makes the screenplay stand out is the creativity behind each character, giving them interesting scenes and moments to shine. The dialogue was sharp and witty, filled with great laughs throughout. However, some of the comedy was very generic, with jokes and physical comedy that have been done a dozen times over.\r\n\r\nThe performances in the film were very solid, with Chris Pine stealing the show as the lead. Pine was extremely witty and charismatic, with excellent comedic timing. Michelle Rodriguez, while playing a pretty flat character, had incredible action scenes. Rege-Jean Page was a standout in every scene he was in, with over-the-top and hilarious moments that left me in stitches. Justice Smith, who hasn't been one of my favorite actors, did well here as a great comedic character. Sophia Lillis, while not getting a ton of time to shine in terms of her acting chops, was amazing in her action set pieces, especially in the long sequence where her character shape shifts while escaping from the castle.\r\n\r\nThe direction of Dungeons & Dragons: Honor Among Thieves was surprisingly stellar. The action was sharp and well-choreographed, with minimal cuts allowing the audience to really get a larger grasp of what was happening. The film balanced comedy and high fantasy elements really well. While the shots weren't overly creative, the movie looked fantastic with beautiful landscapes and above-average CGI.\r\n\r\nIn conclusion, Dungeons & Dragons: Honor Among Thieves is a great movie that exceeded my expectations. With a creative screenplay, solid performances, and fantastic direction, it deserves to be seen on the big screen.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-05-16T15:33:27.274Z"}, {"movie_id": 493529, "review_id": "646bba8154a09801728ad7c9", "author_rating": 6.0, "review_text": "**_Rebooting the sword & sorcery series with Chris Pine and Michelle Rodriguez_** \r\n\r\nA former member of the Harpers turned thief (Pine) amasses a group of unique individuals in order to acquire a magic relic, The Helm of Disjunction, and get his daughter back from a conman Lord (Hugh Grant) and his Red Wizard accomplice (Daisy Head). The adventurers include a barbarian (Rodriguez), an amateur sorcerer (Justice Smith), a shape-changing tiefling (Sophia Lillis) and a noble paladin (Regé-Jean Page).\r\n\r\n\"Dungeons & Dragons: Honor Among Thieves” (2023) reboots the trilogy that ran from 2000-2012. It’s easily the best film on a technical level but, story-wise, I prefer the previous two, “Wrath of the Dragon God” (2005) and “The Book of Vile Darkness” (2012), which are more serious.\r\n\r\nLike the first one from 2000, it telegraphs from the get-go that it's not to be taken too seriously. If you can roll with the campy air, it’s an amusing throwaway fantasy flick. Imagine the gaudiness of \"Star Wars\" (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you'd have a good idea of what this movie has to offer.\r\n\r\nSo, it’s a fun, entertaining adventure-fantasy with a good cast and the highlight of petite Sophia Lillis as the elf-like tiefling, but it’s overlong and needed more depth. Plus, there are too many glaring borrowings from other movies, like the frozen-land prison from “Star Trek VI: The Undiscovered Country,” the bald witch-sorceress from “Conan the Barbarian” (2011), Magneto’s helmet from the “X-Men” flicks, bits from the “Thor” and “Guardians of the Galaxy” movies, etc.\r\n\r\nThe film runs 2 hours, 14 minutes, and was shot in Iceland and Northern Ireland.\r\n\r\nGRADE: B-/C+", "created_at": "2023-05-22T18:54:57.210Z"}, {"movie_id": 493529, "review_id": "649102dac3c891010ca658ed", "author_rating": 7.0, "review_text": "Entertaining enough fantasy/adventure that features a fun script and seems accessible to both fans of D&D and those, like myself, who know very little about it. Also enjoyed the cast with Chris Pine showing his usual charisma and worked nicely opposite Michelle Rodriguez. Did lag a bit in the middle but the finale was good. **3.5/5**", "created_at": "2023-06-20T01:37:30.533Z"}, {"movie_id": 493529, "review_id": "64271aa09cc67b05796af5e8", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-dungeons-dragons-honor-among-thieves-is-a-delightful-surprise/\r\n\r\n\"DUNGEONS & DRAGONS: HONOR AMONG THIEVES is one of the best fantasy films of the most recent years. Chris Pine is the MVP of an incredibly charming cast with such natural chemistry that the comedic moments become truly hilarious - the graveyard scene will be replayed over and over again. An adventure blockbuster in all its purity, containing action set pieces filled with fantastical elements and accompanied by remarkable visual effects and score. One of the most fun, enjoyable, surprising theater experiences of the year so far. Impossible not to recommend it to any type of viewer.\"\r\n\r\nRating: B+", "created_at": "2023-03-31T17:38:40.603Z"}, {"movie_id": 493529, "review_id": "642a8ec79cc67b059cc4f97d", "author_rating": 7.0, "review_text": "Now I really did enjoy this, but let's not for a moment pretend that it has much originality to it. We start with a scene borrowed from \"Jurassic Park\" (1993) before getting introduced to the wise-cracking \"Edgin\" (Chris Pine) who has been incarcerated in an impregnable prison with his pal \"Holga\" (Michelle Rodriguez). They're at a sort of parole board hearing awaiting the arrival of \"Jarnathan\" for whom they have a rather surprising use! What now follows in an exciting and quickly paced series of escapades that sees our escapees try to reconcile with his daughter \"Kira\" (Chloe Coleman) whom they left in the capable - they thought - hands of their pal \"Forge\" (Hugh Grant). It turns out that he has his own agenda, and together with the mysterious \"Sofina\" (Daisy Head) is working on a plan to garner untold riches. That latter creature, though, has her own agenda too - a much more malevolent and dastardly one. \"Edgin\" and \"Holga\" have to find a magical helmet in order to spring his daughter and so recruiting the rather hapless sorceror \"Simon\" (Justice Smith) and the shape-shifting \"Doric\" (Sophia Lillis) set off in search of the legendary warrior \"Xenk\" (Regé-Jean Page) and perilous adventures beckon. This actually works well as an entertaining, episodic, collection of short stories that pitch our heroes agains a wonderfully chubby dragon, some dead but undead soldiers and along the way treats us to bits of \"Journey to the Centre of the Earth\" by way of \"Maze Runner\". \"Robin Hood\" and some stunningly presented magical duels worthy of Edgar Allan Poe. There is plenty of pith in the script - a bit of sarcasm never goes wrong; the cast genuinely seem to be having fun as their quest lurches from the frying pan to the fire each time and there is a suitably conniving effort from Grant to top it all off and keep us interested. I was a little disappointed in Page. He doesn't really have so much to do, and features rather sparingly - but Pine shows something of his versatility as an actor (perhaps not so much with his lute) and the whole thing delivers an amusing ensemble effort that passes 2¼ hours predictably, but nonetheless enjoyably. I could have done with more dragons and sorcery, but the visual effects are still put to good use to support a character-led, light-hearted, drama that is really only worth seeing on a big screen. This is good fun - and they even spelled \"honour\" properly in the title!", "created_at": "2023-04-03T08:31:03.580Z"}, {"movie_id": 493529, "review_id": "643fad9bdd471607c1811bcc", "author_rating": 8.0, "review_text": "The numerous manuals on my shelves for 1st to 5e speak volumes of my familiarity with the game, as does the novels I own, and the numerous D&D computer games I've played, so I was ecstatic seeing the places, people, and creatures I know very well. I've heard others who have played the game say they wished they had done a movie about characters like Elminster, Drizzt Do'Urden, or Alias instead. While they would have been nice to see, those characters are from the lore not the game. What I was more hoping for was that the characters in this movie felt like the characters the players play, the adventures they go on, and the antics they get themselves into. This movie felt like that in spades, and it was an absolute joy to see. I watched this and was constantly reminded of the crazy things I did as a player or watched others do as their DM, and more importantly the fun we had playing the game we all loved. This is why I give it my highest recommendation to all others who have played the game, and especially to those who have not so they may see for themselves what Dungeons & Dragons is really about. 8/10", "created_at": "2023-04-19T09:00:11.203Z"}, {"movie_id": 493529, "review_id": "6444c91fa06efe05c4a53b5c", "author_rating": 8.0, "review_text": "Based on the legendary role-playing game, “Dungeons & Dragons: Honor Among Thieves” is nothing like what I anticipated and much better than I expected. This irresistible fantasy adventure has a healthy dose of good humor, playful charm, and is easily accessible to all who love imaginary worlds filled with wizards, sorcerers, warlocks, knights, and fire-breathing dragons.\r\n\r\nCharismatic thief Edgin (Chris Pine) and his band of unlikely adventurers (including Holga (Michelle Rodriguez) the barbarian) undertake an epic heist to retrieve a lost relic and to liberate his daughter (Chloe Coleman) from Forge’s (Hugh Grant) castle. Things go dangerously awry when they run afoul of the wrong people, but the group must work together to overcome seemingly never-ending obstacles as they continue their important quest.\r\n\r\nWhile directors John Francis Daley and Jonathan Goldstein stay true to the origins of the game, prior knowledge of Dungeons & Dragons isn’t necessary. The film explains everything you need to know, making this an action adventure that’s appropriate for everyone. It’s surprising just how accessible this movie is. You don’t have to know the rules of the game to get a real kick out of this one. I’m sure there are plenty of Easter eggs hidden around for the gamers, but it’s not so insider that the uninitiated can’t understand what’s going on. This is definitely one of the film’s greatest strengths.\r\n\r\nThe story (with a script by Goldstein, Daley, and Michael Gilio) is solid too, with well-developed characters and irreverent humor that keeps the movie from becoming just another based-on-a-game throwaway. There’s a ton of heart and genuine emotion, which is elevated by the terrific cast. The actors play off each other well, giving a human element to what thankfully is not just a bunch of dumb CGI. You can feel the real connection between Edgin and Holga, best friends who always have each other’s backs, and Rodriguez and Pine’s chemistry finds the perfect groove. Grant, who is having a career resurgence lately, is as delightful as ever as the rogue Forge Fitzwilliam, as is Justice Smith as amateur sorcerer Simon and Sophia Lillis as shape shifting tiefling druid Doric. Most shocking is that Pine isn’t doing yet another version of his annoying shtick here, which in itself is a massive achievement.\r\n\r\nThe pacing is brisk and the special effects are well done, even if the finale is stretched a little thin. I found it easy to become engrossed in the mythical world of D&D not only because the movie looks great visually, but the characters are appealing, too. There’s plenty to root for.\r\n\r\nEven if you think you aren’t a fan of the fantasy genre, I suggest you give “Dungeons & Dragons: Honor Among Thieves” a try. This playful, character-driven adventure offers a ton of magical fun at the movies.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / www.ScreenZealots.com**", "created_at": "2023-04-23T05:58:55.912Z"}, {"movie_id": 493529, "review_id": "6463a2470f365500e20cd102", "author_rating": 8.0, "review_text": "Dungeons & Dragons: Honor Among Thieves is a great movie that strikes a perfect balance between high fantasy and comedy.\r\n\r\nThe screenplay for the movie was pretty average in terms of the overall plot, but the individual story beats and set pieces really carried the movie forward. What makes the screenplay stand out is the creativity behind each character, giving them interesting scenes and moments to shine. The dialogue was sharp and witty, filled with great laughs throughout. However, some of the comedy was very generic, with jokes and physical comedy that have been done a dozen times over.\r\n\r\nThe performances in the film were very solid, with Chris Pine stealing the show as the lead. Pine was extremely witty and charismatic, with excellent comedic timing. Michelle Rodriguez, while playing a pretty flat character, had incredible action scenes. Rege-Jean Page was a standout in every scene he was in, with over-the-top and hilarious moments that left me in stitches. Justice Smith, who hasn't been one of my favorite actors, did well here as a great comedic character. Sophia Lillis, while not getting a ton of time to shine in terms of her acting chops, was amazing in her action set pieces, especially in the long sequence where her character shape shifts while escaping from the castle.\r\n\r\nThe direction of Dungeons & Dragons: Honor Among Thieves was surprisingly stellar. The action was sharp and well-choreographed, with minimal cuts allowing the audience to really get a larger grasp of what was happening. The film balanced comedy and high fantasy elements really well. While the shots weren't overly creative, the movie looked fantastic with beautiful landscapes and above-average CGI.\r\n\r\nIn conclusion, Dungeons & Dragons: Honor Among Thieves is a great movie that exceeded my expectations. With a creative screenplay, solid performances, and fantastic direction, it deserves to be seen on the big screen.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-05-16T15:33:27.274Z"}, {"movie_id": 493529, "review_id": "646bba8154a09801728ad7c9", "author_rating": 6.0, "review_text": "**_Rebooting the sword & sorcery series with Chris Pine and Michelle Rodriguez_** \r\n\r\nA former member of the Harpers turned thief (Pine) amasses a group of unique individuals in order to acquire a magic relic, The Helm of Disjunction, and get his daughter back from a conman Lord (Hugh Grant) and his Red Wizard accomplice (Daisy Head). The adventurers include a barbarian (Rodriguez), an amateur sorcerer (Justice Smith), a shape-changing tiefling (Sophia Lillis) and a noble paladin (Regé-Jean Page).\r\n\r\n\"Dungeons & Dragons: Honor Among Thieves” (2023) reboots the trilogy that ran from 2000-2012. It’s easily the best film on a technical level but, story-wise, I prefer the previous two, “Wrath of the Dragon God” (2005) and “The Book of Vile Darkness” (2012), which are more serious.\r\n\r\nLike the first one from 2000, it telegraphs from the get-go that it's not to be taken too seriously. If you can roll with the campy air, it’s an amusing throwaway fantasy flick. Imagine the gaudiness of \"Star Wars\" (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you'd have a good idea of what this movie has to offer.\r\n\r\nSo, it’s a fun, entertaining adventure-fantasy with a good cast and the highlight of petite Sophia Lillis as the elf-like tiefling, but it’s overlong and needed more depth. Plus, there are too many glaring borrowings from other movies, like the frozen-land prison from “Star Trek VI: The Undiscovered Country,” the bald witch-sorceress from “Conan the Barbarian” (2011), Magneto’s helmet from the “X-Men” flicks, bits from the “Thor” and “Guardians of the Galaxy” movies, etc.\r\n\r\nThe film runs 2 hours, 14 minutes, and was shot in Iceland and Northern Ireland.\r\n\r\nGRADE: B-/C+", "created_at": "2023-05-22T18:54:57.210Z"}, {"movie_id": 493529, "review_id": "649102dac3c891010ca658ed", "author_rating": 7.0, "review_text": "Entertaining enough fantasy/adventure that features a fun script and seems accessible to both fans of D&D and those, like myself, who know very little about it. Also enjoyed the cast with Chris Pine showing his usual charisma and worked nicely opposite Michelle Rodriguez. Did lag a bit in the middle but the finale was good. **3.5/5**", "created_at": "2023-06-20T01:37:30.533Z"}]