[{"movie_id": 1619, "review_id": "63cafbaa6d97e60081fe5eb7", "author_rating": 6.0, "review_text": "**_Convoluted crime drama in the wake of Pulp Fiction_**\r\n\r\nTwo low-life criminals (Ryan Phillippe & Benicio Del Toro) kidnap a pregnant surrogate (Juliette Lewis) of a rich couple who, unknowingly, has ties to the mob.\r\n\r\n\"The Way of the Gun\" (2000) is an offbeat flick in the tradition of \"Pulp Fiction\" written & directed by a proven screenwriter and featuring a quality cast, which includes James Caan. It's touted as a \"modern Western\" with two protagonists patterned after Butch Cassidy and the Sundance Kid (their names in the film are the last names of Butch & Sundance).\r\n\r\nIt starts out as a black comedy with cussing every other word, but then morphs into a serious crime drama with flashes of gunplay. The score is notable.\r\n\r\nTwo issues hinder the film: (1) A plot that becomes convoluted and therefore increasingly unbelievable, and (2) unlikable characters, except for maybe the surrogate. Concerning the second issue, I understand the concept of antiheroes, but even antiheroes require some redeemable or universally human qualities to make the audience root for them or care about them. Wolverine and Clint Eastwood's Western characters, like Josey Wales, are good examples, as are the antiheroes in films like \"Runaway Train\" and \"Apocalypse Now,\" two cinematic masterpieces.\r\n\r\nThese two points naturally create disinterest and tempt the viewer to tune out. The first time I watched it I gave up by the 90-minute mark with a half hour to go, I could care less about the characters, their story or how it turned out, even though I tried. \r\n\r\nOn my second viewing, I decided to pay closer attention and stick with the movie till the end. I'm glad I did because this is a well-written examination of crime & violence and the fools involved. An attempt is made to flesh-out all the main characters and I'm talking no less than nine people, each of whom are a piece of the interlocking puzzle, often with their own agenda. \r\n\r\nWhile it's no where near great like the seminal \"Pulp Fiction,\" it has style and glimmerings of depth. If you can get past the convoluted story and unlikable characters, it certainly has its points of interest, like well-scripted dialogues and Del Toro's towering performance, not to mention Taye Diggs's interesting heavy.\r\n\r\nThe film was shot in Utah in the Salt Lake City area.\r\n\r\nGRADE: B-", "created_at": "2023-01-20T20:38:02.758Z"}]