[{"movie_id": 627290, "review_id": "5f6a55f5c4ad590038fcfa81", "author_rating": 6.0, "review_text": "_The past is never dead. It's not even past._\r\n\r\nThe movie did an excellent job with the twist and reveal. \r\n\r\nThat said, the movie overall could've been better.\r\nThe tone of race and discrimination is handled well.\r\nThe story could've gone a supernatural way with how it was done.\r\nThough I'm not hating this psychological thriller route they took.\r\n\r\nMixed reactions and reviews are a given for this movie.\r\nBottom line is seeing this movie for yourself.\r\nPersonally, I enjoyed it but not enough to overlook the faults in the film.\r\nThe movie took something and tried to make it work.\r\nIt wasn't great but it wasn't bad.", "created_at": "2020-09-22T19:52:21.499Z"}, {"movie_id": 627290, "review_id": "5f7410be8c22c00039cd409a", "author_rating": 3.0, "review_text": "As someone who has been enjoying the renewed focus on black horror and the rise in storytelling from unique perspectives kickstarted by 'Get Out', it makes my heart sink to see something like 'Antebellum' stumble into cinemas. My fear is that if there are enough negative appraisals of the genre and the discourse shrinks, the film industry will just stop producing socially conscious horror movies, point-blank. The biggest sin that 'Antebellum' commits is that the filmmakers took one of the most horrific periods of American history and, via exceedingly clumsy execution, unintentionally made it into a joke.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-antebellum-socially-conscious-horror-without-any-finesse-or-cleverness", "created_at": "2020-09-30T04:59:42.029Z"}, {"movie_id": 627290, "review_id": "5f7b5964c8113d0036a17d03", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSome media outlets are providing a spoiler-ish synopsis that I believe the film should have omitted throughout its marketing campaign, including its own trailers. There's a central mystery that only begins almost midway through the runtime, and it plays out until the start of the third act, so you have my advice: stay away from its trailers and don't read too many synopses. Since I didn't know anything about it, I watched Antebellum with modest expectations, and most important of all, without any preconceived ideas or theories about its narrative structure. \r\n\r\nHowever, I couldn't help but see the movie later than most people, and I have to admit: I'm slightly surprised that so many people deeply hate this film… It does have some issues, and I'll get to those, but overall, I believe the extreme White-on-Black violence is the main reason why so many viewers gave up on the movie. I'll start with this topic. It's indisputable that Gerard Bush and Christopher Renz (feature directorial debuts) deliver quite a shocking film, depicting racism and slavery in unpleasant yet realistic ways. This last part is precisely the seamless balance that every movie needs to have when dealing with these themes, and in my opinion, Bush and Renz didn't really nail it.\r\n\r\nThe brutal torture and death sequences that Black people suffer in this film are shown without any restraint. From massive amounts of blood to visible hits, it's one of those movies that carries so much realism that it becomes uncomfortable. If these scenes end up carrying a meaningful message or a compelling arc, it might be hard to watch, but it ultimately feels necessary and emotionally impactful. If they don't, then it just looks like violence for the sake of entertainment, which will always bother a lot of viewers depending on the type of violence on display. Bush and Renz risk the film's success walking this thin line, and overall, even though they're far from perfecting that balance, they didn't do a bad job, at all.\r\n\r\nIn fact, for a directorial debut, Antebellum is technically remarkable. Opening with an uncut, long opening sequence, where the camera shows the entire plantation, passing through the recent arrival of Janelle Monáe's character, and finishing in a horrendous slow-motion treatment of a desperate slave trying to escape. These six to eight minutes function like a disclaimer to the audience. If people feel way too disturbed by what they've just witnessed, then it's better to leave this one on the side, and forget about it. \r\n\r\nPedro Luque's cinematography feels definitely unique, and it never shies away from displaying what's happening, no matter how gruesome and terrible. The musical score from Nate Wonder and Roman Gianarthur, characterized by its dominant use of strings, elevates so many suspenseful moments. Honestly, it's pretty addictive to listen to. Great production value, as expected, costume and set design are fantastic… visually, I find nothing to complain about. Even judging the brutality solely on itself, if the purpose is to demonstrate how much slaves suffered back then, it's as faithful as it could be.\r\n\r\nStory-wise, Bush and Renz need to improve their quality as screenwriters. Their premise is extremely convincing, the nonlinear narrative structure adds a neat mystery, and the story itself is incredibly intriguing. However, instead of reaching its undeniable potential and delivering a phenomenal, profound, well-developed screenplay, Antebellum ends up in a predictable manner, leaving tons of interesting storylines to explore. Even its climactic, action-heavy final minutes are underwhelming, and every problem is solved way too easily. It even gives the viewer the right to question why and how everything that happens in the movie could, in fact, occur for so long.\r\n\r\nNevertheless, it's far from being a trainwreck, much on the contrary. I was invested until the very end, almost every scene is captivating to the point of me staying completely still without taking my eyes off the screen. I didn't feel too uncomfortable with the display of violence, so my experience was smoother than most people, I'd assume. The excellent representation of Janelle Monáe's character's distinct lifestyles, in the plantation and in the city, is the best aspect of the entire film, clearly setting up a different color palette and tone. Monáe offers a powerful performance, carrying the whole movie on her shoulders, as the sole protagonist of an incredibly heavy story.\r\n\r\nAll in all, Antebellum is set to divide viewers due to its uncomfortable yet realistic, extreme violence. Gerard Bush and Christopher Renz deliver an undeniably shocking film, involving hard-to-watch depictions of torture, slavery, and racism. Technically, the camera work gives the whole movie a distinct style, as well as its score, costumes, and set design. Janelle Monáe demonstrates her acting abilities as the protagonist, delivering an emotionally captivating display. The nonlinear narrative structure elevates the central mystery, but the story doesn't receive the extensive treatment that its premise deserves. The enormous potential is wasted in meaningless, horrific deaths, just as in the third act's disappointing action sequences. While the White-on-Black violence is justified in the context of the film, its excessive, unrestrained display without a convincing message or arc surrounding it is definitely a negative aspect that some people won't be able to accept. I didn't feel bothered to that level, and I still believe the intent was benign, so I recommend this directorial debut from Bush and Renz, but with a disclaimer for the sensitive subject matter and/or viewers who struggle with depictions of intense violence.\r\n\r\nRating: B", "created_at": "2020-10-05T17:35:32.430Z"}, {"movie_id": 627290, "review_id": "5f910d2d383df20034b1d146", "author_rating": 5.0, "review_text": "\"Antebellum\" is a tough movie to watch AND review. It's depiction of slavery is brutal, but the twist that brings it into genre territory is badly timed and ultimately disappointing.", "created_at": "2020-10-22T04:40:13.658Z"}, {"movie_id": 627290, "review_id": "5f910d5dd9f4a60038da9e1c", "author_rating": 5.0, "review_text": "\"Antebellum\" is a tough movie to watch AND review. It's depiction of slavery is brutal, but the twist that brings it into genre territory is badly timed and ultimately disappointing.", "created_at": "2020-10-22T04:41:01.174Z"}]