[{"movie_id": 19840, "review_id": "5b99c8a2c3a368278d000789", "author_rating": 4.0, "review_text": "_I Love You, Beth Cooper_ is honestly pretty atypical for your American Teen Rom-Com, but the things I hated about it are still the things that I hate about American Teen Rom-Coms at large.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2018-09-13T02:17:06.305Z"}, {"movie_id": 19840, "review_id": "5f14994b78570e003357f565", "author_rating": 6.0, "review_text": "Decent watch, could watch again, but can't confidently recommend.\r\n\r\nWhile they're very different movies, I tend to get this mixed up with \"She's Out of My League\".  They're both decent movies, they're funny enough, but they're both forgettable and I don't think you're missing out if you skip either.\r\n\r\nMy biggest problem with this movie is that there is a wildly violent crime spree throughout the movie.  I'm not talking about simple trespassing, or even under-age drinking (though, I think it applies to my point)  there is physical assault, jokes about \"date-rapey\" behavior, use of cocaine, threats to life, severe destruction of property, forced entry, and I think illegal tracking, quite a bit is just done openly in front of adults / authority figures, and at one point in uniform.  It's one thing to be a little lenient and let kids be kids, but graduating high schoolers are probably 18, adults, and it doesn't make sense to not arrest this idiot.  On top of that, to create a character like that in the moment, then he must have a long history of crimes.\r\n\r\nI'm actually a fan of the story, cringey as it may be.  I love an underdog story, and this is a powerful \"coming of age\" story for at least 3 different characters, but as the premise is that it is an unbelievable situation, and they casted and that caste delivered just a little too well.  They specifically don't play well off of each other because the performances are actually so good as characters, and the characters barely mesh, even as the movie continues.\r\n\r\nThe movie also undercuts the protagonist at the oddest times.  While we're supposed to relate to one of the boys (or possibly Beth Cooper) there are several points where it makes them look even more pathetic or jerks (in her case) and it really takes me out of the movie.  I think it is better to have irredeemable characters than characters that vary on their relate-ability like this movie does.\r\n\r\nI think you could have a fun little watch with this, but there are so many other things I would suggest: \"Superbad\", \"Can't Hardly Wait\", \"She's All That\", \"Booksmart\", \"Eurotrip\" for a start.", "created_at": "2020-07-19T19:04:43.747Z"}]