[{"movie_id": 50456, "review_id": "50fc21e2760ee360852c3f31", "author_rating": 8.0, "review_text": "This is a very cool movie. I wasn't totally sold on the premise based solely on the overview but there is a lot more to Hanna than just your run-of-the-mill assassin story. I didn't necessarily pick up on the \"fairy tale like elements\" while watching it but in hindsight, they were definitely there.\r\n\r\nSaoirse Ronan is really, really good.\r\n\r\nI also really enjoyed the soundtrack. The Chemical Brothers style fit perfectly with the pace and theme of the movie and got me bumpin' on more than a single occasion.\r\n\r\nOverall, I give this movie an 8/10. I'm super interested to see what Seth Lochhead does next.", "created_at": "2013-01-20T16:57:06.025Z"}, {"movie_id": 50456, "review_id": "5d6c32cb65686e000f88e847", "author_rating": 4.0, "review_text": "Hanna-Barbera More Like.\r\n\r\nHanna is directed by Joe Wright and written by David Farr and Seth Lochhead. It stars Saoirse Ronan, Eric Banna, Tom Hollander, Olivia Williams, Jason Flemyng and Cate Blanchett. Music is by The Chemical Brothers and cinematography by Alwin H. Kuchler.\r\n\r\nHanna Heller (Ronan) is a 16 year old highly trained assassin on the run from the CIA...\r\n\r\nHeralded by some British critics as original and thrilling, Joe Wright's Hanna is neither. It's a gimmick movie dressed up as cool for the kids fodder that is both boring and cheesy. Taking the gimmick aside, that of a 16 year old crack assassin girl slotting all who come in her way, it starts off promisingly enough as we meet Hanna and her father Erik (Banna) out in the wilderness. There's training, a believable bond (both Ronan and Banna don't disgrace themselves) and the wintry landscape bites hard as we wonder what is in store.\r\n\r\nThen the film shifts to Hanna being on the run, where the back story guff is just, well, guff, and the pace crawls to a standstill. Blanchett's (badly miscast) CIA operative is in pursuit, with that back story guff tattooed on her forehead, and it tries to gain momentum for the inevitable showdown between the big bad bitch and the little china doll killer. The Chemical Brothers drip their brand of techno beats over it, which is OK if you like that sort of thing. How cool?!\r\n\r\nIn the middle passages Hanna rides along with a Hippy family, with Flemyng also badly miscast, and there's some cack-handed attempt at humanising poor Hanna as she comes alive in the big old world. It's derivative in premise, boring in execution and designed to make teenagers think they are watching a masterpiece for their generation.\r\n\r\nThe amusement park finale is well staged, location photography is pleasing enough in that hip-euro way, and Banna and Ronan work hard to keep it from total damnation. But for much of the near two hour run time it's a butt numbing bore that has ideas far above its station. Joe Wright should stick to making Keira Knightley look good. 4/10", "created_at": "2019-09-01T21:06:19.887Z"}, {"movie_id": 50456, "review_id": "6132d6d55ab81a00912187bb", "author_rating": 10.0, "review_text": "SAIRSE RONAN IS THE ONLY PERSON TO PLAY THIS COMPLEX LONELY YET POWERFUL CHARACTER. ONE OF THE MOST INTERESTING FEMALE ASSASINS EVER TO BE PUT INTO FILM. SO YOUNG, SO SCARY. HERIOC", "created_at": "2021-09-04T02:15:49.571Z"}, {"movie_id": 50456, "review_id": "632f793da9117f007ed68e65", "author_rating": 7.0, "review_text": "**_European adventure/spy thriller about a real, um, super girl_**\r\n\r\nIn the wintery wilderness of northern Finland, an ex-CIA father (Eric Bana) has been training his teen daughter, the titular character (Saoirse Ronan), to survive in a harsh world of cutthroat government agents. When the girl's ready, she's introduced to the real world where she's ruthlessly hunted down from North Africa to Germany by a mysterious intelligence operative, Marissa (Cate Blanchett), and her heavies.\r\n\r\nWhat I like best about \"Hanna\" (2011) is its uniqueness, stylishness and picturesque globetrotting. This is top-of-the-line filmmaking with a hip, kinetic, quirky tone and superlative score, comparable to \"Lucy\" (2014) and Tarantino thrillers like \"Kill Bill\" (2003/2004). It's not a great film because there's not enough depth or mindfood, but it contains a few elements of greatness and is overall entertaining enough.\r\n\r\nWe learn Marissa is preoccupied with Hanna for unknown reasons; so, while she's an expert agent, this obsession is her kryptonite. Subtext-wise, the movie's an obvious metaphor for a child reaching adulthood and the agonies of being a loving parent (preparing them for the world, teaching them necessary skills to survive, giving them increasing freedom, being candid about the callousness of life). It's also somewhat of a fairytale about the relationship between a father and daughter. Later in the film Marissa asks Erik, \"Why now?\" and he simply replies, \"Kids grow up.\"\r\n\r\nI liked the dichotomy of the so-called normal banality of the civilians compared to the single-minded cold-bloodedness of the agents. If you object to the sometimes unwieldy fight scenes, go parent a child, wait eighteen years, then view it again and see if you feel the same. The film's often thrilling, but don't approach this as a straight action flick or you'll probably be disappointed.\r\n\r\nThere are low-key things that are clumsily explored, like the RV family perking Hanna's curiosity about life (remember she grew up isolated in the northern wilds), but this was an obvious mechanism to make us feel bad that she was on this life-or-death mission, and different than these \"normal\" kids, yet at the same time special and more exciting, which is how the daughter & kid brother viewed Hanna. The individual used as a tool is hardly innovative, but I nonetheless appreciated this take on it.\r\n\r\nThe film runs 1 hour, 51 minutes and was shot in Finland, Morocco and (mostly) Germany.\r\n\r\nGRADE: B+", "created_at": "2022-09-24T21:40:13.142Z"}]