[{"movie_id": 447332, "review_id": "5ae1b72092514124bb00d195", "author_rating": 8.0, "review_text": "This review contains **spoilers**.\r\nSo let’s First get this out of The way I’ve never been more frustrated, by people eating popcorn, fidgeting, & Coming in late. \r\n\r\nAnyways form the very start I had so many questions, how’d they get here? Where’d the Monster come from? Etc. And by the end I have no answers and even more questions. Are they gonna survive and kill all the Monsters? Is everyone else dead? Why’d they think to have a baby? But that doesn’t matter.\r\n\r\nWe’re just tossed into this situation with no explanation to almost anything. The only things we really know is of course making lond sounds means you’re likely gonna die. And High Pitch Sounds Hurts the Monster. \r\n\r\nWish is a smart Choice and come to think of it is kinda obvious, maybe a little too obvious. Like how’d they never think about that? Either way. \r\n\r\nA quick note for surviving other then the soundproofing here and there. Why not have a sound bomb of sorts, you could just throw? That would have toldy saved the Dad from having to sacrifice him self. \r\n\r\nThat isn’t to say they’re stupid they had many Smart decisions such a The sand paths, the box for the baby (wish was kinda sad), the little sound proof room, the Radio, and the fireworks. And that’s just the sound related stuff the Lights and Fires Where also Smart.\r\n\r\nOtherwise the cast give us some incredible performances and lots of good chemistry. It probably helps that John and Emily are a real couple. Speaking of wich John Krasinski has Written and Directed a very clever and suspenseful horror film. I’ve never been more scared of corn in my life. Also had jumped at water. \r\n\r\nAnd the sound department specifically the Foley Artist have never shined greater in any film I have ever seen before. The sound is a way flipped from most horror films as it’s when the music drops and everything goes quiet that the Monster attacks. But not in this case everytime the Monster comes it’s a big moment.\r\n\r\nAlthough I have nothing against a R rating. In fact I’m somethimes more likely to see a film because of a R rating, it shows they have gus and they are willing to take a risk. F*ck you MPAA!!! \r\n\r\nAnyways some times all kinds of unnecessary crap is put in a Film because they like oh yeah we’re rated R. Although that’s not always needed this Film proves a well done PG-13 can still be dark and brutal. Killing a Child with in the first 10ish minuets, is a little dark. Although come on that kid had it Coming as soon as he grab those batteries. there’s almost a bit of blood maybe the MPAA is pulling back on some things. Probably not those F*ck you MPAA!!!\r\n\r\nOk sorry my review is getting to become rated R. 😆\r\n\r\nAlso I wanted to note for whatever reason I enjoy films where I can count the entire cast.\r\n\r\nAlong side Get Out it seems people form comedy make better Horror film Directors then most Horror film Directors. It definitely makes sense though it’s all about that timing.\r\n\r\n\r\nIn Short It was a gripping film from start to finish. I’d highly recommend to all Horror and Thriller Fans. Although because of spoilers in this review you probably already saw it. \r\n\r\n\r\nSo leave a comment and let’s discuss.\r\n\r\nNo likes", "created_at": "2018-04-26T11:25:20.198Z"}, {"movie_id": 447332, "review_id": "5af2664ac3a36855ac00755a", "author_rating": 8.0, "review_text": "**_No important spoilers here_**\r\n\r\nIn a **dystopic future**, the humanity has been severely smitten by strange blind creatures that feast on living flesh, both human and animal. In spite of being blind, the creatures have a super hearing and can identify sounds from far away. The creatures are nearly indestructible and very effective killers, and once they hear you, you are most likely dead.\r\n\r\nThe movie follows a surviving family trying to keep alive in this harsh reality. The movie setup is incredibly well-built to transpire the precaution, the constant fear, and the direful consequences of an unthought action in this terrible future. **The sound effects are awesome**, and the director can successfully use the nearly-constant silence in contrast to the hassle of being followed by those creatures.\r\n\r\nThe **acting is solid** and helps to immerse the watcher in the well-built plot.\r\n\r\nMy only regret for this movie is that it ends during a climax, when we are not ready to stop watching it yet. **It could be 30 minutes longer** to explain some missing points and to show what happens after the ending.\r\n\r\nOverall, **an awesome movie**, well-thought and beautifully produced in every aspect.", "created_at": "2018-05-09T03:08:58.988Z"}, {"movie_id": 447332, "review_id": "5bb5a604c3a368150c008e41", "author_rating": 6.0, "review_text": "Every time a horror movie does something that I've never seen before, that gets me very excited. _A Quiet Place_ is such a movie. I do believe that maybe _A Quiet Place_ doesn't **quite** deserve the praise that it has received. Not that it isn't a good movie, just that said acclaims have been **so** high, to the point that I think maybe just the fact that it's original isn't enough to earn those laurels.\r\n\r\nI still am a fan of the movie, hardline, absolutely, just maybe a little underwhelmed given the reviews.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-04T05:32:52.910Z"}, {"movie_id": 447332, "review_id": "5c15b05e0e0a2603883cff6d", "author_rating": 10.0, "review_text": "This is far and away one of the best movies I have ever watched, and I've watched a lot of movies!  The story is original, no  small feat these days, and the acting is just outstanding!  John Krasinski and Emily Blunt, along with the children, bring these characters to life, and make us really care, all without the benefit of well written dialogue.  That's not easy to do, but they do it.  Right from the start, you find yourself drawn into the lives of these people, and can feel the tension, the undercurrent of threat, that they live with every day.  Through all they face, we are also given a picture of a solid family, with a dad and mom doing everything possible to care for their children, the family praying together, holding onto faith even under the most difficult of circumstances, and that family dynamic really strengthens the entire story.  Who do you rely on when all is changed?  When everything goes wrong?  Family.  Along with the acting, the direction, sets, just everything, come together to deliver a truly scary movie, that doesn't rely on flash to terrify you.  Highly recommend this one.  We saw it in the theater, and bought it as soon as it hit the stores.  Top notch work.", "created_at": "2018-12-16T01:54:38.117Z"}, {"movie_id": 447332, "review_id": "5eadf69a1a934f0026e94386", "author_rating": 1.0, "review_text": "This film is terrible. How this pathetic excuse for entertainment has any rating is a mystery. It's an insult to art of film making and to the people who love cinema. Nobody in their right mind would suggest watching this hole ridden, ham acted, utter nonsense themed non-story movie to anybody. Save yourself the hassle, trust me, it's bad.", "created_at": "2020-05-02T22:39:22.859Z"}, {"movie_id": 447332, "review_id": "5ec1fc54cdf2e600204f6481", "author_rating": 5.0, "review_text": "_**Decent horror flick, but the family members make too many exasperating blunders**_\r\n\r\nA family tries to survive on their farm in rural New York while blind indestructible creatures prowl the landscape. The creatures find prey based on sound so they have to be careful to be quiet at all times. Emily Blunt plays the pregnant mother and John Krasinski her husband (Krasinski also directs).  \r\n\r\n“A Quiet Place” (2018) is a well-made horror flick that brings to mind “Signs” (2002) with ferocious creatures that mix the xenomorphs of “Alien/Aliens” with the extraterrestrials of “War of the Worlds” (2005). They’re basically a knock-off of the monster in “Cloverfield” (2008), albeit the smaller size of the creatures in those previous flicks.\r\n\r\nWhile this movie gets a lot of praise in some circles, the constant mistakes of the family members gets frustrating and tiresome. I love the tone, however, as well as Emily Blunt and the sumptuous Hudson River-area locations.     \r\n\r\nThe film runs 1 hour, 30 minutes, and was shot in the state of New York, about 50-65 miles north of the Big Apple (Beacon, Pawling & New Paltz), except for Little Falls, which is another 110 miles northwest.\r\n\r\nGRADE: C+/B-", "created_at": "2020-05-18T03:09:08.541Z"}, {"movie_id": 447332, "review_id": "60ad1c0f8c44b900412a7b4f", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEver since Jordan Peele shocked everyone with his feature directorial debut, Get Out, no one else questioned the potential that a well-known comedic actor could bring to the horror genre. Therefore, I vividly remember discovering that John Krasinski was directing, writing, and starring in a low-budget, original horror flick and feeling incredibly interested, to the point of considering it one of my most anticipated movies of the respective year. I absolutely adore the actor's memorable performance in The Office, but I never really saw anything worth noting from him after that show. Adding Emily Blunt (Sicario, Edge of Tomorrow) - her \"slightly more famous\" wife - was definitely an attention-grabbing move, especially when the young actors were still unknown at the time of release.\r\n\r\nWith the help of Bryan Woods and Scott Beck, Krasinski developed a screenplay based on a relatively simple yet highly impactful, imaginative premise. Creepy, scary monsters who hunt by sound isn't exactly a mind-blowing story aspect, but the extreme amount of tension and suspense transform a regular theater session into a nail-biting, nerve-wracking cinematic experience. Fortunately, the audience at my first screening was really invested in the film, which made for a truly unforgettable moment that I know some people didn't have due to disrespectful moviegoers. However, if there's one thing no one can take away from A Quiet Place is that it works just as well or better watching at home with the lights out in the silence of our own house.\r\n\r\nSome viewers might look at this movie solely as an entertaining horror film with effective jumpscares, shock value, and cool monsters, which are all great attributes. However, the reason why everything works so well is indisputably due to the profoundly well-explored family. Thematically, parenthood and family love are subjects that Krasinski and his team of writers deeply expand upon, primarily through the father-daughter relationship. Being a parent is seen by many as a daunting task, filled with the inevitable fear of not being considered a good father or mother. Lee and Regan's (Millicent Simmonds) difficulties in understanding each other are not only remarkably relatable, but their bond also contributes to some of the most emotional scenes of the movie.\r\n\r\nLee and Evelyn only desire to keep their children safe, but when the world is packed with merciless creatures that kill if a pin drops, some details like having a deaf daughter certainly don't help their mission. They do, however, dial up the levels of tension and suspense to their maximum. Krasinski shows tremendous skill as the director by delivering excruciatingly suspenseful build-ups and exceptionally effective scares. His ability to drastically change the entire mood of a scene offers the viewers several genuinely captivating sequences. Horror-wise, there's plenty to enjoy. From creative atmospheric sequences to jaw-dropping, shocking plot points, A Quiet Place has something for everyone.\r\n\r\nI've addressed Krasinski's work as both director and writer, but he also offers what I believe to be his career-best performance in a feature film. Both he and Emily Blunt perfectly capture the terrifying feeling of living in a post-apocalyptic environment. The protection of their children carries overwhelming despair of losing them to the visually distinct monsters, and both actors shine in their roles. However, my personal standout is Simmonds (Wonderstruck) and Noah Jupe (Honey Boy, Ford v Ferrari). Both were unknown young actors at the original release date, but they steal the spotlight from the big stars. Jupe proves that he has everything to become an Oscar-winner - the demand for him is exponentially rising - and Simmonds delivers one of the best performances I've ever seen from a real-life deaf actress, bringing a great deal of authenticity to her display.\r\n\r\nAll incorporate their characters seamlessly. The interactions between the adult and young actors feel as realistic and honest as possible, also due to the beautifully written screenplay. Technically, I must praise the phenomenal work done with such a low budget. All the way from the shooting location to the sound department, it truly feels like every single person had an essential role in the making of this movie. Not even the monsters are at fault, and there are a couple of close-ups that could have easily been awful, but the VFX artists really step up to the plate and deliver wonderfully horrific creatures. It's well-edited (Christopher Tellefsen), well-shot (Charlotte Bruus Christensen), and the score (Marco Beltrami) is employed just at the right moments.\r\n\r\nI only have one major issue with the film. Story-wise, even though the audience is placed in a fictional world, it feels so real that it's hard to ignore a couple of logical questions regarding the fate of the rest of humanity. These nitpicks don't really bother me, but the ending of the movie still doesn't sit well with me after many viewings. Without spoiling it, of course, the very last shot feels like a cry to Hollywood to make a sequel, which I have to admit is somewhat disappointing. Finally, a film that doesn't belong to cinematic universes or titanic franchises focuses on telling an engaging story with characters worth investing our time on… all to end in a slightly out-of-character moment so more movies can be made?\r\n\r\nA Quiet Place remains emotionally impactful, as well as incredibly suspenseful and tense, even after multiple viewings. Boasting a concept so unique yet so simple, John Krasinski and his fellow co-writers create a profoundly well-explored, character-driven horror story packed with relatable family issues and impressive performances across the board. Through justified shock value and surprisingly investing non-verbal dialogues, this film is one more piece of evidence that the best horror emerges from remarkable character building. The popular actor also proves to be a phenomenal director, generating extreme suspense quickly, drastically altering the entire atmosphere of a scene seamlessly. Technically, it genuinely feels like a low-budget flick where every single department has a noticeable impact on the final product, but the menacing, distinct-looking CGI monsters do steal the spotlight. Despite a few logical issues and an ending that feels more corporate than indie, my love for this movie continues intact. Hopefully, its sequel won't be a disappointment.\r\n\r\nRating: A-", "created_at": "2021-05-25T15:47:27.974Z"}, {"movie_id": 447332, "review_id": "60df798b4ca676004619a95d", "author_rating": 4.0, "review_text": "**Works for a normal audience, not for critical thinkers**\r\n\r\nAlmost an 8/10 on a different, shabbier, online movie database with almost 14 hundred reviews at the point of this review written. The hype is distorting the ratings of this movie, like the script is distorting the physical laws of sound. A creature film should not be hard to make, and the producers here had the budget, the special effects and the actors to do something interesting. Unfortunately suspending disbelief is impossible when nothing makes sense and so many questions are left unanswered. How can a pitiful monster like that overthrow mankind? Where is the power coming from? Not a single sound trap in the whole film? Did she turn off the faucet eventually? The creatures can come and go inside the shelter without breaking anything down (which you would hear)? But the humans did not prepare silent exits in their home? What even happened? And there is no story. The creatures come, humans make some sounds, they don't even fight, end of movie. It's like watching a boxing match with one guy weighing double the other, then last round the same guy weighs only half the other. How cheap and boring, I want to scream the screenwriter in his moronic ear. Disappointing and anti-climatic.\r\n\r\n27 June 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:39:39.428Z"}, {"movie_id": 447332, "review_id": "630015db097c49007f5fce6d", "author_rating": 9.0, "review_text": "**Overall : A Quiet Place creates an unnerving, tense, and terrifying world that skillfully drags its audience into its silent fear-filled universe.**\r\n\r\nThe most extraordinary theater experience of my life! The tension in the room silenced the crowd to a level requiring everyone to forgo chewing their snacks until a jump scare or rare moment of sound. John Krasinski's mastery of suspense and tension was unparalleled. Every second dripped with palpable fear and anxiety. Krasinski's creativity shined in every moment from the concept, writing, creature design, character development, and more. With decades of creature features, John Krasinski offered not only something new and innovative but something that raised the standards of the genre to a new level.", "created_at": "2022-08-19T22:59:39.450Z"}, {"movie_id": 447332, "review_id": "63fd63b09653f600853c28da", "author_rating": 7.0, "review_text": "***spoilers*** // Many (too many) a dumb moment, but <em>'A Quiet Place'</em> is a really good watch nevertheless.\r\n\r\nI will start with the positives that I have, as in fairness there are a number. The first, most obvious, being the sound design - excellent! Super effective. Emily Blunt and John Krasinski are very good, the pacing is on point (the 90mins fly by) and the monsters are well done.\r\n\r\nHowever, I did find myself questioning a lot of it - and I'm not usually one to notice, or at least criticise, characters being stupid etc. Here, though, it's too obvious - I think the top notch sound, or the lack thereof, actually heightens the flaws, which is unfortunate. From the very start I was like \"Really?!\", as well as at a few other moments - e.g. the nail.\r\n\r\nFirstly with the kid, like rule number one at primary school on field trips is adult at the front, then the kids and then another adult... who leaves the two most vulnerable people at the back in this situation, especially seconds after one of them has almost made a grave error - not even counting the fact that you just walk out the store and leave them alone after the event? Stuff like that, it's annoying that it took me out of it every now and then, I can't lie.\r\n\r\nAs noted though, it is still a fun watch and I'm certainly wanting to check out the sequel. I just don't think I've ever had a film that I enjoy but has such noticeable stupidness, the latter usually outweighs the former - or vice versa. So kudos for that, I guess, Krasinski & Co.", "created_at": "2023-02-28T02:15:12.246Z"}, {"movie_id": 447332, "review_id": "5ae1b72092514124bb00d195", "author_rating": 8.0, "review_text": "This review contains **spoilers**.\r\nSo let’s First get this out of The way I’ve never been more frustrated, by people eating popcorn, fidgeting, & Coming in late. \r\n\r\nAnyways form the very start I had so many questions, how’d they get here? Where’d the Monster come from? Etc. And by the end I have no answers and even more questions. Are they gonna survive and kill all the Monsters? Is everyone else dead? Why’d they think to have a baby? But that doesn’t matter.\r\n\r\nWe’re just tossed into this situation with no explanation to almost anything. The only things we really know is of course making lond sounds means you’re likely gonna die. And High Pitch Sounds Hurts the Monster. \r\n\r\nWish is a smart Choice and come to think of it is kinda obvious, maybe a little too obvious. Like how’d they never think about that? Either way. \r\n\r\nA quick note for surviving other then the soundproofing here and there. Why not have a sound bomb of sorts, you could just throw? That would have toldy saved the Dad from having to sacrifice him self. \r\n\r\nThat isn’t to say they’re stupid they had many Smart decisions such a The sand paths, the box for the baby (wish was kinda sad), the little sound proof room, the Radio, and the fireworks. And that’s just the sound related stuff the Lights and Fires Where also Smart.\r\n\r\nOtherwise the cast give us some incredible performances and lots of good chemistry. It probably helps that John and Emily are a real couple. Speaking of wich John Krasinski has Written and Directed a very clever and suspenseful horror film. I’ve never been more scared of corn in my life. Also had jumped at water. \r\n\r\nAnd the sound department specifically the Foley Artist have never shined greater in any film I have ever seen before. The sound is a way flipped from most horror films as it’s when the music drops and everything goes quiet that the Monster attacks. But not in this case everytime the Monster comes it’s a big moment.\r\n\r\nAlthough I have nothing against a R rating. In fact I’m somethimes more likely to see a film because of a R rating, it shows they have gus and they are willing to take a risk. F*ck you MPAA!!! \r\n\r\nAnyways some times all kinds of unnecessary crap is put in a Film because they like oh yeah we’re rated R. Although that’s not always needed this Film proves a well done PG-13 can still be dark and brutal. Killing a Child with in the first 10ish minuets, is a little dark. Although come on that kid had it Coming as soon as he grab those batteries. there’s almost a bit of blood maybe the MPAA is pulling back on some things. Probably not those F*ck you MPAA!!!\r\n\r\nOk sorry my review is getting to become rated R. 😆\r\n\r\nAlso I wanted to note for whatever reason I enjoy films where I can count the entire cast.\r\n\r\nAlong side Get Out it seems people form comedy make better Horror film Directors then most Horror film Directors. It definitely makes sense though it’s all about that timing.\r\n\r\n\r\nIn Short It was a gripping film from start to finish. I’d highly recommend to all Horror and Thriller Fans. Although because of spoilers in this review you probably already saw it. \r\n\r\n\r\nSo leave a comment and let’s discuss.\r\n\r\nNo likes", "created_at": "2018-04-26T11:25:20.198Z"}, {"movie_id": 447332, "review_id": "5af2664ac3a36855ac00755a", "author_rating": 8.0, "review_text": "**_No important spoilers here_**\r\n\r\nIn a **dystopic future**, the humanity has been severely smitten by strange blind creatures that feast on living flesh, both human and animal. In spite of being blind, the creatures have a super hearing and can identify sounds from far away. The creatures are nearly indestructible and very effective killers, and once they hear you, you are most likely dead.\r\n\r\nThe movie follows a surviving family trying to keep alive in this harsh reality. The movie setup is incredibly well-built to transpire the precaution, the constant fear, and the direful consequences of an unthought action in this terrible future. **The sound effects are awesome**, and the director can successfully use the nearly-constant silence in contrast to the hassle of being followed by those creatures.\r\n\r\nThe **acting is solid** and helps to immerse the watcher in the well-built plot.\r\n\r\nMy only regret for this movie is that it ends during a climax, when we are not ready to stop watching it yet. **It could be 30 minutes longer** to explain some missing points and to show what happens after the ending.\r\n\r\nOverall, **an awesome movie**, well-thought and beautifully produced in every aspect.", "created_at": "2018-05-09T03:08:58.988Z"}, {"movie_id": 447332, "review_id": "5bb5a604c3a368150c008e41", "author_rating": 6.0, "review_text": "Every time a horror movie does something that I've never seen before, that gets me very excited. _A Quiet Place_ is such a movie. I do believe that maybe _A Quiet Place_ doesn't **quite** deserve the praise that it has received. Not that it isn't a good movie, just that said acclaims have been **so** high, to the point that I think maybe just the fact that it's original isn't enough to earn those laurels.\r\n\r\nI still am a fan of the movie, hardline, absolutely, just maybe a little underwhelmed given the reviews.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-04T05:32:52.910Z"}, {"movie_id": 447332, "review_id": "5c15b05e0e0a2603883cff6d", "author_rating": 10.0, "review_text": "This is far and away one of the best movies I have ever watched, and I've watched a lot of movies!  The story is original, no  small feat these days, and the acting is just outstanding!  John Krasinski and Emily Blunt, along with the children, bring these characters to life, and make us really care, all without the benefit of well written dialogue.  That's not easy to do, but they do it.  Right from the start, you find yourself drawn into the lives of these people, and can feel the tension, the undercurrent of threat, that they live with every day.  Through all they face, we are also given a picture of a solid family, with a dad and mom doing everything possible to care for their children, the family praying together, holding onto faith even under the most difficult of circumstances, and that family dynamic really strengthens the entire story.  Who do you rely on when all is changed?  When everything goes wrong?  Family.  Along with the acting, the direction, sets, just everything, come together to deliver a truly scary movie, that doesn't rely on flash to terrify you.  Highly recommend this one.  We saw it in the theater, and bought it as soon as it hit the stores.  Top notch work.", "created_at": "2018-12-16T01:54:38.117Z"}, {"movie_id": 447332, "review_id": "5eadf69a1a934f0026e94386", "author_rating": 1.0, "review_text": "This film is terrible. How this pathetic excuse for entertainment has any rating is a mystery. It's an insult to art of film making and to the people who love cinema. Nobody in their right mind would suggest watching this hole ridden, ham acted, utter nonsense themed non-story movie to anybody. Save yourself the hassle, trust me, it's bad.", "created_at": "2020-05-02T22:39:22.859Z"}, {"movie_id": 447332, "review_id": "5ec1fc54cdf2e600204f6481", "author_rating": 5.0, "review_text": "_**Decent horror flick, but the family members make too many exasperating blunders**_\r\n\r\nA family tries to survive on their farm in rural New York while blind indestructible creatures prowl the landscape. The creatures find prey based on sound so they have to be careful to be quiet at all times. Emily Blunt plays the pregnant mother and John Krasinski her husband (Krasinski also directs).  \r\n\r\n“A Quiet Place” (2018) is a well-made horror flick that brings to mind “Signs” (2002) with ferocious creatures that mix the xenomorphs of “Alien/Aliens” with the extraterrestrials of “War of the Worlds” (2005). They’re basically a knock-off of the monster in “Cloverfield” (2008), albeit the smaller size of the creatures in those previous flicks.\r\n\r\nWhile this movie gets a lot of praise in some circles, the constant mistakes of the family members gets frustrating and tiresome. I love the tone, however, as well as Emily Blunt and the sumptuous Hudson River-area locations.     \r\n\r\nThe film runs 1 hour, 30 minutes, and was shot in the state of New York, about 50-65 miles north of the Big Apple (Beacon, Pawling & New Paltz), except for Little Falls, which is another 110 miles northwest.\r\n\r\nGRADE: C+/B-", "created_at": "2020-05-18T03:09:08.541Z"}, {"movie_id": 447332, "review_id": "60ad1c0f8c44b900412a7b4f", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEver since Jordan Peele shocked everyone with his feature directorial debut, Get Out, no one else questioned the potential that a well-known comedic actor could bring to the horror genre. Therefore, I vividly remember discovering that John Krasinski was directing, writing, and starring in a low-budget, original horror flick and feeling incredibly interested, to the point of considering it one of my most anticipated movies of the respective year. I absolutely adore the actor's memorable performance in The Office, but I never really saw anything worth noting from him after that show. Adding Emily Blunt (Sicario, Edge of Tomorrow) - her \"slightly more famous\" wife - was definitely an attention-grabbing move, especially when the young actors were still unknown at the time of release.\r\n\r\nWith the help of Bryan Woods and Scott Beck, Krasinski developed a screenplay based on a relatively simple yet highly impactful, imaginative premise. Creepy, scary monsters who hunt by sound isn't exactly a mind-blowing story aspect, but the extreme amount of tension and suspense transform a regular theater session into a nail-biting, nerve-wracking cinematic experience. Fortunately, the audience at my first screening was really invested in the film, which made for a truly unforgettable moment that I know some people didn't have due to disrespectful moviegoers. However, if there's one thing no one can take away from A Quiet Place is that it works just as well or better watching at home with the lights out in the silence of our own house.\r\n\r\nSome viewers might look at this movie solely as an entertaining horror film with effective jumpscares, shock value, and cool monsters, which are all great attributes. However, the reason why everything works so well is indisputably due to the profoundly well-explored family. Thematically, parenthood and family love are subjects that Krasinski and his team of writers deeply expand upon, primarily through the father-daughter relationship. Being a parent is seen by many as a daunting task, filled with the inevitable fear of not being considered a good father or mother. Lee and Regan's (Millicent Simmonds) difficulties in understanding each other are not only remarkably relatable, but their bond also contributes to some of the most emotional scenes of the movie.\r\n\r\nLee and Evelyn only desire to keep their children safe, but when the world is packed with merciless creatures that kill if a pin drops, some details like having a deaf daughter certainly don't help their mission. They do, however, dial up the levels of tension and suspense to their maximum. Krasinski shows tremendous skill as the director by delivering excruciatingly suspenseful build-ups and exceptionally effective scares. His ability to drastically change the entire mood of a scene offers the viewers several genuinely captivating sequences. Horror-wise, there's plenty to enjoy. From creative atmospheric sequences to jaw-dropping, shocking plot points, A Quiet Place has something for everyone.\r\n\r\nI've addressed Krasinski's work as both director and writer, but he also offers what I believe to be his career-best performance in a feature film. Both he and Emily Blunt perfectly capture the terrifying feeling of living in a post-apocalyptic environment. The protection of their children carries overwhelming despair of losing them to the visually distinct monsters, and both actors shine in their roles. However, my personal standout is Simmonds (Wonderstruck) and Noah Jupe (Honey Boy, Ford v Ferrari). Both were unknown young actors at the original release date, but they steal the spotlight from the big stars. Jupe proves that he has everything to become an Oscar-winner - the demand for him is exponentially rising - and Simmonds delivers one of the best performances I've ever seen from a real-life deaf actress, bringing a great deal of authenticity to her display.\r\n\r\nAll incorporate their characters seamlessly. The interactions between the adult and young actors feel as realistic and honest as possible, also due to the beautifully written screenplay. Technically, I must praise the phenomenal work done with such a low budget. All the way from the shooting location to the sound department, it truly feels like every single person had an essential role in the making of this movie. Not even the monsters are at fault, and there are a couple of close-ups that could have easily been awful, but the VFX artists really step up to the plate and deliver wonderfully horrific creatures. It's well-edited (Christopher Tellefsen), well-shot (Charlotte Bruus Christensen), and the score (Marco Beltrami) is employed just at the right moments.\r\n\r\nI only have one major issue with the film. Story-wise, even though the audience is placed in a fictional world, it feels so real that it's hard to ignore a couple of logical questions regarding the fate of the rest of humanity. These nitpicks don't really bother me, but the ending of the movie still doesn't sit well with me after many viewings. Without spoiling it, of course, the very last shot feels like a cry to Hollywood to make a sequel, which I have to admit is somewhat disappointing. Finally, a film that doesn't belong to cinematic universes or titanic franchises focuses on telling an engaging story with characters worth investing our time on… all to end in a slightly out-of-character moment so more movies can be made?\r\n\r\nA Quiet Place remains emotionally impactful, as well as incredibly suspenseful and tense, even after multiple viewings. Boasting a concept so unique yet so simple, John Krasinski and his fellow co-writers create a profoundly well-explored, character-driven horror story packed with relatable family issues and impressive performances across the board. Through justified shock value and surprisingly investing non-verbal dialogues, this film is one more piece of evidence that the best horror emerges from remarkable character building. The popular actor also proves to be a phenomenal director, generating extreme suspense quickly, drastically altering the entire atmosphere of a scene seamlessly. Technically, it genuinely feels like a low-budget flick where every single department has a noticeable impact on the final product, but the menacing, distinct-looking CGI monsters do steal the spotlight. Despite a few logical issues and an ending that feels more corporate than indie, my love for this movie continues intact. Hopefully, its sequel won't be a disappointment.\r\n\r\nRating: A-", "created_at": "2021-05-25T15:47:27.974Z"}, {"movie_id": 447332, "review_id": "60df798b4ca676004619a95d", "author_rating": 4.0, "review_text": "**Works for a normal audience, not for critical thinkers**\r\n\r\nAlmost an 8/10 on a different, shabbier, online movie database with almost 14 hundred reviews at the point of this review written. The hype is distorting the ratings of this movie, like the script is distorting the physical laws of sound. A creature film should not be hard to make, and the producers here had the budget, the special effects and the actors to do something interesting. Unfortunately suspending disbelief is impossible when nothing makes sense and so many questions are left unanswered. How can a pitiful monster like that overthrow mankind? Where is the power coming from? Not a single sound trap in the whole film? Did she turn off the faucet eventually? The creatures can come and go inside the shelter without breaking anything down (which you would hear)? But the humans did not prepare silent exits in their home? What even happened? And there is no story. The creatures come, humans make some sounds, they don't even fight, end of movie. It's like watching a boxing match with one guy weighing double the other, then last round the same guy weighs only half the other. How cheap and boring, I want to scream the screenwriter in his moronic ear. Disappointing and anti-climatic.\r\n\r\n27 June 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:39:39.428Z"}, {"movie_id": 447332, "review_id": "630015db097c49007f5fce6d", "author_rating": 9.0, "review_text": "**Overall : A Quiet Place creates an unnerving, tense, and terrifying world that skillfully drags its audience into its silent fear-filled universe.**\r\n\r\nThe most extraordinary theater experience of my life! The tension in the room silenced the crowd to a level requiring everyone to forgo chewing their snacks until a jump scare or rare moment of sound. John Krasinski's mastery of suspense and tension was unparalleled. Every second dripped with palpable fear and anxiety. Krasinski's creativity shined in every moment from the concept, writing, creature design, character development, and more. With decades of creature features, John Krasinski offered not only something new and innovative but something that raised the standards of the genre to a new level.", "created_at": "2022-08-19T22:59:39.450Z"}, {"movie_id": 447332, "review_id": "63fd63b09653f600853c28da", "author_rating": 7.0, "review_text": "***spoilers*** // Many (too many) a dumb moment, but <em>'A Quiet Place'</em> is a really good watch nevertheless.\r\n\r\nI will start with the positives that I have, as in fairness there are a number. The first, most obvious, being the sound design - excellent! Super effective. Emily Blunt and John Krasinski are very good, the pacing is on point (the 90mins fly by) and the monsters are well done.\r\n\r\nHowever, I did find myself questioning a lot of it - and I'm not usually one to notice, or at least criticise, characters being stupid etc. Here, though, it's too obvious - I think the top notch sound, or the lack thereof, actually heightens the flaws, which is unfortunate. From the very start I was like \"Really?!\", as well as at a few other moments - e.g. the nail.\r\n\r\nFirstly with the kid, like rule number one at primary school on field trips is adult at the front, then the kids and then another adult... who leaves the two most vulnerable people at the back in this situation, especially seconds after one of them has almost made a grave error - not even counting the fact that you just walk out the store and leave them alone after the event? Stuff like that, it's annoying that it took me out of it every now and then, I can't lie.\r\n\r\nAs noted though, it is still a fun watch and I'm certainly wanting to check out the sequel. I just don't think I've ever had a film that I enjoy but has such noticeable stupidness, the latter usually outweighs the former - or vice versa. So kudos for that, I guess, Krasinski & Co.", "created_at": "2023-02-28T02:15:12.246Z"}, {"movie_id": 447332, "review_id": "5ae1b72092514124bb00d195", "author_rating": 8.0, "review_text": "This review contains **spoilers**.\r\nSo let’s First get this out of The way I’ve never been more frustrated, by people eating popcorn, fidgeting, & Coming in late. \r\n\r\nAnyways form the very start I had so many questions, how’d they get here? Where’d the Monster come from? Etc. And by the end I have no answers and even more questions. Are they gonna survive and kill all the Monsters? Is everyone else dead? Why’d they think to have a baby? But that doesn’t matter.\r\n\r\nWe’re just tossed into this situation with no explanation to almost anything. The only things we really know is of course making lond sounds means you’re likely gonna die. And High Pitch Sounds Hurts the Monster. \r\n\r\nWish is a smart Choice and come to think of it is kinda obvious, maybe a little too obvious. Like how’d they never think about that? Either way. \r\n\r\nA quick note for surviving other then the soundproofing here and there. Why not have a sound bomb of sorts, you could just throw? That would have toldy saved the Dad from having to sacrifice him self. \r\n\r\nThat isn’t to say they’re stupid they had many Smart decisions such a The sand paths, the box for the baby (wish was kinda sad), the little sound proof room, the Radio, and the fireworks. And that’s just the sound related stuff the Lights and Fires Where also Smart.\r\n\r\nOtherwise the cast give us some incredible performances and lots of good chemistry. It probably helps that John and Emily are a real couple. Speaking of wich John Krasinski has Written and Directed a very clever and suspenseful horror film. I’ve never been more scared of corn in my life. Also had jumped at water. \r\n\r\nAnd the sound department specifically the Foley Artist have never shined greater in any film I have ever seen before. The sound is a way flipped from most horror films as it’s when the music drops and everything goes quiet that the Monster attacks. But not in this case everytime the Monster comes it’s a big moment.\r\n\r\nAlthough I have nothing against a R rating. In fact I’m somethimes more likely to see a film because of a R rating, it shows they have gus and they are willing to take a risk. F*ck you MPAA!!! \r\n\r\nAnyways some times all kinds of unnecessary crap is put in a Film because they like oh yeah we’re rated R. Although that’s not always needed this Film proves a well done PG-13 can still be dark and brutal. Killing a Child with in the first 10ish minuets, is a little dark. Although come on that kid had it Coming as soon as he grab those batteries. there’s almost a bit of blood maybe the MPAA is pulling back on some things. Probably not those F*ck you MPAA!!!\r\n\r\nOk sorry my review is getting to become rated R. 😆\r\n\r\nAlso I wanted to note for whatever reason I enjoy films where I can count the entire cast.\r\n\r\nAlong side Get Out it seems people form comedy make better Horror film Directors then most Horror film Directors. It definitely makes sense though it’s all about that timing.\r\n\r\n\r\nIn Short It was a gripping film from start to finish. I’d highly recommend to all Horror and Thriller Fans. Although because of spoilers in this review you probably already saw it. \r\n\r\n\r\nSo leave a comment and let’s discuss.\r\n\r\nNo likes", "created_at": "2018-04-26T11:25:20.198Z"}, {"movie_id": 447332, "review_id": "5af2664ac3a36855ac00755a", "author_rating": 8.0, "review_text": "**_No important spoilers here_**\r\n\r\nIn a **dystopic future**, the humanity has been severely smitten by strange blind creatures that feast on living flesh, both human and animal. In spite of being blind, the creatures have a super hearing and can identify sounds from far away. The creatures are nearly indestructible and very effective killers, and once they hear you, you are most likely dead.\r\n\r\nThe movie follows a surviving family trying to keep alive in this harsh reality. The movie setup is incredibly well-built to transpire the precaution, the constant fear, and the direful consequences of an unthought action in this terrible future. **The sound effects are awesome**, and the director can successfully use the nearly-constant silence in contrast to the hassle of being followed by those creatures.\r\n\r\nThe **acting is solid** and helps to immerse the watcher in the well-built plot.\r\n\r\nMy only regret for this movie is that it ends during a climax, when we are not ready to stop watching it yet. **It could be 30 minutes longer** to explain some missing points and to show what happens after the ending.\r\n\r\nOverall, **an awesome movie**, well-thought and beautifully produced in every aspect.", "created_at": "2018-05-09T03:08:58.988Z"}, {"movie_id": 447332, "review_id": "5bb5a604c3a368150c008e41", "author_rating": 6.0, "review_text": "Every time a horror movie does something that I've never seen before, that gets me very excited. _A Quiet Place_ is such a movie. I do believe that maybe _A Quiet Place_ doesn't **quite** deserve the praise that it has received. Not that it isn't a good movie, just that said acclaims have been **so** high, to the point that I think maybe just the fact that it's original isn't enough to earn those laurels.\r\n\r\nI still am a fan of the movie, hardline, absolutely, just maybe a little underwhelmed given the reviews.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-04T05:32:52.910Z"}, {"movie_id": 447332, "review_id": "5c15b05e0e0a2603883cff6d", "author_rating": 10.0, "review_text": "This is far and away one of the best movies I have ever watched, and I've watched a lot of movies!  The story is original, no  small feat these days, and the acting is just outstanding!  John Krasinski and Emily Blunt, along with the children, bring these characters to life, and make us really care, all without the benefit of well written dialogue.  That's not easy to do, but they do it.  Right from the start, you find yourself drawn into the lives of these people, and can feel the tension, the undercurrent of threat, that they live with every day.  Through all they face, we are also given a picture of a solid family, with a dad and mom doing everything possible to care for their children, the family praying together, holding onto faith even under the most difficult of circumstances, and that family dynamic really strengthens the entire story.  Who do you rely on when all is changed?  When everything goes wrong?  Family.  Along with the acting, the direction, sets, just everything, come together to deliver a truly scary movie, that doesn't rely on flash to terrify you.  Highly recommend this one.  We saw it in the theater, and bought it as soon as it hit the stores.  Top notch work.", "created_at": "2018-12-16T01:54:38.117Z"}, {"movie_id": 447332, "review_id": "5eadf69a1a934f0026e94386", "author_rating": 1.0, "review_text": "This film is terrible. How this pathetic excuse for entertainment has any rating is a mystery. It's an insult to art of film making and to the people who love cinema. Nobody in their right mind would suggest watching this hole ridden, ham acted, utter nonsense themed non-story movie to anybody. Save yourself the hassle, trust me, it's bad.", "created_at": "2020-05-02T22:39:22.859Z"}, {"movie_id": 447332, "review_id": "5ec1fc54cdf2e600204f6481", "author_rating": 5.0, "review_text": "_**Decent horror flick, but the family members make too many exasperating blunders**_\r\n\r\nA family tries to survive on their farm in rural New York while blind indestructible creatures prowl the landscape. The creatures find prey based on sound so they have to be careful to be quiet at all times. Emily Blunt plays the pregnant mother and John Krasinski her husband (Krasinski also directs).  \r\n\r\n“A Quiet Place” (2018) is a well-made horror flick that brings to mind “Signs” (2002) with ferocious creatures that mix the xenomorphs of “Alien/Aliens” with the extraterrestrials of “War of the Worlds” (2005). They’re basically a knock-off of the monster in “Cloverfield” (2008), albeit the smaller size of the creatures in those previous flicks.\r\n\r\nWhile this movie gets a lot of praise in some circles, the constant mistakes of the family members gets frustrating and tiresome. I love the tone, however, as well as Emily Blunt and the sumptuous Hudson River-area locations.     \r\n\r\nThe film runs 1 hour, 30 minutes, and was shot in the state of New York, about 50-65 miles north of the Big Apple (Beacon, Pawling & New Paltz), except for Little Falls, which is another 110 miles northwest.\r\n\r\nGRADE: C+/B-", "created_at": "2020-05-18T03:09:08.541Z"}, {"movie_id": 447332, "review_id": "60ad1c0f8c44b900412a7b4f", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEver since Jordan Peele shocked everyone with his feature directorial debut, Get Out, no one else questioned the potential that a well-known comedic actor could bring to the horror genre. Therefore, I vividly remember discovering that John Krasinski was directing, writing, and starring in a low-budget, original horror flick and feeling incredibly interested, to the point of considering it one of my most anticipated movies of the respective year. I absolutely adore the actor's memorable performance in The Office, but I never really saw anything worth noting from him after that show. Adding Emily Blunt (Sicario, Edge of Tomorrow) - her \"slightly more famous\" wife - was definitely an attention-grabbing move, especially when the young actors were still unknown at the time of release.\r\n\r\nWith the help of Bryan Woods and Scott Beck, Krasinski developed a screenplay based on a relatively simple yet highly impactful, imaginative premise. Creepy, scary monsters who hunt by sound isn't exactly a mind-blowing story aspect, but the extreme amount of tension and suspense transform a regular theater session into a nail-biting, nerve-wracking cinematic experience. Fortunately, the audience at my first screening was really invested in the film, which made for a truly unforgettable moment that I know some people didn't have due to disrespectful moviegoers. However, if there's one thing no one can take away from A Quiet Place is that it works just as well or better watching at home with the lights out in the silence of our own house.\r\n\r\nSome viewers might look at this movie solely as an entertaining horror film with effective jumpscares, shock value, and cool monsters, which are all great attributes. However, the reason why everything works so well is indisputably due to the profoundly well-explored family. Thematically, parenthood and family love are subjects that Krasinski and his team of writers deeply expand upon, primarily through the father-daughter relationship. Being a parent is seen by many as a daunting task, filled with the inevitable fear of not being considered a good father or mother. Lee and Regan's (Millicent Simmonds) difficulties in understanding each other are not only remarkably relatable, but their bond also contributes to some of the most emotional scenes of the movie.\r\n\r\nLee and Evelyn only desire to keep their children safe, but when the world is packed with merciless creatures that kill if a pin drops, some details like having a deaf daughter certainly don't help their mission. They do, however, dial up the levels of tension and suspense to their maximum. Krasinski shows tremendous skill as the director by delivering excruciatingly suspenseful build-ups and exceptionally effective scares. His ability to drastically change the entire mood of a scene offers the viewers several genuinely captivating sequences. Horror-wise, there's plenty to enjoy. From creative atmospheric sequences to jaw-dropping, shocking plot points, A Quiet Place has something for everyone.\r\n\r\nI've addressed Krasinski's work as both director and writer, but he also offers what I believe to be his career-best performance in a feature film. Both he and Emily Blunt perfectly capture the terrifying feeling of living in a post-apocalyptic environment. The protection of their children carries overwhelming despair of losing them to the visually distinct monsters, and both actors shine in their roles. However, my personal standout is Simmonds (Wonderstruck) and Noah Jupe (Honey Boy, Ford v Ferrari). Both were unknown young actors at the original release date, but they steal the spotlight from the big stars. Jupe proves that he has everything to become an Oscar-winner - the demand for him is exponentially rising - and Simmonds delivers one of the best performances I've ever seen from a real-life deaf actress, bringing a great deal of authenticity to her display.\r\n\r\nAll incorporate their characters seamlessly. The interactions between the adult and young actors feel as realistic and honest as possible, also due to the beautifully written screenplay. Technically, I must praise the phenomenal work done with such a low budget. All the way from the shooting location to the sound department, it truly feels like every single person had an essential role in the making of this movie. Not even the monsters are at fault, and there are a couple of close-ups that could have easily been awful, but the VFX artists really step up to the plate and deliver wonderfully horrific creatures. It's well-edited (Christopher Tellefsen), well-shot (Charlotte Bruus Christensen), and the score (Marco Beltrami) is employed just at the right moments.\r\n\r\nI only have one major issue with the film. Story-wise, even though the audience is placed in a fictional world, it feels so real that it's hard to ignore a couple of logical questions regarding the fate of the rest of humanity. These nitpicks don't really bother me, but the ending of the movie still doesn't sit well with me after many viewings. Without spoiling it, of course, the very last shot feels like a cry to Hollywood to make a sequel, which I have to admit is somewhat disappointing. Finally, a film that doesn't belong to cinematic universes or titanic franchises focuses on telling an engaging story with characters worth investing our time on… all to end in a slightly out-of-character moment so more movies can be made?\r\n\r\nA Quiet Place remains emotionally impactful, as well as incredibly suspenseful and tense, even after multiple viewings. Boasting a concept so unique yet so simple, John Krasinski and his fellow co-writers create a profoundly well-explored, character-driven horror story packed with relatable family issues and impressive performances across the board. Through justified shock value and surprisingly investing non-verbal dialogues, this film is one more piece of evidence that the best horror emerges from remarkable character building. The popular actor also proves to be a phenomenal director, generating extreme suspense quickly, drastically altering the entire atmosphere of a scene seamlessly. Technically, it genuinely feels like a low-budget flick where every single department has a noticeable impact on the final product, but the menacing, distinct-looking CGI monsters do steal the spotlight. Despite a few logical issues and an ending that feels more corporate than indie, my love for this movie continues intact. Hopefully, its sequel won't be a disappointment.\r\n\r\nRating: A-", "created_at": "2021-05-25T15:47:27.974Z"}, {"movie_id": 447332, "review_id": "60df798b4ca676004619a95d", "author_rating": 4.0, "review_text": "**Works for a normal audience, not for critical thinkers**\r\n\r\nAlmost an 8/10 on a different, shabbier, online movie database with almost 14 hundred reviews at the point of this review written. The hype is distorting the ratings of this movie, like the script is distorting the physical laws of sound. A creature film should not be hard to make, and the producers here had the budget, the special effects and the actors to do something interesting. Unfortunately suspending disbelief is impossible when nothing makes sense and so many questions are left unanswered. How can a pitiful monster like that overthrow mankind? Where is the power coming from? Not a single sound trap in the whole film? Did she turn off the faucet eventually? The creatures can come and go inside the shelter without breaking anything down (which you would hear)? But the humans did not prepare silent exits in their home? What even happened? And there is no story. The creatures come, humans make some sounds, they don't even fight, end of movie. It's like watching a boxing match with one guy weighing double the other, then last round the same guy weighs only half the other. How cheap and boring, I want to scream the screenwriter in his moronic ear. Disappointing and anti-climatic.\r\n\r\n27 June 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:39:39.428Z"}, {"movie_id": 447332, "review_id": "630015db097c49007f5fce6d", "author_rating": 9.0, "review_text": "**Overall : A Quiet Place creates an unnerving, tense, and terrifying world that skillfully drags its audience into its silent fear-filled universe.**\r\n\r\nThe most extraordinary theater experience of my life! The tension in the room silenced the crowd to a level requiring everyone to forgo chewing their snacks until a jump scare or rare moment of sound. John Krasinski's mastery of suspense and tension was unparalleled. Every second dripped with palpable fear and anxiety. Krasinski's creativity shined in every moment from the concept, writing, creature design, character development, and more. With decades of creature features, John Krasinski offered not only something new and innovative but something that raised the standards of the genre to a new level.", "created_at": "2022-08-19T22:59:39.450Z"}, {"movie_id": 447332, "review_id": "63fd63b09653f600853c28da", "author_rating": 7.0, "review_text": "***spoilers*** // Many (too many) a dumb moment, but <em>'A Quiet Place'</em> is a really good watch nevertheless.\r\n\r\nI will start with the positives that I have, as in fairness there are a number. The first, most obvious, being the sound design - excellent! Super effective. Emily Blunt and John Krasinski are very good, the pacing is on point (the 90mins fly by) and the monsters are well done.\r\n\r\nHowever, I did find myself questioning a lot of it - and I'm not usually one to notice, or at least criticise, characters being stupid etc. Here, though, it's too obvious - I think the top notch sound, or the lack thereof, actually heightens the flaws, which is unfortunate. From the very start I was like \"Really?!\", as well as at a few other moments - e.g. the nail.\r\n\r\nFirstly with the kid, like rule number one at primary school on field trips is adult at the front, then the kids and then another adult... who leaves the two most vulnerable people at the back in this situation, especially seconds after one of them has almost made a grave error - not even counting the fact that you just walk out the store and leave them alone after the event? Stuff like that, it's annoying that it took me out of it every now and then, I can't lie.\r\n\r\nAs noted though, it is still a fun watch and I'm certainly wanting to check out the sequel. I just don't think I've ever had a film that I enjoy but has such noticeable stupidness, the latter usually outweighs the former - or vice versa. So kudos for that, I guess, Krasinski & Co.", "created_at": "2023-02-28T02:15:12.246Z"}, {"movie_id": 447332, "review_id": "5ae1b72092514124bb00d195", "author_rating": 8.0, "review_text": "This review contains **spoilers**.\r\nSo let’s First get this out of The way I’ve never been more frustrated, by people eating popcorn, fidgeting, & Coming in late. \r\n\r\nAnyways form the very start I had so many questions, how’d they get here? Where’d the Monster come from? Etc. And by the end I have no answers and even more questions. Are they gonna survive and kill all the Monsters? Is everyone else dead? Why’d they think to have a baby? But that doesn’t matter.\r\n\r\nWe’re just tossed into this situation with no explanation to almost anything. The only things we really know is of course making lond sounds means you’re likely gonna die. And High Pitch Sounds Hurts the Monster. \r\n\r\nWish is a smart Choice and come to think of it is kinda obvious, maybe a little too obvious. Like how’d they never think about that? Either way. \r\n\r\nA quick note for surviving other then the soundproofing here and there. Why not have a sound bomb of sorts, you could just throw? That would have toldy saved the Dad from having to sacrifice him self. \r\n\r\nThat isn’t to say they’re stupid they had many Smart decisions such a The sand paths, the box for the baby (wish was kinda sad), the little sound proof room, the Radio, and the fireworks. And that’s just the sound related stuff the Lights and Fires Where also Smart.\r\n\r\nOtherwise the cast give us some incredible performances and lots of good chemistry. It probably helps that John and Emily are a real couple. Speaking of wich John Krasinski has Written and Directed a very clever and suspenseful horror film. I’ve never been more scared of corn in my life. Also had jumped at water. \r\n\r\nAnd the sound department specifically the Foley Artist have never shined greater in any film I have ever seen before. The sound is a way flipped from most horror films as it’s when the music drops and everything goes quiet that the Monster attacks. But not in this case everytime the Monster comes it’s a big moment.\r\n\r\nAlthough I have nothing against a R rating. In fact I’m somethimes more likely to see a film because of a R rating, it shows they have gus and they are willing to take a risk. F*ck you MPAA!!! \r\n\r\nAnyways some times all kinds of unnecessary crap is put in a Film because they like oh yeah we’re rated R. Although that’s not always needed this Film proves a well done PG-13 can still be dark and brutal. Killing a Child with in the first 10ish minuets, is a little dark. Although come on that kid had it Coming as soon as he grab those batteries. there’s almost a bit of blood maybe the MPAA is pulling back on some things. Probably not those F*ck you MPAA!!!\r\n\r\nOk sorry my review is getting to become rated R. 😆\r\n\r\nAlso I wanted to note for whatever reason I enjoy films where I can count the entire cast.\r\n\r\nAlong side Get Out it seems people form comedy make better Horror film Directors then most Horror film Directors. It definitely makes sense though it’s all about that timing.\r\n\r\n\r\nIn Short It was a gripping film from start to finish. I’d highly recommend to all Horror and Thriller Fans. Although because of spoilers in this review you probably already saw it. \r\n\r\n\r\nSo leave a comment and let’s discuss.\r\n\r\nNo likes", "created_at": "2018-04-26T11:25:20.198Z"}, {"movie_id": 447332, "review_id": "5af2664ac3a36855ac00755a", "author_rating": 8.0, "review_text": "**_No important spoilers here_**\r\n\r\nIn a **dystopic future**, the humanity has been severely smitten by strange blind creatures that feast on living flesh, both human and animal. In spite of being blind, the creatures have a super hearing and can identify sounds from far away. The creatures are nearly indestructible and very effective killers, and once they hear you, you are most likely dead.\r\n\r\nThe movie follows a surviving family trying to keep alive in this harsh reality. The movie setup is incredibly well-built to transpire the precaution, the constant fear, and the direful consequences of an unthought action in this terrible future. **The sound effects are awesome**, and the director can successfully use the nearly-constant silence in contrast to the hassle of being followed by those creatures.\r\n\r\nThe **acting is solid** and helps to immerse the watcher in the well-built plot.\r\n\r\nMy only regret for this movie is that it ends during a climax, when we are not ready to stop watching it yet. **It could be 30 minutes longer** to explain some missing points and to show what happens after the ending.\r\n\r\nOverall, **an awesome movie**, well-thought and beautifully produced in every aspect.", "created_at": "2018-05-09T03:08:58.988Z"}, {"movie_id": 447332, "review_id": "5bb5a604c3a368150c008e41", "author_rating": 6.0, "review_text": "Every time a horror movie does something that I've never seen before, that gets me very excited. _A Quiet Place_ is such a movie. I do believe that maybe _A Quiet Place_ doesn't **quite** deserve the praise that it has received. Not that it isn't a good movie, just that said acclaims have been **so** high, to the point that I think maybe just the fact that it's original isn't enough to earn those laurels.\r\n\r\nI still am a fan of the movie, hardline, absolutely, just maybe a little underwhelmed given the reviews.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-04T05:32:52.910Z"}, {"movie_id": 447332, "review_id": "5c15b05e0e0a2603883cff6d", "author_rating": 10.0, "review_text": "This is far and away one of the best movies I have ever watched, and I've watched a lot of movies!  The story is original, no  small feat these days, and the acting is just outstanding!  John Krasinski and Emily Blunt, along with the children, bring these characters to life, and make us really care, all without the benefit of well written dialogue.  That's not easy to do, but they do it.  Right from the start, you find yourself drawn into the lives of these people, and can feel the tension, the undercurrent of threat, that they live with every day.  Through all they face, we are also given a picture of a solid family, with a dad and mom doing everything possible to care for their children, the family praying together, holding onto faith even under the most difficult of circumstances, and that family dynamic really strengthens the entire story.  Who do you rely on when all is changed?  When everything goes wrong?  Family.  Along with the acting, the direction, sets, just everything, come together to deliver a truly scary movie, that doesn't rely on flash to terrify you.  Highly recommend this one.  We saw it in the theater, and bought it as soon as it hit the stores.  Top notch work.", "created_at": "2018-12-16T01:54:38.117Z"}, {"movie_id": 447332, "review_id": "5eadf69a1a934f0026e94386", "author_rating": 1.0, "review_text": "This film is terrible. How this pathetic excuse for entertainment has any rating is a mystery. It's an insult to art of film making and to the people who love cinema. Nobody in their right mind would suggest watching this hole ridden, ham acted, utter nonsense themed non-story movie to anybody. Save yourself the hassle, trust me, it's bad.", "created_at": "2020-05-02T22:39:22.859Z"}, {"movie_id": 447332, "review_id": "5ec1fc54cdf2e600204f6481", "author_rating": 5.0, "review_text": "_**Decent horror flick, but the family members make too many exasperating blunders**_\r\n\r\nA family tries to survive on their farm in rural New York while blind indestructible creatures prowl the landscape. The creatures find prey based on sound so they have to be careful to be quiet at all times. Emily Blunt plays the pregnant mother and John Krasinski her husband (Krasinski also directs).  \r\n\r\n“A Quiet Place” (2018) is a well-made horror flick that brings to mind “Signs” (2002) with ferocious creatures that mix the xenomorphs of “Alien/Aliens” with the extraterrestrials of “War of the Worlds” (2005). They’re basically a knock-off of the monster in “Cloverfield” (2008), albeit the smaller size of the creatures in those previous flicks.\r\n\r\nWhile this movie gets a lot of praise in some circles, the constant mistakes of the family members gets frustrating and tiresome. I love the tone, however, as well as Emily Blunt and the sumptuous Hudson River-area locations.     \r\n\r\nThe film runs 1 hour, 30 minutes, and was shot in the state of New York, about 50-65 miles north of the Big Apple (Beacon, Pawling & New Paltz), except for Little Falls, which is another 110 miles northwest.\r\n\r\nGRADE: C+/B-", "created_at": "2020-05-18T03:09:08.541Z"}, {"movie_id": 447332, "review_id": "60ad1c0f8c44b900412a7b4f", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEver since Jordan Peele shocked everyone with his feature directorial debut, Get Out, no one else questioned the potential that a well-known comedic actor could bring to the horror genre. Therefore, I vividly remember discovering that John Krasinski was directing, writing, and starring in a low-budget, original horror flick and feeling incredibly interested, to the point of considering it one of my most anticipated movies of the respective year. I absolutely adore the actor's memorable performance in The Office, but I never really saw anything worth noting from him after that show. Adding Emily Blunt (Sicario, Edge of Tomorrow) - her \"slightly more famous\" wife - was definitely an attention-grabbing move, especially when the young actors were still unknown at the time of release.\r\n\r\nWith the help of Bryan Woods and Scott Beck, Krasinski developed a screenplay based on a relatively simple yet highly impactful, imaginative premise. Creepy, scary monsters who hunt by sound isn't exactly a mind-blowing story aspect, but the extreme amount of tension and suspense transform a regular theater session into a nail-biting, nerve-wracking cinematic experience. Fortunately, the audience at my first screening was really invested in the film, which made for a truly unforgettable moment that I know some people didn't have due to disrespectful moviegoers. However, if there's one thing no one can take away from A Quiet Place is that it works just as well or better watching at home with the lights out in the silence of our own house.\r\n\r\nSome viewers might look at this movie solely as an entertaining horror film with effective jumpscares, shock value, and cool monsters, which are all great attributes. However, the reason why everything works so well is indisputably due to the profoundly well-explored family. Thematically, parenthood and family love are subjects that Krasinski and his team of writers deeply expand upon, primarily through the father-daughter relationship. Being a parent is seen by many as a daunting task, filled with the inevitable fear of not being considered a good father or mother. Lee and Regan's (Millicent Simmonds) difficulties in understanding each other are not only remarkably relatable, but their bond also contributes to some of the most emotional scenes of the movie.\r\n\r\nLee and Evelyn only desire to keep their children safe, but when the world is packed with merciless creatures that kill if a pin drops, some details like having a deaf daughter certainly don't help their mission. They do, however, dial up the levels of tension and suspense to their maximum. Krasinski shows tremendous skill as the director by delivering excruciatingly suspenseful build-ups and exceptionally effective scares. His ability to drastically change the entire mood of a scene offers the viewers several genuinely captivating sequences. Horror-wise, there's plenty to enjoy. From creative atmospheric sequences to jaw-dropping, shocking plot points, A Quiet Place has something for everyone.\r\n\r\nI've addressed Krasinski's work as both director and writer, but he also offers what I believe to be his career-best performance in a feature film. Both he and Emily Blunt perfectly capture the terrifying feeling of living in a post-apocalyptic environment. The protection of their children carries overwhelming despair of losing them to the visually distinct monsters, and both actors shine in their roles. However, my personal standout is Simmonds (Wonderstruck) and Noah Jupe (Honey Boy, Ford v Ferrari). Both were unknown young actors at the original release date, but they steal the spotlight from the big stars. Jupe proves that he has everything to become an Oscar-winner - the demand for him is exponentially rising - and Simmonds delivers one of the best performances I've ever seen from a real-life deaf actress, bringing a great deal of authenticity to her display.\r\n\r\nAll incorporate their characters seamlessly. The interactions between the adult and young actors feel as realistic and honest as possible, also due to the beautifully written screenplay. Technically, I must praise the phenomenal work done with such a low budget. All the way from the shooting location to the sound department, it truly feels like every single person had an essential role in the making of this movie. Not even the monsters are at fault, and there are a couple of close-ups that could have easily been awful, but the VFX artists really step up to the plate and deliver wonderfully horrific creatures. It's well-edited (Christopher Tellefsen), well-shot (Charlotte Bruus Christensen), and the score (Marco Beltrami) is employed just at the right moments.\r\n\r\nI only have one major issue with the film. Story-wise, even though the audience is placed in a fictional world, it feels so real that it's hard to ignore a couple of logical questions regarding the fate of the rest of humanity. These nitpicks don't really bother me, but the ending of the movie still doesn't sit well with me after many viewings. Without spoiling it, of course, the very last shot feels like a cry to Hollywood to make a sequel, which I have to admit is somewhat disappointing. Finally, a film that doesn't belong to cinematic universes or titanic franchises focuses on telling an engaging story with characters worth investing our time on… all to end in a slightly out-of-character moment so more movies can be made?\r\n\r\nA Quiet Place remains emotionally impactful, as well as incredibly suspenseful and tense, even after multiple viewings. Boasting a concept so unique yet so simple, John Krasinski and his fellow co-writers create a profoundly well-explored, character-driven horror story packed with relatable family issues and impressive performances across the board. Through justified shock value and surprisingly investing non-verbal dialogues, this film is one more piece of evidence that the best horror emerges from remarkable character building. The popular actor also proves to be a phenomenal director, generating extreme suspense quickly, drastically altering the entire atmosphere of a scene seamlessly. Technically, it genuinely feels like a low-budget flick where every single department has a noticeable impact on the final product, but the menacing, distinct-looking CGI monsters do steal the spotlight. Despite a few logical issues and an ending that feels more corporate than indie, my love for this movie continues intact. Hopefully, its sequel won't be a disappointment.\r\n\r\nRating: A-", "created_at": "2021-05-25T15:47:27.974Z"}, {"movie_id": 447332, "review_id": "60df798b4ca676004619a95d", "author_rating": 4.0, "review_text": "**Works for a normal audience, not for critical thinkers**\r\n\r\nAlmost an 8/10 on a different, shabbier, online movie database with almost 14 hundred reviews at the point of this review written. The hype is distorting the ratings of this movie, like the script is distorting the physical laws of sound. A creature film should not be hard to make, and the producers here had the budget, the special effects and the actors to do something interesting. Unfortunately suspending disbelief is impossible when nothing makes sense and so many questions are left unanswered. How can a pitiful monster like that overthrow mankind? Where is the power coming from? Not a single sound trap in the whole film? Did she turn off the faucet eventually? The creatures can come and go inside the shelter without breaking anything down (which you would hear)? But the humans did not prepare silent exits in their home? What even happened? And there is no story. The creatures come, humans make some sounds, they don't even fight, end of movie. It's like watching a boxing match with one guy weighing double the other, then last round the same guy weighs only half the other. How cheap and boring, I want to scream the screenwriter in his moronic ear. Disappointing and anti-climatic.\r\n\r\n27 June 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:39:39.428Z"}, {"movie_id": 447332, "review_id": "630015db097c49007f5fce6d", "author_rating": 9.0, "review_text": "**Overall : A Quiet Place creates an unnerving, tense, and terrifying world that skillfully drags its audience into its silent fear-filled universe.**\r\n\r\nThe most extraordinary theater experience of my life! The tension in the room silenced the crowd to a level requiring everyone to forgo chewing their snacks until a jump scare or rare moment of sound. John Krasinski's mastery of suspense and tension was unparalleled. Every second dripped with palpable fear and anxiety. Krasinski's creativity shined in every moment from the concept, writing, creature design, character development, and more. With decades of creature features, John Krasinski offered not only something new and innovative but something that raised the standards of the genre to a new level.", "created_at": "2022-08-19T22:59:39.450Z"}, {"movie_id": 447332, "review_id": "63fd63b09653f600853c28da", "author_rating": 7.0, "review_text": "***spoilers*** // Many (too many) a dumb moment, but <em>'A Quiet Place'</em> is a really good watch nevertheless.\r\n\r\nI will start with the positives that I have, as in fairness there are a number. The first, most obvious, being the sound design - excellent! Super effective. Emily Blunt and John Krasinski are very good, the pacing is on point (the 90mins fly by) and the monsters are well done.\r\n\r\nHowever, I did find myself questioning a lot of it - and I'm not usually one to notice, or at least criticise, characters being stupid etc. Here, though, it's too obvious - I think the top notch sound, or the lack thereof, actually heightens the flaws, which is unfortunate. From the very start I was like \"Really?!\", as well as at a few other moments - e.g. the nail.\r\n\r\nFirstly with the kid, like rule number one at primary school on field trips is adult at the front, then the kids and then another adult... who leaves the two most vulnerable people at the back in this situation, especially seconds after one of them has almost made a grave error - not even counting the fact that you just walk out the store and leave them alone after the event? Stuff like that, it's annoying that it took me out of it every now and then, I can't lie.\r\n\r\nAs noted though, it is still a fun watch and I'm certainly wanting to check out the sequel. I just don't think I've ever had a film that I enjoy but has such noticeable stupidness, the latter usually outweighs the former - or vice versa. So kudos for that, I guess, Krasinski & Co.", "created_at": "2023-02-28T02:15:12.246Z"}]