[{"movie_id": 278154, "review_id": "581cf4bb9251413749001193", "author_rating": 6.0, "review_text": "**This time the trouble comes finding them.**\r\n\r\nIt was handed over to the two new directors and the result is not so good. This is a most simplest film in the 'Ice Age' series. For the first time, the franchise is in real trouble. Though it managed well at the box office, which is a below par compared to the previous installments. It looks like a short film or it should have been a short film. From the adventures to the locations, everything shrunk in this sequel. Except Scrat, who goes for a lifetime journey into the outer space.\r\n\r\nAs usual the story continued, but this time Manny and his family and friends do not go anywhere, the trouble comes to them. So they have to find a solution to escape from it. At the right rime, Buck returns from the underground and teams up with his old friends to tackle the situation. Besides, Peaches getting married and all the fun adventures from the earth, as well as from the space in the solar system aims at one direction.\r\n\r\nNowadays the space adventure is a big thing in films, and this franchise always extents its boundary for its new sequels, so this time it was something bigger than ever. I think it won't get bigger than this in a concept wise. Particularly Scrat who has been the backbone for this series donned with a spacesuit. Like Minions and Penguins, I too want Scrat's stand alone film. But I think that would not happen, not anytime soon, since those two films did not deliver the expected result.\r\n\r\nIf you are an 'Ice Age' series fan or not, it does not matter, you will be slightly get disappointed for sure. Now it has overtaken the 'Shrek' franchise with this fifth film and they are already thinking about the sixth. This is not that bad, just a watchable average film and you need to be updated if you want to continue the series in the future. So that's the reason I suggest to watch this. Other than that, it is totally ignorable one.\r\n\r\n_5.5/10_", "created_at": "2016-11-04T20:51:07.479Z"}, {"movie_id": 278154, "review_id": "606d0244699fb700588557f2", "author_rating": 8.0, "review_text": "What is it about these Ice Age movies that don't seem quite right? I think I just don't like the sound of any of the voice actors... its like some kind of torture having them all in the same place and the same time. Of course, the kids don't mind, and like all the other Ice Age movies, this one is quite watchable and entertaining for them. The weasel never fails to amuse and I look forward to his antics every time (this one also happens to be a nice compliment to the PS4 game). Disclaimer: I did not pay close attention to this one while on.", "created_at": "2021-04-07T00:52:20.877Z"}, {"movie_id": 278154, "review_id": "64a4521a11386c00c591e27f", "author_rating": 8.0, "review_text": "Another hilarious Ice Age. These are definitely my favorite animation series. I normally hate animation movies. With the exception of Beavis & Butthead.", "created_at": "2023-07-04T17:08:42.739Z"}]