[{"movie_id": 10075, "review_id": "58c720ed92514179e400185e", "author_rating": 6.0, "review_text": "Now living in Romania, an American living under the rules of her guardian finally relents to a romance with a stranger he discovers her and the whole clan are werewolves and when they fear he could expose them try to do whatever they can to keep the two of them apart.\r\n\r\nThere was some good stuff to this one when it mattered. One of it's best parts was it's big actions scenes early on with there being two really great chase scenes through the forest in here. The first one is really great, with the suspense of not knowing what's going to happen during the course of the scene, and that makes the initial set-ups with the group appearing at the ceremonial grounds with the prisoner stuck in the middle. Once it switches over to the hunt, it becomes all the greater with the atmosphere from the imposing forest being used to perfection, the wolves' chase is rather fun and the whole thing is a big plus. The second one works with pretty much the same points but with the added benefit of featuring a really nice werewolf battle at the same time. The battle is quite long and enjoyable, using the surroundings and setting quite nicely with the action coming from the realistic wolves that can only be done that way, and it becomes quite exciting. Another rather good part about it is the film's action-packed ending, which is all sorts of awesome from the energetic and engaging street chase where they're jumping around the buildings to the big confrontations inside the hideout. The hideout sequences are the best, with a fine mixture between gunfights, brawling, wanton destruction and even some explosions placed in the mix to end the film on a high-point. The last plus here is the fact that the mythology with the werewolves is impressive and incredibly original, using a lot of the facts known while mixing it in with the new facts presented make for some great times. These here are the film's good points while there were some pretty big flaws to this one. One of the biggest problems is that the film uses real wolves for the transformation into werewolves. It's a cheap ploy, doesn't for the slightest look anywhere near convincing and makes it seem like a horror film was the furthest thing possible from the makers, which isn't a good sign. This is just lazy and makes the whole movie feel quite cheap in the process, besides looking wrong and oddly out-of-place. That feeling also works on the romance angle in here which just feels so tacked on just to have it here that it serves no point. Add onto that the fact that they constitute so much time in the middle segment of the film that almost nothing at else takes place during these scenes, making them quite dull and boring all around. The last flaw is the tameness of the film which is perfectly captured by the rating, which takes out much of the opportunities for this one to be entertaining since it can't show too much blood or gore, and the werewolf kills can't be too intense as the rating implies, which is what really hampers this one here with a series of off-screen or completely bloodless kills in here. These here are the big damaging factors to this one.\r\n\r\nRated PG-13: Violence and Language.", "created_at": "2017-03-13T22:45:01.495Z"}, {"movie_id": 10075, "review_id": "5cba02d50e0a267e34ecf102", "author_rating": 7.0, "review_text": "***Dynamic Bucharest werewolf flick feels like it’s in a rush*** \r\n\r\nTwo former-American youths meet in Bucharest, Romania, and develop an affinity for each other (Agnes Bruckner & Hugh Dancy). But one of them is a traditional werewolf (a person who can morph into an actual wolf) and is reluctant to pursue a relationship with a regular human. Meanwhile the city’s pack leader (Olivier Martinez) wants the pretty young thing for himself and so sends his son (Bryan Dick) to get rid of the dude.\r\n\r\n\"Blood and Chocolate\" (2007) was based on the 1997 book by Annette Curtis Klause and debuted 22 months before “Twilight” (2008), which was based on the 2005 novel by Stephenie Meyer. As such, don’t expect a “Twilight” clone.\r\n\r\nWhat’s great about this movie is the magnificent Bucharest locations and the polished kinetic style and great music, not to mention the decent cast. There are elements of “An American Werewolf in Paris” (1997), “The Howling” (1981), “Wolfen” (1981), “Wolves” (2014) and “Twilight” (2008). The last two came out later, of course; I’m just providing reference points.\r\n\r\nUnfortunately, \"Blood and Chocolate\" starts out like it’s in a rush, like it’s trying to cram too much material into the first 15 minutes plus cater to people with ADHD. It eventually finds its footing just enough to enjoy it, for the most part, but it needed more room to breathe. The flick only runs 97 minutes; another 20-22 minutes would’ve done wonders. As it is, it feels like it lacks the confidence to slow down and take its time.\r\n\r\nAs far as comparisons to the book go, the filmmakers dumbed down the plot (naturally) and made it more \"hip.” The book's message was to accept who you are and don't try to be something you're not while the movie's moral is to not let others determine your identity, customs or destiny; go after what you want and do not allow yourself be limited by the hand dealt you or what others say.\r\n\r\nGRADE: B/B- (6.5/10)", "created_at": "2019-04-19T17:18:13.210Z"}]