[{"movie_id": 247504, "review_id": "53bb168dc3a368661a0001b8", "author_rating": 6.0, "review_text": "Right in the opening segment, director Siva lays out his cards. There is a fight between two groups in a college and the new principal, who wants to put an end to this, goes to meet the elder brother of one of the parties involved in the scuffle. And, there, we see that the brother himself is a ruffian, who will feed people before beating them as he wants them to be strong to take the blows. But since this person is also the hero of the film, he is what we could call a genial rowdy, and the scene plays out mostly for laughs. The district collector, who is his friend, is present at the scene, happily requesting a similar \"entertainment\" the next day as well. If this is what your of idea of fun is, then, hop on aboard, the director seems to say.\r\n\r\nThe film is a template masala film — a superhuman hero, his cronies who will sing his praises all the time, a beautiful-looking heroine, a raging villain. It has no room for logic, moving from one hero-worshipping scene to the next and is aimed at our visceral tastes. The story is in service of its star and, it is unapologetic about it.\r\n\r\nThe plot, which kicks in only in the second half, and revolves around Vinayagam (Ajith) and his four brothers, who are do-gooders who will not hesitate to meet violence with violence. Vinayagam falls in love with Koperundevi ( Tamannaah), the daughter of Nallasivam ( Nasser), a pacifist. He tries to mend his ways for the sake of his lover, but when he learns that a revenge-seeking convict (Atul Kulkarni) wants to annihilate her entire family, he decides to stop him at all cost.\r\n\r\nThe very purpose of Veeram is to be a showcase for its star, Ajith, and that it does quite well. Right from the hero introduction scene, Siva creates moments specifically designed for his hero to shine — you see him being praised by those around him, mouthing punch dialogues, being nice to kids and elders, fighting on a running train, and in the climax, coming back from the dead to destroy the villain and his men. The best scene among the lot is one where Vinayagam goes to meet Vanangamudi, a goon with whom he has had a few run-ins, and orders him to do his bidding, all the while making it seem like he is begging for mercy, for the sake of the peace-loving Nallasivam. And, Ajith effortlessly conveys the heroic nature of his character and completely plays to the gallery.\r\n\r\nThe challenge with this sort of film is that it should keep moving forward without losing momentum. And that is where Veeram slips, at least in the initial stages. The entire first half involves the shenanigans of Vinayagam's brothers who, with help from their lawyer Bail Perumal ( Santhanam) try to get their brother fall in love with Koperundevi. Throughout these episodes, we are left wondering where the plot is heading and the film doesn't make it clear even by the interval point. The brothers too are uniformly uninteresting — all the four of them look the same and behave the same, and their characters are hardly defined. The romantic portions and Santhanam's quips, while entertaining, travel through previously trodden ground.\r\n\r\nAs for the second half, it coasts along once the plot kicks in and for a while, we are engrossed in Vinayagam's efforts to track down the various teams of hitmen sent to wipe out Koperundevi's family. But, even here, the villain doesn't come across as too much of a challenger to the hero, and, despite having an actor like Atul Kulkarni, Siva fails to build a truly terrifying character.", "created_at": "2014-07-07T21:52:13.296Z"}]