[{"movie_id": 82693, "review_id": "54d9099dc3a3687ab5000074", "author_rating": null, "review_text": "**Dolly Mopping**\r\n(29 January 2013) \r\n\r\nJennifer Lawrence is one magnificent slut. Her performance in _Silver Linings_ is a tour de force. She nails it. Not since Jennifer Jason Lee in _Last Exit to Brooklyn_ has a trashy trollop been played so convincingly. She easily deserves to win the Oscar for best actress and for any other category the film might win since she is the reason it's in the running at all. It's not easy being a slut. And harder still garnering sympathy for one. We can never be certain if her salacious wonts are biological or self-imposed. The grand old whore is a whole lot more desirable. She is typically forced into a her predicament for money or by male coercion. She's portrayed as a victim and tattooed with a heart of gold. But the nymphomaniac is a sadder sort. She's not as fetching or sentimental. Why should we care about her? It's clear that she either can't get enough carnal pleasure for herself or desperately seeks endless attention from men. Pathetic, is it not? But Lawrence absorbs the role and literally runs with it. Perhaps even re-writing the Dolly-Mop playbook. This movie will be required viewing for budding psychologists. And while Bradley Cooper does an impressive job bouncing the the bi-polar ball, we know he's acting. Fine work Mr. Cooper, no one else could have done it better, maybe. But down the street a few blocks, we entirely lose ourselves in Ms Lawrence. She deftly out-performs them all. Daniel Day Lincoln has to be relieved that there is a gender divide in the acting awards categories. Lawrence is so adept at playing the unapologetic slut that we suspect she's not acting. That she's spilling her guts. Revealing all the sores and warts of her true self. And this is what makes her so great in the movie.", "created_at": "2015-02-09T19:25:17.285Z"}, {"movie_id": 82693, "review_id": "5f6dc7cf1fa1c80036140d4a", "author_rating": 8.0, "review_text": "Great watch, probably won't watch again, and can recommend.\r\n\r\nThis is a great movie that I don't care about.  I'm not a particularly big fan of either Bradley Cooper or Jennifer Lawrence, though they are clearly great actors, and give a fantastic performance in this, especially with the range of emotions delivered and broad spectrum of dialogue topics.\r\n\r\nIt's about two sad, broken people who are trying to rehabilitate and release back into society despite their behavioral problems.  While that is intriguing from a psychological perspective, I found it to be more sad than fun, which does make it powerful and worthy of awards and your attention, but it's not a movie that I'm going to re-watch lovingly.\r\n\r\nThe writing is excellent: well structured and has good content, with an odd message that it is okay to lie to people when it is in their best interest so that you can get them to a potential to better themselves even if choose not too, and that is what love is.\r\n\r\nThe movie also focuses a fair bit on proper etiquette of social interactions, football, and dancing: none of which I'm particularly fond of watching.\r\n\r\nSo while there isn't a lot for me in this, objectively, I do believe that a lot of people will like this and it is well worth a watch.", "created_at": "2020-09-25T10:34:55.547Z"}, {"movie_id": 82693, "review_id": "62c4ddc0dcb6a30053dd7f15", "author_rating": 9.0, "review_text": "**An excellent film.**\r\n\r\nI confess that this movie was better than I was expecting. I thought I would find a simple romantic comedy, conventional and relatively predictable, but I was very pleased with the way the story develops and the conception of the characters. The director, David O. Russell, is also responsible for _The Fighter_, a film that won two Oscars but that I don't think is as good as this one.\r\n\r\nThe script is, in my opinion, quite well written, and follows Pat, a man who has just been released from a psychiatric hospital where he served a sentence of a few months, after catching his wife in the act of adultery and violently assaulting her lover. With his marriage over, he goes to his parents' house, his father being a crazy fan of the town's football team and seems to be convinced that having his son close during games brings good luck to the team. In the midst of his attempts to get close to his ex-wife (who has imposed an injunction on him by law), he approaches Tiffany, a young widow, with a strong temper and very explosive manners, who proposes to help him in swaps him being her date in a dance contest.\r\n\r\nThe story is very good, and it is full of shenanigans arising from the volatility of Pat and Tiffany's personalities. The characters, played convincingly and very committed by Bradley Cooper and Jennifer Lawrence, are complex and demanding, and it was great to see the way in which the two actors were facing the challenge and solving what they had in front of them. Furthermore, Lawrence won the Oscar for the work done in this film, which, in addition, had seven other nominations – Best Picture, Best Actor, Best Supporting Actor, Best Supporting Actress, Best Director, Best Adapted Screenplay and Best Editing. In addition to the duo of main actors, the film has an excellent supporting cast, including the impeccable Robert DeNiro, the wonderfully restrained and maternal Jacki Weaver, and the dysfunctional and strange couple played by Julia Styles and John Ortiz.\r\n\r\nIn the midst of so many good things, is there anything less good or possibly bad? I think so. Although I really like the film in general, I feel that the ending was a little cliché, and that the solution found is a little too conventional for a film that seems to want to give us something different from most romantic comedies we are used to. I also thought that there are some characters that end up not getting enough attention (Julia Styles, John Ortiz, in a subplot that gets very sketchy and underdeveloped). But these are points that end up not detracting from the film's value, criticisms and minor repairs.\r\n\r\nOn a technical level, I would like to positively highlight the excellence of the cinematography, with the film taking advantage of the good filming locations in the city of Philadelphia, and the editing, which makes the film pleasant, giving it the right pace. Good sets and costumes (in particular what is reserved for Lawrence, who has a somewhat depressing look) complete the positive values ​​of a discrete production, without great effects or visual artifices.", "created_at": "2022-07-06T00:56:32.733Z"}]