[{"movie_id": 46705, "review_id": "62c6217f05b549006096a7cf", "author_rating": 7.0, "review_text": "**It is a discreet film, which can go unnoticed, but very intense, realistic, believable and that can be difficult to see for many people.**\r\n\r\nRomantic dramas aren't exactly my favorite type of film, but I recognize the quality of work done in this film, and the skill of director Derek Cianfrance. In almost every way, this film was a labor of love, drawing heavily on the director's personal experience who, as a young man, witnessed his parents' divorce. Although the film has a name that reminds us of the rosier side of love, the film actually does a very detailed dissection of a relationship, from beginning to end.\r\n\r\nI can even agree if someone tells me that this film is not for everyone: it is a dense film, something slow, there are very monotonous passages, dialogues that seem to be there just to fill time, but that actually help us to understand the personality and way of acting of the two elements of the couple. In addition, the film does not have a linear narrative, making several setbacks and temporal advances, in order to intersperse the past and the present, showing us the evolution of the relationship and, also, its wear and tear. It's not a nice movie or easy to watch, and in large part this is due to the authenticity of what we see. That couple could be our neighbor, or one of us. It is a film that, for many people, can evoke painful memories of past and present courtships and marriages.\r\n\r\nI really enjoyed the interpretation of Ryan Gosling and Michelle Williams. Both actors were fully committed to the work, built a powerful chemistry and partnership, they are largely the soul of the film. Gosling played a romantic who absolutely believes in love and seems willing to do anything to try to make their marriage work. He's passionate, absolute and enthusiastic, the kind of man who doesn't mind taking risks, and has the self-confidence to run after the ones he loves. Williams made her character more reserved, tough, a little defensive, but full of personality and inner strength. Moreover, the actress would get an Oscar nomination for Best Actress with this work.\r\n\r\nThe film has a very well executed cinematography, excellent editing work and good production values. It's not a flashy film, it will surely go unnoticed by many people, and in fact it's not a perfect film or totally likable, but it's interesting, it's intense, and if we give it a chance, it's impossible not to feel sympathy for the characters. and suffer with the difficulties they go through.", "created_at": "2022-07-06T23:57:51.919Z"}]