[{"movie_id": 131631, "review_id": "547e6075c3a368256200022f", "author_rating": 10.0, "review_text": "It was good. Although I wish it had more action scenes. It's worth watching ago don't miss out!", "created_at": "2014-12-03T00:59:33.505Z"}, {"movie_id": 131631, "review_id": "54d9b29c9251410a4500100a", "author_rating": 4.0, "review_text": "Yet more of the same extended in an inexcusable way. Let's hope the last movie of the saga can get a proper end.", "created_at": "2015-02-10T07:26:20.246Z"}, {"movie_id": 131631, "review_id": "62690fc8f9253216228aa396", "author_rating": 6.0, "review_text": "Well, the problem with having a part one is that you just know that nothing much is going to happen as we build up to the next film's denouement. \"Katniss\" (Jennifer Lawrence) finds herself on a ship with \"Finnick\" (Sam Claflin) where she discovers that the erstwhile baddie \"Plutarch\" (Philip Seymour Hoffman) is really on their side as she is whisked to the long-thought destroyed District 13 where she meets \"President Coin\" (Julianne Moore), who leads a semi-militaristic society bent on deposing the Capitol. Unfortunately, not everyone managed to escape from the collapsing dome and poor old \"Peeta\" is being used, shamelessly, by the authorities to try and paint \"Katniss\" as the epitome of revolution and evil and so the scene is set: rescue him and mass their forces for an attack that will eliminate the totalitarian regime once and for all. Aside from one of two combat scenes, very little actually happens here. There is a great deal of dialogue, plenty of moralising and if I'm honest, \"Coin\" doesn't come across as any more trustworthy than the man she hopes to succeed. There simply isn't enough by way of plot to sustain this for two hours and the acting still, largely, refuses to engage me. Liam Hemsworth (\"Gale\") features a little more, but the confused does she/doesn't she romance stuff is exasperating as this supposedly emotionally and sexually charged environment delivers nothing by way of passion - indeed the pace of the whole thing borders on the racial. Sure, it looks great but I feel that the writing is very much on the wall for part two - my expectations are pretty low.", "created_at": "2022-04-27T09:41:28.071Z"}]