[{"movie_id": 520023, "review_id": "6303b50ce8601700818e34bf", "author_rating": 6.0, "review_text": "I can't say I am a bit disappointed about this film, I can't really say that there was one thing in particular that I did not enjoy, it just didn't work for me as much as I would have liked. The plot line was fairly predictable, even with the twists and turns. Characters consistently make stupid decisions for plot's sake, even though that is the M.O. for slasher films, I expected a bit more from A24. The slasher elements were barely present, even though I knew that coming in, the marketing still makes this look like a different movie altogether. The comedy was lackluster, I understand it was suppose to be dry social commentary based humor, but I did not really find it funny one bit. Even with all my critiques, I still found this movie somewhat enjoyable.\r\n\r\n**Score:** _65%_\r\n\r\n**Verdict:** _Decent_\r\n\r\n**Theater Verdict:** _Stream It_", "created_at": "2022-08-22T16:55:40.249Z"}, {"movie_id": 520023, "review_id": "631fa4aae9da69007999fa3f", "author_rating": null, "review_text": "I love going to the theater!\r\n\r\nSurprisingly atmospheric and immersive, I loved how it's shot/edited. Clever script and a fun cast too! Rachel Sennott is amazing here. Charli XCX credits are the cherry on top.\r\n\r\nProbably the most \"gen z\" movie I've ever seen.", "created_at": "2022-09-12T21:29:14.056Z"}, {"movie_id": 520023, "review_id": "632053e5e55937009189f110", "author_rating": 6.0, "review_text": "So a group of fairly unlikeable, spoiled, rich kids gather at the home of one of their number ahead of an impending hurricane. As conditions turn particularly nasty outside (think \"Devil Wears Prada\"), they decide to play an hybrid game of \"Cleudo\" meets \"Ten Little Indians\" that involves someone being given a piece of paper with a cross on it. That person has to \"kill\" one of their entirely deserving friends. Thereafter, they all reconvene to deduce who the killer is and if they get it wrong, then off they go again... Things take a turn for the worst when, infused with cocaine and booze, they start to fall out and their host \"David\" (the panda-impersonator Pete Davidson) strops off, the power goes down and next thing he is found quite literally bouncing off the patio doors with his throat slit. Whodunit? What now ensues is a messy, expletive-ridden character study of half a dozen women who are all too readily suspicious of each other. Two of them are lovers, with a third on the periphery of that very new relationship and another has brought her rather curious boyfriend along. The seeds are sown for a sea of discord right from the get-go. At times, the dialogue is really quite good fun, delivering quite an abrasively effective analysis of these fairly stupid and odious youngsters and playing well on their vacuousness and mistrust. All to often, though, the language becomes almost puerile. A good old dose of Anglo-Saxon can work, but when repeated as often as it is here, it loses any real potency. Indeed here, it borders on the hysterical - but not in an any way menacing manner. The acting, well that's another story. It's terrible. Quite simply, nobody here ought to worry about being troubled by any juries during awards season. That's a shame, because just a little more discerning effort on the casting front could really have lifted this, especially as the ending is really quite amusing. At times the production design offers us quite a claustrophobic environment, helped along nicely by the prevailing weather conditions - but sadly, that can't excuse the mediocrity of the talent delivering here, and I left the cinema unimpressed.", "created_at": "2022-09-13T09:56:53.962Z"}, {"movie_id": 520023, "review_id": "632e87572a210c007fd0fe5a", "author_rating": 5.0, "review_text": "**Bodies Bodies Bodies is filled with neurotic, selfish, and annoying characters that find a way to make a killer in their midst aggravating and tiresome.**\r\n\r\nI spent the entire runtime of Bodies Bodies Bodies wondering why this movie was so well received and highly rated. The plot doesn’t kick in until around halfway through, and the audience is left to endure young 20-somethings complaining, making out, and wondering why the world didn’t revolve around them for 45 minutes. The weak dialogue is dreadful to the point of making me wonder if any of it was actually written or just ad-libbed. Unfortunately, once the bodies start dropping, even the mystery of a vicious murderer plays the background to the self-absorbed spoiled brats whining and spilling each other’s secrets. At one point, the story attempts to shoehorn the murderer killing the victims in the order of the game, but even the characters in the movie don’t buy it. The cast does a convincing job of portraying a bunch of immature narcissists reacting to such a high-stress situation. I was so bored and disappointed until the final 3 minutes. The final twist is unique and entertaining but wasn’t worth the trash that had to be tolerated for an hour and a half to get there.", "created_at": "2022-09-24T04:28:07.211Z"}]