[{"movie_id": 5176, "review_id": "589be0ff92514126120022c8", "author_rating": 8.0, "review_text": "When you think about it, which I have been lately, is they weren't paying me to walk away. They were paying me so they could walk away.\r\n\r\n\r\n3:10 to Yuma is directed by James Mangold and co-adapted to screenplay by Halsted Welles, Michael Brandt and Derek Haas. A remake of Delmer Daves' 1957 film of the same name, it's based on a story written by Elmore Leonard. It stars Russell Crowe, Christian Bale, Peter Fonda, Ben Foster and Logan Lerman. Music is by Marco Beltrami and cinematography by Phedon Papamichael.\r\n\r\nAfter the capture of notorious outlaw Ben Wade (Crowe), a posse is put together to escort him to the town of Contention from where he will be put on the 3:10 train to Yuma prison. Joining this posse is broke rancher Dan Evans (Bale), disabled in the Civil War, Dan is struggling to keep hold of his land and to support his family. Seen as a flop in the eyes of his eldest son William (Lerman), Dan sees this opportunity as a way out of his problems. But with Wade an intelligent foe, and the outlaw boss' gang on their trail, Evans and the posse will do well to make it to Contention alive...\r\n\r\nDaves' original film is a fine effort, very much pulsing with psychological beats and cloaked in claustrophobic atmospherics. Backed up by two excellent Western performers in Glenn Ford and Van Heflin, there is many a Western fan who cherish it and never felt it was a genre piece ripe for a remake; myself included. But the logic behind the reasons Mangold and his team put forward for remaking it made sense. A story of great thematics for the adults, and action a go-go for the younger modern film fan. Thus putting a Western back in the headlines at yet another time when the genre was gasping for air. All that was left to do was get two of the modern era's biggest stars to play Wade and Evans - which of course they duly did - and it was good to go. Just don't mess it up was all that was asked of the makers.\r\n\r\nRunning at nearly half an hour longer than the original, Mangold's movie slots in a new mid-section and changes the ending. The former works a treat as the posse venture through hostile Apache country, meet some ne'er-do-well railroad ruffians, while Wade's gang, led by the supremely fiendish Charlie Prince (Foster), are on the bloody trail. The latter is a huge misstep, both in execution and character development. Most film fans are happy to suspend disbelief in the name of good entertainment, but here we are asked to ignore some impossible athletics while also being asked to swallow a character turn around that beggars belief. Such a shame because up till then the blend of traditional Western character themes such as morality and redemption had dovetailed nicely with the pistol banging and all round breezy action construction. While the father and son axis also gives the narrative some extra bite.\r\n\r\nEven bad guys love their mothers.\r\n\r\nThe performances are also of a high standard. In the support slots Fonda, Foster and Lerman are top dollar. Fonda is all leather faced and gruff as bounty hunter McElroy, Foster does a quality line in sneering villainy, and Lerman, in a tricky role, utterly convinces as the conflicted boy breaking out into a man. But this is Crowe and Bale's movie. Crowe has Wade as an intelligent dandy, a man who loves and understands women, an artist who also has a tongue as quick as his hands are on his guns. We know that Wade is callous, but Crowe ensures that we never know what is around the corner or truly on his mind. Bale puts much dignity into Evans, he's a put upon man, tortured by his failings on the home front, but there is stoic nobility there and as he and Wade venture further on their journey, a grudging respect begins to form and Bale and Crowe really start to put credibility into their characters. And then that last quarter nearly undoes all their excellent work...\r\n\r\nIn spite of this, 3:10 to Yuma is a good time to be had as a modern Western production with old traditional values. Energetic and never dull from first frame to last, it's recommended on proviso you don't mind unscrewing your head and taking out your brain for the last 15 minutes. 7.5/10\r\n\r\n", "created_at": "2017-02-09T03:24:47.129Z"}, {"movie_id": 5176, "review_id": "5af5d3609251417997000aaa", "author_rating": 9.0, "review_text": "The price of redemption -- READ THIS if you had problems with the ending\r\n\r\nThis remake involves the capture of a notorious outlaw, Ben Wade (Russell Crowe), who is then escorted to the town of Contention to await the train to Yuma, where he'll be hanged. A desperate rancher, Dan Evans (Christian Bale), hires on for the escort job because he needs the $200 for his family to survive. Wade plays psychological games the entire time trying to corrupt Evans, but things turn out differently.\r\n\r\nThe cast is outstanding (which also features the beautiful Gretchen Mol and Peter Fonda), the New Mexican locations are great and the score ranks with the all-time best. Most importantly the picture is engaging throughout its 2 hour runtime, not to mention the story gives the viewer a lot to chew on.\r\n\r\nThe first hour of the film is realistic but what turned me off during my initial viewing was the second hour's mounting implausibilities. Thankfully, most of these can be explained.\r\n\r\nOne issue is when a man burns to death locked in a wagon carriage. The quibble is that he doesn't scream enough in fiery torment. But watch the scene and you'll clearly hear him yelling in the background. Evan's loss of a limp at the climax is more of an issue, although this can be explained by an adrenaline rush.\r\n\r\nOne problem I had was that Ben Wade (Crowe) came off as super-human. There was seemingly nothing he couldn't do, even while handcuffed. I suppose this could be explained by the fact that there ARE people who are incredibly gifted to the point of being nigh super-human. \r\n\r\nIn any event, this is not a realistic Western like, say, \"Wyatt Earp\" or \"The Long Riders.\" No, \"3:10 to Yuma\" is a MYTHIC Western with an potent message. If you can't handle strong mythic elements in Westerns look elsewhere.\r\n\r\nWhen I first saw the film I didn't get the ending and it turned me off. But it was clear that there was more to the picture than what first meets the eye so I decided to view it again. It DOES make sense, it's just that you might miss it on your initial viewing because the events flash by so quickly. When you DO see it, it'll blow you away.\r\n\r\n***SPOILER ALERT*** DO NOT READ FURTHER UNLESS YOU WANT AN EXPLANATION OF THE FILM! \r\n\r\nWade is a confident and talented man who smugly looks down on others, acting like a disciple of Nietzsche who has no moral obligation to anyone, least of all God. He senses simple purity in Evans and plays the role of tempter, trying to corrupt Evans and win him to his way of thinking. But as they wait in the hotel room it is Evans who \"converts\" Wade, in a sense. Evans doesn't accomplish this in any type of contrived manner, he accomplishes it simply by being WHO HE IS -- an undefiled, courageous family man who stubbornly refuses to give up on hope, faith, life, righteousness and family.\r\n\r\nAs they're waiting, Wade sketches a picture of Evans in a book. It is later shown that this sketch was made on an opening page of a Bible. This reveals that Wade came to view Evans as a Christ figure, at least subconsciously, and that Evans is clearly a type of Christ in the story.\r\n\r\nWhat exactly was it that caused Wade to \"convert\" and support Evans? (1.) He saw in Evans a man that refused to be bought -- a man who refused to be corrupted by filthy lucre, which was something he never experienced before. (2.) Evan's son insisted that there was still some good in Wade despite his wicked history. Regardless of Wade's denial, the kid was right. The idea that SOMEONE saw a glimmer of good in him, that SOMEONE out there BELIEVED in him despite his past evil deeds ultimately moved him and compelled him to support Evans. (3.) Wade turned evil because he was abandoned as a kid. He saw in Evans and his wife a REAL family -- parents who stayed together and refused to abandon faith, hope, righteousness and family come hell or high water. He became convinced that Evans and his family were worth supporting, even perhaps dying for. (4.) Evans made a deal with the Pinkerton that if he successfully got Wade to the train the Pinkerton would make sure Evans' family got $1000, which would bail them out of their hardships. Wade wanted to make sure the family got that money. Somewhere deep inside he wanted to redeem himself of his wicked past and this was the opportunity. This could be the beginning of a new life.\r\n\r\n(5.) Wade's relationship with Evans lasted only a few days but he found something that was missing in all his other relationships - a friendship based on respect rather than familiarity or shared events. Great friendships like this can happen quickly similar to love-at-first-sight. Such relationships are conducive to transparency, which explains why Evans reveals to Wade the real reason he lost his leg in the war.\r\n\r\nAfter Evan's brutal death Wade has an even greater revelation: To see a truly undefiled man -- a simple but GREAT man -- murdered by a group of immoral swine fills him with disgust. You can see it on his face. Yes, he should be thankful that his men remained loyal to him but this was about their only redeeming quality. To truly start a new life he would have to be judge and executioner of the corrupted souls who would pull him back down into the slime.\r\n\r\nWhy did Evans have to die? Because redemption can only be paid via the spilling of blood. It was the price for Wade to live and have a new life.\r\n\r\nGRADE: A", "created_at": "2018-05-11T17:31:12.747Z"}, {"movie_id": 5176, "review_id": "610fbe8b01e4d1005e8d19ce", "author_rating": 10.0, "review_text": "This is the best Western of the 21st Century so far (for mine, just edging out Django Unchained). \r\n\r\nBuilding on the classic movie from 1957, James Mangold's remake adds in much needed scenes to fill plot holes and build nuanced characters that were sorely lacking in the original.  \r\n\r\nOur hero now, is a man struggling to keep his farm and the respect of his family whilst the \"antagonist\" (I stretch the use of the word here) is almost tired of his way of life and his \"family.\"  Adding in the concept of children to these two was smart thinking on the part of the writers and this really deepens Bale and Crowe's characters.  \r\n\r\nSpeaking of which, both give perfectly nuanced performances here and you can watch their characters grow in response to each other as the movie progresses.  Both \"sons\" (Lerman and Foster) fit into their roles of the naive teen becoming a man, and the unhinged \"son\" idolising his \"father\" respectively.  The rest of the cast have been perfectly chosen. \r\n\r\nThe cinematography is stunning at times, but unlike most Westerns, this does emphasize the country - it is more of a silent character here.  But when it is shown, it is just gorgeous...seriously, I hadnt seen snow in Westerns until this - but it just looks brilliant. \r\n\r\nThe score drips with the memories of older, more famous Westerns, but Beltrami makes this one unique.  Sound design is also great, even using the heartbeat-like rhythm of the idling train's engine in the final scene.  \r\n\r\nEverything else is perfect - the lighting, editing, costumes, set design...this does not look like an independently made film that the major studios didnt want to touch.  The people who worked on this, really wanted to.  And that's also probably why its so good.  \r\n\r\nTHIS is how to remake a movie.  Enjoy.", "created_at": "2021-08-08T11:22:51.830Z"}, {"movie_id": 5176, "review_id": "63c21d88e16e5a008ac852a1", "author_rating": 10.0, "review_text": "Most of the time I hate remakes....but I give a big pass to most Western and War movie remakes.\r\n\r\nMainly that's because, until M*A*S*H early war movies had soldiers that looked like they stepped out of the shower and put on a freshly laundered uniform...you know, instead of the realities of life in combat zones.\r\n\r\nAnd the same goes with Westerns, the cowpokes may be riding the range...yet they look like they had the time to shower, shave, style their hair, and press their clothes.\r\n\r\nNone of that really sat right with me...at all.\r\n\r\nThe remake righted that wrong.\r\n\r\nAnd it did it without killing the wonderful Elmore Leonard story the movie was based on and let's be honest, he really has the best ideas for crime and western stories the world has ever seen.", "created_at": "2023-01-14T03:12:08.033Z"}, {"movie_id": 5176, "review_id": "589be0ff92514126120022c8", "author_rating": 8.0, "review_text": "When you think about it, which I have been lately, is they weren't paying me to walk away. They were paying me so they could walk away.\r\n\r\n\r\n3:10 to Yuma is directed by James Mangold and co-adapted to screenplay by Halsted Welles, Michael Brandt and Derek Haas. A remake of Delmer Daves' 1957 film of the same name, it's based on a story written by Elmore Leonard. It stars Russell Crowe, Christian Bale, Peter Fonda, Ben Foster and Logan Lerman. Music is by Marco Beltrami and cinematography by Phedon Papamichael.\r\n\r\nAfter the capture of notorious outlaw Ben Wade (Crowe), a posse is put together to escort him to the town of Contention from where he will be put on the 3:10 train to Yuma prison. Joining this posse is broke rancher Dan Evans (Bale), disabled in the Civil War, Dan is struggling to keep hold of his land and to support his family. Seen as a flop in the eyes of his eldest son William (Lerman), Dan sees this opportunity as a way out of his problems. But with Wade an intelligent foe, and the outlaw boss' gang on their trail, Evans and the posse will do well to make it to Contention alive...\r\n\r\nDaves' original film is a fine effort, very much pulsing with psychological beats and cloaked in claustrophobic atmospherics. Backed up by two excellent Western performers in Glenn Ford and Van Heflin, there is many a Western fan who cherish it and never felt it was a genre piece ripe for a remake; myself included. But the logic behind the reasons Mangold and his team put forward for remaking it made sense. A story of great thematics for the adults, and action a go-go for the younger modern film fan. Thus putting a Western back in the headlines at yet another time when the genre was gasping for air. All that was left to do was get two of the modern era's biggest stars to play Wade and Evans - which of course they duly did - and it was good to go. Just don't mess it up was all that was asked of the makers.\r\n\r\nRunning at nearly half an hour longer than the original, Mangold's movie slots in a new mid-section and changes the ending. The former works a treat as the posse venture through hostile Apache country, meet some ne'er-do-well railroad ruffians, while Wade's gang, led by the supremely fiendish Charlie Prince (Foster), are on the bloody trail. The latter is a huge misstep, both in execution and character development. Most film fans are happy to suspend disbelief in the name of good entertainment, but here we are asked to ignore some impossible athletics while also being asked to swallow a character turn around that beggars belief. Such a shame because up till then the blend of traditional Western character themes such as morality and redemption had dovetailed nicely with the pistol banging and all round breezy action construction. While the father and son axis also gives the narrative some extra bite.\r\n\r\nEven bad guys love their mothers.\r\n\r\nThe performances are also of a high standard. In the support slots Fonda, Foster and Lerman are top dollar. Fonda is all leather faced and gruff as bounty hunter McElroy, Foster does a quality line in sneering villainy, and Lerman, in a tricky role, utterly convinces as the conflicted boy breaking out into a man. But this is Crowe and Bale's movie. Crowe has Wade as an intelligent dandy, a man who loves and understands women, an artist who also has a tongue as quick as his hands are on his guns. We know that Wade is callous, but Crowe ensures that we never know what is around the corner or truly on his mind. Bale puts much dignity into Evans, he's a put upon man, tortured by his failings on the home front, but there is stoic nobility there and as he and Wade venture further on their journey, a grudging respect begins to form and Bale and Crowe really start to put credibility into their characters. And then that last quarter nearly undoes all their excellent work...\r\n\r\nIn spite of this, 3:10 to Yuma is a good time to be had as a modern Western production with old traditional values. Energetic and never dull from first frame to last, it's recommended on proviso you don't mind unscrewing your head and taking out your brain for the last 15 minutes. 7.5/10\r\n\r\n", "created_at": "2017-02-09T03:24:47.129Z"}, {"movie_id": 5176, "review_id": "5af5d3609251417997000aaa", "author_rating": 9.0, "review_text": "The price of redemption -- READ THIS if you had problems with the ending\r\n\r\nThis remake involves the capture of a notorious outlaw, Ben Wade (Russell Crowe), who is then escorted to the town of Contention to await the train to Yuma, where he'll be hanged. A desperate rancher, Dan Evans (Christian Bale), hires on for the escort job because he needs the $200 for his family to survive. Wade plays psychological games the entire time trying to corrupt Evans, but things turn out differently.\r\n\r\nThe cast is outstanding (which also features the beautiful Gretchen Mol and Peter Fonda), the New Mexican locations are great and the score ranks with the all-time best. Most importantly the picture is engaging throughout its 2 hour runtime, not to mention the story gives the viewer a lot to chew on.\r\n\r\nThe first hour of the film is realistic but what turned me off during my initial viewing was the second hour's mounting implausibilities. Thankfully, most of these can be explained.\r\n\r\nOne issue is when a man burns to death locked in a wagon carriage. The quibble is that he doesn't scream enough in fiery torment. But watch the scene and you'll clearly hear him yelling in the background. Evan's loss of a limp at the climax is more of an issue, although this can be explained by an adrenaline rush.\r\n\r\nOne problem I had was that Ben Wade (Crowe) came off as super-human. There was seemingly nothing he couldn't do, even while handcuffed. I suppose this could be explained by the fact that there ARE people who are incredibly gifted to the point of being nigh super-human. \r\n\r\nIn any event, this is not a realistic Western like, say, \"Wyatt Earp\" or \"The Long Riders.\" No, \"3:10 to Yuma\" is a MYTHIC Western with an potent message. If you can't handle strong mythic elements in Westerns look elsewhere.\r\n\r\nWhen I first saw the film I didn't get the ending and it turned me off. But it was clear that there was more to the picture than what first meets the eye so I decided to view it again. It DOES make sense, it's just that you might miss it on your initial viewing because the events flash by so quickly. When you DO see it, it'll blow you away.\r\n\r\n***SPOILER ALERT*** DO NOT READ FURTHER UNLESS YOU WANT AN EXPLANATION OF THE FILM! \r\n\r\nWade is a confident and talented man who smugly looks down on others, acting like a disciple of Nietzsche who has no moral obligation to anyone, least of all God. He senses simple purity in Evans and plays the role of tempter, trying to corrupt Evans and win him to his way of thinking. But as they wait in the hotel room it is Evans who \"converts\" Wade, in a sense. Evans doesn't accomplish this in any type of contrived manner, he accomplishes it simply by being WHO HE IS -- an undefiled, courageous family man who stubbornly refuses to give up on hope, faith, life, righteousness and family.\r\n\r\nAs they're waiting, Wade sketches a picture of Evans in a book. It is later shown that this sketch was made on an opening page of a Bible. This reveals that Wade came to view Evans as a Christ figure, at least subconsciously, and that Evans is clearly a type of Christ in the story.\r\n\r\nWhat exactly was it that caused Wade to \"convert\" and support Evans? (1.) He saw in Evans a man that refused to be bought -- a man who refused to be corrupted by filthy lucre, which was something he never experienced before. (2.) Evan's son insisted that there was still some good in Wade despite his wicked history. Regardless of Wade's denial, the kid was right. The idea that SOMEONE saw a glimmer of good in him, that SOMEONE out there BELIEVED in him despite his past evil deeds ultimately moved him and compelled him to support Evans. (3.) Wade turned evil because he was abandoned as a kid. He saw in Evans and his wife a REAL family -- parents who stayed together and refused to abandon faith, hope, righteousness and family come hell or high water. He became convinced that Evans and his family were worth supporting, even perhaps dying for. (4.) Evans made a deal with the Pinkerton that if he successfully got Wade to the train the Pinkerton would make sure Evans' family got $1000, which would bail them out of their hardships. Wade wanted to make sure the family got that money. Somewhere deep inside he wanted to redeem himself of his wicked past and this was the opportunity. This could be the beginning of a new life.\r\n\r\n(5.) Wade's relationship with Evans lasted only a few days but he found something that was missing in all his other relationships - a friendship based on respect rather than familiarity or shared events. Great friendships like this can happen quickly similar to love-at-first-sight. Such relationships are conducive to transparency, which explains why Evans reveals to Wade the real reason he lost his leg in the war.\r\n\r\nAfter Evan's brutal death Wade has an even greater revelation: To see a truly undefiled man -- a simple but GREAT man -- murdered by a group of immoral swine fills him with disgust. You can see it on his face. Yes, he should be thankful that his men remained loyal to him but this was about their only redeeming quality. To truly start a new life he would have to be judge and executioner of the corrupted souls who would pull him back down into the slime.\r\n\r\nWhy did Evans have to die? Because redemption can only be paid via the spilling of blood. It was the price for Wade to live and have a new life.\r\n\r\nGRADE: A", "created_at": "2018-05-11T17:31:12.747Z"}, {"movie_id": 5176, "review_id": "610fbe8b01e4d1005e8d19ce", "author_rating": 10.0, "review_text": "This is the best Western of the 21st Century so far (for mine, just edging out Django Unchained). \r\n\r\nBuilding on the classic movie from 1957, James Mangold's remake adds in much needed scenes to fill plot holes and build nuanced characters that were sorely lacking in the original.  \r\n\r\nOur hero now, is a man struggling to keep his farm and the respect of his family whilst the \"antagonist\" (I stretch the use of the word here) is almost tired of his way of life and his \"family.\"  Adding in the concept of children to these two was smart thinking on the part of the writers and this really deepens Bale and Crowe's characters.  \r\n\r\nSpeaking of which, both give perfectly nuanced performances here and you can watch their characters grow in response to each other as the movie progresses.  Both \"sons\" (Lerman and Foster) fit into their roles of the naive teen becoming a man, and the unhinged \"son\" idolising his \"father\" respectively.  The rest of the cast have been perfectly chosen. \r\n\r\nThe cinematography is stunning at times, but unlike most Westerns, this does emphasize the country - it is more of a silent character here.  But when it is shown, it is just gorgeous...seriously, I hadnt seen snow in Westerns until this - but it just looks brilliant. \r\n\r\nThe score drips with the memories of older, more famous Westerns, but Beltrami makes this one unique.  Sound design is also great, even using the heartbeat-like rhythm of the idling train's engine in the final scene.  \r\n\r\nEverything else is perfect - the lighting, editing, costumes, set design...this does not look like an independently made film that the major studios didnt want to touch.  The people who worked on this, really wanted to.  And that's also probably why its so good.  \r\n\r\nTHIS is how to remake a movie.  Enjoy.", "created_at": "2021-08-08T11:22:51.830Z"}, {"movie_id": 5176, "review_id": "63c21d88e16e5a008ac852a1", "author_rating": 10.0, "review_text": "Most of the time I hate remakes....but I give a big pass to most Western and War movie remakes.\r\n\r\nMainly that's because, until M*A*S*H early war movies had soldiers that looked like they stepped out of the shower and put on a freshly laundered uniform...you know, instead of the realities of life in combat zones.\r\n\r\nAnd the same goes with Westerns, the cowpokes may be riding the range...yet they look like they had the time to shower, shave, style their hair, and press their clothes.\r\n\r\nNone of that really sat right with me...at all.\r\n\r\nThe remake righted that wrong.\r\n\r\nAnd it did it without killing the wonderful Elmore Leonard story the movie was based on and let's be honest, he really has the best ideas for crime and western stories the world has ever seen.", "created_at": "2023-01-14T03:12:08.033Z"}, {"movie_id": 5176, "review_id": "589be0ff92514126120022c8", "author_rating": 8.0, "review_text": "When you think about it, which I have been lately, is they weren't paying me to walk away. They were paying me so they could walk away.\r\n\r\n\r\n3:10 to Yuma is directed by James Mangold and co-adapted to screenplay by Halsted Welles, Michael Brandt and Derek Haas. A remake of Delmer Daves' 1957 film of the same name, it's based on a story written by Elmore Leonard. It stars Russell Crowe, Christian Bale, Peter Fonda, Ben Foster and Logan Lerman. Music is by Marco Beltrami and cinematography by Phedon Papamichael.\r\n\r\nAfter the capture of notorious outlaw Ben Wade (Crowe), a posse is put together to escort him to the town of Contention from where he will be put on the 3:10 train to Yuma prison. Joining this posse is broke rancher Dan Evans (Bale), disabled in the Civil War, Dan is struggling to keep hold of his land and to support his family. Seen as a flop in the eyes of his eldest son William (Lerman), Dan sees this opportunity as a way out of his problems. But with Wade an intelligent foe, and the outlaw boss' gang on their trail, Evans and the posse will do well to make it to Contention alive...\r\n\r\nDaves' original film is a fine effort, very much pulsing with psychological beats and cloaked in claustrophobic atmospherics. Backed up by two excellent Western performers in Glenn Ford and Van Heflin, there is many a Western fan who cherish it and never felt it was a genre piece ripe for a remake; myself included. But the logic behind the reasons Mangold and his team put forward for remaking it made sense. A story of great thematics for the adults, and action a go-go for the younger modern film fan. Thus putting a Western back in the headlines at yet another time when the genre was gasping for air. All that was left to do was get two of the modern era's biggest stars to play Wade and Evans - which of course they duly did - and it was good to go. Just don't mess it up was all that was asked of the makers.\r\n\r\nRunning at nearly half an hour longer than the original, Mangold's movie slots in a new mid-section and changes the ending. The former works a treat as the posse venture through hostile Apache country, meet some ne'er-do-well railroad ruffians, while Wade's gang, led by the supremely fiendish Charlie Prince (Foster), are on the bloody trail. The latter is a huge misstep, both in execution and character development. Most film fans are happy to suspend disbelief in the name of good entertainment, but here we are asked to ignore some impossible athletics while also being asked to swallow a character turn around that beggars belief. Such a shame because up till then the blend of traditional Western character themes such as morality and redemption had dovetailed nicely with the pistol banging and all round breezy action construction. While the father and son axis also gives the narrative some extra bite.\r\n\r\nEven bad guys love their mothers.\r\n\r\nThe performances are also of a high standard. In the support slots Fonda, Foster and Lerman are top dollar. Fonda is all leather faced and gruff as bounty hunter McElroy, Foster does a quality line in sneering villainy, and Lerman, in a tricky role, utterly convinces as the conflicted boy breaking out into a man. But this is Crowe and Bale's movie. Crowe has Wade as an intelligent dandy, a man who loves and understands women, an artist who also has a tongue as quick as his hands are on his guns. We know that Wade is callous, but Crowe ensures that we never know what is around the corner or truly on his mind. Bale puts much dignity into Evans, he's a put upon man, tortured by his failings on the home front, but there is stoic nobility there and as he and Wade venture further on their journey, a grudging respect begins to form and Bale and Crowe really start to put credibility into their characters. And then that last quarter nearly undoes all their excellent work...\r\n\r\nIn spite of this, 3:10 to Yuma is a good time to be had as a modern Western production with old traditional values. Energetic and never dull from first frame to last, it's recommended on proviso you don't mind unscrewing your head and taking out your brain for the last 15 minutes. 7.5/10\r\n\r\n", "created_at": "2017-02-09T03:24:47.129Z"}, {"movie_id": 5176, "review_id": "5af5d3609251417997000aaa", "author_rating": 9.0, "review_text": "The price of redemption -- READ THIS if you had problems with the ending\r\n\r\nThis remake involves the capture of a notorious outlaw, Ben Wade (Russell Crowe), who is then escorted to the town of Contention to await the train to Yuma, where he'll be hanged. A desperate rancher, Dan Evans (Christian Bale), hires on for the escort job because he needs the $200 for his family to survive. Wade plays psychological games the entire time trying to corrupt Evans, but things turn out differently.\r\n\r\nThe cast is outstanding (which also features the beautiful Gretchen Mol and Peter Fonda), the New Mexican locations are great and the score ranks with the all-time best. Most importantly the picture is engaging throughout its 2 hour runtime, not to mention the story gives the viewer a lot to chew on.\r\n\r\nThe first hour of the film is realistic but what turned me off during my initial viewing was the second hour's mounting implausibilities. Thankfully, most of these can be explained.\r\n\r\nOne issue is when a man burns to death locked in a wagon carriage. The quibble is that he doesn't scream enough in fiery torment. But watch the scene and you'll clearly hear him yelling in the background. Evan's loss of a limp at the climax is more of an issue, although this can be explained by an adrenaline rush.\r\n\r\nOne problem I had was that Ben Wade (Crowe) came off as super-human. There was seemingly nothing he couldn't do, even while handcuffed. I suppose this could be explained by the fact that there ARE people who are incredibly gifted to the point of being nigh super-human. \r\n\r\nIn any event, this is not a realistic Western like, say, \"Wyatt Earp\" or \"The Long Riders.\" No, \"3:10 to Yuma\" is a MYTHIC Western with an potent message. If you can't handle strong mythic elements in Westerns look elsewhere.\r\n\r\nWhen I first saw the film I didn't get the ending and it turned me off. But it was clear that there was more to the picture than what first meets the eye so I decided to view it again. It DOES make sense, it's just that you might miss it on your initial viewing because the events flash by so quickly. When you DO see it, it'll blow you away.\r\n\r\n***SPOILER ALERT*** DO NOT READ FURTHER UNLESS YOU WANT AN EXPLANATION OF THE FILM! \r\n\r\nWade is a confident and talented man who smugly looks down on others, acting like a disciple of Nietzsche who has no moral obligation to anyone, least of all God. He senses simple purity in Evans and plays the role of tempter, trying to corrupt Evans and win him to his way of thinking. But as they wait in the hotel room it is Evans who \"converts\" Wade, in a sense. Evans doesn't accomplish this in any type of contrived manner, he accomplishes it simply by being WHO HE IS -- an undefiled, courageous family man who stubbornly refuses to give up on hope, faith, life, righteousness and family.\r\n\r\nAs they're waiting, Wade sketches a picture of Evans in a book. It is later shown that this sketch was made on an opening page of a Bible. This reveals that Wade came to view Evans as a Christ figure, at least subconsciously, and that Evans is clearly a type of Christ in the story.\r\n\r\nWhat exactly was it that caused Wade to \"convert\" and support Evans? (1.) He saw in Evans a man that refused to be bought -- a man who refused to be corrupted by filthy lucre, which was something he never experienced before. (2.) Evan's son insisted that there was still some good in Wade despite his wicked history. Regardless of Wade's denial, the kid was right. The idea that SOMEONE saw a glimmer of good in him, that SOMEONE out there BELIEVED in him despite his past evil deeds ultimately moved him and compelled him to support Evans. (3.) Wade turned evil because he was abandoned as a kid. He saw in Evans and his wife a REAL family -- parents who stayed together and refused to abandon faith, hope, righteousness and family come hell or high water. He became convinced that Evans and his family were worth supporting, even perhaps dying for. (4.) Evans made a deal with the Pinkerton that if he successfully got Wade to the train the Pinkerton would make sure Evans' family got $1000, which would bail them out of their hardships. Wade wanted to make sure the family got that money. Somewhere deep inside he wanted to redeem himself of his wicked past and this was the opportunity. This could be the beginning of a new life.\r\n\r\n(5.) Wade's relationship with Evans lasted only a few days but he found something that was missing in all his other relationships - a friendship based on respect rather than familiarity or shared events. Great friendships like this can happen quickly similar to love-at-first-sight. Such relationships are conducive to transparency, which explains why Evans reveals to Wade the real reason he lost his leg in the war.\r\n\r\nAfter Evan's brutal death Wade has an even greater revelation: To see a truly undefiled man -- a simple but GREAT man -- murdered by a group of immoral swine fills him with disgust. You can see it on his face. Yes, he should be thankful that his men remained loyal to him but this was about their only redeeming quality. To truly start a new life he would have to be judge and executioner of the corrupted souls who would pull him back down into the slime.\r\n\r\nWhy did Evans have to die? Because redemption can only be paid via the spilling of blood. It was the price for Wade to live and have a new life.\r\n\r\nGRADE: A", "created_at": "2018-05-11T17:31:12.747Z"}, {"movie_id": 5176, "review_id": "610fbe8b01e4d1005e8d19ce", "author_rating": 10.0, "review_text": "This is the best Western of the 21st Century so far (for mine, just edging out Django Unchained). \r\n\r\nBuilding on the classic movie from 1957, James Mangold's remake adds in much needed scenes to fill plot holes and build nuanced characters that were sorely lacking in the original.  \r\n\r\nOur hero now, is a man struggling to keep his farm and the respect of his family whilst the \"antagonist\" (I stretch the use of the word here) is almost tired of his way of life and his \"family.\"  Adding in the concept of children to these two was smart thinking on the part of the writers and this really deepens Bale and Crowe's characters.  \r\n\r\nSpeaking of which, both give perfectly nuanced performances here and you can watch their characters grow in response to each other as the movie progresses.  Both \"sons\" (Lerman and Foster) fit into their roles of the naive teen becoming a man, and the unhinged \"son\" idolising his \"father\" respectively.  The rest of the cast have been perfectly chosen. \r\n\r\nThe cinematography is stunning at times, but unlike most Westerns, this does emphasize the country - it is more of a silent character here.  But when it is shown, it is just gorgeous...seriously, I hadnt seen snow in Westerns until this - but it just looks brilliant. \r\n\r\nThe score drips with the memories of older, more famous Westerns, but Beltrami makes this one unique.  Sound design is also great, even using the heartbeat-like rhythm of the idling train's engine in the final scene.  \r\n\r\nEverything else is perfect - the lighting, editing, costumes, set design...this does not look like an independently made film that the major studios didnt want to touch.  The people who worked on this, really wanted to.  And that's also probably why its so good.  \r\n\r\nTHIS is how to remake a movie.  Enjoy.", "created_at": "2021-08-08T11:22:51.830Z"}, {"movie_id": 5176, "review_id": "63c21d88e16e5a008ac852a1", "author_rating": 10.0, "review_text": "Most of the time I hate remakes....but I give a big pass to most Western and War movie remakes.\r\n\r\nMainly that's because, until M*A*S*H early war movies had soldiers that looked like they stepped out of the shower and put on a freshly laundered uniform...you know, instead of the realities of life in combat zones.\r\n\r\nAnd the same goes with Westerns, the cowpokes may be riding the range...yet they look like they had the time to shower, shave, style their hair, and press their clothes.\r\n\r\nNone of that really sat right with me...at all.\r\n\r\nThe remake righted that wrong.\r\n\r\nAnd it did it without killing the wonderful Elmore Leonard story the movie was based on and let's be honest, he really has the best ideas for crime and western stories the world has ever seen.", "created_at": "2023-01-14T03:12:08.033Z"}, {"movie_id": 5176, "review_id": "589be0ff92514126120022c8", "author_rating": 8.0, "review_text": "When you think about it, which I have been lately, is they weren't paying me to walk away. They were paying me so they could walk away.\r\n\r\n\r\n3:10 to Yuma is directed by James Mangold and co-adapted to screenplay by Halsted Welles, Michael Brandt and Derek Haas. A remake of Delmer Daves' 1957 film of the same name, it's based on a story written by Elmore Leonard. It stars Russell Crowe, Christian Bale, Peter Fonda, Ben Foster and Logan Lerman. Music is by Marco Beltrami and cinematography by Phedon Papamichael.\r\n\r\nAfter the capture of notorious outlaw Ben Wade (Crowe), a posse is put together to escort him to the town of Contention from where he will be put on the 3:10 train to Yuma prison. Joining this posse is broke rancher Dan Evans (Bale), disabled in the Civil War, Dan is struggling to keep hold of his land and to support his family. Seen as a flop in the eyes of his eldest son William (Lerman), Dan sees this opportunity as a way out of his problems. But with Wade an intelligent foe, and the outlaw boss' gang on their trail, Evans and the posse will do well to make it to Contention alive...\r\n\r\nDaves' original film is a fine effort, very much pulsing with psychological beats and cloaked in claustrophobic atmospherics. Backed up by two excellent Western performers in Glenn Ford and Van Heflin, there is many a Western fan who cherish it and never felt it was a genre piece ripe for a remake; myself included. But the logic behind the reasons Mangold and his team put forward for remaking it made sense. A story of great thematics for the adults, and action a go-go for the younger modern film fan. Thus putting a Western back in the headlines at yet another time when the genre was gasping for air. All that was left to do was get two of the modern era's biggest stars to play Wade and Evans - which of course they duly did - and it was good to go. Just don't mess it up was all that was asked of the makers.\r\n\r\nRunning at nearly half an hour longer than the original, Mangold's movie slots in a new mid-section and changes the ending. The former works a treat as the posse venture through hostile Apache country, meet some ne'er-do-well railroad ruffians, while Wade's gang, led by the supremely fiendish Charlie Prince (Foster), are on the bloody trail. The latter is a huge misstep, both in execution and character development. Most film fans are happy to suspend disbelief in the name of good entertainment, but here we are asked to ignore some impossible athletics while also being asked to swallow a character turn around that beggars belief. Such a shame because up till then the blend of traditional Western character themes such as morality and redemption had dovetailed nicely with the pistol banging and all round breezy action construction. While the father and son axis also gives the narrative some extra bite.\r\n\r\nEven bad guys love their mothers.\r\n\r\nThe performances are also of a high standard. In the support slots Fonda, Foster and Lerman are top dollar. Fonda is all leather faced and gruff as bounty hunter McElroy, Foster does a quality line in sneering villainy, and Lerman, in a tricky role, utterly convinces as the conflicted boy breaking out into a man. But this is Crowe and Bale's movie. Crowe has Wade as an intelligent dandy, a man who loves and understands women, an artist who also has a tongue as quick as his hands are on his guns. We know that Wade is callous, but Crowe ensures that we never know what is around the corner or truly on his mind. Bale puts much dignity into Evans, he's a put upon man, tortured by his failings on the home front, but there is stoic nobility there and as he and Wade venture further on their journey, a grudging respect begins to form and Bale and Crowe really start to put credibility into their characters. And then that last quarter nearly undoes all their excellent work...\r\n\r\nIn spite of this, 3:10 to Yuma is a good time to be had as a modern Western production with old traditional values. Energetic and never dull from first frame to last, it's recommended on proviso you don't mind unscrewing your head and taking out your brain for the last 15 minutes. 7.5/10\r\n\r\n", "created_at": "2017-02-09T03:24:47.129Z"}, {"movie_id": 5176, "review_id": "5af5d3609251417997000aaa", "author_rating": 9.0, "review_text": "The price of redemption -- READ THIS if you had problems with the ending\r\n\r\nThis remake involves the capture of a notorious outlaw, Ben Wade (Russell Crowe), who is then escorted to the town of Contention to await the train to Yuma, where he'll be hanged. A desperate rancher, Dan Evans (Christian Bale), hires on for the escort job because he needs the $200 for his family to survive. Wade plays psychological games the entire time trying to corrupt Evans, but things turn out differently.\r\n\r\nThe cast is outstanding (which also features the beautiful Gretchen Mol and Peter Fonda), the New Mexican locations are great and the score ranks with the all-time best. Most importantly the picture is engaging throughout its 2 hour runtime, not to mention the story gives the viewer a lot to chew on.\r\n\r\nThe first hour of the film is realistic but what turned me off during my initial viewing was the second hour's mounting implausibilities. Thankfully, most of these can be explained.\r\n\r\nOne issue is when a man burns to death locked in a wagon carriage. The quibble is that he doesn't scream enough in fiery torment. But watch the scene and you'll clearly hear him yelling in the background. Evan's loss of a limp at the climax is more of an issue, although this can be explained by an adrenaline rush.\r\n\r\nOne problem I had was that Ben Wade (Crowe) came off as super-human. There was seemingly nothing he couldn't do, even while handcuffed. I suppose this could be explained by the fact that there ARE people who are incredibly gifted to the point of being nigh super-human. \r\n\r\nIn any event, this is not a realistic Western like, say, \"Wyatt Earp\" or \"The Long Riders.\" No, \"3:10 to Yuma\" is a MYTHIC Western with an potent message. If you can't handle strong mythic elements in Westerns look elsewhere.\r\n\r\nWhen I first saw the film I didn't get the ending and it turned me off. But it was clear that there was more to the picture than what first meets the eye so I decided to view it again. It DOES make sense, it's just that you might miss it on your initial viewing because the events flash by so quickly. When you DO see it, it'll blow you away.\r\n\r\n***SPOILER ALERT*** DO NOT READ FURTHER UNLESS YOU WANT AN EXPLANATION OF THE FILM! \r\n\r\nWade is a confident and talented man who smugly looks down on others, acting like a disciple of Nietzsche who has no moral obligation to anyone, least of all God. He senses simple purity in Evans and plays the role of tempter, trying to corrupt Evans and win him to his way of thinking. But as they wait in the hotel room it is Evans who \"converts\" Wade, in a sense. Evans doesn't accomplish this in any type of contrived manner, he accomplishes it simply by being WHO HE IS -- an undefiled, courageous family man who stubbornly refuses to give up on hope, faith, life, righteousness and family.\r\n\r\nAs they're waiting, Wade sketches a picture of Evans in a book. It is later shown that this sketch was made on an opening page of a Bible. This reveals that Wade came to view Evans as a Christ figure, at least subconsciously, and that Evans is clearly a type of Christ in the story.\r\n\r\nWhat exactly was it that caused Wade to \"convert\" and support Evans? (1.) He saw in Evans a man that refused to be bought -- a man who refused to be corrupted by filthy lucre, which was something he never experienced before. (2.) Evan's son insisted that there was still some good in Wade despite his wicked history. Regardless of Wade's denial, the kid was right. The idea that SOMEONE saw a glimmer of good in him, that SOMEONE out there BELIEVED in him despite his past evil deeds ultimately moved him and compelled him to support Evans. (3.) Wade turned evil because he was abandoned as a kid. He saw in Evans and his wife a REAL family -- parents who stayed together and refused to abandon faith, hope, righteousness and family come hell or high water. He became convinced that Evans and his family were worth supporting, even perhaps dying for. (4.) Evans made a deal with the Pinkerton that if he successfully got Wade to the train the Pinkerton would make sure Evans' family got $1000, which would bail them out of their hardships. Wade wanted to make sure the family got that money. Somewhere deep inside he wanted to redeem himself of his wicked past and this was the opportunity. This could be the beginning of a new life.\r\n\r\n(5.) Wade's relationship with Evans lasted only a few days but he found something that was missing in all his other relationships - a friendship based on respect rather than familiarity or shared events. Great friendships like this can happen quickly similar to love-at-first-sight. Such relationships are conducive to transparency, which explains why Evans reveals to Wade the real reason he lost his leg in the war.\r\n\r\nAfter Evan's brutal death Wade has an even greater revelation: To see a truly undefiled man -- a simple but GREAT man -- murdered by a group of immoral swine fills him with disgust. You can see it on his face. Yes, he should be thankful that his men remained loyal to him but this was about their only redeeming quality. To truly start a new life he would have to be judge and executioner of the corrupted souls who would pull him back down into the slime.\r\n\r\nWhy did Evans have to die? Because redemption can only be paid via the spilling of blood. It was the price for Wade to live and have a new life.\r\n\r\nGRADE: A", "created_at": "2018-05-11T17:31:12.747Z"}, {"movie_id": 5176, "review_id": "610fbe8b01e4d1005e8d19ce", "author_rating": 10.0, "review_text": "This is the best Western of the 21st Century so far (for mine, just edging out Django Unchained). \r\n\r\nBuilding on the classic movie from 1957, James Mangold's remake adds in much needed scenes to fill plot holes and build nuanced characters that were sorely lacking in the original.  \r\n\r\nOur hero now, is a man struggling to keep his farm and the respect of his family whilst the \"antagonist\" (I stretch the use of the word here) is almost tired of his way of life and his \"family.\"  Adding in the concept of children to these two was smart thinking on the part of the writers and this really deepens Bale and Crowe's characters.  \r\n\r\nSpeaking of which, both give perfectly nuanced performances here and you can watch their characters grow in response to each other as the movie progresses.  Both \"sons\" (Lerman and Foster) fit into their roles of the naive teen becoming a man, and the unhinged \"son\" idolising his \"father\" respectively.  The rest of the cast have been perfectly chosen. \r\n\r\nThe cinematography is stunning at times, but unlike most Westerns, this does emphasize the country - it is more of a silent character here.  But when it is shown, it is just gorgeous...seriously, I hadnt seen snow in Westerns until this - but it just looks brilliant. \r\n\r\nThe score drips with the memories of older, more famous Westerns, but Beltrami makes this one unique.  Sound design is also great, even using the heartbeat-like rhythm of the idling train's engine in the final scene.  \r\n\r\nEverything else is perfect - the lighting, editing, costumes, set design...this does not look like an independently made film that the major studios didnt want to touch.  The people who worked on this, really wanted to.  And that's also probably why its so good.  \r\n\r\nTHIS is how to remake a movie.  Enjoy.", "created_at": "2021-08-08T11:22:51.830Z"}, {"movie_id": 5176, "review_id": "63c21d88e16e5a008ac852a1", "author_rating": 10.0, "review_text": "Most of the time I hate remakes....but I give a big pass to most Western and War movie remakes.\r\n\r\nMainly that's because, until M*A*S*H early war movies had soldiers that looked like they stepped out of the shower and put on a freshly laundered uniform...you know, instead of the realities of life in combat zones.\r\n\r\nAnd the same goes with Westerns, the cowpokes may be riding the range...yet they look like they had the time to shower, shave, style their hair, and press their clothes.\r\n\r\nNone of that really sat right with me...at all.\r\n\r\nThe remake righted that wrong.\r\n\r\nAnd it did it without killing the wonderful Elmore Leonard story the movie was based on and let's be honest, he really has the best ideas for crime and western stories the world has ever seen.", "created_at": "2023-01-14T03:12:08.033Z"}]