[{"movie_id": 514921, "review_id": "5e183e161ad93b00153eab08", "author_rating": 8.0, "review_text": "There's little groundbreaking about 'The Aeronauts', but that isn't to diminish what an excellent and genuinely thrilling experience it is. At its best, it's 'Gravity' in a hot air balloon, a nail-biting and awe-inspiring adventure of human beings pitted against the ferocity of the elements. Tom Harper has done a sterling job elevating Jack Thorne's screenplay and imbuing it with tremendous tension. Even with its faults, 'The Aeronauts' knows exactly what kind of film it needs to be and does so with great aplomb. If you can see it on the big screen, don't miss the chance. Those set pieces deserve to be seen on as big a screen as possible.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-aeronauts-a-thrilling-adventure-on-the-edge-of-the-sky", "created_at": "2020-01-10T09:04:22.426Z"}, {"movie_id": 514921, "review_id": "5e206f85b3316b0013034df3", "author_rating": 7.0, "review_text": "The Aeronauts ascends through the weathering clouds to deliver a beautifully panoramic adventure. The sky is our limit. Our ambitious endeavours, boundless by the mysterious stars that plague the night. Eloquent diamonds dancing on a twinkled canvas. The infallible lust for discovery, eternally motivated to make the world and ourselves more habitable. Safer. Predictable.\r\n\r\nHarper’s loose adaptation of Holmes’ novel, for better or worse, takes the capabilities of artistic licence and alters history for the sake of entertainment. Whilst unnecessary in depicting the scientific discoveries and world-shattering record at the time, Harper’s daring adventurous thrill-ride passes through the stratosphere with vivid colours. Meteorologist Glaisher and balloon pilot Rennes attempt to break the world-record height of 23,000ft, but soon encounter a battle for survival when their minds become deluded from the insufficient oxygen.\r\n\r\nAs I was saying, artistic licence is a powerful element to filmmaking. In the wrong hands, an irresponsible change in history could be produced, tarnishing the events that actually occurred. Conversely, it could be used to elevate a vital moral that, whilst enhances entertainment, retains the delicacy of history without diminishing its achievements. Harper and Thorne teeter on the two halves, precariously floating through thunderous clouds of inaccuracy. The removal of Glaisher’s scientific partner Coxwell, replaced by the fictional Rennes, was haphazard. With no acknowledgement of his existence, The Aeronauts clearly rains down upon the realms of light entertainment, and that’s absolutely fine. But to utilise Glaisher’s real persona instead of fictionalising his character whilst retaining his discoveries, felt deflating for Coxwell.\r\n\r\nHaving said that, the addition of Rennes and surprisingly making her story at the forefront of the narrative, inspired a bountiful amount of female empowerment during the repressed Victorian era. Her lack of knowledge in Glaisher’s area of expertise resulted in an accessible screenplay that allowed audiences to instantly connect with her. As the human component to the aeronautical adventure, Rennes seamlessly moves forward in being the main protagonist. A refreshing change that juxtaposes Redmayne and Jones’ previous partnership in ‘The Theory of Everything’. It allowed Jones, who absolutely captivated with her buoyant performance, to showcase a physically demanding and emotionally vulnerable journey.\r\n\r\nThe tragic personal loss that plagues Rennes’ stability, testing her ornate instinct in survivability. Riding in thunderous clouds, battling oxygen deficiency and climbing a freezing balloon whilst combating frostbite at 36,000ft. Just a shame that Redmayne rarely changes up his usual bumbling performance that we’ve seen time and time again. Harper’s intent focus on teamwork and partnership, allows the film’s moral to come shining through. Some reach for the stars, others push others towards them.\r\n\r\nThe flashback structure prevents a completely linear experience for occurring, and adds appropriate drips of backstory without diminishing the excitement of their gradual ascent. The abrupt cuts do produce an irregular pace, especially when the two barely survive a raincloud only for the editing to splice a societal debate back in London, but the outstanding visuals and Price’s intense score (as to be expected...) instantly regulate the taste for adventure again. Simply the best panoramic visuals of the year. The endless blanket of cumulus clouds envelope you in an overwhelming horizon, conveying the solidarity of these two daredevils. Then, when they reach the summit of their ascent, well, I was on the edge of my seat. Superbly thrilling!\r\n\r\nThe Aeronauts, despite the historical inaccuracy and fictionalised strands for the sake of entertainment, floats through the atmosphere in a gloriously thrilling adventure that remains both grounded in narration and afloat in excitement. No hot air balloon rides for me...", "created_at": "2020-01-16T14:13:25.142Z"}, {"movie_id": 514921, "review_id": "631836988ddc34007a6162bd", "author_rating": 1.0, "review_text": "The Aeronauts is a100-minute long illustration of the rule in Ebert's Little Movie Glossary that teaches us, \"no good movie has ever featured a hot-air balloon,\" though it takes it less than 10 minutes to show why — right about the point where a poor, defenseless dog is parachuted from a hot-air balloon; the animal makes a safe landing, which of course raises the question, how does a dog, lacking both the brainpower and opposable thumbs, successfully operates a parachute?\r\n\r\nThis film actually illustrates something else, and it’s that 'sex sells' has been replaced by 'gender sells.' The most significant balloon flight depicted here is based on the September 5, 1862 flight of British balloonists James Glaisher and Henry Coxwell. \r\n\r\nHowever, while Glaisher appears in the film (played by Eddie Redmayne, who looks like he landed on his face after his own parachute failed to open), Coxwell has been replaced by Amelia (Felicity Jones), a purely fictional character.\r\n\r\nThe lesson seems to be that it's not enough to discredit a real person simply because they belong to the male persuasion, but on top of that they have to 'empower' a unnecessary character that the filmmakers have dreamed up because they can't be bothered to research the subject their film is supposed to be about — if they had, they would know that the history of aeronautics is not short on women; for example, Katharina Paulus, who invented the first collapsible parachute (and didn’t endangered a dog’s life in the process, I’m sure).", "created_at": "2022-09-07T06:13:44.671Z"}, {"movie_id": 514921, "review_id": "63bf684905a5330085a41ca1", "author_rating": 1.0, "review_text": "Well, I like Jones and I like Redmayne so I had high hopes for this, plus it was based on true events... and I understood that it was going to be exaggerated for dramatic effect, but I didn't think it was going to be a total rewrite of history.\r\n\r\nI don't mind taking artistic licenses when making movies based on historical events... but I had no idea that Henry Coxwell was a woman named Amelia Rennes and I didn't know that she was the only one capable of doing anything of value on the flight.\r\n\r\nBut, I guess politics got in the way of history, and they decided that a total rewrite to the point where it was based around a fictional character needed to be done because the truth had too much meh patriarchy? Because they couldn't depict men as being intelligent or daring in any way?\r\n\r\nThey went woke, and filled it with trope of the new woke fad.\r\n\r\nSo, Jones doesn't really struggle, she never makes a mistake, she is always more intelligent, stronger, and braver than anyone else around her, while everyone else around her is a bumbling fool that only succeeds because of her capabilities.\r\n\r\nAnd, of course, her character is entirely fictional.\r\n\r\nBut, it's a success if you want to entirely rewrite history to suit a political agenda.", "created_at": "2023-01-12T01:54:17.845Z"}]