[{"movie_id": 511987, "review_id": "5d2754ccbe4b3612f59db23a", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\n2018 was a disappointing year for me. A lot of letdowns regarding my most anticipated movies, and not enough surprises throughout the year. 2019, on the other hand, has been quite interesting. Most blockbusters have resonated with me, and they’ve been my favorite films to watch so far (Avengers: Endgame, John Wick: Chapter 3 - Parabellum, Us, Glass). Additionally, original low-budget flicks have also caught my eye, and I’ve been enjoying them as well, even if they’re no masterpieces (Greta, Long Shot). Although, I had some bad experiences as well (Dark Phoenix, Hellboy, Godzilla: King of the Monsters). \r\n\r\nCrawl, which I honestly expected just to be a cliche-filled silly horror movie, joins this last group, and it’s on par with Long Shot as the best surprise of 2019, until now. First of all, this is not a typical horror film, at least having in mind the last few examples of the genre. People might go in expecting something along the lines of Annabelle Comes Home, but with alligators, so I might as well moderate those thoughts. I wouldn’t even place it in that genre, even though disaster-horror isn’t exactly a bad description. It’s definitely a suspense movie, almost like a survival-thriller. Haley and Dave have to fight for their lives in a race against both a hurricane and fatal predators, so I wouldn’t generally put this in the horror genre. Moving on …\r\n\r\nI love this type of films, you know that. Suspenseful, claustrophobic sequences, straightforward plot, and set in (mostly) just one location. You might think that since it’s only one place to shoot and it’s such a simple concept, it’s easier overall, but it couldn’t be more distant from the truth. With high-budget, multiple-location movies, directors and screenwriters can hide their technical flaws with tremendous VFX or huge set pieces. In one location, especially such a small one like a modest house, there’s no hiding. If you want to deliver an entertaining and captivating story, you have to write an enthralling screenplay. If you want to provide scary and efficient jump scare scenes, you need to show some creativity and prove you’re a talented filmmaker.\r\n\r\nAlexandre Aja, who doesn’t exactly has a remarkable filmography, showcases that even with such a simplistic and short idea, it’s possible to be as or more fun than a massive blockbuster. Less than 20 minutes into the film, and we’re on. There’s enough backstory and characterization of the main protagonist for the audience to not only care about Haley but understand what skills she has that will help her survive what comes next. I love small details like zooming in on her locking a door, closing a window, moving a piece of furniture … Every shot has meaning because it will affect the plot later on. Aja is not shooting something “just because”, and that’s a skill that a lot of directors struggle to have nowadays since they feel that the runtime needs to be close to the two-hour mark.\r\n\r\nAfter so many dumb, cliche, and horribly performed jump scare sequences in previous horror flicks from this year, I finally got to watch a movie where the director knows how to truly scare people, and make them jump out of their chairs. There are no loud soundtrack noises to make you screech. There are no demons or monsters in front of the screen, screaming like crazy. I was at the edge of my seat for more than a couple of times, and I genuinely got scared on some particular moments, where the surprise factor (Aja doesn’t follow the cheap timings of most horror scenes) and the creativity behind the camera were top notch.\r\n\r\nObviously, the VFX and overall production design aren’t mind-blowing. The alligators look pretty real, and that was the main goal, so mission accomplished. Also, being Rated-R helps the film to deliver great alligator attacks with tons of blood, and the injuries our characters have to deal with are pretty gnarly and disgusting (that’s a compliment). Filming in water is extremely hard, especially in such a confined space. However, Aja and his crew were able to produce a movie where you can understand everything that’s going on for the entire runtime. \r\n\r\nKaya Scodelario and Barry Pepper deliver great performances and show amazing chemistry. Their characters have enough development, even if they don’t have that imaginative scripts. Crawl is one of those films where I can’t point out a preeminent issue with it because it’s good at every aspect. I mean, sure, there are a couple of rare moments of extreme survival, where we might think “he/she should be dead”, but it’s such a fun and entertaining time at the theater that we can let go of one or two over-the-top scenes. It’s not like The Meg, where every single moment is unrealistic as hell. The success of the fictional part of a fiction movie depends on its realistic foundation and limits. If these aren’t well-established, then the film will be all over the place, and its viewers won’t know what to believe or not.\r\n\r\nAll in all, Crawl is one of 2019’s best surprises, and I definitely recommend to see it in theaters. With compelling leads and a simple concept, Alexandre Aja delivers an entertaining, suspenseful, claustrophobic, and technically creative movie. Finally, someone who knows how to handle a camera, and provide genuinely scary jump scare sequences. Hopefully, this can catapult Kaya Scodelario to grab a bigger role on a more impactful film. I can’t point out any “flaws”, it’s simply a “good movie”. With such a low-budget, give a chance to this one, and watch it instead of a massive blockbuster that will probably leave you disappointed with the numerous cliches and the extreme focus on silly action or huge set pieces as a replacement for a good story. Good job, Paramount!\r\n\r\nRating: B+", "created_at": "2019-07-11T15:25:00.705Z"}, {"movie_id": 511987, "review_id": "5d9ade53d371970020b7a357", "author_rating": 7.0, "review_text": "_Crawl_ didn't changing my life or anything, but it is far and a way the best creature feature I have seen in years. Kaya Scodelario still hasn't quite got the hang of an American accent, and the very first time we see a gator it does nooot look good, but I still am very happy with what was achieved here. \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-10-07T06:42:27.705Z"}, {"movie_id": 511987, "review_id": "5da3bb2ee860170017b0f0d2", "author_rating": 2.0, "review_text": "Crawl is a medium budget creature horror film that’s more Bait than Jaws – but with the added back drop of a massive hurricane. As if our characters weren’t already in enough danger.\r\n\r\nIs Crawl a “so bad its good” movie, or a “so bad you should avoid it” movie? Read on to find out.\r\n\r\nSet in Florida during a category 5 hurricane, Crawl tells the story of Haley and her father Dave, played by Barry Pepper. After receiving a frantic phone call from her sister, Haley goes on the hunt to find her father who is trapped in their old house as the hurricane approaches. \r\n\r\nUnbeknownst to Haley, the overflow drain has been breached by Alligators, and their about to make Haley’s rescue mission a whole lot more difficult.\r\n\r\nAnd if the gators don’t get Haley and her dad, the rising hurricane waters will.\r\n\r\nI don’t know much about Alligators or Hurricanes, but I do like to think I know something about logic. And that is something that is sorely lacking in most characters in this film. Even the dog.\r\n\r\nA series of unfortunate events conspire to make the rescue almost a futile effort. And the missing logic from our characters only add to the frustration to us, as the viewer. \r\n\r\nWhere should I start? First and foremost, I want to understand why neither Haley or Dave ever tried to smash out the weak looking brick work patterns on the basement wall and then crawl out of the new hole to safety? It doesn’t look like the bricks would need much in the way of a good whack to break open – and considering there were tools in the basement, including the shovel that Dave uses later on to half-decapitate a gator, this bit makes no sense to me. Now I realise two things – 1 is that the open brick patterns serves a purpose to flood the basement – but in reality it’s the first thing anyone would think to smash open. And 2 – if they did do that, then I realise we’d have a short film. But then the writers could have had more fun for the next hour putting Haley and Dave in more incredible and hard to survive scenarios. So there’s a missed opportunity.\r\n\r\nThe gators that are stuck into basement with Haley and Dave also don’t seem to be those of the killing variety – its either that or the skin of our two characters is so tough that these gators just can’t bite through them. I’m not gator expert, but I am pretty sure if one gets his whole mouth on your arm – he is probably going to bite your whole arm off, and not just leave a minor bite mark. Funny thing is we know these two gators are indeed killers, as one of them does eat the police man who comes to rescue them. \r\n\r\nAlso following up on the theme of me not being an expert on gators – one thing has me puzzled. Do gators kill for sport, or because they’re hungry? I can’t work that out based on this movie. \r\n\r\nAnd in something that really shocked me for an American movie – it took over an hour until we saw the first gun. That has to be some kind of record for an American horror thriller movie?\r\n\r\nBut its not all bad – because there are quite a few laugh out loud moments in this movie to lighten up the mood.\r\n\r\nI really liked the way Haley traps one of the gators in the shower. That’s both clever and utterly ridiculous – that a flimsy piece of shower glass could be strong enough to hold back a gator that wants to kill.\r\n\r\nI also liked the nod to the Purge movies when the siren started just as the eye of the storm was passing through. It almost felt like a both a warning to all humans, and a sign to all gators that they could begin their hunt.\r\n\r\nIf you go into this movie realising that its not meant to be taken seriously, then its an enjoyable ride that will only briefly have you jumping in your seat over the scares and light gore. For a movie about gators hunting humans, it is surprisingly light on the gore – but then that’s what happens when Hollywood makes horror movies for teen audiences.\r\n\r\nAnd there in lies the problem with this movie and someone like me watching it. It not aimed or marketed at me, and maybe not even at you. It’s a forgettable popcorn flick in the same vein as Bait, but not as fun – at least that had gore to go with its killer sharks.", "created_at": "2019-10-14T00:02:54.072Z"}, {"movie_id": 511987, "review_id": "5da79fcde6d3cc0015ae0f45", "author_rating": 7.0, "review_text": "Simple but entertaining enough, and quickly paced (running time around 80-minutes w/o credits), thriller that has just enough character development for me to care about their predicament. Not sure how much replay value this has but it's at least worth a rental. **3.5/5**", "created_at": "2019-10-16T22:55:09.050Z"}, {"movie_id": 511987, "review_id": "5ff0d6dd869e750041d8a0cc", "author_rating": 3.0, "review_text": "The movie plot follows Hayle, who heads towards a storm in Florida to check on his father, who is not answering calls.\r\n\r\nWhen she gets there, her father is hurt and the house is surrounded by hungry and furious alligators. To make it worse, the storm causes a flooding and all this water just makes the hunt easier for the gators.\r\n\r\nThe movie has good visual effects, but the plot armor is the most absurd one I have seen in years. Against everybody else, the gators are relentless and super-effective man-killing machines, tearing anyone in pieces before they are even able to see what is attacking them. The protagonists, however, suffer only mild scratches from gator bites that would at least result in an arm or leg being torn off. \r\n\r\nThis is so frequent and so clearly absurd and unrealistic that the movie ceases to be enjoyable after a while.", "created_at": "2021-01-02T20:26:05.803Z"}, {"movie_id": 511987, "review_id": "630a674532489b007e860d7d", "author_rating": 7.0, "review_text": "**Hurricanes, alligators, and a fractured father-daughter relationship - Crawl is a fun creature flick that survives it all!**\r\n\r\nCrawl is different from my usual favorite stupid shark or alligator creature features because this is not a so-bad-it’s-good ridiculous movie. Instead, Crawl is a well-done creature survival thriller that creates high anxiety with claustrophobic environments filled with enraged starving alligators. Kaya Scodelario and Barry Pepper play a father and daughter trapped in a flooding basement in the middle of a hurricane that has become the new home of some hungry crocs. The serious tone and high quality of Crawl would be comparable to The Shallows making this an excellent film as much about survival and growth as the alligators looking for dinner. The effects, well-designed sets, and great performances make Crawl a top-notch creature feature.", "created_at": "2022-08-27T18:49:41.638Z"}]