[{"movie_id": 20662, "review_id": "589c4471925141250a003729", "author_rating": 7.0, "review_text": "It wasn't really what I expected. I thought I'd be bored in my ass. I wasn't really. Ok. Maybe just a little. I didn't want to watch this because, come on, we all know Robin Hood's story. But then while watching it, I tell myself, this isn't the Robin Hood that I know. It's a different take on Robin Hood. Although I can't help but tell mayi that the movie could've been a lot better if Gerard Butler played Robin. But Russell Crowe delivered too. I'm just not a super big fan of his. And then Cate Blanchett, was intimidating as always. I mean not in a bad way. I think she's the celebrity that I'm most intimidated with. Her characters were always great. The movie was nice. Although I wouldn't rate it as super nice. It had its boring parts wherein I just want to close my eyes for a little. And then it felt like it was too long for me. I wasn't really into it that much although I was entertained.", "created_at": "2017-02-09T10:29:05.119Z"}, {"movie_id": 20662, "review_id": "63c21d5705a533007c7f0208", "author_rating": 1.0, "review_text": "What we have here is an Ego problem...and that makes Prince of Thieves look great in comparison.\r\n\r\nBut I'll be honest, I can watch Prince of Thieves over and over again. It's a fun movie, so long as you only watch the Alan Rickman parts.\r\n\r\nBut Rickman was kind of out there on his own for most of the film and able to do his own thing and cut loose...while poor Freeman was stuck opposite Costner in every scene and, being a generous man he stepped back and gave Kevin the opportunity to not even attempt to act.\r\n\r\nHere wen have, again, some pretty good actors and some pretty clever character actors...and Russel Crowe.\r\n\r\nMy issue with a LOT of Crowe movies is that he's not generous like Freeman. He doesn't step back and let others do their thing so the movie will succeed.\r\n\r\nCrowe hogs as much of every scene as he can and, when he's not directly talking, moves, does things to draw your attention to him and not the other actors.\r\n\r\nMaster and Commander suffered for it. He was probably too afraid to do it opposite Pacino in The Insider, I can see Bale being just as aggressive in 3:10 to Yuma...but in Robin Hood, Crowe is up to his old tricks again.\r\n\r\nSo you have the Russel Crowe show once more and that gets tiresome. It gets tiresome fast.\r\n\r\nThe rule, at least my rule for Crowe movies is simple, if it looks like he's going to be forced to share it will be a great film...if it looks like he can hog it, the movie is going to stink.\r\n\r\nRobin Hood Stinks", "created_at": "2023-01-14T03:11:19.082Z"}]