[{"movie_id": 346364, "review_id": "59afaa2cc3a3682e6401064f", "author_rating": null, "review_text": "\"Skarsgård goes to hell and back to craft a truly malevolent creation, utterly believable as the black soul of King’s cursed small town...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/9/6/it.html", "created_at": "2017-09-06T07:56:29.005Z"}, {"movie_id": 346364, "review_id": "59bfb66c9251414745014240", "author_rating": 1.0, "review_text": "**This movie went right to the trash.** I cannot believe what Warner Bros has done for this piece of trash.\r\nYes, there have been rave reviews for this movie, but we recommend that you do not mind them, as we should not be teaching children on how to safely get sodomized by a monster.\r\n\r\nThese directors' brains are also in the trash. Now let's put the MPAA R rating right into the trash where it is supposed to go. Final warning: **Don't let your kids watch trash.**", "created_at": "2017-09-18T12:05:00.548Z"}, {"movie_id": 346364, "review_id": "59c098eac3a36804db00aeb6", "author_rating": 7.0, "review_text": "More _Fucked-Up-Coming-of-Age_ than _Monster-Movie-Slasher-Horror_. Which is what it should be, but perhaps not what it's marketed to be. Stephen King's _It_ is one of my all time favourite books, and I don't know that it will ever get a faithful adaptation (totally understandable seeing as the thing is 1200 pages and contains a multi-book spanning mythology of Space Gods and Turtle vomit), but this does a pretty good job of interpreting the feeling of the novel, even if it's not a great adaptation the events as a whole.\r\n\r\nThe kids are all great, Skarsgård makes for a good Pennywise, Pennywise improves as the piece moves forward, and the town is completely believable as \"Derry\" in the '80s. It may not be all it's purported to be, but is a very impressive film on its own merits.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-09-19T04:11:22.572Z"}, {"movie_id": 346364, "review_id": "59c711d19251415b5404ecef", "author_rating": 8.0, "review_text": "If you are gonna watch this movie go to the theatres and watch it...It's way more scarier than Annabelle: Creation and you will have lots of jump scares too.", "created_at": "2017-09-24T02:00:49.957Z"}, {"movie_id": 346364, "review_id": "59cfdca4925141141e00215a", "author_rating": null, "review_text": "Something certainly rings true in the horror thriller **It** that capitalizes on that common known fear that clowns are creepy annoyances to those that have an intense phobia towards them. In the case of **It’s** dastardly powder-faced joyboy or shall we say corrosive killjoy Pennywise the Dancing Clown, he definitely takes the cake in terms of his treacherous tendencies to quiet the unsuspecting kiddies in devious fashion. Here is a tip, parents, do not invite the poisonous Pennywise to your kids’ birthday party any time soon to blow up balloons and sing songs. This is just a friendly little warning. There is more to elaborate on regarding the sicko circus funnypants freak later.\r\n\r\nDirector Andy Muschietti (‘Mama’) delves into this surprisingly delicious twisted and terrorizing tale of a killer clown that gets his jollies off snuffing the lives out of rural-based youngsters in this calculating frightfest that pushes all the right buttons of panic and perversion. Skilfully edgy and traumatically tasty, **It** is a refreshing throwback to old-fashioned gory-minded gems where the boundaries of old-fashioned scare tactics were designed not only by the actual act of homicidal happenings but the mere suggestive nature of the heinous hedonism taking place. Polished and gripping in its shadowy and shifty overtones, **It** is convincingly probing as an absorbing psychological character study with an off-kilter sense of defiance in its naughty commentary on youthful innocence being compromised.\r\n\r\nBased on the novel from famed hair-raising author Stephen King, **It** delivers the solid, sordid goods of a wild and wicked imagination following the acidic exploits of a menacing clown in the aforementioned Pennywise (played with penetrating  and devilish aplomb by Bill Skarsgard from ‘Atomic Blonde’) whose murderous methods of slaughtering the young has been a staple signature in his madness for centuries now. The surviving tykes in the quaint town of Derry, Maine must now safeguard themselves from the makeup-wearing whackjob and figure out a way to terminate the baggy-panted beast before he continues to strike again and victimize another doomed child.\r\n\r\nThe backstory behind Pennywise’s existence is that he is some shape-shifting demon that emerges from the sewers only to target the unlucky rugrat in his immediate path while conniving, and conducting his blood-thirsty ways. However, there are a group of children that refuse to play dead for the demented clown and the quest to create an ill-advised showdown with the deplorable Pennywise would prove to be a very violent and mentally scarring experience in the process.\r\n\r\nThe story centres around young Bill (Jaeden Lieberher, ‘Allegiant’) and his early encounter with the sadness of unknowingly witnessing Pennywise’s wrath as it was inferred that the clown had to do with the demise of his precious little brother, George (Jackson Robert Scott), who never returned after enthusiastically wanting to work on a fun project in the basement. This haunting revelation sticks with poor Bill until this very day.\r\n\r\nNowadays, Bill must cope with the typical obstacles at school avoiding bullies and dealing with the pitfalls of peer pressure and needing to belong to a group of trusty associates. Thus, Bill is able to cement close relationships with the town’s other free-spirited youngsters. Still, there is that hovering myth about the mysterious sewers and, yes, the evil-minded Pennywise is at the forefront of fearful concern for Bill and the bunch. In fact, the gang will succumb to their collection of fears, paranoia and hesitation as the suburban legend of the creep-seeking clown clouds each of the kids’ tainted psyches.\r\n\r\nThe ensemble of young actors in **It**  all register accordingly with their characters’ childhood shock in trying to overcome the overwhelming and petrifying mindset that has invaded their sensibilities. Lieberher has an authentic raw turn as the lead lad invested in the bizarre boundaries of matching wits with the demonic chalk-skinned trickster and his committed craziness. The other supporting cast of exposed kiddies on this adventurous train wreck of terror includes Sophia Lillis (’37’), Finn Wolfhard (from television’s ‘Stranger Things’), Jeremy Ray Taylor (‘Alvin And The Chipmunks: The Road Chip’), Wyatt Oleff (‘Guardians Of The Galaxy”), Chosen Jacobs, Jack Dylan Grazer (‘Tales Of Halloween’) and Nicholas Hamilton (‘Captain Fantastic’).\r\n\r\nThere is no doubt that Skarsgard’s clown of corrosion in Pennywise steals the show with his nefarious nature blistering shamelessly in seedy-minded elation. Clearly, Skarsgard chews the tarnished scenery with his abominable costumed cretin tip toeing on the unassuming sidelines while striking gory goosebump moments for his pubescent prey on screen and the twitchy audience off screen.\r\n\r\nSure, **It** suffers from the conventional trappings of cheesy false alarm jolts and the obligatory lurking in the dark sequences are arbitrarily tossed in as an aftermath for the legitimate lunacy of our star-making crazed and corruptible clown to perform his showboating insanity. Besides, what horror showcase has not welcomed the invitation of the overused and abused jump-scare techniques highlighted by a jittery soundtrack? Still, Muschietti and screenwriters Chase Palmer, Cary Joji Funkunga and Gary Dauberman manage to supply the infectious and insidious **It** with well-executed scary shenanigans, well-paced anxiety, wavering vulnerability and decent acting on behalf of the performers that aptly brought to life the eerie visions and vitality of King’s complex, creative mind.\r\n\r\nTruly **It** is one of the best harrowing and in-depth horror/psychological thrillers to emerge in 2017. Also this titillating tale of cautionary kiddie chaos may be one of King’s formidable movie adaptions since the effective tension-filled, off-the-wall brilliance of 1990’s _Misery_.    \r\n\r\n**It** (2017)\r\n\r\nWarner Bros. Pictures and New Line Cinema\r\n\r\n1 hour 35 minutes\r\n\r\nCAST: Bill Skarsgard, Jaeden Lieberher, Sophia Lillis, Finn Wolfhard, Jeremy Ray Taylor, Wyatt Oleff, Chosen Jacobs, Nicholas Hamilton and Jack Dylan Grazer\r\n\r\nDIRECTOR: Andy Muschietti\r\n\r\nWRITERS: Chase Palmer, Cary Joji Funkunaga, Gary Dauberman\r\n\r\nMPAA Rating: R\r\n\r\nGENRE: Horror/Mystery & Suspense\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-09-30T18:04:20.111Z"}, {"movie_id": 346364, "review_id": "59d3d70bc3a36844e10033bf", "author_rating": 8.0, "review_text": "It is a movie that looked interesting, but I wasn't necessarily anticipating, because it had the potential to be awful. After seeing it, I can say that while it is good, I don't think it's nearly as good as other people are saying it is, and it had the potential to be. Starting off with the good, the film has some fantastic performances from the kids. I think the best performances in the film are from Andy Skaarsgard (or however you spell it) for Pennywise, and the kid who had asthma. I don't know his name, and I haven't seen him in anything before, but he stole the show. The movie also has some pretty scary moments. The scene inside of the house is one of the scariest scenes of the year, and there are lost of images that were genuinely disturbing. While the films was full of cheesy dialogue, the conversations between the kids are extremely entertaining and captivating. When it came to characters, MOST of the characters are well done and fleshed out. And that leads me to one of the 4 things that keep this film from being great in my eyes. Some characters, such as the bullies and Stan, and bland and have no back story. Therefore, whenever they are put in danger, it isn't nearly as scary as with other characters. Another reason I didn't love this film is the rock fight scene. Basically, the Losers Club stumbles upon the bullies and they throw rocks at each other. The rocks seemingly bounce off of their head without any problems like a trampoline. No one gets killed, or even knocked out. Overall, it was a very bad scene. For the most part the special effects were pretty good. However, the leper outside of the creepy house was awful. The costume would be great if it were for a haunted house or prank, but not for a big budgeted horror movie. When it came on screen I literally thought it was a bully playing tricks on him. And the last problem I have with the film is that the police are seemingly nowhere, along with parents. *Mild spoilers* One of the bullies murders his dad, a police officer, and then around a few scenes later, the son dies too. The bullies like to go around thereatening kids with knives and carving H's into their bellies. I think we would see at least one police officer investegating something in the film, and if not, I think my parents would notice if one day I came home and there was a gigantic blood pool on my shirt. Overall, It is a very fun movie. There are certainly better movies out there, but with this, I have an urge to go watch it again in theaters. It is a perfectly fun popcorn flick.\r\n\r\nScore: 7.5/10", "created_at": "2017-10-03T18:29:31.449Z"}, {"movie_id": 346364, "review_id": "59dd94d49251412514085d45", "author_rating": 8.0, "review_text": "Great acting, memorable characters. One of the best (horror?) films I've watched.", "created_at": "2017-10-11T03:49:40.868Z"}, {"movie_id": 346364, "review_id": "64a58090a0be2800cbf67953", "author_rating": 10.0, "review_text": "Greatest remake of a movie ever made in my opinion. Even way scary then the original. Remade the death scenes way better as well. Love it!", "created_at": "2023-07-05T14:39:12.391Z"}, {"movie_id": 346364, "review_id": "59afaa2cc3a3682e6401064f", "author_rating": null, "review_text": "\"Skarsgård goes to hell and back to craft a truly malevolent creation, utterly believable as the black soul of King’s cursed small town...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/9/6/it.html", "created_at": "2017-09-06T07:56:29.005Z"}, {"movie_id": 346364, "review_id": "59bfb66c9251414745014240", "author_rating": 1.0, "review_text": "**This movie went right to the trash.** I cannot believe what Warner Bros has done for this piece of trash.\r\nYes, there have been rave reviews for this movie, but we recommend that you do not mind them, as we should not be teaching children on how to safely get sodomized by a monster.\r\n\r\nThese directors' brains are also in the trash. Now let's put the MPAA R rating right into the trash where it is supposed to go. Final warning: **Don't let your kids watch trash.**", "created_at": "2017-09-18T12:05:00.548Z"}, {"movie_id": 346364, "review_id": "59c098eac3a36804db00aeb6", "author_rating": 7.0, "review_text": "More _Fucked-Up-Coming-of-Age_ than _Monster-Movie-Slasher-Horror_. Which is what it should be, but perhaps not what it's marketed to be. Stephen King's _It_ is one of my all time favourite books, and I don't know that it will ever get a faithful adaptation (totally understandable seeing as the thing is 1200 pages and contains a multi-book spanning mythology of Space Gods and Turtle vomit), but this does a pretty good job of interpreting the feeling of the novel, even if it's not a great adaptation the events as a whole.\r\n\r\nThe kids are all great, Skarsgård makes for a good Pennywise, Pennywise improves as the piece moves forward, and the town is completely believable as \"Derry\" in the '80s. It may not be all it's purported to be, but is a very impressive film on its own merits.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-09-19T04:11:22.572Z"}, {"movie_id": 346364, "review_id": "59c711d19251415b5404ecef", "author_rating": 8.0, "review_text": "If you are gonna watch this movie go to the theatres and watch it...It's way more scarier than Annabelle: Creation and you will have lots of jump scares too.", "created_at": "2017-09-24T02:00:49.957Z"}, {"movie_id": 346364, "review_id": "59cfdca4925141141e00215a", "author_rating": null, "review_text": "Something certainly rings true in the horror thriller **It** that capitalizes on that common known fear that clowns are creepy annoyances to those that have an intense phobia towards them. In the case of **It’s** dastardly powder-faced joyboy or shall we say corrosive killjoy Pennywise the Dancing Clown, he definitely takes the cake in terms of his treacherous tendencies to quiet the unsuspecting kiddies in devious fashion. Here is a tip, parents, do not invite the poisonous Pennywise to your kids’ birthday party any time soon to blow up balloons and sing songs. This is just a friendly little warning. There is more to elaborate on regarding the sicko circus funnypants freak later.\r\n\r\nDirector Andy Muschietti (‘Mama’) delves into this surprisingly delicious twisted and terrorizing tale of a killer clown that gets his jollies off snuffing the lives out of rural-based youngsters in this calculating frightfest that pushes all the right buttons of panic and perversion. Skilfully edgy and traumatically tasty, **It** is a refreshing throwback to old-fashioned gory-minded gems where the boundaries of old-fashioned scare tactics were designed not only by the actual act of homicidal happenings but the mere suggestive nature of the heinous hedonism taking place. Polished and gripping in its shadowy and shifty overtones, **It** is convincingly probing as an absorbing psychological character study with an off-kilter sense of defiance in its naughty commentary on youthful innocence being compromised.\r\n\r\nBased on the novel from famed hair-raising author Stephen King, **It** delivers the solid, sordid goods of a wild and wicked imagination following the acidic exploits of a menacing clown in the aforementioned Pennywise (played with penetrating  and devilish aplomb by Bill Skarsgard from ‘Atomic Blonde’) whose murderous methods of slaughtering the young has been a staple signature in his madness for centuries now. The surviving tykes in the quaint town of Derry, Maine must now safeguard themselves from the makeup-wearing whackjob and figure out a way to terminate the baggy-panted beast before he continues to strike again and victimize another doomed child.\r\n\r\nThe backstory behind Pennywise’s existence is that he is some shape-shifting demon that emerges from the sewers only to target the unlucky rugrat in his immediate path while conniving, and conducting his blood-thirsty ways. However, there are a group of children that refuse to play dead for the demented clown and the quest to create an ill-advised showdown with the deplorable Pennywise would prove to be a very violent and mentally scarring experience in the process.\r\n\r\nThe story centres around young Bill (Jaeden Lieberher, ‘Allegiant’) and his early encounter with the sadness of unknowingly witnessing Pennywise’s wrath as it was inferred that the clown had to do with the demise of his precious little brother, George (Jackson Robert Scott), who never returned after enthusiastically wanting to work on a fun project in the basement. This haunting revelation sticks with poor Bill until this very day.\r\n\r\nNowadays, Bill must cope with the typical obstacles at school avoiding bullies and dealing with the pitfalls of peer pressure and needing to belong to a group of trusty associates. Thus, Bill is able to cement close relationships with the town’s other free-spirited youngsters. Still, there is that hovering myth about the mysterious sewers and, yes, the evil-minded Pennywise is at the forefront of fearful concern for Bill and the bunch. In fact, the gang will succumb to their collection of fears, paranoia and hesitation as the suburban legend of the creep-seeking clown clouds each of the kids’ tainted psyches.\r\n\r\nThe ensemble of young actors in **It**  all register accordingly with their characters’ childhood shock in trying to overcome the overwhelming and petrifying mindset that has invaded their sensibilities. Lieberher has an authentic raw turn as the lead lad invested in the bizarre boundaries of matching wits with the demonic chalk-skinned trickster and his committed craziness. The other supporting cast of exposed kiddies on this adventurous train wreck of terror includes Sophia Lillis (’37’), Finn Wolfhard (from television’s ‘Stranger Things’), Jeremy Ray Taylor (‘Alvin And The Chipmunks: The Road Chip’), Wyatt Oleff (‘Guardians Of The Galaxy”), Chosen Jacobs, Jack Dylan Grazer (‘Tales Of Halloween’) and Nicholas Hamilton (‘Captain Fantastic’).\r\n\r\nThere is no doubt that Skarsgard’s clown of corrosion in Pennywise steals the show with his nefarious nature blistering shamelessly in seedy-minded elation. Clearly, Skarsgard chews the tarnished scenery with his abominable costumed cretin tip toeing on the unassuming sidelines while striking gory goosebump moments for his pubescent prey on screen and the twitchy audience off screen.\r\n\r\nSure, **It** suffers from the conventional trappings of cheesy false alarm jolts and the obligatory lurking in the dark sequences are arbitrarily tossed in as an aftermath for the legitimate lunacy of our star-making crazed and corruptible clown to perform his showboating insanity. Besides, what horror showcase has not welcomed the invitation of the overused and abused jump-scare techniques highlighted by a jittery soundtrack? Still, Muschietti and screenwriters Chase Palmer, Cary Joji Funkunga and Gary Dauberman manage to supply the infectious and insidious **It** with well-executed scary shenanigans, well-paced anxiety, wavering vulnerability and decent acting on behalf of the performers that aptly brought to life the eerie visions and vitality of King’s complex, creative mind.\r\n\r\nTruly **It** is one of the best harrowing and in-depth horror/psychological thrillers to emerge in 2017. Also this titillating tale of cautionary kiddie chaos may be one of King’s formidable movie adaptions since the effective tension-filled, off-the-wall brilliance of 1990’s _Misery_.    \r\n\r\n**It** (2017)\r\n\r\nWarner Bros. Pictures and New Line Cinema\r\n\r\n1 hour 35 minutes\r\n\r\nCAST: Bill Skarsgard, Jaeden Lieberher, Sophia Lillis, Finn Wolfhard, Jeremy Ray Taylor, Wyatt Oleff, Chosen Jacobs, Nicholas Hamilton and Jack Dylan Grazer\r\n\r\nDIRECTOR: Andy Muschietti\r\n\r\nWRITERS: Chase Palmer, Cary Joji Funkunaga, Gary Dauberman\r\n\r\nMPAA Rating: R\r\n\r\nGENRE: Horror/Mystery & Suspense\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-09-30T18:04:20.111Z"}, {"movie_id": 346364, "review_id": "59d3d70bc3a36844e10033bf", "author_rating": 8.0, "review_text": "It is a movie that looked interesting, but I wasn't necessarily anticipating, because it had the potential to be awful. After seeing it, I can say that while it is good, I don't think it's nearly as good as other people are saying it is, and it had the potential to be. Starting off with the good, the film has some fantastic performances from the kids. I think the best performances in the film are from Andy Skaarsgard (or however you spell it) for Pennywise, and the kid who had asthma. I don't know his name, and I haven't seen him in anything before, but he stole the show. The movie also has some pretty scary moments. The scene inside of the house is one of the scariest scenes of the year, and there are lost of images that were genuinely disturbing. While the films was full of cheesy dialogue, the conversations between the kids are extremely entertaining and captivating. When it came to characters, MOST of the characters are well done and fleshed out. And that leads me to one of the 4 things that keep this film from being great in my eyes. Some characters, such as the bullies and Stan, and bland and have no back story. Therefore, whenever they are put in danger, it isn't nearly as scary as with other characters. Another reason I didn't love this film is the rock fight scene. Basically, the Losers Club stumbles upon the bullies and they throw rocks at each other. The rocks seemingly bounce off of their head without any problems like a trampoline. No one gets killed, or even knocked out. Overall, it was a very bad scene. For the most part the special effects were pretty good. However, the leper outside of the creepy house was awful. The costume would be great if it were for a haunted house or prank, but not for a big budgeted horror movie. When it came on screen I literally thought it was a bully playing tricks on him. And the last problem I have with the film is that the police are seemingly nowhere, along with parents. *Mild spoilers* One of the bullies murders his dad, a police officer, and then around a few scenes later, the son dies too. The bullies like to go around thereatening kids with knives and carving H's into their bellies. I think we would see at least one police officer investegating something in the film, and if not, I think my parents would notice if one day I came home and there was a gigantic blood pool on my shirt. Overall, It is a very fun movie. There are certainly better movies out there, but with this, I have an urge to go watch it again in theaters. It is a perfectly fun popcorn flick.\r\n\r\nScore: 7.5/10", "created_at": "2017-10-03T18:29:31.449Z"}, {"movie_id": 346364, "review_id": "59dd94d49251412514085d45", "author_rating": 8.0, "review_text": "Great acting, memorable characters. One of the best (horror?) films I've watched.", "created_at": "2017-10-11T03:49:40.868Z"}, {"movie_id": 346364, "review_id": "64a58090a0be2800cbf67953", "author_rating": 10.0, "review_text": "Greatest remake of a movie ever made in my opinion. Even way scary then the original. Remade the death scenes way better as well. Love it!", "created_at": "2023-07-05T14:39:12.391Z"}, {"movie_id": 346364, "review_id": "59afaa2cc3a3682e6401064f", "author_rating": null, "review_text": "\"Skarsgård goes to hell and back to craft a truly malevolent creation, utterly believable as the black soul of King’s cursed small town...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/9/6/it.html", "created_at": "2017-09-06T07:56:29.005Z"}, {"movie_id": 346364, "review_id": "59bfb66c9251414745014240", "author_rating": 1.0, "review_text": "**This movie went right to the trash.** I cannot believe what Warner Bros has done for this piece of trash.\r\nYes, there have been rave reviews for this movie, but we recommend that you do not mind them, as we should not be teaching children on how to safely get sodomized by a monster.\r\n\r\nThese directors' brains are also in the trash. Now let's put the MPAA R rating right into the trash where it is supposed to go. Final warning: **Don't let your kids watch trash.**", "created_at": "2017-09-18T12:05:00.548Z"}, {"movie_id": 346364, "review_id": "59c098eac3a36804db00aeb6", "author_rating": 7.0, "review_text": "More _Fucked-Up-Coming-of-Age_ than _Monster-Movie-Slasher-Horror_. Which is what it should be, but perhaps not what it's marketed to be. Stephen King's _It_ is one of my all time favourite books, and I don't know that it will ever get a faithful adaptation (totally understandable seeing as the thing is 1200 pages and contains a multi-book spanning mythology of Space Gods and Turtle vomit), but this does a pretty good job of interpreting the feeling of the novel, even if it's not a great adaptation the events as a whole.\r\n\r\nThe kids are all great, Skarsgård makes for a good Pennywise, Pennywise improves as the piece moves forward, and the town is completely believable as \"Derry\" in the '80s. It may not be all it's purported to be, but is a very impressive film on its own merits.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-09-19T04:11:22.572Z"}, {"movie_id": 346364, "review_id": "59c711d19251415b5404ecef", "author_rating": 8.0, "review_text": "If you are gonna watch this movie go to the theatres and watch it...It's way more scarier than Annabelle: Creation and you will have lots of jump scares too.", "created_at": "2017-09-24T02:00:49.957Z"}, {"movie_id": 346364, "review_id": "59cfdca4925141141e00215a", "author_rating": null, "review_text": "Something certainly rings true in the horror thriller **It** that capitalizes on that common known fear that clowns are creepy annoyances to those that have an intense phobia towards them. In the case of **It’s** dastardly powder-faced joyboy or shall we say corrosive killjoy Pennywise the Dancing Clown, he definitely takes the cake in terms of his treacherous tendencies to quiet the unsuspecting kiddies in devious fashion. Here is a tip, parents, do not invite the poisonous Pennywise to your kids’ birthday party any time soon to blow up balloons and sing songs. This is just a friendly little warning. There is more to elaborate on regarding the sicko circus funnypants freak later.\r\n\r\nDirector Andy Muschietti (‘Mama’) delves into this surprisingly delicious twisted and terrorizing tale of a killer clown that gets his jollies off snuffing the lives out of rural-based youngsters in this calculating frightfest that pushes all the right buttons of panic and perversion. Skilfully edgy and traumatically tasty, **It** is a refreshing throwback to old-fashioned gory-minded gems where the boundaries of old-fashioned scare tactics were designed not only by the actual act of homicidal happenings but the mere suggestive nature of the heinous hedonism taking place. Polished and gripping in its shadowy and shifty overtones, **It** is convincingly probing as an absorbing psychological character study with an off-kilter sense of defiance in its naughty commentary on youthful innocence being compromised.\r\n\r\nBased on the novel from famed hair-raising author Stephen King, **It** delivers the solid, sordid goods of a wild and wicked imagination following the acidic exploits of a menacing clown in the aforementioned Pennywise (played with penetrating  and devilish aplomb by Bill Skarsgard from ‘Atomic Blonde’) whose murderous methods of slaughtering the young has been a staple signature in his madness for centuries now. The surviving tykes in the quaint town of Derry, Maine must now safeguard themselves from the makeup-wearing whackjob and figure out a way to terminate the baggy-panted beast before he continues to strike again and victimize another doomed child.\r\n\r\nThe backstory behind Pennywise’s existence is that he is some shape-shifting demon that emerges from the sewers only to target the unlucky rugrat in his immediate path while conniving, and conducting his blood-thirsty ways. However, there are a group of children that refuse to play dead for the demented clown and the quest to create an ill-advised showdown with the deplorable Pennywise would prove to be a very violent and mentally scarring experience in the process.\r\n\r\nThe story centres around young Bill (Jaeden Lieberher, ‘Allegiant’) and his early encounter with the sadness of unknowingly witnessing Pennywise’s wrath as it was inferred that the clown had to do with the demise of his precious little brother, George (Jackson Robert Scott), who never returned after enthusiastically wanting to work on a fun project in the basement. This haunting revelation sticks with poor Bill until this very day.\r\n\r\nNowadays, Bill must cope with the typical obstacles at school avoiding bullies and dealing with the pitfalls of peer pressure and needing to belong to a group of trusty associates. Thus, Bill is able to cement close relationships with the town’s other free-spirited youngsters. Still, there is that hovering myth about the mysterious sewers and, yes, the evil-minded Pennywise is at the forefront of fearful concern for Bill and the bunch. In fact, the gang will succumb to their collection of fears, paranoia and hesitation as the suburban legend of the creep-seeking clown clouds each of the kids’ tainted psyches.\r\n\r\nThe ensemble of young actors in **It**  all register accordingly with their characters’ childhood shock in trying to overcome the overwhelming and petrifying mindset that has invaded their sensibilities. Lieberher has an authentic raw turn as the lead lad invested in the bizarre boundaries of matching wits with the demonic chalk-skinned trickster and his committed craziness. The other supporting cast of exposed kiddies on this adventurous train wreck of terror includes Sophia Lillis (’37’), Finn Wolfhard (from television’s ‘Stranger Things’), Jeremy Ray Taylor (‘Alvin And The Chipmunks: The Road Chip’), Wyatt Oleff (‘Guardians Of The Galaxy”), Chosen Jacobs, Jack Dylan Grazer (‘Tales Of Halloween’) and Nicholas Hamilton (‘Captain Fantastic’).\r\n\r\nThere is no doubt that Skarsgard’s clown of corrosion in Pennywise steals the show with his nefarious nature blistering shamelessly in seedy-minded elation. Clearly, Skarsgard chews the tarnished scenery with his abominable costumed cretin tip toeing on the unassuming sidelines while striking gory goosebump moments for his pubescent prey on screen and the twitchy audience off screen.\r\n\r\nSure, **It** suffers from the conventional trappings of cheesy false alarm jolts and the obligatory lurking in the dark sequences are arbitrarily tossed in as an aftermath for the legitimate lunacy of our star-making crazed and corruptible clown to perform his showboating insanity. Besides, what horror showcase has not welcomed the invitation of the overused and abused jump-scare techniques highlighted by a jittery soundtrack? Still, Muschietti and screenwriters Chase Palmer, Cary Joji Funkunga and Gary Dauberman manage to supply the infectious and insidious **It** with well-executed scary shenanigans, well-paced anxiety, wavering vulnerability and decent acting on behalf of the performers that aptly brought to life the eerie visions and vitality of King’s complex, creative mind.\r\n\r\nTruly **It** is one of the best harrowing and in-depth horror/psychological thrillers to emerge in 2017. Also this titillating tale of cautionary kiddie chaos may be one of King’s formidable movie adaptions since the effective tension-filled, off-the-wall brilliance of 1990’s _Misery_.    \r\n\r\n**It** (2017)\r\n\r\nWarner Bros. Pictures and New Line Cinema\r\n\r\n1 hour 35 minutes\r\n\r\nCAST: Bill Skarsgard, Jaeden Lieberher, Sophia Lillis, Finn Wolfhard, Jeremy Ray Taylor, Wyatt Oleff, Chosen Jacobs, Nicholas Hamilton and Jack Dylan Grazer\r\n\r\nDIRECTOR: Andy Muschietti\r\n\r\nWRITERS: Chase Palmer, Cary Joji Funkunaga, Gary Dauberman\r\n\r\nMPAA Rating: R\r\n\r\nGENRE: Horror/Mystery & Suspense\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-09-30T18:04:20.111Z"}, {"movie_id": 346364, "review_id": "59d3d70bc3a36844e10033bf", "author_rating": 8.0, "review_text": "It is a movie that looked interesting, but I wasn't necessarily anticipating, because it had the potential to be awful. After seeing it, I can say that while it is good, I don't think it's nearly as good as other people are saying it is, and it had the potential to be. Starting off with the good, the film has some fantastic performances from the kids. I think the best performances in the film are from Andy Skaarsgard (or however you spell it) for Pennywise, and the kid who had asthma. I don't know his name, and I haven't seen him in anything before, but he stole the show. The movie also has some pretty scary moments. The scene inside of the house is one of the scariest scenes of the year, and there are lost of images that were genuinely disturbing. While the films was full of cheesy dialogue, the conversations between the kids are extremely entertaining and captivating. When it came to characters, MOST of the characters are well done and fleshed out. And that leads me to one of the 4 things that keep this film from being great in my eyes. Some characters, such as the bullies and Stan, and bland and have no back story. Therefore, whenever they are put in danger, it isn't nearly as scary as with other characters. Another reason I didn't love this film is the rock fight scene. Basically, the Losers Club stumbles upon the bullies and they throw rocks at each other. The rocks seemingly bounce off of their head without any problems like a trampoline. No one gets killed, or even knocked out. Overall, it was a very bad scene. For the most part the special effects were pretty good. However, the leper outside of the creepy house was awful. The costume would be great if it were for a haunted house or prank, but not for a big budgeted horror movie. When it came on screen I literally thought it was a bully playing tricks on him. And the last problem I have with the film is that the police are seemingly nowhere, along with parents. *Mild spoilers* One of the bullies murders his dad, a police officer, and then around a few scenes later, the son dies too. The bullies like to go around thereatening kids with knives and carving H's into their bellies. I think we would see at least one police officer investegating something in the film, and if not, I think my parents would notice if one day I came home and there was a gigantic blood pool on my shirt. Overall, It is a very fun movie. There are certainly better movies out there, but with this, I have an urge to go watch it again in theaters. It is a perfectly fun popcorn flick.\r\n\r\nScore: 7.5/10", "created_at": "2017-10-03T18:29:31.449Z"}, {"movie_id": 346364, "review_id": "59dd94d49251412514085d45", "author_rating": 8.0, "review_text": "Great acting, memorable characters. One of the best (horror?) films I've watched.", "created_at": "2017-10-11T03:49:40.868Z"}, {"movie_id": 346364, "review_id": "64a58090a0be2800cbf67953", "author_rating": 10.0, "review_text": "Greatest remake of a movie ever made in my opinion. Even way scary then the original. Remade the death scenes way better as well. Love it!", "created_at": "2023-07-05T14:39:12.391Z"}, {"movie_id": 346364, "review_id": "59afaa2cc3a3682e6401064f", "author_rating": null, "review_text": "\"Skarsgård goes to hell and back to craft a truly malevolent creation, utterly believable as the black soul of King’s cursed small town...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/9/6/it.html", "created_at": "2017-09-06T07:56:29.005Z"}, {"movie_id": 346364, "review_id": "59bfb66c9251414745014240", "author_rating": 1.0, "review_text": "**This movie went right to the trash.** I cannot believe what Warner Bros has done for this piece of trash.\r\nYes, there have been rave reviews for this movie, but we recommend that you do not mind them, as we should not be teaching children on how to safely get sodomized by a monster.\r\n\r\nThese directors' brains are also in the trash. Now let's put the MPAA R rating right into the trash where it is supposed to go. Final warning: **Don't let your kids watch trash.**", "created_at": "2017-09-18T12:05:00.548Z"}, {"movie_id": 346364, "review_id": "59c098eac3a36804db00aeb6", "author_rating": 7.0, "review_text": "More _Fucked-Up-Coming-of-Age_ than _Monster-Movie-Slasher-Horror_. Which is what it should be, but perhaps not what it's marketed to be. Stephen King's _It_ is one of my all time favourite books, and I don't know that it will ever get a faithful adaptation (totally understandable seeing as the thing is 1200 pages and contains a multi-book spanning mythology of Space Gods and Turtle vomit), but this does a pretty good job of interpreting the feeling of the novel, even if it's not a great adaptation the events as a whole.\r\n\r\nThe kids are all great, Skarsgård makes for a good Pennywise, Pennywise improves as the piece moves forward, and the town is completely believable as \"Derry\" in the '80s. It may not be all it's purported to be, but is a very impressive film on its own merits.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-09-19T04:11:22.572Z"}, {"movie_id": 346364, "review_id": "59c711d19251415b5404ecef", "author_rating": 8.0, "review_text": "If you are gonna watch this movie go to the theatres and watch it...It's way more scarier than Annabelle: Creation and you will have lots of jump scares too.", "created_at": "2017-09-24T02:00:49.957Z"}, {"movie_id": 346364, "review_id": "59cfdca4925141141e00215a", "author_rating": null, "review_text": "Something certainly rings true in the horror thriller **It** that capitalizes on that common known fear that clowns are creepy annoyances to those that have an intense phobia towards them. In the case of **It’s** dastardly powder-faced joyboy or shall we say corrosive killjoy Pennywise the Dancing Clown, he definitely takes the cake in terms of his treacherous tendencies to quiet the unsuspecting kiddies in devious fashion. Here is a tip, parents, do not invite the poisonous Pennywise to your kids’ birthday party any time soon to blow up balloons and sing songs. This is just a friendly little warning. There is more to elaborate on regarding the sicko circus funnypants freak later.\r\n\r\nDirector Andy Muschietti (‘Mama’) delves into this surprisingly delicious twisted and terrorizing tale of a killer clown that gets his jollies off snuffing the lives out of rural-based youngsters in this calculating frightfest that pushes all the right buttons of panic and perversion. Skilfully edgy and traumatically tasty, **It** is a refreshing throwback to old-fashioned gory-minded gems where the boundaries of old-fashioned scare tactics were designed not only by the actual act of homicidal happenings but the mere suggestive nature of the heinous hedonism taking place. Polished and gripping in its shadowy and shifty overtones, **It** is convincingly probing as an absorbing psychological character study with an off-kilter sense of defiance in its naughty commentary on youthful innocence being compromised.\r\n\r\nBased on the novel from famed hair-raising author Stephen King, **It** delivers the solid, sordid goods of a wild and wicked imagination following the acidic exploits of a menacing clown in the aforementioned Pennywise (played with penetrating  and devilish aplomb by Bill Skarsgard from ‘Atomic Blonde’) whose murderous methods of slaughtering the young has been a staple signature in his madness for centuries now. The surviving tykes in the quaint town of Derry, Maine must now safeguard themselves from the makeup-wearing whackjob and figure out a way to terminate the baggy-panted beast before he continues to strike again and victimize another doomed child.\r\n\r\nThe backstory behind Pennywise’s existence is that he is some shape-shifting demon that emerges from the sewers only to target the unlucky rugrat in his immediate path while conniving, and conducting his blood-thirsty ways. However, there are a group of children that refuse to play dead for the demented clown and the quest to create an ill-advised showdown with the deplorable Pennywise would prove to be a very violent and mentally scarring experience in the process.\r\n\r\nThe story centres around young Bill (Jaeden Lieberher, ‘Allegiant’) and his early encounter with the sadness of unknowingly witnessing Pennywise’s wrath as it was inferred that the clown had to do with the demise of his precious little brother, George (Jackson Robert Scott), who never returned after enthusiastically wanting to work on a fun project in the basement. This haunting revelation sticks with poor Bill until this very day.\r\n\r\nNowadays, Bill must cope with the typical obstacles at school avoiding bullies and dealing with the pitfalls of peer pressure and needing to belong to a group of trusty associates. Thus, Bill is able to cement close relationships with the town’s other free-spirited youngsters. Still, there is that hovering myth about the mysterious sewers and, yes, the evil-minded Pennywise is at the forefront of fearful concern for Bill and the bunch. In fact, the gang will succumb to their collection of fears, paranoia and hesitation as the suburban legend of the creep-seeking clown clouds each of the kids’ tainted psyches.\r\n\r\nThe ensemble of young actors in **It**  all register accordingly with their characters’ childhood shock in trying to overcome the overwhelming and petrifying mindset that has invaded their sensibilities. Lieberher has an authentic raw turn as the lead lad invested in the bizarre boundaries of matching wits with the demonic chalk-skinned trickster and his committed craziness. The other supporting cast of exposed kiddies on this adventurous train wreck of terror includes Sophia Lillis (’37’), Finn Wolfhard (from television’s ‘Stranger Things’), Jeremy Ray Taylor (‘Alvin And The Chipmunks: The Road Chip’), Wyatt Oleff (‘Guardians Of The Galaxy”), Chosen Jacobs, Jack Dylan Grazer (‘Tales Of Halloween’) and Nicholas Hamilton (‘Captain Fantastic’).\r\n\r\nThere is no doubt that Skarsgard’s clown of corrosion in Pennywise steals the show with his nefarious nature blistering shamelessly in seedy-minded elation. Clearly, Skarsgard chews the tarnished scenery with his abominable costumed cretin tip toeing on the unassuming sidelines while striking gory goosebump moments for his pubescent prey on screen and the twitchy audience off screen.\r\n\r\nSure, **It** suffers from the conventional trappings of cheesy false alarm jolts and the obligatory lurking in the dark sequences are arbitrarily tossed in as an aftermath for the legitimate lunacy of our star-making crazed and corruptible clown to perform his showboating insanity. Besides, what horror showcase has not welcomed the invitation of the overused and abused jump-scare techniques highlighted by a jittery soundtrack? Still, Muschietti and screenwriters Chase Palmer, Cary Joji Funkunga and Gary Dauberman manage to supply the infectious and insidious **It** with well-executed scary shenanigans, well-paced anxiety, wavering vulnerability and decent acting on behalf of the performers that aptly brought to life the eerie visions and vitality of King’s complex, creative mind.\r\n\r\nTruly **It** is one of the best harrowing and in-depth horror/psychological thrillers to emerge in 2017. Also this titillating tale of cautionary kiddie chaos may be one of King’s formidable movie adaptions since the effective tension-filled, off-the-wall brilliance of 1990’s _Misery_.    \r\n\r\n**It** (2017)\r\n\r\nWarner Bros. Pictures and New Line Cinema\r\n\r\n1 hour 35 minutes\r\n\r\nCAST: Bill Skarsgard, Jaeden Lieberher, Sophia Lillis, Finn Wolfhard, Jeremy Ray Taylor, Wyatt Oleff, Chosen Jacobs, Nicholas Hamilton and Jack Dylan Grazer\r\n\r\nDIRECTOR: Andy Muschietti\r\n\r\nWRITERS: Chase Palmer, Cary Joji Funkunaga, Gary Dauberman\r\n\r\nMPAA Rating: R\r\n\r\nGENRE: Horror/Mystery & Suspense\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-09-30T18:04:20.111Z"}, {"movie_id": 346364, "review_id": "59d3d70bc3a36844e10033bf", "author_rating": 8.0, "review_text": "It is a movie that looked interesting, but I wasn't necessarily anticipating, because it had the potential to be awful. After seeing it, I can say that while it is good, I don't think it's nearly as good as other people are saying it is, and it had the potential to be. Starting off with the good, the film has some fantastic performances from the kids. I think the best performances in the film are from Andy Skaarsgard (or however you spell it) for Pennywise, and the kid who had asthma. I don't know his name, and I haven't seen him in anything before, but he stole the show. The movie also has some pretty scary moments. The scene inside of the house is one of the scariest scenes of the year, and there are lost of images that were genuinely disturbing. While the films was full of cheesy dialogue, the conversations between the kids are extremely entertaining and captivating. When it came to characters, MOST of the characters are well done and fleshed out. And that leads me to one of the 4 things that keep this film from being great in my eyes. Some characters, such as the bullies and Stan, and bland and have no back story. Therefore, whenever they are put in danger, it isn't nearly as scary as with other characters. Another reason I didn't love this film is the rock fight scene. Basically, the Losers Club stumbles upon the bullies and they throw rocks at each other. The rocks seemingly bounce off of their head without any problems like a trampoline. No one gets killed, or even knocked out. Overall, it was a very bad scene. For the most part the special effects were pretty good. However, the leper outside of the creepy house was awful. The costume would be great if it were for a haunted house or prank, but not for a big budgeted horror movie. When it came on screen I literally thought it was a bully playing tricks on him. And the last problem I have with the film is that the police are seemingly nowhere, along with parents. *Mild spoilers* One of the bullies murders his dad, a police officer, and then around a few scenes later, the son dies too. The bullies like to go around thereatening kids with knives and carving H's into their bellies. I think we would see at least one police officer investegating something in the film, and if not, I think my parents would notice if one day I came home and there was a gigantic blood pool on my shirt. Overall, It is a very fun movie. There are certainly better movies out there, but with this, I have an urge to go watch it again in theaters. It is a perfectly fun popcorn flick.\r\n\r\nScore: 7.5/10", "created_at": "2017-10-03T18:29:31.449Z"}, {"movie_id": 346364, "review_id": "59dd94d49251412514085d45", "author_rating": 8.0, "review_text": "Great acting, memorable characters. One of the best (horror?) films I've watched.", "created_at": "2017-10-11T03:49:40.868Z"}, {"movie_id": 346364, "review_id": "64a58090a0be2800cbf67953", "author_rating": 10.0, "review_text": "Greatest remake of a movie ever made in my opinion. Even way scary then the original. Remade the death scenes way better as well. Love it!", "created_at": "2023-07-05T14:39:12.391Z"}]