[{"movie_id": 1858, "review_id": "6466399b006b0101684a932e", "author_rating": 6.0, "review_text": "With all the gazillion planets in the galaxy to choose from, the warring Cybertron races of \"Autobots\" (the sort of goodies) and \"Decepticons\" (the sort of baddies) descend on Earth in search of a missing cube. This \"allspark\" - landed on our planet aeons ago and for many years has been unwittingly in the custody of the always competent US military and their \"Section 7\" operatives - currently led by \"Simmons\" (John Turturro). Now it transpires that there is a clue to the location of this gizmo - and that is to be found on the spectacles of the grandfather of \"Sam\" (Shia LaBeouf), only he doesn't know it. The goodies decide to protect him by providing him with one of their number, the ultimate convertible car \"Bumblebee\" but that doesn't actually end up being much use as his bodyguard and soon poor old \"Sam\" and his gal \"Mikaela\" (the startlingly wooden Megan Fox) are embroiled in the action-packed Meccano movie. The star is easy on the eye and has a soupçon of charisma to bring, but otherwise this is just a shockingly derivative series of repetitive fight scenes featuring robots between whom it is almost impossible to distinguish. Their vocals all seem to involve them speaking into the microphone through an old pair of socks, and as it lurches on I gradually found I really couldn't care less whether the red robot beat the black one - you just know this is but the start of a never ending franchise with only two purposes. 1 - to restart the flagging career of Josh Duhamel and 2 - to sell toys, thousands and thousands of toys. Marketing has often been behind some of the most successful movie spin-offs, but somehow this is just a touch more cynical than the rest. The story is weak and the characterisations, such as they are, are about as deep as a hoof print. Plenty of pyrotechnics, though, but at all but 2½ hours long, this is a long old haul. Maybe if I were only twelve years old, but...", "created_at": "2023-05-18T14:43:39.092Z"}]