[{"movie_id": 551804, "review_id": "5facc8ca8a84d2003f28f754", "author_rating": 6.0, "review_text": "'Freaky' succeeds when it sticks to the serial killer/swapped bodies storyline, but its need to add emotional depth to this horror-comedy and tack on an extended cheap ending weakens the whole film. Come for the deadly kills and big laughs, but maybe get up before the final 10.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-freaky-get-your-freak-on", "created_at": "2020-11-12T05:31:54.545Z"}, {"movie_id": 551804, "review_id": "6015b076dd731b003d573339", "author_rating": 7.0, "review_text": "Fun horror-comedy akin to Happy Death Day (and would make for a good double header) with two amusing performances from Vince Vaughn and Kathryn Newton. It's a nice twist on the body-switching formula and even though has the cliches in terms of the high school aspect (such as the flamboyant gay best friend), still found it entertaining. **3.5/5**", "created_at": "2021-01-30T19:16:06.725Z"}, {"movie_id": 551804, "review_id": "6274728551c01f009da14e2f", "author_rating": 6.0, "review_text": "Kathryn Newton deserved better.\r\n\r\n<em>'Freaky'</em> is largely a (very) mixed bag, but Newton's performance is honestly superb - which makes it difficult to rate. On the one hand you have a fairly run-of-the-mill slasher, yet on the other Newton's showing is of such quality that it belongs in something far greater. She's top notch here, it's just severely unfortunate the film is nowhere near her level at all.\r\n\r\nThere are a few decent slasher-y moments and Vince Vaughn tries. Speaking of Vaughn, it's neat to see a different side to him as an actor but I found him to be 50/50 in this; he kills it (pardon the pun) in some parts, but in others it's clear he's trying to impersonate a teenage girl - which is the complete opposite to Newton, who plays two characters supremely well.\r\n\r\nI know I'm repeating myself, but... in layman's terms: Newton good, film bad.", "created_at": "2022-05-06T00:57:41.886Z"}, {"movie_id": 551804, "review_id": "62bdf83a3679a10061e55948", "author_rating": 5.0, "review_text": "Freaky is a self-aware horror comedy spin on the classic film Freaky Friday (hence the name freaky). The slasher elements are extremely present, and I loved the shades of Friday the 13th with the Jason style killer and the sharp music, reminiscent of the original F13 score, playing during his scenes. The kills are incredibly brutal and really earn the R rating, some are very creative while others are the run of the mill horror kills. While watching this movie I could not help but feel bored at times. There were some definite lulls that could have been sharpened up for a tighter movie viewing experience.\r\nI understand that the movie was self-aware and poked fun at a lot of horror tropes, bult I felt as if they went a little too overboard. There were some scenes of bullying that just felt so unbelievable and over the top that it really pulled me out of the film even though I understood it was being satirical. The acting overall was pretty good, some lines were delivered awkwardly but nothing that was too consistent to harm the experience. Vince Vaughn is fantastic in this movie, and when that switch happens, he really sells that he is a high school girl in a killer's body with his girly movements and dialect.\r\nOverall, I had a fun time with the movie, but there were quite a few elements that really hold it back.\r\n\r\n**Verdict:** _Decent_", "created_at": "2022-06-30T19:23:38.947Z"}]