[{"movie_id": 440161, "review_id": "5c446c820e0a266d66d354a5", "author_rating": 5.0, "review_text": "Certainly the better of the two Westerns I've seen today, but I'm also not really feeling the love with _Sisters Brothers_ like everybody else seems to be.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T12:41:38.605Z"}, {"movie_id": 440161, "review_id": "5d5d8a426743fa00137029fe", "author_rating": 5.0, "review_text": "_**A plodding and overlong tale of violence and redemption that doesn't seem to know quite what it's trying to say**_\r\n\r\n> _You are afraid of hell. But that's all religion is, really. Fear of a place we'd rather not be, and where there's no such a thing as suicide to steal us away._\r\n\r\n- Patrick deWitt; _The Sisters Brothers_ (2011)\r\n\r\n_The Sisters Brothers_ is a film set in the American Old West, based on a book by a Canadian, made by a mostly French crew, shot primarily in Spain and Romania, featuring a Brit as an American, an American as a Brit, and a British trans comedian as a ruthless American businesswoman. And I don't bring this up out of mere frivolousness; rather, a certain element of schizophrenia is built into the film's very DNA. On the surface it's a Revisionist Western with a gritty Spaghetti aesthetic focusing very much on a group of anti-heroes, but it's also a story of two brothers getting on one another's nerves, a tale of avarice and the destructive potential of progressive thinking, a chase movie, a dark comedy, a tragic fable, an examination of the days when the Old West was giving way to an ever-encroaching modernity, a look at how the sins of the father are oft repeated by the children, a study of competing types of masculinity, and even a political thesis, postulating that there was a time in American history when certain people genuinely believed they could build a harmonious society based on direct democracy and the kind of socialist attitude to capitalism that would make even Bernie Sanders blush.\r\n\r\nThe English language debut of French director Jacques Audiard, who adapted the script with his regular writing partner Thomas Bidegain from Patrick deWitt's 2011 novel of the same name, the film posits that even those who seem irredeemable may one day find a path to redemption. Very much of a piece with Audiard's more celebrated humanist work such as _De battre mon cœur s'est arrêté_ (2005), _Un prophète_ (2009), and _Dheepan_ (2015), _The Sisters Brothers_ works primarily as a character study about people trying to do what they feel is right in a world arrayed against them. Unfortunately, it did next-to-nothing for me. I wouldn't say it's a bad movie, as it clearly has a lot going for it; not the least of which is an unapologetic foregrounding of character over plot. However, its episodic rhythm, bifurcated narrative structure, and poorly-defined morality left me unengaged, frustrated, and rather bored.\r\n\r\n1851; the height of the California Gold Rush. In Oregon, Charlie Sisters (Joaquin Phoenix) and his older brother Eli (John C. Reilly) are hired guns working for \"The Commodore\" (a criminally underused Rutger Hauer). Far more sensitive and thoughtful than his younger brother, Eli is growing weary of the lifestyle, wanting to retire, settle down, and open a grocery store. The more unpredictable and volatile Charlie, however, wants to keep on killing indefinitely. After a mission descends into disarray, Eli is unimpressed when The Commodore appoints Charlie as \"lead man\" for their next quarry; a mild-manner chemist named Hermann Kermit Warm (Riz Ahmed). Telling Eli that Warm has stolen something from The Commodore which they are to retrieve, Charlie is under orders to keep their real purpose to himself for the time being. Unsure of Warm's exact location, The Commodore has already sent highly-intelligent tracker John Morris (Jake Gyllenhaal), a man too gentile for killing, to pick up his trail and detain him until the brothers catch up. Keeping them abreast of his progress via a series of letters, it doesn't take long for Morris to find Warm, telling the brothers he will await them in Jacksonville. However, when Warm learns that The Commodore has sent men after him, he explains to Morris that he has created an elixir that when poured into a river, will illuminate any gold deposits on the river bed, with the only catch being that the potion is extremely caustic, and any sustained exposure results in severe burns. Recognising that Morris is only an advance, he guesses that whoever is still to come is under orders to torture the formula out of him and then kill him. Learning that Warm doesn't want to use the gold for himself, but to help establish \"_an ideal living space, ruled by the laws of true democracy and sharing_\", Morris decides to join him, and they head to San Francisco in an attempt to evade the approaching brothers.\r\n\r\nA passion project for star and producer John C. Reilly, who purchased the rights to deWitt's novel shortly after it was published, it was he who first brought the material to Audiard's attention. One of the best-reviewed films at the 2018 Venice Film Festival, where it won Audiard his first Silver Lion for Best Director, when the film went on general release in North America later the same month, it flopped badly, earning only $3 million against a $38 million budget. That's a shame, as Audiard is immensely talented, and although I personally didn't enjoy this particular film, he deserves as much success as he can get. In terms of the novel, I don't know a huge amount about it, but I would imagine Warm's desire to build a Phalanstère in Dallas is inspired by La Réunion, a Fourierist-based utopian community founded in 1855 by Victor Prosper Considerant on the banks of the Trinity River. Wishing to make La Réunion a \"communal experiment administered by a system of direct democracy\", Considerant planned to allow participants to share in profits from capital investments. However, the settlement lasted only 18 months before financial insolvency, shortage of skilled participants, inadequate farming methods, and untenable maintenance costs led to its dissolution.\r\n\r\nAs one would expect from Audiard, working with his regular editor Juliette Welfling (_Le scaphandre et le papillon_; _The Hunger Games_; _Ocean's 8_) and production designer Michel Barthélémy (_Dobermann_; _Les salauds_; _Frantz_) and for the first time with cinematographer Benoît Debie (_Irréversible_; _Lost River_; _One More Time with Feeling_) and costume designer Milena Canonero (_Barry Lyndon_; _Chariots of Fire_; _The Grand Budapest Hotel_), the film looks amazing. Very much adopting the visual style of a Spaghetti Western, everything on screen looks dirty and/or dusty, whether it's the worn and lived-in costumes, the spartan and uncared for buildings, or even the perpetually unshaven characters and their rotting teeth (an historically accurate detail absent in most modern westerns). Of particular note are the shootouts, of which there are three significant examples. The first takes place at night, and is shot from a distance and without much in the way of coverage; the second is shot primarily from the point of view of two characters doing their best to hide; and the third isn't seen at all - we remain inside as the shooting can be heard on the street.\r\n\r\nThis should convey, as well as anything, just how revisionist _The Sisters Brothers_ is; the genre's tropes are all there, but they're examined from unexpected angles. A bear attack on a camp is not only not seen, it's not even heard, with our first indication of the incident being when one character wakes up to find another has shot and killed a bear during the night; men are seen riding horses, but when a horse is mortally wounded, the man to whom he belongs cries and apologises; whisky is drunk aplenty, but one character would rather sit alone thinking about home than go whoring or drinking; a film about hired guns ends on a shot of a man sitting in a bath; the anticipated climatic shootout plays out in a manner you'll never see coming. If it does nothing else, the film really drives home that to be able to truly subvert generic tropes, one must first understand and respect how those tropes work.\r\n\r\nThe film opens with an extraordinarily beautiful and striking scene. It's night on the prairie, which is so dark, we can make out only the barest outline of a house, with a smaller building nearby. After some shouted dialogue, a shootout begins between the house and the smaller building, with each booming gun blast sending out sparks and illuminating for a micro-second the surrounding area. Having vanquished their opponents, the brothers are about to leave the area, when they see a horse, its back covered in flames, galloping away, trying to outrun the fire from which it doesn't understand it can never escape. Realising the barn is on fire, Eli dashes in to try to save the trapped horses, whilst Charlie urges him to remain outside. Is the metaphor of the burning horse a little on the nose? Absolutely; try as they might, the brothers can never escape that which brings them pain, no matter how far or fast they run. But just because it's not exactly subtle doesn't mean it's ineffective, and as opening visual metaphors go, it's as striking an example as you're likely to find. The scene also immediately establishes the differences between Eli (who would risk his own life to save a group of horses) and Charlie (who sees no point in such sacrifices).\r\n\r\nIn relation to the _milieu_, yes, this is the Old West of John Ford, Anthony Mann, and Sergio Leone, but Audiard defamiliarises it as much as possible. A recurring theme, for example, is that this is a world on the brink of modernity, but whose inhabitants are still very much rooted in the past. This is depicted via a running gag about Eli's fascination with a curious modern invention (the toothbrush; so complicated a device, it comes with an instruction manual), and his childlike glee at staying in a hotel with indoor plumbing. Elsewhere, Morris remarks on how quickly the country is changing, writing, \"_I have travelled through places that didn't exist three months ago. First tents, then houses, then shops, with women fiercely discussing the price of flour._\" Additionally, Warm's progressive egalitarian vision for the future and his desire to use his formula to create a better society for all, allows the film to examine the belief (however short-lived) that out of the lawlessness, land thievery, and Native American genocide, a certain section of the populace hoped a more mutually beneficial society might arise.\r\n\r\nHowever, Audiard, of course, is not naïve enough to suggest that the Old West was especially peaceful or safe; although on the cusp of modernity, this is still a merciless place where violence is a form of currency. But even here, he subverts the genre, using a recurring motif of either Charlie or Eli shooting an already downed opponent pleading for his life, which is certainly not what we've come to expect from the (figurative) white hat protagonists so familiar in Hollywood westerns. Coupled with this, there's the ever-present background of the Gold Rush, and the mercenary mentality it fostered. Indeed, the whole plot is set in motion by The Commodore's greed, and as the film goes on, it comes to focus more and more on the clash between a Darwinian survival of the fittest, might is right mentality (represented by Charlie) and a more esoteric and politically progressive way of thinking (represented by Warm), with Eli and Morris functioning as something of a halfway house between the two extremes.\r\n\r\nIn terms of acting, Phoenix, Gyllenhaal, and Ahmed all have moments to shine (a monologue in which Morris describes his hatred for his father is especially worth looking out for), but this is Reilly's film through-and-through, turning Eli from a possibly oafish sidekick into an achingly human emotional fulcrum. His nuanced performance allows us to see just how badly Eli's conscience is affecting him, and how much he is drifting away from the increasingly amoral Charlie. Eli has no desire to split with Charlie, but he is slowly coming to the conclusion that he may have no option but to do just that. It's an extraordinarily subtle performance by Reilly, that reminded me a lot of his work in Paul Thomas Anderson's _Magnolia_ (1999), where he played a cop in love with a drug addict who shows unexpected emotional vulnerability, and Rob Marshall's _Chicago_ (2002), in which he played the dim but loyal-to-a-fault husband who emerges as the film's only really moral character. His unexpected affection for his horse is especially poignant, and his tendency to sniff a shawl given to him by his girlfriend is beautifully played by Reilly.\r\n\r\nHowever, for all this, I really disliked the movie, for a myriad of reasons. For one, I found it far too episodic, lurching from one incident to next with little in the way of connective tissue between them. I also didn't particularly like the shifts in focus from the brothers on the one hand to Morris and Warm on the other, with each strand serving only to detract from the other, making it impossible for either to fully settle. A knock-on from this is that the film lacks a strong lead character; although everything suggests that Eli is the protagonist, Phoenix is billed above Reilly, and a lot of the time, Eli seems more like Charlie's sidekick than his equal, making it difficult to figure out where one's empathy is supposed to lie. This difficulty becomes especially problematic in relation to the morally questionable _dénouement_, in which there is an incident which seems designed for the audience to roundly condemn one of the main characters, only for the film to then give us a 15-minute epilogue seemingly designed to redeem him.\r\n\r\nThis throws into relief what for me was the most egregious problem - none of what we see seems to mean anything, there are virtually no consequences for anything the brothers do (although plenty of consequences for others). This left me scratching my head as to what the film is trying to say. Is it suggesting that even the most morally repugnant of men deserve a shot at redemption? If that is the case, however, its rhetorical position is not especially cogent, as the character mentioned above in no way deserves redemption, allowing his greed and stubbornness to cause untold suffering to others whilst he gets off relatively scot-free. Furthermore, the aforementioned epilogue is hugely anticlimactic, which, I understand, is kind of the point, but it's still a very strange way to wrap things up, feeling forced and emotionally manipulative, completely out of tonal and thematic pace with the rest of the film, and also undermining what could have been a deeply affecting bittersweet final scene. The film is also far too long, and could easily have lost a half hour or more, with the meandering plot becoming interminably boring on more than one occasion.\r\n\r\nAs a kind of an aside, it's also worth mentioning an aesthetic decision that has me baffled. On occasion, the film is shot within a circular frame (think of how films often simulate POV through a telescope), often combined with racked focus and unsteady photography. I'm assuming the idea is to try to replicate the style of a Kinetograph, but given that device wouldn't be invented for another four decades, I'm not entirely sure what the point is, as the scenes which employ the style don't seem to contain anything to justify the usage. An especially strange example is a scene which sees Charlie speaking direct-to-camera, the only example of such in the whole film. Is this a break in the fourth wall, and if so, why? If it isn't a break, from whose POV is the scene shot? This kind of unjustified visual trickery pulls you right out of the film and offers next-to-nothing in the way of thematic compensation.\r\n\r\nThe four performances at the heart of _The Sisters Brothers_ earn it a great deal of leeway. But even taking that into account, I just couldn't get into it. Far too plodding and thematically unfocused, although I initially liked the characters a great deal, by the last act, I just wanted it to end already. It's certainly original in how it approaches a number of generic tropes, and that's to be commended, but the imprecise and poorly constructed episodic narrative saps away the goodwill built up by the aesthetic design and the acting. Is it a western? A comedy? A tragedy? An esoteric political piece? A realist depiction of greed trumping idealism? In the end, it doesn't seem to know itself, trying to be many things, and ending up being none of them.", "created_at": "2019-08-21T18:15:30.337Z"}, {"movie_id": 440161, "review_id": "64ce9728d9f4a603b6c888ec", "author_rating": 1.0, "review_text": "I was looking forward to this. It has two of my favorite actors in it. Unfortunately, I had to give up on watching it. It's impossible to see what's going on. There are some shadows moving about, sometimes covering each other. A dot lights up occasionally on my 55-inch OLED. I can see subtitles, hear the sound. This is apparently one of those \"someone invented HDR, that means we should put a cloth over the lens\" kind of movies. Such a shame.", "created_at": "2023-08-05T18:38:32.497Z"}, {"movie_id": 440161, "review_id": "5c446c820e0a266d66d354a5", "author_rating": 5.0, "review_text": "Certainly the better of the two Westerns I've seen today, but I'm also not really feeling the love with _Sisters Brothers_ like everybody else seems to be.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T12:41:38.605Z"}, {"movie_id": 440161, "review_id": "5d5d8a426743fa00137029fe", "author_rating": 5.0, "review_text": "_**A plodding and overlong tale of violence and redemption that doesn't seem to know quite what it's trying to say**_\r\n\r\n> _You are afraid of hell. But that's all religion is, really. Fear of a place we'd rather not be, and where there's no such a thing as suicide to steal us away._\r\n\r\n- Patrick deWitt; _The Sisters Brothers_ (2011)\r\n\r\n_The Sisters Brothers_ is a film set in the American Old West, based on a book by a Canadian, made by a mostly French crew, shot primarily in Spain and Romania, featuring a Brit as an American, an American as a Brit, and a British trans comedian as a ruthless American businesswoman. And I don't bring this up out of mere frivolousness; rather, a certain element of schizophrenia is built into the film's very DNA. On the surface it's a Revisionist Western with a gritty Spaghetti aesthetic focusing very much on a group of anti-heroes, but it's also a story of two brothers getting on one another's nerves, a tale of avarice and the destructive potential of progressive thinking, a chase movie, a dark comedy, a tragic fable, an examination of the days when the Old West was giving way to an ever-encroaching modernity, a look at how the sins of the father are oft repeated by the children, a study of competing types of masculinity, and even a political thesis, postulating that there was a time in American history when certain people genuinely believed they could build a harmonious society based on direct democracy and the kind of socialist attitude to capitalism that would make even Bernie Sanders blush.\r\n\r\nThe English language debut of French director Jacques Audiard, who adapted the script with his regular writing partner Thomas Bidegain from Patrick deWitt's 2011 novel of the same name, the film posits that even those who seem irredeemable may one day find a path to redemption. Very much of a piece with Audiard's more celebrated humanist work such as _De battre mon cœur s'est arrêté_ (2005), _Un prophète_ (2009), and _Dheepan_ (2015), _The Sisters Brothers_ works primarily as a character study about people trying to do what they feel is right in a world arrayed against them. Unfortunately, it did next-to-nothing for me. I wouldn't say it's a bad movie, as it clearly has a lot going for it; not the least of which is an unapologetic foregrounding of character over plot. However, its episodic rhythm, bifurcated narrative structure, and poorly-defined morality left me unengaged, frustrated, and rather bored.\r\n\r\n1851; the height of the California Gold Rush. In Oregon, Charlie Sisters (Joaquin Phoenix) and his older brother Eli (John C. Reilly) are hired guns working for \"The Commodore\" (a criminally underused Rutger Hauer). Far more sensitive and thoughtful than his younger brother, Eli is growing weary of the lifestyle, wanting to retire, settle down, and open a grocery store. The more unpredictable and volatile Charlie, however, wants to keep on killing indefinitely. After a mission descends into disarray, Eli is unimpressed when The Commodore appoints Charlie as \"lead man\" for their next quarry; a mild-manner chemist named Hermann Kermit Warm (Riz Ahmed). Telling Eli that Warm has stolen something from The Commodore which they are to retrieve, Charlie is under orders to keep their real purpose to himself for the time being. Unsure of Warm's exact location, The Commodore has already sent highly-intelligent tracker John Morris (Jake Gyllenhaal), a man too gentile for killing, to pick up his trail and detain him until the brothers catch up. Keeping them abreast of his progress via a series of letters, it doesn't take long for Morris to find Warm, telling the brothers he will await them in Jacksonville. However, when Warm learns that The Commodore has sent men after him, he explains to Morris that he has created an elixir that when poured into a river, will illuminate any gold deposits on the river bed, with the only catch being that the potion is extremely caustic, and any sustained exposure results in severe burns. Recognising that Morris is only an advance, he guesses that whoever is still to come is under orders to torture the formula out of him and then kill him. Learning that Warm doesn't want to use the gold for himself, but to help establish \"_an ideal living space, ruled by the laws of true democracy and sharing_\", Morris decides to join him, and they head to San Francisco in an attempt to evade the approaching brothers.\r\n\r\nA passion project for star and producer John C. Reilly, who purchased the rights to deWitt's novel shortly after it was published, it was he who first brought the material to Audiard's attention. One of the best-reviewed films at the 2018 Venice Film Festival, where it won Audiard his first Silver Lion for Best Director, when the film went on general release in North America later the same month, it flopped badly, earning only $3 million against a $38 million budget. That's a shame, as Audiard is immensely talented, and although I personally didn't enjoy this particular film, he deserves as much success as he can get. In terms of the novel, I don't know a huge amount about it, but I would imagine Warm's desire to build a Phalanstère in Dallas is inspired by La Réunion, a Fourierist-based utopian community founded in 1855 by Victor Prosper Considerant on the banks of the Trinity River. Wishing to make La Réunion a \"communal experiment administered by a system of direct democracy\", Considerant planned to allow participants to share in profits from capital investments. However, the settlement lasted only 18 months before financial insolvency, shortage of skilled participants, inadequate farming methods, and untenable maintenance costs led to its dissolution.\r\n\r\nAs one would expect from Audiard, working with his regular editor Juliette Welfling (_Le scaphandre et le papillon_; _The Hunger Games_; _Ocean's 8_) and production designer Michel Barthélémy (_Dobermann_; _Les salauds_; _Frantz_) and for the first time with cinematographer Benoît Debie (_Irréversible_; _Lost River_; _One More Time with Feeling_) and costume designer Milena Canonero (_Barry Lyndon_; _Chariots of Fire_; _The Grand Budapest Hotel_), the film looks amazing. Very much adopting the visual style of a Spaghetti Western, everything on screen looks dirty and/or dusty, whether it's the worn and lived-in costumes, the spartan and uncared for buildings, or even the perpetually unshaven characters and their rotting teeth (an historically accurate detail absent in most modern westerns). Of particular note are the shootouts, of which there are three significant examples. The first takes place at night, and is shot from a distance and without much in the way of coverage; the second is shot primarily from the point of view of two characters doing their best to hide; and the third isn't seen at all - we remain inside as the shooting can be heard on the street.\r\n\r\nThis should convey, as well as anything, just how revisionist _The Sisters Brothers_ is; the genre's tropes are all there, but they're examined from unexpected angles. A bear attack on a camp is not only not seen, it's not even heard, with our first indication of the incident being when one character wakes up to find another has shot and killed a bear during the night; men are seen riding horses, but when a horse is mortally wounded, the man to whom he belongs cries and apologises; whisky is drunk aplenty, but one character would rather sit alone thinking about home than go whoring or drinking; a film about hired guns ends on a shot of a man sitting in a bath; the anticipated climatic shootout plays out in a manner you'll never see coming. If it does nothing else, the film really drives home that to be able to truly subvert generic tropes, one must first understand and respect how those tropes work.\r\n\r\nThe film opens with an extraordinarily beautiful and striking scene. It's night on the prairie, which is so dark, we can make out only the barest outline of a house, with a smaller building nearby. After some shouted dialogue, a shootout begins between the house and the smaller building, with each booming gun blast sending out sparks and illuminating for a micro-second the surrounding area. Having vanquished their opponents, the brothers are about to leave the area, when they see a horse, its back covered in flames, galloping away, trying to outrun the fire from which it doesn't understand it can never escape. Realising the barn is on fire, Eli dashes in to try to save the trapped horses, whilst Charlie urges him to remain outside. Is the metaphor of the burning horse a little on the nose? Absolutely; try as they might, the brothers can never escape that which brings them pain, no matter how far or fast they run. But just because it's not exactly subtle doesn't mean it's ineffective, and as opening visual metaphors go, it's as striking an example as you're likely to find. The scene also immediately establishes the differences between Eli (who would risk his own life to save a group of horses) and Charlie (who sees no point in such sacrifices).\r\n\r\nIn relation to the _milieu_, yes, this is the Old West of John Ford, Anthony Mann, and Sergio Leone, but Audiard defamiliarises it as much as possible. A recurring theme, for example, is that this is a world on the brink of modernity, but whose inhabitants are still very much rooted in the past. This is depicted via a running gag about Eli's fascination with a curious modern invention (the toothbrush; so complicated a device, it comes with an instruction manual), and his childlike glee at staying in a hotel with indoor plumbing. Elsewhere, Morris remarks on how quickly the country is changing, writing, \"_I have travelled through places that didn't exist three months ago. First tents, then houses, then shops, with women fiercely discussing the price of flour._\" Additionally, Warm's progressive egalitarian vision for the future and his desire to use his formula to create a better society for all, allows the film to examine the belief (however short-lived) that out of the lawlessness, land thievery, and Native American genocide, a certain section of the populace hoped a more mutually beneficial society might arise.\r\n\r\nHowever, Audiard, of course, is not naïve enough to suggest that the Old West was especially peaceful or safe; although on the cusp of modernity, this is still a merciless place where violence is a form of currency. But even here, he subverts the genre, using a recurring motif of either Charlie or Eli shooting an already downed opponent pleading for his life, which is certainly not what we've come to expect from the (figurative) white hat protagonists so familiar in Hollywood westerns. Coupled with this, there's the ever-present background of the Gold Rush, and the mercenary mentality it fostered. Indeed, the whole plot is set in motion by The Commodore's greed, and as the film goes on, it comes to focus more and more on the clash between a Darwinian survival of the fittest, might is right mentality (represented by Charlie) and a more esoteric and politically progressive way of thinking (represented by Warm), with Eli and Morris functioning as something of a halfway house between the two extremes.\r\n\r\nIn terms of acting, Phoenix, Gyllenhaal, and Ahmed all have moments to shine (a monologue in which Morris describes his hatred for his father is especially worth looking out for), but this is Reilly's film through-and-through, turning Eli from a possibly oafish sidekick into an achingly human emotional fulcrum. His nuanced performance allows us to see just how badly Eli's conscience is affecting him, and how much he is drifting away from the increasingly amoral Charlie. Eli has no desire to split with Charlie, but he is slowly coming to the conclusion that he may have no option but to do just that. It's an extraordinarily subtle performance by Reilly, that reminded me a lot of his work in Paul Thomas Anderson's _Magnolia_ (1999), where he played a cop in love with a drug addict who shows unexpected emotional vulnerability, and Rob Marshall's _Chicago_ (2002), in which he played the dim but loyal-to-a-fault husband who emerges as the film's only really moral character. His unexpected affection for his horse is especially poignant, and his tendency to sniff a shawl given to him by his girlfriend is beautifully played by Reilly.\r\n\r\nHowever, for all this, I really disliked the movie, for a myriad of reasons. For one, I found it far too episodic, lurching from one incident to next with little in the way of connective tissue between them. I also didn't particularly like the shifts in focus from the brothers on the one hand to Morris and Warm on the other, with each strand serving only to detract from the other, making it impossible for either to fully settle. A knock-on from this is that the film lacks a strong lead character; although everything suggests that Eli is the protagonist, Phoenix is billed above Reilly, and a lot of the time, Eli seems more like Charlie's sidekick than his equal, making it difficult to figure out where one's empathy is supposed to lie. This difficulty becomes especially problematic in relation to the morally questionable _dénouement_, in which there is an incident which seems designed for the audience to roundly condemn one of the main characters, only for the film to then give us a 15-minute epilogue seemingly designed to redeem him.\r\n\r\nThis throws into relief what for me was the most egregious problem - none of what we see seems to mean anything, there are virtually no consequences for anything the brothers do (although plenty of consequences for others). This left me scratching my head as to what the film is trying to say. Is it suggesting that even the most morally repugnant of men deserve a shot at redemption? If that is the case, however, its rhetorical position is not especially cogent, as the character mentioned above in no way deserves redemption, allowing his greed and stubbornness to cause untold suffering to others whilst he gets off relatively scot-free. Furthermore, the aforementioned epilogue is hugely anticlimactic, which, I understand, is kind of the point, but it's still a very strange way to wrap things up, feeling forced and emotionally manipulative, completely out of tonal and thematic pace with the rest of the film, and also undermining what could have been a deeply affecting bittersweet final scene. The film is also far too long, and could easily have lost a half hour or more, with the meandering plot becoming interminably boring on more than one occasion.\r\n\r\nAs a kind of an aside, it's also worth mentioning an aesthetic decision that has me baffled. On occasion, the film is shot within a circular frame (think of how films often simulate POV through a telescope), often combined with racked focus and unsteady photography. I'm assuming the idea is to try to replicate the style of a Kinetograph, but given that device wouldn't be invented for another four decades, I'm not entirely sure what the point is, as the scenes which employ the style don't seem to contain anything to justify the usage. An especially strange example is a scene which sees Charlie speaking direct-to-camera, the only example of such in the whole film. Is this a break in the fourth wall, and if so, why? If it isn't a break, from whose POV is the scene shot? This kind of unjustified visual trickery pulls you right out of the film and offers next-to-nothing in the way of thematic compensation.\r\n\r\nThe four performances at the heart of _The Sisters Brothers_ earn it a great deal of leeway. But even taking that into account, I just couldn't get into it. Far too plodding and thematically unfocused, although I initially liked the characters a great deal, by the last act, I just wanted it to end already. It's certainly original in how it approaches a number of generic tropes, and that's to be commended, but the imprecise and poorly constructed episodic narrative saps away the goodwill built up by the aesthetic design and the acting. Is it a western? A comedy? A tragedy? An esoteric political piece? A realist depiction of greed trumping idealism? In the end, it doesn't seem to know itself, trying to be many things, and ending up being none of them.", "created_at": "2019-08-21T18:15:30.337Z"}, {"movie_id": 440161, "review_id": "64ce9728d9f4a603b6c888ec", "author_rating": 1.0, "review_text": "I was looking forward to this. It has two of my favorite actors in it. Unfortunately, I had to give up on watching it. It's impossible to see what's going on. There are some shadows moving about, sometimes covering each other. A dot lights up occasionally on my 55-inch OLED. I can see subtitles, hear the sound. This is apparently one of those \"someone invented HDR, that means we should put a cloth over the lens\" kind of movies. Such a shame.", "created_at": "2023-08-05T18:38:32.497Z"}, {"movie_id": 440161, "review_id": "5c446c820e0a266d66d354a5", "author_rating": 5.0, "review_text": "Certainly the better of the two Westerns I've seen today, but I'm also not really feeling the love with _Sisters Brothers_ like everybody else seems to be.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T12:41:38.605Z"}, {"movie_id": 440161, "review_id": "5d5d8a426743fa00137029fe", "author_rating": 5.0, "review_text": "_**A plodding and overlong tale of violence and redemption that doesn't seem to know quite what it's trying to say**_\r\n\r\n> _You are afraid of hell. But that's all religion is, really. Fear of a place we'd rather not be, and where there's no such a thing as suicide to steal us away._\r\n\r\n- Patrick deWitt; _The Sisters Brothers_ (2011)\r\n\r\n_The Sisters Brothers_ is a film set in the American Old West, based on a book by a Canadian, made by a mostly French crew, shot primarily in Spain and Romania, featuring a Brit as an American, an American as a Brit, and a British trans comedian as a ruthless American businesswoman. And I don't bring this up out of mere frivolousness; rather, a certain element of schizophrenia is built into the film's very DNA. On the surface it's a Revisionist Western with a gritty Spaghetti aesthetic focusing very much on a group of anti-heroes, but it's also a story of two brothers getting on one another's nerves, a tale of avarice and the destructive potential of progressive thinking, a chase movie, a dark comedy, a tragic fable, an examination of the days when the Old West was giving way to an ever-encroaching modernity, a look at how the sins of the father are oft repeated by the children, a study of competing types of masculinity, and even a political thesis, postulating that there was a time in American history when certain people genuinely believed they could build a harmonious society based on direct democracy and the kind of socialist attitude to capitalism that would make even Bernie Sanders blush.\r\n\r\nThe English language debut of French director Jacques Audiard, who adapted the script with his regular writing partner Thomas Bidegain from Patrick deWitt's 2011 novel of the same name, the film posits that even those who seem irredeemable may one day find a path to redemption. Very much of a piece with Audiard's more celebrated humanist work such as _De battre mon cœur s'est arrêté_ (2005), _Un prophète_ (2009), and _Dheepan_ (2015), _The Sisters Brothers_ works primarily as a character study about people trying to do what they feel is right in a world arrayed against them. Unfortunately, it did next-to-nothing for me. I wouldn't say it's a bad movie, as it clearly has a lot going for it; not the least of which is an unapologetic foregrounding of character over plot. However, its episodic rhythm, bifurcated narrative structure, and poorly-defined morality left me unengaged, frustrated, and rather bored.\r\n\r\n1851; the height of the California Gold Rush. In Oregon, Charlie Sisters (Joaquin Phoenix) and his older brother Eli (John C. Reilly) are hired guns working for \"The Commodore\" (a criminally underused Rutger Hauer). Far more sensitive and thoughtful than his younger brother, Eli is growing weary of the lifestyle, wanting to retire, settle down, and open a grocery store. The more unpredictable and volatile Charlie, however, wants to keep on killing indefinitely. After a mission descends into disarray, Eli is unimpressed when The Commodore appoints Charlie as \"lead man\" for their next quarry; a mild-manner chemist named Hermann Kermit Warm (Riz Ahmed). Telling Eli that Warm has stolen something from The Commodore which they are to retrieve, Charlie is under orders to keep their real purpose to himself for the time being. Unsure of Warm's exact location, The Commodore has already sent highly-intelligent tracker John Morris (Jake Gyllenhaal), a man too gentile for killing, to pick up his trail and detain him until the brothers catch up. Keeping them abreast of his progress via a series of letters, it doesn't take long for Morris to find Warm, telling the brothers he will await them in Jacksonville. However, when Warm learns that The Commodore has sent men after him, he explains to Morris that he has created an elixir that when poured into a river, will illuminate any gold deposits on the river bed, with the only catch being that the potion is extremely caustic, and any sustained exposure results in severe burns. Recognising that Morris is only an advance, he guesses that whoever is still to come is under orders to torture the formula out of him and then kill him. Learning that Warm doesn't want to use the gold for himself, but to help establish \"_an ideal living space, ruled by the laws of true democracy and sharing_\", Morris decides to join him, and they head to San Francisco in an attempt to evade the approaching brothers.\r\n\r\nA passion project for star and producer John C. Reilly, who purchased the rights to deWitt's novel shortly after it was published, it was he who first brought the material to Audiard's attention. One of the best-reviewed films at the 2018 Venice Film Festival, where it won Audiard his first Silver Lion for Best Director, when the film went on general release in North America later the same month, it flopped badly, earning only $3 million against a $38 million budget. That's a shame, as Audiard is immensely talented, and although I personally didn't enjoy this particular film, he deserves as much success as he can get. In terms of the novel, I don't know a huge amount about it, but I would imagine Warm's desire to build a Phalanstère in Dallas is inspired by La Réunion, a Fourierist-based utopian community founded in 1855 by Victor Prosper Considerant on the banks of the Trinity River. Wishing to make La Réunion a \"communal experiment administered by a system of direct democracy\", Considerant planned to allow participants to share in profits from capital investments. However, the settlement lasted only 18 months before financial insolvency, shortage of skilled participants, inadequate farming methods, and untenable maintenance costs led to its dissolution.\r\n\r\nAs one would expect from Audiard, working with his regular editor Juliette Welfling (_Le scaphandre et le papillon_; _The Hunger Games_; _Ocean's 8_) and production designer Michel Barthélémy (_Dobermann_; _Les salauds_; _Frantz_) and for the first time with cinematographer Benoît Debie (_Irréversible_; _Lost River_; _One More Time with Feeling_) and costume designer Milena Canonero (_Barry Lyndon_; _Chariots of Fire_; _The Grand Budapest Hotel_), the film looks amazing. Very much adopting the visual style of a Spaghetti Western, everything on screen looks dirty and/or dusty, whether it's the worn and lived-in costumes, the spartan and uncared for buildings, or even the perpetually unshaven characters and their rotting teeth (an historically accurate detail absent in most modern westerns). Of particular note are the shootouts, of which there are three significant examples. The first takes place at night, and is shot from a distance and without much in the way of coverage; the second is shot primarily from the point of view of two characters doing their best to hide; and the third isn't seen at all - we remain inside as the shooting can be heard on the street.\r\n\r\nThis should convey, as well as anything, just how revisionist _The Sisters Brothers_ is; the genre's tropes are all there, but they're examined from unexpected angles. A bear attack on a camp is not only not seen, it's not even heard, with our first indication of the incident being when one character wakes up to find another has shot and killed a bear during the night; men are seen riding horses, but when a horse is mortally wounded, the man to whom he belongs cries and apologises; whisky is drunk aplenty, but one character would rather sit alone thinking about home than go whoring or drinking; a film about hired guns ends on a shot of a man sitting in a bath; the anticipated climatic shootout plays out in a manner you'll never see coming. If it does nothing else, the film really drives home that to be able to truly subvert generic tropes, one must first understand and respect how those tropes work.\r\n\r\nThe film opens with an extraordinarily beautiful and striking scene. It's night on the prairie, which is so dark, we can make out only the barest outline of a house, with a smaller building nearby. After some shouted dialogue, a shootout begins between the house and the smaller building, with each booming gun blast sending out sparks and illuminating for a micro-second the surrounding area. Having vanquished their opponents, the brothers are about to leave the area, when they see a horse, its back covered in flames, galloping away, trying to outrun the fire from which it doesn't understand it can never escape. Realising the barn is on fire, Eli dashes in to try to save the trapped horses, whilst Charlie urges him to remain outside. Is the metaphor of the burning horse a little on the nose? Absolutely; try as they might, the brothers can never escape that which brings them pain, no matter how far or fast they run. But just because it's not exactly subtle doesn't mean it's ineffective, and as opening visual metaphors go, it's as striking an example as you're likely to find. The scene also immediately establishes the differences between Eli (who would risk his own life to save a group of horses) and Charlie (who sees no point in such sacrifices).\r\n\r\nIn relation to the _milieu_, yes, this is the Old West of John Ford, Anthony Mann, and Sergio Leone, but Audiard defamiliarises it as much as possible. A recurring theme, for example, is that this is a world on the brink of modernity, but whose inhabitants are still very much rooted in the past. This is depicted via a running gag about Eli's fascination with a curious modern invention (the toothbrush; so complicated a device, it comes with an instruction manual), and his childlike glee at staying in a hotel with indoor plumbing. Elsewhere, Morris remarks on how quickly the country is changing, writing, \"_I have travelled through places that didn't exist three months ago. First tents, then houses, then shops, with women fiercely discussing the price of flour._\" Additionally, Warm's progressive egalitarian vision for the future and his desire to use his formula to create a better society for all, allows the film to examine the belief (however short-lived) that out of the lawlessness, land thievery, and Native American genocide, a certain section of the populace hoped a more mutually beneficial society might arise.\r\n\r\nHowever, Audiard, of course, is not naïve enough to suggest that the Old West was especially peaceful or safe; although on the cusp of modernity, this is still a merciless place where violence is a form of currency. But even here, he subverts the genre, using a recurring motif of either Charlie or Eli shooting an already downed opponent pleading for his life, which is certainly not what we've come to expect from the (figurative) white hat protagonists so familiar in Hollywood westerns. Coupled with this, there's the ever-present background of the Gold Rush, and the mercenary mentality it fostered. Indeed, the whole plot is set in motion by The Commodore's greed, and as the film goes on, it comes to focus more and more on the clash between a Darwinian survival of the fittest, might is right mentality (represented by Charlie) and a more esoteric and politically progressive way of thinking (represented by Warm), with Eli and Morris functioning as something of a halfway house between the two extremes.\r\n\r\nIn terms of acting, Phoenix, Gyllenhaal, and Ahmed all have moments to shine (a monologue in which Morris describes his hatred for his father is especially worth looking out for), but this is Reilly's film through-and-through, turning Eli from a possibly oafish sidekick into an achingly human emotional fulcrum. His nuanced performance allows us to see just how badly Eli's conscience is affecting him, and how much he is drifting away from the increasingly amoral Charlie. Eli has no desire to split with Charlie, but he is slowly coming to the conclusion that he may have no option but to do just that. It's an extraordinarily subtle performance by Reilly, that reminded me a lot of his work in Paul Thomas Anderson's _Magnolia_ (1999), where he played a cop in love with a drug addict who shows unexpected emotional vulnerability, and Rob Marshall's _Chicago_ (2002), in which he played the dim but loyal-to-a-fault husband who emerges as the film's only really moral character. His unexpected affection for his horse is especially poignant, and his tendency to sniff a shawl given to him by his girlfriend is beautifully played by Reilly.\r\n\r\nHowever, for all this, I really disliked the movie, for a myriad of reasons. For one, I found it far too episodic, lurching from one incident to next with little in the way of connective tissue between them. I also didn't particularly like the shifts in focus from the brothers on the one hand to Morris and Warm on the other, with each strand serving only to detract from the other, making it impossible for either to fully settle. A knock-on from this is that the film lacks a strong lead character; although everything suggests that Eli is the protagonist, Phoenix is billed above Reilly, and a lot of the time, Eli seems more like Charlie's sidekick than his equal, making it difficult to figure out where one's empathy is supposed to lie. This difficulty becomes especially problematic in relation to the morally questionable _dénouement_, in which there is an incident which seems designed for the audience to roundly condemn one of the main characters, only for the film to then give us a 15-minute epilogue seemingly designed to redeem him.\r\n\r\nThis throws into relief what for me was the most egregious problem - none of what we see seems to mean anything, there are virtually no consequences for anything the brothers do (although plenty of consequences for others). This left me scratching my head as to what the film is trying to say. Is it suggesting that even the most morally repugnant of men deserve a shot at redemption? If that is the case, however, its rhetorical position is not especially cogent, as the character mentioned above in no way deserves redemption, allowing his greed and stubbornness to cause untold suffering to others whilst he gets off relatively scot-free. Furthermore, the aforementioned epilogue is hugely anticlimactic, which, I understand, is kind of the point, but it's still a very strange way to wrap things up, feeling forced and emotionally manipulative, completely out of tonal and thematic pace with the rest of the film, and also undermining what could have been a deeply affecting bittersweet final scene. The film is also far too long, and could easily have lost a half hour or more, with the meandering plot becoming interminably boring on more than one occasion.\r\n\r\nAs a kind of an aside, it's also worth mentioning an aesthetic decision that has me baffled. On occasion, the film is shot within a circular frame (think of how films often simulate POV through a telescope), often combined with racked focus and unsteady photography. I'm assuming the idea is to try to replicate the style of a Kinetograph, but given that device wouldn't be invented for another four decades, I'm not entirely sure what the point is, as the scenes which employ the style don't seem to contain anything to justify the usage. An especially strange example is a scene which sees Charlie speaking direct-to-camera, the only example of such in the whole film. Is this a break in the fourth wall, and if so, why? If it isn't a break, from whose POV is the scene shot? This kind of unjustified visual trickery pulls you right out of the film and offers next-to-nothing in the way of thematic compensation.\r\n\r\nThe four performances at the heart of _The Sisters Brothers_ earn it a great deal of leeway. But even taking that into account, I just couldn't get into it. Far too plodding and thematically unfocused, although I initially liked the characters a great deal, by the last act, I just wanted it to end already. It's certainly original in how it approaches a number of generic tropes, and that's to be commended, but the imprecise and poorly constructed episodic narrative saps away the goodwill built up by the aesthetic design and the acting. Is it a western? A comedy? A tragedy? An esoteric political piece? A realist depiction of greed trumping idealism? In the end, it doesn't seem to know itself, trying to be many things, and ending up being none of them.", "created_at": "2019-08-21T18:15:30.337Z"}, {"movie_id": 440161, "review_id": "64ce9728d9f4a603b6c888ec", "author_rating": 1.0, "review_text": "I was looking forward to this. It has two of my favorite actors in it. Unfortunately, I had to give up on watching it. It's impossible to see what's going on. There are some shadows moving about, sometimes covering each other. A dot lights up occasionally on my 55-inch OLED. I can see subtitles, hear the sound. This is apparently one of those \"someone invented HDR, that means we should put a cloth over the lens\" kind of movies. Such a shame.", "created_at": "2023-08-05T18:38:32.497Z"}, {"movie_id": 440161, "review_id": "5c446c820e0a266d66d354a5", "author_rating": 5.0, "review_text": "Certainly the better of the two Westerns I've seen today, but I'm also not really feeling the love with _Sisters Brothers_ like everybody else seems to be.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T12:41:38.605Z"}, {"movie_id": 440161, "review_id": "5d5d8a426743fa00137029fe", "author_rating": 5.0, "review_text": "_**A plodding and overlong tale of violence and redemption that doesn't seem to know quite what it's trying to say**_\r\n\r\n> _You are afraid of hell. But that's all religion is, really. Fear of a place we'd rather not be, and where there's no such a thing as suicide to steal us away._\r\n\r\n- Patrick deWitt; _The Sisters Brothers_ (2011)\r\n\r\n_The Sisters Brothers_ is a film set in the American Old West, based on a book by a Canadian, made by a mostly French crew, shot primarily in Spain and Romania, featuring a Brit as an American, an American as a Brit, and a British trans comedian as a ruthless American businesswoman. And I don't bring this up out of mere frivolousness; rather, a certain element of schizophrenia is built into the film's very DNA. On the surface it's a Revisionist Western with a gritty Spaghetti aesthetic focusing very much on a group of anti-heroes, but it's also a story of two brothers getting on one another's nerves, a tale of avarice and the destructive potential of progressive thinking, a chase movie, a dark comedy, a tragic fable, an examination of the days when the Old West was giving way to an ever-encroaching modernity, a look at how the sins of the father are oft repeated by the children, a study of competing types of masculinity, and even a political thesis, postulating that there was a time in American history when certain people genuinely believed they could build a harmonious society based on direct democracy and the kind of socialist attitude to capitalism that would make even Bernie Sanders blush.\r\n\r\nThe English language debut of French director Jacques Audiard, who adapted the script with his regular writing partner Thomas Bidegain from Patrick deWitt's 2011 novel of the same name, the film posits that even those who seem irredeemable may one day find a path to redemption. Very much of a piece with Audiard's more celebrated humanist work such as _De battre mon cœur s'est arrêté_ (2005), _Un prophète_ (2009), and _Dheepan_ (2015), _The Sisters Brothers_ works primarily as a character study about people trying to do what they feel is right in a world arrayed against them. Unfortunately, it did next-to-nothing for me. I wouldn't say it's a bad movie, as it clearly has a lot going for it; not the least of which is an unapologetic foregrounding of character over plot. However, its episodic rhythm, bifurcated narrative structure, and poorly-defined morality left me unengaged, frustrated, and rather bored.\r\n\r\n1851; the height of the California Gold Rush. In Oregon, Charlie Sisters (Joaquin Phoenix) and his older brother Eli (John C. Reilly) are hired guns working for \"The Commodore\" (a criminally underused Rutger Hauer). Far more sensitive and thoughtful than his younger brother, Eli is growing weary of the lifestyle, wanting to retire, settle down, and open a grocery store. The more unpredictable and volatile Charlie, however, wants to keep on killing indefinitely. After a mission descends into disarray, Eli is unimpressed when The Commodore appoints Charlie as \"lead man\" for their next quarry; a mild-manner chemist named Hermann Kermit Warm (Riz Ahmed). Telling Eli that Warm has stolen something from The Commodore which they are to retrieve, Charlie is under orders to keep their real purpose to himself for the time being. Unsure of Warm's exact location, The Commodore has already sent highly-intelligent tracker John Morris (Jake Gyllenhaal), a man too gentile for killing, to pick up his trail and detain him until the brothers catch up. Keeping them abreast of his progress via a series of letters, it doesn't take long for Morris to find Warm, telling the brothers he will await them in Jacksonville. However, when Warm learns that The Commodore has sent men after him, he explains to Morris that he has created an elixir that when poured into a river, will illuminate any gold deposits on the river bed, with the only catch being that the potion is extremely caustic, and any sustained exposure results in severe burns. Recognising that Morris is only an advance, he guesses that whoever is still to come is under orders to torture the formula out of him and then kill him. Learning that Warm doesn't want to use the gold for himself, but to help establish \"_an ideal living space, ruled by the laws of true democracy and sharing_\", Morris decides to join him, and they head to San Francisco in an attempt to evade the approaching brothers.\r\n\r\nA passion project for star and producer John C. Reilly, who purchased the rights to deWitt's novel shortly after it was published, it was he who first brought the material to Audiard's attention. One of the best-reviewed films at the 2018 Venice Film Festival, where it won Audiard his first Silver Lion for Best Director, when the film went on general release in North America later the same month, it flopped badly, earning only $3 million against a $38 million budget. That's a shame, as Audiard is immensely talented, and although I personally didn't enjoy this particular film, he deserves as much success as he can get. In terms of the novel, I don't know a huge amount about it, but I would imagine Warm's desire to build a Phalanstère in Dallas is inspired by La Réunion, a Fourierist-based utopian community founded in 1855 by Victor Prosper Considerant on the banks of the Trinity River. Wishing to make La Réunion a \"communal experiment administered by a system of direct democracy\", Considerant planned to allow participants to share in profits from capital investments. However, the settlement lasted only 18 months before financial insolvency, shortage of skilled participants, inadequate farming methods, and untenable maintenance costs led to its dissolution.\r\n\r\nAs one would expect from Audiard, working with his regular editor Juliette Welfling (_Le scaphandre et le papillon_; _The Hunger Games_; _Ocean's 8_) and production designer Michel Barthélémy (_Dobermann_; _Les salauds_; _Frantz_) and for the first time with cinematographer Benoît Debie (_Irréversible_; _Lost River_; _One More Time with Feeling_) and costume designer Milena Canonero (_Barry Lyndon_; _Chariots of Fire_; _The Grand Budapest Hotel_), the film looks amazing. Very much adopting the visual style of a Spaghetti Western, everything on screen looks dirty and/or dusty, whether it's the worn and lived-in costumes, the spartan and uncared for buildings, or even the perpetually unshaven characters and their rotting teeth (an historically accurate detail absent in most modern westerns). Of particular note are the shootouts, of which there are three significant examples. The first takes place at night, and is shot from a distance and without much in the way of coverage; the second is shot primarily from the point of view of two characters doing their best to hide; and the third isn't seen at all - we remain inside as the shooting can be heard on the street.\r\n\r\nThis should convey, as well as anything, just how revisionist _The Sisters Brothers_ is; the genre's tropes are all there, but they're examined from unexpected angles. A bear attack on a camp is not only not seen, it's not even heard, with our first indication of the incident being when one character wakes up to find another has shot and killed a bear during the night; men are seen riding horses, but when a horse is mortally wounded, the man to whom he belongs cries and apologises; whisky is drunk aplenty, but one character would rather sit alone thinking about home than go whoring or drinking; a film about hired guns ends on a shot of a man sitting in a bath; the anticipated climatic shootout plays out in a manner you'll never see coming. If it does nothing else, the film really drives home that to be able to truly subvert generic tropes, one must first understand and respect how those tropes work.\r\n\r\nThe film opens with an extraordinarily beautiful and striking scene. It's night on the prairie, which is so dark, we can make out only the barest outline of a house, with a smaller building nearby. After some shouted dialogue, a shootout begins between the house and the smaller building, with each booming gun blast sending out sparks and illuminating for a micro-second the surrounding area. Having vanquished their opponents, the brothers are about to leave the area, when they see a horse, its back covered in flames, galloping away, trying to outrun the fire from which it doesn't understand it can never escape. Realising the barn is on fire, Eli dashes in to try to save the trapped horses, whilst Charlie urges him to remain outside. Is the metaphor of the burning horse a little on the nose? Absolutely; try as they might, the brothers can never escape that which brings them pain, no matter how far or fast they run. But just because it's not exactly subtle doesn't mean it's ineffective, and as opening visual metaphors go, it's as striking an example as you're likely to find. The scene also immediately establishes the differences between Eli (who would risk his own life to save a group of horses) and Charlie (who sees no point in such sacrifices).\r\n\r\nIn relation to the _milieu_, yes, this is the Old West of John Ford, Anthony Mann, and Sergio Leone, but Audiard defamiliarises it as much as possible. A recurring theme, for example, is that this is a world on the brink of modernity, but whose inhabitants are still very much rooted in the past. This is depicted via a running gag about Eli's fascination with a curious modern invention (the toothbrush; so complicated a device, it comes with an instruction manual), and his childlike glee at staying in a hotel with indoor plumbing. Elsewhere, Morris remarks on how quickly the country is changing, writing, \"_I have travelled through places that didn't exist three months ago. First tents, then houses, then shops, with women fiercely discussing the price of flour._\" Additionally, Warm's progressive egalitarian vision for the future and his desire to use his formula to create a better society for all, allows the film to examine the belief (however short-lived) that out of the lawlessness, land thievery, and Native American genocide, a certain section of the populace hoped a more mutually beneficial society might arise.\r\n\r\nHowever, Audiard, of course, is not naïve enough to suggest that the Old West was especially peaceful or safe; although on the cusp of modernity, this is still a merciless place where violence is a form of currency. But even here, he subverts the genre, using a recurring motif of either Charlie or Eli shooting an already downed opponent pleading for his life, which is certainly not what we've come to expect from the (figurative) white hat protagonists so familiar in Hollywood westerns. Coupled with this, there's the ever-present background of the Gold Rush, and the mercenary mentality it fostered. Indeed, the whole plot is set in motion by The Commodore's greed, and as the film goes on, it comes to focus more and more on the clash between a Darwinian survival of the fittest, might is right mentality (represented by Charlie) and a more esoteric and politically progressive way of thinking (represented by Warm), with Eli and Morris functioning as something of a halfway house between the two extremes.\r\n\r\nIn terms of acting, Phoenix, Gyllenhaal, and Ahmed all have moments to shine (a monologue in which Morris describes his hatred for his father is especially worth looking out for), but this is Reilly's film through-and-through, turning Eli from a possibly oafish sidekick into an achingly human emotional fulcrum. His nuanced performance allows us to see just how badly Eli's conscience is affecting him, and how much he is drifting away from the increasingly amoral Charlie. Eli has no desire to split with Charlie, but he is slowly coming to the conclusion that he may have no option but to do just that. It's an extraordinarily subtle performance by Reilly, that reminded me a lot of his work in Paul Thomas Anderson's _Magnolia_ (1999), where he played a cop in love with a drug addict who shows unexpected emotional vulnerability, and Rob Marshall's _Chicago_ (2002), in which he played the dim but loyal-to-a-fault husband who emerges as the film's only really moral character. His unexpected affection for his horse is especially poignant, and his tendency to sniff a shawl given to him by his girlfriend is beautifully played by Reilly.\r\n\r\nHowever, for all this, I really disliked the movie, for a myriad of reasons. For one, I found it far too episodic, lurching from one incident to next with little in the way of connective tissue between them. I also didn't particularly like the shifts in focus from the brothers on the one hand to Morris and Warm on the other, with each strand serving only to detract from the other, making it impossible for either to fully settle. A knock-on from this is that the film lacks a strong lead character; although everything suggests that Eli is the protagonist, Phoenix is billed above Reilly, and a lot of the time, Eli seems more like Charlie's sidekick than his equal, making it difficult to figure out where one's empathy is supposed to lie. This difficulty becomes especially problematic in relation to the morally questionable _dénouement_, in which there is an incident which seems designed for the audience to roundly condemn one of the main characters, only for the film to then give us a 15-minute epilogue seemingly designed to redeem him.\r\n\r\nThis throws into relief what for me was the most egregious problem - none of what we see seems to mean anything, there are virtually no consequences for anything the brothers do (although plenty of consequences for others). This left me scratching my head as to what the film is trying to say. Is it suggesting that even the most morally repugnant of men deserve a shot at redemption? If that is the case, however, its rhetorical position is not especially cogent, as the character mentioned above in no way deserves redemption, allowing his greed and stubbornness to cause untold suffering to others whilst he gets off relatively scot-free. Furthermore, the aforementioned epilogue is hugely anticlimactic, which, I understand, is kind of the point, but it's still a very strange way to wrap things up, feeling forced and emotionally manipulative, completely out of tonal and thematic pace with the rest of the film, and also undermining what could have been a deeply affecting bittersweet final scene. The film is also far too long, and could easily have lost a half hour or more, with the meandering plot becoming interminably boring on more than one occasion.\r\n\r\nAs a kind of an aside, it's also worth mentioning an aesthetic decision that has me baffled. On occasion, the film is shot within a circular frame (think of how films often simulate POV through a telescope), often combined with racked focus and unsteady photography. I'm assuming the idea is to try to replicate the style of a Kinetograph, but given that device wouldn't be invented for another four decades, I'm not entirely sure what the point is, as the scenes which employ the style don't seem to contain anything to justify the usage. An especially strange example is a scene which sees Charlie speaking direct-to-camera, the only example of such in the whole film. Is this a break in the fourth wall, and if so, why? If it isn't a break, from whose POV is the scene shot? This kind of unjustified visual trickery pulls you right out of the film and offers next-to-nothing in the way of thematic compensation.\r\n\r\nThe four performances at the heart of _The Sisters Brothers_ earn it a great deal of leeway. But even taking that into account, I just couldn't get into it. Far too plodding and thematically unfocused, although I initially liked the characters a great deal, by the last act, I just wanted it to end already. It's certainly original in how it approaches a number of generic tropes, and that's to be commended, but the imprecise and poorly constructed episodic narrative saps away the goodwill built up by the aesthetic design and the acting. Is it a western? A comedy? A tragedy? An esoteric political piece? A realist depiction of greed trumping idealism? In the end, it doesn't seem to know itself, trying to be many things, and ending up being none of them.", "created_at": "2019-08-21T18:15:30.337Z"}, {"movie_id": 440161, "review_id": "64ce9728d9f4a603b6c888ec", "author_rating": 1.0, "review_text": "I was looking forward to this. It has two of my favorite actors in it. Unfortunately, I had to give up on watching it. It's impossible to see what's going on. There are some shadows moving about, sometimes covering each other. A dot lights up occasionally on my 55-inch OLED. I can see subtitles, hear the sound. This is apparently one of those \"someone invented HDR, that means we should put a cloth over the lens\" kind of movies. Such a shame.", "created_at": "2023-08-05T18:38:32.497Z"}]