[{"movie_id": 92591, "review_id": "58a9b7fc92514173f2009365", "author_rating": 8.0, "review_text": "Bernie is a really fun and enjoyable dark comedy, starring Jack Black and Shirley MacLaine. This is actually the true story of what happened between a purely good man and a purely evil woman.\r\n\r\nJack Black plays Bernie Tiede, an assistant undertaker in the small town of Carthage, Texas. He is loved by everybody for his pure-hearted character, his sympathy for every person he comes across and his willingness to help everyone who needs it in any way, shape or form. He's just such a good guy, you almost wouldn't believe it if not for the fact that this character is based on an actual person.\r\n\r\nAnd then there's Marjorie Nugent, played by Shirley MacLaine. She is his polar opposite, as hated as Bernie is loved. She is the widow of some rich oil baron, and she is just the most mean and spiteful woman you could ever fear to meet. Everyone in town absolutely hates her guts, and there's no one who would be sorry to see her go...\r\n\r\nThen comes the day when these two people meet and – all due to Bernie's good nature – form an unlikely friendship. Until about two years later when Marjorie's true personality rears its ugly head and even Bernie can't stand her abuse any longer, when he is reduced to her personal slave and whipping boy. And what no one believed possible, happens... He kills her. (don't worry, that's not a spoiler, that's the story line.) What follows is the strange lengths Bernie attempts to go to, in order to cover up his crime.\r\n\r\nWhat makes this film work so well is mostly the subtle humour of it. Director Richard Linklater thankfully didn't choose to make this into the hysterical, caricature of a comedy it easily could have been. Something that really adds to the authenticity of the film is the use of actual Carthage townsfolk, providing commentary on the events in documentary-like interview scenes. This really is a perfect move on the director's part, because it makes the 'acting' completely real and spontaneous.\r\n\r\nI really like Jack Black, but in this case, I'm somewhat glad he left his crazy mannerisms and facial expressions at the door, in order to just play this character true-to-form. He actually acts, rather than just playing another silly, typical \"Jack Black character\".\r\n\r\nI always love watching Shirley MacLaine in a mean and vile role such as this one, and in 'Bernie', she plays it to a T once again. Imagine her character in 'Steel Magnolia's' and then multiply it by ten. That's what you get here and it's an absolute joy to watch.\r\n\r\nMatthew McConaughey plays the county sheriff, dead-set on burning Bernie for his crime. I'm usually not too fond of him, but his role in 'Bernie' is pretty funny and he plays it well. He seems to be the only person in town who thinks it's bad what happened to Marjorie. That's another really funny aspect to this story – the fact that everybody involved just loves Bernie so much and really hates Marjorie to the bone, that they all seem to take his side in the matter. You might feel like I'm just throwing spoilers at you here, but pretty much the whole story is told in hindsight and flashbacks, so there are no real secretes or mysteries unveiled. Then what's the point of watching, you might ask, if I already know everything that's going to happen from the get-go? The point is the enjoyment you'll get from watching these events unfold.\r\n\r\nThe actors are all really well cast, and they play their roles with a certain flair that makes them instantly likable. The dialogue is clever and witty, and like I mentioned earlier, the combination of event re-enactment and documentary-like interviews, is a winning ticket and 'Bernie's' major selling point. The story is well constructed, as is the chronology of how it unfolds. Basically, it's just very well-made, and it definitely would have deserved a little more credit. But then again, this film also kind of has a \"small budget/small audience\" feel to it, so that might explain why it practically went unnoticed at the box office. It's just a shame that charming little comedies like 'Bernie' always get overlooked when stuff like 'The Hangover' and the like get multi-million dollar appraisal. All I can hope for is that 'Bernie' gathers its own DVD-fan base, because it's certainly worth it.\r\n\r\nWatch this film if you're in the mood a darkly hilarious comedy that has its heart in the right place. Oh, and stick around for the credits, where you can see pictures of the actual Bernie and Marjorie, and footage of Bernie and Jack Black talking, which is a fun addition.\r\n\r\nAll in all, a highly recommended film!\r\n_(October 2012)_", "created_at": "2017-02-19T15:21:32.987Z"}]