[{"movie_id": 365942, "review_id": "58a3d253c3a368396b002bb2", "author_rating": null, "review_text": "Somehow Hollywood continues to search for different outlets in conveying young love at the box office. Sure, the goal is always the same in terms of tapping into the youth market by promoting yet another transparent teen weepie but this time among the planetary stars. Hey, youngsters need catering at the movie theaters as well, right? However, one is not so convinced that the Young Adults (YA) genre is convincingly elevated by a flimsy frontier sci-fi romancer among the Clearasil crowd. Hence, **The Space Between Us** fits the bill as a scattershot and schmaltzy pimple-faced love story that has all the emotional stability of moon dust in front of a heavy duty oscillating fan.\r\n\r\nWriter-director Peter Chelsom (“Funny Bones”, “Serendipity”) and fellow screenwriters Allan Loeb and Tinker Lindsay delve into the conventional cliches of a lame star-crossed lovers theme that wreaks of saccharine-coated simplicity wrapped in scientific triteness. The awkward mixture of lightweight sci-fi drama, pandering gooey-eyed overtures toward teenage girls still nostalgically embracing their _Twilight_ fixation and space-age elements as filler exploration makes for a paper-cutter potency that creates unwanted space between us or any other species watching this cosmic claptrap. Give Chelsom some credit–at least his young protagonists are not another incarnation of obligatory hairy werewolves or fanged vampires, right?\r\n\r\nThe adolescent pen pals in **The Space Between Us** are truly from different worlds although this does not stop these particular kids from bonding deeply. Advanced academic in sixteen-year old Gardner Elliot (Asa Butterfield) is having a time of his life in corresponding with the edgy Tulsa (Britt Robertson) in the chat rooms. Whereas Gardner is a whiz in robotics and comes from prestigious stock (his late mother was a pioneering astronaut) his object of affection Tulsa is a motorcycle-loving wild child that had bounced around in the foster care system. The glaring differences between the unlikely young couple is that the scientifically gifted Gardner is located on Mars and Tulsa is a gritty gal living on Earth in the state of Colorado. Geez…talking about long distant relationships, huh?\r\n\r\nPoor Gardner has always entertained the thought of traveling to Earth–the home planet of his deceased explorer mother who died giving birth to him during her mission to colonize Mars. So now there is more of an incentive for Gardner to yearn for visiting Earth now that his curiosity and fascination with Tulsa has heightened. At this point all Martian Gardner has going for him socially is his guardian/”second” mother in astronaut/scientist Kendra Wyndham (Carla Gugino) and his robotic pal he built to provide him companionship. The cruel reality for Gardner not being able to take a trip to Earth has something to do with his sensitive Martian-bred bodily functioning not being able to withstand the atmospheric gravity settings on our planet (huh…is he not half Earthling?). All Gardner wants to do is come to terms with connecting to the planet Earth and finding some self-discovery about himself and self-fulfillment with his Colorado-based crush in the leather-clad Tulsa.\r\n\r\nOf course the film figures out–in convoluted fashion no doubt–how to place the inquisitive Gardner on earth-related soil through the far-fetched means of a billionaire Nathaniel Shepherd (Gary Oldman) funding the experimentation and expedition of the Red Planet-raised tyke whose dream of reaching the planet that houses his unknown father and his precious Tulsa. Soon, the inevitability of Gardner meeting up with his dreamgirl comes true as the teenage twosome take off and find liberation in each other’s company as the authorities are hot on their trail. Look out Romeo and Juliet…you have a cheesy carbon copy coupling seeking to steal your familiar thunder.\r\n\r\n**The Space Between Us** produces more sappy substance than a row of Vermont trees. The fish-out-of-water routine that Butterfield’s Gardner undergoes when reaching Earth is mechanically clumsy and predictable. Butterfield does what he can to portray Gardner as an alien just not from another planet but from his own skin and this notion is philosophically ambitious to pull off for an interstellar teen tearjerker that has all the complexity of a sofa cushion. Robertson’s Tulsa is the typical rebellious chick but her and Butterfield’s Gardner become tiresome as they engage in manufactured chase scenes, teen-angst lovey-dovey lameness and the dragged-out space travel drivel that beleaguers this simplistic sci-fi yarn.\r\n\r\nThe results in **The Space Between Us** is alarming more than charming because once the payoff is realized where Gardner and Tulsa draw energy from each other’s worldly vibes as they cuddle in zero gravity one will be left wondering where the next asteroid is coming to act as the needed wrecking ball to obliterate this toothless sci-fi saga aimed at the indiscriminate teen targets.\r\n\r\n**The Space Between Us (2017)**\r\n\r\nSTX Entertainment\r\n\r\n2 hrs.\r\n\r\nSTARRING: Asa Butterfield, Brit Robertson, Gary Oldman, Gina Gugino, Janet Montgomery, Trey Tucker, Scott Takeda, Adande “Swoozie” Thorne, Sarah Minnich\r\n\r\nDIRECTED BY: Peter Chelsom\r\n\r\nWRITTEN BY: Peter Chelsom, Tinker Lindsay Allan Loeb\r\n\r\nMPAA Rating: PG-13\r\n\r\nGENRE: Action & Adventure/Science Fiction/Fantasy & Romance\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-02-15T04:00:19.491Z"}, {"movie_id": 365942, "review_id": "598ca7a1c3a3686bfd0009bb", "author_rating": 7.0, "review_text": "**What's your favourite thing about Earth?**\r\n\r\nYou might ask that question for yourself while/after watching this film. This is not a great film, but surely different and enjoyable. This kind of storyline can be acceptable for the todays space ambition by the humans they have to accomplish. A couple of decades ago, it was called a fiction, still it is, but quite close to realistically possible.\r\n\r\nSo we had seen many films based on human connection with the red planet, Mars, but this one was a little different. It is romance theme, though not like east meets west. It is Mars meets Earth. The story of a boy from Mars and the girl from Earth. That's how it ends, but not that how it was initiated. It was the boy who searched for his connection with the Earth, and doing that, all the usual things happen, like some people come after him, like running and chasing.\r\n\r\nWell made film. It was not a complicated screenplay, but the twist was unexpected at the end yet I did not think it was strong. Explained everything with details, as well as intentionally added some of scenes to cover up later parts when the narration takes the unexpected route. Best cast for sure.\r\n\r\nBritt Robertson played the role ten years younger than her she is. But it does not matter, she still looks like a teenager. And Asa Butterfield was quite good too. The only usual thing about the film was the road adventure, though it did not take the usual route. Nothing was like you have already seen them. That's where it hand upper hand. The end was good, yet I felt it softened to bring a certain type of ending than a relevant one. Because it is a PG13 film and they wanted the conclusion that satisfy their target audience. So, it is a nice film and once watchable.\r\n\r\n_7/10_", "created_at": "2017-08-10T18:36:17.041Z"}]