[{"movie_id": 154400, "review_id": "58ab824b92514158c0006001", "author_rating": 7.0, "review_text": "Are you doing something desperate? Something we can't clean up this time?\r\n\r\nThe Drop is directed by Michael R. Roskam and written by Dennis Lehane, who adapts from his own short story titled Animal Rescue. It stars Tom Hardy, James Gandolfini, Noomi Rapace and Matthias Schoenaerts. Music is by Marco Beltrami and cinematography by Nicolas Karakatsanis.\r\n\r\nBrooklyn barman Bob Saginowski (Hardy) spies an opportunity for a better life - but only if he can escape family ties, the crime that surrounds him and a dark past \r\n\r\nIt's arguably a tricky film to recommend with confidence given that it doesn't sit still in crime genre company. This is very much a character based story about a small handful of people affected by crime, where they are chained to events occurring by way of law breaking. Roskam is in no hurry what so ever to spin his picture's literary worth, very much favouring a slow burn - even low key - approach. He deftly develops atmosphere whilst simultaneously ensuring we the viewers are very much a part of the setting and situations - something Lehane does so brilliantly in his novels. By the time the pic plays its hand, what appeared at first to be needless complexities, are valid and close the piece down with some considerable success. 7.5/10", "created_at": "2017-02-20T23:56:59.690Z"}, {"movie_id": 154400, "review_id": "626a906995acf00e1b01e4c5", "author_rating": 7.0, "review_text": "\"Bob\" (Tom Hardy) and his cousin \"Marv\" (James Gandolfini) run a bar that is regularly used for the anonymous drop - money paid to their Chechen landlords - and all goes fine until it is robbed. They are tasked with retrieving the money and are soon immersed in a cycle of gangland betrayal and deception that isn't helped by a police investigation into another murder, and the curious \"Eric Deeds\" (Matthias Schoenaerts) whose dog \"Bob\" has rescued from maltreatment. Nobody knows who to trust and director Michaël Roskam manages to use the talent at his disposal, alongside some effective lighting and a careful build up of the pace to help this better-than-average thriller work up to it's clever conclusion. Noomi Rapace (\"Nadia\") features only sparingly, and Hardy's accent maybe isn't the best - but the complexities of the plot as well as a reasonable attempt to develop the characterisations into people we cared a little about do help this stand out. Hardy shows us that he has the ability to deliver a slightly more multi-dimensional persona and this is a good watch with quite a quirky ending.", "created_at": "2022-04-28T13:02:33.111Z"}]