[{"movie_id": 436969, "review_id": "61048d3d688cd0007f215a28", "author_rating": 8.0, "review_text": "The Suicide Squad...\r\n...stayed true to the hype of the anti-hero teams in DC.\r\n\r\nI feel like it wasn't really a sequel but rather a reboot and ignoring the first film.\r\nThe action was insane and BLOODY brilliant, with a stellar cast. And they LITERALLY killed off the first team at the very start of the film! To be honest, I wasn't really surprised as I didn't see more of them in later scenes of the trailer. But I was surprised they killed off Captain Boomerang - he was basically the primary member of the team! And I especially wanted to see more character build up with Savant, learn more of his backstory. Instead, he just turned out to be a totally wuss that's only good at killing small birds! But what shocked me the most was Rick Flagg's death!\r\n\r\nStill, Idris Elba and John Cena were fucking awesome as Bloodsport and Peacemaker, respectively. And King Shark was hilariously awesome. Funnier that Groot because at least he says more than three words - although, \"hand\" would have to be my favourite moment!\r\n\r\nI did had mixed feelings from the start, but then I started to really get into it all!", "created_at": "2021-07-30T23:37:33.102Z"}, {"movie_id": 436969, "review_id": "610d456f5bce9e002cfa1ef5", "author_rating": 7.0, "review_text": "For sure has its moments and also has James Gunn's fingerprints with the dark humor. Not sure I would rank this all that high amongst all comic book movies, nor is it near the top compared with some DC, but it's a step up from the previous entry. The performances all around were well done with Idris Elba and John Cena being the highlights but everyone else were great. **3.75/5**", "created_at": "2021-08-06T14:21:35.658Z"}, {"movie_id": 436969, "review_id": "6116ecdecee481002e284eea", "author_rating": null, "review_text": "I was pleasantly surprised by this one, I had not watched any trailers in the run up to watching it but I was expecting it to be a bit lame but it turned out to be a good movie. I was surprised when pretty much the whole first team was killed off straight of the bat especially since some of the characters where played by well known actors, it wasn't all about Harlequin, John Cena and Idris Elba worked well together, good movie worth going to the cinema to watch it.", "created_at": "2021-08-13T22:06:22.841Z"}, {"movie_id": 436969, "review_id": "611b96a49f0e1900440acce5", "author_rating": 9.0, "review_text": "**From Director JAMES GUNN : \"The Supremely Delectable Art Of, Er, HOMICIDE, 101🤦‍♂️💥😅\"**\r\n\r\n______________________________________________________\r\nA  **-{ _B I G_ }-**  Screen **Micro** Review . Film Viewed By Me At **_NOVO CINEMAS_** Sharjah UAE, On August 16\r\n______________________________________________________ \r\n\r\nSo usually, I try and maintain a somewhat orderly structure with my Reviews, namely : 'Intro->-Body->-Summation'. This time, just to 'Keep-it fresh', I just thought I'd shake things up a bit, and { quite literally } write my review, er . . . .  'backwards'. Hence, without further ado, here goes 😉❗ \r\n\r\nFINAL ANALYSIS : \r\nAs a 'doting' parent, I'm going to come clean and tell you that I had a real problem with the fact that I -{ Did }- really enjoy this -Certifiably- { Decadent } \"Bloodsoaked Adult Goof-fest\", and in no small measure either, at that. Sure it was 'dominated' mostly by -Cartoonish- violence meant only for 'Mature' viewers, ( it has an M.p.a.a certified rating of 'R' ) ; however ...the, um, how shall I say... \"Sheerly, Obscenely, Gratuitous\" levels of gore in said movie -Did- somewhat take me by surprise . . . given as it comes -directly- from the Director -best- know for his ( -relatively- ) \"More kosher\" -M.c.u- ( 'Marvel Cinematic Universe' ) . . . blockbuster fare. \r\n\r\nHIGH POINTS : \r\n1. \"Peacemaker\" : The cheeky,  sneaky', yet unequivocally -{ \"Bold, Fresh & Fabulous\" }- takedown of the long, long, long standing -Imperialist- tendencies ; but more significantly, the -{ \"Hypocricies & Triple-standards\" }- of, \"Past United States Governments\", -Symbolically- , of course.\r\n2. Simply Put : basically -\"Everything\"- the { Stunningly 💣 💥❗ } Talented Margot Robbie, ( 'Harley Quinn' ) does ; with an 'Extra-special' mention for her -protracted- \"Escape From Coronel\" fight scene. 3. Daniela Melchoir, ( 'Ratcatcher-two' ) : This peculiarly endowed 'Anti-heroine' has a seiously -Bizarre- talent... but she, along with Idris Elba's 'Bloodsport', the just bespoke Margot's 'Harley' ( -and Others- ) ...end up bringing a veritable -{ \" Ton Of -Unexpected & Genuine- Heart \" }- to 'The Suicide Squad'. \r\n\r\n**\" A Conflicted, yet -Thoroughly- Entertained, 8.50 Marks Out Of 10 From Me \" ;** if only out of 'Absolute Admiration' for the 'Funny, & Insanely-Creative' James Gunn. It bears iterating that I ( -Very Obviously- ) won't be letting my kids anywhere \"Near\" this super-Crazy, Super-Fun picture . . . -{ However }- . . . the Reviewer in me has -Indeed- won over the Parent, in this instance, all the same 🤷‍♂️ 😂 .", "created_at": "2021-08-17T10:59:48.656Z"}, {"movie_id": 436969, "review_id": "612b83b4a1d33200473fc3c6", "author_rating": 8.0, "review_text": "This is one fun and violent superhero movie that is just entertaining. A nice break from the vast universe of Marvel, this is just a simple fun movie.\r\n\r\nCrazy, silly, surprising and hilarious.\r\n\r\nDefinitely recommended!", "created_at": "2021-08-29T12:55:16.583Z"}, {"movie_id": 436969, "review_id": "6134975e64f71600629ffb82", "author_rating": 9.0, "review_text": "Full Review and Analysis at Spotamovie.com \r\n\r\n**The Suicide Squad – Introduction**\r\nTake the weirdest villains, give them an impossible mission, add some creepy humour, actions, colours and talent, and you get “The Suicide Squad.”\r\nIf some villains in 2021 try to improve and become better people, see Cruella, for instance, we can’t say the same for our protagonists on the scene. They are looking to please the American government to gain some favour in return. However, some of them will surprise us with some good intentions and actions.It’s an exciting movie, spectacular in its genre and filled with dark humour and great character. So let’s dive into the story and some insights.\r\n\r\n**The Suicide Squad – The Story**\r\nThe American government organises a secret mission to take control of “Project Starfish” in the South American island of Corto Maltese. However, a recent coup overthrew the friendly American government and, the task forces created by intelligence officer Amanda Waller needs to destroy the laboratory of the secret experiment, Jötunheim. Colonel Rick Flag leads the first team that tries to enter the Corto Maltese’s beach. At the same time, the second team leader is Bloodsport, an assassin who accepted the mission under the blackmail of the American authorities. Both teams will have to strive and survive to accomplish the critical goal.\r\n\r\nOur heroes, or villains, needs to save the world from “Starro The Conqueror”, a dangerous weapon in the hands of the not trustable Corto Maltese’s government. But also prevent a tremendous international scandal that will destroy America’s reputation in the world.\r\n\r\nWill our team succeed with their mission?\r\nWhat will be the price to pay?\r\nAnd what is the difference between a not trustable regime and one which conspires against the world for its interests? \r\n\r\nFull Review and Analysis at https://www.spotamovie.com/the-suicide-squad-2021-movie-review-and-analysis/", "created_at": "2021-09-05T10:09:34.228Z"}, {"movie_id": 436969, "review_id": "6137ade5a217c000890ea0b8", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-suicide-squad-spoiler-free-review\r\n\r\n\"The Suicide Squad is everything its predecessor should have been, boasting everything a Suicide Squad film deserves. Proper rated-R content with extremely gory, bloody action sequences, which are impressively shot and choreographed through long takes, exceptional stunt work, and surprisingly outstanding VFX. \r\n\r\nWith the help of a witty soundtrack, James Gunn brings his dark humor to an expectedly hilarious level, though not all jokes land in a still generic screenplay filled with the usual cliches and formulaic developments. Nevertheless, the phenomenal cast elevates the overall picture with fantastic performances all-around, though Daniela Melchior's breakthrough performance is an absolute standout. \r\n\r\nEach squad member receives decent screentime to share their emotionally compelling backstories, transforming a superhero movie into a character-driven story instead of just a team of superpowered nobodies beating up a random CGI monster. \r\n\r\nGunn just can't seem to miss.\"\r\n\r\nRating: B+", "created_at": "2021-09-07T18:22:29.451Z"}, {"movie_id": 436969, "review_id": "615d95dc8e2ba6008beb88f4", "author_rating": 8.0, "review_text": "The Suicide Squad is an uproarious extravaganza filled with grotesque nom-noms, full-on naked dick shots, and John Cena in tighty-whities and it’s is the most fun you’ll have with an R-rated comic book film in a theater (or at home with HBO Max) since Deadpool. It’s the first comic book film to come along in a good long while that’s charming because of how weird it is. \r\n\r\nFull review: https://geekshavegame.com/the-suicide-squad-review-im-a-motherf___ing-superhero/", "created_at": "2021-10-06T12:26:04.431Z"}, {"movie_id": 436969, "review_id": "61c9c2fdb6c264001cfd4f0a", "author_rating": 9.0, "review_text": "_The Suicide Squad_ is still one of my favorite films of the year. James Gunn understood what the real Suicide Squad is, the great action, the violence, with a nice balance of heart and humor. The performances made this film a lot better. I didn’t expect that enjoy this film even on rewatch, and even put a spot on my yearly ranking, and I hope Gunn makes more films like this.\r\n\r\n**MY FULL REVIEW** : https://boxd.it/2kVcop", "created_at": "2021-12-27T13:43:25.993Z"}, {"movie_id": 436969, "review_id": "628a48ef209f1812c6340271", "author_rating": 8.0, "review_text": "I cannot help wondering if the writer of this movie was on a LSD trip or something when he wrote it. It is over the top crazy, weird and outrageous. It is also incredibly gory. It is a super hero / bad guy comedy with emphasis on comedy. I was thinking comedy version of Kill Bill (for the gore and killing) with supers in it when I was watching it.\r\n\r\nI have to say that I enjoyed watching it though.\r\n\r\nThe movie makes absolutely no pretense of being taken seriously. The “heros” are outrageously wacky and so are most normal persons in the movie. The plot is just as wacky as the characters and this is a movie in which the normal ludicrous and illogical plot twists that the Hollywood hacks usually comes up with actually feels right for the movie.\r\n\r\nI got a bit of a what the f… moment at the beginning when the movie had but started and everything went to hell right away. That was before I had realized how much of a comedy this movie really was supposed to be. If there is a sane moment in this movie I missed it.\r\n\r\nIf there was one thing I didn’t like about the movie it was the liberal use of jumping back and forth. I hate this “24 hours earlier…” bullshit or any permutations thereof.\r\n\r\nI also really didn’t like the “It’s the evil US government conducting illegal evil experiments and we’re supposed to cover it up” story line. It just typical Hollywood overused crap.\r\n\r\nI did like the action though. As I wrote before it is ridiculously gory and very very comical. So is a lot of the dialog which of course is as crazy and weird as the rest of the movie. In any other movie as large shark with legs walking on land saying “yum yum” and then eating someone, repeatedly, would be just cringeworthy. In this movie it actually works.\r\n\r\nThe movie is 2 hours 12 minutes long and it really did not feel too long. It was 2+ hours of fun entertainment.\r\n\r\nThe post credit scene was a bit lame though. Not at the same level as the rest of the movie.", "created_at": "2022-05-22T14:30:07.585Z"}, {"movie_id": 436969, "review_id": "62bdf9e597eab400967a6dcb", "author_rating": 9.0, "review_text": "What a surprise, after hearing such great things about this film for the past year I finally decided to give it a watch and it did not disappoint. James Gunn is such a fantastically creative director, and it is shown in full force here. Gunn is able to give each character their own artistic flair that makes even the most ridiculous characters (Polka-Dot Man) memorable. The comedy is on point, like most Gunn films, but there is a more brutal style of humor that is distinctly different the MCU humor that he has pioneered, given the R rating. I was pleased with the fighting choreography, with many unique kills i.e, the Harley Quinn escape scene. The plot is nothing special, but that is really in the background to the characters relationships that build throughout the course of the film.\r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-06-30T19:30:45.444Z"}, {"movie_id": 436969, "review_id": "630fa1ba0231f20091be3163", "author_rating": 6.0, "review_text": "Movie is different in terms of the violence it handles, but I feel that it falls into many things previously seen. The beginning of this film is brutal but as the second act progresses it becomes a bit tedious and there is a lot of sentimentality that ends up overshadowing the violence. The special effects are good and the sound is good too, most of the performances are convincing. While I didn't think it was that funny, it has it's few moments, and the main cast of characters is also more likable.", "created_at": "2022-08-31T18:00:26.710Z"}, {"movie_id": 436969, "review_id": "631384dbc048a9008fe99028", "author_rating": 1.0, "review_text": "The Suicide Squad is to Suicide Squad what McDowell's is to McDonald's. Suicide Squad had Deadshot, The Suicide Squad has Bloodsport. Suicide Squad had a computer generated anthropomorphic crocodile, The Suicide Squad has a computer generated anthropomorphic shark. Suicide Squad had a Latino character who could control CGI flames, The Suicide Squad has a Hispanic character who can control CGI rats. Et-fucking-cetera.\r\n\r\nThese minor differences only serve to emphasize that the only real difference between this movie and its predecessor is a definite article in the title. Even the quote-unquote new characters serve to preserve the status quo, as their introduction allows writer/director James Gunn to repeat David Ayer's formula from the first film: Amanda Waller (Viola Davis), who is clearly a bigger sociopath than any member of the Suicide Squad, scrapes the bottom of the DC barrel for characters who go from feeling sorry for themselves to feeling sorry for each other.\r\n\r\nBut there is something that The Suicide Squad has that Suicide Squad doesn't: an odd habit of unnecessarily doubling down. Thus, we have Peacemaker, who is interchangeable with Bloodsport does. Or Weasel, a humanoid weasel who is interchangeable with Pete Davidson, a weasely human (Davidson is possibly the only person more annoying than Margot Robbie; thankfully, his character gets his face shot off early on, which actually makes Davidson less grotesque to look at than usual).", "created_at": "2022-09-03T16:46:19.270Z"}, {"movie_id": 436969, "review_id": "632b9be43520e80082a392dd", "author_rating": 5.0, "review_text": "I certainly could have tolerated a LOT more comedic lines. But what the hell, it's just good, dumb, fun anyway.", "created_at": "2022-09-21T23:19:00.026Z"}, {"movie_id": 436969, "review_id": "632b9cae61bac4007bf56e00", "author_rating": 5.0, "review_text": "I certainly could have \"tolerated\" a LOT more comedic lines. But what the hell, the film is just good, dumb, fun anyway!", "created_at": "2022-09-21T23:22:22.202Z"}, {"movie_id": 436969, "review_id": "63e72d93a2e602007bb6d29c", "author_rating": 9.0, "review_text": "**Where the first film was a good action movie with Suicide Squad characters, The Suicide Squad (2021) truly is a Suicide Squad movie in all its psychotic, unpredictable glory.**\r\n\r\nWhile I am one of the few that really enjoyed the 2016 Suicide Squad, I can't deny that this movie captures the chaos, instability, and expendable nature of the Squad in the comics. James Gunn introduces the audience to a whole cadre of characters that are very deep cuts into DC lore with unknowns like Polka-dot Man, Peacemaker, Bloodsport, Ratcatcher, Javelin, and more. These obscure villains serve as perfect cannon fodder for Amanda Waller's hopeless suicide missions. These C-list villains almost scream that no one is safe. Both new and old characters constantly die throughout the film. Still, somehow Gunn manages to make us care about these obscure and insignificant comic book characters making their deaths more potent and heartbreaking. He also knows how to direct Harley Quinn better than any director who has brought the character to live action. Her insanity and charm are delightfully deranged and perfectly showcased repeatedly. With an army of bad guys, there is plenty of action and fighting to keep the runtime moving and put each squad member's skills on display. After what Gunn did with The Suicide Squad, I am excited to see what he brings to the rest of the DC Universe.", "created_at": "2023-02-11T05:54:27.203Z"}]