[{"movie_id": 713704, "review_id": "64440771cee2f667e736c55d", "author_rating": null, "review_text": "Evil Dead Rise Gives Series Fans A Fresh Take And Plenty Of Gore\r\nUsually when a film series is embarking on a fifth outing the challenges\r\nof keeping things fresh and original yet being new and creative can be a\r\nmassive obstacle.\r\n\r\nHorror series ranging  from “Halloween” to “Friday the 13th”, “SAW”, and\r\n“A Nightmare on Elm Street” all faced issues with moving the series along\r\nyet trying to stay true to the original film that inspired them and in\r\nevery case; failing to fully capture what made the original film a hit.\r\n\r\n“Evil Dead Rise” is not only the latest entry into the series but a bold\r\ntake on the cinematic series as it abandons the remote cabin setting of\r\nthe first two films and the reboot in favor of an urban setting.\r\n\r\nThe film does open in a remote lakeside locale before jumping a day\r\nearlier to California where estranged sisters Ellie (Alyssa Sutherland)\r\nand Beth (Lilly Sullivan) reunite. Beth has been working as a guitar\r\ntechnician and bristles that her sister refers to her as a groupie.\r\n\r\nEllie is raising three children after their father left and informs her\r\nsister that the building they are living in is scheduled to be demolished\r\nso they will have to move soon which is a shock to Beth as she has learned\r\nthat she is pregnant and is trying to figure out her life all the while\r\nseeing what she thought would be a source of stability for her upended.\r\n\r\nThe arrival of an earthquake allows access to a hidden area in the parking\r\ngarage of their building and since the locale was a former bank; the kids\r\nsoon find a hidden book and records which the only son Danny (Morgan\r\nDavies) hopes he can sell despite his sister Bridget (Gabrielle Echols)\r\nadmonishing him constantly to leave it alone and return it to where it was\r\nfound.\r\n\r\nThe book turns out to be a Necronomicon or “Book of the Dead” and as fans\r\nof the series know; nothing good ever comes from one and thanks to playing\r\nold records left by a Priest describing his thoughts on the book; a\r\nsummoning incantation is read and this causes Ellie to become possessed\r\nand unleash grotesque carnage and terror on her family.\r\n\r\nWhat follows is a gory and at times intense game of cat and mouse\r\npunctuated by moments of levity as the demonic infestation knows no end.\r\n\r\nThe film has the over-the top- gore that is expected of the series and the\r\nmakeup and effects are very effective. Writer? Director Lee Cronin has done\r\na great job capturing the tone of the series while moving it forward as he\r\ncleverly incorporates lines and nods to the series without making them\r\nseem forced.\r\n\r\nSome may find the excess of blood too much but the series has always been\r\nknown for taking things to the extreme as the blend of horror and comedic\r\nparody is what made the original film such a success.\r\n\r\nIn the end “Evil Dead Rise” does enough to keep fans of the series happy\r\nand hopefully, we will be seeing a new entry in the series in the future.\r\n\r\n3.5 stars out of 5", "created_at": "2023-04-22T16:12:33.817Z"}, {"movie_id": 713704, "review_id": "6445c6e60582244d833294e8", "author_rating": 1.0, "review_text": "If you are expecting an Evil Dead movie... well, I guess it depends on what generation you're from.  If you are expecting Evil Dead, Evil Dead 2, Army of Darkness, the films of the unholy trilogy... you are going to be gravely disappointed.  This isn't Sam Raimi's Evil Dead.\r\n\r\nThis is, well, this is the Conjuring just like almost every other Horror movie past 2014.\r\n\r\nIt doesn't really breathe \"new life\" into the franchise, instead it takes the Evil Dead and breathes the PG-13 Neo-Horror Movie breathe into a franchise that used to be a heck of a lot of campy immature fun.  \r\n\r\nHere you get the same as everything else.", "created_at": "2023-04-24T00:01:42.572Z"}, {"movie_id": 713704, "review_id": "6452cd5e87a27a011b13329d", "author_rating": 7.0, "review_text": "_Evil Dead Rise_ is mostly entertaining as a new entry of the _Evil Dead_ franchise, but it’s got some hiccups that should be ironed out in any potential sequel.\r\n\r\nThe cast’s performances are all strong, with Sutherland masterfully making the most of her character with spine-tingling body language and unnerving dialogue, but as a fifth film in a well-known horror franchise, it’s disappointing to see that its most memorable moments are throwbacks to previous films.\r\n\r\nUltimately, _Evil Dead Rise_’s biggest flaw is that it simply isn’t as good as its ten-year-old predecessor. Nevertheless, the film is fun, blood splattering carnage that will hopefully take the _Evil Dead_ franchise in a bold and exhilarating direction.\r\n\r\nFull review: https://boundingintocomics.com/2023/05/02/evil-dead-rise-review-new-mommy-demon-look-same-great-chainsaw-taste/", "created_at": "2023-05-03T21:08:46.409Z"}, {"movie_id": 713704, "review_id": "6463762def8b3200e3aeaae2", "author_rating": 6.0, "review_text": "This is certainly a triumph for the visual and audio effects folks. Otherwise, I found it all a bit derivative and frankly a rather classless rehash of the much more entertaining original. It's tough to just keep on re-inventing these themes - they do tire, and as I reckon with the recent updates of the \"Halloween\" franchise, they maybe just rely too heavily on a current generation who were not around to see the originals in the cinema first time round, and who maybe just don't appreciate that the acting and the writing - though never exactly crucial to these plots - did have more of a role than just relying on well made-up (virtual) demons spinning around the ceiling emitting threatening shrieks. It's not terrible - it moves along quickly for ninety minutes and might just put you off a bath anytime shortly afterwards, but there just isn't any real sense of menace or jeopardy and to be honest I wasn't entirely sure that the family weren't nightmarish enough - before their visitor arrived. Perfectly watchable on the telly around Halloween with a drink in your hand, and it's a sort of gift that keeps on giving because you'll be able to watch it again the next year without the faintest recollection of what is going to happen!", "created_at": "2023-05-16T12:25:17.923Z"}, {"movie_id": 713704, "review_id": "6463a77f8c44b9780961d349", "author_rating": 8.0, "review_text": "Evil Dead Rise puts a creative spin on the classic franchise while also remaining faithful to the core experience.\r\n\r\nThe story is not overly complex and admittedly somewhat generic, as the main characters find the Book of the Dead, read it, and all hell breaks loose. But the conditions surrounding this plot are what truly set it apart. For one, the high-rise setting was brilliant and created a very claustrophobic environment that worked really well. I found the earthquake to be an original idea not only for the discovery of The Necronomicon but also for the entrapment of our main characters.\r\n\r\nSpeaking of our cast, this film does a really great job of setting up these characters. I genuinely liked all of them, which made it difficult to see some of them go, unlike in Evil Dead (2013). The familiar bond between them was palpable, and this could not have been done without a fantastic cast. Alyssa Sutherland is by far my favorite Deadite in the entire franchise. Her motherly connection was haunting, her facial expressions, and mannerisms are nightmare fuel. Lily Sullivan was genuinely fantastic as a final girl. Her badass nature to defend the children is incredible, and she had some really great moments to stand out in the film. The kids overall did fine, nothing that was too amazing but nothing that took away from the film either.\r\n\r\nThe direction was my favorite part of the film by far. Lee Cronin did such a fantastic job with haunting camera work with subtle tilts and use of reflections. The action was top-notch, and the practical effects were amazing. So many scenes had me physically wincing with some insanely creative violence mixed with stomach-churning blood and wound effects. It is definitely a worthy successor to Evil Dead (2013) in the gore department.\r\n\r\nOverall, this may not be the best in the franchise, but I think it is one of the most refined. The story lacks in some areas, but the direction, performances, and violence really cement this as one of the best horror films of the year.\r\n\r\nScore: 84%  ✅\r\nVerdict: Great", "created_at": "2023-05-16T15:55:43.944Z"}, {"movie_id": 713704, "review_id": "64646e040284200170064da7", "author_rating": null, "review_text": "**\"Evil Dead Rise\"** (2023) is a captivating and bone-chilling horror film that left me on the edge of my seat. From the opening scene to the final credits, the movie delivers a relentless onslaught of terror and gore. The practical effects are outstanding, creating some truly gruesome and memorable moments that will haunt your nightmares. The performances are top-notch, with the cast fully committed to their roles and delivering intense and believable performances. The direction by Lee Cronin is masterful, as he expertly builds tension and suspense throughout the film. The setting of an urban high-rise adds a unique and claustrophobic atmosphere, amplifying the sense of dread. \"Evil Dead Rise\" is a must-watch for horror aficionados who crave a thrilling and visceral experience. Brace yourself for a wild ride that will leave you both terrified and exhilarated.", "created_at": "2023-05-17T06:02:44.237Z"}, {"movie_id": 713704, "review_id": "64986ff86f43ec01399a86e7", "author_rating": 7.0, "review_text": "Okay supernatural horror and entry into the long-running franchise that really takes off during the blood-drenched finale. Can't say I loved it and it was far too dark at times to even tell what was going on, but thought it was on par with Evil Dead 2013. **3.5/5**", "created_at": "2023-06-25T16:48:56.748Z"}, {"movie_id": 713704, "review_id": "649a50540e5aba0139de2ed6", "author_rating": 2.0, "review_text": "As contemporary horror films go, I’ll freely admit that this is a genre about which I couldn’t care less. I find most of these films boring, predictable, stupid and not especially scary. In fact, the only ones to which I’ll even give a second look are smart horror films (like “Get Out” (2017) or “Annihilation” (2018)) or campy romps (like “Renfield” (2023)). So the fact that I somehow managed to sit through this trash heap is quite an accomplishment. (Actually, the only reason I watched was because I was channel surfing and there was nothing else on, so I decided to give it a chance (I would have been better turning on the radio).) This pointless parade of endless blood and gore is a prime example of the decline of the mainstream movie industry (how projects like this get greenlighted is beyond me, except, of course, for the obvious box office considerations). It’s so utterly ridiculous that the picture plays like something that was made up as the crew went along. I’ll admit that there was some modestly cheeky humor here, but not enough to make it a genuine camp fest. Writer-director Lee Cronin’s latest is an assault on the art of filmmaking, the kind that should carry fines and other punishments. My goodness, what has this industry come to?", "created_at": "2023-06-27T02:58:28.489Z"}]