[{"movie_id": 245842, "review_id": "621a7853dd926a00691751f0", "author_rating": 2.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"The King's Daughter is everything viewers expected: a formulaic, uninteresting story filled with old-fashioned cliches and spine-chilling visual effects - not in a good way.\r\n\r\nNot a single filmmaker and respective creative team deserve to have their work stuck in a seven-year limbo until it's released, let alone due to scheduling and budget issues. However, while the horrible VFX can be forgiven, the disappointing narrative can't be saved, not even by the also underwhelming performances.\r\n\r\nPierce Brosnan (False Positive) seems to represent a caricature, while Kaya Scodelario (Crawl) benefits from the release delay, which fortunately didn't negatively impact her early career. The only positive point is that, in fact, it reached the big screen.\r\n\r\nToo bad it's not worth it.\"\r\n\r\nRating: D-", "created_at": "2022-02-26T18:58:27.607Z"}, {"movie_id": 245842, "review_id": "621a7853f96a3900696f4bb8", "author_rating": 2.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"The King's Daughter is everything viewers expected: a formulaic, uninteresting story filled with old-fashioned cliches and spine-chilling visual effects - not in a good way.\r\n\r\nNot a single filmmaker and respective creative team deserve to have their work stuck in a seven-year limbo until it's released, let alone due to scheduling and budget issues. However, while the horrible VFX can be forgiven, the disappointing narrative can't be saved, not even by the also underwhelming performances.\r\n\r\nPierce Brosnan (False Positive) seems to represent a caricature, while Kaya Scodelario (Crawl) benefits from the release delay, which fortunately didn't negatively impact her early career. The only positive point is that, in fact, it reached the big screen.\r\n\r\nToo bad it's not worth it.\"\r\n\r\nRating: D-", "created_at": "2022-02-26T18:58:27.974Z"}, {"movie_id": 245842, "review_id": "648becb826346200ae1ab8b2", "author_rating": 4.0, "review_text": "Must have been tax return time for Pierce Brosnan as he \"stars\" in this daft historical fantasy about Louis XIV of France and his aspirations for immortality. Egged on by the ambitious \"Labarthe\" (Pablo Schreiber) he believes that he can live forever if her manages to get hold of a mermaid and - well, he pinches her life force. Snag is, though, his own daughter \"Mary-Josephe\" (Kaya Scodelerio) is not so supportive of this scheme when she discovers this distressed sea creature and so, of course, off we head into the turbulent waters of familial discord before a whopping great power ballad at the end. William Hurt crops up here, too, and Benjamin Walker provides some eye candy - but the story is Disney-lite, there is way too much verbiage and although Brosnan tries to ham it all up, he just looks like he couldn't care less about any of it - a feeling with which I could pretty readily associate. It does look good, the costumes and Versailles look lovely but the rest of it is straight to video.", "created_at": "2023-06-16T05:01:44.775Z"}]