[{"movie_id": 458737, "review_id": "5c56d9969251410e24698396", "author_rating": 6.0, "review_text": "I don't believe I've ever seen a film shot so deliberately. Almost every single angle is framed with precision and intent. Like a Wes Anderson film sapped of any and all whimsy. Many shots linger in a style not often found outside of horror films, in the scenes they intend to deliver the audience a scare that its characters do not see.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-02-03T12:07:50.940Z"}, {"movie_id": 458737, "review_id": "5cc26113c3a368776c8e7121", "author_rating": 7.0, "review_text": "**_Brilliantly shot, excellently written_**\r\n\r\n> **_Alissa Wilkinson_**: _Do you think of_ First Reformed _as an apocalyptic film?_\r\n \r\n> **_Paul Schrader_**: _It depends on what you call \"the apocalypse\". I think we are seeing the last century of homo sapiens. I don't see a scenario in which homo sapiens emerge from this century in our present form. Now, that's not the end of the world. That's just the end of a species, which evolution has taken to its dead end. All of its intelligence is not enabling it to survive. So, there will be some modification in the world. We may be on the cusp of a_ _new evolutionary step. But if you're optimistic about the world as it now is, you're just simply not paying attention._\r\n> \r\n> [...]\r\n\r\n> _When you called, I was looking at an article with the headline, \"Arctic Ice Sheet Is Melting Faster Than Expected, Scientists Warn\". None of these things are slowing down. They're all going faster._\r\n\r\n> **_Wilkinson_**: _That's a really hard thing for people to grapple with when they're just thinking about day-to-day things._\r\n\r\n> **_Schrader_**: _We live in a world of denial. Before, choosing hope was kind of an option. Now it’s almost a requirement._\r\n\r\n> **_Wilkinson_**: _How do you think people grapple with the end in the face of faith? Can you have faith and hope and the certainty that something is going down in the near future?_\r\n\r\n> **_Schrader_**: _I don't know. I'm 72, so honestly, it's not really my problem. I can't imagine what it would be like to be 22._\r\n\r\n> **Wilkinson**: _A lot of this film does feel like it's trying to see if faith can position itself at all in our world._\r\n\r\n> **_Schrader_**: _That question that Michael asks - why should we bring life into this world? - is not a question people were asking 50 years ago._\r\n\r\n- \"Paul Schrader on _First Reformed_: \"This is a troubling film about a troubled person\"\" (Alissa Wilkinson); _Vox_ (June 18, 2018)\r\n\r\nMost reviews I've seen of _First Reforme_d have praised it as Paul Schrader's best work since either _Taxi Driver_ (1976) or _Raging Bull_ (1980). And whilst I think that's an oversimplification, unjustly ignoring such strong screenplays as _The Last Temptation of Christ_ (1988) and _Bringing Out the Dead_ (1999), and very unjustly ignoring such superb directorial work as _Affliction_ (1997) and _Auto Focus_ (2002), there can be little doubt that First Reformed is easily his best film of the last fifteen years or so. Which wouldn't be hard when you consider films like _The Canyons_ (2013), _Dying of the Light_ (2014), and _Dog Eat Dog_ (2016).\r\n\r\nThe film tells a deceptively simple story - Reverend Ernst Toller (Ethan Hawke) is the parish priest of a small congregation in the Snowbridge suburb of New York. A former military chaplain, Toller is struggling with the death of his son, Joseph, who he encouraged to enlist, and who was killed several months into his first tour in Iraq. As a result, Toller's marriage fell apart, with his wife blaming him for Joseph's death. As the film begins, Toller's spiritual crisis is already well under way. He's drinking too much, doesn't show much interest in his official duties, doesn't seem bothered that his congregation has dwindled to about ten people, and has taken to recording his thoughts in a journal which he plans to keep for one year, and then destroy. After Sunday mass, Toller is approached by Mary (Amanda Seyfried), one of his parishioners, who is worried about her husband, Michael (Philip Ettinger). A radical environmentalist who has just been released from prison in Canada, Michael has developed extreme nihilistic views, and wants Mary to abort their unborn child because he doesn't think anyone has the right to bring a child into a dying world. Although initially reluctant to get involved, Mary persuades Toller to counsel Michael. Meanwhile, the 250th anniversary of the First Reformed church from which Toller works is fast approaching, with a huge service to be attended by both the governor and mayor.\r\n\r\nThe above plot summary takes up roughly the first twenty minutes or so of the film, almost up to the end of the first act. At that point, it looks as if the narrative is heading in the direction of following Toller as he sets about changing Michael's extreme worldview. But that's not where it goes at all, instead focusing almost exclusively on the disintegration of Toller's faith, and the development of his own nihilistic outlook. Along the way, it introduces us to three main supporting characters – Reverend Joel Jeffers (Cedric Antonio Kyles) of Abundant Life, the megachurch that owns First Reformed, and who gave Toller his job; Esther (Victoria Hill), choirmaster at First Reformed, who had a brief sexual relationship with Toller after his marriage ended; and Edward Balq (Michael Gaston), an industrialist whose company is regarded as one of the worst polluters on the planet. As Toller wrestles with his conscience, he comes into conflict with all three in various ways. At the same time, Mary remains virtually the only remnant of hope in his life, as they continue to grow close.\r\n\r\nThe most striking thing to me about _First Reformed_ is that it is brilliantly shot in Academy ratio (1.37:1), and as a result, everything is boxed in, suggesting little room for movement, with very little empty space in the frame. Coupled with this, Schrader is remarkably consistent in composing perfectly symmetrical shots (the opening scene is a good example). Together, the small frame and the symmetrical compositions give one the impression of looking at a confessional, with the priest on one side and the confessor on the other. As Toller's journal entries occur throughout the film in the form of voiceover, this aesthetic replication of a confessional is enhanced even further - although Toller is not the priest hearing the confession, he is the one confessing.\r\n\r\nIn line with this, _First Reformed_ is not an easy film to watch. It's central themes are suffering, loss of faith, nihilism, and environmental catastrophe, and the way the film is shot, with the added intimacy of the journal, make it seems as if the audience is suffering right alongside Toller; we're drawn completely into his world, and even his mind, in a way very few films achieve. Schrader allows the content to brilliantly dictate the form, with the two becoming so intertwined as to be virtually indistinguishable from one another - a concept most filmmakers don't seem to even understand, let alone have the ability to accomplish. Interestingly this is the second film in the last twelve months to use Academy ratio for explicit narrative reasons, the other being David Lowery's superb _A Ghost Story_ (2017).\r\n\r\nOf course, Schrader is as cine-literate as they come, and doesn't make films in isolation (for example, there are at least three explicit visual references to _Taxi Driver_), and looking at First Reformed in relation to his career would require a full article-length study to itself. However, the film in his _oeuvre_ of which I was most reminded was, strangely enough, _Dominion: Prequel to the Exorcist_ (2005), which is not especially good, but which does share many of the same narrative beats and thematic concerns - a lost priest whose experiences of the darker side of humanity has led to him questioning his faith; a crisis of conscience; a righteous cause to which he totally gives himself over; an indifferent God watching everything unfold; an unimaginable sacrifice; hope offered in the form of an innocent. _First Reformed_ is a lot better, and a lot more morally complex, but there's certainly a thematic consistency.\r\n\r\nHowever, that is not to say _First Reformed_ is perfect. There are parts where it is extraordinarily clunky. For example, there's the wake where a group of environmentalists start singing an awful cappella version of Neil Young's activist song, \"Who's Gonna Stand up?\", or the scene where Mary and Toller take (figurative) flight through the power of holding hands (in a scene that reminded me of Joel Coen's _The Big Lebowski_ (1998) far more than I would imagine was intended, and got quite a few laughs at the screening I attended).\r\n\r\nAdditionally, although I've seen many reviews talking about how thought-provoking the environmentalist side of the story is, for me it never really coalesced into anything inherently coherent. Obviously, Toller is a man ready to fall apart when the movie begins, and Michael's concerns about the future of the planet serve as the catalyst for that. However, rather than the film presenting this as nothing more than the backdrop against which Toller's crisis takes place, and thus purposely rendering it unimportant in and of itself, Schrader seems to be trying to genuinely shoehorn in a call-to-action. Which is fairly out of place. And, to be honest, the photograph of the emaciated polar bear is far more disturbing and resonant than any of the facts and figures the film occasionally tosses out.\r\n\r\nI'm also not 100% convinced the black comedy worked. There aren't that many instances of it, but when they come, they are so black as to be easily missed. Probably the best example is when Toller is showing a group of children around First Reformed, and telling them how it was a stop on the Underground Railroad, showing them a secret basement in which the runaway slaves would hide. However, instead of simply giving them a quick history lesson, he ends up staring into the basement and giving a graphic description of what it must have been like hiding in the dark, scared and tired, with no room to move. There's a few moments like this, but I didn't think they really sat well with the ultra-realism on display elsewhere.\r\n\r\nBut they're minor faults, and all things considered, this is a high-quality film. Will it be in contention come awards season? Possibly. Schrader has always had a fraught relationship with the Academy (hard to believe he's never even been nominated for an Oscar), but this is the kind of serious subject matter that voters usually lap up. I certainly wouldn't be surprised to see Hawke get some acting nods, possibly Seyfried too. Irrespective of that (and we all know the amount of Oscar nominations a film gets has very little to do with its quality), this is a strong film made by a skilled artist about a subject matter for which he clearly feels deeply.", "created_at": "2019-04-26T01:38:27.268Z"}]