[{"movie_id": 804150, "review_id": "63f7d73d68b1ea0079cc0a45", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/cocaine-bear-review\r\n\r\n\"COCAINE BEAR offers what one expects from it: an absolutely INSANE bear wreaking gory, bloody havoc while also doing the stupidest things imaginable. A totally nonsensical yet extremely entertaining time where nothing else matters besides the bear who did cocaine.\"\r\n\r\nRating: B-", "created_at": "2023-02-23T21:14:37.835Z"}, {"movie_id": 804150, "review_id": "63fbe7b157176f007cfd8ce4", "author_rating": 7.0, "review_text": "OK, so the plot wears a little thin after a while but I really did quite enjoy this daft action adventure film. It all starts with a bloke tossing bags from an aircraft before he clonks his head on the door whilst leaving, mid-air, and next thing the police are identifying the body and a large duffle bag of cocaine. Where's the rest of it? Well out near the original \"glory hole\" at Cagney's Cavern a bear is having the time of her life - and snacking on just about anything that crosses her path - including Scandi tourists as an appetiser! A couple of kids \"Dee Dee\" (Brooklyn Prince) and \"Henry\" (Christian Convery) bunk off school to visit a waterfall and pretty soon her mother and the feisty park ranger \"Liz\" (Margo Martindale) are all trying to find them and stay one step ahead of the increasingly stoned apex predator. It's got funny moments, scary moments - downright silly moments; Martindale and the young Convery are good fun too, and there is even a bit of a moral to the story from \"Eddie\" (Alden Ehrenreich) who is determined to opt out of the drug dealing business of his ruthless dad \"Syd\" (Ray Liotta). It's not often folks laugh out loud in a cinema these days and folks did - as did I - tonight. Rocket science it isn't, but entertaining it certainly is and the bear has some nifty moves, too!", "created_at": "2023-02-26T23:13:53.693Z"}, {"movie_id": 804150, "review_id": "64020896c7176d009d6f855c", "author_rating": 5.0, "review_text": "After the initial hit of Cocaine Bear, the film left me scratching for something a little stronger.\r\n\r\nI think the main drawback of this film is that it is trying to do too much. There are seven to eight characters introduced throughout the course of the film, with each given significant time to develop their story and motivations. This takes a lot of time away from the main attraction, the cocaine bear. There is a period of almost 45 minutes where we are focused on these \"secondary\" characters, without any action or appearance of the cocaine bear. This section was pretty slow paced and started to lose me, but once the bear is re-introduced, the film gets significantly better. The paramedic scene was superb.\r\n\r\nThe comedy was pretty lackluster as well. The entire theater was laughing aloud, but I found myself only chuckling at a few jokes. This left the script feeling somewhat bland. But the lack of humor is made up for by the absolute brutality on display. There are some really messed up kills that do not shy away from the blood and gore. Some of the effects looked to be prosthetics as well, which always have an especially disgusting appearance to them.\r\n\r\nThe story overall was pretty decent, but the ending was atrocious and incredibly predictable. I found that it was really over the top and cheesy, but not in a good way. \r\n\r\nThe visual appearance of the bear was pretty solid. The CGI was done well but is spotty in a couple of scenes. Overall, I was slightly entertained by this film, but I can't help but feel it did not live up to its full potential.\r\n\r\nScore: 55% |\r\nVerdict: Average", "created_at": "2023-03-03T14:47:50.911Z"}, {"movie_id": 804150, "review_id": "64137bdd323eba00ef641969", "author_rating": 6.0, "review_text": "**Cocaine Bear delivers ridiculous creature violence on some goofy, short-lived characters, but its lack of consistent tone and identity kept it from being everything I had hoped.**\r\n\r\nLet’s start with this: I am a massive fan of lane creature movies - Ghost Shark, Sharknado, Lavalantula, The Sand - some of my favorites. So I expected to love Cocaine Bear. Sadly, I was a little underwhelmed. It wasn’t bad for what it was, but it didn’t dazzle me as I had hoped. Two things held it back for me:\r\n\r\n1. The tone inconsistently switched from a Zombieland-style ridiculous violence to a goofy crime movie to an odd family drama. Cocaine Bear had a minor identity crisis from start to finish.\r\n\r\n2. The movie tried to give each character a little backstory and development. While this is generally a good thing, in a low-budget creature movie, it slows down the nonsensical violence that the audience came for in the first place. Spend time on one or two characters but not all of them. I didn’t need to know about the drug lord’s grandson or the detective’s dog. I just need to see more people get eaten 😆.\r\n\r\nI appreciated the larger-budget kills and the oddball characters. If it continues, I will come back for a second try in this franchise, but ultimately I wasn’t high on Cocaine Bear (get it? 😜).", "created_at": "2023-03-16T20:28:13.170Z"}, {"movie_id": 804150, "review_id": "641d39ed8de0ae00ba4c7e35", "author_rating": 8.0, "review_text": "If you are viewing this film with some of the Oscar flicks in mind then you might see it as terrible. But if you are watching it for some good ole entertainment's sake, then this one is surely not a miss. A definite viewing which will make you smile and horrified at the same time. I loved it as a one time watch. Not so much the 2nd time though. If you are one of those who like to go critical on not-so-logical jokes, then give this a miss. But if you find life good to have a hearty laugh, then this one's for you.", "created_at": "2023-03-24T05:49:33.976Z"}, {"movie_id": 804150, "review_id": "6444cc97651fcf5b8a9d87ec", "author_rating": 4.0, "review_text": "There’s a bear high on mass quantities of illegal drugs that is going on a murderous rampage in a Tennessee state park in “Cocaine Bear,” an absolutely awful action / horror movie from director Elizabeth Banks. I understand with a premise like that, it’s supposed to be stupid. The problem is that the movie isn’t just dumb, it’s actually bad, with poor direction, acting, CGI, writing, and storytelling.\r\n\r\nLoosely based on true events (yes, really), the film is inspired by the 1985 story of a drug runner’s plane crash. In order to save a large quantity of cocaine, the man threw out several duffel bags full of the stuff over Tennessee and then jumped to his death when his parachute didn’t open. A black bear got into the drugs, consumed most of it and, according to experts, immediately died. This movie imagines what could have happened if the bear didn’t die from ingesting all that booger sugar. In this bloody and gory version, the 500 pound apex predator goes bananas and kills everyone in sight.\r\n\r\nIt’s a fictional story that is stretched too thin, especially with the meager subplots about a single mom (Keri Russell), her missing daughter (Brooklynn Prince) and friend (Christian Convery), a group of criminals (Ray Liotta, O’Shea Jackson Jr., Alden Ehrenreich), two park rangers (Margo Martindale, Jesse Tyler Ferguson), a police detective (Isiah Whitlock Jr.), and random tourists and teenagers that must think on their toes in order to avoid being the bear’s next victim. Jimmy Warden‘s script is atrocious because he’s trying to force a story that’s not at all compelling nor complex. The actors give clunky performances and character-wise, there just isn’t a whole lot to root for.\r\n\r\nBanks isn’t the most skilled director, and a film like this certainly doesn’t demand a whole lot of talent behind the camera. But there’s something that consistently feels “off” with her style and tone, especially in the random, mostly unsuccessful jokes. The humor didn’t work for me at all, and when I did muster a laugh, I wasn’t doing so because the movie was good — I was laughing because the movie was so dumb. I understand that a movie about a huge bear ingesting a bounty of blow is supposed to be dumb, but it also has to be good in order to work, and this movie is not.\r\n\r\nTo become a cult classic, a movie must be one that you’d want to watch on repeat. “Cocaine Bear” is simply not funny enough, not campy enough, and not kooky enough to succeed. It’s nothing but a one-joke trainwreck. \r\n\r\n**By: Louisa Moore / www.ScreenZealots.com**", "created_at": "2023-04-23T06:13:43.953Z"}, {"movie_id": 804150, "review_id": "647e3d6a0fb39800c129480f", "author_rating": 4.0, "review_text": "**_Not funny enough as a comedy and too silly to take serious_**\r\n \r\nIn 1985, several bags of cocaine fall from a drug smuggling plane in the mountainous area of northern Georgia and eastern Tennessee. Near Blood Mountain, a mother black bear eats a lot of the cocaine and goes on a bloody spree as it menaces hikers, rangers, thugs, EMTs and cops.\r\n\r\n“Cocaine Bear” (2023) is a campy creature feature inspired by the true story directed by, of all people, Elizabeth Banks. It was Ray Liotta’s second to last movie before his death on May 26, 2022. Keri Russell is on hand as the concerned mother of a tween hiker. In real-life the black bear weighed 175 lbs, but this was changed to almost 400 lbs for the movie.\r\n\r\nThe production unbelievably cost $35 million. I say “unbelievably” because this is a decidedly throwaway creature feature of the semi-goofy SyFy variety. The CGI is a little superior, but not enough to make any appreciable difference. I’m speaking as someone who enjoys some of the better SyFy flicks on occasion. A good example is “Sasquatch Mountain” (2006), aka “Devil on the Mountain,” which only cost $800,000.\r\n\r\nExcept for the lush scenery (shot in Ireland, locations listed below), this is decent but generally meh. It’s not humorous enough as a comedy, but you can’t take it serious either because it’s too goofy. It doesn’t help that Keri is the only female worth mentioning (as a footnote at that).\r\n\r\nHow this garnered as much attention as it did is a great mystery. “Grizzly Park” (2008) treaded similar terrain and, while far from a great movie, is more entertaining than this (at a fraction of the budget). \r\n\r\nThe film runs 1 hour, 35 minutes, and was shot south of Dublin, Ireland, in Barnaslingan, Powerscourt and, further south, Avoca.\r\n\r\nGRADE: C-", "created_at": "2023-06-05T19:54:18.923Z"}, {"movie_id": 804150, "review_id": "64808066bf31f2010032f1ec", "author_rating": 1.0, "review_text": "I got excited for this one, I mean it's 2023 and Cocaine Bear had the promise of NOT being political.  It had the promise of NOT having meh message.  It had the promise of NOT being serious.\r\n\r\nI mean, the bear was obviously the star.  People were going to see it because they wanted to see a giant bear high on coke killing people in a mindless and humorous way...\r\n\r\n... but.... something happened with the direction.  The humor was clearly there on paper.  That was evident enough, but the delivery was... meh.  The jokes didn't land because they ran too long, the timing was off, everything was there for it to be funny and fun... it just feels like it was made by a director that can't tell a joke.\r\n\r\nAnd it falls on the director, because the writer clearly can.  Everything is there to make it work.  But all the action is predictable and all the jokes are butchered.\r\n\r\nIn the hands of anyone else, this would have been hysterical fun.", "created_at": "2023-06-07T13:04:38.680Z"}, {"movie_id": 804150, "review_id": "648187f7d2b209012dfb87bc", "author_rating": 6.0, "review_text": "To say that Cocaine Bear isn’t the usual style of movie I like to watch is an understatement. My wife thought it had been involved in Academy Award talk of some kind and suggested we give it a try. Not sure where the Oscar talk came from but we stuck with it, barely. The violence is that excessive sort that horror fans demand, I guess. It was easy to get past it, once you internalize that it is all special effects and make believe, of course. There was just enough humor to keep us watching, though I am sure if they come out with a sequel, we won’t get drawn in a second time.", "created_at": "2023-06-08T07:49:11.176Z"}]