[{"movie_id": 76203, "review_id": "53a4def00e0a261432000650", "author_rating": null, "review_text": "Sometimes, I just have to stop my brain in the middle of a film and just admire its exceptional craftsmanship. I found myself doing that time and time again during this film. Perhaps I was more open to admiring the shot compositions and acting choices because, as I cynically told myself before the film, it's not like I needed much convincing that slavery was bad. Or perhaps it was because I was shielding myself from the honest brutalities the film convincingly portrayed. Nonetheless, I was reminded of the film \"Children of Men,\" because when I watched that, I was struck by how easily I could imagine a less engaging, more dumbed-down version of the same film. I haven't seen enough films about slavery to know this for certain, but I suspect that because many of this film's principals are British, telling a story about a free man who was forced into slavery, as opposed to one born into it, they were able to be gain some valuable distance from the subject and craft something that's both beautiful and feels true to life. And even though I thought I could not have been made to feel worse than I already did about slavery, the post-scripts on the lack of justice Solomon received for his kidnapping and the unknown causes of his death, helped keep the film from lapsing into a kind of \"triumph of the spirit\" happy ending others might have imposed.", "created_at": "2014-06-21T01:25:04.024Z"}, {"movie_id": 76203, "review_id": "5544ef0592514140a100181a", "author_rating": 8.0, "review_text": "This movie is very, very well done. Well, edited and with the proper long shots at the proper moments bringing you to the life of Solomon without remedy.\r\n\r\nAll the cast performs exceptionally well and Ejiofor is to be remembered for this film.\r\n\r\nA must to be seen.", "created_at": "2015-05-02T15:36:37.946Z"}, {"movie_id": 76203, "review_id": "58aac8dac3a3686ed9001f78", "author_rating": 8.0, "review_text": "Not in a long time have I seen a movie that brings out real emotions from my cold hearted soul. This movie brought them out in floods of tears.\r\n\r\nthe acting was superb, especially from the lead Chiwetel Ejiofor, he acted from his little toe right up to his eyes.\r\n\r\nThe style was also filmed beautifully with some (extremely) painful long shots which pulled you into Solomons nightmare.\r\n\r\nIm not sure if its a film I could watch again, purely for the emotion but I would recommend this film to everyone.", "created_at": "2017-02-20T10:45:46.127Z"}, {"movie_id": 76203, "review_id": "590b2ada9251414f99013f87", "author_rating": 10.0, "review_text": "**Dreaded at the thought that human kind ACTUALLY had this kind of livelihood at some point of time..**\r\n\r\nCould not gather my thoughts to write this review at the end of the movie.Feeling really bogged down by some heaviness on my chest. Thinking about the times in history when we actually used to do these atrocities on other human beings makes me cringe.To imagine waking up one day and find me in chains just because I'm a colored man and living my life like an unwanted child of god makes me question humanity altogether. Just sitting through a little over than 2 hours and watching this movie made my heart bleed, I can't even begin to think of the people who lived their entire lives as SLAVES... 12 years a slave heart breakingly makes you feel the pain and suffering of almost the entire human kind at one point of time or other. Direction by Steve McQueen is brilliant.Chiwetel Ejiofor plays a helpless slave in Solomon Northup to the hilt and also the small but impactive role played by Brad Pitt as a man with conscience is superb.Lupita Nyong'o's Patsey too was depicted heart warmingly. You can't help but question yourself that how could MAN stoop such low and do these cruel acts and that too over such a prolonged period of time without even a single ounce of doubt in his mind for what he would have to pay for his actions.. All in all a GEM of a movie showing one of the lowest point in human history !", "created_at": "2017-05-04T13:21:30.836Z"}]