[{"movie_id": 631843, "review_id": "6126819cd7059400682aa38d", "author_rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/old-spoiler-free-review\r\n\r\n\"Old is one of those cases of a remarkably unique, intriguing concept failing to reach its potential due to an overall disappointing execution of too many ideas. M. Night Shyamalan delivers yet another divisive film, tackling deeper themes associated with our relationship with time and how the latter impacts people in distinct ways. The trademark final act revelation not only negatively affects the main theme of the movie but also raises dozens of plot and character inconsistencies, too many to handle. The acting is surprisingly as poor as some of the awful dialogues, despite great casting concerning the kid-to-adult transitions. The main family's arc is one worth investing in, but there are too many disposable, irrelevant characters. The technically accurate, detailed cinematography might not be pleasant for every viewer, but the editing definitely lacks some finesse. Unfortunately, I can't defend Shyamalan too much on this one...\"\r\n\r\nRating: C-", "created_at": "2021-08-25T17:45:00.424Z"}, {"movie_id": 631843, "review_id": "61501234af95900026fe3886", "author_rating": 6.0, "review_text": "I liked Old not for its horror elements (at least the very little that it has) but for its themes about aging and regrets in life, something that hit home. There may be several flaws with this weird drama but the central theme of how we take life lightly when we are aging slowly really stayed with me. Recommended.", "created_at": "2021-09-26T06:24:52.368Z"}, {"movie_id": 631843, "review_id": "6240b1735f2b8d008bf82968", "author_rating": 6.0, "review_text": "I was really disappointed with this. It's an intriguing story from M. Night Shyamalan that is really let down by some lacklustre casting and a really lousy script. A few holidaymakers are taken to a beach where they discover that not only are they trapped there, but that they begin to age rapidly too... Can they escape? Sadly, I didn't really care - the characters are pretty unremarkable, and although the setting is beautiful the rest of it is slow and dull to watch. Rufus Sewell stands out as probably the worst of the bunch, but only marginally more so than an equally out of place Gael García Bernal who really did look like he was just waiting for his cheque to arrive. The last twenty minutes could have retrieved the situation had they be handled better, but what little jeopardy - or plausibility the story had had until then just evaporated. Shyamalan ought to have enough clout nowadays to ensure his quirky and intelligent stories are better presented in terms of talent and, especially given it's his own screenplay - writing too.", "created_at": "2022-03-27T18:48:19.245Z"}, {"movie_id": 631843, "review_id": "6276465895665811ec9ffd2c", "author_rating": 7.0, "review_text": "There is a low-rent movie review site we all know that I go to when I am deciding whether to watch a movie or program. I don’t go there because it is full of great reviews and accurate ratings, but rather because sometimes I find it is more revealing why a production gets poor reviews that what the actual ratings are.\r\n\r\nThere were a lot of negative reviews of Old, but not for the most common reasons, such as racism, or political hatred of multi-culturalism. No it appears a lot of the negativity is aimed the director Shyamalen because this is not The Sixth Sense.\r\n\r\nI thought the movie was okay, especially since I am not a horror fan at all. It isn’t great, but interesting enough to make it worth my time. I didn’t see the gaping plot holes or inconsistencies that reviewers mentioned but never got specific about. I didn’t feel the acting was bad. I mean, who knows how we would look and sound if life itself stopped making sense to us? If what happens to these people happened to me, I hope I could be forgiven for looking shell-shocked, acting lost, or staring uncomprehendingly at people around me. Seems like a perfectly reasonable reaction to me. We are jaded by the horror and suspense movies we watch, but would we make sense as people if we were living in one? \r\n\r\nAnyway, not a great film, but worth a peek if you take it at face value.", "created_at": "2022-05-07T10:13:44.806Z"}, {"movie_id": 631843, "review_id": "62bdf85fc1606a008bf2cf38", "author_rating": 3.0, "review_text": "Old is a very unique and interesting idea as a film. That is about the only positive thing I can say about it. The entire movie feels jumbled together, the pacing moves incredibly fast and choppy at some points, jumping from one small event to another. As a viewer you never get to sit in atmosphere of what has just occurred because it rips you away into another event. The writing in this film is simply not good. There is a ton of cheesy dialogue and character reactions that just do not make sense. I originally thought that the acting was just bad, but I think it has more to do with the material they are trying to work with. The cheesy lines can be fine if that was the style of film they were trying to make, but with the very serious and melodramatic tone it just comes off as awkward. There is a very weird and kind of off-putting direction that the story goes relating to the children that just made me uncomfortable as well. It is sad that this film had so much potential, and trailers really sell that potential, but what we were delivered was far from a quality film.\r\n\r\n**Verdict:** _Bad_", "created_at": "2022-06-30T19:24:15.346Z"}]