[{"movie_id": 136418, "review_id": "5c7f2baa925141277a1819e2", "author_rating": 9.0, "review_text": "surprising depth and quality\r\n\r\nExpecting yet another revenge/vigilante movie - Statham is an action guy, right? - I was disappointed, but in a very positive way. This movie has character development, good acting, and a story with more depth than to be expected. It's no psychological masterpiece, but it goes far beyond a simple action flick.\r\n\r\nIt starts out simple, though. Former soldier became drug addicted bum, living in the streets; by accident, he gets a way out. And into moral grey zones - very dark grey. \r\n\r\nThere is a love story in it, but it is a good one, I think; two complex characters each struggling with themselves, and their lives. And the most gripping part for me was where we see two people waiting, watching other people.\r\n\r\nFear not, it's not all artsy and emotional; there's a bit of action as well - solid quality, reliably delivered by Statham (and a good team). With a small side of humour. Violence is not the core of this movie; it's just part of the story. Which is a dark and gritty one.\r\n\r\nI found this movie worth my time, and memorable enough to write this review. Recommended.\r\n\r\nPS: Someone called this \"a thoughtful action movie or a violent art film\" - and very good in either function. I agree.", "created_at": "2019-03-06T02:08:42.890Z"}, {"movie_id": 136418, "review_id": "60ee62db11386c0047a8b06e", "author_rating": 8.0, "review_text": "An classic Jason Statham action film with quite a few unnecessary touches. Nevertheless, one of my favorites for its simplicity and feel-good story.", "created_at": "2021-07-14T04:06:51.175Z"}, {"movie_id": 136418, "review_id": "63b2423b66362700d707339a", "author_rating": 3.0, "review_text": "**Not Statham’s typical action film and, therefore, a letdown compared to what I was hoping to see.**\r\n\r\nPossibly the slowest and most depressing Statham movie I have seen so far. That doesn’t necessarily mean it’s terrible, but it is definitely not what I want to see when I watch a Statham movie. Most of the movie is his conversations with a nun doubting her belief in God and her “goodness,” while Statham wrestles with whether or not he can ever be a good man after the things he has done. Not much action or fighting. Mostly drinking and being miserable. I would pass on this one if you are looking for a Statham action film.", "created_at": "2023-01-02T02:32:27.179Z"}]