[{"movie_id": 567609, "review_id": "5d5d7b1ba3d02700160bfc08", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nOnce again, I didn’t know anything going into the theater regarding this movie. In fact, Ready or Not wasn’t even on my watchlist until the beginning of this week. I thought it was just going to be a passable and cheap horror flick, but the tremendously positive feedback from everyone around the world convinced me to give it a go. Fortunately, I wasn’t disappointed! Matt Bettinelli-Olpin and Tyler Gillett deliver a dumb yet entertaining film with a childish yet fun concept never really explored in the gruesome and bloody way they do.\r\n\r\nIt’s one of those movies which the only flaw they might have has to do with the viewer’s expectations. You’ll only dislike this story if you don’t accept its lighthearted tone. If you go in expecting a film filled with truly terrifying and scary sequences, you won’t get that. If you go in expecting a movie with a dark vibe and tonally heavy scenes, you won’t get that. It’s one of the most common issues that audiences have all over the world: unrealistic expectations. After watching the trailers, it’s clear that Ready or Not was always marketed as a horror-comedy with more emphasis on the dumb fun that the concept inevitably provides, so don’t expect something the producers didn’t even think of doing.\r\n\r\nHaving that in mind, the film definitely delivers what it promises. It’s a fast-paced hide-and-seek game, filled with suspenseful scenes and genuinely funny moments. Its short runtime doesn’t really let us care about every character, but to be fair, it’s not like it truly matters in this case. Samara Weaving plays the bride who has to hide while the rest of the family tries to find her. Overall, everyone gives good performances, but Weaving completely steals the show with fantastic reactions to different situations, always making space for an extra laugh.\r\n\r\nDespite the unique exploration of a strange premise, it has a pretty generic and even formulaic development, which is a bit of a letdown. Granted, the ending is, well, unexpected in the way that it is executed, but its final result is still very predictable. There’s a lot of cheesy moments, some do work, but others aren’t near as effective. The score is actually one of the surprises since it’s not usual for this feature to have such an impact in a rather simple movie. It provides a few chuckles with some witty lyrics, and it helps with elevating the suspense in the more tense sequences. It’s also mostly well-shot and set in one-location, something I always deeply appreciate. \r\n\r\nAll in all, Ready or Not accomplishes exactly what it set out to do. It delivers a fun and entertaining 90-minute hide-and-seek game like we’ve never seen before. Its R rating lets its makers do whatever they please with the amount of blood and goriness present in a scene, which ultimately culminates in a jaw-dropping, hilarious ending. Samara Weaving is brilliant as the main character, carrying the whole film on her shoulders. Is it cliche? Yes. Is it formulaic and predictable? Yes. Is it cheesy? Hell, yes. However, this movie never intended to be a groundbreaking achievement in the genre. It just wants to deliver good fun. And it does.\r\n\r\nRating: B-", "created_at": "2019-08-21T17:10:51.770Z"}, {"movie_id": 567609, "review_id": "5da13750b84f94001597c5d4", "author_rating": 7.0, "review_text": "**_An entertaining horror-comedy that takes aim at the decadence and insularity of the 1%_**\r\n\r\n>_So distribution should undo excess,/And each man have enough._\r\n\r\n- William Shakespeare; _His True Chronicle Historie of the life and death of King Lear, and his three Daughters. With the vnfortunate life of Edgar, sonne and heire to the Earle of Gloster, and his sullen and assumed humour of Tom of Bedlam_, 4.i.73-74 (1605-1606)\r\n\r\n>_In the long run, men inevitably become the victims of their wealth. They adapt their lives and habits to their money, not their money to their lives. It preoccupies t__heir thoughts, creates artificial needs, and draws a curtain between them and the world._\r\n\r\n- Herbert Croly; _The Promise of American Life_ (1909)\r\n\r\n>_I don't want to be married just to be married. I can't think of anything lonelier than spending the rest of my life with someone I can't talk to, or worse, someone I can't be silent with._\r\n\r\n- Mary Ann Shaffer; _The Guernsey Literary and Potato Peel Pie Society_ (2008)\r\n\r\nOn August 3, 2018, Patrick Crusius murdered 22 people and injured 24 in a mass shooting in El Paso, TX. Just over 12 hours later, Connor Betts murdered nine people and injured 17 in a mass shooting in Dayton, OH. On August 10, Universal Pictures announced they had pulled Craig Zobel's eagerly awaited film _The Hunt_ from its scheduled release date on September 27. Telling the story of 12 strangers who are hunted for the amusement of a group of wealthy elites, in the wake of the shootings, the film had been accused by hysterical conservatives of portraying liberal elites hunting Donald Trump supporters. On August 7, for example, Matt Margolis of _PJ Media_ wrote,\r\n\r\n>_in the past few days we've been hearing a lot about how Donald Trump's rhetoric is apparently to blame for the El Paso shooting, yet Hollywood apparently lacked the foresight to think that a movie promoting violence against \"deplorables\" might be in bad taste until after the shootings in El Paso and Dayton._\r\n\r\nHe also claimed, incorrectly, that the film was originally called _Red State Vs. Blue State_, before concluding,\r\n\r\n>_apparently, some in Hollywood are more than willing to promote violence against Trump supporters. Meanwhile, Democrats and liberals in the media want us to believe that it's Trump's rhetoric that needs to be toned down._\r\n\r\nOn August 9, Trump himself tweeted, \"_the movie coming out is made in order to inflame and cause chaos_\" (as opposed to his own balm-like rhetoric, which is renowned for bringing people together), saying of Hollywood in general, \"_they create their own violence, and then try to blame others. They are the true Racists, and are very bad for our Country!_\" (because responding to a mass shooting by condemning a film you haven't seen makes way more sense than, oh, I don't know, tightening gun laws and outlawing the indefensible sale of automatic weaponry to the public. Way more sense).\r\n\r\nSo, what does any of this have to do with _Ready or Not_? Well, it's just curious that _Ready or Not_ has a very similar plot (elites hunting common folk), yet it has arrived in theatres without the slightest hint of controversy. Of course, despite what right-wing commentators would have us think about _The Hunt_, the theme of elites hunting the less privileged is nothing new. As far as I'm aware, it was first explored in Richard Connell's short story \"The Most Dangerous Game\" (1924). And now in _Ready or Not_, except with tongue firmly in cheek. Written by Guy Busick and R. Christopher Murphy (aka Ryan Murphy), and directed by Matt Bettinelli-Olpin and Tyler Gillett, _Ready or Not_ is a horror-comedy and a social satire that comically exaggerates the anxieties attendant with marrying into a wealthy family and mocks the insular nature of such families, so obsessed with their wealth that they've become disconnected from the real world. And whilst it can be a tad episodic at times, and the manner in which it presents some of its violence is somewhat problematic, this is a very enjoyable and funny film that's well worth checking out.\r\n\r\nAfter a brief prologue, the film cuts to the wedding day of Grace (an exceptional Samara Weaving) and Alex Le Domas (Mark O'Brien). The Le Domas family started out printing playing cards but earned its fortune making board games, and the family has now become decadently wealthy, owning several sports franchises (when Grace asks Alex if they refer to themselves as an \"empire\", he half-jokingly says they prefer the term \"dominion\"). Several years previously, Alex turned his back on the family, even though he's in line to inherit the business, and it's only since he met Grace (a foster child eager to have a family to call her own) that he has started to rebuild bridges. His return to the fold has made his mother Becky (Andie McDowell) especially happy, and she makes sure Grace knows how appreciative she is. Alex's father, Tony (a barely sane Henry Czerny) is more ambivalent; he's polite and respectful to Grace, but she's convinced he doesn't like her. There's no such ambiguity with Helene (a hilariously acerbic Nicky Guadagni), Tony's sister, who makes no bones about the fact that she hates Grace. Elsewhere there's Alex's brother Daniel (Adam Brody), an alcoholic locked in a loveless marriage to Charity (Elyse Levesque), but who is deeply thankful that he has Alex back in his life. Offering Grace a get-out-of-jail card just prior to the wedding, Alex tells her if she wants to leave, he will let her go. She dismisses the offer, however, and the two are wed. Shortly thereafter, Alex and Daniel's cocaine-addicted sister Emilie (a wonderfully hapless Melanie Scrofano) and her husband Fitch Bradley (a scene-stealing Kristian Bruun) arrive at the estate, apologising for missing the ceremony. It's at this point that Alex explains a strange family tradition to Grace – whenever someone new marries into the clan, they must participate in a game, chosen at random by a mechanised box using a deck of cards (Charity got checkers when she married Daniel). Alex is worried that Grace might get the hide and seek card, but Tony assures him that's highly unlikely – stating that in his lifetime, only one person has ever gotten that card; Helene's husband (something of which we saw in the prologue). At a disturbingly austere ceremony, Grace is asked to operate the box and so the game can commence…and she receives the hide and seek card, with Tony explaining that the only way for her to win is to stay hidden until dawn. And so, Grace hides in the mansion, unaware that the family (_sans_ Alex) are arming themselves with crossbows, axes, hunting rifles, and assorted antique weaponry. This is no ordinary game of hide and seek.\r\n\r\nThe film's various psychoanalytical/satirical subtexts are fairly obvious – a lampooning of blue blood families clueless as to how the real world works, a savage deconstruction of the institution of marriage, and a gynocentric/fempowerment celebration of a woman fighting back against old-world patriarchy. In relation to these last two themes, nowhere are they more apparent than in Grace's wedding dress, that most classic symbol of marriage, which becomes dirtier and more damaged as the film progresses, with costume designer Avery Plewes using the dress to show the stages of Grace's symbolic dismantling of the institution of marriage (to survive the night, she must make the dress more conducive to running and hiding, which involves a lot of ripping and tearing). In this sense, each time Grace evades capture or strikes back against her pursuers, she is chipping away at the foundation of everything in which the Le Domas family believe, quite literally deconstructing the very concepts of marriage and old-world patriarchy.\r\n\r\nConcerning the film's engagement with wealth, essentially it suggests that, yes, as we all know, the rich are very different from you and I, but could it be that not only are they different, maybe they're actually evil? Maybe their wealth is built on the suffering of others in a very literal sense and maybe the difficulty they have accepting it when someone who they see as their social inferior marries into their circle manifests itself in actual violence. Of course, it's not suggesting this with anything even approaching realism, and much of the film's humour comes from the Le Domas family itself; sure, they're wealthy, evil, violent, and powerful. But so too are they hilariously incompetent. For example, it's been so long since anyone has got the hide and seek card that everyone is a little fuzzy on the rules, and they spend a good chunk of the film arguing with one another about the hunt – people like Fitch and Charity want to use modern weapons, but Tony maintains they have to use antique weaponry, nor are they allowed to use the castle's security cameras to track Grace.\r\n\r\nThis all goes back to a century-old deal made between the family's original patriarch Victor and a mysterious traveller named Mr Le Bail, who may, or may not, be Satan. Le Bail promised Victor that the family would become hugely wealthy, but only if they maintained the tradition of having new family members play a game on their wedding night, laying out the rules for what was to happen if they got the hide and seek card. Tony argues that the rules can be no different from those originally established by Le Bail, but, really, his argument never amounts to much more than \"_tradition...reasons_\". The film makes no bones about the fact that the family is comically inept, and it gets a lot of laughs out of showing characters trying to get to grips with their weapon – from Fitch taking time out from the hunt to look up \"how to use a crossbow\" videos on YouTube to Emilie accidentally dispatching several maids due to her inability to handle her weapon (more on this in a moment).\r\n\r\nAnother theme, although one not developed to the extent of the above, is religion. Le Bail, for example, is believed by the family to be a demonic figure, and his name, obviously enough, is an anagram of Belial, the demon from the Tanakh, who is described in _The War of the Sons of Light Against the Sons of Darkness_, one of the Dead Sea Scrolls, as the \"King of Evil\" and the \"Prince of Darkness\", and who would later form the basis for the Christian and Jewish depiction of Satan. On the other hand, Grace's name most likely references the idea of Divine grace, which is defined by _ChristianEducation.org_ as,\r\n\r\n>_a sharing in the divine life. It is the infused presence of God, a presence that is supernatural, not merely natural. Human persons are not born in a state of grace. And there is nothing we can do ourselves to earn grace. Rather, divine grace is favour, and it is freely bestowed._\r\n\r\nElsewhere, the film depicts a pit of slaughtered goats, alluding to ritual animal sacrifice, which is a pre-Christian practice. Goats are also important in Christianity, especially in the practice of scapegoating, whereby a goat takes upon them the sins of the community and is cast into the desert, symbolically removing the taint of those sins (as per Leviticus 16:8-10; \"_Aaron shall cast lots upon the two goats; one lot for the LORD, and the other lot for the scapegoat. And Aaron shall bring the goat on which the LORD's lot fell, and offer it as a sin offering. But the goat, on which the lot fell to be the scapegoat, shall be presented alive before the LORD, to make an atonement with him, and to let him go for a scapegoat into the wilderness._\") Along the same lines, Grace injures her hand on a nail, in a veiled reference to the Stigmata. However, whether or not we're supposed to interpret her as a Christ figure is hard to say as, although these references are interesting in isolation, they never really coalesce into anything concrete.\r\n\r\nLooking at some other problems, despite its themes, the film is, generally speaking, very slight; it's short and it's silly, and it's not going to change your life or lead you down the road of esoteric revolution. The violence is also (somewhat) problematic. The film maintains the stance that the rich are insane and the violence they mete out is contemptible. However, some of the biggest laughs are reserved for Emilie's accidental killing of the maids. And I have to admit, I found the way she haplessly dispatches two of them exceptionally funny (especially her comment after the second one, \"_why does this keep happening to me_\"). Also funny is that after one of the kills, the family are trying to have a conversation, which is continually interrupted by the gurgling of a mortally wounded maid; until Helene takes an axe to her head. And again, I have to admit, I laughed a lot at that scene, even though I recognised that the film was essentially asking the audience to see this violence as funny but some of the violence elsewhere as not so much.\r\n\r\nIn this sense, it kind of wants to have its cake and eat it. In _Natural Born Killers_ (1994), Oliver Stone gets away with asking the audience to laugh at horrific violence because he's fairly consistent in depicting all violence as funny (whether it's being shot by a bullet that stops in mid-air, getting drowned in a fish tank and simultaneously beaten with a tire-iron, having a perfectly circular hole shot through your hand, or having your head literally ripped off by rioting inmates). Here, the film picks and chooses when the audience should laugh; it takes Grace's stakes seriously but also encourages us to laugh at some (and only some) of the violence, which is problematically inconsistent.\r\n\r\nNevertheless, as I said, these scenes did make me laugh, so make of that what you will (it may say more about me than the film). Although _Ready or Not_ is slight, its satirical ire is focused, even if the tendency towards irreverence doesn't always chime with the tone of the socio-political agenda. Is it the greatest horror-comedy of all time? Good Lord, no. Indeed, it doesn't have much in the way of scares at all. But it sure is funny, allegorically skewering inherited wealth, marriage, tradition, even religion on occasion. With atavistic rules and sense of entitlement, the Le Domas family embody the concept that old-money can lead to an insularity from modernity, preventing the work-a-day world from entering their gated estates. Offering us a match, the film suggests that perhaps the only way to deal with such irrelevancies and their sense of self-importance is to burn them to the ground. And it has a blast showing us why.", "created_at": "2019-10-12T02:15:44.056Z"}, {"movie_id": 567609, "review_id": "5db02cac09dda40011e0dd46", "author_rating": 6.0, "review_text": "‘Ready or Not’ doesn’t sport as many laughs as you'd want for this ridiculous story, nor is it dark enough to be a true horror; it's just gory and violent with the occasional jump scare and anxiety-ridden scene. So while it doesn’t meet expectations or desires, it’s still a fun, thrilling, wicked romp through the blood-soaked mansion and goat barn. \r\n\r\nSo prepare yourself for squeals of fear, squeals of delight, squeals of patriotism and the occasional giggled “WTF!?”... because here it comes!\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-ready-or-not-not-quite-horror-not-quite-comedy-but-a-wickedly-good-time", "created_at": "2019-10-23T10:34:20.384Z"}, {"movie_id": 567609, "review_id": "5de8056728723c0018784012", "author_rating": 7.0, "review_text": "Fun little horror-thriller-(dark)comedy that was entertaining enough and features a great performance from Samara Weaving, who has similar command of the scene like her uncle. Story-wise, not groundbreaking but as someone who generally doesn't enjoy dark comedies, this one worked for me. **3.5/5**", "created_at": "2019-12-04T19:13:43.731Z"}, {"movie_id": 567609, "review_id": "5e0749bdd236e600109f0acc", "author_rating": 6.0, "review_text": "I've never kept it secret that I have a personal issue with Samara Weaving, but I try to keep things like that out of my mind, and, even though I know it's impossible to be truly objective about something as subjective as art, at least attempt to be **impartial**. And bearing that in mind, _Ready or Not_ is... Okay. Pretty good even. Disappointing, if I'm honest, given the hype and the trailer, but still. Pretty good. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-12-28T12:25:33.082Z"}, {"movie_id": 567609, "review_id": "5f20aa97d4d5090035178440", "author_rating": 8.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nThis is such a great crazy, survivalist premise: an average lady that just wants to marry her man gets served up into a human hunting game, and she's a bad ass.  Samara Weaving nails every aspect of this role.  I did recognize a couple other actors: Melanie Scrofano (Wyanna Earp), Adam Brody, and Andie MacDowell, but none of the family really stands out other than Melanie, and that is more of circumstance, but they put the right person in that role at least.\r\n\r\nThe setting is limited to the estate grounds, but even if they built the sets for that place, it is bloody amazing and lends to the visuals both when they're displaying the house as being expansion and when they're showing it as a trap.\r\n\r\nI'm actually short on words to why it is as good as it is, the writing is top notch and the set it great, but the acting is only good (other than Samara), and there aren't huge effects.  Maybe it's the subtly of the effects they do show, and the details they go into in both presentation of the scene and the chosen dialogue.  This movie definitely creates a permeable atmosphere for the audience.\r\n\r\nIf you're okay with blood / gore / violence, then give it a go, it should be a good time.", "created_at": "2020-07-28T22:45:43.350Z"}, {"movie_id": 567609, "review_id": "5f9a34ef079a970038438b51", "author_rating": 8.0, "review_text": "The excellent Samara Weaving is the antithesis of a scream queen. With kick-ass roles in \"The Babysitter,\" \"Mayhem,\" and \"Guns Akimbo,\" she is vying with Harley Quinn as the \"vixen\" of modern cinema. An outrageous story with just the right balance of camp and horror, \"Ready or Not\" is a fun romp through the worst-ever wedding night.", "created_at": "2020-10-29T03:20:15.042Z"}, {"movie_id": 567609, "review_id": "61ed2596cedac4001cac9c5d", "author_rating": 7.0, "review_text": "⭐⭐⭐⭐\r\nGood solid entertainment. Nothing really special, or twisty, but a great execution (unfortunately rare these days). This is how movies like Boss Level or Wrath of Man should've been made. \r\n\r\n* Short runtime ✅\r\n* Never slows down ✅", "created_at": "2022-01-23T09:53:26.073Z"}, {"movie_id": 567609, "review_id": "62d11d8cf6787a004d70b811", "author_rating": 7.0, "review_text": "When \"Grace\" (Samara Weaving) marries \"Alex\" (Mark O'Brien) she thinks it will be the happiest day of her life. Gathered at his family's sprawling mansion, the ceremony is followed by a small dinner at which \"Tony\" (Henry Czerny) announces that it is traditional on such occasions to play a game. A game of hide and seek. A lethal, deadly and downright dangerous game of hide and seek with poor, unsuspecting, \"Grace\" the target. The family count to two hundred then set off with all sorts of weapons (they cannot use guns nor the house's security cameras) to eliminate her. With her newlywed husband securely tied to the bed after he tried to help her, and still clad in her wedding dress, she must find a way to avoid execution and escape the grisly fate that awaits her. Luckily for her, \"Dan\" (Adam Brody) is a little less sold on the game so perhaps, just perhaps, she has a chance? Weaving reminded me a little of Margot Robbie as she gradually adapts to her perilous scenario, and what ensues is actually quite entertaining with some fun contributions from the pursuing family - \"Becky\" (Andie MacDowell) and \"Charity\" (Elyse Levesque). The film looks good, is well paced after a shaky start and a house riddled with secret passages provides an solid template for the drama to unfold. It does have something of the theatrical to it, but that's quite effective as it builds to quite an enjoyably fitting conclusion. It's not laugh out loud, but is certainly worth ninety minutes of your time and is way better than the contemporary, silmilarly styled, \"Knives Out\".", "created_at": "2022-07-15T07:55:56.589Z"}, {"movie_id": 567609, "review_id": "62dfa87a5aba32004d1e1b12", "author_rating": 4.0, "review_text": "Drawn out to absurdity... Predictable and long winded.", "created_at": "2022-07-26T08:40:26.861Z"}, {"movie_id": 567609, "review_id": "63097de9c39266007f19ec88", "author_rating": 8.0, "review_text": "**In a world of remakes, Ready or Not brings a bold new take on fun old horror.**\r\n\r\nIt’s no wonder Ready Or Not’s directing duo was asked to take over the Scream franchise. This film has Scream’s dark humor dripping from every kill, every snarky one-liner, and every fully embraced horror trope. Ready or Not is a beautiful mixture of Scream, Clue, and The Most Dangerous Game, all held together by Samara Weaving’s fantastic performance. Bettinelli-Olpin and Gillett are the masters of taking over used horror tropes and using them to tease and subvert expectations creating dark, fun, and tense movies that delight any horror fan. Ready or Not does just that with a story that feels familiar and surprising, recognizable and innovative, resulting in an original slasher filled with charm and chills.", "created_at": "2022-08-27T02:14:01.866Z"}]