[{"movie_id": 614560, "review_id": "5fb73aa5e24e3a003f3d9c80", "author_rating": 10.0, "review_text": "Rather than a burst of cinematic energy, 'Mank' is a considered, meticulous, subtle and ultimately furious film, one that continues to grow in your mind hours after seeing it. Even after two viewings, I can still hear my mind chewing over every second, my heart quietly racing as I consider its individual moments of genius. This isn't some nostalgic elegy to a great film or a great artist, but a damning portrait of how systems of power can be misused, and how good men find themselves complicit. It speaks ferociously to our contemporary world, and reminds us of the important role of art in a functioning society. In that sense, 'Mank' isn't a film about cinema; it's a film that asks what the point of cinema even is. It's a powerful, rebellious question to ask, and the kind of question only a filmmaker as skilled as David Fincher would dare to, and the imagination to find the answer. In the process, he may have just delivered the best film of the year.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-mank-a-dazzling-damnation-of-the-hypocrisy-of-power", "created_at": "2020-11-20T03:40:21.787Z"}, {"movie_id": 614560, "review_id": "5fc3db802bcf67003ec0c769", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis last week of mine has been one of the most challenging I've ever had since I started this project. Not only due to the number of David Fincher's films (Se7en, Fight Club, Zodiac, The Social Network, Gone Girl) I (re)watched in preparation for Mank (plus Citizen Kane), but also because these aren't exactly movies I usually review this quick. Since Zodiac was the only first-watch of this bunch, I was able to surprise myself and fly through the writing process, actually managing to deliver each article daily as I idealized. Finally, the time for one of Netflix's biggest baits for the upcoming awards season had arrived, so I watched Fincher's latest yesterday night.\r\n\r\nClearly, I'm a fan of Fincher's style, as my opinions about his filmography prove, so I always expect one of the best films of the respective year to come out of his work. However, having in mind the biographical premise, I know that this type of movie heavily relies on its storytelling. In my case, if a film like this isn't able to offer me new relevant information about a subject I already possess some knowledge of, then inevitably I'll end up disappointed. Even if I still receive these new story details, the transmission must be performed in a compelling manner, which usually these movies fail to do, basing their scripts too much on lazy exposition. So, I tried to keep my expectations moderately high yet realistic and hopeful.\r\n\r\nBefore I share my thoughts, a quick disclaimer. Mank will undoubtedly generate quite a divisive response from the general public. Why? From something as simple as the fact that the film is on black-and-white to the crime that is people not knowing a single thing about Citizen Kane (including never seeing it) but still choosing to watch Mank, there will be countless examples of viewers who will watch the latter with terribly unrealistic expectations. Audiences all around the world will find this movie \"boring, uneventful\", and say stuff like, \"I fell asleep five minutes in\", \"another artsy B&W uninteresting film for critics to blindly love\". Some of these comments will unavoidably come from people who just sat on their couch and clicked a random flick that they saw on Netflix.\r\n\r\nThe marketing campaign could never place a pre-requirement to watch Mank, but I can, and I will. As straightforward and honest as I possibly can: if you've never watched Citizen Kane in your life, then either you do it before even opening your streaming service, or please, skip Mank because you'll probably not enjoy it at all. I firmly believe only 1/1000 viewers will like the latter if they have zero knowledge about Orson Welles' iconic movie. Ideally, (re)watch it, and research a bit about its background: what lead to the creation of the film, who was involved, what controversies surrounded the movie… I know what you're thinking: isn't that what Mank is supposed to tell me about? This takes me to one of my issues with the film. \r\n\r\nThere are basically two options in this genre: either the director and/or the screenwriter choose to help the audience follow the story by introducing them to what they will witness, or they jump straight into the narrative itself. Fincher doesn't waste a second helping the audience understand what's happening or, in some cases, who even are the characters. Either the viewers know what they're getting themselves into (like I advise above) or prepare yourself for an incredibly intricate narrative, wholly packed with flashbacks, side stories, and many, many characters.\r\n\r\nThis will be a significant reason why some people will definitely dislike this movie. I researched and studied Citizen Kane to exhaustion, and I still felt lost during some periods due to the overwhelming amount of subplots and its characters. Then, even though the following is connected to one of the aspects I love the most about Mank, there are at least a couple of other characters besides Herman J. Mankiewicz who I wish I could have learned more about, mainly Marion Davies (Amanda Seyfried) and Joseph L. Mankiewicz (Tom Pelphrey), the protagonist's brother. On the other hand, this also means that despite the high number of characters, most are indeed quite interesting, possessing emotionally compelling arcs.\r\n \r\nI just noticed I started my review stating my issues with the film, but don't be mistaken: I really, really like it. However, since I'm already here, I might as well let out my remaining problem. So, this isn't close to anything Fincher has done before. It genuinely feels like a remarkably personal project that he surely would have loved to share with his late father, Mank's posthumously screenwriter, Jack Fincher (I'll refer to him as Jack from now on, keeping Fincher related to David). If there's one thing I expected from this movie was Fincher paying homage to Citizen Kane through the technical aspects, including the narrative structure profoundly based on flashbacks to justify a particular opinion, conversation, or event happening in the present.\r\n\r\nEvidently, Mank follows the exact same storytelling method as Citizen Kane, and despite it being a brilliant decision from David and/or Jack Fincher, the former lets it take over the story instead of elevating it. The flashbacks are mostly earned and well-placed in the narrative, but sometimes it comes across as a mere technical feature exclusively to make that comparison with Citizen Kane, instead of its execution improving the story both Fincher want to tell. Nevertheless, these issues of mine are far from ruining the entire viewing, much on the contrary. \r\n\r\nWhen it comes to my number one requirement, Fincher nails it perfectly. I loved getting to know the real-life inspirations that led Mankiewicz to create one of the greatest screenplays of all-time, as well as the shocking (and unknown to me) conditions he had to work on. It's truly a filmmaking miracle to be able to write a masterpiece in the space of two months, being physically and mentally debilitated. Despite the imperfect efficiency of the flashbacks, most develop impactful characters in Mankiewicz's life, and I can't deny that it's a joy for any film lover to see or even hear the mention of some famous filmmakers from that time. Nevertheless, a character is only as great as the actor who portrays it (and vice-versa).\r\n\r\nGary Oldman is undoubtedly a contender for this year's Best Actor awards. It would be a major snub for him not to be exhaustingly nominated on every single ceremony. I believe his performance in Darkest Hour as Winston Churchill is more visibly riveting (I've never been so captivated during a war drama before), but his phenomenal display in Mank is hard to deny. From his hilarious yet grounded portrayal of a drunk Mankiewicz to his more sober, sincere attitude, Oldman demonstrates mind-blowing variation, with his physical performance having a notable influence on the overall result. There's no doubt that he carries the entire narrative on his shoulders, and he does it effortlessly.\r\n\r\nHowever, Oldman is far from being the only bright spot. Amanda Seyfried can very well get her first serious awards season as the extremely captivating Marion Davies. Seyfried manages to deliver an exquisite balance between the purposefully exaggerated voice mannerisms and Marion's real personality. Tom Pelphrey is also extraordinary as Mankiewicz's brother, whom I immediately researched about as soon as I finished the movie. The intensity with which Pelphrey expresses some sentences is becoming one of his trademark characteristics. \r\n\r\nI've seen many people talking about these two actors, but Lily Collins (Rita Alexander) portrays my favorite character besides the protagonist. As Mankiewicz's secretary, Lily explores her character in such a heartfelt, authentic manner that, at times, I wished to go back to the present not because of learning more about Citizen Kane's screenplay actually being written, but due to Rita Alexander's interactions with her \"boss\". Their conversations are some of the most satisfying moments of the entire film, and I genuinely cared for both of them.\r\n\r\nI know that most of my readers probably don't care about technicalities, but if you've been following me for enough time, you know I value the technical aspects when they significantly impact the movie. Well, I dare state that a massive reason why I enjoy Mank so much is the near-perfect technical homage that Fincher pays to Orson Welles' precedent-setting film. From tiny little details like a \"cigarette burn\" here and there (I counted eight, and if you don't know what this means, then you clearly didn't watch Citizen Kane) to similar shot composition, Fincher creates flawless resemblances to the \"greatest movie of all-time\" in almost every scene, including his own version of a \"Rosebud\" moment.\r\n\r\nThis obviously means that Erik Messerschmidt's cinematography is absolutely stunning. Erik previously worked with Fincher on Mindhunter, proving now that his film career still has a lot of ground to cover. Kirk Baxter could very well be nominated for Best Film Editing, and I can easily picture the exact scene the ceremony would show to demonstrate the seamless, clean cuts which make dialogues easier to follow. Donald Graham Burt, who has worked with Fincher since Zodiac, offers an exceptional production design, but it's Trent Reznor and Atticus Ross' score that steals the show for me. Using only period-authentic instruments, Reznor and Ross deliver a rich, unique, memorable tribute to Bernard Herrmann's work.\r\n\r\nAll in all, Netflix releases another massive contender for the awards season, Mank. With the perfectionist, dedicated David Fincher at the helm, his late father's screenplay ends up being Fincher's most personal project so far. It's a wonderful homage not only to Citizen Kane but also to the 30s/40s decades. Technically, every single component is award-worthy: cinematography, editing, production design, and especially the score. Fincher works with his team to deliver impressively similar iconic scenes and precedent-setting technical characteristics from Orson Welles' impactful movie. Outstanding performances across the board, but expect nominations flying the way of Gary Oldman, Amanda Seyfried, and Lily Collins. However, Fincher's identical narrative structure to the 1941's flick sometimes feels just like a clever tribute instead of actually elevating the story. Jack Fincher's screenplay is overwhelmingly crowded with side stories and characters, making it challenging to follow comprehensibly, especially for viewers without any knowledge about the respective matter. Fortunately, the primary mission of representing Herman J. Mankiewicz's real-life inspirations that led to arguably one of the best screenplays ever written is flawlessly accomplished, making Mank a must-see for any film lover, as long as the viewer has at least watched the so-called \"greatest movie of all-time\".\r\n\r\nRating: A-", "created_at": "2020-11-29T17:33:52.168Z"}, {"movie_id": 614560, "review_id": "603885f168b1ea0057e0f631", "author_rating": 8.0, "review_text": "A fascinating look about what supposedly went into <em>'Citizen Kane'</em>.\r\n\r\n<em>'Mank'</em>, a biopic about screenwriter Herman J. Mankiewicz, is a very good watch. A lot goes on and it's pretty much all interesting to see, admittedly you'd need to have seen the 1941 film. I like that they done this in a non-linear format and in black-and-white, à la in '41.\r\n\r\nKudos to the cast. Gary Oldman (Herman) is impressive, I did feel he was overacting - likewise with Amanda Seyfried (Marion) - just a little bit in parts but for the vast, vast majority he (and she) is top notch. Arliss Howard (Mayer), Lily Collins (Rita) and a few others are also pleasing to watch.", "created_at": "2021-02-26T05:24:01.897Z"}, {"movie_id": 614560, "review_id": "64b4b72423d27800c93cb477", "author_rating": 7.0, "review_text": "This features another quite impressive, powerful, performance from Gary Oldman as David Fincher uses his stylish and authentic portrayal of the borderline iconoclast Herman J. Mankiewicz to take us on a tour of Hollywood in the 1930s. It's told by way of flashback, as the bed-ridden Oldman is working on his screenplay for \"Citizen Kane\" and through his frequently drunken hazes we experience much of the politics, bigotry, misogyny, and pretty blatant corruption that prevailed in the upper echelons of the studio system as espoused by the likes of Louis B. Meyer (Arliss Howard); Irving Thalberg (Ferdinand Kingsley) and most especially the king of the hill - WR Hearst (Charles Dance). The monochrome photography adds much to the rich look of the film, and Jack Fincher provided the star with some wonderfully eloquent (often wittily loquacious) monologues - particularly towards the end as his battle against the booze starts to become more of an effort for him to fight and his friends begin to redefine their relationship with him. I was less impressed with the supporting cast - Dance dressed like a circus ringmaster for much of the time and Amanda Seyfried and Lily Collins struggled to make much of an impact, even though both roles are significant in the lives of Mankiewicz and Hearst respectively. It's a considered work, this - it doesn't dwell on the salaciousness of the scenarios; indeed it seems hell bent on avoiding dirtying it's hands with any of the concomitant scandal that accompanied the era, and that is quite odd. It robs the storyline of the oxygen of the underling politics and power-broking that created the ambience Mankiewicz so resented - even loathed. I saw it on the big screen about a day before Netflix rolled it out, and on balance I think a television viewing is all this needs. It's good - but not great.", "created_at": "2023-07-17T03:36:04.785Z"}, {"movie_id": 614560, "review_id": "64b52dd437806200ad159258", "author_rating": 6.0, "review_text": "The sequence of events was the reason for repeating the movie and watching it more than once. Never mind if you are not following the history of Hollywood, you will feel weary and bored.", "created_at": "2023-07-17T12:02:28.145Z"}, {"movie_id": 614560, "review_id": "5fb73aa5e24e3a003f3d9c80", "author_rating": 10.0, "review_text": "Rather than a burst of cinematic energy, 'Mank' is a considered, meticulous, subtle and ultimately furious film, one that continues to grow in your mind hours after seeing it. Even after two viewings, I can still hear my mind chewing over every second, my heart quietly racing as I consider its individual moments of genius. This isn't some nostalgic elegy to a great film or a great artist, but a damning portrait of how systems of power can be misused, and how good men find themselves complicit. It speaks ferociously to our contemporary world, and reminds us of the important role of art in a functioning society. In that sense, 'Mank' isn't a film about cinema; it's a film that asks what the point of cinema even is. It's a powerful, rebellious question to ask, and the kind of question only a filmmaker as skilled as David Fincher would dare to, and the imagination to find the answer. In the process, he may have just delivered the best film of the year.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-mank-a-dazzling-damnation-of-the-hypocrisy-of-power", "created_at": "2020-11-20T03:40:21.787Z"}, {"movie_id": 614560, "review_id": "5fc3db802bcf67003ec0c769", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis last week of mine has been one of the most challenging I've ever had since I started this project. Not only due to the number of David Fincher's films (Se7en, Fight Club, Zodiac, The Social Network, Gone Girl) I (re)watched in preparation for Mank (plus Citizen Kane), but also because these aren't exactly movies I usually review this quick. Since Zodiac was the only first-watch of this bunch, I was able to surprise myself and fly through the writing process, actually managing to deliver each article daily as I idealized. Finally, the time for one of Netflix's biggest baits for the upcoming awards season had arrived, so I watched Fincher's latest yesterday night.\r\n\r\nClearly, I'm a fan of Fincher's style, as my opinions about his filmography prove, so I always expect one of the best films of the respective year to come out of his work. However, having in mind the biographical premise, I know that this type of movie heavily relies on its storytelling. In my case, if a film like this isn't able to offer me new relevant information about a subject I already possess some knowledge of, then inevitably I'll end up disappointed. Even if I still receive these new story details, the transmission must be performed in a compelling manner, which usually these movies fail to do, basing their scripts too much on lazy exposition. So, I tried to keep my expectations moderately high yet realistic and hopeful.\r\n\r\nBefore I share my thoughts, a quick disclaimer. Mank will undoubtedly generate quite a divisive response from the general public. Why? From something as simple as the fact that the film is on black-and-white to the crime that is people not knowing a single thing about Citizen Kane (including never seeing it) but still choosing to watch Mank, there will be countless examples of viewers who will watch the latter with terribly unrealistic expectations. Audiences all around the world will find this movie \"boring, uneventful\", and say stuff like, \"I fell asleep five minutes in\", \"another artsy B&W uninteresting film for critics to blindly love\". Some of these comments will unavoidably come from people who just sat on their couch and clicked a random flick that they saw on Netflix.\r\n\r\nThe marketing campaign could never place a pre-requirement to watch Mank, but I can, and I will. As straightforward and honest as I possibly can: if you've never watched Citizen Kane in your life, then either you do it before even opening your streaming service, or please, skip Mank because you'll probably not enjoy it at all. I firmly believe only 1/1000 viewers will like the latter if they have zero knowledge about Orson Welles' iconic movie. Ideally, (re)watch it, and research a bit about its background: what lead to the creation of the film, who was involved, what controversies surrounded the movie… I know what you're thinking: isn't that what Mank is supposed to tell me about? This takes me to one of my issues with the film. \r\n\r\nThere are basically two options in this genre: either the director and/or the screenwriter choose to help the audience follow the story by introducing them to what they will witness, or they jump straight into the narrative itself. Fincher doesn't waste a second helping the audience understand what's happening or, in some cases, who even are the characters. Either the viewers know what they're getting themselves into (like I advise above) or prepare yourself for an incredibly intricate narrative, wholly packed with flashbacks, side stories, and many, many characters.\r\n\r\nThis will be a significant reason why some people will definitely dislike this movie. I researched and studied Citizen Kane to exhaustion, and I still felt lost during some periods due to the overwhelming amount of subplots and its characters. Then, even though the following is connected to one of the aspects I love the most about Mank, there are at least a couple of other characters besides Herman J. Mankiewicz who I wish I could have learned more about, mainly Marion Davies (Amanda Seyfried) and Joseph L. Mankiewicz (Tom Pelphrey), the protagonist's brother. On the other hand, this also means that despite the high number of characters, most are indeed quite interesting, possessing emotionally compelling arcs.\r\n \r\nI just noticed I started my review stating my issues with the film, but don't be mistaken: I really, really like it. However, since I'm already here, I might as well let out my remaining problem. So, this isn't close to anything Fincher has done before. It genuinely feels like a remarkably personal project that he surely would have loved to share with his late father, Mank's posthumously screenwriter, Jack Fincher (I'll refer to him as Jack from now on, keeping Fincher related to David). If there's one thing I expected from this movie was Fincher paying homage to Citizen Kane through the technical aspects, including the narrative structure profoundly based on flashbacks to justify a particular opinion, conversation, or event happening in the present.\r\n\r\nEvidently, Mank follows the exact same storytelling method as Citizen Kane, and despite it being a brilliant decision from David and/or Jack Fincher, the former lets it take over the story instead of elevating it. The flashbacks are mostly earned and well-placed in the narrative, but sometimes it comes across as a mere technical feature exclusively to make that comparison with Citizen Kane, instead of its execution improving the story both Fincher want to tell. Nevertheless, these issues of mine are far from ruining the entire viewing, much on the contrary. \r\n\r\nWhen it comes to my number one requirement, Fincher nails it perfectly. I loved getting to know the real-life inspirations that led Mankiewicz to create one of the greatest screenplays of all-time, as well as the shocking (and unknown to me) conditions he had to work on. It's truly a filmmaking miracle to be able to write a masterpiece in the space of two months, being physically and mentally debilitated. Despite the imperfect efficiency of the flashbacks, most develop impactful characters in Mankiewicz's life, and I can't deny that it's a joy for any film lover to see or even hear the mention of some famous filmmakers from that time. Nevertheless, a character is only as great as the actor who portrays it (and vice-versa).\r\n\r\nGary Oldman is undoubtedly a contender for this year's Best Actor awards. It would be a major snub for him not to be exhaustingly nominated on every single ceremony. I believe his performance in Darkest Hour as Winston Churchill is more visibly riveting (I've never been so captivated during a war drama before), but his phenomenal display in Mank is hard to deny. From his hilarious yet grounded portrayal of a drunk Mankiewicz to his more sober, sincere attitude, Oldman demonstrates mind-blowing variation, with his physical performance having a notable influence on the overall result. There's no doubt that he carries the entire narrative on his shoulders, and he does it effortlessly.\r\n\r\nHowever, Oldman is far from being the only bright spot. Amanda Seyfried can very well get her first serious awards season as the extremely captivating Marion Davies. Seyfried manages to deliver an exquisite balance between the purposefully exaggerated voice mannerisms and Marion's real personality. Tom Pelphrey is also extraordinary as Mankiewicz's brother, whom I immediately researched about as soon as I finished the movie. The intensity with which Pelphrey expresses some sentences is becoming one of his trademark characteristics. \r\n\r\nI've seen many people talking about these two actors, but Lily Collins (Rita Alexander) portrays my favorite character besides the protagonist. As Mankiewicz's secretary, Lily explores her character in such a heartfelt, authentic manner that, at times, I wished to go back to the present not because of learning more about Citizen Kane's screenplay actually being written, but due to Rita Alexander's interactions with her \"boss\". Their conversations are some of the most satisfying moments of the entire film, and I genuinely cared for both of them.\r\n\r\nI know that most of my readers probably don't care about technicalities, but if you've been following me for enough time, you know I value the technical aspects when they significantly impact the movie. Well, I dare state that a massive reason why I enjoy Mank so much is the near-perfect technical homage that Fincher pays to Orson Welles' precedent-setting film. From tiny little details like a \"cigarette burn\" here and there (I counted eight, and if you don't know what this means, then you clearly didn't watch Citizen Kane) to similar shot composition, Fincher creates flawless resemblances to the \"greatest movie of all-time\" in almost every scene, including his own version of a \"Rosebud\" moment.\r\n\r\nThis obviously means that Erik Messerschmidt's cinematography is absolutely stunning. Erik previously worked with Fincher on Mindhunter, proving now that his film career still has a lot of ground to cover. Kirk Baxter could very well be nominated for Best Film Editing, and I can easily picture the exact scene the ceremony would show to demonstrate the seamless, clean cuts which make dialogues easier to follow. Donald Graham Burt, who has worked with Fincher since Zodiac, offers an exceptional production design, but it's Trent Reznor and Atticus Ross' score that steals the show for me. Using only period-authentic instruments, Reznor and Ross deliver a rich, unique, memorable tribute to Bernard Herrmann's work.\r\n\r\nAll in all, Netflix releases another massive contender for the awards season, Mank. With the perfectionist, dedicated David Fincher at the helm, his late father's screenplay ends up being Fincher's most personal project so far. It's a wonderful homage not only to Citizen Kane but also to the 30s/40s decades. Technically, every single component is award-worthy: cinematography, editing, production design, and especially the score. Fincher works with his team to deliver impressively similar iconic scenes and precedent-setting technical characteristics from Orson Welles' impactful movie. Outstanding performances across the board, but expect nominations flying the way of Gary Oldman, Amanda Seyfried, and Lily Collins. However, Fincher's identical narrative structure to the 1941's flick sometimes feels just like a clever tribute instead of actually elevating the story. Jack Fincher's screenplay is overwhelmingly crowded with side stories and characters, making it challenging to follow comprehensibly, especially for viewers without any knowledge about the respective matter. Fortunately, the primary mission of representing Herman J. Mankiewicz's real-life inspirations that led to arguably one of the best screenplays ever written is flawlessly accomplished, making Mank a must-see for any film lover, as long as the viewer has at least watched the so-called \"greatest movie of all-time\".\r\n\r\nRating: A-", "created_at": "2020-11-29T17:33:52.168Z"}, {"movie_id": 614560, "review_id": "603885f168b1ea0057e0f631", "author_rating": 8.0, "review_text": "A fascinating look about what supposedly went into <em>'Citizen Kane'</em>.\r\n\r\n<em>'Mank'</em>, a biopic about screenwriter Herman J. Mankiewicz, is a very good watch. A lot goes on and it's pretty much all interesting to see, admittedly you'd need to have seen the 1941 film. I like that they done this in a non-linear format and in black-and-white, à la in '41.\r\n\r\nKudos to the cast. Gary Oldman (Herman) is impressive, I did feel he was overacting - likewise with Amanda Seyfried (Marion) - just a little bit in parts but for the vast, vast majority he (and she) is top notch. Arliss Howard (Mayer), Lily Collins (Rita) and a few others are also pleasing to watch.", "created_at": "2021-02-26T05:24:01.897Z"}, {"movie_id": 614560, "review_id": "64b4b72423d27800c93cb477", "author_rating": 7.0, "review_text": "This features another quite impressive, powerful, performance from Gary Oldman as David Fincher uses his stylish and authentic portrayal of the borderline iconoclast Herman J. Mankiewicz to take us on a tour of Hollywood in the 1930s. It's told by way of flashback, as the bed-ridden Oldman is working on his screenplay for \"Citizen Kane\" and through his frequently drunken hazes we experience much of the politics, bigotry, misogyny, and pretty blatant corruption that prevailed in the upper echelons of the studio system as espoused by the likes of Louis B. Meyer (Arliss Howard); Irving Thalberg (Ferdinand Kingsley) and most especially the king of the hill - WR Hearst (Charles Dance). The monochrome photography adds much to the rich look of the film, and Jack Fincher provided the star with some wonderfully eloquent (often wittily loquacious) monologues - particularly towards the end as his battle against the booze starts to become more of an effort for him to fight and his friends begin to redefine their relationship with him. I was less impressed with the supporting cast - Dance dressed like a circus ringmaster for much of the time and Amanda Seyfried and Lily Collins struggled to make much of an impact, even though both roles are significant in the lives of Mankiewicz and Hearst respectively. It's a considered work, this - it doesn't dwell on the salaciousness of the scenarios; indeed it seems hell bent on avoiding dirtying it's hands with any of the concomitant scandal that accompanied the era, and that is quite odd. It robs the storyline of the oxygen of the underling politics and power-broking that created the ambience Mankiewicz so resented - even loathed. I saw it on the big screen about a day before Netflix rolled it out, and on balance I think a television viewing is all this needs. It's good - but not great.", "created_at": "2023-07-17T03:36:04.785Z"}, {"movie_id": 614560, "review_id": "64b52dd437806200ad159258", "author_rating": 6.0, "review_text": "The sequence of events was the reason for repeating the movie and watching it more than once. Never mind if you are not following the history of Hollywood, you will feel weary and bored.", "created_at": "2023-07-17T12:02:28.145Z"}, {"movie_id": 614560, "review_id": "5fb73aa5e24e3a003f3d9c80", "author_rating": 10.0, "review_text": "Rather than a burst of cinematic energy, 'Mank' is a considered, meticulous, subtle and ultimately furious film, one that continues to grow in your mind hours after seeing it. Even after two viewings, I can still hear my mind chewing over every second, my heart quietly racing as I consider its individual moments of genius. This isn't some nostalgic elegy to a great film or a great artist, but a damning portrait of how systems of power can be misused, and how good men find themselves complicit. It speaks ferociously to our contemporary world, and reminds us of the important role of art in a functioning society. In that sense, 'Mank' isn't a film about cinema; it's a film that asks what the point of cinema even is. It's a powerful, rebellious question to ask, and the kind of question only a filmmaker as skilled as David Fincher would dare to, and the imagination to find the answer. In the process, he may have just delivered the best film of the year.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-mank-a-dazzling-damnation-of-the-hypocrisy-of-power", "created_at": "2020-11-20T03:40:21.787Z"}, {"movie_id": 614560, "review_id": "5fc3db802bcf67003ec0c769", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis last week of mine has been one of the most challenging I've ever had since I started this project. Not only due to the number of David Fincher's films (Se7en, Fight Club, Zodiac, The Social Network, Gone Girl) I (re)watched in preparation for Mank (plus Citizen Kane), but also because these aren't exactly movies I usually review this quick. Since Zodiac was the only first-watch of this bunch, I was able to surprise myself and fly through the writing process, actually managing to deliver each article daily as I idealized. Finally, the time for one of Netflix's biggest baits for the upcoming awards season had arrived, so I watched Fincher's latest yesterday night.\r\n\r\nClearly, I'm a fan of Fincher's style, as my opinions about his filmography prove, so I always expect one of the best films of the respective year to come out of his work. However, having in mind the biographical premise, I know that this type of movie heavily relies on its storytelling. In my case, if a film like this isn't able to offer me new relevant information about a subject I already possess some knowledge of, then inevitably I'll end up disappointed. Even if I still receive these new story details, the transmission must be performed in a compelling manner, which usually these movies fail to do, basing their scripts too much on lazy exposition. So, I tried to keep my expectations moderately high yet realistic and hopeful.\r\n\r\nBefore I share my thoughts, a quick disclaimer. Mank will undoubtedly generate quite a divisive response from the general public. Why? From something as simple as the fact that the film is on black-and-white to the crime that is people not knowing a single thing about Citizen Kane (including never seeing it) but still choosing to watch Mank, there will be countless examples of viewers who will watch the latter with terribly unrealistic expectations. Audiences all around the world will find this movie \"boring, uneventful\", and say stuff like, \"I fell asleep five minutes in\", \"another artsy B&W uninteresting film for critics to blindly love\". Some of these comments will unavoidably come from people who just sat on their couch and clicked a random flick that they saw on Netflix.\r\n\r\nThe marketing campaign could never place a pre-requirement to watch Mank, but I can, and I will. As straightforward and honest as I possibly can: if you've never watched Citizen Kane in your life, then either you do it before even opening your streaming service, or please, skip Mank because you'll probably not enjoy it at all. I firmly believe only 1/1000 viewers will like the latter if they have zero knowledge about Orson Welles' iconic movie. Ideally, (re)watch it, and research a bit about its background: what lead to the creation of the film, who was involved, what controversies surrounded the movie… I know what you're thinking: isn't that what Mank is supposed to tell me about? This takes me to one of my issues with the film. \r\n\r\nThere are basically two options in this genre: either the director and/or the screenwriter choose to help the audience follow the story by introducing them to what they will witness, or they jump straight into the narrative itself. Fincher doesn't waste a second helping the audience understand what's happening or, in some cases, who even are the characters. Either the viewers know what they're getting themselves into (like I advise above) or prepare yourself for an incredibly intricate narrative, wholly packed with flashbacks, side stories, and many, many characters.\r\n\r\nThis will be a significant reason why some people will definitely dislike this movie. I researched and studied Citizen Kane to exhaustion, and I still felt lost during some periods due to the overwhelming amount of subplots and its characters. Then, even though the following is connected to one of the aspects I love the most about Mank, there are at least a couple of other characters besides Herman J. Mankiewicz who I wish I could have learned more about, mainly Marion Davies (Amanda Seyfried) and Joseph L. Mankiewicz (Tom Pelphrey), the protagonist's brother. On the other hand, this also means that despite the high number of characters, most are indeed quite interesting, possessing emotionally compelling arcs.\r\n \r\nI just noticed I started my review stating my issues with the film, but don't be mistaken: I really, really like it. However, since I'm already here, I might as well let out my remaining problem. So, this isn't close to anything Fincher has done before. It genuinely feels like a remarkably personal project that he surely would have loved to share with his late father, Mank's posthumously screenwriter, Jack Fincher (I'll refer to him as Jack from now on, keeping Fincher related to David). If there's one thing I expected from this movie was Fincher paying homage to Citizen Kane through the technical aspects, including the narrative structure profoundly based on flashbacks to justify a particular opinion, conversation, or event happening in the present.\r\n\r\nEvidently, Mank follows the exact same storytelling method as Citizen Kane, and despite it being a brilliant decision from David and/or Jack Fincher, the former lets it take over the story instead of elevating it. The flashbacks are mostly earned and well-placed in the narrative, but sometimes it comes across as a mere technical feature exclusively to make that comparison with Citizen Kane, instead of its execution improving the story both Fincher want to tell. Nevertheless, these issues of mine are far from ruining the entire viewing, much on the contrary. \r\n\r\nWhen it comes to my number one requirement, Fincher nails it perfectly. I loved getting to know the real-life inspirations that led Mankiewicz to create one of the greatest screenplays of all-time, as well as the shocking (and unknown to me) conditions he had to work on. It's truly a filmmaking miracle to be able to write a masterpiece in the space of two months, being physically and mentally debilitated. Despite the imperfect efficiency of the flashbacks, most develop impactful characters in Mankiewicz's life, and I can't deny that it's a joy for any film lover to see or even hear the mention of some famous filmmakers from that time. Nevertheless, a character is only as great as the actor who portrays it (and vice-versa).\r\n\r\nGary Oldman is undoubtedly a contender for this year's Best Actor awards. It would be a major snub for him not to be exhaustingly nominated on every single ceremony. I believe his performance in Darkest Hour as Winston Churchill is more visibly riveting (I've never been so captivated during a war drama before), but his phenomenal display in Mank is hard to deny. From his hilarious yet grounded portrayal of a drunk Mankiewicz to his more sober, sincere attitude, Oldman demonstrates mind-blowing variation, with his physical performance having a notable influence on the overall result. There's no doubt that he carries the entire narrative on his shoulders, and he does it effortlessly.\r\n\r\nHowever, Oldman is far from being the only bright spot. Amanda Seyfried can very well get her first serious awards season as the extremely captivating Marion Davies. Seyfried manages to deliver an exquisite balance between the purposefully exaggerated voice mannerisms and Marion's real personality. Tom Pelphrey is also extraordinary as Mankiewicz's brother, whom I immediately researched about as soon as I finished the movie. The intensity with which Pelphrey expresses some sentences is becoming one of his trademark characteristics. \r\n\r\nI've seen many people talking about these two actors, but Lily Collins (Rita Alexander) portrays my favorite character besides the protagonist. As Mankiewicz's secretary, Lily explores her character in such a heartfelt, authentic manner that, at times, I wished to go back to the present not because of learning more about Citizen Kane's screenplay actually being written, but due to Rita Alexander's interactions with her \"boss\". Their conversations are some of the most satisfying moments of the entire film, and I genuinely cared for both of them.\r\n\r\nI know that most of my readers probably don't care about technicalities, but if you've been following me for enough time, you know I value the technical aspects when they significantly impact the movie. Well, I dare state that a massive reason why I enjoy Mank so much is the near-perfect technical homage that Fincher pays to Orson Welles' precedent-setting film. From tiny little details like a \"cigarette burn\" here and there (I counted eight, and if you don't know what this means, then you clearly didn't watch Citizen Kane) to similar shot composition, Fincher creates flawless resemblances to the \"greatest movie of all-time\" in almost every scene, including his own version of a \"Rosebud\" moment.\r\n\r\nThis obviously means that Erik Messerschmidt's cinematography is absolutely stunning. Erik previously worked with Fincher on Mindhunter, proving now that his film career still has a lot of ground to cover. Kirk Baxter could very well be nominated for Best Film Editing, and I can easily picture the exact scene the ceremony would show to demonstrate the seamless, clean cuts which make dialogues easier to follow. Donald Graham Burt, who has worked with Fincher since Zodiac, offers an exceptional production design, but it's Trent Reznor and Atticus Ross' score that steals the show for me. Using only period-authentic instruments, Reznor and Ross deliver a rich, unique, memorable tribute to Bernard Herrmann's work.\r\n\r\nAll in all, Netflix releases another massive contender for the awards season, Mank. With the perfectionist, dedicated David Fincher at the helm, his late father's screenplay ends up being Fincher's most personal project so far. It's a wonderful homage not only to Citizen Kane but also to the 30s/40s decades. Technically, every single component is award-worthy: cinematography, editing, production design, and especially the score. Fincher works with his team to deliver impressively similar iconic scenes and precedent-setting technical characteristics from Orson Welles' impactful movie. Outstanding performances across the board, but expect nominations flying the way of Gary Oldman, Amanda Seyfried, and Lily Collins. However, Fincher's identical narrative structure to the 1941's flick sometimes feels just like a clever tribute instead of actually elevating the story. Jack Fincher's screenplay is overwhelmingly crowded with side stories and characters, making it challenging to follow comprehensibly, especially for viewers without any knowledge about the respective matter. Fortunately, the primary mission of representing Herman J. Mankiewicz's real-life inspirations that led to arguably one of the best screenplays ever written is flawlessly accomplished, making Mank a must-see for any film lover, as long as the viewer has at least watched the so-called \"greatest movie of all-time\".\r\n\r\nRating: A-", "created_at": "2020-11-29T17:33:52.168Z"}, {"movie_id": 614560, "review_id": "603885f168b1ea0057e0f631", "author_rating": 8.0, "review_text": "A fascinating look about what supposedly went into <em>'Citizen Kane'</em>.\r\n\r\n<em>'Mank'</em>, a biopic about screenwriter Herman J. Mankiewicz, is a very good watch. A lot goes on and it's pretty much all interesting to see, admittedly you'd need to have seen the 1941 film. I like that they done this in a non-linear format and in black-and-white, à la in '41.\r\n\r\nKudos to the cast. Gary Oldman (Herman) is impressive, I did feel he was overacting - likewise with Amanda Seyfried (Marion) - just a little bit in parts but for the vast, vast majority he (and she) is top notch. Arliss Howard (Mayer), Lily Collins (Rita) and a few others are also pleasing to watch.", "created_at": "2021-02-26T05:24:01.897Z"}, {"movie_id": 614560, "review_id": "64b4b72423d27800c93cb477", "author_rating": 7.0, "review_text": "This features another quite impressive, powerful, performance from Gary Oldman as David Fincher uses his stylish and authentic portrayal of the borderline iconoclast Herman J. Mankiewicz to take us on a tour of Hollywood in the 1930s. It's told by way of flashback, as the bed-ridden Oldman is working on his screenplay for \"Citizen Kane\" and through his frequently drunken hazes we experience much of the politics, bigotry, misogyny, and pretty blatant corruption that prevailed in the upper echelons of the studio system as espoused by the likes of Louis B. Meyer (Arliss Howard); Irving Thalberg (Ferdinand Kingsley) and most especially the king of the hill - WR Hearst (Charles Dance). The monochrome photography adds much to the rich look of the film, and Jack Fincher provided the star with some wonderfully eloquent (often wittily loquacious) monologues - particularly towards the end as his battle against the booze starts to become more of an effort for him to fight and his friends begin to redefine their relationship with him. I was less impressed with the supporting cast - Dance dressed like a circus ringmaster for much of the time and Amanda Seyfried and Lily Collins struggled to make much of an impact, even though both roles are significant in the lives of Mankiewicz and Hearst respectively. It's a considered work, this - it doesn't dwell on the salaciousness of the scenarios; indeed it seems hell bent on avoiding dirtying it's hands with any of the concomitant scandal that accompanied the era, and that is quite odd. It robs the storyline of the oxygen of the underling politics and power-broking that created the ambience Mankiewicz so resented - even loathed. I saw it on the big screen about a day before Netflix rolled it out, and on balance I think a television viewing is all this needs. It's good - but not great.", "created_at": "2023-07-17T03:36:04.785Z"}, {"movie_id": 614560, "review_id": "64b52dd437806200ad159258", "author_rating": 6.0, "review_text": "The sequence of events was the reason for repeating the movie and watching it more than once. Never mind if you are not following the history of Hollywood, you will feel weary and bored.", "created_at": "2023-07-17T12:02:28.145Z"}, {"movie_id": 614560, "review_id": "5fb73aa5e24e3a003f3d9c80", "author_rating": 10.0, "review_text": "Rather than a burst of cinematic energy, 'Mank' is a considered, meticulous, subtle and ultimately furious film, one that continues to grow in your mind hours after seeing it. Even after two viewings, I can still hear my mind chewing over every second, my heart quietly racing as I consider its individual moments of genius. This isn't some nostalgic elegy to a great film or a great artist, but a damning portrait of how systems of power can be misused, and how good men find themselves complicit. It speaks ferociously to our contemporary world, and reminds us of the important role of art in a functioning society. In that sense, 'Mank' isn't a film about cinema; it's a film that asks what the point of cinema even is. It's a powerful, rebellious question to ask, and the kind of question only a filmmaker as skilled as David Fincher would dare to, and the imagination to find the answer. In the process, he may have just delivered the best film of the year.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-mank-a-dazzling-damnation-of-the-hypocrisy-of-power", "created_at": "2020-11-20T03:40:21.787Z"}, {"movie_id": 614560, "review_id": "5fc3db802bcf67003ec0c769", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis last week of mine has been one of the most challenging I've ever had since I started this project. Not only due to the number of David Fincher's films (Se7en, Fight Club, Zodiac, The Social Network, Gone Girl) I (re)watched in preparation for Mank (plus Citizen Kane), but also because these aren't exactly movies I usually review this quick. Since Zodiac was the only first-watch of this bunch, I was able to surprise myself and fly through the writing process, actually managing to deliver each article daily as I idealized. Finally, the time for one of Netflix's biggest baits for the upcoming awards season had arrived, so I watched Fincher's latest yesterday night.\r\n\r\nClearly, I'm a fan of Fincher's style, as my opinions about his filmography prove, so I always expect one of the best films of the respective year to come out of his work. However, having in mind the biographical premise, I know that this type of movie heavily relies on its storytelling. In my case, if a film like this isn't able to offer me new relevant information about a subject I already possess some knowledge of, then inevitably I'll end up disappointed. Even if I still receive these new story details, the transmission must be performed in a compelling manner, which usually these movies fail to do, basing their scripts too much on lazy exposition. So, I tried to keep my expectations moderately high yet realistic and hopeful.\r\n\r\nBefore I share my thoughts, a quick disclaimer. Mank will undoubtedly generate quite a divisive response from the general public. Why? From something as simple as the fact that the film is on black-and-white to the crime that is people not knowing a single thing about Citizen Kane (including never seeing it) but still choosing to watch Mank, there will be countless examples of viewers who will watch the latter with terribly unrealistic expectations. Audiences all around the world will find this movie \"boring, uneventful\", and say stuff like, \"I fell asleep five minutes in\", \"another artsy B&W uninteresting film for critics to blindly love\". Some of these comments will unavoidably come from people who just sat on their couch and clicked a random flick that they saw on Netflix.\r\n\r\nThe marketing campaign could never place a pre-requirement to watch Mank, but I can, and I will. As straightforward and honest as I possibly can: if you've never watched Citizen Kane in your life, then either you do it before even opening your streaming service, or please, skip Mank because you'll probably not enjoy it at all. I firmly believe only 1/1000 viewers will like the latter if they have zero knowledge about Orson Welles' iconic movie. Ideally, (re)watch it, and research a bit about its background: what lead to the creation of the film, who was involved, what controversies surrounded the movie… I know what you're thinking: isn't that what Mank is supposed to tell me about? This takes me to one of my issues with the film. \r\n\r\nThere are basically two options in this genre: either the director and/or the screenwriter choose to help the audience follow the story by introducing them to what they will witness, or they jump straight into the narrative itself. Fincher doesn't waste a second helping the audience understand what's happening or, in some cases, who even are the characters. Either the viewers know what they're getting themselves into (like I advise above) or prepare yourself for an incredibly intricate narrative, wholly packed with flashbacks, side stories, and many, many characters.\r\n\r\nThis will be a significant reason why some people will definitely dislike this movie. I researched and studied Citizen Kane to exhaustion, and I still felt lost during some periods due to the overwhelming amount of subplots and its characters. Then, even though the following is connected to one of the aspects I love the most about Mank, there are at least a couple of other characters besides Herman J. Mankiewicz who I wish I could have learned more about, mainly Marion Davies (Amanda Seyfried) and Joseph L. Mankiewicz (Tom Pelphrey), the protagonist's brother. On the other hand, this also means that despite the high number of characters, most are indeed quite interesting, possessing emotionally compelling arcs.\r\n \r\nI just noticed I started my review stating my issues with the film, but don't be mistaken: I really, really like it. However, since I'm already here, I might as well let out my remaining problem. So, this isn't close to anything Fincher has done before. It genuinely feels like a remarkably personal project that he surely would have loved to share with his late father, Mank's posthumously screenwriter, Jack Fincher (I'll refer to him as Jack from now on, keeping Fincher related to David). If there's one thing I expected from this movie was Fincher paying homage to Citizen Kane through the technical aspects, including the narrative structure profoundly based on flashbacks to justify a particular opinion, conversation, or event happening in the present.\r\n\r\nEvidently, Mank follows the exact same storytelling method as Citizen Kane, and despite it being a brilliant decision from David and/or Jack Fincher, the former lets it take over the story instead of elevating it. The flashbacks are mostly earned and well-placed in the narrative, but sometimes it comes across as a mere technical feature exclusively to make that comparison with Citizen Kane, instead of its execution improving the story both Fincher want to tell. Nevertheless, these issues of mine are far from ruining the entire viewing, much on the contrary. \r\n\r\nWhen it comes to my number one requirement, Fincher nails it perfectly. I loved getting to know the real-life inspirations that led Mankiewicz to create one of the greatest screenplays of all-time, as well as the shocking (and unknown to me) conditions he had to work on. It's truly a filmmaking miracle to be able to write a masterpiece in the space of two months, being physically and mentally debilitated. Despite the imperfect efficiency of the flashbacks, most develop impactful characters in Mankiewicz's life, and I can't deny that it's a joy for any film lover to see or even hear the mention of some famous filmmakers from that time. Nevertheless, a character is only as great as the actor who portrays it (and vice-versa).\r\n\r\nGary Oldman is undoubtedly a contender for this year's Best Actor awards. It would be a major snub for him not to be exhaustingly nominated on every single ceremony. I believe his performance in Darkest Hour as Winston Churchill is more visibly riveting (I've never been so captivated during a war drama before), but his phenomenal display in Mank is hard to deny. From his hilarious yet grounded portrayal of a drunk Mankiewicz to his more sober, sincere attitude, Oldman demonstrates mind-blowing variation, with his physical performance having a notable influence on the overall result. There's no doubt that he carries the entire narrative on his shoulders, and he does it effortlessly.\r\n\r\nHowever, Oldman is far from being the only bright spot. Amanda Seyfried can very well get her first serious awards season as the extremely captivating Marion Davies. Seyfried manages to deliver an exquisite balance between the purposefully exaggerated voice mannerisms and Marion's real personality. Tom Pelphrey is also extraordinary as Mankiewicz's brother, whom I immediately researched about as soon as I finished the movie. The intensity with which Pelphrey expresses some sentences is becoming one of his trademark characteristics. \r\n\r\nI've seen many people talking about these two actors, but Lily Collins (Rita Alexander) portrays my favorite character besides the protagonist. As Mankiewicz's secretary, Lily explores her character in such a heartfelt, authentic manner that, at times, I wished to go back to the present not because of learning more about Citizen Kane's screenplay actually being written, but due to Rita Alexander's interactions with her \"boss\". Their conversations are some of the most satisfying moments of the entire film, and I genuinely cared for both of them.\r\n\r\nI know that most of my readers probably don't care about technicalities, but if you've been following me for enough time, you know I value the technical aspects when they significantly impact the movie. Well, I dare state that a massive reason why I enjoy Mank so much is the near-perfect technical homage that Fincher pays to Orson Welles' precedent-setting film. From tiny little details like a \"cigarette burn\" here and there (I counted eight, and if you don't know what this means, then you clearly didn't watch Citizen Kane) to similar shot composition, Fincher creates flawless resemblances to the \"greatest movie of all-time\" in almost every scene, including his own version of a \"Rosebud\" moment.\r\n\r\nThis obviously means that Erik Messerschmidt's cinematography is absolutely stunning. Erik previously worked with Fincher on Mindhunter, proving now that his film career still has a lot of ground to cover. Kirk Baxter could very well be nominated for Best Film Editing, and I can easily picture the exact scene the ceremony would show to demonstrate the seamless, clean cuts which make dialogues easier to follow. Donald Graham Burt, who has worked with Fincher since Zodiac, offers an exceptional production design, but it's Trent Reznor and Atticus Ross' score that steals the show for me. Using only period-authentic instruments, Reznor and Ross deliver a rich, unique, memorable tribute to Bernard Herrmann's work.\r\n\r\nAll in all, Netflix releases another massive contender for the awards season, Mank. With the perfectionist, dedicated David Fincher at the helm, his late father's screenplay ends up being Fincher's most personal project so far. It's a wonderful homage not only to Citizen Kane but also to the 30s/40s decades. Technically, every single component is award-worthy: cinematography, editing, production design, and especially the score. Fincher works with his team to deliver impressively similar iconic scenes and precedent-setting technical characteristics from Orson Welles' impactful movie. Outstanding performances across the board, but expect nominations flying the way of Gary Oldman, Amanda Seyfried, and Lily Collins. However, Fincher's identical narrative structure to the 1941's flick sometimes feels just like a clever tribute instead of actually elevating the story. Jack Fincher's screenplay is overwhelmingly crowded with side stories and characters, making it challenging to follow comprehensibly, especially for viewers without any knowledge about the respective matter. Fortunately, the primary mission of representing Herman J. Mankiewicz's real-life inspirations that led to arguably one of the best screenplays ever written is flawlessly accomplished, making Mank a must-see for any film lover, as long as the viewer has at least watched the so-called \"greatest movie of all-time\".\r\n\r\nRating: A-", "created_at": "2020-11-29T17:33:52.168Z"}, {"movie_id": 614560, "review_id": "603885f168b1ea0057e0f631", "author_rating": 8.0, "review_text": "A fascinating look about what supposedly went into <em>'Citizen Kane'</em>.\r\n\r\n<em>'Mank'</em>, a biopic about screenwriter Herman J. Mankiewicz, is a very good watch. A lot goes on and it's pretty much all interesting to see, admittedly you'd need to have seen the 1941 film. I like that they done this in a non-linear format and in black-and-white, à la in '41.\r\n\r\nKudos to the cast. Gary Oldman (Herman) is impressive, I did feel he was overacting - likewise with Amanda Seyfried (Marion) - just a little bit in parts but for the vast, vast majority he (and she) is top notch. Arliss Howard (Mayer), Lily Collins (Rita) and a few others are also pleasing to watch.", "created_at": "2021-02-26T05:24:01.897Z"}, {"movie_id": 614560, "review_id": "64b4b72423d27800c93cb477", "author_rating": 7.0, "review_text": "This features another quite impressive, powerful, performance from Gary Oldman as David Fincher uses his stylish and authentic portrayal of the borderline iconoclast Herman J. Mankiewicz to take us on a tour of Hollywood in the 1930s. It's told by way of flashback, as the bed-ridden Oldman is working on his screenplay for \"Citizen Kane\" and through his frequently drunken hazes we experience much of the politics, bigotry, misogyny, and pretty blatant corruption that prevailed in the upper echelons of the studio system as espoused by the likes of Louis B. Meyer (Arliss Howard); Irving Thalberg (Ferdinand Kingsley) and most especially the king of the hill - WR Hearst (Charles Dance). The monochrome photography adds much to the rich look of the film, and Jack Fincher provided the star with some wonderfully eloquent (often wittily loquacious) monologues - particularly towards the end as his battle against the booze starts to become more of an effort for him to fight and his friends begin to redefine their relationship with him. I was less impressed with the supporting cast - Dance dressed like a circus ringmaster for much of the time and Amanda Seyfried and Lily Collins struggled to make much of an impact, even though both roles are significant in the lives of Mankiewicz and Hearst respectively. It's a considered work, this - it doesn't dwell on the salaciousness of the scenarios; indeed it seems hell bent on avoiding dirtying it's hands with any of the concomitant scandal that accompanied the era, and that is quite odd. It robs the storyline of the oxygen of the underling politics and power-broking that created the ambience Mankiewicz so resented - even loathed. I saw it on the big screen about a day before Netflix rolled it out, and on balance I think a television viewing is all this needs. It's good - but not great.", "created_at": "2023-07-17T03:36:04.785Z"}, {"movie_id": 614560, "review_id": "64b52dd437806200ad159258", "author_rating": 6.0, "review_text": "The sequence of events was the reason for repeating the movie and watching it more than once. Never mind if you are not following the history of Hollywood, you will feel weary and bored.", "created_at": "2023-07-17T12:02:28.145Z"}]