[{"movie_id": 65057, "review_id": "5049f28719c29509190020f3", "author_rating": 4.0, "review_text": "Sorry, but this movie was unwatchable for me. The premise is clever enough. The wife of a romantically unavailable husband has a fatal accident and he's forced to repair his relationship with his alienated daughters. It's good chick-flick material and no doubt, all the women scored it high and not only because of George Clooney. I normally love his work, but this premise is so poorly executed in this film that even he can't find a solid stage on which to base his acting. There are too many good movies out there to waste time watching this one.", "created_at": "2012-09-07T13:11:35.000Z"}, {"movie_id": 65057, "review_id": "61fad6601e259a001df1592a", "author_rating": 9.0, "review_text": "I really like this movie...\r\n\r\nI've watched it many times and am always entertained. I like the Hawaii locations, the young Woodley, Clooney's clumsy but morally accommodating character, and the confrontations with \r\nlife's inevitable surprises. All the characters gel, and the \r\nstory moves forward with some sadness as well as some laughs.\r\n\r\n8 out of 10 stars", "created_at": "2022-02-02T19:07:12.737Z"}, {"movie_id": 65057, "review_id": "62fbc9002dffd8007daee4f9", "author_rating": 8.0, "review_text": "**An elegant and moving film about family, family values ​​and how they change and adapt to new times.**\r\n\r\nOverall, I liked this movie. Skillfully directed by Alexander Payne, the film tackles several issues around a Hawaiian family in apparent disintegration: while his wife is in a coma due to an accident, and the doctors are deciding what to do, the protagonist has to take responsibility for the education and guidance of his two daughters, each troubled in her own way, and to decide what to do with a huge portion of still virgin land that her family owns on one of the Hawaiian islands, and which is all that remains of an inheritance that dates back to the times of the last Hawaiian kings.\r\n\r\nAlthough the film is sometimes considered a very light comedy, I didn't see anything comical or funny here, and I prefer to think of this film as a family film, that is, whose focal point is the family and the way the family works. Being myself from an aristocratic family (albeit without fortune or privileges), I understand very well the relevance of family past, ancestors and the weight of an inheritance, especially being as old as the one in this film. And personally, I can see myself in the way Matt King, the main character, decides to deal with this, right at the end of the movie. He made the same decision I would have made.\r\n\r\nGeorge Clooney is the lead actor, and he's in excellent shape, he did a really good job, and he was really believable and authentic in the way he played his character. I liked the way he approaches the problems, and also the very positive collaboration that was established between him and the young Shailene Woodley. She proved to be very competent in the way she gave life to the couple's eldest daughter, an angry and troubled teenager who has problems with drugs and alcohol, and who, however, seems to have a very valid reason for all the revolt. Amara Miller also does an interesting, albeit more discreet, job. There are, however, actors who don't do so well: Patricia Hastie is never convincing, Beau Bridges has almost no relevance in the film and Nick Krause is simply annoying and always seems to be left, in the plot and in the scene.\r\n\r\nTechnically, it is a fairly regular film, which bets little on effects or visual artifices and prefers to give the actors more space to shine, taking advantage of the good quality of the script and direction. Thus, the emphasis is entirely on the good quality of the cinematography, which wonderfully uses the landscapes of the Hawaiian Islands, fully honoring the archipelago and its great scenic beauty. We have excellent plans that highlight the bright blue sea and the intense green of the forests, as well as good perspectives on urban life, cities or traffic. The colors and lighting were well-crafted and the film never feels lukewarm or too still thanks to a good editing job and a pleasant pacing. The soundtrack is also excellent and makes a very interesting use of some Hawaiian melodies, calm and harmonious.", "created_at": "2022-08-16T16:42:40.828Z"}]