[{"movie_id": 2675, "review_id": "5e84287098f1f10014a856d8", "author_rating": 7.0, "review_text": "_**Is it really about aliens?**_\r\n\r\nM. Night Shyamalan's \"Signs\" (2002) is about a disillusioned ex-minister (Mel Gibson) who lives in the country with his son & daughter and brother (Juaquin Phoenix). The reasons for his disillusionment become clear as the story unfolds. When a mysterious crop circle is discovered in their cornfield they wonder if it's a prank or an alien invasion!\r\n\r\nAlthough the plot deals with a possible alien invasion, the theme is faith. There are two general views of life: (1) That life and the universe are one big meaningless accident and you're just an insignificant bug that will soon be squashed out of existence and memory. And (2) that there's an intelligent design to the universe and, although it's somehow fallen (i.e. severely messed up), there IS meaning, love, hope and purpose, even if we are presently unable to fully comprehend it.\r\n\r\nThe film addresses the clash of these two opposing views. We've all experienced the conflict of these two positions within our OWN hearts; it's the clash of flesh (id) and spirit (super-ego). On the one hand, we WANT to believe the latter position, but life dishes out so much crap that we are seriously tempted to give-in to the former.\r\n\r\nThis is the struggle Gibson's character faces in the story. He's given up on God and is stumbling in the dark; he's just going through the motions to exist. His smile is mostly a facade.\r\n\r\nMany people diss the film for an obvious plot hole regarding the alien's weakness, but Shyamalan's too talented to not realize this. It's a sign to what the film is really about (sorry; I couldn't resist).\r\n\r\n**SPOILER ALERT** (Don't read further unless you've seen the film)\r\n\r\nIt's possible that the aliens aren't really extraterrestrials but rather demons from the underworld (the dark dimension) invading the physical realm to take as many victims as they can. The idea that they are aliens is just a mass deception and, remember, the devil is the \"father of lies\".\r\n\r\nThere are many clues: The spaceships are never seen, just lights in the sky (the devil's also called \"the prince of the power of the air\" in the bible). The \"aliens\" look decidedly demonic and have cloven hoofs. The “primitive method” of repelling the aliens is discovered in “three cities the Middle East” and is holy water, which is ordinarily used by Catholic & Episcopal exorcists against demonic manifestations (Shyamalan, by the way, attended Catholic & Episcopal schools). The daughter, Bo, was said to be a \"gift from God\" who is sensitive to impure (unholy) water. Her name in Old Norse means \"to live\" and she was able to discern the weapon of life needed to defeat the demonic menace. The dog and bird were clearly possessed. The crop circles are occultic symbols and possible portals to the underworld. The crop circle in the Hess cornfield resembles a pitchfork. When the disillusioned minister cries out to God that he hates him he actually displays his faith; after all, he has to believe in God in order to converse. At that precise moment his son recovers from the asthma attack and the news announcer declares that the \"aliens\" are retreating. You see, FAITH sends the enemy fleeing with their tails between their legs.\r\n\r\nAlso, we see evidence that the demons are personal in nature. The \"alien\" locked in the vet's pantry was linked to the guilt and disillusionment that haunted the vet and the minister after the death of the latter's wife.\r\n\r\nAlso, we see evidence that the demons are personal in nature. The \"alien\" locked in the vet's pantry was linked to the guilt and disillusionment that haunted the vet after the death of the minister's wife.\r\n\r\nKeep in mind that when the film debuted, Shyamalan was known as the king of the plot twist, yet the revelation that the aliens’ weakness is water wasn’t exactly a mind-blowing turn seeing as how the earth is 71% water and technologically advanced aliens who can travel the galaxy would know this. Moreover, the aliens curiously have no physical weapons and are easily trapped by a pantry door. It stands to reason that Shyamalan hid the twist in the movie. That twist is that the aliens are really demonic in nature.\r\n\r\nI'm not saying you can't view the movie as a literal extra-terrestrial invasion flick, but rather that the underlying demonic reading is a legitimate way of viewing the material because it all ties together and links to the story arc of the disillusioned ex-minister finding redemption. Also, I'm not suggesting that you have to believe in God to appreciate this movie, which is obviously not the case.\r\n\r\nBOTTOM LINE: This is a quality Shyamalan film and is about on par with \"The Sixth Sense\" and \"The Village.”\r\n\r\nThe film runs 106 minutes and was shot in Eastern Pennsylvania.\r\n\r\nGRADE: B+", "created_at": "2020-04-01T05:36:48.431Z"}, {"movie_id": 2675, "review_id": "60d3cf929f1be7005d932740", "author_rating": 7.0, "review_text": "Not my favorite M. Night Shyamalan film. Also not my least favorite...", "created_at": "2021-06-24T00:19:30.748Z"}, {"movie_id": 2675, "review_id": "62c7d44558361b00555bc2a8", "author_rating": 6.0, "review_text": "It's barely over an hour and a half this film, but it seems much longer. Mel Gibson (\"Graham\") is a widowed former pastor who lives on a farm with his two kids \"Morgan\" (Rory Culkin) and \"Bo\" (Abigail Breslin) and his brother \"Merrill\" (Joaquin Phoenix). Their lives are all rolling along normally until one morning they discover some crop circles amongst the corn fields. Dismissing them as hoaxes, they are intrigued when television reports suggest a proliferation of these things all around the world. Now add to their now heightened suspicions some late night noises and mysterious happenings, and the family begin to suspect that they are being watched - and that their observer is not exactly benign. The last ten minutes or so redeem this story to a degree, but for the most part it is a terribly slow burn of a film. There isn't really much by way of action; Gibson and Phoenix don't really exude much of a compelling sibling relationship and the kids - usually a crucial conduit for M. Night Shyamalan stories have much less to work with here. This has more of the melodrama to it - the backstory of tragedy and grief all gets in the way of the gradually increasing sense of menace and I found the whole momentum of the story quite staccato. This is an adequate film, but it is definitely nobody's best work.", "created_at": "2022-07-08T06:52:53.374Z"}]