[{"movie_id": 2135, "review_id": "629bec3d4df291009e943fa9", "author_rating": 6.0, "review_text": "Some interesting and even ambitious aspects but this sci-fi thriller was pretty uneven while the visual effects were also a mixed bag from being fairly impressive for its time (20 years now) to pretty shoddy. On the plus side, Guy Pearce was good in the lead. This one also reminded me when Orlando Jones was in a good amount of movies (18 between 1998-2004). IDK, this is one that did keep me entertained. **3.0/5**", "created_at": "2022-06-04T23:35:25.671Z"}, {"movie_id": 2135, "review_id": "63c21b16df857c00bc21fda5", "author_rating": 1.0, "review_text": "I don't know how to approach this one.\r\n\r\n\"The Time Machine\" is one of those stories that, rereading it, beings back vivid memories. One of my best friends in high school loaned it to me, I stored it away in my backpack for about a month and then...when we had a field trip to The Board of Trade, I scrounged it out and read it on the train ride.\r\n\r\nIt was one of those stories that is so short I could rip through it in the hour and fifteen minutes between our small town and Chicago. To this day, every time I go back to it, it brings me back to 1997 and, to this day, I distinctly remember finishing it about the time the train stopped and I remember walking into the crowded city feeling like I was in a different world. The story had moved me out of reality so much Chicago seemed jarring.\r\n\r\nAnd then they made it into a movie, a remake of a movie and, watching it, I don't know, I didn't have that same sense of being in a totally different world that the book gave me...\r\n\r\nAnd the movie, in my mind, has to live up to that experience in some small way. Or at least give you that feeling that same feeling that the world was still spinning that one gets when they walk out of a movie and discover that it had rained.\r\n\r\nIt's an engrossing story and The Time Machine didn't seem to whisk me away like the book did. I can't help but feel it deserved better.\r\n\r\nIt felt like I was watching a movie and, honestly, it gave me the same since that Jackson's King Kong did, it felt like it was trying and horribly, miserably failed.\r\n\r\nI left feeling \"meh,\" and that was after being excited walking into it, I mean, I read it in 1997 and they made a movie in 2002 and, I was expecting the same feeling. I had waited long enough.\r\n\r\nSo, I don't know, I may be overly harsh on it just because I loved what the story did to me so much, the first time I read it and now, as an adult, it doesn't take me to another world, it takes me back to 1997 again, and high school, and that hour fifteen minute train ride to Chicago.\r\n\r\nSo ultimately, it could be a halfway decent film that I just hate because the story had such a jarring effect on me when I first encountered it.", "created_at": "2023-01-14T03:01:42.973Z"}]