[{"movie_id": 293768, "review_id": "59632c529251410c560e400e", "author_rating": 4.0, "review_text": "Poorly crafted and pretty predictable, I do wonder how Halle Berry got to making movies like _Kidnap_. It's not awful, but it's obviously low-budget, and there's nothing to it that I can really see as being appealing beyond the paycheque.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-07-10T07:27:14.535Z"}, {"movie_id": 293768, "review_id": "59fe21e1c3a36868930264ea", "author_rating": 8.0, "review_text": "**It's now or never! A mother's fight back!**\r\n\r\nTruly shocking for people blindly following the words of critics. This is really a good film. I totally enjoyed it. Well, it was not like I never saw such film. In a century of motion picture history, hundreds of similar films were made. This is just another one, but there's nothing wrong with it. People wrongly judged it. The pace of the film was rocket speed. So basically, there's no time for one to keep looking for flaws. If they do, then they're not enjoying the show. They missed out everything, hence end up bashing it. Just like the clowns, aka film critics.\r\n\r\nIt was another kidnap film that Halle Barry in it, that's similar to her previous film 'The Call'. It did not take long to get into the action. A hardworking mother, going through divorce, fighting for her son's custody. While engaging in a phone call, she loses her son in an amusement park. The alert mother quickly jumps into pursuing when he was seen forcefully taken in a stranger's car. The remaining events take place on the road, with car chases, with a twist before the conclusion.\r\n\r\nNicely written screenplay and well performed actors, particularly Halle Berry. I have never seen she had played such an energetic role in the recent time. Whatever the storyline is, it's kind of an inspiring film. How a mother fought for her son. Totally a mother instinct. You can't simply expect like the film 'Taken'. It might not be realistic, but cinematically honest. The same thing happens in the animal world too. Sad that the film released after so many delays. Moreover, how people responded to it. Believe me, it is a nice film and I definitely suggest it to all.\r\n\r\n_8/10_", "created_at": "2017-11-04T20:24:01.683Z"}]