[{"movie_id": 548473, "review_id": "5dc8aea07d2bc1579834ece6", "author_rating": 7.0, "review_text": "**_A solid adaptation, albeit with a bit too much alpaca-based comedy_**\r\n\r\n>_This was no fruit of such worlds and suns as shine on the telescopes and photographic plates of our observatories. This was no breath from the skies whose motions and dimensions our astronomers measure or deem too vast to measure. It was just a colour out of space – a frightful messenger from unformed realms of infinity beyond all Nature as we know it; from realms whose mere existence stuns the brain and numbs us with the black extra-cosmic gulfs it throws open before our frenzied eyes._\r\n\r\n- H.P. Lovecraft; \"The Colour Out of Space\"; _Amazing Stories_ (September, 1927)\r\n\r\nMuch of the work of H.P. Lovecraft takes place in a vast shared universe, which would, by its very nature, seem to lend itself to the current vogue for cinematic long-form narratives. However, considering the size of his _oeuvre_, very little of it has been adapted for the screen, and Lovecraft in general has proved a difficult author to film (although Stuart Gordon and Brian Yuzna would probably beg to differ). And so we have _Colour Out of Space_, written and directed by Richard Stanley (his first film in 25 years, after he was famously fired three days into the disastrous shoot of his long-gestating dream project, _The Island of Dr. Moreau_). A modernisation but otherwise surprisingly faithful adaptation of Lovecraft's 1927 short story \"The Colour Out of Space\", _Colour_ takes a good stab at depicting one of Lovecraft's most oblique entities (essentially it exists as an indescribable colour). Mixing humour and body horror (perhaps weighed a little too much towards humour), the film gives Nicholas Cage another opportunity to go full-Cage after he recently cut loose in Brian Taylor's _Mom and Dad_ (2017) and Panos Cosmatos's _Mandy_ (2018). And boy does he lean into it – this is the most ludicrous, histrionic, and borderline farcical performance he's given since Robert Bierman's _Vampire's Kiss_ (1989), screaming about the importance of alpacas one minute (they're \"_the animal of the future_\"), calmly playing the dutiful father the next. And how you respond to this will largely dictate how you respond to the film – ridiculously camp, over the top, and vapid or ridiculously camp, over the top, and darkly compelling.\r\n\r\nJust outside the city of Arkham, MA (the fictitious setting of many Lovecraftian stories), Nathan Gardner (Cage), and his wife Theresa (Joely Richardson), teenage children Benny (Brendan Meyer) and Lavinia (Madeleine Arthur), and young son Jack (Julian Hilliard) have moved into Nathan's deceased father's property. Theresa has recently been given the all-clear after battling breast cancer, and is gradually returning to work as a commodities trader, working from home via the internet (albeit with an unreliable connection). Lavinia, a practising Wiccan, spends her time riding the family horse and performing rituals she hopes will keep her mother cancer-free. Nathan, for his part, has embraced rural life by raising alpacas on the property's farm. As the film begins, hydrologist Ward (Eliot Knight) arrives in the area to survey the water table. That night, the sky fills with pulsating light and a rock crashes onto the Gardners' land. The following day, Ward says it's probably just a meteorite, although Ezra (Tommy Chong, essentially playing himself), an ageing hippie who lives in the forest completely off the grid, believes it's a sign that something has gone wrong with the natural order of things. As time passes, the Gardners start to experience ever-more bizarre events – unnaturally localised lightning storms that seem to come from nowhere; huge fuchsia-like plants that seem to grow overnight; a horrific odour coming from the meteorite that only Nathan can smell; a gigantic purple mantis flying around; radios and the internet cutting out more than normal; the water turning strange colours; the meteorite itself mysteriously turning to dust; the family's dog, Lavinia's horse, and Nathan's alpacas starting to acting strangely; the family's produce (such as tomatoes) growing at exponential speeds; even time itself appears to be corrupted. Soon enough, the family members begin to show signs of change – Jack starts talking to someone in the well; Nathan discovers his arm is developing scales; Theresa accidentally cuts off two of her fingers and barely notices; Benny goes in and out of fugues, Lavinia becomes violently nauseous. And as the whole family finds itself in mortal danger, are any of them unaffected to the point where they're capable of saving the others?\r\n\r\nThe original \"The Colour out of Space\" tells the story of a surveyor from Boston who learns a meteorite crashed just outside Arkham several years previously in an area now known as the \"Blasted Heath\", apparently poisoning everything and causing anybody with whom it came into contact to go insane. Hoping to get more specific information, the unnamed surveyor seeks out Ammi Pierce, a hermit living in the nearby woods, who tells him the story of Nahum Gardner, on whose property the meteorite landed. As it started to shrink, the meteorite left behind globules of a colour that fell outside the visible spectrum and could only be described by analogy. Over the following year, the Gardner family experience a series of increasingly devastating traumas before eventually turning on one another.\r\n\r\nLovecraft felt that the depiction of alien species in fiction was too familiar, too defined by the range of human comprehension, and he believed that if we were ever to encounter real cosmic beings, they could be so unlike anything in our experience as to be impossible to describe, or even process in our minds. One of his aims with \"Colour\" was to create an entity that didn't fulfil the rubric of conforming to human understanding – hence the only description is by analogy, and even then, it's described only in relation to colour. In fact, it's never even determined if the entity is conscious or not, at least not in the sense that humans recognise consciousness. It may be aware, but it's just as possible that it isn't, and the negative effects experienced by the Gardners aren't a sign of aggressiveness but simply the result of two vastly different existences interacting with one another. The story has been adapted for the screen four main times – Daniel Haller's _Die, Monster, Die!_ (1965), David Keith's _The Curse_ (1987), Ivan Zuccon's _Colour from the Dark_, and Huan Vu's rather enjoyable _Die farbe_ (2010), which is in black and white, except for the colours emitted by the meteorite.\r\n\r\nThis latest version opens with Ward speaking in a contemplative sub-Malick style voiceover that's fairly unnecessary, but which doesn't distract too much (it's only used a couple of times). After some basic introductory preamble to show us the family dynamic and establish important plot points such as Theresa's cancer, Lavinia's Wiccan rituals, Nathan and his alpacas, the film then features one of the most inorganic expositionary scenes I've ever seen, as Nathan and Theresa stand on the porch, admiring the woods and spend a good five minutes telling each other things that they both already know – the property used to belong to Nathan's father, Nathan is afraid of turning into his father, Nathan used to be a painter but hasn't worked in a while, Theresa is starting to get back into work, Lavinia and Benny are finding it hard to adapt to rural life, Jack not so much. It really is a ridiculous scene, to the point where it would have been no more on-the-nose to feature captions with character info.\r\n\r\nWhere Stanley is much more successful is in how he depicts the entity itself, or rather, how he doesn't. Obviously, by choosing to adapt this story, he knew he would have to give some kind of visual representation to something that exists, to human eyes at least, only as a colour beyond the visible spectrum. Lovecraft gets around this problem by way of analogy – the entity is never explicitly described other than by comparison – but this is not a technique available to a filmmaker. With this in mind, Stanley wisely keeps everything as vague as possible – vibrant, modulating pulses of light that seem to be emanating from somewhere just outside the frame, sounds originating from something just out of sight, vaguely-defined spatial distortions, colour manipulations with no obvious source, personality changes with no obvious reasoning behind them. It's rare you see such restraint in what is, ostensibly at least, a horror story, and Stanley is to be commended for it.\r\n\r\nImportant here is the actual colour itself. Again, in the novel, Lovecraft never says, for example, that the colour is \"mainly purple\", or words to that effect, because it isn't describable in those terms, and, once again, this poses a unique problem for a filmmaker – if something on-screen has a colour, then that colour has to be shown. However, instead of attempting to create an indescribable colour, director of photography Steve Annis (_Kissing Candice_; _I Am Mother_) chooses to go the route of not settling for any one stable colour – every time we see the effects of the meteorite, the hue appears to be in a state of flux, modulating through purple, magenta, mauve, fuchsia, lavender – so although we can say the colours are recognisable, they are never identifiable as any one specific colour, which, it has to be said, is probably the best choice the filmmakers could have made.\r\n\r\nAs we get into the third act, the film abandons all sense of restraint and goes completely batshit insane, with about five different things happening at any one moment, and the body horror which has threatened to break through from the earliest moments finally unleashed, foregrounding the exceptional work of special effects supervisor/creature designer Dan Martin (_The Human Centipede 2 (Full Sequence)_; _ABCs of Death 2_; _High Rise_). These scenes are heavily indebted to David Cronenberg, especially his earlier work such as _Shivers_ (1975), _Rabid_ (1977), and _The Brood_ (1979), although the most obvious touchstone is Chris Walas's work on Cronenberg's masterpiece, _The Fly_ (1986), where it's not so much body horror, as body mincemeat. A lot of Martin's creature design seems inspired by the legendary work of Rob Bottin, and there's a direct visual quote of one of the best moments in John Carpenter's _The Thing_ (1982). Some of the more grotesque human-related effects also reminded me a little of Screaming Mad George's work on Brian Yuzna's _Society_ (1989), especially the orgy scene.\r\n\r\nIt's also in the last act where Cage is turned loose, signalled by an epic meltdown when he discovers Benny hasn't closed the barn door and the alpacas have gotten out. From there, it's Nicholas Cage unrestrained, figuratively amped up on amphetamines, cocaine, and coffee. There is a problem with this, however. Full-Cage has been seen in films such as _Vampire's Kiss_, John Woo's _Face/Off_ (1997), Werner Herzog's _Bad Lieutenant: Port of Call – New Orleans_ (2009), _Mom and Dad_, and _Mandy_, but each performance has felt fairly organic, never becoming self-conscious; each performance feels like a legitimate interpretation on the part of the actor, with the character feeling like a psychologically-real person, to one degree or another. In _Colour_, however, to an even greater extent than he did in Neil LaBute's virtually unwatchable _The Wicker Man_ (2006), Cage crosses into self-parody, with his performance having as much to do with people's preconceived notions of a Nicholas Cage performance as it does with finding the character. There are a couple of scenes here were he suddenly goes full-Cage out of nowhere, with very little narrative justification, only to revert to relative normality the next scene, and these alterations don't feel like organic character development, they feel like Cage winking at the audience. \r\n\r\nWhich might be entertaining and all, but which serves neither the character nor the film especially well. For all its insanity, this is a relatively serious movie, but Cage's performance is so manically uneven and unpredictable, that it affects everything around it. Example – after the aforementioned meltdown (\"_Don't you know how expensive those alpacas were_\"), which just about fits in what we know of the character, as Nathan is walking away from Benny and Lavinia, he stops, turns, pauses, shouts, \"_ALPACAS_\", pauses again, and then walks away. This got a huge laugh at the screening I attended, and it was undoubtedly funny. But does self-reflexive humour by the leading man really serve the story well at this point? No, not in the slightest. In essence, this scene marks the point where the character ceases to be Nathan Gardner and becomes a version of Nicholas Cage. And this is driven home in the very next scene, where Cage once again portrays Gardner as a kind and caring father.\r\n\r\nThe other characters all have a kind of internal logic to their crumbling sanity; the meteorite affects each of them differently, with their minds disintegrating in different, but consistent ways. With Cage, however, it's there one minute, absent the next, and Stanley seems unwilling, or unable, to establish the parameters by which Nathan's mind is disintegrating, seemingly going for laughs rather than something more cogent.\r\n\r\nThis issue notwithstanding, I enjoyed _Colour Out of Space_ a great deal. Stanley's return to the director's chair is to be admired for its restraint and how faithful it remains to the very tricky Lovecraftian original. The body-horror in the film's last act will appeal to fans of the grotesque, whilst others will take great pleasure from Cage's insanity, as narratively unjustified as it is. The film is ridiculous on many levels, but it's extremely well realised and well made, and is to be applauded for not trying to attach an explicit meaning to a story which avoids any kind of thematic specificity.", "created_at": "2019-11-11T00:43:12.759Z"}, {"movie_id": 548473, "review_id": "5dd48fd93faba00013f39556", "author_rating": 4.0, "review_text": "Combining the unholy trio of Nicolas Cage, H.P. Lovecraft and Richard Stanley seems like insane brilliance on paper, which is why it’s so disappointing that ‘Color Out of Space’, despite some interesting themes and reverence to alpacas, is a bit of a slog.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-color-out-of-space-a-messy-fusion-of-sci-fi-horror-and-comedy", "created_at": "2019-11-20T00:59:05.266Z"}, {"movie_id": 548473, "review_id": "5e4853c81e92250015c0a675", "author_rating": 6.0, "review_text": "Trippy movie for sure, but having never read anything from H.P. Lovecraft, probably don't appreciate it compared to most but visually interesting and also bizarre, felt like Close Encounters of the Third Kind meets Donnie Darko. One thing setting it back was some, presumably, unintentionally funny scenes, one where Cage yells at some fruit. But his performance was alright, and young Madeleine Arthur was probably the standout.\r\n\r\nI don't know how to feel, certainly does stand out from the rest in terms of horror-sci-fi, I'll give it that much. **3.0/5**", "created_at": "2020-02-15T20:25:44.086Z"}, {"movie_id": 548473, "review_id": "5e74c0812f3b1700194f1f96", "author_rating": 8.0, "review_text": "_Colour Out of Space_ was one of the biggest joys that 2019 cinema brought me. I was genuinely thrilled by it from about fifteen minutes in right up until the credits rolled. Not to mention for several days afterwards.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2020-03-20T13:09:21.951Z"}, {"movie_id": 548473, "review_id": "608e3a2bd7107e0040689649", "author_rating": 1.0, "review_text": "A thoughtless adaption of one of Lovecraft's most recognizable stories. The film maker clearly failed to grasp the themes of Lovecraft and only took notice of the most obvious surface elements. Coupled with lazy direction that produces some of the most unintentionally funny moments I've ever seen in a \"thriller\", shallow characters that seemingly have no motivation for their actions beyond the trope that they represent, and a heavy pile of cgi. It is my opinion that this is one of many attempts at production companies trying to cash in on the resurgence of Lovecraftian horror in the public eye.", "created_at": "2021-05-02T05:35:39.328Z"}, {"movie_id": 548473, "review_id": "6177061dfdc4fa002a9c827d", "author_rating": 8.0, "review_text": "\" _**The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown**_ \" -H.P.Lovecraft\r\n\r\nIt is very difficult to make a film adaptation of any H.P.Lovecraft short story. When an author aims to paint an image of the Unknown through poetic mastery it makes the task immensely difficult for any Director who refuses to alter the story itself. It was truly an incomprehensible mystery which ultimately ends and I wondered what was it that I had just watched? Then I realized I felt the same way when I read his short story years ago. I loved both.\r\n\r\nIt was intriguing, eerie, unpredictable and disturbing. Watch it for the art of the images as well as for the beauty behind the complexity of the writer who has a level of Linguistic Intelligence very few will ever understand. Including myself. Being able to make someone feel disturbed without using any violence or excess of violence is what I feel is pure Horror. Which is what H.P. Lovecraft believed and excelled at.\r\n\r\nThat being said the Director did an amazing work of art. It was beautiful to look at, the images were fantastic and it gets a solid 8.5/10 from me.\r\n\r\n_Parental Advisory_: **16+**\r\n\r\nThis is not a film for children or even young teenagers. It has no violence however it displays gore and blood in several scenes to a 7/10 intensity at its peak. It can create a very eerie and edgy ambience throughout the second half that creeps up on you and before you know it you might feel very uncomfortable. \r\n\r\n-_**eQuilibrium**_", "created_at": "2021-10-25T19:31:41.428Z"}, {"movie_id": 548473, "review_id": "639be96193db920093a99f11", "author_rating": 10.0, "review_text": "This movie is slow paced, builds up action for the ending which is worth the watch. Brilliant sci fi film based on Lovecraftian tale.", "created_at": "2022-12-16T03:43:29.755Z"}]