[{"movie_id": 397837, "review_id": "5935d01b92514105130031d1", "author_rating": 6.0, "review_text": "**Not about a second chance, but infinite!**\r\n\r\nEven if you are not that into the films, you probably have seen at least a couple film related to 'time loop'. For me, this is like hundredth. When I first saw the trailer, I said 'not again'. 'Time loop' is just a concept, but the storyline for it drawn differently. It tells the story of a high school girl on the Cupid's Day, a special day for her since she has a big for it to remember. Like usual her day goes on and at the end of the day something goes wrong and then she wakes again on the same day in the following day which keeps repeating. Now how she's going to find a solution or the reason for it is covered in the rest of the film.\r\n\r\nFamiliar them, but well designed storyline around it. In some way, it is same as 'Groundhog Day', though it is about a teenager and more serious and tragic tale. We sometimes wish for a second chance, that's how this film was developed, but even bigger scale with a small message for teenagers.\r\n\r\nAwesome performances, particularly Zoey. Predictable scenes, so I had thought of couple of ending that did not happen. And I also disappointed how it concluded. Not the best solution, yet an unexpected twist. Originally the film was based on the book of the same name. This is a small budget and a quality film. The direction was good, very rich in presentation. Definitely not bad for once viewing.\r\n\r\n_6/10_", "created_at": "2017-06-05T21:41:47.195Z"}, {"movie_id": 397837, "review_id": "5981e93892514151ed015e77", "author_rating": 5.0, "review_text": "_Donnie Darko Lite™_ by way of _Groundhog Day_.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-08-02T15:01:12.977Z"}, {"movie_id": 397837, "review_id": "5b6694299251414054085ab7", "author_rating": 10.0, "review_text": "It's a very good movie but I think the last scene was predictable", "created_at": "2018-08-05T06:07:37.552Z"}]