[{"movie_id": 476968, "review_id": "631ac1a991f0ea007a52c55a", "author_rating": 1.0, "review_text": "Can you be said to lead by example when the example is spurious? Paul, Apostle of Christ is the early Christianity 'success story' of the conversion of Mauritius Gallas (Olivier Martinez), Commander of the Third Legion of Rome, and Prefect of the Mamertine Prison.\r\n\r\nActually, I’m not even sure Mauritius officially converted; he certainly formed a better opinion of Christians after Saint Luke cured his daughter of an indeterminate disease. I guess the filmmakers deserve some credit for not presenting this as a miracle (Luke saves the little girl’s life through his medical knowledge), but it really makes no difference anyway because there was no sick child, no Mauritius Gallas, no Third Legion, no nothing.\r\n\r\nThis is a kind of artistic license that goes well beyond the fact that everyone in Nero’s Rome speaks fluent English (with a French accent, in Martinez’s case). Mauritius’s conversion (if indeed he converted) doesn’t carry as much weight as, say, that of Constantine, and not because the latter was an Emperor and the former a humble prefect; the problem is that Mauritius’s change of heart doesn’t appears to take place, not as a sign of personal growth, but simply because it’s in the script.\r\n\r\nI mean, if you’re just going to make shit up, why stop at one conversion? Why not go ahead and make it so that the entire Third Legion accepted Jesus Christ into their hearts as their Lord and Savior?\r\n\r\nLuke is only slightly less fictional than Mauritius, and equally problematic. A \"Luke,\" to whom tradition assigns authorship of the Gospel of Luke and the Acts of the Apostles, was mentioned by Paul in three of his epistles.\r\n\r\nThe movie depicts Luke (Jim Caviezel) visiting Paul (James Faulkner) in the rather well-lit \"darkness\" of his cell, where the two commit the Acts to paper. Why? According to Paul, \"[Luke] believes people should know the certainties of my life.\"\r\n\r\nThis turns out to be quite an unwittingly ironical statement, considering that a) though the Gospel of Luke and the Acts of the Apostles are attributed to the same author, the true identity of this author remains unknown, and b) there are many contradictions between the Acts and the authentic Pauline letters; thus, in the odd chance Luke did in fact pen these books, it’d be safe to say that he and Paul weren’t as simpatico as this movie would have us believe (the aforementioned irony, by the way, is completely lost on the filmmakers, according to whom \"Paul’s life was well documented by Luke\").\r\n\r\n ", "created_at": "2022-09-09T04:31:37.053Z"}]