[{"movie_id": 8676, "review_id": "5c6bf1349251417aa209ee8d", "author_rating": 6.0, "review_text": "***Fun island thriller, but a little too long***  \r\n\r\nReleased in 2008, \"Fool's Gold\" stars Matthew McConaughey & Kate Hudson as a couple on the verge of divorce in the Bahamas, the former a treasure-seeker. Donald Sutherland plays Hudson's new rich boss and Alexis Dziena his bimbo-ish daughter. Ray Winstone and Kevin Hart also factor in as potential villains.\r\n\r\nIf you can imagine serious island-thrillers like \"The Deep\" and the two \"Into the Blue\" flicks mixed with a heavy dose of comedy and cartoonish action you'd have a good idea of \"Fool's Gold.\" It's basically \"The Goonies\" as adults in the Bahamas. \r\n\r\nKate and McConaughey look great and are great together, and everyone else is likable, even the villains (sort of). The problem is the movie is too long at 1 hour, 52 minutes. A silly, fun film like should limit the runtime to around 85-100 minutes.\r\n\r\nThe story takes place in (or near) the Bahamas, but the film was shot on the east coast of Queensland, and you can tell. The coast of Queensland is gorgeous but it lacks the lushness of the Caribbean. Regardless, the film is worth watching just for the locations, especially on a cloudy fall day or a cold winter night.\r\n\r\nSo this is a fun island flick with romance, treasure-hunting and adventure, but it’s a little too long for such goofy antics. For the real deal in oceanic thrillers check out 2009's \"Into the Blue 2: The Reef,\" which IMHO is way better than the original \"Into the Blue\" from 2005. \r\n\r\nGRADE: B-/C+", "created_at": "2019-02-19T12:06:12.177Z"}, {"movie_id": 8676, "review_id": "63c322fea5743d00c3c00ada", "author_rating": 10.0, "review_text": "It is far from a bad film...unless you are the kind of person that just can't stand a fun, pulp adventure story.\r\n\r\nBasically all this movie is is a pulp novel turned into a movie.\r\n\r\nHad it been made in the Golden Age of Hollywood right up to the 1980s it would have been a hit. Had it been made in the 1990s it would have been a modest success...\r\n\r\nBut it was made in 2008 and the tastes of the world had changed. 9-11 had come and gone and people lost that childlike innocence that is needed to enjoy films like this. The Computer Age dawned and everyone wanted nothing but over-the-top special effects.\r\n\r\nSo fun adventures were shoved to the side and the critics--that still claim to love fun adventures like Captain Blood--turned their noses up at anyone that even hinted towards enjoying them.\r\n\r\nWhat you have is a treasure standing in for the MacGuffin, a roguish hero, a little bit of a love triangle, and the open seas.\r\n\r\nIt is classic Hollywood. It is also, unfortunately, they kind of movie we need today and the kind that Hollywood is most reluctant to make.", "created_at": "2023-01-14T21:47:42.702Z"}]