[{"movie_id": 246655, "review_id": "57acf03292514158840001b2", "author_rating": null, "review_text": "Not really a step forward in the X-Men franchise. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/x-men-apocalypse-review", "created_at": "2016-08-11T21:37:54.523Z"}, {"movie_id": 246655, "review_id": "57d15d9e92514173a30094f2", "author_rating": 5.0, "review_text": "Though far from the worst _X-Men_ film, _Apocalypse_ was still a disappointment, because until this entry, every Bryan Singer _X-Men_ film had been excellent. _Apocalypse_ is a far cry from terrible, but it is underwhelming given Singer's history, as well as in and of itself.\r\n\r\nCertain actors, who shall remain Jennifer Lawrence, were completely checked out in this instalment. The CGI was often so bad it was confronting, even in the climax of the film. Apocalypse's plan was plot-hole-y and underdeveloped, and not all of the new characters hit it out of the park.\r\n\r\nThere was still a lot to like here though. Some of the newer costumes were neat, and a lot of the side-plots had me very intrigued. Fassbender and McAvoy are excellent as always. It's certainly not a failure amongst the likes of, for example, _X-Men: The Last Stand_. Which was a good callout in _Apocalypse_. Another thing I enjoyed.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-08T12:46:22.836Z"}, {"movie_id": 246655, "review_id": "580e44b59251416e18001907", "author_rating": 5.0, "review_text": "**Another ancient power was awoken and blah blah blah.**\r\n\r\nI have seen almost all the superhero films of the recent time, but this is the franchise I never liked. I'm sorry to say that, but that's the truth. The 'X-Men' series never made me sense, particularly to say it from the Marvel comics is a disappointment. When it comes to 'Wolverine', my opinion is different, because I loved those films. Hugh Jackman as Logan is the only 'X-Men' I love, so like usual this is another waste of time from its series to me.\r\n\r\nI even enjoyed the recently rebooted 'Fantastic Four', but not this one. There's nothing new in the story, it's the same plot stolen from the different films. Like an ancient force is awoken who tries to rule the world by destroying everything created so far by the humans. So the mutants join hands to bring him down and we know what happens at the end. Apart from the vfx, this is very boring film and 150 minutes runtime was another lengthy joke that you never laugh.\r\n\r\nNot just me, many people, even 'X-Men' fans showed displeasure over this film. That means, Bryan Singer's stint with the franchise is pretty much over. So they will going to bring a new one and that's another disappointment, because I don't know how long they're going to drag this series. End it already. Anyway, like I said I never was or will be this universe fan, so I don't care much, rather I just give them a try when they get released and obviously I'm to end in regret watching. Instead, I'm looking forward to the final 'Wolverine' film with Hugh Jackman.\r\n\r\n_5/10_", "created_at": "2016-10-24T17:28:21.070Z"}, {"movie_id": 246655, "review_id": "589464f2925141426c004fbd", "author_rating": 8.0, "review_text": "X-Men Apocalypse is typical of what you would expect from a Marvel X-Men movie. Light on story and depth and heavy on special effects and action. In short it is exactly what I, as a Science Fiction and Fantasy geek, would expect as well as hope for.\r\n\r\nThe X-Men faces a new threat in the form of the worlds first mutant. Naturally said mutant is really a Übermutant vastly more powerful than any “normal” mutant. Equally naturally this Übermutant is set on a path of world destruction and domination. I quite liked this villain. He is a good all evil and powerful bad guy and a worthy adversary. No nonsense about trying to make the villain likable or trying to explain why he turned evil or such like. This guy is evil, he is the bad guy, he needs to be taken down…full stop.\r\n\r\nAs I wrote the story is not the most elaborate one around but it is a good one within the confines of a Marvel super hero movie. It gets the job done without being overly stupid or silly. It is set in the “prequel” universe created by X-Men First Class. The movie adds a few new X-Men to the ranks of Professor Xaviers team. Some of them thanks to the manipulations of Apocalypse although they start out on the bad side at first.\r\n\r\nThe movie moves along at a decent enough pace and, as was mentioned, there are quite a few action sequences and special effects thrown at the viewer throughout the movie. Personally I found the special effects to be quite good. Even stunning at times. I am quite a bit of a special effects nerd so of course this pleased me a lot.\r\n\r\nThe movies ending certainly opens the door to future X-Men movies and I for sure would like to see the franchise continue. I very much enjoyed these almost two and a half hours in front of my TV set.", "created_at": "2017-02-03T11:09:38.498Z"}, {"movie_id": 246655, "review_id": "58d2ad4ac3a368121b000cf4", "author_rating": 4.0, "review_text": "*** This review may contain spoilers ***\r\n\r\nAfter immensely enjoying the turn the X-Men franchise took after the disappointment of X-Men: The Last Stand, I was pretty excited to see this movie. I love comics, but I never got into the X-Men, so I can excuse some of the inaccuracies that seemed to upset hardcore fans. I just enjoyed the movies.\r\n\r\nX-Men Apocalypse is the weakest film since duds like Last Stand and Wolverine Origins. It just didn't have a whole lot going on. One of the biggest critiques of Marvel (yes, I know X-Men films aren't produced by Marvel Studios, but I'm speaking of the publisher of the original medium) is that their villains are lackluster. The big baddie through the whole franchise has been Magneto, easily the most charismatic and entertaining Marvel villain on film. Though we've had brushes with Stryker and Trask and his sentinels, this is the first movie in which the X-Men had taken on a true super villain who wasn't Magneto-- Wolverine vs. The Silver Samurai aside. \r\n\r\nBut it's almost like director Bryan Singer painted himself into a corner with Apocalypse. The villain was too powerful and could have easily achieved his goals without the help of his \"four horsemen.\" He could have ended the world, in mere minutes, all by himself. But, of course, that would make a boring movie, so Singer and Co. had to figure out what to do with the world's most powerful and dangerous mutant for two hours before the final climax was to begin.\r\n\r\nThere were scenes where the villains were literally sitting around the desert talking about how they were going to lay waste to a city on the horizon. There were scenes where the most powerful of the villains went out recruiting much less powerful villains to join him. Really, Singer just didn't know what to do with this character. How do you create conflict and drama when the bad guy is just too powerful? Well, you can't. \r\n\r\nOf course, after two hours of watching the most powerful mutant ever talk about what he is going to do (instead of simply doing it) he finally unleashes his fury. Except that, the X- Men actually have the most powerful mutant in the world on their side in Jean Grey.\r\n\r\nSo, again, why is Jean not simply destroying Apocalypse in the first 10 minutes of the movie? Because, running time needs filler.\r\n\r\nAnd that's basically what this movie is: Filler. They came up with a concept that would make the storytelling aspect problematic. And rather than tweaking the concept or fleshing out the story with subplots, they just assumed explosions and superhero fights would be enough to carry the film.", "created_at": "2017-03-22T16:58:50.550Z"}, {"movie_id": 246655, "review_id": "59602ee7c3a368253c09ad10", "author_rating": 4.0, "review_text": "What a let down after Days of Future Past (the best X-Men movie ever, in my opinion). Bryan Singer has usually directed some of the best films of the franchise but this one is a real clunker. Too many characters with not enough development and a very lackluster villain. Oscar Isaac is a talented actor, but even he can't make Apocalypse interesting under all that silly blue make up. Characters like Angel and Psylocke, as Apocalypse's horsemen, are very thinly written and barely have a personality. Also, it is absolutely ridiculous that the villain Mystique is transformed into a role model and leader for the X-Men in this movie. Jennifer Lawrence looks bored throughout and barely appears as Mystique's true blue self even though she's supposed to be an out and proud mutant. A real disappointment.", "created_at": "2017-07-08T01:01:27.829Z"}, {"movie_id": 246655, "review_id": "5bf6f151c3a368189f0e0e37", "author_rating": 8.0, "review_text": "***Ranks with the best in the X-Men franchise***  \r\n\r\nReleased in 2016 and directed/co-written by Bryan Singer, \"X-Men: Apocalypse\" has the team go up against the first mutant, Apocalypse (Oscar Isaac), whose origins date back to ancient Egypt. After thousands of years in stasis, Apocalypse is immediately disillusioned by the state of the world and so recruits a team of worthy mutants, including a dispirited Magneto (Michael Fassbender), to purge humanity and craft a new world order over which he will reign. Professor X (James McAvoy), with the assistance of Raven (Jennifer Lawrence), leads a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction. Josh Helman is on hand as Col. Stryker.\r\n\r\nThis sixth film in the franchise (not including the several spin off films) easily ranks as one of the best. It includes many of the best elements of the X-Men and everything I would want in a great X-Men flick:\r\n\r\nProfessor X's ongoing goal for an educational sanctuary for interesting mutants from all over the world; his love for Moira (Rose Byrne); Magneto's increasing mastery of his great powers and his struggle to go on the offensive against prejudiced humanity; a greater focus on Cyclops (Tye Sheridan) and his potent power, both of which were neglected in the original trilogy; an outstanding actress to play Jean Grey (Sophie Turner), who is far better than the bland Famke Janssen; Olivia Munn's ultra-hotness as Psylocke; a worthy subplot on Weapon X with the corresponding guest appearance of Wolverine (Hugh Jackman); an excellent collection of young mutants, like Storm (Alexandra Shipp), Beast (Nicholas Hoult), Quicksilver (Evan Peters), Nightcrawler (Kodi Smit-McPhee), Havok (Lucas Till), Angel (Ben Hardy), etc.; a worthy main villain in the mold of Dr. Doom and Thanatos; an epic, apocalyptic final act (sorry); I could go on and on.\r\n\r\nThis isn't to say the movie doesn't have faults, however; the cartoony overblown prologue in ancient Egypt is Exhibit A.\r\n\r\nThe film runs 144 minutes and was shot in Quebec, Canada (Greenfield Park, Montreal and Oka).\r\n\r\nGRADE: A-", "created_at": "2018-11-22T18:11:29.943Z"}, {"movie_id": 246655, "review_id": "5c14bb0ec3a36866bd366868", "author_rating": 6.0, "review_text": "Plenty of action with good acting, however, Apocalypse (the villain) lacks originality. X-Men: Apocalypse is a mediocre film in the respected franchise that is \"X-Men\"", "created_at": "2018-12-15T08:27:58.629Z"}, {"movie_id": 246655, "review_id": "57acf03292514158840001b2", "author_rating": null, "review_text": "Not really a step forward in the X-Men franchise. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/x-men-apocalypse-review", "created_at": "2016-08-11T21:37:54.523Z"}, {"movie_id": 246655, "review_id": "57d15d9e92514173a30094f2", "author_rating": 5.0, "review_text": "Though far from the worst _X-Men_ film, _Apocalypse_ was still a disappointment, because until this entry, every Bryan Singer _X-Men_ film had been excellent. _Apocalypse_ is a far cry from terrible, but it is underwhelming given Singer's history, as well as in and of itself.\r\n\r\nCertain actors, who shall remain Jennifer Lawrence, were completely checked out in this instalment. The CGI was often so bad it was confronting, even in the climax of the film. Apocalypse's plan was plot-hole-y and underdeveloped, and not all of the new characters hit it out of the park.\r\n\r\nThere was still a lot to like here though. Some of the newer costumes were neat, and a lot of the side-plots had me very intrigued. Fassbender and McAvoy are excellent as always. It's certainly not a failure amongst the likes of, for example, _X-Men: The Last Stand_. Which was a good callout in _Apocalypse_. Another thing I enjoyed.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-08T12:46:22.836Z"}, {"movie_id": 246655, "review_id": "580e44b59251416e18001907", "author_rating": 5.0, "review_text": "**Another ancient power was awoken and blah blah blah.**\r\n\r\nI have seen almost all the superhero films of the recent time, but this is the franchise I never liked. I'm sorry to say that, but that's the truth. The 'X-Men' series never made me sense, particularly to say it from the Marvel comics is a disappointment. When it comes to 'Wolverine', my opinion is different, because I loved those films. Hugh Jackman as Logan is the only 'X-Men' I love, so like usual this is another waste of time from its series to me.\r\n\r\nI even enjoyed the recently rebooted 'Fantastic Four', but not this one. There's nothing new in the story, it's the same plot stolen from the different films. Like an ancient force is awoken who tries to rule the world by destroying everything created so far by the humans. So the mutants join hands to bring him down and we know what happens at the end. Apart from the vfx, this is very boring film and 150 minutes runtime was another lengthy joke that you never laugh.\r\n\r\nNot just me, many people, even 'X-Men' fans showed displeasure over this film. That means, Bryan Singer's stint with the franchise is pretty much over. So they will going to bring a new one and that's another disappointment, because I don't know how long they're going to drag this series. End it already. Anyway, like I said I never was or will be this universe fan, so I don't care much, rather I just give them a try when they get released and obviously I'm to end in regret watching. Instead, I'm looking forward to the final 'Wolverine' film with Hugh Jackman.\r\n\r\n_5/10_", "created_at": "2016-10-24T17:28:21.070Z"}, {"movie_id": 246655, "review_id": "589464f2925141426c004fbd", "author_rating": 8.0, "review_text": "X-Men Apocalypse is typical of what you would expect from a Marvel X-Men movie. Light on story and depth and heavy on special effects and action. In short it is exactly what I, as a Science Fiction and Fantasy geek, would expect as well as hope for.\r\n\r\nThe X-Men faces a new threat in the form of the worlds first mutant. Naturally said mutant is really a Übermutant vastly more powerful than any “normal” mutant. Equally naturally this Übermutant is set on a path of world destruction and domination. I quite liked this villain. He is a good all evil and powerful bad guy and a worthy adversary. No nonsense about trying to make the villain likable or trying to explain why he turned evil or such like. This guy is evil, he is the bad guy, he needs to be taken down…full stop.\r\n\r\nAs I wrote the story is not the most elaborate one around but it is a good one within the confines of a Marvel super hero movie. It gets the job done without being overly stupid or silly. It is set in the “prequel” universe created by X-Men First Class. The movie adds a few new X-Men to the ranks of Professor Xaviers team. Some of them thanks to the manipulations of Apocalypse although they start out on the bad side at first.\r\n\r\nThe movie moves along at a decent enough pace and, as was mentioned, there are quite a few action sequences and special effects thrown at the viewer throughout the movie. Personally I found the special effects to be quite good. Even stunning at times. I am quite a bit of a special effects nerd so of course this pleased me a lot.\r\n\r\nThe movies ending certainly opens the door to future X-Men movies and I for sure would like to see the franchise continue. I very much enjoyed these almost two and a half hours in front of my TV set.", "created_at": "2017-02-03T11:09:38.498Z"}, {"movie_id": 246655, "review_id": "58d2ad4ac3a368121b000cf4", "author_rating": 4.0, "review_text": "*** This review may contain spoilers ***\r\n\r\nAfter immensely enjoying the turn the X-Men franchise took after the disappointment of X-Men: The Last Stand, I was pretty excited to see this movie. I love comics, but I never got into the X-Men, so I can excuse some of the inaccuracies that seemed to upset hardcore fans. I just enjoyed the movies.\r\n\r\nX-Men Apocalypse is the weakest film since duds like Last Stand and Wolverine Origins. It just didn't have a whole lot going on. One of the biggest critiques of Marvel (yes, I know X-Men films aren't produced by Marvel Studios, but I'm speaking of the publisher of the original medium) is that their villains are lackluster. The big baddie through the whole franchise has been Magneto, easily the most charismatic and entertaining Marvel villain on film. Though we've had brushes with Stryker and Trask and his sentinels, this is the first movie in which the X-Men had taken on a true super villain who wasn't Magneto-- Wolverine vs. The Silver Samurai aside. \r\n\r\nBut it's almost like director Bryan Singer painted himself into a corner with Apocalypse. The villain was too powerful and could have easily achieved his goals without the help of his \"four horsemen.\" He could have ended the world, in mere minutes, all by himself. But, of course, that would make a boring movie, so Singer and Co. had to figure out what to do with the world's most powerful and dangerous mutant for two hours before the final climax was to begin.\r\n\r\nThere were scenes where the villains were literally sitting around the desert talking about how they were going to lay waste to a city on the horizon. There were scenes where the most powerful of the villains went out recruiting much less powerful villains to join him. Really, Singer just didn't know what to do with this character. How do you create conflict and drama when the bad guy is just too powerful? Well, you can't. \r\n\r\nOf course, after two hours of watching the most powerful mutant ever talk about what he is going to do (instead of simply doing it) he finally unleashes his fury. Except that, the X- Men actually have the most powerful mutant in the world on their side in Jean Grey.\r\n\r\nSo, again, why is Jean not simply destroying Apocalypse in the first 10 minutes of the movie? Because, running time needs filler.\r\n\r\nAnd that's basically what this movie is: Filler. They came up with a concept that would make the storytelling aspect problematic. And rather than tweaking the concept or fleshing out the story with subplots, they just assumed explosions and superhero fights would be enough to carry the film.", "created_at": "2017-03-22T16:58:50.550Z"}, {"movie_id": 246655, "review_id": "59602ee7c3a368253c09ad10", "author_rating": 4.0, "review_text": "What a let down after Days of Future Past (the best X-Men movie ever, in my opinion). Bryan Singer has usually directed some of the best films of the franchise but this one is a real clunker. Too many characters with not enough development and a very lackluster villain. Oscar Isaac is a talented actor, but even he can't make Apocalypse interesting under all that silly blue make up. Characters like Angel and Psylocke, as Apocalypse's horsemen, are very thinly written and barely have a personality. Also, it is absolutely ridiculous that the villain Mystique is transformed into a role model and leader for the X-Men in this movie. Jennifer Lawrence looks bored throughout and barely appears as Mystique's true blue self even though she's supposed to be an out and proud mutant. A real disappointment.", "created_at": "2017-07-08T01:01:27.829Z"}, {"movie_id": 246655, "review_id": "5bf6f151c3a368189f0e0e37", "author_rating": 8.0, "review_text": "***Ranks with the best in the X-Men franchise***  \r\n\r\nReleased in 2016 and directed/co-written by Bryan Singer, \"X-Men: Apocalypse\" has the team go up against the first mutant, Apocalypse (Oscar Isaac), whose origins date back to ancient Egypt. After thousands of years in stasis, Apocalypse is immediately disillusioned by the state of the world and so recruits a team of worthy mutants, including a dispirited Magneto (Michael Fassbender), to purge humanity and craft a new world order over which he will reign. Professor X (James McAvoy), with the assistance of Raven (Jennifer Lawrence), leads a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction. Josh Helman is on hand as Col. Stryker.\r\n\r\nThis sixth film in the franchise (not including the several spin off films) easily ranks as one of the best. It includes many of the best elements of the X-Men and everything I would want in a great X-Men flick:\r\n\r\nProfessor X's ongoing goal for an educational sanctuary for interesting mutants from all over the world; his love for Moira (Rose Byrne); Magneto's increasing mastery of his great powers and his struggle to go on the offensive against prejudiced humanity; a greater focus on Cyclops (Tye Sheridan) and his potent power, both of which were neglected in the original trilogy; an outstanding actress to play Jean Grey (Sophie Turner), who is far better than the bland Famke Janssen; Olivia Munn's ultra-hotness as Psylocke; a worthy subplot on Weapon X with the corresponding guest appearance of Wolverine (Hugh Jackman); an excellent collection of young mutants, like Storm (Alexandra Shipp), Beast (Nicholas Hoult), Quicksilver (Evan Peters), Nightcrawler (Kodi Smit-McPhee), Havok (Lucas Till), Angel (Ben Hardy), etc.; a worthy main villain in the mold of Dr. Doom and Thanatos; an epic, apocalyptic final act (sorry); I could go on and on.\r\n\r\nThis isn't to say the movie doesn't have faults, however; the cartoony overblown prologue in ancient Egypt is Exhibit A.\r\n\r\nThe film runs 144 minutes and was shot in Quebec, Canada (Greenfield Park, Montreal and Oka).\r\n\r\nGRADE: A-", "created_at": "2018-11-22T18:11:29.943Z"}, {"movie_id": 246655, "review_id": "5c14bb0ec3a36866bd366868", "author_rating": 6.0, "review_text": "Plenty of action with good acting, however, Apocalypse (the villain) lacks originality. X-Men: Apocalypse is a mediocre film in the respected franchise that is \"X-Men\"", "created_at": "2018-12-15T08:27:58.629Z"}, {"movie_id": 246655, "review_id": "57acf03292514158840001b2", "author_rating": null, "review_text": "Not really a step forward in the X-Men franchise. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/x-men-apocalypse-review", "created_at": "2016-08-11T21:37:54.523Z"}, {"movie_id": 246655, "review_id": "57d15d9e92514173a30094f2", "author_rating": 5.0, "review_text": "Though far from the worst _X-Men_ film, _Apocalypse_ was still a disappointment, because until this entry, every Bryan Singer _X-Men_ film had been excellent. _Apocalypse_ is a far cry from terrible, but it is underwhelming given Singer's history, as well as in and of itself.\r\n\r\nCertain actors, who shall remain Jennifer Lawrence, were completely checked out in this instalment. The CGI was often so bad it was confronting, even in the climax of the film. Apocalypse's plan was plot-hole-y and underdeveloped, and not all of the new characters hit it out of the park.\r\n\r\nThere was still a lot to like here though. Some of the newer costumes were neat, and a lot of the side-plots had me very intrigued. Fassbender and McAvoy are excellent as always. It's certainly not a failure amongst the likes of, for example, _X-Men: The Last Stand_. Which was a good callout in _Apocalypse_. Another thing I enjoyed.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-08T12:46:22.836Z"}, {"movie_id": 246655, "review_id": "580e44b59251416e18001907", "author_rating": 5.0, "review_text": "**Another ancient power was awoken and blah blah blah.**\r\n\r\nI have seen almost all the superhero films of the recent time, but this is the franchise I never liked. I'm sorry to say that, but that's the truth. The 'X-Men' series never made me sense, particularly to say it from the Marvel comics is a disappointment. When it comes to 'Wolverine', my opinion is different, because I loved those films. Hugh Jackman as Logan is the only 'X-Men' I love, so like usual this is another waste of time from its series to me.\r\n\r\nI even enjoyed the recently rebooted 'Fantastic Four', but not this one. There's nothing new in the story, it's the same plot stolen from the different films. Like an ancient force is awoken who tries to rule the world by destroying everything created so far by the humans. So the mutants join hands to bring him down and we know what happens at the end. Apart from the vfx, this is very boring film and 150 minutes runtime was another lengthy joke that you never laugh.\r\n\r\nNot just me, many people, even 'X-Men' fans showed displeasure over this film. That means, Bryan Singer's stint with the franchise is pretty much over. So they will going to bring a new one and that's another disappointment, because I don't know how long they're going to drag this series. End it already. Anyway, like I said I never was or will be this universe fan, so I don't care much, rather I just give them a try when they get released and obviously I'm to end in regret watching. Instead, I'm looking forward to the final 'Wolverine' film with Hugh Jackman.\r\n\r\n_5/10_", "created_at": "2016-10-24T17:28:21.070Z"}, {"movie_id": 246655, "review_id": "589464f2925141426c004fbd", "author_rating": 8.0, "review_text": "X-Men Apocalypse is typical of what you would expect from a Marvel X-Men movie. Light on story and depth and heavy on special effects and action. In short it is exactly what I, as a Science Fiction and Fantasy geek, would expect as well as hope for.\r\n\r\nThe X-Men faces a new threat in the form of the worlds first mutant. Naturally said mutant is really a Übermutant vastly more powerful than any “normal” mutant. Equally naturally this Übermutant is set on a path of world destruction and domination. I quite liked this villain. He is a good all evil and powerful bad guy and a worthy adversary. No nonsense about trying to make the villain likable or trying to explain why he turned evil or such like. This guy is evil, he is the bad guy, he needs to be taken down…full stop.\r\n\r\nAs I wrote the story is not the most elaborate one around but it is a good one within the confines of a Marvel super hero movie. It gets the job done without being overly stupid or silly. It is set in the “prequel” universe created by X-Men First Class. The movie adds a few new X-Men to the ranks of Professor Xaviers team. Some of them thanks to the manipulations of Apocalypse although they start out on the bad side at first.\r\n\r\nThe movie moves along at a decent enough pace and, as was mentioned, there are quite a few action sequences and special effects thrown at the viewer throughout the movie. Personally I found the special effects to be quite good. Even stunning at times. I am quite a bit of a special effects nerd so of course this pleased me a lot.\r\n\r\nThe movies ending certainly opens the door to future X-Men movies and I for sure would like to see the franchise continue. I very much enjoyed these almost two and a half hours in front of my TV set.", "created_at": "2017-02-03T11:09:38.498Z"}, {"movie_id": 246655, "review_id": "58d2ad4ac3a368121b000cf4", "author_rating": 4.0, "review_text": "*** This review may contain spoilers ***\r\n\r\nAfter immensely enjoying the turn the X-Men franchise took after the disappointment of X-Men: The Last Stand, I was pretty excited to see this movie. I love comics, but I never got into the X-Men, so I can excuse some of the inaccuracies that seemed to upset hardcore fans. I just enjoyed the movies.\r\n\r\nX-Men Apocalypse is the weakest film since duds like Last Stand and Wolverine Origins. It just didn't have a whole lot going on. One of the biggest critiques of Marvel (yes, I know X-Men films aren't produced by Marvel Studios, but I'm speaking of the publisher of the original medium) is that their villains are lackluster. The big baddie through the whole franchise has been Magneto, easily the most charismatic and entertaining Marvel villain on film. Though we've had brushes with Stryker and Trask and his sentinels, this is the first movie in which the X-Men had taken on a true super villain who wasn't Magneto-- Wolverine vs. The Silver Samurai aside. \r\n\r\nBut it's almost like director Bryan Singer painted himself into a corner with Apocalypse. The villain was too powerful and could have easily achieved his goals without the help of his \"four horsemen.\" He could have ended the world, in mere minutes, all by himself. But, of course, that would make a boring movie, so Singer and Co. had to figure out what to do with the world's most powerful and dangerous mutant for two hours before the final climax was to begin.\r\n\r\nThere were scenes where the villains were literally sitting around the desert talking about how they were going to lay waste to a city on the horizon. There were scenes where the most powerful of the villains went out recruiting much less powerful villains to join him. Really, Singer just didn't know what to do with this character. How do you create conflict and drama when the bad guy is just too powerful? Well, you can't. \r\n\r\nOf course, after two hours of watching the most powerful mutant ever talk about what he is going to do (instead of simply doing it) he finally unleashes his fury. Except that, the X- Men actually have the most powerful mutant in the world on their side in Jean Grey.\r\n\r\nSo, again, why is Jean not simply destroying Apocalypse in the first 10 minutes of the movie? Because, running time needs filler.\r\n\r\nAnd that's basically what this movie is: Filler. They came up with a concept that would make the storytelling aspect problematic. And rather than tweaking the concept or fleshing out the story with subplots, they just assumed explosions and superhero fights would be enough to carry the film.", "created_at": "2017-03-22T16:58:50.550Z"}, {"movie_id": 246655, "review_id": "59602ee7c3a368253c09ad10", "author_rating": 4.0, "review_text": "What a let down after Days of Future Past (the best X-Men movie ever, in my opinion). Bryan Singer has usually directed some of the best films of the franchise but this one is a real clunker. Too many characters with not enough development and a very lackluster villain. Oscar Isaac is a talented actor, but even he can't make Apocalypse interesting under all that silly blue make up. Characters like Angel and Psylocke, as Apocalypse's horsemen, are very thinly written and barely have a personality. Also, it is absolutely ridiculous that the villain Mystique is transformed into a role model and leader for the X-Men in this movie. Jennifer Lawrence looks bored throughout and barely appears as Mystique's true blue self even though she's supposed to be an out and proud mutant. A real disappointment.", "created_at": "2017-07-08T01:01:27.829Z"}, {"movie_id": 246655, "review_id": "5bf6f151c3a368189f0e0e37", "author_rating": 8.0, "review_text": "***Ranks with the best in the X-Men franchise***  \r\n\r\nReleased in 2016 and directed/co-written by Bryan Singer, \"X-Men: Apocalypse\" has the team go up against the first mutant, Apocalypse (Oscar Isaac), whose origins date back to ancient Egypt. After thousands of years in stasis, Apocalypse is immediately disillusioned by the state of the world and so recruits a team of worthy mutants, including a dispirited Magneto (Michael Fassbender), to purge humanity and craft a new world order over which he will reign. Professor X (James McAvoy), with the assistance of Raven (Jennifer Lawrence), leads a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction. Josh Helman is on hand as Col. Stryker.\r\n\r\nThis sixth film in the franchise (not including the several spin off films) easily ranks as one of the best. It includes many of the best elements of the X-Men and everything I would want in a great X-Men flick:\r\n\r\nProfessor X's ongoing goal for an educational sanctuary for interesting mutants from all over the world; his love for Moira (Rose Byrne); Magneto's increasing mastery of his great powers and his struggle to go on the offensive against prejudiced humanity; a greater focus on Cyclops (Tye Sheridan) and his potent power, both of which were neglected in the original trilogy; an outstanding actress to play Jean Grey (Sophie Turner), who is far better than the bland Famke Janssen; Olivia Munn's ultra-hotness as Psylocke; a worthy subplot on Weapon X with the corresponding guest appearance of Wolverine (Hugh Jackman); an excellent collection of young mutants, like Storm (Alexandra Shipp), Beast (Nicholas Hoult), Quicksilver (Evan Peters), Nightcrawler (Kodi Smit-McPhee), Havok (Lucas Till), Angel (Ben Hardy), etc.; a worthy main villain in the mold of Dr. Doom and Thanatos; an epic, apocalyptic final act (sorry); I could go on and on.\r\n\r\nThis isn't to say the movie doesn't have faults, however; the cartoony overblown prologue in ancient Egypt is Exhibit A.\r\n\r\nThe film runs 144 minutes and was shot in Quebec, Canada (Greenfield Park, Montreal and Oka).\r\n\r\nGRADE: A-", "created_at": "2018-11-22T18:11:29.943Z"}, {"movie_id": 246655, "review_id": "5c14bb0ec3a36866bd366868", "author_rating": 6.0, "review_text": "Plenty of action with good acting, however, Apocalypse (the villain) lacks originality. X-Men: Apocalypse is a mediocre film in the respected franchise that is \"X-Men\"", "created_at": "2018-12-15T08:27:58.629Z"}, {"movie_id": 246655, "review_id": "57acf03292514158840001b2", "author_rating": null, "review_text": "Not really a step forward in the X-Men franchise. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/x-men-apocalypse-review", "created_at": "2016-08-11T21:37:54.523Z"}, {"movie_id": 246655, "review_id": "57d15d9e92514173a30094f2", "author_rating": 5.0, "review_text": "Though far from the worst _X-Men_ film, _Apocalypse_ was still a disappointment, because until this entry, every Bryan Singer _X-Men_ film had been excellent. _Apocalypse_ is a far cry from terrible, but it is underwhelming given Singer's history, as well as in and of itself.\r\n\r\nCertain actors, who shall remain Jennifer Lawrence, were completely checked out in this instalment. The CGI was often so bad it was confronting, even in the climax of the film. Apocalypse's plan was plot-hole-y and underdeveloped, and not all of the new characters hit it out of the park.\r\n\r\nThere was still a lot to like here though. Some of the newer costumes were neat, and a lot of the side-plots had me very intrigued. Fassbender and McAvoy are excellent as always. It's certainly not a failure amongst the likes of, for example, _X-Men: The Last Stand_. Which was a good callout in _Apocalypse_. Another thing I enjoyed.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-08T12:46:22.836Z"}, {"movie_id": 246655, "review_id": "580e44b59251416e18001907", "author_rating": 5.0, "review_text": "**Another ancient power was awoken and blah blah blah.**\r\n\r\nI have seen almost all the superhero films of the recent time, but this is the franchise I never liked. I'm sorry to say that, but that's the truth. The 'X-Men' series never made me sense, particularly to say it from the Marvel comics is a disappointment. When it comes to 'Wolverine', my opinion is different, because I loved those films. Hugh Jackman as Logan is the only 'X-Men' I love, so like usual this is another waste of time from its series to me.\r\n\r\nI even enjoyed the recently rebooted 'Fantastic Four', but not this one. There's nothing new in the story, it's the same plot stolen from the different films. Like an ancient force is awoken who tries to rule the world by destroying everything created so far by the humans. So the mutants join hands to bring him down and we know what happens at the end. Apart from the vfx, this is very boring film and 150 minutes runtime was another lengthy joke that you never laugh.\r\n\r\nNot just me, many people, even 'X-Men' fans showed displeasure over this film. That means, Bryan Singer's stint with the franchise is pretty much over. So they will going to bring a new one and that's another disappointment, because I don't know how long they're going to drag this series. End it already. Anyway, like I said I never was or will be this universe fan, so I don't care much, rather I just give them a try when they get released and obviously I'm to end in regret watching. Instead, I'm looking forward to the final 'Wolverine' film with Hugh Jackman.\r\n\r\n_5/10_", "created_at": "2016-10-24T17:28:21.070Z"}, {"movie_id": 246655, "review_id": "589464f2925141426c004fbd", "author_rating": 8.0, "review_text": "X-Men Apocalypse is typical of what you would expect from a Marvel X-Men movie. Light on story and depth and heavy on special effects and action. In short it is exactly what I, as a Science Fiction and Fantasy geek, would expect as well as hope for.\r\n\r\nThe X-Men faces a new threat in the form of the worlds first mutant. Naturally said mutant is really a Übermutant vastly more powerful than any “normal” mutant. Equally naturally this Übermutant is set on a path of world destruction and domination. I quite liked this villain. He is a good all evil and powerful bad guy and a worthy adversary. No nonsense about trying to make the villain likable or trying to explain why he turned evil or such like. This guy is evil, he is the bad guy, he needs to be taken down…full stop.\r\n\r\nAs I wrote the story is not the most elaborate one around but it is a good one within the confines of a Marvel super hero movie. It gets the job done without being overly stupid or silly. It is set in the “prequel” universe created by X-Men First Class. The movie adds a few new X-Men to the ranks of Professor Xaviers team. Some of them thanks to the manipulations of Apocalypse although they start out on the bad side at first.\r\n\r\nThe movie moves along at a decent enough pace and, as was mentioned, there are quite a few action sequences and special effects thrown at the viewer throughout the movie. Personally I found the special effects to be quite good. Even stunning at times. I am quite a bit of a special effects nerd so of course this pleased me a lot.\r\n\r\nThe movies ending certainly opens the door to future X-Men movies and I for sure would like to see the franchise continue. I very much enjoyed these almost two and a half hours in front of my TV set.", "created_at": "2017-02-03T11:09:38.498Z"}, {"movie_id": 246655, "review_id": "58d2ad4ac3a368121b000cf4", "author_rating": 4.0, "review_text": "*** This review may contain spoilers ***\r\n\r\nAfter immensely enjoying the turn the X-Men franchise took after the disappointment of X-Men: The Last Stand, I was pretty excited to see this movie. I love comics, but I never got into the X-Men, so I can excuse some of the inaccuracies that seemed to upset hardcore fans. I just enjoyed the movies.\r\n\r\nX-Men Apocalypse is the weakest film since duds like Last Stand and Wolverine Origins. It just didn't have a whole lot going on. One of the biggest critiques of Marvel (yes, I know X-Men films aren't produced by Marvel Studios, but I'm speaking of the publisher of the original medium) is that their villains are lackluster. The big baddie through the whole franchise has been Magneto, easily the most charismatic and entertaining Marvel villain on film. Though we've had brushes with Stryker and Trask and his sentinels, this is the first movie in which the X-Men had taken on a true super villain who wasn't Magneto-- Wolverine vs. The Silver Samurai aside. \r\n\r\nBut it's almost like director Bryan Singer painted himself into a corner with Apocalypse. The villain was too powerful and could have easily achieved his goals without the help of his \"four horsemen.\" He could have ended the world, in mere minutes, all by himself. But, of course, that would make a boring movie, so Singer and Co. had to figure out what to do with the world's most powerful and dangerous mutant for two hours before the final climax was to begin.\r\n\r\nThere were scenes where the villains were literally sitting around the desert talking about how they were going to lay waste to a city on the horizon. There were scenes where the most powerful of the villains went out recruiting much less powerful villains to join him. Really, Singer just didn't know what to do with this character. How do you create conflict and drama when the bad guy is just too powerful? Well, you can't. \r\n\r\nOf course, after two hours of watching the most powerful mutant ever talk about what he is going to do (instead of simply doing it) he finally unleashes his fury. Except that, the X- Men actually have the most powerful mutant in the world on their side in Jean Grey.\r\n\r\nSo, again, why is Jean not simply destroying Apocalypse in the first 10 minutes of the movie? Because, running time needs filler.\r\n\r\nAnd that's basically what this movie is: Filler. They came up with a concept that would make the storytelling aspect problematic. And rather than tweaking the concept or fleshing out the story with subplots, they just assumed explosions and superhero fights would be enough to carry the film.", "created_at": "2017-03-22T16:58:50.550Z"}, {"movie_id": 246655, "review_id": "59602ee7c3a368253c09ad10", "author_rating": 4.0, "review_text": "What a let down after Days of Future Past (the best X-Men movie ever, in my opinion). Bryan Singer has usually directed some of the best films of the franchise but this one is a real clunker. Too many characters with not enough development and a very lackluster villain. Oscar Isaac is a talented actor, but even he can't make Apocalypse interesting under all that silly blue make up. Characters like Angel and Psylocke, as Apocalypse's horsemen, are very thinly written and barely have a personality. Also, it is absolutely ridiculous that the villain Mystique is transformed into a role model and leader for the X-Men in this movie. Jennifer Lawrence looks bored throughout and barely appears as Mystique's true blue self even though she's supposed to be an out and proud mutant. A real disappointment.", "created_at": "2017-07-08T01:01:27.829Z"}, {"movie_id": 246655, "review_id": "5bf6f151c3a368189f0e0e37", "author_rating": 8.0, "review_text": "***Ranks with the best in the X-Men franchise***  \r\n\r\nReleased in 2016 and directed/co-written by Bryan Singer, \"X-Men: Apocalypse\" has the team go up against the first mutant, Apocalypse (Oscar Isaac), whose origins date back to ancient Egypt. After thousands of years in stasis, Apocalypse is immediately disillusioned by the state of the world and so recruits a team of worthy mutants, including a dispirited Magneto (Michael Fassbender), to purge humanity and craft a new world order over which he will reign. Professor X (James McAvoy), with the assistance of Raven (Jennifer Lawrence), leads a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction. Josh Helman is on hand as Col. Stryker.\r\n\r\nThis sixth film in the franchise (not including the several spin off films) easily ranks as one of the best. It includes many of the best elements of the X-Men and everything I would want in a great X-Men flick:\r\n\r\nProfessor X's ongoing goal for an educational sanctuary for interesting mutants from all over the world; his love for Moira (Rose Byrne); Magneto's increasing mastery of his great powers and his struggle to go on the offensive against prejudiced humanity; a greater focus on Cyclops (Tye Sheridan) and his potent power, both of which were neglected in the original trilogy; an outstanding actress to play Jean Grey (Sophie Turner), who is far better than the bland Famke Janssen; Olivia Munn's ultra-hotness as Psylocke; a worthy subplot on Weapon X with the corresponding guest appearance of Wolverine (Hugh Jackman); an excellent collection of young mutants, like Storm (Alexandra Shipp), Beast (Nicholas Hoult), Quicksilver (Evan Peters), Nightcrawler (Kodi Smit-McPhee), Havok (Lucas Till), Angel (Ben Hardy), etc.; a worthy main villain in the mold of Dr. Doom and Thanatos; an epic, apocalyptic final act (sorry); I could go on and on.\r\n\r\nThis isn't to say the movie doesn't have faults, however; the cartoony overblown prologue in ancient Egypt is Exhibit A.\r\n\r\nThe film runs 144 minutes and was shot in Quebec, Canada (Greenfield Park, Montreal and Oka).\r\n\r\nGRADE: A-", "created_at": "2018-11-22T18:11:29.943Z"}, {"movie_id": 246655, "review_id": "5c14bb0ec3a36866bd366868", "author_rating": 6.0, "review_text": "Plenty of action with good acting, however, Apocalypse (the villain) lacks originality. X-Men: Apocalypse is a mediocre film in the respected franchise that is \"X-Men\"", "created_at": "2018-12-15T08:27:58.629Z"}]