[{"movie_id": 524047, "review_id": "5f731036d40d4c0038630b4b", "author_rating": 3.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis type of movie is always rather divisive between critics and audiences simply due to its nature. Story-wise, it's never groundbreaking or innovative in any shape or form. These apocalyptic films always follow a formulaic screenplay, packed with logical inconsistencies, but also with tons of thrilling action. Visuals vary in quality depending on the studio, as well as sound design and other technical aspects. I always try my best to accept *everything* these movies throw irrationally at the viewer. I prepare myself to be as open-minded as I can, and usually, I have no issues with that (actually, I find the \"that's not how science works\" argument a bit nitpicky in this subgenre).\r\n\r\nHowever, Greenland fails to deliver the only thing I did expect from it: a planet-killer comet of pure popcorn entertainment. The only positive aspects are the cast and two/three sequences genuinely exciting. Gerard Butler is already used to this sort of film (Has Fallen series, Geostorm), so he has no problems in portraying another thin character with no real motivations or depth. Same goes for Morena Baccarin, who simply plays the wife of Butler. Both deliver good performances, enough to keep me engaged until the end of the flick.\r\n\r\nThe few good sequences are really good. Little scraps of the giant comet hit Earth before the extinction-level event, and these look great. Nevertheless, just this for a 119-minute runtime is far from being satisfying. As expected, Chris Sparling's screenplay is as generic as it could be, just like Ric Roman Waugh's direction, which doesn't really offer anything remotely new. Some narrative decisions (not related to science or technology because these I just accepted as part of the usual illogical stuff) are definitely to pass the time since they have no consequences whatsoever. Greenland is precisely like dozens of other movies in the subgenre, but without the technical aspects that end up elevating the overall picture.\r\n\r\nThe VFX look dated in some sequences, almost like they didn't have enough time (or money) to finish them. I mean, a static image of a meteorite shower as the sky? Really? Sadly, this comes across as amateur and lazy. The absence of a powerful score (David Buckley) makes the action scenes feel \"empty\", like something is missing. A few fighting moments are pretty much impossible to see clearly due to the overly dark environment and choppy editing (Gabriel Fleming). Overall, the action walks the line between decent and terrible.\r\n\r\nHowever, the most significant \"slap in the face\" is the planet-killer comet that everyone is going to look forward to as soon as they enter the theater. There's no way of working around this: if an entire film builds up a third act's massive comet of the side of Europe, it must show it hit the ground in all of its splendor. The gigantic explosion of ridiculous proportions, the endless smoke that fills up the whole atmosphere, the distinctive sound of the impact... This is the moment that can make or break any apocalyptic movie. Unfortunately, and I'm only going to write this, it broke.\r\n\r\nIn the end, Greenland is predictably underwhelming, packing only a couple of genuinely exciting sequences, and a decent cast. Gerard Butler and Morena Baccarin try, but they're not enough to compensate for everything else. As expected, Chris Sparling's formulaic screenplay doesn't add a unique storyline or innovative aspect to the genre, as well as Ric Roman Waugh's basic direction. This would all be fine if the action delivered what most people want to see, but sadly, this component is also quite a letdown. Despite a few occasional, riveting scenes, the entertainment levels are pretty low due to the unimpressive visual effects, lack of a powerful score, and poor editing, culminating in a \"viewing-killer\" disappointment. If you absolutely love apocalyptic films, maybe you'll find something enjoyable about it that I didn't. However, if this type of movie doesn't suit your preferences, then this one surely isn't going to convert you.\r\n\r\nRating: D+", "created_at": "2020-09-29T10:45:10.207Z"}, {"movie_id": 524047, "review_id": "601b5ee181da39003fbe365a", "author_rating": 6.0, "review_text": "Briskly paced and littered with jagged, realistic edges though it is, 'Greenland' ultimately imagines a very sentimental planetary extinction. Perhaps the highest compliment I can pay this film is that it's far better than the annual paint-by-numbers Gerard Butler movie that humanity is used to receiving.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-greenland-a-gerard-butler-flick-that-isnt-a-disaster", "created_at": "2021-02-04T02:41:37.761Z"}, {"movie_id": 524047, "review_id": "6047957cc8a5ac006ffd7de1", "author_rating": 8.0, "review_text": "“Greenland” ranks well above average when it comes to disaster movies. Screenwriter Chris Sparling takes the traditional end of the world blueprint and inserts some really nice surprises and twists, making this formulaic action flick seem not as much so.\r\n\r\nJohn (Gerard Butler) is in a race against time to save his wife (Morena Baccarin) and son (Roger Dale Floyd) from an alien killer comet that is hurtling towards Earth. The impact of the big one is expected in less than 24 hours, and there seems to be no hope for any survivors. While at the grocery store, John gets a terrifying message from the Department of Homeland Security alerting him that his family has been chosen to flee to a safe haven bunker in Greenland. As the trio attempt to get to the designated location, a lot starts to go wrong.\r\n\r\nDirector Ric Roman Waugh worked with Butler on “Angel Has Fallen,” and he is a good choice at the helm. He creates a world of increasing panic and lawlessness, and you’re right there along for the ride. The movie has a brisk pacing, and the stakes are high. The special effects are satisfying, especially the scenes of destruction. That is, after all, why most of us watch movies about catastrophes in the first place.\r\n\r\nEven more admirable is that the film doesn’t fall into the trap of the typical “rah rah” patriotic disaster movie. There are no waving American flags, no slow motion masculine strutting. Instead, “Greenland” sets its bar at a much higher level, and it succeeds. This is a really well done, enjoyable popcorn movie.", "created_at": "2021-03-09T15:34:20.493Z"}, {"movie_id": 524047, "review_id": "60784c017464570029d82567", "author_rating": 5.0, "review_text": "Cue the epic music... and exactly the same elements, acting, cinematography, and script that are in nearly every disaster movie in the last 20 years.", "created_at": "2021-04-15T14:21:53.787Z"}]