[{"movie_id": 373571, "review_id": "5cee582d0e0a262b74ca5ae1", "author_rating": 4.0, "review_text": "‘Godzilla II: King of the Monsters’ promises to build on the great work already laid out for this franchise, mixing popcorn fun and thrilling craft, but instead it relinquishes all of that to be a predictably dull and plodding bore. It doesn’t even manage to be a fun, brainless monster movie, assuming that a satisfying monster battle is all about being big and loud and doing nothing else. We waited five years for the follow-up to ‘Godzilla’, which only makes this new film even more of a disappointment, and doesn't excuse the badly-written screenplay or the poorly-executed visual effects. With Dougherty handing the reigns over to horror director Adam Wingard for 2020’s ‘Godzilla vs Kong’, here’s hoping the Monsterverse finds its feet again.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-godzilla-2-king-of-the-monsters-the-king-stumbles-in-this-loud-and-blundering-mess", "created_at": "2019-05-29T10:00:13.666Z"}, {"movie_id": 373571, "review_id": "5ceeaaf6c3a36879841f1815", "author_rating": null, "review_text": "Picking up after the events of the previous film; “Godzilla: King of the Monsters” deals with a world trying to assess what to do with the presence of the giant Titans. The Monarch Corporation wants the creatures studied and has established locales to study the ones they have found currently hibernating. The U.S. Government wants them destroyed as they do not want repeats of the destruction that was previously caused by Godzilla.\r\n\r\nDr. Emma Russell (Vera Farmiga) and her daughter Madison (Millie Bobbie Brown) have developed a device known as Orca that will allow them to communicate with the creatures using specific sonic frequencies.\r\n\r\nAfter a successful test under duress; the duo are captured by a ruthless Eco Terrorist group who want to use the giant creatures for their own objectives.\r\nThis leads to a chase around the world with Monarch attempting to stop them and with Emma’s ex-husband Mark (Kyle Chandler) deeply involved though he is deeply divided as he blames Godzilla for the loss of their son.\r\n\r\nWhen a gigantic creature is freed; Godzilla faces his greatest challenge as there is a race against time to save the world.\r\n\r\nWhile the film has some very impressive visual effects, the film drags as aside from a couple of brief encounters; the audience is required to sit through roughly 90 minutes of plodding story to get to the action which is roughly only the last 15-20 minutes of the film.\r\n\r\nThe human characters were very disinteresting and many of the international cast looked at times like they were sleepwalking though their lines as they seemed to have a real lack of passion for what they were given to work with.\r\n\r\nThe human characters were also very annoying and I found myself hoping that they would be taken out by the creatures as I had no connection to them and they did not inspire any sympathy.\r\n\r\nWhile it may possibly appeal to hardcore fans, this was a miss for me as there simply was not enough creature action to counter-balance having to sit through the human characters and plodding plot to get to the good stuff.\r\n\r\n2.5 stars out of 5", "created_at": "2019-05-29T15:53:26.191Z"}, {"movie_id": 373571, "review_id": "5cf00e1e0e0a262318caefaa", "author_rating": 4.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nAs some of you might know, Godzilla: King of the Monsters is one of my Most Anticipated Movies of 2019. Not because I expected it to be a beautifully written, heartfelt story with fully-developed characters who I would immensely care about. I was incredibly excited because it’s freaking Godzilla and from the few images that I had seen, it looked absolutely stunning. I didn’t need an Oscar-worthy screenplay or amazing performances. I just wanted a decent and logical (this last word is important) narrative with reasonable characters, and tons of monsters fighting to the death against each other. So, my expectations were neither complex or as high as some other people might have.\r\n\r\nUnfortunately, I left the theater extremely disappointed. I can’t deny the impeccable VFX and the infinite amount of wallpaper-worthy images spread across the entire film. Some scenes are filled with jaw-dropping cinematography, astonishingly gorgeous monsters, and the fights feel so real that the sound design alone takes you to the edge of your seat. However, when the two pillars of any movie (story and characters) are so far away from even remotely working, there are no technically perfect aspects that can save the film from a disaster. I wrote this exact last sentence a few weeks ago regarding Game Of Thrones, and I will stand by it. I’m always the first guy to praise exceptional filmmaking skills, but if I have to choose between a technically seamless movie, and a film with a fantastic story and fully-developed characters, I have no doubts that the latter is the indisputably right choice.\r\n\r\nUltimately, that’s the huge problem here. The screenplay is loaded with some of the laziest exposition scenes I’ve seen in the last few years. Characters continuously have some sort of presentation to explain something in a completely unpredictable conversation randomly. Generally, a movie like this always has some kind of cliche secondary characters who are either a nerdy scientist, a comic-relief guy, a duo of bantering personalities or a military general who always wants to attack something, even though everyone knows it’s not the most intelligent decision. King of the Monsters has all of these types and more! More?! Seriously, Michael Dougherty and Zach Shields overstuff the narrative with so many unnecessary, useless, stereotypical characters who stretch the overall runtime and extend the periods between the massive fights, turning them into minutes of complete boredom.\r\n\r\nI yawned during a Godzilla blockbuster. Yawned. How sad is that?! I really enjoyed Gareth Edwards’ 2014’s Godzilla. At the time, the most common complaint was that there wasn’t enough Godzilla in it. Most of the characters were well-written, despite that some could have been more fleshed out. King of the Monsters is (kind of) the other way around: there are dozens of monsters and bone-crushing, titanic fights, but they literally forgot to write a captivating story with compelling characters. In the first installment, even though I also wanted more Godzilla, when he actually shows up, I was so freaking excited! Since I had to wait for the third act to watch the Titans fight, the build-up that was generated and its payoff actually made the time spent with the human characters worthy.\r\n\r\nThis sequel was doomed from the moment the characters were written. There are a lot of fight sequences, and I wrote above that unnecessary characters extend the periods between these scenes. The dilemma is that those periods need to exist, making the whole thing look like a double-edged sword that the director is trying to avoid. On one hand, you can’t have an action set piece after another action set piece consecutively, otherwise, these will lose impact over time and become monotonous, so you need to spend time with the horribly-written human characters. On the other hand, you can’t have dumb characters with unclear motivations on-screen for long periods, otherwise, the audience will fall asleep of tediousness or get annoyed, so you have to insert a massive fight sequence again, hence making the audience gradually lose interest in those scenes.\r\n\r\nKing of the Monsters continuously repeats this cycle of going from one situation to the other. No one wants to have back-to-back fights because they’ll lose the impactful energy, but no one wants to waste their precious time listening to exposition-heavy PowerPoint presentations from characters no one is going to remember their name. I can’t even remember the main characters’ names, and I watched the movie yesterday! I can’t blame the cast, everyone gives good performances. Millie Bobby Brown (Madison Russell) continues her path to become one of Hollywood’s biggest stars (in less than 10 years, she’ll have an Oscar in her hands, I guarantee you that). Kyle Chandler (Mark Russell) does more than what was expected of him with such a lousy script, and Ken Watanabe (Dr. Ishiro Serizawa) is the only one who delivered a solid performance AND had a suitable character (fruit of the previous film). Vera Farmiga (Dr. Emma Russell) is connected to the worst character of the movie (atrociously irrational decisions made by Emma), and everyone else is pretty much one of the vast cliche secondary characters.\r\n\r\nThey had five years to write a straightforward narrative with simple characters. No fan neither wanted or needed a brilliant, groundbreaking screenplay. Dougherty and Shields delivered one of the worst scripts of the year, one filled with exposition, cliche characters, and a runtime that turned out to be way too long for someone to tolerate all of the dreadful dialogue. I don’t know if it will clearly end up as one of the worst films of 2019, but it’s definitely one of the biggest letdowns. All in all, Godzilla: King of the Monsters didn’t meet my expectations (and mine were pretty fair), not even close. Visually, it’s one of the most striking movies I’ve seen this year, and that can’t be dismissed. From the massive fights with the Titans to the impressive wide shots, Dougherty had a gorgeous diamond that he just needed to polish with a rational and simplistic story, like it was a soft, clean cloth. Instead, he used a hammer…\r\n\r\nRating: C-", "created_at": "2019-05-30T17:08:46.984Z"}, {"movie_id": 373571, "review_id": "5d2c4bc7b84f947f3b4ae8aa", "author_rating": 6.0, "review_text": "It's dumb. Really dumb. And I don't mean \"Oh it's a big, noisy action movie and it doesn't engage you very much mentally so that means it's stupid\", I'm talking like, the rules contained within just this movie are frequently broken, and a big chunk of the ideas make no sense by the end. Dumb. But I still had a pretty good time with _King of the Monsters_ (kind of a weird title to give Godzilla when the tagline for the sequel is \"God VS King\", and Godzilla is not the king in that matchup, but I digress). The quality of the CGI varies _drastically_, but when it's good, it's **just** enough to get me over the line to enjoying it to the point I can give the movie a positive review.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-07-15T09:47:51.191Z"}, {"movie_id": 373571, "review_id": "5d782b6d39549a001097184a", "author_rating": 7.0, "review_text": "**_Very loud, very dumb, and very entertaining_**\r\n\r\n>_And four great beasts came up from the sea, diverse one from another. The first was like a lion, and had eagle's wings: I beheld till the wings thereof were plucked, and it was lifted up from the earth, and made stand upon the feet as a man, and a man's heart was given to it. And behold another beast, a second, like to a bear, and it raised up itself on one side, and it had three ribs in the mouth of it between the teeth of it: and they said thus unto it, \"Arise, devour much flesh.\" After this I beheld, and lo another, like a leopard, whic__h had upon the back of it four wings of a fowl; the beast had also four heads; and dominion was given to it. After this I saw in the night visions, and behold a fourth beast, dreadful and terrible, and strong exceedingly; and it had great iron teeth: it devoured and brake in pieces, and stamped the residue with the feet of it: and it was diverse from all the beasts that were before it; and it had ten horns._\r\n\r\n- Daniel 7:3-7\r\n\r\n>_Behold a great red dragon, having seven heads and ten horns, and seven crowns upon his heads. And his tail drew the third part of the stars of heaven, and did cast them to the earth_ [...] _And I stood upon the sand of the sea, and saw a beast rise up out of the sea_ [...] _And they worshipped the dragon which gave power unto the beast: and they worshipped the beast, saying, \"Who is like unto the beast? Who is able to make war with him?\"_ [...] _And all that dwell upon the earth shall worship him, whose names are not written in the book of life of the Lamb slain from the foundation of the world._\r\n\r\n- Revelation 12:3-13:8\r\n\r\nI really enjoyed Gareth Edwards's 2014 _Godzilla_. Sure, there were plot holes through which you could drive an entire fleet of trains carrying nuclear weapons, it featured coincidences that stretched believability even by Hollywood's standards, the human characters were paper-thin, and it took itself very, very seriously. But I enjoyed it. As Edwards had already proved with his debut film, the superb _Monsters_ (2010) and as he would subsequently prove with _Rogue One: A Star Wars Story_ (2016), he has a knack for wedding large-scale CGI grandiosity to stories that feel contemplative and personalised. And I don't care how long this franchise may run, and how many films get churned out, Godzilla's mic-drop moment, when he holds the female MUTO's mouth open and breathes blue fire down its throat will never be topped in its \"holy shit\"-ness. Ironically enough though, what I admired most about the film is the same thing that a lot of people disliked - the fact that Edwards kept Godzilla's appearances so fleeting; it took over an hour before we first saw him, and then he got only seven minutes total screen time. Personally, I thought it was a masterclass in directorial restraint, and it had the effect that when the big final fight came, it hit home on so many levels because here, finally, we were getting to see the big guy throw down. Remember when Hulk Hogan was the WWF champion for three years running? He didn't wrestle on every show, he didn't even appear on every show. So when Wrestlemania came around, and we knew the Hulkster would be headlining, it meant more than if we'd just seen him the week prior. Same thing with _Godzilla_. However, I understand why some people were unimpressed that a film called _Godzilla_ featured so little, well, Godzilla!\r\n\r\nThe third film in Legendary Entertainment's \"MonsterVerse\" franchise, _King of the Monsters_ is a direct sequel to Edwards's film (although sadly, he doesn't return as director), and sets up Adam Wingard's _Godzilla vs. Kong_, which has already wrapped shooting, and is scheduled for release next summer. However, whereas Edwards held Godzilla back and made the action feel smaller by focalising it through the human characters, new director Michael Dougherty (_Trick 'r Treat_; _Krampus_) essentially inverts that formula, putting Godzilla front and centre for pretty much the entire runtime (there are four big fight scenes within the first half-hour alone), and shooting the action in such a way as to make it seem as grandiose as possible. Indeed, he told Collider, \"_I would call it the_ Aliens _to Gareth's_ Alien.\" And although Dougherty isn't half the director that Edwards is, _King of the Monsters_ works pretty well in a braindead summer action movie that's wall-to-wall giant monsters fighting one another kind of way. Sure, there are significant problems (all the best shots are in the trailer, the plot is beyond laughable, the characters are so thinly sketched as to make those in the first film feel Shakespearean, clichés abound, the talented cast is wasted), but all things considered, I enjoyed it, as it accomplished exactly what it set out to accomplish, and you really can't fault a film for succeeding at its primary objective.\r\n\r\nFive years since Godzilla defeated the MUTOs, many more creatures (newly dubbed Titans) have been found throughout the world, all in various forms of hibernation. In charge of studying and protecting them is the private company Monarch Sciences (introduced in a fledgeling state in Jordan Vogt-Roberts's _Kong: Skull Island_, which took place in 1973). As the film begins, Monarch employees Dr. Ishirô Serizawa (Ken Watanabe) and Dr. Vivienne Graham (Sally Hawkins), both returning from the previous film, are attempting to convince the Senate that under no circumstances should control of the Titans be turned over to the military, something with which Admiral William Stenz (the great David Strathairn, also returning from the first film) strongly disagrees. Meanwhile, in China, paleobiologist Dr. Emma Russell (Vera Farmiga) and her daughter Madison (Millie Bobby Brown) watch the awakening of the larval form of Mothra. However, when Mothra becomes distressed, Emma is able to calm it using the ORCA, a device which monitors the Titans' bioacoustics and transmits a dominant \"alpha signal\" capable of placating them. Soon thereafter, eco-terrorist Jonah Alan (Charles Dance) and his private army storm the facility, stealing the ORCA, and kidnapping Emma and Madison. In response, Monarch track down Dr. Mark Russell (Kyle Chandler), Emma's estranged husband, and co-designer of the ORCA, hoping he might be able to help find Jonah. Mark and Emma lost a son in San Francisco during the fight between Godzilla and the MUTOs, and whereas Emma came to feel the Titans could help humanity, Mark became convinced they should all be eradicated. Meanwhile, Jonah heads to the Monarch facility in Antarctica and unleashes the only non-terrestrial Titan, a fearsome three-headed dragon codenamed \"Monster Zero\", but whom ancient humans knew as King Ghidorah. Arguing that humanity has brought the planet to the point of destruction, Jonah believes that if the Titans are awoken, the ensuing conflict would wipe out most of human civilisation, allowing the planet the time it needs to heal. And so, with Ghidorah awakening the various Titans throughout the world, Godzilla emerges to stand against him.\r\n\r\nWith production wrapping on _King of the Monsters_ in 2017, and with two release dates scrapped, the film was beginning to accrue some pretty bad buzz. Then that magisterial first trailer dropped, showing Mothra spanning her glorious wings scored with a remix of Claude Debussy's \"Clair de Lune\" from _Suite bergamasque_ (1890) and promising a film of pensive apocalyptic goings-on. It was the sort of trailer to turn even the biggest naysayer around. The good news is that all the best bits from the trailer are in the film. The bad news is that most of the best bits from the film are in the trailer.\r\n\r\nGodzilla was originally created by Tomoyuki Tanaka, Ishirô Honda, and Eiji Tsuburaya, and first seen on screen in 1954's _Gojira_ (released in North America in 1956 as _Godzilla, King of the Monsters!_, a reedited version of the original with additional scenes and new actors). Over the last six decades, he has appeared in all manner of films and TV shows, from action flicks to eco-metaphors to kid's cartoons to comedy to whatever the hell Roland Emmerich's 1998 version was. Conceived in the wake of Hiroshima and Nagasaki, as well as the Daigo Fukuryū Maru incident, Godzilla was intended as a metaphor for the destructive power of nuclear weaponry. Thematically speaking, the highpoint of the \"Kaiju\" (Japanese for \"strange beast\") genre thus far is probably Hideaki Anno's _Shin Gojira_ (2016), which was a political satire inspired by the Japanese government's response to the 2011 Tôhoku earthquake and tsunami, and the subsequent Fukushima Daiichi nuclear accident.\r\n\r\n_King of the Monsters_ has one eye on its themes too (a dire warning of oncoming eco-disaster, biodiversity, co-existence with other species, military impulsiveness, the insignificance of humanity compared to the vastness of nature), but really, the sermonising, exposition-heavy script by Dougherty and Zach Shields, from a story by Max Borenstein, is so badly put together, with the characters' motivations so poorly delineated, that any thematic concerns dissipate into nothing. Part of this is that the narrative simplifies Godzilla's 'morality'. Traditionally, Godzilla is inherently benevolent. However, in the 2014 version, Edwards muddied this concept brilliantly, depicting a monster that was fairly indifferent to humanity and was far more concerned with the biological drive to reassert his alpha status. In _King of the Monsters_, both Godzilla and Mothra are fundamentally good, and they wish to protect humanity from Ghidorah, which is more binary and not nearly as interesting a position to take.\r\n\r\nAnd yes, the film does address the fact that through inattention and greed, humanity is on the brink of ensuring its own extinction. Jonah, of course, believes that giving the earth back to the Titans is all humanity deserves, and is exactly what the planet needs (it's revealed early in the film that the Titans leave behind biomatter which results in the rapid growth of vegetation). For her part, Emma compares humanity to a virus, and the Titans to a \"fever\" that could eradicate it. Elsewhere, obviously with one eye on the issue of American isolationism under Trump, as well as the unstable geopolitical situation, Serizawa states, \"_sometimes, the only way to heal a wound is to make peace with the demon who caused it_\". The problem with all of this is that the script is so ham-fisted and poorly structured, the eco themes so preachy, and the organic integration of those themes into the action so lacking, that they come across as background irrelevancies at best, and distracting moralising at worst. And in any case, the film ultimately undermines all of this in favour of reaffirming the clichéd old notion of human perseverance in the face of adversity.\r\n\r\nAs we're discussing the script, another problem is repetition. For example, on several occasions, Godzilla is getting his ass handed to him, only to make an 'unexpected' comeback, whilst not one, not two, but three characters sacrifice themselves for the greater good (all at different times), resulting in none of the sacrifices really meaning anything. There are also some hideous clichés. At one point, on their flagship the ARGO, the Monarch people are listening to Godzilla's heartbeat, which is becoming weaker and weaker, and Dr. Rick Stanton (a criminally underused Bradley Whitford) implores, all earnest-like, \"_c'mon big guy_.\" It's supposed to be a moment of great pathos, tapping into the audience's empathy for Godzilla. Instead, at the screening I attended, everyone laughed, so clunky and self-serious was the moment. \r\n\r\nAnother scene that doesn't work, although in a completely different way, is the death of a major character; it happens so suddenly, amidst so much chaos, with the camera not even focused on them, that in the very next scene, the film has to show us their face on a monitor with the word \"Deceased\" written underneath. Not exactly the best way to handle a major death. There's also a (predictable) twist based on what could charitably be called ill-defined character motivations. The character of Mark is also peculiarly written. Played by the top-billed Kyle Chandler, he has precious little to do for most of the film other than look at monitors with a concerned expression, coming off more as a fed-up dad than the protagonist of a Kaiju film. There are also far too many scenes of characters standing on the bridge of the ARGO, spouting expositional word-dumps at one another, oftentimes even narrating their motivations. In any case, not a single character in the film comes across as three-dimensional, with not a hint of interiority amongst the lot of them. Additionally, because the scale of the fights is so massive, and the humans so poorly written, Dougherty is unable to make the characters seem even remotely significant. This was another area where Edwards did well, marrying the spectacle with smaller human drama, but Dougherty allows the spectacle to overwhelm everything else.\r\n\r\nThere are also some hilarious spatial hijinks going on. I get that the ARGO is supposed to be a super-advanced high-tech mobile fortress, but it seems capable of flying from one side of the planet to the other in about ten minutes. From Colorado to China to Bermuda to Antarctica to Mexico to Massachusetts, unless the ARGO is capable of transportation, there's some _Game of Thrones_-level compression of distances going on. Related to this is that Zhang Ziyi plays twins (Dr. Ilene Chen and Dr. Ling Chen), who we never see together. Except I didn't even realise there were two of them until I read a few reviews. Sure, I noticed what I thought was a singular character appear to be in two places at once, but because the ARGO had already been globe-hopping all over the place by that point, I just put it down to the film's lack of geographic realism. The fact that it's so easy to miss that there are twins is spectacularly bad writing, especially considering they're supposed to be a modernised version of the Shobijin, two fairies that speak for Mothra. Also, Aisha Hinds as Colonel Diane Foster, O'Shea Jackson Jr. as Chief Warrant Officer Jackson Barnes, and Thomas Middleditch as Dr. Sam Coleman may as well not be in the film at all, so little are they given to do. The same could be said for most of the Titans. Apart from the central tag-teams of Godzilla and Mothra facing off against Ghidorah and Rodan, most of the rest (including those newly created for the film - Baphomet, Typhon, Abaddon, Bunyip, and Methuselah) are seen only in news reports and a montage that plays behind the closing credits, although a few do turn up for one scene.\r\n\r\nBut for all that, however, I thoroughly enjoyed _King of the Monsters_. Although the trailer does promise what the film can't deliver, aesthetically, there's a lot to admire. The sound design by Erik Aadahl (_I, Robot_; _The Tree of Life_; _A Quiet Place_) Brandon Jones (_13 Hours_; _The Shallows_), and Tim Walston (_The Incredible Hulk_; _Pacific Rim_; _Chronicle_) is suitably deafening, and the cinematography by Lawrence Sher (_The Hangover_; _War Dogs_; _Joker_) has a well-judged sense of scale, especially in the 2.39:1 3D IMAX format. This is complemented by the editing by Roger Barton (_Gone in 60 Seconds_; _Pearl Harbor_; _The Grey_), Bob Ducsay (_Season of the Witch_; _Looper_; _Rampage_), and Richard Pearson (_The Bourne Supremacy_; _Quantum of Solace_; _Iron Man 2_), who maintain the rhythm of even the most chaotic action scenes. And even though pretty much the entire film takes place at night in the midst of a storm of the Titans' own making, it never becomes difficult to follow or see what's happening. \r\n\r\nThe film also does some interesting things with colour. Whereas the palette is predominantly mixed when we're with the human characters, the Titans are coded in binary elemental colours: Mothra glows blue as a larva and gold in her final form, Rodan reflects the hardened red of the lava from which he emerges, Godzilla is the green of nature, Ghidorah is a neutralising dark brown. There are also some extraordinary individual shots (most of which have unfortunately been spoiled by the trailer); Mothra spreading her wings for the first time, Ghidorah perched atop an erupting volcano with a crucifix looming in the foreground, the reveal of Godzilla's lair. And the final shot is a goosebumps moment with which no Kaiju fan could possibly be dissatisfied. Purely at the level of craft, this is a hugely impressive film.\r\n\r\n_Citizen Kane_ it most certainly isn't, but who expected (or wanted) it to be. The key to really parsing the film is to consider the context, looking at what it was trying to be. And in this sense, it's a success. Sure, the script is hideous, and Dougherty is no Edwards, struggling to accomplish what Edwards seemed to do with ease; bring his own personality to the spectacle. However, if you approach it for what it is, a dumb summer blockbuster about large monsters punching each other, you'll like it just fine.", "created_at": "2019-09-10T23:02:05.398Z"}, {"movie_id": 373571, "review_id": "5d98c2dbaaec71001a68789c", "author_rating": null, "review_text": "When I watched the 2014 Godzilla movie I was less than impressed as can be seen from my review here.\r\n\r\nWhen watching this one I felt it was marginally better.\r\n\r\nTrue to the Hollywood standards today, or perhaps lack thereof, the script writers just had to try and squeeze in a lot of green bullshit about how we destroy the planet and something has to be done bla bla bla.\r\n\r\nInteresting enough though, the way it was done, actually made the green fanatics the bad guys in the movie. Whether that was intentional or the writers was too stupid to realize it I do not know.\r\n\r\nThe story is essentially about how one green fanatic in particular releases the “Titans” as they are called in the movie and uses them to wreak havoc, killing millions, to “balance things” and start a new world. That is your typical green fanatic although with a bit more means than usual to implement his deluded fantasies. Of course Godzilla, with the help of a few clear minded humans, comes to the rescue. That’s pretty much it. As I wrote, a typical substandard Hollywood script.\r\n\r\nWhat makes this movie better though is that the implementation is not so shit full of absolutely stupid and unintelligent sequences as the 2014 movie. The implementation is actually not that bad. The action sequences are really quite good and there’s plenty of big ass monsters in this movie.\r\n\r\nI also quite liked that cool super-carrier airplane that the Monarch crew flew around in.\r\n\r\nAs despicable as the previously mentioned green fanatic is, the role was nicely implemented as well as the main protagonist and most people around him.\r\n\r\nThe part about kick-starting Godzilla after he was wounded by detonating a nuke in front of his nose was a bit silly though. So was the hole it’s to hot and radioactive for drones as well as for a nuclear submarine so let’s send in a guy on foot. Seriously?\r\n\r\nAlso the after scenes where life magically sprouted everywhere the Titans had wrecked havoc was more than a little stupid.\r\n\r\nIf this hadn’t been a cool giant monster movie with a lot of special effects I would have scored it a lot lower. However, I am a sucker for these kinds of movies and I really like Godzilla. I even watched some of the old black and white movies when I was a kid.", "created_at": "2019-10-05T16:20:43.315Z"}, {"movie_id": 373571, "review_id": "60a4ded6e272600029d4b4a6", "author_rating": 9.0, "review_text": "When Charles Dance first entered the scene I was like; \"Tywin Lannister's alive?!\"! LOL\r\n\r\nDon't know why everybody is hating this, it was actually a pretty good films.\r\nCan't wait to see GvK!", "created_at": "2021-05-19T09:48:06.819Z"}, {"movie_id": 373571, "review_id": "62dfa947bbcae0004dca4fb8", "author_rating": 8.0, "review_text": "I felt like a kid again watching my fave monsters fight like they did when my late dad and i watched them together. I freaking loved it. THAT is how you make a Godzilla movie. Can't wait till he fights Kong.", "created_at": "2022-07-26T08:43:51.716Z"}]