[{"movie_id": 480530, "review_id": "5c9dbc4a9251410a48142036", "author_rating": null, "review_text": "that's the movie I wanted to see badly for a long time I watched its first part that was too awesome and creed 2 is marvelous I had to <a href=\"https://www.tutorshelponline.com/do-my-homework\">do my college homework</a> but I skipped that just to watch creed 2 the training part and the last fight I can't describe in words what I feels after watched.", "created_at": "2019-03-29T06:33:46.896Z"}, {"movie_id": 480530, "review_id": "5d17a9c590fca30022aafb30", "author_rating": 6.0, "review_text": "**_Decent enough, but adheres far too rigidly to the_ Rocky _template_**\r\n\r\n> _I have not met one person who didn't like a_ Rocky _movie._\r\n\r\n- Steven Caple Jr.; \"How _Creed II_ Director Crafted His _Rocky IV_ Successor\" (Mia Galuppo); _The Hollywood Reporter_ (November 21, 2018)\r\n\r\nRyan Coogler's _Creed_ (2015) was probably the best of the remakequels (ostensible sequels that are, for all intents and purposes, remakes) that came out in the mid-2010s (the most obvious ones being J.J Abrams's _Star Wars: The Force Awakens_, Colin Trevorrow's _Jurassic World_, and Adam Wingard's _Blair Witch_), and was the first _Rocky_ film not written by Sylvester Stallone, and not directed by either Stallone or John G. Avildsen. After _Rocky Balboa_ did the seemingly impossible, redeeming and concluding the franchise after the damage done by _Rocky V_, _Creed_, written by Coogler and Aaron Covington, and directed by Coogler, did something even more unlikely – revitalising the franchise with Rocky himself as a supporting character. For the sequel, Stallone is back as a writer (sharing credit with Juel Taylor, from a story by Sascha Penn and Cheo Hodari Coker), with Steven Caple Jr. directing (Coogler is credited as an executive producer). Whereas _Creed_ was essentially a remake of the original _Rocky_, _Creed II_ is more of a combination of _Rocky III_ and _Rocky IV_, with some elements from _Rocky II_, and whilst it hits all the beats one expects from a _Rocky_ movie, the problem is that it hits them so slavishly, and does little else. It also, perhaps inevitably, suffers badly in comparison to its predecessor, especially in terms of direction – whereas Coogler's directorial work was assured, distinctive, and inventive, Caple Jr.'s is pedestrian and functional. Had it strayed from the formula just a tad, the way _Creed_ did, the way _Rocky Balboa_ did, it would have been a much better film instead of a bland rehash of something we've seen multiple times (and not just in this franchise, but in virtually every boxing movie). The kernel for a terrific film is there, but the execution is not, it features a litany of clichés, it's dull, repetitive, the antagonist's subplot is infinitely more compelling than the main plot, and the culminating fight is almost parodic in design.\r\n\r\nIn _Rocky IV_, former WBC Heavyweight Champion Apollo Creed (Carl Weathers) was killed in the ring during an exhibition bout against Ivan Drago (Dolph Lundgren). Determined to avenge the loss of his best friend, reigning champion Rocky Balboa (Sylvester Stallone) travelled to Moscow, where he not only defeated Drago, he also got the Soviet crowd on his side. 33 years later, Ivan's son, Viktor (the man-mountain that is Florian Munteanu), is training as a professional boxer in Ukraine, under the watchful eye of promoter Buddy Marcelle (Russell Hornsby). Meanwhile, in Philadelphia, three years after his professional debut against \"Pretty\" Ricky Conlan (Tony Bellew), Apollo's son, Adonis Creed (Michael B. Jordan), is preparing for a bout against the champion, Danny \"Stuntman\" Wheeler (Andre Ward). Upon winning the title, Adonis proposes to his girlfriend, Bianca Taylor (Tessa Thompson), who says yes. Life seems perfect. That is until Viktor and Ivan head to the US and issue a very public challenge to Adonis. Meanwhile, Ivan tells Rocky, who is in Adonis's corner, that the fight is a way to regain honour for the Drago name, explaining that after their bout 33 years ago, he lost everything, including his wife, Ludmilla (Brigitte Nielsen), who left him shortly after Viktor's birth. Spurred on by Marcelle, and seeing an opportunity to avenge his father's death, Adonis plans to take the fight, but is warned against doing so by Rocky. When Adonis insists, Rocky says he can no longer train him. Adonis and Bianca move to Los Angeles so she can pursue her singing career, moving into a luxury apartment near Apollo's widow, Mary Anne (Phylicia Rashād). To replace Rocky, Adonis recruits Tony \"Little Duke\" Evers (Wood Harris), Wheeler's former trainer, and son of Tony \"Duke\" Evers (Tony Burton), who trained both Apollo and Rocky in the past. Feeling betrayed by Rocky, and finding it difficult to adjust to the recent changes in his life, including the fact that Bianca is pregnant, Adonis's preparations for the bout are not what they should be, whilst Ivan makes sure to push Viktor as hard as he possibly can.\r\n\r\nWhat's perhaps most surprising about _Creed II_ is that not only is it a sequel to _Creed_, it's also a sequel to one of the most ridiculous films of all time, and one which certainly didn't cry out for a continuation of the narrative, _Rocky IV_. _Creed_ recast the _Rocky_ template for a modern audience, setting it in a social-realist African-American _milieu_ and relegating Rocky to a supporting player. _Rocky IV_, by contrast, was the movie wherein the franchise abandoned all semblance of realism; the film in which Rocky himself, the working-class everyman, became a superhero (he even had a talking robot sidekick), travelling to the Soviet Union, defeating Communism, and winning the Cold War by preaching _glasnost_ to the Soviet people (two years before Ronald Reagan's \"_tear down this wall_\" speech). It's a movie so ridiculous that the poster quite literally tells you how it ends! It also features Sylvester Stallone all but sexually abusing Sergei Eisenstein's theories of montage. The first example of such (Rocky driving pensively into the night) is a montage of Rocky thinking about montages, and the second (Rocky training by cutting down trees and running atop mountains) is probably the most 80s thing to ever exist. The film is, in fact, so preposterous, far-fetched, and ludicrous that if you're unable to have fun watching it, you may as well just stop watching movies.\r\n\r\nFrom an aesthetic point of view, _Creed II_ is largely unremarkable (there's certainly nothing as epic as the single-shot fight from the first film), but one aspect that did stand out is the sound. As the first film established, Bianca is losing her hearing, something which is manifested in the aural design of _Creed II_ several times. At the start of the film, for example, as Bianca walks through the backstage area prior to the title fight, the sound of the crowd is soft and distanced until she puts in her hearing aid. Later, when Creed is training in a swimming pool, Bianca and Mary Anne are talking at another location, with their conversation carrying over his scenes. However, every time he goes below the water, the sound of their voices dulls as if it were diegetic. When Adonis is knocked down during his bout with Viktor, all sound is pulled from the film, only returning when he locks eyes with Bianca in the crowd. Even Adonis's marriage proposal involves her hearing aid. This is all thematic, of course, insofar as they are worried their child may inherit her hereditary hearing loss.\r\n\r\nThematically, legacy is a huge issue in _Creed II_, particularly as it relates to fathers and sons – Apollo and Adonis, Ivan and Viktor, Duke and Little Duke. Rocky himself is something of a surrogate father to Adonis, and is estranged from his own son, Robert (Milo Ventimiglia, who played the role in _Rocky Balboa_), and a grandson he has never met. Whilst _Creed_ saw Adonis use boxing as a way to symbolically bond with a father he never knew, _Creed II_ is more concerned with the emotionally fraught terrain that can result when fathers try to live vicariously through their sons, and when sons must live with their father's failures. Everything Viktor does, for example, is an attempt to earn Ivan's approval, whilst Ivan sees Viktor as the only way to atone for what happened to him after losing to Rocky.\r\n\r\nIndeed, the depiction of the Dragos in general is especially interesting, and is both one of the best aspects of the film, and simultaneously one of the most problematic. In _Rocky IV_, Ivan was a cartoon villain, a badly written, pseudo-xenophobic hyperbole of what some Americans seemed to think Soviets were like. He was barely one-dimensional. In _Creed II_, he's still relatively thin as a character, but Lundgren is given enough room to portray him as essentially broken, living on nothing but bitterness, resentment, and shame. When he meets up with Rocky in the latter's restaurant, promising, \"_my son will break your boy_\", he comes across as more pathetic than anything else, a million miles from the almost automaton-like warrior of three decades prior. When Ivan mentions their fight, Rocky tries to dismiss it, \"_that's like a million years ago_.\" Ivan, however, replies, \"_but just yesterday to me_.\" One gets the impression that from the moment of his loss he's been waiting for this, seeing his son as nothing more than the delivery method of his vengeance. Ivan has raised Viktor in pure hate, teaching him that the only thing that matters is winning, but you can see in every move that Viktor is far more concerned with earning his father's respect – winning as an end unto itself means relatively little to him. There's a lot of pathos in that, and both Lundgren and Munteanu act the hell out of the complex dynamic. Working with Stallone for the fifth time, Lundgren's understated and subtle performance is easily the best of his career, and the best in the film, with the quietness that spoke to lack of interiority in the previous film, here suggesting a deeply felt pain.\r\n\r\nThe training montages also do something very interesting in respect to Viktor. Showing him jogging through economically impoverished communities, stacking crates, lugging around bags of cement, and working with less than state-of-the-art equipment, the parallel is not to Ivan, who trained with hi-tech gizmos and gadgets in _Rocky IV_, but to Rocky's training in the original film. Indeed, whilst Adonis lives in a luxury apartment, Viktor and Ivan live in a dingy bedsit in Ukraine that recalls Rocky's original digs in Philadelphia.\r\n\r\nThe problem with all of this is that the Dragos' story is by far the most compelling one in the film. One should not come away from a film named _Creed II_ wishing there had been less Creed and more of the antagonists. Although Creed, Bianca, and Rocky all get a little character development, the most interesting story arc is that of Ivan. Set against the complex and fascinating Drago family drama, Creed and Bianca's story is pretty insipid, and is essentially a rehash of Rocky's relationship with Adrian (Talia Shire) in _Rocky II_. The most dramatic and heartfelt moments of the film involve Ivan and Viktor, and the long middle section where Creed falls into a depression seems to go on forever; the whole time we were watching him fall apart, I was yearning to get back to the Dragos.\r\n\r\nAnd this feeds into the film's most egregious problems – its rigid adhesion to the _Rocky_ template, and the concomitant predictability. Chances are that everything you think might happen in _Creed II_ does, as the film makes no attempt whatsoever to be original. Aside from the Drago subplot, there is nothing here that we haven't seen before. Granted, the _Rocky_ franchise has always tended to wear its predictability like a badge of honour, and the core template does undoubtedly work. But even when a film adheres to that template, one shouldn't be able to predict each narrative beat with near perfect accuracy. Even _Rocky V_, as awful as it was, tried something new, culminating with a street fight rather than an in-ring bout. It didn't even remotely work, but the thinking behind it was admirable. Aside from two unexpected cameos, _Creed II_ never once caught me off-guard, doing nothing original, unexpected, or in any way daring. And because of that, for large portions of the runtime, particularly the middle section, the film is interminably boring.\r\n\r\nEven the boxing itself is not especially well-done. The cinematography by Kramer Morgenthau (_Thor: The Dark World_; _Chef_; _Terminator Genisys_) is fine, but nothing special, and pales in comparison to Maryse Alberti's work in the first film. Similarly, Caple Jr.'s direction is efficient, but not in the same ballpark as Coogler's. Aside from Martin Scorsese's _Raging Bull_ (1980) and Michael Mann's _Ali_ (2001), both visually unique in their own ways, _Creed_ is arguably the most technically proficient boxing movie in terms of in-ring competition. _Creed II_, however, shoots all the fights very conventionally, holding a fairly uniform three-quarters distance from the actors, with Caple Jr.'s only trick seeming to be slow-motion, which he grossly over-uses. This has the effect of making the fights seem repetitive, even when the story being told by the fighting action is different (which isn't helped by the fact that Ivan tells Viktor to \"break him\" about 150 times).\r\n\r\nWhile we're on the subject of the boxing itself, the culminating fight between Adonis and Viktor is beyond ridiculous, even for this franchise. The boxing in _Rocky_ films has never been even remotely realistic, with a laughable number of haymakers landing cleanly in every round of every fight, but _Creed II_ takes this almost to the point of parody. In the recent Deontay Wilder vs. Tyson Fury fight, the total power punches landed was 31-38 from 182-104 thrown (17%-36.5%), whilst overall punches was 71-84 from 430-327 (16.5%-25.7%). These numbers are a little below the heavyweight average (which is 15 punches per round), but they're not especially unusual. In one round towards the end of _Creed II_, I counted Creed landing 19 power punches to Drago's 12. That's just ridiculous, to the point where it completely takes you out of the film. There's also an unintentionally hilarious moment when Adonis is knocked down, and Little Duke, apparently auditioning as the worst corner man in boxing history, looks out to Bianca in the crowd and shrugs!\r\n\r\nInsanely, even \"Gonna Fly Now\", that most fundamental aspect of all _Rocky_ movies (except the one it wasn't used in) is underwhelming; whereas the first film used it to carry the audience to the emotional highpoint, combining Ludwig Göransson's interpolation of Bill Conti's legendary score with the on-screen action and Rocky screaming, \"_You're a Creed_\" as a way to inspire Adonis off the canvas, _Creed II_ just kind of randomly drops it into the mix without a whole lot of justification or thematic relevance.\r\n\r\nAlthough there are some laudable elements here, _Creed II_ is a disappointment in almost every way, from the dull and soulless domestic scenes to a _dénouement_ that goes beyond suspension-of-disbelief, with not a hint of unpredictability. By essentially deconstructing the _Rocky_ template, _Creed_ found its way to unexpected thematic depths, recasting the great-white-hope subtext into a narrative about a struggling black man, whilst also examining notions of masculinity in the 21st century, and having Rocky himself face his own mortality. _Creed II_ exists entirely on the surface. Sure, the _Rocky_ melodrama is there, the _Rocky_ fights are there, the Stallone one-liners are there, but with a narrative focused almost entirely on the less interesting characters, this has to go down as a missed opportunity. Apart from the Drago subplot, everything is by-the-numbers. Yes, we care about these characters, but that's primarily because of the previous films, and whereas _Creed_ forged a path very much its own, _Creed II_ returns us to the safety of the overly familiar.", "created_at": "2019-06-29T18:11:17.478Z"}, {"movie_id": 480530, "review_id": "63bf6983df857c00d9c03747", "author_rating": 1.0, "review_text": "I finally got around to this, and I think my issue with it is Adonis Creed.\r\n\r\nI kind of passed it over in the first one, because, honestly, it was just nice to see another Rocky movie, and you did see Creed train and fight and struggle a bit.\r\n\r\nWhat we have is a kid that grew up an orphan, but at a young age got adopted into a life of privilege, had a good job, and didn't have to struggle financially, until he kind of did when he wanted to become a full time boxer... and then the story takes off.\r\n\r\nAnd that was all passable, because he didn't exactly win did he? It was a hard fought first movie and he still had to go through a pretty tough arch to get to where he was that was both interesting and compelling... so despite the relative flaws in Creed, it was an enjoyable enough film to watch and far better than most of the movies we've been getting lately.\r\n\r\nBy the time Creed II rolls around, however, Adonis Creed is just whiny. And that's really it, his character isn't really allowed to progress any further, he's not allowed to grow in any way.\r\n\r\nThe poster suggests that there was a hard fought and emotional battle that Adonis had to over come and made it through a better man that when he started. The raw emotion of the poster makes us believe that he faced something insurmountable and came out victorious through sheer will alone.\r\n\r\nAnd, honestly, that is how the fight itself played out and I loved every minute of it. Both Michael B. Jordan and Florian Munteanu sold each and every blow and you could almost feel it as you sat back shoving your face with popcorn.\r\n\r\nBut in the end, Adonis was still the same whiny little brat he was at the start of the first Creed installment and we are two films in. He hasn't grown in any way, no personal faults were over come. He's not at all a changed person, so you're left with the feeling that you haven't grown with him, you haven't progressed any, and by the end of the film you are left wondering what the point of it all was.", "created_at": "2023-01-12T01:59:31.207Z"}, {"movie_id": 480530, "review_id": "640209d29f1be700aaed76c5", "author_rating": 9.0, "review_text": "Creed II takes pieces of the previous Rocky stories and is able to completely transform them into a better, more emotional story that can easily resonate with audiences.\r\n\r\nIf I have one big complaint about this installment, it would be that the script steals almost every single story beat from Rocky IV. But, at the same time, that is one of the most interesting aspects. Rocky IV had so much potential to be an emotionally impactful movie but failed to capture that tone due to the 80s camp that was heavily featured. In Creed II, we get to see the fallout of the fight between Rocky and Drago. Where Rocky went on to be a national treasure in retirement, Drago met a worse fate in Russia. His wife left him, his country turned its back on him, and he and his son were completely alone. This isolation drives the two in order to regain the respect of their countrymen and is a very compelling motive. On the other hand, Adonis is attempting to gain redemption for the Creeds by beating the fighters that single handedly killed his father all those years ago. This story is able to evolve all of our main characters, with Donnie being able to accept his father's absence and become a father figure for his newly born daughter. Rocky learns to care for and communicate with others, resulting in him gaining a relationship with his son. And with the Drago’s realizing that they don’t need the acceptance of Russia to become successful in their own right. This story really worked for me and was exactly the type of film I wished Rocky IV would have been.\r\n\r\nOur cast is once again superb; Michael B. Jordan’s chemistry with Stallone and Tessa Thompson is fantastic, and he is so great in this role. There is a scene with Rocky giving Adonis a very emotional speech about why he wants to fight, and it honestly rivals his speech in Rocky Balboa; it sent shivers down my spine. Our villains are spectacular. Dolph Lundgren is incredible and actually has a substantial role, with him being the hard-nosed jackass of a father to Viktor. His journey towards the end of the movie is very fulfilling. Florian Munteanu was a surprise and was really able to portray the complex emotions of his character. His subtle facial expressions during the final fight really showed that his heart was not fully in it, unlike his father.\r\n\r\nThe fight scenes are fantastic. There is a sudden brutality to them that really emphasizes the sheer size and power of Viktor Drago, creating a very intimidating feel to the matches. Even though the choreography and cinematography might not be as great as the original, it is still able to do an incredible job of staging and filming the fights.\r\n\r\nOverall, this movie is genuinely excellent, and while it might not fully live up to the original, it is a worthy successor in almost every way.\r\n\r\nScore: 88%\r\nVerdict: Excellent", "created_at": "2023-03-03T14:53:06.854Z"}, {"movie_id": 480530, "review_id": "6489167ae272600107242f75", "author_rating": 6.0, "review_text": "I like the 1st Creed alot. This one though is trying to be to much like the old rocky movie. He said he wants to be his own fighter. Yet the stories are just like the rocky movies.", "created_at": "2023-06-14T01:23:06.257Z"}]