[{"movie_id": 283235, "review_id": "56f21ce9925141553f000152", "author_rating": 10.0, "review_text": "This movie is reality, it shows real life experiences of how people were ripped off by wall street and their employees we call government.", "created_at": "2016-03-23T04:34:49.535Z"}, {"movie_id": 283235, "review_id": "571cddf292514121a00068a4", "author_rating": 8.0, "review_text": "> Jumping back into the pool where you have almost drowned once.\r\n\r\nI think it was Andrew Garfield's recent best performance. Because he hasn't done any films lately since 'The Amazing Spider-Man 2' critically failed. His role was awesome, but a struggling young single father. When he loses his inherited family house to the bank, he has no choice but to make a quick decision that can secure his family a roof over the head. But when the things get ugly, the new issues begin to appear, and with a narrow chance he tries to fix it.\r\n\r\nAnother excellent character in the movie that played by Michael Shannon. Not like you know this story very well, and wonderfully narrated story on the screen about what a desperate man can do with his small opportunity to rise again. You will know the twist is coming, but when and how is what we have to patiently wait for. I almost liked the entire film, except the end, which was a bit weak solution and stronger in the display.\r\n\r\n8/10", "created_at": "2016-04-24T14:53:38.596Z"}, {"movie_id": 283235, "review_id": "6533dc15a0be28011cbb1090", "author_rating": 6.0, "review_text": "Now there can be little arguing that Andrew Garfield - even without the big hair - is a good looking man whom the camera very much likes. That does not, however, compensate for the fact that he is a a truly mediocre actor - and this film, sadly, displays that in spades. He (\"Nash\") is a single father living with him mum (Laura Dern) but he loses his job on a construction site. The bank forecloses and when the bailiffs arrive they are quite literally chucked out onto the street by the police and a rather avaricous, ruthless realtor \"Rich Carver\" (Michael Shannon). Desparate to get his family back home, he ends up doing odd jobs for his nemesis and gradually that expands until he is little better than a mini-me version; just as cruel and insensitive to an increasing number of victims of unemployment and bad luck. The story doesn't hang around, but I was puzzled by just how quickly the resolutely defiant Garfield character turned native, and the implausible haste with which this happened really robbed this of any sense of realism. Shannon is quite good as the malevolent exploiter, but there no real contributions from Dern and the ending is really quite predictably poor.", "created_at": "2023-10-21T14:11:33.046Z"}]