[{"movie_id": 1574, "review_id": "5b7c4b6e9251413b89000080", "author_rating": 7.0, "review_text": "Gazillions of babes frolicking around in showgirl costumes and lingerie\r\n\t\r\nIn mid-20’s Chicago Velma Kelly (Catherine Zeta-Jones) and Roxie Hart (Renée Zellweger) find themselves on death row for murdering their lovers and fan the fame that will keep them from the gallows with the assistance of a slick lawyer (Richard Gere). John C. Reilly plays Roxie’s likable but dimwitted husband while Latifah is on hand as the avaricious prison matron.\r\n\r\nPeople criticize this amusing satirical musical for being sleazy, but it would be hard to lampoon and ridicule the corrupt targets of the media and the legal (in)justice system without showing, um, sleaze. That's the point of the original 1926 play “Chicago” and all its successive incarnations, including this acclaimed 2002 movie: illustrating and sarcastically denouncing sleaze via a droll musical. “Chicago” without sleaze would be akin to “Apocalypse Now” without war.\r\n\r\nBelieve it or not, the movie is based on real women, Beulah Annan (represented by Roxie) and Belva Gaertner (Velma), who were imprisoned for killing lovers in spring, 1924, in two unrelated incidents. The actual accounts were salacious with loads of sex & violence; and both were ultimately acquitted. Maurine Dallas Watkins wrote the original play, which was intended as a stinging satire of the lack of morals in Chicago during the roaring 20s. Watkins was, interestingly, a reporter for the Chicago Tribune who covered the popular trials and is represented by Mary Sunshine (Christine Baranski) in the film. Several of the peripheral characters are also based on real-life individuals who played a part in the unfolding drama, e.g. journalists, attorneys, officials and convicts.\r\n\r\nI’m not big on musicals beyond ones like “Moulin Rouge” (1952) and “The Wizard of Oz” (1939), but “Chicago” works for me simple due to the scores of beautiful women prancing around in scanty showgirl apparel of the 20s. It’s the same reason I love figure skating. After the passage of the 19th Amendment, American women were basking in their newfound freedoms and “Chicago” depicts this euphoric emancipation.\r\n\r\nI also appreciate “Chicago” because Gere is great and there are some creative pieces, like the puppet one and the tap-dancing part. All the musical skits are in Roxie’s imagination, except for the opening “All that Jazz” performed by Velma at the club and the climatic one, which features both Velma & Roxie.\r\n\r\nThe film runs 1 hour, 53 minutes.\r\n\r\nGRADE: B", "created_at": "2018-08-21T17:27:10.920Z"}, {"movie_id": 1574, "review_id": "5b8630cb92514149f30066c8", "author_rating": 9.0, "review_text": "SPOILERS AHEAD!\r\n\r\nFrom Rob Marshall (\"Into the Woods\") and Bill Condon (\"Dreamgirls\") comes this charming satirical stab on celebrity criminals. Based on the 1975 stage play and starring Renee Zellweger, Catherine Zeta-Jones and Richard Gere.\r\n\r\nSet in the jazz age of Chicago, Illinois. \"Chicago\" tells the story of two women on murderess row who hope that fame and fortune will keep them out of the gallows. Velma Kelly (Zeta-Jones) is a vaudevillian performer who plugs her sister and husband right before a performance. Roxie Hart (Zellweger) is watching the performance while idolizeing Velma and hopes one day to be on the stage just like her. Convinced that with Fred Casely's (Dominic West) help she will get what she wants.\r\n\r\nBut, when Casely turns out to be an abusive lying womanizer Roxie is angered and betrayed. Causing her to kill him as revenge, she tries to convince her husband Amos (John C. Reilly) to take the blame. However, his story does not phase the Harrison (Colm Feore) and Roxie is arrested and learns that she could face the death penalty. Roxie later meets the corrupt but nurturing jail matron Mama Morton (Queen Latifah), who gives her some helpful advice on how to win the court's appeal. Roxie later finds herself being a client of the corrupt smooth-talking Billy Flynn (Gere), who is determined to help her win her case.\r\n\r\nBilly corrupts the press with a story about how Roxie killed Fred out of self-defense. At the same time she butts heads with Velma after the press starts putting her name in the headlines. Roxie's fame is almost short-lived until she fakes a pregnancy. Now with a swelled head, she fires Billy convinced she can win the case on her own. Unfortunately, she is forced to take Billy back after seeing that another inmate will be executed. At the same time Amos starts to wonder about Roxie's \"baby.\" Convinced that it is not his baby he decides to file for divorce. The day of the trial Billy turns the court room upside down and is able to convince the jury that Roxie is innocent, Amos learns that the pregnancy was a ruse and finally leaves her.\r\n\r\nNow that Roxie is free she tries to make her dream come true, but Velma explains to her that a one woman act is not what Chicago is looking for. Roxie rejects the offer because of Velma's resentment towards her and the lack of hospitality when they were on murderess row. Velma finally convinces her that they don't have to be friends in order to be partners. Roxie's dream becomes a reality as she and Velma are now the hottest act in Chicago.\r\n\r\nBut one question remains did it really happen or is it all in Roxie's head?\r\n\r\nHighly Recommended. This movie has some of the best singing and acting I have ever seen. It deserved all six of the awards.", "created_at": "2018-08-29T05:36:11.328Z"}, {"movie_id": 1574, "review_id": "6242bd4397a4e60047a80680", "author_rating": 7.0, "review_text": "Hats off to Rob Marshall for taking a cast not necessarily obvious for this story and moulding them into an entertaining trio. The screenplay has been sanitised a bit, and proves really quite thin: \"Roxie\" (Renée Zellweger) and \"Velma\" (Catherine Zeta-Jones) are both convicted murderesses who will do just about anything to escape death row. Using their skills as dancers, and their gifts for attracting publicity they must try to engage dodgy lawyer \"Billy Flynn\" (Richard Gere) to help get them out of the clutches of prison warden \"Mama Morton\" (a superb Queen Latifah). That's all pretty incidental to the stunning look of this film. At times a little confusing as the costumes seems to straddle timelines from the 1920s to things one might see in \"Saturday Night Fever\", but it is all about the style; and both principals have it in spades. Zeta-Jones, especially, has a classy sexiness about her performance; Zellweger more of an innocence, and Gere is the perfect man for the job proving he, too, can get his (and our) toes tapping. The original Fosse play remains the bedrock for this and the Kander and Ebb songs performed strongly with \"All That Jazz\"; Funny Honey\" and \"Razzle Dazzle\" all delightfully choreographed and delivered. I still prefer the intimacy (and grittiness) of the stage production, but as cinematic adaptations go - this is highly entertaining and well worth a watch.", "created_at": "2022-03-29T08:03:15.016Z"}, {"movie_id": 1574, "review_id": "624abc26a9117f004f856d37", "author_rating": 7.0, "review_text": "Hats off to Rob Marshall for taking a cast not necessarily obvious for this story and moulding them into an entertaining trio. The screenplay has been sanitised a bit, and proves really quite thin: \"Roxie\" (Renée Zellweger) and \"Velma\" (Catherine Zeta-Jones) are both convicted murderesses who will do just about anything to escape death row. Using their skills as dancers, and their gifts for attracting publicity they must try to engage dodgy lawyer \"Billy Flynn\" (Richard Gere) to help get them out of the clutches of prison warden \"Mama Morton\" (a superb Queen Latifah). That's all pretty incidental to the stunning look of this film. At times a little confusing as the costumes seems to straddle timelines from the 1920s to things one might see in \"Saturday Night Fever\", but it is all about the style; and both principals have it in spades. Zeta-Jones, especially, has a classy sexiness about her performance; Zellweger more of an innocence, and Gere is the perfect man for the job proving he, too, can get his (and our) toes tapping. The original Fosse play remains the bedrock for this and the Kander and Ebb songs performed strongly with \"All That Jazz\"; \"Funny Honey\" and \"Razzle Dazzle\" all delightfully choreographed and delivered. I still prefer the intimacy (and grittiness) of the stage production, but as cinematic adaptations go - this is highly entertaining and well worth a watch.", "created_at": "2022-04-04T09:36:38.165Z"}]