[{"movie_id": 1930, "review_id": "5192715d19c2950a16225394", "author_rating": 5.5, "review_text": "“The Amazing Spider-Man” has no reason to exist. Spider-man is a hero everyone knows. He´s been around for so long everyone is familiar with his origin, comic fan or not. Its basic pop culture. Then you have the Sam Raimi´s movies. Everyone saw them. They made loads of money and they´re always on tv. They are entertaining movies. “Spider-Man” gave us a good origin story in 2002. This movie simply wasn't needed. \r\nNow I gave it the benefit of the doubt. There´s Burton´s Batman and Nolan´s. Maybe this was a different Spider-Man. A more “dark” vision perhaps! Maybe the movie spent a few minutes on the origin and then wisely moved on with its story. Maybe... well maybe it wasn't just another rehash. A shameless attempt to remake, or how they say it these days, reboot the same idea with minimal changes except the cast. I was naive.\r\nThe whole movie is about Spider-Man´s origin. They traded Mary Jane for another love interest and held off on “The Green Goblin” because that would be too much “rubbing it in the face” for the fans, I guess. We get Gwen Stacy and “The Lizard”. The rest is same old, same old. The same uncle Ben plot, the same scenes about making the suit, learning how to control powers, the search for the criminal Spider-man lets get away with horrific results. Same thing. Except everything is done without a spark of energy or creativity. Raimi´s movies were energetic, flowing with excitement. They were “new”. Seeing Spider-Man on the big screen,  webbing all over the city, fighting “The Green Goblin”, it was amazing. We didn't have “The Avengers” back there, or “Iron Man”. This was like a dream come true for comic fans. \r\n“The Amazing Spider-Man” smells of old cheese. \r\nI tried to take the movie for what it was but it was impossible. My mind would not let me. I knew what was going to happen next. I knew all the plots! I´d seen it all before! \r\nBut even ignoring that the movie just does not work. Its slow, turgid with an unlikable Peter Parker and a CGI lizard for a villain. Parker is a whiny, self centered idiot. His relationship with aunt May and uncle Ben is never fully explored and what little there is consists of Parker being a rude jerk for no reason at all. \r\nThe movie has one thing going for it. The cast. Sally Field and Martin Sheen are great with what little material they have. Emma Stone is sexy and sweet which is “her thing” and again she pulls it off brilliantly.  Rhys Ifans is decent as Curt Connors and surprisingly enough I loved Andrew Garfield as Spidey. Yes, seriously! He looks perfect for the part and he did his best with the horrible script. He´s charismatic and brought his own touch to the role instead of copying Toby Maguire. If the movie is even slightly original its because of him. \r\nSome of the action in the last third of the movie is also spectacular. Spider-man´s movements when fighting are really well done as is the web-slinging. The action is well directed and exciting and the movie sets up a sequel rather nicely. \r\nBut its asking a lot to go over the material everyone knows for two hours for a few minutes of cool action. The movie plays it so safe it hurts. Its competent but never brilliant. Tedious but far too long with little spots of action but few and far between. \r\nI hope in the sequel this “Spider-Man” can find its own style and its own place. Given space to grow and evolve, on the strength of the character and Garfield´s acting this could be the weak start to a new amazing super-hero trilogy. \r\nThen again, maybe i´m just naive.", "created_at": "2013-05-14T17:16:13.321Z"}, {"movie_id": 1930, "review_id": "5a71f1cd9251417f1600a830", "author_rating": 6.0, "review_text": "This is the fourth spider man movie although it is not the fourth sequel but rather one of these reboots which seems to be so popular today. I found the movie to be quite enjoyable but at the same time a bit of a let-down.\r\n\r\nIn some ways it is better than the previous trilogy by Sam Raimi (well it is not very hard to make something that is better than the 2nd installment in that trilogy of course). The film is darker, more serious and Spider Man is not so silly and a total mess-up when out of his costume as the character portrayed by Toby Maquire.\r\n\r\nHowever, this movie has its own faults which makes me have to think hard whether it is really that much of an improvement over the previous movie and this is what makes me feel a bit let-down since I had hope that this reboot would be that “real” Spider Man movie that enabled me to forget about the previous ones.\r\n\r\nA lot of not so interesting scenes are really dragged out and the important stuff is rushed. Peter Parker’s transition to Spider Man after his bitten is over and done with quite quickly. In another scene he spends 5 minutes trying to talk some kid out of a car. He even takes off his mask and gives it to him (what the f…) and in the end just zips him out with a net shot. He could have done that right away and spared us the boring time.\r\n\r\nGenerally I think this movie is indeed a better Spider Man movie than the previous ones though and I quite enjoyed the movie evening yesterday, just not as much as I hoped.", "created_at": "2018-01-31T16:41:49.413Z"}, {"movie_id": 1930, "review_id": "5d12a5550e0a267dceca3083", "author_rating": 7.0, "review_text": "Webb's Spider-Man, Spider-Man, does what ever a Spider can.\r\n\r\nThe Amazing Spider-Man is directed by Marc Webb and collectively written by James Vanderbilt, Alvin Sargent and Steve Kloves. It stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Martin Sheen and Sally Field. Music is by James Horner and cinematography by John Schwartzman. \r\n\r\nPeter Parker (Garfield) was orphaned as a boy when his parents were killed in a plane crash, raised by his Uncle Ben (Sheen) and Aunt May (Field), he is a clever lad but something of an outcast at high school. While investigating the disappearance of his parents and sporting a crush on class mate Gwen Stacy (Stone), Peter's life is tipped upside down when he is bitten by a radioactive spider that gives him abnormal powers. \r\n\r\nWhile the Spider-Man franchise doesn't (thankfully) come packaged with the kind of bizarre mania that comes with Batman, the acolytes are a tough bunch to figure out. Sam Raimi's trilogy garnered close towards $2.5 billion worldwide, yet now, with this reboot (actually it's a reimaging) trundled off of the Sony production line, there are plenty of \"fans\" coming forward to say they never rated Raimi's films! Magurie was this, Dunst was that, Raimi missed the beat of the comic version of Spidey and etc and etc. Well I'm sorry, but I just don't remember any fall out apart from the near unanimously agreed upon over stuffing of Raimi's part 3. Perhaps I just didn't go on the right Spider-Man forums? But even then it's hard to argue with a box office take of $2.5 billion, those figures have to be made up of a good proportion of Spidey fans, surely? You would reasonably think. \r\n\r\nI mention it because The Amazing Spider-Man has met with reviews from each end of the scale. Those at the high end who support the \"reimaging\" seem to focus on it being close to the real Spidey universe they wanted, with great casting, better effects work and a origin story of worth. At the other end is the arguments that \"reimaging\" a film that is only ten years old is daft, especially since it actually doesn't bring the promised new direction or origin story of worth. In fact it just juggles bits of the Raimi trilogy and plays it out with other Spider-Man characters instead. While Garfield is hardly an improvement since he's way too old for high school as well! The truth is that Webb's movie falls somewhere in between both sides of the argument, and that's not just me being Switzerland and staying neutral! \r\n\r\nNegatively it plays out as a compromised production and not the film that the makers initially set out to make, there are too many dangling threads and haphazard edits that leave narrative gaps. An Important character disappears off the radar, other characters are given limited time to breathe, and crucial plot points are arrived at with stupendous leaps of logic. A coda spliced into the end credits tries to entice us for the sequel, suggesting that the quick wipe over the origin \"origin\" story was deliberate, it's unlikely, and feels like an afterthought. For a film that purports to be putting its own stamp on the Spidey universe, it quite often makes you think of Raimi's films anyway. It may be The Lizard instead of Green Goblin and Gwen instead of MJ, but the emotional and psychological beats are still the same. Reboot? My arse. Oh and Horner, who I'm normally a fan of, has turned in a score that lacks vim and vigour, it aspires to be full of swirling superhero fervour to raise the goose flesh on your arms, but instead it's just goose, and not a decently cooked one at that. \r\n\r\nHowever, on the positive side of things, low expectation really helped me to enjoy the film, and I even watched it a second time to check over some initial reactions I had. There is still a lot to enjoy here. Acting is of a high standard (Ifans' performance as Curt Connors gets better on repeat viewings), with good chemistry generated between Stone and Garfield, the effects work is (obviously) better ten years on; something which gives us a better-more acrobatic-moving Spider-Man, while the whole make-up of Parker as a geek who becomes cocky, even arrogant, really adds a kick to the first half of the movie's coming-of-age narrative bent. It's also good that with a running time of over two hours the makers have the time to expand Peter as a character, making the audience wait with expectation of his life changing date with the spider. As for the villain, it's true enough to say that The Lizard is hardly an inspiring choice, but it does fit in with the whole origin story plan that Webb and his team want to tell. Though it should be noted that those seeking wall to wall fights between Spidey and The Liz are going to go a little hungry. \r\n\r\nIt's big on human story and not the lazy cash in movie it could have been, and undeniably it's fun, but the holes, dangling threads and logic leaps stop it breaking out to achieve its intentions. Looking forward to the sequel, mind 7/10", "created_at": "2019-06-25T22:51:01.261Z"}, {"movie_id": 1930, "review_id": "624216a99451e700498326e0", "author_rating": 7.0, "review_text": "I enjoyed this. One of the great advantages of the whole \"Spiderman\" concept is that it can be reinvented time and time again without really compromising the original character - a decent but lonely young man trying to make his way in the world and to get his girl. Like Tobey Maguire before him, the casting of the largely unknown Andrew Garfield works well - it allows a whole new generation of fans to follow their hero. The fact that he is cute in tights doesn't do him any harm either. Emma Stone is quite good, too, as the object of his affections \"Mary Jane\" and the whole look of the film is sophisticated and colourful. The story is very derivative, however - and that is the problem with this film. Though there is plenty of action, it becomes a little repetitive and uninspired. The CGI will always look good, and will increasingly do most of the work with these kind of films - indeed, just about everything in the Marvel Universe is 90% style over substance; but so long as they can still recruit enthusiastic actors to play the roles than the franchise might still have legs (though hopefully not eight) for the future. Martin Sheen and Sally Field add a little gravitas to the proceedings - the former has one of these wonderful Churchillian style voices that just goes on resonating, and Rhys Ifans makes for an OK mad scientist. As a stand alone adventure this works fine. Maybe a bit too long, but a cinema experience to be relished - then, maybe, just put away again for seven years.", "created_at": "2022-03-28T20:12:25.665Z"}, {"movie_id": 1930, "review_id": "5192715d19c2950a16225394", "author_rating": 5.5, "review_text": "“The Amazing Spider-Man” has no reason to exist. Spider-man is a hero everyone knows. He´s been around for so long everyone is familiar with his origin, comic fan or not. Its basic pop culture. Then you have the Sam Raimi´s movies. Everyone saw them. They made loads of money and they´re always on tv. They are entertaining movies. “Spider-Man” gave us a good origin story in 2002. This movie simply wasn't needed. \r\nNow I gave it the benefit of the doubt. There´s Burton´s Batman and Nolan´s. Maybe this was a different Spider-Man. A more “dark” vision perhaps! Maybe the movie spent a few minutes on the origin and then wisely moved on with its story. Maybe... well maybe it wasn't just another rehash. A shameless attempt to remake, or how they say it these days, reboot the same idea with minimal changes except the cast. I was naive.\r\nThe whole movie is about Spider-Man´s origin. They traded Mary Jane for another love interest and held off on “The Green Goblin” because that would be too much “rubbing it in the face” for the fans, I guess. We get Gwen Stacy and “The Lizard”. The rest is same old, same old. The same uncle Ben plot, the same scenes about making the suit, learning how to control powers, the search for the criminal Spider-man lets get away with horrific results. Same thing. Except everything is done without a spark of energy or creativity. Raimi´s movies were energetic, flowing with excitement. They were “new”. Seeing Spider-Man on the big screen,  webbing all over the city, fighting “The Green Goblin”, it was amazing. We didn't have “The Avengers” back there, or “Iron Man”. This was like a dream come true for comic fans. \r\n“The Amazing Spider-Man” smells of old cheese. \r\nI tried to take the movie for what it was but it was impossible. My mind would not let me. I knew what was going to happen next. I knew all the plots! I´d seen it all before! \r\nBut even ignoring that the movie just does not work. Its slow, turgid with an unlikable Peter Parker and a CGI lizard for a villain. Parker is a whiny, self centered idiot. His relationship with aunt May and uncle Ben is never fully explored and what little there is consists of Parker being a rude jerk for no reason at all. \r\nThe movie has one thing going for it. The cast. Sally Field and Martin Sheen are great with what little material they have. Emma Stone is sexy and sweet which is “her thing” and again she pulls it off brilliantly.  Rhys Ifans is decent as Curt Connors and surprisingly enough I loved Andrew Garfield as Spidey. Yes, seriously! He looks perfect for the part and he did his best with the horrible script. He´s charismatic and brought his own touch to the role instead of copying Toby Maguire. If the movie is even slightly original its because of him. \r\nSome of the action in the last third of the movie is also spectacular. Spider-man´s movements when fighting are really well done as is the web-slinging. The action is well directed and exciting and the movie sets up a sequel rather nicely. \r\nBut its asking a lot to go over the material everyone knows for two hours for a few minutes of cool action. The movie plays it so safe it hurts. Its competent but never brilliant. Tedious but far too long with little spots of action but few and far between. \r\nI hope in the sequel this “Spider-Man” can find its own style and its own place. Given space to grow and evolve, on the strength of the character and Garfield´s acting this could be the weak start to a new amazing super-hero trilogy. \r\nThen again, maybe i´m just naive.", "created_at": "2013-05-14T17:16:13.321Z"}, {"movie_id": 1930, "review_id": "5a71f1cd9251417f1600a830", "author_rating": 6.0, "review_text": "This is the fourth spider man movie although it is not the fourth sequel but rather one of these reboots which seems to be so popular today. I found the movie to be quite enjoyable but at the same time a bit of a let-down.\r\n\r\nIn some ways it is better than the previous trilogy by Sam Raimi (well it is not very hard to make something that is better than the 2nd installment in that trilogy of course). The film is darker, more serious and Spider Man is not so silly and a total mess-up when out of his costume as the character portrayed by Toby Maquire.\r\n\r\nHowever, this movie has its own faults which makes me have to think hard whether it is really that much of an improvement over the previous movie and this is what makes me feel a bit let-down since I had hope that this reboot would be that “real” Spider Man movie that enabled me to forget about the previous ones.\r\n\r\nA lot of not so interesting scenes are really dragged out and the important stuff is rushed. Peter Parker’s transition to Spider Man after his bitten is over and done with quite quickly. In another scene he spends 5 minutes trying to talk some kid out of a car. He even takes off his mask and gives it to him (what the f…) and in the end just zips him out with a net shot. He could have done that right away and spared us the boring time.\r\n\r\nGenerally I think this movie is indeed a better Spider Man movie than the previous ones though and I quite enjoyed the movie evening yesterday, just not as much as I hoped.", "created_at": "2018-01-31T16:41:49.413Z"}, {"movie_id": 1930, "review_id": "5d12a5550e0a267dceca3083", "author_rating": 7.0, "review_text": "Webb's Spider-Man, Spider-Man, does what ever a Spider can.\r\n\r\nThe Amazing Spider-Man is directed by Marc Webb and collectively written by James Vanderbilt, Alvin Sargent and Steve Kloves. It stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Martin Sheen and Sally Field. Music is by James Horner and cinematography by John Schwartzman. \r\n\r\nPeter Parker (Garfield) was orphaned as a boy when his parents were killed in a plane crash, raised by his Uncle Ben (Sheen) and Aunt May (Field), he is a clever lad but something of an outcast at high school. While investigating the disappearance of his parents and sporting a crush on class mate Gwen Stacy (Stone), Peter's life is tipped upside down when he is bitten by a radioactive spider that gives him abnormal powers. \r\n\r\nWhile the Spider-Man franchise doesn't (thankfully) come packaged with the kind of bizarre mania that comes with Batman, the acolytes are a tough bunch to figure out. Sam Raimi's trilogy garnered close towards $2.5 billion worldwide, yet now, with this reboot (actually it's a reimaging) trundled off of the Sony production line, there are plenty of \"fans\" coming forward to say they never rated Raimi's films! Magurie was this, Dunst was that, Raimi missed the beat of the comic version of Spidey and etc and etc. Well I'm sorry, but I just don't remember any fall out apart from the near unanimously agreed upon over stuffing of Raimi's part 3. Perhaps I just didn't go on the right Spider-Man forums? But even then it's hard to argue with a box office take of $2.5 billion, those figures have to be made up of a good proportion of Spidey fans, surely? You would reasonably think. \r\n\r\nI mention it because The Amazing Spider-Man has met with reviews from each end of the scale. Those at the high end who support the \"reimaging\" seem to focus on it being close to the real Spidey universe they wanted, with great casting, better effects work and a origin story of worth. At the other end is the arguments that \"reimaging\" a film that is only ten years old is daft, especially since it actually doesn't bring the promised new direction or origin story of worth. In fact it just juggles bits of the Raimi trilogy and plays it out with other Spider-Man characters instead. While Garfield is hardly an improvement since he's way too old for high school as well! The truth is that Webb's movie falls somewhere in between both sides of the argument, and that's not just me being Switzerland and staying neutral! \r\n\r\nNegatively it plays out as a compromised production and not the film that the makers initially set out to make, there are too many dangling threads and haphazard edits that leave narrative gaps. An Important character disappears off the radar, other characters are given limited time to breathe, and crucial plot points are arrived at with stupendous leaps of logic. A coda spliced into the end credits tries to entice us for the sequel, suggesting that the quick wipe over the origin \"origin\" story was deliberate, it's unlikely, and feels like an afterthought. For a film that purports to be putting its own stamp on the Spidey universe, it quite often makes you think of Raimi's films anyway. It may be The Lizard instead of Green Goblin and Gwen instead of MJ, but the emotional and psychological beats are still the same. Reboot? My arse. Oh and Horner, who I'm normally a fan of, has turned in a score that lacks vim and vigour, it aspires to be full of swirling superhero fervour to raise the goose flesh on your arms, but instead it's just goose, and not a decently cooked one at that. \r\n\r\nHowever, on the positive side of things, low expectation really helped me to enjoy the film, and I even watched it a second time to check over some initial reactions I had. There is still a lot to enjoy here. Acting is of a high standard (Ifans' performance as Curt Connors gets better on repeat viewings), with good chemistry generated between Stone and Garfield, the effects work is (obviously) better ten years on; something which gives us a better-more acrobatic-moving Spider-Man, while the whole make-up of Parker as a geek who becomes cocky, even arrogant, really adds a kick to the first half of the movie's coming-of-age narrative bent. It's also good that with a running time of over two hours the makers have the time to expand Peter as a character, making the audience wait with expectation of his life changing date with the spider. As for the villain, it's true enough to say that The Lizard is hardly an inspiring choice, but it does fit in with the whole origin story plan that Webb and his team want to tell. Though it should be noted that those seeking wall to wall fights between Spidey and The Liz are going to go a little hungry. \r\n\r\nIt's big on human story and not the lazy cash in movie it could have been, and undeniably it's fun, but the holes, dangling threads and logic leaps stop it breaking out to achieve its intentions. Looking forward to the sequel, mind 7/10", "created_at": "2019-06-25T22:51:01.261Z"}, {"movie_id": 1930, "review_id": "624216a99451e700498326e0", "author_rating": 7.0, "review_text": "I enjoyed this. One of the great advantages of the whole \"Spiderman\" concept is that it can be reinvented time and time again without really compromising the original character - a decent but lonely young man trying to make his way in the world and to get his girl. Like Tobey Maguire before him, the casting of the largely unknown Andrew Garfield works well - it allows a whole new generation of fans to follow their hero. The fact that he is cute in tights doesn't do him any harm either. Emma Stone is quite good, too, as the object of his affections \"Mary Jane\" and the whole look of the film is sophisticated and colourful. The story is very derivative, however - and that is the problem with this film. Though there is plenty of action, it becomes a little repetitive and uninspired. The CGI will always look good, and will increasingly do most of the work with these kind of films - indeed, just about everything in the Marvel Universe is 90% style over substance; but so long as they can still recruit enthusiastic actors to play the roles than the franchise might still have legs (though hopefully not eight) for the future. Martin Sheen and Sally Field add a little gravitas to the proceedings - the former has one of these wonderful Churchillian style voices that just goes on resonating, and Rhys Ifans makes for an OK mad scientist. As a stand alone adventure this works fine. Maybe a bit too long, but a cinema experience to be relished - then, maybe, just put away again for seven years.", "created_at": "2022-03-28T20:12:25.665Z"}, {"movie_id": 1930, "review_id": "5192715d19c2950a16225394", "author_rating": 5.5, "review_text": "“The Amazing Spider-Man” has no reason to exist. Spider-man is a hero everyone knows. He´s been around for so long everyone is familiar with his origin, comic fan or not. Its basic pop culture. Then you have the Sam Raimi´s movies. Everyone saw them. They made loads of money and they´re always on tv. They are entertaining movies. “Spider-Man” gave us a good origin story in 2002. This movie simply wasn't needed. \r\nNow I gave it the benefit of the doubt. There´s Burton´s Batman and Nolan´s. Maybe this was a different Spider-Man. A more “dark” vision perhaps! Maybe the movie spent a few minutes on the origin and then wisely moved on with its story. Maybe... well maybe it wasn't just another rehash. A shameless attempt to remake, or how they say it these days, reboot the same idea with minimal changes except the cast. I was naive.\r\nThe whole movie is about Spider-Man´s origin. They traded Mary Jane for another love interest and held off on “The Green Goblin” because that would be too much “rubbing it in the face” for the fans, I guess. We get Gwen Stacy and “The Lizard”. The rest is same old, same old. The same uncle Ben plot, the same scenes about making the suit, learning how to control powers, the search for the criminal Spider-man lets get away with horrific results. Same thing. Except everything is done without a spark of energy or creativity. Raimi´s movies were energetic, flowing with excitement. They were “new”. Seeing Spider-Man on the big screen,  webbing all over the city, fighting “The Green Goblin”, it was amazing. We didn't have “The Avengers” back there, or “Iron Man”. This was like a dream come true for comic fans. \r\n“The Amazing Spider-Man” smells of old cheese. \r\nI tried to take the movie for what it was but it was impossible. My mind would not let me. I knew what was going to happen next. I knew all the plots! I´d seen it all before! \r\nBut even ignoring that the movie just does not work. Its slow, turgid with an unlikable Peter Parker and a CGI lizard for a villain. Parker is a whiny, self centered idiot. His relationship with aunt May and uncle Ben is never fully explored and what little there is consists of Parker being a rude jerk for no reason at all. \r\nThe movie has one thing going for it. The cast. Sally Field and Martin Sheen are great with what little material they have. Emma Stone is sexy and sweet which is “her thing” and again she pulls it off brilliantly.  Rhys Ifans is decent as Curt Connors and surprisingly enough I loved Andrew Garfield as Spidey. Yes, seriously! He looks perfect for the part and he did his best with the horrible script. He´s charismatic and brought his own touch to the role instead of copying Toby Maguire. If the movie is even slightly original its because of him. \r\nSome of the action in the last third of the movie is also spectacular. Spider-man´s movements when fighting are really well done as is the web-slinging. The action is well directed and exciting and the movie sets up a sequel rather nicely. \r\nBut its asking a lot to go over the material everyone knows for two hours for a few minutes of cool action. The movie plays it so safe it hurts. Its competent but never brilliant. Tedious but far too long with little spots of action but few and far between. \r\nI hope in the sequel this “Spider-Man” can find its own style and its own place. Given space to grow and evolve, on the strength of the character and Garfield´s acting this could be the weak start to a new amazing super-hero trilogy. \r\nThen again, maybe i´m just naive.", "created_at": "2013-05-14T17:16:13.321Z"}, {"movie_id": 1930, "review_id": "5a71f1cd9251417f1600a830", "author_rating": 6.0, "review_text": "This is the fourth spider man movie although it is not the fourth sequel but rather one of these reboots which seems to be so popular today. I found the movie to be quite enjoyable but at the same time a bit of a let-down.\r\n\r\nIn some ways it is better than the previous trilogy by Sam Raimi (well it is not very hard to make something that is better than the 2nd installment in that trilogy of course). The film is darker, more serious and Spider Man is not so silly and a total mess-up when out of his costume as the character portrayed by Toby Maquire.\r\n\r\nHowever, this movie has its own faults which makes me have to think hard whether it is really that much of an improvement over the previous movie and this is what makes me feel a bit let-down since I had hope that this reboot would be that “real” Spider Man movie that enabled me to forget about the previous ones.\r\n\r\nA lot of not so interesting scenes are really dragged out and the important stuff is rushed. Peter Parker’s transition to Spider Man after his bitten is over and done with quite quickly. In another scene he spends 5 minutes trying to talk some kid out of a car. He even takes off his mask and gives it to him (what the f…) and in the end just zips him out with a net shot. He could have done that right away and spared us the boring time.\r\n\r\nGenerally I think this movie is indeed a better Spider Man movie than the previous ones though and I quite enjoyed the movie evening yesterday, just not as much as I hoped.", "created_at": "2018-01-31T16:41:49.413Z"}, {"movie_id": 1930, "review_id": "5d12a5550e0a267dceca3083", "author_rating": 7.0, "review_text": "Webb's Spider-Man, Spider-Man, does what ever a Spider can.\r\n\r\nThe Amazing Spider-Man is directed by Marc Webb and collectively written by James Vanderbilt, Alvin Sargent and Steve Kloves. It stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Martin Sheen and Sally Field. Music is by James Horner and cinematography by John Schwartzman. \r\n\r\nPeter Parker (Garfield) was orphaned as a boy when his parents were killed in a plane crash, raised by his Uncle Ben (Sheen) and Aunt May (Field), he is a clever lad but something of an outcast at high school. While investigating the disappearance of his parents and sporting a crush on class mate Gwen Stacy (Stone), Peter's life is tipped upside down when he is bitten by a radioactive spider that gives him abnormal powers. \r\n\r\nWhile the Spider-Man franchise doesn't (thankfully) come packaged with the kind of bizarre mania that comes with Batman, the acolytes are a tough bunch to figure out. Sam Raimi's trilogy garnered close towards $2.5 billion worldwide, yet now, with this reboot (actually it's a reimaging) trundled off of the Sony production line, there are plenty of \"fans\" coming forward to say they never rated Raimi's films! Magurie was this, Dunst was that, Raimi missed the beat of the comic version of Spidey and etc and etc. Well I'm sorry, but I just don't remember any fall out apart from the near unanimously agreed upon over stuffing of Raimi's part 3. Perhaps I just didn't go on the right Spider-Man forums? But even then it's hard to argue with a box office take of $2.5 billion, those figures have to be made up of a good proportion of Spidey fans, surely? You would reasonably think. \r\n\r\nI mention it because The Amazing Spider-Man has met with reviews from each end of the scale. Those at the high end who support the \"reimaging\" seem to focus on it being close to the real Spidey universe they wanted, with great casting, better effects work and a origin story of worth. At the other end is the arguments that \"reimaging\" a film that is only ten years old is daft, especially since it actually doesn't bring the promised new direction or origin story of worth. In fact it just juggles bits of the Raimi trilogy and plays it out with other Spider-Man characters instead. While Garfield is hardly an improvement since he's way too old for high school as well! The truth is that Webb's movie falls somewhere in between both sides of the argument, and that's not just me being Switzerland and staying neutral! \r\n\r\nNegatively it plays out as a compromised production and not the film that the makers initially set out to make, there are too many dangling threads and haphazard edits that leave narrative gaps. An Important character disappears off the radar, other characters are given limited time to breathe, and crucial plot points are arrived at with stupendous leaps of logic. A coda spliced into the end credits tries to entice us for the sequel, suggesting that the quick wipe over the origin \"origin\" story was deliberate, it's unlikely, and feels like an afterthought. For a film that purports to be putting its own stamp on the Spidey universe, it quite often makes you think of Raimi's films anyway. It may be The Lizard instead of Green Goblin and Gwen instead of MJ, but the emotional and psychological beats are still the same. Reboot? My arse. Oh and Horner, who I'm normally a fan of, has turned in a score that lacks vim and vigour, it aspires to be full of swirling superhero fervour to raise the goose flesh on your arms, but instead it's just goose, and not a decently cooked one at that. \r\n\r\nHowever, on the positive side of things, low expectation really helped me to enjoy the film, and I even watched it a second time to check over some initial reactions I had. There is still a lot to enjoy here. Acting is of a high standard (Ifans' performance as Curt Connors gets better on repeat viewings), with good chemistry generated between Stone and Garfield, the effects work is (obviously) better ten years on; something which gives us a better-more acrobatic-moving Spider-Man, while the whole make-up of Parker as a geek who becomes cocky, even arrogant, really adds a kick to the first half of the movie's coming-of-age narrative bent. It's also good that with a running time of over two hours the makers have the time to expand Peter as a character, making the audience wait with expectation of his life changing date with the spider. As for the villain, it's true enough to say that The Lizard is hardly an inspiring choice, but it does fit in with the whole origin story plan that Webb and his team want to tell. Though it should be noted that those seeking wall to wall fights between Spidey and The Liz are going to go a little hungry. \r\n\r\nIt's big on human story and not the lazy cash in movie it could have been, and undeniably it's fun, but the holes, dangling threads and logic leaps stop it breaking out to achieve its intentions. Looking forward to the sequel, mind 7/10", "created_at": "2019-06-25T22:51:01.261Z"}, {"movie_id": 1930, "review_id": "624216a99451e700498326e0", "author_rating": 7.0, "review_text": "I enjoyed this. One of the great advantages of the whole \"Spiderman\" concept is that it can be reinvented time and time again without really compromising the original character - a decent but lonely young man trying to make his way in the world and to get his girl. Like Tobey Maguire before him, the casting of the largely unknown Andrew Garfield works well - it allows a whole new generation of fans to follow their hero. The fact that he is cute in tights doesn't do him any harm either. Emma Stone is quite good, too, as the object of his affections \"Mary Jane\" and the whole look of the film is sophisticated and colourful. The story is very derivative, however - and that is the problem with this film. Though there is plenty of action, it becomes a little repetitive and uninspired. The CGI will always look good, and will increasingly do most of the work with these kind of films - indeed, just about everything in the Marvel Universe is 90% style over substance; but so long as they can still recruit enthusiastic actors to play the roles than the franchise might still have legs (though hopefully not eight) for the future. Martin Sheen and Sally Field add a little gravitas to the proceedings - the former has one of these wonderful Churchillian style voices that just goes on resonating, and Rhys Ifans makes for an OK mad scientist. As a stand alone adventure this works fine. Maybe a bit too long, but a cinema experience to be relished - then, maybe, just put away again for seven years.", "created_at": "2022-03-28T20:12:25.665Z"}, {"movie_id": 1930, "review_id": "5192715d19c2950a16225394", "author_rating": 5.5, "review_text": "“The Amazing Spider-Man” has no reason to exist. Spider-man is a hero everyone knows. He´s been around for so long everyone is familiar with his origin, comic fan or not. Its basic pop culture. Then you have the Sam Raimi´s movies. Everyone saw them. They made loads of money and they´re always on tv. They are entertaining movies. “Spider-Man” gave us a good origin story in 2002. This movie simply wasn't needed. \r\nNow I gave it the benefit of the doubt. There´s Burton´s Batman and Nolan´s. Maybe this was a different Spider-Man. A more “dark” vision perhaps! Maybe the movie spent a few minutes on the origin and then wisely moved on with its story. Maybe... well maybe it wasn't just another rehash. A shameless attempt to remake, or how they say it these days, reboot the same idea with minimal changes except the cast. I was naive.\r\nThe whole movie is about Spider-Man´s origin. They traded Mary Jane for another love interest and held off on “The Green Goblin” because that would be too much “rubbing it in the face” for the fans, I guess. We get Gwen Stacy and “The Lizard”. The rest is same old, same old. The same uncle Ben plot, the same scenes about making the suit, learning how to control powers, the search for the criminal Spider-man lets get away with horrific results. Same thing. Except everything is done without a spark of energy or creativity. Raimi´s movies were energetic, flowing with excitement. They were “new”. Seeing Spider-Man on the big screen,  webbing all over the city, fighting “The Green Goblin”, it was amazing. We didn't have “The Avengers” back there, or “Iron Man”. This was like a dream come true for comic fans. \r\n“The Amazing Spider-Man” smells of old cheese. \r\nI tried to take the movie for what it was but it was impossible. My mind would not let me. I knew what was going to happen next. I knew all the plots! I´d seen it all before! \r\nBut even ignoring that the movie just does not work. Its slow, turgid with an unlikable Peter Parker and a CGI lizard for a villain. Parker is a whiny, self centered idiot. His relationship with aunt May and uncle Ben is never fully explored and what little there is consists of Parker being a rude jerk for no reason at all. \r\nThe movie has one thing going for it. The cast. Sally Field and Martin Sheen are great with what little material they have. Emma Stone is sexy and sweet which is “her thing” and again she pulls it off brilliantly.  Rhys Ifans is decent as Curt Connors and surprisingly enough I loved Andrew Garfield as Spidey. Yes, seriously! He looks perfect for the part and he did his best with the horrible script. He´s charismatic and brought his own touch to the role instead of copying Toby Maguire. If the movie is even slightly original its because of him. \r\nSome of the action in the last third of the movie is also spectacular. Spider-man´s movements when fighting are really well done as is the web-slinging. The action is well directed and exciting and the movie sets up a sequel rather nicely. \r\nBut its asking a lot to go over the material everyone knows for two hours for a few minutes of cool action. The movie plays it so safe it hurts. Its competent but never brilliant. Tedious but far too long with little spots of action but few and far between. \r\nI hope in the sequel this “Spider-Man” can find its own style and its own place. Given space to grow and evolve, on the strength of the character and Garfield´s acting this could be the weak start to a new amazing super-hero trilogy. \r\nThen again, maybe i´m just naive.", "created_at": "2013-05-14T17:16:13.321Z"}, {"movie_id": 1930, "review_id": "5a71f1cd9251417f1600a830", "author_rating": 6.0, "review_text": "This is the fourth spider man movie although it is not the fourth sequel but rather one of these reboots which seems to be so popular today. I found the movie to be quite enjoyable but at the same time a bit of a let-down.\r\n\r\nIn some ways it is better than the previous trilogy by Sam Raimi (well it is not very hard to make something that is better than the 2nd installment in that trilogy of course). The film is darker, more serious and Spider Man is not so silly and a total mess-up when out of his costume as the character portrayed by Toby Maquire.\r\n\r\nHowever, this movie has its own faults which makes me have to think hard whether it is really that much of an improvement over the previous movie and this is what makes me feel a bit let-down since I had hope that this reboot would be that “real” Spider Man movie that enabled me to forget about the previous ones.\r\n\r\nA lot of not so interesting scenes are really dragged out and the important stuff is rushed. Peter Parker’s transition to Spider Man after his bitten is over and done with quite quickly. In another scene he spends 5 minutes trying to talk some kid out of a car. He even takes off his mask and gives it to him (what the f…) and in the end just zips him out with a net shot. He could have done that right away and spared us the boring time.\r\n\r\nGenerally I think this movie is indeed a better Spider Man movie than the previous ones though and I quite enjoyed the movie evening yesterday, just not as much as I hoped.", "created_at": "2018-01-31T16:41:49.413Z"}, {"movie_id": 1930, "review_id": "5d12a5550e0a267dceca3083", "author_rating": 7.0, "review_text": "Webb's Spider-Man, Spider-Man, does what ever a Spider can.\r\n\r\nThe Amazing Spider-Man is directed by Marc Webb and collectively written by James Vanderbilt, Alvin Sargent and Steve Kloves. It stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Martin Sheen and Sally Field. Music is by James Horner and cinematography by John Schwartzman. \r\n\r\nPeter Parker (Garfield) was orphaned as a boy when his parents were killed in a plane crash, raised by his Uncle Ben (Sheen) and Aunt May (Field), he is a clever lad but something of an outcast at high school. While investigating the disappearance of his parents and sporting a crush on class mate Gwen Stacy (Stone), Peter's life is tipped upside down when he is bitten by a radioactive spider that gives him abnormal powers. \r\n\r\nWhile the Spider-Man franchise doesn't (thankfully) come packaged with the kind of bizarre mania that comes with Batman, the acolytes are a tough bunch to figure out. Sam Raimi's trilogy garnered close towards $2.5 billion worldwide, yet now, with this reboot (actually it's a reimaging) trundled off of the Sony production line, there are plenty of \"fans\" coming forward to say they never rated Raimi's films! Magurie was this, Dunst was that, Raimi missed the beat of the comic version of Spidey and etc and etc. Well I'm sorry, but I just don't remember any fall out apart from the near unanimously agreed upon over stuffing of Raimi's part 3. Perhaps I just didn't go on the right Spider-Man forums? But even then it's hard to argue with a box office take of $2.5 billion, those figures have to be made up of a good proportion of Spidey fans, surely? You would reasonably think. \r\n\r\nI mention it because The Amazing Spider-Man has met with reviews from each end of the scale. Those at the high end who support the \"reimaging\" seem to focus on it being close to the real Spidey universe they wanted, with great casting, better effects work and a origin story of worth. At the other end is the arguments that \"reimaging\" a film that is only ten years old is daft, especially since it actually doesn't bring the promised new direction or origin story of worth. In fact it just juggles bits of the Raimi trilogy and plays it out with other Spider-Man characters instead. While Garfield is hardly an improvement since he's way too old for high school as well! The truth is that Webb's movie falls somewhere in between both sides of the argument, and that's not just me being Switzerland and staying neutral! \r\n\r\nNegatively it plays out as a compromised production and not the film that the makers initially set out to make, there are too many dangling threads and haphazard edits that leave narrative gaps. An Important character disappears off the radar, other characters are given limited time to breathe, and crucial plot points are arrived at with stupendous leaps of logic. A coda spliced into the end credits tries to entice us for the sequel, suggesting that the quick wipe over the origin \"origin\" story was deliberate, it's unlikely, and feels like an afterthought. For a film that purports to be putting its own stamp on the Spidey universe, it quite often makes you think of Raimi's films anyway. It may be The Lizard instead of Green Goblin and Gwen instead of MJ, but the emotional and psychological beats are still the same. Reboot? My arse. Oh and Horner, who I'm normally a fan of, has turned in a score that lacks vim and vigour, it aspires to be full of swirling superhero fervour to raise the goose flesh on your arms, but instead it's just goose, and not a decently cooked one at that. \r\n\r\nHowever, on the positive side of things, low expectation really helped me to enjoy the film, and I even watched it a second time to check over some initial reactions I had. There is still a lot to enjoy here. Acting is of a high standard (Ifans' performance as Curt Connors gets better on repeat viewings), with good chemistry generated between Stone and Garfield, the effects work is (obviously) better ten years on; something which gives us a better-more acrobatic-moving Spider-Man, while the whole make-up of Parker as a geek who becomes cocky, even arrogant, really adds a kick to the first half of the movie's coming-of-age narrative bent. It's also good that with a running time of over two hours the makers have the time to expand Peter as a character, making the audience wait with expectation of his life changing date with the spider. As for the villain, it's true enough to say that The Lizard is hardly an inspiring choice, but it does fit in with the whole origin story plan that Webb and his team want to tell. Though it should be noted that those seeking wall to wall fights between Spidey and The Liz are going to go a little hungry. \r\n\r\nIt's big on human story and not the lazy cash in movie it could have been, and undeniably it's fun, but the holes, dangling threads and logic leaps stop it breaking out to achieve its intentions. Looking forward to the sequel, mind 7/10", "created_at": "2019-06-25T22:51:01.261Z"}, {"movie_id": 1930, "review_id": "624216a99451e700498326e0", "author_rating": 7.0, "review_text": "I enjoyed this. One of the great advantages of the whole \"Spiderman\" concept is that it can be reinvented time and time again without really compromising the original character - a decent but lonely young man trying to make his way in the world and to get his girl. Like Tobey Maguire before him, the casting of the largely unknown Andrew Garfield works well - it allows a whole new generation of fans to follow their hero. The fact that he is cute in tights doesn't do him any harm either. Emma Stone is quite good, too, as the object of his affections \"Mary Jane\" and the whole look of the film is sophisticated and colourful. The story is very derivative, however - and that is the problem with this film. Though there is plenty of action, it becomes a little repetitive and uninspired. The CGI will always look good, and will increasingly do most of the work with these kind of films - indeed, just about everything in the Marvel Universe is 90% style over substance; but so long as they can still recruit enthusiastic actors to play the roles than the franchise might still have legs (though hopefully not eight) for the future. Martin Sheen and Sally Field add a little gravitas to the proceedings - the former has one of these wonderful Churchillian style voices that just goes on resonating, and Rhys Ifans makes for an OK mad scientist. As a stand alone adventure this works fine. Maybe a bit too long, but a cinema experience to be relished - then, maybe, just put away again for seven years.", "created_at": "2022-03-28T20:12:25.665Z"}]