[{"movie_id": 60935, "review_id": "5d929a9fc0348b002c3f6f73", "author_rating": 7.0, "review_text": "Hvem går det?\r\n\r\nThe Thing is directed by Matthijs van Heijningen Jr. and adapted to screenplay by Eric Heisserer. It's based on the novel \"Who Goes There?\" by John W. Campbell and is a prequel to \"John Carpenter's The Thing\" from 1982. It stars Mary Elizabeth Winstead, Joel Edgerton, Ulrich Thomsen, Eric Christian Olsen and Adewale Akinnuoye-Agbaje. Music is by Marco Beltrami and cinematography by Michel Abramowicz.\r\n\r\nAntartica, 1982, and scientist Kate Lloyd is requested to investigate something strange at a Norwegian base station. By accident the Norwegians have discovered what appears to be an alien craft frozen beneath the ice. Their thoughts prove to be correct and they are rightly celebrating a magnificent discovery, particularly as there appears to also be a frozen being in the ice. But it's not long before everyone at the base begins to regret unearthing the being...\r\n\r\nNo serious John Carpenter fan wanted this film, it wasn't needed or required. His 1982 film is an awesome slice of sci-fi horror, a remake itself of a very good film, \"The Thing from Another World\" (Howard Hawks 1951), Carpenter flipped the scenario around from Hawks' movie to great effect. Paranoia and creeping dread blended with amazing beasties to make for what many feel is one of the ultimate sci-fi horror movies going. So why remake it then? Well, we are told by Heijningen Jr and his team that this is a prequel to Carpenter's movie, asking the big questions such as just what happened at the Norwegian base station before Kurt Russell's manly mob got there? Making this a sort of filling in the blanks session. Not a bad idea at all is that, something good to work from, even if we know from the beginning of Carpenter's movie just how many Norwegian's survived!\r\n\r\nNow the problem here is that it may be a prequel, and attention to detail in scenes linking both films together is rather ace, but it's devoid of freshness, the makers pretty much following the exact same formula of Carpenter's film. Cue a group of scientist types getting spooked by something ghastly stalking them, cue one by one them getting offed in grizzly ways by an assimilating menace and cue paranoia and suspicion. They even put in the test sequence from 82, only with a metal slant instead of blood, while the creatures are the same only bigger in body horror terms and budget. Instead of Kurt Russell's mighty machismo, we get Winstead's spunky lady (she's the one without the face fuzz here), but it's the same old same old routine, only for the \"Scott Pilgrim\" crowd. When all is said and done, this is pretty much a remake of a far far better film.\r\n\r\nYet for all that is annoying and unadventurous about it, it's still a bunch of fun, the director is capable in having us wonder what is around the corner, utilising the cramped interiors for maximum fret. The various creatures born out of the Thing itself are monstrous, especially the two headed one which we see horrifically birthed, and even though the CGI is there, with some of it poor, much of it is blended with practical work and the human actors to stop it from being \"all\" about the effects. It's also nice to report that there is undeniably love and respect for the 82 cut. Leading cast performances are efficient, but Winstead is just too young and looks out of place, she does not, however, fail for lack of effort to make her thinly written part work. Bonus is the Norwegian actors adding some intense character dynamics to the plotting. Beltrami's score nods appreciatively to Morricone's original, and on Blu-ray Abramowicz's steely coloured photography really pings out of the screen.\r\n\r\nIn an alternative universe where there is no John Carpenter film, this would be a well regarded entry into the creature feature stable. With enough shocks and squirmy screams delivered for the genre eager crowd. But unless you are someone who hasn't seen Carpenter's superior movie, then this will feel like a shallow imitation, just like, ironically enough, one of The Thing's assimilated humans. A generous 7/10 from me because I did have fun watching in the privacy of my own home with the lights off. Other Carpenter fans, though, are most likely to start rating from my 7 and work backwards I feel...", "created_at": "2019-10-01T00:15:27.129Z"}, {"movie_id": 60935, "review_id": "6508acd4394a87013916a365", "author_rating": 7.0, "review_text": "**_More of the same with a female protagonist, but well done_**\r\n\r\nAn American paleontologist (Mary Elizabeth Winstead) is recruited by a doctor and his assistant (Ulrich Thomsen and Eric Christian Olsen) to travel to a Norwegian base in Antarctica to examine a colossal craft buried under the ice and a nearby frozen specimen. They bring the latter into the base; big mistake. \r\n\r\n“The Thing” (2011) is a prequel to the Kurt Russell movie from 29 years prior. The ending fittingly paves the way for the 1982 film, which featured an all-male cast. This one attempts to “fix” that arguable issue with the inclusion of Winstead and another female character, but I wouldn’t look for romantic complications because this flick runs 6 minutes shorter than the ’82 film and so only has time to focus on the life-or-death challenges of the remote station.  \r\n\r\nIt's basically a re-do, just with a female protagonist à la “Alien” & “Aliens.” The laughable torso jaws return, but this shows faithfulness and consistency. The ’82 film is revered by devotees so this movie was never going to measure up in their eyes. However, it’s pretty much on par and I appreciate the presence of Winstead, plus it does do something different in the last act that I’m not going to give away. \r\n\r\nThe film runs 1 hour, 43 minutes, and was shot at Pinewood Toronto Studios near the shore in Port Lands, as well as nearby Stouffville and the Canadian Forces Base in Trenton, the latter of which is a 2-hour drive east of Toronto. Exteriors were shot in British Columbia.\r\n\r\nGRADE: B", "created_at": "2023-09-18T20:02:28.828Z"}]