[{"movie_id": 346910, "review_id": "5b9d9aa40e0a2675650093ff", "author_rating": 4.0, "review_text": "A complete waste of opportunity.  The film smacks of studio interference and bad decisions.  It starts off decent enough but at the halfway point it turns into a shambles and it does feel as if a lot of it ended up on the cutting room floor.  The music was very intrusive and some scenes were so badly lit you had no idea who was just killed or even what killed them.\r\n\r\nSome knowing nods to the earlier Predator films was a nice touch and it was good they didn't skimp on the gore and violence but all in all it's a bad movie.  Stick to Predator and Predators.", "created_at": "2018-09-15T23:49:56.555Z"}, {"movie_id": 346910, "review_id": "5ba3bf77c3a3683398020486", "author_rating": 5.0, "review_text": "My mind was racing as I watched _The Predator_ in the cinema tonight. I'd heard virtually nothing good about it so my anxious brain kicked into overdrive the whole time the film was going on. As a result of that, I almost feel like I experienced three movies in that theatre. First, obviously the movie on the screen. Secondly, the awesome movie I was theorising could unfurl at the result of each new sequence and plot point, but that sadly never did. And thirdly, the inexcusably awful and franchise-ruining movie that I feared it was about to take a hard left turn into at any minute, and thankfully never did.\r\n\r\nAnd that's really my experience on _The Predator_ overall, and the reason for a stalemate \"2.5 outta 5\" review: It wasn't as good as it should have been, it wasn't as bad as it could have been. Unfortunately, when the movie I'm writing in my head alongside watching it is better than what's actually on screen, when you take into account that I'm an unimaginative, talentless hack, really doesn't cut it for a sequel to _Predator_, one of of only five movies I've ever given a perfect rating to.\r\n\r\nThe best parts of _The Predator_ are when there is an eponymous Predator on screen. So you might think, \"Oh it's not a good movie, but it's a good _Predator_ movie\", and fair enough a conclusion to draw, but no. Part of the problem is, this movie really could have been pulled off with any aliens at all. Take out the Yautja and replace them with... I dunno, the blue skinned pogo-stick people of Planet Hurfadump, and it can still play out functionally the same. See, although I enjoyed watching the Predators do their thing, there was really nothing beyond cosmetic similarities that made them the Predators we've seen in every movie preceding this one.\r\n\r\nI think possibly part of the reason for that is that every other movie with a Predator in it has been an Action Horror movie (albeit Action Horror with ever-increasing Sci-Fi elements from film to film) whereas _The Predator_ is an Action Comedy, just one with some gore. Now I don't think that taking it that route was necessarily and... abysmal failure, let's say, but was Action Comedy the **best** way to take the _Predator_ franchise? I think it's pretty clear that the answer is no.\r\n\r\nIronic that that direction is being taken by Shane Black, the man who has a history with _Predator_ purely because the crew of the first film were determined to have him to work on the script, which he refused. Now here we are more 30 years later and Shane Black finally **has** put his name on a Predator movie, and it's not even good.\r\n\r\nFuck. At least it's better than _AvP: Requiem_!", "created_at": "2018-09-20T15:40:39.023Z"}, {"movie_id": 346910, "review_id": "5bfc6bebc3a36861f901dcab", "author_rating": 2.0, "review_text": "I couldn't believe what I was seeing. I was inclined to step out of the theater to check if I was sitting in the right room. But there it was, definitely a Predator, but obviously totally misplaced in a ridiculous movie - ridiculous story, ridiculous characters, ridiculous acting, ridiculous everything.\r\n\r\nI was so upset. One of the diamonds of a movie genre thrown in the dirt and made fun of. If you want to see how that's done, watch this one.\r\n\r\nA total waste of money - on production side and on cinema visitor's side.", "created_at": "2018-11-26T21:55:55.361Z"}, {"movie_id": 346910, "review_id": "5c043e0692514110800b4d29", "author_rating": 4.0, "review_text": "Its just not good.  The first predator created atmosphere; you were being hunted.  The only \"Predator\" film to deliver another dose of this was Predators.  \r\nThis film falls completely short of its predecessors (yes, all of them), but does leave you with a strong impression that this was a cash grab to squeeze any life out of a franchise that surpassed its EOL a long time ago.", "created_at": "2018-12-02T20:18:14.267Z"}, {"movie_id": 346910, "review_id": "5c527fd0c3a368576a98b772", "author_rating": 8.0, "review_text": "OK, I have to disagree with the other reviewers, to date, of this movie.  I totally enjoyed this movie and gave it an 8.  Once you figured it out, I thought the story line made complete sense.  I loved all the new characters, and thought the camaraderie of the main military characters was great and rather realistic.  I don't know about the other reviewers, but I did serve in the U. S. Army and found the character interplay highly realistic.  I am disappointed with the interplay between the \"good guys\" and our government; however, these days you come to expect that.  I don't believe that part would be realistic, but I don't think it distracted that much from the movie, and everyone came together in the end...to, of course, save humanity!  Which, of course, it did otherwise we all wouldn't be here anymore...right?  Good movie!  Go see it and then decide for yourself, but I thought it was definitely worth seeing, so much so I even bought the blu-ray!", "created_at": "2019-01-31T04:55:44.810Z"}, {"movie_id": 346910, "review_id": "5cfadcecc3a3680b4e267496", "author_rating": 4.0, "review_text": "A crushing disappointment.\r\n\r\nThe hopes were high for this latest Predator rebirth, not because Shane Black starred in the great first Predator film, so therefore he surely must care about the project? But because he's an excellent writer and director. Shane Black can count Lethal Weapon(S), The Last Boy Scout and The Long Kiss Goodnight on his CV, he was the man who put Iron Man back on track after the sag of part 2. Plus he is the creator of two of the best buddy buddy neo-noirs this millennium (Kiss Kiss Bang Bang/The Nice Guys), So how come The Predator stinks of lazy cash cow manure?\r\n\r\nPlot in a nutshell sees the universe's most lethal hunters unleashed on Earth due to the meddling of a soldiers kid and some nosey scientist types. The fate of mankind rests with a group of damaged ex-soldiers and a rather cheesed off female scientist.\r\n\r\nWe have a rehash mishmash of what we have seen before in Predator 87 and Predators 2010. A group dynamic fighting a seemingly invincible foe. The subsequent science aspects such as human DNA inference/reasoning etc never really add up to much, serving only for a bunch of standard actors shouting, swearing and spouting hopelessly weak jokes and series re-treads. When you think the pic is about to up a gear, get rivetingly dramatic, a poor slice of humour comes our way either by vocal spillage or visual drivel (puppy pet Predator dog, really?). There's a bunch of plot threads that just dangle never to be pulled (PTSD/our hero's family strife et al), and the Predators loose on Earth - with different agendas - are confusingly shifted about by a screenplay not sure where it wants to land. \r\n\r\nPlus points? Well the cinematography is superb (Larry Fong), and you can't fault this for action quotas, there's plenty of it and it's bloody (both red and green type). The score is the traditional one we had from Alan Silvestri back in the 87 film, in fact it hardly deviates from it and yet Henry Jackman gets the credit. Of course some of the jokes will work for some folk (I would be lying if I said a Whoopi Goldberg gag didn't make me laugh), but the terror has gone, these Predators are no longer scary creatures. This reeks of a troubled production going hand in hand with a cash cow that not only narratively adds up to nothing really, but of a franchise death knell. Shame. 3.5/10", "created_at": "2019-06-07T21:53:48.714Z"}, {"movie_id": 346910, "review_id": "60df78a5344a8e00753d05bf", "author_rating": 8.0, "review_text": "**\"Long story short\"**\r\n\r\nUnlike the clueless reviewer (on a different website) who I quoted in the headline, I will not proceed to write 5 paragraphs of meaningless drivel about a movie I hate.\r\n\r\nUsually all of the AvP movies, Alien, Predator and the cross overs are at least a solid 3.5 stars. Of course the original Alien trilogy as well as Predator 1, 2 and even Predators stand out as being very original. The difference between the originals and the spin-offs is clearly the tone they set. In this movie we get a comic book style presented, with by no means bad CGI (dogs looked more real than in Predators for example), a secret research conspiracy, and charismatic heroes getting slaughtered (or not, no spoilers). Just like in the graphic novels, the pace is neck breaking. The ending felt almost rushed, to introduce the new Predator Killer Weapon. It is understandable how regular movie goers are put off by the constant over-stimulation, but I would not want it any other way. The action is over the top, definitely. But there was great attention to detail how the action scenes played out exactly, as opposed to lesser action films in which a flurry of cuts leaves a thinking audience just confused about what just happened.\r\n\r\nSure, I would have loved a darker vibe throughout the film too, especially in the beginning the score reminded a little of a Disney orchestra playing. But \"The Predator\" was a hell of a ride and deserves a special place among the spin-offs.\r\n\r\n28 November 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:35:49.813Z"}, {"movie_id": 346910, "review_id": "63c202c3e16e5a00afcba5bc", "author_rating": 1.0, "review_text": "Full disclosure, I've only really seen the first two movies, and after that I ignored the franchise. When the 2010 film dropped, it didn't even hit my radar and none of the crossovers with aliens I even bothered with...\r\n\r\n...but by 2010 I was 30 and, honestly, these are rated \"R\" movies that I loved in my childhood. But that was the 80s when parents could take their children to bloody rated R movies and not be arrested for abuse.\r\n\r\nSo, when they started making more, as much as I loved the first one, I really didn't care too much about the series. They lost me at the sequel.\r\n\r\nBut 2018 rolled around and I was feeling nostalgic. I wanted a throw back to a simpler time when people weren't so high strung about everything including the movies. Why not give it a try.\r\n\r\nAnd, I loved Predator as a kid even though it was clearly an adult movie. But you get the feeling that this one was a rated R movie clearly made for children.\r\n\r\nI remember moments of levity in the first few...but I don't recall them being light and, almost whimsical at all. They were serious sci-fi horror films.\r\n\r\nThis comes across as a Marvel movie, and though I love Marvel movies I don't want a Predator movie to feel like The Avengers. It's the Predator, it is supposed to have a different tone.\r\n\r\nIt left me with a bad taste in my mouth. It was too light to be a Predator movie. It wasn't dark. It wasn't scary, and it had too much of an attempt at humor to enjoy.\r\n\r\nIn other words, the movie stank. It couldn't even remember what it was supposed to be.", "created_at": "2023-01-14T01:17:55.781Z"}, {"movie_id": 346910, "review_id": "64418aa5b3f6f505269d846a", "author_rating": 5.0, "review_text": "Boyd Holbrook - a sort of love child of Mel Gibson and Michael Biehn - is the army sniper hero (\"McKenna\") who finds himself on the wrong end of the law after he and his team encounter the eponymous killing machine in the forest. Lucky to escape with his life, and a few souvenirs from the wreckage, he makes his way to a cantina where he posts his trophies to his wife and son before being taken into custody. Out in space, another of these would be visitors decides it needs to get that stuff back and so arrives duly determined to annihilate all who get in it's way. It turns out that the young \"Rory McKenna\" (Jacob Tremblay) is little short of a genius with AI - and pretty soon he, dad and feisty biologist \"Brackett\" (Olivia Munn) - along with a ragtag band of gung-ho prisoner/soldiers are facing up to their looming terror. Can they survive? Should they survive is probably the better question. Aside from a few scenes at the start and an admittedly lively fifteen minutes at the end, this is almost entirely devoid of the beastie we switched on to see. The dialogue is poorly written, expletive-ridden and banal; the characterisations are really shallow and there are far too many irrelevant sub-plots to distract from the (limited) focus of this 110 minute ramble of a film. The old adage - \"if it ain't broke...\" comes to mind. This is as far removed from the excellent 1987 introduction to this monstrous creature as it's possible to get and is, quite simply, a waste of video tape. There are plenty of adequate visual effects and pyrotechnics, but this film definitely had me rooting for the creature in the mask pretty much from the start!", "created_at": "2023-04-20T18:55:33.243Z"}, {"movie_id": 346910, "review_id": "5b9d9aa40e0a2675650093ff", "author_rating": 4.0, "review_text": "A complete waste of opportunity.  The film smacks of studio interference and bad decisions.  It starts off decent enough but at the halfway point it turns into a shambles and it does feel as if a lot of it ended up on the cutting room floor.  The music was very intrusive and some scenes were so badly lit you had no idea who was just killed or even what killed them.\r\n\r\nSome knowing nods to the earlier Predator films was a nice touch and it was good they didn't skimp on the gore and violence but all in all it's a bad movie.  Stick to Predator and Predators.", "created_at": "2018-09-15T23:49:56.555Z"}, {"movie_id": 346910, "review_id": "5ba3bf77c3a3683398020486", "author_rating": 5.0, "review_text": "My mind was racing as I watched _The Predator_ in the cinema tonight. I'd heard virtually nothing good about it so my anxious brain kicked into overdrive the whole time the film was going on. As a result of that, I almost feel like I experienced three movies in that theatre. First, obviously the movie on the screen. Secondly, the awesome movie I was theorising could unfurl at the result of each new sequence and plot point, but that sadly never did. And thirdly, the inexcusably awful and franchise-ruining movie that I feared it was about to take a hard left turn into at any minute, and thankfully never did.\r\n\r\nAnd that's really my experience on _The Predator_ overall, and the reason for a stalemate \"2.5 outta 5\" review: It wasn't as good as it should have been, it wasn't as bad as it could have been. Unfortunately, when the movie I'm writing in my head alongside watching it is better than what's actually on screen, when you take into account that I'm an unimaginative, talentless hack, really doesn't cut it for a sequel to _Predator_, one of of only five movies I've ever given a perfect rating to.\r\n\r\nThe best parts of _The Predator_ are when there is an eponymous Predator on screen. So you might think, \"Oh it's not a good movie, but it's a good _Predator_ movie\", and fair enough a conclusion to draw, but no. Part of the problem is, this movie really could have been pulled off with any aliens at all. Take out the Yautja and replace them with... I dunno, the blue skinned pogo-stick people of Planet Hurfadump, and it can still play out functionally the same. See, although I enjoyed watching the Predators do their thing, there was really nothing beyond cosmetic similarities that made them the Predators we've seen in every movie preceding this one.\r\n\r\nI think possibly part of the reason for that is that every other movie with a Predator in it has been an Action Horror movie (albeit Action Horror with ever-increasing Sci-Fi elements from film to film) whereas _The Predator_ is an Action Comedy, just one with some gore. Now I don't think that taking it that route was necessarily and... abysmal failure, let's say, but was Action Comedy the **best** way to take the _Predator_ franchise? I think it's pretty clear that the answer is no.\r\n\r\nIronic that that direction is being taken by Shane Black, the man who has a history with _Predator_ purely because the crew of the first film were determined to have him to work on the script, which he refused. Now here we are more 30 years later and Shane Black finally **has** put his name on a Predator movie, and it's not even good.\r\n\r\nFuck. At least it's better than _AvP: Requiem_!", "created_at": "2018-09-20T15:40:39.023Z"}, {"movie_id": 346910, "review_id": "5bfc6bebc3a36861f901dcab", "author_rating": 2.0, "review_text": "I couldn't believe what I was seeing. I was inclined to step out of the theater to check if I was sitting in the right room. But there it was, definitely a Predator, but obviously totally misplaced in a ridiculous movie - ridiculous story, ridiculous characters, ridiculous acting, ridiculous everything.\r\n\r\nI was so upset. One of the diamonds of a movie genre thrown in the dirt and made fun of. If you want to see how that's done, watch this one.\r\n\r\nA total waste of money - on production side and on cinema visitor's side.", "created_at": "2018-11-26T21:55:55.361Z"}, {"movie_id": 346910, "review_id": "5c043e0692514110800b4d29", "author_rating": 4.0, "review_text": "Its just not good.  The first predator created atmosphere; you were being hunted.  The only \"Predator\" film to deliver another dose of this was Predators.  \r\nThis film falls completely short of its predecessors (yes, all of them), but does leave you with a strong impression that this was a cash grab to squeeze any life out of a franchise that surpassed its EOL a long time ago.", "created_at": "2018-12-02T20:18:14.267Z"}, {"movie_id": 346910, "review_id": "5c527fd0c3a368576a98b772", "author_rating": 8.0, "review_text": "OK, I have to disagree with the other reviewers, to date, of this movie.  I totally enjoyed this movie and gave it an 8.  Once you figured it out, I thought the story line made complete sense.  I loved all the new characters, and thought the camaraderie of the main military characters was great and rather realistic.  I don't know about the other reviewers, but I did serve in the U. S. Army and found the character interplay highly realistic.  I am disappointed with the interplay between the \"good guys\" and our government; however, these days you come to expect that.  I don't believe that part would be realistic, but I don't think it distracted that much from the movie, and everyone came together in the end...to, of course, save humanity!  Which, of course, it did otherwise we all wouldn't be here anymore...right?  Good movie!  Go see it and then decide for yourself, but I thought it was definitely worth seeing, so much so I even bought the blu-ray!", "created_at": "2019-01-31T04:55:44.810Z"}, {"movie_id": 346910, "review_id": "5cfadcecc3a3680b4e267496", "author_rating": 4.0, "review_text": "A crushing disappointment.\r\n\r\nThe hopes were high for this latest Predator rebirth, not because Shane Black starred in the great first Predator film, so therefore he surely must care about the project? But because he's an excellent writer and director. Shane Black can count Lethal Weapon(S), The Last Boy Scout and The Long Kiss Goodnight on his CV, he was the man who put Iron Man back on track after the sag of part 2. Plus he is the creator of two of the best buddy buddy neo-noirs this millennium (Kiss Kiss Bang Bang/The Nice Guys), So how come The Predator stinks of lazy cash cow manure?\r\n\r\nPlot in a nutshell sees the universe's most lethal hunters unleashed on Earth due to the meddling of a soldiers kid and some nosey scientist types. The fate of mankind rests with a group of damaged ex-soldiers and a rather cheesed off female scientist.\r\n\r\nWe have a rehash mishmash of what we have seen before in Predator 87 and Predators 2010. A group dynamic fighting a seemingly invincible foe. The subsequent science aspects such as human DNA inference/reasoning etc never really add up to much, serving only for a bunch of standard actors shouting, swearing and spouting hopelessly weak jokes and series re-treads. When you think the pic is about to up a gear, get rivetingly dramatic, a poor slice of humour comes our way either by vocal spillage or visual drivel (puppy pet Predator dog, really?). There's a bunch of plot threads that just dangle never to be pulled (PTSD/our hero's family strife et al), and the Predators loose on Earth - with different agendas - are confusingly shifted about by a screenplay not sure where it wants to land. \r\n\r\nPlus points? Well the cinematography is superb (Larry Fong), and you can't fault this for action quotas, there's plenty of it and it's bloody (both red and green type). The score is the traditional one we had from Alan Silvestri back in the 87 film, in fact it hardly deviates from it and yet Henry Jackman gets the credit. Of course some of the jokes will work for some folk (I would be lying if I said a Whoopi Goldberg gag didn't make me laugh), but the terror has gone, these Predators are no longer scary creatures. This reeks of a troubled production going hand in hand with a cash cow that not only narratively adds up to nothing really, but of a franchise death knell. Shame. 3.5/10", "created_at": "2019-06-07T21:53:48.714Z"}, {"movie_id": 346910, "review_id": "60df78a5344a8e00753d05bf", "author_rating": 8.0, "review_text": "**\"Long story short\"**\r\n\r\nUnlike the clueless reviewer (on a different website) who I quoted in the headline, I will not proceed to write 5 paragraphs of meaningless drivel about a movie I hate.\r\n\r\nUsually all of the AvP movies, Alien, Predator and the cross overs are at least a solid 3.5 stars. Of course the original Alien trilogy as well as Predator 1, 2 and even Predators stand out as being very original. The difference between the originals and the spin-offs is clearly the tone they set. In this movie we get a comic book style presented, with by no means bad CGI (dogs looked more real than in Predators for example), a secret research conspiracy, and charismatic heroes getting slaughtered (or not, no spoilers). Just like in the graphic novels, the pace is neck breaking. The ending felt almost rushed, to introduce the new Predator Killer Weapon. It is understandable how regular movie goers are put off by the constant over-stimulation, but I would not want it any other way. The action is over the top, definitely. But there was great attention to detail how the action scenes played out exactly, as opposed to lesser action films in which a flurry of cuts leaves a thinking audience just confused about what just happened.\r\n\r\nSure, I would have loved a darker vibe throughout the film too, especially in the beginning the score reminded a little of a Disney orchestra playing. But \"The Predator\" was a hell of a ride and deserves a special place among the spin-offs.\r\n\r\n28 November 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:35:49.813Z"}, {"movie_id": 346910, "review_id": "63c202c3e16e5a00afcba5bc", "author_rating": 1.0, "review_text": "Full disclosure, I've only really seen the first two movies, and after that I ignored the franchise. When the 2010 film dropped, it didn't even hit my radar and none of the crossovers with aliens I even bothered with...\r\n\r\n...but by 2010 I was 30 and, honestly, these are rated \"R\" movies that I loved in my childhood. But that was the 80s when parents could take their children to bloody rated R movies and not be arrested for abuse.\r\n\r\nSo, when they started making more, as much as I loved the first one, I really didn't care too much about the series. They lost me at the sequel.\r\n\r\nBut 2018 rolled around and I was feeling nostalgic. I wanted a throw back to a simpler time when people weren't so high strung about everything including the movies. Why not give it a try.\r\n\r\nAnd, I loved Predator as a kid even though it was clearly an adult movie. But you get the feeling that this one was a rated R movie clearly made for children.\r\n\r\nI remember moments of levity in the first few...but I don't recall them being light and, almost whimsical at all. They were serious sci-fi horror films.\r\n\r\nThis comes across as a Marvel movie, and though I love Marvel movies I don't want a Predator movie to feel like The Avengers. It's the Predator, it is supposed to have a different tone.\r\n\r\nIt left me with a bad taste in my mouth. It was too light to be a Predator movie. It wasn't dark. It wasn't scary, and it had too much of an attempt at humor to enjoy.\r\n\r\nIn other words, the movie stank. It couldn't even remember what it was supposed to be.", "created_at": "2023-01-14T01:17:55.781Z"}, {"movie_id": 346910, "review_id": "64418aa5b3f6f505269d846a", "author_rating": 5.0, "review_text": "Boyd Holbrook - a sort of love child of Mel Gibson and Michael Biehn - is the army sniper hero (\"McKenna\") who finds himself on the wrong end of the law after he and his team encounter the eponymous killing machine in the forest. Lucky to escape with his life, and a few souvenirs from the wreckage, he makes his way to a cantina where he posts his trophies to his wife and son before being taken into custody. Out in space, another of these would be visitors decides it needs to get that stuff back and so arrives duly determined to annihilate all who get in it's way. It turns out that the young \"Rory McKenna\" (Jacob Tremblay) is little short of a genius with AI - and pretty soon he, dad and feisty biologist \"Brackett\" (Olivia Munn) - along with a ragtag band of gung-ho prisoner/soldiers are facing up to their looming terror. Can they survive? Should they survive is probably the better question. Aside from a few scenes at the start and an admittedly lively fifteen minutes at the end, this is almost entirely devoid of the beastie we switched on to see. The dialogue is poorly written, expletive-ridden and banal; the characterisations are really shallow and there are far too many irrelevant sub-plots to distract from the (limited) focus of this 110 minute ramble of a film. The old adage - \"if it ain't broke...\" comes to mind. This is as far removed from the excellent 1987 introduction to this monstrous creature as it's possible to get and is, quite simply, a waste of video tape. There are plenty of adequate visual effects and pyrotechnics, but this film definitely had me rooting for the creature in the mask pretty much from the start!", "created_at": "2023-04-20T18:55:33.243Z"}, {"movie_id": 346910, "review_id": "5b9d9aa40e0a2675650093ff", "author_rating": 4.0, "review_text": "A complete waste of opportunity.  The film smacks of studio interference and bad decisions.  It starts off decent enough but at the halfway point it turns into a shambles and it does feel as if a lot of it ended up on the cutting room floor.  The music was very intrusive and some scenes were so badly lit you had no idea who was just killed or even what killed them.\r\n\r\nSome knowing nods to the earlier Predator films was a nice touch and it was good they didn't skimp on the gore and violence but all in all it's a bad movie.  Stick to Predator and Predators.", "created_at": "2018-09-15T23:49:56.555Z"}, {"movie_id": 346910, "review_id": "5ba3bf77c3a3683398020486", "author_rating": 5.0, "review_text": "My mind was racing as I watched _The Predator_ in the cinema tonight. I'd heard virtually nothing good about it so my anxious brain kicked into overdrive the whole time the film was going on. As a result of that, I almost feel like I experienced three movies in that theatre. First, obviously the movie on the screen. Secondly, the awesome movie I was theorising could unfurl at the result of each new sequence and plot point, but that sadly never did. And thirdly, the inexcusably awful and franchise-ruining movie that I feared it was about to take a hard left turn into at any minute, and thankfully never did.\r\n\r\nAnd that's really my experience on _The Predator_ overall, and the reason for a stalemate \"2.5 outta 5\" review: It wasn't as good as it should have been, it wasn't as bad as it could have been. Unfortunately, when the movie I'm writing in my head alongside watching it is better than what's actually on screen, when you take into account that I'm an unimaginative, talentless hack, really doesn't cut it for a sequel to _Predator_, one of of only five movies I've ever given a perfect rating to.\r\n\r\nThe best parts of _The Predator_ are when there is an eponymous Predator on screen. So you might think, \"Oh it's not a good movie, but it's a good _Predator_ movie\", and fair enough a conclusion to draw, but no. Part of the problem is, this movie really could have been pulled off with any aliens at all. Take out the Yautja and replace them with... I dunno, the blue skinned pogo-stick people of Planet Hurfadump, and it can still play out functionally the same. See, although I enjoyed watching the Predators do their thing, there was really nothing beyond cosmetic similarities that made them the Predators we've seen in every movie preceding this one.\r\n\r\nI think possibly part of the reason for that is that every other movie with a Predator in it has been an Action Horror movie (albeit Action Horror with ever-increasing Sci-Fi elements from film to film) whereas _The Predator_ is an Action Comedy, just one with some gore. Now I don't think that taking it that route was necessarily and... abysmal failure, let's say, but was Action Comedy the **best** way to take the _Predator_ franchise? I think it's pretty clear that the answer is no.\r\n\r\nIronic that that direction is being taken by Shane Black, the man who has a history with _Predator_ purely because the crew of the first film were determined to have him to work on the script, which he refused. Now here we are more 30 years later and Shane Black finally **has** put his name on a Predator movie, and it's not even good.\r\n\r\nFuck. At least it's better than _AvP: Requiem_!", "created_at": "2018-09-20T15:40:39.023Z"}, {"movie_id": 346910, "review_id": "5bfc6bebc3a36861f901dcab", "author_rating": 2.0, "review_text": "I couldn't believe what I was seeing. I was inclined to step out of the theater to check if I was sitting in the right room. But there it was, definitely a Predator, but obviously totally misplaced in a ridiculous movie - ridiculous story, ridiculous characters, ridiculous acting, ridiculous everything.\r\n\r\nI was so upset. One of the diamonds of a movie genre thrown in the dirt and made fun of. If you want to see how that's done, watch this one.\r\n\r\nA total waste of money - on production side and on cinema visitor's side.", "created_at": "2018-11-26T21:55:55.361Z"}, {"movie_id": 346910, "review_id": "5c043e0692514110800b4d29", "author_rating": 4.0, "review_text": "Its just not good.  The first predator created atmosphere; you were being hunted.  The only \"Predator\" film to deliver another dose of this was Predators.  \r\nThis film falls completely short of its predecessors (yes, all of them), but does leave you with a strong impression that this was a cash grab to squeeze any life out of a franchise that surpassed its EOL a long time ago.", "created_at": "2018-12-02T20:18:14.267Z"}, {"movie_id": 346910, "review_id": "5c527fd0c3a368576a98b772", "author_rating": 8.0, "review_text": "OK, I have to disagree with the other reviewers, to date, of this movie.  I totally enjoyed this movie and gave it an 8.  Once you figured it out, I thought the story line made complete sense.  I loved all the new characters, and thought the camaraderie of the main military characters was great and rather realistic.  I don't know about the other reviewers, but I did serve in the U. S. Army and found the character interplay highly realistic.  I am disappointed with the interplay between the \"good guys\" and our government; however, these days you come to expect that.  I don't believe that part would be realistic, but I don't think it distracted that much from the movie, and everyone came together in the end...to, of course, save humanity!  Which, of course, it did otherwise we all wouldn't be here anymore...right?  Good movie!  Go see it and then decide for yourself, but I thought it was definitely worth seeing, so much so I even bought the blu-ray!", "created_at": "2019-01-31T04:55:44.810Z"}, {"movie_id": 346910, "review_id": "5cfadcecc3a3680b4e267496", "author_rating": 4.0, "review_text": "A crushing disappointment.\r\n\r\nThe hopes were high for this latest Predator rebirth, not because Shane Black starred in the great first Predator film, so therefore he surely must care about the project? But because he's an excellent writer and director. Shane Black can count Lethal Weapon(S), The Last Boy Scout and The Long Kiss Goodnight on his CV, he was the man who put Iron Man back on track after the sag of part 2. Plus he is the creator of two of the best buddy buddy neo-noirs this millennium (Kiss Kiss Bang Bang/The Nice Guys), So how come The Predator stinks of lazy cash cow manure?\r\n\r\nPlot in a nutshell sees the universe's most lethal hunters unleashed on Earth due to the meddling of a soldiers kid and some nosey scientist types. The fate of mankind rests with a group of damaged ex-soldiers and a rather cheesed off female scientist.\r\n\r\nWe have a rehash mishmash of what we have seen before in Predator 87 and Predators 2010. A group dynamic fighting a seemingly invincible foe. The subsequent science aspects such as human DNA inference/reasoning etc never really add up to much, serving only for a bunch of standard actors shouting, swearing and spouting hopelessly weak jokes and series re-treads. When you think the pic is about to up a gear, get rivetingly dramatic, a poor slice of humour comes our way either by vocal spillage or visual drivel (puppy pet Predator dog, really?). There's a bunch of plot threads that just dangle never to be pulled (PTSD/our hero's family strife et al), and the Predators loose on Earth - with different agendas - are confusingly shifted about by a screenplay not sure where it wants to land. \r\n\r\nPlus points? Well the cinematography is superb (Larry Fong), and you can't fault this for action quotas, there's plenty of it and it's bloody (both red and green type). The score is the traditional one we had from Alan Silvestri back in the 87 film, in fact it hardly deviates from it and yet Henry Jackman gets the credit. Of course some of the jokes will work for some folk (I would be lying if I said a Whoopi Goldberg gag didn't make me laugh), but the terror has gone, these Predators are no longer scary creatures. This reeks of a troubled production going hand in hand with a cash cow that not only narratively adds up to nothing really, but of a franchise death knell. Shame. 3.5/10", "created_at": "2019-06-07T21:53:48.714Z"}, {"movie_id": 346910, "review_id": "60df78a5344a8e00753d05bf", "author_rating": 8.0, "review_text": "**\"Long story short\"**\r\n\r\nUnlike the clueless reviewer (on a different website) who I quoted in the headline, I will not proceed to write 5 paragraphs of meaningless drivel about a movie I hate.\r\n\r\nUsually all of the AvP movies, Alien, Predator and the cross overs are at least a solid 3.5 stars. Of course the original Alien trilogy as well as Predator 1, 2 and even Predators stand out as being very original. The difference between the originals and the spin-offs is clearly the tone they set. In this movie we get a comic book style presented, with by no means bad CGI (dogs looked more real than in Predators for example), a secret research conspiracy, and charismatic heroes getting slaughtered (or not, no spoilers). Just like in the graphic novels, the pace is neck breaking. The ending felt almost rushed, to introduce the new Predator Killer Weapon. It is understandable how regular movie goers are put off by the constant over-stimulation, but I would not want it any other way. The action is over the top, definitely. But there was great attention to detail how the action scenes played out exactly, as opposed to lesser action films in which a flurry of cuts leaves a thinking audience just confused about what just happened.\r\n\r\nSure, I would have loved a darker vibe throughout the film too, especially in the beginning the score reminded a little of a Disney orchestra playing. But \"The Predator\" was a hell of a ride and deserves a special place among the spin-offs.\r\n\r\n28 November 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:35:49.813Z"}, {"movie_id": 346910, "review_id": "63c202c3e16e5a00afcba5bc", "author_rating": 1.0, "review_text": "Full disclosure, I've only really seen the first two movies, and after that I ignored the franchise. When the 2010 film dropped, it didn't even hit my radar and none of the crossovers with aliens I even bothered with...\r\n\r\n...but by 2010 I was 30 and, honestly, these are rated \"R\" movies that I loved in my childhood. But that was the 80s when parents could take their children to bloody rated R movies and not be arrested for abuse.\r\n\r\nSo, when they started making more, as much as I loved the first one, I really didn't care too much about the series. They lost me at the sequel.\r\n\r\nBut 2018 rolled around and I was feeling nostalgic. I wanted a throw back to a simpler time when people weren't so high strung about everything including the movies. Why not give it a try.\r\n\r\nAnd, I loved Predator as a kid even though it was clearly an adult movie. But you get the feeling that this one was a rated R movie clearly made for children.\r\n\r\nI remember moments of levity in the first few...but I don't recall them being light and, almost whimsical at all. They were serious sci-fi horror films.\r\n\r\nThis comes across as a Marvel movie, and though I love Marvel movies I don't want a Predator movie to feel like The Avengers. It's the Predator, it is supposed to have a different tone.\r\n\r\nIt left me with a bad taste in my mouth. It was too light to be a Predator movie. It wasn't dark. It wasn't scary, and it had too much of an attempt at humor to enjoy.\r\n\r\nIn other words, the movie stank. It couldn't even remember what it was supposed to be.", "created_at": "2023-01-14T01:17:55.781Z"}, {"movie_id": 346910, "review_id": "64418aa5b3f6f505269d846a", "author_rating": 5.0, "review_text": "Boyd Holbrook - a sort of love child of Mel Gibson and Michael Biehn - is the army sniper hero (\"McKenna\") who finds himself on the wrong end of the law after he and his team encounter the eponymous killing machine in the forest. Lucky to escape with his life, and a few souvenirs from the wreckage, he makes his way to a cantina where he posts his trophies to his wife and son before being taken into custody. Out in space, another of these would be visitors decides it needs to get that stuff back and so arrives duly determined to annihilate all who get in it's way. It turns out that the young \"Rory McKenna\" (Jacob Tremblay) is little short of a genius with AI - and pretty soon he, dad and feisty biologist \"Brackett\" (Olivia Munn) - along with a ragtag band of gung-ho prisoner/soldiers are facing up to their looming terror. Can they survive? Should they survive is probably the better question. Aside from a few scenes at the start and an admittedly lively fifteen minutes at the end, this is almost entirely devoid of the beastie we switched on to see. The dialogue is poorly written, expletive-ridden and banal; the characterisations are really shallow and there are far too many irrelevant sub-plots to distract from the (limited) focus of this 110 minute ramble of a film. The old adage - \"if it ain't broke...\" comes to mind. This is as far removed from the excellent 1987 introduction to this monstrous creature as it's possible to get and is, quite simply, a waste of video tape. There are plenty of adequate visual effects and pyrotechnics, but this film definitely had me rooting for the creature in the mask pretty much from the start!", "created_at": "2023-04-20T18:55:33.243Z"}, {"movie_id": 346910, "review_id": "5b9d9aa40e0a2675650093ff", "author_rating": 4.0, "review_text": "A complete waste of opportunity.  The film smacks of studio interference and bad decisions.  It starts off decent enough but at the halfway point it turns into a shambles and it does feel as if a lot of it ended up on the cutting room floor.  The music was very intrusive and some scenes were so badly lit you had no idea who was just killed or even what killed them.\r\n\r\nSome knowing nods to the earlier Predator films was a nice touch and it was good they didn't skimp on the gore and violence but all in all it's a bad movie.  Stick to Predator and Predators.", "created_at": "2018-09-15T23:49:56.555Z"}, {"movie_id": 346910, "review_id": "5ba3bf77c3a3683398020486", "author_rating": 5.0, "review_text": "My mind was racing as I watched _The Predator_ in the cinema tonight. I'd heard virtually nothing good about it so my anxious brain kicked into overdrive the whole time the film was going on. As a result of that, I almost feel like I experienced three movies in that theatre. First, obviously the movie on the screen. Secondly, the awesome movie I was theorising could unfurl at the result of each new sequence and plot point, but that sadly never did. And thirdly, the inexcusably awful and franchise-ruining movie that I feared it was about to take a hard left turn into at any minute, and thankfully never did.\r\n\r\nAnd that's really my experience on _The Predator_ overall, and the reason for a stalemate \"2.5 outta 5\" review: It wasn't as good as it should have been, it wasn't as bad as it could have been. Unfortunately, when the movie I'm writing in my head alongside watching it is better than what's actually on screen, when you take into account that I'm an unimaginative, talentless hack, really doesn't cut it for a sequel to _Predator_, one of of only five movies I've ever given a perfect rating to.\r\n\r\nThe best parts of _The Predator_ are when there is an eponymous Predator on screen. So you might think, \"Oh it's not a good movie, but it's a good _Predator_ movie\", and fair enough a conclusion to draw, but no. Part of the problem is, this movie really could have been pulled off with any aliens at all. Take out the Yautja and replace them with... I dunno, the blue skinned pogo-stick people of Planet Hurfadump, and it can still play out functionally the same. See, although I enjoyed watching the Predators do their thing, there was really nothing beyond cosmetic similarities that made them the Predators we've seen in every movie preceding this one.\r\n\r\nI think possibly part of the reason for that is that every other movie with a Predator in it has been an Action Horror movie (albeit Action Horror with ever-increasing Sci-Fi elements from film to film) whereas _The Predator_ is an Action Comedy, just one with some gore. Now I don't think that taking it that route was necessarily and... abysmal failure, let's say, but was Action Comedy the **best** way to take the _Predator_ franchise? I think it's pretty clear that the answer is no.\r\n\r\nIronic that that direction is being taken by Shane Black, the man who has a history with _Predator_ purely because the crew of the first film were determined to have him to work on the script, which he refused. Now here we are more 30 years later and Shane Black finally **has** put his name on a Predator movie, and it's not even good.\r\n\r\nFuck. At least it's better than _AvP: Requiem_!", "created_at": "2018-09-20T15:40:39.023Z"}, {"movie_id": 346910, "review_id": "5bfc6bebc3a36861f901dcab", "author_rating": 2.0, "review_text": "I couldn't believe what I was seeing. I was inclined to step out of the theater to check if I was sitting in the right room. But there it was, definitely a Predator, but obviously totally misplaced in a ridiculous movie - ridiculous story, ridiculous characters, ridiculous acting, ridiculous everything.\r\n\r\nI was so upset. One of the diamonds of a movie genre thrown in the dirt and made fun of. If you want to see how that's done, watch this one.\r\n\r\nA total waste of money - on production side and on cinema visitor's side.", "created_at": "2018-11-26T21:55:55.361Z"}, {"movie_id": 346910, "review_id": "5c043e0692514110800b4d29", "author_rating": 4.0, "review_text": "Its just not good.  The first predator created atmosphere; you were being hunted.  The only \"Predator\" film to deliver another dose of this was Predators.  \r\nThis film falls completely short of its predecessors (yes, all of them), but does leave you with a strong impression that this was a cash grab to squeeze any life out of a franchise that surpassed its EOL a long time ago.", "created_at": "2018-12-02T20:18:14.267Z"}, {"movie_id": 346910, "review_id": "5c527fd0c3a368576a98b772", "author_rating": 8.0, "review_text": "OK, I have to disagree with the other reviewers, to date, of this movie.  I totally enjoyed this movie and gave it an 8.  Once you figured it out, I thought the story line made complete sense.  I loved all the new characters, and thought the camaraderie of the main military characters was great and rather realistic.  I don't know about the other reviewers, but I did serve in the U. S. Army and found the character interplay highly realistic.  I am disappointed with the interplay between the \"good guys\" and our government; however, these days you come to expect that.  I don't believe that part would be realistic, but I don't think it distracted that much from the movie, and everyone came together in the end...to, of course, save humanity!  Which, of course, it did otherwise we all wouldn't be here anymore...right?  Good movie!  Go see it and then decide for yourself, but I thought it was definitely worth seeing, so much so I even bought the blu-ray!", "created_at": "2019-01-31T04:55:44.810Z"}, {"movie_id": 346910, "review_id": "5cfadcecc3a3680b4e267496", "author_rating": 4.0, "review_text": "A crushing disappointment.\r\n\r\nThe hopes were high for this latest Predator rebirth, not because Shane Black starred in the great first Predator film, so therefore he surely must care about the project? But because he's an excellent writer and director. Shane Black can count Lethal Weapon(S), The Last Boy Scout and The Long Kiss Goodnight on his CV, he was the man who put Iron Man back on track after the sag of part 2. Plus he is the creator of two of the best buddy buddy neo-noirs this millennium (Kiss Kiss Bang Bang/The Nice Guys), So how come The Predator stinks of lazy cash cow manure?\r\n\r\nPlot in a nutshell sees the universe's most lethal hunters unleashed on Earth due to the meddling of a soldiers kid and some nosey scientist types. The fate of mankind rests with a group of damaged ex-soldiers and a rather cheesed off female scientist.\r\n\r\nWe have a rehash mishmash of what we have seen before in Predator 87 and Predators 2010. A group dynamic fighting a seemingly invincible foe. The subsequent science aspects such as human DNA inference/reasoning etc never really add up to much, serving only for a bunch of standard actors shouting, swearing and spouting hopelessly weak jokes and series re-treads. When you think the pic is about to up a gear, get rivetingly dramatic, a poor slice of humour comes our way either by vocal spillage or visual drivel (puppy pet Predator dog, really?). There's a bunch of plot threads that just dangle never to be pulled (PTSD/our hero's family strife et al), and the Predators loose on Earth - with different agendas - are confusingly shifted about by a screenplay not sure where it wants to land. \r\n\r\nPlus points? Well the cinematography is superb (Larry Fong), and you can't fault this for action quotas, there's plenty of it and it's bloody (both red and green type). The score is the traditional one we had from Alan Silvestri back in the 87 film, in fact it hardly deviates from it and yet Henry Jackman gets the credit. Of course some of the jokes will work for some folk (I would be lying if I said a Whoopi Goldberg gag didn't make me laugh), but the terror has gone, these Predators are no longer scary creatures. This reeks of a troubled production going hand in hand with a cash cow that not only narratively adds up to nothing really, but of a franchise death knell. Shame. 3.5/10", "created_at": "2019-06-07T21:53:48.714Z"}, {"movie_id": 346910, "review_id": "60df78a5344a8e00753d05bf", "author_rating": 8.0, "review_text": "**\"Long story short\"**\r\n\r\nUnlike the clueless reviewer (on a different website) who I quoted in the headline, I will not proceed to write 5 paragraphs of meaningless drivel about a movie I hate.\r\n\r\nUsually all of the AvP movies, Alien, Predator and the cross overs are at least a solid 3.5 stars. Of course the original Alien trilogy as well as Predator 1, 2 and even Predators stand out as being very original. The difference between the originals and the spin-offs is clearly the tone they set. In this movie we get a comic book style presented, with by no means bad CGI (dogs looked more real than in Predators for example), a secret research conspiracy, and charismatic heroes getting slaughtered (or not, no spoilers). Just like in the graphic novels, the pace is neck breaking. The ending felt almost rushed, to introduce the new Predator Killer Weapon. It is understandable how regular movie goers are put off by the constant over-stimulation, but I would not want it any other way. The action is over the top, definitely. But there was great attention to detail how the action scenes played out exactly, as opposed to lesser action films in which a flurry of cuts leaves a thinking audience just confused about what just happened.\r\n\r\nSure, I would have loved a darker vibe throughout the film too, especially in the beginning the score reminded a little of a Disney orchestra playing. But \"The Predator\" was a hell of a ride and deserves a special place among the spin-offs.\r\n\r\n28 November 2018\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:35:49.813Z"}, {"movie_id": 346910, "review_id": "63c202c3e16e5a00afcba5bc", "author_rating": 1.0, "review_text": "Full disclosure, I've only really seen the first two movies, and after that I ignored the franchise. When the 2010 film dropped, it didn't even hit my radar and none of the crossovers with aliens I even bothered with...\r\n\r\n...but by 2010 I was 30 and, honestly, these are rated \"R\" movies that I loved in my childhood. But that was the 80s when parents could take their children to bloody rated R movies and not be arrested for abuse.\r\n\r\nSo, when they started making more, as much as I loved the first one, I really didn't care too much about the series. They lost me at the sequel.\r\n\r\nBut 2018 rolled around and I was feeling nostalgic. I wanted a throw back to a simpler time when people weren't so high strung about everything including the movies. Why not give it a try.\r\n\r\nAnd, I loved Predator as a kid even though it was clearly an adult movie. But you get the feeling that this one was a rated R movie clearly made for children.\r\n\r\nI remember moments of levity in the first few...but I don't recall them being light and, almost whimsical at all. They were serious sci-fi horror films.\r\n\r\nThis comes across as a Marvel movie, and though I love Marvel movies I don't want a Predator movie to feel like The Avengers. It's the Predator, it is supposed to have a different tone.\r\n\r\nIt left me with a bad taste in my mouth. It was too light to be a Predator movie. It wasn't dark. It wasn't scary, and it had too much of an attempt at humor to enjoy.\r\n\r\nIn other words, the movie stank. It couldn't even remember what it was supposed to be.", "created_at": "2023-01-14T01:17:55.781Z"}, {"movie_id": 346910, "review_id": "64418aa5b3f6f505269d846a", "author_rating": 5.0, "review_text": "Boyd Holbrook - a sort of love child of Mel Gibson and Michael Biehn - is the army sniper hero (\"McKenna\") who finds himself on the wrong end of the law after he and his team encounter the eponymous killing machine in the forest. Lucky to escape with his life, and a few souvenirs from the wreckage, he makes his way to a cantina where he posts his trophies to his wife and son before being taken into custody. Out in space, another of these would be visitors decides it needs to get that stuff back and so arrives duly determined to annihilate all who get in it's way. It turns out that the young \"Rory McKenna\" (Jacob Tremblay) is little short of a genius with AI - and pretty soon he, dad and feisty biologist \"Brackett\" (Olivia Munn) - along with a ragtag band of gung-ho prisoner/soldiers are facing up to their looming terror. Can they survive? Should they survive is probably the better question. Aside from a few scenes at the start and an admittedly lively fifteen minutes at the end, this is almost entirely devoid of the beastie we switched on to see. The dialogue is poorly written, expletive-ridden and banal; the characterisations are really shallow and there are far too many irrelevant sub-plots to distract from the (limited) focus of this 110 minute ramble of a film. The old adage - \"if it ain't broke...\" comes to mind. This is as far removed from the excellent 1987 introduction to this monstrous creature as it's possible to get and is, quite simply, a waste of video tape. There are plenty of adequate visual effects and pyrotechnics, but this film definitely had me rooting for the creature in the mask pretty much from the start!", "created_at": "2023-04-20T18:55:33.243Z"}]