[{"movie_id": 310888, "review_id": "585e9f44c3a3681a6801154f", "author_rating": 7.0, "review_text": "**First date with a chocolate ice cream girl.**\r\n\r\nA small film with a small success. It was entirely shot in the two weeks of time. Directed by a first timer, it tells the true story of Barack Obama and Michelle Robinson's first date back in the 1989 during working for a big law firm in Chicago. Like how Michelle denied it is a date as co-workers should not engage in a close relationship. While Obama is trying to win her heart, the film reveals their day, what they talk and do and how it all ends.\r\n\r\nThis is not a biographical film I was expecting. I mean I was looking forward to the film, but not this kind of simple story. This looks like another version of 'Before Sunrise', and I won't be surprised if they make a sequel in a similar fashion, maybe a trilogy. So this is a one day event when they were young and passionate about their work, somewhat they both liked each other, though they knew their limits. The writer-come-director confirms all the events from his film really occurred, but not all of them in just one date.\r\n\r\nThe actors were good, especially I liked Parker Sawyers as Barack Obama. For me, this is not a great film, but decently made one. Obama fans might like it, though you could try it if you like date film in a realistic manner. It's Obama's early life, so there's nothing about his present politics or the president post, except talking about their future plans. But most of the film about between them and their life, like how they grew how, what they love and loved, those kind of stuffs. So I hope you watch it with a low expectation.\r\n\r\n_6.5/10_", "created_at": "2016-12-24T16:16:04.139Z"}, {"movie_id": 310888, "review_id": "64cca67b798e06011d81e0ba", "author_rating": 4.0, "review_text": "Inspired by Barack and Michelle Obama’s first date in 1989, “Southside With You” is a fun period premise that just isn’t fully realized. It’s not romantic enough to be a traditional date movie and it tries too hard to be a racially focused drama, making this talky film from writer-director Richard Tanne much more of a bore than a joy to sit through.\r\n\r\nThe movie focuses on one date and takes place over one day in and around Chicago. Summer law firm associate Barack (Parker Sawyers) picks up his colleague Michelle (Tika Sumpter) to spend the day chatting and exploring their city. In a blatant rip-off of the far better “Before Sunrise” series, this film starts off delightful and then becomes just too cutesy and preachy to be meaningful.\r\n\r\nThe film makes Obama out to be some sort of savior for the poor and the disenfranchised which I guess is okay, but it’s also more than a little irritating. (The religious imagery becomes so forced that there’s a scene in a church where Obama is bathed in sunlight).\r\n\r\nThe early banter in the ‘first date’ scenes are fun, romantic and enjoyably charming, much due to the charismatic performances from Sawyers and Sumpter. It’s when the discussions turn more and more towards race and poverty that the film begins to feel like it’s an exercise in pandering to the liberal crowd. Ultimately it becomes a bland attempt at pointed social, gender and racial commentary.\r\n\r\nThis movie is short (84 minutes) but it should’ve been even shorter. There’s just not enough compelling material to make an interesting feature film.", "created_at": "2023-08-04T07:19:23.808Z"}]