[{"movie_id": 682507, "review_id": "62d2d1dcd399e6004bfb74f6", "author_rating": 8.0, "review_text": "By January 2022, the book had sold 12 million copies, making it one of the best-selling books of all time. Almost everyone in the theatre, yesterday afternoon, had read the book and were wondering if the movie could be as good as the book, so in my exit poll, of a dozen, or so, viewers, I asked then specifically, “Did the movie do justice to the book?” Without exception they said it had. (Although one reader thought the movie had a more definitive ending than the book.) Their ratings were 8s, 8.5s and two 10s. When I said that anything I rated over 8 would be worthy of a rewatch, it was unanimous that all of them would rewatch it, some thinking they’d like to read the book, again. So, these people, who came to see the movie, had high standards that they felt were met.\r\n\r\nThe story is simple but intriguing. There is a whole TO KILL A MOCKINGBIRD vibe to it. And there is a wonderful contrast between a purity of soul living within a world of threat and danger. It was refreshing to have a film celebrate innocence. The nature shots of North Carolina are breathtaking. The casting is spot on and the performances are flawless. But the success of the film lies with the lead actor, Daisy Edgar-Jones (a very talented Brit, who earned respect for her talents in another best selling novel adaptation for television, NORMAL PEOPLE). There is a wide eyed innocence about Kya that she captures which, in turn, captivates the audience to invest in her story and her plight. (The only disconnect I had with her portrayal was not her fault but that of the production. For a swamp girl, living off the grid, her personal hygiene and wardrobe were spotless and fitted to perfection. A seemingly unlikely possibility considering her environment.) I would definitely see this film again and am tempted to buy the audible book. I give this film an enthusiastic 9 (beautiful and touching) out of 10. [Drama]", "created_at": "2022-07-16T14:57:32.259Z"}, {"movie_id": 682507, "review_id": "62e2e96567e0f700617f5ade", "author_rating": 7.0, "review_text": "Daisy Edgar-Jones is really quite good in this adaptation of the Delia Owens story of a young girl left to her own devices in 1950s America. One by one her mother, siblings and finally her father abandon her to bring herself up. She takes to fishing for mussels in order to try to make ends meet, and is generally shunned by her community. Except, that is for her childhood friend \"Tate\" (a good effort too from Taylor John Smith) but when he leaves to go to college, she is exposed to the local Lothario \"Chase\" (Harris Dickinson). Turns out he is a bit of a wrong 'un for her, and when he is found dead at the bottom of a fire tower, she is prime suspect. What now ensues is a trial that provides us with retrospectives of the girl's childhood and her relationships whilst \"Milton\" (David Strathairn) organises her defence for a crime that might not even have been committed! The cinematography is gorgeous, the remoteness and intimacy of her existence is captured really well; as is the sense of isolation from her community as they look upon her as little more than an urchin. Smith portrays a decency to his character (he reminded me a lot of Joe Alwyn) and there are some touching performances from Sterling Macer Jnr. and Michael Hyatt as the closest thing the young girl has to family. Dickinson's accent is all over the shop, but he does manage to convince well enough as the rather duplicitous man who probably deserved his fate - however it actually happened. It is an interesting story, illustrating just how little by way of state infrastructure (or interference) there was in this young girl's life and how that empowered and endangered her in equal measure. DEJ delivers a strong and nuanced performance as the initially illiterate girl who was determined not be put upon and the story has a redemption that I found really fitting. The photography really does benefit from a cinema screen if you can.", "created_at": "2022-07-28T19:54:13.972Z"}, {"movie_id": 682507, "review_id": "62e92d9296522000581d1480", "author_rating": 7.0, "review_text": "Split opinion on this. Overall, though, I think my thoughts regarding it are, just narrowly, positive.\r\n\r\n<em>'Where the Crawdads Sing'</em> is a tad overlong and I'm not sold on the ending, though even so I think I like this enough. The acting is the big reason for that, with Daisy Edgar-Jones standing out alongside David Strathairn. Taylor John Smith and Garret Dillahunt are solid elsewhere. Away from the actors, most other elements are forgettable.\r\n\r\nThe conclusion is iffy to me. It was clear the film was holding something back in regards to the story, though the way it eventually goes isn't the most satisfying to me personally. It's a pretty straightforward film, when all is said and done. \r\n\r\nIt's close to being what I'd consider a miss, but I reckon it just about does enough right. 6/10 doesn't feel fitting to me, so 7/10 it is.", "created_at": "2022-08-02T13:58:42.109Z"}, {"movie_id": 682507, "review_id": "62ecea671bf266005da59327", "author_rating": 7.0, "review_text": "WHERE THE CRAWDADS SING is a movie adaptation of the novel of the same name by Delia Owens. The movie is set in the early 1950s in the fictional town of Barkley Cove, North Carolina. Kya Clark (played by Daisy Edgar-Jones) is a young girl who lives in isolation after she is abandoned by her family. She becomes friends with Tate Walker (played by Taylor John Smith), a local boy who helps her learn how to read and write. When Tate also abandons her, Kya becomes involved with Chase Andrews (played by Harris Dickinson), the town's golden boy. When Chase is found dead, Kya becomes the prime suspect.\r\n\r\nThe movie begins with the murder, unlike in the book.  In the movie, Kya is arrested and put on trial at the start. The trial is the central focus of the movie, whereas in the book it is a secondary plotline. The movie does a decent job of adapting the book's complex plot and characters for the screen. However, it lacks the lyrical prose of the novel, which is one of the novel's greatest strengths.\r\n\r\nDaisy Edgar-Jones gives a breakout performance as Kya. She conveys Kya's isolation, desperation, and hope. The movie is worth watching for her performance alone. The movie is visually stunning, with sweeping shots of the North Carolina marshes. It's a beautiful backdrop for the story. In addition to her relationships with the two men in the story, a black couple also befriends Kya – Jumpin' (played by Sterling Macer Jr) and Mabel (played by Michael Hyatt). Their relationship is one of the most complex and interesting relationships in the movie.\r\n\r\nWHERE THE CRAWDADS SING is not perfect. The film's pacing is uneven, and it struggles to find the right tone. The murder mystery plot is too convoluted and not particularly interesting. And the relationship between Kya and Chase feels forced and unconvincing. And there is no explanation of what a crawdad is! My understanding is that a crawdad is a freshwater crustacean that resembles a small lobster. They are also known as crayfish, crawfish, and crawdaddies. They live in the swamps battling for their existence – a metaphor for Kya's own battle to survive.\r\n\r\nThe themes of love, loss, betrayal, and redemption are at the heart of this movie. Kya's story is a moving tale of human resilience in the face of great adversity. The ending is hopeful, though not without tragedy.\r\n\r\nOverall, WHERE THE CRAWDADS SING is a beautiful but flawed adaptation of a great novel. It's worth watching for the stunning visuals and Daisy Edgar-Jones' performance. But be prepared to be disappointed if you're expecting a faithful adaptation of the book.", "created_at": "2022-08-05T10:01:11.234Z"}, {"movie_id": 682507, "review_id": "63152e2ffab3fa007f3dd599", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Where the Crawdads Sing is one of the biggest surprises of the year - may the extraordinary box office result serve as proof.\r\n\r\nA survival story - on many levels - that tackles heavy trauma, the power of nature, prejudice, hypocrisy, and many other topics in a thematically rich screenplay. Daisy Edgar-Jones ends her breakthrough year with yet another complex performance that convinces viewers to invest in the equally intricate, fully-developed protagonist over a runtime slightly affected by a short period during the second act where it loses some momentum.\r\n\r\nA tad too melodramatic for my taste, and the divisive revelation of the final minutes will certainly generate much discourse - personally, it almost ruins the whole work.\r\n\r\nStill, I recommend it!\"\r\n\r\nRating: B", "created_at": "2022-09-04T23:01:03.681Z"}, {"movie_id": 682507, "review_id": "6360955f40d0fe007acd65b7", "author_rating": 6.0, "review_text": "**While well done and well told, it is not a movie I would return to.**\r\n\r\nWhere the Crawdads Sing is a lingering sorrowful tale of an abandoned young woman finding her purpose and strength in the isolation of nature. The story mourns the abuses and judgments the protagonist faces as nearly every relationship in her life betrays her. Yet, she remains hopeful, kind, and gentle after all that. The movie is a mixture of biography, courtroom drama, and murder mystery, and while that might sound full and active, Where the Crawdads Sing is an unhurried creeping story. Typically, slow-moving films bore me, but this one was definitely engaging. The main character is steadfast and strong even after all she had endured making the story more compelling and interesting. The mystery part of the movie almost hides in the background until the film's final moments, focusing on Kya's journey rather than devolving into a mediocre whodunit. While I was taken along on an intriguing sojourn with Where the Crawdads Sing, it was ultimately a very somber tale moving at a very melancholy pace.", "created_at": "2022-11-01T03:41:19.666Z"}, {"movie_id": 682507, "review_id": "64e25b0ca3b5e601d8760eb2", "author_rating": 8.0, "review_text": "**_The challenges of growing up (alone) in the shoreline swamps of the Carolinas_**\r\n\r\nIn the 60s, a girl (Daisy Edgar-Jones) comes-of-age in coastal North Carolina, where she’s an outcast known as “the marsh girl.” When a local hotshot is found dead (Harris Dickinson), the community thinks she’s the culprit. Taylor John Smith plays a male friend and David Strathairn her lawyer. \r\n\r\nBased on the 2018 novel by Delia Owens, “Where the Crawdads Sing” (2022) is a meshing of “Cross Creek” (1983) with backwoods crime mystery, such as \"Undertow\" (2004), \"Winter's Bone\" (2010) and \"Mud\" (2012). It’s reminiscent of Steve Gerber’s Man-Thing comics of the 70s, just with the swamp monster being replaced by human monsters. \r\n\r\nThe coastal swamp cinematography is awesome, but this wasn’t shot within 850 miles of the shores of North Carolina. It was filmed in Houma and New Orleans, Louisiana\r\n\r\nThe movie runs 2 hours, 5 minutes. \r\n\r\nGRADE: B+/A-", "created_at": "2023-08-20T18:27:24.154Z"}]