[{"movie_id": 1620, "review_id": "5ae2aa1bc3a36876b2029409", "author_rating": 8.0, "review_text": "I know, I know, this movie is rather superficial and simple. More effort has been spent on cool action than on depth of the story. Well, you know what? I do not care! I quite liked this movie. Agent 47 is cool and kicks ass. The bad guys gets plenty of ass whooping. The action is good. There is quite a lot of high tech and gadgets. What is there not to like?\n\nThe movie starts of with a quite cool sequence introducing Agent 47. I have to say that I got into quite a bit of “wow” mode right a way there. The movie continues with plenty of action sequences with just a wee bit of slowdown in between. Actually the first-half, at least, of the movie is pretty much one long chase.\n\nPerhaps I should point out that I have not played Hitman and do not really know what the original story is about. From a lot of the comments I have read it appears That this might be to my advantage when it comes to enjoying the movie.\n\nSome people are probably complaining about bad acting since Agent 47 do not really show much in terms of facial expressions or emotions. Well, news for you, he is not supposed to! He is supposed to be a cold emotionless killing machine so stop whining. Personally I found Agent 47 to be an excellent character. the re is on scene in particular that I liked where Agent 47 intentionally allows himself to be caught in a embassy. Once inside he, to no one in the audience surprise starts to tear the place apart. You have to see it to know what I mean.\n\nThe second part, or perhaps just the last third, of the movie turns into more of a search and destroy for Agent 47 and his new “partner”. this part is of course as action filled as the first part of the movie. Naturally it all leads to a big show down between the Agent 47 & Co. The end itself did not really deliver any surprises but was satisfying.\n\nThe one thing in the movie that annoyed me was this subdermal armor stuff. The idea was not a too bad one but they really overplayed it. Come on! Just shoot him in the head or an eye or some other “sensitive” part for Christ sake. Bulletproof my arse!\n\nI honestly do not understand the low rating this movie has received. 5.7 at IMDb is really a bit harsh. Rotten Tomatoes rating is, not very surprisingly, abysmal. Rotten Tomatoes and their “critics” ratings must be the worst of any ratings site. When these dickwads rate down a movie, that’s when I start to get interested. First step is to drill down into the real audience ratings which more often that not gives a different picture.\n\nAny way I digress. Bottom line is that, for me, this is a simple, straightforward, high octane action movie and I quite enjoyed it.", "created_at": "2018-04-27T04:42:03.151Z"}]