[{"movie_id": 12201, "review_id": "639a9d303d43e00089d63a7b", "author_rating": 6.0, "review_text": "**mixed bag.**\r\n\r\nWe've seen many movies with the same premise: man seeking revenge for his loved one/child.\r\n\r\nThis could've been an rare exception sticking out of the plot repetition, but it fails in other aspects.\r\n\r\nThe good bits:\r\n\r\n* We get to actually care for the victims. They are more than just plot triggers, they are persons, and there is an emotional attachment.\r\n* The protagonist isn't as over the top as in most revenge flicks. He's an realistic cop who, caused by tragedy, is losing his grip.\r\n* In addition to the evil main antagonist, there is a deuteragonist; and I like this type of character very much: independent, but not good. Lots of potential in such a figure.\r\n* The violence is naturalistic.\r\n\r\nThe bad bits:\r\n\r\n* Whether as early as in script (several authors), or as late as in post-production cuts - this looks like important bits were simply omitted.\r\n* The pacing is OK and follows the story, but at times, it feels a bit slow.\r\n* some resolution is too clichéd.\r\n\r\nThis is an remake of an BBC series, which I haven't seen; my wild guess is: the original is much better.\r\n\r\nI don't think this is a spoiler; just give you an idea of the calibre of plot-holes in this: Two criminals are arrested by half a dozen cops, with physical evidence to get them behind bars for years. The TV reports about this incident, so no way this gets hushed up. Yet, two scenes later, we see the same two bad guys strutting and driving around as if police would neither recognise nor bother them. Explanation? None.\r\n\r\nPart of this is an unusual variation of the revenge-flick, with a tinge of supernatural; but another, large, part is a failed script or implementation.\r\n\r\n4 for the movie as such; +1 for the emotional part, +1 for the deuteragonist, which really improves the potential (though not all of the outcome). I'm giving it a 6 out of 10.", "created_at": "2022-12-15T04:06:08.262Z"}]