[{"movie_id": 77949, "review_id": "561b68e79251415a670002f5", "author_rating": 7.5, "review_text": "There's no place on earth people understand loneliness better than here.\r\n\r\nThe Awakening is directed by Nick Murphy and Murphy co-writes the screenplay with Stephen Volk. It stars Rebecca Hall, Dominic West, Imelda Staunton, Isaac Hempstead Wright, Shaun Dooley and Joseph Mawle. Music is by Daniel Pemberton and cinematography by Eduard Grau.\r\n\r\nBritain, post World War 1, and Florence Cathcart (Hall) makes a living as an exposer of charlatan spiritualists, a debunker of ghost sightings. When she receives a request from school master Robert Mallory (West) to investigate the supernatural events at a remote boarding school for boys, she is suitably intrigued to take on the assignment...\r\n\r\nIt comes as no surprise to find that numerous reviews for The Awakening make reference to ghost story films that were made previously. The Woman in Black released a year later would suffer the same fate, charges of it not bringing nothing new to the table etc. A ghost story set in a big mansion or remote educational/correctional establishment is what it is, and will continue to be so, all fans of such spooky fare ask is that it does it well and maybe add some adult themes into the bargain. The Awakening does these in spades.\r\n\r\nThe concept of a disbeliever in ghosts having their belief system tested to the full is not new, but it's a great concept and one with longevity assured. Here, boosted by a terrific performance from Hall, the screenplay consistently keeps you guessing. The possibilities of real or faked are constant as the director pumps up the creep factor, whilst he simultaneously crafts a number of genuine shock sequences - including one of the best doll house scenes put to film! This really has all the requisite jolts and atmospheric creeps for a period spooker.\r\n\r\nIt's not until the final quarter when the screenplay begins to unravel its mystery, a finale that has proved both ambiguous and divisive. The ambiguity factor is a little baffling since everything is made clear in a nicely staged scene, and this is something which the director has gone on record to state as well. As for the divisive side of things? That's a blight for this sub-genre of horror. It's convoluted! Contrived! It has been done before they cry! These are true to be sure, and without doubt there's a leap of faith required to not get annoyed, but it garners a reaction and has done its ghost story essence very well indeed.\r\n\r\nBeautifully photographed, scored and performed by the leads to boot, this is for sure one for fans of period spookers with brains. 7.5/10", "created_at": "2015-10-12T08:01:43.016Z"}]