[{"movie_id": 198663, "review_id": "562a27ac9251412845001d90", "author_rating": 5.0, "review_text": "Another forgettable Game of Ender/Hunger Games/Divergent clone.\r\n\r\nIn this case, to compensate that the main characters are often women, we just make the whole cast to be men.\r\n\r\nJust forget about this.", "created_at": "2015-10-23T12:27:24.274Z"}, {"movie_id": 198663, "review_id": "58c95a2992514110ed00a8a6", "author_rating": null, "review_text": "It was a good movie as far as it goes -- resourceful characters deprived of both freedom and their memories manage to build a society and think their way out of their bondage.  The problem is that at the end, it simply stopped.  No dramatic reason for ending where it does, no resolution of \"why did the captors do this?\" .  Even in a series a movie ought to have a decent local climax -- for example,  Kat and Peeta winning the Hunger Games.", "created_at": "2017-03-15T15:13:45.947Z"}, {"movie_id": 198663, "review_id": "5a3d1dbac3a368148f0acd87", "author_rating": 7.0, "review_text": "One thing that I liked about this movie from the start was that it was, in my limited experience at least, somewhat original. Yes it was an apocalypse story but I have really not seen anything quite like it before. Yes moving mazes and all that have been done but the story as a whole was new to me. That was refreshingly enjoyable in this age of more or less boring Hollywood remakes.\r\n\r\nOn the whole I quite enjoyed the movie. I would label it a “young adult” movie. Not only because the lead characters as well as almost the entire cast are teenagers but the story itself is clearly at a level directed towards a younger audience. But then, who do not wish they were young again? I quite liked the story. It clearly had its usual collection of illogical moments and plot holes but nothing really really annoying as far as I am concerned.\r\n\r\nIn my opinion all of the cast did a decent enough job of their roles. Some roles mostly consisted of standing around in the background of course but the lead characters was not bad. Teresa was more of a plot element than a lead character in this movie though that has to be said.\r\n\r\nI did indeed like the maze itself. It had a quite cool look and was well done from a cinematic point of view. The one thing that did not come out in the movie though was the reason for it all. I know that is supposed to be the mystery but it was rather frustrating nonetheless to not get any clues whatsoever. What on Earth could be the purpose of having a bunch of kids live through this experience in that way?\r\n\r\nSometimes the behavior of these kids where somewhat annoying of course. I especially disliked the plot element where that dumbass kid seemed to just want everything to stay the same forever. It is of course a classical element in stories like this but it still annoys the hell out of me every time.\r\n\r\nBottom line is still that I found this a rather enjoyable movie. I would definitely want to see the other two books made into movies as well. I have not read the books by the way so me thinking this was a new story experience is of course partly due to this fact.\r\n\r\nSHARE THIS:", "created_at": "2017-12-22T14:59:06.227Z"}, {"movie_id": 198663, "review_id": "5ae763880e0a26104f00e231", "author_rating": 1.0, "review_text": "Don't bother.", "created_at": "2018-04-30T18:42:16.369Z"}, {"movie_id": 198663, "review_id": "5bb59b33c3a368150c008095", "author_rating": 6.0, "review_text": "Much better than the marketing would have you assume.\r\n\r\n_Final rating: ★★★ - I personally recommend you give it a go._", "created_at": "2018-10-04T04:46:43.996Z"}]