[{"movie_id": 354912, "review_id": "5a5881500e0a2634f1006a6b", "author_rating": 5.0, "review_text": "Spectacularly colourful with a sweet, (albeit predictable) path. Certainly not a misfire from Pixar, but also did not appeal to me personally in the way that many of their other films have.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2018-01-12T09:35:12.923Z"}, {"movie_id": 354912, "review_id": "5b0a82e99251411e6a004bc1", "author_rating": 9.0, "review_text": "**Beautiful, colourful and sweet**\r\n\r\nThis film has real heart, with great messages about what family can and should do for each other.  Great voice acting, great songs without having the burden of exposition via song that you find in the more musical ventures by Disney.  I loved that you could see genuine guitar chords being played, so often in live action films the playing of musical instruments, especially guitar are poorly faked.  None of that in this animated gem.\r\n\r\nOne thing I personally loved was the depiction of Mexican culture.  Although I really enjoyed _Moana_, I thought it was a little bit too much of a pastiche of multiple Pacific cultures when it should have just picked one (Maori) and stuck with it.  _Coco_ celebrates Mexican culture, and depicts it well.  The only thing missing for me was more Mexican cuisine.\r\n\r\nIt can get a little dark in places, so maybe be careful when watching it with the little ones, but should appeal to most of the family.\r\n\r\n9/10", "created_at": "2018-05-27T10:05:29.634Z"}, {"movie_id": 354912, "review_id": "5cc048f2c3a368596a82957b", "author_rating": 10.0, "review_text": "I loved the movie starting from the characters, animation, colors, emotions, story everything. A good way to tell how important a family is. Happy it had a happy ending.", "created_at": "2019-04-24T11:30:58.056Z"}, {"movie_id": 354912, "review_id": "5f56619790dde00034ec6967", "author_rating": 10.0, "review_text": "Sensational! <em>'Coco'</em> is straight into my top five of Disney animations.\r\n\r\nThe whole 105 minutes are a joy to watch, thanks to its rich and highly meaningful story alongside the wonderful animation and sharp humour. Safe to say, I was not expecting this film to smash it out the park - which it totally does. This is why I don't, personally, look up about films before watching them, I love being surprised.\r\n\r\nBig credit also goes to the cast, who play some awesome characters. From Miguel (Anthony Gonzalez) to Héctor (Gael García Bernal) to Ernesto (Benjamin Bratt), among others, they are all very, very good.\r\n\r\nIt isn't just the characters that make this memorable, it is also the excellent plot which is told beautifully. It's filled with not just comedy but also a load of heart - there's a few nicely done twists too. The world that they create around the Day of the Dead is fantastic, while the music fits perfectly.\r\n\r\nIf you haven't already, you must watch this! It's brilliant!", "created_at": "2020-09-07T16:36:39.664Z"}, {"movie_id": 354912, "review_id": "64f2d05b77d23b012e8ad10a", "author_rating": 7.0, "review_text": "Budding guitarist \"Miguel\" is puzzled by his family's long-established ban on anything musical. To him it just doesn't make any sense at all especially as, generations ago, his family were at the top of that very game. Determined to get to the bottom of that mystery so he can emulate the legendary heart-throb \"Ernesto\" (a cross between Julio Iglesias and Justin Bieber), he finds that serendipity takes an hand in things. On the Day of the Dead, he manages to get himself transported to the the vibrant and surprisingly lively land of the dead where he encounters the slightly mischievous \"Hector\" who promises to guide him to his great, great grand-father, find the truth and enable him to return home to a family that will, once again, embrace music. He has to get a move on though, as he only has the hours of darkness to fulfil his quest - so the race is on. Meantime some of his other, long deceased, family are also on his trail bent on returning him home without his music. To be honest, I found the underlying tale of loyalty and family to be just a bit overly-sentimental at times, but the quality and vivacity of the animation is a class apart - huge great eyes and smiles that tell the story so much better than words ever could. The story marries the musical with the dastardly and mysterious nicely with a well written script and a quickly paced storyline that is really quite entertaining. This works better on a big screen - it really shows the animators art off to best effect and, luckily, this has plenty for the adult audience too with some engagingly quirky characters.", "created_at": "2023-09-02T06:04:11.561Z"}]