[{"movie_id": 27022, "review_id": "5a5709f10e0a2607ec033cdd", "author_rating": 9.0, "review_text": "As usual the so-called critics wrote it down quite a lot but the reviews by ordinary people gave it a much better score (although not stellar). Not very surprising of course since those self-proclaimed besserwissers always moan about films made just to entertain.\r\n\r\nI found the film well worth the time and money spent. Of course the plot was not very intriguing but is there anyone who would really expect that from a film like this? It’s clearly aimed at younger people and people with a liking for magic and old-fashioned adventure. The effects where really nice and I certainly liked the old-fashioned magic theme. The fact that the lead actor was Nicolas Cage of course helps a lot as well.", "created_at": "2018-01-11T06:53:37.598Z"}, {"movie_id": 27022, "review_id": "5fa8b41421621d003dfa0799", "author_rating": 7.0, "review_text": "Good enough, if nothing standout.\r\n\r\n<em>'The Sorcerer’s Apprentice'</em> is an interesting film. The premise isn't anything revolutionary, it follows the same beats that a load of these sorta films do; I recall <em>'Bulletproof Monk'</em> and <em>'Percy Jackson & the Olympians: The Lightning Thief'</em> having similar-ish set-ups.\r\n\r\nThat's not to say it isn't enjoyable, as I did like it. Nicolas Cage always manages to entertain one way or another, while Jay Baruchel works well for the comedic stuff in particular. Alfred Molina makes another live-action Disney appearance, following on from <em>'Prince of Persia: The Sands of Time'</em> two months prior. He's solid, but better in the latter.\r\n\r\nThe special effects are excellent, I really enjoyed seeing it all come to life onscreen. The score is decent, though the pacing could've been finer. Overall, it's a film I just about feel satisfied with. Worth a watch? Sure.", "created_at": "2020-11-09T03:14:28.872Z"}, {"movie_id": 27022, "review_id": "624abbb9a9117f00647dadf4", "author_rating": 5.0, "review_text": "Aside from an entertaining scene with some of Lukas' wonderful \"L'Apprenti Sorcier\" and some overly enthusiastic mops, this is a really poor adaptation of this Arthurian legend. In days of old, \"Merlin\" manages to imprison \"Morgana\" (Alice Krige) inside a sort of Russian doll. It falls to \"Balthazar\" (Nicolas Cage) to keep it safe over the millennia until the successor to the sagely old wizard emerges. Well it does, in the unlikely guise of the rather geeky \"Dave\" (Jay Baruchel) and so it falls to the former to train the hapless latter in the arts of sorcery. Meanwhile, the nasty \"Horvath\" (Alfred Molina) is bent on releasing the witch from her captivity, and aided by a Billy Idol style rocker \"Drake Stone\" (Toby Kebbell) is hot on their trail. To be fair, the intention is good - there is plenty of quickly-paced action, the visual effects are adequate and it really looks ok. The acting, though, is pretty terrible. There isn't the slightest hint of a spark between Cage and his young protege; Molina as the suave and ruthless \"Horvath\" falls fairly flat and the rest of the cast really just serve to clutter this up. Apart, that is, from Kebbell who is having a little fun. The dialogue is unremarkable, and at ten minutes shy of two hours, this is also just way too long. Pity. It has the resources to be good - just let down by the imagination of Messrs Cage and Turteltaub.", "created_at": "2022-04-04T09:34:49.078Z"}]