[{"movie_id": 29963, "review_id": "545a2f0bc3a3687d4d0016c6", "author_rating": 6.0, "review_text": "Good performances from Cornish, Whishaw and Schneider for a folks and costums movie.\r\n\r\nYou will enjoy it if you like the genre. If not ... well, probably it would be a slow and dull romantic drama for you.", "created_at": "2014-11-05T14:07:07.401Z"}, {"movie_id": 29963, "review_id": "630ae9a165c26c007fe672b1", "author_rating": 4.0, "review_text": "Bright Star is the rare biopic of an artist that actually provides some insight into its subject’s craft. Usually, a film about a writer, including such recent examples as To Olivia (Roald Dahl) and The Laureate (Robert Graves), will approach the creative process as 99-percent inspiration and 1-percent actual work – and sometimes not even that. Writing is taken as matter of course; poems come out straight out of the author’s mouth, fully formed like Athena emerging from Zeus’s forehead.\r\n\r\nBright Star doesn’t dismiss the notion of divine inspiration, but it does not tacitly take it for granted either; on the contrary, it acknowledges and articulates it (“If poetry does not come as naturally as leaves to a tree, then it had better not come at all”). Moreover, even though it declares “Poetic craft is a carcass, a sham,” it does so perhaps out of modesty (after all, “A poet is not at all poetical. He is the most un-poetical thing in existence. He has no identity”), before diving right into the crux of the craft itself (“A poem needs understanding through the senses. The point of diving in a lake is not immediately to swim to the shore but to be in the lake, to luxuriate in the sensation of water. You do not work the lake out. It is an experience beyond thought. Poetry soothes and emboldens the soul to accept mystery”).\r\n\r\nThis is all great stuff, and writer/director Jane Campion displays a sincere love for poetry with which she infuses her characters (who not only commit their favorite poems to memory, but can even recite verbatim from literary reviews). The problem is that her cast themselves are un-poetical and have no identity, and while this might serve them well in their poetic endeavors, as characters it renders them dull and unappealing; Ben Wishaw is wishy-washy as John Keats, and although credit is due Campion for not depicting him as a proto-rockstar (unlike, for instance, Leo DiCaprio’s Rimbaud in Total Eclipse), she loses many points for portraying Keats’s romantic interest Fanny Brawne (Abbie Cornish) as a proto-groupie (early on, in order to impress him, she quotes some of Keats’s verses back to him, as if he weren’t familiar enough with his own work).\r\n\r\nI’m aware that an artist’s love life, or lack thereof, tends to inform his creative output, but the romance between Wishaw and Cornish is so corny and mushy that we can’t believe such saccharine sentiment could ever translate into Keats’s sublime lyricism. Only Paul Schneider as the sardonic Charles Armitage Brown, Keats’s fellow poet, comes across as a sensible person who can tell the difference between poetry and real life; he starts out as boorish for the sake of boorishness, but he grows on us the more we realize that his contempt for the shallow Fanny is well-deserved (I especially enjoyed when he tricks her with a question about Paradise Lost’s non-existent rhymes).", "created_at": "2022-08-28T04:05:53.374Z"}]