[{"movie_id": 616037, "review_id": "62742e148e2e0000a97e3876", "author_rating": null, "review_text": "Pretty good ngl. Something new i enjoyed it", "created_at": "2022-05-05T20:05:40.542Z"}, {"movie_id": 616037, "review_id": "62b57d4b25b95500615f1ae8", "author_rating": null, "review_text": "One of the best MCU up to date. Gorr is my favourite villain so far. Chris Hemsworth is amazing as always. The story is truly awesome, the visuals are stunning. Another Taika banger", "created_at": "2022-06-24T09:00:59.842Z"}, {"movie_id": 616037, "review_id": "62c437ce22e48038847e2b0c", "author_rating": null, "review_text": "The God of Thunder returns in Marvel Studios’ “Thor: Love and Thunder” and audiences find that Thor (Chris Hemsworth), has been doing missions with the Guardians of the Galaxy while he works himself back into shape and looks to find a new purpose in life.\r\n\r\nThor has been taking the spotlight in many of the missions and when multiple calls for help arise, Thor opts to go off on his own to address a particular call for help while the Guardians head on their way to help others.\r\n\r\nIt is learned that a being named Gorr (Christian Bale) has been killing Gods and Thor is eager to put a stop to him before he can do more damage. His mission soon puts him on a collision course with Gorr and The Mighty Thor (Natalie Portman) who being his ex and wielding his former weapon causes more than a few funny and awkward moments.\r\n\r\nIn a race to save captured children, rally the gods, and defeat Gorr, Thor, and Jane along with Korr (Taika Waititi) and Valkyrie (Tessa Thompson), embark on an epic adventure in a race against time.\r\n\r\nWhile audiences have come to expect Marvel films to be epic cinematic events, this film is less on the over-the-top action sequences in favor of establishing new circumstances and challenges for the characters going forward.\r\n\r\nWhile there are indeed action sequences and plenty of VFX, it does not have the action or intensity of several of the past films. What it does offer is a good mix of action and humor with enjoyable characters old and new and establishes scenarios for the MCU going forward.\r\n\r\nBale is very good as Gorr and you understand his motivations clearly as while evil, he has a degree of sympathy towards his character which makes his creepy performance all the more compelling.\r\n\r\nThe cast works very well with one another and there are two scenes in the credits which open up all kinds of possibilities for the future as we are told Thor will return before the credits even begin to roll.\r\n\r\nThe film also has considerable music and I joked to myself that Guns and Roses are going to be getting a big check due to their music being used frequently during the film as well as that of other artists which helps make the film an enjoyable outing from start to finish which should delight fans as we wait to see for the next cinematic offering from Marvel.\r\n\r\n4 stars out of 5", "created_at": "2022-07-05T13:08:30.584Z"}, {"movie_id": 616037, "review_id": "62c8912b13a320004c6c0a70", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/thor-love-and-thunder-spoiler-free-review\r\n\r\n\"Thor: Love and Thunder boasts a bittersweet story about finding peace and love in suffering and pain, without forgetting the necessary thunderous action that reaches its best level in a long sequence surrounded by a breathtaking black-and-white color palette.\r\n\r\nChristian Bale stands out with a terrifying performance as one of MCU's best villains in recent years, while Chris Hemsworth and Natalie Portman share excellent chemistry. Visually distinct and with a unique soundtrack, the formulaic screenplay benefits immensely when focusing on the complex arcs of each character.\r\n\r\nStill, the continuous comedy bits - far from the hilarious creativity of the past - deny further exploration, removing emotional value from the third act. The action featuring generic CGI shadow monsters holds predictable issues, and an irrelevant plot deviation only serves as a teaser for future content.\r\n\r\nOverall, Taika Waititi succeeds yet again, but this time, he fails to reach the full potential of the premise.\"\r\n\r\nRating: B+", "created_at": "2022-07-08T20:18:51.906Z"}, {"movie_id": 616037, "review_id": "62c9df1064de350050dfdb1f", "author_rating": 7.0, "review_text": "After a rocky start, _Thor Love and Thunder_ is able to find its footing during delivering a fun and despondent Thor adventure filled with a tremendous amount of heart.\r\nIt is no surprise that this film is far from perfect, and that is not more evident than the beginning of the film. The entire first act feels so disjointed and rushed. You get thrown plot point after plot point and get whipped from planet to planet which results in the viewer not being able to lock in on the story. I really enjoyed the scenes we got from Gorr and Jane during this act, but they felt a little underdeveloped and rushed. The comedy was a little thick during this section, some jokes completely missed, but it was nothing that was overbearing that it hurt the experience. Once the movie enters the second act and begins focusing on Jane the entire gets much better. It is here where you can really see the balance that Taika Waititi brought during Ragnarök with some moments rivaling the best from that film. The ending of this film has some really great action and cinematography, some may argue it's among the best in the MCU. As the movie credits rolled, I was very satisfied to the conclusion of this film and am ready for more Thor action in the future.\r\nThe acting all around was excellent in this film, I found the dynamic between Jane and Thor worked much better than in previous films. They had real chemistry on screen, and you could feel the love the two previously shared unearth with each additional scene. There are some really great conversations that dive into their relationship that were done fantastically. Christian Bale was menacing as Gorr, his demeanor was sinister and completely unhinged as he delivered crazy laughs while delivering his villain manifesto. It gave me serious flashbacks to Heath Ledger’s Joker. I just wish we got to see more of him in the film, but the bit we did see was top tier villainy in the MCU.\r\nThe music in this film blends with the scenes very well. When the Guns N' Roses guitar starts playing you know it is about to go down and I could not help but smile. While the beginning of this film was bad, I can admit, the ending was so great that it averaged out the movie and made it a very enjoyable experience.\r\n\r\n**Verdict:** _Good_\r\n\r\n**Score:** _7/10_", "created_at": "2022-07-09T20:03:28.675Z"}, {"movie_id": 616037, "review_id": "62ca8c62e8131d068b119bf7", "author_rating": 5.0, "review_text": "**Thor: Love and Thunder** is a sequel to the 2017 film Thor: Ragnarok. It is written and directed by Taika Waititi and based on, of course, the Marvel Comics by Stan Lee. The film stars Chris Hemsworth as Thor, Natalie Portman as Jane Foster / Mighty Thor, and Christian Bale as Gorr the God Butcher.\r\n\r\nAnd the story? The gods are in danger! The God Butcher is coming for them! And only the mightiest of them all can stop him: Thor. But Thor is in bad shape. He's lost his hammer, his friends, and his confidence. He'll need all the help he can get to save the day. He'll have to relearn what it means to be a hero, and Jane Foster will have to become the Mighty Thor.\r\n\r\nI was looking forward to this movie. I loved Taika Waititi's direction in Ragnarok, and the cast is amazing. I was hoping for another fun, fast-paced, and humorous film like its predecessor. But unfortunately, Thor: Love and Thunder falls flat. The story is convoluted and slow-moving, and there are too many characters for any of them to get enough development. The humour is forced, and it frequently fails. And the ending is just...Stranger things have happened, I suppose.\r\n\r\nI was disappointed in **Thor: Love and Thunder**. If you're a die-hard Marvel fan, you might enjoy it, but if you're looking for another fun and exciting Thor film, I think you'll be disappointed, too.", "created_at": "2022-07-10T08:22:58.350Z"}, {"movie_id": 616037, "review_id": "62cc827fe8d0280052f1c8e1", "author_rating": 6.0, "review_text": "This was my favourite of the Marvel franchises, but boy have we now plumbed the depths. Taika Waititi presents us here with a mess of a film that dumps just about all of the original exciting Norse mythology and legend, and substitutes it with something little better than a cartoon. Chris Hemsworth does try quite hard, and nobody could ever doubt Christian Bale's commitment to his roles - he must have lost half his bodyweight as he portrays the emaciated \"Gorr\". This poor fellow loses his daughter but has hopes that his local god will step in. Nope, as Jordan Peele might have said, and as the evil necro-sword mysteriously appears in his hand, he duly dispatches this thoughtless immortal and thereby vows to do the same for all the rest. When several Asgardian children are kidnapped and taken to the shadowland, it falls to Thor, \"King Valkyrie\" (Tessa Thompson) and the newly empowered - but terminally ill - \"Jane\" (Natalie Portman) to thwart this plan. Along the way, they try to recruit some other gods from different pantheons - notably Zeus (a hammily absurd Russell Crowe) but ultimately it's all down to these three to save the day. There is a bit of humour at the start - and maybe Jane Fonda would have been an useful addition, but for the most part this film is neither one thing nor another with too much romance - a serious illness that just didn't belong in a light-heated fantasy film that treats death as an occupational hazard for the characters; and the need to generate and sustain the supporting characters reduced the impact of Thor to little more than a team player in a red cape. The ending is weak, but frankly no more so than most of the rest of this truly disappointing feature. If you stick right to the end of the credits, you will see that perhaps Hercules is to be the next topic for this character - I can only hope Sir Kenneth Branagh is available. Looks great on a big screen, superb visual effects etc., but Marvel have lost their way with this...", "created_at": "2022-07-11T20:05:19.711Z"}, {"movie_id": 616037, "review_id": "62ce1450e62719004cabaaae", "author_rating": 6.0, "review_text": "To be fair, Waititi has some really funny material in _Love and Thunder_. Everyone in the extremely talented cast looks to be having a ton of fun and the villain is out of this world good. The events of the film feel kind of pointless, especially with repeat viewings. Phase four of the MCU has this aimless direction that is heading towards a ton of projects that no one is really all that excited for. After Endgame and Spider-Man: No Way Home, it honestly feels like the MCU has reached its peak. _Thor: Love and Thunder_ is mostly just a brightly colored filler episode that will likely be forgotten about like most of the _Thor_ franchise.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Thor-Love-and-Thunder-2022-Review-Taika-Waititi-Overload", "created_at": "2022-07-13T00:39:44.724Z"}, {"movie_id": 616037, "review_id": "62e6bf79d5dbc2005edbbd68", "author_rating": null, "review_text": "The worst Thor movie what I ever seen...", "created_at": "2022-07-31T17:44:25.153Z"}, {"movie_id": 616037, "review_id": "63001c6496e30b007a812c49", "author_rating": 7.0, "review_text": "**It’s definitely worth seeing but doesn’t quite reach the height of its predecessor.**\r\n\r\nThis is a tough movie to explain. I can’t say there was a part of Thor: Love & Thunder I didn’t enjoy, but I also left the theater feeling unsatisfied. There were great parts! The space goats and Thor’s jealous battle ax were highlights. There was a big fight scene with some of the best special effects in a Marvel movie to date. But the ending felt sudden and disappointed me, while the movie overall lacked something that made me connect and care about the plot.", "created_at": "2022-08-19T23:27:32.517Z"}, {"movie_id": 616037, "review_id": "6306444b263462007bc27176", "author_rating": 7.0, "review_text": "As usual for the MCU, <em>'Thor: Love and Thunder'</em> is a good watch. I did want more from it, though.\r\n\r\nChris Hemsworth remains the star of the show, I'm adding nothing new by saying he is just perfect for the role. Tessa Thompson, Taika Waititi and Natalie Portman all make for good support. Christian Bale is also someone I enjoyed, I like the look of his character but kinda felt that I wanted to see more of him - it's like we see a beginning and an end, but part of me feels like we coulda had something in-between.\r\n\r\nThe special effects are solid, as is the music; even if the track choices aren't the most creative. I probably would've shortened the run time a little, though that isn't anything all that noteworthy to be honest. There are some funny moments in there, which is always something I expect from a Taika Waititi flick.\r\n\r\nAs for me and my own personal Thor ranking, this  - like the 2011 original (also 3*) - isn't one of my favourites (fwiw, I enjoy <em>'Thor: The Dark World'</em> and <em>'Thor: Ragnarok'</em> (both 4*) way more) but it's still a fun enough time that I'd recommend it.\r\n\r\nI simply cannot (cannot, I tell you!) believe they didn't just call this 'Thor Four' btw... 💔", "created_at": "2022-08-24T15:31:23.057Z"}, {"movie_id": 616037, "review_id": "631b52e17314a1007e656442", "author_rating": 2.0, "review_text": "Bad humor, characters teleporting all over the place, terrible plot. A thing capable of altering the universe happens to exist, you don't even need infinity stones *facepalm* I can't believe there is a worse Thor movie than The Dark World.", "created_at": "2022-09-09T14:51:14.073Z"}, {"movie_id": 616037, "review_id": "63230629db154f007abcd629", "author_rating": 8.0, "review_text": "Best Movie by MARVEL. LOVE YOU THOR", "created_at": "2022-09-15T11:02:01.534Z"}, {"movie_id": 616037, "review_id": "632471b5ae6f09007f28026e", "author_rating": 8.0, "review_text": "Nice actin movie.", "created_at": "2022-09-16T12:53:10.005Z"}, {"movie_id": 616037, "review_id": "63d643c1955c65008479676d", "author_rating": 3.0, "review_text": "It appears that disgraced asshat Bob Chapek (not going to link to IMDb for this asshat since his bio there is just corporate gibberish written by Disney themselves, and not updated to show that he got fired) has scared away any form of actual talent from Disney so that even when they do something that is not blatantly woke and preaching it still turns into a turd.\r\n\r\nAlready in the first scenes I was going what the f… is this? Are they turning the franchise into a comedy?\r\n\r\nThor himself has been turned into a rambling moron. The rest of the Gods are either unbelievable assholes or fat slobs only caring about their orgies or some combination thereof. Most of the movie I was just cringing in my seat.\r\n\r\nIf they were actually going for more of a comedy movie than an actual Thor movie they failed miserably. The “jokes” where unfunny, unintelligent and just bad. Superhero slapstick at best.\r\n\r\nThe only character that I found remotely likable and cool in the movie was King Valkyrie. Jane Foster was not too bad either. The rest was just a joke. The portrayal of the mighty God Zeus and Olympus was an affront. The bad guy was not too bad although I would not call him likable of course. He is not supposed to be likable. At least he was not turned into a parody.\r\n\r\nIt is really a shame because the underlying story is not half bad… if it had been given to someone with actual talent to implement. It is predictable of course but it is okay. If it had only been given to someone who could have turned it into a real Thor movie instead of this failed comedy turd.\r\n\r\nI have to admit that I did not have my hopes up very much when starting to watch this movie. Given what Disney has turned into I was afraid that they were literally going to turn Thor into a female and luckily that did not happen. Unfortunately they found another way of ruining the franchise. This movie is nothing like the previous Thor movies. I really liked Thor: The Dark World for example. To me this movie is very close to a franchise killer.\r\n\r\nThe one and a half stars is for the special effects. They were pretty good. The rest of this movie is really bad.", "created_at": "2023-01-29T10:00:33.590Z"}]