[{"movie_id": 8843, "review_id": "5bd2944f0e0a2616d80049a1", "author_rating": 6.0, "review_text": "I can't... I can't call _The Cell_ good... But it's artistically spectacular, features one of D'Onofrio's best roles ever, and though it has unoriginal concepts, it uses them in originally thematic ways. I can't call _The Cell_ good... But I can tell you to watch it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-26T04:13:03.243Z"}, {"movie_id": 8843, "review_id": "5bd39a16c3a36820e900b4a2", "author_rating": 10.0, "review_text": "The Cell is a forgotten classic. Way ahead of its time, it is a cinematic delight. It could be best described as a psychological thriller but it is so much more. Don't hesitate to enjoy this gem. It is visually stunning with a gripping story. JLo is good in this despite her booty never being the focus. Yes, it makes an appearance in a side view but it doesn't overwhelm. For serious, this is a 10-star film. Have fun!", "created_at": "2018-10-26T22:49:58.592Z"}, {"movie_id": 8843, "review_id": "606b5c6998f1f100785ba2df", "author_rating": null, "review_text": "_**Going inside the mind of a psycho**_\r\n\r\nA child psychologist who’s adept with an innovative procedure (Jennifer Lopez) agrees to help FBI agents (Vince Vaughn and Jake Weber) by entering the mind of a comatose serial killer (Vincent D'Onofrio) in order to find clues to where his latest kidnap victim is held captive. Will they find her in time? \r\n\r\n\"The Cell\" (2000) is a psychological crime drama/thriller that combines “The Silence of the Lambs” (1991) with “The Matrix” (1999) and the style of Francis Ford Coppola’s “Dracula” (1992); meanwhile the sordid elements recall “The General’s Daughter” (1999). Although the plot seems convoluted, the film is actually easy to follow and it’s a veritable feast for the eyes. \r\n\r\nThe best ‘feast’ is Jennifer in her prime. Also on the female front is Catherine Sutherland as one of the victims. The only thing that takes down my rating is the early scene showing how the sick phukk gets his jollies with female corpses. Who wants to see that? How about just hinting at it or describing it verbally?\r\n\r\nThe film runs 1 hour, 47 minutes, and was shot mostly in Southern Cal, e.g. San Diego (neurosciences facility), Los Angeles (hospital), Bakersfield (the silos), Taft & Pomona; as well as the Namib Desert (mind scenes with the boy).\r\n\r\nGRADE: B", "created_at": "2021-04-05T18:52:25.061Z"}]