[{"movie_id": 283552, "review_id": "58d809b89251411fdc05e1c6", "author_rating": 8.0, "review_text": "**A tale of imbalance between love and grief.**\r\n\r\nThe film was based on the Australian novel of the same name. It was a recent book, but a period drama about a World War I veteran who just returned home. So I feel this film was made too soon. Because it seems so classic, only if we had given some time to pick up its popularity. I mean the literature version which at least needed a decade of freedom before heading to the big screen. You know, this same kind of tales from the past is what now we consider epic, which looks even better in the cinema. Anyway, this film was good, but the future adaptations will be much more effective for its viewers.\r\n\r\nFrom the director of 'The Place Beyond the Pines' who also wrote for the screen. The title gives a brief insight of what kind of a tale it is. But the film was even deeper and darker with emotionally strong. The island where it takes place reminded me 'Song of the Sea', though it is not a fantasy film. If you love views, nature, particularly seaside, this film will suit you.\r\n\r\nBesides, the story was much stronger, so the backgrounds will fade away when all your focus fall on its narration. For me the location was the first in the film, the hundred year old setting, away from normal society was the most impressive. It helped to narrate this wonderful drama which contained the message of moral imbalance.\r\n\r\nTom Sherbourne, a World War I hero who relieved from the duty returns home and becomes a lighthouse keeper in an isolated island on the west coast of Australia. He marries a woman whom he has instantly fallen in love. Now they are living far from the human world. A couple of tragedy strikes in their life following one another.\r\n\r\nBefore coming out of that trauma, they find a baby on a lifeboat that washed up on their island and decides to adopt her. But after some times when they return to the mainland, they come to realise what they're doing is not legally nor morally correct. From onwards how it affects their each others trust, how far it all goes and how the story ends was told in the remaining parts.\r\n\r\n> ❝You only have to forgive once. To resent, you have to do it all day, every day.❞\r\n\r\nDespite the book was modern, the storytelling was so vintage. I'm talking about the way the plot and characters developed, including how it concludes. For the present generation, if you are familiar with a few similar works from the past, then you would predict this film. I mean not the entire film, but some scenes are at its initial stage can be foreseen. Because sometimes, some developments are called coincidence, but when you have plenty of them, that is called very intentional. That was the only negative of this film. By avoiding them the tale would not be possible. In other way, it could have had stretched even further which are unnecessary details.\r\n\r\nI did not care the clichés. For me it was a fine drama. The performances were magnificent. It looked to me an Oscar worthy, from both Michael Fassbender and Alicia Vikander. Even Rachel Weisz was for the supporting role. So tick marks for cast and locations, also the screenplay and score. But the sad part is the film was not received very well, especially by the jackass film critics.\r\n\r\nIt's not the same case with regular movie goers, particular I think the older and matured people would like it better. But it's not another 'Pride and Prejudice' from the family audience perspective. The events of the film and the outcome can be wrongly judged. Most importantly, it sets in the same world as ours, so everything is the near fact based. So the right and wrongs are inside the film, but not applicable for the filmmaking which I think a well done job.\r\n\r\nThe post climax scene, the one that comes before the end credit was very good. For this kind of tale, that kind of outro sets a final tone. Despite not an inspiring storyline, all the portrayal in the film was so poetic. Mainly because of slow narration with high influence of sentiments and most of the occasions being dialogueless. The length was not an issue if you like period dramas. Anyway, it was engaging theme, there's always something keeps happening. So I think this is one of the under-rated films of the year. It deserves much better recognition. If you haven't watched it yet, I recommend it and highly if you are 30+.\r\n\r\n_8/10_", "created_at": "2017-03-26T18:34:32.284Z"}]