[{"movie_id": 542178, "review_id": "6182edec8ed03f008df94bc4", "author_rating": 9.0, "review_text": "Yet again a great piece of art!", "created_at": "2021-11-03T20:15:40.920Z"}, {"movie_id": 542178, "review_id": "61910ed9a6d93100430c45b8", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-french-dispatch-spoiler-free-review\r\n\r\n\"The French Dispatch possesses all of Wes Anderson's trademark quirks, but this time, even hardcore fans of his unique style will struggle to not feel overwhelmed.\r\n\r\nEvery filmmaking department shines in such an impressive manner that one could call this movie a \"technical masterpiece\" packed with fantastic performances across the board. Unfortunately, the cliche criticism \"style over substance\" fits this picture too well.\r\n\r\nThe infinite amount of Anderson-ish quirks transforms the already uninteresting narrative with emotionally hollow characters into an extremely challenging, hard-to-follow story.\r\n\r\nIn four simple words: it's just too much...\"\r\n\r\nRating: C+", "created_at": "2021-11-14T13:27:53.032Z"}, {"movie_id": 542178, "review_id": "62229587e258600046ccc3b9", "author_rating": 9.0, "review_text": "Impeccably well made, supremely enjoyable.\r\n\r\nThis is only the second Wes Anderson film that I've seen (fwiw, first was <em>'<a href=\"https://letterboxd.com/film/moonrise-kingdom/\" rel=\"nofollow\">Moonrise Kingdom</a>'</em> which I didn't like all that much <em>*hides*</em>) and now I can better understand the hype that man gets. <em>'The French Dispatch'</em> is quality, plain and simple.\r\n\r\nThe ensemble cast are a delight, with many a familiar face spread across each segment and each one of them bringing entertaining performances. Frances McDormand would be my standout performer, closely followed by Benicio del Toro. Though, to be honest, all them are terrific - from Owen Wilson to Adrien Brody to Léa Seydoux to Timothée Chalamet to Jeffrey Wright. Christoph Waltz, Willem Dafoe and Bill Murray star too. Unreal casting, that!\r\n\r\nAnthology flicks can be hit-and-miss for me personally, though to be fair my predominant previous exposure to them has been via those cheaply made Disney animated sequels from yesteryear so time will tell if that feeling holds. I'm pleased to say here, though, that I thoroughly enjoyed watching one develop. It helps that this release knits the segments together seamlessly, with stunning cinematography, editing et al. Loved the animated part, too.", "created_at": "2022-03-04T22:41:11.814Z"}, {"movie_id": 542178, "review_id": "62404b3281a7fc008ca1938d", "author_rating": 7.0, "review_text": "I suppose like any newspaper or magazine upon which this compendium effort is based, there are some \"articles\" more interesting than others - and that's what this offers. Three elongated features form the centrepieces of this somewhat surreal comedy. As you might expect from Wes Anderson, these stories are eclectic, and delivered well by a cast that were well up for their tasks. My favourite of the three features Frances McDormand and Timothée Chalamet offering us some sort of Hemmingway-esque parody of revolution fought over a chess board - with quite humorous results. Humour is a strong feature of this film. I would say comedy, not so much. One has to pay attention to what is going on to get the best from the acting, the script and, as importantly, the imagery which effortlessly mixes monochrome and colour, and which is also bright, vivacious, and frequently just as informative as the dialogue. It does run out of steam at times, the themes could have been a little more compact, and the two side-stories - especially the travel report with Owen Wilson at the top of the film didn't work so well for me. I'm not an huge fan of eccentricity - it is all-too-often just hit or miss, but here we have more hits than not, and with a healthy swipe at journalistic values along the way, a bit of romance and some daft antics from a rogue Benicio del Toro, this is certainly worth watching.", "created_at": "2022-03-27T11:32:02.055Z"}, {"movie_id": 542178, "review_id": "62b0c3923a48c500620cf6d9", "author_rating": 6.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/the-world-through-pastel-colored-glasses-the-french-dispatch-review<a>\r\n\r\nWatching a Wes Anderson movie is a feast for the eyes. Few directors have such a distinct visual language. When you are watching a Wes Anderson movie, the audience knows it’s a Wes Anderson movie. _The French Dispatch_ is no different. It is a series of vignettes from the fictional French foreign bureau of the Liberty, Kansas Evening Sun’s last issue following the death of its editor, Arthur Howitzer Jr. (Bill Murray). Each scene is an extraordinarily detailed still life painting that welcomes the audience to the dreamy French town of Ennui-sur-Blasé. It’s what the world would look like if we were all wearing rose-colored glasses.", "created_at": "2022-06-20T18:59:30.757Z"}, {"movie_id": 542178, "review_id": "6306b838b04228007f4a8d5a", "author_rating": 10.0, "review_text": "This film might be a tie with Grand Budapest Hotel for my favorite Wes Anderson. It's wacky and creative. The pacing is so fast that it will need another watch to really appreciate. I wish I'd seen it on a big screen :-(  Did I mention the amazing cast and the super job they did?", "created_at": "2022-08-24T23:46:00.770Z"}]