[{"movie_id": 207703, "review_id": "54eb0afcc3a36836d90062eb", "author_rating": null, "review_text": "One of the most interesting movies to watch. Humor, action and adventure well plotted into this great movie. The action is just great.", "created_at": "2015-02-23T11:11:56.401Z"}, {"movie_id": 207703, "review_id": "556727cdc3a3681752001d65", "author_rating": 7.0, "review_text": "A nice surprise.\r\n\r\nI was not expecting anything from this movie but it turned to be a really funny one, borrowing from all the other spy's movies around.\r\n\r\nCollin Firth is a great choose and you can say the same for most of the cast, remarking also Samuel L. Jackson.\r\n\r\nAn easy movie for a brainless evening.", "created_at": "2015-05-28T14:35:57.174Z"}, {"movie_id": 207703, "review_id": "56207e5dc3a3680e16006271", "author_rating": null, "review_text": "The kinetic super-spy caper ‘Kingsman: The Secret Service’ will serve as a boisterous blueprint for those teen fanboys out there that will fancy an elaborate overload of James Bond-esque high-powered hedonism. It certainly does not hurt that the high-wire hysteria as showcased in the twitchy ‘Kingman’ is based upon the acclaimed comicbook series by Mark Millar and Dave Gibbons. Also, add into the mix the movie-making overdrive pedigree of director Matthew Vaughn (‘Kick-Ass’, ‘X-Men: First Class’) and slick, cheeky spy-spry send-ups that recall the over-the-top espionage genre and its exaggerated suspense-driven foundation. Well, ‘Kingsman: The Secret Service’ is a cockeyed, pulsating parody that works its ultra-violent magic for the Austin Powers crowd that wants to walk on the high-octane wild side of Bond’s universe.\r\n\r\nSure, ‘Kingsman: The Secret Service’ has its iffy moments where the blatant sexist overtones, magnified violent sequences and a generous bloody bounce of excess will have some stomping their feet in sheer indignation. The apparent knock on ‘Kingsman’ will be its robust ridiculousness and familiarity in Vaughn’s ‘Kick-Ass’ cartoonish vibe. However, the same elements that may cause some reservations with the film’s low-brow lunacy is also the same ingredients that trigger ‘Kingsman: The Secret Service’s carousing charm in majestic mayhem.\r\n\r\nThe grand gimmick behind behind kick-starting ‘Kingsman’s go-for-broke rollicking is casting the sophisticated presence of the Oscar-winning Colin Firth (‘The King’s Speech’) as dapper Harry Hart (aka ‘Galahad’), a polished and prominent superspy for a British secret intelligence society.  Hart’s top-secret spy network is headed up by Arthur (Oscar-winner Michael Caine). The secretive operation is based out of a notable tailor’s shop known as Kingsman. Also worth noting is that all the secret service agents are named after the famed knights of King Arthur’s Round Table. Go figure. In any event, the suave Harry Hart is the debonair face of the spy organisation and will play a critical part in both recruiting a young up-and-coming agent with decent physical skills and tracking down a worldwide menace bent of destroying the planet. It is all in a day’s work for the skilled, well-dressed licensed-to-kill operative.\r\n\r\nHart, who had been loyally connected to a fallen colleague from a past mission gone disastrous years before, decides to become a mentor for his late co-worker’s troubled son Gary ‘Eggsy’ Unwin (played by newcomer Taron Egerton) whose law-breaking conduct catches the attention of the police. Feeling a sense of responsibility for his deceased spy buddy’s wayward kid, Hart takes Eggsy under his wings and determines to shape the misguided youngster into resilient Kingman stock. After all, Eggsy has the needed physicality (we are told he is an exceptional gymnast) and roguish spunk to join the ranks of the seemingly understaffed spy outfit. Soon, Eggy and other recruits will be grilled through rigorous training from Kingman member Merlin (Mark Strong) as they look to fill the spot vacated recently from the dead Lancelot.\r\n\r\nThe dearly departed Lancelot, it turns out, was the latest victim of ruthless criminal mastermind Valentine (Samuel L. Jackson). The flashy Valentine, a billionaire gone bonkers, hopes to control the world’s climate change. He is known as a mega-wealthy entrepreneur and philanthropist but his sinister heart yearns for some heavy-handed dastardly deeds that puts him on the immediate radar for Hart and his crafty Kingsmen to spring into action. At the demented Valentine’s side is the deliciously disabled exotic henchwoman Gazelle (Sophia Boutella) with the treacherous knack for disarming her adversaries with blazing blades.\r\n\r\nThe bombastic and eye-pleasing ‘Kingsman: The Secret Service’ sets out to have one goal in mind: to highlight its thunderous homage to spygate spectacles that salute everything from the Agent 007 flicks and related free-wheeling 60’s fare such as the ‘Matt Helm’ and ‘Derek Flint’ spy franchises to the recent espionage vehicles that invite the millennium-based harried heroes such as the Jason Bournes and Jack Ryans of the world into the frenetic fold.  It is fast, furious and unapologetic in its rambunctious spirit as a ricocheting romp.\r\n\r\nVaughn, in all his rousing Tarantino-esque tactics, unleashes a visceral assault that is visually wrapped in his escapist package of an adrenaline rush. Wisely, Vaughn incorporates some of his ‘Kick-Ass’ colourful calisthenics to arm his playful spy yarn. As the veteran spygame squires, both Firth and Caine are game for the frolic they signed up to participate in with puckish aplomb. Jackson brings his usual explosive badass persona to the table as the villainous fashion plate Valentine. The 14 year-old males will draw their adventurous inspiration from Egerton’s junior spy Eggsy Unwin. Some may become nostalgic when uncovering the likes of spotting ‘Star Wars’ icon Mark Hamill as an imperiled climate changer scientist caught in the crazy clutches of Jackson’s diabolical antagonist. \r\n\r\nAlthough not the most inventive take on ridiculing the spy genre with over-extended finesse and sensationalism, ‘Kingsman: The Secret Service’ is still a preferred jolting distraction at the beginning of an early stillborn movie season.\r\n\r\nKingman: The Secret Service (2015)\r\n\r\n20th Century Fox\r\n\r\n1 hr. 40 min.\r\n\r\nStarring: Colin Firth, Taron Egerton, Michael Caine, Samuel L. Jackson, Mark Strong and Sophia Boutella\r\n\r\nDirected by: Matthew Vaughn\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Spy Thriller/Action & Adventure/Fantasy & Action", "created_at": "2015-10-16T04:34:37.336Z"}, {"movie_id": 207703, "review_id": "58c1503b925141734f009c3b", "author_rating": 5.0, "review_text": "'Kingsman: The Secret Service' is a comedy film that satirises spy movies such as the James Bond franchise. Gary 'Eggsy' Unwin (played by Taron Egerton) is a normal working class 18 year old from London who gets recruited into a super secret spy organisation. Humour comes as he tries to mix with these posh and suave upper-class stereotypes.\r\n\r\nMatthew Vaughn has included his typical ultra stylised violence ('Kick Ass') and it does boast a good sound track. There are a lot of nods to films such as Quentin Tarantino's 'Pulp Fiction' but it just reminds me of examples when things have been done much better. The highlight of the film for me was a scene in which Colin Firth violently massacres a crazy church to the music of Lynyrd Skynyrd ('Free Bird') whilst almost seeming like a continuous long shot.\r\n\r\nThe screenplay is very unoriginal and the dialogue with the young actors in particular is cringe-worthy. Tarantino type set-pieces just come across as annoying as the film fails to have any cleverness or creativity.\r\n\r\nApart from Colin Firth every actor is either average or just really bad. Samuel L. Jackson, in particular, is worse than usual as he tries to add some freshness to his regular spiel by trying to affect an annoying and distracting speech impediment.\r\n\r\n'Kingsman' is going to appeal to the intended target age group as it does contain scenes of fantasy violence depicted as \"cool\" whilst characters swear. It would also help your enjoyment of the film if you have not seen the many, many examples where each scene had been conducted much better.\r\n\r\n★★½", "created_at": "2017-03-09T12:53:15.568Z"}, {"movie_id": 207703, "review_id": "5ae48c870e0a2669f4008764", "author_rating": 9.0, "review_text": "If you like old-fashioned James Bond style movies you probably like this one. It is a bit more outrageous and has a few more overly silly moments than the old Bond movies but on the whole this is a very fun and enjoyable secret agent movie.\r\n\r\nGary is, via a few twists and turns at the beginning of the movie, recruited by a secret agent employed by a super secret private organisation with remarkable resources. Their agents looks and behaves like London upper class gentlemen but have remarkable fighting skills. The initial scenes when Gary is recruited are just great.\r\n\r\nGary is then submitted to a rather gruesome training schedule and at the same time the main plot plays out in parallell. Of course the two threads merge towards the classical showdown with the megalomaniacal evil mastermind in the end where, naturally, Gary gets to save the world.\r\n\r\nThe movie has all the “goodies” of a secret agent movie. British gentlemen agents, action, secret agent “stuff” like shops that are not what they look like, hidden entrances into secret bases, rooms that are actually elevators and of course gadgets, lots of gadget to help our heroes thwart the evil mastermind’s nefarious plans. Of course said mastermind have a personal henchman a la Oddjob to do the more grisly parts of his evil biddings. I quite liked this rather unique henchman, or rather henchwoman, and her odd weapons. More so than the main villain which I found a bit bland at times.\r\n\r\nOn the whole I enjoyed this movie a lot. However, there are some silly parts which drags it down a bit. I especially disliked the colorful exploding heads towards the end of the movie. That just felt like the producer/director was smoking some funny stuff when making those scenes. There were a few other scenes which I felt was going too much towards silly comedies as well. Without those I would probably have added a star.\r\n\r\nAll things said this was well spent 130 minutes as far as I am concerned.", "created_at": "2018-04-28T15:00:23.903Z"}, {"movie_id": 207703, "review_id": "6352fb3e417aaf008269f05c", "author_rating": 8.0, "review_text": "**Kingsman reinvents James Bond for a younger generation with enthusiastic, heart-pounding, savage energy.**\r\n\r\nKingsman: The Secret Service bursts onto the big screen with an explosion celebration of all things spy. Matthew Vaughn clearly loves James Bond, Mission Impossible, and Jason Bourne with this youthful, vibrant, action-packed homage to the genre. The gentlemanly charm mixed with the brutal face-paced action and bright, colorful sets feels familiar and new simultaneously. Kingsman tells a coming-of-age tale through the lens of a spy thriller. Kingsman has a fun, fresh, and innovative energy that speeds from beginning to end, telling a simple but engaging story in a delightfully entertaining way.", "created_at": "2022-10-21T20:04:14.639Z"}, {"movie_id": 207703, "review_id": "63b2cc1aa9117f05b0d9f7dd", "author_rating": 7.0, "review_text": "Despite the fairly experienced cast here, this rather enjoyable rip-off of all things \"Bond\" and \"U.N.C.L.E\" really belongs to the ballsy and engaging effort from Taron Egerton. He is the young \"Eggsy\" who lives with his mum (Samantha Womack) and her gangster boyfriend \"Dean\" (Geoff Bell). After a pretty daring altercation with his goons, the youngster ends up in a police station where he remembers a gift that was given to his mother when his father mysteriously died. He calls a number, is duly sprung and introduced to the dapper \"Harry Hart\" (Colin Firth) who quickly enrols him in a school that isn't for the faint hearted. Survival here is just the start of his adventures as he is quickly embroiled in a world-domination scheme being hatched by gazillionaire \"Valentine\" (Samuel L. Jackson) - aided by his lethal-limbed hench-woman \"Gazelle\" (Sofia Boutella). Luckily he has the sagely \"Merlin\" (Mark Strong) and the versatile \"Roxy\" (Sophie Cookson) to help him - but can he thwart the dastardly plan? Jeopardy isn't high on director Matthew Vaughn's priority lists here, but entertainment and plenty of fun action-escapades are, and they deliver well. Firth is on fine form as the deadly but debonaire mentor; Sir Michael Caine adds a soupçon of class to the proceedings and Jackson looks like he is having fun in his bright red Converse trainers. It does take just a shade too long to get going, but Egerton works really well as the cheeky chappy with a brain in his head and a solid sense of common decency - particularly useful when he is facing overwhelming odds and doom lies menacingly before him. It's a great looking film, the visual effects are used sparingly and all told this is a characterful, well-written, and good fun yarn that still tips it's hat to the espionage genre - but in a playful and slightly mischievous way. Good fun.", "created_at": "2023-01-02T12:20:42.114Z"}]