[{"movie_id": 402900, "review_id": "5bb5bf94c3a368151a00b5e6", "author_rating": 5.0, "review_text": "It was pretty gay. Could've been a lot gayer though.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-10-04T07:21:56.581Z"}, {"movie_id": 402900, "review_id": "5e7beccd109dec1cbb00d7fe", "author_rating": 10.0, "review_text": "Ocean's Eight has been my comfort movie for the longest time. I adore the strength of the cast, and the dynamics they possess as a whole, not to mention the brilliant cinematography. The humour and the relationships of the characters brings a sense of lightheartedness to the movie, which I personally adore. Overall, it's a very underappreciated movie in terms of the writing, casting and cinematography, as well as the costume and makeup departments.", "created_at": "2020-03-25T23:44:13.760Z"}, {"movie_id": 402900, "review_id": "5fee4c0985702e003e923600", "author_rating": 8.0, "review_text": "Good stuff, this.\r\n\r\nI really enjoyed <em>'Ocean’s Eight'</em>. It's a sizeable drop off from the great <em>'Ocean's Eleven'</em>, but I actually - just narrowly - enjoyed it more than <em>'Ocean's Twelve'</em> and <em>'Ocean's Thirteen'</em>. With this 2018 film, they got a lot right. The pacing, but also the casting.\r\n\r\nIt's nice to have Sandra Bullock (Debbie) return just to keep the continuity going, that as well as the fact that she's very good in this. I rate her as an actress, but sometimes I find her performances irritating - here, the complete opposite, I love how charismatic and confident she plays Debbie. Cate Blanchett (Lou) supports her well, too.\r\n\r\nThe rest of the cast are strong choices. I enjoyed seeing Rihanna and Awkwafina, along with Sarah Paulson, Mindy Kaling and Anne Hathaway. James Cordon appears too, he seems to split opinion but I like him.\r\n\r\nThe plot is good, very watchable. I found myself questioning one moment of the nitty-gritty event, but otherwise I thoroughly enjoyed seeing it unfold. I also liked the editing around it. The ending isn't the greatest, but still more than satisfactory.", "created_at": "2020-12-31T22:09:13.715Z"}, {"movie_id": 402900, "review_id": "63c20985a5743d00dd550f9b", "author_rating": 1.0, "review_text": "They tried to do the Ghostbusters thing with this one didn't they? No, not the all female cast thing, which I guess they did try and do, but really I mean the \"if you don't like this movie, we're going to threaten you with horrible labels\" thing.\r\n\r\nAnd the result are cautionary reviews that all kind of sound as if the people are too afraid to call it boring...so they are going to point out the one decent performance in the film.\r\n\r\nBut even then, you got the feeling that some of the cast wasn't really into threatening the audience to like the movie. Watching the interviews, you got the feeling that, yeah, they knew it was boring. Only one or two of them looked really prepared to be combative about forcing the public to love it.\r\n\r\nMeanwhile, this is a heist film, you are supposed to have comedy or action and in many cases both...and at least they tried for comedy in jokes that didn't entirely land. In fact, for the most part, the attempts at humor left you with a \"meh\" feeling at best. You can see where its supposed to be a laugh but it doesn't even really turn a cheek in the right direction.\r\n\r\nAnd then the action was all under cooked.\r\n\r\nSo you're left with a story about a woman that is going to double cross the Oceans team, has the opportunity to do it, but then doesn't at the last minute for...reasons that are never really explained.", "created_at": "2023-01-14T01:46:45.710Z"}]