[{"movie_id": 273477, "review_id": "563e5f7692514118670046cd", "author_rating": null, "review_text": "We certainly get the inside joke about wanting to skewer something as raucous and ridiculous as lambasting nonsensical and numbing grade B horror flicks that are worthy of such scrutiny. After all, the temptation is just too much to resist in not exposing such throwaway thrills of intentional insipidness, correct? Plus, incorporating a mixture of smarmy filth and frolic involving menacing zombies, hormonal teens, bouncy bimbos and any other fright-driven clichés that one can think immediately off-the-cuff should be enough to satisfy the creepy concoction of craziness, right? Well wrong...especially when the experimental goosebump gags fall flat and feel synthetically repetitive in the over-indulgent and inane fear farce Scouts Guide to the Zombie Apocalypse. \r\n\r\nSure, some will automatically gravitate to the outlandish Scouts Guide to the Zombie Apocalypse and invite the spirit of the movie's manufactured foolishness as an elaborate playful put-on. In many ways, co-writer/director Christopher Landon wants to promote the silly-coated salaciousness of his teasing teen-oriented terror tale with a sly wink and anticipates that the audience will embrace Zombie Apocalypse as an unconventional, naughty-minded tangy treat for giddy thrill-seekers. Sure, Landon's off-kilter humor horror show is meant as an escapist ruse and wears its badge of honor as a brain-dead flesh-and-blood fright fable garnering cheap chuckles. Nevertheless, Scouts Guide to the Zombie Apocalypse feels relentlessly lazy, mean-spirited and connects as a raunchy wasteland of sluggish juvenile jolts and jabs.\r\n\r\n\r\nThere is no excuse for Scouts Guide to the Zombie Apocalypse to present such a witless,  misplaced macabre mess. In an age where spoofing zombie flicks in cinema can be high-minded and heralded in both creepiness and creativity in the shadows of such riotous offerings as Shaun of the Dead and Zombieland, it is inexplicable how something like the rancid and toothless Zombie Apocalypse can be so arbitrarily clueless and contemptible in its strained search for crafting off-balance laughs. Again, it is realized that zombie cinema--however serious or silly-minded--is not exactly on the food chain of being considered a viable selection for the American Film Institute anytime soon. Still, there should at least have been some sense of smartness and perception injected in the aimless zaniness that Zombie Apocalypse emits routinely in its languished lunacy. Instead, Landon and his fellow screenwriters invite a series of empty-minded shock value shrills to the proceedings and hopes that the viewers will embrace the cluttered chaos without question. Sadly, some will do just that (read: the indiscriminate teen demo in general) as they will go with the flow and bask in the baseless swamp of tasteless titillation. Consequently, Scouts Guide to the Zombie Apocalypse is about as adventurous, amusing and intriguing as a medieval stoning in a rural town square.\r\n\r\n\r\n\r\nUndoubtedly, Scouts Guide to the Zombie Apocalypse needs the approval of its boys locker room impishness to feature such graphic and goofy-minded displays of sexual body part piercings to pad the already morose stupidity put forth in desperate vain. If your idea of horror-minded high jinks include the subjection of zombie-related severed penises and constant groping of female breasts then guess what...Zombie Apocalypse will certainly satisfy one's hormonal guilty pleasures in a heartbeat. In addition, it pays to also have some stunt casting and add to the dumb cheekiness where the likes of the once celebrated Oscar and Emmy-winning veteran actress Cloris Leachman serves as the token oldster to certify the gimmicky warped proceedings (perhaps Leachman's former Mary Tyler Moore Show co--star in the beloved pop cultural and iconic Betty White was not available to sign on the dotted line for this teen terror train-wreck?).\r\n\r\nThe premise, while highlighting the gore and boyhood gratification of wet dreams, involves a group of youngsters that belong to a scouting organization while being taught the efficiency of  leadership and self-reliance. Naturally, these boys will put their merit badges to the test as they must combat the overflowing presence of threatening zombies that are infiltrating their small community. Not only must these adolescents learn to battle each other competitively and tackle their own nagging growing pains but know they must band together and slaughter the walking dead menaces that look to make some serious ominous waves within their bedroom town.\r\n\r\nThe teenage terminators that are called into action are Ben, Carter and Augie (played by Tye Sheridan, Logan Miller and Joey Morgan). Of course this trio fits into the distinctive archetype of youth labeling. Ben is the clean cut kid with some semblance of sensibility. Carter is a handful as the insufferable horndog. Lastly, Augie is the geeky hanger-on. So there you have it--the mini-sized Three Musketeers out to destroy some zombie butt and take down numbers in the process. \r\n\r\nThe feminine eye candy wrapped up in this monstrous madness includes Carter's sister Kendall (Halston Sage). Kendall also serves as the convenient object of affection for the love-struck Ben. And what would a horror flick be without the resident curvaceous gun-toting, butt-kicking beauty with the killer instinct of zombie zapping?  In this case, that role would go to strip club siren Denise (Sarah Dumont) whose skill in eradicating the zombie pests as she struts around like an armed jiggly cheerleader in heat becomes increasingly distracting (or maybe not for some that might find this bombastic and busty Barbie Doll lustfully \"liberating\"). \r\n\r\nThe boys' scout leader (former Saturday Night Live alum David Koechner) is the accident-prone wonder whose penchant for overcoming various injuries is supposedly laughable yet the joke of his clumsy confrontations quickly tires out and grows old. However, the scout leader is essential to the storyline for the tykes because he suffers the fate of becoming one of the zombies that needs to be destroyed. It certainly does not help matters any when poor Kendall's safety is jeopardized and the boys (especially Ben in particular) along with Denise's assisted brashness must rescue Carter's pretty sibling and protect the town's masses from the zombie intruders.\r\n\r\nFor the most part, Scouts Guide to the Zombie Apocalypse is a woefully tepid tease that does not care much about its sloppy execution. The scattershot script constructed by Landon and fellow scribers Carrie Evans, Emi Mochizuki and Lona Williams vacillates back and forth in complete cartoonish chaos and it is never clear as to why any of us would want to put stock in hoping that the periled protagonists of this banal roguish romp emerge victorious? The combination of humor, sentimental vibes and sketchy scare tactics overlap and is perceived as annoyingly inconsistent. The deplorable and disposable foundation for the sexual depiction of the females in Zombie Apocalypse is insulting and does not invite any sense of truth or revelation besides flashing feminine skin for the sake of giving this horror hiccup some trivial sauciness. The hoards of zombies being butchered in some imaginative selective scenes is at first kind of challenging in an offbeat, exaggerated sort of sinister way. The repetitive slaughtering gradually becomes off-putting and you are left wondering rather or not you were better off chopping off your own limbs for enduring this boisterous bomb in the first place. \r\n\r\nHopelessly choppy and chintzy, Scouts Guide to the Zombie Apocalypse could have been stunningly irreverent and still carried out its nuttiness with a coherent slice of clever mockery attached to its brand of mayhem. The zombies genre seems all the rage now within today's pop cultural climate. Of course with the continued disconnected gory gumption of damaged duds such as Apocalypse the future invitation of visiting the zombie zone in entertainment may become as extinct as the dinosaur. \r\n\r\nScouts Guide to the Zombie Apocalypse (2015)\r\n\r\nParamount Pictures\r\n\r\n1 hr. 33 mins.\r\n\r\nStarring: Tye Sheridan, Logan Miller, Joey Morgan, Sarah Dumont, David Koechner, Halston Sage, Cloris Leachman, Patrick Schwartzenegger\r\n\r\nDirected and Co-Written by: Christopher Landon\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Horror and Suspense\r\n\r\nCritic's rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-11-07T20:30:46.482Z"}, {"movie_id": 273477, "review_id": "56e6fbf7c3a3685aa400a643", "author_rating": 7.0, "review_text": "> Scouts guide to the night of the living dead.\r\n\r\nAt first I believed it was a children's horror movie, I have not even known it was rated R. In the opening scene itself convinced me that it's going to be aggressive as the progression commence. Yeah, it lived up to my last minute expectation. A fine time pass movie for the regular audience, definitely it won't suits for the critics' viewing.\r\n\r\nWhen the three friends find virus outbreak in their town that turns everyone into zombies, they plan to make into a safe place along saving a few others in their attempt. Surely this is what every zombie movie you have seen dealt with. The same old adventure in zombie theme, but the characters and the scenarios were different with lots of fun. I was surprised at that part, surely a cult status will be tagged for it.\r\n\r\nOverall movie was decent, but being a horror-comedy was its strength. Just leave the logics behind and enjoy the entertainment it offers. In the end you will be convinced for your patience. It is the movie you might like it, but can't give full marks. One of the many reasons was, it is not a mainstream actor or the filmmaker's film. But still the entire team was awesome, and delivered its purpose. It was not a box office hit, but still I expect there will be a sequel.\r\n\r\n7/10", "created_at": "2016-03-14T17:59:19.466Z"}, {"movie_id": 273477, "review_id": "58c16fff9251411d7b006596", "author_rating": 5.0, "review_text": "I thought this film would be a cross between 'Superbad' and 'Zombieland'. I think I was too accurate. There is nothing original about this film. I suppose originality is not what you are looking for when sitting down to this film which is fair enough but every single character has been ripped from the pages of previous 'teen' movie scripts that have gone before it and the humour doesn't even make it stand out.\r\n\r\nThe story does move on slightly from the tiresome quest of American teenagers wanting to get laid when the zombies appear (spoiler alert!) which kept my interest slightly. The over-the-top gore was fun but only distracted me slightly from how poor the other aspects of the film were.\r\n\r\nOverall, the screenplay and performances are nothing to write home about but it was quite well directed.\r\n\r\n★★½", "created_at": "2017-03-09T15:08:47.949Z"}, {"movie_id": 273477, "review_id": "5bbb50599251410a1a041711", "author_rating": 3.0, "review_text": "Literally the very last line of the entire movie made me laugh, that was the first time I'd laughed too.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2018-10-08T12:40:57.047Z"}]