[{"movie_id": 139932, "review_id": "508ab876760ee3714900071a", "author_rating": null, "review_text": "I have a soft spot in my heart for movies about making movies.\r\n\r\nWhether you go back to Fellini’s “8 1/2” or point to modern efforts such as “Adaptation” or “Seven Psychopaths,” I rarely grow tired of the meta-frameworks of the usually self-referential films. They serve as constant reminders that no matter the seriousness, toil and drama poured into cinema, there’s always room for levity.\r\n\r\nThat said, Argentinian writer-director Diego Rougier’s “Sal” hit me just the right way with its mix of Western iconography, gorgeous photography and limitless sardonicism.\r\n\r\nTo simply make the comparison between this darkly comic Western thriller and “No Country for Old Men” seems insufficient, even though the Best Picture winner immediately springs to mind while watching “Sal.” The influence of the Coen Bros. is steeped throughout this film, right from the opening caveat (a la “Fargo”) that the story is based on true events — a claim that seems dubious but in good fun.\r\n\r\nFele Martínez (best known from Alejandro Amenábar’s “Abre Los Ojos” and Pedro Almodóvar’s “Bad Education”) leads viewers between the world of aspiring screenwriter Sergio and the rough-and-tumble arena of revenge faced by Diego, a man for whom Sergio is mistaken after traveling to northern Chile to research his troubled script, a Western titled “Sal.”\r\n\r\nThe fabled Diego left some scores unsettled with the local jefe, Victor (Patricio Contreras), and his wife, Maria (Javiera Contadar, who also serves as producer), all of them Sergio must answer for, a mistaken identity case that reminds me of the fun and twisted “The Big Lebowski” at times.\r\n\r\nAiding Sergio in his quest to find a tantilizing story for his script (not to mention survive the torment of Victor and his gang) is the old man Vizcacha (Sergio Hernández), who himself has revenge on his mind vis a vis Victor.\r\nWhile somewhat heavy-handed in its transitions between the supposed reality of Sergio’s script trip and the boots-and-belts drama of Diego, “Sal” never suffers for lack of humor, especially from Hernández’s mentor-hermit character and the comically irascible henchman Pascual (Luis Dubbo).\r\n\r\nEqually compelling is the rich cinematography of David Bravo, whose camera movements and respect for natural light across scorched desert days and fire-lit nights help ground the main narrative while indulging in color and saturation tricks for dream sequences and cutaways to the plot of Sergio’s film-within-a-film.\r\n\r\nWhile some viewers may find the transitions grating and tiresome, the humor, performances and overall production quality in “Sal” keep you invested and entertained.", "created_at": "2012-10-26T16:21:10.000Z"}]