[{"movie_id": 530385, "review_id": "5d2de9366a300b0010a476e4", "author_rating": 7.0, "review_text": "Although it has an elegant way of building suspense and one absolutely stunning opening scene, I think Midsommar fails for me in the execution of its sequences. The whole movie is slowly building up the dread of the pagan cult, but fails to deliver when it comes to showcasing the brutality toward the end, and after two hours of  build up it's baffling how minute the payoff is. The performances are fantastic, though! And I love watching Swedish people scream.", "created_at": "2019-07-16T15:11:50.125Z"}, {"movie_id": 530385, "review_id": "5d4b7f8a4dc34a0014620a98", "author_rating": 6.0, "review_text": "Although arthouse horror movies really aren’t my thing for the most part, ‘Midsommar’ falls into a strange middle ground where I wasn’t bored but I wasn’t invested either. I feel no need to “finding the mean“ to read theories online, because I simply don’t care. The only saving grace is the visuals, which are breathtaking and wildly creative at times, but it’s not a trip I want to take again. \r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-midsommar-ari-aster-brings-the-gore-but-lacks-the-emotion\r\n\r\n8/08/2019\r\n3 stars", "created_at": "2019-08-08T01:48:58.869Z"}, {"movie_id": 530385, "review_id": "5d894f3ed9f4a600204da5c2", "author_rating": 7.0, "review_text": "_**Very poorly advertised as something it isn't; will be sure to frustrate and impress in equal measure**_\r\n\r\n> _Methought I was enamoured of an ass._\r\n\r\n- William Shakespeare; _A Midsummer Night's Dream_ (1595)\r\n\r\n>_Sometimes at pagan shrines they vowed_\r\n\r\n>_offerings to idols, swore oaths_\r\n\r\n>_that the killer of souls might come to their aid_\r\n\r\n>_and save the people. That was their way,_\r\n\r\n>_their heathenish hope; deep in their hearts_\r\n\r\n>_they remembered hell._\r\n\r\n- Seamus Heaney; _Beowulf: A Verse Translation_ (1999)\r\n\r\nMuch like his feature debut, the excellent _Hereditary_ (2018), writer/director Ari Aster's _Midsommar_ has divided audiences much more than critics. Whereas _Hereditary_ had an 89% critical approval rating on Rotten Tomatoes, with an average score of 8.26/10, it managed only a 65% audience approval rating, with an average score of 3.43/5, whilst also famously garnering a pitiful D+ CinemaScore. _Midsommar_ currently has an 82% critical approval with a 7.51/10 average, against a 61% audience approval, with a 3.36/5 average and a C+ CinemaScore. This recalls recent films such as Robert Eggers's _The VVitch: A New England Folktale_ (90% with a 7.77/10 average vs 58% with a 3.22/5 average and a C- CinemaScore) and Trey Edward Shults's superb _It Comes At Night_ (87% with a 7.36/10 average vs 44% with a 2.75/5 average and a D CinemaScore). The reason for the discrepancies? In large part it's because all four films were promoted as something they weren't, drawing in audiences who were disappointed that they didn't get what they were expecting; all four were heavily promoted as horrors, when none in fact are (and in the case of _It Comes At Night_, not even remotely close). As for _Midsommar_, it is, at best, a thriller, and I would argue that even that's pushing it. Whereas _Hereditary_ was a study of grief and familial breakdown, it undeniably had horror elements (the floating self-decapitation scene is one of the most haunting images put on screen in decades). In the case of _Midsommar_, however, apart from one very brief moment involving somebody wearing somebody else's skin (don't ask), there's nothing remotely resembling a horror trope, and very little that's thrilling. Which is not necessarily a criticism; I enjoyed the film very much, I simply think the marketing people have once again set the movie up to fail with a lot of the people who will see it.\r\n\r\nWhat _Midsommar_ does have in abundance, however, is dread, which is, of course, very different to horror. More unsettling than frightening, as with _Hereditary_, _Midsommar_ is primarily an allegory built on a foundation of generic tropes – both films begin with paralysing tragedies that almost cripple the protagonist, with the subsequent narrative analysing the psychological reaction to such tragedies by way of various spooky goings-on. And whereas _Hereditary_ dealt with the lengths one may go to shut off deep emotional pain, _Midsommar_ is more interested in what happens when the initial pain of bereavement starts to wear off, especially when the only person one feels one can turn to isn't exactly sympathetic to one's situation. Aster himself has called it a \"_breakup movie_\", and it's hard to argue against this categorisation, as the story begins and ends with very specific relationship drama. And whilst the characters are grossly underwritten, and the film is painfully predictable (if you're familiar with Robin Hardy's _The Wicker Man_ (1973), chances are that everything you think is going to happen in _Midsommar_ does happen), it's beautifully crafted, brilliantly shot almost entirely in glaring sunlight, and vastly ambitious in scope (it runs 147 minutes). Indeed, it's the type of film where you can tell the director was given an unusual amount of freedom to fulfil their vision. And whilst that can often result in unmitigated disaster (think filmmakers such as Michael Cimino, Richard Kelly, and David Robert Mitchell), much like Jordan Peele's _Us_ (2019), _Midsommar_ avoids the dreaded sophomore slump without necessarily knocking it out of the park.\r\n\r\nThe film begins as Dani Ardor (a superb Florence Pugh) is hit with the kind of tragedy from which many would find it impossible to recover - her bipolar sister has killed their parents and subsequently committed suicide. Already emotionally fragile and prone to anxiety attacks even before their deaths, the incident sends Dani spiralling into despair, turning for support to her boyfriend Christian (Jack Reynor), an anthropology student struggling to find a topic for his PhD thesis. Unfortunately, for some time, Christian has wanted to break things off with Dani, as he finds her overly needy, and he had been trying to work up to ending the relationship when her family died. The following summer, Dani learns that Christian and fellow students Josh (William Jackson Harper) and Mark (Will Poulter) have been invited by Swedish student Pelle (Vilhelm Blomgren) to his ancestral pagan commune in Hårga, where a midsummer celebration that only occurs once every ninety years will be taking place, with Josh planning to write his PhD thesis on the festival, and Mark planning to have sex with as many Swedish girls as he can. Dani is upset that Christian didn't tell her about the trip, and to placate her, he invites her to come, never imagining she will say yes. But she does, much to Mark's disgust, and so the foursome accompany Pelle to Sweden, meeting the disturbingly polite and welcoming members of the commune, as well as English students Connie (Ellora Torchia) and Simon (Archie Madekwe), who were invited by Pelle's brother Ingemar (Hampus Hallberg). It doesn't take long, however, for the visitors to learn that things aren't exactly kosher in the commune - whether it's the elderly couple who fling themselves from the top of a cliff, the pies with pubic hair in them, the \"oracle\" child specifically bred through incest, the caged bear who seems to have no function in the festival, the strange yellow pyramid building which they are forbidden from entering, the elaborate murals depicting violence and torture, or the communal wailing.\r\n\r\n_Midsommar_ originally began life as a slasher movie set in a Swedish commune, until Aster revised the script to focus on a toxic relationship after going through a particularly bad breakup himself. Christian is your garden variety manipulator, who uses Dani's emotional vulnerability against her. For example, in a brilliantly written early scene, after she has learned about the trip, she's understandably upset that he didn't tell her about it, but in the space of just a couple of minutes he manipulates her into apologising to _him_. The core of the story is Dani slowly coming to realise that Christian isn't the man she thought he was, and in a weird way, it's a variation on the female revenge genre. However, whereas usually it's revenge for rape or assault, here it's revenge for being a complete and utter dick. In this sense, the film is primarily an allegory for the process of a young woman's emotional/spiritual awakening independent of the man on whom she thought she had to rely. Indeed, one could take this even further if one reads the character names as symbolic; Dani's surname is Ardor, but she is denied love and passion, and in the paganism of the commune, she's offered something she can't get from a self-serving Christian(ity). Whether _Midsommar_ works for you or not will depend largely on how you respond to this element of the story - if you buy into the notion that Christian is the _de facto_ villain, and that Dani is an emotionally scarred young woman looking for support, you'll get a lot more out of it than if you think Dani is a needy whinger and Christian would do well to be rid of her.\r\n\r\nAesthetically, the film looks terrific, with Henrik Svensson's production designer, Andrea Flesch's costume designer, and Pawel Pogorzelski's cinematography especially praiseworthy. Whereas the US scenes are dark and confined, taking place in small poorly lit rooms with the characters wearing drab costumes, once the film shifts to Sweden, the visual design changes completely. The production design emphasises an open-plan vastness with unlimited space to move, but few places to hide; the cinematography drenches everything in glaring sunlight, which, again, makes it hard to hide; and the costume design focuses on brilliant white, with a smattering of colour. Unlike the vast majority of horror movies, there are few shadows or dark corners, but the film is shot in such a way that the very lack of such is itself disconcerting. The same is true for the always pristine costumes, which suggest that something is just not quite right underneath the veneer of cleanliness and insincere sense of perfection. Indeed, the attention to detail in the presentation of the commune is immensely impressive; the long middle act doesn't really feature much in the way of narrative incident, but it sure does a fine job of creating a _milieu_ that feels completely authentic and lived-in.\r\n\r\nThere are also some nice individual moments. For example, the choral singing with which the film begins is harshly interrupted by a telephone ringing, suggesting the clash between tradition and modernity that will play out throughout; Dani's hysterical crying upon learning of her family's deaths blends seamlessly with Bobby Krlic's wonderfully discordant music; a superb single-take shot takes Dani from heading to her apartment bathroom to entering the bathroom of an airplane; a high altitude shot showing a car travelling along a country road is imbued with malevolent undercurrent as the car passes under the camera, but rather than turning around to pick the vehicle up on the reverse angle, the camera follows the car by turning downwards, ending up upside-down, signalling to the viewer that things have changed irrevocably for the characters, as if they have crossed a barrier of some kind.\r\n\r\nIn terms of the narrative design, somewhat unusually, the film wears its predictability on its sleeve, with many of the major narrative beats not only foreshadowed but literally shown to the audience prior to occurring in the story, whether it be the mural that opens the film or the illustrations seen on the walls all over the commune – the _dénouement_ isn't simply hinted at, it's all-but presented to us from the outset. With that in mind, anyone who has seen any folk horror will be able to predict much of what happens. Even if you're only familiar with _The Wicker Man_, you'll still be able to take a decent stab at how things are going to turn out. Of course, this allows the audience to roundly mock the characters' utter obliviousness to what's coming, which is presumably the point. You know that scene in most horror films where you think to yourself \"how can they not realise something nasty is going to happen\"? _Midsommar_ is like a 147-minute version of that one scene.\r\n\r\nAs for the acting, much as _Hereditary_ was Toni Collette's, _Midsommar_ belongs entirely to Florence Pugh, who's going from strength-to-strength at the moment. For most of the film, she's on the precipice of a nervous breakdown, with her performance redolent of Shelley Duval in Stanley Kubrick's _The Shining_ (1980). Pugh has already impressed in films as varied as Carol Morley's _The Falling_ (2014), William Oldroyd's _Lady Macbeth_ (2016), Richard Eyre's _King Lear_ (2018) and Stephen Merchant's _Fighting With My Family_ (2019), but _Midsommar_ is easily her best and most layered performance thus far, especially the gamut of contradictory emotions she runs in the batshit insane last 20 minutes. Elsewhere, the performances are all fine, but the actors aren't helped by the script. As Christian, Jack Reynor plays, well, Jack Reynor. There's nothing really wrong with the performance (although he is the least convincing academic ever put on screen), and he does do a decent job of getting the audience to loathe his passive-aggressive persona, but there isn't a huge amount of depth. The same is true of Will Poulter, who plays Mark as the kind of ignorant sex-crazed loudmouth that seems to only exist in the movies and who is never characterised beyond this caricature. As Josh, William Jackson Harper, although a far more believable academic than Reynor, barely registers, whilst Vilhelm Blomgren's Pelle is so one-note and obviously untrustworthy that it pushes suspension of disbelief to breaking point.\r\n\r\nAs this might suggest, one of the biggest problems with the film is the underwritten characters. This is especially true of Christian, a boyfriend so selfish and uncaring, one wonders how he ever wooed Dani in the first place. Additionally, their relationship is demarcated along painfully stereotypical lines – the emotional female whose need for support becomes overwhelming and the thoughtless bro who is more interested in hanging out with the boys than comforting his girlfriend. Another issue is that even aside from the character of Pelle, the film pushes the suspension of disbelief too far. There are multiple moments when the goings-on in the commune should prompt the visitors to leave immediately, but apart from a few weak attempts by Dani to persuade the others to go, they repeatedly accept the most ridiculous of situations based upon the most tenuous of explanations. Indeed, in a lot of ways, they're no different from the horny idiots who get picked off one by one in so many cheap slasher films. Furthermore, it doesn't help that initially Josh is depicted as an expert on paganism, and is familiar with many aspects of the festival, but later on, the script conveniently forgets about this when necessary.\r\n\r\nThematically, things are also quite jumbled. Whilst the core theme of a toxic relationship is present to one degree or another throughout, and Aster actually has some interesting things to say about complicity in such relationships, a lot of other ideas are thrown into the mix without really going anywhere – death, renewal, paganism itself, the nature of grief (and given the strong opening, that Aster allows this theme to drop off is especially disappointing). Additionally, as already mentioned, there are few surprises here. Aster is obviously a big fan of the subgenre of folk horror, but he allows reverence to the tropes supersede any kind of narrative inventiveness, leading to predictability, and as insane as the last 20 minutes are, nothing really happens that surprised me. Also, as in _Hereditary_, the explanation for what's going on isn't anywhere near as interesting as the ambiguity preceding it, making explicit something which was so deeply unsettling when implicit.\r\n\r\nThat all said, however, I did enjoy _Midsommar_. Not as disturbing as _Herditary_, it finds Aster again working with dread rather than quintessential horror tropes. Aesthetically impressive, and built on a terrific central performance, it could be accused of style over substance or cited as an example of a filmmaker whose ambitions outweigh his abilities, but ultimately, Aster's mastery of tone sees him through. The script could use some work, no doubt, but the ominous sense of dread is palpable throughout and is brilliantly handled, with the most mundane of objects imbued with haunting portentousness. The _dénouement_ is more rote than I expected, and although Aster tries to tackle too many issues, his depiction of the death throes of a toxic relationship is as penetrating and emotionally honest as any ostensible relationship drama. Unnerving and audacious, _Midsommar_ is, ultimately, an exceptionally confident piece of filmmaking, if not necessarily an exceptional piece of filmmaking.", "created_at": "2019-09-23T23:03:26.080Z"}, {"movie_id": 530385, "review_id": "5d8e3626221ba60029b5833d", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThis was easily one of my most anticipated movies of the year. Hereditary was my favorite film of 2018, so obviously, Ari Aster's second feature grabbed my full attention from the very first announcement. Fortunately, even though Midsommar is only being released now in my country, I was able to stay away from spoilers, as well as from any sort of images or clips. As you might expect, this is not a typical horror movie, even though it's being marketed as belonging to the genre. Sure, it has some horror stuff that indisputably connects it to the genre, but it definitely doesn't play out to scare audiences or make you have nightmares at night.\r\n\r\nHereditary was quite divisive among audiences due to the lack of traditional jump scares and generic entertainment, besides it being too excessive regarding spiritualism for the general public. Midsommar is undoubtedly going to be even more divisive. First of all, it drags. There's no denying it. The first weird cult scene only occurs about one hour in, which in a 140-minute runtime is a bit too far ahead. Granted, it's one of the most shocking and horrific sequences in the daylight I've ever seen, but its build-up (extremely well-done) takes a big part of the second act, slowing down the pacing too much.\r\n\r\nAdditionally, it's a film that entirely relies its entertainment value on the feeling of shock instead of fear. If you didn't enjoy Aster's first feature because it didn't have enough scary sequences, Midsommar isn't going to convert you to being a fan of his work. Similarly to Ad Astra (just released last week), it's a story that requires the audience to care about more than only superficial aspects. If you go in expecting to leave your brain outside just so you can be uncloudedly entertained, then you might want to think again. I can't stress this enough: you need to pay attention to what you're watching!\r\n\r\nHints to what the story holds for us are everywhere, especially in the walls. Through paintings, runes, and hand-drawings, Ari Aster spreads basically all the information you need to better understand where the movie is going. It's a film about two key themes: how to deal with grief, and how to handle a complicated relationship. These are the issues that people should be able to acknowledge and understand how they're being developed. I love how Aster addresses the latter topic (he wrote this screenplay after he ended a relationship of his own), but I'm disappointed by the way he put the former into the \"background\".\r\n\r\nThe first 15-20 minutes deal with what happens to Dani's life, and it's never approached again, even though there's a vague idea of what could have actually happened, by the end of the movie. Regarding the other point, it isn't exactly a \"toxic\" relationship that we've seen in previous films, but one where each person is waiting for an excuse to leave the other. Hence, some actions feel forced in the hope that they can trigger something. It's a strangely realistic yet uncomfortable take on something a lot of people go through. Technically, this is one of 2019's most fascinating productions.\r\n\r\nFrom the colorful cinematography to the impeccable editing, from the stunningly impressive production design (again, the WALLS!) to the immersive score … Ari Aster is no joke. The way he handles dialogues is a treat to someone like me, who cares so much about engagement through characters speaking. There are so many long takes with Florence Pugh giving her all, just raw and powerful emotions. It's her career-best performance, no doubt about it. Her character's storyline is partially what brings the \"horror\" to the narrative. Just like Toni Colette on Hereditary, Pugh is probably going to be ignored during the awards season, as well as the movie's technical achievements since the horror genre still didn't convince enough people to give a shot.\r\n\r\nRegarding the other characters, they're my main issue. They simply felt like plot devices. Will Poulter (Mark) is funny as the comic-relief guy, but his character, like every other one besides Dani, doesn't do much to make me care about or feel invested in their own subplots (if there are any). They barely have any backstory, and their purpose is basically to help move the plot forward by giving Aster opportunities to show some pagan rituals of some kind. There are incredibly shocking, bloody, and jaw-dropping scenes, some might make you feel uncomfortable, others might make you laugh. But they're all meant to shock you in some shape or form.\r\n\r\nWhether you love it or hate it, Midsommar is memorable. If you didn't enjoy Hereditary due to the lack of jump scares, the former isn't for you then. Midsommar requires full attention, patience, and an open-minded mentality. It's not a generic horror flick, so don't go in expecting to be constantly entertained by silly scares. Expectations are everything, so moderate them in the best way possible. It has one of the most abstract ways of addressing a difficult relationship and how to deal with grief, but if you LOOK AT THE WALLS, you'll be able to (maybe) follow the story a bit better.\r\n\r\nTechnically, Ari Aster delivers a masterful work, with exceptional production design and gorgeous cinematography, plus seamless editing. Florence Pugh carries the story on her shoulders with an astonishingly compelling performance, but her supporting cast didn't do much with their under-developed characters. The film drags a lot, and it can become tedious at some point, but in the end, it's one of those movies that sticks with you. A second viewing may be necessary, and it will probably be a better experience. Can't wait to find out. Go see it!\r\n\r\nRating: B", "created_at": "2019-09-27T16:17:42.862Z"}, {"movie_id": 530385, "review_id": "5d9c850b3e01ea00288d6210", "author_rating": 5.0, "review_text": "_Midsommar_ might genuinely be my big disappointment for 2019. I'm not saying it's bad. But coming into this on the back of not only the crazy good _Hereditary_ from last year, but also the **gushing** praise from the online horror community, I guess my expectations were a little high. It doesn't make me feel good to say it, but honestly I'm glad I didn't see this in the cinema. Firstly because I think I might've been a little mad if I had forked out $25 to see this, based on the experience I ended up happening, but also secondly, because I don't much feel like going blind in the theatre from the sheer white exposure that takes up 97% of _Midsommar's_ runtime.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-10-08T12:46:03.881Z"}, {"movie_id": 530385, "review_id": "5db93e062d37210015eaa959", "author_rating": 8.0, "review_text": "An impressive work, “Midsommar” is Ari Aster’s follow-up to “Herditary,” a decent if flawed horror film.\r\n\r\n“Midsommar” follows Dani, who, after the tragic loss of her parents and sister, decides to follow her increasingly distant boyfriend and his friends on a trip to Sweden to visit the pagan cult commune their roommate, Pelle, grew up in. While seemingly open and friendly, it becomes obvious fairly quickly that something else is going on here. The obvious comparisons to “The Wicker Man” are not uncalled for.\r\n\r\nFirst, in the interest of full disclosure, this review is based on the nearly three-hour Director’s Cut of the film rather than the theatrical release. I haven’t even seen the theatrical release, so I can’t attest as to what was added in the nearly 30 new minutes. I will say that the Director’s Cut is pretty seamless and doesn’t seem to have any superfluous scenes.\r\n\r\nSecond, we need to start with the elephant in the room and address how this compares to “Hereditary,” which as I stated was okay but flawed. The major flaw in that film is that it has its own internal consistency, but doesn’t have consistency from an audience standpoint. There’s only the most minor of hints as to the truth, and it’s clear that in that world, such things were possible, but the audience isn’t really let in on the answer until the end. The audience has to think about it to get that internal logic. I’m usually the type that doesn’t like spoonfeeding information to the audience, but this withheld a little too much.\r\n\r\nOkay, that was “Hereditary.” So how does “Midsommar” compare? Well, it’s far better in terms of letting the audience in on the secret and revealing its internal logic. But, sometimes it’s too good at it. There’s not much of a secret. You know what’s ultimately coming.\r\n\r\nHowever, interestingly this is where the brilliance of the movie actually comes in. Much like life and sex, it’s about the journey, not the destination. We know where we’re going, but the fun is in seeing how we get there. And it’s a fun and colorful journey. This is bright daytime horror, taking place in Sweden at Midsommar when there is very little darkness at night, which itself could be a metaphor in that we can see the end and know where we’re going.\r\n\r\nSo, why only 4 stars? The film is great, but definitely not perfect and has a couple deep flaws. I could give the film a little more credit if it did conceal the end a little more, giving a less obvious “twist.” The other is that it sticks pretty close to traditional character archetypes for horror films. If you don’t know what I mean, this was very well addressed in “Cabin in the Woods.” A little more variety and a little added creativity could have elevated “Midsommar’s” score. While it’s still great, don’t expect a perfect film.", "created_at": "2019-10-30T07:38:46.905Z"}, {"movie_id": 530385, "review_id": "61157992b686b900452ad41b", "author_rating": 6.0, "review_text": "_**“The Wicker Man” meets “The Village”**_\r\n\r\nInvited by their genial Swedish friend, four college students from New York take a vacation to rural Sweden to experience a Midsummer celebration at a commune. A couple of them are cultural anthropology students, who are naturally interested in the friendly isolated group and their odd ceremonies. The situation goes from friendly and curious to shocking. Florence Pugh and Jack Reynor play the American protagonists.\r\n\r\n“Midsommar” (2019) is folk horror that plays out like “The Wicker Man” (1973/2006) meets “The Village” (2004) with elements of “The Lords of Salem” (2012). The topic of visiting a secluded pagan religious community and the increasing challenges thereof can be seen in other flicks like “Ogre” (2008), “The Ritual” (2017) and “Apostle” (2018), as well as the recent Indie “Devil’s Island” (2021). \r\n\r\nIf you like these kinds of movies “Midsommar” delivers the goods.  Writer/director Ari Aster did his homework, combining fact with fiction, old and new. There’s an insightful comparison between the lack of social intimacy in modern Western culture and the family-like camaraderie of the remote Commune. Pugh makes for an effective protagonist and there’s some convincing gore. It’s a professionally made piece no doubt.  \r\n\r\nUnfortunately, the first half is more compelling than the second, which devolves into tedious ceremonies and the corresponding gobbledygook. Hammer’s “The Mummy” (1959) had the same issue but was mercifully an hour shorter. “Midsommar” needed tightened up for a more gripping viewing experience, but directors generally don’t like to cut scenes from their ‘baby.’ \r\n\r\nThe film runs 2 hours, 27 minutes, and was shot in Budakeszi, Hungary (Hårga), as well as Korda Studios, Etyek, and Budapest, Hungary; Dani’s apartment was shot in Brooklyn, New York.\r\n\r\nGRADE: B-", "created_at": "2021-08-12T19:42:10.073Z"}, {"movie_id": 530385, "review_id": "62418eeac740d90089ea5eeb", "author_rating": 5.0, "review_text": "Hey, honey - let's take a trip to a surreal drug-fuelled Swedish festival with cruel pagan tendencies? Yes, I know - it all sounds too bonkers; and yes, for the main, it is. I think you have to be in the zone if you are going to get anything from this otherwise it could fairly be described as nonsense. There are shades of \"The Wicker Man\" here, but this is nowhere near as well written or as scary. Florence Pugh and Jack Reynor try their best but this just doesn't really work. On the plus side - it is beautifully shot - the purity of the light is amazing.", "created_at": "2022-03-28T10:33:14.244Z"}, {"movie_id": 530385, "review_id": "63af93b1be4b3600b63ba289", "author_rating": 7.0, "review_text": "This place raises more red flags than Summerisle, an overlong film and the characters are as thick as pigsh*t. I was so hoping the finale would deliver the goods but it ended up as a less memorable 'The Wicker Man'.\r\n\r\nBut, but, but I do admire it.", "created_at": "2022-12-31T01:43:13.640Z"}, {"movie_id": 530385, "review_id": "6403f5d267dcc900abdf54ca", "author_rating": null, "review_text": "Of course creators of this movie are big fans of the wicker man movie(excellent 60's movie). Very slow action. Didn't got bored ,but in the end not fully satisficed.", "created_at": "2023-03-05T01:52:18.879Z"}, {"movie_id": 530385, "review_id": "64c4298495ce24011e5837dd", "author_rating": 10.0, "review_text": "**Not what it appears to be... I really did not-see this coming...**\r\n\r\nThis is one of those horror movies that is actually really deep and symbolical and works on multiple levels and has multiple stories hidden within the surface narrative and in this case it's actually 3 stories that are told at the same time, though only the surface narrative is picked up consciously, the other 2 are picked up subconsciously and that's what makes it disturbing.\r\n\r\nBe sure to watch the extended cut, because only there does it really become apparent what the other 2 stories are about. So, here go the spoilers, cause now I am gonna say what I believe those 3 themes are. Obviously on the surface it's a horror movie, but beneath that it's a drama about relationships and about breaking up - some people pick up on that first hidden theme/narrative and so they find it boring because they expected a horror movie, but what they get is an emotional drama.\r\n\r\nBut no one has consciously picked up on the 3rd narrative - or at least I have never seen anyone mention it - even though it's very obvious when you watch the extended cut. The third genre of movies is that it's a movie about the 3rd Reich and related National Socialist propaganda, ideology and atrocities committed and that's the aspect everyone only picks up subconsciously and that makes everyone feel uncomfortable watching this movie, but without really knowing why.\r\n\r\nWhich also explains some of the criticism, such as Swedes and Pagans complaining that their culture and ideology isn't portrayed accurately. Of course it isn't, because that's not the culture or ideology it's trying to portray! So the 4th and ultimate genre is that it's really a biting political satire that uses all the other genres as cover.\r\n\r\nIt's like the travel movies that the Soviet Union published that make the Soviet Union look like some kind of socialist Disneyland. And as long as you were a tourist who was willing to only go to the places he was told to go and to just gloss over all the labor camps and atrocities, it kinda was! And so what those movies were for socialism, this movie is for National Socialism - a sorta satirical video travel guide into a promised National Socialist fantasy land and Utopian paradise that never existed and that only a complete psychopath could ever try to propagate as something desirable.", "created_at": "2023-07-28T20:48:04.444Z"}]