[{"movie_id": 109445, "review_id": "535fe7c2c3a36830a9006c93", "author_rating": null, "review_text": "\"Frozen,\" the latest Disney musical extravaganza, preaches the importance of embracing your true nature but seems to be at odds with itself.\r\n\r\nThe animated, 3-D adventure wants to enliven and subvert the conventions of typical Disney princess movies while simultaneously remaining true to their aesthetic trappings for maximum merchandising potential. It encourages young women to support and stay loyal to each other—a crucial message when mean girls seem so prevalent—as long as some hunky potential suitors and adorable, wise-cracking creatures also are around to complete them.\r\n\r\nIt all seems so cynical, this attempt to shake things up without shaking them up too much. \"Frozen\" just happens to be reaching theaters as Thanksgiving and the holiday shopping season are arriving. The marketing possibilities are mind-boggling. And in the tradition of the superior \"Beauty and the Beast\" and \"The Little Mermaid,\" surely \"Frozen: The Musical\" will be headed to the Broadway stage soon. The songs – which are lively and amusing if not quite instant hits—are already in place. \r\n\r\nLittle girls will absolutely love it, though. That much is undeniable. And the film from co-directors Chris Buck (\"Surf's Up\") and Jennifer Lee is never less than gorgeous to watch. A majestic mountaintop ice castle is particularly exquisite—glittery and detailed and tactile, especially as rendered in 3-D.\r\n\r\nBut first we must witness the tortured backstory of the film's princesses – not one, but two of them. The script from \"Wreck-It Ralph\" co-writer Lee, inspired by the Hans Christian Andersen story \"The Snow Queen,\" has lots of cheeky, contemporary touches but is firmly and safely rooted in Scandinavian fairy tale traditions.\r\n\r\nWhen they were young girls, sisters Anna and Elsa were joyous playmates and inseparable friends. But Elsa's special power—her ability to turn anything to ice and snow in a flash from her fingertips—comes back to haunt her when she accidentally zaps her sister. (Not unlike the telekinesis in \"Carrie,\" Elsa inadvertently unleashes her power in moments of heightened emotion.) A magical troll king heals Anna and erases the event from her memory, but as for the sisters' relationship, the damage is done.\r\n\r\nElsa's parents lock her away and close down the castle, which devastates the younger Anna. (Of the many tunes from \"Avenue Q\" and \"The Book of Mormon\" songwriter Robert Lopez and his wife, Kristen Anderson-Lopez, the wistful \"Do You Want to Build a Snowman?\" is by far the most poignant.) But once they reach adolescence and it's Elsa's turn to take over the throne at age 18, the two experience an awkward reunion.\r\n\r\nThe perky, quirky Anna (now voiced by a likable Kristen Bell) is a little nervous but overjoyed to see her sister. The reserved and reluctant Elsa (Broadway veteran Idina Menzel) remains distant, and with gloved hands hopes not to freeze anything and reveal her true self on coronation day. But a run-in with an amorous, visiting prince (Santino Fontana) who sets his sights on Anna triggers Elsa's ire, and she inadvertently plunges the sunny, idyllic kingdom into perpetual winter.\r\n\r\nFlustered and fearful, Elsa dashes away in a fit of self-imposed exile – which significantly weakens \"Frozen,\" since she's the film's most complicated and compelling figure. On her way to the highest mountain she can find, Elsa belts out the power ballad \"Let It Go,\" her version of \"I Am Woman.\" This soaring declaration of independence is the reason you want a performer of Menzel's caliber in this role, and it's the film's musical highlight. (Her flashy physical transformation from prim princess to ice queen does make her resemble a real housewife of some sort, however.)\r\n\r\nAfterward, though, the story settles in on Anna's efforts to retrieve her sister and restore order to the kingdom. Along the way she gets help from an underemployed ice salesman named Kristoff (Jonathan Groff) and his trusty reindeer sidekick, Sven. They all meet up with a singing snowman named Olaf (a lovably goofy Josh Gad, star of \"The Book of Mormon\" on Broadway) who dreams of basking in the warmth of the summer sun. This \"Wizard of Oz\"-style quartet makes the obstacle-filled trek to the imposing fortress that awaits. (At least \"Frozen\" has the decency to borrow from excellent source material.)\r\n\r\nWhile the journey may seem overly familiar, the destination has some surprises in store. Some come out of nowhere and don't exactly work. But the biggie—the one that's a real game-changer in terms of the sorts of messages Disney animated classics have sent for decades—is the one that's important not just for the little girls in the audience, but for all viewers. http://newmoviestream.co/watch/2294629/frozen\r\nwish everything about the film met the same clever standard.", "created_at": "2014-04-29T17:56:18.980Z"}, {"movie_id": 109445, "review_id": "54b1bf59c3a3682313000089", "author_rating": 8.0, "review_text": "I was excited to watch this movie after all the buzz about it but I've been a bit disappointed.\r\n\r\nYes, the animation is great and it keeps all the typical Disney details and is funny, sometimes. In addition, it features two strong female characters that don't need of a hero to save the story but ...\r\n\r\n... but still they are the super-beautiful and perfect Disney princesses, as if they couldn't be normal girls from normal status, and the role of Queen Elsa is not that important as it would have expected.\r\n\r\nNot a bad movie, but not the best and I think far from the fun I had with Tangled.", "created_at": "2015-01-11T00:10:01.106Z"}, {"movie_id": 109445, "review_id": "5ddc0bc53faba0001500a759", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nSix years later, and Frozen has left an undeniable cultural impact. From Let It Go to tons of merchandising, Chris Buck and Jennifer Lee delivered such a memorable film that people not only didn’t forget but regularly asked for its sequel. As of right now, Frozen II has claimed the third-best animated opening weekend ever, proving that the love for this franchise (I think it’s safe to call it that already) is strong. However, how great is the original movie, after all? To be honest, I never fully watched it until this past week in preparation for its sequel. It surprised me in the sense that I didn’t expect to enjoy it as much as I did. Frozen is deserving of the love it possesses.\r\n\r\nWith extremely captivating characters, the story flows naturally, and the entertainment levels are always high. Whether these are due to the amazing singing sequences or to the exciting adventures, this film never stops having fun. That’s what Frozen ultimately is: a lighthearted, fun, and entertaining movie. It follows Disney’s formula for creating a variation of a story we have seen before. Characters go through a traumatic event when they’re young. They have to grow up while struggling with the aftermath of said trauma. Eventually, they overcome that obstacle and live happily ever after (or at least until the next installment).\r\n\r\nIt’s the generic and somewhat cliche Disney model for a new animated film (franchise). Nevertheless, don’t get me wrong: it works perfectly. Sure, it doesn’t bring anything new story-wise, but it’s still a great time. Despite some unnecessary and lazy exposition (the magical trolls are basically exposition devices), Frozen still delivers a truly captivating and visually jaw-dropping narrative. I do need to emphasize this: the animation is phenomenal. Elsa’s magic is seamless and beautiful. Arendelle is a gorgeous location, and the snowy mountains are impressively designed. Let It Go will always be remembered for its lyrics and melody, but the actual animated sequence is astonishing.\r\n\r\nEvery character carries a lot of expressiveness, which allows them to do basically everything. Frozen might not be a groundbreaking movie, but its compelling characters make the generic plot work. From Elsa and Anna’s complicated but heartwarming relationship to Kristoff and Sven’s camaraderie, I care about all of them… especially Olaf. I know, Olaf is simply the snowman version of a comic-relief character. He doesn’t really have a complex arc in need of extreme development. However, it’s impossible not to love him. He’s such a welcome presence in every single scene. Every single line of his is either a funny remark or a pretty valuable insight into something.\r\n\r\nCounting him out, every other character has a very well explored arc, mainly Elsa and Anna. Their (older) relationship originates from a plot point that might be a tad exaggerated, but it’s convincing enough. Finally, the score is as important as it is fantastic. It’s an animated musical, let us not forget about that. Obviously, Let It Go is the queen of all songs due to its catchy lyrics, memorable chorus, and significance to the character. But other ones such as Do You Wanna Build a Snowman and For the First Time in Forever also carry a sweet melody plus some exquisite character and story development. That’s what I love the most about musicals and why Disney always triumphs regarding this aspect: the way a simple song can tell so much about someone or move the plot forward. In my opinion, it’s the genre’s variation of “show, don’t tell.”\r\n\r\nIn the end, Frozen might not be a groundbreaking animated film story-wise, but it delivers around 100 minutes of pure fun and entertainment. With an exceptional voice cast (Idina Menzel, Kristen Bell, and Josh Gad are wonderful), Chris Buck and Jennifer Lee are able to take Disney’s formula and create a worthy variation of the classic blueprint. From the emotionally compelling and well-developed characters to the eyegasmic animation quality, Frozen is a good time from start to finish. Boasting some memorable and catchy songs, it became one of the decade’s culturally most impactful animated movies. I wish exposition wasn’t overused, and that more risks were taken concerning the screenplay, but as a Disney animated flick, it meets the company’s standards.\r\n\r\nRating: B", "created_at": "2019-11-25T17:13:41.003Z"}, {"movie_id": 109445, "review_id": "5e534a61a76ac50016a5ef87", "author_rating": 6.0, "review_text": "Great animation and good voice talent, however pretty weak story but ultimately entertaining enough movie. Also found the music, outside of the song \"Let It Go\" (which was played to death for the past several years now) were rather forgettable and bland. **3.0/5**", "created_at": "2020-02-24T04:00:33.088Z"}, {"movie_id": 109445, "review_id": "5f4cfa52223a8b0037af2261", "author_rating": 9.0, "review_text": "One of Disney's best, in my opinion. Not quite top tier, but very close.\r\n\r\n<em>'Frozen'</em> really did blow up when it was released, and rightly so. Sure it probably got overhyped but that isn't the film's fault. It's a cracking watch, the pacing is absolutely spot on as are the musical numbers.\r\n\r\nWhat impresses me the most about the music is that it manages to keep the storytelling alive whilst it occurs. Particularly at the beginning there are loads of songs squeezed in next to each other, which could mess with the premise building but it doesn't - it actually enhances it. The songs themselves are terrific, with \"Let It Go\" obviously getting the most plaudits.\r\n\r\nIdina Menzel (Elsa) and Kristen Bell (Anna) are excellent in the lead roles, while Josh Gad almost steals the show as Olaf - very funny character! Of course it's aimed at the younger audience members, but it is still entertaining for us adult folk too - I've watched it a few times down the years and still thoroughly enjoy it.", "created_at": "2020-08-31T13:25:38.561Z"}, {"movie_id": 109445, "review_id": "62e8c8197caa47005e86fb63", "author_rating": 6.0, "review_text": "OK, so it took me ten years and a persistent nephew to finally sit down before this, and though I didn't hate it, I really did struggle to see what all the fuss was about. It's a colourful adaptation of Hans Christian Anderson's \"Snow Queen\" story that sees Queen \"Elsa\" leave her kingdom after she almost kills her sister \"Anna\" - she has the ability to turn all before her to ice and that can be perilous at times for those around her! As she flees, upset, she accidentally leaves all in her kingdom with a rather frosty predicament. It now falls to \"Anna\" alongside her friendly snowman and her reindeer to try and get this pesky curse lifted. It skips along amiably enough with plenty of charming animation - especially from \"Olaf\" the snowman, but it's really about that one song that Edina Menzel delivers with a skill that, for my money anyway, is comfortably the best of these anthemic Disney power-ballads. I'm not sure even legendary lyricists Don Black and Richard Stilgoe have ever managed to incorporate \"fractals\" into their songs! As with so many of HCA's fairy tales, there is a darkness to the story - this one sanitises these aspects a little too much for me, but that said it still deals with issues of fear and deceit well enough for folks to get the message that perhaps having a frozen heart is not just a physical thing. Ten years on, it's still a decent watch that I suspect will continue to sustain youngsters for many a year to come.", "created_at": "2022-08-02T06:45:45.675Z"}, {"movie_id": 109445, "review_id": "6465239bd05a0300e2f52115", "author_rating": 5.0, "review_text": "Not a fan of this movie. It's a great story, but the singing is annoying. The kids love it though.", "created_at": "2023-05-17T18:57:31.735Z"}]