[{"movie_id": 43539, "review_id": "51d4755019c29567c308c54d", "author_rating": 1.0, "review_text": "If Paul Haggis is going to keep on making movies, would somebody do us all a favor and sign him up for a basic screenwriting class? I mean, please, this film could be a lesson all on its own on how not to write a decent screenplay. Its all in here: one-dimensional characters, supremely poor pacing, multiple threads that go absolutely nowhere and completely implausible action sequences.\r\n\r\nAnd, you know, it's just a B-thriller. It's not like I haven't seen these mistakes time and time again. What really bothers me is just how highly it thinks of itself. It not only thinks it's interesting (which it isn't whatsoever), but it thinks it's smart, edgy, and it probably even thinks it's clever. I mean, there are so many characters who function for exactly one plot point and are then left behind in the dust. For example, this one chick who's name I forget (did they ever even say her name?) is introduced fairly early on in the film, and looks even like Russell Crowe's love interest. We see the very, very beginnings of a meaningful relationship forming and then it turns out that she was only a device to fill in a little potential plot hole (trying not to spoil the movie.) The same with Russell Crowe's parents, there are a handful of scattered scenes with them showing little glimpses of a meaningful relationship, and then the same exact friggin' thing is done, they're used as a simple (and illogical) plot mechanism.\r\n\r\nIt's almost like one of Paul Haggis's friends was reading the script and said \"hey, Paul, this is completely ridiculous, how could they possibly manage to _________\" and Haggis wrote in these characters as devices to satisfy the issue, realized they were one-dimensional, and wrote in a pseudo-intelligent relationship (which doesn't in reality make them any better.) And this is how the first 2/3 of the movie moves so dreadfully slowly. I mean, I'm absolutely confident that with a decent editor, the first hour and fifteen minutes could be whittled down to maybe half an hour.\r\n\r\nThey could have especially left out the symbols that don't actually symbolize anything. Which seems silly to say, but the jar of quarters that keeps recurring in the movie not only has no plot significance, but has zero metaphorical significance. They barely explained what they were doing in their house. They were quite literally only in the film to make it look a little deeper. Not to make it more meaningful, but to make it look more meaningful. To make it \"smart,\" and \"edgy,\" and \"clever.\" I don't usually have a problem with making it through a movie but I had to push to make it through this ludicrous, self-righteous mess.", "created_at": "2013-07-03T19:02:40.442Z"}, {"movie_id": 43539, "review_id": "5ec9fcfd6c84920020312096", "author_rating": 8.0, "review_text": "Seen this movie a handful of times over the years, and still holds up so well. A solid thriller with fine performances by Russell Crowe and Elizabeth Banks, and features a great supporting cast in small parts (seems about 5 min. each), including Liam Neeson, Daniel Stern (wish he'd do more straight dramas), Brian Dennehy (RIP) and Olivia Wilde. Some nice suspense-filled moments throughout (the bump key scene still gets me).\r\n\r\nHowever, the final scene with detective \"seeing\" how the crime went down seemed like something the studio wanted to give a clear conclusion, and felt so unnecessary. **4.0/5**", "created_at": "2020-05-24T04:50:05.399Z"}]