[{"movie_id": 522938, "review_id": "5d9dffcf3d4d96003782c94e", "author_rating": 8.0, "review_text": "**_Guns, carnage, explosions, and xenophobia - everything you could want from a Rambo movie; hugely entertaining_**\r\n\r\n>**Col. Sam Trautman**: _Think about what you're doing. The building's perimeter is covered. No exit. There are nearly 200 men out there and a lot of M-16s. You did everything to make this private war happen. You've done enough damage. This mission is over, Rambo. Do you understand me? This mission is over. Look at them out there. Look at them. If you won't end this now, they will kill you. Is that what you want? It's over, Johnny. It's over._\r\n\r\n>**John Rambo**: _NOTHING IS O__VER. Nothing. You just don't turn it off. It wasn't my war. You asked me, I didn't ask you. And I did what I had to do to win, but somebody wouldn't let us win. And I come back to the world, and I see all those maggots at the airport, protesting me, spitting, calling me \"baby killer\", and all kinds of vile crap. Who are they to protest me, huh? Who are they, unless they been me and been there, and know what the hell they're yelling about?_\r\n\r\n>**Trautman**: _It was a bad time for everyone, Rambo. It's all in the past now._\r\n\r\n>**Rambo**: _For you. For me, civilian life is nothing. In the field, we had a code of honour. You watch my back, I watch your's. Back here, there's nothing._\r\n\r\n>**Trautman**: _You're the last of an elite group. Don't end it like this._\r\n\r\n>**Rambo**: _Back there, I could fly a gunship. I could drive a tank. I was in charge of million dollar equipment. Back here, I can't even get a job PARKING CARS. Where is everybody? Oh, God. I had a friend, was in the Air Force. I had all these guys, man. Back there, I had all these fucking guys who were my friends. Back here, there's nothing. Remember Danforth? He wore this black headband, and he took one of those magic markers. He mailed it to Las Vegas, 'cause we were always talking about Vegas, and this fucking car, this red '58 Chevy convertible, he was talking about this car; he said we were gonna cruise 'til the tires fall off. [begins sobbing] We were in this bar in Saigon and this kid comes up, this kid carrying a shoe-shine box. And he says, \"Shine, please, shine\". I said \"No.\" He kept asking, and Joey said \"Yeah.\" And, I went to get a couple beers, and the box was wired, and he opened up the box, fucking blew his body all over the place. And he's laying there, and he's fucking screaming, there's pieces of him all over me, and I'm tryin' to pull him off, you know, he's my friend and he's all over me. I got blood and everything, and I'm trying to hold him together, put him together, his fucking insides keep coming out, and nobody would help. Nobody would help, and he's saying \"I wanna go home. I wanna go home.\" He keeps calling my name. \"I wanna go home, Johnny. I wanna drive my Chevy\". I said \"With what? I can't find your fucking legs. I can't find your legs.\" I can't get it out of my head. I've dreamed it for seven years. Every day, I have this. And sometimes, I wake up, and I don't know where I am. I don't talk to anybody. Sometimes a day, a week, I can't put it out of my mind._\r\n\r\n- _First Blood_ (1982); Wri. Michael Kozoll, William Sackheim, Sylvester Stallone, (based on the 1972 novel by David Morrell); Dir. Ted Kotcheff\r\n\r\n>**Maj. Roger Murdock**: _Trautman, I still don't think you understand what this is all about._\r\n\r\n>**Trautman**: _The same as it always is. Money. In '72 we were supposed to pay the Cong four-and-a-half billion in war reparations. We reneged, they kept the POWs, and you're doing the same thing all over again._\r\n\r\n>**Murdock**: _And what the hell would you do, Trautman? Pay blackmail money to ransom our own men and finance the war effort against our allies? What if some burn-out POW shows up on the six o-clock news? What do you want to do? Start the war all over again? You wanna bomb Hà Nội? You want everybody screaming for armed invasion? Do you honestly think somebody's gonna get up on the floor of the United States Senate, and ask for billions of dollars for a couple of forgotten ghosts?_\r\n\r\n- _Rambo: First Blood Part II_ (1985); Wri. Sylvester Stallone, James Cameron (from a story by Kevin Jarre); Dir. George P. Cosmatos\r\n\r\n>**Trautman**: _You expect sympathy? You started this damn war, now you'll have to deal with it._\r\n\r\n>**Col. Alexei Zaysen**: _And we will. It is just a matter of time before we achieve a complete victory._\r\n\r\n>**Trautman**: _There won't be a victory. Every day, your war machines lose ground to a bunch of poorly-armed, poorly-equipped freedom fighters. The fact is that you underestimated your competition. If you'd studied your history, you'd know that these people have never given up to anyone. They'd rather die than be slaves to an invading army. You can't defeat a people like that. We tried; we already had our Việt Nam. Now you're going to have yours._\r\n\r\n- _Rambo III_ (1988); Wri. Sylvester Stallone, Sheldon Lettich; Dir. Peter MacDonald\r\n\r\n>**Rambo**: _Go live your life 'cause you've got a good one._\r\n\r\n>**Sarah Miller**: _It's what I'm trying to do._\r\n\r\n>**Rambo**: _No, what you're trying to do is change what is._\r\n\r\n>**Sarah**: _And what is?_\r\n\r\n>**Rambo**: _That we're like animals. It's in the blood. It's natural. Peace? That's an accident. It's what is. When you're pushed, killing's as easy as breathing. When the killing stops in one place, it starts in another, but that's okay, 'cause you're killing for your country. But it ain't your country who asks you, it's a few men up top who want it. Old men start it, young men fight it, nobody wins, everybody in the middle dies, and nobody tells the truth. God's gonna make all that go away? Don't waste your life, I did. Go home._\r\n\r\n- _Rambo_ (2008); Wri. Art Monterastelli, Sylvester Stallone; Dir. Sylvester Stallone\r\n\r\nIn the torrent of negative reviews that greeted _Rambo: Last Blood_, one that stood out was Richard Roeper's zero-star rant for _The Chicago Sun Times_, in which he said of the film, \"_this is a gratuitously violent, shamelessly exploitative, gruesomely sadistic and utterly repellent piece of trash_\". I agree with pretty much all of that sentence. And I loved it. But let me segue into asking a question. Which is the more \"responsible\" - the hard R-rated movie that makes no bones about its violent content, or the equally violent PG-13 movie that gets around the issue by removing the gore but leaving the savagery? _Last Blood_ is only moderately more violent than the movies in the _Taken_ franchise, for example, but it's a damn-sight more honest in its depiction of the impact of violence on the human body. It's like the old joke about _The A-Team_ - it didn't matter what the level of violence was, the fact that we never saw blood and never saw anyone die meant it was family entertainment. _Last Blood_ is not family entertainment. Nor is it trying to be. Nor does it want to be. It's a throwback to a time before studios saw an R as a death-knell; a threadbare story leading to an extended action scene of ever-increasing ridiculousness and viciousness.\r\n\r\nAnd it's awesome.\r\n\r\nIn an age of political correctness, when almost everyone with a public voice is afraid to say anything that might earn them a ticking off, it's easy enough for a film to stand out, but only if the filmmaker has the balls to stand there relatively alone. S. Craig Zahler's superb _Dragged Across Concrete_ (2018) was a good recent example, an unashamedly trashy piece of exploitation that wasn't afraid to air opinions that could be considered (say it quietly) right-wing. Now, make no mistake, _Last Blood_ is no _Dragged Across Concrete_; it's barely a movie at all (the script is so rudimentary, it rivals the dizzying complexities of _Rocky IV_), and it's by far the least political entry in the _Rambo_ franchise thus far. Is it xenophobic? Yes. Is it racist? To a certain extent. Is it likely to stoke irrational fears about the evils of Mexico and permeability of the southern border? Possibly. What it definitely is, however, is a film in which Rambo doesn't just kill his enemies, he kills them several times just to be sure (like the unfortunate schmuck who is decapitated via close-range shotgun blast and then shot several times in the torso for punctuation). What it definitely is, is a film in which on no less than two occasions, Rambo uses his bare hands to extract internal organs. What it definitely is, is an immensely enjoyable no-holds-barred revenge actioner that's about as interested in political correctness as it is in millennial angst. Which is to say, not even remotely.\r\n\r\nAnd it's awesome.\r\n\r\nWhen last we saw former Green Beret John J. Rambo (Sylvester Stallone), it was 2008, and he had returned to the US for the first time since 1985. Heading to his father's ranch in Bowie, Arizona, the implication was that maybe, after conflicts in Việt Nam (twice), Afghanistan (where he fought alongside the Mujahideen), and Myanmar (where he faced off against the Tatmadaw), and an extended residency in Thailand, he had finally come home in both a literal and existential sense. _Last Blood_ picks up the story 11 years later. His father has died, but Rambo remains at the ranch, breaking in horses and taking medication to keep his PTSD partially under-control. He shares his home with live-in housekeeper Maria Beltran (Adriana Barraza) and her teenage granddaughter Gabriela (Yvette Monreal), who refers to him as uncle and who he helped to raise. All is quiet until Gabriela is contacted from Mexico by her friend Gizelle (Fenessa Pineda), who tells her she has located Gabriela's father Manuel (Marco de la O), who walked out on her and her dying mother when she was still a child. Soon to be heading off to college, Gabriela is determined to look Manuel in the eye and ask why he left his family. Although advised by both Rambo and Maria not to go to Mexico, she ignores their warnings and heads south anyway. After Manuel proves as cruel as Rambo told her he was, she and Gizelle head out for a few drinks, but she is drugged and abducted by the Martinez brothers, Hugo (Sergio Peris-Mencheta) and Victor (Óscar Jaenada), who run a prostitution ring. Meanwhile, Rambo comes looking for her, but earns a beating for his troubles, only surviving because of the intervention of Carmen Delgado (Paz Vega), a local journalist investigating the Martinez cartel. And so, realising he can't fight the cartel on their territory and terms, Rambo decides to lure them back to Arizona, where he can fight them on his.\r\n\r\nIntroduced in David Morrell's superb 1972 novel, _First Blood_, the character of John Rambo was brought to the screen 10 years later, in the film of the same name, written by Michael Kozoll, William Sackheim, and Stallone, and directed by Ted Kotcheff. A Việt Nam vet who finds himself unable to integrate back into a society that now hates him, he runs afoul of Sheriff Will Teasle (Brian Dennehy) in the small town of Hope, WA, against whom he wages a guerrilla war. One of many Việt Nam-vet-comes-home-and-is-rejected-by-society films made in the years following the end of the Việt Nam War (1955-1975), the character was praised as a particularly salient embodiment of the problems of unaddressed-PTSD. The novel ended with Rambo's commanding officer, Col. Trautman (played in the film by Richard Crenna) recognising that the man who came home from Việt Nam could never be at peace in the US and shooting him dead in an act of mercy. The film was also supposed to end this way, but test audiences disliked the sense of nihilism with which they were left, and so a new ending was shot which saw Rambo arrested and imprisoned, but very much alive.\r\n\r\nOf course, Rambo hadn't been conceived as a muscle-bound action hero; Morell has always maintained the novel was a piece of social protest, and Stallone has spoken about how he thought of the film as the slightly more action-orientated, but equally serious, cousin of prestige dramas such as Hal Ashby's _Coming Home_ and Michael Cimino's _The Deer Hunter_ (both 1978). Nevertheless, it was the action elements of the film rather than the inherent tragedy of the character that audiences embraced, and for _Rambo: First Blood Part II_ (1985), written by Stallone and James Cameron, from a screen story by Kevin Jarre, and directed by George P. Cosmatos, Rambo took his first steps towards becoming a cartoon, as now the misunderstood vet who just wanted to be left alone was given a chance to return to Việt Nam to fight the war the right way, rescuing undeclared POWs from the clutches of a Soviet/Việt Nam conspiracy. With his actions in the second film earning him a pardon for his actions in the first, in _Rambo III_ (1988), written by Stallone and Sheldon Lettich, and directed by Peter MacDonald, things got even more ridiculous, as Rambo, now the embodiment of jingoistic Regan-era American militarism, was tasked with entering Afghanistan in the midst of the Soviet-Afghan War, where he would fight alongside the Mujahideen against the Soviet war machine. Finally, in _Rambo_ (2008), written by Art Monterastelli and Stallone, and directed by Stallone, Rambo must penetrate into Myanmar to rescue a group of Christian aid workers from the clutches of the Tatmadaw, an entire battalion of whom he massacres with a commandeered M2 Browning in a gloriously violent finale.\r\n\r\nUndeniably, for better or worse, the _Rambo_ films have always found a way to tap into some of the major geopolitical issues of the era in which they were made. The first film, made in the second year of Reagan's presidency, was a thoughtful and genuinely heartfelt plea for understanding, arguing that you can't create killing machines for use in a foreign war and then simply bring them home and expect them to reintegrate. Indeed, it's a film that's relatively uninterested in violence _per se_ (Rambo only indirectly kills one person, and it's an accident). The next two films also took place during Reagan's presidency, at a time when although the wounds of Việt Nam were still fresh, the idea of American exceptionalism had started to morph into a kind of over-compensatory machismo. It was for this reason that the perceptive and justified seriousness of the first film became diluted as Rambo transitioned from being an allegory for the real struggles of vets to an embodiment of juvenile wish-fulfilment (I mean, in the second film, he literally gets a second crack at winning in Việt Nam). In essence, he had transitioned from a symbol for the psychological damage of war to an undefeatable representative of American military might. The fourth film came out in the final year of George W. Bush's presidency at a time when the US (in no small part because of an illegal war) had once again risen to the position of global police force, although the fact that he's on a mission to save, of all things, Christian aid workers, is a bit on the nose even for this franchise. \r\n\r\nAll of which brings us to _Last Blood_. Written by Stallone and Matthew Cirulnick, from a story by Dan Gordon, and directed by Adrian Grunberg (_Get the Gringo_), _Last Blood_, of course, comes in the fourth year of Donald Trump's presidency, and sees Rambo facing off against the bad _hombres_ south of the border (they bring drugs, they bring crime, they're rapists, although some, he assumes, are good people). And with a border this porous (characters easily cross over with weaponry, drugs, dead bodies, and, on one occasion, a decapitated head on the passenger seat), the only person who can protect the US of A from such villains is Don J. Trumpo...sorry, John J. Rambo. It's all gloriously juvenile, gloriously transparent, and gloriously entertaining.\r\n\r\nHowever, having said that, this is far and away the least political film of the franchise. Whilst the first and second both dealt explicitly with Việt Nam, the third with the Soviet-Afghan war, and the fourth with the Myanmar Civil War, _Last Blood_ doesn't explicitly deal with a real-world conflict. It certainly alludes to real-world controversies, primarily issues related to the US-Mexican border, but it's not set in an inherently politicised _milieu_ the way the previous films have. And this ties into a crucial point – in moving out of the arena of politics, the storyline is more personal, which is important insofar as Rambo himself is presented somewhat differently this time, showing more emotion than we've seen from him since the opening few scenes of _First Blood_ (which Stallone has rightly pointed to as the last time we saw a vulnerable, very much human Rambo). This aspect of the film, in and of itself, is pretty fascinating, as it's also the only time since _First Blood_ where his PTSD has been so front-and-centre, as that element of his character was downplayed to the point of being virtually forgotten in the other three films. Here, not only is Rambo shown as still suffering the effects, he actually leans into it, using his trauma to motivate himself, essentially getting himself back into a Việt Nam mindset, which is a pretty interesting way of presenting a character who has been rendered in simpler and simpler terms as the films have gone on. In this sense, the early parts of the film work extremely well from a psychological point of view – we see Rambo in a home, we see him trying to keep his demons at bay, we see him, for arguably the first time, with something to lose.\r\n\r\nHowever, for better or worse, the film's big selling point isn't the political allegory or the character's psychology – it's the action, the \"suit-up\" moment when Rambo unleashes hell. Here, the entire third-act is one long action scene, and it's entertaining enough to temper some of the political immaturity and distasteful stereotypes that lead up to it. Luring the Martinez cartel back to Arizona, Rambo hides out in a series of tunnels under the ranch, stalking and dispatching them one by one with simple, but vicious, man-made traps, in a scene that partly recalls his forest pursuit of Teasel and his men early in _First Blood_.\r\n\r\nWell shot by director Grunberg and cinematographer Brendan Galvin (_Veronica Guerin_; _Immortals_; _Self/less_), it's kind of the inverse of the sleek action scenes found in the _John Wick_ films - it's dark, gritty, and brutal, and whereas those films often create the impression of near weightlessness, here, it's the tangible physicality that works so well, the sense of visceral devastation that results from a particular impact rather than anything balletic. Editors Carsten Kurpanek (_Kickboxer: Vengeance_) and Todd E. Miller (_The Expendables 2_; _The Purge: Election Year_; _Mechanic: Resurrection_) also do terrific work here. Large portions of the scene take place in reasonably poorly lit underground tunnels, with very little to distinguish one location from another, so the fact that the grammar of the combat is so well maintained is a credit to them – you always know roughly where you are at any given moment, and never once did I find myself losing consciousness because of a flurry of incoherent edits (another problem with the _Taken_ films).\r\n\r\nOf course, a vital aspect of any Rambo movie is that a lot of what some people love will be the exact things that others despise. In this case, it's the laughably simplistic politics, the barely disguised xenophobia, the brutal violence, and the fetishisation of weaponry. On this last point, I can't recall, off the top of my head, another film which is so blatant in its glorification of guns, whether it's the long tracking shots of Rambo's collection of rifles, or the way the film lingers on the destruction they mete out. In short, this is the NRA's wet dream – an all-American hero dispensing biblical assault rifle-based vengeance on a bunch of greasy Mexican scumbags. Charlton Heston would be proud, bigly (yeah, I know, I'm mixing my right-wing references). \r\n\r\nThe film's handling of the Mexican portion of the story is also a good example of how you either decry the stupidity or celebrate the ridiculousness. The character of Gazelle, for example, dresses like the only research the costume department did was to watch Ramón Menéndez's _Stand and Deliver_ (1988) – she literally wears pleated khakis, a chequered blue and white shirt, dark lip-liner, and a bandana tied at the front. Similarly, poor Gabriela gets abducted after one night (count 'em, ONE night) in Mexico, where, apart from Carmen, every single character we meet is either in the cartel, involved in prostitution, or, in a lot of cases, both. And as for the aforementioned porousness of the border, I'm not sure if it's appallingly lazy writing or satirical genius, but Rambo (who at this point is carrying some questionable items) gets back into the US by simply finding a quiet section and ploughing his truck through the wire mesh fence (ignoring a sign warning against illegal crossings, because Rambo spits at signage). He wouldn't have been able to do that if there'd been a wall.\r\n\r\nOn the other hand, a criticism that I would treat a little more seriously is that although this is supposed to be the last chapter in the franchise, the script doesn't have any sense of finality. Nothing happens at any point where you could say to yourself, \"that seems a fitting send-off for the character\". From the generic and mainly faceless villains to the rote dialogue to the poorly constructed narrative beats, never at any point did this feel like a culmination. In fact, the previous film felt more final than this one does, as at least that one gave the character a degree of closure. And speaking of the script, much as _Rocky IV_ was two boxing matches loosely tied together by montages (including a montage in which Rocky thinks about montages), _Last Blood_ is 40 minutes of plot loosely connected to an extended action scene via, you guessed it, a series of montages.\r\n\r\nFinally, it would be remiss of me not to mention David Morrell's opinion on the film. At one point, Morrell was actually working on a script for the film with Stallone, which he said gave Rambo a \"_soulful journey_\", and featured a \"_really emotional, powerful story_\". However, their draft was rejected in favour of an earlier idea which saw Rambo head to Mexico to rescue a young girl. Upon seeing the completed film, Morrell was far from impressed, writing on Twitter, \"_the film is a mess. Embarrassed to have my name associated with it_\", and later telling _Newsweek_,\r\n\r\n>_I felt degraded and dehumanised after I left the theatre. Instead of being soulful, this new movie lacks one. I felt I was less a human being for having seen it, and today that's an unfortunate message._\r\n\r\nMake of that what you will.\r\n\r\nIn many ways, _Last Blood_ is a hilariously bad film. But it's also a hugely entertaining film. And sure, it continues a process which has seen a character who was once a representative for the nation's wounded psyche and just how dehumanising war can be, transition into an unstoppable jingoistic war machine. And sure, the violence is off the chart. And sure, the politics are hilariously naïve at best, dangerously reductionist at worse, with Rambo coming to embody some of the current administration's most racist ideological arguments. But it's extremely well shot, Stallone gives a predictably strong performance, the action is intense, and, for me, none of the problems are so large as to render the film unenjoyable. Approach it with the right frame of mind, and you'll find much to appreciate.", "created_at": "2019-10-09T15:42:07.859Z"}, {"movie_id": 522938, "review_id": "5e0282c8c5840d001309dc43", "author_rating": 7.0, "review_text": "Action (and violence) filled sequel (and likely last) in the Rambo franchise. Not nearly as good as First Blood or Rambo (2008), but still darkly entertaining flick with another solid performance from Stallone who thankfully hasn't gone into the lazy realm like Steven Seagal.\r\n\r\nThere are some plot contrivances one has to get past but still enjoyed this entry and it is one insane of an ending. **3.75/5**", "created_at": "2019-12-24T21:27:36.166Z"}, {"movie_id": 522938, "review_id": "5ea5cfd87390c0001fa6566b", "author_rating": 7.0, "review_text": "_**Rambo goes to Mexico**_\r\n\r\nRambo (Sylvester Stallone) has been living on the family ranch in southern Arizona for the last ten years. When his niece (Yvette Monreal) goes missing across the border he has to fight a cartel of thugs to get her back. Paz Vega is on hand as a helpful journalist.\r\n\r\n“Rambo: Last Blood” (2019) is the fifth and probably last of the Rambo franchise since Stallone was 72 during filming. While the plot is simple, with elements bringing to mind “One-Eyed Jacks” (1961) and “Conan the Barbarian” (1982), the film is a worthy addition to the series, albeit not quite as good as the previous one. \r\n\r\nIt provides what fans look for in a Rambo flick: A one-man-army situation with a noble cause and plenty of brutal action. While criticized for being “racist,” it’s no more racist than the other Rambo flicks. “Last Blood” never for a second suggests that ALL Mexicans are evil any more than ALL cops, Vietnamese, Afghans and Siamese were evil in the four previous films. Speaking of which, for me, this installment places third after “First Blood” (1982) and “Rambo IV” (2008).      \r\n\r\nThe movie runs 1 hour, 29 minutes, and was shot in Santa Cruz de Tenerife, Canary Islands, Spain. There’s also an Extended Cut that runs 12 minutes longer.\r\n\r\nGRADE: B", "created_at": "2020-04-26T18:15:52.673Z"}, {"movie_id": 522938, "review_id": "5f1d320c66a7c30038084d48", "author_rating": 5.0, "review_text": "The _Rambo_ franchise underwent a massive change after the first movie, and that new direction has stuck with the series ever since they put _Rambo_ in the title. But even all the way back in First Blood, John Rambo's actions seemed to have always been fuelled by desperation. In _Last Blood_ however, Rambo's actions are calculated, and personal. It's something I'd never really considered before, but I actually don't like this direction for the character. It's not that it doesn't make sense, because it does, just personally I preferred when Rambo was surviving the bad world that was happening to him, not creating it.\r\n\r\n2008's _Rambo_ was over the top and its very existence seemed bizarre, but it also felt like John Rambo \"came full circle\" as it were, which sort of justified that existence. _Last Blood_ doesn't really feel like it re-opened or closed any circle. It kind of feels like an episode of a long-running show I haven't watched the last 10+ seasons of. Stallone seems to think he'll be getting a _Rambo 6_ where he's on a Rez, if that's the plan, why bother calling this one \"_Last Blood_\", and if it's not the case, why make this movie that starts and ends like it's supposed to slot in between other pieces of a story we haven't gotten yet?\r\n\r\nEnd of the day, _Last Blood_ was okay. A low point for the series, arguably even the lowest, but it was a franchise that has always been at least a little enjoyable, so that's not too harsh a burn.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-07-26T07:34:36.312Z"}, {"movie_id": 522938, "review_id": "5fd74c5dd8e225003f1b95c4", "author_rating": 1.0, "review_text": "This (so called) Movie is just a waste of time. Seems more like a \"Build the Wall\" advertisment. Did Trump finance this?", "created_at": "2020-12-14T11:28:29.198Z"}, {"movie_id": 522938, "review_id": "63bf6dab23be4600b2f08018", "author_rating": 10.0, "review_text": "So I'm going ahead and giving this 10 out of 10 stars, not because I think it deserves it, but because there is a 1 star review entitled \"White Supremacy is Cancer\" and that seems to be the concept of a LOT of negative reviews.\r\n\r\nHowever, I have actually seen it and I can 100% guarantee that it has NOTHING to do with the content of those reviews. None of that is mentioned or implied.\r\n\r\nHOWEVER, there are negative reviews that ultimately say that this is NOT a Rambo film... and that is fair. If you compare it to Rambo First Blood Part II, III, and Rambo the 1 star reviews make sense. It is not at all like 2-4... so if you are expecting a Rambo like the sequels you're probably not going to like it... but you are probably not going to like it for entirely fair reasons.\r\n\r\nI won't fault you for that negative review.\r\n\r\nIt's a lot more like the first film. More like Rambo First Blood... only instead of the military it's a drug cartel and instead of chasing Rambo he's... kind of... chasing them.... kind of... for revenge.\r\n\r\nLike all the other Rambo movies, it's formulaic. Once more we start off with Rambo trying to get out of the business, and this time he has gotten out and been adopted as an \"Uncle\" by a Latino family.\r\n\r\nAnd to follow the formula, like in the Godfather, he gets pulled back in. This time the daughter of said Latino family leaves to track down her family, goes to cartel occupied Mexico, and gets promptly kidnapped, sending Rambo on a blood crazed path to get her back and deliver vengeance on the cartels.\r\n\r\nUnlike the sequels, however, it's a little more of a slow burner. It takes a little more time to set up the characters, it takes a little more time to set up the plot and the relationships, and (shockingly given that in most of the Rambo films the enemy is almost faceless he's so under-developed) it actually takes a little time to set up the heavy as well.\r\n\r\nAnd in the end there is a lot of killing, a lot of elderly action, and ultimately a lot of fun... but what there is not a lot of is political messaging... because, at it's heart, it's just another action movie.\r\n\r\nWhich leads me to the third type of negative review... the reviews critical of it being an action movie... those I don't understand... It's a Rambo movie, you know exactly what it is... and action movie... so what kind of film did they think they were going to see?", "created_at": "2023-01-12T02:17:15.305Z"}, {"movie_id": 522938, "review_id": "5d9dffcf3d4d96003782c94e", "author_rating": 8.0, "review_text": "**_Guns, carnage, explosions, and xenophobia - everything you could want from a Rambo movie; hugely entertaining_**\r\n\r\n>**Col. Sam Trautman**: _Think about what you're doing. The building's perimeter is covered. No exit. There are nearly 200 men out there and a lot of M-16s. You did everything to make this private war happen. You've done enough damage. This mission is over, Rambo. Do you understand me? This mission is over. Look at them out there. Look at them. If you won't end this now, they will kill you. Is that what you want? It's over, Johnny. It's over._\r\n\r\n>**John Rambo**: _NOTHING IS O__VER. Nothing. You just don't turn it off. It wasn't my war. You asked me, I didn't ask you. And I did what I had to do to win, but somebody wouldn't let us win. And I come back to the world, and I see all those maggots at the airport, protesting me, spitting, calling me \"baby killer\", and all kinds of vile crap. Who are they to protest me, huh? Who are they, unless they been me and been there, and know what the hell they're yelling about?_\r\n\r\n>**Trautman**: _It was a bad time for everyone, Rambo. It's all in the past now._\r\n\r\n>**Rambo**: _For you. For me, civilian life is nothing. In the field, we had a code of honour. You watch my back, I watch your's. Back here, there's nothing._\r\n\r\n>**Trautman**: _You're the last of an elite group. Don't end it like this._\r\n\r\n>**Rambo**: _Back there, I could fly a gunship. I could drive a tank. I was in charge of million dollar equipment. Back here, I can't even get a job PARKING CARS. Where is everybody? Oh, God. I had a friend, was in the Air Force. I had all these guys, man. Back there, I had all these fucking guys who were my friends. Back here, there's nothing. Remember Danforth? He wore this black headband, and he took one of those magic markers. He mailed it to Las Vegas, 'cause we were always talking about Vegas, and this fucking car, this red '58 Chevy convertible, he was talking about this car; he said we were gonna cruise 'til the tires fall off. [begins sobbing] We were in this bar in Saigon and this kid comes up, this kid carrying a shoe-shine box. And he says, \"Shine, please, shine\". I said \"No.\" He kept asking, and Joey said \"Yeah.\" And, I went to get a couple beers, and the box was wired, and he opened up the box, fucking blew his body all over the place. And he's laying there, and he's fucking screaming, there's pieces of him all over me, and I'm tryin' to pull him off, you know, he's my friend and he's all over me. I got blood and everything, and I'm trying to hold him together, put him together, his fucking insides keep coming out, and nobody would help. Nobody would help, and he's saying \"I wanna go home. I wanna go home.\" He keeps calling my name. \"I wanna go home, Johnny. I wanna drive my Chevy\". I said \"With what? I can't find your fucking legs. I can't find your legs.\" I can't get it out of my head. I've dreamed it for seven years. Every day, I have this. And sometimes, I wake up, and I don't know where I am. I don't talk to anybody. Sometimes a day, a week, I can't put it out of my mind._\r\n\r\n- _First Blood_ (1982); Wri. Michael Kozoll, William Sackheim, Sylvester Stallone, (based on the 1972 novel by David Morrell); Dir. Ted Kotcheff\r\n\r\n>**Maj. Roger Murdock**: _Trautman, I still don't think you understand what this is all about._\r\n\r\n>**Trautman**: _The same as it always is. Money. In '72 we were supposed to pay the Cong four-and-a-half billion in war reparations. We reneged, they kept the POWs, and you're doing the same thing all over again._\r\n\r\n>**Murdock**: _And what the hell would you do, Trautman? Pay blackmail money to ransom our own men and finance the war effort against our allies? What if some burn-out POW shows up on the six o-clock news? What do you want to do? Start the war all over again? You wanna bomb Hà Nội? You want everybody screaming for armed invasion? Do you honestly think somebody's gonna get up on the floor of the United States Senate, and ask for billions of dollars for a couple of forgotten ghosts?_\r\n\r\n- _Rambo: First Blood Part II_ (1985); Wri. Sylvester Stallone, James Cameron (from a story by Kevin Jarre); Dir. George P. Cosmatos\r\n\r\n>**Trautman**: _You expect sympathy? You started this damn war, now you'll have to deal with it._\r\n\r\n>**Col. Alexei Zaysen**: _And we will. It is just a matter of time before we achieve a complete victory._\r\n\r\n>**Trautman**: _There won't be a victory. Every day, your war machines lose ground to a bunch of poorly-armed, poorly-equipped freedom fighters. The fact is that you underestimated your competition. If you'd studied your history, you'd know that these people have never given up to anyone. They'd rather die than be slaves to an invading army. You can't defeat a people like that. We tried; we already had our Việt Nam. Now you're going to have yours._\r\n\r\n- _Rambo III_ (1988); Wri. Sylvester Stallone, Sheldon Lettich; Dir. Peter MacDonald\r\n\r\n>**Rambo**: _Go live your life 'cause you've got a good one._\r\n\r\n>**Sarah Miller**: _It's what I'm trying to do._\r\n\r\n>**Rambo**: _No, what you're trying to do is change what is._\r\n\r\n>**Sarah**: _And what is?_\r\n\r\n>**Rambo**: _That we're like animals. It's in the blood. It's natural. Peace? That's an accident. It's what is. When you're pushed, killing's as easy as breathing. When the killing stops in one place, it starts in another, but that's okay, 'cause you're killing for your country. But it ain't your country who asks you, it's a few men up top who want it. Old men start it, young men fight it, nobody wins, everybody in the middle dies, and nobody tells the truth. God's gonna make all that go away? Don't waste your life, I did. Go home._\r\n\r\n- _Rambo_ (2008); Wri. Art Monterastelli, Sylvester Stallone; Dir. Sylvester Stallone\r\n\r\nIn the torrent of negative reviews that greeted _Rambo: Last Blood_, one that stood out was Richard Roeper's zero-star rant for _The Chicago Sun Times_, in which he said of the film, \"_this is a gratuitously violent, shamelessly exploitative, gruesomely sadistic and utterly repellent piece of trash_\". I agree with pretty much all of that sentence. And I loved it. But let me segue into asking a question. Which is the more \"responsible\" - the hard R-rated movie that makes no bones about its violent content, or the equally violent PG-13 movie that gets around the issue by removing the gore but leaving the savagery? _Last Blood_ is only moderately more violent than the movies in the _Taken_ franchise, for example, but it's a damn-sight more honest in its depiction of the impact of violence on the human body. It's like the old joke about _The A-Team_ - it didn't matter what the level of violence was, the fact that we never saw blood and never saw anyone die meant it was family entertainment. _Last Blood_ is not family entertainment. Nor is it trying to be. Nor does it want to be. It's a throwback to a time before studios saw an R as a death-knell; a threadbare story leading to an extended action scene of ever-increasing ridiculousness and viciousness.\r\n\r\nAnd it's awesome.\r\n\r\nIn an age of political correctness, when almost everyone with a public voice is afraid to say anything that might earn them a ticking off, it's easy enough for a film to stand out, but only if the filmmaker has the balls to stand there relatively alone. S. Craig Zahler's superb _Dragged Across Concrete_ (2018) was a good recent example, an unashamedly trashy piece of exploitation that wasn't afraid to air opinions that could be considered (say it quietly) right-wing. Now, make no mistake, _Last Blood_ is no _Dragged Across Concrete_; it's barely a movie at all (the script is so rudimentary, it rivals the dizzying complexities of _Rocky IV_), and it's by far the least political entry in the _Rambo_ franchise thus far. Is it xenophobic? Yes. Is it racist? To a certain extent. Is it likely to stoke irrational fears about the evils of Mexico and permeability of the southern border? Possibly. What it definitely is, however, is a film in which Rambo doesn't just kill his enemies, he kills them several times just to be sure (like the unfortunate schmuck who is decapitated via close-range shotgun blast and then shot several times in the torso for punctuation). What it definitely is, is a film in which on no less than two occasions, Rambo uses his bare hands to extract internal organs. What it definitely is, is an immensely enjoyable no-holds-barred revenge actioner that's about as interested in political correctness as it is in millennial angst. Which is to say, not even remotely.\r\n\r\nAnd it's awesome.\r\n\r\nWhen last we saw former Green Beret John J. Rambo (Sylvester Stallone), it was 2008, and he had returned to the US for the first time since 1985. Heading to his father's ranch in Bowie, Arizona, the implication was that maybe, after conflicts in Việt Nam (twice), Afghanistan (where he fought alongside the Mujahideen), and Myanmar (where he faced off against the Tatmadaw), and an extended residency in Thailand, he had finally come home in both a literal and existential sense. _Last Blood_ picks up the story 11 years later. His father has died, but Rambo remains at the ranch, breaking in horses and taking medication to keep his PTSD partially under-control. He shares his home with live-in housekeeper Maria Beltran (Adriana Barraza) and her teenage granddaughter Gabriela (Yvette Monreal), who refers to him as uncle and who he helped to raise. All is quiet until Gabriela is contacted from Mexico by her friend Gizelle (Fenessa Pineda), who tells her she has located Gabriela's father Manuel (Marco de la O), who walked out on her and her dying mother when she was still a child. Soon to be heading off to college, Gabriela is determined to look Manuel in the eye and ask why he left his family. Although advised by both Rambo and Maria not to go to Mexico, she ignores their warnings and heads south anyway. After Manuel proves as cruel as Rambo told her he was, she and Gizelle head out for a few drinks, but she is drugged and abducted by the Martinez brothers, Hugo (Sergio Peris-Mencheta) and Victor (Óscar Jaenada), who run a prostitution ring. Meanwhile, Rambo comes looking for her, but earns a beating for his troubles, only surviving because of the intervention of Carmen Delgado (Paz Vega), a local journalist investigating the Martinez cartel. And so, realising he can't fight the cartel on their territory and terms, Rambo decides to lure them back to Arizona, where he can fight them on his.\r\n\r\nIntroduced in David Morrell's superb 1972 novel, _First Blood_, the character of John Rambo was brought to the screen 10 years later, in the film of the same name, written by Michael Kozoll, William Sackheim, and Stallone, and directed by Ted Kotcheff. A Việt Nam vet who finds himself unable to integrate back into a society that now hates him, he runs afoul of Sheriff Will Teasle (Brian Dennehy) in the small town of Hope, WA, against whom he wages a guerrilla war. One of many Việt Nam-vet-comes-home-and-is-rejected-by-society films made in the years following the end of the Việt Nam War (1955-1975), the character was praised as a particularly salient embodiment of the problems of unaddressed-PTSD. The novel ended with Rambo's commanding officer, Col. Trautman (played in the film by Richard Crenna) recognising that the man who came home from Việt Nam could never be at peace in the US and shooting him dead in an act of mercy. The film was also supposed to end this way, but test audiences disliked the sense of nihilism with which they were left, and so a new ending was shot which saw Rambo arrested and imprisoned, but very much alive.\r\n\r\nOf course, Rambo hadn't been conceived as a muscle-bound action hero; Morell has always maintained the novel was a piece of social protest, and Stallone has spoken about how he thought of the film as the slightly more action-orientated, but equally serious, cousin of prestige dramas such as Hal Ashby's _Coming Home_ and Michael Cimino's _The Deer Hunter_ (both 1978). Nevertheless, it was the action elements of the film rather than the inherent tragedy of the character that audiences embraced, and for _Rambo: First Blood Part II_ (1985), written by Stallone and James Cameron, from a screen story by Kevin Jarre, and directed by George P. Cosmatos, Rambo took his first steps towards becoming a cartoon, as now the misunderstood vet who just wanted to be left alone was given a chance to return to Việt Nam to fight the war the right way, rescuing undeclared POWs from the clutches of a Soviet/Việt Nam conspiracy. With his actions in the second film earning him a pardon for his actions in the first, in _Rambo III_ (1988), written by Stallone and Sheldon Lettich, and directed by Peter MacDonald, things got even more ridiculous, as Rambo, now the embodiment of jingoistic Regan-era American militarism, was tasked with entering Afghanistan in the midst of the Soviet-Afghan War, where he would fight alongside the Mujahideen against the Soviet war machine. Finally, in _Rambo_ (2008), written by Art Monterastelli and Stallone, and directed by Stallone, Rambo must penetrate into Myanmar to rescue a group of Christian aid workers from the clutches of the Tatmadaw, an entire battalion of whom he massacres with a commandeered M2 Browning in a gloriously violent finale.\r\n\r\nUndeniably, for better or worse, the _Rambo_ films have always found a way to tap into some of the major geopolitical issues of the era in which they were made. The first film, made in the second year of Reagan's presidency, was a thoughtful and genuinely heartfelt plea for understanding, arguing that you can't create killing machines for use in a foreign war and then simply bring them home and expect them to reintegrate. Indeed, it's a film that's relatively uninterested in violence _per se_ (Rambo only indirectly kills one person, and it's an accident). The next two films also took place during Reagan's presidency, at a time when although the wounds of Việt Nam were still fresh, the idea of American exceptionalism had started to morph into a kind of over-compensatory machismo. It was for this reason that the perceptive and justified seriousness of the first film became diluted as Rambo transitioned from being an allegory for the real struggles of vets to an embodiment of juvenile wish-fulfilment (I mean, in the second film, he literally gets a second crack at winning in Việt Nam). In essence, he had transitioned from a symbol for the psychological damage of war to an undefeatable representative of American military might. The fourth film came out in the final year of George W. Bush's presidency at a time when the US (in no small part because of an illegal war) had once again risen to the position of global police force, although the fact that he's on a mission to save, of all things, Christian aid workers, is a bit on the nose even for this franchise. \r\n\r\nAll of which brings us to _Last Blood_. Written by Stallone and Matthew Cirulnick, from a story by Dan Gordon, and directed by Adrian Grunberg (_Get the Gringo_), _Last Blood_, of course, comes in the fourth year of Donald Trump's presidency, and sees Rambo facing off against the bad _hombres_ south of the border (they bring drugs, they bring crime, they're rapists, although some, he assumes, are good people). And with a border this porous (characters easily cross over with weaponry, drugs, dead bodies, and, on one occasion, a decapitated head on the passenger seat), the only person who can protect the US of A from such villains is Don J. Trumpo...sorry, John J. Rambo. It's all gloriously juvenile, gloriously transparent, and gloriously entertaining.\r\n\r\nHowever, having said that, this is far and away the least political film of the franchise. Whilst the first and second both dealt explicitly with Việt Nam, the third with the Soviet-Afghan war, and the fourth with the Myanmar Civil War, _Last Blood_ doesn't explicitly deal with a real-world conflict. It certainly alludes to real-world controversies, primarily issues related to the US-Mexican border, but it's not set in an inherently politicised _milieu_ the way the previous films have. And this ties into a crucial point – in moving out of the arena of politics, the storyline is more personal, which is important insofar as Rambo himself is presented somewhat differently this time, showing more emotion than we've seen from him since the opening few scenes of _First Blood_ (which Stallone has rightly pointed to as the last time we saw a vulnerable, very much human Rambo). This aspect of the film, in and of itself, is pretty fascinating, as it's also the only time since _First Blood_ where his PTSD has been so front-and-centre, as that element of his character was downplayed to the point of being virtually forgotten in the other three films. Here, not only is Rambo shown as still suffering the effects, he actually leans into it, using his trauma to motivate himself, essentially getting himself back into a Việt Nam mindset, which is a pretty interesting way of presenting a character who has been rendered in simpler and simpler terms as the films have gone on. In this sense, the early parts of the film work extremely well from a psychological point of view – we see Rambo in a home, we see him trying to keep his demons at bay, we see him, for arguably the first time, with something to lose.\r\n\r\nHowever, for better or worse, the film's big selling point isn't the political allegory or the character's psychology – it's the action, the \"suit-up\" moment when Rambo unleashes hell. Here, the entire third-act is one long action scene, and it's entertaining enough to temper some of the political immaturity and distasteful stereotypes that lead up to it. Luring the Martinez cartel back to Arizona, Rambo hides out in a series of tunnels under the ranch, stalking and dispatching them one by one with simple, but vicious, man-made traps, in a scene that partly recalls his forest pursuit of Teasel and his men early in _First Blood_.\r\n\r\nWell shot by director Grunberg and cinematographer Brendan Galvin (_Veronica Guerin_; _Immortals_; _Self/less_), it's kind of the inverse of the sleek action scenes found in the _John Wick_ films - it's dark, gritty, and brutal, and whereas those films often create the impression of near weightlessness, here, it's the tangible physicality that works so well, the sense of visceral devastation that results from a particular impact rather than anything balletic. Editors Carsten Kurpanek (_Kickboxer: Vengeance_) and Todd E. Miller (_The Expendables 2_; _The Purge: Election Year_; _Mechanic: Resurrection_) also do terrific work here. Large portions of the scene take place in reasonably poorly lit underground tunnels, with very little to distinguish one location from another, so the fact that the grammar of the combat is so well maintained is a credit to them – you always know roughly where you are at any given moment, and never once did I find myself losing consciousness because of a flurry of incoherent edits (another problem with the _Taken_ films).\r\n\r\nOf course, a vital aspect of any Rambo movie is that a lot of what some people love will be the exact things that others despise. In this case, it's the laughably simplistic politics, the barely disguised xenophobia, the brutal violence, and the fetishisation of weaponry. On this last point, I can't recall, off the top of my head, another film which is so blatant in its glorification of guns, whether it's the long tracking shots of Rambo's collection of rifles, or the way the film lingers on the destruction they mete out. In short, this is the NRA's wet dream – an all-American hero dispensing biblical assault rifle-based vengeance on a bunch of greasy Mexican scumbags. Charlton Heston would be proud, bigly (yeah, I know, I'm mixing my right-wing references). \r\n\r\nThe film's handling of the Mexican portion of the story is also a good example of how you either decry the stupidity or celebrate the ridiculousness. The character of Gazelle, for example, dresses like the only research the costume department did was to watch Ramón Menéndez's _Stand and Deliver_ (1988) – she literally wears pleated khakis, a chequered blue and white shirt, dark lip-liner, and a bandana tied at the front. Similarly, poor Gabriela gets abducted after one night (count 'em, ONE night) in Mexico, where, apart from Carmen, every single character we meet is either in the cartel, involved in prostitution, or, in a lot of cases, both. And as for the aforementioned porousness of the border, I'm not sure if it's appallingly lazy writing or satirical genius, but Rambo (who at this point is carrying some questionable items) gets back into the US by simply finding a quiet section and ploughing his truck through the wire mesh fence (ignoring a sign warning against illegal crossings, because Rambo spits at signage). He wouldn't have been able to do that if there'd been a wall.\r\n\r\nOn the other hand, a criticism that I would treat a little more seriously is that although this is supposed to be the last chapter in the franchise, the script doesn't have any sense of finality. Nothing happens at any point where you could say to yourself, \"that seems a fitting send-off for the character\". From the generic and mainly faceless villains to the rote dialogue to the poorly constructed narrative beats, never at any point did this feel like a culmination. In fact, the previous film felt more final than this one does, as at least that one gave the character a degree of closure. And speaking of the script, much as _Rocky IV_ was two boxing matches loosely tied together by montages (including a montage in which Rocky thinks about montages), _Last Blood_ is 40 minutes of plot loosely connected to an extended action scene via, you guessed it, a series of montages.\r\n\r\nFinally, it would be remiss of me not to mention David Morrell's opinion on the film. At one point, Morrell was actually working on a script for the film with Stallone, which he said gave Rambo a \"_soulful journey_\", and featured a \"_really emotional, powerful story_\". However, their draft was rejected in favour of an earlier idea which saw Rambo head to Mexico to rescue a young girl. Upon seeing the completed film, Morrell was far from impressed, writing on Twitter, \"_the film is a mess. Embarrassed to have my name associated with it_\", and later telling _Newsweek_,\r\n\r\n>_I felt degraded and dehumanised after I left the theatre. Instead of being soulful, this new movie lacks one. I felt I was less a human being for having seen it, and today that's an unfortunate message._\r\n\r\nMake of that what you will.\r\n\r\nIn many ways, _Last Blood_ is a hilariously bad film. But it's also a hugely entertaining film. And sure, it continues a process which has seen a character who was once a representative for the nation's wounded psyche and just how dehumanising war can be, transition into an unstoppable jingoistic war machine. And sure, the violence is off the chart. And sure, the politics are hilariously naïve at best, dangerously reductionist at worse, with Rambo coming to embody some of the current administration's most racist ideological arguments. But it's extremely well shot, Stallone gives a predictably strong performance, the action is intense, and, for me, none of the problems are so large as to render the film unenjoyable. Approach it with the right frame of mind, and you'll find much to appreciate.", "created_at": "2019-10-09T15:42:07.859Z"}, {"movie_id": 522938, "review_id": "5e0282c8c5840d001309dc43", "author_rating": 7.0, "review_text": "Action (and violence) filled sequel (and likely last) in the Rambo franchise. Not nearly as good as First Blood or Rambo (2008), but still darkly entertaining flick with another solid performance from Stallone who thankfully hasn't gone into the lazy realm like Steven Seagal.\r\n\r\nThere are some plot contrivances one has to get past but still enjoyed this entry and it is one insane of an ending. **3.75/5**", "created_at": "2019-12-24T21:27:36.166Z"}, {"movie_id": 522938, "review_id": "5ea5cfd87390c0001fa6566b", "author_rating": 7.0, "review_text": "_**Rambo goes to Mexico**_\r\n\r\nRambo (Sylvester Stallone) has been living on the family ranch in southern Arizona for the last ten years. When his niece (Yvette Monreal) goes missing across the border he has to fight a cartel of thugs to get her back. Paz Vega is on hand as a helpful journalist.\r\n\r\n“Rambo: Last Blood” (2019) is the fifth and probably last of the Rambo franchise since Stallone was 72 during filming. While the plot is simple, with elements bringing to mind “One-Eyed Jacks” (1961) and “Conan the Barbarian” (1982), the film is a worthy addition to the series, albeit not quite as good as the previous one. \r\n\r\nIt provides what fans look for in a Rambo flick: A one-man-army situation with a noble cause and plenty of brutal action. While criticized for being “racist,” it’s no more racist than the other Rambo flicks. “Last Blood” never for a second suggests that ALL Mexicans are evil any more than ALL cops, Vietnamese, Afghans and Siamese were evil in the four previous films. Speaking of which, for me, this installment places third after “First Blood” (1982) and “Rambo IV” (2008).      \r\n\r\nThe movie runs 1 hour, 29 minutes, and was shot in Santa Cruz de Tenerife, Canary Islands, Spain. There’s also an Extended Cut that runs 12 minutes longer.\r\n\r\nGRADE: B", "created_at": "2020-04-26T18:15:52.673Z"}, {"movie_id": 522938, "review_id": "5f1d320c66a7c30038084d48", "author_rating": 5.0, "review_text": "The _Rambo_ franchise underwent a massive change after the first movie, and that new direction has stuck with the series ever since they put _Rambo_ in the title. But even all the way back in First Blood, John Rambo's actions seemed to have always been fuelled by desperation. In _Last Blood_ however, Rambo's actions are calculated, and personal. It's something I'd never really considered before, but I actually don't like this direction for the character. It's not that it doesn't make sense, because it does, just personally I preferred when Rambo was surviving the bad world that was happening to him, not creating it.\r\n\r\n2008's _Rambo_ was over the top and its very existence seemed bizarre, but it also felt like John Rambo \"came full circle\" as it were, which sort of justified that existence. _Last Blood_ doesn't really feel like it re-opened or closed any circle. It kind of feels like an episode of a long-running show I haven't watched the last 10+ seasons of. Stallone seems to think he'll be getting a _Rambo 6_ where he's on a Rez, if that's the plan, why bother calling this one \"_Last Blood_\", and if it's not the case, why make this movie that starts and ends like it's supposed to slot in between other pieces of a story we haven't gotten yet?\r\n\r\nEnd of the day, _Last Blood_ was okay. A low point for the series, arguably even the lowest, but it was a franchise that has always been at least a little enjoyable, so that's not too harsh a burn.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-07-26T07:34:36.312Z"}, {"movie_id": 522938, "review_id": "5fd74c5dd8e225003f1b95c4", "author_rating": 1.0, "review_text": "This (so called) Movie is just a waste of time. Seems more like a \"Build the Wall\" advertisment. Did Trump finance this?", "created_at": "2020-12-14T11:28:29.198Z"}, {"movie_id": 522938, "review_id": "63bf6dab23be4600b2f08018", "author_rating": 10.0, "review_text": "So I'm going ahead and giving this 10 out of 10 stars, not because I think it deserves it, but because there is a 1 star review entitled \"White Supremacy is Cancer\" and that seems to be the concept of a LOT of negative reviews.\r\n\r\nHowever, I have actually seen it and I can 100% guarantee that it has NOTHING to do with the content of those reviews. None of that is mentioned or implied.\r\n\r\nHOWEVER, there are negative reviews that ultimately say that this is NOT a Rambo film... and that is fair. If you compare it to Rambo First Blood Part II, III, and Rambo the 1 star reviews make sense. It is not at all like 2-4... so if you are expecting a Rambo like the sequels you're probably not going to like it... but you are probably not going to like it for entirely fair reasons.\r\n\r\nI won't fault you for that negative review.\r\n\r\nIt's a lot more like the first film. More like Rambo First Blood... only instead of the military it's a drug cartel and instead of chasing Rambo he's... kind of... chasing them.... kind of... for revenge.\r\n\r\nLike all the other Rambo movies, it's formulaic. Once more we start off with Rambo trying to get out of the business, and this time he has gotten out and been adopted as an \"Uncle\" by a Latino family.\r\n\r\nAnd to follow the formula, like in the Godfather, he gets pulled back in. This time the daughter of said Latino family leaves to track down her family, goes to cartel occupied Mexico, and gets promptly kidnapped, sending Rambo on a blood crazed path to get her back and deliver vengeance on the cartels.\r\n\r\nUnlike the sequels, however, it's a little more of a slow burner. It takes a little more time to set up the characters, it takes a little more time to set up the plot and the relationships, and (shockingly given that in most of the Rambo films the enemy is almost faceless he's so under-developed) it actually takes a little time to set up the heavy as well.\r\n\r\nAnd in the end there is a lot of killing, a lot of elderly action, and ultimately a lot of fun... but what there is not a lot of is political messaging... because, at it's heart, it's just another action movie.\r\n\r\nWhich leads me to the third type of negative review... the reviews critical of it being an action movie... those I don't understand... It's a Rambo movie, you know exactly what it is... and action movie... so what kind of film did they think they were going to see?", "created_at": "2023-01-12T02:17:15.305Z"}, {"movie_id": 522938, "review_id": "5d9dffcf3d4d96003782c94e", "author_rating": 8.0, "review_text": "**_Guns, carnage, explosions, and xenophobia - everything you could want from a Rambo movie; hugely entertaining_**\r\n\r\n>**Col. Sam Trautman**: _Think about what you're doing. The building's perimeter is covered. No exit. There are nearly 200 men out there and a lot of M-16s. You did everything to make this private war happen. You've done enough damage. This mission is over, Rambo. Do you understand me? This mission is over. Look at them out there. Look at them. If you won't end this now, they will kill you. Is that what you want? It's over, Johnny. It's over._\r\n\r\n>**John Rambo**: _NOTHING IS O__VER. Nothing. You just don't turn it off. It wasn't my war. You asked me, I didn't ask you. And I did what I had to do to win, but somebody wouldn't let us win. And I come back to the world, and I see all those maggots at the airport, protesting me, spitting, calling me \"baby killer\", and all kinds of vile crap. Who are they to protest me, huh? Who are they, unless they been me and been there, and know what the hell they're yelling about?_\r\n\r\n>**Trautman**: _It was a bad time for everyone, Rambo. It's all in the past now._\r\n\r\n>**Rambo**: _For you. For me, civilian life is nothing. In the field, we had a code of honour. You watch my back, I watch your's. Back here, there's nothing._\r\n\r\n>**Trautman**: _You're the last of an elite group. Don't end it like this._\r\n\r\n>**Rambo**: _Back there, I could fly a gunship. I could drive a tank. I was in charge of million dollar equipment. Back here, I can't even get a job PARKING CARS. Where is everybody? Oh, God. I had a friend, was in the Air Force. I had all these guys, man. Back there, I had all these fucking guys who were my friends. Back here, there's nothing. Remember Danforth? He wore this black headband, and he took one of those magic markers. He mailed it to Las Vegas, 'cause we were always talking about Vegas, and this fucking car, this red '58 Chevy convertible, he was talking about this car; he said we were gonna cruise 'til the tires fall off. [begins sobbing] We were in this bar in Saigon and this kid comes up, this kid carrying a shoe-shine box. And he says, \"Shine, please, shine\". I said \"No.\" He kept asking, and Joey said \"Yeah.\" And, I went to get a couple beers, and the box was wired, and he opened up the box, fucking blew his body all over the place. And he's laying there, and he's fucking screaming, there's pieces of him all over me, and I'm tryin' to pull him off, you know, he's my friend and he's all over me. I got blood and everything, and I'm trying to hold him together, put him together, his fucking insides keep coming out, and nobody would help. Nobody would help, and he's saying \"I wanna go home. I wanna go home.\" He keeps calling my name. \"I wanna go home, Johnny. I wanna drive my Chevy\". I said \"With what? I can't find your fucking legs. I can't find your legs.\" I can't get it out of my head. I've dreamed it for seven years. Every day, I have this. And sometimes, I wake up, and I don't know where I am. I don't talk to anybody. Sometimes a day, a week, I can't put it out of my mind._\r\n\r\n- _First Blood_ (1982); Wri. Michael Kozoll, William Sackheim, Sylvester Stallone, (based on the 1972 novel by David Morrell); Dir. Ted Kotcheff\r\n\r\n>**Maj. Roger Murdock**: _Trautman, I still don't think you understand what this is all about._\r\n\r\n>**Trautman**: _The same as it always is. Money. In '72 we were supposed to pay the Cong four-and-a-half billion in war reparations. We reneged, they kept the POWs, and you're doing the same thing all over again._\r\n\r\n>**Murdock**: _And what the hell would you do, Trautman? Pay blackmail money to ransom our own men and finance the war effort against our allies? What if some burn-out POW shows up on the six o-clock news? What do you want to do? Start the war all over again? You wanna bomb Hà Nội? You want everybody screaming for armed invasion? Do you honestly think somebody's gonna get up on the floor of the United States Senate, and ask for billions of dollars for a couple of forgotten ghosts?_\r\n\r\n- _Rambo: First Blood Part II_ (1985); Wri. Sylvester Stallone, James Cameron (from a story by Kevin Jarre); Dir. George P. Cosmatos\r\n\r\n>**Trautman**: _You expect sympathy? You started this damn war, now you'll have to deal with it._\r\n\r\n>**Col. Alexei Zaysen**: _And we will. It is just a matter of time before we achieve a complete victory._\r\n\r\n>**Trautman**: _There won't be a victory. Every day, your war machines lose ground to a bunch of poorly-armed, poorly-equipped freedom fighters. The fact is that you underestimated your competition. If you'd studied your history, you'd know that these people have never given up to anyone. They'd rather die than be slaves to an invading army. You can't defeat a people like that. We tried; we already had our Việt Nam. Now you're going to have yours._\r\n\r\n- _Rambo III_ (1988); Wri. Sylvester Stallone, Sheldon Lettich; Dir. Peter MacDonald\r\n\r\n>**Rambo**: _Go live your life 'cause you've got a good one._\r\n\r\n>**Sarah Miller**: _It's what I'm trying to do._\r\n\r\n>**Rambo**: _No, what you're trying to do is change what is._\r\n\r\n>**Sarah**: _And what is?_\r\n\r\n>**Rambo**: _That we're like animals. It's in the blood. It's natural. Peace? That's an accident. It's what is. When you're pushed, killing's as easy as breathing. When the killing stops in one place, it starts in another, but that's okay, 'cause you're killing for your country. But it ain't your country who asks you, it's a few men up top who want it. Old men start it, young men fight it, nobody wins, everybody in the middle dies, and nobody tells the truth. God's gonna make all that go away? Don't waste your life, I did. Go home._\r\n\r\n- _Rambo_ (2008); Wri. Art Monterastelli, Sylvester Stallone; Dir. Sylvester Stallone\r\n\r\nIn the torrent of negative reviews that greeted _Rambo: Last Blood_, one that stood out was Richard Roeper's zero-star rant for _The Chicago Sun Times_, in which he said of the film, \"_this is a gratuitously violent, shamelessly exploitative, gruesomely sadistic and utterly repellent piece of trash_\". I agree with pretty much all of that sentence. And I loved it. But let me segue into asking a question. Which is the more \"responsible\" - the hard R-rated movie that makes no bones about its violent content, or the equally violent PG-13 movie that gets around the issue by removing the gore but leaving the savagery? _Last Blood_ is only moderately more violent than the movies in the _Taken_ franchise, for example, but it's a damn-sight more honest in its depiction of the impact of violence on the human body. It's like the old joke about _The A-Team_ - it didn't matter what the level of violence was, the fact that we never saw blood and never saw anyone die meant it was family entertainment. _Last Blood_ is not family entertainment. Nor is it trying to be. Nor does it want to be. It's a throwback to a time before studios saw an R as a death-knell; a threadbare story leading to an extended action scene of ever-increasing ridiculousness and viciousness.\r\n\r\nAnd it's awesome.\r\n\r\nIn an age of political correctness, when almost everyone with a public voice is afraid to say anything that might earn them a ticking off, it's easy enough for a film to stand out, but only if the filmmaker has the balls to stand there relatively alone. S. Craig Zahler's superb _Dragged Across Concrete_ (2018) was a good recent example, an unashamedly trashy piece of exploitation that wasn't afraid to air opinions that could be considered (say it quietly) right-wing. Now, make no mistake, _Last Blood_ is no _Dragged Across Concrete_; it's barely a movie at all (the script is so rudimentary, it rivals the dizzying complexities of _Rocky IV_), and it's by far the least political entry in the _Rambo_ franchise thus far. Is it xenophobic? Yes. Is it racist? To a certain extent. Is it likely to stoke irrational fears about the evils of Mexico and permeability of the southern border? Possibly. What it definitely is, however, is a film in which Rambo doesn't just kill his enemies, he kills them several times just to be sure (like the unfortunate schmuck who is decapitated via close-range shotgun blast and then shot several times in the torso for punctuation). What it definitely is, is a film in which on no less than two occasions, Rambo uses his bare hands to extract internal organs. What it definitely is, is an immensely enjoyable no-holds-barred revenge actioner that's about as interested in political correctness as it is in millennial angst. Which is to say, not even remotely.\r\n\r\nAnd it's awesome.\r\n\r\nWhen last we saw former Green Beret John J. Rambo (Sylvester Stallone), it was 2008, and he had returned to the US for the first time since 1985. Heading to his father's ranch in Bowie, Arizona, the implication was that maybe, after conflicts in Việt Nam (twice), Afghanistan (where he fought alongside the Mujahideen), and Myanmar (where he faced off against the Tatmadaw), and an extended residency in Thailand, he had finally come home in both a literal and existential sense. _Last Blood_ picks up the story 11 years later. His father has died, but Rambo remains at the ranch, breaking in horses and taking medication to keep his PTSD partially under-control. He shares his home with live-in housekeeper Maria Beltran (Adriana Barraza) and her teenage granddaughter Gabriela (Yvette Monreal), who refers to him as uncle and who he helped to raise. All is quiet until Gabriela is contacted from Mexico by her friend Gizelle (Fenessa Pineda), who tells her she has located Gabriela's father Manuel (Marco de la O), who walked out on her and her dying mother when she was still a child. Soon to be heading off to college, Gabriela is determined to look Manuel in the eye and ask why he left his family. Although advised by both Rambo and Maria not to go to Mexico, she ignores their warnings and heads south anyway. After Manuel proves as cruel as Rambo told her he was, she and Gizelle head out for a few drinks, but she is drugged and abducted by the Martinez brothers, Hugo (Sergio Peris-Mencheta) and Victor (Óscar Jaenada), who run a prostitution ring. Meanwhile, Rambo comes looking for her, but earns a beating for his troubles, only surviving because of the intervention of Carmen Delgado (Paz Vega), a local journalist investigating the Martinez cartel. And so, realising he can't fight the cartel on their territory and terms, Rambo decides to lure them back to Arizona, where he can fight them on his.\r\n\r\nIntroduced in David Morrell's superb 1972 novel, _First Blood_, the character of John Rambo was brought to the screen 10 years later, in the film of the same name, written by Michael Kozoll, William Sackheim, and Stallone, and directed by Ted Kotcheff. A Việt Nam vet who finds himself unable to integrate back into a society that now hates him, he runs afoul of Sheriff Will Teasle (Brian Dennehy) in the small town of Hope, WA, against whom he wages a guerrilla war. One of many Việt Nam-vet-comes-home-and-is-rejected-by-society films made in the years following the end of the Việt Nam War (1955-1975), the character was praised as a particularly salient embodiment of the problems of unaddressed-PTSD. The novel ended with Rambo's commanding officer, Col. Trautman (played in the film by Richard Crenna) recognising that the man who came home from Việt Nam could never be at peace in the US and shooting him dead in an act of mercy. The film was also supposed to end this way, but test audiences disliked the sense of nihilism with which they were left, and so a new ending was shot which saw Rambo arrested and imprisoned, but very much alive.\r\n\r\nOf course, Rambo hadn't been conceived as a muscle-bound action hero; Morell has always maintained the novel was a piece of social protest, and Stallone has spoken about how he thought of the film as the slightly more action-orientated, but equally serious, cousin of prestige dramas such as Hal Ashby's _Coming Home_ and Michael Cimino's _The Deer Hunter_ (both 1978). Nevertheless, it was the action elements of the film rather than the inherent tragedy of the character that audiences embraced, and for _Rambo: First Blood Part II_ (1985), written by Stallone and James Cameron, from a screen story by Kevin Jarre, and directed by George P. Cosmatos, Rambo took his first steps towards becoming a cartoon, as now the misunderstood vet who just wanted to be left alone was given a chance to return to Việt Nam to fight the war the right way, rescuing undeclared POWs from the clutches of a Soviet/Việt Nam conspiracy. With his actions in the second film earning him a pardon for his actions in the first, in _Rambo III_ (1988), written by Stallone and Sheldon Lettich, and directed by Peter MacDonald, things got even more ridiculous, as Rambo, now the embodiment of jingoistic Regan-era American militarism, was tasked with entering Afghanistan in the midst of the Soviet-Afghan War, where he would fight alongside the Mujahideen against the Soviet war machine. Finally, in _Rambo_ (2008), written by Art Monterastelli and Stallone, and directed by Stallone, Rambo must penetrate into Myanmar to rescue a group of Christian aid workers from the clutches of the Tatmadaw, an entire battalion of whom he massacres with a commandeered M2 Browning in a gloriously violent finale.\r\n\r\nUndeniably, for better or worse, the _Rambo_ films have always found a way to tap into some of the major geopolitical issues of the era in which they were made. The first film, made in the second year of Reagan's presidency, was a thoughtful and genuinely heartfelt plea for understanding, arguing that you can't create killing machines for use in a foreign war and then simply bring them home and expect them to reintegrate. Indeed, it's a film that's relatively uninterested in violence _per se_ (Rambo only indirectly kills one person, and it's an accident). The next two films also took place during Reagan's presidency, at a time when although the wounds of Việt Nam were still fresh, the idea of American exceptionalism had started to morph into a kind of over-compensatory machismo. It was for this reason that the perceptive and justified seriousness of the first film became diluted as Rambo transitioned from being an allegory for the real struggles of vets to an embodiment of juvenile wish-fulfilment (I mean, in the second film, he literally gets a second crack at winning in Việt Nam). In essence, he had transitioned from a symbol for the psychological damage of war to an undefeatable representative of American military might. The fourth film came out in the final year of George W. Bush's presidency at a time when the US (in no small part because of an illegal war) had once again risen to the position of global police force, although the fact that he's on a mission to save, of all things, Christian aid workers, is a bit on the nose even for this franchise. \r\n\r\nAll of which brings us to _Last Blood_. Written by Stallone and Matthew Cirulnick, from a story by Dan Gordon, and directed by Adrian Grunberg (_Get the Gringo_), _Last Blood_, of course, comes in the fourth year of Donald Trump's presidency, and sees Rambo facing off against the bad _hombres_ south of the border (they bring drugs, they bring crime, they're rapists, although some, he assumes, are good people). And with a border this porous (characters easily cross over with weaponry, drugs, dead bodies, and, on one occasion, a decapitated head on the passenger seat), the only person who can protect the US of A from such villains is Don J. Trumpo...sorry, John J. Rambo. It's all gloriously juvenile, gloriously transparent, and gloriously entertaining.\r\n\r\nHowever, having said that, this is far and away the least political film of the franchise. Whilst the first and second both dealt explicitly with Việt Nam, the third with the Soviet-Afghan war, and the fourth with the Myanmar Civil War, _Last Blood_ doesn't explicitly deal with a real-world conflict. It certainly alludes to real-world controversies, primarily issues related to the US-Mexican border, but it's not set in an inherently politicised _milieu_ the way the previous films have. And this ties into a crucial point – in moving out of the arena of politics, the storyline is more personal, which is important insofar as Rambo himself is presented somewhat differently this time, showing more emotion than we've seen from him since the opening few scenes of _First Blood_ (which Stallone has rightly pointed to as the last time we saw a vulnerable, very much human Rambo). This aspect of the film, in and of itself, is pretty fascinating, as it's also the only time since _First Blood_ where his PTSD has been so front-and-centre, as that element of his character was downplayed to the point of being virtually forgotten in the other three films. Here, not only is Rambo shown as still suffering the effects, he actually leans into it, using his trauma to motivate himself, essentially getting himself back into a Việt Nam mindset, which is a pretty interesting way of presenting a character who has been rendered in simpler and simpler terms as the films have gone on. In this sense, the early parts of the film work extremely well from a psychological point of view – we see Rambo in a home, we see him trying to keep his demons at bay, we see him, for arguably the first time, with something to lose.\r\n\r\nHowever, for better or worse, the film's big selling point isn't the political allegory or the character's psychology – it's the action, the \"suit-up\" moment when Rambo unleashes hell. Here, the entire third-act is one long action scene, and it's entertaining enough to temper some of the political immaturity and distasteful stereotypes that lead up to it. Luring the Martinez cartel back to Arizona, Rambo hides out in a series of tunnels under the ranch, stalking and dispatching them one by one with simple, but vicious, man-made traps, in a scene that partly recalls his forest pursuit of Teasel and his men early in _First Blood_.\r\n\r\nWell shot by director Grunberg and cinematographer Brendan Galvin (_Veronica Guerin_; _Immortals_; _Self/less_), it's kind of the inverse of the sleek action scenes found in the _John Wick_ films - it's dark, gritty, and brutal, and whereas those films often create the impression of near weightlessness, here, it's the tangible physicality that works so well, the sense of visceral devastation that results from a particular impact rather than anything balletic. Editors Carsten Kurpanek (_Kickboxer: Vengeance_) and Todd E. Miller (_The Expendables 2_; _The Purge: Election Year_; _Mechanic: Resurrection_) also do terrific work here. Large portions of the scene take place in reasonably poorly lit underground tunnels, with very little to distinguish one location from another, so the fact that the grammar of the combat is so well maintained is a credit to them – you always know roughly where you are at any given moment, and never once did I find myself losing consciousness because of a flurry of incoherent edits (another problem with the _Taken_ films).\r\n\r\nOf course, a vital aspect of any Rambo movie is that a lot of what some people love will be the exact things that others despise. In this case, it's the laughably simplistic politics, the barely disguised xenophobia, the brutal violence, and the fetishisation of weaponry. On this last point, I can't recall, off the top of my head, another film which is so blatant in its glorification of guns, whether it's the long tracking shots of Rambo's collection of rifles, or the way the film lingers on the destruction they mete out. In short, this is the NRA's wet dream – an all-American hero dispensing biblical assault rifle-based vengeance on a bunch of greasy Mexican scumbags. Charlton Heston would be proud, bigly (yeah, I know, I'm mixing my right-wing references). \r\n\r\nThe film's handling of the Mexican portion of the story is also a good example of how you either decry the stupidity or celebrate the ridiculousness. The character of Gazelle, for example, dresses like the only research the costume department did was to watch Ramón Menéndez's _Stand and Deliver_ (1988) – she literally wears pleated khakis, a chequered blue and white shirt, dark lip-liner, and a bandana tied at the front. Similarly, poor Gabriela gets abducted after one night (count 'em, ONE night) in Mexico, where, apart from Carmen, every single character we meet is either in the cartel, involved in prostitution, or, in a lot of cases, both. And as for the aforementioned porousness of the border, I'm not sure if it's appallingly lazy writing or satirical genius, but Rambo (who at this point is carrying some questionable items) gets back into the US by simply finding a quiet section and ploughing his truck through the wire mesh fence (ignoring a sign warning against illegal crossings, because Rambo spits at signage). He wouldn't have been able to do that if there'd been a wall.\r\n\r\nOn the other hand, a criticism that I would treat a little more seriously is that although this is supposed to be the last chapter in the franchise, the script doesn't have any sense of finality. Nothing happens at any point where you could say to yourself, \"that seems a fitting send-off for the character\". From the generic and mainly faceless villains to the rote dialogue to the poorly constructed narrative beats, never at any point did this feel like a culmination. In fact, the previous film felt more final than this one does, as at least that one gave the character a degree of closure. And speaking of the script, much as _Rocky IV_ was two boxing matches loosely tied together by montages (including a montage in which Rocky thinks about montages), _Last Blood_ is 40 minutes of plot loosely connected to an extended action scene via, you guessed it, a series of montages.\r\n\r\nFinally, it would be remiss of me not to mention David Morrell's opinion on the film. At one point, Morrell was actually working on a script for the film with Stallone, which he said gave Rambo a \"_soulful journey_\", and featured a \"_really emotional, powerful story_\". However, their draft was rejected in favour of an earlier idea which saw Rambo head to Mexico to rescue a young girl. Upon seeing the completed film, Morrell was far from impressed, writing on Twitter, \"_the film is a mess. Embarrassed to have my name associated with it_\", and later telling _Newsweek_,\r\n\r\n>_I felt degraded and dehumanised after I left the theatre. Instead of being soulful, this new movie lacks one. I felt I was less a human being for having seen it, and today that's an unfortunate message._\r\n\r\nMake of that what you will.\r\n\r\nIn many ways, _Last Blood_ is a hilariously bad film. But it's also a hugely entertaining film. And sure, it continues a process which has seen a character who was once a representative for the nation's wounded psyche and just how dehumanising war can be, transition into an unstoppable jingoistic war machine. And sure, the violence is off the chart. And sure, the politics are hilariously naïve at best, dangerously reductionist at worse, with Rambo coming to embody some of the current administration's most racist ideological arguments. But it's extremely well shot, Stallone gives a predictably strong performance, the action is intense, and, for me, none of the problems are so large as to render the film unenjoyable. Approach it with the right frame of mind, and you'll find much to appreciate.", "created_at": "2019-10-09T15:42:07.859Z"}, {"movie_id": 522938, "review_id": "5e0282c8c5840d001309dc43", "author_rating": 7.0, "review_text": "Action (and violence) filled sequel (and likely last) in the Rambo franchise. Not nearly as good as First Blood or Rambo (2008), but still darkly entertaining flick with another solid performance from Stallone who thankfully hasn't gone into the lazy realm like Steven Seagal.\r\n\r\nThere are some plot contrivances one has to get past but still enjoyed this entry and it is one insane of an ending. **3.75/5**", "created_at": "2019-12-24T21:27:36.166Z"}, {"movie_id": 522938, "review_id": "5ea5cfd87390c0001fa6566b", "author_rating": 7.0, "review_text": "_**Rambo goes to Mexico**_\r\n\r\nRambo (Sylvester Stallone) has been living on the family ranch in southern Arizona for the last ten years. When his niece (Yvette Monreal) goes missing across the border he has to fight a cartel of thugs to get her back. Paz Vega is on hand as a helpful journalist.\r\n\r\n“Rambo: Last Blood” (2019) is the fifth and probably last of the Rambo franchise since Stallone was 72 during filming. While the plot is simple, with elements bringing to mind “One-Eyed Jacks” (1961) and “Conan the Barbarian” (1982), the film is a worthy addition to the series, albeit not quite as good as the previous one. \r\n\r\nIt provides what fans look for in a Rambo flick: A one-man-army situation with a noble cause and plenty of brutal action. While criticized for being “racist,” it’s no more racist than the other Rambo flicks. “Last Blood” never for a second suggests that ALL Mexicans are evil any more than ALL cops, Vietnamese, Afghans and Siamese were evil in the four previous films. Speaking of which, for me, this installment places third after “First Blood” (1982) and “Rambo IV” (2008).      \r\n\r\nThe movie runs 1 hour, 29 minutes, and was shot in Santa Cruz de Tenerife, Canary Islands, Spain. There’s also an Extended Cut that runs 12 minutes longer.\r\n\r\nGRADE: B", "created_at": "2020-04-26T18:15:52.673Z"}, {"movie_id": 522938, "review_id": "5f1d320c66a7c30038084d48", "author_rating": 5.0, "review_text": "The _Rambo_ franchise underwent a massive change after the first movie, and that new direction has stuck with the series ever since they put _Rambo_ in the title. But even all the way back in First Blood, John Rambo's actions seemed to have always been fuelled by desperation. In _Last Blood_ however, Rambo's actions are calculated, and personal. It's something I'd never really considered before, but I actually don't like this direction for the character. It's not that it doesn't make sense, because it does, just personally I preferred when Rambo was surviving the bad world that was happening to him, not creating it.\r\n\r\n2008's _Rambo_ was over the top and its very existence seemed bizarre, but it also felt like John Rambo \"came full circle\" as it were, which sort of justified that existence. _Last Blood_ doesn't really feel like it re-opened or closed any circle. It kind of feels like an episode of a long-running show I haven't watched the last 10+ seasons of. Stallone seems to think he'll be getting a _Rambo 6_ where he's on a Rez, if that's the plan, why bother calling this one \"_Last Blood_\", and if it's not the case, why make this movie that starts and ends like it's supposed to slot in between other pieces of a story we haven't gotten yet?\r\n\r\nEnd of the day, _Last Blood_ was okay. A low point for the series, arguably even the lowest, but it was a franchise that has always been at least a little enjoyable, so that's not too harsh a burn.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-07-26T07:34:36.312Z"}, {"movie_id": 522938, "review_id": "5fd74c5dd8e225003f1b95c4", "author_rating": 1.0, "review_text": "This (so called) Movie is just a waste of time. Seems more like a \"Build the Wall\" advertisment. Did Trump finance this?", "created_at": "2020-12-14T11:28:29.198Z"}, {"movie_id": 522938, "review_id": "63bf6dab23be4600b2f08018", "author_rating": 10.0, "review_text": "So I'm going ahead and giving this 10 out of 10 stars, not because I think it deserves it, but because there is a 1 star review entitled \"White Supremacy is Cancer\" and that seems to be the concept of a LOT of negative reviews.\r\n\r\nHowever, I have actually seen it and I can 100% guarantee that it has NOTHING to do with the content of those reviews. None of that is mentioned or implied.\r\n\r\nHOWEVER, there are negative reviews that ultimately say that this is NOT a Rambo film... and that is fair. If you compare it to Rambo First Blood Part II, III, and Rambo the 1 star reviews make sense. It is not at all like 2-4... so if you are expecting a Rambo like the sequels you're probably not going to like it... but you are probably not going to like it for entirely fair reasons.\r\n\r\nI won't fault you for that negative review.\r\n\r\nIt's a lot more like the first film. More like Rambo First Blood... only instead of the military it's a drug cartel and instead of chasing Rambo he's... kind of... chasing them.... kind of... for revenge.\r\n\r\nLike all the other Rambo movies, it's formulaic. Once more we start off with Rambo trying to get out of the business, and this time he has gotten out and been adopted as an \"Uncle\" by a Latino family.\r\n\r\nAnd to follow the formula, like in the Godfather, he gets pulled back in. This time the daughter of said Latino family leaves to track down her family, goes to cartel occupied Mexico, and gets promptly kidnapped, sending Rambo on a blood crazed path to get her back and deliver vengeance on the cartels.\r\n\r\nUnlike the sequels, however, it's a little more of a slow burner. It takes a little more time to set up the characters, it takes a little more time to set up the plot and the relationships, and (shockingly given that in most of the Rambo films the enemy is almost faceless he's so under-developed) it actually takes a little time to set up the heavy as well.\r\n\r\nAnd in the end there is a lot of killing, a lot of elderly action, and ultimately a lot of fun... but what there is not a lot of is political messaging... because, at it's heart, it's just another action movie.\r\n\r\nWhich leads me to the third type of negative review... the reviews critical of it being an action movie... those I don't understand... It's a Rambo movie, you know exactly what it is... and action movie... so what kind of film did they think they were going to see?", "created_at": "2023-01-12T02:17:15.305Z"}, {"movie_id": 522938, "review_id": "5d9dffcf3d4d96003782c94e", "author_rating": 8.0, "review_text": "**_Guns, carnage, explosions, and xenophobia - everything you could want from a Rambo movie; hugely entertaining_**\r\n\r\n>**Col. Sam Trautman**: _Think about what you're doing. The building's perimeter is covered. No exit. There are nearly 200 men out there and a lot of M-16s. You did everything to make this private war happen. You've done enough damage. This mission is over, Rambo. Do you understand me? This mission is over. Look at them out there. Look at them. If you won't end this now, they will kill you. Is that what you want? It's over, Johnny. It's over._\r\n\r\n>**John Rambo**: _NOTHING IS O__VER. Nothing. You just don't turn it off. It wasn't my war. You asked me, I didn't ask you. And I did what I had to do to win, but somebody wouldn't let us win. And I come back to the world, and I see all those maggots at the airport, protesting me, spitting, calling me \"baby killer\", and all kinds of vile crap. Who are they to protest me, huh? Who are they, unless they been me and been there, and know what the hell they're yelling about?_\r\n\r\n>**Trautman**: _It was a bad time for everyone, Rambo. It's all in the past now._\r\n\r\n>**Rambo**: _For you. For me, civilian life is nothing. In the field, we had a code of honour. You watch my back, I watch your's. Back here, there's nothing._\r\n\r\n>**Trautman**: _You're the last of an elite group. Don't end it like this._\r\n\r\n>**Rambo**: _Back there, I could fly a gunship. I could drive a tank. I was in charge of million dollar equipment. Back here, I can't even get a job PARKING CARS. Where is everybody? Oh, God. I had a friend, was in the Air Force. I had all these guys, man. Back there, I had all these fucking guys who were my friends. Back here, there's nothing. Remember Danforth? He wore this black headband, and he took one of those magic markers. He mailed it to Las Vegas, 'cause we were always talking about Vegas, and this fucking car, this red '58 Chevy convertible, he was talking about this car; he said we were gonna cruise 'til the tires fall off. [begins sobbing] We were in this bar in Saigon and this kid comes up, this kid carrying a shoe-shine box. And he says, \"Shine, please, shine\". I said \"No.\" He kept asking, and Joey said \"Yeah.\" And, I went to get a couple beers, and the box was wired, and he opened up the box, fucking blew his body all over the place. And he's laying there, and he's fucking screaming, there's pieces of him all over me, and I'm tryin' to pull him off, you know, he's my friend and he's all over me. I got blood and everything, and I'm trying to hold him together, put him together, his fucking insides keep coming out, and nobody would help. Nobody would help, and he's saying \"I wanna go home. I wanna go home.\" He keeps calling my name. \"I wanna go home, Johnny. I wanna drive my Chevy\". I said \"With what? I can't find your fucking legs. I can't find your legs.\" I can't get it out of my head. I've dreamed it for seven years. Every day, I have this. And sometimes, I wake up, and I don't know where I am. I don't talk to anybody. Sometimes a day, a week, I can't put it out of my mind._\r\n\r\n- _First Blood_ (1982); Wri. Michael Kozoll, William Sackheim, Sylvester Stallone, (based on the 1972 novel by David Morrell); Dir. Ted Kotcheff\r\n\r\n>**Maj. Roger Murdock**: _Trautman, I still don't think you understand what this is all about._\r\n\r\n>**Trautman**: _The same as it always is. Money. In '72 we were supposed to pay the Cong four-and-a-half billion in war reparations. We reneged, they kept the POWs, and you're doing the same thing all over again._\r\n\r\n>**Murdock**: _And what the hell would you do, Trautman? Pay blackmail money to ransom our own men and finance the war effort against our allies? What if some burn-out POW shows up on the six o-clock news? What do you want to do? Start the war all over again? You wanna bomb Hà Nội? You want everybody screaming for armed invasion? Do you honestly think somebody's gonna get up on the floor of the United States Senate, and ask for billions of dollars for a couple of forgotten ghosts?_\r\n\r\n- _Rambo: First Blood Part II_ (1985); Wri. Sylvester Stallone, James Cameron (from a story by Kevin Jarre); Dir. George P. Cosmatos\r\n\r\n>**Trautman**: _You expect sympathy? You started this damn war, now you'll have to deal with it._\r\n\r\n>**Col. Alexei Zaysen**: _And we will. It is just a matter of time before we achieve a complete victory._\r\n\r\n>**Trautman**: _There won't be a victory. Every day, your war machines lose ground to a bunch of poorly-armed, poorly-equipped freedom fighters. The fact is that you underestimated your competition. If you'd studied your history, you'd know that these people have never given up to anyone. They'd rather die than be slaves to an invading army. You can't defeat a people like that. We tried; we already had our Việt Nam. Now you're going to have yours._\r\n\r\n- _Rambo III_ (1988); Wri. Sylvester Stallone, Sheldon Lettich; Dir. Peter MacDonald\r\n\r\n>**Rambo**: _Go live your life 'cause you've got a good one._\r\n\r\n>**Sarah Miller**: _It's what I'm trying to do._\r\n\r\n>**Rambo**: _No, what you're trying to do is change what is._\r\n\r\n>**Sarah**: _And what is?_\r\n\r\n>**Rambo**: _That we're like animals. It's in the blood. It's natural. Peace? That's an accident. It's what is. When you're pushed, killing's as easy as breathing. When the killing stops in one place, it starts in another, but that's okay, 'cause you're killing for your country. But it ain't your country who asks you, it's a few men up top who want it. Old men start it, young men fight it, nobody wins, everybody in the middle dies, and nobody tells the truth. God's gonna make all that go away? Don't waste your life, I did. Go home._\r\n\r\n- _Rambo_ (2008); Wri. Art Monterastelli, Sylvester Stallone; Dir. Sylvester Stallone\r\n\r\nIn the torrent of negative reviews that greeted _Rambo: Last Blood_, one that stood out was Richard Roeper's zero-star rant for _The Chicago Sun Times_, in which he said of the film, \"_this is a gratuitously violent, shamelessly exploitative, gruesomely sadistic and utterly repellent piece of trash_\". I agree with pretty much all of that sentence. And I loved it. But let me segue into asking a question. Which is the more \"responsible\" - the hard R-rated movie that makes no bones about its violent content, or the equally violent PG-13 movie that gets around the issue by removing the gore but leaving the savagery? _Last Blood_ is only moderately more violent than the movies in the _Taken_ franchise, for example, but it's a damn-sight more honest in its depiction of the impact of violence on the human body. It's like the old joke about _The A-Team_ - it didn't matter what the level of violence was, the fact that we never saw blood and never saw anyone die meant it was family entertainment. _Last Blood_ is not family entertainment. Nor is it trying to be. Nor does it want to be. It's a throwback to a time before studios saw an R as a death-knell; a threadbare story leading to an extended action scene of ever-increasing ridiculousness and viciousness.\r\n\r\nAnd it's awesome.\r\n\r\nIn an age of political correctness, when almost everyone with a public voice is afraid to say anything that might earn them a ticking off, it's easy enough for a film to stand out, but only if the filmmaker has the balls to stand there relatively alone. S. Craig Zahler's superb _Dragged Across Concrete_ (2018) was a good recent example, an unashamedly trashy piece of exploitation that wasn't afraid to air opinions that could be considered (say it quietly) right-wing. Now, make no mistake, _Last Blood_ is no _Dragged Across Concrete_; it's barely a movie at all (the script is so rudimentary, it rivals the dizzying complexities of _Rocky IV_), and it's by far the least political entry in the _Rambo_ franchise thus far. Is it xenophobic? Yes. Is it racist? To a certain extent. Is it likely to stoke irrational fears about the evils of Mexico and permeability of the southern border? Possibly. What it definitely is, however, is a film in which Rambo doesn't just kill his enemies, he kills them several times just to be sure (like the unfortunate schmuck who is decapitated via close-range shotgun blast and then shot several times in the torso for punctuation). What it definitely is, is a film in which on no less than two occasions, Rambo uses his bare hands to extract internal organs. What it definitely is, is an immensely enjoyable no-holds-barred revenge actioner that's about as interested in political correctness as it is in millennial angst. Which is to say, not even remotely.\r\n\r\nAnd it's awesome.\r\n\r\nWhen last we saw former Green Beret John J. Rambo (Sylvester Stallone), it was 2008, and he had returned to the US for the first time since 1985. Heading to his father's ranch in Bowie, Arizona, the implication was that maybe, after conflicts in Việt Nam (twice), Afghanistan (where he fought alongside the Mujahideen), and Myanmar (where he faced off against the Tatmadaw), and an extended residency in Thailand, he had finally come home in both a literal and existential sense. _Last Blood_ picks up the story 11 years later. His father has died, but Rambo remains at the ranch, breaking in horses and taking medication to keep his PTSD partially under-control. He shares his home with live-in housekeeper Maria Beltran (Adriana Barraza) and her teenage granddaughter Gabriela (Yvette Monreal), who refers to him as uncle and who he helped to raise. All is quiet until Gabriela is contacted from Mexico by her friend Gizelle (Fenessa Pineda), who tells her she has located Gabriela's father Manuel (Marco de la O), who walked out on her and her dying mother when she was still a child. Soon to be heading off to college, Gabriela is determined to look Manuel in the eye and ask why he left his family. Although advised by both Rambo and Maria not to go to Mexico, she ignores their warnings and heads south anyway. After Manuel proves as cruel as Rambo told her he was, she and Gizelle head out for a few drinks, but she is drugged and abducted by the Martinez brothers, Hugo (Sergio Peris-Mencheta) and Victor (Óscar Jaenada), who run a prostitution ring. Meanwhile, Rambo comes looking for her, but earns a beating for his troubles, only surviving because of the intervention of Carmen Delgado (Paz Vega), a local journalist investigating the Martinez cartel. And so, realising he can't fight the cartel on their territory and terms, Rambo decides to lure them back to Arizona, where he can fight them on his.\r\n\r\nIntroduced in David Morrell's superb 1972 novel, _First Blood_, the character of John Rambo was brought to the screen 10 years later, in the film of the same name, written by Michael Kozoll, William Sackheim, and Stallone, and directed by Ted Kotcheff. A Việt Nam vet who finds himself unable to integrate back into a society that now hates him, he runs afoul of Sheriff Will Teasle (Brian Dennehy) in the small town of Hope, WA, against whom he wages a guerrilla war. One of many Việt Nam-vet-comes-home-and-is-rejected-by-society films made in the years following the end of the Việt Nam War (1955-1975), the character was praised as a particularly salient embodiment of the problems of unaddressed-PTSD. The novel ended with Rambo's commanding officer, Col. Trautman (played in the film by Richard Crenna) recognising that the man who came home from Việt Nam could never be at peace in the US and shooting him dead in an act of mercy. The film was also supposed to end this way, but test audiences disliked the sense of nihilism with which they were left, and so a new ending was shot which saw Rambo arrested and imprisoned, but very much alive.\r\n\r\nOf course, Rambo hadn't been conceived as a muscle-bound action hero; Morell has always maintained the novel was a piece of social protest, and Stallone has spoken about how he thought of the film as the slightly more action-orientated, but equally serious, cousin of prestige dramas such as Hal Ashby's _Coming Home_ and Michael Cimino's _The Deer Hunter_ (both 1978). Nevertheless, it was the action elements of the film rather than the inherent tragedy of the character that audiences embraced, and for _Rambo: First Blood Part II_ (1985), written by Stallone and James Cameron, from a screen story by Kevin Jarre, and directed by George P. Cosmatos, Rambo took his first steps towards becoming a cartoon, as now the misunderstood vet who just wanted to be left alone was given a chance to return to Việt Nam to fight the war the right way, rescuing undeclared POWs from the clutches of a Soviet/Việt Nam conspiracy. With his actions in the second film earning him a pardon for his actions in the first, in _Rambo III_ (1988), written by Stallone and Sheldon Lettich, and directed by Peter MacDonald, things got even more ridiculous, as Rambo, now the embodiment of jingoistic Regan-era American militarism, was tasked with entering Afghanistan in the midst of the Soviet-Afghan War, where he would fight alongside the Mujahideen against the Soviet war machine. Finally, in _Rambo_ (2008), written by Art Monterastelli and Stallone, and directed by Stallone, Rambo must penetrate into Myanmar to rescue a group of Christian aid workers from the clutches of the Tatmadaw, an entire battalion of whom he massacres with a commandeered M2 Browning in a gloriously violent finale.\r\n\r\nUndeniably, for better or worse, the _Rambo_ films have always found a way to tap into some of the major geopolitical issues of the era in which they were made. The first film, made in the second year of Reagan's presidency, was a thoughtful and genuinely heartfelt plea for understanding, arguing that you can't create killing machines for use in a foreign war and then simply bring them home and expect them to reintegrate. Indeed, it's a film that's relatively uninterested in violence _per se_ (Rambo only indirectly kills one person, and it's an accident). The next two films also took place during Reagan's presidency, at a time when although the wounds of Việt Nam were still fresh, the idea of American exceptionalism had started to morph into a kind of over-compensatory machismo. It was for this reason that the perceptive and justified seriousness of the first film became diluted as Rambo transitioned from being an allegory for the real struggles of vets to an embodiment of juvenile wish-fulfilment (I mean, in the second film, he literally gets a second crack at winning in Việt Nam). In essence, he had transitioned from a symbol for the psychological damage of war to an undefeatable representative of American military might. The fourth film came out in the final year of George W. Bush's presidency at a time when the US (in no small part because of an illegal war) had once again risen to the position of global police force, although the fact that he's on a mission to save, of all things, Christian aid workers, is a bit on the nose even for this franchise. \r\n\r\nAll of which brings us to _Last Blood_. Written by Stallone and Matthew Cirulnick, from a story by Dan Gordon, and directed by Adrian Grunberg (_Get the Gringo_), _Last Blood_, of course, comes in the fourth year of Donald Trump's presidency, and sees Rambo facing off against the bad _hombres_ south of the border (they bring drugs, they bring crime, they're rapists, although some, he assumes, are good people). And with a border this porous (characters easily cross over with weaponry, drugs, dead bodies, and, on one occasion, a decapitated head on the passenger seat), the only person who can protect the US of A from such villains is Don J. Trumpo...sorry, John J. Rambo. It's all gloriously juvenile, gloriously transparent, and gloriously entertaining.\r\n\r\nHowever, having said that, this is far and away the least political film of the franchise. Whilst the first and second both dealt explicitly with Việt Nam, the third with the Soviet-Afghan war, and the fourth with the Myanmar Civil War, _Last Blood_ doesn't explicitly deal with a real-world conflict. It certainly alludes to real-world controversies, primarily issues related to the US-Mexican border, but it's not set in an inherently politicised _milieu_ the way the previous films have. And this ties into a crucial point – in moving out of the arena of politics, the storyline is more personal, which is important insofar as Rambo himself is presented somewhat differently this time, showing more emotion than we've seen from him since the opening few scenes of _First Blood_ (which Stallone has rightly pointed to as the last time we saw a vulnerable, very much human Rambo). This aspect of the film, in and of itself, is pretty fascinating, as it's also the only time since _First Blood_ where his PTSD has been so front-and-centre, as that element of his character was downplayed to the point of being virtually forgotten in the other three films. Here, not only is Rambo shown as still suffering the effects, he actually leans into it, using his trauma to motivate himself, essentially getting himself back into a Việt Nam mindset, which is a pretty interesting way of presenting a character who has been rendered in simpler and simpler terms as the films have gone on. In this sense, the early parts of the film work extremely well from a psychological point of view – we see Rambo in a home, we see him trying to keep his demons at bay, we see him, for arguably the first time, with something to lose.\r\n\r\nHowever, for better or worse, the film's big selling point isn't the political allegory or the character's psychology – it's the action, the \"suit-up\" moment when Rambo unleashes hell. Here, the entire third-act is one long action scene, and it's entertaining enough to temper some of the political immaturity and distasteful stereotypes that lead up to it. Luring the Martinez cartel back to Arizona, Rambo hides out in a series of tunnels under the ranch, stalking and dispatching them one by one with simple, but vicious, man-made traps, in a scene that partly recalls his forest pursuit of Teasel and his men early in _First Blood_.\r\n\r\nWell shot by director Grunberg and cinematographer Brendan Galvin (_Veronica Guerin_; _Immortals_; _Self/less_), it's kind of the inverse of the sleek action scenes found in the _John Wick_ films - it's dark, gritty, and brutal, and whereas those films often create the impression of near weightlessness, here, it's the tangible physicality that works so well, the sense of visceral devastation that results from a particular impact rather than anything balletic. Editors Carsten Kurpanek (_Kickboxer: Vengeance_) and Todd E. Miller (_The Expendables 2_; _The Purge: Election Year_; _Mechanic: Resurrection_) also do terrific work here. Large portions of the scene take place in reasonably poorly lit underground tunnels, with very little to distinguish one location from another, so the fact that the grammar of the combat is so well maintained is a credit to them – you always know roughly where you are at any given moment, and never once did I find myself losing consciousness because of a flurry of incoherent edits (another problem with the _Taken_ films).\r\n\r\nOf course, a vital aspect of any Rambo movie is that a lot of what some people love will be the exact things that others despise. In this case, it's the laughably simplistic politics, the barely disguised xenophobia, the brutal violence, and the fetishisation of weaponry. On this last point, I can't recall, off the top of my head, another film which is so blatant in its glorification of guns, whether it's the long tracking shots of Rambo's collection of rifles, or the way the film lingers on the destruction they mete out. In short, this is the NRA's wet dream – an all-American hero dispensing biblical assault rifle-based vengeance on a bunch of greasy Mexican scumbags. Charlton Heston would be proud, bigly (yeah, I know, I'm mixing my right-wing references). \r\n\r\nThe film's handling of the Mexican portion of the story is also a good example of how you either decry the stupidity or celebrate the ridiculousness. The character of Gazelle, for example, dresses like the only research the costume department did was to watch Ramón Menéndez's _Stand and Deliver_ (1988) – she literally wears pleated khakis, a chequered blue and white shirt, dark lip-liner, and a bandana tied at the front. Similarly, poor Gabriela gets abducted after one night (count 'em, ONE night) in Mexico, where, apart from Carmen, every single character we meet is either in the cartel, involved in prostitution, or, in a lot of cases, both. And as for the aforementioned porousness of the border, I'm not sure if it's appallingly lazy writing or satirical genius, but Rambo (who at this point is carrying some questionable items) gets back into the US by simply finding a quiet section and ploughing his truck through the wire mesh fence (ignoring a sign warning against illegal crossings, because Rambo spits at signage). He wouldn't have been able to do that if there'd been a wall.\r\n\r\nOn the other hand, a criticism that I would treat a little more seriously is that although this is supposed to be the last chapter in the franchise, the script doesn't have any sense of finality. Nothing happens at any point where you could say to yourself, \"that seems a fitting send-off for the character\". From the generic and mainly faceless villains to the rote dialogue to the poorly constructed narrative beats, never at any point did this feel like a culmination. In fact, the previous film felt more final than this one does, as at least that one gave the character a degree of closure. And speaking of the script, much as _Rocky IV_ was two boxing matches loosely tied together by montages (including a montage in which Rocky thinks about montages), _Last Blood_ is 40 minutes of plot loosely connected to an extended action scene via, you guessed it, a series of montages.\r\n\r\nFinally, it would be remiss of me not to mention David Morrell's opinion on the film. At one point, Morrell was actually working on a script for the film with Stallone, which he said gave Rambo a \"_soulful journey_\", and featured a \"_really emotional, powerful story_\". However, their draft was rejected in favour of an earlier idea which saw Rambo head to Mexico to rescue a young girl. Upon seeing the completed film, Morrell was far from impressed, writing on Twitter, \"_the film is a mess. Embarrassed to have my name associated with it_\", and later telling _Newsweek_,\r\n\r\n>_I felt degraded and dehumanised after I left the theatre. Instead of being soulful, this new movie lacks one. I felt I was less a human being for having seen it, and today that's an unfortunate message._\r\n\r\nMake of that what you will.\r\n\r\nIn many ways, _Last Blood_ is a hilariously bad film. But it's also a hugely entertaining film. And sure, it continues a process which has seen a character who was once a representative for the nation's wounded psyche and just how dehumanising war can be, transition into an unstoppable jingoistic war machine. And sure, the violence is off the chart. And sure, the politics are hilariously naïve at best, dangerously reductionist at worse, with Rambo coming to embody some of the current administration's most racist ideological arguments. But it's extremely well shot, Stallone gives a predictably strong performance, the action is intense, and, for me, none of the problems are so large as to render the film unenjoyable. Approach it with the right frame of mind, and you'll find much to appreciate.", "created_at": "2019-10-09T15:42:07.859Z"}, {"movie_id": 522938, "review_id": "5e0282c8c5840d001309dc43", "author_rating": 7.0, "review_text": "Action (and violence) filled sequel (and likely last) in the Rambo franchise. Not nearly as good as First Blood or Rambo (2008), but still darkly entertaining flick with another solid performance from Stallone who thankfully hasn't gone into the lazy realm like Steven Seagal.\r\n\r\nThere are some plot contrivances one has to get past but still enjoyed this entry and it is one insane of an ending. **3.75/5**", "created_at": "2019-12-24T21:27:36.166Z"}, {"movie_id": 522938, "review_id": "5ea5cfd87390c0001fa6566b", "author_rating": 7.0, "review_text": "_**Rambo goes to Mexico**_\r\n\r\nRambo (Sylvester Stallone) has been living on the family ranch in southern Arizona for the last ten years. When his niece (Yvette Monreal) goes missing across the border he has to fight a cartel of thugs to get her back. Paz Vega is on hand as a helpful journalist.\r\n\r\n“Rambo: Last Blood” (2019) is the fifth and probably last of the Rambo franchise since Stallone was 72 during filming. While the plot is simple, with elements bringing to mind “One-Eyed Jacks” (1961) and “Conan the Barbarian” (1982), the film is a worthy addition to the series, albeit not quite as good as the previous one. \r\n\r\nIt provides what fans look for in a Rambo flick: A one-man-army situation with a noble cause and plenty of brutal action. While criticized for being “racist,” it’s no more racist than the other Rambo flicks. “Last Blood” never for a second suggests that ALL Mexicans are evil any more than ALL cops, Vietnamese, Afghans and Siamese were evil in the four previous films. Speaking of which, for me, this installment places third after “First Blood” (1982) and “Rambo IV” (2008).      \r\n\r\nThe movie runs 1 hour, 29 minutes, and was shot in Santa Cruz de Tenerife, Canary Islands, Spain. There’s also an Extended Cut that runs 12 minutes longer.\r\n\r\nGRADE: B", "created_at": "2020-04-26T18:15:52.673Z"}, {"movie_id": 522938, "review_id": "5f1d320c66a7c30038084d48", "author_rating": 5.0, "review_text": "The _Rambo_ franchise underwent a massive change after the first movie, and that new direction has stuck with the series ever since they put _Rambo_ in the title. But even all the way back in First Blood, John Rambo's actions seemed to have always been fuelled by desperation. In _Last Blood_ however, Rambo's actions are calculated, and personal. It's something I'd never really considered before, but I actually don't like this direction for the character. It's not that it doesn't make sense, because it does, just personally I preferred when Rambo was surviving the bad world that was happening to him, not creating it.\r\n\r\n2008's _Rambo_ was over the top and its very existence seemed bizarre, but it also felt like John Rambo \"came full circle\" as it were, which sort of justified that existence. _Last Blood_ doesn't really feel like it re-opened or closed any circle. It kind of feels like an episode of a long-running show I haven't watched the last 10+ seasons of. Stallone seems to think he'll be getting a _Rambo 6_ where he's on a Rez, if that's the plan, why bother calling this one \"_Last Blood_\", and if it's not the case, why make this movie that starts and ends like it's supposed to slot in between other pieces of a story we haven't gotten yet?\r\n\r\nEnd of the day, _Last Blood_ was okay. A low point for the series, arguably even the lowest, but it was a franchise that has always been at least a little enjoyable, so that's not too harsh a burn.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-07-26T07:34:36.312Z"}, {"movie_id": 522938, "review_id": "5fd74c5dd8e225003f1b95c4", "author_rating": 1.0, "review_text": "This (so called) Movie is just a waste of time. Seems more like a \"Build the Wall\" advertisment. Did Trump finance this?", "created_at": "2020-12-14T11:28:29.198Z"}, {"movie_id": 522938, "review_id": "63bf6dab23be4600b2f08018", "author_rating": 10.0, "review_text": "So I'm going ahead and giving this 10 out of 10 stars, not because I think it deserves it, but because there is a 1 star review entitled \"White Supremacy is Cancer\" and that seems to be the concept of a LOT of negative reviews.\r\n\r\nHowever, I have actually seen it and I can 100% guarantee that it has NOTHING to do with the content of those reviews. None of that is mentioned or implied.\r\n\r\nHOWEVER, there are negative reviews that ultimately say that this is NOT a Rambo film... and that is fair. If you compare it to Rambo First Blood Part II, III, and Rambo the 1 star reviews make sense. It is not at all like 2-4... so if you are expecting a Rambo like the sequels you're probably not going to like it... but you are probably not going to like it for entirely fair reasons.\r\n\r\nI won't fault you for that negative review.\r\n\r\nIt's a lot more like the first film. More like Rambo First Blood... only instead of the military it's a drug cartel and instead of chasing Rambo he's... kind of... chasing them.... kind of... for revenge.\r\n\r\nLike all the other Rambo movies, it's formulaic. Once more we start off with Rambo trying to get out of the business, and this time he has gotten out and been adopted as an \"Uncle\" by a Latino family.\r\n\r\nAnd to follow the formula, like in the Godfather, he gets pulled back in. This time the daughter of said Latino family leaves to track down her family, goes to cartel occupied Mexico, and gets promptly kidnapped, sending Rambo on a blood crazed path to get her back and deliver vengeance on the cartels.\r\n\r\nUnlike the sequels, however, it's a little more of a slow burner. It takes a little more time to set up the characters, it takes a little more time to set up the plot and the relationships, and (shockingly given that in most of the Rambo films the enemy is almost faceless he's so under-developed) it actually takes a little time to set up the heavy as well.\r\n\r\nAnd in the end there is a lot of killing, a lot of elderly action, and ultimately a lot of fun... but what there is not a lot of is political messaging... because, at it's heart, it's just another action movie.\r\n\r\nWhich leads me to the third type of negative review... the reviews critical of it being an action movie... those I don't understand... It's a Rambo movie, you know exactly what it is... and action movie... so what kind of film did they think they were going to see?", "created_at": "2023-01-12T02:17:15.305Z"}]