[{"movie_id": 302699, "review_id": "57f413429251417fd40019ea", "author_rating": 6.0, "review_text": "**Twenty years is a big gap for a big change to happen in anybody's life.**\r\n\r\nThis film had the potential to be the best comedy of the year, it opened so well, but did not conclude on high. Like everything suddenly halted, the story came to an end with giving clichéd reason. Though the actors were amazing, and many jokes were awesome. The lead two combination was among the best Kevin Hart worked so far like in the recently with Ice Cube and Will Ferrell.\r\n\r\nThe opening scenes set off the tone for the rest of the film. Twenty years later, an adventure begins, but that part was so familiar, except the influence of the opening part that carried till the final scene. Even though slightly unpredictable scenes, because the diversions were neatly done against what viewers could expect. The focus was largely on the lead pair, so theirs undertaking was kind of faded away.\r\n\r\nThere's a guest role at the end, also some behind the scene clips during the end credit cheers us. I think it is a good comedy than it looks, but definitely not the best. Its not the narration, but the actors that makes worth a watch. The stunt sequences were just okay, but utilised according to what the story required. Overall, an enjoyable, time pass film.\r\n\r\n_6/10_", "created_at": "2016-10-04T20:38:26.421Z"}, {"movie_id": 302699, "review_id": "63e708581277780079f16c9d", "author_rating": 6.0, "review_text": "**Central Intelligence might not do anything special with its story, but what makes it special is the genius comedic pairing of Kevin Hart and Dwayne Johnson.**\r\n\r\nCentral Intelligence is exactly what you have come to expect of any film with Kevin Hart - a lot of fast-talking, dramatic arm-waving, strange faces, and hilarious antics. But Central Intelligence is probably the best of Hart’s catalog of buddy comedies because it marks the beginning of his entertaining friendship with Dwayne Johnson. While the movie is ridiculously goofy, the chemistry between these two reduces the film and leaves the audience wanting more of this fantastic and dorky duo. Central Intelligence also surprises with all the talent on its cast, including Aaron Paul, Jason Bateman, Melissa McCarthy, and more. It might not be a masterpiece, but Central Intelligence is a funny and entertaining film that will make you smile and make you happy that Hollywood has brought Kevin Hart and Dwayne Johnson together to bring the laughs again and again.", "created_at": "2023-02-11T03:15:36.380Z"}]