[{"movie_id": 616747, "review_id": "64c18b4afdc146011cd60d65", "author_rating": 5.0, "review_text": "LaKeith Stanfield steals every scene that he’s in while The Hatbox Ghost is one of the more menacing live-action Disney villains to be portrayed in quite some time. But _Haunted Mansion_ is a PG horror comedy trapped in a PG-13 rating. It’s only PG-13 because it revolves around the supernatural. The exaggerated comedy is annoying and anything remotely scary is ruined by relentless buffoonery.\r\n\r\nFull review: https://bit.ly/hatboxghost", "created_at": "2023-07-26T21:08:26.794Z"}, {"movie_id": 616747, "review_id": "64c32806d861af013909c1e8", "author_rating": null, "review_text": "Welcome Foolish Mortals to the latest adaptation of the popular Disney attraction as Haunted Mansion has materialized for audiences to enjoy.\r\n\r\nThis time around the film follows a single mother named Gabbie (RosarioDawson), and her son Travis (Chase W. Dillon).\r\n\r\nThe family has moved into an abandoned mansion near New Orleans as they look to start over but find that their new abode is haunted.\r\nDespite their best efforts to flee, the ghosts force them to return to the\r\nmansion and they seek help in the form of a Priest named Father Kent (Owen Wilson), and Ben Matthias (LaKeith Stanfield) who has been reduced to doing Ghost Tours following a personal tragedy that saw his lofty skills and career vanish in the aftermath.\r\n\r\nWhen the help finds themselves able to leave the mansion without an\r\notherworldly escort, they bring in a Medium named Harriet (Tiffany\r\nHaddish) and in time the mysterious Madame Leota (Jamie Lee Curtis).\r\nIt is learned that a dangerous ghost is striking fear into the other 999\r\nhaunts that inhabit the locale and should he collect his 1000th soul, he\r\nwill unleash a new level of terror on the world.\r\n\r\nThings become even more complicated with a local professor named Bruce (Danny DeVito) arrives and creates a new Wild Card to the situation.\r\n\r\nThe movie does a great job of capturing the look and tone of the\r\nattraction as one of the great joys was seeing things ranging from the\r\npictures to stretching room and other factors big and small from the\r\nattraction portrayed on the big screen.\r\n\r\nThe cast is great and works well with one another but the movie does take\r\nsome time getting ramped up and I did find it dragging in various places.\r\nThe audience laughed frequently but for me many of the jokes did not work which I attributed to the focus being on a a younger audience as I found them more amusing than funny.\r\n\r\nThe FX in the film are solid and Jared Leto’s character is so well done\r\nyou cannot recognize him as he has disappeared so deeply into the\r\ncharacter aided by some great visual work.\r\n\r\nAs a big fan of the attraction it was nice to see a much better take on\r\nthe source material than previous efforts.\r\n\r\nIn the end despite the flaws, there is enough happy nostalgia to keep fans\r\nentertained and hopefully the audience will want to visit the mansion enough that a new franchise is on the way.\r\n\r\n3 stars out of 5", "created_at": "2023-07-28T02:29:26.702Z"}, {"movie_id": 616747, "review_id": "64cca1fce04d8a3aa8b409f1", "author_rating": 6.0, "review_text": "As a longtime Disney enthusiast, I was highly skeptical (and very wary) about director Justin Simien‘s “Haunted Mansion,” the second film inspired by the classic and beloved theme park attraction. Everything about this project screamed “pointless” and “dreadful,” but I was pleasantly surprised at the inventive and fun finished product.\r\n\r\nWhen a woman (Rosario Dawson) and her bullied son (Chase Dillon) move to a haunted manor in New Orleans, they seek the help of supposed spiritual experts to help rid their historic home of supernatural inhabitants. They collect a motley crew of misfits, including a fake exorcist (Owen Wilson), a man with a penchant for photographing specters (LaKeith Stanfield), a history professor (Danny DeVito), and a medium (Tiffany Haddish). After it’s learned that once you enter the home you must always return (or a ghost will follow you home), everyone is trapped and cannot leave. After a walk on the other side during a séance, an evil spirit called the Hatbox Ghost (Jared Leto) is encountered, and he’s collecting souls. If the new friends want to live, they must work together before time runs out.\r\n\r\nThe mythology created fits in with the theme park ride, is done in a way that feels natural, and is sure to please Disney fans. Think of almost any element from the attraction and the film gives a satisfactory back story (Madame Leota’s is my favorite, not to mention the casting of Jamie Lee Curtis in the role). I can’t wait to go back to Disneyland after seeing this movie, because it will be so much fun to experience the Haunted Mansion through fresh eyes that have this new background narrative.\r\n\r\nEaster eggs are around every corner, and they’re a fun treat for eagle-eyed viewers. Most elements from the attraction are incorporated organically (like the exterior and location-specific bits from both the Florida and California versions of the ride), and the most iconic scenes are fun to see on a grand scale (the stretching room, the dining room party, Constance in the attic). As a fan, I was absolutely delighted by all of this.\r\n\r\nThe film is elevated by a talented cast (including a strong lead performance from Stanfield and a charming one from Dillon) and kooky characters that lighten the mood when it gets too dark. There’s a lot of talk about grief, and plenty of borderline scares that may teeter on the terrifying side for little kids. This is not a traditional scary movie, and the balance of light humor and emotional drama works really well.\r\n\r\nSince this is a big studio film, the overt product placement becomes distracting and laughable, and the denouement is bloated, excessive, and drawn out. The film could use a bit of editing, but I didn’t find it too long.\r\n\r\nI quite enjoyed “Haunted Mansion,” flaws and all. If you’re a fan of the Disney parks and share a passion for the ride, I’m sure you will, too. It isn’t an instant classic by any means, but it’s far better than it has any right to be and is a fun way to spend a couple of hours this summer.", "created_at": "2023-08-04T07:00:12.977Z"}, {"movie_id": 616747, "review_id": "64dcc8a2a3b5e600c5bbea37", "author_rating": 7.0, "review_text": "**Haunted Mansion (2023) isn’t trying to bring some new franchise launching edge to the Disney ride’s story. Instead, it captures all the goofy pun-filled fun of the ride by allowing its excellent cast to have a blast!**\r\n\r\nHaunted Mansion (2023) is a fun family adventure that gives each of its comedic talents their own time to shine and bring the laughs. My expectations were very low (especially after seeing the 2003 version). Still, I never should have bet against Owen Wilson’s lovable charm, but his endearing goofy antics were couched in a cast of characters that each had me laughing out loud. I struggle to choose a favorite character because they were all so ridiculously entertaining and delightful. But even amid all the wackiness, LaKeith Stanfield does excellent work delivering some genuinely moving and emotional moments. Many of the poor reviews on Haunted Mansion possibly expected something other than what it was: a fun family adventure full of clever quips, puns, and classic Disney charm. I felt a little nostalgic while enjoying the film and being impressed by its scarier moments. Haunted Mansion isn’t trying to be Pirates of the Caribbean. It’s just here to delight and make you jump a time or two. And I’m here for it!", "created_at": "2023-08-16T13:01:22.657Z"}, {"movie_id": 616747, "review_id": "64e877cdc613ce014dfbf3bc", "author_rating": 6.0, "review_text": "\"Gabbie\" (Rosario Dawson) and her young son \"Travis\" (Chase Dillon) arrive at their eponymous new home only to come face to face with a walking suit of armour that forces them to flee! Escape isn't that simple, though, and they enlist the help of priest \"Fr. Kent\" (Owen Wilson) who in turn finds \"Ben\" (LaKeith Stanfield) who has developed a camera that can photograph visitors from the spirit world! Stuck in this increasingly perilous house, they all have to work together to get to bottom of the source of the haunting before they all get their comeuppance. There are a couple of fun, over-the-top, contributions from Danny DeVito and an engagingly attitudinal Tiffany Haddish as \"Harriet\" (the medium) but otherwise this is all just a pretty straightforward rehash of the 2003 version - only I did think this was slightly better without Eddie Murphy. The visual effects are pretty standard, it's bit over-scored and though much credited, I am not sure it mattered at all that Jared Leto was the Top-hat ghoul. It's still enjoyable enough fayre for Christmas telly, but is unremarkable as a piece of not remotely scary cinema that I expect you will forget quite quickly.", "created_at": "2023-08-25T09:43:41.942Z"}]