[{"movie_id": 256962, "review_id": "563a4d97c3a3681b610233ed", "author_rating": 8.0, "review_text": "> About a little boy who believed he can change the world.\r\n\r\nI was two minded after seeing its trailer. Because I'm pretty much convinced it is a B movie. But that's not the issue, I usually put my faith on them and take my chances. So what bothered me was the film contents, because the trailed roughly reveals what kind of movie it is, from that I reckoned it should have been a big production house's product. Hence, I believed the visuals could be disastrous, but that was not the case. In fact, it was a remarkable standard, one of the reasons for the movie's success, despite there are no list-A actors in the full fledged roles.\r\n\r\nThe boy was much better in the movie than I judged his performance in the trailer. He might have appeared in a few television episodes, but this was his silver-screen debut. A wonderful display and I believe he would bag more projects for this. It was a family film, an emotional drama set during the United States entry into the World War II. Takes place in a small western coastal town called O'Hare about a 7 year old boy Pepper, nicknamed Little Boy who's willing to do anything to bring back his father alive from the war. On the effort he takes up a series of task which later stuns his town and the whole country.\r\n\r\n> \"Do you believe you can do this?\"\r\n\r\nThe Fascinating thing was, the blend between the real occurrence with the fictitious attachment. People might believe it was based on the real, but it is not. Like I said the graphics were very crucial that matched to any big budget films, unfortunately it was a small portion, but definitely a big deal. It talks about lots of interesting stuff which is inspiring, partially funny and also a children friendly film. Especially it explains quite clearly the difference between religious beliefs and magics which is obviously little kids never understood. So it could help to learn something from other than the textbooks.\r\n\r\nThe plus points were the consequences of war (any war), how the people can get affected by the war, bullying, racism and misbelief. On the other hand the minus was too much ingredient in a little movie, fortunately clicked so well. As usual, it was knocked down by the critics who never recognised the art of sentimental works. If you are not one of them or their followers, you are going to enjoy it.\r\n\r\nIf it had some big names in the main cast, especially for the father and brother characters, then it would have been roared louder and helped the international markets. As being one of the finest storied movie that highlighted our past mistakes, sadly terribly failed at the box office, but very much could get a cult status because particularly families loved this one so far. Not highly, but simply I recommend it and one of the must see from year 2015.\r\n\r\n8/10", "created_at": "2015-11-04T18:25:27.180Z"}]