[{"movie_id": 437583, "review_id": "63201774e9da6900799a1e65", "author_rating": 6.0, "review_text": "In the real world, magical thinking is a type of fallacy and a source of many superstitions, but in a film like November, it can be the difference between life and death, salvation and damnation. The characters in this Bergmanesque Estonian-German fairy tale, written and directed by Rainer Sarnet, live in a village surrounded by an honest-to-goodness Haunted Forest, although for them it would be weird if it weren’t haunted — to put it in perspective, pacts with the devil are so common that cunning villagers manage to fool the devil by using the sap of blackcurrants instead of blood to sign the contract. \r\n\r\nI find it curious that both All Movie and Wikipedia state that the movie is set in the 19th century, because it feels more like the Late Middle Ages, complete with the Plague. On the other hand, this is a world where almost anything is possible — cheating death as well as the devil; one of these clever villagers has a brilliant idea: “Take off your pants and put them on your head. The plague will think we have two butts and won't dare to touch us.\" We are tempted to poke fun at these ignorant peasants, but then the Plague, in the form of a white goat, does indeed pass them by harmlessly — at least for the time being.\r\n\r\nThe characters employ various other, for lack of a better term, 'lifehacks,' to survive the harsh winter; the most popular of these is the kratt, which in turn explains the frequency of pacts with the devil — the kratt, a magical creature in ancient Estonian mythology, is formed from hay or old household utensils, but needs to be imbued with a soul to carry out the orders of its master; the villagers summon the devil at a crossroads to make a deal: to buy a soul for their kratt in exchange for their own souls down the line. \r\n\r\nThe problem is that kratts are excessively 'gung ho', and capable of making an attempt on the lives of their owners if they do not provide them with something to do all the time; consequently, the kratt's master would ask the creature to do impossible things, such as build a ladder out of bread. The main task of the kratt in November is to hook the viewer, and in my case it more than succeeded thanks to the film’s practical special effects.\r\n\r\nHans (Jörgen Liik), who is either a genius or too dumb to live, fashions a snow kratt; there is no danger that it will attack him, but there is also no hope that it will do much for him. Hans wishes the kratt would bring him a young baroness, the daughter of the local German baron, with whom he is infatuated; sadly, the Baroness isn't a cow (kratts can't steal humans, only cattle and inanimate things), and even if she was, this kratt is particularly fragile. \r\n\r\nThe only benefit Hans can gain from the situation is that of his kratt's vast experience (\"Where did you learn to talk like that, kratt?\"; \"Everywhere. I ran through ancient cities like a river, bubbling in splendid Gardens like a fountain, I fell like rain and carried countless ships. Now I am snow, and for the first time I have the ability to speak through the mouth you gave me, Master\").\r\n\r\nGiven this general state of affairs, it’s not surprising that a villager is caught scraping gold from a Christian altar; “Why did you scrape it?”; “You know that the altar is sacred. If I pay with it at the bar, the gold will go back to my pocket.” However, in an ironic twist, the peasant woman is ridiculed: “how will it come back? Walking?\" \r\n\r\nThe notion that \"Jesus will bring it\" back because \"it's holy gold\" is an example of magical thinking just as blatant as putting your pants on your head to outwit the Plague; why, then, is one taken seriously and the other a cause for ridicule? \r\n\r\nOne reason is that the idea is from a Latvian and “Latvians have an ass for a mouth and only shit comes out”, but there is something more complex at play; Sarnet not only juxtaposes the Apollonian and Dionysian natures of Christianity and paganism, but also reverses the physical and metaphysical roles of each religion.", "created_at": "2022-09-13T05:39:00.150Z"}]