[{"movie_id": 9383, "review_id": "518b3ca819c29568a504a762", "author_rating": 6.0, "review_text": "I have been unusually lucky with my SyFy-channel movie watching lately. I had no idea what this movie was really but there was nothing else on last night and I also noticed that it was directed by Paul Verhoeven which have directed quite a few movies that I really liked so I decided to give it a try. As it turned out, this is another movie that is somewhat above the usual standard for movies given on SyFy.\r\n\r\nIt has a rating on 27% on Rotten Tomatoes which is just bullshit. But then, the so called “professional critics” used by the Rotten Tomatoes are dimwits who trash every movie that is not “intellectual” enough for their self-imagined refined tastes. I do not know why they continue to use these clowns for their official rating system instead of the real audience? On IMDb it holds a 5.6 out of 10 rating which is more realistic. I was hesitating between 7 and 6. In the end I gave it a 6 because, as I said in the title, it is a quite okay movie but not a fantastic one.\r\n\r\nThe story of the movie is a fairly standard one. Scientist experiments on himself, experiment goes wrong, scientist goes mad, hack hack, chop chop, scientist dies, happy ending for the remaining survivors. Thus the movie pretty much relies on its special effects which are indeed quite good. The various invisible effects, not to mention the scenes where Caine is partially visible due to smoke or water effects, are quite enjoyable to watch. \r\n\r\nKevin Bacon is making quite a performance as a very disagreeable fanatic scientist. He is doing a remarkably good job of it even when he is covered by a latex mask which of course is quite a feat being deprived of any facial expressions. The rest of the cast was fairly standard Hollywood fare, that is, fairly bland.\r\n\r\nOn the whole I found the movie quite enjoyable. It was perhaps a bit slow at the beginning and Cain’s show of megalomaniacal attitudes was indeed becoming a bit tiresome after a while. As I said, his roles was a very disagreeable one. Once he became invisible things started to become more interesting although it took a wee time for things to speed up even then.\r\n\r\nIt was certainly not a wasted movie evening and the movie is worth at least 6 out of 10 stars.", "created_at": "2013-05-09T06:05:28.852Z"}, {"movie_id": 9383, "review_id": "5594548ac3a36869d1003b44", "author_rating": 6.5, "review_text": "It's amazing what you can do... when you don't have to look at yourself in the mirror any more.\r\n\r\nIt was the film that convinced director Paul Verhoeven to leave Hollywood and take a break from film making. His reasoning being that any Hollywood director could have made Hollow Man, a big effects led movie that made a lot of cash at the box office. It's this that is the main problem with the picture, it lacks some of the director's bite and satirical savagery, even the souped up sex (natural or deviant) that often comes with his productions. Yet devoid of expectations of a Verhoeven masterpiece, and the crushing realisation that it basically wastes its potential and plays out as a haunted house stalk movie - it's a good enough energetic popcorner.\r\n\r\nIt quickly becomes obvious that we are entering special effects extravaganza, the opening credits are dynamite, sci-fi sexy, then the opening gambit sequence literally grabs us - and a rodent - by the throat. From here on in we are treated to grade \"A\" effects and some genius ways of exposing \"the invisible\" Sebastian Caine (Kevin Bacon) to us and the prey he soon comes to hunt. Unfortunately the whole cast performances are a much of a muchness, and playing a roll call of sci-fi stereotypes. All involved here have done much better work in their sleep, but they put the bums on theatre seats and ultimately this works as one of those movies designed to thrill and awe the senses - but sadly not the brain. 6.5/10", "created_at": "2015-07-01T20:58:50.931Z"}, {"movie_id": 9383, "review_id": "5ec38d1e28723c001f4c1dc3", "author_rating": 6.0, "review_text": "Some pretty impressive effects for the era, and a pretty cool (if not original) core concept, but what's most intriguing about _Hollow Man_ is the hero's journey, or more accurately, the absence of it. The inverse of it. I don't feel like it's fair to even say that it's a villain's journey. Assuredly, by the end of the movie, it is very clear who our villain is, but given that he starts out such a dick anyway, the intriguing thing is not so much that he necessarily changes, but the idea that his character is maybe just \"revealed\". To become the type of prick he always could have been, if only had the power to be so. The thing is, he starts this movie a pretty archetypal protagonist. His role is seen almost identically across any number of movies for decades before _Hollow Man_ was released, and one that we honestly still see today. And this archetype is almost always beloved! \"Sure he's a bit cheeky, but that's why he's such a great character\". It's very confronting to think about what this archetype is so close to being, and I think maybe that's kind of the point of this whole thing.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-05-19T07:39:10.443Z"}, {"movie_id": 9383, "review_id": "5f1710cf4284ea0035331a92", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can definitely recommend.\r\n\r\nThis has a fantastic premise of what happens when humans discover a process to \"invisible-lize\" and \"visible-lize\" organic life forms.  For a 2000 movie, this has a high production value and probably state of the art computer effects in 2000, and for most of the movie they hold up, though they do struggle at points.  I honestly do think that it's an \"invisibility\" effect, is what helps it hold up.\r\n\r\nThis is a rather tricky premise, it's presented as a scientist turning himself invisible, but it's much closer to a \"Twilight Zone\" episode with a philosophical waxing of a Dr.'s god complex.  What would a human do when it has a distinct advantage / power over others.  And while that is super interesting, it tracks a little better if you just think of him as \"snapping\", but the movie fights you on this as it very quickly devolves to \"I could do [horrible thing], who's going to stop me.\".  It parallels with the mad scientist trope of \"We can, but do we ask if we should?\".\r\n\r\nKevin Bacon nails the awful, irredeemable mad scientist, and Elisabeth Shue does a wonderful job of playing support to Bacon and a protagonist in her own right.  It is refreshingly different that the protagonist is the bad guy, or at least he's fluid, and it's almost two different perspectives blended together to make one story.\r\n\r\nI'm a big fan \"inescapable terror\" type of thriller, and this is fantastic example of it, and I think other thriller / horror fans will enjoy this where the sci-fi types might not enjoy it as much, even though that's how this one is sort of advertised.\r\n\r\nWith \"The Invisible Man\" soon available, I'm very excited to have watch this, and am looking forward to a newer version of it.", "created_at": "2020-07-21T15:59:11.077Z"}, {"movie_id": 9383, "review_id": "647112de1f748b00c12d0d05", "author_rating": 8.0, "review_text": "Loved this movie. I never seen a concept for a movie like this. I wouldn't hate being invisible at all. I can also see how it would be frustrating to not be able to become normal again too.", "created_at": "2023-05-26T20:13:18.575Z"}, {"movie_id": 9383, "review_id": "64ecc0821feac1011b2ef502", "author_rating": 6.0, "review_text": "Kevin Bacon (\"Sebastian Caine\") leads a team of scientists looking for ways to make living things invisible. When he decides to be the ultimate guinea pig, it all starts to go a bit wonky - they can make him disappear ok, but they cannot quite reverse the transaction. Needless to say, despite the best efforts of Elisabeth Shue (\"Linda\") and Josh Brolin (\"Matt\") he starts to go off the rails a bit, and with his new found abilities to go about undetected, he soon becomes quite a nasty piece of work determined to wreak retribution on his boss and his erstwhile colleagues. It's a rather daft slasher with plenty of clever skeletal effects and pace, but the dialogue and scenarios are pretty preposterous with little, if any, chemistry between any of the stars.", "created_at": "2023-08-28T15:42:58.269Z"}]