[{"movie_id": 339964, "review_id": "5971fc55c3a368712803aa03", "author_rating": 7.0, "review_text": "A spectacular spectacle of a movie that faithfully adapts a French 1970s sci-fi comic book. If you think you might see it some day, you owe it to yourself to catch it in 3D on a big screen now. In a world of paint-by-numbers blockbusters, this is an invigorating slap to the eyeballs.\r\n\r\nThe flick would benefit from more focus and deliberation; often, story beats are glancing blows instead  of precision hits. The biggest flaws, however, are found in the dialogue, which is at best serviceable and at times painful, probably owing to its transition through times, languages, and mediums.\r\n\r\nValerian isn't perfect, it's a bit clunky, but the sheer unusualness, whimsy, and wonder overpowers the movie's faults, making it well worth watching.", "created_at": "2017-07-21T13:06:29.750Z"}, {"movie_id": 339964, "review_id": "5972e6f8c3a3687c7d0225ed", "author_rating": 6.0, "review_text": "It's a fun movie, but it's not what I would call a sci fi classic. It's all spectacle, with eye popping visuals. It creates some really interesting side characters and alien worlds. The drawback is the two leads. They seem rather bland and one dimensional. Their romantic bantering is quite boring. The supporting characters are more colorful and interesting. If you are a fan of Luc Besson's The Fifth Element, you will probably enjoy this. Just don't expect anything too deep from this movie.", "created_at": "2017-07-22T05:47:36.465Z"}, {"movie_id": 339964, "review_id": "5a1cc2b1925141032405cc04", "author_rating": 5.0, "review_text": "Well, the scenes start comin' and they don't stop comin'. Aaaand that's basically the whole movie.\r\n\r\nNo, honestly by the end of it I was actually pretty on board. It took me a lot to get to that point though. The ham-fisted romance subplot they kept awkwardly grinding the movie to a standstill for was chief amongst the swill I felt I had to wade through to get to that point of enjoyment. The primary alien race being the most poorly animated was another. But somewhere between the Rhianna actually being bearable in this, and the Ethan Hawke character I want to see 500 more times, I did actually somewhat enjoy _Valerian_... Somewhat.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-11-28T01:58:09.180Z"}, {"movie_id": 339964, "review_id": "5a3824f4c3a36814ab06fc79", "author_rating": 10.0, "review_text": "I guess I am going to disagree both with the critics, wich of course is not at all unusual, as well as with a lot of the actual viewers of this movie by saying that I really liked this movie.\n\nI guess that I can to some extent understand that some viewers are disappointed. That would be the viewers that have read the comics that the movie is based on. Unfortunately someone in the production team decided to take bits and pieces from several comic books and mash them together as well as change some key elements. It is really annoying when that is done. It is usually an indication that somewhere some dumbass who did not understand, and certainly did not respect, the source material had way too much influence on the production. It is really a shame since the comic book from wich the core of the of the story seems to be taken is certainly more than good enough to stand on its own.\n\nWell luckily the mashup that they produced is actually bloody good. Something wich in my experience is quite rare. The Valerian comics lends themselves very well as a base for some spectacular sci-fi  with plenty of weird creatures and spectacular scenery. Add Luc Besson to the mix and you have to spell spectacular in all caps.\n\nThis is definitely a Luc Besson movie. Plenty of action, spectacular (yes I repeat myself but this movie deserves it) scenery, a fair amount of weirdness. In short a lot of stuff this particular viewer likes.\n\nThe mashed up story is not too bad. It is predictable as hell of course, even though it is not following the comics, but it is making a decent job of tying together all the action and FX and the action and FX is really the main reason to watch this movie after all.\nI have to say that I think most of the characters were pretty okay. It seems that the performance of the two main characters where generally not so well received by a lot of people. I guess I can somewhat understand that but I still cannot refrain from saying: Read the fucking comics! Okay it is a French comic and there are probably few people outside of France (or at least outside of Europe) that have read them. Me being one of the few of course. Anyway, Valerian and Laureline are supposed to be somewhat weird, silly and a little bit childish. Personally I think they did a fair job of interpreting the comic book characters the way they should be. We probably have Luc Besson to thank for not getting a some Hollywood, thirteen on a dozen, characters.\n\nI do miss some bits of the real comics though. The transmutation animal played a much more visible role in the comic and so did the three information peddlers wich gave a much more professional impression in the comic book by the way. I also think it was a shame that they changed the story of the Muh so much. Their role in the comic book was much more impressive to me.\n\nStill, most of the bits and pieces that is taken from the different comic books and mashed together are quite faithfully reproduced, at least visually and the results turned out really really good as far as I am concerned.\n\nTo wrap it up, to me, this movie was a fun, spectacular, action filled sci-fi extravaganza. A typical Luc Besson movie and I mean that in a good way.", "created_at": "2017-12-18T20:28:36.807Z"}, {"movie_id": 339964, "review_id": "5a40bc00925141740300d87e", "author_rating": 10.0, "review_text": "I like this Movie very much. It reminds a bit about Avatar & John Carter. I can not Understand why it did Not make it to the Australian Cinemas. For this type of High Budget it would be worth watching in 3D Cinemas.\r\nI gave it 10/10 **********", "created_at": "2017-12-25T08:51:12.798Z"}, {"movie_id": 339964, "review_id": "5bf9710392514104d80146d7", "author_rating": 6.0, "review_text": "A disorrienting but somewhat delightful run through all manner of sci-fi imaginations. The acting was not good, and the storyline was sometimes incoherent, yet I have this strange urge to rewatch this thing. It's harmless, fascinating fun, in ways like the original starwars experience (though much more visually spectacular, and much less narratively coherent).", "created_at": "2018-11-24T15:40:51.783Z"}]