[{"movie_id": 295699, "review_id": "57d66c77c3a3684f37006632", "author_rating": 6.0, "review_text": "A bit thick on the testosterone for my tastes, but still an undeniably well crafted movie.\r\n\r\nSure the characters and their tribulations might be a little bit surface-y, but it's still a tight script well shot and well acted that 100% captures the spirit of the era it is set in.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2016-09-12T08:51:03.686Z"}, {"movie_id": 295699, "review_id": "5835db5c9251416bc601a6c2", "author_rating": 7.0, "review_text": "**On the verge to set a foot into the college, theirs wild side unleashed!**\r\n\r\nThis is like a lighter and smarter version of 'Animal House'. The story takes place in the mid 1980 and three days prior to the first day of the college. This film follows a freshman named Jake, who is a baseball pitcher, with his first encounter with his new teammates, as well as housemates. And then a beautiful girl who he befriends. So it's all about the girls, party, video games, dare games and what else, these young guys make their footprint before the college opens. A very satisfying film, all the comedies are within the limits. I mean, usually American teen/student comedies are overwhelmed by adult jokes and mostly unrealistic. But this one seems real, yet cinematically very appealing to stick with it still the final scene.\r\n\r\nAll the actors were so good. Looks like it is the first film for most of them or I'm watching theirs. Many of them are going to be a big star in the future. Another excellent film by Richard Linklater and an awesome screenplay as well by him. According to him, it is a spiritual sequel to both his previous films 'Dazed and Confused' and 'Boyhood'. I've seen one, I'm going to check it out the other one very soon. Because I'm kind of started to like this filmmaker and his signature.\r\n\r\nI was very impressed by the way the scenes and characters developed. Like everything was simple and familiar, yet very fun to watch. You know, between the seniors and freshmen, it's not like the film promotes bullying, but an understandable compromise which brings smile among us. The 80s setting was so good, almost flawless. The opening scene freaked me out, and then the rest of the film was completely different. Without the big stars, this film was a box office disaster, but surely it will find its place in the coming years. So I suggest you to check it out this rare comedy.\r\n\r\n_7.5/10_", "created_at": "2016-11-23T18:09:32.099Z"}]