[{"movie_id": 664469, "review_id": "633c7e6e42f19f00845aa9ef", "author_rating": null, "review_text": "With a star-laden cast and acclaimed Director David O. Russell at the helm, the new film “Amsterdam” arrives and touts a story mostly based on real events.\r\n\r\nFollowing injuries they sustained serving in WWI, Dr. Burt Berendsen (Christian Bale) and Harold Woodman (John David Washington) return to New York to find a world where Veterans are not as welcome as they thought and racial division remains for Harold despite fighting for his country.\r\n\r\nBurt having lost an eye in the war finds that his uptown In-Laws and wife shipped him to the war to get him out of the way as his mixed Catholic and Jewish heritage is not ideal for their version of society nor is his insistence on helping Vets at his practice over the cream of society.\r\n\r\nWhen a wealthy socialite Liz Meekins (Taylor Swift) hires Harold to investigate what she believes is the murder of her prominent father, Burt is asked for his medical verification. When an unexpected event arises, Burt and Harold find themselves the leading suspects and must seek to find a way to clear their names from an ever-deepening mystery, one that brings them back into the circle of a former associate who treated them during the war named Valerie (Margot Robbie). The fact that Harold and Valerie had a relationship in Amsterdam following the war and that Burt was the adored friend of both further complicates the matter.\r\n\r\nWith complications mounting, the three must find a way to solve the mystery and save the day before the end of either dead or being charged for crimes they are innocent of with an ever-growing cast of characters and suspects for them to contend with.\r\n\r\nThe visuals of the film are solid as they capture the look and sounds of New York in the 1930s and the cast and costumes also lead to a fantastic level of immersion. Bale is so good as his character as it is hard to believe it is him as he transforms himself completely into a new being with a distinctive look, sound, and mannerisms which underscores how he is one of the most gifted and versatile actors ever.\r\n\r\nThe entire cast is very good from the leads to the supporting players but what hampers the film from truly achieving is that it is very slow and at times self-indulgent in the pacing and story.\r\n\r\nThere is an interesting premise, great cast, great performances, and solid visuals, but the film drags on without any regard to pacing, dramatic tension, or real surprises which in the end makes watching it a long task without the payoff one would expect, especially for the time the audiences has invested.\r\n\r\nIn the end, the film delivers entertainment and great performances but lacks the pacing and payoff to make the trip fully worthwhile.\r\n\r\n3.5 stars out of 5.", "created_at": "2022-10-04T18:41:50.765Z"}, {"movie_id": 664469, "review_id": "633e59071b7c590091978192", "author_rating": 6.0, "review_text": "**Amsterdam's uneven pacing and erratic story mishandled its amazing potential and left me wondering when it would finally end.**\r\n\r\nAmsterdam comes roaring out of the gate with a fast-paced, quirky, charming, and unique mystery of the likes of Sherlock Holmes or Knives Out. The list of celebrities and actors continues to grow as almost every face in this movie is another a-lister making an entertaining appearance. I was so excited to see what happened next and was surprised when the story suddenly screeched to a halt for a very long slow flashback that didn't offer much to the plot. I hoped the exciting pace would return when the story returned to its original narrative, but the risk and urgency had been replaced by a scattered collection of arbitrary dialogue and scenes that lingered much longer than needed. The pacing lagged almost an hour before ramping back up in the final act. Amsterdam had so much potential but floundered in its attempts to be whimsical and unique. The film's best part was Michael Shannon and Mike Myers' quirky bird-loving spies. Every time they were on the screen, I couldn't help but laugh. Christian Bale logged another amazing performance, as expected. But even with entertaining characters, great performances, and an exciting opening and conclusion, Amsterdam fumbled all its fantastic elements and ended up making my eyes heavy and my heart yearn to go to bed early.", "created_at": "2022-10-06T04:26:47.458Z"}, {"movie_id": 664469, "review_id": "6349a562501cf2007a1e9756", "author_rating": 7.0, "review_text": "_Amsterdam_ does nothing to reinvent the wheel but does everything well enough that I had a pleasant time in the theater. The performances all around were excellent. Christian Bale was brilliant in this film, every new role Bale finds himself in he knocks out of the park, and I continually ask myself what can't he do? Margot Robbie was really great too. In many of her roles, her Harley Quinn mannerisms creep in and while I find that fun it was really refreshing to see her get away from that in Amsterdam. John David Washington was fine in his role, I never really find him to have great performances, but always does enough to get the job done, that can be said again with his performance here. The supporting roles were all fine too Raimi Malek and Anna Taylor-Joy did well and had funny chemistry together. Mike Myers and Robert De Niro did fine as well. While the story was not overly original, I had a blast following it to its finality. There are many fun twists and turns along the way and found a way to keep me gripped and entertained throughout it's near two- and half-hour runtime. While many critics are giving these harsh reviews, I think it is a good film that is fun watch despite its flaws.\r\n\r\n**Score:** _68%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T18:07:30.459Z"}, {"movie_id": 664469, "review_id": "63512a81076ce8007f005c18", "author_rating": 6.0, "review_text": "Even if it is based on true events, it's all just a bit to slapstick and fa-fetched for me. The story centres around \"Berendsen\" (Christian Bale) who is asked by his pal \"Woodman\" (John David Washington) to help out the widowed \"Mrs. Meekins\" (Taylor Swift) whose husband - a former American general - has mysteriously died. A slightly dodgy autopsy follows and pretty soon, someone has gone under the wheels of a car and our two gents are being sought by the police and by a clandestine organisation. Can they stay free and can we discover what is truly going on? Well David O. Russell decides to tell the story by chopping and changing the timelines, and so we retrace our steps to a WWI hospital where both men find themselves in the care of the slightly enigmatic nurse \"Valerie\" (Margot Robbie) who collects the shrapnel she takes from their wounded bodies and makes works of art from it. The three form an immutable bond before time and circumstances drive them apart, only for them to reunite unexpectedly as their current-day dilemma reaches it's denouement. The film looks great, certainly. The attention to detail, the costumes and the score all work well. It's the narrative, though, that really struggled for me. The story is just too insubstantial to sustain the 2¼ hour running time and as ever, I found Robbie a remarkably sterile actress to watch. Nobody could ever cause Bale of not trying, but there is a distinct lack of on-screen chemistry across the board here. None of that is helped by Rami Malek's rather underwhelming contribution as \"Tom\" - her wealthy if eccentric and clearly manipulating brother. Oddly enough, I found myself thinking this had something of the Agatha Christie to it - and maybe it would have worked better with a much tighter cast on a stage where the humour and quirkiness of the characterisations could have been better exploited? As it is, though, this sort of meanders back and forth with little impetus and I have to say I was a bit bored half way through.", "created_at": "2022-10-20T11:01:21.308Z"}]