[{"movie_id": 23437, "review_id": "58bc759dc3a368666b03b7f5", "author_rating": 3.0, "review_text": "This is a pretty movie. Its apparent from the start, that this remake of the 1984 classic, has a pretty good sized budget to work with. In fact the budget for this incarnation was $35 Million according to Wikipedia. The budget for the Wes Craven original, $1.8 Million. You don't always get a better movie if your budget is huge, look at Avatar. You just get a really pretty movie that looks polished and has flawless special effects. Again, see Avatar. That movie was nothing but flash. The story is unoriginal and weak... and don't try coming at me with this whole \"Shut up man! Avatar proved itself!\" shut up! The larger budget in this case makes the movie look too polished to be takes seriously. Why the hell are we caring about watching clones of the Twilight teens being chased by Freddy Kruger? Were not. This movie didn't need a budget of $35 Million. It feels wasted. Some of the appeal of the original came from watching the director be a director and figure scenes out. This movie didn't do that. It felt trite and forced.\r\n\r\nFreddy Kruger is less of a movie villain in the horror industry and more of an icon. Everyone I knew growing up all had Freddy Kruger nightmares when they were a kid. Perhaps this new version of Freddy will serve to scare the shit out of kids these days. I would hope so. Maybe when they remake this movie again in twenty years they will bitch about it then as well. Who knows.", "created_at": "2017-03-05T20:31:25.270Z"}, {"movie_id": 23437, "review_id": "5c04315092514116540b902f", "author_rating": 6.0, "review_text": "***A more realistic and morose version of the original film & franchise***\r\n\r\nThe specter of a dead pedophile fatally haunts the dreams of the children of his self-appointed executioners who burned him to death years earlier.\r\n\r\nReleased in 2010, this is a reboot of the original 1984 movie, freely throwing in elements from other flicks in the franchise. I think Jackie Earle Haley works well as creepy Freddy Krueger and I like the more realistic tone, which some say makes movie bland and boring. Rooney Mara (Nancy) and Kyle Gallner (Quentin) are decent as the main protagonists and I think the bedroom scene is superior to the same attack scene in the original; it’s more shocking. The prison scene’s great too.\r\n\r\nUnfortunately, the concept of Freddy is a bit of a mess. For instance, his bladed-glove is never explained. And what was the point of the boiler room since he was just a gardener at a small preschool? The filmmakers just threw in these elements because it's Freddy, figuring people knew the character. But how do these components fit into THIS movie? And what about viewers who never saw the original flicks?\r\n\r\nThe film runs 1 hours, 35 minutes and was shot in northern Illinois and nearby Gary, Indiana, with reshoots done in Los Angeles.\r\n\r\nGRADE: B-/C+", "created_at": "2018-12-02T19:24:00.484Z"}, {"movie_id": 23437, "review_id": "643e01d5f2883804a1aa75f2", "author_rating": 7.0, "review_text": "I really liked this new nightmare. I wish there was more action in it but still pretty good. I hope this is the start of a new Freddy movie series.", "created_at": "2023-04-18T02:35:01.692Z"}]