[{"movie_id": 333386, "review_id": "57f4114bc3a3683b67001752", "author_rating": 4.0, "review_text": "**When revenge's not an agenda, but an opportunity knocks!**\r\n\r\nLately I have been watching lots of blacklisted screenplay films. Some of them were really good, but most of them were not. This is one of those, and I'm not convinced. The story wise, it was decent, until the secret was revealed. After that part, it's become completely uninterested. Because that twist was not par with any decent western film. In fact, it was same as what we had seen in those that sets in the modern day themes, but here it was in the second half of the 1800s.\r\n\r\nSo the story was the bad thing for this, but the actors were good. I liked the Liam Hemsworth. Woody Harrelson was not bad either, but his negative kind of role pushes us away from liking him and so the Alice Braga. It opened well, but did not develop and end well. If you are looking for a good western with the story, this is not for you. You should not try this just for the performances, because I don't think it is worth that much. Definitely, I won't recommend it on that ground, but there's always people for all kinds of films, so I won't surprise if you say it is a better film than what I said.\r\n\r\n_4/10_", "created_at": "2016-10-04T20:30:03.105Z"}, {"movie_id": 333386, "review_id": "61b3aba90372640041230e19", "author_rating": 3.0, "review_text": "_**“Are you an assassin?” “I’m a Texas Ranger.” “You’re neither.”**_\r\n\r\nIn 1888, a government agent (Liam Hemsworth) is sent to investigate a town in east Texas and its mystic leader (Woody Harrelson) as to why people from south of the border wind up missing there. Alice Braga (Marisol) and Felicity Price (Naomi) appear on the female front, both striking in different ways.\r\n\r\n“The Duel” (2016) is a well-made atmospheric Western with Hemsworth stalwart as the protagonist and Harrelson superb in the Kurtz-like role. As with “The Long Riders” (1980), it shows that a quality Western can be made in the East. “Long Riders” was shot in Georgia while this one was filmed in Mississippi, about 220 miles east of the Texas border. It’s reminiscent of “The Proposition” (2005) with the story being transferred from northeastern Australia to southeastern United States.    \r\n\r\nUnlike “Apocalypse Now” there’s zero build-up of suspense as the ‘Kurtz’ character is fully revealed right out of the gate, not to mention the proceedings just aren’t that compelling. They’re rather tedious actually.\r\n\r\nWorse, you get the LIEberal narrative shoved down your throat that people of color are “oppressed” in America by racist white Christians and only the government can save them. Yeah, that’s why immigrants of all ethnicities from all over the world have been constantly pouring into the USA by the millions since its founding, legally and illegally. The scriptwriter needs to open up an honest history book.    \r\n\r\nThe movie runs 1 hour, 50 minutes, and was shot in Greenwood, Mississippi, \r\n\r\nGRADE: C-/D+", "created_at": "2021-12-10T19:34:01.440Z"}, {"movie_id": 333386, "review_id": "63182fb840d0fe007b270a8f", "author_rating": 1.0, "review_text": "The Duel is the kind of movie that brings a knife to a gunfight. This is a western, mind you; we’re expecting a showdown at high noon your in standard frontier town with a wide Main Street, a saloon, and a room over the saloon occupied by a sexy hooker. Instead, we get a \"Helena duel\" (two, actually), wherein \"You shall pour out each other's blood and we will cover it with dust. Whomever bleeds the dirt red the most today, his deeds shall not be forgotten.\" Yeah, I don’t get it, either.\r\n\r\nAs far as I can discern, this film is an allegorical indictment of the Minuteman Civil Defense Corps; never mind that that group was dissolved six years before The Duel’s release (though the Minuteman Project, a comparatively less Ku Klux Klany organization, remains active to this day).\r\n\r\nThe problem is that the filmmakers can’t make up their minds on how they want to go about making their point. On the one hand we have the xenophobic, tyrannical, snake-handling preacher/mayor of the town of Mount Hermon — a border town; if nothing else, they got that part right —, Abraham Brant (Woody Harrelson), and on the other, a Hunting the Most Dangerous Game-type plot. \r\n\r\nEither of those two premises provides enough separation between the allegory and its intended target for the conceit to work; I would have stuck with the former, if only because the latter had been done to death even in 2016 — also, they had, on paper, the perfect actor for the power-mad evil preacher; unfortunately, Harrelson unusually phones his performance in. This role requires a Large Ham, like Guy Pearce in Brimstone, but Harrelson’s dial never even comes close to 11. \r\n\r\nTo unnecessarily complicate matters further, there’s David Kingston (Liam Hemsworth), an undercover Texas Ranger sent to investigate the Mexican corpses turning up in a strainer downriver from Mount Hermon. \r\n\r\nThe notion of an undercover Texas Ranger is already pretty stupid, but the filmmakers manage to make it even dumber. Kingston and his wife Marisol (Alice Braga) pose as a traveling couple just passing through.\r\n\r\nSo far so good, sort of. The wheels start to come off when, out of the clear blue sky, Brant offers Kingston the vacant sheriff job. Kingston accepts the gig because \"it's the ideal cover until I can figure out what's going on here.\"   \r\n\r\nIn-universe, it is ideal — too ideal, perhaps; never for a moment does Kingston find it the least bit suspicious that Brant would give the second most important position in town to the first random stranger that literally rides into Mount Hermon, regardless of whether or not he’s qualified for the job (as a Texas Ranger, Kingston is certainly qualified, but Brant doesn’t know that... or does he?).\r\n\r\nNow, if it’s the ideal cover, why not make that the actual cover, instead of the cover to the cover? First of all, who ever heard of a cop going undercover as a cop? And second, why didn’t the filmmakers simply have Kingston pose as the new sheriff? Why do in three steps what you can do in just one?\r\n\r\nPS. I’d be remiss if I didn’t mention a Wikipedia article (albeit one that looks more unreliable than usual) according to which there was such a thing as a Helena duel; moreover, \"Helena was once known as the self-proclaimed \"toughest town on earth\" in the mid-19th century.\" Leave it to the makers of The Duel to set their movie in the next town over; this is like making a film about the eruption of Mount Vesuvius in AD 79 called The Last Days of the City Adjacent to Pompeii.", "created_at": "2022-09-07T05:44:24.237Z"}]