[{"movie_id": 77016, "review_id": "5207b103760ee362fc233909", "author_rating": null, "review_text": "Officers Taylor (Jake Gyllenhaal) and Zavala (Michael Peña) are LA beat cops, partnered up a long time. We watch them in action via a number of set pieces, and see that they're cynical enough to interpret the rules as necessary but still by a long, long stretch good and decent cops that will risk their lives in carrying out their duties at a moment's notice. Zavala is already blissfully happily married with a baby on the way, Taylor has just met a sweet Irish gal and over the course of the film we see their relationship blossom and grow. These two men are like the closest of brothers. It's all good to see. One day, their dedication to the job causes them to stumble in over their pay grade into a much larger drug cartel and human trafficking operation than regular beat cops would usually encounter. Homeland Security agents appear, having apparently already been monitoring the situation, and warn our boys that they've bloodied the wrong noses, and they'd better lay low.\r\n\r\nI HATE a dumb actioner, and this ain't that. Well, it DOES contain all of the standard tropes and cliches (buddy cops, stumbling in over their heads into some drug cartel hoo-haa; the bad guys all being relentlessly bad 24/7, permanently scowling, growling and barking at one another, etc.), but done ever-so-well; reminiscent to me of how [REC] didn't contain anything new or fresh whatsoever, but did all of what it did very well indeed and it came across as fresh as a result.\r\n\r\nIt's shot mostly cinéma vérité-style, utilising a plotline in which officer Taylor is shooting a documentary piece for a student course he's taking. However, it switches between between first and third-person narrative a la Modern Family, but when it switches to third-person it retains a very documentary-like feel, so it all feels quite seamless.\r\n\r\nIt wilts a little just past the halfway mark but picks up enormously for the final third. Also, when it's violent (which isn't often), it's unexpectedly VERY violent.\r\n\r\nI'd give it an 8/10 and recommend that it's worth at least a look. And I'm not a fan of L.A. guns/bloods/crips/gangs/urban/drugs/cops films.", "created_at": "2013-08-11T15:42:59.260Z"}, {"movie_id": 77016, "review_id": "5d620bfb54f6eb34db9b45f0", "author_rating": 6.0, "review_text": "A good duo at the forefront of this thing, but I don't especially care for the half-assed documentary schematic or, you know... cops.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a _", "created_at": "2019-08-25T04:18:03.723Z"}]