[{"movie_id": 27586, "review_id": "58ac53e9c3a36849f6012005", "author_rating": 6.0, "review_text": "Back in the 70's, The Runaways was one of the first all-girl rock bands, initiated by then 16-year-old Joan Jett, who later went on to gain world fame with her band The Blackhearts. Now, I might be somewhat biased on this particular subject, because I am a huge fan of 70's (punk)rock, and especially female rock artists, but I am also a very critical film reviewer. The Runaways therefore, leaves me feeling in limbo.\r\n\r\nI love musical biopics as much as I love the music itself, and since The Runaways falls exactly into my favourite genre of music, I thought this film would be nothing other than a win-win flick for me. However, I felt rather quickly discouraged from the build-up on. When you are telling a true-to-life story, I consider it an important issue to let the audience know who we're dealing with, what's going on and perhaps most importantly, why. These are real people and I want to know why they are who they are, and what motivated them to walk their chosen path in life. The film starts off with alternating scenes of Joan Jett and her soon to be band mate Cherie Currie. Doing stuff that, well... isn't that interesting. It doesn't tell us much about these girls except that they like punk rock and David Bowie. Honestly, having only seen the film last night, it's all I can remember about the first 15 minutes or so. And so the film continues.\r\n\r\nThey form a band, are taken under the wing of weirdo record producer/manager Kim Fowley, become famous and at some point, break up. The way director Floria Sigismondi tells the story, you'd think it was actually that easy. And this is exactly where the problem lies: bad direction. Possibly even worse editing and screenplay. We are given almost zero back-story of the lives of these young girls, and strangely, literally nothing at all about the personal life of Joan Jett. What makes it even stranger is the fact that the real Joan Jett was actually executive producer of this film, which completely puzzles me considering her part was so badly written. Her character comes across as not much more than a bystander in her own story.\r\n\r\nAt least we're offered snippets of information about Cherie Currie. We know that she comes from an instable family and that her sister (who is in fact her twin – something I had to learn from Wikipedia since it's never told in the film...) is the only one she is at least somewhat close to. Again though, strangely, what is never told here is that this girl was raped when she was 14 – an incident which strongly determined the person she would become later on. Very weird to leave out of a biopic.\r\n\r\nIt is my understanding that the rest of the band didn't give permission for their life story to be used in the film, and it shows. On the one hand, it's a shame because the back-story of the band is already so badly underexposed. On the other, I can't blame them, because this film would have done them no justice whatsoever.\r\n\r\nThe story of The Runaways is told as though it all happened overnight: formation, fame, break-up; in what feels like no more than a short year maybe. When in fact they released four albums, three of which with Cherie. Truly awful screenplay.\r\n\r\nThe actors though, are not at all to blame. Kristen Stewart embodies Joan Jett perfectly, she's got the looks, the voice (she sings all her parts herself) and the swagger. Dakota Fanning as Cherie does a very good job also. Although she may not look or sound that much like the real Cherie Currie, her acting more than makes up for it. But then again, anyone who's seen Dakota before, whether as a child actor or teenager, already knows she's a very convincing young actress. The rest of the band, much like their characters, are barely there to be noticed...\r\n\r\nThe part of Kim Fowley is played by Michael Shannon, and he approaches it with a \"love it or hate it\" attitude. Personally, I think he was an absolute scene-stealer (which is not necessarily a good thing, because obviously this film is not about him – though it is the direction that is to blame, not the actor), acting completely over the top, crude, and horribly inappropriate. Though I can see why some people absolutely hated his character. Simple: there is nothing likable about him. He's an a**hole, and a big one too. As an acting part however, it was obvious that Michael Shannon had a ball playing this guy, and I think that's what makes his role very enjoyable to watch.\r\n\r\nThe actors really do make up for a lot in The Runaways. All parts are equally well-played and very enjoyable. But when the technical aspects of a film are this poor, not even the best actors in the world can make it a success. Zero story, zero character development, shoddy editing and, worst of all, not enough music! Probably the stupidest thing about the whole film – you'd think that, in a film about The Runaways, there'd be more than two or three original Runaways songs! Yet we have to listen to \"Cherry Bomb\" over and over again, and we get only titbits of their other songs. Sheesh.\r\n\r\nThe Runaways may not have been the most groundbreaking band in history, but they certainly were a cool band of young rock chicks, and they deserved a better film than this one. I would say it's fun to watch once if you're into this kind of music, but that's it. Such a shame.\r\n_(February 2013)_", "created_at": "2017-02-21T14:51:21.368Z"}]