[{"movie_id": 635891, "review_id": "6328259320af77007bfce2e6", "author_rating": 5.0, "review_text": "It's quite fun to try and spot the famous names who pepper this otherwise puerile and really rather unfunny film - but that was about it for me. It's all about a \"Dante\" (Brian O'Halloran) and \"Elias\" (Trevor Fehrman) who run a small-town store. They spend much of their day quoting lines from their favourite films until poor old \"Elias\" has an heart attack. Whisked to hospital, his friends decide to make a film about life in their convenience store. What now ensues may well offer us an isight into just how a sudden medical emergency can focus the attention and motivate people, but I just found the references either too in-your-face or absurdly obscure and contrived. Perhaps this will rate better in the USA, but here in the UK this just comes across as a rather sad indictment of rural life where it's all about weed and dumb wheezes. It is extremely difficult to marry the threads of humour and tragedy. Dark humour, in my view, is the hardest to write and play well - and I am afraid that nobody here really carries it off with much distinction. Maybe I just wasn't in the mood, but I didn't hear anyone else in the cinema laughing either. Not for me, sorry.", "created_at": "2022-09-19T08:17:23.623Z"}, {"movie_id": 635891, "review_id": "63bccf255be00e00b08fb24b", "author_rating": 1.0, "review_text": "I guess Kevin Smith is irrelevant.\r\n\r\nBut, as the Dark Knight pointed out \"you either die a hero or live long enough to see yourself become the villain.\" I guess Smith live long enough.\r\n\r\nChasing Amy was always my favorite, but Clerks and Mall Rats were classics, Clerks II was pretty hysterical, Dogma (especially if you are Catholic like me) is absolutely cutting and brilliantly so. Jay and Silent Bob... to much of the side characters, but at the end of the day they all had something in common...\r\n\r\n... they all cut into fandoms in only the way that fans, legit come to the comic book store every Wednesday, know what Diamond Distribution is fans of geek fandoms can completely and hysterically criticize the things they love.\r\n\r\nHe even cut into the original Star Wars. It was Geek Counter Culture and we loved every minute of it.\r\n\r\nClerks III has NONE OF THAT. Smith used to criticize pop culture, and now that he's part of it, his scripts don't work. They lost their edge. The brilliance of his early work has faded to the land of sell outs.\r\n\r\nNow you are more likely to see him weep over a bad Star Wars movie in an obvious shill than you are to see him make jokes about how many innocent construction workers died in the second Death Star.\r\n\r\nAnd when he stopped being able to take apart fandom's and playfully make jabs at them, when he stopped criticizing pop culture and started to shill for it, he became irrelevant.\r\n\r\nThere is no need to watch Clerks III, everything that made the first two... that made most of his early work great is absent in this on.", "created_at": "2023-01-10T02:36:21.672Z"}, {"movie_id": 635891, "review_id": "6441a06efcec2e04bdd90e98", "author_rating": 5.0, "review_text": "**A worthy end to a franchise that took a while to captivate my interest.**\r\n\r\nI didn't like the first film very much, as I even mentioned in the text I wrote for it. However, I was able to enjoy the sequel, and although this film is not as good as it is, it ends up being able to give a decent ending to the trilogy: Dante and Randal continue to run their shop, and both are haunted by heart diseases, the result of of the bad life habits they had. After recovering from a heart problem, Randal decides to make an autobiographical film based on his professional experience.\r\n\r\nThe movie was specially thought for Clerks fans. There is no concern about attracting new audiences or pleasing the general public, it is felt from the beginning that it is a film designed to close a larger work, not to give it continuity. The greatest proof of this turns out to be the omnipresence of metaphysical themes, such as illness, religion, death and what happens after it. The characters are the same as usual, and the film even has some special appearances (as had been customary in previous films), and there is nothing surprising in what they do or say.\r\n\r\nThe cast remains the same, with Brian O'Halloran and Jeff Anderson pontificating and dominating everything with a remarkable job, very well done. Next to them are Jason Mewes and Kevin Smith, who have an important part in the most hilarious scenes. And although Rosario Dawson has a good capacity and talent for comedy, her character takes on a much more dramatic and profound facet here, which gave the film greater emotion.", "created_at": "2023-04-20T20:28:30.418Z"}]