[{"movie_id": 283366, "review_id": "57ef77e7c3a3683c88001135", "author_rating": 5.0, "review_text": "_Miss Peregrine's_ could have done with a little more peculiarity. I understand that the lead is our door into this fantastical world, but a character can be relatable without being downright boring. Not an outright bad movie, but certainly not the one to put Tim Burton back on track.\r\n\r\nEva Green is golden but under-utilised, Sam Jackson can barely talk through his fake teeth, the creature designs are fantastic but pulled off with some very poor CGI. There is a little stop-motion to counter this, but again, it's not used to the degree it should have been. Which is really an apt description for the whole thing. Over an over, _Miss Peregrine's_ hints at a great movie buried somewhere within it, but what we end up with is an ill-paced mess. The only truly engaging character momets of the whole story are dropped as soon as they crop up in favour of the \"Good VS Evil\" rhetoric you've seen a million times before.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-10-01T08:46:31.199Z"}, {"movie_id": 283366, "review_id": "57f0c546c3a36849ae0017de", "author_rating": null, "review_text": "Well one certainly cannot accuse filmmaker Tim Burton from straying away from his trademark bizarre movie-making playbook. Perhaps Burton’s best asset when it comes to his brand of distinctive cinema is to faithfully maintain that solid sense of oddness in the manner for which he presents his randomly spry, off-kilter narratives? There was always this consistent understanding that Burton enthusiastically embraces the whimsical peculiarities of his colorful, cockeyed characterizations. Naturally, the eccentric Burton would be drawn to yet another off-balance project that is right up his weirdly imaginative alley. Hence, in **Miss Peregrine’s Home for Peculiar Children** the notoriously quirky director is true to form as he presents another delightfully macabre and freakish showcase that will definitely appeal to the darkened nature of the kiddie crowd.\r\n\r\n**Miss Peregrine’s Home for Peculiar Children** is the big screen adaptation of Ranson Rigg’s popular young adults trilogy. The film is an instant magnet for Burton’s off-the-cuff style and standard of warped whimsy. The Sci-Fi enhanced children’s fantasy is highlighted effectively by visually arousing set decorations, breath-taking CGI special effects, eye-popping costumes and an overall wonderment of interestingly deformed yet capable super-powered youngsters with unusual gifts that define their unique identities. Screenwriter Jane Goldman (“Stardust”) dutifully captures the misguided magic of Rigg’s best-selling novel brought to life that is very reminiscent of an atmospheric _Harry Potter-esque_ universe where one can easily detect that stimulating Hogswarts vibe bursting at the seams. The only viable knock on **Miss Peregrine’s Home for Peculiar Children** is that Burton has explored this twisted territory before thus giving the familiar illusion that he is making the same movie over again but with some updated dressing. Still, the surreal stamp of Burton’s animated movie mindset is enough to recommend the erratically conceived **Miss Peregrine’s** as a frolicking fun-filled fable riddled with perky-minded naughtiness.\r\n\r\nThe construction of **Miss Peregrine’s Home for Peculiar Children** is a strange brew that brings together the assembled working parts of a previous Burton Gothic-looking spectacle with similar elements meshed in the movie-related mechanics of such ditties including Mary Poppins, the aforementioned _Harry Potter_ film franchise, _Willy Wonka and the Chocolate Factory_ with a touch of a junior-sized _X-Men_ sentiment attached to the proceedings. Basically, Burton encourages his kooky kind of whirlwind escapism where he wants to transport the audience into a hazy maze of unstable, creepy hedonism embedded in indescribable gaudy chaos. It is no secret that Burton looks to incorporate his known ingredients of strangeness, endearment, gentle terror and slight wackiness. The majestic concoction, for the most part, works on the welcomed senses.\r\n\r\nIn the title role of **Miss Peregrine** is the fetching Penny Dreadful star Eva Green (one of Burton’s featured actresses from his 2012 film “Dark Shadows”). The nostalgic backstory of Miss P. and her mixture of rejected orphans is recalled in detail by a Florida-based retiree named Abe Portman (Terrance Stamp) who revels in enlightening his teenage grandson Jake (Asa Butterfield) about the remarkable wonder woman and her special orphanage stationed on a Welsh island. Clearly, Jake thinks highly of his grandfather’s fascinating vintage storytelling but feels like an outsider especially when his own parents think that he is in need of serious counseling. When Jake is not engaged in Abe’s recollections of his old pals from Miss Penegrine’s orphanage (complete with handy black-and-white photographs for proof of his proclamations) he works at the local supermarket in uneventful fashion.\r\n\r\nAs legend has it poor Miss Penegrine’s Victorian orphanage located on the island of Cairnholm was demolished by Nazi bombs that rendered her and the kids vulnerable during World War II. However, we are also informed of the supernatural tendencies of the resilient lady and her “peculiar children”. For one, Miss Penegrine can turn herself into a…wait for it…penegrine falcon at a moment’s notice. As for the bird beauty’s charges they too possess noteworthy specialties in appearances  and spellbinding prowess as well although not as accepting as Miss P’s accentuated tricks.\r\n\r\nJake had always viewed his grandfather’s accounts of Miss Penegrine and her peculiar children in question as a compelling revelation especially when he was younger. Jake, courtesy of his indifferent folks, saddle him as the caretaker for the ailing Abe. However, when he uncovers his dementia-ridden, dying grandpa Abe babbling endlessly about monsters and everything connected to the Miss Peregrine universe this sparks an immense curiosity about Jake wanting to further explore Abe’s whispered claims of seemingly exaggerations. Jake is convinced that Abe was murdered–no doubt by the so-called monsters–and wants to further the cause by visiting the mysterious European island that planted so many adventurous memories in his grandfather’s childhood back in the early wartime forties. Additionally, the concept of time bubbles known as “loops” figure into the suspense. The loops are a designed invention by Miss Penegrine to keep her endangered wards safe from the period’s on-going harm.\r\n\r\nSince Jake is already in therapy and everyone thinks that the troubled kid has a screw loose in the aftermath of the trauma regarding his deceased beloved grandpa Abe it is suggested that maybe a visit to the Welsh island would put to rest the inner conflict within the young man. So Jake’s father Franklin (Chris O’Dowd) accompanies his son to Cairnholm where he can sort out his lingering angst. Can Jake successfully locate his grandfather’s old-time orphanage and come to his own elusive conclusions? Soon, the modern-day Jake will experience his own time-traveling warp where he will at firsthand encounter the captivating kids that were included in youthful Abe’s existence including the lovely Emma (Ella Punell) that strikes his fancy–the same gal that his grandfather crushed on back in his heyday.\r\n\r\n**Miss Peregrine’s Home for Peculiar Children** is a jumbled gem that does not quite separate its eerie realm from other Burton-oriented fare that shares the same branding of visual makeup found in entries such as _Beetlejuice_, _Edward Scissorhands_ or _Dark Shadows_. Nevertheless, **Miss Pelegrine’s** is stunning although the half-baked plot bounces aimlessly at will. When Jake is transported back to 1943 and witnesses the peculiar-looking children we are truly in awe of Burton’s tangy taste for the cartoonish craziness. Children that are cursed (or blessed) with head-scratching anomalies not to mention the haunting images of Hollowgast monsters and Green’s fetching but crafty spellbound diva in Miss P all establishes an intriguing off-balance children’s Sci-Fi fantasy that hits more than it misses its nightmarish target.\r\n\r\nBurton assembles some notable names that fill the circus ring surroundings in **Miss Peregrine’s Home for Peculiar Children**. The explosive Samuel L. Jackson is on board as the villainous Barron looking to feast upon the peculiar kiddies’ eyeballs. Veteran performer Stamp is convincing as the aging Abe whose descriptions of his 40’s-era childhood inspires Butterfield’s Jake to make this disjointed journey into Burton’s devilish and daring vision of eccentricity. Other supporting players include the magnificent Judi Dench’s Miss Avocet, Emmy-winning actress Allison Janney (from TV’s “Mom”) as Dr. Golan and Rupert Everett as the resident ornithologist.\r\n\r\nSurely, **Miss Peregrine’s Home for Peculiar Children** won’t entirely disappoint avid Burton fans as he delivers what amounts to be a safe serving of sideshow cinema ready to please the entertaining palates of gentle grotesque-loving moviegoers everywhere.\r\n\r\n**Miss Peregrine’s Home for Peculiar Children** (2016)\r\n\r\n20th Century Fox\r\n\r\n2 hrs. 7 mins.\r\n\r\nStarring: Eva Green, Samuel L. Jackson, Terrence Stamp, Asa Butterfield, Judi Dench, Ella Purnell, Chris O’Dowd, Rupert Everett, Allison Janney, Milo Parker, Pixie Davies\r\n\r\nDirected by: Tim Burton\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Children’s Fantasy/Sci-Fi & Family/Action & Adventure\r\n\r\nCritic’s Rating: ** 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-10-02T08:28:54.236Z"}, {"movie_id": 283366, "review_id": "585ed423c3a3681a6201304b", "author_rating": 6.0, "review_text": "**The innocent peculiar children versus the monstrous peculiar adults.**\r\n\r\nI thought it should have been a Steven Spielberg film, but he would have compromised on the visually frightening negative characters. Particularly from the little children's angle who are the regular target audience for a theme like this. Even in his recent 'The BFG', you know how the giants were portrayed. So Tim Burton was the right choice and he did his best. But not everybody agrees on that, even I was slightly disappointed. I mean technically it sounded so awesome, but the story was not that impressive. Because of too familiarity, except the peculiar characters.\r\n\r\nIt was based on the young adult book of the same name. The story of a boy named Jake. After his grandfather's murder, he goes to Wales to find the children from an island home about the stories he had heard when he was a little. He discovers they are intentionally stuck in a time loop to avoid their enemies from striking them. But what they feared is about the come true, so now how they plan to defeat after half a century hiding from them is to be told in the rest of the segment.\r\n\r\nAs a children's film fan, I wanted to like it, but not fully satisfied. It was a two hour long film, the first half was an introduction that we saw everything from its trailers and teasers. So I lost interest in those parts, but once the clash between the good and bad had began, the film started to give something new. Again the final battle at the fair should have been designed better. I thought Samuel L. Jackson was not untilised well.\r\n\r\nThe major issue with the film was the narration not trying to take a big step in the story development. Felt like they are aiming for a sequel, so they are avoiding to give out everything in here itself. Similar to the first 'Twilight' film, which was too boring drama. It is almost out of the big screen now and the rating further going to drop. The film critics bashed it, but seems most of the people and film fanatics enjoyed it. I hope they will make 'Hallow City' and I'll be waiting for that.\r\n\r\n_6/10_", "created_at": "2016-12-24T20:01:39.610Z"}, {"movie_id": 283366, "review_id": "5a926d95c3a3682502019a06", "author_rating": 7.0, "review_text": "Before I start I should perhaps mention that, although I consider this a family movie, it is perhaps a bit on the scary side for the youngest member of the family. Anyway, personally I liked the movie and so did my kids. \n\nIt did have time travel in it which I, in general, utterly dislike but it is a Tim Burton movie so it was already a foregone conclusion that it would be a wee bit bizarre anyway and it had Eva Green, which is one of my favorites, in it so that kind of made up for the time travel crap.\n\nThe movie starts of by Jacob watching his grandfather being murdered by some mysterious being that only he can see. Of course everyone believes that he was hallucinating and so off we go with hospitals and shrinks and so on. Finally his parents allow him to travel to the island of Cairnholm in search of the mysterious Miss Peregrine.\n\nFrom their on we wander into the wonderful world of “Burtonesque” bizarreness, fantasy and general weirdness. Naturally Jacob meets Miss Peregrine and her kids. Kids who each have some peculiar talent each more weird than the other.\n\nNaturally there are a some bad guys lurking in the shadows as well. Bad guys intent on destroying Miss Peregrine’s shelter and … well, let us just say that they are not exactly concerned for the children’s wellbeing. I liked the bad guys. Both in their half human form and their more scary monster form. I especially liked Samuel L. Jackson as Barron, the boss bad guy. He really made an excellent performance.\n\nThe one person I did not like was Jacob’s father. Apart from being a jerk he looked like he was on drugs or sleeping pills throughout the entire movie.\n\nOn the whole this was perhaps not the best of Tim Burtons movies but it was still a good and enjoyable one. Decent special effects. The story worked despite the enormous paradoxes introduced by the time travel stuff. The characters did a fair performance. I did not regret the 2+ hours I spent on watching it.", "created_at": "2018-02-25T08:02:29.625Z"}, {"movie_id": 283366, "review_id": "63a6031a596a91008c4f76ed", "author_rating": 7.0, "review_text": "**Despite the flaws, and some less than positive interpretations, it is a good film.**\r\n\r\nTim Burton has already accustomed us to a surreal and fantastic style, and he almost always gives us very good films. This movie is no exception, giving us good entertainment. It's based on a book, which I've never read and I don't know what it's like, although I've heard that it's frankly more interesting than this movie. However, Tim Burton has already shown that he doesn't care much about this, in previous works that we have seen.\r\n\r\nThe script is surreal and fantastic, based on a teenager's trip to the British Isles, to see his grandfather's place of origin, recently deceased. There, he discovers the ruins of the orphanage where his grandfather grew up, destroyed by German bombing and never rebuilt. And later he discovers that his childhood friends and the orphanage's governess are still alive and living in a time loop created the day the house was razed. And that there is a danger that will threaten them all.\r\n\r\nOverall, the film is quite satisfying, entertains quite well, and has a beautiful, well-written story. This is due, in large part, to the way in which he tackles difficult topics such as mourning and the family relationship between a father and a son. There are some little-explained details, loose ends, situations that don't get the attention they could have, and I thought the film takes a while to \"gear\" and really capture our interest.\r\n\r\nAmong the cast of this film, no one stands out like the impeccable Eva Green. The actress has what it takes for the character that fits her, and she knows how to make the most of her charisma and the good quality of the material given to her by the screenwriter. Terence Stamp was also in good shape and did a good job. Among the younger actors, it is Ella Purnell who stands out the most on a positive note, although Finlay MacMillan and Lauren McCrostie also give us very satisfactory performances. Unfortunately, as far as the cast is concerned, everyone else can't achieve such a good performance: Judi Dench, Rupert Everett and Chris O'Dowd have neither characters nor screen time to allow them to do something really interesting. Despite having achieved some good moments, Samuel L. Jackson looks like a fish out of water in this work. But the one who really deserves a boo is Asa Butterfield. It was a bad choice, a casting error. The actor doesn't have charisma, he doesn't have the capacity to deal with the protagonist, and he wasn't very lucky with the material he received either (and here, the fault lies with the screenwriter and the way he conceived and worked his character). Far from capturing attention and holding our interest, the actor fades away from any of his co-stars.\r\n\r\nAnother of the strong points of this film are the visual effects and the excellent CGI used. The house, for example, couldn't be more realistic, and the skeletons and ship look great on screen too. The cinematography was very well worked, the camera does a good job, the sets and especially the costumes and hairstyles are excellent and automatically transport you to the 40s. I really liked some of the places where the film was made, highlighting In particular, there is a famous Belgian mansion near Antwerp, which has been in ruins since the Second World War and which was demolished shortly after this film was released. The soundtrack does an effective job, but it doesn't bring us any surprises.", "created_at": "2022-12-23T19:35:54.661Z"}, {"movie_id": 283366, "review_id": "646f266c07216600fa6c3dcf", "author_rating": 7.0, "review_text": "This reminded me a bit of the \"Golden Compass\" (2007) as Asa Butterfield (\"Jake\") finds himself drawn to a sleepy island where he encounters the eponymous, magical, Eva Green who hosts a group of children of all ages with special quirks who live in a time loop - the same day from 1943 - which should ensure that they remain safe from the predatory \"Barron\" (a wonderfully over-the-top Samuel L. Jackson) and his menacing monsters who are bent on capturing \"Miss Peregrine\" and eliminating the youngsters. It's a bit too long, but once it gets up an head of steam then Butterfield is an engaging hero well supported by the odd appearances from Dame Judi Dench, Rupert Everett, his father Chris O'Dowd and his inspirational grandfather Terence Stamp. The stories are enjoyably episodic, each child has their five minutes of fame to demonstrate their skills and personality, there's a soupçon of romance, a bit of mischief, teenage jealousy and yes, even the usually rather wooden Eva Green brings a little charisma to the screen with her Sherlock Holmes-style pipe before a denouement that knits it all together nicely. I like that this is trying to be a more sophisticated story for younger folks. Some of the issues - i.e. WWII - have resonance beyond the frivolity of the story and the increasing sense of menace is well developed by Tim Burton without becoming the stuff of sleepless nights.", "created_at": "2023-05-25T09:12:12.459Z"}, {"movie_id": 283366, "review_id": "64b7d65bb1f68d00c8ffa43e", "author_rating": 7.0, "review_text": "A bunch of teens and children with weird special abilities like superheroes all in one house. Miss Peregrine is pretty much there mom. I hope they make a sequel because I would like to see more of there abilities then they showed in this movie. It feels like it was like a tease showing us as little as possible at what they can do.", "created_at": "2023-07-19T12:26:03.249Z"}]