[{"movie_id": 238615, "review_id": "568a3236c3a36860e902a34d", "author_rating": 8.0, "review_text": "> Not very innovative, as well as not that bad.\r\n\r\nLike the previous year, the 2015 was also considered the year of sci-fi in the film world. Plenty of large and small scale flicks came out and among them I was eagerly waiting for this one. If the story is what you always prefer with a fine production quality, then this film won't disappoint you. The performances were also well supported. Then what was this film's issue?\r\n\r\nThe last time widely accepted movie by Tarsem Singh was when he engaged in the screenplay development. After that he did not see much success where all his directed ones were written by others. My perception is that he must do those both department where he's good at it. Take this film as an example, an awesome story and had a good cast, but the writing was let down according to many who saw it.\r\n\r\nEven in the short period of appearance, Ben Kingsley's role's legacy carried out till the end, because the concept was designed like that way. Being one of the top actors, Ryan Reylands films are not that celebratable. Though he's doing a decent flicks often and those were failing to recognise in the higher level, which did not spare this one as well.\r\n\r\nPeople are comparing it to 'Face/off', but to me it looked more like coming together of 'The Island' and 'Skeleton Key'. Whatever it is I had a good time. Not a fresh concept of an idea, but narrated differently and it needed a bit depth in showcasing everything in the film.\r\n\r\nMy formula/secret for watching a movie successfully even it considered as an average or worse is, I won't bother for all the departments come together to become a well crafted product like the critics expect, because I'm a movie fanatic and love watching them almost most of the time than arguing about its flawed contents. If I find anything solely interesting like acting, music, story, visuals, I respect the efforts. So do I to this one and believe me it is much better than what the critics say so.\r\n\r\n7/10", "created_at": "2016-01-04T08:49:58.006Z"}]