[{"movie_id": 625568, "review_id": "5f4d20e8c392660036d5a8bf", "author_rating": null, "review_text": "Russell Crowe stars in the new Thriller “Unhinged” and gives an intense performance which has become a staple of his career. Playing a man who has lost it after the loss of his job and marriage, The Man kills his ex and her partner before burning down their home and vanishing into the night.\r\n\r\nRachel (Caren Pistorius) is a woman who is seeing her world slowly crumble around her. She is in the midst of a contentious divorce, has just lost her best client, and is struggling to take care of her son while dealing with her brother in financing moving in with her so she can afford to pay for a needed care home for a family member.\r\n\r\nAs one thing after another mounts for Rachel and dealing with heavy traffic as she tries to get her son to school to avoid a detention for being tardy; she honks and makes and aggressive turn in front of the Man. He takes offense to this and drives alongside Rachel and demands a since apology for her actions. Rachel has long since lost any sense of caring and does not provide a sufficient response which further triggers the Man.\r\n\r\nAs some very aggressive road rage follows; Rachel believes she has put it behind her and drops her son off at his school. While filling up her gas tank Rachel sees that the Man is following her and when her efforts to diffuse the situation further trigger the Man she sees just how dangerous and highly unstable individual he is.\r\n\r\nWhat follows is a deadly game of cat and mouse as the Man taunts Rachel while exacting his revenge on those in her life all the while preparing for his next encounter with her.\r\n\r\nCrowe is fantastic and gives a very intense performance without ever going too far over the top and becoming campy with his performance which is often the case in films of this type. He is a compelling adversary who commands the attention of the viewer and one can see that he is an individual who has simply snapped from the pressures and reality of life and believes his actions are justified.\r\n\r\nWhile I was able to predict one of the big moments near the end of the film; it was delivered In a slightly different way which was refreshing. The film was intense and compelling and Director Derrick Borte keeps things from become too over the top especially in the last part of the film where Hollywood standards for the genre did tend to come in the play.\r\n\r\nThe film wisely relies on the strength of Crowe and the supporting performances and provides a welcome return to cinematic features for viewers as long as they are willing to overlook some minor things and focus on the intense story and compelling performances.\r\n\r\n4 stars out of 5\r\nwww.sknr.net", "created_at": "2020-08-31T16:10:16.128Z"}, {"movie_id": 625568, "review_id": "5f9f8b1e2790bf0036476a9e", "author_rating": 5.0, "review_text": "Russell Crowe dials up his inner Rutger Hauer (\"The Hitcher) and Michael Douglas (\"Falling Down\") to reap terror on a boy and his mom who don't give him a courtesy honk. Skip this \"meh\" road rage thriller and check out the aforementioned titles instead.", "created_at": "2020-11-02T04:29:18.558Z"}, {"movie_id": 625568, "review_id": "5fb4463d1f027500405c6791", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nBoasting a ferociously captivating Russell Crowe as an absolutely lunatic driver, Derrick Borte delivers a purposefully exaggerated premise based on something that occurs every day to pretty much everyone. The rated-R action is surprising in its amount of gore and unrestraint in murdering every character in the most shocking yet incredibly entertaining fashion.\r\n\r\nHowever, Carl Ellsworth's screenplay lacks character depth, leaving the viewer with barely any knowledge of anything remotely relevant about the protagonists besides basic relationships, which are merely used as plot devices to more bloody killing. The narrative goes through hard-to-believe developments, and the ending still possesses the cliche \"dumb protagonist's decision that no sane person would ever think about\".\r\n\r\nStill, I defend that its main narrative is closer to reality than fiction, especially the first two acts. In the end, my main issue might actually be that Caren Pistorius' character was indeed guilty of the event that propelled everything. She demonstrated arrogance, selfishness, and the inability to simply apologize to someone who was initially polite. That, to me, it's her biggest sin and the reason why I couldn't care less about what happened to her or her family.\r\n\r\nRating: B-", "created_at": "2020-11-17T21:53:01.359Z"}, {"movie_id": 625568, "review_id": "60784cff746457003fd626b0", "author_rating": 6.0, "review_text": "A good cast, including some relatively new actors, lead this edge-of-your-seat thriller about, you guessed it, a man unhinged.\r\n\r\nUnfortunately, after the first \"unhinged\" act, this is one of the most predictable films I've ever watched.", "created_at": "2021-04-15T14:26:07.040Z"}]