[{"movie_id": 277216, "review_id": "57dab701c3a36841c8000021", "author_rating": 6.0, "review_text": "Gangster rap is pretty far removed from my wheelhouse, and I've never followed N.W.A. closely enough to know if this biopic an accurate depiction of their career, but; a good movie is a good movie is a good movie. And _Straight Outta Compton_ undeniably is that.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2016-09-15T14:58:09.618Z"}, {"movie_id": 277216, "review_id": "57f40cf4925141398a000228", "author_rating": 7.0, "review_text": "**The rise of the Rap music!**\r\n\r\nThere were lots of debate over this film's snub from the Oscars, but I'm not here to talk about that. As a film, it was awesome and as a biographical film, even more awesome, but not an inspiring film that I was expecting. There were many bad things in it, like the language and character portrayals. Though hats off to the filmmakers for rendering the it with the bold contents. I don't know if it being true to the actual events, but anybody can feel how those circumstances would have been for those involved in the real.\r\n\r\nOne thing is for sure, the film is not for the families. The first half was the reason which was very negatively appealed, particularly the racism and police abuse preoccupied rather than telling the actual story. But the next half was much better. I liked it because of that part which crafted so brilliantly. That's where the real journey begins. Well played characters, everybody who repressed those real ones were done incredible job.\r\n\r\nThis film revealed something I did know. Like how the Rap music got so popular. I quite belong to the same generation where this thing got its revolution. It was like another 'Lords of Dogtown' where the young guys made skateboards popular, but here it was the Rap songs. It was a two and half hour long film, longer than an average film length, but the pace was good. Except the strong contents, the narration never looked dull. I totally enjoyed watching it, a good film for adults, particularly those who love Rap music must not think of missing it.\r\n\r\n_7/10_", "created_at": "2016-10-04T20:11:32.061Z"}, {"movie_id": 277216, "review_id": "5fe7f8451d3563003fd9522b", "author_rating": 9.0, "review_text": "Quality film.\r\n\r\nI thoroughly enjoyed <em>'Straight Outta Compton'</em>, it had me gripped all the way through. That's despite me having little to no knowledge of N.W.A, I knew of their name and of Ice Cube and Dr. Dre but basically zilch about their actual story. I couldn't comment on how true it is to history, but as a film it's fantastic.\r\n\r\nYou have great performances from O'Shea Jackson Jr., Corey Hawkins, Jason Mitchell and Paul Giamatti. Mitchell impressed me most as Eazy-E, while the casting of Jackson as Ice Cube - his father, of course - was a masterstroke. All the cast do very well, in truth.\r\n\r\nI love how gritty the film is too, it feels real - at least as real as film can get. There is some neat cinematography in there, while the music is entwinned nicely. The pacing is almost perfect, aside from a few moments in the middle. I also rate how it all ends, in terms of the story but also with the end credits. There's heart in there.", "created_at": "2020-12-27T02:58:13.038Z"}]