[{"movie_id": 241257, "review_id": "572bb3da9251416cee000520", "author_rating": 6.0, "review_text": "The making of the movie is good. The directing OKish and the cast is great and performs well.\r\n\r\nHowever, the story is an anti-climax one. Amenábar builds an atmosphere that promises a lot more than it delivers. In the end, it is just the only logical and down to earth story with unrolls well but it just drives the spectator to boredom.\r\n\r\nGood from the philosophical and logical point of view. Bad from the show perspective.", "created_at": "2016-05-05T20:58:02.358Z"}, {"movie_id": 241257, "review_id": "57375f069251417b5e0036f5", "author_rating": 7.0, "review_text": "> When the case needs a physical evidence, but it can't reach to get one.\r\n\r\nWell, it is an investigation theme, something like the Oscar winner 'Spotlight'. After a teen girl Angela was reported of the sexual abuse, a detective named Bruce takes a special interest in solving the case. With the help of a psychologist, lots of ugly truth comes out. But the lack of the solid evidence makes the case slowly slip away from his hands. While his desperate effort to find whoever behind it, it only affect more Angela and her family. So how the story end is told with a twist in the third act.\r\n\r\nIt was inspired by the real events of the late 80s. About the rise of the Satanic culture when panic was among the peoples of the United States. One of the best investigative films, with well developed mysteries around the plot. I found hard to predict, especially the twist was simple, but unexpected. Ms Watson was okay, but Ethan Hawke was excellent. From an awesome filmmaker, another wonderful film, yet not anywhere near to his other great works.\r\n\r\nWhenever a film based on the real, especially about crimes reveals the truth, we the people believe it and pour our supports to the victim. In that perspective, this film tests our capability to understand between the good and bad. Sometimes the things are not what it is supposed to be because of the overlook. Such theme was this that neatly narrated on the screen.\r\n\r\nI know this is not a masterpiece, but I don't understand why it is very underrated. This is actually a better psychological-thriller you would find in the recent time. Forget what the critics say, just give it a try, obviously it is slow, but in the end you would find it worth, at least most of you.\r\n\r\n7/10", "created_at": "2016-05-14T17:23:18.593Z"}]