[{"movie_id": 13207, "review_id": "58a24e15c3a36829620004ed", "author_rating": 4.0, "review_text": "'Friday the 13th' turned out to be one of the biggest disappointments when it comes to horror classics remakes. After watching the trailers, I got the wrong idea that this film was going to be more serious. The previews gave me the false impression that this remake was going to go deeper into Jason's background story or maybe even offer extremely gory murders, when in reality, it is exactly the opposite. I'm not one of those horror lovers who want to know everything related to the villains, their origins and such, but in this case, it would have been acceptable to throw in some flashbacks regarding Jason Voorhees' past. Unfortunately, this remake wastes all the opportunities to make this interesting and instead, it offers an exaggerated and ineffective amount of comedy situations that are badly placed and ruin the possibility of creating a genuine horror feeling. Comedy situations in slasher films are no surprise, but in this remake, the attempted comedy is badly placed and seems like it was forced by the producers to make the film more marketable. I will give an example: after a really tense and dramatic persecution, the film cuts to a scene involving a horny stereotyped hillbilly lusting over a mannequin, while Jason silently walking up to him from behind, with the obvious intention of slashing him. How can they mix cheap humor and tension in one scene? The results obviously cannot be good. It was a murder scene, but instead of causing uneasiness, tension or shock, everyone at the movie theater was laughing at the guy talking about how he lost his virginity to a mannequin. The worst part is that the so-called humor is extremely 15-years-ago and even back then, it wouldn't have been funny.\r\n\r\nThe gore is very unsatisfying also. Nowadays, slasher films usually offer creative and really brutal murders and even if the plot is not so good, you can always at least settle for that. When I found out that Marcus Nispel was directing this, I thought it was good news, because he directed \"The Texas Chain Saw Massacre\" remake, which is a fine example of a movie that may not be as good as the original, but at least it offers something more serious, gory and overall fulfilling. Naturally, since Marcus Nispel also directed 'Friday the 13th' remake, I expected something in the same vein as 'The Texas Chainsaw Massacre' remake. Sadly, that was a very inaccurate assumption. In this film, the gore is completely unsatisfactory and in some cases, the murders are even funny. The entire movie theater burst into a maniacal laughter during some of the murders and I must say that in those cases, I had to agree with them.\r\n\r\nAnother thing that bothered me about this film, is the fact that they could have showed a little bit more about the character of Mrs. Voorhees. Unfortunately, she only appears during the first seconds of the film and they cut her scenes with the opening credits, which is a disgrace. The confrontation between Mrs. Voorhees and the counselor girl is perhaps one of the finest points of the entire 'Friday the 13th' series, and it should have been remade in an equally tense way. Cutting the scene with the opening credits is, in my opinion, a self-sabotage. I think it's safe to say that many fans of the original film were eager to learn some more about Jason's beloved mother and see her more time on the screen. But no... apparently, they didn't even take advantage of that opportunity to make this movie more interesting. True, we see a little bit about Jason's environment, since the characters get to take a tour inside his house and it was a good idea to show his bedroom and evidence the fact that once upon a time, the killing machine was an innocent boy with a normal life. However, that doesn't make up for the lack of space that Mrs. Voorhees had on the story.\r\n\r\n'Friday the 13th' turned out to be a teen comedy with lousy humor and some badly placed murders from the beginning until the end. Watch it if you're curious, but unless you're a silly teenager who thinks everything is funny, don't expect anything even remotely good, because you'll be devastated.", "created_at": "2017-02-14T00:23:49.253Z"}, {"movie_id": 13207, "review_id": "5d33e8422f8d095259dd2ef3", "author_rating": 7.0, "review_text": "***Scarier and with a more dangerous Jason, but not as fun***\r\n\r\nI became a fan of the \"Friday the 13th\" series after seeing \"Part V: A New Beginning\" (1985) on TV in the late 90s and have subsequently digested all of the films in the series. This '09 reboot takes elements of the first four films, drops all campy elements seen in Part III (and V, VI, IX & X) and provides better scares with a more dangerous Jason, who runs, shoots arrows, uses traps and schemes. In the original series Jason was comparable to an unstoppable zombie-like force, particularly as the series progressed where Jason became more & more infernal and monstrous. Here he's more human, which makes sense since it's early in the timeline and Jason hasn't yet morphed into the hellish zombie he became in later segments.\r\n\r\nThe appeal of the series for is not the gore or kills but rather the plot of a group of youths gathering in the wilderness; the inclusion of a psycho killer on the loose adds a necessary element of threat & suspense, and Jason's a quality nemesis/monster. Simply put, \"Friday the 13th\" is an entertaining series with creepy elements, but I never found the flicks all that scary, not even the first two films, which are the most serious in tone, along with IV, VII, VIII and XI. Of course there are jump-scares galore, but that's not what I'm talking about. With the third installment, campiness was added, which made several of the installments even less scary. The good thing about this '09 reboot is that it throws out the campy aspects and opts for a more serious approach. In addition, it has a couple of sequences that produce actual frights, something I never experienced with the rest of the series, as well as scenes with genuine suspense, like when Jason chases the three protagonists through the tunnels, etc.\r\n\r\nSpeaking of the three protagonists, the cast is filled with youthful no-names, but the three main protagonists, a brother & sister and a brunette who takes a liking to the brother, are good and likable. It's always nice to have some people you can root for. Really, there are only two characters who are unlikable, a creepy redneck hick (and his \"hot\" mannequin, lol) and the arrogant alpha-male whose father owns the vacation house.\r\n\r\nI found one aspect of the film highly unusual and unique. I'm referring to the 24-minute prologue before the opening credits. This has to be one of the longest prologues in film history. I have to give credit to the filmmakers for being creative and trying something different.\r\n\r\nThis reboot also just plain LOOKS better than all those older films; I'm referring mostly to the creepy woods at night. This is to be expected, of course, with the advancements in filming technology since 1980, not to mention the bigger budget.\r\n\r\nThe series is known for its excellent assortment of women in every entry, but this one's not quite as good as most of the films in the franchise. There's the excellent Amanda (America Olivo) in the first act and also Whitney (Amanda Righetti) and Jenna (Danielle Panabaker) as the two female protagonists. They're solid, but not in the same league as Pam in Part V, Agent Marcus in Part IX and Heather in Part XI (FvJ). I suppose it's all a matter of taste though. \r\n\r\nThe film was shot in the heart of Texas, mainly in regions relatively near Austin.\r\n\r\nFINAL WORD: My biggest criteria for judging the worth of a film is whether or not it pulls me in and makes me forget about the passing of time. This '09 reboot succeeds in this respect. Although nothing can replace the initial 1980 film and its immediate sequel, this reboot should be given credit for generating a few genuine scares, which I rarely if ever experienced with the rest of the series; not to mention providing a worthy trio of protagonists, as well as scenes with genuine momentum. \r\n\r\nOther than these factors, the reboot is just more of the same, but it's at least as good as the better sequels, although it's not as fun as several of them because it shoots for serious horror. This is good, but the first half is more effective than the second. And it fails to approach the greatness of the '09 remake of \"The Last House on the Left,\" a veritable masterpiece that transcends the usual one-dimensional nature of most slasher flicks, not that I would expect (or necessarily want) that for \"Friday the 13th.\" \r\n\r\nI have the \"Killer Cut\" that runs 105 minutes, while the theatrical version runs 97 minutes. Needless to say, this is a heavy R-rated picture.\r\n\r\nGRADE: B", "created_at": "2019-07-21T04:21:22.289Z"}, {"movie_id": 13207, "review_id": "5ec3ba0ed2147c0021b444d3", "author_rating": 7.0, "review_text": "**The following is a long-form review that I originally wrote in 2009.**\r\n\r\n_Friday the 13th_, originally released in 1980 began one of the most successful film franchises of all time. Now, 31 years later, the newest incarnation of _Friday the 13th_ has just been released on Special Edition DVD. It seems unlikely that the director of the first film Sean S. Cunningham (who is also the producer of the 2009 version) could ever have seen just where the monster he had helped to create would go. So now, with the series being given one of those oh-so-popular of late \"reboots\", it's important to take a look at what Jason Voorhees has been up to, what has changed, and just as importantly, what hasn't.\r\n\r\nThe film loosely follows the progression of the first four _Friday the 13th_ films, the opening credit sequence has mother dearest Pamela Voorhees on June 13, 1980 confronting one of the Camp Crystal Lake counsellors , she is promptly decapitated with a machete, as per the original story. This is a powerful intro to the rest of the movie, as a reboot, you have to show Mrs. Voorhees at some point in time, but it can't take up too many of those valuable 90 minutes. At this point the film begins to deviate from the original, we get some of Harry Manfredini's musical score (Ki-ki-ki-ma-ma-ma) but this time round Jason is very much alive, sees his mother beheaded and picks up his iconic machete and some very bad habits from here on in. After the credits there is a new bunch of kids, looking to score some pot, have a little pre-marital sex, get wasted, go places they're not allowed, and just generally set themselves up to die. But something is missing... that would be... Oh yes, the cast! Only a single member of the \"media-hyped\" actors portrays a character in this group, so we already know that these guys are going nowhere. Only after their demise are we given the \"_FRIDAY THE 13TH_\" movie title, and the film begins. Unfortunately, by the time this happens, we have already been through a good set of characters, and it feels like watching a sequel after you're 23 minutes in.\r\n\r\nThe new group of rowdy teenagers have much the same plans in store as the last, but they are much less believable characters when compared to the ones we had just minutes ago. They are somewhat saved by the performances of Travis Van Winkle (from _Accepted_) as Trent, the \"rich asshole\" of the movie, and Aaron Yoo as Chewie, the lovable little stoner. Jared Padalecki's character Clay (a reboot of Rob from _Friday the 13th Part IV: The Final Chapter_) is wholly out of place, maybe it's his _Supernatural_ fame or maybe it's his deliberate intention to not have a good time. Either way the protagonist of the entire film really doesn't seem like he belongs in the movie at all. Sort of a down point when you think about it.\r\n\r\nWhile the film didn't seem to have plot holes per se, it very much seems as though they tried to fit the creation of the film in before it was due to be released on Friday, February 13th. Now don't get me wrong, I love novelty and a good theatrical gimmick as much as anyone can, but know what I care about even more? The end product (especially when it comes to _Friday the 13th_)! The time could have been much better spent on filling in all the little bits where the movie just seemed to be missing something. You're not quite sure what it is, but that's their job to figure out.\r\n\r\nThe hype over the film's sexual content seems to have been grossly over-exaggerated. Supposedly Michael Bay walked out of the first screening due to the sex scenes. After having watched the film, I find this very difficult to believe. Although the sex does seem to have been thrown in for the Hell of it (isn't it always), there really isn't all that much. But, after all of the problems the film goes through, they get the most important thing right, Jason. With culturally recognised hockey mask and machete in tow, Mr. Voorhees does his thing, and he does it well. Whilst this particular incarnation of Jason is wholly more believable than any of the others, Derek Mears makes it work, he's not a supernatural boogieman-esque killing machine, he's a hunter, he's a natural, he's almost the anti-hero. Upon first hearing that Kane Hodder was yet again not to be playing the role of Jason Voorhees, I think a little part of me died inside. But I submit, Derek Mears has given the best representation of Jason I think we've ever seen.\r\n\r\nThe 2009 reboot of _Friday the 13th_ is the type of movie that you can watch, and when it's finished, want to go right back to the beginning and watch it all over again, you're just not sure why...\r\n\r\n-_Gimly_", "created_at": "2020-05-19T10:50:54.525Z"}, {"movie_id": 13207, "review_id": "6116b6f7350398002db6a282", "author_rating": 8.0, "review_text": "A modern update of the cult following horror...\r\n\r\nTruly terrifying, and gore-tastic!", "created_at": "2021-08-13T18:16:23.152Z"}]