[{"movie_id": 470878, "review_id": "5aae84940e0a267833028375", "author_rating": 9.0, "review_text": "*Disclaimer: This isn't any sort of \"official\" review. This is just one ordinary movie-goer's opinion...\r\n\r\nLovely movie. 😊\r\n\r\nI honestly wasn't expecting much, but I wanted to support MercyMe, and I always like to throw my support whenever a movie theater plays a good, clean movie like this one.\r\n\r\nI was actually quite amazed by the production. It had the look of a big budget film (I have no idea how much the budget was), and was lacking the cheese element prevalent in so many Christian movies. It was remarkably well cast, and I was particularly impressed by both guys who played Bart - the 11 year old Bart (Brody Rose), and the teenage/20something Bart (J Michael Finley). I also LOVED Trace Adkins as Brickell.\r\n\r\nI took my non-believer friend to it, because he likes MercyMe, and has enjoyed Bart's testimonies whenever I've taken him to a concert, and he liked the movie as well. He even teared up, and he is NOT an emotional guy! I cried too, but I'm an emotional girl! 😉\r\n\r\nI definitely recommend it. I'm not a person who enjoys going to the movie theater, and usually will only go in special circumstances. I think mainstream America playing a Christian movie in the theater is a special circumstance, and if you want to see more of this happening, I hope you'll go support it.", "created_at": "2018-03-18T15:24:04.119Z"}, {"movie_id": 470878, "review_id": "5ad8693bc3a368718901150e", "author_rating": null, "review_text": "\"Though it will never be championed as an insightful work of either religious art or patriarchal psychology, I Can Only Imagine does manage to be a good film about a great song...\"\r\n \r\nRead the full review here: http://screen-space.squarespace.com/reviews/2018/3/23/i-can-only-imagine.html", "created_at": "2018-04-19T10:02:35.533Z"}, {"movie_id": 470878, "review_id": "5c6a24129251412a74fd2dae", "author_rating": 6.0, "review_text": "***The story behind the popular Christian band***  \r\n\r\nReleased in 2018, “I Can Only Imagine” is a biopic of Bart Millard (J. Michael Finley) of MercyMe, spanning his childhood, the abuse of his father (Dennis Quaid), meeting his true love (Madeline Carroll), starting the band, low-rent touring, acquiring a manager (Trace Adkins) and eventual success with the band’s titular hit.\r\n\r\nWhile this semi-modest inspirational flick is nowhere near as good as “Coal Miner’s Daughter” (1980) or even “La Bamba” (1987), it’s almost on par with the Johnny Cash biopic “Walk the Line” (2005), although it cost five times LESS and lacks the polish. Finley is an otherwise unknown actor, but he makes for a fine protagonist. And Carroll is winsome and curvy; unfortunately, her part is small.\r\n\r\nIt’s too by-the-numbers, but I could relate to the father/son issues and the story builds to an inspiring and emotional performance of their hit song.\r\n\r\nThe film runs 1 hour, 50 minutes and was shot entirely in Oklahoma.\r\n\r\nGRADE: B-/C+", "created_at": "2019-02-18T03:18:42.077Z"}]