[{"movie_id": 51333, "review_id": "62020844f706de006e3a6ab1", "author_rating": 5.0, "review_text": "By the year 2000, Kenneth Branagh had an admirable film career.  Especially noteworthy are the 3 films that he adapted from Shakespeare plays. After his most ambitious, **HAMLET**, he focused on more acting roles and didn't step behind the camera until he produced **LOVES LABOUR'S LOST**. It pains me to say that the resulting film is audacious and sometimes mind-numbingly awkward.  This review will personally serve me as I try to understand this effort.\r\n\r\nThis was the first film top be created under the new _SHAKESPEARE FILM COMPANY_.  It is likely obscure to most viewers as it survived only through two films, **LOVES LABOURS LOST** and the markedly better **AS YOU LIKE IT**. My guess is that the new film company was going to tackle more frequent Shakespeare stories that were already less popular and not as epic as **HAMLET** or **HENRY V**.  And many of those lesser known stories contain stuff that just doesn't translate well to modern audiences.  Maybe this new company can approach the stories with a more experimental approach?\r\n\r\n**LOVES LABOUR'S LOST** is certainly experimental and the results are scattered.  Most obviously, Branagh took a 3 and a half hour play and trimmed it to an hour and a half, of which half an hour of it was pre-existing song standards.  It seems the objective was to call to mind the musicals of the golden age of Hollywood.  But the casting didn't require singing and dancing, so it often feels like we are being duped.\r\n\r\nWhat remains of the stage play makes for some excellent fun.  Branagh knew what to leave in and what to excise. Nathan Lane and Adrian Lester join some of Branagh's frequent film collaborators.  They are right there, bringing some professionality to the beautiful but otherwise sufficient casting.  But the young Alicia Silverstone really shows her socks while trying to carry the important role of the visiting queen.\r\n\r\nSome of the musical numbers work to a point, some make you long for the films they emulate, and a couple are downright creepy - like the erotic _FACE THE MUSIC AND DANCE_.  It tries to capture the sexy party environment of **MUCH ADO ABOUT NOTHING**, but fails.\r\n\r\nI maintain that much of the story struggles come straight from Will Shakespeare himself... The largest example - the happy ending interrupted by news that the queens father has died so she has to postpone all of their new relationships for one year of mourning.  It seems a strange conceit, and Branagh tries to address it by have all 4 of his male stars go off to war, and they can all be reunited when the war has ended.  In my opinion this was just as weird a solution.\r\n\r\nI remain an ardent Branagh film, but to date, this is his least re-watchable film.", "created_at": "2022-02-08T06:05:56.807Z"}]