[{"movie_id": 282631, "review_id": "55e74e3fc3a368377c00073f", "author_rating": 8.0, "review_text": "> At war, it's not all about the manpower, but strategy.\r\n\r\nThe highest domestic box office ever as well as internationally as a Korean movie. Based on the naval wars of Japanese invasion of Korea that took place in the last decade of the 1500s. The battle was fought for six long years, but this film focuses only the final one called 'Battle of Myeongnyang' in the year 1597. The famous face from the Korean filmdom, Choi Min-sik can be seen in the title role. For the international market, he was badly needed than the role wanted him. But I don't say that, he was amazing as always, like the character was specially created for him.\r\n\r\nAs an important historical subject of the Korea, it was a very carefully made flick. But the product was more commercialised than being practical, especially in the battle scenes. You can't expect logic and accurate historical account, but entertainment is promised as the film's main intention. Awesome visuals, but as I said lacks the reality. Not a bad film either, because a very much acceptable for having interesting tiny bits in the battle. The first half was more a drama and as we are viewers, there is a chance to lose the focus. Barely generates any interest, kind of a setback to the movie. Not even the character constructive was handled that better in those sections where it should have been.\r\n\r\nExactly after the first hour the pace picks up as the war commenced. Then it was a non-stop action, one must buckle up his seat belt for onwards to enjoy. Mostly never seen before style, because it was exhibited in the Korean style of a sea battle. It involves some kind of oceanography like the second half of the title say, 'Roaring Currents'. But not in a theoretical calculation rather a practical by observing the pattern and executing the plans like any old civilization was doing in any field. In one of the dialogue, the admiral uses the word 'virus' about fears spreading among his men. I don't think so the virus was discovered not before the late 19th century.\r\n\r\n> \"Fear does not discriminate,\r\n> it can equally affect our enemy.\"\r\n\r\nIt may be a Korean answer to the '300: Rise of an Empire'. There are no similarities, one is a fictional war and the other one is a biographical war film, but deals on the same theme. Especially when the hundreds of soldiers fight against the thousands, definitely reminds '300'. Actually, it was 12 Korean warships against the 330 Japanese fleets. There are so many characters, the editing was much better to give space for everyone to show their parts in this 2 long hour run. The music was equally matched to the visuals. It includes some emotional segments too, but not the appealing one like you are going to have tears rather the narration demanded it and it worked.\r\n\r\nIn the last two decades, Korean filmmakers going after the untouched territories and their success were inevitable. The quality of graphics in the world cinema is the revolution. Something is sure that now it does not belong to Hollywood alone. Because of this technology the world cinemas can compete with Hollywood. When I was a kid, my frequent question was 'why its so gloomy?'. The one thing I liked in this film was they were not afraid to create the battleground (atmosphere in the sea) in the daylight. You can see sunshine, shadows as well as gloomy as the clouds passing by. This film was a spectacular piece, that does not mean I said it a masterpiece. Like I always say, knowing/learning history through the films are easier than the textbooks. Hope there is a part 2, seems I want one.\r\n\r\n8/10", "created_at": "2015-09-02T19:30:07.136Z"}]