[{"movie_id": 9472, "review_id": "5f614fbb706b9f00370ad0ba", "author_rating": 8.0, "review_text": "Really good watch, could watch again, and can recommend.\r\n\r\nI forgot how well this movie holds up.  Now, I'm not a fan of Vince Vaughn or Ben Stiller (most of the time), but, being objective, this is a pretty funny movie with a good plot to it.  It has problems besides casting, but most of those are over in a blink and we're back to the movie.\r\n\r\nThis is a movie that leans on ridiculous humor, and everyone pretty much stays in their lane with quirks and motivations, and while the abuse humor of Justin Long pushes my boundaries of entertainment, Vaughn's lazy character work breaks it.  I'd say it was a problem with the writing, but the delivery is sloppy even for someone playing a lazy character: the character is someone who knows what needs to get done and can't be bothered to do work, not someone who is too lazy to do what he can do.  \r\n\r\nBen Stiller is over the top, but that's a combination of how the character is written and Stiller's delivery: I clearly don't like the character concept, but without him being an overly nice / secretly evil guy, I'm don't have a real suggestion there.\r\n\r\nI'm sure you can make similar arguments for any given character, but the movie is actually so well produced, overall well written, and the performances are funny enough to distract from \"problems\" that if you just relax and watch this movie, you'll probably be laughing all the way up to \"My Milkshake By's All the Boys to the Yard\".", "created_at": "2020-09-15T23:35:23.113Z"}, {"movie_id": 9472, "review_id": "6379bac25b2f47007fd6bdb1", "author_rating": 9.0, "review_text": "**Dodgeball knows it’s a ludicrous nonsensical laugh fest and embraces all its ridiculous charm to become one of the best sports comedies of all time.**\r\n\r\nDodgeball is one of the funniest, most outrageous movies in existence and is one of my favorite comedies (and sports movies?) of all time! This movie just had every actor in their sweet spot. White Goodman is peak Ben Stiller. Vaughn, Long, and Taylor each feel at home in their roles, and Alan Tudyk’s Steve the Pirate steals the scene every time. Each and every moment of this movie is zany, goofy, and insane, making Dodgeball a quintessential 2000s comedy. Dodgeball gifts the world with hilarious lines to be quoted repeatedly, Chuck Norris gifs, and laughs that keep going long after the movie ends. Plenty of people might disagree, but Dodgeball will forever be one of the best movies of the 2000s and maybe eternity… ok, let’s stick with the 2000s.", "created_at": "2022-11-20T05:27:30.794Z"}]