[{"movie_id": 11152, "review_id": "5b3c416392514102e2004a85", "author_rating": 8.0, "review_text": "***Horror adventure in the Mayan jungle***\r\n\r\nRELEASED IN 2008 and directed by Carter Smith based on Scott B. Smith’s novel, \"The Ruins\" refuses to make the mistake of too many conventional horror flicks by NOT going over-the-top with the situation, the \"monster\" or the horrific thrills; films that do so are usually more goofy than horrifying. Take the ending of \"The Ruins,” which is different than the book and, in my opinion, better: In a typical horror movie there would've been a wild (i.e. thrilling but totally unbelievable) vehicle pursuit by the Mayans; not here. It's the BELIEVABILITY of \"The Ruins\" that makes it effective, which is reinforced by the acting of the five protagonists.\r\n\r\nSpeaking of whom, the main cast consists of Jonathan Tucker as Jeff, Laura Ramsey as Stacy, Jena Malone as Amy, Shawn Ashmore as Eric and Joe Anderson as Mathias, the German. The two girls and Tucker (Jeff) especially stand out. I found these protagonists likable and fairly fleshed-out for a 90-minute horror flick. For one, they're not the typical frat trash you see in so many horror flicks. Secondly, we see signs of character again and again, which I detail below.\r\n\r\nCritics complain that the antagonists are decidedly un-scary, but that's one of the main points of the movie. Like 1963's \"The Birds,\" it takes something we see every day and are NOT scared of and turns it/them into a source of horror.\r\n\r\nOne memorable scene is when Stacy and Amy are in the dark bowels of the pyramid searching for a cell phone they keep hearing. What they discover is equal parts shocking, surreal and amazing (more on this below). Another memorable sequence is when Jeff & Eric are forced to perform a gruesome operation. The climax is also well-done and suspenseful.\r\n\r\nWhile the story takes place on the Yucatán Peninsula, Mexico, it was surprisingly shot at Gold Coast and Tamborine Mountain, Australia, just south of Brisbane, which is on the East coast. In any case, the locations are spectacular.\r\n\r\nBOTTOM LINE: \"The Ruins\" surprised me in light of the inexplicable mediocre ratings and incessant panning. It's an adventure story mixed with psychological horror utilizing something common and un-scary as the \"monster.\" It features quality gore, excellent locations & props, quality performances and proficient filmmaking in general. Plus it takes advantage of the presence of Laura Ramsey and eschews the overdone cartoony-ness of too many horror flicks, which are more funny than creepy or horrifying. In other words, \"The Ruins\" delivers the goods.\r\n\r\nThe theatrical version runs 90 minutes and the unrated version 93 minutes. I viewed the latter.\r\n\r\nGRADE: B+/A-\r\n\r\n***SPOILER ALERT*** (Don't read further unless you've seen the film)\r\n\r\nThe plants that live on the pyramid and what they are able to do spur a fascinating point: The animal kingdom spans the spectrum of worms to human beings. What about plant life? The plants at the Mayan ruins are obviously from the higher-developed end of the plant kingdom – they work as a team to obtain sustenance and are able to mimic sounds, like human voices and the ringtone of a cell phone.\r\n\r\nI've heard complaints about how the protagonists constantly make the wrong decisions. Answer: The foursome had befriended Mathias and therefore trusted him. They wanted to experience some Mayan history off the beaten track. When the Natives suddenly arrive on the scene and brutally shoot one of their members in the head the only place for them to safely flee is the pyramid. At that point they're stranded because the Natives have the ruins surrounded. How is any of this a wrong decision?\r\n\r\nSomeone complained that the youths never attempt to escape the pyramid until it is basically too late, which supposedly defies logic. Answer: They're only on the pyramid for two nights and were waiting for help to arrive. Their only other recourse was to make a run for the jungle, which was impossible because the pyramid was surrounded by Natives with deadly weapons who already proved they would kill without mercy anyone infected by the plants. As such, the most logical thing to do was to wait for help and only make a run for it (to the jungle) if they absolutely had to, which is what happens. It sounds logical to me.\r\n\r\nAnother criticism is that the protagonists are imbeciles with little character development. I found them likable, as noted above, and there are numerous examples of character: They desire to experience the culture of the area and not just utilize their exotic vacation to party, like the average one-dimensional spring-breakers. Also, they refuse to leave Mathias for dead in the pyramid and the girls risk going down the same dubious rope that resulted in his fall. Moreover, Jeff insists on performing the gruesome task of cutting off Mathias' legs and Eric agrees to help even while the primitive operation causes him to vomit. Lastly, Jeff willingly sacrifices himself so that Amy has a chance to escape and she makes a bold dash for freedom. All this sounds like character to me.\r\n\r\nNeedless to say, the criticisms leveled at the film are mostly invalid or easily explained.", "created_at": "2018-07-04T03:39:15.058Z"}]