[{"movie_id": 44977, "review_id": "5beef314c3a36818a301cf19", "author_rating": null, "review_text": "Dhoom 3 is the third of the well acclaimed blockbuster \"Dhoom\" action series. The movie stars renowned Bollywood stars Aamir Khan and Abhishek Bachchan in a legendary battle between a vigilante and a no-nonsense policeman. The film opens in the 1990’s to a show known as The Great Indian Circus. The show starred flashy dancers, dangerous stunts and most importantly a young magician established as the Iqbal Khan’s (the owner) son Sahir.  The show was under a great deal of pressure from its lender as it was unable to make payments on its loan.  Per the banker’s demand, the show was ordered to be shut down and Iqbal Khan committed suicide immediately.\r\n\tThe film then fast forwards to present day, Sahir (Aamir Khan) is an adult and has formulated a plot to avenge his father’s death by planning and executing robberies against the bank that once closed his father’s circus. After one robbery, ACP Jai Dixit (Abhishek Bachchan) is summoned on the case. After a case of cat and mouse, epic chase scenes, and another robbery Jai learns the truth behind Sahir’s robberies. An epic plot twist reveals that Sahir is actually a twin to his autistic brother Samar which explains the inherit “magic” behind Sahir’s avoiding the police during the chase. Undercover police work and a fifteen minute police chase later the film fittingly ends when Sahir and Samar apparently commit suicide by jumping off a bridge much like their father did. The film lives up to the hype led by the precursor movies in the series, giving the viewers epic action scenes, major plot twists and countless dance numbers that Bollywood film patrons love so much. \r\n   This action film has same intrinsic values and plot as the iconic film Deewaar. The motives of both Sahir and Vijay can be ascribed to the underlying resentment and anger of  young men, or the proverbial “angry young man” made so famous by Deewar’s leading man, Amitabh Bachchan. The young men both took it upon themselves to seek their own justice against what they deemed was unfair and unjust to their family. Both films stress the increased importance on family values that one would see in any other typical megahit Bollywood film. The basic plot of Dhoom 3 is the revenge of the twin sons against the bank for being the cause of their father's death, albeit indirectly.  In Deewaar, Vijay’s father is victimized by a corrupt businessman and leaves town, leaving the family to fend for themselves, and Vijay spends his formative teen years and early adulthood fighting for his rights.  The impact of the victimization of the fathers on the children was evident in both films. The endings are also both inherently tragic as both angry young men die in pursuit of their own justices because they operated outside the law. Historically, in Bollywood rivalries and traditions are multi-generational and these two movies are no exceptions. “[Vijay]… unlike hard core villains, values family relationships… he is an exemplary older brother (as a child he worked so hard so that his brother could be educated” (Thomas). In both films the villain is not one true villain but rather someone who is fighting for their own justice having experienced one in the past. “… he [Vijay] is also good enough to be the focal hero” (Thomas). This runs a direct parallel to Sahir as the triumph of the law (Abhishek Bachchan) over the criminal (Aamir Khan), even if the crime is strangely understandable and maybe justifiable.  There have been rumors of Dhoom 4 and a potential leading villain role of Shah Rukh Khan as well.  We will just have to wait and see.", "created_at": "2018-11-16T16:40:52.514Z"}]