[{"movie_id": 7551, "review_id": "5cd07987c3a368472dd9a796", "author_rating": 7.0, "review_text": "***Denzel Washington tries to deter a terrorist attack upon looking back in time***\r\n\r\nAfter a terrorist explosion of a ferry in New Orleans, an ATF agent (Denzel Washington) joins an experimental FBI surveillance unit that uses space-folding technology to find the culprit and maybe even avert the disaster. While looking in the past he starts to fall for a notable victim of the tragedy (Paula Patton). Val Kilmer plays the head FBI agent and Jim Caviezel the antagonist. Adam Goldberg is on hand as a tech geek.\r\n\r\nWhile watching \"Deja Vu\" (2006) I couldn’t help thinking of “Enemy of the State” (1998) because of the kinetic editing and advanced surveillance technology. Turns out they were made by the same director, Tony Scott, Ridley Scott’s brother, who unfortunately jumped off a bridge in Los Angeles in 2012, ending his life at 68 years-old. (Ridley claimed it was due to his secret struggles with cancer while others say it was due to two antidepressants known to cause suicidal thoughts or paranoid ideation). \r\n\r\n“Deja Vu” is good, especially the compelling last act. Although it may not be as great as “Enemy of the State,” the filmmaking expertise is off the charts, particularly in regards to the depictions of surveillance technology. It’s mind-boggling to think of the effort that was put into making everything gel and dynamically move along without confusing the viewer. However, it admittedly does get a little convoluted in the second act with the experimental observation equipment, which culminates with a thrilling-but-highly-unbelievable past/present car-chase sequence.      \r\n\r\nAnother problem, a minor one, is the revelation of the terrorist, which brings to mind someone like the infamous Timothy McVeigh. Never mind that 99% of the terrorist attacks the world over are by radical Islamists (e.g. 9/11, Orlando, San Bernardino, Chattanooga, Fort Hood, Boston Marathon, Paris, Nice, etc.). Shh, don’t tell anyone.    \r\n\r\nThe film runs 2 hours, 6 minutes and was shot in New Orleans.\r\n\r\nGRADE: B", "created_at": "2019-05-06T18:14:31.039Z"}, {"movie_id": 7551, "review_id": "5fe6dbd0c49048003f1638b3", "author_rating": 7.0, "review_text": "Pacing could've been better but still an effective sci-fi thriller thanks to Denzel Washington's charisma carrying over the finish line. Even though this was my third viewing, first time in at least a decade, my feelings and rating remains the same. **3.5/5**", "created_at": "2020-12-26T06:44:32.552Z"}]