[{"movie_id": 324668, "review_id": "579cf601925141066e000c65", "author_rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\n**LOUISA SAYS:**\r\n\r\n“Jason Bourne” is a spy movie for imbeciles. The entire film feels like it’s written using nothing more than the vocabulary of a 12 year old and consists of two very tiring hours of repetition. Bourne gets chased, throws some punches, and gets away. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Shoot, bleed, run, escape. Repeat to infinity.\r\n\r\nI actually felt bad for the actors having to deliver such dreadful dialogue; their onscreen characters literally describe everything that’s happening as it unfolds (“It’s Bourne!” and “I’m going to shoot!” and “He’s running upstairs!” and “The files are downloaded!”). At some point it started to get funny.\r\n\r\nMatt Damon is back as Jason Bourne and it feels like he’s sleepwalking through the entire movie. Even the talented Alicia Vikander phones in her questionable performance (is she supposed to have an accent or not?) and Tommy Lee Jones plays yet another scowling caricature of a sinister government official. There’s little in the way of character development and the only actor who’s enjoyable here is franchise veteran Julia Stiles. What a pity that she’s not given much to do.\r\n\r\nEven the action sequences are inexcusably incoherent. Paul Greengrass is one of my least favorite directors, mainly because he loves that fast cutting junk where I can’t tell what is going on in the movie. It’s a filmmaking style for those with short attention spans and it’s a sign of extreme laziness.\r\n\r\nGreengrass sucks all the fun out of what should’ve been a spectacular car chase down the Las Vegas strip. Instead of taking his time and showing off the pageantry of stunt driving with a steady hand (see the legendary cinematic car chases in Quentin Tarantino’s “Death Proof,” William Friedkin’s “The French Connection,” Peter Yates’ “Bullit,” Justin Lin’s “Fast Five,” or hell, even Michael Bay’s “Bad Boys II“), Greengrass once again opts for the lazy way out and gives us a messy commotion of three second snippets that seem to be edited together in a blender on the high setting.\r\n\r\nNone of the elements work: the film covers no new ground, it lacks any energy, and it simply feels tired, making “Jason Bourne” the lamest of all in the series.\r\n\r\n**MATT SAYS:**\r\n\r\n“Conversation” with 5-word sentences using spy and techno-jargon. Quick cut to person typing on computer: Beep, boop, beep. Quick cut to shaky cam conversation. Another five-word-sentence conversation and more shaky cam. Cut to shaky-cam motorcycle chase with no sense of geography. Cut back to computer.\r\n\r\nCut, cut, cut. Shaky cam, shaky cam, shaky cam. “Jason Bourne” might as well have been shot and assembled by a seven-year-old with ADD that hasn’t taken his Ritalin. It wasn’t so much edited as jammed together. So little artistry went into making this movie that it’s hard to even call Paul Greengrass its “director.”\r\n\r\nOne of my recurring rants is on the use of quick cutting and shaky cams in action films: it’s the hallmark of lazy filmmaking. When your action sequences are constructed by using cut after cut after cut, you don’t have to worry about storyboarding (contrast “The Raid: Redemption“). You don’t need actors who have any training in fight choreography (contrast “The Raid 2“). You don’t have to concern yourself with geography or spatial relationships. In other words, instead of having to WORK at creating a compelling action sequence, you can hack your way through it. And boy, there is NO ONE working in film now that loves hack action better than Paul Greengrass. And nowhere has Greengrass’s hackiness been on display more than in “Jason Bourne.” It’s his masterpiece of hacketry. I can continue making up new word forms using “hack” to describe this movie and director, but I think you get the idea.\r\n\r\nIn addition to the bad direction and editing, “Jason Bourne” stinks because it’s a poor excuse for a spy thriller. We are subjected to scene after scene of dreadful acting. Julia Stiles (Nicky Parsons) is the worst of the lot, but Matt Damon (Jason Bourne), Alicia Vikander (Heather Lee) and Tommy Lee Jones (Director Dewey) are only marginally better. The script is abysmal, with the characters not so much dialoguing with one another as speaking spy techno-jargon while they type on computers that are constantly beep-bloop-bleeping (no computer I’ve ever used makes so many noises when scanning files). Using words that sound cool does not make a scene interesting. And the plot? It’s barely even there.\r\n\r\nI found only three things enjoyable about this movie. The very first fight scene between Bourne and some nameless guy — the one you see in the trailer. The story thread featuring the Silicon Valley billionaire that refused to screw over the public in the name of national security. And the final vehicular chase scene down Las Vegas Boulevard — which I liked in spite of the terrible editing (which, incidentally, got the geography of the Strip all wrong).\r\n\r\nPlease don’t make this movie a hit, because then we will get lots of imitators (like we did after “The Bourne Supremacy” and “The Bourne Ultimatum“, when quick cuts and shaky cam were used in 95% of all action pictures).\r\n\r\nDemand more for your money. There are so many movies that do it better than this one. Do you want an engaging, twisty techno-spy thriller? Check out the “Mission Impossible” series. Do you want a well-written story of international espionage and intrigue? See “Our Kind of Traitor.” Do you want well-choreographed fight sequences? Watch “The Raid” movies. Hell, even this summer’s “Warcraft” did a better job with its fights and action that this film.\r\n\r\n**A SCREEN ZEALOTS REVIEW www.screenzealots.com**", "created_at": "2016-07-30T18:46:25.804Z"}, {"movie_id": 324668, "review_id": "584469a4925141676400c7b0", "author_rating": 6.0, "review_text": "**New officials, new operations at agency, but the same old Bourne!**\r\n\r\nI thought the original films are meant to be a trilogy, but when filmmakers saw money, they went ahead with the fourth in a new direction. So now with this, it has returned to the original storyline. The Jason Bourne, whose quest to find the answers was over. Yet, a new chapter begins with this like another trilogy is on making like the 'Star Wars' with a new storyline and adventures.\r\n\r\nStill the theme remains the same, like running and chasing. So the story was just a one or two liner. But if you like the action sequences, this has got plenty of them to entertain you. That's should be a main reason, if you want to see it, other than that the film was average kind. Matt Damon's return for the title role was the best thing happened in here with the director of 'Supremecy' and 'Ultimatum'.\r\n\r\nI think Alicia Vikander's role is yet to exploit and that would be in the next two films. Looks like an interesting combo between her and Matt, so waiting for the official news. The same formula for this is what disappointing, though not a bad flick. After all, that's how we know Bourne series. So go for it if you are up to date with this franchise, because there's going to be at least another two films if my guess is right.\r\n\r\n_6/10_", "created_at": "2016-12-04T19:08:20.065Z"}]