[{"movie_id": 766475, "review_id": "631e59861ac292007f0fac27", "author_rating": 7.0, "review_text": "Sam Rockwell and Saoirse Ronan gel really well together in this rather entertaining spoof of all thing Agatha Christie. The latter is the newbie constable \"Stalker\" - an enthusiastic young woman who is saddled on the experienced, gin-loving, inspector \"Stoppard\" when the pretty unlikeable film director \"Köpernick\" (Adrien Brody) is beaten to death with a sewing machine! It turns out that he had just been engaged to direct a big screen version of the legendary \"Mousetrap\" play that had just celebrated it's hundredth performance at London's Ambassador's Theatre. What now ensues is a really engaging whodunit with flashbacks galore as the two police officers have to learn to trust each other as well as to handle the high drama amongst a cast of thespians, an avaricious producer and, of course, a publicity seeking police Commissioner. Rockwell delivers strongly as the rather laconic and disillusioned officer (he reminded me a little of Johnny Depp's \"Abberline\" in \"From Hell\" from back in 2001) and Ronan brings plenty of amusement (and courage) to her role as his aspirational sidekick who is always jumping to conclusions. As ever with Christie stories, you just know that the perpetrator of the crime is going to be the least important character so there's not oodles of jeopardy here, but it ends well with all assembled in a creaking stately home where it all ultimately falls to the author - \"Moaning Myrtle\" herself - to solve her own mystery. Tom George has assembled a decent supporting cast with both Harris Dickinson quite effective as a rather effete Richard Attenborough and Ruth Wilson as the shrewd theatre producer \"Petula\" and they help to deliver a pace and humour that is enjoyably amiable for just over ninety minutes. I've sat in the Ivy restaurant opposite this theatre for many a year but have never actually seen the play. A bit like with this film, you mustn't disclose the ending or maybe you'll be next... Good fun!", "created_at": "2022-09-11T21:56:22.142Z"}, {"movie_id": 766475, "review_id": "63b2412ea9117f05c4240f1d", "author_rating": 6.0, "review_text": "See How They Run meddles through its runtime in mediocrity until the final 20 minutes (which are fantastic!). Not horrible overall, but not worth a repeat.\r\n\r\nSee How They Run lagged along for about the first hour of the movie but really picked up and entertained in the final act. Saoirse Ronan's performance brought some charm to a fairly bland film. There were hidden jokes and puns throughout that, if caught, would give you a chuckle, but overall this campy whodunit failed to amuse. While the majority of the film was disappointing, the film's climax and resolution delighted with funny drama, meta plot twists, and even a breaking of the fourth wall. I would have loved it if the rest of the movie had been as good as the ending. But it made me endure the slow first hour and fifteen minutes before I was rewarded with its clever wrap-up. I can't recommend it, but I can't say it's terrible.", "created_at": "2023-01-02T02:27:58.110Z"}]