[{"movie_id": 300693, "review_id": "57d30d11925141548d0008bc", "author_rating": 8.0, "review_text": "**When journalism becomes limbless!**\r\n\r\nA surprisingly good film, you can compare it with the Oscar winner 'Spotlight'. But it was not popular as that one, because it was about the American politics, so seems the world did not care much. However, going down in the domestic market was a very sad. It was directed by the newcomer and he did a wonderful job, even for penning a good screenplay. But it was based on the memoir by Mary Mapes called 'Truth and Duty'.\r\n\r\nIt's a journalism theme, sets in during the months before the 2004 presidential election. It was focused on the CBS's famous news series '60 Minutes Wednesday' where its episodes reveals some of the copy documents how George W. Bush altered them get into the military in the 80s. Soon the producer to the host, everyone who involved in that show receive a backlash. In the remaining parts, it aims to disclose how the claimer decides to fight the issue and would they succeed?\r\n\r\nCate Blanchett was never attracted to me, but I never doubted her performances. So in this, she was amazing and quite physically looked beautiful. One of her great character display, and it should have nominated for the various awards, but I don't understand why it was discarded totally. The other actors too were awesome, Especially Robert Redford was superb as a news anchor. He's a bit old, otherwise I would have expected him to play Don Trump in a movie, maybe a biopic or comedy.\r\n\r\nLike the film revealed what happened to Mapes, I think those invisible and powerful men made this film does not get into the spotlight. But as I've seen, I say it's a must see film of the year, if you're interested in the US and its politics. How the story ends is sad, but I've seen other journalism films that highlights their strength, whereas this one was opposite. I loved the lines Cate delivered at one of the final scenes. I hope you watch it at least after reading my review.\r\n\r\n8/10", "created_at": "2016-09-09T19:27:13.609Z"}]