[{"movie_id": 666277, "review_id": "6484f5b1d2b209010c193369", "author_rating": 4.0, "review_text": "As the son of parents who were childhood sweethearts/soul mates, I tend to be a sucker for movie romances that address this subject. In this case, however, the only “sucker” aspect applies to the money I plunked down to watch this two-hour snoozefest. Writer-director Celine Song’s debut feature has been praised as a masterful piece of filmmaking and one of the best pictures of 2023, but I heartily beg to disagree. When a pair of young, tightly knit Korean friends, Nora (Greta Lee) and Hae Sung (Teo Yoo), part ways from their native Seoul and are later reunited in New York after a 24-year separation, the reunion of these childhood pals provides them with an opportunity to reflect on what might have been. However, their time together consists mostly of a series of overly bloated pregnant pauses, inane dialogue and missed chances to discuss much of anything meaningful, the kinds of scenes that make even the most patient viewers want to yell “Get on with it already!” These “conversations” come nowhere close to matching their joy of their spirited youthful interactions or the heartfelt, substantive talks that later take place between Nora and her husband, Arthur (John Magaro). The result is, quite frankly, a big fat bore that’s trying to be more than it is but never achieves that outcome. Perhaps the biggest problem with this is the film’s truly sincere but decidedly paper thin narrative that doesn’t have the writing support to bring it all into beautiful full bloom, despite some fine performances, exquisite cinematography and an emotive background score. From this, the director would appear to have a hefty reserve of potential stashed away, at least based on this offering’s stylistic elements, but the substance could use some definite shoring up. Let’s hope her next effort lives up to that.", "created_at": "2023-06-10T22:14:09.873Z"}, {"movie_id": 666277, "review_id": "64e9848c1feac100c46eb01a", "author_rating": 9.0, "review_text": "Wow. For a director, Celine Song, just coming out of the gate, this is quite an impressive film. The lead actress, Greta Lee, fit the role like a soft leather glove, which speaks volumes, both for her talent, and for Song's casting. Lee's Hollywood Critics Association Best Actress award is well-deserved.\r\n\r\nSong wrote an excellent screenplay, and her direction turned it into a stunning film. Kudos to A24 for taking a chance on her. I presume they are happy with the outcome. It's rather interestingly paced in a Buddhist or Asian kind of way - slow, meditative, and more is shown than is said. Overall, it's not a perfect film, but it's close.\r\n\r\nThis isn't precisely a coming-of-age movie, but the plot revolves around that (perhaps even more difficult,) developing period between the ages of 20 and mid-30s. I've held a long-standing belief that our life chapters change every seven years. You know: there are seven chakras, seven days in a week, the Seven Sisters (Pleiades), or whichever mystical seven you'd like. Over the course of three of these \"theoretical\" chapters, this movie focuses on two relationships in the protagonist's life, from roughly twenty-one (7*3) to approximately forty-two (7*6). She was married at about the time of a chapter shift (7*5), as if to validate my weird belief. In my world, it all makes sense.\r\n\r\n\r\nThis movie is certainly somewhat autobiographical, even by Song's own admission. It will be added to my Directors About Themselves list. I can't wait to see Celine's next project!", "created_at": "2023-08-26T04:50:20.883Z"}, {"movie_id": 666277, "review_id": "65352740c8a5ac00e2b73e59", "author_rating": 7.0, "review_text": "\"Na Young\" (Moon Seung-ah) and her best pal \"Hae Sung\" (Leem Seung-min) are pretty much joined at the hip at school. They do everything together. That is, until her family decide that they are going to emigrate to Canada. The young lad is a bit bereft, he doesn't really understand and he certainly doesn't approve! Anyway, off they go and after quite an hiatus, she discovers that he had tried to get in touch previously and so she now gets in contact. Now called \"Nora\" (and played by Greta Lee), she has married \"Arthur\" (John Magaro) and moved to NYC, but as they continue to chat online they gradually rebuild their friendship so that a visit from Korea to the USA seems the natural next step. What now ensues are a poignantly constructed series of reminiscences that extol the virtues and innocence of their childhoods but also illustrate how different they have become - even while the underlying bedrock of her relationship with him (and, for that matter with her husband) is probably just as solid - though not in quite the same way. There's a bit of pining, a bit of regret - but the film also fairly optimistically looks at where their lives have got to, and also of where their lives have yet to go. The acting isn't really much to write home about, though Magaro delivers well as the gooseberry. He doesn't speak much Korean and so the chats with their visitor frequently leave him in a sort of nervous, but polite, limbo. There are a few films around just now that focus on reconciliation of those separated by migration when South East Asia was still recovering from post war/French colonial rule - and this one is certainly one of the more interesting and honest. It's not without the odd bit of humour either - and is well worth a gander.", "created_at": "2023-10-22T13:44:32.405Z"}]