[{"movie_id": 498743, "review_id": "5d6706bab5bc21000e6f10c3", "author_rating": 5.0, "review_text": "Middling western-drama that has some okay moments but nothing really stands out, including the acting from both Hirsch an Cusack (who does seem to sleepwalk through his role, however). IDK, didn't at all hate it but kind of confused on the messaging, guess it was good for the town to be run by a tyrannical Christian priest?", "created_at": "2019-08-28T22:56:58.130Z"}, {"movie_id": 498743, "review_id": "5d967b16ea426328929380ca", "author_rating": 7.0, "review_text": "**_Ugly, bleak, gritty, and enjoyable_**\r\n\r\n> _The idea was to write a western that would work as a genre film, but which would also comment on the founding of America and what that really meant (and thus, hopefully, commenting on the America of today). The film opens with a burnt American flag, so it touches on subjects such as the genocide of the Native Americans, xenophobia, the oppression and exploitation of women, the law of the \"wild west\" and capital punishment. My main inspiration when writing were the frontier photographs from the 1850s onwards. The hardship on the people's faces was_ _startlingly apparent, and when you listen to the hynms they sang at the time, they are about hardship, the misery of life, and how life will be better on the other side, in Heaven. It is a very sobering and moving view of the founding of America, and of the immigrant experience. I tried to get some of that into the film, as well as paying homage to the westerns I loved as a child._\r\n\r\n- Ivan Kavanagh; \"Ivan Kavanagh: Director of _Never Grow Old_\" (Davide Abbatescianni); _Cineuropa_ (March 15, 2019)\r\n\r\nI guarantee you've seen this story before – a good man who either abhors or has renounced violence forced to take up arms so as to protect the innocent from a villain. You can find it deployed in westerns such as John Ford's _The Man Who Shot Liberty Valance_ (1962), Vincent McEveety's _Firecreek_ (1968), and Clint Eastwood's _The Outlaw Josey Wales_ (1976), and in genre films as varied as Michael Mann's _Collateral_ (2004), James Wan's _Death Sentence_ (2007), and Sylvester Stallone's _Rambo_ (2008). Filmed in Connemara, Ireland (standing in for Oregon), this third feature from writer/director Ivan Kavanagh (_Tin Can Man_; _The Canal_) is the latest to roll out that narrative template. And really, there are next to no surprises in _Never Grow Old_ - chances are everything you think is going to happen does happen. However, this isn't really a criticism. The film wears its predictability like a badge of honour, and Kavanagh is obviously a huge fan of violent revisionist westerns such as Sam Peckinpah's _The Wild Bunch_ (1969) and S. Craig Zahler's _Bone Tomahawk_ (2015). The script isn't going to be winning any awards for originality, but the film has been put together with undeniable craft. It's bleak, gritty, and despairing, and whilst it won't change your life, it is rather enjoyable.\r\n\r\nOregon, 1849; the town of Garlow is the last stop on the California Trail prior to reaching the Rocky Mountains. Although Sheriff Parker (Tim Ahern) is nominally in charge, Garlow is really governed by the local Methodist preacher, Pike (Danny Webb), who has forbidden alcohol, gambling, and prostitution. The town's mild-mannered undertaker, Irish immigrant Patrick Tate (Emile Hirsch with an Irish accent that wavers mid-sentence), isn't especially interested in Pike's hellfire sermons, but he converted from Catholicism because it was important to his wife, French immigrant Audrey (Déborah François). Living on the edge of town with their two children, they plan to leave Garlow at some point but are in no major rush to do so. That plan becomes complicated when three men - Christopher 'Dutch' Albert (John Cusack, having an absolute blast), Dumb Dumb (Sam Louwyck), who carries his severed tongue with him, and Sicily (Camille Piston), an Italian immigrant who doesn't speak English - roll into town looking for Bill Crabtree (Paul Ronan), who left Garlow several months prior, although his wife (Anne Coesens) and daughter Emily (Manon Capelle) are still there. Stating that Crabtree stole from him and must be killed, Dutch browbeats Tate into bringing the trio to his home and having Audrey cook for them. Seeing Pike's decrees as an opportunity, Dutch procures a group of prostitutes and reopens the town's saloon, killing anyone who crosses him. With his undertaker business thriving because of the spike in violence, Tate stays out of the situation as best he can, although Audrey is disgusted that he's prospering because of Dutch's actions. Soon, however, Tate's family will come under threat and he'll be forced to decide what he must do.\r\n\r\nIn naming the film _Never Grow Old_ (which is a generic name if ever there was one), I'm assuming Kavanagh is referencing the Southern Gospel hymn \"Where We'll Never Grow Old\" written by James Cleveland Moore, Sr. in 1914. The song is never mentioned in the film, nor is it used on the soundtrack, but the lyrics have an unmistakable thematic relevance;\r\n\r\n_I have heard of a land_\r\n\r\n_On the faraway strand_\r\n\r\n_'Tis a beautiful home of the soul_\r\n\r\n_Built by Jesus on high_\r\n\r\n_There we never shall die_\r\n\r\n_'Tis a land where we never grow old._\r\n\r\nThe idea of paradise awaiting us in the next life, specifically the notion that the afterlife will be a lot better than our earthly existence, is alluded to throughout the film, mainly by Pike, but also by Audrey, and even Tate and Dutch on occasion (although Dutch references it ironically). And it's really not too hard to imagine a better life than the one Kavanagh presents in Garlow (more on that in a moment).\r\n\r\nThematically, _Never Grow Old_ has the structure of a morality tale or a Mystery play, looking at issues such as religious hypocrisy and self-righteousness. It even takes time to briefly address the genocide of Native American people, with Pike sermonising about how the colonists saved the land from \"_savages_\". The most obvious theme, however, is greed. Tate, for example, is complicit with Dutch's violence insofar as he accepts and ignores it, even profiting indirectly because of it. Audrey is utterly disgusted with this, and she regards their newfound financial prosperity as nothing short of evil. Several of the town's more religious folk think the same thing, and there are multiple references to Tate getting his \"_30 pieces of silver_\". Indeed, a recurring motif in the film is to cut from Dutch killing someone to Tate cleaning the body to placing two coins on their eyes to closing the coffin to burying the coffin, and finally, to hiding his payment away in a tin buried in the house. When we first see the tin, there's little in it, but as the film goes on, it becomes fuller and fuller.\r\n\r\nIndeed, the film has several visual moments like this which convey thematic points _sans_ dialogue. The opening shot, for example, shows a tattered American flag hanging on a burnt building, immediately introducing the theme of violence and how life in the Americas was very different from that which was sold to so many before they arrived. In another early shot, we see Pike preaching to a packed church. Later, however, after Dutch has reopened the saloon, we again see Pike preaching, but this time to an almost empty church, which, of course, makes reference to the dwindling church attendance that we're seeing playing out today. Another heavy theme is child prostitution and a scene where a lecherous drunken old man clambers on top of a crying girl of 14 is one of the film's most arresting images, showing us just how low some men can sink. Another nice visual touch, this time in the production design by _John Leslie_ (_The Survivalist_; _Bad Day for the Cut_; _The Devil's Doorway_) is that the saloon is directly across the road from the church, symbolising the battle between these two forces (hedonism and piety) that continues to this day. \r\n\r\nIndeed, the overall aesthetic design is quite impressive. Garlow is literally a one-road town. However, this isn't the parched, dusty environment of beige, yellow, and light browns that we're all used to seeing in westerns. Rather, it's bleak and forlorn; the buildings are dark brown, almost black, the clouds hardly ever part, it rains a lot, and the road itself is nothing but mud, with the sound design by Aza Hand (_I Am Not a Serial Killer_; _Muse_; _Cardboard Gangsters_) emphasising the squelching of the characters' steps. To compound this sense of squalor, most of the film takes place at night, with cinematographer Piers McGrail (_Let Us Prey_; _Glassland_; _The Cured_) occasionally using only one practical light to illuminate an entire scene. This necessitates that characters drift in and out of the shadows, which adds an extra element of danger to Dutch and his men. The life of a European in the Americas of the 19th century wasn't easy, and one of the film's most successful elements is in showing us some of why that was.\r\n\r\nIn terms of problems, the script isn't exactly original, with every character an archetype we've seen in many other films. Additionally, the slow-burn pace will put some people off. As mentioned, Emile Hirsch joins a venerable list of actors who have completely butchered the Irish accent; everyone from Tom Cruise (_Far and Away_) to Tommy Lee Jones (_Blown Away_) to Val Kilmer (_The Ghost and the Darkness_) to Brad Pitt (_The Devil's Own_). Hirsch isn't as bad as any of these, but his tendency to drop in and out of the inflections on a word-by-word basis is distracting. Another slight issue is that towards the end of the film, Dutch starts reading from the Bible, quoting Revelation 19:17 (\"_And I saw an angel standing in the sun; and he cried with a loud voice, saying to all the fowls that fly in the midst of heaven, Come and gather yourselves together unto the supper of the great God_\"). It's more than a little on the nose, and really, a villain quoting _Revelations_ is itself a cliché.\r\n\r\nOverall, however, I enjoyed _Never Grow Old_ far more than I expected. It's bleak and gritty, rough-edged and nihilistic, but it's very well made, with some nicely conceived visual shorthand. An uncompromising look at the harshness of frontier life in the 19th century, the film suggests that stoic individualism is no substitute for a vibrant community, and is as thematically dark as it is practically dark. A morality tale in all but name, there's nothing here you haven't seen before, but Kavanagh handles the genre elements well and has made a rather enjoyable film.", "created_at": "2019-10-03T22:49:58.158Z"}]