[{"movie_id": 402897, "review_id": "5a934130c3a368250b024c96", "author_rating": null, "review_text": "An interesting, but somewhat worrying docudrama look at the United Kingdom if Comrade Corbyn ever came to power.", "created_at": "2018-02-25T23:05:20.731Z"}, {"movie_id": 402897, "review_id": "5aa2674bc3a36829a10099c7", "author_rating": 6.0, "review_text": "Pretty genuinely funny, which I was not expecting. A great one for me and my roommate with a hammer and sickle tattoo to watch together.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-03-09T10:51:55.528Z"}, {"movie_id": 402897, "review_id": "647114b08813e400e2d7a479", "author_rating": null, "review_text": "Oh, Lordy, how close were these characters to the real people?  If you want to learn how illegitimate governments use and abuse power, this is your movie.  Forget Seven Days in May, Downfall, All the President's Men, etc.  This black-hearted comedy is about the machinations of the Politburo (or whatever these cunning clowns called themselves) to carve up power at the end of the reign of the 2nd worst mass murderer of all time, Josef Stalin.  The callous disregard for the most basic respect for human life leaves one horrified, but the machine-gun delivery of snide and snark between these murderous clowns makes you squirm on the sofa.  You know who the \"good guys\" are which, in itself, shows that same disrespect for human life.  You feel conflicted because you've picked sides, and I picked Nikita Khrushchev, and not because he was played by Steve Buscemi (\"Shut up, Donnie!).\r\n\r\nIf you have no knowledge of the story of the power struggle after Uncle Joe vapor-locked and rolled to a halt, then accept that the history isn't terribly accurate, but who the hell cares?  The viewer sees the mad rush to grab, grab, and grab when the megalomaniacal monster moves on to a luxury suite in Hell.  These monsters seem human.  I'm totally sure that a black comedy about Adolph or Mao would have the same cunning sleazeballs trying to add to the world's supply of worm food.  You wouldn't shoot for a sequel.  Everything you need to know is right here.\r\n\r\nWhat I found so disturbing about TDOS was the casual nature of killing people.  Prisoners, soldiers, doctors, lawyers, NKVD leaders die with a terrified shout of \"Long live, Stalin\" and a sharp crack of a pistol.  Sometimes that seems to go on and on and on in the echoing background cells of the Kremlin.  You get used to the background noise.\r\n\r\nSo, if you have a taste for the sort of humor you might find in \"Best in Show,\" wherein one character exclaims how romantic it was to lock eyes on each other from their respective corner Starbucks, if you enjoy the feeling of being conflicted about picking good guys when everyone is saturated with Marxist evil, and/or if you like rolling back the video to find out if he or she really said THAT, then sit back and sip that vodka slowly.", "created_at": "2023-05-26T20:21:04.556Z"}]