[{"movie_id": 68724, "review_id": "521acc3a760ee33ef9087099", "author_rating": null, "review_text": "Parece que fuera el  sino de la tierra y de los hombres, situacion que es posible observar a traves de la historia universal. Pero no seria posible hacer una película que muestre lo contrario? sería una lección o un modelo para todos en un mundo tan convulsionado?", "created_at": "2013-08-26T03:32:10.291Z"}, {"movie_id": 68724, "review_id": "522652b819c29553c70ba8e9", "author_rating": 7.0, "review_text": "If you want an action movie, this one really rocks. There are some unneeded clichés but, all in all, is quite an enjoying journey.\r\n\r\nIn addition, Matt Damon, Jodie Foster and, remarkably, Sharlto Copley perform at great level.", "created_at": "2013-09-03T21:20:56.662Z"}, {"movie_id": 68724, "review_id": "58ac43e4c3a36849b0011d85", "author_rating": 10.0, "review_text": "Wow... Where do I begin? I just got back from the cinema and I can still feel the adrenaline rushing through me. I was already a huge fan of director Neill Blomkamp's previous effort, District 9, so my expectations were running pretty high. And for once, I was not disappointed. No, I got even more than I could have hoped for.\r\n\r\nElysium is a terrific film. Plain and simple. The story is fairly simple, which I consider a good thing because the plot was easy to follow and so it wasn't overly complex and trying to be too intelligent and contrived. It is the year 2154, and planet Earth is one hot mess. The rich reside on a space station called Elysium while the poor remain on Earth, basically grabbing at every straw just to get by. The story we follow is that of Max, who, after a terrible accident at work, is in dire need of medical help, which is only available at Elysium. In order to get there, he must go to extreme measures. I won't tell you anything else, because that would just spoil the fun.\r\n\r\nMax is played by Matt Damon, and he is very good in this role. He truly carries the film, start to finish. It always pleases me to see an actor who is just as good at tackling the character elements as well as the action parts of his role. When you think about it, that doesn't actually happen that often. Matt Damon can do both perfectly, and he is convincing in every aspect. Jodie Foster plays the role of senator Delacourt, a rich bitch who thinks she can get away with anything just because she calls the shots on Elysium. Well, somebody's about to prove her wrong... I absolutely love Jodie Foster, so it's hard not to gush, but she is a delight to watch. Her character is cold, calculating and without a sliver of conscience. And Jodie is so convincing you just want to slap her. It was great, and the fact that her accent is a little weird and distracting at times, is easily forgiven. William Fichtner also appears in a relatively small, but crucial role.\r\n\r\nThe biggest surprise for me, however, was Sharlto Copley. Remember him from District 9? He played Wikus, a dorky and kind of sissy character... Well, not in this one. His character Kruger, is the meanest, most vile bastard you can imagine. A card-carrying sadistic psycho. It really was a great opportunity for Copley to prove his versatility as an actor, and he used it to the fullest. Also, somehow his South-African twang made his character even more menacing, so I'm really glad he didn't drop it in favour of a – perhaps more crowd-pleasing – American accent.\r\n\r\nMy biggest compliment goes to the special effects department. As was the case with District 9, the SFX are so convincing, it's actually hard to realise that you're watching something that was probably 96% computer animated. Unlike D9, the visuals were even better here, if you can believe that. Usually, when a director's first film is a success and they up his budget for the next one, they go completely overboard and essentially ruin the aesthetics that made the first film so successful *cough*Matrix*cough*. In this case, all and everything was a major improvement. The action scenes are incredibly solid, the spacecrafts were eye-poppingly gorgeous (without being all flashy and futuristic – adding to the reality factor) and Elysium was a true sight to behold. 109 minutes of pure eye candy.\r\n\r\nThere were only two things that slightly bothered me. One, the somewhat stereotypical characterization of the Rich vs. The Poor. Simply put, rich = evil and poor = good, no exceptions. Especially with the rich Elysium folk I found it a little bothersome that there wasn't a single person who seemed to have a heart, they were almost mechanical and so the polarisation was pretty black-and-white. Two, the lack of emotional involvement. I didn't really feel much for any of the characters, except Max. There is a plot line with a woman he has feelings for, whose daughter is very ill, and that's a sad thing but the film failed at really convincing me why I'm supposed to care. Could be personal, but that's the way I experienced it. \r\n\r\nHowever, these two minor plot points are not sufficient enough to deter me from giving this film any less than 10 stars. What I think is most thrilling about Elysium is the fact that it actually paints a frighteningly plausible picture of what our future might just look like. It is, in any case, much more realistic than pretty much every other post-apocalyptic film I've ever seen. Don't write this concept off too easily, this might very well be the world we live in one day.\r\n\r\nIn the end, Elysium is a terrifically made film. It's gritty, it's gnarly and highly realistic. And, to the zero-attention-span MTV kids out there, it's also an incredibly entertaining, action-packed thrill ride. Tiny side note: the violence is quite graphic at times, so some amount of parental guidance is definitely advised. \r\n\r\nThat leaves me with nothing else to say but: go watch this film. You won't regret it.\r\n_(August 2013)_", "created_at": "2017-02-21T13:43:00.692Z"}, {"movie_id": 68724, "review_id": "60258fadd6c300003e6db5ac", "author_rating": 8.0, "review_text": "A little heavy-handed at times with the social commentary though that's Neil Blomkamp's thing with all his movies at this point, however still was entertained throughout, the effects were mostly good (a few shots were a bit iffy) and Matt Damon is good in the lead. Didn't exactly land the emotional impact they were going for in the end but still was enjoyed this quite a bit and think it's actually better than District 9 (which I feel is overrated outside of the visual effects) and far and away better than Chappie. **3.75/5**", "created_at": "2021-02-11T20:12:29.691Z"}]