[{"movie_id": 581389, "review_id": "601e772a85b105003e872689", "author_rating": 9.0, "review_text": "\"**Space Sweepers**\" is South Korea's first-ever space science fiction show. For their first venture into space, they did not disappoint and made sure audiences were awed by the show's deep story and unforgettable space adventure.\r\n\r\n> **Space Sweepers** ***is lightyears better from recent Western space scifi shows.***\r\n\r\n## Story\r\nThe story started out as a typical Western space scifi. Humanity encountered a life threatening situation and the only way out was up, out there in outer space. Slowly and perfectly the Korean signature in storytelling and plots surfaced up and it started to get very interesting.\r\n\r\nThere was a grand or overarching story guiding Space Sweepers but they instead zoomed-in and told the story from a human perspective. This approach allowed them to tackle the questions from the vantage point of ordinary humans, attaching the audiences to the characters in ways not possible from a \"bigger picture\" method. A story about a crew of \"Space Sweepers\" but at the same time it was not about them.\r\n\r\nIt is rare to see this type of story and storytelling in live-action movies considering the limited time available and yet they were able to flesh out the characters, presented a family relationship plots, questioned human moralities and ethics, and explored the notion about \"the needs of the many outweigh the needs of the few\".\r\n\r\n## Acting/Cast\r\nThe casting was excellent. Song Joong Ki, playing as \"Tae Ho\", and Kim Tae Ri, playing as \"Captain Jang\", are two popular and veteran Korean actors. They were joined in by Jin Seon Kyu as \"Tiger Park\", Yoo Hae Jin as the Robot, and the child actress Park Ye Rin as \"Dorothy\". Five actors who complimented each others' acting style enabled them to bring the story closer to the audience.\r\n\r\nKim Tae Ri is best known from her 2016 movie \"The Handmaiden\" and the Netflix TV series \"Mr. Sunshine\" in 2018. Despite the huge jump from historical romance genre to a space scifi action and adventure, Kim Tae Ri has proven once again her talent in acting. She showed her character's strength and fierceness and yet behind it all she was caring and loving.\r\n\r\nSong Joong Ki is well known from his major role in the hugely popular 2016 TV series \"Descendants of the Sun\". He masterfully played his character, a man who lost his daughter in a tragedy and ended up as a sweeper of space debris to make his living. Throughout the movie, he showed perfectly the thoughts and goals of his character despite of what was in front of him. His emotions and expressions were in check, thus completing the aura of his character while at the same time letting the audience feel his sadness and difficult choices.\r\n\r\nSpecial mention is the child actress Park Ye Rin. She is technically a newbie in the industry, having only appeared as a guest in a 2020 TV series. Having thrown in a blockbuster film this early would have a huge challenge for her and yet she amazingly showed that she was born an actress. She played as \"Dorothy\", one of the key characters in this film. This being a space scifi, which means they had a lot of filming in front of green screens, Park Ye Rin was not distracted and was able to deliver her dialogues and interacted with her co-stars naturally. Oh, did I not say that she's only 7 years old?\r\n\r\n## Production\r\nThey did not shy away from giving this a budget. The superb visual effects, cgi, and editing, definitely placed this movie equal in rank with Western shows like \"Star Trek\" and \"Marvel's Guardians of the Galaxy\" to name two.\r\n\r\nIt was also a brilliant idea to bring in actors from different nationalities and to use their native languages. This is rarely done and is simply explained as some magic or technology like a \"universal translator\". But that's not where it ends … even though they have a \"universal translator\", they did not resorted to \"English\" or \"Korean\" as a \"universal language\". They showed all directors in the world how to properly portray different languages even if there is a \"universal translator\" available.\r\n\r\nThat deserves a huge mention especially for a show which concerns multiple nationalities, languages, and cultures--the planet Earth. The flow of the story was not broken even though the characters were speaking different languages. Everything was flowing smoothly, this is how it actually will be like if \"universal translators\" become a reality. Well done!\r\n\r\n## Conclusion\r\nWhile this is a space science fiction film, the story was about you and me, being a human, and the relationships we build in each of our adventures. This is what \"Space Sweepers\" was about. It is about you and me. Our humanity. Our frailties. The challenges we face every single day and how to ultimately triumph (or not).\r\n\r\nCan you guess how many languages were spoken and nationalities represented in \"Space Sweepers\"?\r\n\r\n-------\r\n\r\nOriginally posted on my [blog](https://youronly.one/yuki/review-space-sweepers-2021-202137/) under a CC-BY-SA 4.0 International License.", "created_at": "2021-02-06T11:02:02.884Z"}]