[{"movie_id": 7345, "review_id": "5d3eb9afb87aec2c3d3acd40", "author_rating": null, "review_text": "Great movie, not a spaghetti western. Very good story and atmosphere 10 stars.", "created_at": "2019-07-29T09:17:35.723Z"}, {"movie_id": 7345, "review_id": "5d559dcee8131d3e3989d197", "author_rating": 7.0, "review_text": "***Weighty, morose period drama with complex characters and Daniel Day-Lewis*** \r\n\r\nIn the early 20th century, an industrious prospector in Southern California, Daniel Plainview (Daniel Day-Lewis), becomes a shrewd oil magnate, whose journey is paralleled with a dubious Pentecostal pastor of a remote church, Eli Sunday (Paul Dano).     \r\n\r\n“There Will Be Blood” (2007) is a one-of-a-kind period drama with Western elements. It’s arty and the furthest thing from a conventional blockbuster. You have to be in the mode for a deep, slow-moving, epic flick like this in order to appreciate it. The contemporaneous “The Assassination of Jesse James by the Coward Robert Ford” and “No Country for Old Men” are good comparisons.  \r\n\r\nWhilst the story and main characters are simple on the surface, they go deep and there are many gems to mine: What good is success if you have no one to love and enjoy it with? Is Daniel a sociopath or a quality individual who acquires sociopathic tendencies because his choices put him on the road of madness? Was Eli a “false prophet”? If so, was he always a con or did he become one? \r\n\r\nWhy is Eli paralleled with Daniel? Does Daniel have the capacity for genuine love? Does he mean what he ultimately says to HW or are they words born from a sense of betrayal? Would a sane person rashly resort to murder? Is there a positive protagonist in the movie? If so, who and why? If not, why not?    \r\n\r\nThe film runs 2 hours, 38 minutes, and was shot in Southern Cal and Texas (Shafter & Marfa); and Lakewood, Washington (Thornewood Castle).\r\n\r\nGRADE: B", "created_at": "2019-08-15T18:00:46.064Z"}, {"movie_id": 7345, "review_id": "65001ff0ffc9de0ee00d4c1b", "author_rating": 7.0, "review_text": "I remember reading about just how much money Rockefeller was making at the height of his prowess and the sums were eye watering. His Standard Oil company is referenced in this powerful drama with Daniel Day Lewis as “Plainview”. He’s a prospector looking for silver but who has a bit of a fall and discovers that there is something much more valuable and plentiful - if you know how to find it, He gradually buys up leases and together with his stalwart “Fletcher” (Ciarán Hinds) and young son “H.W.” (Dillon Freasier) starts to develop his business with a view to building a pipeline of over one hundred miles  to reach the sea. Along the way, their lives are fraught with dangers and tough choices have to be made - especially when an accident at one of the wells renders the young boy deaf. It’s at this remote site that “Plainview”meets his nemesis. Not in a competitive, business, fashion - but in a puritanical Christian one. The son of a local homesteader is aspiring preacher “Eli” (Paul Dano) and the remainder of the film sees the one trying to humiliate and outmanoeuvre the other and disclaim each’s strongly held values. It’s a slow burn, this film, but DDL is on super form as a man striving for success but for it’s own purpose. His wealth does not bring him contentedness nor, for that matter, does it bring joy to anyone else. This also demonstrates just how poor rural parts of the USA were at the turn of the 20th century, and at how vulnerable the population were to exploitation and the venality of the oilmen. The photography is immersive and the pace works well in drawing us into the perfectly constructed characterisations that were the natural successors to the earlier pioneers. I didn’t love the conclusion. It seemed a little unnecessary, underwhelming - rushed even. The last ten minutes have an intensity of their own that though they well illustrate the skill of Dano and DDL, they just didn’t quite wrap things up as I might have liked. Still, it’s a great piece of cinema with some strong writing underpinning a series of lusts….", "created_at": "2023-09-12T08:23:12.719Z"}, {"movie_id": 7345, "review_id": "652a59c8f2883802a3276782", "author_rating": 10.0, "review_text": "What the hell was in the air in 2007?", "created_at": "2023-10-14T09:05:12.262Z"}, {"movie_id": 7345, "review_id": "652bb4f6f28838029f32a9c5", "author_rating": 10.0, "review_text": "A hypnotic flight into the darkness of the soul and how people hide themselves away. A masterfully directed feat, There Will Be Blood shows the very limits of selfishness and greed which are further encapsulated by Day-Lewis’ mind-blowing and unique performance of which could be easily called the greatest of all time. Every person who worked on this seem as if they are masters of their crafts, even the child actors, whose performances are stunning. Day-Lewis has excellent chemistry with Paul Dano’s egoistical preacher, who was very much snubbed for the best actor category. With some of the best cinematography ever brought to film, this is truly one of the all time greats.", "created_at": "2023-10-15T09:46:30.463Z"}]