[{"movie_id": 286217, "review_id": "5619f70d9251415d3100129c", "author_rating": null, "review_text": "'The Martian’ is definitely in the creative wheelhouse of filmmaker Ridley Scott whose Science Fiction sensibilities are grounded in colorful futuristic fantasies that tiptoe in grand whimsy.  The veteran auteur responsible for such pop cultural high-minded spectacles in ‘Alien’, ‘Blade Runner’ and even the mixed bag reception of ‘Prometheus’ certainly brings a sophisticated and thought-provoking vibe to the probing aura of ‘The Martian’. As with other Scott-helmed productions, ‘The Martian’ settles nicely in its majestic scope that taps into visual wonderment, humanistic curiosities, technical impishness and the surreal spryness of the SF experience.\r\n\r\nThe exploratory nature of ‘The Martian’ is its own noteworthy mission. Scott arms his frothy planetary odyssey with a sense of thematic inquisitiveness and intelligence while meshing human consciousness and scientific forethought. Clearly, ‘The Martian’ is astutely meditative and one can thankfully block in their memory banks some of Scott’s mediocre misses (anyone care to recall the monumental mishaps in the form of the flimsy ‘The Counselor’ or the unintentional laughfest that was ‘Exodus: Gods And Kings’?). Rightfully so, ‘The Martian’ shares its crafty crater of similarities with other space-place spectacles that resonated with the imagination and innovation such as the Academy Award-winning ‘Gravity’ and the under-rated ‘Interstellar’. \r\n\r\nQuite frankly, ‘The Martian’ is elegantly arresting in its sheer skin for both the character studies and the major plight involved (particularly anchored on the shoulders of star Matt Damon as the contemplative lead) as well as the trademark Scott-induced flourishes that incorporate crisp and cunning visual special effects and a sweeping musical score that invites a transfixing hold on one’s indelible spirit.\r\n\r\n‘The Martian’ is the film adaptation of Andy Weir’s best-selling tome. Scott’s disciplined direction and screenwriter Drew Goddard’s ambitious vision of Weir’s compelling written material seemingly gels in convincing, cerebral fashion. The premise is not wildly original as it revisits the familiar foundation of a lost soul in survival mode trying to take on the treacherous surroundings with philosophical conviction. Nevertheless, this does not make ‘The Martian’ any less formidable in its soul-searching perspective. Scott’s narrative on individualism and isolation with a tremendous technological tilt truly registers with boisterous bounce. Amazingly, Scott has assembled a capable and committed cast that are dedicated to making ‘The Martian’ look resourcefully skillful in its masterful mischievousness. Sure, The Martian’s lengthy running time is staggering but it is compelling enough to invest in its meandering, adventurous narrative.\r\n\r\nThe ultimate nightmare (or perilous predicament…take your choice) has been realised for one stranded space traveler in Mark Watney (Matt Damon). You see…poor astronaut Watney had the misfortune of losing contact with his commander in Melissa Lewis (Jessica Chastain) and the rest of his crew when undergoing a scientific expedition to examine the terrain on Mars. Courtesy of an unexpected freakish storm Watney is separated from his comrades and believed to be dead as a result of the hazardous weather conditions on Mars. Lewis and her associates have no choice but to head back to Earth as searching for Watney may prove to be futile and endanger their lives as well.\r\n\r\nThus, Mark Watney is basically his own forced-upon version of ‘Robinson Crusoe On Mars’. There is no option for Watney but to allow his major survival instincts to kick in while striving for his jeopardised livelihood on the unpredictable and treacherous Red Planet’s jagged landscape. Despite being stuck in hostile territory, Watney must use his background skills as a trained botanist to cultivate the scarce food he must rely on for his unconventional nutrition. The only ‘companion’ that Watney has to relate to rests in the recorded device that captures his harried thoughts through video diaries (at least this is more practical than what Tom Hanks’s ‘Castaway’ character had in his possession with inanimate object best buddy, Wilson the volleyball).\r\n\r\nIn the meanwhile, the devastating news about Mark Watney’s possible death far beyond the reaches of home hits his colleagues understandably hard as tributes start to pour in remembrance of the seemingly dearly departed space pioneer. Soon, there is some measure of hope when NASA officials that include head honchos Teddy Sanders (Jeff Daniels from TV’s ‘The Newsroom’), Vincent Kapoor (the Oscar-nominated Chiwetel Ejiofor from ’12 Years A Slave’) and Mitch Henderson (Sean Bean) find evidence that Watney may be alive and ready to be rescued. Naturally, a sense of urgency is warranted to retrieve the weary astronaut without causing too many public relations waves. This puts press aide Annie Montrose (Kristen Wiig) into damage control mode in particular.\r\n\r\nOkay...so it is not as scenic as Yellowstone National Park but the rocky region in THE MARTIAN still has some unassuming charm, right?\r\nOkay…so it is not as scenic as Yellowstone National Park but the rocky region in THE MARTIAN still has some unassuming charm, right?\r\nImportantly, ‘The Martian’ is clever and carefully conceived because it does not have to rely on the excess baggage to convey its entertainment value in a series of hyperactive and hedonistic happenings. Ridley Scott is soundly methodical in presenting a low-key terrifying tale of loneliness and resiliency and what it takes to handle the pressure of adversity when there is no glimmer of humanity around to reinforce or remind one of such psychological obstacles. The intriguing factor here is the science-friendly serving of intelligence and insight that builds up the audience’s appreciation for the underlying suspense. Interestingly, the conflict approached in ‘The Martian’ is not so much the back-and-forth high-scale struggles of man versus outlandish creature or an over-the-top diabolical deviant out to destroy the world in cartoonish fashion. No, the genuine combative and confrontational war of will is contained in one vulnerable man’s ability to face the unknown grounded in both doubt and determination. Hence, Scott has made a palpable thinking man’s Science Fiction exposition rooted in articulated forethought.\r\n\r\nDamon more than holds his own as the disillusioned botanist/astronaut out on an ominous limb as his doomed odyssey of uncertainty is something that the common viewer can embrace and relate to without question. The perceived opulence in ‘The Martian’ is not contained in the film’s production values per se (Scott has made previous movies with more visual vitality and purpose) but subtly showcased in the concepts of  knowledgeable tidbits concerning food rations, mathematical equations, crucial time tables, planetary probes, NASA-themed procedural techniques and aerodynamics considerations.\r\n\r\nHopefully, ‘The Martian’ is not dismissed as a foreign alien in the minds of ardent movie-going SF enthusiasts looking for a realistic and soulful space-age adventure with a refreshing backbone of scientific curiosity and candidness.\r\n\r\nThe Martian (2015)\r\n\r\n20th Century Fox\r\n\r\n2 hrs. 35 mins.\r\n\r\nStarring: Matt Damon, Jessica Chastain, Jeff Daniels, Kristen Wiig, Michael Pena, Sean Bean, Chiwetel Ejiofor, Kate Mara, Sebastian Stan, Donald Glover and Benedict Wong\r\n\r\nDirected by: Ridley Scott\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space Adventure/Science and Fantasy\r\n\r\nCritic’s rating: *** 1/2 stars (out of 4 stars)", "created_at": "2015-10-11T05:43:41.246Z"}, {"movie_id": 286217, "review_id": "56d97caac3a3682cef01144c", "author_rating": 7.0, "review_text": "This is a movie that I have to say that I have a bit of a difficulty in rating. Quite honestly I was sorely tempted to remove a star, or even two stars. Why? Because it is full of Hollywood nonsense, scientific errors, it is rather predictable and it did feel a bit like a Apollo 13 rip-off. Why did I not remove those stars? Well, it is rather entertaining even if, at times, I squirmed in my seat.\r\n\r\nThe movie starts of with a somewhat implausible event where a unexpected storm hits the Mars camp which forces the ground crew of the Mars mission to hurry back to the launch vehicle before it tilts over. The launch vehicle gradually tilts a degree at the time. Is it just me finding this strange? Would storms on Mars defy the usual rules of weather dynamics that they would exert a constant pressure which would cause a slow but constant tilt of a construct like that. No gusts, no change in pressure? And why would it gradually tilt at all? Once the force would be enough for the landing struts on one side to leave the ground it would pretty much tilt right away. Okay, I am being picky so lets give that a benefit of a doubt for the time being.\r\n\r\nObviously one guy is lost during the dramatic events. This is equally obviously 100% predictable. The fact that the guy is still alive after the rest of the crew blasted off is obviously also 100% predictable but then, this you should have pretty figured out from the title of the move after all.\r\n\r\nA lot of the rest of the movie is following this guys quest for survival on Mars using the left over equipment at his disposal and the NASA crew on Earth trying to rescue him. Yes the NASA crew on Earth does discover that he is alive which, again, is pretty much predictable. Of course this gave Hollywood the opportunity to add a utterly dislikable political bureaucrat that is pretty much in the movie for one reason and one reason alone…to be dislikable. Personally I just found him tiresome. But then, Americans seems to like these kind of people given the kind of trash that we see being pushed towards the upcoming presidential elections…from both sides!\r\n\r\nThere are a lot of good stuff in the movie. Even though it is rather predictable there are some suspense in it, there are a lot of good scenery, and even though you pretty much knows what is going to happen you do feel like cheering for the hero. Given the script I think a lot of the actors did a rather good job of their roles.\r\n\r\nIf the script writers would have brought on some decent scientific advisors I would say this would have been a great movie but it was frequently goofed up with issues that was just stupid. Like digging down a nuclear reactor a few feet in the ground. What the f… good was that supposed to do? And the constant use of simple plastic and duct tape to seal the environment. Yeah, right. Sure, Mars do have some atmosphere so it is not vacuum we are talking about but then in other scenes they seemed to assume almost zero atmosphere and made quite a bit use of explosive decompression effects.\r\n\r\nOkay, okay I am probably nitpicking quite a bit here but, unlike many Science Fiction movies, this one tries to give an impression of being within the realms of realism and it is just too full of classical Hollywood mishaps for my taste.\r\n\r\nAs I wrote above I still think it is a movie worth watching. It has some suspense, it is well done from a photographic point of view and the actors are doing a decent job. I think 7 out of 10 stars is a fair rating but it should certainly not have more.", "created_at": "2016-03-04T12:16:42.078Z"}, {"movie_id": 286217, "review_id": "56f08847925141183a000d05", "author_rating": 8.0, "review_text": "This is a movie following the lead started with Gravity with the human main character fighting for survival in space.\r\n\r\nThe plot has a good combination of suspense, action, humor and drama. Damon performs well and the rest of the cast does a good job and has been well chosen.\r\n\r\nIt is not a magnificent movie but it is good enough to fill a couple of hours of entertainment.", "created_at": "2016-03-21T23:48:23.565Z"}, {"movie_id": 286217, "review_id": "5adcc2e3c3a36862c4023beb", "author_rating": 8.0, "review_text": "This movie is very entertaining and really imaginative. The narrative is well controlled so you don't feel bored or exhausted. The part that I like best is when the accident happened and Witney lost all his crops, the despair he had and the noisy scary sound of strong Mars winds blowing outside the base. The real loneliness.\r\n\r\nHowever, this movie's plot was too straight-forward as I see. Nearly every action proposed by the sorts of parties and organization was execute, taking the story forward without stagnation. But this also made everything look too artificial. In comparison, Robinson Crusoe was much more twisted.", "created_at": "2018-04-22T17:14:11.173Z"}, {"movie_id": 286217, "review_id": "5c0c2987c3a368251508ce37", "author_rating": 8.0, "review_text": "Liked it.", "created_at": "2018-12-08T20:28:55.028Z"}, {"movie_id": 286217, "review_id": "5cd1cf339251417df726b940", "author_rating": 8.0, "review_text": "***Realistic account of trying to survive on Mars while awaiting rescue*** \r\n\r\nIn 2035 an astronaut (Matt Damon) gets stuck on Mars after he is presumed dead and his team departs without him. When NASA eventually finds out that he’s alive & well they have to find a way to save him. But can he survive for the next couple of years until they arrive? Jeff Daniels plays the director of NASA while Jessica Chastain plays the leader of the vessel. Sean Bean, Chiwetel Ejiofor and several other notables are on hand.\r\n\r\nThe only way for Ridley Scott’s \"The Martian\" (2015) to work is if it can convince you that Damon’s character is actually on Mars, which it does spectacularly and realistically (minus a few forced dramatics or stabs at humor here and there). If, like me, you’re fascinated by Mars or the potential of living on another planet in the real world, “The Martian” is a must.\r\n\r\nIt’s reminiscent of movies like “Armegeddon” (1998), “Mission to Mars” (2000), “Gravity” (2013) and “2001: A Space Odyssey” (1968), albeit without the fantastical elements of some of these. It even brings to mind the first acts of “Planet of the Apes” (1968) and “Beneath the Planet of the Apes” (1970). \r\n\r\nThe movie scores pretty well on the female front with Chastain, Mackenzie Davis, Kate Mara and Kristen Wiig. Davis looks good in tight pants.\r\n\r\nThe film runs 2 hours, 24 minutes.\r\n\r\nGRADE: A-/B+", "created_at": "2019-05-07T18:32:19.284Z"}, {"movie_id": 286217, "review_id": "5f2bc3018e87020037330843", "author_rating": 10.0, "review_text": "I feel like this science fiction movie was a stunning achievement, for at least a couple of reasons. Firstly, for much of the time it is a one man show, and that can be risky in a feature length film. It worked with acclaimed actors Tom Hanks in Cast Away, and with Robert Redford in All is Lost, but could it work with Matt Damon in a sci-fi flick? Well, I answer that question with a resounding ‘yes.’\r\n\r\nThe movie does cut away to planet Earth and the spaceship returning home without him, so it isn’t all Damon all the time. And some humor is injected here and there to offset the character’s grim situation. I liked the line where he referred to himself as the greatest biologist on the planet. As the only current resident on Mars at that time, he was also the worst biologist on the planet!\r\n\r\nAnother reason this film is remarkable is because there is a lot of science here, which drives the plot as he has to solve continuous problems that arise, not with brute strength or other physical,skills, but with his analytical mind. And yet the details don’t get tedious or overly  technical. Oddly enough, it is not a movie I will watch multiple times, as I have lesser robust sci-fI entries such as Super 8 or Monsters, but I plan to watch it at least one more time, just out of appreciation for the solid job that was done in adapting what much must have been a very challenging story to film and have it be both entertaining and informative, both scientific and an  amazing adventure.", "created_at": "2020-08-06T08:44:49.419Z"}, {"movie_id": 286217, "review_id": "643a6b30e329430522f9ac6d", "author_rating": 7.0, "review_text": "A sudden and violent storm causes the team of the \"Ares\" mission to hastily abandon their camp and return to the relative safety of their orbiting spacecraft and a journey home. Giving the command to leave, their commander \"Lewis\" (Jessica Chastain) is informed that one of their number has been killed. Thing is, once the dust has (quite literally) settled, we discover that \"Watney\" (Matt Damon) is anything but. Impaled by an antenna needle he is alive and alone. Now a sort of space-bound \"Robinson Crusoe\" adventure ensues with \"Watney\" trying to ensure he repairs the damage to his body the uses his training - as a botanist - to find a way to survive. Everyone back home assumes he is dead - it is only when an eagle-eyed scientist notices that some of the equipment is moving that they try to re-establish contact. Now, with NASA Director \"Teddy\" (Jeff Daniels) and \"Mitch\" (Sean Bean) it's a race against time to cobble together a rescue plan before poor old \"Watney\" turns into one of his life-sustaining potatoes! I found this at it's most effective when it is just Damon using his guile to find innovative ways to survive. I can't swear to the plausibility of the science, but peppered with some pithy pieces-to-camera in a video diary style and his favourite (not) disco music Damon ensures that the film builds nicely allowing us to invest in his survival. I began to lose interest once the political melodrama kicked in, though, and but for the last exciting twenty minutes, I felt the film lost it's way as the scientific responses all just became a little too predictably convenient and oddly enough for a science fiction film, far-fetched! Some spectacular visual effects are put to great use complementing a strong, visionary and speculative, story of a man using his wits to survive and the all but 2½ hours really does fly by. It's even got a bit of ABBA too!", "created_at": "2023-04-15T09:15:28.076Z"}]