[{"movie_id": 34016, "review_id": "5deea174dc86470013c5bd09", "author_rating": 5.0, "review_text": "***A really good romcom marred by profane crudeness***\r\n\r\nA TSA worker at the Pittsburgh Airport (Jay Baruchel) starts a relationship with a woman many consider to be a perfect 10 (Alice Eve), which surprises his friends and family. Can the relationship survive their pestering?\r\n\r\n\"She’s Out of My League\" (2010) is a surprisingly well-written, well-casted romcom that’s entertaining throughout, but it’s ruined for me by a little too much gross or profane (non)humor and I can’t in good conscience give it a higher grade. This is unfortunate because the flick didn’t need to stoop to that low-level.\r\n\r\nBut if you can stomach the needlessly gross bodily fluid & raunchy ‘humor’ of “There’s Something about Mary” (1998), “The Girl Next Door” (2004) and “Forgetting Sarah Marshal” (2008) you might like it more than me.\r\n\r\nThe film runs 1 hour, 44 minutes, and was shot in the Pittsburgh area.\r\n\r\nGRADE: C", "created_at": "2019-12-09T19:33:08.076Z"}, {"movie_id": 34016, "review_id": "610c7bff68b1ea005f8080a1", "author_rating": 7.0, "review_text": "I enjoyed She’s Out of My League; let me get that out there at the outset. It is witty, mostly intelligent, and downright hilarious in places. Mind you, there were a few places that made me shake my head. There was some old fashioned gross-out humor, the sort I thought stopped being used in romantic comedies years ago. I particularly didn’t like the semen stain interlude, though I admit that Kirk’s friend’s advice later on how to explain it to Molly nearly saved it completely for me. \r\n\r\nI also thought that having every male within twenty yards of Molly being paralyzed and struck dumb by her beauty was a bit overdone, but I am willing to overlook small issues if the movie is intelligent enough otherwise.\r\n\r\nI liked most of the characters, especially Marnie, who says the stuff everybody wants to say. Even Cam is made into a nice guy rather than a jerk, as most movies would make the handsome rival of the dweeb for the lady fair. All in all a fair entry into the crowded romantic comedy genre.", "created_at": "2021-08-06T00:02:07.500Z"}, {"movie_id": 34016, "review_id": "6379b9e6c2f44b00dcd87ce8", "author_rating": 7.0, "review_text": "**She’s Out of My League is edgier than need be with language and some of the humor, but in the end, it’s a solid rom-com that isn’t fun for the whole family but definitely fun for some.**\r\n\r\nI’m not typically a fan of rated-R comedies because of the over-the-top sensuality, inappropriateness, and frequent nudity. While She’s Out of My League definitely has inappropriate jokes and suggestive moments, the movie plays more towards the awkwardness of dating rather than the sexuality of the movie’s stars and avoids nudity altogether. The focus on the embarrassing, awkward normalness of the main character leads to hilarious situations and laugh-out-loud moments. She’s Out of My League could have been one of my all-time favorites if it had toned down the raunchiness a little further, but the spotlight on goofiness and an ending with some heart and sincerity make it my favorite R-rated rom-com.", "created_at": "2022-11-20T05:23:50.105Z"}]