[{"movie_id": 677179, "review_id": "64020a359653f600853e4393", "author_rating": 9.0, "review_text": "While Creed III may not be the best in the franchise, it brings enough creativity and passion to the table to keep the series fresh.\r\n\r\nThe Rocky/Creed franchise is at its best when the villain is just as, if not more, interesting than our protagonist, and that is not more evident than in Creed III. Damien Anderson (expertly played by Jonathan Majors) is a very sympathetic antagonist that has a direct connection with Adonis Creed’s past. This connection is at the forefront of the conflict as Creed tries to reconcile with his past mistakes while also being true to his present self. This back and forth is excellently done and evolves Creed further as a boxer and a man. I really enjoyed this story overall, and while it may not be the most unique script to hit the silver screen, it does enough to differentiate itself from the rest of the Rocky universe, and I can respect that.\r\n\r\nThe acting in this film is excellent, as it has been in previous Creed films. I thought that there might be a hole left by the absence of Sylvester Stallone, but I really did not notice it at all. Michael B. Jordan is able to get the best out of the entire cast, and everyone is better than ever. Tessa Thompson is fantastic; her chemistry with Jordan is incredible. The addition of their daughter creates a very wholesome family dynamic. Jonathan Majors is superb; he is intimidating, tragic, and full of emotion that the audience can genuinely resonate with. His anger is justified, and his portrayal of this angry kid who had his life taken from him is incredibly genuine. He was one of the best parts of the film.\r\n\r\nWith Michael B. Jordan behind the camera, this film has the most unique cinematography in the entire series. Jordan takes some liberties with the material that came before to deliver a modern spin on the boxing genre. Where previous films tried to have a broadcast experience grounded in grit and realism, Creed III turns that on its head, delivering the most stunning action scenes I have ever seen. The anime inspiration is apparent, with slow motion used sparingly but effectively. The finale fight has some very creative choices that create an intimate connection between our two leads that is a great backdrop to not only the fight but the story as a whole.\r\n\r\nOverall, I had an excellent time watching Creed III. Michael B. Jordan had a wonderful directorial debut, creating a film that left me with a huge smile on my face.\r\n\r\nScore: 92% |\r\nVerdict: Excellent", "created_at": "2023-03-03T14:54:45.072Z"}, {"movie_id": 677179, "review_id": "6404ba2067dcc900826e98ee", "author_rating": null, "review_text": "Life for Adonis Creed (Michael B. Jordan), is going well. He has a loving\r\nwife (Tessa Thompson), and daughter (Mile Davis-Kent), and has retired\r\nfrom boxing after defeating an old rival and ensuring his legacy.\r\n\r\nCreed spends his time with his family and developing young fighters at his\r\ngym and is prepping the current champion for his next big match against\r\nViktor Drago.\r\n\r\nAn unexpected figure from Creed’s past arrives in the form of Damian\r\nAnderson (Jonathan Majors), a friend of Creed’s troubled youth has\r\njust completed eighteen years in prison.\r\n\r\nDamian was the current Golden Gloves champion when he was arrested and\r\nbelieves he is due his title shot and Creed is the one who can make it\r\nhappen.\r\n\r\nCreed tries to teach his friend that a person without a single professional fight does not get a magical title shot and with his large\r\nthe gap from the ring he would need to grind it out to get a shot.\r\n\r\nWhen an incident occurs just before a scheduled fight and without any\r\nestablished fighters available to make the date of the fight, Creed gives\r\nhis friend a shot and sees that his brutal style of boxing is not what he\r\nwould endorse.\r\n\r\nUpon winning the title Damian lets it go to his head and gloats at how Creed\r\nhad the life he should have had and blames Creed for his past issues and\r\nfor not visiting him or staying in contact.\r\n\r\nNaturally, this puts the two former friends on a path of no return with a\r\nclimatic boxing match being the solution.\r\n\r\n“Creed III” does not have the benefit of Sylvester Stallone but you can\r\nstill get whips of his character’s influence on Creed and Jordan does a\r\nvery solid job Directing the film. He produces strong character moments\r\nwhich help define the struggles and motivations that each of them faces and\r\nthe boxing sequences are very engaging and will have you cheering along.\r\n\r\nMajors does a great job in what could have been a routine bad guy\r\nperformance. He gives Damian a drive and purpose but also shows the path\r\nthat Creed could easily have followed had fate not gone as it did and how\r\nwatching someone get everything you dreamed of while you are in prison can\r\nturn even the best of a man cold and bitter.\r\n\r\nThe film satisfies from start to finish and the character moments and\r\nboxing blend to make not only a very enjoyable film but one that shows\r\nthat there is plenty of life in the franchise.\r\n\r\n4 stars out of 5", "created_at": "2023-03-05T15:49:52.462Z"}, {"movie_id": 677179, "review_id": "641ec338c613ce00e0f1a02e", "author_rating": 6.0, "review_text": "This reminded me quite a lot of \"Rocky IV\" (1985) only instead of a Russian auto-box doing the challenging, it's \"Damian\" (Jonathan Majors). Former champion \"Adonis\" (Michael B. Jordan) is living the life of a retired sportsman, wealthy and happy with his family whilst managing the gym with \"Duke\" (Wood Harris). Leaving, one afternoon, he discovers a guy sitting on his car and after a quick chat realises that it's his long-lost childhood pal who has been incarcerated for the last eighteen years. He (\"Damian\") is now determined to succeed in the ring and so his friend tries to sort it all out - only to discover that this lean, mean, fighting machine has an altogether different agenda and that is going to force the former champ to prove whether or not he still has what it takes. The story is an hybrid of too many others and plays out as predictably as the sun coming up. Add to the mix a degree of familial discord and melodrama and we are left with something largely forgettable that I found to be a pretty poor relation of the previous, much more charismatic and grittier efforts in this franchise. The actual boxing scenes are impressively photographed but there's just no jeopardy - and I'd largely given up. Pretty to look at, yes - but not a great watch.", "created_at": "2023-03-25T09:47:37.025Z"}, {"movie_id": 677179, "review_id": "6444cc0cb3f6f504f49ee2e2", "author_rating": 7.0, "review_text": "When it comes to boxing movies, it can sometimes feel like there are few stories left to be told. What works so well about “Creed III” is that instead of being a laser-focused sports story, co-writers Keenan Coogler and Zach Baylin‘s script leans heavily into a sincere family drama. It’s also a solid directorial debut from actor Michael B. Jordan, who reprises his role as the title character.\r\n\r\nAdonis Creed (Jordan) has retired from sparring in the ring. After amassing dozens of titles, he’s now a devoted husband to Bianca (Tessa Thompson) and father to Amara (Mila Davis-Kent), a loving son to Mary-Ann (Phylicia Rashad), and runs a successful boxing gym where he works with the latest and greatest talent in the sport. Things are going well until his former childhood friend Damian (Jonathan Majors) resurfaces after nearly two decades in prison, and a long-buried incident (which is eventually revealed) causes tension between them. Eager to prove himself and get the boxing career he always wanted, Damian asks Adonis if he can help get him a shot in a fight. Feeling guilty, he agrees. Damian is a skilled but dirty fighter, which creates even more problems. Things go from bad to worse, with an eventual title fight between the two men.\r\n\r\nThe fight scenes are well directed and exciting, even if they are predictable. The film expects the audience to know the general rules of boxing so if you have no idea what’s an illegal or legal hit, you may be in over your head. (I have next to zero knowledge of the sport but I still enjoyed the fight scenes).\r\n\r\nThe film’s strongest element is the robust character development, which has always been a huge part of the franchise. Learning the painful history between Adonis and Damian makes their narrative of friends turned adversaries even more compelling, and there are genuinely touching moments featuring Bianca, Amara, and Mary-Ann. The chemistry and talent of the cast are both terrific.\r\n\r\nThat being said, there is a lot of story here. A lot. It makes much of the film feel too hurried as Jordan rushes through scene after scene. It’s good that the movie isn’t draggy, but this is a blink-and-you’ll-miss-it type of project. And although the characters and their relationships are detailed, parts of the script feel hollow and of course, predictable.\r\n\r\nFor the third film in a franchise, “Creed III” is far better than reasonably expected. Despite a few stumbles, the strong performances, the compelling story, and themes of perseverance and the importance of family make this one a winner.\r\n**\r\nBy: Louisa Moore / SCREEN ZEALOTS**", "created_at": "2023-04-23T06:11:24.074Z"}, {"movie_id": 677179, "review_id": "648928cf7ef38100c811ce3d", "author_rating": 6.0, "review_text": "Alright movie but it got away from what made this movie great. No Stallone in this one either. Now he's retiring already. Kind of dumb. I want to see him box more maybe more fights. It's always just one fight. Idk he's to young to retire and I don't want to watch him become a trainer now just like rocky.", "created_at": "2023-06-14T02:41:19.028Z"}]