[{"movie_id": 489999, "review_id": "5bd4e5a5c3a36820ec0248c3", "author_rating": 7.0, "review_text": "Impressive that viewers are able to relate to the characters despite the entire film taking place across the various tech screens of our lives.", "created_at": "2018-10-27T22:24:37.446Z"}, {"movie_id": 489999, "review_id": "5c43f4b9c3a3681a0323bdc1", "author_rating": 7.0, "review_text": "Definitely the best use of this format I've ever seen. I also picked a lot of the mystery ahead of its reveal, but not everything! And I like it when I can't pick everything. John Cho is an absolute champion, and _Searching_ genuinely met my expectations.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T04:10:33.528Z"}, {"movie_id": 489999, "review_id": "5cde0221c3a36878dcc14b70", "author_rating": 7.0, "review_text": "**_Terrible plot, but aesthetically well-crafted_**\r\n\r\n>_As of January 2019, total worldwide population is 7.7 billion. The internet has 4.2 billion users. There are 3.397 billion active social media users. The average daily time spent on social is 116 minutes a day. Social media users grew by 320 million between Sep 2017 and Oct 2018. That works out at a new social media user every 10 seconds. Facebook Messenger and WhatsApp handle 60 billion messages a day._\r\n\r\n>[...]\r\n\r\n>_Google processes 100 billion searches a month. That's an average of 40,000 search queries every second. 91.47% of all in__ternet searches are carried out by Google. Those searches are carried out by 1.17 billion unique user. Every day, 15% of that day's queries have never been asked before. Google has answered 450 billion unique queries since 2003. By 2014, Google had indexed over 130 trillion web pages. To carry out all these searches, Google's data centre uses 0.01% of worldwide electricity._\r\n\r\n- \"122 Amazing Social Media Statistics and Facts\" (Kit Smith); _BrandWatch_ (January 2, 2019)\r\n\r\n_Searching_ is a film with two main organisational principles; there's the thriller plot, which ostensibly keeps everything moving, and to which everything else should, in theory, be in service. Then there's the aesthetic design, with the entire film taking place online, the images presented taking the form of what is seen on computer screens, iPhones, security cameras etc. One of these principles is exceptionally well handled, the other isn't, and it shouldn't take a genius to guess which is which. If we're being really honest, in fact, the plot becomes more and more incidental as the narrative progresses and ever more ludicrous flights of fancy are introduced, transposing the story from a search for a missing girl into a litany of clichés and melodrama. On the other hand, the main reason, indeed probably the only reason any of us saw the film at all is because of its unique visual schema, and thankfully, this aspect is realised with an impressive degree of craft. You know you're in reasonably secure territory when the filmmakers are self-aware enough to begin an online film depicting the latest in consumer technology with the sound of an old dial-up connection.\r\n\r\nWritten by Aneesh Chaganty and Sev Ohanian, and directed by Chaganty, the film begins with a montage of video clips depicting various events in the recent lives of David Kim (John Cho), his wife Pamela (Sara Sohn), and their daughter Margot (Michelle La). The montage covers several years, taking in Margot's childhood, Pamela's diagnosis with cancer, the disease going into remission, her relapse, and, finally, her deterioration and eventual death. This brings us up to roughly the present day, with Margot now a teenager who has drifted apart from her father, although David himself doesn't seem to have noticed. In the early hours of the morning on a night when Margot left the house to attend a study group, she calls David three times, but he is asleep and doesn't hear the phone. Seeing the missed calls the next morning, and realising Margot isn't in the house, he tries to call her back, but her phone is turned off. Assuming she left early to attend a piano lesson, he calls the teacher, but she tells him Margot cancelled the lessons six months prior. Thereafter, he discovers that the money he had been giving her for her lessons was instead being deposited into her bank account, and, several weeks ago, the entirety was transferred to a now deactivated Venmo account. Frantic, David reports her missing, with the case assigned to Det. Rosemary Vick (Debra Messing). However, as David and Vick begin to delve deeper into Margot's life, David is shocked to learn she has no friends at school, and has instead an online existence of which he knew nothing. Meanwhile, every investigative avenue seems to throw up another mystery, and as time passes, it begins to look more and more as if Margot has simply run away. David, however, refuses to believe this, with his wildly vacillating suspicions regarding who may have been behind her disappearance ranging from a friendly YouCast (video blogging site) user, a disrespectful pot-smoking Facebook user, his own brother Peter (Joseph Lee), and everyone in between.\r\n\r\nAlthough the plot has a reasonably strong forward momentum, with a well-judged pace, it comes across as initially insipid, and ultimately rather ridiculous. If this was a standardly shot film, without the unique visual design, no one would be giving it a second glance – the thriller plot is clichéd, derivative, and trite, and despite the foolishness into which it descends, it's also fairly predictable (I guessed who the villain was, although not why they were so villainous). In this sense, the film reminds me of something like Robert Montgomery's _Lady in the Lake_ (1946) or Sebastian Schipper's _Victoria_ (2015). Both feature dull and hackneyed plots that serve only as something onto which to hang the structure, rather than the other way around; _Lady in the Lake_ is shot entirely in the first-person, whilst _Victoria_ is shot in a single continuous take, and neither is worth looking at for their plot, characters, or dialogue.\r\n\r\nWith this in mind, the aesthetic aspect of _Searching_ is much more successful, with almost the entire film taking place on a computer screen, with Facetime conversations, iPhone messages, security camera footage, and TV material rounding out the design. It's a fascinating hook, and thankfully, it does more than simply exist to carry a poorly written plot – the filmmakers actually have something to say, albeit nothing too revolutionary.\r\n\r\nThe first thing to know is that the aesthetic is extremely well crafted; from Chaganty's direction to Juan Sebastian Baron's cinematography, to, especially, Nicholas D. Johnson and Will Merrick's editing; logistically, this can't have been an easy film to plan or shoot, and the fact that the various components that go into making up the final image all work so well together suggests a great degree of care. In tandem with this, whilst the overarching plot is poor, Chaganty and Ohanian's writing is excellent in terms of how it continually finds natural ways to confine the action to a screen – whether it's David looking into Margot's finances, Vick watching FaceTime conversations, TV news showing security footage – never once did it feel like a gimmick, like it was being forced to stay within the computer screen simply to satisfy an abstract aesthetic rubric. It all worked reasonably organically, and after a few minutes of acclimating yourself, you barely even register it anymore.\r\n\r\nWithin this, the filmmakers are even able to throw up a few surprises. For example, the structure grants us more access to David's interiority than would be possible in a regular film. How so? Simple – by employing something we've all done, many times. On several occasions, David is shown typing something during a conversation, only to delete it, and send something completely different, whether because the first message was angry, or emotionally revealing, or accusatory etc. Anyone who has spent any amount of time talking online or via text will be familiar with this, and the use of it in the film allows us a glance into his psyche, showing us where his mind is in an unfiltered sense, before self-censorship kicks in. It only happens a few times (if it happened too much, it would become meaningless), but it really does impart a degree of psychological verisimilitude that I wasn't expecting.\r\n\r\nAdditionally, as mentioned earlier, the film actually uses the visual design to offer some social commentary, which is, again, something I wasn't expecting. Chaganty himself is a former Google Creative Lab employee, so he would know a thing or two about issues such as the uses and over-uses of technology, the unpleasant side of online culture, and the notion of digital footprints, and it is these areas where most of the film's more salient points are concentrated. For example, the addiction to technology and social media so prevalent in today's culture is right there in the set-up – the entire Kim family are obsessed with speaking to one another via phones and computers, and recording pretty much everything, often at the expense of having more natural face-to-face conversations. Another subject is the toxicity of the internet, the prevalence of online troll culture, and the tendency for people to say things online that they never would in person, believing that the anonymity afforded by the internet gives them the right to be unpleasant. This is communicated primarily through one scene – after watching a news report about Margot on YouTube, David begins reading the comments, which almost immediately start making jokes about him having killed her, and being \"father of the year\" (presented as a meme, obviously, because typing is such a drag).\r\n\r\nA very pertinent topic in the wake of Trump's election is the dissemination of fake news, and this is conveyed through a half-funny, half-unpleasant scene – shortly after realising Margot is missing, David speaks to Abigail (Briana McLean), at whose house the study group had taken place, who confesses that she barely knew Margot. Later on, however, when the media is swarming all over the case, she is seen on the news, tearfully lamenting how much she misses her \"best friend.\" The impossibility of ever being invisible online is another topic. Yes, the film is about a person who had an entire online existence that no one knew about, but that was only because no one had looked. Once someone did, and once a few threads were pulled, everything is exposed, as the impossibility of erasing ones digital footprint becomes manifest in the story. Anyone who has spent any amount of time online will be familiar with many of these issues, and the fact that they all ring so true, without the film becoming preachy, is a testament to the quality of the filmmaking.\r\n\r\nFinally, and this cannot be overemphasised, the film includes a pitch-perfect, perfectly timed, perfectly delivered Justin Bieber joke that is absolutely hilarious, and has to be seen to be appreciated.", "created_at": "2019-05-17T00:36:49.804Z"}, {"movie_id": 489999, "review_id": "60a20bde62fcd30057384334", "author_rating": 8.0, "review_text": "Searching blew me away even though I saw it after Run, Aneesh Chaganty's later feature, and having heard and read everything about how similar Mahesh Narayan's c u soon is. The intensity of the plot, its unpredictability, and the conviction of the characters are what stood out for me in this unconventional thriller that is also so relatable and real. Watch it right now if you haven't. **8 stars**.", "created_at": "2021-05-17T06:23:26.059Z"}, {"movie_id": 489999, "review_id": "63daac6a3dc31300864cf6f0", "author_rating": 8.0, "review_text": "Searching is a mystery thriller film shot from the perspective of our main characters computer screen. In most movies of this nature, this is done as gimmick and does not feel natural in the story telling. But here, the technology is seamlessly integrated into the story where the two are inseparable. John Cho does an excellent job of being the lead here. His emotional connection with his daughter is a driving force of the plot and the turmoil he goes through in discovering that the connection he has with his daughter was all on the surface is superb. The unknowns surround our leads daughter creates so much tension and mystery as we are trying learn about the character along side the father. The editing is top notch here as the story maintains a very coherent progression while balancing multiple windows and views of the computer screen. There were plenty of twists in the story, some worked well and others fell flat for me. The movie does a little bit too much at the end, but overall was great.\r\n\r\nScore: 79%\r\nVerdict: Great", "created_at": "2023-02-01T18:16:10.524Z"}]