[{"movie_id": 385687, "review_id": "6465de18a5046e01474ba11b", "author_rating": 6.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"Fast X surprisingly pulls me back into a saga I had practically given up on. Jason Momoa is, by far, the MVP of the whole film, transforming an easily forgettable villain into a truly hilarious explosion of charm and *camp*. The cast still holds that enviable chemistry, even though Daniela Melchior and Portugal deserved more screen time.\r\n\r\nConsidering the previous entries, the energetic action actually turns out to be quite tolerable when it comes to the expected illogical insanity of the franchise - which will please viewers with less patience for absurdity. Despite an overuse of false backdrops and extremely agitated editing, the entertainment levels are well within the acceptable spectrum.\r\n\r\nIt's clearly the first film in a final trilogy. Interpret this last sentence as you wish.\"\r\n\r\nRating: B-", "created_at": "2023-05-18T08:13:12.147Z"}, {"movie_id": 385687, "review_id": "6466f564c3514c00e5dc65cd", "author_rating": null, "review_text": "A vacous and imbecile action potboiler which does what it's meant to do, \"Entertain\".\r\n\r\nFast X is a noisy actioner which pushes the limits of inventive action set pieces but this time stays grounded compared to the space shit they tried last time. As a franchise, fast and furious has always been extremely self aware of what it intends to present , over the top, adrenaline pumping , never seen before action and Fast X delivers in that front yet again. The sheer amount of scale and production value gone into this makes this an insane film. While it entertains us throughout because of its action, having an engaging and appealing premise has always been the weakest aspect of this franchise. The story is yet again dumb and feels like an Indian tv soap where no one dies and pops up again and again. \r\n\r\nThe cast rather than balancing the count keeps getting bigger with each iteration. The best thing the makers have done this time is to integrate Jason Mamoa as Dante and he is maniacal and psychotic. Probably the best villain in the franchise until now. He brings in the much needed wackyness to the film. Alan Ritchson joins the cast and he is brilliant. While rest of the cast remains same and their chemistry adds the elements of humour , Brie Larson's entry doesn't make any sense. Let's hope she springs in a surprise in the next 2 films. The film finishes on a cliffhanger and promises more madness in the next. However dumb it may be, the franchise will be remembered as the one which defies physics in the most realistic way possible.\r\n\r\nOverall, if you are a fast and furious fan there's no one stopping you, but if you are not then you are missing the out on the most badass franchise coming to a close. I recommend keep your brains at home and go have a blast.\r\n\r\nInstagram @streamgenx", "created_at": "2023-05-19T04:04:52.963Z"}, {"movie_id": 385687, "review_id": "6469eeb82bcf67011bf3a715", "author_rating": null, "review_text": "Great movie", "created_at": "2023-05-21T10:13:12.913Z"}, {"movie_id": 385687, "review_id": "646b33fa2bcf6700e3bbaa38", "author_rating": 6.0, "review_text": "Starting off with a bit of nostalgia, this high-octane adventure sees just how \"Dom\" (Vin Diesel) et al become the targets of \"Dante\" (Jason Momoa). The most improbable of robberies from a police station followed by an even less plausible chase through the streets of Rio dragging a ten ton safe behind their cars! Now I was thinking, this is going to be rubbish. Well, it isn't actually. Though it is pretty repetitive and the story is rather episodic in delivery, it's still got just enough of a story to underpin the collection of lively set-piece car chases that trash just about every city in the world - especially Rome. The camp but deadly Momoa looks like he is having an whale of a time with his role and though the \"family\" sentiment of the whole thing starts to grate after a while, the production is high standard, the pace is relentless and the visual effects are put to good use for most of it. The rest of the cast deliver adequately enough - I could have been doing with a bit more from \"Cipher\" (Charlize Theron) and a lot less from the double act of \"Tej\" (Ludacris) and \"Roman\" (Tyrese Gibson) that got on my nerves a bit after a while. From a plot perspective, it's an introductory offer - they are setting the scene for the next one (or two) that will doubtlessly be a spectacular denouement, tinged with tragedy, that probably only leaves Nepal as a country untouched by their wrecking! It's harmless fun. It won't challenge you one little bit, the acting and writing are largely forgettable and it will slot into the library of the rest of this franchise easily enough. If you don't know what you are going to get from the series by now, then you ought not to bother.", "created_at": "2023-05-22T09:20:59.008Z"}, {"movie_id": 385687, "review_id": "6479215b9b6e4700fbf888e8", "author_rating": 2.0, "review_text": "The very definition of moronic. \r\n\r\nLoud, obnoxious, cheesy characterisations, idiotic back story  and enough bling to make you wince.  \r\n\r\nThe only vaguely redeeming quality is the polish and money spent on the over the top, at times novel, action scenes but that's not really saying much, in the wider context of awfulness, this represents.\r\n\r\nI'm not sure who the demographic for this flick is? I would have thought people were more evolved, as a species but well.....\r\n\r\nIn summary, just dumb, that's really all needs be said.....", "created_at": "2023-06-01T22:53:16.005Z"}, {"movie_id": 385687, "review_id": "64821c4ad2b20900ebbf3a2d", "author_rating": 9.0, "review_text": "I can always rely on this franchise to give me what I desire from it.\r\n\r\n<em>'Fast X'</em> is a great time. I adore the whole series and have done so since watching the opening entry of it as a teen, sure it has changed tremendously since those halcyonic days of 2001 (OK, I was like 5 then...) but my fondness and enjoyment of these films remains unchanged - quality entertainment!\r\n\r\nI love the main cast, particularly those we've had since the beginning or thereabouts - from Vin Diesel and Michelle Rodriguez to Tyrese Gibson and Ludacris (I'm gonna need a spin-off with those two if you're reading, Universal!) to Sung Kang and Jordana Brewster (want more of the latter, but I get it's tricky with the absence of Paul Walker; who is still missed). I'll never tire (tyre?) of watching them together.\r\n\r\nAway from those guys, the recurrence of the likes of Charlize Theron, John Cena and Nathalie Emmanuel is pleasant and the additions of Brie Larson and Jason Momoa are highly welcomed. I wasn't sure if Momoa was a bit too over the top in parts, but all in all he makes for a memorable antagonist - he certainly commits to the role!\r\n\r\nThe action continues to be absolutely bonkers and I continue to be absolutely onboard with everything and anything that is portrayed onscreen. The look of the film, the sound of the film... I dig it all to be honest. It's loud as heck, but that's exactly what I'd want from a <em>'Fast & Furious'</em> flick. A film worth the admission fee, as usual.\r\n\r\nBring on <em>'Fast XI'</em> or whatever they decide to call it. Apparently we're still getting another one after that, which I personally hope has its own sequel, which in turn has its sequel, followed by another seque... you get my point. I wanna be 105 and sat in the cinema watching another one of these.😂", "created_at": "2023-06-08T18:22:02.617Z"}, {"movie_id": 385687, "review_id": "64821c4ae375c000acc42037", "author_rating": 9.0, "review_text": "I can always rely on this franchise to give me what I desire from it.\r\n\r\n<em>'Fast X'</em> is a great time. I adore the whole series and have done so since watching the opening entry of it as a teen, sure it has changed tremendously since those halcyonic days of 2001 (OK, I was like 5 then...) but my fondness and enjoyment of these films remains unchanged - quality entertainment!\r\n\r\nI love the main cast, particularly those we've had since the beginning or thereabouts - from Vin Diesel and Michelle Rodriguez to Tyrese Gibson and Ludacris (I'm gonna need a spin-off with those two if you're reading, Universal!) to Sung Kang and Jordana Brewster (want more of the latter, but I get it's tricky with the absence of Paul Walker; who is still missed). I'll never tire (tyre?) of watching them together.\r\n\r\nAway from those guys, the recurrence of the likes of Charlize Theron, John Cena and Nathalie Emmanuel is pleasant and the additions of Brie Larson and Jason Momoa are highly welcomed. I wasn't sure if Momoa was a bit too over the top in parts, but all in all he makes for a memorable antagonist - he certainly commits to the role!\r\n\r\nThe action continues to be absolutely bonkers and I continue to be absolutely onboard with everything and anything that is portrayed onscreen. The look of the film, the sound of the film... I dig it all to be honest. It's loud as heck, but that's exactly what I'd want from a <em>'Fast & Furious'</em> flick. A film worth the admission fee, as usual.\r\n\r\nBring on <em>'Fast XI'</em> or whatever they decide to call it. Apparently we're still getting another one after that, which I personally hope has its own sequel, which in turn has its sequel, followed by another seque... you get my point. I wanna be 105 and sat in the cinema watching another one of these.😂", "created_at": "2023-06-08T18:22:02.871Z"}, {"movie_id": 385687, "review_id": "64b67eadac416101391d3134", "author_rating": 1.0, "review_text": "Even for a Fast and Furious film, this is a total price of crap. You'll hate yourself for watching it.", "created_at": "2023-07-18T11:59:41.682Z"}, {"movie_id": 385687, "review_id": "64cca41e2f266b09ef121f56", "author_rating": 5.0, "review_text": "Writing a review for a sequel like “Fast X” feels pretty pointless. It’s the type of adrenaline-fueled blockbuster that rabid fans will eagerly shell out money to see and want to love, while snobby critics will begrudgingly watch with a chip on their shoulder combined with a predetermined disdain for whatever will unfold. I’m a big fan of the series, even when it veered away from fast cars and leaned into the street superhero action angle. Most moviegoers would expect “Fast X” to be a film that’s packed with big, loud, dumb fun. It’s big and loud (and certainly dumb), but there admittedly is a slight shortage of fun.\r\n\r\nThe plot is so stupid, but it builds on the best film of the franchise, “Fast Five.” If you don’t remember the movie, don’t worry: the first 15 minutes are a rehash of everything that happened. Even newbies will be up to speed quickly. The film focuses on Dante (Jason Momoa), a formidable foe who is fueled by revenge. He’s ready for blood, and Dominic Toretto (Vin Diesel) and his “family” are squarely in his sights. This installment takes the crew from Rome to Rio de Janeiro and beyond, with explosions, car chases, fist fights, and lots of faces from the past.\r\n\r\nThe story isn’t what most came for anyway, and the pacing slows under the weight of Diesel growling about “family” and “faith.” The jokes aren’t really funny either, and Louis Leterrier‘s direction is lacking. The threadbare writing is awful. The CGI looks shoddy. The situations our heroes are put in are so far-fetched and ridiculous that it makes Tej (Ludacris) and Roman’s (Tyrese Gibson) trip into space in “F9” seem like no big deal. In other words, there is a lot to dislike about this movie — but there’s also plenty to enjoy.\r\n\r\nThe stunt driving is absolutely spectacular, as are the majority of the action sequences. For every misstep, there’s an equally thrilling chase (like a bomb tearing through the streets of Rome). The cast mostly gives performances that are better than expected. The real MVP here is Momoa, who creates a truly terrifying character in Dante, a big screen villain for the ages. Obviously having fun with the role, Momoa completely steals and runs away with the movie. He is absolutely terrific.\r\n\r\nThe film is packed with all the fan favorite characters and a few new added for good measure (although Brie Larson as a CIA agent and Leo Abelo Perry as Dom’s son don’t bring that much to the table). Diehards will be pleased to see Letty (Michelle Rodriguez), Mia (Jordana Brewster), Ramsey (Nathalie Emmanuel), Jakob (John Cena), Han (Sung Kang), Queenie (Helen Mirren), and baddies Shaw (Jason Statham) and Cipher (Charlize Theron).\r\n\r\nAlthough I’m a fan of all things “Fast and Furious,” it’s becoming increasingly difficult to overlook the fact that each film seems to become even more dependent on over-the-top silliness. “Fast X” feels like it’s headed toward the end of the road, a dead end from which the series will never return. But if you’re searching for a bit of mindless entertainment, it’s also a great way to kick off the start of the summer movie season.", "created_at": "2023-08-04T07:09:18.478Z"}, {"movie_id": 385687, "review_id": "64d05871303c8500ade4b72e", "author_rating": 5.0, "review_text": "I've more or less enjoyed the Fast and the Furious franchise though with each installment, the writers attempt to go further in its goofiness from the previous movie, it's becoming harder and harder to really be entertained, not to mention care one iota about these characters. I will say Jason Momoa, in whatever he was doing, was a hoot in the cold-blooded villain. And in typical \"Fast\" fashion, there are scenes that don't make a lick of sense. I found some of the action scenes to be well directed I guess by journeyman Louis Leterrier who took over from Justin Lin who left only a week into production.\r\n\r\nGiven I wasn't that big of a fan of Fate of the Furious or F9, I think I've grown out of this franchise and would be a good thing to bring it to a close. **2.5/5**", "created_at": "2023-08-07T02:35:29.616Z"}, {"movie_id": 385687, "review_id": "6559d34c22931a00c58d4d2f", "author_rating": 7.0, "review_text": "This was, of course, a totally ludicrous movie devoid of any pretense of realism or intelligence when it comes to basic science and physics from the script writers. It was however, also a quite fun movie.\r\n\r\nIt is also a movie free from the usual Hollywood far left woke preaching which is, of course, a big plus.\r\n\r\nIt is a shame that there is always a bunch of trolls around giving movies like this single star reviews. I mean, come on, what the fuck did you expect? It is a movie exactly in the same style as the last movies in the franchise.\r\n\r\nVin Diesel is Vin Diesel which is a good thing. It is loaded with fun, totally unrealistic but fun, action. I really could have been without Roman’s and Tej’s shenanigans but for the rest I liked the characters and it was nice to see Statham in the movie.\r\n\r\nWhat really made the movie though was to finally see a real, rotten to the core, megalomaniac and charismatic bad guy. Jason Momoa is doing a great job of Dante and I suspect he had quite a bit of fun when doing the role.\r\n\r\nOf course there are a few things that drags down the movie.\r\n\r\nThings like a 20 kiloton nuclear bomb going of a few hundred meters from the Vatican with “almost” no casualties. That is a new low on unrealism even for the Hollywood hacks.\r\n\r\nAnd what bloody passenger airliner has bomb drop style cargo doors under it?\r\n\r\nEven if they did not care about sanity or realism when making the movie there are limits. That drags down the rating as far as I am concerned.\r\n\r\nAlso, they decided to make this final (?) instalment a two part movie with a huge cliffhanger at the end of this one. I just hate cliffhangers and it makes me automatically reduce the rating.\r\n\r\nThere was absolutely know need for it. They could just have Dom & Co walk into the sunset plotting their revenge or something instead of this dumbass ending.\r\n\r\nAt least the good thing is that, unless the Hollywood hacks turns out to be even more stupid than they usually are (which would be quite a feat), part two of this movie will be all about kicking Dante’s arse.", "created_at": "2023-11-19T09:20:12.780Z"}]