[{"movie_id": 300669, "review_id": "57563dd69251416e2d001324", "author_rating": null, "review_text": "As is typical with almost all movies of this genre I found this film to be predictable and lacking real creativity. It is an unfortunate collision of several popular titles and left me wondering if its writers had just binge watched a weekend of thriller films that made a few bucks before looking at each other through a bongy haze and declaring \"Dude we can totally write a screenplay!\" \r\nThe result is a film that is average at best. Perhaps the audience could also benefit from a little pre-screening bongy haze of their own.", "created_at": "2016-06-07T03:21:58.087Z"}, {"movie_id": 300669, "review_id": "57c3427ec3a3680cc50010e8", "author_rating": null, "review_text": "There are several contemporary horror showcases that could certainly benefit from co-writer/director Fede Alvarez’s (“Evil Dead”) edgy home invasion thriller **Don’t Breathe**. For starters, Alvarez taps into the suggestive elements of tension without the overextended need to go overboard. The chills and thrills seem almost organic and unassuming. Sure, there appears to be a simplistic approach to an otherwise conventional premise of a house break-in at the hands of opportunistic thugs. Nevertheless, **Don’t Breathe** captures the claustrophobic spirit of its inherent creepiness with stylish cruelty and cleverness.\r\n\r\nInevitably, **Don’t Breathe** may inspire cinematic comparisons to the 2002 David Fincher-directed vehicle _Panic Room_. Understandably the theme is somewhat recognizable to movie audiences as ominous strangers invading your domestic private space is a recipe for paranoia and persecution. However, **Don’t Breathe** takes this precarious situation to a whole new scare tactic level of horrific proportions. Consequently, the executed violence and terror-driven tempo is definitely worthy of its suspense-driven objectives. **Don’t Breathe** is a macabre masterpiece in the making that sets the standard for a current-day stillborn and repetitive horror genre that thrives on pressure cooker predictability.\r\n\r\nThe set-up for **Don’t Breathe** is quite ambitious and challenging thus forming an interesting spin on the home robbery scenario. The sordid story centers around three upstart small-time crooks making the rounds of thievery in the suburban surroundings of Detroit. Rocky (Jane Levy) and her two male companions Money and Alex (Daniel Zovatto and Dylan Minnette) are able to carry off their home invasion scamming courtesy of Alex’s connections to a home security firm owned by his father (where there is all kinds of access information to private residences and local businesses).\r\n\r\nAlex’s stipulation, however, is that these home invasion robberies need to be less flashy without drawing too much attention. Plus, all the stolen items confiscated much not be too expensive otherwise their illegal activities will be exposed much sooner than later. Unfortunately lovebirds Rocky and Money do not see eye-to-eye with Alex’s brand of careful and cautious home-robbing philosophy. In fact, the romantic couple wants to reach for the sky and steal as much stuff possible to make their dreams of living on East Street an immediate reality. So what will it take for Alex to get on the same page as Rocky and Money in terms of all of them benefiting on a big score without suffering the dire consequences?\r\n\r\nThe consensus is reached among the law-breaking trio that their next target for viable riches is in the form of a blinded Iraqi war veteran (Stephen Lang). The word is that the personally troubled and sightless ex-military man is about to be awarded a whopping three-hundred thousand dollar cash settlement involving the wrongful death of his beloved young daughter. So the home invasion task seems quite self-explanatory to the young heist-happy hooligans as committing theft against a seemingly vulnerable blind man emotionally and psychologically down in the dumps should be a piece of cake so to speak. Well, Rocky and her two boytoys were sadly mistaken if they thought that they could take sole advantage of this savvy yet disturbed disabled war vet with visions of sorrow and sacrifice.\r\n\r\nThe realization that the home-invading crew has picked a tricky trap of a house to pillage while underestimating the capabilities of its handicapped owner seems like poetic justice. In fact, the irony of the criminal threesome trying to escape the boarded-up dark and dingy household makes them look like the victimized three blind mice at the mercy of a crazed trigger-happy, sight-deprived ex-soldier that can see all too well that his cherished castle and belongings are being jeopardized by these punkish intrusive violators. Strangely, the audience is left wondering whether or not they should root for the blinded bombshell protecting his homestead of secrets or the clueless crooks that talked themselves into this caustic cat-and-mouse game of gloom-and-doom.\r\n\r\n**Don’t Breathe** is uncharacteristically compelling for a horror showcase because it relies on genuine scary jolts and jumps…or at least the anticipation of the jolts and jumps that have convincing dramatic weight behind the build up of intensity. Alvarez crafts an arousing narrative that brilliantly displays the mounting nervousness that awaits. Lang’s belligerent blind man patrols every spacing and crevice in the darkness with the will of a rabid dog in heat as he points his explosive firearms at the slightest movements of his trapped guinea pigs in despair. Creatively nerve-racking and nauseous, **Don’t Breathe** makes dutiful usage of its instinctual delivery of shock value as this potent pot-boiler never settles for any sense of false or mechanically manufactured hedonism. The haunting aura that exists in **Don’t Breathe** is gasping in visceral authenticity.\r\n\r\nAs the menacing misfit saddled by wartime mortar fire blindness but blessed with tactical tenacity drenched in borderline villainy, Lang’s portrayal as the sightless hunter tracking down his vulnerable prey in his tortured domestic playground is solidly digestible. His inner madness was already established by personalized heartbreak but the arrival of his uninvited guests devilishly unleashed more demons within his off-kilter psyche. The moving targets at the other end of the deranged blind man’s intimidating gun are thoroughly convincing as the harried catalysts for their sightless tormentor’s frustration and escalating rage. Levy’s Rocky, Zovatto’s Money and Minnette’s Alex are plausible as the frightened specimens caught in the maniacal maze of their aggressor’s clutches.\r\n\r\nThe very thought of a psychotic blind man enforcing his brand of warped justice on the youthfully sighted self-indulgent saps is deliciously manipulative and wonderfully inventive. The creepy corners concerning the backlash blackness in **Don’t Breathe** is explored with grand naughtiness and the atmospheric vibes certainly will not disappoint in this percolating peek-a-boo primer.\r\n\r\n**Don’t Breathe** (2016)\r\n\r\nGhost House Pictures/Screen Gems/Stage 6 Films/Good Universe\r\n\r\n1 hr. 28 mins.\r\n\r\nStarring: Jane Levy, Stephen Lang, Dylan Minnette, Daniel Zovatto, Emma Bercovici, Franciska Torocsik\r\n\r\nDirected and Co-Written by: Fede Alvarez\r\n\r\nMPAA Rating: R\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-28T19:58:54.608Z"}, {"movie_id": 300669, "review_id": "57e52d239251411af40027c5", "author_rating": null, "review_text": "2016 has been a great year for horror. With the addition of _Don't Breathe_, 3 of my top 5 movies the past 9 months are in the genre. I'm a pretty huge horror fan but even for me that is crazy unexpected.\r\n\r\nDirector Fede Alvarez has knocked it out of the park with _Don't Breathe_.  In fact I'm yet to be anything other than impressed by his work (not that notable an achievement, as he's only directed two films, but still). _Don't Breathe_ flips a lot of modern horror conventions, and I love it for that. The use of silence and barely audible noise to bring the scares instead of some cheap blaring-ly loud audio. The fact that there is really no one wholly good or wholly evil.... Plus that puppy is really bloody cute...\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2016-09-23T13:24:51.364Z"}, {"movie_id": 300669, "review_id": "58446a5cc3a368481300bc33", "author_rating": 7.0, "review_text": "**The right house, but an underestimated person!**\r\n\r\nIt's a great comeback for the director after his first film, 'Evil Dead' remake had got a mixed response. This film might feel very familiar to you if you have got a good knowledge of the B movies. It was still a very refreshing and very thrilling. The film was short, because there were none segments wasted, it comes to the point quickly. I mean the event, because the story was a one liner, but the event was what this film based on.\r\n\r\nThree youngsters who rob the houses when the people are out, mark their new target on a blind war veteran. But when it does not go as they have planned, they find trapped inside his house. Struggling to escape from there, they also get so close to what they had come for. Though it becomes a suicidal, and left without any option, what's next for them and the result of their attempt is what becomes the film's conclusion.\r\n\r\nReally a great effort. Almost a one night based theme with the limited cast. The title is not just what the film revolves, it also for us to hold breath while watching it and most probably sitting on the edge of our seat throughout. But I'm very disappointed with many flaws, or maybe you can say those unexplained stuffs. Like the end seems very silly, because there were lots of evidence to prove the film character had committed a crime, but easily got out. Likewise there are many more, but the film does not explain and I believe there are sure reasons behind them.\r\n\r\nThe writers did not care to waste time on those, because they wanted only a thriller, a non-stop one and they got one. Now it is going to be remade in Kollywood and also a sequel was announced. I expected that when I saw the ending. Maybe, a prequel, though sequel seems more interesting idea after what happened in this. Surely one of the best thriller of the year, so make sure you watch it soon.\r\n\r\n_7/10_", "created_at": "2016-12-04T19:11:24.147Z"}, {"movie_id": 300669, "review_id": "630a61d1b7d352007bca426b", "author_rating": 7.0, "review_text": "**The ruthless savagery of the killer combined with the tight quarters and oppressive silence make Don't Breathe a well-done and frightening slasher must-see.**\r\n\r\nWhat starts as a typical home invasion thriller transforms into anything, but when the blind elderly man the thieves thought would be an easy mark turns out to be a vicious killer, Don't Breathe becomes something so much better. With suspense and tension similar to A Quiet Place, characters desperately fight to hold their breath and avoid making any sound so the deadly blind man can't find and kill them. Don't Breathe is visceral, brutal, and claustrophobic. In such a small, confined space, the anxiety never fades because the killer is literally in the room with his potential victims. There is one particularly disturbing scene near the end, so I recommend looking up a parents guide before you commit to watching if you aren't a frequent horror enthusiast. Don't Breathe surprises as one of the best new horror slasher films of the last decade.", "created_at": "2022-08-27T18:26:25.424Z"}]