[{"movie_id": 297762, "review_id": "59303b4c92514166e9000f76", "author_rating": 7.0, "review_text": "I'd just like to thank Patty Jenkins for making a DCIThoughtSheWasWithUniverse movie that wasn't fucking garbage.\r\n\r\nIf I'm being completely honest, the two people I went to the cinema to watch _Wonder Woman_ with and I did spend the next two hours after coming out of our screening discussing the various problems with the movie, but we also all agreed on one thing: We still loved it.\r\n\r\nMaybe it's just the rose-coloured glasses of comparison, but I had an excellent time with _Wonder Woman_, and I'm excited to go back to the cinema and watch it, at least one more time.\r\n\r\nIt's the first time I've said that about a DC movie since _The Dark Knight Rises_.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-06-01T16:05:32.067Z"}, {"movie_id": 297762, "review_id": "593476aec3a3685a2402386d", "author_rating": 9.0, "review_text": "**The First Great DCEU Film**\r\n\r\nThis film is the origin story of Diana Prince/Wonder Woman (Gal Gadot), who was first introduced in Batman v. Superman last year. She is born and trained on Themyscira, the hidden island where the powerful warrior women known as the Amazons live. One day, Steve Trevor (Chris Pine), an American World War I spy, crashes off the coast of Themyscira and is rescued by Diana and the two team up to take down Ares, the God of War, and the Germans, who are developing a very deadly form of mustard gas. There are fantastic action sequences in this film, especially by Gal Gadot. It's amazing to see her single-handedly storm the German front, inspiring the Allies to fight with her. Gadot takes over from the legendary Linda Carter and makes the role her own. She has great chemistry with Pine. They are complete equals in this film. It's refreshing to see the female lead in a superhero film not be the love interest. The only negative part of the film are the lackluster villains. Hopefully, Wonder Woman will have more formidable foes in future films.", "created_at": "2017-06-04T21:07:58.016Z"}, {"movie_id": 297762, "review_id": "59358fc692514174a1000015", "author_rating": 6.0, "review_text": "**DC Hits A...Bunt. But compared to the strikeouts, a bunt seems impressive.**\r\n\r\nWonder Woman had some things working for it--things other comic book movies have faltered on. But it had a lot of things not working for it too. The result is an average median between what works and what doesn't. While the film is spectacular within the struggling DCEU, as a stand alone film it's mediocre at best. \r\n\r\nDiana's origin story--how she came to be and how she came to be a super hero was refreshing. It showcased the world of the Amazon warriors. It was unique in the often cookie-cutter super hero origin stories. Patty Jenkins did a good job of framing it, but I think the character's origin story dating back to the comics has always been unique in comparison to other super heroes.\r\n\r\nThe result is that the first third or so of the movie is satisfying--despite dull performances from Gal Gadot and Chris Pine (who had zero chemistry as a couple). But once we leave the confines of the island and enter the real world, the movie becomes hit or miss. WWI (that's right, WWI now, not WWII. The reason for the change in setting is never apparent) London is portrayed in a way that is almost a distraction. Yes, the world isn't white washed; diversity is a thing--a wonderful thing at that. But DC's version of Captain America's Howling Commandos consist of an Arab and an American Indian. Diversity for diversity's sake becomes distracting--especially when paired with a low-rent Simon Pegg whose soul function is being a deadly sniper who never fires his weapon (that's helpful on a top-secret mission behind enemy lines). \r\n\r\nIt's almost as if the movie telegraphs all of these unnecessary plot hiccups to remind you that this is a super hero film, and no matter how much the mortal humans fail, it will all be okay because the super hero will save the day. \r\n\r\nThe dialogue can be clichéd at times, and the final theme of the movie--one of love conquering all and the acknowledgement that, overall, mankind is good, is laughable in it's amateur preachiness. \r\n\r\nBut what the film lacks in substance and script, it makes up for in the visuals. I found the action sequences to be great fun. Heavily stylized \"Matrix-style\" fight scenes seem right at home in a film about super hero Gods. The freeze frames worked too--as fight sequences froze in over-the-top super hero poses that harkened back to the source material's comic book roots.\r\n\r\nThe final confrontation between Wonder Woman and Ares--while dragging on a little long--was well done, being one of the few super hero movie climaxes that delivered. \r\n\r\nWhile aspects of the movie were so similar (Hell! Identical!) to Captain America: The First Avenger, I actually felt embarrassed for the filmmakers, I did come away thinking this was the movie Captain America should have been. It succeeded in places where Captain America failed miserably. \r\n\r\nThe movie is entertainment--pure, fun, pop-corn-gobbling entertainment. In that realm, it succeeds and succeeds well. But as a piece of cinematic art, it falls flat on its face with too many plot holes, script inconsistencies, clichés and mediocre acting. Wonder Woman will be an important movie for both the DCEU and the summer of 2017. But it lacks the magic and staying power of Nolan and Donner's contributions to DC comics' films.", "created_at": "2017-06-05T17:07:18.493Z"}, {"movie_id": 297762, "review_id": "595e4493c3a36828fc07d0e7", "author_rating": 6.0, "review_text": "I like the portrayal of the Greek/Amazonian myth; the part where Chris Pine is naked; the part where Wonder Woman overturns the tank; and the post-battle dance scene with her and Steve Trevor, and that's it.\r\n\r\nThis could be mistaken for a mediocre, melodramatic, cheesy TV movie. Visually, it's less interesting than any of the other nu-DC fare; I never thought I'd miss Zach Snyder's sensibility but I did in this flick. Storywise, it may be a step up from the rest of the DCEU, but it still barely rivals the worst of the Marvel movies. Gal Gadot can't act, and Chris Pine couldn't make the clunky dialogue sound not ridiculous.\r\n\r\nWonder Woman is tolerable. That's more than can be said for the other nu-DC movies but it's not a compliment.", "created_at": "2017-07-06T14:09:23.723Z"}, {"movie_id": 297762, "review_id": "59fb1990c3a3681adf00e576", "author_rating": 8.0, "review_text": "I quite enjoyed this movie. When I learned that Zack Snyder had his fingers in it I got a worried since he recently wrote such atrocities as Batman vs Superman and sure enough the story is a really the weakest part of the movie. A typical nonsensical, unintelligent, Hollywood story/script were you are better off putting your brain in idle when watching it.\n\nHowever it makes up for this with cool special effects and, surprisingly, quite enjoyable characters. This is definitely a movie that you watch for the sake of the special effects. Well, if you are a male teenager you might also be watching it to drool over Gal Gadot of course (I have to admit that she is hot).\n\nThere is not too much to say about the plot. Our Amazon hot chick discovers that there is a war going on and goes out to stop it. Since she has been overly protected by her guardian she is amazingly clueless about life outside of her little island. Especially aspects involving men. Something which creates some funny moments as well as some embarrassingly silly ones. This, Diana’s gradual evolution where she not only is learning about life but also discovers her considerable powers, is one of the enjoyable aspects of the movie though. It is of course also one of the dummer aspects of the movie. How the f… could the Amazon Queen race Diana to be so ignorant about everything?\n\nAnother not so enjoyable part of the movie is the ludicrous scenes where the britts are trying to obtain peace at all costs as well as the stereotypical portrayal of Ludendorff as some megalomaniacal, half crazy war-mongerer. This was just dumb. I guess Zac Snyder just picked the name out of some history book without bothering to read up on the character. Typical lack of intelligence and respect, a la Hollywood, for anything outside of their, very limited, sphere of knowledge.\nWell, at least Danny Huston did a pretty decent job of the shitty role he was given. So did most of the rest of actors. I definitely liked Gal Gadot as Super Woman but then, although I am not a teenager, I am still a male so maybe I am biased when it comes to her?\n\nI definitely liked the special effects. The showdown at the end was great as far as I am concerned and the rest not bad either. They could have been even better though if it would not have been so obvious that the Germans where mostly incompetent extras waiting for Wonder Woman to show off her gymnastics and slow motion abilities. Come on, even superhero special effects should make some pretense of being “realistic” superhero special effects.\n\nThe movie is definitely aimed at the young adult segment. Unfortunately it do not seem to know what it is aiming for. Sometimes it is almost adult, sometimes it is late teen and sometimes just so bloody TV-show silly that you’re wondering if it is aiming for even pre-teens.\n\nAnyway, regardless of its faults I did enjoy my 2+ hour spent on this movie. Enough to give it a 4 out of 5 rating", "created_at": "2017-11-02T13:11:44.783Z"}, {"movie_id": 297762, "review_id": "5a1ec3880e0a264cc807f241", "author_rating": 8.0, "review_text": "**The Amazonian princess Diana's quest-come-self-discovery!**\r\n\r\nFrom all the superhero films, this was one of the most anticipated. Mainly because of the woman oriented theme. People were desperate to see the solo woman superhero. Today, we have the great visual effects technology, that anything can be possible to bring on to the screen. And actress like Gal Gadot, even better it gets. Yes, it was a wonderful film. A simple storyline, but a well made film.\r\n\r\nThe Amazonians who are cut off from the rest of the world, is preparing for the battle if Ares returns. All these years nothing has happened, but one day a fighter pilot crash on the cost of their island. Then the princess embark a journey back with him to find, and end the Ares threat forever. But she only ends up in the WWII, and what happens in the following sequence are the rest of the film.\r\n\r\nWho would have done a better job than Patty Jenkins. She nailed it, and so set to direct the sequel too. Even the supporting cast was good. DC's visuals always high standards and so this one. Action sequences too amazing. There's lots of changes in the character, as well as in everything. Firstly a nice superhero costume. And connections like Diana's father, the island, all pretty nicely written out. The DC universe just got extended. I can't wait to see 'Justice League'.\r\n\r\n**8/10**", "created_at": "2017-11-29T14:26:16.149Z"}, {"movie_id": 297762, "review_id": "5cc1fbb7c3a36809ab850931", "author_rating": null, "review_text": "***Wonder Woman and Captain Steve Trevor seek to end WW1***\r\n\r\nNear the end of WW1, an American spy (Chris Pine) is chased by Germans to the hidden island of Amazonian women created by Zeus to protect mankind. The princess of the island (Gal Gadot) leaves with the captain to help end the Great War and destroy Ares forever.\r\n\r\n\"Wonder Woman\" (2017) combines the Wonder Woman TV series (1975-1979) with elements of “All Quiet on the Western Front” (1979), \"Raiders of the Lost Ark\" (1981), “The Dirty Dozen” (1967), “Captain America: The First Avenger” (2011) and “Man of Steel” (2013). It’s a well done modern superhero flick and superior to both “The First Avenger” and “Man of Steel.”\r\n\r\nThe opening paradisal island sequence is good without overstaying its welcome. The story really picks up when Captain Steve Trevor and Diana depart the island. They have great chemistry and their relationship adds human interest. \r\n\r\nUnlike “Man of Steel,” which devolved into super-beings constantly pulverizing each other in the second half, “Wonder Woman” has the poise to take its time and establish an interesting assortment of characters. The entire midsection is great, but the last act, to be expected, comes down to two super-beings pounding each other. But at least the creators tried to add a weighty moral.  \r\n\r\nThe film runs 2 hours, 21 minutes.\r\n\r\nGRADE: B", "created_at": "2019-04-25T18:25:59.768Z"}, {"movie_id": 297762, "review_id": "6050898a8c7b0f002856af28", "author_rating": 8.0, "review_text": "I was wrong about Gal Gadot taking the role as Diana Prince/Wonder Woman since BvS. She was not bad.\r\nThen this film, her standalone film, really brought emphasis on female empowerment.", "created_at": "2021-03-16T10:33:46.946Z"}, {"movie_id": 297762, "review_id": "61397d1e22df2e002a859805", "author_rating": null, "review_text": "Such a really nice one & Gal Gadot is the perfect Wonder Woman", "created_at": "2021-09-09T03:18:54.337Z"}, {"movie_id": 297762, "review_id": "618822c835d1bc008c940875", "author_rating": 10.0, "review_text": "I truly enjoyed Wonder Woman after Diana’s BvS intro with that amazing theme music.\r\nI was disappointed Diana didn’t have the bullets and bracelets contest to return Steve to Man’s World.\r\nDirector Patty Jenkins must have watched Justice League the animated series because Diana stole her costume in that episode.\r\nI read moviegoers review  the 3rd act as a heavy CGI fest but but butt Diana’s a demi god fighting Ares,the God of War certainly they wouldn’t be mimicking a Saturday morning WWE wrestling match.\r\nTraveling by ship instead of invisible plane was another missed opportunity to stay true to the CB.\r\nThe Themyscria healing waters was okay I would have liked the Purple Healing Ray - but but butt Director Patty Jenkins kept with the au naturel order of Mother Earth no guns, no electricity, no meat/fish only fruits and vegetables honouring the harvest goddess.\r\n10/10", "created_at": "2021-11-07T19:02:32.777Z"}, {"movie_id": 297762, "review_id": "630013f03af929007ad09e07", "author_rating": 9.0, "review_text": "**Overall : Wonder Woman exceeds the high expectations of existing fans while winning new fans with its amazing action, fantastic visuals, and sincere characters.**\r\n\r\nZack Snyder’s casting of Gal Gadot as Wonder Woman was a masterstroke that shined in its full brilliance in this film. While I had high hopes for Patty Jenkins’ Wonder Woman, I didn’t expect this kind of excellence! Gal Gadot delighted as the powerful yet compassionate Diana. Jenkins carried that balance of elegance and strength throughout the entire film. The No Man’s Land scene stands out as one of the best action scenes in a comic book movie. Wonder Woman is full of fun, action, grace, and significance, making it a true stand-out in the ever-growing ocean of comic book films.", "created_at": "2022-08-19T22:51:28.992Z"}, {"movie_id": 297762, "review_id": "63c21eff17b5ef00a7fbb6ad", "author_rating": 10.0, "review_text": "OK, calm down....I am going to address the \"controversy\" around this first...and I can't believe I just had to write that. It's freaking Wonder Woman!!!!! I can see the X-Men being controversial, what with being primarily about Civil Rights and equality for minorities...but this is DC Comics.\r\n\r\nOK, so let me put it this way...\r\n\r\n...I do NOT think that Wonder Woman is the greatest female protagonist in an action movie or sci-fi movies...and I am NOT a misogynist.\r\n\r\nMy \"lack of respect\" of Wonder Woman doesn't stem from a hatred of strong female leads...I just think Sarah Conner (Especially in \"Terminator the Sarah Conner Chronicles\") is the absolute coolest and most bada$$ strong female lead that has ever graced the silver screen or your home television.\r\n\r\nNot only that, I was livid when it got canceled and, for the cherry on top, if you want a strong female role model...have one with the cold soldier discipline and the willingness to sacrifice her life for the mission that Sarah Conner has.\r\n\r\nNot only that, but to be further controversial, I don't believe that Wonder Woman is the first awesome strong female lead in an action movie. I mean, Ellen Ripely is almost as pure awesome as Sarah Conner...and who can forget Buffy, OK Buffy is touchy, when I mention her I am talking about Buffy from the TV show, not Buffy from the movie.\r\n\r\nThose are only to name a few. And then there are lesser ones that we hate yet still came before Wonder Woman....most recently the Ghost Busters and Mary Sue from the new Star Wars.\r\n\r\nSo cool down on the politics...people that don't think Wonder Woman is the greatest female lead aren't necessarily misogynists forcing a male agenda....they may just be aware of Sarah Conner and Echo.\r\n\r\nNow...back to Wonder Woman.\r\n\r\nWHY DOES IT HAVE TO BE DARK, REALISTIC, AND GRITTY?!?!?! Seriously, I only like one (1) of the Nolan Batman movies and...Wonder Woman and Superman and the Justice League are NOT Batman.\r\n\r\nI don't want to sit through a Super Hero movie that is bucking for ultra-realistic. If I wanted that, I'd see a drama.\r\n\r\nThere are few super heroes that you can go totally dark and Gritty with, Batman, Dare Devil, Green Arrow....\r\n\r\nSpeaking of Green Arrow, notice how he was dark and the Flash wasn't? Why can the WB understand this but not the film department? What you have here is a director trying to make a Batman movie using Wonder Woman and that doesn't work. If I want a dark and gritty female action protagonist I already have the Terminator and Alien franchises.\r\n\r\nthe director, the studio, the writers should have concentrated more on making a Wonder Woman film and not another Batman movie...this failed for the same reason Batman V Superman did.", "created_at": "2023-01-14T03:18:23.649Z"}, {"movie_id": 297762, "review_id": "59303b4c92514166e9000f76", "author_rating": 7.0, "review_text": "I'd just like to thank Patty Jenkins for making a DCIThoughtSheWasWithUniverse movie that wasn't fucking garbage.\r\n\r\nIf I'm being completely honest, the two people I went to the cinema to watch _Wonder Woman_ with and I did spend the next two hours after coming out of our screening discussing the various problems with the movie, but we also all agreed on one thing: We still loved it.\r\n\r\nMaybe it's just the rose-coloured glasses of comparison, but I had an excellent time with _Wonder Woman_, and I'm excited to go back to the cinema and watch it, at least one more time.\r\n\r\nIt's the first time I've said that about a DC movie since _The Dark Knight Rises_.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-06-01T16:05:32.067Z"}, {"movie_id": 297762, "review_id": "593476aec3a3685a2402386d", "author_rating": 9.0, "review_text": "**The First Great DCEU Film**\r\n\r\nThis film is the origin story of Diana Prince/Wonder Woman (Gal Gadot), who was first introduced in Batman v. Superman last year. She is born and trained on Themyscira, the hidden island where the powerful warrior women known as the Amazons live. One day, Steve Trevor (Chris Pine), an American World War I spy, crashes off the coast of Themyscira and is rescued by Diana and the two team up to take down Ares, the God of War, and the Germans, who are developing a very deadly form of mustard gas. There are fantastic action sequences in this film, especially by Gal Gadot. It's amazing to see her single-handedly storm the German front, inspiring the Allies to fight with her. Gadot takes over from the legendary Linda Carter and makes the role her own. She has great chemistry with Pine. They are complete equals in this film. It's refreshing to see the female lead in a superhero film not be the love interest. The only negative part of the film are the lackluster villains. Hopefully, Wonder Woman will have more formidable foes in future films.", "created_at": "2017-06-04T21:07:58.016Z"}, {"movie_id": 297762, "review_id": "59358fc692514174a1000015", "author_rating": 6.0, "review_text": "**DC Hits A...Bunt. But compared to the strikeouts, a bunt seems impressive.**\r\n\r\nWonder Woman had some things working for it--things other comic book movies have faltered on. But it had a lot of things not working for it too. The result is an average median between what works and what doesn't. While the film is spectacular within the struggling DCEU, as a stand alone film it's mediocre at best. \r\n\r\nDiana's origin story--how she came to be and how she came to be a super hero was refreshing. It showcased the world of the Amazon warriors. It was unique in the often cookie-cutter super hero origin stories. Patty Jenkins did a good job of framing it, but I think the character's origin story dating back to the comics has always been unique in comparison to other super heroes.\r\n\r\nThe result is that the first third or so of the movie is satisfying--despite dull performances from Gal Gadot and Chris Pine (who had zero chemistry as a couple). But once we leave the confines of the island and enter the real world, the movie becomes hit or miss. WWI (that's right, WWI now, not WWII. The reason for the change in setting is never apparent) London is portrayed in a way that is almost a distraction. Yes, the world isn't white washed; diversity is a thing--a wonderful thing at that. But DC's version of Captain America's Howling Commandos consist of an Arab and an American Indian. Diversity for diversity's sake becomes distracting--especially when paired with a low-rent Simon Pegg whose soul function is being a deadly sniper who never fires his weapon (that's helpful on a top-secret mission behind enemy lines). \r\n\r\nIt's almost as if the movie telegraphs all of these unnecessary plot hiccups to remind you that this is a super hero film, and no matter how much the mortal humans fail, it will all be okay because the super hero will save the day. \r\n\r\nThe dialogue can be clichéd at times, and the final theme of the movie--one of love conquering all and the acknowledgement that, overall, mankind is good, is laughable in it's amateur preachiness. \r\n\r\nBut what the film lacks in substance and script, it makes up for in the visuals. I found the action sequences to be great fun. Heavily stylized \"Matrix-style\" fight scenes seem right at home in a film about super hero Gods. The freeze frames worked too--as fight sequences froze in over-the-top super hero poses that harkened back to the source material's comic book roots.\r\n\r\nThe final confrontation between Wonder Woman and Ares--while dragging on a little long--was well done, being one of the few super hero movie climaxes that delivered. \r\n\r\nWhile aspects of the movie were so similar (Hell! Identical!) to Captain America: The First Avenger, I actually felt embarrassed for the filmmakers, I did come away thinking this was the movie Captain America should have been. It succeeded in places where Captain America failed miserably. \r\n\r\nThe movie is entertainment--pure, fun, pop-corn-gobbling entertainment. In that realm, it succeeds and succeeds well. But as a piece of cinematic art, it falls flat on its face with too many plot holes, script inconsistencies, clichés and mediocre acting. Wonder Woman will be an important movie for both the DCEU and the summer of 2017. But it lacks the magic and staying power of Nolan and Donner's contributions to DC comics' films.", "created_at": "2017-06-05T17:07:18.493Z"}, {"movie_id": 297762, "review_id": "595e4493c3a36828fc07d0e7", "author_rating": 6.0, "review_text": "I like the portrayal of the Greek/Amazonian myth; the part where Chris Pine is naked; the part where Wonder Woman overturns the tank; and the post-battle dance scene with her and Steve Trevor, and that's it.\r\n\r\nThis could be mistaken for a mediocre, melodramatic, cheesy TV movie. Visually, it's less interesting than any of the other nu-DC fare; I never thought I'd miss Zach Snyder's sensibility but I did in this flick. Storywise, it may be a step up from the rest of the DCEU, but it still barely rivals the worst of the Marvel movies. Gal Gadot can't act, and Chris Pine couldn't make the clunky dialogue sound not ridiculous.\r\n\r\nWonder Woman is tolerable. That's more than can be said for the other nu-DC movies but it's not a compliment.", "created_at": "2017-07-06T14:09:23.723Z"}, {"movie_id": 297762, "review_id": "59fb1990c3a3681adf00e576", "author_rating": 8.0, "review_text": "I quite enjoyed this movie. When I learned that Zack Snyder had his fingers in it I got a worried since he recently wrote such atrocities as Batman vs Superman and sure enough the story is a really the weakest part of the movie. A typical nonsensical, unintelligent, Hollywood story/script were you are better off putting your brain in idle when watching it.\n\nHowever it makes up for this with cool special effects and, surprisingly, quite enjoyable characters. This is definitely a movie that you watch for the sake of the special effects. Well, if you are a male teenager you might also be watching it to drool over Gal Gadot of course (I have to admit that she is hot).\n\nThere is not too much to say about the plot. Our Amazon hot chick discovers that there is a war going on and goes out to stop it. Since she has been overly protected by her guardian she is amazingly clueless about life outside of her little island. Especially aspects involving men. Something which creates some funny moments as well as some embarrassingly silly ones. This, Diana’s gradual evolution where she not only is learning about life but also discovers her considerable powers, is one of the enjoyable aspects of the movie though. It is of course also one of the dummer aspects of the movie. How the f… could the Amazon Queen race Diana to be so ignorant about everything?\n\nAnother not so enjoyable part of the movie is the ludicrous scenes where the britts are trying to obtain peace at all costs as well as the stereotypical portrayal of Ludendorff as some megalomaniacal, half crazy war-mongerer. This was just dumb. I guess Zac Snyder just picked the name out of some history book without bothering to read up on the character. Typical lack of intelligence and respect, a la Hollywood, for anything outside of their, very limited, sphere of knowledge.\nWell, at least Danny Huston did a pretty decent job of the shitty role he was given. So did most of the rest of actors. I definitely liked Gal Gadot as Super Woman but then, although I am not a teenager, I am still a male so maybe I am biased when it comes to her?\n\nI definitely liked the special effects. The showdown at the end was great as far as I am concerned and the rest not bad either. They could have been even better though if it would not have been so obvious that the Germans where mostly incompetent extras waiting for Wonder Woman to show off her gymnastics and slow motion abilities. Come on, even superhero special effects should make some pretense of being “realistic” superhero special effects.\n\nThe movie is definitely aimed at the young adult segment. Unfortunately it do not seem to know what it is aiming for. Sometimes it is almost adult, sometimes it is late teen and sometimes just so bloody TV-show silly that you’re wondering if it is aiming for even pre-teens.\n\nAnyway, regardless of its faults I did enjoy my 2+ hour spent on this movie. Enough to give it a 4 out of 5 rating", "created_at": "2017-11-02T13:11:44.783Z"}, {"movie_id": 297762, "review_id": "5a1ec3880e0a264cc807f241", "author_rating": 8.0, "review_text": "**The Amazonian princess Diana's quest-come-self-discovery!**\r\n\r\nFrom all the superhero films, this was one of the most anticipated. Mainly because of the woman oriented theme. People were desperate to see the solo woman superhero. Today, we have the great visual effects technology, that anything can be possible to bring on to the screen. And actress like Gal Gadot, even better it gets. Yes, it was a wonderful film. A simple storyline, but a well made film.\r\n\r\nThe Amazonians who are cut off from the rest of the world, is preparing for the battle if Ares returns. All these years nothing has happened, but one day a fighter pilot crash on the cost of their island. Then the princess embark a journey back with him to find, and end the Ares threat forever. But she only ends up in the WWII, and what happens in the following sequence are the rest of the film.\r\n\r\nWho would have done a better job than Patty Jenkins. She nailed it, and so set to direct the sequel too. Even the supporting cast was good. DC's visuals always high standards and so this one. Action sequences too amazing. There's lots of changes in the character, as well as in everything. Firstly a nice superhero costume. And connections like Diana's father, the island, all pretty nicely written out. The DC universe just got extended. I can't wait to see 'Justice League'.\r\n\r\n**8/10**", "created_at": "2017-11-29T14:26:16.149Z"}, {"movie_id": 297762, "review_id": "5cc1fbb7c3a36809ab850931", "author_rating": null, "review_text": "***Wonder Woman and Captain Steve Trevor seek to end WW1***\r\n\r\nNear the end of WW1, an American spy (Chris Pine) is chased by Germans to the hidden island of Amazonian women created by Zeus to protect mankind. The princess of the island (Gal Gadot) leaves with the captain to help end the Great War and destroy Ares forever.\r\n\r\n\"Wonder Woman\" (2017) combines the Wonder Woman TV series (1975-1979) with elements of “All Quiet on the Western Front” (1979), \"Raiders of the Lost Ark\" (1981), “The Dirty Dozen” (1967), “Captain America: The First Avenger” (2011) and “Man of Steel” (2013). It’s a well done modern superhero flick and superior to both “The First Avenger” and “Man of Steel.”\r\n\r\nThe opening paradisal island sequence is good without overstaying its welcome. The story really picks up when Captain Steve Trevor and Diana depart the island. They have great chemistry and their relationship adds human interest. \r\n\r\nUnlike “Man of Steel,” which devolved into super-beings constantly pulverizing each other in the second half, “Wonder Woman” has the poise to take its time and establish an interesting assortment of characters. The entire midsection is great, but the last act, to be expected, comes down to two super-beings pounding each other. But at least the creators tried to add a weighty moral.  \r\n\r\nThe film runs 2 hours, 21 minutes.\r\n\r\nGRADE: B", "created_at": "2019-04-25T18:25:59.768Z"}, {"movie_id": 297762, "review_id": "6050898a8c7b0f002856af28", "author_rating": 8.0, "review_text": "I was wrong about Gal Gadot taking the role as Diana Prince/Wonder Woman since BvS. She was not bad.\r\nThen this film, her standalone film, really brought emphasis on female empowerment.", "created_at": "2021-03-16T10:33:46.946Z"}, {"movie_id": 297762, "review_id": "61397d1e22df2e002a859805", "author_rating": null, "review_text": "Such a really nice one & Gal Gadot is the perfect Wonder Woman", "created_at": "2021-09-09T03:18:54.337Z"}, {"movie_id": 297762, "review_id": "618822c835d1bc008c940875", "author_rating": 10.0, "review_text": "I truly enjoyed Wonder Woman after Diana’s BvS intro with that amazing theme music.\r\nI was disappointed Diana didn’t have the bullets and bracelets contest to return Steve to Man’s World.\r\nDirector Patty Jenkins must have watched Justice League the animated series because Diana stole her costume in that episode.\r\nI read moviegoers review  the 3rd act as a heavy CGI fest but but butt Diana’s a demi god fighting Ares,the God of War certainly they wouldn’t be mimicking a Saturday morning WWE wrestling match.\r\nTraveling by ship instead of invisible plane was another missed opportunity to stay true to the CB.\r\nThe Themyscria healing waters was okay I would have liked the Purple Healing Ray - but but butt Director Patty Jenkins kept with the au naturel order of Mother Earth no guns, no electricity, no meat/fish only fruits and vegetables honouring the harvest goddess.\r\n10/10", "created_at": "2021-11-07T19:02:32.777Z"}, {"movie_id": 297762, "review_id": "630013f03af929007ad09e07", "author_rating": 9.0, "review_text": "**Overall : Wonder Woman exceeds the high expectations of existing fans while winning new fans with its amazing action, fantastic visuals, and sincere characters.**\r\n\r\nZack Snyder’s casting of Gal Gadot as Wonder Woman was a masterstroke that shined in its full brilliance in this film. While I had high hopes for Patty Jenkins’ Wonder Woman, I didn’t expect this kind of excellence! Gal Gadot delighted as the powerful yet compassionate Diana. Jenkins carried that balance of elegance and strength throughout the entire film. The No Man’s Land scene stands out as one of the best action scenes in a comic book movie. Wonder Woman is full of fun, action, grace, and significance, making it a true stand-out in the ever-growing ocean of comic book films.", "created_at": "2022-08-19T22:51:28.992Z"}, {"movie_id": 297762, "review_id": "63c21eff17b5ef00a7fbb6ad", "author_rating": 10.0, "review_text": "OK, calm down....I am going to address the \"controversy\" around this first...and I can't believe I just had to write that. It's freaking Wonder Woman!!!!! I can see the X-Men being controversial, what with being primarily about Civil Rights and equality for minorities...but this is DC Comics.\r\n\r\nOK, so let me put it this way...\r\n\r\n...I do NOT think that Wonder Woman is the greatest female protagonist in an action movie or sci-fi movies...and I am NOT a misogynist.\r\n\r\nMy \"lack of respect\" of Wonder Woman doesn't stem from a hatred of strong female leads...I just think Sarah Conner (Especially in \"Terminator the Sarah Conner Chronicles\") is the absolute coolest and most bada$$ strong female lead that has ever graced the silver screen or your home television.\r\n\r\nNot only that, I was livid when it got canceled and, for the cherry on top, if you want a strong female role model...have one with the cold soldier discipline and the willingness to sacrifice her life for the mission that Sarah Conner has.\r\n\r\nNot only that, but to be further controversial, I don't believe that Wonder Woman is the first awesome strong female lead in an action movie. I mean, Ellen Ripely is almost as pure awesome as Sarah Conner...and who can forget Buffy, OK Buffy is touchy, when I mention her I am talking about Buffy from the TV show, not Buffy from the movie.\r\n\r\nThose are only to name a few. And then there are lesser ones that we hate yet still came before Wonder Woman....most recently the Ghost Busters and Mary Sue from the new Star Wars.\r\n\r\nSo cool down on the politics...people that don't think Wonder Woman is the greatest female lead aren't necessarily misogynists forcing a male agenda....they may just be aware of Sarah Conner and Echo.\r\n\r\nNow...back to Wonder Woman.\r\n\r\nWHY DOES IT HAVE TO BE DARK, REALISTIC, AND GRITTY?!?!?! Seriously, I only like one (1) of the Nolan Batman movies and...Wonder Woman and Superman and the Justice League are NOT Batman.\r\n\r\nI don't want to sit through a Super Hero movie that is bucking for ultra-realistic. If I wanted that, I'd see a drama.\r\n\r\nThere are few super heroes that you can go totally dark and Gritty with, Batman, Dare Devil, Green Arrow....\r\n\r\nSpeaking of Green Arrow, notice how he was dark and the Flash wasn't? Why can the WB understand this but not the film department? What you have here is a director trying to make a Batman movie using Wonder Woman and that doesn't work. If I want a dark and gritty female action protagonist I already have the Terminator and Alien franchises.\r\n\r\nthe director, the studio, the writers should have concentrated more on making a Wonder Woman film and not another Batman movie...this failed for the same reason Batman V Superman did.", "created_at": "2023-01-14T03:18:23.649Z"}, {"movie_id": 297762, "review_id": "59303b4c92514166e9000f76", "author_rating": 7.0, "review_text": "I'd just like to thank Patty Jenkins for making a DCIThoughtSheWasWithUniverse movie that wasn't fucking garbage.\r\n\r\nIf I'm being completely honest, the two people I went to the cinema to watch _Wonder Woman_ with and I did spend the next two hours after coming out of our screening discussing the various problems with the movie, but we also all agreed on one thing: We still loved it.\r\n\r\nMaybe it's just the rose-coloured glasses of comparison, but I had an excellent time with _Wonder Woman_, and I'm excited to go back to the cinema and watch it, at least one more time.\r\n\r\nIt's the first time I've said that about a DC movie since _The Dark Knight Rises_.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-06-01T16:05:32.067Z"}, {"movie_id": 297762, "review_id": "593476aec3a3685a2402386d", "author_rating": 9.0, "review_text": "**The First Great DCEU Film**\r\n\r\nThis film is the origin story of Diana Prince/Wonder Woman (Gal Gadot), who was first introduced in Batman v. Superman last year. She is born and trained on Themyscira, the hidden island where the powerful warrior women known as the Amazons live. One day, Steve Trevor (Chris Pine), an American World War I spy, crashes off the coast of Themyscira and is rescued by Diana and the two team up to take down Ares, the God of War, and the Germans, who are developing a very deadly form of mustard gas. There are fantastic action sequences in this film, especially by Gal Gadot. It's amazing to see her single-handedly storm the German front, inspiring the Allies to fight with her. Gadot takes over from the legendary Linda Carter and makes the role her own. She has great chemistry with Pine. They are complete equals in this film. It's refreshing to see the female lead in a superhero film not be the love interest. The only negative part of the film are the lackluster villains. Hopefully, Wonder Woman will have more formidable foes in future films.", "created_at": "2017-06-04T21:07:58.016Z"}, {"movie_id": 297762, "review_id": "59358fc692514174a1000015", "author_rating": 6.0, "review_text": "**DC Hits A...Bunt. But compared to the strikeouts, a bunt seems impressive.**\r\n\r\nWonder Woman had some things working for it--things other comic book movies have faltered on. But it had a lot of things not working for it too. The result is an average median between what works and what doesn't. While the film is spectacular within the struggling DCEU, as a stand alone film it's mediocre at best. \r\n\r\nDiana's origin story--how she came to be and how she came to be a super hero was refreshing. It showcased the world of the Amazon warriors. It was unique in the often cookie-cutter super hero origin stories. Patty Jenkins did a good job of framing it, but I think the character's origin story dating back to the comics has always been unique in comparison to other super heroes.\r\n\r\nThe result is that the first third or so of the movie is satisfying--despite dull performances from Gal Gadot and Chris Pine (who had zero chemistry as a couple). But once we leave the confines of the island and enter the real world, the movie becomes hit or miss. WWI (that's right, WWI now, not WWII. The reason for the change in setting is never apparent) London is portrayed in a way that is almost a distraction. Yes, the world isn't white washed; diversity is a thing--a wonderful thing at that. But DC's version of Captain America's Howling Commandos consist of an Arab and an American Indian. Diversity for diversity's sake becomes distracting--especially when paired with a low-rent Simon Pegg whose soul function is being a deadly sniper who never fires his weapon (that's helpful on a top-secret mission behind enemy lines). \r\n\r\nIt's almost as if the movie telegraphs all of these unnecessary plot hiccups to remind you that this is a super hero film, and no matter how much the mortal humans fail, it will all be okay because the super hero will save the day. \r\n\r\nThe dialogue can be clichéd at times, and the final theme of the movie--one of love conquering all and the acknowledgement that, overall, mankind is good, is laughable in it's amateur preachiness. \r\n\r\nBut what the film lacks in substance and script, it makes up for in the visuals. I found the action sequences to be great fun. Heavily stylized \"Matrix-style\" fight scenes seem right at home in a film about super hero Gods. The freeze frames worked too--as fight sequences froze in over-the-top super hero poses that harkened back to the source material's comic book roots.\r\n\r\nThe final confrontation between Wonder Woman and Ares--while dragging on a little long--was well done, being one of the few super hero movie climaxes that delivered. \r\n\r\nWhile aspects of the movie were so similar (Hell! Identical!) to Captain America: The First Avenger, I actually felt embarrassed for the filmmakers, I did come away thinking this was the movie Captain America should have been. It succeeded in places where Captain America failed miserably. \r\n\r\nThe movie is entertainment--pure, fun, pop-corn-gobbling entertainment. In that realm, it succeeds and succeeds well. But as a piece of cinematic art, it falls flat on its face with too many plot holes, script inconsistencies, clichés and mediocre acting. Wonder Woman will be an important movie for both the DCEU and the summer of 2017. But it lacks the magic and staying power of Nolan and Donner's contributions to DC comics' films.", "created_at": "2017-06-05T17:07:18.493Z"}, {"movie_id": 297762, "review_id": "595e4493c3a36828fc07d0e7", "author_rating": 6.0, "review_text": "I like the portrayal of the Greek/Amazonian myth; the part where Chris Pine is naked; the part where Wonder Woman overturns the tank; and the post-battle dance scene with her and Steve Trevor, and that's it.\r\n\r\nThis could be mistaken for a mediocre, melodramatic, cheesy TV movie. Visually, it's less interesting than any of the other nu-DC fare; I never thought I'd miss Zach Snyder's sensibility but I did in this flick. Storywise, it may be a step up from the rest of the DCEU, but it still barely rivals the worst of the Marvel movies. Gal Gadot can't act, and Chris Pine couldn't make the clunky dialogue sound not ridiculous.\r\n\r\nWonder Woman is tolerable. That's more than can be said for the other nu-DC movies but it's not a compliment.", "created_at": "2017-07-06T14:09:23.723Z"}, {"movie_id": 297762, "review_id": "59fb1990c3a3681adf00e576", "author_rating": 8.0, "review_text": "I quite enjoyed this movie. When I learned that Zack Snyder had his fingers in it I got a worried since he recently wrote such atrocities as Batman vs Superman and sure enough the story is a really the weakest part of the movie. A typical nonsensical, unintelligent, Hollywood story/script were you are better off putting your brain in idle when watching it.\n\nHowever it makes up for this with cool special effects and, surprisingly, quite enjoyable characters. This is definitely a movie that you watch for the sake of the special effects. Well, if you are a male teenager you might also be watching it to drool over Gal Gadot of course (I have to admit that she is hot).\n\nThere is not too much to say about the plot. Our Amazon hot chick discovers that there is a war going on and goes out to stop it. Since she has been overly protected by her guardian she is amazingly clueless about life outside of her little island. Especially aspects involving men. Something which creates some funny moments as well as some embarrassingly silly ones. This, Diana’s gradual evolution where she not only is learning about life but also discovers her considerable powers, is one of the enjoyable aspects of the movie though. It is of course also one of the dummer aspects of the movie. How the f… could the Amazon Queen race Diana to be so ignorant about everything?\n\nAnother not so enjoyable part of the movie is the ludicrous scenes where the britts are trying to obtain peace at all costs as well as the stereotypical portrayal of Ludendorff as some megalomaniacal, half crazy war-mongerer. This was just dumb. I guess Zac Snyder just picked the name out of some history book without bothering to read up on the character. Typical lack of intelligence and respect, a la Hollywood, for anything outside of their, very limited, sphere of knowledge.\nWell, at least Danny Huston did a pretty decent job of the shitty role he was given. So did most of the rest of actors. I definitely liked Gal Gadot as Super Woman but then, although I am not a teenager, I am still a male so maybe I am biased when it comes to her?\n\nI definitely liked the special effects. The showdown at the end was great as far as I am concerned and the rest not bad either. They could have been even better though if it would not have been so obvious that the Germans where mostly incompetent extras waiting for Wonder Woman to show off her gymnastics and slow motion abilities. Come on, even superhero special effects should make some pretense of being “realistic” superhero special effects.\n\nThe movie is definitely aimed at the young adult segment. Unfortunately it do not seem to know what it is aiming for. Sometimes it is almost adult, sometimes it is late teen and sometimes just so bloody TV-show silly that you’re wondering if it is aiming for even pre-teens.\n\nAnyway, regardless of its faults I did enjoy my 2+ hour spent on this movie. Enough to give it a 4 out of 5 rating", "created_at": "2017-11-02T13:11:44.783Z"}, {"movie_id": 297762, "review_id": "5a1ec3880e0a264cc807f241", "author_rating": 8.0, "review_text": "**The Amazonian princess Diana's quest-come-self-discovery!**\r\n\r\nFrom all the superhero films, this was one of the most anticipated. Mainly because of the woman oriented theme. People were desperate to see the solo woman superhero. Today, we have the great visual effects technology, that anything can be possible to bring on to the screen. And actress like Gal Gadot, even better it gets. Yes, it was a wonderful film. A simple storyline, but a well made film.\r\n\r\nThe Amazonians who are cut off from the rest of the world, is preparing for the battle if Ares returns. All these years nothing has happened, but one day a fighter pilot crash on the cost of their island. Then the princess embark a journey back with him to find, and end the Ares threat forever. But she only ends up in the WWII, and what happens in the following sequence are the rest of the film.\r\n\r\nWho would have done a better job than Patty Jenkins. She nailed it, and so set to direct the sequel too. Even the supporting cast was good. DC's visuals always high standards and so this one. Action sequences too amazing. There's lots of changes in the character, as well as in everything. Firstly a nice superhero costume. And connections like Diana's father, the island, all pretty nicely written out. The DC universe just got extended. I can't wait to see 'Justice League'.\r\n\r\n**8/10**", "created_at": "2017-11-29T14:26:16.149Z"}, {"movie_id": 297762, "review_id": "5cc1fbb7c3a36809ab850931", "author_rating": null, "review_text": "***Wonder Woman and Captain Steve Trevor seek to end WW1***\r\n\r\nNear the end of WW1, an American spy (Chris Pine) is chased by Germans to the hidden island of Amazonian women created by Zeus to protect mankind. The princess of the island (Gal Gadot) leaves with the captain to help end the Great War and destroy Ares forever.\r\n\r\n\"Wonder Woman\" (2017) combines the Wonder Woman TV series (1975-1979) with elements of “All Quiet on the Western Front” (1979), \"Raiders of the Lost Ark\" (1981), “The Dirty Dozen” (1967), “Captain America: The First Avenger” (2011) and “Man of Steel” (2013). It’s a well done modern superhero flick and superior to both “The First Avenger” and “Man of Steel.”\r\n\r\nThe opening paradisal island sequence is good without overstaying its welcome. The story really picks up when Captain Steve Trevor and Diana depart the island. They have great chemistry and their relationship adds human interest. \r\n\r\nUnlike “Man of Steel,” which devolved into super-beings constantly pulverizing each other in the second half, “Wonder Woman” has the poise to take its time and establish an interesting assortment of characters. The entire midsection is great, but the last act, to be expected, comes down to two super-beings pounding each other. But at least the creators tried to add a weighty moral.  \r\n\r\nThe film runs 2 hours, 21 minutes.\r\n\r\nGRADE: B", "created_at": "2019-04-25T18:25:59.768Z"}, {"movie_id": 297762, "review_id": "6050898a8c7b0f002856af28", "author_rating": 8.0, "review_text": "I was wrong about Gal Gadot taking the role as Diana Prince/Wonder Woman since BvS. She was not bad.\r\nThen this film, her standalone film, really brought emphasis on female empowerment.", "created_at": "2021-03-16T10:33:46.946Z"}, {"movie_id": 297762, "review_id": "61397d1e22df2e002a859805", "author_rating": null, "review_text": "Such a really nice one & Gal Gadot is the perfect Wonder Woman", "created_at": "2021-09-09T03:18:54.337Z"}, {"movie_id": 297762, "review_id": "618822c835d1bc008c940875", "author_rating": 10.0, "review_text": "I truly enjoyed Wonder Woman after Diana’s BvS intro with that amazing theme music.\r\nI was disappointed Diana didn’t have the bullets and bracelets contest to return Steve to Man’s World.\r\nDirector Patty Jenkins must have watched Justice League the animated series because Diana stole her costume in that episode.\r\nI read moviegoers review  the 3rd act as a heavy CGI fest but but butt Diana’s a demi god fighting Ares,the God of War certainly they wouldn’t be mimicking a Saturday morning WWE wrestling match.\r\nTraveling by ship instead of invisible plane was another missed opportunity to stay true to the CB.\r\nThe Themyscria healing waters was okay I would have liked the Purple Healing Ray - but but butt Director Patty Jenkins kept with the au naturel order of Mother Earth no guns, no electricity, no meat/fish only fruits and vegetables honouring the harvest goddess.\r\n10/10", "created_at": "2021-11-07T19:02:32.777Z"}, {"movie_id": 297762, "review_id": "630013f03af929007ad09e07", "author_rating": 9.0, "review_text": "**Overall : Wonder Woman exceeds the high expectations of existing fans while winning new fans with its amazing action, fantastic visuals, and sincere characters.**\r\n\r\nZack Snyder’s casting of Gal Gadot as Wonder Woman was a masterstroke that shined in its full brilliance in this film. While I had high hopes for Patty Jenkins’ Wonder Woman, I didn’t expect this kind of excellence! Gal Gadot delighted as the powerful yet compassionate Diana. Jenkins carried that balance of elegance and strength throughout the entire film. The No Man’s Land scene stands out as one of the best action scenes in a comic book movie. Wonder Woman is full of fun, action, grace, and significance, making it a true stand-out in the ever-growing ocean of comic book films.", "created_at": "2022-08-19T22:51:28.992Z"}, {"movie_id": 297762, "review_id": "63c21eff17b5ef00a7fbb6ad", "author_rating": 10.0, "review_text": "OK, calm down....I am going to address the \"controversy\" around this first...and I can't believe I just had to write that. It's freaking Wonder Woman!!!!! I can see the X-Men being controversial, what with being primarily about Civil Rights and equality for minorities...but this is DC Comics.\r\n\r\nOK, so let me put it this way...\r\n\r\n...I do NOT think that Wonder Woman is the greatest female protagonist in an action movie or sci-fi movies...and I am NOT a misogynist.\r\n\r\nMy \"lack of respect\" of Wonder Woman doesn't stem from a hatred of strong female leads...I just think Sarah Conner (Especially in \"Terminator the Sarah Conner Chronicles\") is the absolute coolest and most bada$$ strong female lead that has ever graced the silver screen or your home television.\r\n\r\nNot only that, I was livid when it got canceled and, for the cherry on top, if you want a strong female role model...have one with the cold soldier discipline and the willingness to sacrifice her life for the mission that Sarah Conner has.\r\n\r\nNot only that, but to be further controversial, I don't believe that Wonder Woman is the first awesome strong female lead in an action movie. I mean, Ellen Ripely is almost as pure awesome as Sarah Conner...and who can forget Buffy, OK Buffy is touchy, when I mention her I am talking about Buffy from the TV show, not Buffy from the movie.\r\n\r\nThose are only to name a few. And then there are lesser ones that we hate yet still came before Wonder Woman....most recently the Ghost Busters and Mary Sue from the new Star Wars.\r\n\r\nSo cool down on the politics...people that don't think Wonder Woman is the greatest female lead aren't necessarily misogynists forcing a male agenda....they may just be aware of Sarah Conner and Echo.\r\n\r\nNow...back to Wonder Woman.\r\n\r\nWHY DOES IT HAVE TO BE DARK, REALISTIC, AND GRITTY?!?!?! Seriously, I only like one (1) of the Nolan Batman movies and...Wonder Woman and Superman and the Justice League are NOT Batman.\r\n\r\nI don't want to sit through a Super Hero movie that is bucking for ultra-realistic. If I wanted that, I'd see a drama.\r\n\r\nThere are few super heroes that you can go totally dark and Gritty with, Batman, Dare Devil, Green Arrow....\r\n\r\nSpeaking of Green Arrow, notice how he was dark and the Flash wasn't? Why can the WB understand this but not the film department? What you have here is a director trying to make a Batman movie using Wonder Woman and that doesn't work. If I want a dark and gritty female action protagonist I already have the Terminator and Alien franchises.\r\n\r\nthe director, the studio, the writers should have concentrated more on making a Wonder Woman film and not another Batman movie...this failed for the same reason Batman V Superman did.", "created_at": "2023-01-14T03:18:23.649Z"}, {"movie_id": 297762, "review_id": "59303b4c92514166e9000f76", "author_rating": 7.0, "review_text": "I'd just like to thank Patty Jenkins for making a DCIThoughtSheWasWithUniverse movie that wasn't fucking garbage.\r\n\r\nIf I'm being completely honest, the two people I went to the cinema to watch _Wonder Woman_ with and I did spend the next two hours after coming out of our screening discussing the various problems with the movie, but we also all agreed on one thing: We still loved it.\r\n\r\nMaybe it's just the rose-coloured glasses of comparison, but I had an excellent time with _Wonder Woman_, and I'm excited to go back to the cinema and watch it, at least one more time.\r\n\r\nIt's the first time I've said that about a DC movie since _The Dark Knight Rises_.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-06-01T16:05:32.067Z"}, {"movie_id": 297762, "review_id": "593476aec3a3685a2402386d", "author_rating": 9.0, "review_text": "**The First Great DCEU Film**\r\n\r\nThis film is the origin story of Diana Prince/Wonder Woman (Gal Gadot), who was first introduced in Batman v. Superman last year. She is born and trained on Themyscira, the hidden island where the powerful warrior women known as the Amazons live. One day, Steve Trevor (Chris Pine), an American World War I spy, crashes off the coast of Themyscira and is rescued by Diana and the two team up to take down Ares, the God of War, and the Germans, who are developing a very deadly form of mustard gas. There are fantastic action sequences in this film, especially by Gal Gadot. It's amazing to see her single-handedly storm the German front, inspiring the Allies to fight with her. Gadot takes over from the legendary Linda Carter and makes the role her own. She has great chemistry with Pine. They are complete equals in this film. It's refreshing to see the female lead in a superhero film not be the love interest. The only negative part of the film are the lackluster villains. Hopefully, Wonder Woman will have more formidable foes in future films.", "created_at": "2017-06-04T21:07:58.016Z"}, {"movie_id": 297762, "review_id": "59358fc692514174a1000015", "author_rating": 6.0, "review_text": "**DC Hits A...Bunt. But compared to the strikeouts, a bunt seems impressive.**\r\n\r\nWonder Woman had some things working for it--things other comic book movies have faltered on. But it had a lot of things not working for it too. The result is an average median between what works and what doesn't. While the film is spectacular within the struggling DCEU, as a stand alone film it's mediocre at best. \r\n\r\nDiana's origin story--how she came to be and how she came to be a super hero was refreshing. It showcased the world of the Amazon warriors. It was unique in the often cookie-cutter super hero origin stories. Patty Jenkins did a good job of framing it, but I think the character's origin story dating back to the comics has always been unique in comparison to other super heroes.\r\n\r\nThe result is that the first third or so of the movie is satisfying--despite dull performances from Gal Gadot and Chris Pine (who had zero chemistry as a couple). But once we leave the confines of the island and enter the real world, the movie becomes hit or miss. WWI (that's right, WWI now, not WWII. The reason for the change in setting is never apparent) London is portrayed in a way that is almost a distraction. Yes, the world isn't white washed; diversity is a thing--a wonderful thing at that. But DC's version of Captain America's Howling Commandos consist of an Arab and an American Indian. Diversity for diversity's sake becomes distracting--especially when paired with a low-rent Simon Pegg whose soul function is being a deadly sniper who never fires his weapon (that's helpful on a top-secret mission behind enemy lines). \r\n\r\nIt's almost as if the movie telegraphs all of these unnecessary plot hiccups to remind you that this is a super hero film, and no matter how much the mortal humans fail, it will all be okay because the super hero will save the day. \r\n\r\nThe dialogue can be clichéd at times, and the final theme of the movie--one of love conquering all and the acknowledgement that, overall, mankind is good, is laughable in it's amateur preachiness. \r\n\r\nBut what the film lacks in substance and script, it makes up for in the visuals. I found the action sequences to be great fun. Heavily stylized \"Matrix-style\" fight scenes seem right at home in a film about super hero Gods. The freeze frames worked too--as fight sequences froze in over-the-top super hero poses that harkened back to the source material's comic book roots.\r\n\r\nThe final confrontation between Wonder Woman and Ares--while dragging on a little long--was well done, being one of the few super hero movie climaxes that delivered. \r\n\r\nWhile aspects of the movie were so similar (Hell! Identical!) to Captain America: The First Avenger, I actually felt embarrassed for the filmmakers, I did come away thinking this was the movie Captain America should have been. It succeeded in places where Captain America failed miserably. \r\n\r\nThe movie is entertainment--pure, fun, pop-corn-gobbling entertainment. In that realm, it succeeds and succeeds well. But as a piece of cinematic art, it falls flat on its face with too many plot holes, script inconsistencies, clichés and mediocre acting. Wonder Woman will be an important movie for both the DCEU and the summer of 2017. But it lacks the magic and staying power of Nolan and Donner's contributions to DC comics' films.", "created_at": "2017-06-05T17:07:18.493Z"}, {"movie_id": 297762, "review_id": "595e4493c3a36828fc07d0e7", "author_rating": 6.0, "review_text": "I like the portrayal of the Greek/Amazonian myth; the part where Chris Pine is naked; the part where Wonder Woman overturns the tank; and the post-battle dance scene with her and Steve Trevor, and that's it.\r\n\r\nThis could be mistaken for a mediocre, melodramatic, cheesy TV movie. Visually, it's less interesting than any of the other nu-DC fare; I never thought I'd miss Zach Snyder's sensibility but I did in this flick. Storywise, it may be a step up from the rest of the DCEU, but it still barely rivals the worst of the Marvel movies. Gal Gadot can't act, and Chris Pine couldn't make the clunky dialogue sound not ridiculous.\r\n\r\nWonder Woman is tolerable. That's more than can be said for the other nu-DC movies but it's not a compliment.", "created_at": "2017-07-06T14:09:23.723Z"}, {"movie_id": 297762, "review_id": "59fb1990c3a3681adf00e576", "author_rating": 8.0, "review_text": "I quite enjoyed this movie. When I learned that Zack Snyder had his fingers in it I got a worried since he recently wrote such atrocities as Batman vs Superman and sure enough the story is a really the weakest part of the movie. A typical nonsensical, unintelligent, Hollywood story/script were you are better off putting your brain in idle when watching it.\n\nHowever it makes up for this with cool special effects and, surprisingly, quite enjoyable characters. This is definitely a movie that you watch for the sake of the special effects. Well, if you are a male teenager you might also be watching it to drool over Gal Gadot of course (I have to admit that she is hot).\n\nThere is not too much to say about the plot. Our Amazon hot chick discovers that there is a war going on and goes out to stop it. Since she has been overly protected by her guardian she is amazingly clueless about life outside of her little island. Especially aspects involving men. Something which creates some funny moments as well as some embarrassingly silly ones. This, Diana’s gradual evolution where she not only is learning about life but also discovers her considerable powers, is one of the enjoyable aspects of the movie though. It is of course also one of the dummer aspects of the movie. How the f… could the Amazon Queen race Diana to be so ignorant about everything?\n\nAnother not so enjoyable part of the movie is the ludicrous scenes where the britts are trying to obtain peace at all costs as well as the stereotypical portrayal of Ludendorff as some megalomaniacal, half crazy war-mongerer. This was just dumb. I guess Zac Snyder just picked the name out of some history book without bothering to read up on the character. Typical lack of intelligence and respect, a la Hollywood, for anything outside of their, very limited, sphere of knowledge.\nWell, at least Danny Huston did a pretty decent job of the shitty role he was given. So did most of the rest of actors. I definitely liked Gal Gadot as Super Woman but then, although I am not a teenager, I am still a male so maybe I am biased when it comes to her?\n\nI definitely liked the special effects. The showdown at the end was great as far as I am concerned and the rest not bad either. They could have been even better though if it would not have been so obvious that the Germans where mostly incompetent extras waiting for Wonder Woman to show off her gymnastics and slow motion abilities. Come on, even superhero special effects should make some pretense of being “realistic” superhero special effects.\n\nThe movie is definitely aimed at the young adult segment. Unfortunately it do not seem to know what it is aiming for. Sometimes it is almost adult, sometimes it is late teen and sometimes just so bloody TV-show silly that you’re wondering if it is aiming for even pre-teens.\n\nAnyway, regardless of its faults I did enjoy my 2+ hour spent on this movie. Enough to give it a 4 out of 5 rating", "created_at": "2017-11-02T13:11:44.783Z"}, {"movie_id": 297762, "review_id": "5a1ec3880e0a264cc807f241", "author_rating": 8.0, "review_text": "**The Amazonian princess Diana's quest-come-self-discovery!**\r\n\r\nFrom all the superhero films, this was one of the most anticipated. Mainly because of the woman oriented theme. People were desperate to see the solo woman superhero. Today, we have the great visual effects technology, that anything can be possible to bring on to the screen. And actress like Gal Gadot, even better it gets. Yes, it was a wonderful film. A simple storyline, but a well made film.\r\n\r\nThe Amazonians who are cut off from the rest of the world, is preparing for the battle if Ares returns. All these years nothing has happened, but one day a fighter pilot crash on the cost of their island. Then the princess embark a journey back with him to find, and end the Ares threat forever. But she only ends up in the WWII, and what happens in the following sequence are the rest of the film.\r\n\r\nWho would have done a better job than Patty Jenkins. She nailed it, and so set to direct the sequel too. Even the supporting cast was good. DC's visuals always high standards and so this one. Action sequences too amazing. There's lots of changes in the character, as well as in everything. Firstly a nice superhero costume. And connections like Diana's father, the island, all pretty nicely written out. The DC universe just got extended. I can't wait to see 'Justice League'.\r\n\r\n**8/10**", "created_at": "2017-11-29T14:26:16.149Z"}, {"movie_id": 297762, "review_id": "5cc1fbb7c3a36809ab850931", "author_rating": null, "review_text": "***Wonder Woman and Captain Steve Trevor seek to end WW1***\r\n\r\nNear the end of WW1, an American spy (Chris Pine) is chased by Germans to the hidden island of Amazonian women created by Zeus to protect mankind. The princess of the island (Gal Gadot) leaves with the captain to help end the Great War and destroy Ares forever.\r\n\r\n\"Wonder Woman\" (2017) combines the Wonder Woman TV series (1975-1979) with elements of “All Quiet on the Western Front” (1979), \"Raiders of the Lost Ark\" (1981), “The Dirty Dozen” (1967), “Captain America: The First Avenger” (2011) and “Man of Steel” (2013). It’s a well done modern superhero flick and superior to both “The First Avenger” and “Man of Steel.”\r\n\r\nThe opening paradisal island sequence is good without overstaying its welcome. The story really picks up when Captain Steve Trevor and Diana depart the island. They have great chemistry and their relationship adds human interest. \r\n\r\nUnlike “Man of Steel,” which devolved into super-beings constantly pulverizing each other in the second half, “Wonder Woman” has the poise to take its time and establish an interesting assortment of characters. The entire midsection is great, but the last act, to be expected, comes down to two super-beings pounding each other. But at least the creators tried to add a weighty moral.  \r\n\r\nThe film runs 2 hours, 21 minutes.\r\n\r\nGRADE: B", "created_at": "2019-04-25T18:25:59.768Z"}, {"movie_id": 297762, "review_id": "6050898a8c7b0f002856af28", "author_rating": 8.0, "review_text": "I was wrong about Gal Gadot taking the role as Diana Prince/Wonder Woman since BvS. She was not bad.\r\nThen this film, her standalone film, really brought emphasis on female empowerment.", "created_at": "2021-03-16T10:33:46.946Z"}, {"movie_id": 297762, "review_id": "61397d1e22df2e002a859805", "author_rating": null, "review_text": "Such a really nice one & Gal Gadot is the perfect Wonder Woman", "created_at": "2021-09-09T03:18:54.337Z"}, {"movie_id": 297762, "review_id": "618822c835d1bc008c940875", "author_rating": 10.0, "review_text": "I truly enjoyed Wonder Woman after Diana’s BvS intro with that amazing theme music.\r\nI was disappointed Diana didn’t have the bullets and bracelets contest to return Steve to Man’s World.\r\nDirector Patty Jenkins must have watched Justice League the animated series because Diana stole her costume in that episode.\r\nI read moviegoers review  the 3rd act as a heavy CGI fest but but butt Diana’s a demi god fighting Ares,the God of War certainly they wouldn’t be mimicking a Saturday morning WWE wrestling match.\r\nTraveling by ship instead of invisible plane was another missed opportunity to stay true to the CB.\r\nThe Themyscria healing waters was okay I would have liked the Purple Healing Ray - but but butt Director Patty Jenkins kept with the au naturel order of Mother Earth no guns, no electricity, no meat/fish only fruits and vegetables honouring the harvest goddess.\r\n10/10", "created_at": "2021-11-07T19:02:32.777Z"}, {"movie_id": 297762, "review_id": "630013f03af929007ad09e07", "author_rating": 9.0, "review_text": "**Overall : Wonder Woman exceeds the high expectations of existing fans while winning new fans with its amazing action, fantastic visuals, and sincere characters.**\r\n\r\nZack Snyder’s casting of Gal Gadot as Wonder Woman was a masterstroke that shined in its full brilliance in this film. While I had high hopes for Patty Jenkins’ Wonder Woman, I didn’t expect this kind of excellence! Gal Gadot delighted as the powerful yet compassionate Diana. Jenkins carried that balance of elegance and strength throughout the entire film. The No Man’s Land scene stands out as one of the best action scenes in a comic book movie. Wonder Woman is full of fun, action, grace, and significance, making it a true stand-out in the ever-growing ocean of comic book films.", "created_at": "2022-08-19T22:51:28.992Z"}, {"movie_id": 297762, "review_id": "63c21eff17b5ef00a7fbb6ad", "author_rating": 10.0, "review_text": "OK, calm down....I am going to address the \"controversy\" around this first...and I can't believe I just had to write that. It's freaking Wonder Woman!!!!! I can see the X-Men being controversial, what with being primarily about Civil Rights and equality for minorities...but this is DC Comics.\r\n\r\nOK, so let me put it this way...\r\n\r\n...I do NOT think that Wonder Woman is the greatest female protagonist in an action movie or sci-fi movies...and I am NOT a misogynist.\r\n\r\nMy \"lack of respect\" of Wonder Woman doesn't stem from a hatred of strong female leads...I just think Sarah Conner (Especially in \"Terminator the Sarah Conner Chronicles\") is the absolute coolest and most bada$$ strong female lead that has ever graced the silver screen or your home television.\r\n\r\nNot only that, I was livid when it got canceled and, for the cherry on top, if you want a strong female role model...have one with the cold soldier discipline and the willingness to sacrifice her life for the mission that Sarah Conner has.\r\n\r\nNot only that, but to be further controversial, I don't believe that Wonder Woman is the first awesome strong female lead in an action movie. I mean, Ellen Ripely is almost as pure awesome as Sarah Conner...and who can forget Buffy, OK Buffy is touchy, when I mention her I am talking about Buffy from the TV show, not Buffy from the movie.\r\n\r\nThose are only to name a few. And then there are lesser ones that we hate yet still came before Wonder Woman....most recently the Ghost Busters and Mary Sue from the new Star Wars.\r\n\r\nSo cool down on the politics...people that don't think Wonder Woman is the greatest female lead aren't necessarily misogynists forcing a male agenda....they may just be aware of Sarah Conner and Echo.\r\n\r\nNow...back to Wonder Woman.\r\n\r\nWHY DOES IT HAVE TO BE DARK, REALISTIC, AND GRITTY?!?!?! Seriously, I only like one (1) of the Nolan Batman movies and...Wonder Woman and Superman and the Justice League are NOT Batman.\r\n\r\nI don't want to sit through a Super Hero movie that is bucking for ultra-realistic. If I wanted that, I'd see a drama.\r\n\r\nThere are few super heroes that you can go totally dark and Gritty with, Batman, Dare Devil, Green Arrow....\r\n\r\nSpeaking of Green Arrow, notice how he was dark and the Flash wasn't? Why can the WB understand this but not the film department? What you have here is a director trying to make a Batman movie using Wonder Woman and that doesn't work. If I want a dark and gritty female action protagonist I already have the Terminator and Alien franchises.\r\n\r\nthe director, the studio, the writers should have concentrated more on making a Wonder Woman film and not another Batman movie...this failed for the same reason Batman V Superman did.", "created_at": "2023-01-14T03:18:23.649Z"}]