[{"movie_id": 36557, "review_id": "58d9475c925141445f026b91", "author_rating": 3.0, "review_text": "**2006 - the year they turned Bond into a common soccer hooligan.**\r\n\r\nIn 2006, the film makers - no longer under the watchful eye of the late Cubby Broccoli decided to run away from making James Bond movies. They also cast a short blonde man as 007.  They screwed with the gun barrel and the tone of the once lively, over the top and amusing series was now one of tedium.\r\n\r\n\r\nIt's all over for Bond films now unless they decide to make real Bond films again and not this monotonous  and bland rubbish.\r\n\r\nIt's  shame that Cubby was not still around to keep Eon Productions in line and stop them ruining 40 years of hard work.\r\n\r\n\r\n- Potential Kermode", "created_at": "2017-03-27T17:09:48.161Z"}, {"movie_id": 36557, "review_id": "5d09ce370e0a2678fcca1238", "author_rating": 9.0, "review_text": "Arrogance and self-awareness seldom go hand in hand.\r\n\r\nCasino Royale is directed by Martin Campbell and adapted by Neil Purvis, Robert Wade & Paul Haggis from a story written by Ian Fleming. It stars Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright & Giancarlo Giannini. It's the 21st film in the James Bond franchise.\r\n\r\nPlot finds Craig as Bond, newly promoted to 00 status, he is thrust into the murky world of high financed terrorism.\r\n\r\nOne of the hardest series of films to get right, with some of the most committed of fans, is that of the James Bond series. To wit, there will never ever be a Bond film that will appease every fan across the board. The complaints will range from not enough gadgets, too far removed from Fleming's essence, not serious enough and vice a versa: too darn serious. Then there is the usual round of arguments concerning the leading man stepping into the tuxedo, for every Bond fan ready to fight to the death in the name of Sean Connery, I'll find you another prepared to back Timothy Dalton's take on the Martini swigging legend. Once it became clear that Pierce Brosnan had run his course as Bond, bowing out with the super silly Die Another Day in 2002, the pressure for any new Bond, both the actor and the makers, was immense. 2006 and time had moved on, and we live in different cinema times, spy movies are a different breed to what went before, The Bourne Identity had raised the bar. The news filtered thru that Bond was to be rebooted and that Daniel Craig was the man to be Bond. The howls of derision could be heard from as far as the tropical locations so in keeping with a James Bond plot. Too Blonde, too craggy faced, not tall enough, and why reboot a much loved franchise anyway? It was war and the heat was turned up to full.\r\n\r\nCasino Royale still has its critics, but as majorities go as regards a Bond film, this one has the biggest sway. Sure, the Daniel Craig haters will not be bowed, they can't after all lose face after such a vitriolic campaign against his casting, but few, I suspect, can seriously deny Casino Royale is not a magnificent Bond movie. Just a peak at the Worldwide box office figures shows you how well received it was, making nearly $600 million, those are figures that do not lie. The truth is that Casino Royale has almost everything you could wish for from a Bond movie, and a little more. Gorgeous locations, beautiful women and reams of action; where, the stunt department reach new heights. It's also refreshingly in keeping with Fleming's original story, only major difference here is that the makers have upgraded it to a post 9/11 world. There's nods to traditional franchise staples, whilst also neatly streamlining some of the previous film's comedy scene fillers. Smart villain too, Mads Mikkelsen's Le Chiffre, complete with creepy eye issue and loyal girlfriend, is a villain not trying to blow up the world because he's mad, but trying to outwit Bond to stay alive! That's great stuff that keeps a Bond thriller alive and well.\r\n\r\nBut for all the energy and pyrotechnics (there's enough in this one film to have filled half a dozen of previous Bond entries), a Bond film can only succeed if the leading man is up to scratch. Thankfully, and joyously, Craig nails it, both in physicality, swagger and raw egotistical aggression. More telling is that Craig's Bond is more human that what we are used too, at one time suave and appearing unruffled, the next, bruised battered and emotionally conflicted. This is a new and rounded Bond, given impetus by Craig's powerful presence. He is helped by Eva Green putting brains and slinkiness into Vesper Lynd, a Bond girl to turn Bond's head in a way not seen since Diana Rigg's Tracy di Vicenzo in OHMSS. Though one of the film's rare missteps is to under write the part. Felix Leiter also gets a quality tune up in the form of Jeffrey Wright, Judi Dench's M kicks arse and Giancarlo Giannini adds a touch of continental class as Bond's Montenegro contact René Mathis. Layered over the top is a nifty score by David Arnold, blending traditional Bond flavours with high energy bursts and Phil Meheux's photography brings optical delights in the Bahamas, Czech Republic and Italy.\r\n\r\nOpening with the best chase sequence in the whole franchise and closing with an ultimate Bond moment, this is reboot supreme. It's high energy with intelligent humanistic smarts and Bond is back: blonder, brutal and most assuredly better. 9/10", "created_at": "2019-06-19T05:55:03.399Z"}, {"movie_id": 36557, "review_id": "5e939ff38e87020016ccd75c", "author_rating": 8.0, "review_text": "i liked Daniel Craig more as the right bond with action, charm, cunning all in one", "created_at": "2020-04-12T23:10:43.261Z"}, {"movie_id": 36557, "review_id": "5e9549d187f3f2001449e440", "author_rating": 9.0, "review_text": "Great James Bond movie and perfect debut for Daniel Craig. He may, at least in the last couple outings, resent the role, he makes for a bruiser version of the character. Pierce Brosnan is still my favorite as his movies came out in the 90s (i.e. the years for watching Bond movies), but this was an all around great film, not to mention the lovely Eva Green coming on to the scene. **4.5/5**", "created_at": "2020-04-14T05:27:45.156Z"}, {"movie_id": 36557, "review_id": "60b3ec7cc740d90059411a66", "author_rating": 8.0, "review_text": "_**Daniel Craig debuts as Bond**_\r\n\r\nBased on Ian Fleming’s novel, “Casino Royale” (2006) goes back to the beginning with James Bond (Daniel Craig) earning his 00 status with MI6. ‘M’ (Judi Dench) then sends Bond after a private banker who funds terrorists (Mads Mikkelsen), which leads to action in Madagascar, a poker game & romance in the Bahamas, thwarting the destruction of a prototype airliner in Miami, a high-stakes tournament at the Casino Royale in Montenegro and a thrilling finale in Venice. Caterina Murino and Eva Green also appear on the feminine front.\r\n\r\nCraig is more rough-hewn than Pierce Brosnan and more akin to Timothy Dalton, albeit without the smirk. Craig has the gravitas to pull-off the role and is utterly convincing.\r\n\r\nLet's face it, James Bond flicks aren’t that deep. They may have convoluted plots, but there's little character depth and no heavy subtext commenting on the human condition. They're spy thrillers with an ultra-cool protagonist, beautiful women, spectacular locations, amazing gadgets, global political intrigue, gambling matches, wild action and megalomaniac villains. That's it. Yet they're very entertaining, which is why the series has been such a hit since 1962 when \"Dr. No\" was released.\r\n\r\nYet, with the exception of \"On Her Majesty's Secret Service\" (1969), there's very little character depth. Take James himself: Women to him are only meaningful as (1) a sexual dalliance or (2) a means to fulfill his mission. I mention this to point out how \"Casino Royale\" boldly changes this. The film has character depth and shows why Bond is the way he is. For instance, there are a couple amazing conversations between James and his potential woman in the story, Vesper (Eva Green), and they're full of insights. The dialog is snappy & intriguing and the performances are right-on.\r\n\r\nBy the way, someone complained that all the women in Bond flicks are loose and willing to sleep with any man at the drop of a hat. No, they're just willing to sleep with James Bond, lol. I'm not saying it's right, but it does reflect the alluring charisma of the suave Mr. Bond.\r\n\r\nThere are some thrilling action sequences, like the long, unrelenting chase at a construction site after the title credits, but there are also some quality dramatic segments. For instance, the main poker match at the titular casino is well-staged and suspenseful.\r\n\r\n\"Casino Royale\" strikes me as a mixture of the first half of \"Goldfinger\" with the serious tone of \"The Living Daylights\" & \"Licence to Kill.” Don't expect the comic booky approach of \"You Only Live Twice,\" the cartoonish-ness of “Diamonds are Forever” or the science-fiction (and sometimes goofiness) of \"Moonraker.”\r\n\r\nThe film runs 2 hours, 24 minutes, and was shot in the Czech Republic, Venice, Bahamas and England.\r\n\r\nGRADE: A-/B+", "created_at": "2021-05-30T19:50:20.986Z"}, {"movie_id": 36557, "review_id": "6150950bfb8346006124b18a", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/casino-royale-spoiler-free-review\r\n\r\n\"Casino Royale is a near-perfect debut of Daniel Craig as the new James Bond. This brutal version of the famous protagonist is beautifully interpreted by Craig, who contradicted the naysayers at the time of release and delivers a phenomenal performance as the iconic 007. His witty humor, irresistible charm, and excellent line deliveries find a close match in Eva Green's take of the \"Bond girl\", whose intelligence and strong attitude puts aside any generic, formulaic traits. Mads Mikkelsen is outstanding as always as the vulnerable antagonist, but his impact on the overall picture is slightly underwhelming. The action set pieces are worthy of belonging to blockbusters of today, holding impressive stunt work and cinematography. Martin Campbell creates one of those films I can't pinpoint any flaws. Bond fans will feel delighted.\"\r\n\r\nRating: A-", "created_at": "2021-09-26T15:43:07.737Z"}, {"movie_id": 36557, "review_id": "61e3249baf6e94001c5240d3", "author_rating": 10.0, "review_text": "From the breathtaking stunts in the opening chase to the suspenseful high-stakes poker game, ‘Casino Royale’ gets everything right, introducing Craig as a tougher, grittier and more realistic Bond. James Bond.\r\n\r\n10/10", "created_at": "2022-01-15T19:46:35.236Z"}, {"movie_id": 36557, "review_id": "63182914ed2ac2007fb6017f", "author_rating": 7.0, "review_text": "As reboots go, this is probably the best I've seen. Daniel Craig takes up the mantle of Ian Fleming's \"007\" in this two-part thriller that starts off at break neck speed and rarely drops below third gear for almost 2½ hours. Having just attained his licence to kill status - after disposing of the double-crossing \"Dryden\" (Malcolm Sinclair), he is now hot on the trail of a courier in an African republic. After a chase of pretty epic proportions that sees them leaping from buildings and cranes before \"Bond\" finally manages to trash an embassy, he obtains a cellphone with just one word. What does it mean? Well now he must use all of his roughly hewn skills to find out - a challenge that takes him via the Bahamas to Miami where he has two thwart a daring attack at the airport on a brand new airliner, that would bankrupt the manufacturer and make someone $100m. That someone is now seriously annoyed - and in quite considerable danger themselves, so phase two of the story starts - and this is where it gets interesting. Off to the beautiful land of Montenegro for the ultimate game of poker. Staked by a rather wary HM Government, he is put in the capable hands of \"Vesper\" (Eva Green) and with the help of local fixer \"Mathis\" (Giancarlo Giannini) faces his new nemesis \"Le Schifre\" (Mads Mikkelsen). Quite literally - winner takes all. The story here is strong, the plot has twists - especially towards the end; there is loads of action, gadgets - a cracking Aston Martin; and loads of glamour. That latter element was largely missing during the Dalton/Brosnan eras for this suave and debonaire super-spy. Craig exudes a classiness about him, and Green likewise as she quickly realises that his is a dangerous business. Mikkelsen makes for a good baddie - so much of his acting is done through his expressions, and here he radiates a sort of measured menace that proves quite effective as the story reaches it's rather painful climax! David Arnold has written a score that nods to the John Barry sweeping and orchestral style of the early films and the writing doesn't waste time trying with the puerile double-entendres that dogged some of the earlier outings for \"Bond\". The one man missing, rather notably, is \"Q\" and \"Moneypenny\" has become a bloke called \"Villiers\" (Tobias Menzies) working for Dame Judi Dench's no-nonsense \"M\". The denouement is as action packed as the rest of it, and it introduces us to the idea that there is an organisation out there guiding so much of the criminal fraternity. A spectre of things to come, perhaps? Let's hope this is a sign of a new and improved vivacity for this tiring franchise. This is a very good re-start.", "created_at": "2022-09-07T05:16:04.400Z"}, {"movie_id": 36557, "review_id": "63be6fa3fa404600aeff6479", "author_rating": 6.0, "review_text": "It honestly wasn't bad and I really hate Daniel Craig as James Bond, he seems to be the only person on earth that does NOT want to be James Bond. And it kind of sucks watching someone play Bond that doesn't look like he wants to be there.\r\n\r\nAnd then there is the fact that they rebooted the franchise, and I am not a fan of that either.\r\n\r\nAnd, well, the film had 3 endings didn't it? I mean, literally there were two natural endings but they milked it for a third one. So by the time you get around to ending three you're screaming \"enough already!\"\r\n\r\nHowever, it started strong. I mean, it started REALLY strong even for a reboot. And it made the clever move of keeping the same M, and that helped stop the people like me that hate reboots from grumbling too much.\r\n\r\nIt did away with Q and the over-the-top gadgets and, yeah, Python Q wasn't good plus every Bond has his own feel.\r\n\r\nSo what was left was a solid action movie with mostly great acting (especially from the Villains) that was great... up until it SHOULD have ended the first time.", "created_at": "2023-01-11T08:13:23.030Z"}, {"movie_id": 36557, "review_id": "643e16f843250f049c50e766", "author_rating": 1.0, "review_text": "Depressingly predictably Hollywood.\r\nThis is hardly a 007 movie, and can't be called a \"film\". It's just the same Hollywood formula of contriving a story to be as depressing as possible.\r\nThe same formula Hollywood had prided itself on since about 1965.\r\nIt's very dull, and there's no imagery.\r\n007 films once had exotic scenery that was done in a cinematic way.\r\nNo more. \r\nThis has absolutely nothing to do with Daniel Craig. It doesn't matter who plays 007 when the writer and director are control freaks for hatefulness.\r\nIf you can stay awake through the dull scenery and ridiculous lines (Bond even says it doesn't matter what cards you have in a poker game. This movie goes beyond \"retarded\"), then you wonder what the plot is. Bond goes through a kidnapping ordeal and losing in cards, and he's obviously a victim of card cheating, but this genius doesn't suspect that.\r\nThen, we get the predictable ending that is so Hollywood. \r\nThis movie would be the worst Bond movie ever if not for \"A View to a Kill\".", "created_at": "2023-04-18T04:05:12.828Z"}, {"movie_id": 36557, "review_id": "58d9475c925141445f026b91", "author_rating": 3.0, "review_text": "**2006 - the year they turned Bond into a common soccer hooligan.**\r\n\r\nIn 2006, the film makers - no longer under the watchful eye of the late Cubby Broccoli decided to run away from making James Bond movies. They also cast a short blonde man as 007.  They screwed with the gun barrel and the tone of the once lively, over the top and amusing series was now one of tedium.\r\n\r\n\r\nIt's all over for Bond films now unless they decide to make real Bond films again and not this monotonous  and bland rubbish.\r\n\r\nIt's  shame that Cubby was not still around to keep Eon Productions in line and stop them ruining 40 years of hard work.\r\n\r\n\r\n- Potential Kermode", "created_at": "2017-03-27T17:09:48.161Z"}, {"movie_id": 36557, "review_id": "5d09ce370e0a2678fcca1238", "author_rating": 9.0, "review_text": "Arrogance and self-awareness seldom go hand in hand.\r\n\r\nCasino Royale is directed by Martin Campbell and adapted by Neil Purvis, Robert Wade & Paul Haggis from a story written by Ian Fleming. It stars Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright & Giancarlo Giannini. It's the 21st film in the James Bond franchise.\r\n\r\nPlot finds Craig as Bond, newly promoted to 00 status, he is thrust into the murky world of high financed terrorism.\r\n\r\nOne of the hardest series of films to get right, with some of the most committed of fans, is that of the James Bond series. To wit, there will never ever be a Bond film that will appease every fan across the board. The complaints will range from not enough gadgets, too far removed from Fleming's essence, not serious enough and vice a versa: too darn serious. Then there is the usual round of arguments concerning the leading man stepping into the tuxedo, for every Bond fan ready to fight to the death in the name of Sean Connery, I'll find you another prepared to back Timothy Dalton's take on the Martini swigging legend. Once it became clear that Pierce Brosnan had run his course as Bond, bowing out with the super silly Die Another Day in 2002, the pressure for any new Bond, both the actor and the makers, was immense. 2006 and time had moved on, and we live in different cinema times, spy movies are a different breed to what went before, The Bourne Identity had raised the bar. The news filtered thru that Bond was to be rebooted and that Daniel Craig was the man to be Bond. The howls of derision could be heard from as far as the tropical locations so in keeping with a James Bond plot. Too Blonde, too craggy faced, not tall enough, and why reboot a much loved franchise anyway? It was war and the heat was turned up to full.\r\n\r\nCasino Royale still has its critics, but as majorities go as regards a Bond film, this one has the biggest sway. Sure, the Daniel Craig haters will not be bowed, they can't after all lose face after such a vitriolic campaign against his casting, but few, I suspect, can seriously deny Casino Royale is not a magnificent Bond movie. Just a peak at the Worldwide box office figures shows you how well received it was, making nearly $600 million, those are figures that do not lie. The truth is that Casino Royale has almost everything you could wish for from a Bond movie, and a little more. Gorgeous locations, beautiful women and reams of action; where, the stunt department reach new heights. It's also refreshingly in keeping with Fleming's original story, only major difference here is that the makers have upgraded it to a post 9/11 world. There's nods to traditional franchise staples, whilst also neatly streamlining some of the previous film's comedy scene fillers. Smart villain too, Mads Mikkelsen's Le Chiffre, complete with creepy eye issue and loyal girlfriend, is a villain not trying to blow up the world because he's mad, but trying to outwit Bond to stay alive! That's great stuff that keeps a Bond thriller alive and well.\r\n\r\nBut for all the energy and pyrotechnics (there's enough in this one film to have filled half a dozen of previous Bond entries), a Bond film can only succeed if the leading man is up to scratch. Thankfully, and joyously, Craig nails it, both in physicality, swagger and raw egotistical aggression. More telling is that Craig's Bond is more human that what we are used too, at one time suave and appearing unruffled, the next, bruised battered and emotionally conflicted. This is a new and rounded Bond, given impetus by Craig's powerful presence. He is helped by Eva Green putting brains and slinkiness into Vesper Lynd, a Bond girl to turn Bond's head in a way not seen since Diana Rigg's Tracy di Vicenzo in OHMSS. Though one of the film's rare missteps is to under write the part. Felix Leiter also gets a quality tune up in the form of Jeffrey Wright, Judi Dench's M kicks arse and Giancarlo Giannini adds a touch of continental class as Bond's Montenegro contact René Mathis. Layered over the top is a nifty score by David Arnold, blending traditional Bond flavours with high energy bursts and Phil Meheux's photography brings optical delights in the Bahamas, Czech Republic and Italy.\r\n\r\nOpening with the best chase sequence in the whole franchise and closing with an ultimate Bond moment, this is reboot supreme. It's high energy with intelligent humanistic smarts and Bond is back: blonder, brutal and most assuredly better. 9/10", "created_at": "2019-06-19T05:55:03.399Z"}, {"movie_id": 36557, "review_id": "5e939ff38e87020016ccd75c", "author_rating": 8.0, "review_text": "i liked Daniel Craig more as the right bond with action, charm, cunning all in one", "created_at": "2020-04-12T23:10:43.261Z"}, {"movie_id": 36557, "review_id": "5e9549d187f3f2001449e440", "author_rating": 9.0, "review_text": "Great James Bond movie and perfect debut for Daniel Craig. He may, at least in the last couple outings, resent the role, he makes for a bruiser version of the character. Pierce Brosnan is still my favorite as his movies came out in the 90s (i.e. the years for watching Bond movies), but this was an all around great film, not to mention the lovely Eva Green coming on to the scene. **4.5/5**", "created_at": "2020-04-14T05:27:45.156Z"}, {"movie_id": 36557, "review_id": "60b3ec7cc740d90059411a66", "author_rating": 8.0, "review_text": "_**Daniel Craig debuts as Bond**_\r\n\r\nBased on Ian Fleming’s novel, “Casino Royale” (2006) goes back to the beginning with James Bond (Daniel Craig) earning his 00 status with MI6. ‘M’ (Judi Dench) then sends Bond after a private banker who funds terrorists (Mads Mikkelsen), which leads to action in Madagascar, a poker game & romance in the Bahamas, thwarting the destruction of a prototype airliner in Miami, a high-stakes tournament at the Casino Royale in Montenegro and a thrilling finale in Venice. Caterina Murino and Eva Green also appear on the feminine front.\r\n\r\nCraig is more rough-hewn than Pierce Brosnan and more akin to Timothy Dalton, albeit without the smirk. Craig has the gravitas to pull-off the role and is utterly convincing.\r\n\r\nLet's face it, James Bond flicks aren’t that deep. They may have convoluted plots, but there's little character depth and no heavy subtext commenting on the human condition. They're spy thrillers with an ultra-cool protagonist, beautiful women, spectacular locations, amazing gadgets, global political intrigue, gambling matches, wild action and megalomaniac villains. That's it. Yet they're very entertaining, which is why the series has been such a hit since 1962 when \"Dr. No\" was released.\r\n\r\nYet, with the exception of \"On Her Majesty's Secret Service\" (1969), there's very little character depth. Take James himself: Women to him are only meaningful as (1) a sexual dalliance or (2) a means to fulfill his mission. I mention this to point out how \"Casino Royale\" boldly changes this. The film has character depth and shows why Bond is the way he is. For instance, there are a couple amazing conversations between James and his potential woman in the story, Vesper (Eva Green), and they're full of insights. The dialog is snappy & intriguing and the performances are right-on.\r\n\r\nBy the way, someone complained that all the women in Bond flicks are loose and willing to sleep with any man at the drop of a hat. No, they're just willing to sleep with James Bond, lol. I'm not saying it's right, but it does reflect the alluring charisma of the suave Mr. Bond.\r\n\r\nThere are some thrilling action sequences, like the long, unrelenting chase at a construction site after the title credits, but there are also some quality dramatic segments. For instance, the main poker match at the titular casino is well-staged and suspenseful.\r\n\r\n\"Casino Royale\" strikes me as a mixture of the first half of \"Goldfinger\" with the serious tone of \"The Living Daylights\" & \"Licence to Kill.” Don't expect the comic booky approach of \"You Only Live Twice,\" the cartoonish-ness of “Diamonds are Forever” or the science-fiction (and sometimes goofiness) of \"Moonraker.”\r\n\r\nThe film runs 2 hours, 24 minutes, and was shot in the Czech Republic, Venice, Bahamas and England.\r\n\r\nGRADE: A-/B+", "created_at": "2021-05-30T19:50:20.986Z"}, {"movie_id": 36557, "review_id": "6150950bfb8346006124b18a", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/casino-royale-spoiler-free-review\r\n\r\n\"Casino Royale is a near-perfect debut of Daniel Craig as the new James Bond. This brutal version of the famous protagonist is beautifully interpreted by Craig, who contradicted the naysayers at the time of release and delivers a phenomenal performance as the iconic 007. His witty humor, irresistible charm, and excellent line deliveries find a close match in Eva Green's take of the \"Bond girl\", whose intelligence and strong attitude puts aside any generic, formulaic traits. Mads Mikkelsen is outstanding as always as the vulnerable antagonist, but his impact on the overall picture is slightly underwhelming. The action set pieces are worthy of belonging to blockbusters of today, holding impressive stunt work and cinematography. Martin Campbell creates one of those films I can't pinpoint any flaws. Bond fans will feel delighted.\"\r\n\r\nRating: A-", "created_at": "2021-09-26T15:43:07.737Z"}, {"movie_id": 36557, "review_id": "61e3249baf6e94001c5240d3", "author_rating": 10.0, "review_text": "From the breathtaking stunts in the opening chase to the suspenseful high-stakes poker game, ‘Casino Royale’ gets everything right, introducing Craig as a tougher, grittier and more realistic Bond. James Bond.\r\n\r\n10/10", "created_at": "2022-01-15T19:46:35.236Z"}, {"movie_id": 36557, "review_id": "63182914ed2ac2007fb6017f", "author_rating": 7.0, "review_text": "As reboots go, this is probably the best I've seen. Daniel Craig takes up the mantle of Ian Fleming's \"007\" in this two-part thriller that starts off at break neck speed and rarely drops below third gear for almost 2½ hours. Having just attained his licence to kill status - after disposing of the double-crossing \"Dryden\" (Malcolm Sinclair), he is now hot on the trail of a courier in an African republic. After a chase of pretty epic proportions that sees them leaping from buildings and cranes before \"Bond\" finally manages to trash an embassy, he obtains a cellphone with just one word. What does it mean? Well now he must use all of his roughly hewn skills to find out - a challenge that takes him via the Bahamas to Miami where he has two thwart a daring attack at the airport on a brand new airliner, that would bankrupt the manufacturer and make someone $100m. That someone is now seriously annoyed - and in quite considerable danger themselves, so phase two of the story starts - and this is where it gets interesting. Off to the beautiful land of Montenegro for the ultimate game of poker. Staked by a rather wary HM Government, he is put in the capable hands of \"Vesper\" (Eva Green) and with the help of local fixer \"Mathis\" (Giancarlo Giannini) faces his new nemesis \"Le Schifre\" (Mads Mikkelsen). Quite literally - winner takes all. The story here is strong, the plot has twists - especially towards the end; there is loads of action, gadgets - a cracking Aston Martin; and loads of glamour. That latter element was largely missing during the Dalton/Brosnan eras for this suave and debonaire super-spy. Craig exudes a classiness about him, and Green likewise as she quickly realises that his is a dangerous business. Mikkelsen makes for a good baddie - so much of his acting is done through his expressions, and here he radiates a sort of measured menace that proves quite effective as the story reaches it's rather painful climax! David Arnold has written a score that nods to the John Barry sweeping and orchestral style of the early films and the writing doesn't waste time trying with the puerile double-entendres that dogged some of the earlier outings for \"Bond\". The one man missing, rather notably, is \"Q\" and \"Moneypenny\" has become a bloke called \"Villiers\" (Tobias Menzies) working for Dame Judi Dench's no-nonsense \"M\". The denouement is as action packed as the rest of it, and it introduces us to the idea that there is an organisation out there guiding so much of the criminal fraternity. A spectre of things to come, perhaps? Let's hope this is a sign of a new and improved vivacity for this tiring franchise. This is a very good re-start.", "created_at": "2022-09-07T05:16:04.400Z"}, {"movie_id": 36557, "review_id": "63be6fa3fa404600aeff6479", "author_rating": 6.0, "review_text": "It honestly wasn't bad and I really hate Daniel Craig as James Bond, he seems to be the only person on earth that does NOT want to be James Bond. And it kind of sucks watching someone play Bond that doesn't look like he wants to be there.\r\n\r\nAnd then there is the fact that they rebooted the franchise, and I am not a fan of that either.\r\n\r\nAnd, well, the film had 3 endings didn't it? I mean, literally there were two natural endings but they milked it for a third one. So by the time you get around to ending three you're screaming \"enough already!\"\r\n\r\nHowever, it started strong. I mean, it started REALLY strong even for a reboot. And it made the clever move of keeping the same M, and that helped stop the people like me that hate reboots from grumbling too much.\r\n\r\nIt did away with Q and the over-the-top gadgets and, yeah, Python Q wasn't good plus every Bond has his own feel.\r\n\r\nSo what was left was a solid action movie with mostly great acting (especially from the Villains) that was great... up until it SHOULD have ended the first time.", "created_at": "2023-01-11T08:13:23.030Z"}, {"movie_id": 36557, "review_id": "643e16f843250f049c50e766", "author_rating": 1.0, "review_text": "Depressingly predictably Hollywood.\r\nThis is hardly a 007 movie, and can't be called a \"film\". It's just the same Hollywood formula of contriving a story to be as depressing as possible.\r\nThe same formula Hollywood had prided itself on since about 1965.\r\nIt's very dull, and there's no imagery.\r\n007 films once had exotic scenery that was done in a cinematic way.\r\nNo more. \r\nThis has absolutely nothing to do with Daniel Craig. It doesn't matter who plays 007 when the writer and director are control freaks for hatefulness.\r\nIf you can stay awake through the dull scenery and ridiculous lines (Bond even says it doesn't matter what cards you have in a poker game. This movie goes beyond \"retarded\"), then you wonder what the plot is. Bond goes through a kidnapping ordeal and losing in cards, and he's obviously a victim of card cheating, but this genius doesn't suspect that.\r\nThen, we get the predictable ending that is so Hollywood. \r\nThis movie would be the worst Bond movie ever if not for \"A View to a Kill\".", "created_at": "2023-04-18T04:05:12.828Z"}, {"movie_id": 36557, "review_id": "58d9475c925141445f026b91", "author_rating": 3.0, "review_text": "**2006 - the year they turned Bond into a common soccer hooligan.**\r\n\r\nIn 2006, the film makers - no longer under the watchful eye of the late Cubby Broccoli decided to run away from making James Bond movies. They also cast a short blonde man as 007.  They screwed with the gun barrel and the tone of the once lively, over the top and amusing series was now one of tedium.\r\n\r\n\r\nIt's all over for Bond films now unless they decide to make real Bond films again and not this monotonous  and bland rubbish.\r\n\r\nIt's  shame that Cubby was not still around to keep Eon Productions in line and stop them ruining 40 years of hard work.\r\n\r\n\r\n- Potential Kermode", "created_at": "2017-03-27T17:09:48.161Z"}, {"movie_id": 36557, "review_id": "5d09ce370e0a2678fcca1238", "author_rating": 9.0, "review_text": "Arrogance and self-awareness seldom go hand in hand.\r\n\r\nCasino Royale is directed by Martin Campbell and adapted by Neil Purvis, Robert Wade & Paul Haggis from a story written by Ian Fleming. It stars Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright & Giancarlo Giannini. It's the 21st film in the James Bond franchise.\r\n\r\nPlot finds Craig as Bond, newly promoted to 00 status, he is thrust into the murky world of high financed terrorism.\r\n\r\nOne of the hardest series of films to get right, with some of the most committed of fans, is that of the James Bond series. To wit, there will never ever be a Bond film that will appease every fan across the board. The complaints will range from not enough gadgets, too far removed from Fleming's essence, not serious enough and vice a versa: too darn serious. Then there is the usual round of arguments concerning the leading man stepping into the tuxedo, for every Bond fan ready to fight to the death in the name of Sean Connery, I'll find you another prepared to back Timothy Dalton's take on the Martini swigging legend. Once it became clear that Pierce Brosnan had run his course as Bond, bowing out with the super silly Die Another Day in 2002, the pressure for any new Bond, both the actor and the makers, was immense. 2006 and time had moved on, and we live in different cinema times, spy movies are a different breed to what went before, The Bourne Identity had raised the bar. The news filtered thru that Bond was to be rebooted and that Daniel Craig was the man to be Bond. The howls of derision could be heard from as far as the tropical locations so in keeping with a James Bond plot. Too Blonde, too craggy faced, not tall enough, and why reboot a much loved franchise anyway? It was war and the heat was turned up to full.\r\n\r\nCasino Royale still has its critics, but as majorities go as regards a Bond film, this one has the biggest sway. Sure, the Daniel Craig haters will not be bowed, they can't after all lose face after such a vitriolic campaign against his casting, but few, I suspect, can seriously deny Casino Royale is not a magnificent Bond movie. Just a peak at the Worldwide box office figures shows you how well received it was, making nearly $600 million, those are figures that do not lie. The truth is that Casino Royale has almost everything you could wish for from a Bond movie, and a little more. Gorgeous locations, beautiful women and reams of action; where, the stunt department reach new heights. It's also refreshingly in keeping with Fleming's original story, only major difference here is that the makers have upgraded it to a post 9/11 world. There's nods to traditional franchise staples, whilst also neatly streamlining some of the previous film's comedy scene fillers. Smart villain too, Mads Mikkelsen's Le Chiffre, complete with creepy eye issue and loyal girlfriend, is a villain not trying to blow up the world because he's mad, but trying to outwit Bond to stay alive! That's great stuff that keeps a Bond thriller alive and well.\r\n\r\nBut for all the energy and pyrotechnics (there's enough in this one film to have filled half a dozen of previous Bond entries), a Bond film can only succeed if the leading man is up to scratch. Thankfully, and joyously, Craig nails it, both in physicality, swagger and raw egotistical aggression. More telling is that Craig's Bond is more human that what we are used too, at one time suave and appearing unruffled, the next, bruised battered and emotionally conflicted. This is a new and rounded Bond, given impetus by Craig's powerful presence. He is helped by Eva Green putting brains and slinkiness into Vesper Lynd, a Bond girl to turn Bond's head in a way not seen since Diana Rigg's Tracy di Vicenzo in OHMSS. Though one of the film's rare missteps is to under write the part. Felix Leiter also gets a quality tune up in the form of Jeffrey Wright, Judi Dench's M kicks arse and Giancarlo Giannini adds a touch of continental class as Bond's Montenegro contact René Mathis. Layered over the top is a nifty score by David Arnold, blending traditional Bond flavours with high energy bursts and Phil Meheux's photography brings optical delights in the Bahamas, Czech Republic and Italy.\r\n\r\nOpening with the best chase sequence in the whole franchise and closing with an ultimate Bond moment, this is reboot supreme. It's high energy with intelligent humanistic smarts and Bond is back: blonder, brutal and most assuredly better. 9/10", "created_at": "2019-06-19T05:55:03.399Z"}, {"movie_id": 36557, "review_id": "5e939ff38e87020016ccd75c", "author_rating": 8.0, "review_text": "i liked Daniel Craig more as the right bond with action, charm, cunning all in one", "created_at": "2020-04-12T23:10:43.261Z"}, {"movie_id": 36557, "review_id": "5e9549d187f3f2001449e440", "author_rating": 9.0, "review_text": "Great James Bond movie and perfect debut for Daniel Craig. He may, at least in the last couple outings, resent the role, he makes for a bruiser version of the character. Pierce Brosnan is still my favorite as his movies came out in the 90s (i.e. the years for watching Bond movies), but this was an all around great film, not to mention the lovely Eva Green coming on to the scene. **4.5/5**", "created_at": "2020-04-14T05:27:45.156Z"}, {"movie_id": 36557, "review_id": "60b3ec7cc740d90059411a66", "author_rating": 8.0, "review_text": "_**Daniel Craig debuts as Bond**_\r\n\r\nBased on Ian Fleming’s novel, “Casino Royale” (2006) goes back to the beginning with James Bond (Daniel Craig) earning his 00 status with MI6. ‘M’ (Judi Dench) then sends Bond after a private banker who funds terrorists (Mads Mikkelsen), which leads to action in Madagascar, a poker game & romance in the Bahamas, thwarting the destruction of a prototype airliner in Miami, a high-stakes tournament at the Casino Royale in Montenegro and a thrilling finale in Venice. Caterina Murino and Eva Green also appear on the feminine front.\r\n\r\nCraig is more rough-hewn than Pierce Brosnan and more akin to Timothy Dalton, albeit without the smirk. Craig has the gravitas to pull-off the role and is utterly convincing.\r\n\r\nLet's face it, James Bond flicks aren’t that deep. They may have convoluted plots, but there's little character depth and no heavy subtext commenting on the human condition. They're spy thrillers with an ultra-cool protagonist, beautiful women, spectacular locations, amazing gadgets, global political intrigue, gambling matches, wild action and megalomaniac villains. That's it. Yet they're very entertaining, which is why the series has been such a hit since 1962 when \"Dr. No\" was released.\r\n\r\nYet, with the exception of \"On Her Majesty's Secret Service\" (1969), there's very little character depth. Take James himself: Women to him are only meaningful as (1) a sexual dalliance or (2) a means to fulfill his mission. I mention this to point out how \"Casino Royale\" boldly changes this. The film has character depth and shows why Bond is the way he is. For instance, there are a couple amazing conversations between James and his potential woman in the story, Vesper (Eva Green), and they're full of insights. The dialog is snappy & intriguing and the performances are right-on.\r\n\r\nBy the way, someone complained that all the women in Bond flicks are loose and willing to sleep with any man at the drop of a hat. No, they're just willing to sleep with James Bond, lol. I'm not saying it's right, but it does reflect the alluring charisma of the suave Mr. Bond.\r\n\r\nThere are some thrilling action sequences, like the long, unrelenting chase at a construction site after the title credits, but there are also some quality dramatic segments. For instance, the main poker match at the titular casino is well-staged and suspenseful.\r\n\r\n\"Casino Royale\" strikes me as a mixture of the first half of \"Goldfinger\" with the serious tone of \"The Living Daylights\" & \"Licence to Kill.” Don't expect the comic booky approach of \"You Only Live Twice,\" the cartoonish-ness of “Diamonds are Forever” or the science-fiction (and sometimes goofiness) of \"Moonraker.”\r\n\r\nThe film runs 2 hours, 24 minutes, and was shot in the Czech Republic, Venice, Bahamas and England.\r\n\r\nGRADE: A-/B+", "created_at": "2021-05-30T19:50:20.986Z"}, {"movie_id": 36557, "review_id": "6150950bfb8346006124b18a", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/casino-royale-spoiler-free-review\r\n\r\n\"Casino Royale is a near-perfect debut of Daniel Craig as the new James Bond. This brutal version of the famous protagonist is beautifully interpreted by Craig, who contradicted the naysayers at the time of release and delivers a phenomenal performance as the iconic 007. His witty humor, irresistible charm, and excellent line deliveries find a close match in Eva Green's take of the \"Bond girl\", whose intelligence and strong attitude puts aside any generic, formulaic traits. Mads Mikkelsen is outstanding as always as the vulnerable antagonist, but his impact on the overall picture is slightly underwhelming. The action set pieces are worthy of belonging to blockbusters of today, holding impressive stunt work and cinematography. Martin Campbell creates one of those films I can't pinpoint any flaws. Bond fans will feel delighted.\"\r\n\r\nRating: A-", "created_at": "2021-09-26T15:43:07.737Z"}, {"movie_id": 36557, "review_id": "61e3249baf6e94001c5240d3", "author_rating": 10.0, "review_text": "From the breathtaking stunts in the opening chase to the suspenseful high-stakes poker game, ‘Casino Royale’ gets everything right, introducing Craig as a tougher, grittier and more realistic Bond. James Bond.\r\n\r\n10/10", "created_at": "2022-01-15T19:46:35.236Z"}, {"movie_id": 36557, "review_id": "63182914ed2ac2007fb6017f", "author_rating": 7.0, "review_text": "As reboots go, this is probably the best I've seen. Daniel Craig takes up the mantle of Ian Fleming's \"007\" in this two-part thriller that starts off at break neck speed and rarely drops below third gear for almost 2½ hours. Having just attained his licence to kill status - after disposing of the double-crossing \"Dryden\" (Malcolm Sinclair), he is now hot on the trail of a courier in an African republic. After a chase of pretty epic proportions that sees them leaping from buildings and cranes before \"Bond\" finally manages to trash an embassy, he obtains a cellphone with just one word. What does it mean? Well now he must use all of his roughly hewn skills to find out - a challenge that takes him via the Bahamas to Miami where he has two thwart a daring attack at the airport on a brand new airliner, that would bankrupt the manufacturer and make someone $100m. That someone is now seriously annoyed - and in quite considerable danger themselves, so phase two of the story starts - and this is where it gets interesting. Off to the beautiful land of Montenegro for the ultimate game of poker. Staked by a rather wary HM Government, he is put in the capable hands of \"Vesper\" (Eva Green) and with the help of local fixer \"Mathis\" (Giancarlo Giannini) faces his new nemesis \"Le Schifre\" (Mads Mikkelsen). Quite literally - winner takes all. The story here is strong, the plot has twists - especially towards the end; there is loads of action, gadgets - a cracking Aston Martin; and loads of glamour. That latter element was largely missing during the Dalton/Brosnan eras for this suave and debonaire super-spy. Craig exudes a classiness about him, and Green likewise as she quickly realises that his is a dangerous business. Mikkelsen makes for a good baddie - so much of his acting is done through his expressions, and here he radiates a sort of measured menace that proves quite effective as the story reaches it's rather painful climax! David Arnold has written a score that nods to the John Barry sweeping and orchestral style of the early films and the writing doesn't waste time trying with the puerile double-entendres that dogged some of the earlier outings for \"Bond\". The one man missing, rather notably, is \"Q\" and \"Moneypenny\" has become a bloke called \"Villiers\" (Tobias Menzies) working for Dame Judi Dench's no-nonsense \"M\". The denouement is as action packed as the rest of it, and it introduces us to the idea that there is an organisation out there guiding so much of the criminal fraternity. A spectre of things to come, perhaps? Let's hope this is a sign of a new and improved vivacity for this tiring franchise. This is a very good re-start.", "created_at": "2022-09-07T05:16:04.400Z"}, {"movie_id": 36557, "review_id": "63be6fa3fa404600aeff6479", "author_rating": 6.0, "review_text": "It honestly wasn't bad and I really hate Daniel Craig as James Bond, he seems to be the only person on earth that does NOT want to be James Bond. And it kind of sucks watching someone play Bond that doesn't look like he wants to be there.\r\n\r\nAnd then there is the fact that they rebooted the franchise, and I am not a fan of that either.\r\n\r\nAnd, well, the film had 3 endings didn't it? I mean, literally there were two natural endings but they milked it for a third one. So by the time you get around to ending three you're screaming \"enough already!\"\r\n\r\nHowever, it started strong. I mean, it started REALLY strong even for a reboot. And it made the clever move of keeping the same M, and that helped stop the people like me that hate reboots from grumbling too much.\r\n\r\nIt did away with Q and the over-the-top gadgets and, yeah, Python Q wasn't good plus every Bond has his own feel.\r\n\r\nSo what was left was a solid action movie with mostly great acting (especially from the Villains) that was great... up until it SHOULD have ended the first time.", "created_at": "2023-01-11T08:13:23.030Z"}, {"movie_id": 36557, "review_id": "643e16f843250f049c50e766", "author_rating": 1.0, "review_text": "Depressingly predictably Hollywood.\r\nThis is hardly a 007 movie, and can't be called a \"film\". It's just the same Hollywood formula of contriving a story to be as depressing as possible.\r\nThe same formula Hollywood had prided itself on since about 1965.\r\nIt's very dull, and there's no imagery.\r\n007 films once had exotic scenery that was done in a cinematic way.\r\nNo more. \r\nThis has absolutely nothing to do with Daniel Craig. It doesn't matter who plays 007 when the writer and director are control freaks for hatefulness.\r\nIf you can stay awake through the dull scenery and ridiculous lines (Bond even says it doesn't matter what cards you have in a poker game. This movie goes beyond \"retarded\"), then you wonder what the plot is. Bond goes through a kidnapping ordeal and losing in cards, and he's obviously a victim of card cheating, but this genius doesn't suspect that.\r\nThen, we get the predictable ending that is so Hollywood. \r\nThis movie would be the worst Bond movie ever if not for \"A View to a Kill\".", "created_at": "2023-04-18T04:05:12.828Z"}, {"movie_id": 36557, "review_id": "58d9475c925141445f026b91", "author_rating": 3.0, "review_text": "**2006 - the year they turned Bond into a common soccer hooligan.**\r\n\r\nIn 2006, the film makers - no longer under the watchful eye of the late Cubby Broccoli decided to run away from making James Bond movies. They also cast a short blonde man as 007.  They screwed with the gun barrel and the tone of the once lively, over the top and amusing series was now one of tedium.\r\n\r\n\r\nIt's all over for Bond films now unless they decide to make real Bond films again and not this monotonous  and bland rubbish.\r\n\r\nIt's  shame that Cubby was not still around to keep Eon Productions in line and stop them ruining 40 years of hard work.\r\n\r\n\r\n- Potential Kermode", "created_at": "2017-03-27T17:09:48.161Z"}, {"movie_id": 36557, "review_id": "5d09ce370e0a2678fcca1238", "author_rating": 9.0, "review_text": "Arrogance and self-awareness seldom go hand in hand.\r\n\r\nCasino Royale is directed by Martin Campbell and adapted by Neil Purvis, Robert Wade & Paul Haggis from a story written by Ian Fleming. It stars Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright & Giancarlo Giannini. It's the 21st film in the James Bond franchise.\r\n\r\nPlot finds Craig as Bond, newly promoted to 00 status, he is thrust into the murky world of high financed terrorism.\r\n\r\nOne of the hardest series of films to get right, with some of the most committed of fans, is that of the James Bond series. To wit, there will never ever be a Bond film that will appease every fan across the board. The complaints will range from not enough gadgets, too far removed from Fleming's essence, not serious enough and vice a versa: too darn serious. Then there is the usual round of arguments concerning the leading man stepping into the tuxedo, for every Bond fan ready to fight to the death in the name of Sean Connery, I'll find you another prepared to back Timothy Dalton's take on the Martini swigging legend. Once it became clear that Pierce Brosnan had run his course as Bond, bowing out with the super silly Die Another Day in 2002, the pressure for any new Bond, both the actor and the makers, was immense. 2006 and time had moved on, and we live in different cinema times, spy movies are a different breed to what went before, The Bourne Identity had raised the bar. The news filtered thru that Bond was to be rebooted and that Daniel Craig was the man to be Bond. The howls of derision could be heard from as far as the tropical locations so in keeping with a James Bond plot. Too Blonde, too craggy faced, not tall enough, and why reboot a much loved franchise anyway? It was war and the heat was turned up to full.\r\n\r\nCasino Royale still has its critics, but as majorities go as regards a Bond film, this one has the biggest sway. Sure, the Daniel Craig haters will not be bowed, they can't after all lose face after such a vitriolic campaign against his casting, but few, I suspect, can seriously deny Casino Royale is not a magnificent Bond movie. Just a peak at the Worldwide box office figures shows you how well received it was, making nearly $600 million, those are figures that do not lie. The truth is that Casino Royale has almost everything you could wish for from a Bond movie, and a little more. Gorgeous locations, beautiful women and reams of action; where, the stunt department reach new heights. It's also refreshingly in keeping with Fleming's original story, only major difference here is that the makers have upgraded it to a post 9/11 world. There's nods to traditional franchise staples, whilst also neatly streamlining some of the previous film's comedy scene fillers. Smart villain too, Mads Mikkelsen's Le Chiffre, complete with creepy eye issue and loyal girlfriend, is a villain not trying to blow up the world because he's mad, but trying to outwit Bond to stay alive! That's great stuff that keeps a Bond thriller alive and well.\r\n\r\nBut for all the energy and pyrotechnics (there's enough in this one film to have filled half a dozen of previous Bond entries), a Bond film can only succeed if the leading man is up to scratch. Thankfully, and joyously, Craig nails it, both in physicality, swagger and raw egotistical aggression. More telling is that Craig's Bond is more human that what we are used too, at one time suave and appearing unruffled, the next, bruised battered and emotionally conflicted. This is a new and rounded Bond, given impetus by Craig's powerful presence. He is helped by Eva Green putting brains and slinkiness into Vesper Lynd, a Bond girl to turn Bond's head in a way not seen since Diana Rigg's Tracy di Vicenzo in OHMSS. Though one of the film's rare missteps is to under write the part. Felix Leiter also gets a quality tune up in the form of Jeffrey Wright, Judi Dench's M kicks arse and Giancarlo Giannini adds a touch of continental class as Bond's Montenegro contact René Mathis. Layered over the top is a nifty score by David Arnold, blending traditional Bond flavours with high energy bursts and Phil Meheux's photography brings optical delights in the Bahamas, Czech Republic and Italy.\r\n\r\nOpening with the best chase sequence in the whole franchise and closing with an ultimate Bond moment, this is reboot supreme. It's high energy with intelligent humanistic smarts and Bond is back: blonder, brutal and most assuredly better. 9/10", "created_at": "2019-06-19T05:55:03.399Z"}, {"movie_id": 36557, "review_id": "5e939ff38e87020016ccd75c", "author_rating": 8.0, "review_text": "i liked Daniel Craig more as the right bond with action, charm, cunning all in one", "created_at": "2020-04-12T23:10:43.261Z"}, {"movie_id": 36557, "review_id": "5e9549d187f3f2001449e440", "author_rating": 9.0, "review_text": "Great James Bond movie and perfect debut for Daniel Craig. He may, at least in the last couple outings, resent the role, he makes for a bruiser version of the character. Pierce Brosnan is still my favorite as his movies came out in the 90s (i.e. the years for watching Bond movies), but this was an all around great film, not to mention the lovely Eva Green coming on to the scene. **4.5/5**", "created_at": "2020-04-14T05:27:45.156Z"}, {"movie_id": 36557, "review_id": "60b3ec7cc740d90059411a66", "author_rating": 8.0, "review_text": "_**Daniel Craig debuts as Bond**_\r\n\r\nBased on Ian Fleming’s novel, “Casino Royale” (2006) goes back to the beginning with James Bond (Daniel Craig) earning his 00 status with MI6. ‘M’ (Judi Dench) then sends Bond after a private banker who funds terrorists (Mads Mikkelsen), which leads to action in Madagascar, a poker game & romance in the Bahamas, thwarting the destruction of a prototype airliner in Miami, a high-stakes tournament at the Casino Royale in Montenegro and a thrilling finale in Venice. Caterina Murino and Eva Green also appear on the feminine front.\r\n\r\nCraig is more rough-hewn than Pierce Brosnan and more akin to Timothy Dalton, albeit without the smirk. Craig has the gravitas to pull-off the role and is utterly convincing.\r\n\r\nLet's face it, James Bond flicks aren’t that deep. They may have convoluted plots, but there's little character depth and no heavy subtext commenting on the human condition. They're spy thrillers with an ultra-cool protagonist, beautiful women, spectacular locations, amazing gadgets, global political intrigue, gambling matches, wild action and megalomaniac villains. That's it. Yet they're very entertaining, which is why the series has been such a hit since 1962 when \"Dr. No\" was released.\r\n\r\nYet, with the exception of \"On Her Majesty's Secret Service\" (1969), there's very little character depth. Take James himself: Women to him are only meaningful as (1) a sexual dalliance or (2) a means to fulfill his mission. I mention this to point out how \"Casino Royale\" boldly changes this. The film has character depth and shows why Bond is the way he is. For instance, there are a couple amazing conversations between James and his potential woman in the story, Vesper (Eva Green), and they're full of insights. The dialog is snappy & intriguing and the performances are right-on.\r\n\r\nBy the way, someone complained that all the women in Bond flicks are loose and willing to sleep with any man at the drop of a hat. No, they're just willing to sleep with James Bond, lol. I'm not saying it's right, but it does reflect the alluring charisma of the suave Mr. Bond.\r\n\r\nThere are some thrilling action sequences, like the long, unrelenting chase at a construction site after the title credits, but there are also some quality dramatic segments. For instance, the main poker match at the titular casino is well-staged and suspenseful.\r\n\r\n\"Casino Royale\" strikes me as a mixture of the first half of \"Goldfinger\" with the serious tone of \"The Living Daylights\" & \"Licence to Kill.” Don't expect the comic booky approach of \"You Only Live Twice,\" the cartoonish-ness of “Diamonds are Forever” or the science-fiction (and sometimes goofiness) of \"Moonraker.”\r\n\r\nThe film runs 2 hours, 24 minutes, and was shot in the Czech Republic, Venice, Bahamas and England.\r\n\r\nGRADE: A-/B+", "created_at": "2021-05-30T19:50:20.986Z"}, {"movie_id": 36557, "review_id": "6150950bfb8346006124b18a", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/casino-royale-spoiler-free-review\r\n\r\n\"Casino Royale is a near-perfect debut of Daniel Craig as the new James Bond. This brutal version of the famous protagonist is beautifully interpreted by Craig, who contradicted the naysayers at the time of release and delivers a phenomenal performance as the iconic 007. His witty humor, irresistible charm, and excellent line deliveries find a close match in Eva Green's take of the \"Bond girl\", whose intelligence and strong attitude puts aside any generic, formulaic traits. Mads Mikkelsen is outstanding as always as the vulnerable antagonist, but his impact on the overall picture is slightly underwhelming. The action set pieces are worthy of belonging to blockbusters of today, holding impressive stunt work and cinematography. Martin Campbell creates one of those films I can't pinpoint any flaws. Bond fans will feel delighted.\"\r\n\r\nRating: A-", "created_at": "2021-09-26T15:43:07.737Z"}, {"movie_id": 36557, "review_id": "61e3249baf6e94001c5240d3", "author_rating": 10.0, "review_text": "From the breathtaking stunts in the opening chase to the suspenseful high-stakes poker game, ‘Casino Royale’ gets everything right, introducing Craig as a tougher, grittier and more realistic Bond. James Bond.\r\n\r\n10/10", "created_at": "2022-01-15T19:46:35.236Z"}, {"movie_id": 36557, "review_id": "63182914ed2ac2007fb6017f", "author_rating": 7.0, "review_text": "As reboots go, this is probably the best I've seen. Daniel Craig takes up the mantle of Ian Fleming's \"007\" in this two-part thriller that starts off at break neck speed and rarely drops below third gear for almost 2½ hours. Having just attained his licence to kill status - after disposing of the double-crossing \"Dryden\" (Malcolm Sinclair), he is now hot on the trail of a courier in an African republic. After a chase of pretty epic proportions that sees them leaping from buildings and cranes before \"Bond\" finally manages to trash an embassy, he obtains a cellphone with just one word. What does it mean? Well now he must use all of his roughly hewn skills to find out - a challenge that takes him via the Bahamas to Miami where he has two thwart a daring attack at the airport on a brand new airliner, that would bankrupt the manufacturer and make someone $100m. That someone is now seriously annoyed - and in quite considerable danger themselves, so phase two of the story starts - and this is where it gets interesting. Off to the beautiful land of Montenegro for the ultimate game of poker. Staked by a rather wary HM Government, he is put in the capable hands of \"Vesper\" (Eva Green) and with the help of local fixer \"Mathis\" (Giancarlo Giannini) faces his new nemesis \"Le Schifre\" (Mads Mikkelsen). Quite literally - winner takes all. The story here is strong, the plot has twists - especially towards the end; there is loads of action, gadgets - a cracking Aston Martin; and loads of glamour. That latter element was largely missing during the Dalton/Brosnan eras for this suave and debonaire super-spy. Craig exudes a classiness about him, and Green likewise as she quickly realises that his is a dangerous business. Mikkelsen makes for a good baddie - so much of his acting is done through his expressions, and here he radiates a sort of measured menace that proves quite effective as the story reaches it's rather painful climax! David Arnold has written a score that nods to the John Barry sweeping and orchestral style of the early films and the writing doesn't waste time trying with the puerile double-entendres that dogged some of the earlier outings for \"Bond\". The one man missing, rather notably, is \"Q\" and \"Moneypenny\" has become a bloke called \"Villiers\" (Tobias Menzies) working for Dame Judi Dench's no-nonsense \"M\". The denouement is as action packed as the rest of it, and it introduces us to the idea that there is an organisation out there guiding so much of the criminal fraternity. A spectre of things to come, perhaps? Let's hope this is a sign of a new and improved vivacity for this tiring franchise. This is a very good re-start.", "created_at": "2022-09-07T05:16:04.400Z"}, {"movie_id": 36557, "review_id": "63be6fa3fa404600aeff6479", "author_rating": 6.0, "review_text": "It honestly wasn't bad and I really hate Daniel Craig as James Bond, he seems to be the only person on earth that does NOT want to be James Bond. And it kind of sucks watching someone play Bond that doesn't look like he wants to be there.\r\n\r\nAnd then there is the fact that they rebooted the franchise, and I am not a fan of that either.\r\n\r\nAnd, well, the film had 3 endings didn't it? I mean, literally there were two natural endings but they milked it for a third one. So by the time you get around to ending three you're screaming \"enough already!\"\r\n\r\nHowever, it started strong. I mean, it started REALLY strong even for a reboot. And it made the clever move of keeping the same M, and that helped stop the people like me that hate reboots from grumbling too much.\r\n\r\nIt did away with Q and the over-the-top gadgets and, yeah, Python Q wasn't good plus every Bond has his own feel.\r\n\r\nSo what was left was a solid action movie with mostly great acting (especially from the Villains) that was great... up until it SHOULD have ended the first time.", "created_at": "2023-01-11T08:13:23.030Z"}, {"movie_id": 36557, "review_id": "643e16f843250f049c50e766", "author_rating": 1.0, "review_text": "Depressingly predictably Hollywood.\r\nThis is hardly a 007 movie, and can't be called a \"film\". It's just the same Hollywood formula of contriving a story to be as depressing as possible.\r\nThe same formula Hollywood had prided itself on since about 1965.\r\nIt's very dull, and there's no imagery.\r\n007 films once had exotic scenery that was done in a cinematic way.\r\nNo more. \r\nThis has absolutely nothing to do with Daniel Craig. It doesn't matter who plays 007 when the writer and director are control freaks for hatefulness.\r\nIf you can stay awake through the dull scenery and ridiculous lines (Bond even says it doesn't matter what cards you have in a poker game. This movie goes beyond \"retarded\"), then you wonder what the plot is. Bond goes through a kidnapping ordeal and losing in cards, and he's obviously a victim of card cheating, but this genius doesn't suspect that.\r\nThen, we get the predictable ending that is so Hollywood. \r\nThis movie would be the worst Bond movie ever if not for \"A View to a Kill\".", "created_at": "2023-04-18T04:05:12.828Z"}]