[{"movie_id": 641, "review_id": "557c9680c3a368632300242e", "author_rating": 9.0, "review_text": "Shattering expose of the fallible human condition.\r\n\r\nWhat to say about Darren Aronofsky's Requiem for a Dream that hasn't been said already? Without doubt it's a film, that in spite of its high standing on the main movie sites, polarises opinions. It's a film that in simple terms follows four people through their addictions until the shattering denouement, but the journey is made more bleak by offering tantalising snatches of hope, the dreams of the protags offered up as some sort of goals for the addicts to cling on to - only for the narrative to stick in its rusty serrated blade to draw the lifeblood from the hapless hopefuls.\r\n\r\nArononfsky brings a multitude of technical skills to the party that emphasise the emotional discord on show. Standard split-screening is married up with rapid cutting, isolated framing, close ups, long tracking and Snorricam, all of which is sound tracked by Clint Mansell's haunting musical composition. All told it's an assault on all the senses and terrifying with it, boosted no end by Aronofsky getting top performances from his cast of actors. Love it or hate it, it's a film that simply can't be ignored, unsparing cinema produced by a most gifted director. 9/10", "created_at": "2015-06-13T20:45:52.344Z"}, {"movie_id": 641, "review_id": "5f78d0a89a64350036a4e2c8", "author_rating": 9.0, "review_text": "Only my second viewing of this, last time probably was when it came out on DVD, and not one I'll re-watch anytime soon, but still a great drama featuring incredible performances, most notably Ellen Burstyn who was worthy of her Oscar nomination. Has some darkly wild moments and a swing in tones, guess giving viewers insights into the highs and lows of heroine use. Not entertaining in so much as fascinating film worth it for some of the visuals and acting. **4.5/5**", "created_at": "2020-10-03T19:27:36.155Z"}, {"movie_id": 641, "review_id": "600bad8dc86b3a003fbdcccd", "author_rating": 7.0, "review_text": "I've never been so afraid of a refrigerator.", "created_at": "2021-01-23T05:01:01.381Z"}]