[{"movie_id": 700391, "review_id": "640a5f6554f6eb00993d4f0e", "author_rating": null, "review_text": "\"65 is a taut 93 minutes of sweaty tension, appropriately scaled action and surprising tenderness...\"\r\n\r\nRead the full review here: http://www.screen-space.net/reviews/2023/3/9/65.html", "created_at": "2023-03-09T22:36:21.339Z"}, {"movie_id": 700391, "review_id": "64114c7ce18e3f07b4249ab1", "author_rating": 6.0, "review_text": "**65 had so much potential but couldn’t overcome its weird story restrictions.**\r\n\r\n65 is not the horrible movie many recited claim it to be. It’s a decent sci-fi survival thriller with a handful of fun, suspenseful sequences but a slower pace and some strange story decisions kept the film from being the stand-out it had the potential to be. Two major writing choices held the movie back:\r\n\r\n*SPOILERS AHEAD*\r\n\r\n1. Killing every other person on board the ship leaving only the pilot and a nine-year-old girl to survive the dangers of prehistoric Earth minimized the threat and tension of the film. The audience reasonably assumes these two characters will survive at least to the end of the film and prevents the dangers from having any real bite (literally). Allowing for more survivors would have given more characters to fall prey to the terrors around them and raised the tension and the pace of the film.\r\n\r\n2. Why did the writers choose to make the only two characters of the film speak two different languages? It reduced the dialogue to clunky and rudimentary exchanges that were annoying and mostly irrelevant. Having the young girl in shock and not speak at the beginning but slowly say more and more as she trusts the pilot would have been a better way to show development.\r\n\r\n65 wasn’t a great or even a good movie, but it wasn’t bad either. I wasn’t disappointed with seeing it once on $5 Tuesday at the theater. It could have been epic, but a limiting screenplay and a lack of on-screen action prevented 65 from being anything better than decent.", "created_at": "2023-03-15T04:41:33.021Z"}, {"movie_id": 700391, "review_id": "641b2d28d75bd600f69c608b", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/65-review\r\n\r\n\"65 is as unimaginative and predictable as anticipated, only even less entertaining and far more bland. Adam Driver and Ariana Greenblatt try their best, but apart from the climactic ending that delivers one of the best visual executions of an asteroid colliding with a planet in recent years, there isn't a single memorable aspect in this movie that’s part of an already packed subgenre with many stories worthy of more attention. A dinosaur flick this uninteresting should be considered a cinephilic crime.\"\r\n\r\nRating: D+", "created_at": "2023-03-22T16:30:32.371Z"}, {"movie_id": 700391, "review_id": "641ec6be253fab00f3cc89e4", "author_rating": 5.0, "review_text": "\"Mills\" (Adam Driver) undertakes a long space mission so he can earn enough money for his poorly daughter to have life-saving treatment. Along the route, their ship encounters an uncharted meteor storm and next thing he knows, he is marooned on a distinctly hostile planet with the only other survivor - the feisty young \"Koa\" (Ariana Greenblatt) for company, Their only hope is to reach a distant part of their wrecked mother ship in which there is an escape module that can propel them back into space where they might be rescued. Snag? Well they are not the only living creatures on this world - and without exception, the others all want \"Mills\" and \"Koa\" sandwiches for lunch, and - wait for it - there is a great big meteor on a collision course with the planet that is going to have an existential impact on their surroundings. What now ensues is a rather predictable series of \"Jurassic Park\" style adventures that offer the visual effects folks a chance to shine, but little else. Driver is completely unremarkable here, the escapades have little - or no - jeopardy and I just kept thinking this was just a sort of dinosaurs do \"Degoba\" style of adventure. I didn't hate it, and it will be fine on the telly at Christmas - but as a big screen experience it is weak, derivative and the star brings nothing at all to the party.", "created_at": "2023-03-25T10:02:38.186Z"}, {"movie_id": 700391, "review_id": "6437e9681d538601135b785a", "author_rating": 1.0, "review_text": "This review does contain spoilers\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSuch a disappointing movie. Adam Driver is a great actor but this movie is so incredible boring. 90% of the movie are encounters to another and then another and then another dangerous blood seeking Dino. Just when you think the story might get anywhere there is another Dino to shoot.  Slowly you are realizing there is no more extra story. it is just a short journey to a top of a hill fighting Dino's. And Adam is a father of a 9 year old but then on this journey he has to do the journey with another 9 year old (which looks too old) and suddenly  becomes like the dumbest not able to communicate person in the world.  Such a waist of actor talent and special effects money. My guess is that the makers have cgi or vision art backgrounds because the only thing well done in this movie are the special effects.", "created_at": "2023-04-13T11:37:12.827Z"}, {"movie_id": 700391, "review_id": "643c69ca25b9550476f724d4", "author_rating": 7.0, "review_text": "This film starts out with an odd premise. Putting a twist on the Planet of the Apes plot, instead of earth astronauts ending up in the past or future of this planet, the Earth is visited by space travelers from a different planet in the distant prehistoric past. (The title is not a suggested rating for reviewers, but rather how many million years ago the story takes place.) So it is odd to contemplate that the Adam Driver character speaks Engish just so we can understand him, while his co-star speaks some other language. How different the story would have been if we understood her (Koa) and not him!\r\n\r\nBut I digress. So this turns into another Jurassic Park without the huge body count or those magic sighing moments of viewing a herd of docile grazing Brontosauruses or triceratops. Instead the dinosaurs start out as killing threats and remain so throughout. I suppose this is also a good reason to show the movie on a streaming service rather than on a large theater screen. That sort of access might have tilted the movie away from sci-if thriller and towards mere horror.\r\n\r\nI had this weird and unrealized vision of them showing some sign of these alien visitors millions of years later along with other fossil remains, but perhaps fortunately perhaps, nothing like that developed.", "created_at": "2023-04-16T21:34:02.195Z"}, {"movie_id": 700391, "review_id": "646231898c44b900e1664ea5", "author_rating": 6.0, "review_text": "Underneath poor pacing and a half-baked plot, there is a good film that, unfortunately, 65 never fully realizes.\r\n\r\nFrom the start of the film, the pacing was dreadful. The introduction of our character, Mills, and the set-up to his story were rushed and for no reason, as the movie was under an hour and thirty minutes long. This time that should have been used for character development and motivation setup was fast-forwarded in order to get to the action on Earth. This section is critical to the audience's ability to relate to Mills, and unfortunately we never get to see it come to fruition.\r\n\r\nOnce we get to Earth, things start to even out as the story progresses. The world they built was breathtaking, and the visuals were stellar. The action set pieces were nothing too impressive, but they did the job and had me thoroughly entertained. But, similarly to the introduction, this section lacks heart. 65 tries to be more than just a dinosaur action flick, and attempts to develop an intimate relationship between Mills and Koa just don’t work. I think the decision to make them speak different languages really took away from their development. It always felt awkward, which is a missed opportunity for what they could have been.\r\n\r\nDespite my story complaints, this movie was just entertaining. There were some pretty decent action scenes, Adam Driver was fantastic as always, and the overall concept was pretty unique. I loved the idea of this not being a time travel film, especially with that mixed with the extinction event of the dinosaurs. In the end, this film is not good, but it isn’t as bad as many would have you believe.\r\n\r\nScore: 56%\r\nVerdict: Decent", "created_at": "2023-05-15T13:20:09.847Z"}]