[{"movie_id": 675, "review_id": "5d5c84e46743fa00116f04a2", "author_rating": 8.0, "review_text": "Front and Centre for Dumbledore's Army.\r\n\r\nTerm 5 at Hogwarts for Harry and the gang and it's a deeply unsettling time. Harry faces getting expelled and finds himself shunned by many around him. This at a time when the Ministry of Magic compounds his misery by insisting to all and sundry that \"you know who\" is not back again.\r\n\r\nGiven that JK Rowling's fifth book is considered to be something of a door stopper, a book more of interim Potter filler than any great amount of substance, credit has to go to new to the franchise director, David Yates. For Yates and his screenwriter Michael Goldenberg have managed to craft a briskly entertaining segment in under 2 hours and 20 minutes of film. Yes it's safe to say that it ultimately does feel like an interim filler movie, one that is for fans and not newcomers to the series, but the effects are superb (except Grawp that is), the action is much and suspense is not in short supply. While it also finds Radcliffe as Potter finally hitting his acting stride.\r\n\r\nNew into the magical fray comes the wonderful Imelda Staunton as Dolores Umbrage, the sort of cheery psychotic teacher we all had bad dreams about in our formative years. Also most welcome is Helena Bonham Carter as nut job harpy Bellatrix Le Strange, it's an appetiser of substance and we can't wait to see some more of her from here on in. Of course the usual problem of not enough screen time for the regulars still exists, but it's now become a figure of grumpy acceptance in the grand scheme of Potter World. Neatly keeping the story trimmed of extraneous fat, Yates doesn't disappoint in delivering a last quarter as memorable as any so far in the series. Big rewards await those who wait, because the showdown that crowns Order of Phoenix is a magical mêlée of wands and wonderment; a face off between good and evil, a free for all that joyously assaults the senses.\r\n\r\nRoll on Half-Blood Prince, where it's great to know that Yates has been further entrusted with the Harry Potter reins. 7.5/10", "created_at": "2019-08-20T23:40:20.626Z"}, {"movie_id": 675, "review_id": "63b8902b7352050087ebba6a", "author_rating": 8.0, "review_text": "Harry Potter and the Order of the Phoenix is another solid entry into the series with fantastically high stakes, production value, and emotional scenes that leave a lasting impact.\r\n\r\nFrom the beginning minutes, the movie is doubling down on the dark tone the previous two began to establish. The threat of Voldemort still looms, but it is incredibly frustrating that no one seems to believe Harry and Dumbledore. That frustration is perfectly mirrored with Harry as he grows incredibly angry throughout the film, paralleling his connection with the Dark Lord. This more mature and seasoned Potter is a highlight, and his leadership begins to take center stage as he organizes his classmates to train to fight against the dark arts. These scenes are some of my favorites in the film.\r\n\r\nThis entry expands on the wizarding world with the Ministry of Magic and the Order of the Phoenix. The Ministry of Magic is terrible in this film, they are completely mad and delusional to accept any other explanation for the events that have taken place in the previous entries. This is none more present than the introduction of Mrs. Umbridge. She is the worst, and Imelda Staunton does an excellent job of being the worst. I hated her throughout the entire film and every one of her sly smiles was like nails on a chalkboard. Safe to say her finale was oh-so-satisfying.\r\n\r\nThe ending is slightly rushed, but the action is fantastic. It was a bit unbelievable that a group of students could face the Death Eaters by themselves, but the movie addressed the criticism when the Order came to save the day. I do have to say, the death scene of Sirius Black was pretty anti-climactic. The hit he takes happens so fast and he gingerly falls back into the portal never to be seen again, it did not have the resolution I would have hoped for with him being such an influential person in Harry's life. Plus, his limited screen time in the series draws back the effectiveness of his death. Despite that, the special effects in the Dumbledore and Voldemort battle were spectacular and unique, a brilliant way to cap off the film. Especially with the ending shot of Cornelius Fudge just realizing \"He's Back\"\r\n\r\nOverall, this is a slow movie with a limited amount of action. But the world-building and character development are some of the best in the series. It is not going to be everyone's favorite, but it was a great addition, even though the rewatchability is not that high.\r\n\r\nScore: 85% | \r\nVerdict Great", "created_at": "2023-01-06T21:18:35.378Z"}]