[{"movie_id": 1966, "review_id": "594262aec3a3686c2c0099f7", "author_rating": 2.0, "review_text": "My wife picked this one up together with the weekly TV magazine. Luckily we didn't pay full price. I hoped for a film about one of the greatest warlord of all time but what I got was something about a crying homosexual wimp.", "created_at": "2017-06-15T10:34:22.268Z"}, {"movie_id": 1966, "review_id": "5d0e0b04c3a36822c31e753b", "author_rating": 7.0, "review_text": "Alexander Revisited: The Final Cut.\r\n\r\nAlexander is directed by Oliver Stone and Stone co-writes the screenplay with Christopher Kyle and Laeta Kalogridis. It stars Colin Farrell, Val Kilmer, Angelina Jolie, Jared Leto, Anthony Hopkins, Rosario Dawson, Jonathan Rhys Meyers and Christopher Plummer. Music is by Vangelis and cinematography by Rodrigo Prieto.\r\n\r\nAlexander is an historical epic based on the life of Alexander the Great.\r\nOff the bat I have to say that this \"Final Cut\" version of the film is the only one I have seen. Upon its initial home format release - the first theatrical version - I lasted an hour and 15 minutes before growing restless and sought enjoyment elsewhere. Consequently as a massive fan of historical epics through the years, it has been a constant nagging itch for me to see Alexander in its entirety. So with Oliver Stone tinkering away with versions - convinced he has made a worthwhile epic - I finally delved in.\r\n\r\nThe Final Cut, as far as I'm aware, is a vast improvement on that savagely received theatrical release, well that is said by those who tried again instead of calling quits at the first production. Straight away I could see the difference, where once was a plodding first hour, now sits a vibrancy, with Stone seemingly saying that he can do great action and drama, just please hang around during all the historical chatter, sexual connotation, family strife and conquering machinations, and I will enthral you as a whole.\r\n\r\nBy his own admission, Stone reveals he took on a most complex historical character and in his eyes has made a film to befit such complexity. We get a splintered narrative, as we kick off with the crux of Alexander the Great, the leader, while Alexander's childhood and family forming is interspersed at various junctures. The battles are high in intensity and blood letting - exhilarating at times - but more crucially they let us engage with the tactical \"ahead of their time\" manoeuvres of Alexander the Great. This version mostly flows alright, and I got to feel how Alexander's mind was working in the process, even if come pics closure I didn't fully know the man.\r\n\r\nEpically cast of course, some of them work, others not so much. Farrell's looked odd, in the way that Pitt's was in Troy (released this same year as Alexander), but apart from the accent issue he grows into the role and is fiercely committed. Jolie is just wrong for the role of domineering Olympias, worse still the scenes she does with Farrell are damp and threaten to derail the drama already built up. This latter point is more annoying given a great thread involving Dawson as Alexander's wife Roxanne is built up superbly, only to not be pulled until some drama very late in the play. The rest of the cast come through as ok for period flavours (expected for Hopkins, Plummer and Meyers, interesting as regards Leto).\r\n\r\nThis is not the life ambition masterpiece Stone wanted to make, even if he proclaims on the extras that he's happy and content with The Final Cut version. This cut still shows some cracks, but these are not seismic enough to hurt the film. For there's a lot of grandeur, blood stirring and thought gone into the production, and there's a lot to be said for that in this day and age of soulless cash making filmic exercises. Honourable failure then? Yes for sure, but a better film in this form than some may have thought possible back in 2004. 7/10", "created_at": "2019-06-22T11:03:32.247Z"}, {"movie_id": 1966, "review_id": "6111fa92f04d01001f95bbd6", "author_rating": 6.0, "review_text": "_**Alexander’s conquests from Greece through Persia into northwestern India**_\r\n\r\nAfter being tutored by Aristotle (Christopher Plumber), Alexander (Colin Farrell) takes over the Macedonian throne in 336 BC at the age of 20 after his father is assassinated (Val Kilmer). Over the next 13 years he, amazingly, conquers the Persian Empire and heads into India before finally turning back. Anthony Hopkins narrates as Ptolemy in his old age while Angelina Jolie plays Alexander’s snake-loving mother. Rosario Dawson plays his wife acquired in Bactria (in what is today part of Afghanistan).\r\n\r\nOliver Stone’s “Alexander” (2004) was a challenging undertaking and has many attributes despite not being as compelling as the contemporaneous “Troy.” It’s a colorful, entertaining epic with a great cast, awesome battle scenes, exotic locations/sets and a fine score by Vangelis. Naturally the storyline is not as one-dimensional as “Troy” seeing as how it involves a movable empire traveling across western Asia.\r\n\r\nHistorically-minded critics complain about the sequence where Alexander's fatigued soldiers request not to push further into India in favor of returning to Macedonia to see their families again. Alexander denies their request and does something that paints him as an unreasonable tyrant. In real life Alexander pondered their demands for a few days before agreeing to turn back and didn't execute anyone, which showed what a compassionate, merciful leader he was. However, this dubious sequence was simply Stone’s amalgamation of several mutinies during his conquests, which was placed at that particular point in the story for dramatic reasons. Besides, the movie certainly illustrates how Alexander brought the light of civilization to his foreign subjects and was accepting of their cultures, wanting to unify the many tribes under one banner, so to speak.\r\n\r\nThe scenes with Val Kilmer as Alexander’s father are entertaining while the ones with Angelina Jolie get boring after the first two or three. We get it: she loves snakes, hates her husband and thinks Zeus was Alexander’s father. Half of the sequences with Jolie could’ve been cut with no harm done, which would’ve helped momentum.\r\n\r\nI didn’t have an issue with Alexander’s relationship with his childhood friend, Hephaistion (Jared Leto), since it’s clearly depicted as platonic in the sense of David and Jonathan in the Bible (see 2 Samuel 1:26). In the film the two are depicted as having a loving friendship wherein they occasionally hug and that’s it. I occasionally hug my best friend too, but I only sleep with my hot wife. \r\n\r\nAs far as Alexander being bisexual, there’s zero historical proof of this. Yes, the kiss between Alexander and Bagoas (Francisco Bosch) was mentioned by Plutarch who lived in the Roman Empire 200 years later but, assuming it happened, it doesn't mean much. Some cultures in history kissed on the mouth when greeting, like Russians; it’s a social tradition and has nothing to do with sexual desire. To put it in perspective, imagine a filmmaker saying Trump was gay 2327 years in the future even though he had numerous women, marriages and children in his life. It's slanderous and can be attributed to Stone's catering to Liberal propaganda as opposed to historical reality. In short, he played the homosexual card to be ‘hip’ and give his movie Lefty ‘edge,’ but it backfired because it bombed at the box office. Still, the scene in question is brief and all it suggests is that Alexander experimented with homosexuality once after partying which, let’s face it, is something Greeks are known for (although Alexander would argue that he’s technically Macedonian, lol).\r\n\r\nIf you can ignore that glaring flaw, there’s a lot to appreciate in “Alexander” since Stone is unquestionably a top-of-the-line filmmaker. And the flick certainly inspires viewers to look up the real history.\r\n\r\nThe film was shot at Pinewood Studios & Shepperton Studios, both just west of London, as well as Morocco and Thailand (it’s pretty easy to figure out which scenes were done where).\r\n\r\nThere are no less than four cuts of the film available: The theatrical cut runs 2 hr 55 min (175 min); the 2005 Director’s Cut runs 2 hr 47 min (167 min); the so-called Final Cut from 2007 runs 3 hr 34 min (214 min); and the 2013 Ultimate Cut runs 3 hr 27 min (207 min).    \r\n\r\nGRADE: B-", "created_at": "2021-08-10T04:03:30.420Z"}, {"movie_id": 1966, "review_id": "63b9aaea8c0a4800bae172f9", "author_rating": 6.0, "review_text": "Opinion on this film seems to have been hijacked somewhat by the definition and appropriateness of the relationship between Alexander (Farrell) and Hephaestion (Leto). It seems daft to try to apply 21st century social morals onto a society in which same sex relationships were simply unremarkable. Whether or not it was about sex, or love, or both isn't really that important - I think Oliver Stone was trying to involve us in a much more complex story of human nature. It may also be more of an Anglo-Saxon thing - men on Continental Europe from Scandinavia to the Mediterranean (and their N. American descendants) have a completely different, relaxed, view towards tactility amongst men. What this discussion does do successfully, however, is distract us from a pretty lacklustre effort at an epic. The film has grandeur and style but really does lack substance. It has all the grit of a beauty pageant. The script is wordy and weak, and characterisations way too shallow given we have effectively a blank canvas from which to work and an almost unlimited timeframe in which to tell the story. Inevitably, it does draw comparisons with Richard Burton and Frederic March's version from 1956 but not favourably; the all star cast here just doesn't really gel in the same way and the CGI isn't anywhere near as convincing as the real photography of the earlier iteration. Overall, a very well resourced missed opportunity to tell the tale of one of history's most enigmatic characters.", "created_at": "2023-01-07T17:24:58.911Z"}, {"movie_id": 1966, "review_id": "594262aec3a3686c2c0099f7", "author_rating": 2.0, "review_text": "My wife picked this one up together with the weekly TV magazine. Luckily we didn't pay full price. I hoped for a film about one of the greatest warlord of all time but what I got was something about a crying homosexual wimp.", "created_at": "2017-06-15T10:34:22.268Z"}, {"movie_id": 1966, "review_id": "5d0e0b04c3a36822c31e753b", "author_rating": 7.0, "review_text": "Alexander Revisited: The Final Cut.\r\n\r\nAlexander is directed by Oliver Stone and Stone co-writes the screenplay with Christopher Kyle and Laeta Kalogridis. It stars Colin Farrell, Val Kilmer, Angelina Jolie, Jared Leto, Anthony Hopkins, Rosario Dawson, Jonathan Rhys Meyers and Christopher Plummer. Music is by Vangelis and cinematography by Rodrigo Prieto.\r\n\r\nAlexander is an historical epic based on the life of Alexander the Great.\r\nOff the bat I have to say that this \"Final Cut\" version of the film is the only one I have seen. Upon its initial home format release - the first theatrical version - I lasted an hour and 15 minutes before growing restless and sought enjoyment elsewhere. Consequently as a massive fan of historical epics through the years, it has been a constant nagging itch for me to see Alexander in its entirety. So with Oliver Stone tinkering away with versions - convinced he has made a worthwhile epic - I finally delved in.\r\n\r\nThe Final Cut, as far as I'm aware, is a vast improvement on that savagely received theatrical release, well that is said by those who tried again instead of calling quits at the first production. Straight away I could see the difference, where once was a plodding first hour, now sits a vibrancy, with Stone seemingly saying that he can do great action and drama, just please hang around during all the historical chatter, sexual connotation, family strife and conquering machinations, and I will enthral you as a whole.\r\n\r\nBy his own admission, Stone reveals he took on a most complex historical character and in his eyes has made a film to befit such complexity. We get a splintered narrative, as we kick off with the crux of Alexander the Great, the leader, while Alexander's childhood and family forming is interspersed at various junctures. The battles are high in intensity and blood letting - exhilarating at times - but more crucially they let us engage with the tactical \"ahead of their time\" manoeuvres of Alexander the Great. This version mostly flows alright, and I got to feel how Alexander's mind was working in the process, even if come pics closure I didn't fully know the man.\r\n\r\nEpically cast of course, some of them work, others not so much. Farrell's looked odd, in the way that Pitt's was in Troy (released this same year as Alexander), but apart from the accent issue he grows into the role and is fiercely committed. Jolie is just wrong for the role of domineering Olympias, worse still the scenes she does with Farrell are damp and threaten to derail the drama already built up. This latter point is more annoying given a great thread involving Dawson as Alexander's wife Roxanne is built up superbly, only to not be pulled until some drama very late in the play. The rest of the cast come through as ok for period flavours (expected for Hopkins, Plummer and Meyers, interesting as regards Leto).\r\n\r\nThis is not the life ambition masterpiece Stone wanted to make, even if he proclaims on the extras that he's happy and content with The Final Cut version. This cut still shows some cracks, but these are not seismic enough to hurt the film. For there's a lot of grandeur, blood stirring and thought gone into the production, and there's a lot to be said for that in this day and age of soulless cash making filmic exercises. Honourable failure then? Yes for sure, but a better film in this form than some may have thought possible back in 2004. 7/10", "created_at": "2019-06-22T11:03:32.247Z"}, {"movie_id": 1966, "review_id": "6111fa92f04d01001f95bbd6", "author_rating": 6.0, "review_text": "_**Alexander’s conquests from Greece through Persia into northwestern India**_\r\n\r\nAfter being tutored by Aristotle (Christopher Plumber), Alexander (Colin Farrell) takes over the Macedonian throne in 336 BC at the age of 20 after his father is assassinated (Val Kilmer). Over the next 13 years he, amazingly, conquers the Persian Empire and heads into India before finally turning back. Anthony Hopkins narrates as Ptolemy in his old age while Angelina Jolie plays Alexander’s snake-loving mother. Rosario Dawson plays his wife acquired in Bactria (in what is today part of Afghanistan).\r\n\r\nOliver Stone’s “Alexander” (2004) was a challenging undertaking and has many attributes despite not being as compelling as the contemporaneous “Troy.” It’s a colorful, entertaining epic with a great cast, awesome battle scenes, exotic locations/sets and a fine score by Vangelis. Naturally the storyline is not as one-dimensional as “Troy” seeing as how it involves a movable empire traveling across western Asia.\r\n\r\nHistorically-minded critics complain about the sequence where Alexander's fatigued soldiers request not to push further into India in favor of returning to Macedonia to see their families again. Alexander denies their request and does something that paints him as an unreasonable tyrant. In real life Alexander pondered their demands for a few days before agreeing to turn back and didn't execute anyone, which showed what a compassionate, merciful leader he was. However, this dubious sequence was simply Stone’s amalgamation of several mutinies during his conquests, which was placed at that particular point in the story for dramatic reasons. Besides, the movie certainly illustrates how Alexander brought the light of civilization to his foreign subjects and was accepting of their cultures, wanting to unify the many tribes under one banner, so to speak.\r\n\r\nThe scenes with Val Kilmer as Alexander’s father are entertaining while the ones with Angelina Jolie get boring after the first two or three. We get it: she loves snakes, hates her husband and thinks Zeus was Alexander’s father. Half of the sequences with Jolie could’ve been cut with no harm done, which would’ve helped momentum.\r\n\r\nI didn’t have an issue with Alexander’s relationship with his childhood friend, Hephaistion (Jared Leto), since it’s clearly depicted as platonic in the sense of David and Jonathan in the Bible (see 2 Samuel 1:26). In the film the two are depicted as having a loving friendship wherein they occasionally hug and that’s it. I occasionally hug my best friend too, but I only sleep with my hot wife. \r\n\r\nAs far as Alexander being bisexual, there’s zero historical proof of this. Yes, the kiss between Alexander and Bagoas (Francisco Bosch) was mentioned by Plutarch who lived in the Roman Empire 200 years later but, assuming it happened, it doesn't mean much. Some cultures in history kissed on the mouth when greeting, like Russians; it’s a social tradition and has nothing to do with sexual desire. To put it in perspective, imagine a filmmaker saying Trump was gay 2327 years in the future even though he had numerous women, marriages and children in his life. It's slanderous and can be attributed to Stone's catering to Liberal propaganda as opposed to historical reality. In short, he played the homosexual card to be ‘hip’ and give his movie Lefty ‘edge,’ but it backfired because it bombed at the box office. Still, the scene in question is brief and all it suggests is that Alexander experimented with homosexuality once after partying which, let’s face it, is something Greeks are known for (although Alexander would argue that he’s technically Macedonian, lol).\r\n\r\nIf you can ignore that glaring flaw, there’s a lot to appreciate in “Alexander” since Stone is unquestionably a top-of-the-line filmmaker. And the flick certainly inspires viewers to look up the real history.\r\n\r\nThe film was shot at Pinewood Studios & Shepperton Studios, both just west of London, as well as Morocco and Thailand (it’s pretty easy to figure out which scenes were done where).\r\n\r\nThere are no less than four cuts of the film available: The theatrical cut runs 2 hr 55 min (175 min); the 2005 Director’s Cut runs 2 hr 47 min (167 min); the so-called Final Cut from 2007 runs 3 hr 34 min (214 min); and the 2013 Ultimate Cut runs 3 hr 27 min (207 min).    \r\n\r\nGRADE: B-", "created_at": "2021-08-10T04:03:30.420Z"}, {"movie_id": 1966, "review_id": "63b9aaea8c0a4800bae172f9", "author_rating": 6.0, "review_text": "Opinion on this film seems to have been hijacked somewhat by the definition and appropriateness of the relationship between Alexander (Farrell) and Hephaestion (Leto). It seems daft to try to apply 21st century social morals onto a society in which same sex relationships were simply unremarkable. Whether or not it was about sex, or love, or both isn't really that important - I think Oliver Stone was trying to involve us in a much more complex story of human nature. It may also be more of an Anglo-Saxon thing - men on Continental Europe from Scandinavia to the Mediterranean (and their N. American descendants) have a completely different, relaxed, view towards tactility amongst men. What this discussion does do successfully, however, is distract us from a pretty lacklustre effort at an epic. The film has grandeur and style but really does lack substance. It has all the grit of a beauty pageant. The script is wordy and weak, and characterisations way too shallow given we have effectively a blank canvas from which to work and an almost unlimited timeframe in which to tell the story. Inevitably, it does draw comparisons with Richard Burton and Frederic March's version from 1956 but not favourably; the all star cast here just doesn't really gel in the same way and the CGI isn't anywhere near as convincing as the real photography of the earlier iteration. Overall, a very well resourced missed opportunity to tell the tale of one of history's most enigmatic characters.", "created_at": "2023-01-07T17:24:58.911Z"}, {"movie_id": 1966, "review_id": "594262aec3a3686c2c0099f7", "author_rating": 2.0, "review_text": "My wife picked this one up together with the weekly TV magazine. Luckily we didn't pay full price. I hoped for a film about one of the greatest warlord of all time but what I got was something about a crying homosexual wimp.", "created_at": "2017-06-15T10:34:22.268Z"}, {"movie_id": 1966, "review_id": "5d0e0b04c3a36822c31e753b", "author_rating": 7.0, "review_text": "Alexander Revisited: The Final Cut.\r\n\r\nAlexander is directed by Oliver Stone and Stone co-writes the screenplay with Christopher Kyle and Laeta Kalogridis. It stars Colin Farrell, Val Kilmer, Angelina Jolie, Jared Leto, Anthony Hopkins, Rosario Dawson, Jonathan Rhys Meyers and Christopher Plummer. Music is by Vangelis and cinematography by Rodrigo Prieto.\r\n\r\nAlexander is an historical epic based on the life of Alexander the Great.\r\nOff the bat I have to say that this \"Final Cut\" version of the film is the only one I have seen. Upon its initial home format release - the first theatrical version - I lasted an hour and 15 minutes before growing restless and sought enjoyment elsewhere. Consequently as a massive fan of historical epics through the years, it has been a constant nagging itch for me to see Alexander in its entirety. So with Oliver Stone tinkering away with versions - convinced he has made a worthwhile epic - I finally delved in.\r\n\r\nThe Final Cut, as far as I'm aware, is a vast improvement on that savagely received theatrical release, well that is said by those who tried again instead of calling quits at the first production. Straight away I could see the difference, where once was a plodding first hour, now sits a vibrancy, with Stone seemingly saying that he can do great action and drama, just please hang around during all the historical chatter, sexual connotation, family strife and conquering machinations, and I will enthral you as a whole.\r\n\r\nBy his own admission, Stone reveals he took on a most complex historical character and in his eyes has made a film to befit such complexity. We get a splintered narrative, as we kick off with the crux of Alexander the Great, the leader, while Alexander's childhood and family forming is interspersed at various junctures. The battles are high in intensity and blood letting - exhilarating at times - but more crucially they let us engage with the tactical \"ahead of their time\" manoeuvres of Alexander the Great. This version mostly flows alright, and I got to feel how Alexander's mind was working in the process, even if come pics closure I didn't fully know the man.\r\n\r\nEpically cast of course, some of them work, others not so much. Farrell's looked odd, in the way that Pitt's was in Troy (released this same year as Alexander), but apart from the accent issue he grows into the role and is fiercely committed. Jolie is just wrong for the role of domineering Olympias, worse still the scenes she does with Farrell are damp and threaten to derail the drama already built up. This latter point is more annoying given a great thread involving Dawson as Alexander's wife Roxanne is built up superbly, only to not be pulled until some drama very late in the play. The rest of the cast come through as ok for period flavours (expected for Hopkins, Plummer and Meyers, interesting as regards Leto).\r\n\r\nThis is not the life ambition masterpiece Stone wanted to make, even if he proclaims on the extras that he's happy and content with The Final Cut version. This cut still shows some cracks, but these are not seismic enough to hurt the film. For there's a lot of grandeur, blood stirring and thought gone into the production, and there's a lot to be said for that in this day and age of soulless cash making filmic exercises. Honourable failure then? Yes for sure, but a better film in this form than some may have thought possible back in 2004. 7/10", "created_at": "2019-06-22T11:03:32.247Z"}, {"movie_id": 1966, "review_id": "6111fa92f04d01001f95bbd6", "author_rating": 6.0, "review_text": "_**Alexander’s conquests from Greece through Persia into northwestern India**_\r\n\r\nAfter being tutored by Aristotle (Christopher Plumber), Alexander (Colin Farrell) takes over the Macedonian throne in 336 BC at the age of 20 after his father is assassinated (Val Kilmer). Over the next 13 years he, amazingly, conquers the Persian Empire and heads into India before finally turning back. Anthony Hopkins narrates as Ptolemy in his old age while Angelina Jolie plays Alexander’s snake-loving mother. Rosario Dawson plays his wife acquired in Bactria (in what is today part of Afghanistan).\r\n\r\nOliver Stone’s “Alexander” (2004) was a challenging undertaking and has many attributes despite not being as compelling as the contemporaneous “Troy.” It’s a colorful, entertaining epic with a great cast, awesome battle scenes, exotic locations/sets and a fine score by Vangelis. Naturally the storyline is not as one-dimensional as “Troy” seeing as how it involves a movable empire traveling across western Asia.\r\n\r\nHistorically-minded critics complain about the sequence where Alexander's fatigued soldiers request not to push further into India in favor of returning to Macedonia to see their families again. Alexander denies their request and does something that paints him as an unreasonable tyrant. In real life Alexander pondered their demands for a few days before agreeing to turn back and didn't execute anyone, which showed what a compassionate, merciful leader he was. However, this dubious sequence was simply Stone’s amalgamation of several mutinies during his conquests, which was placed at that particular point in the story for dramatic reasons. Besides, the movie certainly illustrates how Alexander brought the light of civilization to his foreign subjects and was accepting of their cultures, wanting to unify the many tribes under one banner, so to speak.\r\n\r\nThe scenes with Val Kilmer as Alexander’s father are entertaining while the ones with Angelina Jolie get boring after the first two or three. We get it: she loves snakes, hates her husband and thinks Zeus was Alexander’s father. Half of the sequences with Jolie could’ve been cut with no harm done, which would’ve helped momentum.\r\n\r\nI didn’t have an issue with Alexander’s relationship with his childhood friend, Hephaistion (Jared Leto), since it’s clearly depicted as platonic in the sense of David and Jonathan in the Bible (see 2 Samuel 1:26). In the film the two are depicted as having a loving friendship wherein they occasionally hug and that’s it. I occasionally hug my best friend too, but I only sleep with my hot wife. \r\n\r\nAs far as Alexander being bisexual, there’s zero historical proof of this. Yes, the kiss between Alexander and Bagoas (Francisco Bosch) was mentioned by Plutarch who lived in the Roman Empire 200 years later but, assuming it happened, it doesn't mean much. Some cultures in history kissed on the mouth when greeting, like Russians; it’s a social tradition and has nothing to do with sexual desire. To put it in perspective, imagine a filmmaker saying Trump was gay 2327 years in the future even though he had numerous women, marriages and children in his life. It's slanderous and can be attributed to Stone's catering to Liberal propaganda as opposed to historical reality. In short, he played the homosexual card to be ‘hip’ and give his movie Lefty ‘edge,’ but it backfired because it bombed at the box office. Still, the scene in question is brief and all it suggests is that Alexander experimented with homosexuality once after partying which, let’s face it, is something Greeks are known for (although Alexander would argue that he’s technically Macedonian, lol).\r\n\r\nIf you can ignore that glaring flaw, there’s a lot to appreciate in “Alexander” since Stone is unquestionably a top-of-the-line filmmaker. And the flick certainly inspires viewers to look up the real history.\r\n\r\nThe film was shot at Pinewood Studios & Shepperton Studios, both just west of London, as well as Morocco and Thailand (it’s pretty easy to figure out which scenes were done where).\r\n\r\nThere are no less than four cuts of the film available: The theatrical cut runs 2 hr 55 min (175 min); the 2005 Director’s Cut runs 2 hr 47 min (167 min); the so-called Final Cut from 2007 runs 3 hr 34 min (214 min); and the 2013 Ultimate Cut runs 3 hr 27 min (207 min).    \r\n\r\nGRADE: B-", "created_at": "2021-08-10T04:03:30.420Z"}, {"movie_id": 1966, "review_id": "63b9aaea8c0a4800bae172f9", "author_rating": 6.0, "review_text": "Opinion on this film seems to have been hijacked somewhat by the definition and appropriateness of the relationship between Alexander (Farrell) and Hephaestion (Leto). It seems daft to try to apply 21st century social morals onto a society in which same sex relationships were simply unremarkable. Whether or not it was about sex, or love, or both isn't really that important - I think Oliver Stone was trying to involve us in a much more complex story of human nature. It may also be more of an Anglo-Saxon thing - men on Continental Europe from Scandinavia to the Mediterranean (and their N. American descendants) have a completely different, relaxed, view towards tactility amongst men. What this discussion does do successfully, however, is distract us from a pretty lacklustre effort at an epic. The film has grandeur and style but really does lack substance. It has all the grit of a beauty pageant. The script is wordy and weak, and characterisations way too shallow given we have effectively a blank canvas from which to work and an almost unlimited timeframe in which to tell the story. Inevitably, it does draw comparisons with Richard Burton and Frederic March's version from 1956 but not favourably; the all star cast here just doesn't really gel in the same way and the CGI isn't anywhere near as convincing as the real photography of the earlier iteration. Overall, a very well resourced missed opportunity to tell the tale of one of history's most enigmatic characters.", "created_at": "2023-01-07T17:24:58.911Z"}, {"movie_id": 1966, "review_id": "594262aec3a3686c2c0099f7", "author_rating": 2.0, "review_text": "My wife picked this one up together with the weekly TV magazine. Luckily we didn't pay full price. I hoped for a film about one of the greatest warlord of all time but what I got was something about a crying homosexual wimp.", "created_at": "2017-06-15T10:34:22.268Z"}, {"movie_id": 1966, "review_id": "5d0e0b04c3a36822c31e753b", "author_rating": 7.0, "review_text": "Alexander Revisited: The Final Cut.\r\n\r\nAlexander is directed by Oliver Stone and Stone co-writes the screenplay with Christopher Kyle and Laeta Kalogridis. It stars Colin Farrell, Val Kilmer, Angelina Jolie, Jared Leto, Anthony Hopkins, Rosario Dawson, Jonathan Rhys Meyers and Christopher Plummer. Music is by Vangelis and cinematography by Rodrigo Prieto.\r\n\r\nAlexander is an historical epic based on the life of Alexander the Great.\r\nOff the bat I have to say that this \"Final Cut\" version of the film is the only one I have seen. Upon its initial home format release - the first theatrical version - I lasted an hour and 15 minutes before growing restless and sought enjoyment elsewhere. Consequently as a massive fan of historical epics through the years, it has been a constant nagging itch for me to see Alexander in its entirety. So with Oliver Stone tinkering away with versions - convinced he has made a worthwhile epic - I finally delved in.\r\n\r\nThe Final Cut, as far as I'm aware, is a vast improvement on that savagely received theatrical release, well that is said by those who tried again instead of calling quits at the first production. Straight away I could see the difference, where once was a plodding first hour, now sits a vibrancy, with Stone seemingly saying that he can do great action and drama, just please hang around during all the historical chatter, sexual connotation, family strife and conquering machinations, and I will enthral you as a whole.\r\n\r\nBy his own admission, Stone reveals he took on a most complex historical character and in his eyes has made a film to befit such complexity. We get a splintered narrative, as we kick off with the crux of Alexander the Great, the leader, while Alexander's childhood and family forming is interspersed at various junctures. The battles are high in intensity and blood letting - exhilarating at times - but more crucially they let us engage with the tactical \"ahead of their time\" manoeuvres of Alexander the Great. This version mostly flows alright, and I got to feel how Alexander's mind was working in the process, even if come pics closure I didn't fully know the man.\r\n\r\nEpically cast of course, some of them work, others not so much. Farrell's looked odd, in the way that Pitt's was in Troy (released this same year as Alexander), but apart from the accent issue he grows into the role and is fiercely committed. Jolie is just wrong for the role of domineering Olympias, worse still the scenes she does with Farrell are damp and threaten to derail the drama already built up. This latter point is more annoying given a great thread involving Dawson as Alexander's wife Roxanne is built up superbly, only to not be pulled until some drama very late in the play. The rest of the cast come through as ok for period flavours (expected for Hopkins, Plummer and Meyers, interesting as regards Leto).\r\n\r\nThis is not the life ambition masterpiece Stone wanted to make, even if he proclaims on the extras that he's happy and content with The Final Cut version. This cut still shows some cracks, but these are not seismic enough to hurt the film. For there's a lot of grandeur, blood stirring and thought gone into the production, and there's a lot to be said for that in this day and age of soulless cash making filmic exercises. Honourable failure then? Yes for sure, but a better film in this form than some may have thought possible back in 2004. 7/10", "created_at": "2019-06-22T11:03:32.247Z"}, {"movie_id": 1966, "review_id": "6111fa92f04d01001f95bbd6", "author_rating": 6.0, "review_text": "_**Alexander’s conquests from Greece through Persia into northwestern India**_\r\n\r\nAfter being tutored by Aristotle (Christopher Plumber), Alexander (Colin Farrell) takes over the Macedonian throne in 336 BC at the age of 20 after his father is assassinated (Val Kilmer). Over the next 13 years he, amazingly, conquers the Persian Empire and heads into India before finally turning back. Anthony Hopkins narrates as Ptolemy in his old age while Angelina Jolie plays Alexander’s snake-loving mother. Rosario Dawson plays his wife acquired in Bactria (in what is today part of Afghanistan).\r\n\r\nOliver Stone’s “Alexander” (2004) was a challenging undertaking and has many attributes despite not being as compelling as the contemporaneous “Troy.” It’s a colorful, entertaining epic with a great cast, awesome battle scenes, exotic locations/sets and a fine score by Vangelis. Naturally the storyline is not as one-dimensional as “Troy” seeing as how it involves a movable empire traveling across western Asia.\r\n\r\nHistorically-minded critics complain about the sequence where Alexander's fatigued soldiers request not to push further into India in favor of returning to Macedonia to see their families again. Alexander denies their request and does something that paints him as an unreasonable tyrant. In real life Alexander pondered their demands for a few days before agreeing to turn back and didn't execute anyone, which showed what a compassionate, merciful leader he was. However, this dubious sequence was simply Stone’s amalgamation of several mutinies during his conquests, which was placed at that particular point in the story for dramatic reasons. Besides, the movie certainly illustrates how Alexander brought the light of civilization to his foreign subjects and was accepting of their cultures, wanting to unify the many tribes under one banner, so to speak.\r\n\r\nThe scenes with Val Kilmer as Alexander’s father are entertaining while the ones with Angelina Jolie get boring after the first two or three. We get it: she loves snakes, hates her husband and thinks Zeus was Alexander’s father. Half of the sequences with Jolie could’ve been cut with no harm done, which would’ve helped momentum.\r\n\r\nI didn’t have an issue with Alexander’s relationship with his childhood friend, Hephaistion (Jared Leto), since it’s clearly depicted as platonic in the sense of David and Jonathan in the Bible (see 2 Samuel 1:26). In the film the two are depicted as having a loving friendship wherein they occasionally hug and that’s it. I occasionally hug my best friend too, but I only sleep with my hot wife. \r\n\r\nAs far as Alexander being bisexual, there’s zero historical proof of this. Yes, the kiss between Alexander and Bagoas (Francisco Bosch) was mentioned by Plutarch who lived in the Roman Empire 200 years later but, assuming it happened, it doesn't mean much. Some cultures in history kissed on the mouth when greeting, like Russians; it’s a social tradition and has nothing to do with sexual desire. To put it in perspective, imagine a filmmaker saying Trump was gay 2327 years in the future even though he had numerous women, marriages and children in his life. It's slanderous and can be attributed to Stone's catering to Liberal propaganda as opposed to historical reality. In short, he played the homosexual card to be ‘hip’ and give his movie Lefty ‘edge,’ but it backfired because it bombed at the box office. Still, the scene in question is brief and all it suggests is that Alexander experimented with homosexuality once after partying which, let’s face it, is something Greeks are known for (although Alexander would argue that he’s technically Macedonian, lol).\r\n\r\nIf you can ignore that glaring flaw, there’s a lot to appreciate in “Alexander” since Stone is unquestionably a top-of-the-line filmmaker. And the flick certainly inspires viewers to look up the real history.\r\n\r\nThe film was shot at Pinewood Studios & Shepperton Studios, both just west of London, as well as Morocco and Thailand (it’s pretty easy to figure out which scenes were done where).\r\n\r\nThere are no less than four cuts of the film available: The theatrical cut runs 2 hr 55 min (175 min); the 2005 Director’s Cut runs 2 hr 47 min (167 min); the so-called Final Cut from 2007 runs 3 hr 34 min (214 min); and the 2013 Ultimate Cut runs 3 hr 27 min (207 min).    \r\n\r\nGRADE: B-", "created_at": "2021-08-10T04:03:30.420Z"}, {"movie_id": 1966, "review_id": "63b9aaea8c0a4800bae172f9", "author_rating": 6.0, "review_text": "Opinion on this film seems to have been hijacked somewhat by the definition and appropriateness of the relationship between Alexander (Farrell) and Hephaestion (Leto). It seems daft to try to apply 21st century social morals onto a society in which same sex relationships were simply unremarkable. Whether or not it was about sex, or love, or both isn't really that important - I think Oliver Stone was trying to involve us in a much more complex story of human nature. It may also be more of an Anglo-Saxon thing - men on Continental Europe from Scandinavia to the Mediterranean (and their N. American descendants) have a completely different, relaxed, view towards tactility amongst men. What this discussion does do successfully, however, is distract us from a pretty lacklustre effort at an epic. The film has grandeur and style but really does lack substance. It has all the grit of a beauty pageant. The script is wordy and weak, and characterisations way too shallow given we have effectively a blank canvas from which to work and an almost unlimited timeframe in which to tell the story. Inevitably, it does draw comparisons with Richard Burton and Frederic March's version from 1956 but not favourably; the all star cast here just doesn't really gel in the same way and the CGI isn't anywhere near as convincing as the real photography of the earlier iteration. Overall, a very well resourced missed opportunity to tell the tale of one of history's most enigmatic characters.", "created_at": "2023-01-07T17:24:58.911Z"}]