[{"movie_id": 473309, "review_id": "5cda20b70e0a26045ccd1d5d", "author_rating": 7.0, "review_text": "**_Powerful film-making_**\r\n\r\n> _It is not wrong to be loyal to the righteous and just God of the Bible. He tells us that he will accept \"in his holy mountain\" only those who walk faultlessly, practice righteousness and speak truth (Ps. 15). If, though, a Christian were to throw in his lot with a wrongdoer who has been rejected by God and disfellowshipped, or has disassociated himself, that would be as much as saying \"I do not want a place in God's holy mountain either.\" If the elders saw him heading in that direction by regularly keeping company with a disfellowshiped person, they would lovin__gly and patiently try to help him to regain God's view (Matt. 18:18; Gal.6:1). They would admonish him and, if necessary, \"reprove him with severity.\" They want to help him remain \"in God's holy mountain.\" But if he will not cease to fellowship with the expelled person, he thus has made himself \"a sharer (supporting or participating) in the wicked works\" and must be removed from the congregation, expelled.​_\r\n\r\n- \"Disfellowshiping: How to View It\"; _The Watchtower Announcing Jehovah's Kingdom_ (September 15, 1981)\r\n\r\n_Apostasy_ is the low-budget feature debut of writer/director Daniel Kokotajlo and, as the name implies, it tells the story of a breakdown in the relationship between a member of the faithful and the organised religion to which they adhere, which, in this case, is the Christian denomination movement known as Jehovah's Witnesses. However, whilst the film tells the story of one person abandoning their religion, it also tells the parallel story of two people who refuse to do so, committing themselves more and more to its practices, even as they come to question some of its dogma.\r\n\r\nIvanna (Siobhan Finneran) is a mother to two girls, Luisa (Sacha Parkinson) and her younger sister Alex (Molly Wright). Living in a working-class area in Oldham, Greater Manchester, all three are Witnesses, with Alex in particular embracing the role of a publisher (the name for Witnesses active in proselytising), even going so far as to learn Urdu so she can better preach to people in the neighbourhood. The film begins with Alex attending her doctor (Poppy Jhakra), who is explaining that her condition means she may need a blood transfusion in the future. Giving her a document to sign agreeing to allow such a procedure, the doctor promises to keep it a secret from Ivanna. Alex, however, has no interest in signing. Born anaemic, she received a blood transfusion when only a few hours old, against the wishes of Ivanna, and because of this, she is burdened with a sense of guilt, believing she must atone by adhering rigidly to Witness doctrine, helping at the local Kingdom Hall (the term used by Witnesses for their places of worship), and preaching door-to-door. Meanwhile, Luisa returns home from college, and tells Ivanna that she's pregnant, and even worse, the father is not a Witness. Ivanna is disgusted, demanding that Luisa marry the father. When she refuses, she is \"disfellowshipped\". However, as one of the requirements of disfellowship is that family members who remain Witnesses cannot have any significant contact, Ivanna forces Luisa to leave home. At the same time, Steven (Robert Emms) arrives in the neighbourhood as a new elder. He becomes friends with Ivanna and Alex, and after a few weeks, proposes to Alex.\r\n\r\nThis plot summary takes us up to about a half-hour in the film, which is loosely divided into three discernible acts – the first focuses on Alex, the second Luisa, and the third Ivanna. At the end of the first act, the plot takes a turn, which I have to admit, I didn't see coming, and which changes everything for the family and how they conduct themselves and observe their religious beliefs.\r\n\r\nTo fully engage with the film at a critical level, one must first contextualise its _milieu_. Kokotajlo is himself an apostate, as he was raised a Witness, but left in his 20s. However, what does being an apostate mean in a practical sense? Why is it such a big deal? _The Watchtower Announcing Jehovah's Kingdom_, one of two official Witness magazines (and which features prominently in the film), defines an apostate as a person who has abandoned the worship of Jehovah, and aligned themselves with Satan, and/or a person who has rejected the church's teachings, doctrines, dogma, biblical interpretations, and religious holidays. Along these lines, The Watchtower calls apostates \"anti-Jehovah\", explaining that when the End Time comes, they will not be permitted to enter the Millennial Kingdom. Important here is that anyone espousing a doctrine which deviates from official policy is also seen as an apostate, and is disfellowshiped, even if they still consider themselves a Witness (more on this issue later). According to _The Watchtower_, apostates are motivated by bitterness, and exhibit traits of \"_prideful intelligence, lack of love, and dishonesty_,\" with their goal being to \"_to tear down Jehovah's people and to distort the Truth_.\" Reasons one may become an apostate include presumptuousness, ungratefulness, misguided independence, jealousy, and mental disease. Such people are prone to drunkenness, have loose morals, and fornicate with multiple partners. Witnesses regard apostates as much worse (in a moral sense) than they regard non-Witnesses, and if a Witness even speaks to an apostate, the church considers that person \"_a sharer in [the apostate's] wicked works._\"\r\n\r\nFrom a contextualisation standpoint, it's also beneficial to give a brief overview of the development of the religion, particularly its eschatological dogma, as this is central to Witnesses' core beliefs, and an important theme in the film. Witnesses' origins can be traced to 1870, when Charles Taze Russell formed the Bible Student movement. Millenarian in design, the movement was greatly influenced by Millerism and Adventism, and employed hermeneutics to reject foundational Christian doctrine, including trinitarianism, the existence of hell, and the immortality of the soul. In _Three Worlds, and the Harvest of this World_ (1876), Russell and Nelson H. Barbour developed a dispensationalist eschatology, arguing that Christ had been on earth since 1874, and in 1878, the current dispensation will end, and human society will be replaced by the Millennial Kingdom, in which only the chosen few will be allowed to live. In 1879, Russell began publishing _Zion's Watch Tower and the Herald of Christ's Presence_ so as to communicate to people that the End Time was imminent. In 1881, he posited that this was the year of the Rapture. By this stage, there were enough people following Russell to warrant the formation of a governing body, Zion's Watch Tower Tract Society.\r\n\r\nIn 1884, the Society was formally recognised as a religion, and Russell now posited 1914 as the end of human society, a claim he felt was corroborated by the outbreak of the Great War. He died in 1916, still of the belief that human society would soon collapse, but the date was now 1918. Russell was succeeded by Joseph Franklin Rutherford, who offered a different interpretation of the scripture; the End Time didn't began in 1914, instead, it would begin during the lifetime of the generation alive in 1914. In 1920, he asserted that the Millennial Kingdom would come into being in 1925. The term \"Jehovah's witnesses\" was adopted as the religion's name in 1931, taken from Isaiah 43:10. Rutherford died in 1942, succeeded by Nathan Homer Knorr, who commissioned a new translation of the bible to be used by all Witnesses (_The New World Translation of the Holy Scriptures_). In 1966, the date of the End Time was changed to 1975, and was subsequently changed again in 1984, 1995, and 2010.\r\n\r\nThe current belief is that Satan was cast down to earth sometime after October 1, 1914, and he rules over humanity by controlling governments. Since 1932, Witnesses have believed that 144,000 people will be resurrected during the End Time, and transferred to heaven to rule at Christ's side, whilst the rest of the faithful will remain on earth, living in the Millennial Kingdom, a theory based upon a literal interpretation of Revelation 14:1-5.\r\n\r\nAccording to official publications, there are now over eight million Witnesses worldwide. The refusal of blood transfusions (another important theme in the film) was introduced in the Netherlands in 1945, based primarily on Genesis 9:4 (\"_Only flesh with its life - its blood - you must not eat_\") and Leviticus 17:10 (\"_If any man of the house of Israel or any foreigner who is residing in your midst eats any sort of blood, I will certainly set my face against the one who is eating the blood, and I will cut him off from among his people_\"). In 1961, having a transfusion became grounds for disfellowship, at which time Dr. Américo Valério claimed transfusions lead to \"_moral insanity [and] sexual perversion_,\" whilst Dr. Alonzo Jay Shadman argued, \"_the poisons that produce the impulse to commit suicide, murder, or steal are in the blood._\" It is estimated that in the period 1961-2016, over 33,000 Witnesses died rather than accept blood. In 2016 alone, there were over 1,200 deaths.\r\n\r\nWith all of that in mind, one of the most impressive aspects of the film is how implicitly Kokotajlo introduces many of these themes, trusting in the audience's intelligence to do the legwork, whilst not even providing us with music cues to tell us what we should be thinking at any given moment. For example, like most religions, Witnesses considers itself the only true religion, and only its adherents will be saved. This is brought to the fore when Alex encounters people who don't subscribe to her beliefs; meeting two of Luisa's college friends, she is bemused that they don't agree with Witness teachings, and even more incredulous when she finds out that not only are they not Witnesses, they are areligious altogether. It's a scene which deftly demonstrates the isolationist nature of Witnesses without telegraphing it.\r\n\r\nTied closely to this is the theme of having independent thoughts, which, again, is introduced very subtly. After Luisa is disfellowshiped, she makes an effort to return to the fold, but Steven expresses doubts as to whether she will succeed, as she \"has too many of her own ideas,\" something frowned upon by Witnesses. That Kokotajlo views this as a central theme in the film is evidenced in multiple interviews he has given. Speaking to _The Irish Times_, he says,\r\n\r\n> _one of the biggest things that happened to me was going to college. Suddenly, people were asking for my opinion on things. That was a new concept for me as a Witness. At the Kingdom Hall, if you were asked questions, it was an opportunity to say what was already there in the Watchtower._\r\n\r\nSimilarly, speaking to _The Guardian_, he states,\r\n\r\n> _I went to college, and that was the key, really. People would ask my opinion on something, and I would be scrambling round trying to find an answer in a text somewhere – because that's what life as a Witness is like. It's group thinking based on the interpretation of a text._\r\n\r\nLikewise, speaking to _Screen International_, he explains,\r\n\r\n> _I was harbouring doubts since I went to college. I realised that people at college were interested in your opinion. That was a new concept to me because being a Witness it was always about reaffirming the text, group-think, it wasn't about encouraging independent thought._\r\n\r\nAnother important theme is even more implicit – likening Witnesses to Scientology. This is never overtly addressed, but Kokotajlo's presentation of how Witnesses deal with certain issues unquestionably draws parallels with how Scientologists deal with those same issues. This is perhaps most obvious in how the film depicts disfellowship, emphasising that the family of someone who has been disfellowed must cut off contact with them. This is virtually identical to the notion of \"suppressive persons\" in Scientology, and in his _Irish Times_ interview, Kokotajlo states,\r\n\r\n> _that's representative of what a lot of Witnesses have to go through. Family members are forced to shun other family members._\r\n\r\nLooking at the film in a more aesthetic sense, an interesting stylistic device is how Kokotajlo presents characters talking to Jehovah. Although they speak aloud, the people around them don't hear what they're saying (think of a soliloquy on a crowded stage in Shakespeare). This essentially positions the viewer as Jehovah – just like Him, we are in a position to hear what others cannot. Indeed, on a couple of occasions, this positioning of the viewer is foregrounded even more, as characters speak direct-to-camera. It's a daring move, but one which is extremely well handled, unifying form and content.\r\n\r\nThe film is undeniably bleak, but never melodramatic, in its depiction of the conflicts that can arise when a family dynamic is in diametrical opposition to Witness doctrine. However, a vital point is that whilst the film is highly critical of the closed-off nature of the religion, the rules and regulations, and the unfulfilled prophecies, it depicts very humanised characters. In relation to this, Kokotajlo told _The Irish Times_,\r\n\r\n> _one of the aims of the film was to treat the Witnesses with a lot of respect […] I have a lot of compassion for the people within the religion. It's the rules that the organisation creates that I have an issue with. Not the people trying to navigate those rules._\r\n\r\nAlong the same lines, the acting is exemplary, which each of the three leads evoking both sympathy and derision at different points. That the viewer can empathise with a staunch fundamentalist such as Ivanna is testament both to Finneran's nuanced performance and Kokotajlo's compassionate screenplay. The story obviously comes from a place of respect; this is not an arbitrary and/or sarcastic hit-job written by someone who is bitter about their time in the religion, but is instead a presentation of how Witness dogma can affect the people on the ground. Dogmatic proclamations from on-high are all very well and good, but what happens when they clash with the everyday? This is essentially what the film is about, and Kokotajlo handles it brilliantly.\r\n\r\nFrom a directorial point of view, he keeps things simple and functional. The lack of budget works for the narrative, as Kokotajlo shuns any kind of directorial gymnastics in lieu of a pseudo-documentarian approach to the material, with the influence of people such as Anthony Asquith, Terrence Rattigan, and Ken Loach unmistakable. In this sense, Oldham comes across as a very real and lived-in neighbourhood, as opposed to an abstract society which feels like it doesn't exist beyond the parameters of the text.\r\n\r\nAll things considered, this is strong filmmaking; in equal measure emotive without being apologist, and informative without being condemnatory – not an easy balance to pull off by any means.", "created_at": "2019-05-14T01:58:15.730Z"}, {"movie_id": 473309, "review_id": "60a558618072980029b48f60", "author_rating": 7.0, "review_text": "This movie is a slow burner, more thoughtful and moody than dramatic and explosive. I wouldn’t advise watching it on two hours’ sleep or while on an adrenaline high (unless you want to calm down).\r\n\r\nI have always liked Siobhan Finneran, and she doesn’t disappoint here. SHe gives a muted performance, no doubt as written and directed. After all, she plays a woman who is oppressed by the cult she belongs to. Even when she questions her role it seems like she is almost doubting her faith more than she is the beliefs their version of iron age religion dictates. The actresses playing her two daughters also do a great job. One of them embraces the Jehovah’s Witness brand of dogma while the other questions it, all without letting the difference come between them unless forced.\r\n\r\nWhen you get past them to the rest of the cast, the acting doesn’t stand out, but since they are marching to Jehovah’s tune, perhaps  they are meant not to stand out. The guy who is interested in marrying the younger sisters seems to phone his lines in, but again, perhaps as directed to do so. The film missed a chance for a tense, dramatic scene when tragedy strikes, opting instead to have someone afterwards say that she couldn’t believe her sister did that, rather than showing it. It is a sacrifice the script makes more than once to maintain the torpid, somber tone.", "created_at": "2021-05-19T18:26:41.639Z"}, {"movie_id": 473309, "review_id": "5cda20b70e0a26045ccd1d5d", "author_rating": 7.0, "review_text": "**_Powerful film-making_**\r\n\r\n> _It is not wrong to be loyal to the righteous and just God of the Bible. He tells us that he will accept \"in his holy mountain\" only those who walk faultlessly, practice righteousness and speak truth (Ps. 15). If, though, a Christian were to throw in his lot with a wrongdoer who has been rejected by God and disfellowshipped, or has disassociated himself, that would be as much as saying \"I do not want a place in God's holy mountain either.\" If the elders saw him heading in that direction by regularly keeping company with a disfellowshiped person, they would lovin__gly and patiently try to help him to regain God's view (Matt. 18:18; Gal.6:1). They would admonish him and, if necessary, \"reprove him with severity.\" They want to help him remain \"in God's holy mountain.\" But if he will not cease to fellowship with the expelled person, he thus has made himself \"a sharer (supporting or participating) in the wicked works\" and must be removed from the congregation, expelled.​_\r\n\r\n- \"Disfellowshiping: How to View It\"; _The Watchtower Announcing Jehovah's Kingdom_ (September 15, 1981)\r\n\r\n_Apostasy_ is the low-budget feature debut of writer/director Daniel Kokotajlo and, as the name implies, it tells the story of a breakdown in the relationship between a member of the faithful and the organised religion to which they adhere, which, in this case, is the Christian denomination movement known as Jehovah's Witnesses. However, whilst the film tells the story of one person abandoning their religion, it also tells the parallel story of two people who refuse to do so, committing themselves more and more to its practices, even as they come to question some of its dogma.\r\n\r\nIvanna (Siobhan Finneran) is a mother to two girls, Luisa (Sacha Parkinson) and her younger sister Alex (Molly Wright). Living in a working-class area in Oldham, Greater Manchester, all three are Witnesses, with Alex in particular embracing the role of a publisher (the name for Witnesses active in proselytising), even going so far as to learn Urdu so she can better preach to people in the neighbourhood. The film begins with Alex attending her doctor (Poppy Jhakra), who is explaining that her condition means she may need a blood transfusion in the future. Giving her a document to sign agreeing to allow such a procedure, the doctor promises to keep it a secret from Ivanna. Alex, however, has no interest in signing. Born anaemic, she received a blood transfusion when only a few hours old, against the wishes of Ivanna, and because of this, she is burdened with a sense of guilt, believing she must atone by adhering rigidly to Witness doctrine, helping at the local Kingdom Hall (the term used by Witnesses for their places of worship), and preaching door-to-door. Meanwhile, Luisa returns home from college, and tells Ivanna that she's pregnant, and even worse, the father is not a Witness. Ivanna is disgusted, demanding that Luisa marry the father. When she refuses, she is \"disfellowshipped\". However, as one of the requirements of disfellowship is that family members who remain Witnesses cannot have any significant contact, Ivanna forces Luisa to leave home. At the same time, Steven (Robert Emms) arrives in the neighbourhood as a new elder. He becomes friends with Ivanna and Alex, and after a few weeks, proposes to Alex.\r\n\r\nThis plot summary takes us up to about a half-hour in the film, which is loosely divided into three discernible acts – the first focuses on Alex, the second Luisa, and the third Ivanna. At the end of the first act, the plot takes a turn, which I have to admit, I didn't see coming, and which changes everything for the family and how they conduct themselves and observe their religious beliefs.\r\n\r\nTo fully engage with the film at a critical level, one must first contextualise its _milieu_. Kokotajlo is himself an apostate, as he was raised a Witness, but left in his 20s. However, what does being an apostate mean in a practical sense? Why is it such a big deal? _The Watchtower Announcing Jehovah's Kingdom_, one of two official Witness magazines (and which features prominently in the film), defines an apostate as a person who has abandoned the worship of Jehovah, and aligned themselves with Satan, and/or a person who has rejected the church's teachings, doctrines, dogma, biblical interpretations, and religious holidays. Along these lines, The Watchtower calls apostates \"anti-Jehovah\", explaining that when the End Time comes, they will not be permitted to enter the Millennial Kingdom. Important here is that anyone espousing a doctrine which deviates from official policy is also seen as an apostate, and is disfellowshiped, even if they still consider themselves a Witness (more on this issue later). According to _The Watchtower_, apostates are motivated by bitterness, and exhibit traits of \"_prideful intelligence, lack of love, and dishonesty_,\" with their goal being to \"_to tear down Jehovah's people and to distort the Truth_.\" Reasons one may become an apostate include presumptuousness, ungratefulness, misguided independence, jealousy, and mental disease. Such people are prone to drunkenness, have loose morals, and fornicate with multiple partners. Witnesses regard apostates as much worse (in a moral sense) than they regard non-Witnesses, and if a Witness even speaks to an apostate, the church considers that person \"_a sharer in [the apostate's] wicked works._\"\r\n\r\nFrom a contextualisation standpoint, it's also beneficial to give a brief overview of the development of the religion, particularly its eschatological dogma, as this is central to Witnesses' core beliefs, and an important theme in the film. Witnesses' origins can be traced to 1870, when Charles Taze Russell formed the Bible Student movement. Millenarian in design, the movement was greatly influenced by Millerism and Adventism, and employed hermeneutics to reject foundational Christian doctrine, including trinitarianism, the existence of hell, and the immortality of the soul. In _Three Worlds, and the Harvest of this World_ (1876), Russell and Nelson H. Barbour developed a dispensationalist eschatology, arguing that Christ had been on earth since 1874, and in 1878, the current dispensation will end, and human society will be replaced by the Millennial Kingdom, in which only the chosen few will be allowed to live. In 1879, Russell began publishing _Zion's Watch Tower and the Herald of Christ's Presence_ so as to communicate to people that the End Time was imminent. In 1881, he posited that this was the year of the Rapture. By this stage, there were enough people following Russell to warrant the formation of a governing body, Zion's Watch Tower Tract Society.\r\n\r\nIn 1884, the Society was formally recognised as a religion, and Russell now posited 1914 as the end of human society, a claim he felt was corroborated by the outbreak of the Great War. He died in 1916, still of the belief that human society would soon collapse, but the date was now 1918. Russell was succeeded by Joseph Franklin Rutherford, who offered a different interpretation of the scripture; the End Time didn't began in 1914, instead, it would begin during the lifetime of the generation alive in 1914. In 1920, he asserted that the Millennial Kingdom would come into being in 1925. The term \"Jehovah's witnesses\" was adopted as the religion's name in 1931, taken from Isaiah 43:10. Rutherford died in 1942, succeeded by Nathan Homer Knorr, who commissioned a new translation of the bible to be used by all Witnesses (_The New World Translation of the Holy Scriptures_). In 1966, the date of the End Time was changed to 1975, and was subsequently changed again in 1984, 1995, and 2010.\r\n\r\nThe current belief is that Satan was cast down to earth sometime after October 1, 1914, and he rules over humanity by controlling governments. Since 1932, Witnesses have believed that 144,000 people will be resurrected during the End Time, and transferred to heaven to rule at Christ's side, whilst the rest of the faithful will remain on earth, living in the Millennial Kingdom, a theory based upon a literal interpretation of Revelation 14:1-5.\r\n\r\nAccording to official publications, there are now over eight million Witnesses worldwide. The refusal of blood transfusions (another important theme in the film) was introduced in the Netherlands in 1945, based primarily on Genesis 9:4 (\"_Only flesh with its life - its blood - you must not eat_\") and Leviticus 17:10 (\"_If any man of the house of Israel or any foreigner who is residing in your midst eats any sort of blood, I will certainly set my face against the one who is eating the blood, and I will cut him off from among his people_\"). In 1961, having a transfusion became grounds for disfellowship, at which time Dr. Américo Valério claimed transfusions lead to \"_moral insanity [and] sexual perversion_,\" whilst Dr. Alonzo Jay Shadman argued, \"_the poisons that produce the impulse to commit suicide, murder, or steal are in the blood._\" It is estimated that in the period 1961-2016, over 33,000 Witnesses died rather than accept blood. In 2016 alone, there were over 1,200 deaths.\r\n\r\nWith all of that in mind, one of the most impressive aspects of the film is how implicitly Kokotajlo introduces many of these themes, trusting in the audience's intelligence to do the legwork, whilst not even providing us with music cues to tell us what we should be thinking at any given moment. For example, like most religions, Witnesses considers itself the only true religion, and only its adherents will be saved. This is brought to the fore when Alex encounters people who don't subscribe to her beliefs; meeting two of Luisa's college friends, she is bemused that they don't agree with Witness teachings, and even more incredulous when she finds out that not only are they not Witnesses, they are areligious altogether. It's a scene which deftly demonstrates the isolationist nature of Witnesses without telegraphing it.\r\n\r\nTied closely to this is the theme of having independent thoughts, which, again, is introduced very subtly. After Luisa is disfellowshiped, she makes an effort to return to the fold, but Steven expresses doubts as to whether she will succeed, as she \"has too many of her own ideas,\" something frowned upon by Witnesses. That Kokotajlo views this as a central theme in the film is evidenced in multiple interviews he has given. Speaking to _The Irish Times_, he says,\r\n\r\n> _one of the biggest things that happened to me was going to college. Suddenly, people were asking for my opinion on things. That was a new concept for me as a Witness. At the Kingdom Hall, if you were asked questions, it was an opportunity to say what was already there in the Watchtower._\r\n\r\nSimilarly, speaking to _The Guardian_, he states,\r\n\r\n> _I went to college, and that was the key, really. People would ask my opinion on something, and I would be scrambling round trying to find an answer in a text somewhere – because that's what life as a Witness is like. It's group thinking based on the interpretation of a text._\r\n\r\nLikewise, speaking to _Screen International_, he explains,\r\n\r\n> _I was harbouring doubts since I went to college. I realised that people at college were interested in your opinion. That was a new concept to me because being a Witness it was always about reaffirming the text, group-think, it wasn't about encouraging independent thought._\r\n\r\nAnother important theme is even more implicit – likening Witnesses to Scientology. This is never overtly addressed, but Kokotajlo's presentation of how Witnesses deal with certain issues unquestionably draws parallels with how Scientologists deal with those same issues. This is perhaps most obvious in how the film depicts disfellowship, emphasising that the family of someone who has been disfellowed must cut off contact with them. This is virtually identical to the notion of \"suppressive persons\" in Scientology, and in his _Irish Times_ interview, Kokotajlo states,\r\n\r\n> _that's representative of what a lot of Witnesses have to go through. Family members are forced to shun other family members._\r\n\r\nLooking at the film in a more aesthetic sense, an interesting stylistic device is how Kokotajlo presents characters talking to Jehovah. Although they speak aloud, the people around them don't hear what they're saying (think of a soliloquy on a crowded stage in Shakespeare). This essentially positions the viewer as Jehovah – just like Him, we are in a position to hear what others cannot. Indeed, on a couple of occasions, this positioning of the viewer is foregrounded even more, as characters speak direct-to-camera. It's a daring move, but one which is extremely well handled, unifying form and content.\r\n\r\nThe film is undeniably bleak, but never melodramatic, in its depiction of the conflicts that can arise when a family dynamic is in diametrical opposition to Witness doctrine. However, a vital point is that whilst the film is highly critical of the closed-off nature of the religion, the rules and regulations, and the unfulfilled prophecies, it depicts very humanised characters. In relation to this, Kokotajlo told _The Irish Times_,\r\n\r\n> _one of the aims of the film was to treat the Witnesses with a lot of respect […] I have a lot of compassion for the people within the religion. It's the rules that the organisation creates that I have an issue with. Not the people trying to navigate those rules._\r\n\r\nAlong the same lines, the acting is exemplary, which each of the three leads evoking both sympathy and derision at different points. That the viewer can empathise with a staunch fundamentalist such as Ivanna is testament both to Finneran's nuanced performance and Kokotajlo's compassionate screenplay. The story obviously comes from a place of respect; this is not an arbitrary and/or sarcastic hit-job written by someone who is bitter about their time in the religion, but is instead a presentation of how Witness dogma can affect the people on the ground. Dogmatic proclamations from on-high are all very well and good, but what happens when they clash with the everyday? This is essentially what the film is about, and Kokotajlo handles it brilliantly.\r\n\r\nFrom a directorial point of view, he keeps things simple and functional. The lack of budget works for the narrative, as Kokotajlo shuns any kind of directorial gymnastics in lieu of a pseudo-documentarian approach to the material, with the influence of people such as Anthony Asquith, Terrence Rattigan, and Ken Loach unmistakable. In this sense, Oldham comes across as a very real and lived-in neighbourhood, as opposed to an abstract society which feels like it doesn't exist beyond the parameters of the text.\r\n\r\nAll things considered, this is strong filmmaking; in equal measure emotive without being apologist, and informative without being condemnatory – not an easy balance to pull off by any means.", "created_at": "2019-05-14T01:58:15.730Z"}, {"movie_id": 473309, "review_id": "60a558618072980029b48f60", "author_rating": 7.0, "review_text": "This movie is a slow burner, more thoughtful and moody than dramatic and explosive. I wouldn’t advise watching it on two hours’ sleep or while on an adrenaline high (unless you want to calm down).\r\n\r\nI have always liked Siobhan Finneran, and she doesn’t disappoint here. SHe gives a muted performance, no doubt as written and directed. After all, she plays a woman who is oppressed by the cult she belongs to. Even when she questions her role it seems like she is almost doubting her faith more than she is the beliefs their version of iron age religion dictates. The actresses playing her two daughters also do a great job. One of them embraces the Jehovah’s Witness brand of dogma while the other questions it, all without letting the difference come between them unless forced.\r\n\r\nWhen you get past them to the rest of the cast, the acting doesn’t stand out, but since they are marching to Jehovah’s tune, perhaps  they are meant not to stand out. The guy who is interested in marrying the younger sisters seems to phone his lines in, but again, perhaps as directed to do so. The film missed a chance for a tense, dramatic scene when tragedy strikes, opting instead to have someone afterwards say that she couldn’t believe her sister did that, rather than showing it. It is a sacrifice the script makes more than once to maintain the torpid, somber tone.", "created_at": "2021-05-19T18:26:41.639Z"}, {"movie_id": 473309, "review_id": "5cda20b70e0a26045ccd1d5d", "author_rating": 7.0, "review_text": "**_Powerful film-making_**\r\n\r\n> _It is not wrong to be loyal to the righteous and just God of the Bible. He tells us that he will accept \"in his holy mountain\" only those who walk faultlessly, practice righteousness and speak truth (Ps. 15). If, though, a Christian were to throw in his lot with a wrongdoer who has been rejected by God and disfellowshipped, or has disassociated himself, that would be as much as saying \"I do not want a place in God's holy mountain either.\" If the elders saw him heading in that direction by regularly keeping company with a disfellowshiped person, they would lovin__gly and patiently try to help him to regain God's view (Matt. 18:18; Gal.6:1). They would admonish him and, if necessary, \"reprove him with severity.\" They want to help him remain \"in God's holy mountain.\" But if he will not cease to fellowship with the expelled person, he thus has made himself \"a sharer (supporting or participating) in the wicked works\" and must be removed from the congregation, expelled.​_\r\n\r\n- \"Disfellowshiping: How to View It\"; _The Watchtower Announcing Jehovah's Kingdom_ (September 15, 1981)\r\n\r\n_Apostasy_ is the low-budget feature debut of writer/director Daniel Kokotajlo and, as the name implies, it tells the story of a breakdown in the relationship between a member of the faithful and the organised religion to which they adhere, which, in this case, is the Christian denomination movement known as Jehovah's Witnesses. However, whilst the film tells the story of one person abandoning their religion, it also tells the parallel story of two people who refuse to do so, committing themselves more and more to its practices, even as they come to question some of its dogma.\r\n\r\nIvanna (Siobhan Finneran) is a mother to two girls, Luisa (Sacha Parkinson) and her younger sister Alex (Molly Wright). Living in a working-class area in Oldham, Greater Manchester, all three are Witnesses, with Alex in particular embracing the role of a publisher (the name for Witnesses active in proselytising), even going so far as to learn Urdu so she can better preach to people in the neighbourhood. The film begins with Alex attending her doctor (Poppy Jhakra), who is explaining that her condition means she may need a blood transfusion in the future. Giving her a document to sign agreeing to allow such a procedure, the doctor promises to keep it a secret from Ivanna. Alex, however, has no interest in signing. Born anaemic, she received a blood transfusion when only a few hours old, against the wishes of Ivanna, and because of this, she is burdened with a sense of guilt, believing she must atone by adhering rigidly to Witness doctrine, helping at the local Kingdom Hall (the term used by Witnesses for their places of worship), and preaching door-to-door. Meanwhile, Luisa returns home from college, and tells Ivanna that she's pregnant, and even worse, the father is not a Witness. Ivanna is disgusted, demanding that Luisa marry the father. When she refuses, she is \"disfellowshipped\". However, as one of the requirements of disfellowship is that family members who remain Witnesses cannot have any significant contact, Ivanna forces Luisa to leave home. At the same time, Steven (Robert Emms) arrives in the neighbourhood as a new elder. He becomes friends with Ivanna and Alex, and after a few weeks, proposes to Alex.\r\n\r\nThis plot summary takes us up to about a half-hour in the film, which is loosely divided into three discernible acts – the first focuses on Alex, the second Luisa, and the third Ivanna. At the end of the first act, the plot takes a turn, which I have to admit, I didn't see coming, and which changes everything for the family and how they conduct themselves and observe their religious beliefs.\r\n\r\nTo fully engage with the film at a critical level, one must first contextualise its _milieu_. Kokotajlo is himself an apostate, as he was raised a Witness, but left in his 20s. However, what does being an apostate mean in a practical sense? Why is it such a big deal? _The Watchtower Announcing Jehovah's Kingdom_, one of two official Witness magazines (and which features prominently in the film), defines an apostate as a person who has abandoned the worship of Jehovah, and aligned themselves with Satan, and/or a person who has rejected the church's teachings, doctrines, dogma, biblical interpretations, and religious holidays. Along these lines, The Watchtower calls apostates \"anti-Jehovah\", explaining that when the End Time comes, they will not be permitted to enter the Millennial Kingdom. Important here is that anyone espousing a doctrine which deviates from official policy is also seen as an apostate, and is disfellowshiped, even if they still consider themselves a Witness (more on this issue later). According to _The Watchtower_, apostates are motivated by bitterness, and exhibit traits of \"_prideful intelligence, lack of love, and dishonesty_,\" with their goal being to \"_to tear down Jehovah's people and to distort the Truth_.\" Reasons one may become an apostate include presumptuousness, ungratefulness, misguided independence, jealousy, and mental disease. Such people are prone to drunkenness, have loose morals, and fornicate with multiple partners. Witnesses regard apostates as much worse (in a moral sense) than they regard non-Witnesses, and if a Witness even speaks to an apostate, the church considers that person \"_a sharer in [the apostate's] wicked works._\"\r\n\r\nFrom a contextualisation standpoint, it's also beneficial to give a brief overview of the development of the religion, particularly its eschatological dogma, as this is central to Witnesses' core beliefs, and an important theme in the film. Witnesses' origins can be traced to 1870, when Charles Taze Russell formed the Bible Student movement. Millenarian in design, the movement was greatly influenced by Millerism and Adventism, and employed hermeneutics to reject foundational Christian doctrine, including trinitarianism, the existence of hell, and the immortality of the soul. In _Three Worlds, and the Harvest of this World_ (1876), Russell and Nelson H. Barbour developed a dispensationalist eschatology, arguing that Christ had been on earth since 1874, and in 1878, the current dispensation will end, and human society will be replaced by the Millennial Kingdom, in which only the chosen few will be allowed to live. In 1879, Russell began publishing _Zion's Watch Tower and the Herald of Christ's Presence_ so as to communicate to people that the End Time was imminent. In 1881, he posited that this was the year of the Rapture. By this stage, there were enough people following Russell to warrant the formation of a governing body, Zion's Watch Tower Tract Society.\r\n\r\nIn 1884, the Society was formally recognised as a religion, and Russell now posited 1914 as the end of human society, a claim he felt was corroborated by the outbreak of the Great War. He died in 1916, still of the belief that human society would soon collapse, but the date was now 1918. Russell was succeeded by Joseph Franklin Rutherford, who offered a different interpretation of the scripture; the End Time didn't began in 1914, instead, it would begin during the lifetime of the generation alive in 1914. In 1920, he asserted that the Millennial Kingdom would come into being in 1925. The term \"Jehovah's witnesses\" was adopted as the religion's name in 1931, taken from Isaiah 43:10. Rutherford died in 1942, succeeded by Nathan Homer Knorr, who commissioned a new translation of the bible to be used by all Witnesses (_The New World Translation of the Holy Scriptures_). In 1966, the date of the End Time was changed to 1975, and was subsequently changed again in 1984, 1995, and 2010.\r\n\r\nThe current belief is that Satan was cast down to earth sometime after October 1, 1914, and he rules over humanity by controlling governments. Since 1932, Witnesses have believed that 144,000 people will be resurrected during the End Time, and transferred to heaven to rule at Christ's side, whilst the rest of the faithful will remain on earth, living in the Millennial Kingdom, a theory based upon a literal interpretation of Revelation 14:1-5.\r\n\r\nAccording to official publications, there are now over eight million Witnesses worldwide. The refusal of blood transfusions (another important theme in the film) was introduced in the Netherlands in 1945, based primarily on Genesis 9:4 (\"_Only flesh with its life - its blood - you must not eat_\") and Leviticus 17:10 (\"_If any man of the house of Israel or any foreigner who is residing in your midst eats any sort of blood, I will certainly set my face against the one who is eating the blood, and I will cut him off from among his people_\"). In 1961, having a transfusion became grounds for disfellowship, at which time Dr. Américo Valério claimed transfusions lead to \"_moral insanity [and] sexual perversion_,\" whilst Dr. Alonzo Jay Shadman argued, \"_the poisons that produce the impulse to commit suicide, murder, or steal are in the blood._\" It is estimated that in the period 1961-2016, over 33,000 Witnesses died rather than accept blood. In 2016 alone, there were over 1,200 deaths.\r\n\r\nWith all of that in mind, one of the most impressive aspects of the film is how implicitly Kokotajlo introduces many of these themes, trusting in the audience's intelligence to do the legwork, whilst not even providing us with music cues to tell us what we should be thinking at any given moment. For example, like most religions, Witnesses considers itself the only true religion, and only its adherents will be saved. This is brought to the fore when Alex encounters people who don't subscribe to her beliefs; meeting two of Luisa's college friends, she is bemused that they don't agree with Witness teachings, and even more incredulous when she finds out that not only are they not Witnesses, they are areligious altogether. It's a scene which deftly demonstrates the isolationist nature of Witnesses without telegraphing it.\r\n\r\nTied closely to this is the theme of having independent thoughts, which, again, is introduced very subtly. After Luisa is disfellowshiped, she makes an effort to return to the fold, but Steven expresses doubts as to whether she will succeed, as she \"has too many of her own ideas,\" something frowned upon by Witnesses. That Kokotajlo views this as a central theme in the film is evidenced in multiple interviews he has given. Speaking to _The Irish Times_, he says,\r\n\r\n> _one of the biggest things that happened to me was going to college. Suddenly, people were asking for my opinion on things. That was a new concept for me as a Witness. At the Kingdom Hall, if you were asked questions, it was an opportunity to say what was already there in the Watchtower._\r\n\r\nSimilarly, speaking to _The Guardian_, he states,\r\n\r\n> _I went to college, and that was the key, really. People would ask my opinion on something, and I would be scrambling round trying to find an answer in a text somewhere – because that's what life as a Witness is like. It's group thinking based on the interpretation of a text._\r\n\r\nLikewise, speaking to _Screen International_, he explains,\r\n\r\n> _I was harbouring doubts since I went to college. I realised that people at college were interested in your opinion. That was a new concept to me because being a Witness it was always about reaffirming the text, group-think, it wasn't about encouraging independent thought._\r\n\r\nAnother important theme is even more implicit – likening Witnesses to Scientology. This is never overtly addressed, but Kokotajlo's presentation of how Witnesses deal with certain issues unquestionably draws parallels with how Scientologists deal with those same issues. This is perhaps most obvious in how the film depicts disfellowship, emphasising that the family of someone who has been disfellowed must cut off contact with them. This is virtually identical to the notion of \"suppressive persons\" in Scientology, and in his _Irish Times_ interview, Kokotajlo states,\r\n\r\n> _that's representative of what a lot of Witnesses have to go through. Family members are forced to shun other family members._\r\n\r\nLooking at the film in a more aesthetic sense, an interesting stylistic device is how Kokotajlo presents characters talking to Jehovah. Although they speak aloud, the people around them don't hear what they're saying (think of a soliloquy on a crowded stage in Shakespeare). This essentially positions the viewer as Jehovah – just like Him, we are in a position to hear what others cannot. Indeed, on a couple of occasions, this positioning of the viewer is foregrounded even more, as characters speak direct-to-camera. It's a daring move, but one which is extremely well handled, unifying form and content.\r\n\r\nThe film is undeniably bleak, but never melodramatic, in its depiction of the conflicts that can arise when a family dynamic is in diametrical opposition to Witness doctrine. However, a vital point is that whilst the film is highly critical of the closed-off nature of the religion, the rules and regulations, and the unfulfilled prophecies, it depicts very humanised characters. In relation to this, Kokotajlo told _The Irish Times_,\r\n\r\n> _one of the aims of the film was to treat the Witnesses with a lot of respect […] I have a lot of compassion for the people within the religion. It's the rules that the organisation creates that I have an issue with. Not the people trying to navigate those rules._\r\n\r\nAlong the same lines, the acting is exemplary, which each of the three leads evoking both sympathy and derision at different points. That the viewer can empathise with a staunch fundamentalist such as Ivanna is testament both to Finneran's nuanced performance and Kokotajlo's compassionate screenplay. The story obviously comes from a place of respect; this is not an arbitrary and/or sarcastic hit-job written by someone who is bitter about their time in the religion, but is instead a presentation of how Witness dogma can affect the people on the ground. Dogmatic proclamations from on-high are all very well and good, but what happens when they clash with the everyday? This is essentially what the film is about, and Kokotajlo handles it brilliantly.\r\n\r\nFrom a directorial point of view, he keeps things simple and functional. The lack of budget works for the narrative, as Kokotajlo shuns any kind of directorial gymnastics in lieu of a pseudo-documentarian approach to the material, with the influence of people such as Anthony Asquith, Terrence Rattigan, and Ken Loach unmistakable. In this sense, Oldham comes across as a very real and lived-in neighbourhood, as opposed to an abstract society which feels like it doesn't exist beyond the parameters of the text.\r\n\r\nAll things considered, this is strong filmmaking; in equal measure emotive without being apologist, and informative without being condemnatory – not an easy balance to pull off by any means.", "created_at": "2019-05-14T01:58:15.730Z"}, {"movie_id": 473309, "review_id": "60a558618072980029b48f60", "author_rating": 7.0, "review_text": "This movie is a slow burner, more thoughtful and moody than dramatic and explosive. I wouldn’t advise watching it on two hours’ sleep or while on an adrenaline high (unless you want to calm down).\r\n\r\nI have always liked Siobhan Finneran, and she doesn’t disappoint here. SHe gives a muted performance, no doubt as written and directed. After all, she plays a woman who is oppressed by the cult she belongs to. Even when she questions her role it seems like she is almost doubting her faith more than she is the beliefs their version of iron age religion dictates. The actresses playing her two daughters also do a great job. One of them embraces the Jehovah’s Witness brand of dogma while the other questions it, all without letting the difference come between them unless forced.\r\n\r\nWhen you get past them to the rest of the cast, the acting doesn’t stand out, but since they are marching to Jehovah’s tune, perhaps  they are meant not to stand out. The guy who is interested in marrying the younger sisters seems to phone his lines in, but again, perhaps as directed to do so. The film missed a chance for a tense, dramatic scene when tragedy strikes, opting instead to have someone afterwards say that she couldn’t believe her sister did that, rather than showing it. It is a sacrifice the script makes more than once to maintain the torpid, somber tone.", "created_at": "2021-05-19T18:26:41.639Z"}, {"movie_id": 473309, "review_id": "5cda20b70e0a26045ccd1d5d", "author_rating": 7.0, "review_text": "**_Powerful film-making_**\r\n\r\n> _It is not wrong to be loyal to the righteous and just God of the Bible. He tells us that he will accept \"in his holy mountain\" only those who walk faultlessly, practice righteousness and speak truth (Ps. 15). If, though, a Christian were to throw in his lot with a wrongdoer who has been rejected by God and disfellowshipped, or has disassociated himself, that would be as much as saying \"I do not want a place in God's holy mountain either.\" If the elders saw him heading in that direction by regularly keeping company with a disfellowshiped person, they would lovin__gly and patiently try to help him to regain God's view (Matt. 18:18; Gal.6:1). They would admonish him and, if necessary, \"reprove him with severity.\" They want to help him remain \"in God's holy mountain.\" But if he will not cease to fellowship with the expelled person, he thus has made himself \"a sharer (supporting or participating) in the wicked works\" and must be removed from the congregation, expelled.​_\r\n\r\n- \"Disfellowshiping: How to View It\"; _The Watchtower Announcing Jehovah's Kingdom_ (September 15, 1981)\r\n\r\n_Apostasy_ is the low-budget feature debut of writer/director Daniel Kokotajlo and, as the name implies, it tells the story of a breakdown in the relationship between a member of the faithful and the organised religion to which they adhere, which, in this case, is the Christian denomination movement known as Jehovah's Witnesses. However, whilst the film tells the story of one person abandoning their religion, it also tells the parallel story of two people who refuse to do so, committing themselves more and more to its practices, even as they come to question some of its dogma.\r\n\r\nIvanna (Siobhan Finneran) is a mother to two girls, Luisa (Sacha Parkinson) and her younger sister Alex (Molly Wright). Living in a working-class area in Oldham, Greater Manchester, all three are Witnesses, with Alex in particular embracing the role of a publisher (the name for Witnesses active in proselytising), even going so far as to learn Urdu so she can better preach to people in the neighbourhood. The film begins with Alex attending her doctor (Poppy Jhakra), who is explaining that her condition means she may need a blood transfusion in the future. Giving her a document to sign agreeing to allow such a procedure, the doctor promises to keep it a secret from Ivanna. Alex, however, has no interest in signing. Born anaemic, she received a blood transfusion when only a few hours old, against the wishes of Ivanna, and because of this, she is burdened with a sense of guilt, believing she must atone by adhering rigidly to Witness doctrine, helping at the local Kingdom Hall (the term used by Witnesses for their places of worship), and preaching door-to-door. Meanwhile, Luisa returns home from college, and tells Ivanna that she's pregnant, and even worse, the father is not a Witness. Ivanna is disgusted, demanding that Luisa marry the father. When she refuses, she is \"disfellowshipped\". However, as one of the requirements of disfellowship is that family members who remain Witnesses cannot have any significant contact, Ivanna forces Luisa to leave home. At the same time, Steven (Robert Emms) arrives in the neighbourhood as a new elder. He becomes friends with Ivanna and Alex, and after a few weeks, proposes to Alex.\r\n\r\nThis plot summary takes us up to about a half-hour in the film, which is loosely divided into three discernible acts – the first focuses on Alex, the second Luisa, and the third Ivanna. At the end of the first act, the plot takes a turn, which I have to admit, I didn't see coming, and which changes everything for the family and how they conduct themselves and observe their religious beliefs.\r\n\r\nTo fully engage with the film at a critical level, one must first contextualise its _milieu_. Kokotajlo is himself an apostate, as he was raised a Witness, but left in his 20s. However, what does being an apostate mean in a practical sense? Why is it such a big deal? _The Watchtower Announcing Jehovah's Kingdom_, one of two official Witness magazines (and which features prominently in the film), defines an apostate as a person who has abandoned the worship of Jehovah, and aligned themselves with Satan, and/or a person who has rejected the church's teachings, doctrines, dogma, biblical interpretations, and religious holidays. Along these lines, The Watchtower calls apostates \"anti-Jehovah\", explaining that when the End Time comes, they will not be permitted to enter the Millennial Kingdom. Important here is that anyone espousing a doctrine which deviates from official policy is also seen as an apostate, and is disfellowshiped, even if they still consider themselves a Witness (more on this issue later). According to _The Watchtower_, apostates are motivated by bitterness, and exhibit traits of \"_prideful intelligence, lack of love, and dishonesty_,\" with their goal being to \"_to tear down Jehovah's people and to distort the Truth_.\" Reasons one may become an apostate include presumptuousness, ungratefulness, misguided independence, jealousy, and mental disease. Such people are prone to drunkenness, have loose morals, and fornicate with multiple partners. Witnesses regard apostates as much worse (in a moral sense) than they regard non-Witnesses, and if a Witness even speaks to an apostate, the church considers that person \"_a sharer in [the apostate's] wicked works._\"\r\n\r\nFrom a contextualisation standpoint, it's also beneficial to give a brief overview of the development of the religion, particularly its eschatological dogma, as this is central to Witnesses' core beliefs, and an important theme in the film. Witnesses' origins can be traced to 1870, when Charles Taze Russell formed the Bible Student movement. Millenarian in design, the movement was greatly influenced by Millerism and Adventism, and employed hermeneutics to reject foundational Christian doctrine, including trinitarianism, the existence of hell, and the immortality of the soul. In _Three Worlds, and the Harvest of this World_ (1876), Russell and Nelson H. Barbour developed a dispensationalist eschatology, arguing that Christ had been on earth since 1874, and in 1878, the current dispensation will end, and human society will be replaced by the Millennial Kingdom, in which only the chosen few will be allowed to live. In 1879, Russell began publishing _Zion's Watch Tower and the Herald of Christ's Presence_ so as to communicate to people that the End Time was imminent. In 1881, he posited that this was the year of the Rapture. By this stage, there were enough people following Russell to warrant the formation of a governing body, Zion's Watch Tower Tract Society.\r\n\r\nIn 1884, the Society was formally recognised as a religion, and Russell now posited 1914 as the end of human society, a claim he felt was corroborated by the outbreak of the Great War. He died in 1916, still of the belief that human society would soon collapse, but the date was now 1918. Russell was succeeded by Joseph Franklin Rutherford, who offered a different interpretation of the scripture; the End Time didn't began in 1914, instead, it would begin during the lifetime of the generation alive in 1914. In 1920, he asserted that the Millennial Kingdom would come into being in 1925. The term \"Jehovah's witnesses\" was adopted as the religion's name in 1931, taken from Isaiah 43:10. Rutherford died in 1942, succeeded by Nathan Homer Knorr, who commissioned a new translation of the bible to be used by all Witnesses (_The New World Translation of the Holy Scriptures_). In 1966, the date of the End Time was changed to 1975, and was subsequently changed again in 1984, 1995, and 2010.\r\n\r\nThe current belief is that Satan was cast down to earth sometime after October 1, 1914, and he rules over humanity by controlling governments. Since 1932, Witnesses have believed that 144,000 people will be resurrected during the End Time, and transferred to heaven to rule at Christ's side, whilst the rest of the faithful will remain on earth, living in the Millennial Kingdom, a theory based upon a literal interpretation of Revelation 14:1-5.\r\n\r\nAccording to official publications, there are now over eight million Witnesses worldwide. The refusal of blood transfusions (another important theme in the film) was introduced in the Netherlands in 1945, based primarily on Genesis 9:4 (\"_Only flesh with its life - its blood - you must not eat_\") and Leviticus 17:10 (\"_If any man of the house of Israel or any foreigner who is residing in your midst eats any sort of blood, I will certainly set my face against the one who is eating the blood, and I will cut him off from among his people_\"). In 1961, having a transfusion became grounds for disfellowship, at which time Dr. Américo Valério claimed transfusions lead to \"_moral insanity [and] sexual perversion_,\" whilst Dr. Alonzo Jay Shadman argued, \"_the poisons that produce the impulse to commit suicide, murder, or steal are in the blood._\" It is estimated that in the period 1961-2016, over 33,000 Witnesses died rather than accept blood. In 2016 alone, there were over 1,200 deaths.\r\n\r\nWith all of that in mind, one of the most impressive aspects of the film is how implicitly Kokotajlo introduces many of these themes, trusting in the audience's intelligence to do the legwork, whilst not even providing us with music cues to tell us what we should be thinking at any given moment. For example, like most religions, Witnesses considers itself the only true religion, and only its adherents will be saved. This is brought to the fore when Alex encounters people who don't subscribe to her beliefs; meeting two of Luisa's college friends, she is bemused that they don't agree with Witness teachings, and even more incredulous when she finds out that not only are they not Witnesses, they are areligious altogether. It's a scene which deftly demonstrates the isolationist nature of Witnesses without telegraphing it.\r\n\r\nTied closely to this is the theme of having independent thoughts, which, again, is introduced very subtly. After Luisa is disfellowshiped, she makes an effort to return to the fold, but Steven expresses doubts as to whether she will succeed, as she \"has too many of her own ideas,\" something frowned upon by Witnesses. That Kokotajlo views this as a central theme in the film is evidenced in multiple interviews he has given. Speaking to _The Irish Times_, he says,\r\n\r\n> _one of the biggest things that happened to me was going to college. Suddenly, people were asking for my opinion on things. That was a new concept for me as a Witness. At the Kingdom Hall, if you were asked questions, it was an opportunity to say what was already there in the Watchtower._\r\n\r\nSimilarly, speaking to _The Guardian_, he states,\r\n\r\n> _I went to college, and that was the key, really. People would ask my opinion on something, and I would be scrambling round trying to find an answer in a text somewhere – because that's what life as a Witness is like. It's group thinking based on the interpretation of a text._\r\n\r\nLikewise, speaking to _Screen International_, he explains,\r\n\r\n> _I was harbouring doubts since I went to college. I realised that people at college were interested in your opinion. That was a new concept to me because being a Witness it was always about reaffirming the text, group-think, it wasn't about encouraging independent thought._\r\n\r\nAnother important theme is even more implicit – likening Witnesses to Scientology. This is never overtly addressed, but Kokotajlo's presentation of how Witnesses deal with certain issues unquestionably draws parallels with how Scientologists deal with those same issues. This is perhaps most obvious in how the film depicts disfellowship, emphasising that the family of someone who has been disfellowed must cut off contact with them. This is virtually identical to the notion of \"suppressive persons\" in Scientology, and in his _Irish Times_ interview, Kokotajlo states,\r\n\r\n> _that's representative of what a lot of Witnesses have to go through. Family members are forced to shun other family members._\r\n\r\nLooking at the film in a more aesthetic sense, an interesting stylistic device is how Kokotajlo presents characters talking to Jehovah. Although they speak aloud, the people around them don't hear what they're saying (think of a soliloquy on a crowded stage in Shakespeare). This essentially positions the viewer as Jehovah – just like Him, we are in a position to hear what others cannot. Indeed, on a couple of occasions, this positioning of the viewer is foregrounded even more, as characters speak direct-to-camera. It's a daring move, but one which is extremely well handled, unifying form and content.\r\n\r\nThe film is undeniably bleak, but never melodramatic, in its depiction of the conflicts that can arise when a family dynamic is in diametrical opposition to Witness doctrine. However, a vital point is that whilst the film is highly critical of the closed-off nature of the religion, the rules and regulations, and the unfulfilled prophecies, it depicts very humanised characters. In relation to this, Kokotajlo told _The Irish Times_,\r\n\r\n> _one of the aims of the film was to treat the Witnesses with a lot of respect […] I have a lot of compassion for the people within the religion. It's the rules that the organisation creates that I have an issue with. Not the people trying to navigate those rules._\r\n\r\nAlong the same lines, the acting is exemplary, which each of the three leads evoking both sympathy and derision at different points. That the viewer can empathise with a staunch fundamentalist such as Ivanna is testament both to Finneran's nuanced performance and Kokotajlo's compassionate screenplay. The story obviously comes from a place of respect; this is not an arbitrary and/or sarcastic hit-job written by someone who is bitter about their time in the religion, but is instead a presentation of how Witness dogma can affect the people on the ground. Dogmatic proclamations from on-high are all very well and good, but what happens when they clash with the everyday? This is essentially what the film is about, and Kokotajlo handles it brilliantly.\r\n\r\nFrom a directorial point of view, he keeps things simple and functional. The lack of budget works for the narrative, as Kokotajlo shuns any kind of directorial gymnastics in lieu of a pseudo-documentarian approach to the material, with the influence of people such as Anthony Asquith, Terrence Rattigan, and Ken Loach unmistakable. In this sense, Oldham comes across as a very real and lived-in neighbourhood, as opposed to an abstract society which feels like it doesn't exist beyond the parameters of the text.\r\n\r\nAll things considered, this is strong filmmaking; in equal measure emotive without being apologist, and informative without being condemnatory – not an easy balance to pull off by any means.", "created_at": "2019-05-14T01:58:15.730Z"}, {"movie_id": 473309, "review_id": "60a558618072980029b48f60", "author_rating": 7.0, "review_text": "This movie is a slow burner, more thoughtful and moody than dramatic and explosive. I wouldn’t advise watching it on two hours’ sleep or while on an adrenaline high (unless you want to calm down).\r\n\r\nI have always liked Siobhan Finneran, and she doesn’t disappoint here. SHe gives a muted performance, no doubt as written and directed. After all, she plays a woman who is oppressed by the cult she belongs to. Even when she questions her role it seems like she is almost doubting her faith more than she is the beliefs their version of iron age religion dictates. The actresses playing her two daughters also do a great job. One of them embraces the Jehovah’s Witness brand of dogma while the other questions it, all without letting the difference come between them unless forced.\r\n\r\nWhen you get past them to the rest of the cast, the acting doesn’t stand out, but since they are marching to Jehovah’s tune, perhaps  they are meant not to stand out. The guy who is interested in marrying the younger sisters seems to phone his lines in, but again, perhaps as directed to do so. The film missed a chance for a tense, dramatic scene when tragedy strikes, opting instead to have someone afterwards say that she couldn’t believe her sister did that, rather than showing it. It is a sacrifice the script makes more than once to maintain the torpid, somber tone.", "created_at": "2021-05-19T18:26:41.639Z"}]