[{"movie_id": 11459, "review_id": "5f67bdbf945c200035e8bc11", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend.\r\n\r\nThis is one of the best superhero movies outside of DC and Marvel movies.  Not only does it use the silly costumes that I like from comics, but it incorporates it as part of normal life: the world is clearly built to show that Supers are somewhat normal to see, and that there is a community of them.  It's basically Professor X's school if people treated Mutants like the Avengers.\r\n\r\nThe immediate problems are in the the casting: there are SO MANY great people, almost everyone is funny and takes to their roles perfectly, but the lead, the focus of the story, is forgettable, and it is completely unbelievable that he would have these girls after him, let alone someone who we're happy to have powers.  And I hate Kurt Russell, but the movie is so good I forget he's in it until he suddenly appears and smarms it up.\r\n\r\nA \"coming of age\" story, with \"high school politics\", and \"girl next door\" tropes all mixed together is a good recipe, and with super powers to keep it interesting.  I think that's the thing that makes this movie stand out.  Using the super powers, the movie is all about SHOW, don't tell.  A lot of movie forget this, overusing narration and dialogue out of place.\r\n\r\nThe content of the movie is all about meaningful dialogue, showing the world, and how it works.  It is also about being fun, they pay special detail to the scenes to keep it light and add something extra to the scenes.  Another thing that comedy movies forget is that a joke should compliment the movie, not stop it: there are so many little bits sewn into the movie that happen to the side (Larry being a 2-ton rock at a party), or as part of the world building (a hero support montage of utility belts).\r\n\r\nThe oddest parts of the movie deal with teens dating and their parents, it's perfectly apt, but you can feel the awkwardness of the situation.\r\n\r\nIf you've ever liked any super hero anything, then give this a go, you'll probably like it.", "created_at": "2020-09-20T20:38:23.144Z"}, {"movie_id": 11459, "review_id": "5fa168aa2cff1800396fc75b", "author_rating": 7.0, "review_text": "A decent superhero comedy from Disney.\r\n\r\n<em>'Sky High'</em> sets up a little iffy, with a few cringey moments early, but goes on to produce a suitably entertaining film. Kurt Russell gives the only performance that I'll likely remember, but all the cast do their part - they are well cast, with none of them leaving anything to be desired to be honest.\r\n\r\nThe effects are good, while there are a couple of amusing gags thrown in. It's a simple and pretty predictable premise, but that doesn't stop it from being fun to watch. It could've, perhaps, worked better as a TV show? There are murmurs that that's what they plan to do soon, so I wouldn't be surprised if they did.\r\n\r\nWorth a watch.", "created_at": "2020-11-03T14:26:50.023Z"}]