[{"movie_id": 438799, "review_id": "5c4476b50e0a266d6bd36903", "author_rating": 7.0, "review_text": "Really, **really** happy with how this one wound up. _Overlord_ is probably this year's movie I most want to rewatch, was definitely one worth seeing on the big screen. I hope it inspires likeminded cinema in the near-future.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T13:25:09.152Z"}, {"movie_id": 438799, "review_id": "5fb12924d8f44e003df82c20", "author_rating": 6.0, "review_text": "Minor spoilers ahead. Finally caught up with this on Netflix as I had wanted to see it at the cinema. It was a fun horror/monster movie romp but it didn't bring anything new to the genre. The set up of Chloe's Aunt was a waste of time and it seemed that her story ended up on the cutting room floor, she was forgotten about until the Nazis killed her and you don't even get to see that. Fun but ultimately forgettable film with decent special effects and an ok cast.", "created_at": "2020-11-15T13:12:04.656Z"}, {"movie_id": 438799, "review_id": "630a630dd051d9007ec76fb8", "author_rating": 8.0, "review_text": "**Overlord won't let you catch your breath with its frenzied pacing and all-out action resulting in a wild supernatural action thriller.**\r\n\r\nOverlord is an insanity-fueled wild ride from the very first second. The extreme intensity of this movie begins with paratroopers diving out of exploding planes and then frantically trying to untangle their parachutes as they plummet behind enemy lines, only to see squad mates captured and executed within moments of touching down. All that takes place in the first 3 minutes of the film, and it's just a taste of what's to come. Overlord's relentless pace never stops in what begins as an exciting and brutal war epic, only to take a sharp turn into terrifying zombie horror. The heroes battle Nazi sorcery, witchcraft, creatures, and soldiers, stopping at nothing to try to save the advancing allied troops from these twisted enemy terrors. Overlord is pure adrenaline with excellent production, effects, and action.", "created_at": "2022-08-27T18:31:41.680Z"}]