[{"movie_id": 308266, "review_id": "5844638492514166ba00be10", "author_rating": 8.0, "review_text": "**War is like a business zone, anyone can start-up a business.**\r\n\r\nTen years ago a similar film was made with Nicolas Cage in the lead called 'Lord of War'. This was based on the two youngsters who got into arm dealing, but many events were fictionalised. War is a business and these two made lots of profit out of it. So it all begins when financially struggling David clueless about raising his unborn child. At a right time he meets his old friend Efraim and decides to partner with him to supply arms to the US army abroad in a small scale. But when they saw a big opportunity, they decided to give it a try. From the obstacles, they go the extra mile to achieve it. But not knowing how serious the consequences are, finally they step into a dangerous turf and from there, what follows is revealed in the remaining parts.\r\n\r\nThis is really amazing film. Obviously a slow start, but like after 10-15 minutes later it gets better and better. For these actors, this is something big and they have done it excellently. Jonah Hill was simply unbelievable. Kind of good, as well as negative, totally unpredictable character. Mile Teller was superb, he narrated the story with the opening scene, gun pointed at him, the flashback begins. While the story keeps developing, it only gets crazy and crazier. Nearly two long was never been an issue, because of the good pace, as well as for the off beast storyline.\r\n\r\nLately I have been seeing lots of Ana de Armas, quite a coincident to watch some many films of someone in a short time. Anyway, her role in this was small, but she was decent. From the director of 'Hangover' trilogy, I think one of his best films it is. If you like the American Dream themes like 'Pain & Gain' and 'Wolf of Wall Street' about making dollars in a fast way risking everything, you would enjoy it as well. Like those two, it was also a comedy, despite inspired by the real. One of the film posters imitates the 'Scareface', but there's a strong reason for that, so you should watch it. Definitely worth a watch, so I suggest it!\r\n\r\n_8/10_", "created_at": "2016-12-04T18:42:12.727Z"}]