[{"movie_id": 663870, "review_id": "62404dd85a99150090c03ef1", "author_rating": 7.0, "review_text": "Mads Mikkelsen seems to be trying to do his level best to reinvigorate Danish cinema for an international audience - and here, again, he performs well. This time, he leads a slightly disparate band of geeks and misfits who are trying to get to the bottom of a train crash that killed his wife. Was it an accident or something far more sinister? It turns out that Mads (\"Markus\") has some serious military training so their investigation is not without some rather arbitrarily applied justice as they seek the truth. The rest of his gang provide great support, as does his rather bemused teenage daughter who is obviously struggling with her own feelings of remorse as her father appears to go off the rails, somewhat. It is a violent film, but the violence is cleverly wrapped in a blanket of humour and an almost slap-stick style of action that brings plenty of smiles as they go along. I didn't love the ending, but I did enjoy the film.", "created_at": "2022-03-27T11:43:20.120Z"}, {"movie_id": 663870, "review_id": "65351ba12b210800c749aaf5", "author_rating": 9.0, "review_text": "<em>'Riders of Justice'</em> - entertaining!\r\n\r\nBased on the poster alone I was expecting a standard <em>'John Wick'</em>-esque action flick, and after the opening few scenes I was anticipating a by-the-numbers revenge flick of Mads Mikkelsen going full Dwayne Johnson in <em>'Faster'</em>. Not that I would've been disappointed with that (I enjoy that latter film), but I like how the filmmakers added some additional elements to the story to make it more absorbing. It's amusing too, e.g. Lennart's gun assembly made me laugh.\r\n\r\nNot that it comes as a surprise whatsoever, but Mads Mikkelsen is excellent throughout - of all the characters I've seen him play, I think this is my favourite 'look' of a character of his thus far... perhaps aside from *that* unforgettable trim in <em>'The Green Butchers'</em>. Nikolaj Lie Kaas, Lars Brygmann, Nicolas Bro and Andrea Heick Gadeberg are deserving of praise too.\r\n\r\nI had a great time watching this across its near two hour run time. I don't have any issues with it, if I was forced to bring up something it would be the perhaps under characterization of the titular bunch but that's me fully reaching and then some for a 'negative'. \r\n\r\nRecommended, no doubt.", "created_at": "2023-10-22T12:54:57.344Z"}]