[{"movie_id": 427641, "review_id": "5b3e196692514114a20082b4", "author_rating": null, "review_text": "So initially I was against this movie as I feel Dwayne Johnson is in everything at the moment. but......... It was actually really good the kids loved it and the story line was quite good. Give it a look you won't be disappointed.", "created_at": "2018-07-05T13:13:10.719Z"}, {"movie_id": 427641, "review_id": "5b99d64992514133b5000cb6", "author_rating": 5.0, "review_text": "Takes some pretty massive but almost certainly necessary departures from the original source material. There's nothing about _Rampage_ to dislike in any particular abundance, except maybe the over-reliance on cliché, but there's also nothing much that stands out positively. The Rock is charming as ever, and the creature designs are so-so, but really this was just the sort of movie you sit back and let happen, you can hope to walk away a little entertained, but certainly not enriched.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-09-13T03:15:21.488Z"}, {"movie_id": 427641, "review_id": "5bb9c538c3a368241f028e74", "author_rating": 8.0, "review_text": "This movie is following the usual recipe for these kind of movies. Big companies are bad, gene science is bad, big monsters are cool. The story is fairly ludicrous, science non-existent and almost everyone except the hero is a dumb-ass.\r\n\r\nRegardless of all that, I quite enjoyed this movie. I watched it with the expectation of seeing The Rock and huge monsters wreck things and that is exactly what I got. The story itself is weak and the science is, well ludicrous. How these monsters grows to immense sizes in almost no time at all defies science of course. But heck, who want’s to spend time in a action movie watching animals grow? Also, what a strange coincidence that the ape, who happens to be on the good side, is the only one of them that doesn’t grow huge fangs, horns or other horrific appendages. As I said, the story is nonsense.\r\n\r\nHowever, once the action starts it is the usual wreck everything overkill kind of action that which is one of the few things that Hollywood is really good at these times. I really enjoyed it even if it was, at times, very very silly. And then we have The Rock. I really like The Rock. Call me old-fashioned but I do like macho type heroes with silly one-liners.\r\n\r\nAs usual the military trying to fight the monsters are depicted, pretty much, as morons. Uberconfident in their capacity to stop the monsters. The monsters of course proves them wrong. So what to do then? Well just nuke them. Okay, they didn’t try to use actual nukes but dropping a MOAB on the downtown of a major city is not that far from using nukes. I mean, come on, they claimed to have evacuated the city in what? A few hours. Not happening. Also in the fighting before this dumb-ass decision they send in a Warthog which was a fairly logical decision at least but they send in a single one! What the f…? And do not get me started about these creatures just shrugging of a Warthog. These planes are tank-killers for Christ sake. Oh well, here I go about science again.\r\n\r\nBad guys. Gotta have bad guys (well apart from the monsters of course) don’t we? Well, Claire Wyden is not too bad. The stereotypical big company asshole not caring about anything than her personal gains. However, Brett Wyden is just annoying. He’s stupid, stupid, stupid and just overly childish. Did I say stupid? From the first scene that he was in I rooted for him to get eaten by his sister’s creations. He wasn’t eaten actually but his demise was fairly satisfactory nonetheless.\r\n\r\nDespite all of this I did, as I wrote earlier, enjoy the movie. It was exactly what I hoped it would be. A roller-coaster ride of action and mayhem. The Rock was great. His “side-kick” Dr. Caldwell was okay but fairly forgettable. Agent Russell however went from annoying government agent to one of my favorite characters in the course of the movie. The scene where he stops that dumb-ass Brett Wayden and then lets him walk away towards his well deserved destiny quite enjoyable.\r\n\r\nI did like the ape as well. I liked how he made jokes on The Rock. An ape giving The Rock the finger may sound silly but it was actually quite funny.\r\n\r\nBottom line, two hours of good entertainment providing that monsters on rampage is your kind of movie.", "created_at": "2018-10-07T08:35:04.830Z"}]