[{"movie_id": 351286, "review_id": "5b2d4c080e0a264aea001943", "author_rating": 2.0, "review_text": "I felt embarrassed to be watching this. It's an embarrassing fever dream. I abandoned it halfway through its runtime.", "created_at": "2018-06-22T19:20:40.137Z"}, {"movie_id": 351286, "review_id": "5b9f08d3925141231900fa88", "author_rating": 8.0, "review_text": "More dinosaurs, Opie’s hot daughter, Dracula’s castle and Indiana Jones\r\n\r\n “Jurassic World: Fallen Kingdom” (2018) revolves around Claire (Bryce Dallas Howard) and Owen (Chris Pratt) leading a team back to Isla Nublar to save several species of dinosaurs after an active volcano threatens all life there. The plan is to relocate the dinosaurs to a new island sanctuary, but that’s not the way it works out.\r\n\r\nMy title blurb pretty much says it all for this fifth film in the franchise. I mention Indiana Jones because the movie has a “Raiders of the Lost Ark” (1981) vibe more so than the other movies. The reference to Dracula’s castle is due to the fact that the entire second half takes place at a cool, gothic chateau in Northern California and there’s a scene with a genetically-enhanced raptor acting like Dracula.\r\n\r\nCurvy Bryce is just stunning throughout and easily blows away any other woman in the series. Meanwhile Pratt seriously upped his game as leading action hero (I wasn’t overly impressed with him in the previous film, although I didn’t dislike him either). At the end of the day I’d have to rank this installment as my favorite, followed by the original 1993 movie and 2015’s “Jurassic World.”\r\n\r\nThe film runs 2 hours, 8 minutes and was shot in Hawaii and England/Scotland.\r\n\r\nGRADE: A-/B+", "created_at": "2018-09-17T01:52:19.067Z"}, {"movie_id": 351286, "review_id": "5bdc66dac3a368403200f453", "author_rating": 5.0, "review_text": "As a kid dinosaurs was one of my great interests. Thus I was so thrilled by the first Jurassic Park movie, which I thought then, and still think today, is a great movie. Sadly the following movies have been a mixed bag to say the least.\r\n\r\nThis movie falls in the “that was disappointing” category I am afraid. It is obviously that however wrote the story was a lazy bugger that simply rehashed old bits and standard Hollywood cheap concepts and then added some frustrating preaching to it.\r\n\r\nThe two scenes, one at the beginning and one in the end, where Ian Malcolm (Jeff Goldblum) was just sitting and ranting on and on was enough by itself to drag down the movie a star or two. We get it, however wrote that crap do not like gene science. Then go and write a piece in a science journal or something. Oh wait, it would not have been excepted since there was no science in it, just ranting mixed up with poorly hidden religious beliefs. So instead you had to go and ruin a movie which was meant to simply entertain.\r\n\r\nThe we have the rest of the story. The best, or should I say the kindest, word for describing it would be “predictable”. How many times are we going to do the big company captures animals for profit story? At least try to put some intelligence in the plot if you have to rehash it over and over again. It has even been done before in the same franchise for Christ sake!\r\n\r\nI would lie if I did not say that I found, at least, some entertainment watching the movie though. But pretty much all of it came from watching the scenery and the special effects. They at least were pretty good. But then I do like big monsters stomping around wreaking havoc and eating people, especially when it is the bad guys.\r\n\r\nThere were some parts that was rather funny. I think Christ Pratt, and most of the other actors as well for that matter, did a fairly good job out of the lousy script. The idea of using a Stygimoloch to break free was quite cool and the havoc he wreaked somewhat funny. The part where Wheatley stop in the middle of all the chaos to extract a tooth as a bloody trophy was just silly though.\r\n\r\nThe end scenes was just frustrating. However wrote that ought to be shot. A few dinosaurs escape and then the conclusion is that humanity have to live side by side with dinosaurs from then one. What a load of rubbish!\r\n\r\nSadly, despite the genre being a favorite of mine and the special effects being pretty good, this film did not make it for me due to the unintelligent and lazy script.", "created_at": "2018-11-02T15:01:46.638Z"}, {"movie_id": 351286, "review_id": "5c4471ba9251412bebdded43", "author_rating": 5.0, "review_text": "A strong, **strong** opening that it never recovers* from.\r\n\r\n(*\"never recovers from\" here meaning \"never stops dissapointing afterwards\".)\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T13:03:54.838Z"}, {"movie_id": 351286, "review_id": "5c961f6bc3a3682e5ff54f83", "author_rating": 5.0, "review_text": "Cover Version 2\r\n\r\nIt was 1993 when Jurassic Park was unleashed upon the film loving public, spawning a blockbuster franchise and pop culture thunders in the process. Sadly we now find ourselves suffering cover versions of what was once a great and thought provoking premise with high octane thrills into the bargain.\r\n\r\nI guess once they started personalising the Velociraptors, making one of them a friend of man, it was the beginning of the end. But we accepted it - sort of - jumping into 2015's Jurassic World with carefree abandon. More dino carnage we wanted, a bright cast fronted by the ever likable Chris Pratt and Bryce Howard drew us in, but it was merely ok, a franchise entry that was just a quick fix but nothing more. But of course box office talks and the franchise lumbers on to Jurassic World: Fallen Kingdom...\r\n\r\nPlot returns to Isla Nublar which along with all the dinosaur inhabitants is about to be vanished from the planet by the mother of all volcanoes. Cue mankind jostling over whether to save a species that was once extinct whilst others have nefarious motives for financial gain.\r\n\r\nOff we go then, stock characters that are over familiar are performed by different actors but go through motions we have witnessed before, whilst the writing strains for a sort of human empathy factor that never hits the mark. There is nothing remotely fresh (well Howard has at least changed her footwear to something more credible) or exciting on offer here, it's a tired cash cow that's in dire need of extinction itself.\r\n\r\nNaturally another instalment will come along, and naturally it will make money, with myself and the other millions of Jurassic zombies filing in to view what we hope will be a return to the heady days back in 1993. But it's most likely a forlorn hope, so maybe, just maybe, it should be enough now, enough?  5/10", "created_at": "2019-03-23T11:58:35.191Z"}, {"movie_id": 351286, "review_id": "5d86b0565a469000299b4892", "author_rating": 2.0, "review_text": "Brain hurt. Me no likey. Err...umm...ahem.\r\n\r\nThis is a movie that really stretches it as far as believability, logic, or even physics.\r\n\r\nFirst, just a quick note: The trailer makes it seem like the movie spends its time on an island about to blow up. Less than half the movie is that. So, if you're looking for a long drawn out volcanic eruption, look elsewhere.\r\n\r\nThe heroes are annoying and dumb caricatures, from the techie who's afraid of everything to the wisecracking animal wrangler (in fairness, this is Chris Pratt's character from the previous film, but still). The villains are short-sighted, moustache-twirling dolts who never seem to remember to watch behind them, especially in dangerous scenarios. And why was Jeff Goldblum even in this movie? He serves no purpose to the story. None at all. He's there for them to say, \"See! We have someone from the older movies, so it ties together.\" That's literally all he's there to do for his two minutes of screen time.\r\n\r\nIt's the same plot as every other Jurassic Park/World film. Let's create/genetically engineer dinosaurs. What could possibly go wrong? Even the supposed \"plot twist\" could be figured out from the very beginning of the film. Basic physics don't even apply, such as the impossible truck jump at one point. I swear I could feel my brain leaking out of my ears while watching this.\r\n\r\nThis film honestly makes me somewhat relieved that Colin Trevorrow got removed from Star Wars Episode IX. Unfortunately, the way this movie ends basically guarantees that there's going to be another one. Although it begs the question about what happened to Jurassic Park III since it ends in a similar way. Is that film even supposed to be canon anymore?\r\n\r\nJust don't bother. Even if you love the dinosaur special effects of previous films, there's really not much here that you didn't see before, and some of it is actually pretty bad and unbelievable for a film from 2018. Just don't bother.", "created_at": "2019-09-21T23:20:54.457Z"}, {"movie_id": 351286, "review_id": "5f705744a6e2d200386b06e5", "author_rating": 3.0, "review_text": "I spent half the time scoffing at the plot Jurassic World 2 was throwing at me, which diluted the fun I was having by looking at the superb CGI, moderate man-dinosaur action, and an overall fine cast performance. It still is a lot worse than Jurassic World (2015), which had a story almost as good as the original, the legendary Jurassic Park (1993) which almost seems impossible to mimic or better today. TN.", "created_at": "2020-09-27T09:11:32.184Z"}, {"movie_id": 351286, "review_id": "62a70afe22af3e00a1b6cc6d", "author_rating": 3.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nJurassic World: FallenKingdom still holds the same massive narrative issues.\r\n\r\nIf not for J. A. Bayona's incredible direction, this would be at the bottom of my ranking. No impressive visuals can overcome the nonsensical plot, annoying side characters, and that awful auction storyline.\r\n\r\nRating: D+", "created_at": "2022-06-13T10:01:34.395Z"}, {"movie_id": 351286, "review_id": "62ece433d036b6005d35014f", "author_rating": 6.0, "review_text": "Well, this is the fourth Jurassic Park movie I have watched over the past month and it feels like my reviews are very similar, something I try to avoid obviously. \r\n\r\nSo let me get a few similarities out of the way. Once again a child is placed at risk, though these precocious kids always seem adept at outrunning dinosaurs even while under a blind panic, so hats off to them. There are of course bad guys on the dinosaur menu, up to at least three in this Jurassic entry. And as usual a couple of times our heroes are saved from certain death by one predator Dino attacking another at the last second. What are the odds?\r\n\r\nBut it looks like we are finally moving away from the small island off the coast  of Costa Rica, as the island seems to have been destroyed by a volcano eruption that oddly reminded me of the lava damage in Lord of the Rings. Poor dinosaurs. First there was the comet millions of years ago, and now the volcano nearly made the score Universe 2, Dinosaurs 0. But don’t fear, a handful got away and who knows how much DNA?\r\n\r\nI am not too impressed by the whole building a super dinosaur thing. Aren’t we reaching a critical mass where they might as well end this franchise and switch to having the monsters be old fashioned alien invaders?\r\n\r\nOh, and Jeff Goldblum is back, though perhaps it was a dry, humorless clone of the original character who was a highlight of previous Jurassic movies, but who sounded like a didactic college professor this time.\r\n\r\nBut hey, we have seen much worse sequels often, haven’t we? On some surface level, this entry in the franchise was entertaining as always. That seems built into the series’s DNA as well as often accompanying Spielberg’s name in the credits. And it must be frustrating to try and fail to match the magic of the very first film.", "created_at": "2022-08-05T09:34:43.934Z"}, {"movie_id": 351286, "review_id": "64a837dbf9253200ca3ada44", "author_rating": 5.0, "review_text": "A lot of action in this one. The movie kind of dragged along. Boring at times.", "created_at": "2023-07-07T16:05:47.655Z"}, {"movie_id": 351286, "review_id": "5b2d4c080e0a264aea001943", "author_rating": 2.0, "review_text": "I felt embarrassed to be watching this. It's an embarrassing fever dream. I abandoned it halfway through its runtime.", "created_at": "2018-06-22T19:20:40.137Z"}, {"movie_id": 351286, "review_id": "5b9f08d3925141231900fa88", "author_rating": 8.0, "review_text": "More dinosaurs, Opie’s hot daughter, Dracula’s castle and Indiana Jones\r\n\r\n “Jurassic World: Fallen Kingdom” (2018) revolves around Claire (Bryce Dallas Howard) and Owen (Chris Pratt) leading a team back to Isla Nublar to save several species of dinosaurs after an active volcano threatens all life there. The plan is to relocate the dinosaurs to a new island sanctuary, but that’s not the way it works out.\r\n\r\nMy title blurb pretty much says it all for this fifth film in the franchise. I mention Indiana Jones because the movie has a “Raiders of the Lost Ark” (1981) vibe more so than the other movies. The reference to Dracula’s castle is due to the fact that the entire second half takes place at a cool, gothic chateau in Northern California and there’s a scene with a genetically-enhanced raptor acting like Dracula.\r\n\r\nCurvy Bryce is just stunning throughout and easily blows away any other woman in the series. Meanwhile Pratt seriously upped his game as leading action hero (I wasn’t overly impressed with him in the previous film, although I didn’t dislike him either). At the end of the day I’d have to rank this installment as my favorite, followed by the original 1993 movie and 2015’s “Jurassic World.”\r\n\r\nThe film runs 2 hours, 8 minutes and was shot in Hawaii and England/Scotland.\r\n\r\nGRADE: A-/B+", "created_at": "2018-09-17T01:52:19.067Z"}, {"movie_id": 351286, "review_id": "5bdc66dac3a368403200f453", "author_rating": 5.0, "review_text": "As a kid dinosaurs was one of my great interests. Thus I was so thrilled by the first Jurassic Park movie, which I thought then, and still think today, is a great movie. Sadly the following movies have been a mixed bag to say the least.\r\n\r\nThis movie falls in the “that was disappointing” category I am afraid. It is obviously that however wrote the story was a lazy bugger that simply rehashed old bits and standard Hollywood cheap concepts and then added some frustrating preaching to it.\r\n\r\nThe two scenes, one at the beginning and one in the end, where Ian Malcolm (Jeff Goldblum) was just sitting and ranting on and on was enough by itself to drag down the movie a star or two. We get it, however wrote that crap do not like gene science. Then go and write a piece in a science journal or something. Oh wait, it would not have been excepted since there was no science in it, just ranting mixed up with poorly hidden religious beliefs. So instead you had to go and ruin a movie which was meant to simply entertain.\r\n\r\nThe we have the rest of the story. The best, or should I say the kindest, word for describing it would be “predictable”. How many times are we going to do the big company captures animals for profit story? At least try to put some intelligence in the plot if you have to rehash it over and over again. It has even been done before in the same franchise for Christ sake!\r\n\r\nI would lie if I did not say that I found, at least, some entertainment watching the movie though. But pretty much all of it came from watching the scenery and the special effects. They at least were pretty good. But then I do like big monsters stomping around wreaking havoc and eating people, especially when it is the bad guys.\r\n\r\nThere were some parts that was rather funny. I think Christ Pratt, and most of the other actors as well for that matter, did a fairly good job out of the lousy script. The idea of using a Stygimoloch to break free was quite cool and the havoc he wreaked somewhat funny. The part where Wheatley stop in the middle of all the chaos to extract a tooth as a bloody trophy was just silly though.\r\n\r\nThe end scenes was just frustrating. However wrote that ought to be shot. A few dinosaurs escape and then the conclusion is that humanity have to live side by side with dinosaurs from then one. What a load of rubbish!\r\n\r\nSadly, despite the genre being a favorite of mine and the special effects being pretty good, this film did not make it for me due to the unintelligent and lazy script.", "created_at": "2018-11-02T15:01:46.638Z"}, {"movie_id": 351286, "review_id": "5c4471ba9251412bebdded43", "author_rating": 5.0, "review_text": "A strong, **strong** opening that it never recovers* from.\r\n\r\n(*\"never recovers from\" here meaning \"never stops dissapointing afterwards\".)\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T13:03:54.838Z"}, {"movie_id": 351286, "review_id": "5c961f6bc3a3682e5ff54f83", "author_rating": 5.0, "review_text": "Cover Version 2\r\n\r\nIt was 1993 when Jurassic Park was unleashed upon the film loving public, spawning a blockbuster franchise and pop culture thunders in the process. Sadly we now find ourselves suffering cover versions of what was once a great and thought provoking premise with high octane thrills into the bargain.\r\n\r\nI guess once they started personalising the Velociraptors, making one of them a friend of man, it was the beginning of the end. But we accepted it - sort of - jumping into 2015's Jurassic World with carefree abandon. More dino carnage we wanted, a bright cast fronted by the ever likable Chris Pratt and Bryce Howard drew us in, but it was merely ok, a franchise entry that was just a quick fix but nothing more. But of course box office talks and the franchise lumbers on to Jurassic World: Fallen Kingdom...\r\n\r\nPlot returns to Isla Nublar which along with all the dinosaur inhabitants is about to be vanished from the planet by the mother of all volcanoes. Cue mankind jostling over whether to save a species that was once extinct whilst others have nefarious motives for financial gain.\r\n\r\nOff we go then, stock characters that are over familiar are performed by different actors but go through motions we have witnessed before, whilst the writing strains for a sort of human empathy factor that never hits the mark. There is nothing remotely fresh (well Howard has at least changed her footwear to something more credible) or exciting on offer here, it's a tired cash cow that's in dire need of extinction itself.\r\n\r\nNaturally another instalment will come along, and naturally it will make money, with myself and the other millions of Jurassic zombies filing in to view what we hope will be a return to the heady days back in 1993. But it's most likely a forlorn hope, so maybe, just maybe, it should be enough now, enough?  5/10", "created_at": "2019-03-23T11:58:35.191Z"}, {"movie_id": 351286, "review_id": "5d86b0565a469000299b4892", "author_rating": 2.0, "review_text": "Brain hurt. Me no likey. Err...umm...ahem.\r\n\r\nThis is a movie that really stretches it as far as believability, logic, or even physics.\r\n\r\nFirst, just a quick note: The trailer makes it seem like the movie spends its time on an island about to blow up. Less than half the movie is that. So, if you're looking for a long drawn out volcanic eruption, look elsewhere.\r\n\r\nThe heroes are annoying and dumb caricatures, from the techie who's afraid of everything to the wisecracking animal wrangler (in fairness, this is Chris Pratt's character from the previous film, but still). The villains are short-sighted, moustache-twirling dolts who never seem to remember to watch behind them, especially in dangerous scenarios. And why was Jeff Goldblum even in this movie? He serves no purpose to the story. None at all. He's there for them to say, \"See! We have someone from the older movies, so it ties together.\" That's literally all he's there to do for his two minutes of screen time.\r\n\r\nIt's the same plot as every other Jurassic Park/World film. Let's create/genetically engineer dinosaurs. What could possibly go wrong? Even the supposed \"plot twist\" could be figured out from the very beginning of the film. Basic physics don't even apply, such as the impossible truck jump at one point. I swear I could feel my brain leaking out of my ears while watching this.\r\n\r\nThis film honestly makes me somewhat relieved that Colin Trevorrow got removed from Star Wars Episode IX. Unfortunately, the way this movie ends basically guarantees that there's going to be another one. Although it begs the question about what happened to Jurassic Park III since it ends in a similar way. Is that film even supposed to be canon anymore?\r\n\r\nJust don't bother. Even if you love the dinosaur special effects of previous films, there's really not much here that you didn't see before, and some of it is actually pretty bad and unbelievable for a film from 2018. Just don't bother.", "created_at": "2019-09-21T23:20:54.457Z"}, {"movie_id": 351286, "review_id": "5f705744a6e2d200386b06e5", "author_rating": 3.0, "review_text": "I spent half the time scoffing at the plot Jurassic World 2 was throwing at me, which diluted the fun I was having by looking at the superb CGI, moderate man-dinosaur action, and an overall fine cast performance. It still is a lot worse than Jurassic World (2015), which had a story almost as good as the original, the legendary Jurassic Park (1993) which almost seems impossible to mimic or better today. TN.", "created_at": "2020-09-27T09:11:32.184Z"}, {"movie_id": 351286, "review_id": "62a70afe22af3e00a1b6cc6d", "author_rating": 3.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nJurassic World: FallenKingdom still holds the same massive narrative issues.\r\n\r\nIf not for J. A. Bayona's incredible direction, this would be at the bottom of my ranking. No impressive visuals can overcome the nonsensical plot, annoying side characters, and that awful auction storyline.\r\n\r\nRating: D+", "created_at": "2022-06-13T10:01:34.395Z"}, {"movie_id": 351286, "review_id": "62ece433d036b6005d35014f", "author_rating": 6.0, "review_text": "Well, this is the fourth Jurassic Park movie I have watched over the past month and it feels like my reviews are very similar, something I try to avoid obviously. \r\n\r\nSo let me get a few similarities out of the way. Once again a child is placed at risk, though these precocious kids always seem adept at outrunning dinosaurs even while under a blind panic, so hats off to them. There are of course bad guys on the dinosaur menu, up to at least three in this Jurassic entry. And as usual a couple of times our heroes are saved from certain death by one predator Dino attacking another at the last second. What are the odds?\r\n\r\nBut it looks like we are finally moving away from the small island off the coast  of Costa Rica, as the island seems to have been destroyed by a volcano eruption that oddly reminded me of the lava damage in Lord of the Rings. Poor dinosaurs. First there was the comet millions of years ago, and now the volcano nearly made the score Universe 2, Dinosaurs 0. But don’t fear, a handful got away and who knows how much DNA?\r\n\r\nI am not too impressed by the whole building a super dinosaur thing. Aren’t we reaching a critical mass where they might as well end this franchise and switch to having the monsters be old fashioned alien invaders?\r\n\r\nOh, and Jeff Goldblum is back, though perhaps it was a dry, humorless clone of the original character who was a highlight of previous Jurassic movies, but who sounded like a didactic college professor this time.\r\n\r\nBut hey, we have seen much worse sequels often, haven’t we? On some surface level, this entry in the franchise was entertaining as always. That seems built into the series’s DNA as well as often accompanying Spielberg’s name in the credits. And it must be frustrating to try and fail to match the magic of the very first film.", "created_at": "2022-08-05T09:34:43.934Z"}, {"movie_id": 351286, "review_id": "64a837dbf9253200ca3ada44", "author_rating": 5.0, "review_text": "A lot of action in this one. The movie kind of dragged along. Boring at times.", "created_at": "2023-07-07T16:05:47.655Z"}, {"movie_id": 351286, "review_id": "5b2d4c080e0a264aea001943", "author_rating": 2.0, "review_text": "I felt embarrassed to be watching this. It's an embarrassing fever dream. I abandoned it halfway through its runtime.", "created_at": "2018-06-22T19:20:40.137Z"}, {"movie_id": 351286, "review_id": "5b9f08d3925141231900fa88", "author_rating": 8.0, "review_text": "More dinosaurs, Opie’s hot daughter, Dracula’s castle and Indiana Jones\r\n\r\n “Jurassic World: Fallen Kingdom” (2018) revolves around Claire (Bryce Dallas Howard) and Owen (Chris Pratt) leading a team back to Isla Nublar to save several species of dinosaurs after an active volcano threatens all life there. The plan is to relocate the dinosaurs to a new island sanctuary, but that’s not the way it works out.\r\n\r\nMy title blurb pretty much says it all for this fifth film in the franchise. I mention Indiana Jones because the movie has a “Raiders of the Lost Ark” (1981) vibe more so than the other movies. The reference to Dracula’s castle is due to the fact that the entire second half takes place at a cool, gothic chateau in Northern California and there’s a scene with a genetically-enhanced raptor acting like Dracula.\r\n\r\nCurvy Bryce is just stunning throughout and easily blows away any other woman in the series. Meanwhile Pratt seriously upped his game as leading action hero (I wasn’t overly impressed with him in the previous film, although I didn’t dislike him either). At the end of the day I’d have to rank this installment as my favorite, followed by the original 1993 movie and 2015’s “Jurassic World.”\r\n\r\nThe film runs 2 hours, 8 minutes and was shot in Hawaii and England/Scotland.\r\n\r\nGRADE: A-/B+", "created_at": "2018-09-17T01:52:19.067Z"}, {"movie_id": 351286, "review_id": "5bdc66dac3a368403200f453", "author_rating": 5.0, "review_text": "As a kid dinosaurs was one of my great interests. Thus I was so thrilled by the first Jurassic Park movie, which I thought then, and still think today, is a great movie. Sadly the following movies have been a mixed bag to say the least.\r\n\r\nThis movie falls in the “that was disappointing” category I am afraid. It is obviously that however wrote the story was a lazy bugger that simply rehashed old bits and standard Hollywood cheap concepts and then added some frustrating preaching to it.\r\n\r\nThe two scenes, one at the beginning and one in the end, where Ian Malcolm (Jeff Goldblum) was just sitting and ranting on and on was enough by itself to drag down the movie a star or two. We get it, however wrote that crap do not like gene science. Then go and write a piece in a science journal or something. Oh wait, it would not have been excepted since there was no science in it, just ranting mixed up with poorly hidden religious beliefs. So instead you had to go and ruin a movie which was meant to simply entertain.\r\n\r\nThe we have the rest of the story. The best, or should I say the kindest, word for describing it would be “predictable”. How many times are we going to do the big company captures animals for profit story? At least try to put some intelligence in the plot if you have to rehash it over and over again. It has even been done before in the same franchise for Christ sake!\r\n\r\nI would lie if I did not say that I found, at least, some entertainment watching the movie though. But pretty much all of it came from watching the scenery and the special effects. They at least were pretty good. But then I do like big monsters stomping around wreaking havoc and eating people, especially when it is the bad guys.\r\n\r\nThere were some parts that was rather funny. I think Christ Pratt, and most of the other actors as well for that matter, did a fairly good job out of the lousy script. The idea of using a Stygimoloch to break free was quite cool and the havoc he wreaked somewhat funny. The part where Wheatley stop in the middle of all the chaos to extract a tooth as a bloody trophy was just silly though.\r\n\r\nThe end scenes was just frustrating. However wrote that ought to be shot. A few dinosaurs escape and then the conclusion is that humanity have to live side by side with dinosaurs from then one. What a load of rubbish!\r\n\r\nSadly, despite the genre being a favorite of mine and the special effects being pretty good, this film did not make it for me due to the unintelligent and lazy script.", "created_at": "2018-11-02T15:01:46.638Z"}, {"movie_id": 351286, "review_id": "5c4471ba9251412bebdded43", "author_rating": 5.0, "review_text": "A strong, **strong** opening that it never recovers* from.\r\n\r\n(*\"never recovers from\" here meaning \"never stops dissapointing afterwards\".)\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T13:03:54.838Z"}, {"movie_id": 351286, "review_id": "5c961f6bc3a3682e5ff54f83", "author_rating": 5.0, "review_text": "Cover Version 2\r\n\r\nIt was 1993 when Jurassic Park was unleashed upon the film loving public, spawning a blockbuster franchise and pop culture thunders in the process. Sadly we now find ourselves suffering cover versions of what was once a great and thought provoking premise with high octane thrills into the bargain.\r\n\r\nI guess once they started personalising the Velociraptors, making one of them a friend of man, it was the beginning of the end. But we accepted it - sort of - jumping into 2015's Jurassic World with carefree abandon. More dino carnage we wanted, a bright cast fronted by the ever likable Chris Pratt and Bryce Howard drew us in, but it was merely ok, a franchise entry that was just a quick fix but nothing more. But of course box office talks and the franchise lumbers on to Jurassic World: Fallen Kingdom...\r\n\r\nPlot returns to Isla Nublar which along with all the dinosaur inhabitants is about to be vanished from the planet by the mother of all volcanoes. Cue mankind jostling over whether to save a species that was once extinct whilst others have nefarious motives for financial gain.\r\n\r\nOff we go then, stock characters that are over familiar are performed by different actors but go through motions we have witnessed before, whilst the writing strains for a sort of human empathy factor that never hits the mark. There is nothing remotely fresh (well Howard has at least changed her footwear to something more credible) or exciting on offer here, it's a tired cash cow that's in dire need of extinction itself.\r\n\r\nNaturally another instalment will come along, and naturally it will make money, with myself and the other millions of Jurassic zombies filing in to view what we hope will be a return to the heady days back in 1993. But it's most likely a forlorn hope, so maybe, just maybe, it should be enough now, enough?  5/10", "created_at": "2019-03-23T11:58:35.191Z"}, {"movie_id": 351286, "review_id": "5d86b0565a469000299b4892", "author_rating": 2.0, "review_text": "Brain hurt. Me no likey. Err...umm...ahem.\r\n\r\nThis is a movie that really stretches it as far as believability, logic, or even physics.\r\n\r\nFirst, just a quick note: The trailer makes it seem like the movie spends its time on an island about to blow up. Less than half the movie is that. So, if you're looking for a long drawn out volcanic eruption, look elsewhere.\r\n\r\nThe heroes are annoying and dumb caricatures, from the techie who's afraid of everything to the wisecracking animal wrangler (in fairness, this is Chris Pratt's character from the previous film, but still). The villains are short-sighted, moustache-twirling dolts who never seem to remember to watch behind them, especially in dangerous scenarios. And why was Jeff Goldblum even in this movie? He serves no purpose to the story. None at all. He's there for them to say, \"See! We have someone from the older movies, so it ties together.\" That's literally all he's there to do for his two minutes of screen time.\r\n\r\nIt's the same plot as every other Jurassic Park/World film. Let's create/genetically engineer dinosaurs. What could possibly go wrong? Even the supposed \"plot twist\" could be figured out from the very beginning of the film. Basic physics don't even apply, such as the impossible truck jump at one point. I swear I could feel my brain leaking out of my ears while watching this.\r\n\r\nThis film honestly makes me somewhat relieved that Colin Trevorrow got removed from Star Wars Episode IX. Unfortunately, the way this movie ends basically guarantees that there's going to be another one. Although it begs the question about what happened to Jurassic Park III since it ends in a similar way. Is that film even supposed to be canon anymore?\r\n\r\nJust don't bother. Even if you love the dinosaur special effects of previous films, there's really not much here that you didn't see before, and some of it is actually pretty bad and unbelievable for a film from 2018. Just don't bother.", "created_at": "2019-09-21T23:20:54.457Z"}, {"movie_id": 351286, "review_id": "5f705744a6e2d200386b06e5", "author_rating": 3.0, "review_text": "I spent half the time scoffing at the plot Jurassic World 2 was throwing at me, which diluted the fun I was having by looking at the superb CGI, moderate man-dinosaur action, and an overall fine cast performance. It still is a lot worse than Jurassic World (2015), which had a story almost as good as the original, the legendary Jurassic Park (1993) which almost seems impossible to mimic or better today. TN.", "created_at": "2020-09-27T09:11:32.184Z"}, {"movie_id": 351286, "review_id": "62a70afe22af3e00a1b6cc6d", "author_rating": 3.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nJurassic World: FallenKingdom still holds the same massive narrative issues.\r\n\r\nIf not for J. A. Bayona's incredible direction, this would be at the bottom of my ranking. No impressive visuals can overcome the nonsensical plot, annoying side characters, and that awful auction storyline.\r\n\r\nRating: D+", "created_at": "2022-06-13T10:01:34.395Z"}, {"movie_id": 351286, "review_id": "62ece433d036b6005d35014f", "author_rating": 6.0, "review_text": "Well, this is the fourth Jurassic Park movie I have watched over the past month and it feels like my reviews are very similar, something I try to avoid obviously. \r\n\r\nSo let me get a few similarities out of the way. Once again a child is placed at risk, though these precocious kids always seem adept at outrunning dinosaurs even while under a blind panic, so hats off to them. There are of course bad guys on the dinosaur menu, up to at least three in this Jurassic entry. And as usual a couple of times our heroes are saved from certain death by one predator Dino attacking another at the last second. What are the odds?\r\n\r\nBut it looks like we are finally moving away from the small island off the coast  of Costa Rica, as the island seems to have been destroyed by a volcano eruption that oddly reminded me of the lava damage in Lord of the Rings. Poor dinosaurs. First there was the comet millions of years ago, and now the volcano nearly made the score Universe 2, Dinosaurs 0. But don’t fear, a handful got away and who knows how much DNA?\r\n\r\nI am not too impressed by the whole building a super dinosaur thing. Aren’t we reaching a critical mass where they might as well end this franchise and switch to having the monsters be old fashioned alien invaders?\r\n\r\nOh, and Jeff Goldblum is back, though perhaps it was a dry, humorless clone of the original character who was a highlight of previous Jurassic movies, but who sounded like a didactic college professor this time.\r\n\r\nBut hey, we have seen much worse sequels often, haven’t we? On some surface level, this entry in the franchise was entertaining as always. That seems built into the series’s DNA as well as often accompanying Spielberg’s name in the credits. And it must be frustrating to try and fail to match the magic of the very first film.", "created_at": "2022-08-05T09:34:43.934Z"}, {"movie_id": 351286, "review_id": "64a837dbf9253200ca3ada44", "author_rating": 5.0, "review_text": "A lot of action in this one. The movie kind of dragged along. Boring at times.", "created_at": "2023-07-07T16:05:47.655Z"}, {"movie_id": 351286, "review_id": "5b2d4c080e0a264aea001943", "author_rating": 2.0, "review_text": "I felt embarrassed to be watching this. It's an embarrassing fever dream. I abandoned it halfway through its runtime.", "created_at": "2018-06-22T19:20:40.137Z"}, {"movie_id": 351286, "review_id": "5b9f08d3925141231900fa88", "author_rating": 8.0, "review_text": "More dinosaurs, Opie’s hot daughter, Dracula’s castle and Indiana Jones\r\n\r\n “Jurassic World: Fallen Kingdom” (2018) revolves around Claire (Bryce Dallas Howard) and Owen (Chris Pratt) leading a team back to Isla Nublar to save several species of dinosaurs after an active volcano threatens all life there. The plan is to relocate the dinosaurs to a new island sanctuary, but that’s not the way it works out.\r\n\r\nMy title blurb pretty much says it all for this fifth film in the franchise. I mention Indiana Jones because the movie has a “Raiders of the Lost Ark” (1981) vibe more so than the other movies. The reference to Dracula’s castle is due to the fact that the entire second half takes place at a cool, gothic chateau in Northern California and there’s a scene with a genetically-enhanced raptor acting like Dracula.\r\n\r\nCurvy Bryce is just stunning throughout and easily blows away any other woman in the series. Meanwhile Pratt seriously upped his game as leading action hero (I wasn’t overly impressed with him in the previous film, although I didn’t dislike him either). At the end of the day I’d have to rank this installment as my favorite, followed by the original 1993 movie and 2015’s “Jurassic World.”\r\n\r\nThe film runs 2 hours, 8 minutes and was shot in Hawaii and England/Scotland.\r\n\r\nGRADE: A-/B+", "created_at": "2018-09-17T01:52:19.067Z"}, {"movie_id": 351286, "review_id": "5bdc66dac3a368403200f453", "author_rating": 5.0, "review_text": "As a kid dinosaurs was one of my great interests. Thus I was so thrilled by the first Jurassic Park movie, which I thought then, and still think today, is a great movie. Sadly the following movies have been a mixed bag to say the least.\r\n\r\nThis movie falls in the “that was disappointing” category I am afraid. It is obviously that however wrote the story was a lazy bugger that simply rehashed old bits and standard Hollywood cheap concepts and then added some frustrating preaching to it.\r\n\r\nThe two scenes, one at the beginning and one in the end, where Ian Malcolm (Jeff Goldblum) was just sitting and ranting on and on was enough by itself to drag down the movie a star or two. We get it, however wrote that crap do not like gene science. Then go and write a piece in a science journal or something. Oh wait, it would not have been excepted since there was no science in it, just ranting mixed up with poorly hidden religious beliefs. So instead you had to go and ruin a movie which was meant to simply entertain.\r\n\r\nThe we have the rest of the story. The best, or should I say the kindest, word for describing it would be “predictable”. How many times are we going to do the big company captures animals for profit story? At least try to put some intelligence in the plot if you have to rehash it over and over again. It has even been done before in the same franchise for Christ sake!\r\n\r\nI would lie if I did not say that I found, at least, some entertainment watching the movie though. But pretty much all of it came from watching the scenery and the special effects. They at least were pretty good. But then I do like big monsters stomping around wreaking havoc and eating people, especially when it is the bad guys.\r\n\r\nThere were some parts that was rather funny. I think Christ Pratt, and most of the other actors as well for that matter, did a fairly good job out of the lousy script. The idea of using a Stygimoloch to break free was quite cool and the havoc he wreaked somewhat funny. The part where Wheatley stop in the middle of all the chaos to extract a tooth as a bloody trophy was just silly though.\r\n\r\nThe end scenes was just frustrating. However wrote that ought to be shot. A few dinosaurs escape and then the conclusion is that humanity have to live side by side with dinosaurs from then one. What a load of rubbish!\r\n\r\nSadly, despite the genre being a favorite of mine and the special effects being pretty good, this film did not make it for me due to the unintelligent and lazy script.", "created_at": "2018-11-02T15:01:46.638Z"}, {"movie_id": 351286, "review_id": "5c4471ba9251412bebdded43", "author_rating": 5.0, "review_text": "A strong, **strong** opening that it never recovers* from.\r\n\r\n(*\"never recovers from\" here meaning \"never stops dissapointing afterwards\".)\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T13:03:54.838Z"}, {"movie_id": 351286, "review_id": "5c961f6bc3a3682e5ff54f83", "author_rating": 5.0, "review_text": "Cover Version 2\r\n\r\nIt was 1993 when Jurassic Park was unleashed upon the film loving public, spawning a blockbuster franchise and pop culture thunders in the process. Sadly we now find ourselves suffering cover versions of what was once a great and thought provoking premise with high octane thrills into the bargain.\r\n\r\nI guess once they started personalising the Velociraptors, making one of them a friend of man, it was the beginning of the end. But we accepted it - sort of - jumping into 2015's Jurassic World with carefree abandon. More dino carnage we wanted, a bright cast fronted by the ever likable Chris Pratt and Bryce Howard drew us in, but it was merely ok, a franchise entry that was just a quick fix but nothing more. But of course box office talks and the franchise lumbers on to Jurassic World: Fallen Kingdom...\r\n\r\nPlot returns to Isla Nublar which along with all the dinosaur inhabitants is about to be vanished from the planet by the mother of all volcanoes. Cue mankind jostling over whether to save a species that was once extinct whilst others have nefarious motives for financial gain.\r\n\r\nOff we go then, stock characters that are over familiar are performed by different actors but go through motions we have witnessed before, whilst the writing strains for a sort of human empathy factor that never hits the mark. There is nothing remotely fresh (well Howard has at least changed her footwear to something more credible) or exciting on offer here, it's a tired cash cow that's in dire need of extinction itself.\r\n\r\nNaturally another instalment will come along, and naturally it will make money, with myself and the other millions of Jurassic zombies filing in to view what we hope will be a return to the heady days back in 1993. But it's most likely a forlorn hope, so maybe, just maybe, it should be enough now, enough?  5/10", "created_at": "2019-03-23T11:58:35.191Z"}, {"movie_id": 351286, "review_id": "5d86b0565a469000299b4892", "author_rating": 2.0, "review_text": "Brain hurt. Me no likey. Err...umm...ahem.\r\n\r\nThis is a movie that really stretches it as far as believability, logic, or even physics.\r\n\r\nFirst, just a quick note: The trailer makes it seem like the movie spends its time on an island about to blow up. Less than half the movie is that. So, if you're looking for a long drawn out volcanic eruption, look elsewhere.\r\n\r\nThe heroes are annoying and dumb caricatures, from the techie who's afraid of everything to the wisecracking animal wrangler (in fairness, this is Chris Pratt's character from the previous film, but still). The villains are short-sighted, moustache-twirling dolts who never seem to remember to watch behind them, especially in dangerous scenarios. And why was Jeff Goldblum even in this movie? He serves no purpose to the story. None at all. He's there for them to say, \"See! We have someone from the older movies, so it ties together.\" That's literally all he's there to do for his two minutes of screen time.\r\n\r\nIt's the same plot as every other Jurassic Park/World film. Let's create/genetically engineer dinosaurs. What could possibly go wrong? Even the supposed \"plot twist\" could be figured out from the very beginning of the film. Basic physics don't even apply, such as the impossible truck jump at one point. I swear I could feel my brain leaking out of my ears while watching this.\r\n\r\nThis film honestly makes me somewhat relieved that Colin Trevorrow got removed from Star Wars Episode IX. Unfortunately, the way this movie ends basically guarantees that there's going to be another one. Although it begs the question about what happened to Jurassic Park III since it ends in a similar way. Is that film even supposed to be canon anymore?\r\n\r\nJust don't bother. Even if you love the dinosaur special effects of previous films, there's really not much here that you didn't see before, and some of it is actually pretty bad and unbelievable for a film from 2018. Just don't bother.", "created_at": "2019-09-21T23:20:54.457Z"}, {"movie_id": 351286, "review_id": "5f705744a6e2d200386b06e5", "author_rating": 3.0, "review_text": "I spent half the time scoffing at the plot Jurassic World 2 was throwing at me, which diluted the fun I was having by looking at the superb CGI, moderate man-dinosaur action, and an overall fine cast performance. It still is a lot worse than Jurassic World (2015), which had a story almost as good as the original, the legendary Jurassic Park (1993) which almost seems impossible to mimic or better today. TN.", "created_at": "2020-09-27T09:11:32.184Z"}, {"movie_id": 351286, "review_id": "62a70afe22af3e00a1b6cc6d", "author_rating": 3.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nJurassic World: FallenKingdom still holds the same massive narrative issues.\r\n\r\nIf not for J. A. Bayona's incredible direction, this would be at the bottom of my ranking. No impressive visuals can overcome the nonsensical plot, annoying side characters, and that awful auction storyline.\r\n\r\nRating: D+", "created_at": "2022-06-13T10:01:34.395Z"}, {"movie_id": 351286, "review_id": "62ece433d036b6005d35014f", "author_rating": 6.0, "review_text": "Well, this is the fourth Jurassic Park movie I have watched over the past month and it feels like my reviews are very similar, something I try to avoid obviously. \r\n\r\nSo let me get a few similarities out of the way. Once again a child is placed at risk, though these precocious kids always seem adept at outrunning dinosaurs even while under a blind panic, so hats off to them. There are of course bad guys on the dinosaur menu, up to at least three in this Jurassic entry. And as usual a couple of times our heroes are saved from certain death by one predator Dino attacking another at the last second. What are the odds?\r\n\r\nBut it looks like we are finally moving away from the small island off the coast  of Costa Rica, as the island seems to have been destroyed by a volcano eruption that oddly reminded me of the lava damage in Lord of the Rings. Poor dinosaurs. First there was the comet millions of years ago, and now the volcano nearly made the score Universe 2, Dinosaurs 0. But don’t fear, a handful got away and who knows how much DNA?\r\n\r\nI am not too impressed by the whole building a super dinosaur thing. Aren’t we reaching a critical mass where they might as well end this franchise and switch to having the monsters be old fashioned alien invaders?\r\n\r\nOh, and Jeff Goldblum is back, though perhaps it was a dry, humorless clone of the original character who was a highlight of previous Jurassic movies, but who sounded like a didactic college professor this time.\r\n\r\nBut hey, we have seen much worse sequels often, haven’t we? On some surface level, this entry in the franchise was entertaining as always. That seems built into the series’s DNA as well as often accompanying Spielberg’s name in the credits. And it must be frustrating to try and fail to match the magic of the very first film.", "created_at": "2022-08-05T09:34:43.934Z"}, {"movie_id": 351286, "review_id": "64a837dbf9253200ca3ada44", "author_rating": 5.0, "review_text": "A lot of action in this one. The movie kind of dragged along. Boring at times.", "created_at": "2023-07-07T16:05:47.655Z"}]