[{"movie_id": 15070, "review_id": "631d7374ce9e91008490c7a8", "author_rating": 2.0, "review_text": "A very good movie could be made with Wesley Snipes, Ving Rhames, Michael Rooker, Wes Studi and Peter Falk; Undisputed is not that movie, and the fault lies not in its stars, but in writer/producer/director Walter Hill. \r\n\r\nThis is unfortunate because the film initially appears to be smarter than the average prison movie. Instead of the usual Force Prized Fights/Involuntary Battles to the Death wherein a Condemned Contestant goes through a Tournament Arc in order to Win His Freedom, we get a state-sanctioned, inter-prison boxing program.\r\n\r\nSadly, Undisputed manages to avoid all the above-mentioned clichés only to succumb to the The Thunderdome. In lieu of a ring with ropes, the bouts take place in a big-ass, roofless cage with barbed wire atop its walls — but why? Why go to the trouble of establishing the lawfulness of the premise only to make the actual thing look like a Texas Death Match?\r\n\r\nAnyway, disgraced heavyweight champion George 'The Iceman' Chambers (Rhames) is convicted of rape, sentenced to 6-8 years, and sent to Sweetwater maximum security prison in California. Chambers asks his cellmate Mingo (Studi) why he’s there. Mingo replies that «it's not considered polite to ask why we're here. Kinda violation of the ethics. You know, the code?»\r\n\r\nNo, I don’t know. What code? I’d seriously like to know, because it would mean that every prison movie where a character asks another character what he’s in there for (i.e., all of them) is in breach of some sort of tacit etiquette system.\r\n\r\nMingo’s right, though; no need to ask when Hill helpfully includes captions detailing the lives and crimes of every single characters — even those who only appear in a couple of scenes. Why exactly do we need to know that the announcer/commentator is a con artist convicted of larceny in 1995 named Marvin?\r\n\r\nMendy Ripstein (Falk), an elderly mobster/boxing fan, becomes dead set on booking a fight between Chambers and Sweetwater’s own state champion Monroe Hutchens (Snipes), so that he can (according to All Movie) \"pull in a million dollars in bets from guards and inmates\" (the movie actually speaks of multiple millions of dollars; either way, that’s a lot of cigarettes). \r\n\r\nChuy (Jon Seda), Ripstein's caretaker or something, says “I talked to the head guard [Rooker]. He’s OK agrees. But the warden [Dennis Arndt] is a problem.” The nature of this problem seems to be that the warden can’t make up his goddamn mind; first he allows the fight, as long as it happens while he’s on vacation. \r\n\r\nHe then backtracks and cancels it. Finally, he backpedals yet again and agrees to it. He’s not the only indecisive one, however; at first Ripstein wants a bare knuckle fight, but then someone complains, Ripstein thinks it over for about five seconds, and decides that it’s better with gloves — so why bring it up at all. \r\n\r\nI understand why they cast Falk in this role, but they needn’t have bothered him for something that Burt Young could have easily handled. As for Rooker and Studi, Hill forgot to write parts for them to play — which is odd considering that Rooker as a sadistic, racist guard C.O and Studi a mystical mentor are parts that pretty much write themselves (and even such clichés, that both actors are more than able to elevate beyond the commonplace, would be better than nothing).\r\n\r\nThat leaves Snipes, who does with his Zen Warrior what he can (not much, since he spends a good chunk of the movie in solitary confinement), and Rhames, who has the juiciest character and makes the most of it, as a man torn between the need to be a \"model prisoner\" if he wants to regain his freedom and resume his career before it’s too late, and his pathological desire to be respected and feared at all costs, something he only knows to achieve through physical violence. \r\n\r\nUnfortunately, the ugly business of rape remains unaccountably ambiguous. Chambers is unequivocally the antagonist, and Rhames is so good at being bad that it's hard to believe his claims of innocence. \r\n\r\nTherefore, either Chambers is innocent in that particular respect but a horrible human being in general, or he's guilty and ultimately gets away with it, since in exchange for fighting Monroe, Ripstein uses his clout to get Chambers out \"in special parole” (one has to wonder why Ripstein, who can get someone paroled without having served the minimum time required, doesn't use his obviously vast influence to his own advantage). \r\n\r\nWe are supposed to believe that the humiliation of being beaten by Monroe is punishment enough; Chuy narrates at the end that “The Iceman and his manager denied that the fight with Monroe ever happened and the story that he lost was just a big rumour” — and why wouldn’t they? It is, after all,  their word against that of 700 witnesses between inmates and prison staff, not to mention, as Marvin points out, “our friends from Las Vegas, here to witness this competition and report to various cities across our great country. A lot of bookmakers want to know what's coming.\" D'oh!", "created_at": "2022-09-11T05:34:44.058Z"}]