[{"movie_id": 318917, "review_id": "570fc615c3a3684ff1001c62", "author_rating": 7.0, "review_text": "> He's obviously the same person, but his intentions are?\r\n\r\nI enjoyed the director's previous works like 'Combat Girls' and 'Wetlands'. Those were young women oriented subjects, yet filled with sensitive topics. But now he turned his focus towards the screen adaptation of a bestselling satirical novel of the same name about Adolf Hitler. Well, this is not his best work, not a bad movie either.\r\n\r\nQuite fun to watch, but not logical, especially the basic ones. Since it mocks a most hated person in the human history, there's no issues on portraying him in whatever angle they wanted, because nobody cares. Yet the film talked some serious current issues of Germany.\r\n\r\nThis is like when 'Borat' meets 'The Dictator'. A man who wanders around a city looking for some answers. That's none other than Adolf Hitler, who wakes up in the middle of where some young kids showing their football skills for a tv programme. Then he embarks to learn where he's and what year it is. Meets a person who helps him and ultimately end up with some tv guy where they begin their journey throughout the nation making videos before landing in an actual tv show. The man who killed millions of people wants the best for Germany and its people, how he turn things around were narrated in a quite interesting perspective.\r\n\r\nThe initial narratives were like the aimless, that tells us what people think of the Adolf Hitler's return. Looked like most of them were shot like a documentary style, outside the official shooting spots. You can see lots of real people's faces were censored. We know that he wanted to be an artist, but he draws some funny sketches in this. Likewise there are many scenes about his qualities that were dragged in to make fun out of it.\r\n\r\nCan people accept the words of one who is considered a villain. He came from a different timeline, but he quickly absorbs the situation and gives some important tips that should come into force. From the common people's perspective, it is an entertaining product, but from the political viewpoint, there are stuffs to consider severely about.\r\n\r\n> \"When you have rats at home, it is called not a clown but an exterminator.\"\r\n\r\nTo me there's nothing controversial about this theme. When he failed, the final pages of his history book were written by his enemies. Otherwise, there's no difference between him, Alexander and Genghis Khan. Every greatest kings who ever lived on the earth dreamed of conquering the world.\r\n\r\nI think the present world is same, except the form of conquering is changed, like some want to rule the world with their strong economy like the US and some are on their cheap industrial products like China. Like that all the other nations are on the top of the chart with something in what they're good at.\r\n\r\nAdolf Hitler was a politician, not a king, but he had his reasons for his actions. So if we go by the rule books, nothing seems rational. To me this film was a decent entertainer, I just wanted to enjoy what it offers and I think I did. I advise the same that you should not mix up this with the reality. Because that might take us to the unwanted territory.\r\n\r\nHe's the same person who came from the past, but I was keen to know his intentions, especially what the writer intended to draw out of him. Because he's alone, not with his army, so he had no power, but his interaction with people brings up some discussable topics. I'm not a German, but it made me think when he spoke about current issues that Germany is facing. Every nation has to think about its internal affairs to improve it, you can't live forever with the past shame.\r\n\r\nThis film might be a comedy, but you can't ignore some of the points the main character talks. I felt the movie was a double strike where people can have some laughs and in other side to learn the reality of the state. This the best satirical film about Adolf Hitler I've seen after the Charles Chaplin's 'The Great Dictator'.\r\n\r\n7/10", "created_at": "2016-04-14T16:32:21.180Z"}, {"movie_id": 318917, "review_id": "621a922cdd926a004225c29b", "author_rating": 9.0, "review_text": "Masucci delivers a completely realistic and utterly deranged Hitler, which, combined with the real reactions of people on the street, produces hilarious scenes and good comedy. Er ist wieder da!\r\n\r\n9/10", "created_at": "2022-02-26T20:48:44.177Z"}]