[{"movie_id": 315837, "review_id": "58e044e8c3a3683d3e0110b2", "author_rating": 6.0, "review_text": "I am writing this review as someone who hasn't seen the original anime. I have also been very critical of the whitewashing of this film. With that I aside, I went to see it with willingness to give it the benefit of the doubt. \"Ghost in the Shell\" is well...a beautiful shell. \r\n\r\nThe visuals were absolutely breath taking. The action scenes flowed so beautifully with special effects. But that's all the movie had to offer. Take away the spectacles and you have a basic run-of-the-mill action movie. \r\n\r\nThe acting was fine. But honestly, the leads didn't have anything to actually sink their teeth into. Scarjo, and everyone else, was serviceable. \r\n\r\nIf you're looking for some mindless, yet stunning entertainment, then go see it.", "created_at": "2017-04-02T00:25:12.545Z"}, {"movie_id": 315837, "review_id": "58e78fe5c3a368730204ce99", "author_rating": 7.0, "review_text": "I've watched Ghost in the Shell at the cinema 3 days ago, knowing\r\nbeforehand about the controversies that have surrounded this movie for\r\nthe last 6 months or so. Science fiction movies are probably my\r\nfavorite genre and I also enjoyed most of Scarlett's movies for the\r\npast 8-9 years so those two factors were a plus for me going in. \r\n\r\nRegarding the whitewashing business, I think its been blown way, WAY\r\nout of proportion by social justice warriors with nothing better to do\r\nthan drag media attention over whatever they're feeling insecure about\r\nthis month/year. For those of you who might be on the fence about\r\nwatching a Caucasian actress in the role that (supposedly) should've\r\nbeen reserved to an Asian actress, please consider this a NON-MATTER\r\nand watch it anyway. The character she is portraying is SUPPOSED to\r\nlook Caucasian/white. It was the same in the source material and even\r\nthe creator of that anime said so in interviews.\r\n\r\nNow, is the movie any good? In my opinion, yes. Yes it was. It wasn't\r\namazing but at the very least entertaining. There is a good amount of\r\npeople who score this a 1/10 because they are butt hurt that the story\r\nwas changed a lot. Please ignore them and see for yourself even if\r\nyou're a fan of the anime and are able to keep an open mind. I think\r\nmaybe I was able to judge it more objectively because I had zero\r\nknowledge about the story in the anime going in, but, if nothing else,\r\nthe movie actually made me want to watch those old ones to compare.\r\n\r\nThe acting - 7.5/10 - Since Scarlett Johansson is the only big name\r\nthat the movie is being marketed alongside, I'd say she did a good job.\r\nAt no point in the movie could I say she didn't belong there. She\r\nplayed the part of cyborg who had difficulty belonging in a human world\r\nvery well. The cast is diverse enough in my opinion, though some of\r\nthem get pretty little screen time.\r\n\r\nThe visuals - 9/10 - If there is one point most critics/viewers are in\r\nalignment concerning this movie, that point is definitely the visuals.\r\nThe movie both looks and feels spectacular, with the futuristic city\r\nlooking like a close-future mix of Blade Runner and TRON. The\r\ncombination of CGI and practical effects looks organic, the movie's\r\npowerful themes of excessive self-augmentation and technology almost\r\nrunning amok represented very well visually.\r\n\r\nSoundtrack - 8/10 - Sometimes pretty subdued, sometimes\r\nalmost-but-not-quite in your face, I found the soundtrack to vary\r\nbetween decent and very good in some moments. It didn't MAKE the movie\r\nbut it enhanced a good deal in my opinion.\r\n\r\nStory - 7/10 - Here is where the good points of the movie kinda start\r\nto run dry. A lot of other people would probably rate it a lot lower,\r\nwith 5 or 4's if they're at least trying to be objective. Yes, the\r\nstory is fairly predictable, and the fact that the movie is only around\r\n100 minutes long doesn't do it any favors either. Here is probably\r\nwhere most of the legitimate hate towards this movie stems from. The\r\ncreators adapted a story that had a lot more depth and philosophical\r\ninsight and turned it into a somewhat generic cyborg coming of age\r\nstory mixed with an evil corporation doing questionable things. The\r\nvillain is also very cookie-cutter and has almost zero depth. HOWEVER,\r\nI do think that concerning this film's particular themes and narrative,\r\na weak villain doesn't hurt it so much since its more about\r\nlosing/gaining your humanity through technology than any bad guy trying\r\nto shoot you.\r\n\r\nWriting/Dialogue - 6/10 - By far the movie's weakest aspect. In fact, I\r\nbelieve if some more meaningful dialogue and character interactions\r\nwere written into this film, it could've easily been 1 or 2 points\r\nhigher on anyone's scoring system. As it is, the dialogue is shallow\r\nand fairly run-of-the-mill for about half the movie's length. Some bits\r\nof good interactions are sprinkled here and there, and thankfully\r\nthat's enough to preserve the soul of the movie's central theme of\r\nhuman souls surviving in machine bodies, BUT not enough to give Ghost\r\nin the Shell the depth it should've inherited from the source material.\r\n\r\nOverall - I gave this movie 3.5/5 stars here, mostly because I\r\ncouldn't give it a 7.5/10 which felt more appropriate to me. My advice\r\nwould be to not listen to the whitewashing nonsense, because that's\r\nexactly what it is, nonsense. Also don't listen to the haters who rate\r\nthis movie a 1/10 or call it shit because those people should not be\r\nreviewing anything to begin with. It is a decent movie, with great\r\nvisuals and a theme that might get you thinking for a couple of days\r\nafter seeing it. The acting is decent, with an above average\r\nperformance from Scarlett and a good soundtrack that might hit the\r\nright spot on occasion. The only bad aspects, like I mentioned, are the\r\nfilm's rather short running time and weak dialogue/writing which hold\r\nit back from being truly great.", "created_at": "2017-04-07T13:11:01.679Z"}, {"movie_id": 315837, "review_id": "59169693925141580d02a643", "author_rating": 7.0, "review_text": "I know I wasn't supposed to love it but I accidentally did.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-05-13T05:16:03.103Z"}, {"movie_id": 315837, "review_id": "591de0e59251414a57022805", "author_rating": 7.0, "review_text": "I boned up on this movie by watching the 1995 version and Stand Alone Complex for a bit, loved the repartée from Major Kusanagi and her crew and hoped it would translate to the big screen. The movie succeeds in displaying the setting and overall feel of the area. Everything is a grainy, low-tech with abundant neon and cyber-solidified humans. Sadly, the script is a bit of a mess. Kusanagi becomes Major Mira Killian (you'll see why toward the end the film) and Scarlett Johhansson, generally a quite credible actress, is sort of wasted here.\r\n\r\nWe do not get a lot of character development for her or her crewmates. There aren't a lot of quirky, funny moments as there are in the animated versions. Worse still, a lot of the teaser from the movie are just absent here, and one feels cheated. Overall this is a fine bit of popcorn absorption but fails to live up the series's standards and fails to give any of the actors much to work with. See it on a rainy day, if nothing else.\r\n\r\n3.5/5", "created_at": "2017-05-18T17:59:01.693Z"}, {"movie_id": 315837, "review_id": "5979fc6992514107cc015b95", "author_rating": 2.0, "review_text": "I was unable to make it to the theaters for this one due to traveling for work those first two weeks.  And then it was gone; couldn't find it in any theaters. I'm sure glad I didn't waste my money for that and only spent $1.62 to rent it from RedBox.\r\nThe trailer didn't show much, which is good.  I hate trailers that give away everything about a movie.  \r\nSo, a hot girl is always good...   \r\nAnd it had the teaser nudity that isn't real but is a suit - I'll let you be the judge of that.\r\nThe rest is the same old overused nonsense from all other science fiction movies:\r\nA lot of fighting, shooting, explosions and destruction - way too much of that... but just about all sci-fi and superhero movies these days only contain that.\r\nThe first hour was incredibly boring.  After about 70 minutes, it got just slightly interesting and then all the fighting/shooting/destruction began.  There is nothing interesting about that - we've all see that hundreds of times. It's ridiculous.\r\nWhy can't any of these shooters hit anything?  We still have that.  It isn't interesting to watch.  Thousands of rounds flying and everyone missing their target.  With all this high tech stuff, why don't they have more advanced weapons?\r\nI have to say, I was in Arizona earlier this year and fired a handgun for the very first time.  It was a 6-shooter, a Colt \"Peacemaker\", you know the pistol of the \"West\".  You don't \"AIM\" those, you lift them to just above waist high, look at your target & not the gun, and pull the trigger. After just a few shots, it starts to become very natural. Any sane person can hit a target the size of a person at least somewhere on their body, even if they are moving.  24 rounds: I had 24 hits & 0 misses at various distances. But the people in these movies can't hit anything even when they do aim and with much better weapons.  \r\nAnd then you have Major, her manufactured body can stretch & tear, wires breaking, and it can still function?  Uh, NO, it wouldn't.  That's not how mechanics and electronics work.\r\nThe City: a ridiculous \"Blade Runner\"/\"Fifth Element\" type of city but with fish floating around.  No, not interesting at all. Just very silly.\r\nOh, one petty but very annoying thing: They can build an entire body and install a human brain in it and get everything to work but they can only give her a ragged, jagged wig or haircut?  That's very weird.  Her crooked bangs were a distraction in every scene that included her facing the viewer.\r\n\r\nIn Summary: This movie has a lot of awesome CGI with a ridiculous plot and horrible acting.  Great CGI alone doesn't make a great, or even a good, movie.  This catastrophe is a perfect example of that.", "created_at": "2017-07-27T14:44:57.095Z"}, {"movie_id": 315837, "review_id": "59a529e39251412f16006b64", "author_rating": 6.0, "review_text": "This is an okay movie but that is about it. The blurb sounded quite interesting and the trailers were promising even though I always take trailers with a huge pinch of salt. I have never read the original Manga. Whether that is good or bad with respect to the movie I do not know.\r\n\r\nThe good stuff as far as this movie is concerned is, not surprisingly, the visuals. I would not say that they are stunning but the are quite good. The environments are interesting and the special effects are not bad at all. I have to say that the tank design was pretty poor though. Not very exiting as a fictional design and utter nonsense from a functional point of view.\r\n\r\nThis is as far as the good stuff goes. The story is okay but it is pretty predictable and not that much to get exited about. It could have been more developed for sure. I would actually have liked to see the Major do a few more missions beating up the bad guys. That was where the movie shined a bit and showed the best visuals and special effects.\r\n\r\nThe acting is pretty mediocre to be honest. Even Daisuke Aramaki, which was a character that I did like, felt rather bland. The main bad guy was just a uninspiring thug.\r\n\r\nTo me the movie more or less felt like the pilote episode of a TV-show with a huge budget for visuals. It was not WOW god but showed promise and I felt like I would like to see more “episodes”. The fact that it is actually a movie and it seems unlikely that a sequel, even though the ending makes it pretty clear that they hoped there would be one, will be made left me with a unsatisfied feeling.\r\n\r\nBottom line, average movie with enjoyable visuals and special effects but one which do not manage to reach above the “just another sci-fi manga movie” segment for me.", "created_at": "2017-08-29T08:46:27.317Z"}, {"movie_id": 315837, "review_id": "5a77051e0e0a26643c049c90", "author_rating": 5.0, "review_text": "**Too late to come out to impress its fans!**\r\n\r\nIt was not my most anticipated film of the year. Like usual for any film, I just wanted to see it and enjoy it. The film was fine, but that does not mean so good. From the visuals to the performances, it sounded great. But the story wasn't. When the original concept was created nearly 30 years back, it fascinated people for being something new and powerful. But for the current world, for the current generation, it is just an ordinary sci-fi. All I say is it just came out at least 15 years late. So the 90s kids would have loved it!\r\n\r\nThe storyline was nothing, but a self-discovery of a half human, half machine. This has been the plot of hundreds of robot films. But it's just differently told. One of only kind, a human brain was saved after the severe accident and given an artificial body. Now she's known as Major fights the crime. But some day later, she's haunted by glitches in her vision which directly connected to her past that she does not remember. The rest of the film was finding the truth and other consequences, before it all ends.\r\n\r\nVisual effects were the only advantage for this film to come out in the present era. The rest of the film was simply okayish. I don't know what the original source fans say about it, but it is a one time watchable film. Otherwise, there are plenty of similar good films, like this is nothing much different than 'Robocop'. Or the recent TV series 'Westworld'. Scarlett Johansson could become a reason for some people to peek into it. The writing and direction were average. Watch and forget kind of film.\r\n\r\n_5/10_", "created_at": "2018-02-04T13:05:34.972Z"}, {"movie_id": 315837, "review_id": "58e044e8c3a3683d3e0110b2", "author_rating": 6.0, "review_text": "I am writing this review as someone who hasn't seen the original anime. I have also been very critical of the whitewashing of this film. With that I aside, I went to see it with willingness to give it the benefit of the doubt. \"Ghost in the Shell\" is well...a beautiful shell. \r\n\r\nThe visuals were absolutely breath taking. The action scenes flowed so beautifully with special effects. But that's all the movie had to offer. Take away the spectacles and you have a basic run-of-the-mill action movie. \r\n\r\nThe acting was fine. But honestly, the leads didn't have anything to actually sink their teeth into. Scarjo, and everyone else, was serviceable. \r\n\r\nIf you're looking for some mindless, yet stunning entertainment, then go see it.", "created_at": "2017-04-02T00:25:12.545Z"}, {"movie_id": 315837, "review_id": "58e78fe5c3a368730204ce99", "author_rating": 7.0, "review_text": "I've watched Ghost in the Shell at the cinema 3 days ago, knowing\r\nbeforehand about the controversies that have surrounded this movie for\r\nthe last 6 months or so. Science fiction movies are probably my\r\nfavorite genre and I also enjoyed most of Scarlett's movies for the\r\npast 8-9 years so those two factors were a plus for me going in. \r\n\r\nRegarding the whitewashing business, I think its been blown way, WAY\r\nout of proportion by social justice warriors with nothing better to do\r\nthan drag media attention over whatever they're feeling insecure about\r\nthis month/year. For those of you who might be on the fence about\r\nwatching a Caucasian actress in the role that (supposedly) should've\r\nbeen reserved to an Asian actress, please consider this a NON-MATTER\r\nand watch it anyway. The character she is portraying is SUPPOSED to\r\nlook Caucasian/white. It was the same in the source material and even\r\nthe creator of that anime said so in interviews.\r\n\r\nNow, is the movie any good? In my opinion, yes. Yes it was. It wasn't\r\namazing but at the very least entertaining. There is a good amount of\r\npeople who score this a 1/10 because they are butt hurt that the story\r\nwas changed a lot. Please ignore them and see for yourself even if\r\nyou're a fan of the anime and are able to keep an open mind. I think\r\nmaybe I was able to judge it more objectively because I had zero\r\nknowledge about the story in the anime going in, but, if nothing else,\r\nthe movie actually made me want to watch those old ones to compare.\r\n\r\nThe acting - 7.5/10 - Since Scarlett Johansson is the only big name\r\nthat the movie is being marketed alongside, I'd say she did a good job.\r\nAt no point in the movie could I say she didn't belong there. She\r\nplayed the part of cyborg who had difficulty belonging in a human world\r\nvery well. The cast is diverse enough in my opinion, though some of\r\nthem get pretty little screen time.\r\n\r\nThe visuals - 9/10 - If there is one point most critics/viewers are in\r\nalignment concerning this movie, that point is definitely the visuals.\r\nThe movie both looks and feels spectacular, with the futuristic city\r\nlooking like a close-future mix of Blade Runner and TRON. The\r\ncombination of CGI and practical effects looks organic, the movie's\r\npowerful themes of excessive self-augmentation and technology almost\r\nrunning amok represented very well visually.\r\n\r\nSoundtrack - 8/10 - Sometimes pretty subdued, sometimes\r\nalmost-but-not-quite in your face, I found the soundtrack to vary\r\nbetween decent and very good in some moments. It didn't MAKE the movie\r\nbut it enhanced a good deal in my opinion.\r\n\r\nStory - 7/10 - Here is where the good points of the movie kinda start\r\nto run dry. A lot of other people would probably rate it a lot lower,\r\nwith 5 or 4's if they're at least trying to be objective. Yes, the\r\nstory is fairly predictable, and the fact that the movie is only around\r\n100 minutes long doesn't do it any favors either. Here is probably\r\nwhere most of the legitimate hate towards this movie stems from. The\r\ncreators adapted a story that had a lot more depth and philosophical\r\ninsight and turned it into a somewhat generic cyborg coming of age\r\nstory mixed with an evil corporation doing questionable things. The\r\nvillain is also very cookie-cutter and has almost zero depth. HOWEVER,\r\nI do think that concerning this film's particular themes and narrative,\r\na weak villain doesn't hurt it so much since its more about\r\nlosing/gaining your humanity through technology than any bad guy trying\r\nto shoot you.\r\n\r\nWriting/Dialogue - 6/10 - By far the movie's weakest aspect. In fact, I\r\nbelieve if some more meaningful dialogue and character interactions\r\nwere written into this film, it could've easily been 1 or 2 points\r\nhigher on anyone's scoring system. As it is, the dialogue is shallow\r\nand fairly run-of-the-mill for about half the movie's length. Some bits\r\nof good interactions are sprinkled here and there, and thankfully\r\nthat's enough to preserve the soul of the movie's central theme of\r\nhuman souls surviving in machine bodies, BUT not enough to give Ghost\r\nin the Shell the depth it should've inherited from the source material.\r\n\r\nOverall - I gave this movie 3.5/5 stars here, mostly because I\r\ncouldn't give it a 7.5/10 which felt more appropriate to me. My advice\r\nwould be to not listen to the whitewashing nonsense, because that's\r\nexactly what it is, nonsense. Also don't listen to the haters who rate\r\nthis movie a 1/10 or call it shit because those people should not be\r\nreviewing anything to begin with. It is a decent movie, with great\r\nvisuals and a theme that might get you thinking for a couple of days\r\nafter seeing it. The acting is decent, with an above average\r\nperformance from Scarlett and a good soundtrack that might hit the\r\nright spot on occasion. The only bad aspects, like I mentioned, are the\r\nfilm's rather short running time and weak dialogue/writing which hold\r\nit back from being truly great.", "created_at": "2017-04-07T13:11:01.679Z"}, {"movie_id": 315837, "review_id": "59169693925141580d02a643", "author_rating": 7.0, "review_text": "I know I wasn't supposed to love it but I accidentally did.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-05-13T05:16:03.103Z"}, {"movie_id": 315837, "review_id": "591de0e59251414a57022805", "author_rating": 7.0, "review_text": "I boned up on this movie by watching the 1995 version and Stand Alone Complex for a bit, loved the repartée from Major Kusanagi and her crew and hoped it would translate to the big screen. The movie succeeds in displaying the setting and overall feel of the area. Everything is a grainy, low-tech with abundant neon and cyber-solidified humans. Sadly, the script is a bit of a mess. Kusanagi becomes Major Mira Killian (you'll see why toward the end the film) and Scarlett Johhansson, generally a quite credible actress, is sort of wasted here.\r\n\r\nWe do not get a lot of character development for her or her crewmates. There aren't a lot of quirky, funny moments as there are in the animated versions. Worse still, a lot of the teaser from the movie are just absent here, and one feels cheated. Overall this is a fine bit of popcorn absorption but fails to live up the series's standards and fails to give any of the actors much to work with. See it on a rainy day, if nothing else.\r\n\r\n3.5/5", "created_at": "2017-05-18T17:59:01.693Z"}, {"movie_id": 315837, "review_id": "5979fc6992514107cc015b95", "author_rating": 2.0, "review_text": "I was unable to make it to the theaters for this one due to traveling for work those first two weeks.  And then it was gone; couldn't find it in any theaters. I'm sure glad I didn't waste my money for that and only spent $1.62 to rent it from RedBox.\r\nThe trailer didn't show much, which is good.  I hate trailers that give away everything about a movie.  \r\nSo, a hot girl is always good...   \r\nAnd it had the teaser nudity that isn't real but is a suit - I'll let you be the judge of that.\r\nThe rest is the same old overused nonsense from all other science fiction movies:\r\nA lot of fighting, shooting, explosions and destruction - way too much of that... but just about all sci-fi and superhero movies these days only contain that.\r\nThe first hour was incredibly boring.  After about 70 minutes, it got just slightly interesting and then all the fighting/shooting/destruction began.  There is nothing interesting about that - we've all see that hundreds of times. It's ridiculous.\r\nWhy can't any of these shooters hit anything?  We still have that.  It isn't interesting to watch.  Thousands of rounds flying and everyone missing their target.  With all this high tech stuff, why don't they have more advanced weapons?\r\nI have to say, I was in Arizona earlier this year and fired a handgun for the very first time.  It was a 6-shooter, a Colt \"Peacemaker\", you know the pistol of the \"West\".  You don't \"AIM\" those, you lift them to just above waist high, look at your target & not the gun, and pull the trigger. After just a few shots, it starts to become very natural. Any sane person can hit a target the size of a person at least somewhere on their body, even if they are moving.  24 rounds: I had 24 hits & 0 misses at various distances. But the people in these movies can't hit anything even when they do aim and with much better weapons.  \r\nAnd then you have Major, her manufactured body can stretch & tear, wires breaking, and it can still function?  Uh, NO, it wouldn't.  That's not how mechanics and electronics work.\r\nThe City: a ridiculous \"Blade Runner\"/\"Fifth Element\" type of city but with fish floating around.  No, not interesting at all. Just very silly.\r\nOh, one petty but very annoying thing: They can build an entire body and install a human brain in it and get everything to work but they can only give her a ragged, jagged wig or haircut?  That's very weird.  Her crooked bangs were a distraction in every scene that included her facing the viewer.\r\n\r\nIn Summary: This movie has a lot of awesome CGI with a ridiculous plot and horrible acting.  Great CGI alone doesn't make a great, or even a good, movie.  This catastrophe is a perfect example of that.", "created_at": "2017-07-27T14:44:57.095Z"}, {"movie_id": 315837, "review_id": "59a529e39251412f16006b64", "author_rating": 6.0, "review_text": "This is an okay movie but that is about it. The blurb sounded quite interesting and the trailers were promising even though I always take trailers with a huge pinch of salt. I have never read the original Manga. Whether that is good or bad with respect to the movie I do not know.\r\n\r\nThe good stuff as far as this movie is concerned is, not surprisingly, the visuals. I would not say that they are stunning but the are quite good. The environments are interesting and the special effects are not bad at all. I have to say that the tank design was pretty poor though. Not very exiting as a fictional design and utter nonsense from a functional point of view.\r\n\r\nThis is as far as the good stuff goes. The story is okay but it is pretty predictable and not that much to get exited about. It could have been more developed for sure. I would actually have liked to see the Major do a few more missions beating up the bad guys. That was where the movie shined a bit and showed the best visuals and special effects.\r\n\r\nThe acting is pretty mediocre to be honest. Even Daisuke Aramaki, which was a character that I did like, felt rather bland. The main bad guy was just a uninspiring thug.\r\n\r\nTo me the movie more or less felt like the pilote episode of a TV-show with a huge budget for visuals. It was not WOW god but showed promise and I felt like I would like to see more “episodes”. The fact that it is actually a movie and it seems unlikely that a sequel, even though the ending makes it pretty clear that they hoped there would be one, will be made left me with a unsatisfied feeling.\r\n\r\nBottom line, average movie with enjoyable visuals and special effects but one which do not manage to reach above the “just another sci-fi manga movie” segment for me.", "created_at": "2017-08-29T08:46:27.317Z"}, {"movie_id": 315837, "review_id": "5a77051e0e0a26643c049c90", "author_rating": 5.0, "review_text": "**Too late to come out to impress its fans!**\r\n\r\nIt was not my most anticipated film of the year. Like usual for any film, I just wanted to see it and enjoy it. The film was fine, but that does not mean so good. From the visuals to the performances, it sounded great. But the story wasn't. When the original concept was created nearly 30 years back, it fascinated people for being something new and powerful. But for the current world, for the current generation, it is just an ordinary sci-fi. All I say is it just came out at least 15 years late. So the 90s kids would have loved it!\r\n\r\nThe storyline was nothing, but a self-discovery of a half human, half machine. This has been the plot of hundreds of robot films. But it's just differently told. One of only kind, a human brain was saved after the severe accident and given an artificial body. Now she's known as Major fights the crime. But some day later, she's haunted by glitches in her vision which directly connected to her past that she does not remember. The rest of the film was finding the truth and other consequences, before it all ends.\r\n\r\nVisual effects were the only advantage for this film to come out in the present era. The rest of the film was simply okayish. I don't know what the original source fans say about it, but it is a one time watchable film. Otherwise, there are plenty of similar good films, like this is nothing much different than 'Robocop'. Or the recent TV series 'Westworld'. Scarlett Johansson could become a reason for some people to peek into it. The writing and direction were average. Watch and forget kind of film.\r\n\r\n_5/10_", "created_at": "2018-02-04T13:05:34.972Z"}, {"movie_id": 315837, "review_id": "58e044e8c3a3683d3e0110b2", "author_rating": 6.0, "review_text": "I am writing this review as someone who hasn't seen the original anime. I have also been very critical of the whitewashing of this film. With that I aside, I went to see it with willingness to give it the benefit of the doubt. \"Ghost in the Shell\" is well...a beautiful shell. \r\n\r\nThe visuals were absolutely breath taking. The action scenes flowed so beautifully with special effects. But that's all the movie had to offer. Take away the spectacles and you have a basic run-of-the-mill action movie. \r\n\r\nThe acting was fine. But honestly, the leads didn't have anything to actually sink their teeth into. Scarjo, and everyone else, was serviceable. \r\n\r\nIf you're looking for some mindless, yet stunning entertainment, then go see it.", "created_at": "2017-04-02T00:25:12.545Z"}, {"movie_id": 315837, "review_id": "58e78fe5c3a368730204ce99", "author_rating": 7.0, "review_text": "I've watched Ghost in the Shell at the cinema 3 days ago, knowing\r\nbeforehand about the controversies that have surrounded this movie for\r\nthe last 6 months or so. Science fiction movies are probably my\r\nfavorite genre and I also enjoyed most of Scarlett's movies for the\r\npast 8-9 years so those two factors were a plus for me going in. \r\n\r\nRegarding the whitewashing business, I think its been blown way, WAY\r\nout of proportion by social justice warriors with nothing better to do\r\nthan drag media attention over whatever they're feeling insecure about\r\nthis month/year. For those of you who might be on the fence about\r\nwatching a Caucasian actress in the role that (supposedly) should've\r\nbeen reserved to an Asian actress, please consider this a NON-MATTER\r\nand watch it anyway. The character she is portraying is SUPPOSED to\r\nlook Caucasian/white. It was the same in the source material and even\r\nthe creator of that anime said so in interviews.\r\n\r\nNow, is the movie any good? In my opinion, yes. Yes it was. It wasn't\r\namazing but at the very least entertaining. There is a good amount of\r\npeople who score this a 1/10 because they are butt hurt that the story\r\nwas changed a lot. Please ignore them and see for yourself even if\r\nyou're a fan of the anime and are able to keep an open mind. I think\r\nmaybe I was able to judge it more objectively because I had zero\r\nknowledge about the story in the anime going in, but, if nothing else,\r\nthe movie actually made me want to watch those old ones to compare.\r\n\r\nThe acting - 7.5/10 - Since Scarlett Johansson is the only big name\r\nthat the movie is being marketed alongside, I'd say she did a good job.\r\nAt no point in the movie could I say she didn't belong there. She\r\nplayed the part of cyborg who had difficulty belonging in a human world\r\nvery well. The cast is diverse enough in my opinion, though some of\r\nthem get pretty little screen time.\r\n\r\nThe visuals - 9/10 - If there is one point most critics/viewers are in\r\nalignment concerning this movie, that point is definitely the visuals.\r\nThe movie both looks and feels spectacular, with the futuristic city\r\nlooking like a close-future mix of Blade Runner and TRON. The\r\ncombination of CGI and practical effects looks organic, the movie's\r\npowerful themes of excessive self-augmentation and technology almost\r\nrunning amok represented very well visually.\r\n\r\nSoundtrack - 8/10 - Sometimes pretty subdued, sometimes\r\nalmost-but-not-quite in your face, I found the soundtrack to vary\r\nbetween decent and very good in some moments. It didn't MAKE the movie\r\nbut it enhanced a good deal in my opinion.\r\n\r\nStory - 7/10 - Here is where the good points of the movie kinda start\r\nto run dry. A lot of other people would probably rate it a lot lower,\r\nwith 5 or 4's if they're at least trying to be objective. Yes, the\r\nstory is fairly predictable, and the fact that the movie is only around\r\n100 minutes long doesn't do it any favors either. Here is probably\r\nwhere most of the legitimate hate towards this movie stems from. The\r\ncreators adapted a story that had a lot more depth and philosophical\r\ninsight and turned it into a somewhat generic cyborg coming of age\r\nstory mixed with an evil corporation doing questionable things. The\r\nvillain is also very cookie-cutter and has almost zero depth. HOWEVER,\r\nI do think that concerning this film's particular themes and narrative,\r\na weak villain doesn't hurt it so much since its more about\r\nlosing/gaining your humanity through technology than any bad guy trying\r\nto shoot you.\r\n\r\nWriting/Dialogue - 6/10 - By far the movie's weakest aspect. In fact, I\r\nbelieve if some more meaningful dialogue and character interactions\r\nwere written into this film, it could've easily been 1 or 2 points\r\nhigher on anyone's scoring system. As it is, the dialogue is shallow\r\nand fairly run-of-the-mill for about half the movie's length. Some bits\r\nof good interactions are sprinkled here and there, and thankfully\r\nthat's enough to preserve the soul of the movie's central theme of\r\nhuman souls surviving in machine bodies, BUT not enough to give Ghost\r\nin the Shell the depth it should've inherited from the source material.\r\n\r\nOverall - I gave this movie 3.5/5 stars here, mostly because I\r\ncouldn't give it a 7.5/10 which felt more appropriate to me. My advice\r\nwould be to not listen to the whitewashing nonsense, because that's\r\nexactly what it is, nonsense. Also don't listen to the haters who rate\r\nthis movie a 1/10 or call it shit because those people should not be\r\nreviewing anything to begin with. It is a decent movie, with great\r\nvisuals and a theme that might get you thinking for a couple of days\r\nafter seeing it. The acting is decent, with an above average\r\nperformance from Scarlett and a good soundtrack that might hit the\r\nright spot on occasion. The only bad aspects, like I mentioned, are the\r\nfilm's rather short running time and weak dialogue/writing which hold\r\nit back from being truly great.", "created_at": "2017-04-07T13:11:01.679Z"}, {"movie_id": 315837, "review_id": "59169693925141580d02a643", "author_rating": 7.0, "review_text": "I know I wasn't supposed to love it but I accidentally did.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-05-13T05:16:03.103Z"}, {"movie_id": 315837, "review_id": "591de0e59251414a57022805", "author_rating": 7.0, "review_text": "I boned up on this movie by watching the 1995 version and Stand Alone Complex for a bit, loved the repartée from Major Kusanagi and her crew and hoped it would translate to the big screen. The movie succeeds in displaying the setting and overall feel of the area. Everything is a grainy, low-tech with abundant neon and cyber-solidified humans. Sadly, the script is a bit of a mess. Kusanagi becomes Major Mira Killian (you'll see why toward the end the film) and Scarlett Johhansson, generally a quite credible actress, is sort of wasted here.\r\n\r\nWe do not get a lot of character development for her or her crewmates. There aren't a lot of quirky, funny moments as there are in the animated versions. Worse still, a lot of the teaser from the movie are just absent here, and one feels cheated. Overall this is a fine bit of popcorn absorption but fails to live up the series's standards and fails to give any of the actors much to work with. See it on a rainy day, if nothing else.\r\n\r\n3.5/5", "created_at": "2017-05-18T17:59:01.693Z"}, {"movie_id": 315837, "review_id": "5979fc6992514107cc015b95", "author_rating": 2.0, "review_text": "I was unable to make it to the theaters for this one due to traveling for work those first two weeks.  And then it was gone; couldn't find it in any theaters. I'm sure glad I didn't waste my money for that and only spent $1.62 to rent it from RedBox.\r\nThe trailer didn't show much, which is good.  I hate trailers that give away everything about a movie.  \r\nSo, a hot girl is always good...   \r\nAnd it had the teaser nudity that isn't real but is a suit - I'll let you be the judge of that.\r\nThe rest is the same old overused nonsense from all other science fiction movies:\r\nA lot of fighting, shooting, explosions and destruction - way too much of that... but just about all sci-fi and superhero movies these days only contain that.\r\nThe first hour was incredibly boring.  After about 70 minutes, it got just slightly interesting and then all the fighting/shooting/destruction began.  There is nothing interesting about that - we've all see that hundreds of times. It's ridiculous.\r\nWhy can't any of these shooters hit anything?  We still have that.  It isn't interesting to watch.  Thousands of rounds flying and everyone missing their target.  With all this high tech stuff, why don't they have more advanced weapons?\r\nI have to say, I was in Arizona earlier this year and fired a handgun for the very first time.  It was a 6-shooter, a Colt \"Peacemaker\", you know the pistol of the \"West\".  You don't \"AIM\" those, you lift them to just above waist high, look at your target & not the gun, and pull the trigger. After just a few shots, it starts to become very natural. Any sane person can hit a target the size of a person at least somewhere on their body, even if they are moving.  24 rounds: I had 24 hits & 0 misses at various distances. But the people in these movies can't hit anything even when they do aim and with much better weapons.  \r\nAnd then you have Major, her manufactured body can stretch & tear, wires breaking, and it can still function?  Uh, NO, it wouldn't.  That's not how mechanics and electronics work.\r\nThe City: a ridiculous \"Blade Runner\"/\"Fifth Element\" type of city but with fish floating around.  No, not interesting at all. Just very silly.\r\nOh, one petty but very annoying thing: They can build an entire body and install a human brain in it and get everything to work but they can only give her a ragged, jagged wig or haircut?  That's very weird.  Her crooked bangs were a distraction in every scene that included her facing the viewer.\r\n\r\nIn Summary: This movie has a lot of awesome CGI with a ridiculous plot and horrible acting.  Great CGI alone doesn't make a great, or even a good, movie.  This catastrophe is a perfect example of that.", "created_at": "2017-07-27T14:44:57.095Z"}, {"movie_id": 315837, "review_id": "59a529e39251412f16006b64", "author_rating": 6.0, "review_text": "This is an okay movie but that is about it. The blurb sounded quite interesting and the trailers were promising even though I always take trailers with a huge pinch of salt. I have never read the original Manga. Whether that is good or bad with respect to the movie I do not know.\r\n\r\nThe good stuff as far as this movie is concerned is, not surprisingly, the visuals. I would not say that they are stunning but the are quite good. The environments are interesting and the special effects are not bad at all. I have to say that the tank design was pretty poor though. Not very exiting as a fictional design and utter nonsense from a functional point of view.\r\n\r\nThis is as far as the good stuff goes. The story is okay but it is pretty predictable and not that much to get exited about. It could have been more developed for sure. I would actually have liked to see the Major do a few more missions beating up the bad guys. That was where the movie shined a bit and showed the best visuals and special effects.\r\n\r\nThe acting is pretty mediocre to be honest. Even Daisuke Aramaki, which was a character that I did like, felt rather bland. The main bad guy was just a uninspiring thug.\r\n\r\nTo me the movie more or less felt like the pilote episode of a TV-show with a huge budget for visuals. It was not WOW god but showed promise and I felt like I would like to see more “episodes”. The fact that it is actually a movie and it seems unlikely that a sequel, even though the ending makes it pretty clear that they hoped there would be one, will be made left me with a unsatisfied feeling.\r\n\r\nBottom line, average movie with enjoyable visuals and special effects but one which do not manage to reach above the “just another sci-fi manga movie” segment for me.", "created_at": "2017-08-29T08:46:27.317Z"}, {"movie_id": 315837, "review_id": "5a77051e0e0a26643c049c90", "author_rating": 5.0, "review_text": "**Too late to come out to impress its fans!**\r\n\r\nIt was not my most anticipated film of the year. Like usual for any film, I just wanted to see it and enjoy it. The film was fine, but that does not mean so good. From the visuals to the performances, it sounded great. But the story wasn't. When the original concept was created nearly 30 years back, it fascinated people for being something new and powerful. But for the current world, for the current generation, it is just an ordinary sci-fi. All I say is it just came out at least 15 years late. So the 90s kids would have loved it!\r\n\r\nThe storyline was nothing, but a self-discovery of a half human, half machine. This has been the plot of hundreds of robot films. But it's just differently told. One of only kind, a human brain was saved after the severe accident and given an artificial body. Now she's known as Major fights the crime. But some day later, she's haunted by glitches in her vision which directly connected to her past that she does not remember. The rest of the film was finding the truth and other consequences, before it all ends.\r\n\r\nVisual effects were the only advantage for this film to come out in the present era. The rest of the film was simply okayish. I don't know what the original source fans say about it, but it is a one time watchable film. Otherwise, there are plenty of similar good films, like this is nothing much different than 'Robocop'. Or the recent TV series 'Westworld'. Scarlett Johansson could become a reason for some people to peek into it. The writing and direction were average. Watch and forget kind of film.\r\n\r\n_5/10_", "created_at": "2018-02-04T13:05:34.972Z"}, {"movie_id": 315837, "review_id": "58e044e8c3a3683d3e0110b2", "author_rating": 6.0, "review_text": "I am writing this review as someone who hasn't seen the original anime. I have also been very critical of the whitewashing of this film. With that I aside, I went to see it with willingness to give it the benefit of the doubt. \"Ghost in the Shell\" is well...a beautiful shell. \r\n\r\nThe visuals were absolutely breath taking. The action scenes flowed so beautifully with special effects. But that's all the movie had to offer. Take away the spectacles and you have a basic run-of-the-mill action movie. \r\n\r\nThe acting was fine. But honestly, the leads didn't have anything to actually sink their teeth into. Scarjo, and everyone else, was serviceable. \r\n\r\nIf you're looking for some mindless, yet stunning entertainment, then go see it.", "created_at": "2017-04-02T00:25:12.545Z"}, {"movie_id": 315837, "review_id": "58e78fe5c3a368730204ce99", "author_rating": 7.0, "review_text": "I've watched Ghost in the Shell at the cinema 3 days ago, knowing\r\nbeforehand about the controversies that have surrounded this movie for\r\nthe last 6 months or so. Science fiction movies are probably my\r\nfavorite genre and I also enjoyed most of Scarlett's movies for the\r\npast 8-9 years so those two factors were a plus for me going in. \r\n\r\nRegarding the whitewashing business, I think its been blown way, WAY\r\nout of proportion by social justice warriors with nothing better to do\r\nthan drag media attention over whatever they're feeling insecure about\r\nthis month/year. For those of you who might be on the fence about\r\nwatching a Caucasian actress in the role that (supposedly) should've\r\nbeen reserved to an Asian actress, please consider this a NON-MATTER\r\nand watch it anyway. The character she is portraying is SUPPOSED to\r\nlook Caucasian/white. It was the same in the source material and even\r\nthe creator of that anime said so in interviews.\r\n\r\nNow, is the movie any good? In my opinion, yes. Yes it was. It wasn't\r\namazing but at the very least entertaining. There is a good amount of\r\npeople who score this a 1/10 because they are butt hurt that the story\r\nwas changed a lot. Please ignore them and see for yourself even if\r\nyou're a fan of the anime and are able to keep an open mind. I think\r\nmaybe I was able to judge it more objectively because I had zero\r\nknowledge about the story in the anime going in, but, if nothing else,\r\nthe movie actually made me want to watch those old ones to compare.\r\n\r\nThe acting - 7.5/10 - Since Scarlett Johansson is the only big name\r\nthat the movie is being marketed alongside, I'd say she did a good job.\r\nAt no point in the movie could I say she didn't belong there. She\r\nplayed the part of cyborg who had difficulty belonging in a human world\r\nvery well. The cast is diverse enough in my opinion, though some of\r\nthem get pretty little screen time.\r\n\r\nThe visuals - 9/10 - If there is one point most critics/viewers are in\r\nalignment concerning this movie, that point is definitely the visuals.\r\nThe movie both looks and feels spectacular, with the futuristic city\r\nlooking like a close-future mix of Blade Runner and TRON. The\r\ncombination of CGI and practical effects looks organic, the movie's\r\npowerful themes of excessive self-augmentation and technology almost\r\nrunning amok represented very well visually.\r\n\r\nSoundtrack - 8/10 - Sometimes pretty subdued, sometimes\r\nalmost-but-not-quite in your face, I found the soundtrack to vary\r\nbetween decent and very good in some moments. It didn't MAKE the movie\r\nbut it enhanced a good deal in my opinion.\r\n\r\nStory - 7/10 - Here is where the good points of the movie kinda start\r\nto run dry. A lot of other people would probably rate it a lot lower,\r\nwith 5 or 4's if they're at least trying to be objective. Yes, the\r\nstory is fairly predictable, and the fact that the movie is only around\r\n100 minutes long doesn't do it any favors either. Here is probably\r\nwhere most of the legitimate hate towards this movie stems from. The\r\ncreators adapted a story that had a lot more depth and philosophical\r\ninsight and turned it into a somewhat generic cyborg coming of age\r\nstory mixed with an evil corporation doing questionable things. The\r\nvillain is also very cookie-cutter and has almost zero depth. HOWEVER,\r\nI do think that concerning this film's particular themes and narrative,\r\na weak villain doesn't hurt it so much since its more about\r\nlosing/gaining your humanity through technology than any bad guy trying\r\nto shoot you.\r\n\r\nWriting/Dialogue - 6/10 - By far the movie's weakest aspect. In fact, I\r\nbelieve if some more meaningful dialogue and character interactions\r\nwere written into this film, it could've easily been 1 or 2 points\r\nhigher on anyone's scoring system. As it is, the dialogue is shallow\r\nand fairly run-of-the-mill for about half the movie's length. Some bits\r\nof good interactions are sprinkled here and there, and thankfully\r\nthat's enough to preserve the soul of the movie's central theme of\r\nhuman souls surviving in machine bodies, BUT not enough to give Ghost\r\nin the Shell the depth it should've inherited from the source material.\r\n\r\nOverall - I gave this movie 3.5/5 stars here, mostly because I\r\ncouldn't give it a 7.5/10 which felt more appropriate to me. My advice\r\nwould be to not listen to the whitewashing nonsense, because that's\r\nexactly what it is, nonsense. Also don't listen to the haters who rate\r\nthis movie a 1/10 or call it shit because those people should not be\r\nreviewing anything to begin with. It is a decent movie, with great\r\nvisuals and a theme that might get you thinking for a couple of days\r\nafter seeing it. The acting is decent, with an above average\r\nperformance from Scarlett and a good soundtrack that might hit the\r\nright spot on occasion. The only bad aspects, like I mentioned, are the\r\nfilm's rather short running time and weak dialogue/writing which hold\r\nit back from being truly great.", "created_at": "2017-04-07T13:11:01.679Z"}, {"movie_id": 315837, "review_id": "59169693925141580d02a643", "author_rating": 7.0, "review_text": "I know I wasn't supposed to love it but I accidentally did.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-05-13T05:16:03.103Z"}, {"movie_id": 315837, "review_id": "591de0e59251414a57022805", "author_rating": 7.0, "review_text": "I boned up on this movie by watching the 1995 version and Stand Alone Complex for a bit, loved the repartée from Major Kusanagi and her crew and hoped it would translate to the big screen. The movie succeeds in displaying the setting and overall feel of the area. Everything is a grainy, low-tech with abundant neon and cyber-solidified humans. Sadly, the script is a bit of a mess. Kusanagi becomes Major Mira Killian (you'll see why toward the end the film) and Scarlett Johhansson, generally a quite credible actress, is sort of wasted here.\r\n\r\nWe do not get a lot of character development for her or her crewmates. There aren't a lot of quirky, funny moments as there are in the animated versions. Worse still, a lot of the teaser from the movie are just absent here, and one feels cheated. Overall this is a fine bit of popcorn absorption but fails to live up the series's standards and fails to give any of the actors much to work with. See it on a rainy day, if nothing else.\r\n\r\n3.5/5", "created_at": "2017-05-18T17:59:01.693Z"}, {"movie_id": 315837, "review_id": "5979fc6992514107cc015b95", "author_rating": 2.0, "review_text": "I was unable to make it to the theaters for this one due to traveling for work those first two weeks.  And then it was gone; couldn't find it in any theaters. I'm sure glad I didn't waste my money for that and only spent $1.62 to rent it from RedBox.\r\nThe trailer didn't show much, which is good.  I hate trailers that give away everything about a movie.  \r\nSo, a hot girl is always good...   \r\nAnd it had the teaser nudity that isn't real but is a suit - I'll let you be the judge of that.\r\nThe rest is the same old overused nonsense from all other science fiction movies:\r\nA lot of fighting, shooting, explosions and destruction - way too much of that... but just about all sci-fi and superhero movies these days only contain that.\r\nThe first hour was incredibly boring.  After about 70 minutes, it got just slightly interesting and then all the fighting/shooting/destruction began.  There is nothing interesting about that - we've all see that hundreds of times. It's ridiculous.\r\nWhy can't any of these shooters hit anything?  We still have that.  It isn't interesting to watch.  Thousands of rounds flying and everyone missing their target.  With all this high tech stuff, why don't they have more advanced weapons?\r\nI have to say, I was in Arizona earlier this year and fired a handgun for the very first time.  It was a 6-shooter, a Colt \"Peacemaker\", you know the pistol of the \"West\".  You don't \"AIM\" those, you lift them to just above waist high, look at your target & not the gun, and pull the trigger. After just a few shots, it starts to become very natural. Any sane person can hit a target the size of a person at least somewhere on their body, even if they are moving.  24 rounds: I had 24 hits & 0 misses at various distances. But the people in these movies can't hit anything even when they do aim and with much better weapons.  \r\nAnd then you have Major, her manufactured body can stretch & tear, wires breaking, and it can still function?  Uh, NO, it wouldn't.  That's not how mechanics and electronics work.\r\nThe City: a ridiculous \"Blade Runner\"/\"Fifth Element\" type of city but with fish floating around.  No, not interesting at all. Just very silly.\r\nOh, one petty but very annoying thing: They can build an entire body and install a human brain in it and get everything to work but they can only give her a ragged, jagged wig or haircut?  That's very weird.  Her crooked bangs were a distraction in every scene that included her facing the viewer.\r\n\r\nIn Summary: This movie has a lot of awesome CGI with a ridiculous plot and horrible acting.  Great CGI alone doesn't make a great, or even a good, movie.  This catastrophe is a perfect example of that.", "created_at": "2017-07-27T14:44:57.095Z"}, {"movie_id": 315837, "review_id": "59a529e39251412f16006b64", "author_rating": 6.0, "review_text": "This is an okay movie but that is about it. The blurb sounded quite interesting and the trailers were promising even though I always take trailers with a huge pinch of salt. I have never read the original Manga. Whether that is good or bad with respect to the movie I do not know.\r\n\r\nThe good stuff as far as this movie is concerned is, not surprisingly, the visuals. I would not say that they are stunning but the are quite good. The environments are interesting and the special effects are not bad at all. I have to say that the tank design was pretty poor though. Not very exiting as a fictional design and utter nonsense from a functional point of view.\r\n\r\nThis is as far as the good stuff goes. The story is okay but it is pretty predictable and not that much to get exited about. It could have been more developed for sure. I would actually have liked to see the Major do a few more missions beating up the bad guys. That was where the movie shined a bit and showed the best visuals and special effects.\r\n\r\nThe acting is pretty mediocre to be honest. Even Daisuke Aramaki, which was a character that I did like, felt rather bland. The main bad guy was just a uninspiring thug.\r\n\r\nTo me the movie more or less felt like the pilote episode of a TV-show with a huge budget for visuals. It was not WOW god but showed promise and I felt like I would like to see more “episodes”. The fact that it is actually a movie and it seems unlikely that a sequel, even though the ending makes it pretty clear that they hoped there would be one, will be made left me with a unsatisfied feeling.\r\n\r\nBottom line, average movie with enjoyable visuals and special effects but one which do not manage to reach above the “just another sci-fi manga movie” segment for me.", "created_at": "2017-08-29T08:46:27.317Z"}, {"movie_id": 315837, "review_id": "5a77051e0e0a26643c049c90", "author_rating": 5.0, "review_text": "**Too late to come out to impress its fans!**\r\n\r\nIt was not my most anticipated film of the year. Like usual for any film, I just wanted to see it and enjoy it. The film was fine, but that does not mean so good. From the visuals to the performances, it sounded great. But the story wasn't. When the original concept was created nearly 30 years back, it fascinated people for being something new and powerful. But for the current world, for the current generation, it is just an ordinary sci-fi. All I say is it just came out at least 15 years late. So the 90s kids would have loved it!\r\n\r\nThe storyline was nothing, but a self-discovery of a half human, half machine. This has been the plot of hundreds of robot films. But it's just differently told. One of only kind, a human brain was saved after the severe accident and given an artificial body. Now she's known as Major fights the crime. But some day later, she's haunted by glitches in her vision which directly connected to her past that she does not remember. The rest of the film was finding the truth and other consequences, before it all ends.\r\n\r\nVisual effects were the only advantage for this film to come out in the present era. The rest of the film was simply okayish. I don't know what the original source fans say about it, but it is a one time watchable film. Otherwise, there are plenty of similar good films, like this is nothing much different than 'Robocop'. Or the recent TV series 'Westworld'. Scarlett Johansson could become a reason for some people to peek into it. The writing and direction were average. Watch and forget kind of film.\r\n\r\n_5/10_", "created_at": "2018-02-04T13:05:34.972Z"}]