[{"movie_id": 11013, "review_id": "5ab7eaa9925141395501e8c7", "author_rating": 5.0, "review_text": "Dominance and submission at the office (um... no)\r\n\r\nRELEASED IN 2002 and directed by Steven Shainberg, \"Secretary\" is a romantic dramedy about a young woman (Maggie Gyllenhaal) who spent some time at a mental hospital for self-harm (e.g. cutting). She apprehends a job as a secretary to a quirky, arduous lawyer (James Spader) wherein their employer-employee bond turns increasingly sexual in a dominant/submissive way.\r\n\r\nThis is the first mainline film in America to breach the difficult topic of BDSM, walking the balance beam between being either too amusing or too offensive. For those not in the know, BDSM is an overlap of acronyms: BD stands for Bondage and Discipline; DS for Dominance and Submission; and SM for Sadism and Masochism. I didn’t really know the movie tackled BDSM before viewing it; I thought it was simply a romance-in-the-office type flick with maybe some kinky elements. \r\n\r\nThe movie is polarizing, unsurprisingly. I read a few reviews by respectable critics and one was fascinated by it, giving it an incredible 10/10 Stars (Why Sure!), while another wrote it off as a film for sick people, granting it 1/10 Stars. Whilst I find the romance-at-the-office element interesting, I could care less about the BDSM angle. Regardless, the first half is amusing enough and Maggie is a winsome treat, but the second half gets a little too deviant and borders on porn. \r\n\r\nYet the movie ends well with a well-intentioned message: This is a story about two people who have an affinity for DS that find each other and their relationship may or may not work (no spoilers). I suppose the movie is trying to get across that pain can be therapeutic as long as it's applied by the right hand with the right intention. Thus two people with an affinity for BDSM can develop a relationship that works, for them. But not me; no thanks.                                       \r\n\r\nTHE MOVIE RUNS 1 hour 47 minutes and was shot in Los Angeles. WRITERS: Mary Gaitskill (short story) and Erin Cressida Wilson & Shainberg (screenplay).  \r\n\r\nGRADE: C-", "created_at": "2018-03-25T18:30:01.423Z"}]