[{"movie_id": 23963, "review_id": "59647938c3a368265d100f8d", "author_rating": null, "review_text": "Upon watching this film for a second time I realized just how much it reminded me of the famous \"War of the Worlds\" radio broadcast Orson Welles aired in 1939. With just the medium of radio he successfully created an atmosphere of panic so real people listening (who had not caught the beginning where it stated that the following was a radio drama) fled their homes thinking aliens from Mars had invaded Grovers Mill, New Jersey!\r\n\r\n\"Pontypool\" takes place almost exclusively inside a small radio station in the town of Pontypool, Ontario Canada. What starts out as an ordinary day slowly morphs into an extraordinary situation told almost entirely through eye witness call ins, a weather reporters sky view, and eventually the towns doctor who has a preposterous yet undeniably believable theory as to what is going on.\r\n\r\nDirector Bruce McDonald and writer Tony Burgess expertly create an atmosphere of frustration, disbelief, and panic all within the confines of a single set. Never once did I feel limited by not seeing what was going on outside. Like the aforementioned \"War of the Worlds\" radio drama, the situation unfolds by audio reports coupled with the unexpected entrance of the doctor.\r\n\r\nFor blood and gore fans there is a scene that is both shocking and heartbreaking. But this film is generally not for that audience... unless they have good imaginations and can be taken in by \"eyewitness\" accounts of brutality.\r\n\r\nThe other part of the tale that is refreshing is that the antagonism that is affecting the outside world is not a virus nor is it the dead come back to life. No... it is something... as the doctor explains... preposterous yet undeniably believable.\r\n\r\nThe casting of Stephen McHattie as the past his prime but not ready to go quietly DJ was a masterstroke. He brings to life Grant Mazzy in a way I cannot imagine another doing as perfectly. He mixes a jaded world view with pathos, anger, humor, and a just the right touch of madness as all around him slides into madness.\r\n\r\nIt is to be noted that in the IMDB trivia section, the writer admits to being heavily influenced by Orson Welles legendary radio drama when conceiving first the book, then radio broadcast, and finally film. It shows, as stated, and it shows gloriously.", "created_at": "2017-07-11T07:07:36.977Z"}]