[{"movie_id": 97370, "review_id": "562de925c3a3681b6100a569", "author_rating": 6.0, "review_text": "Johansson makes a great performance in an unlikely role, adding great sensuality to the film, even with her very different looking.\r\n\r\nThe story and movie on itself is a rarety. Very fresh but, also, kind of an unfinished joke.", "created_at": "2015-10-26T08:49:41.991Z"}, {"movie_id": 97370, "review_id": "57a8dc50c3a368254e0094ea", "author_rating": 9.0, "review_text": "This was a very bizarre and unique viewing experience for me. I greatly enjoy cinematic puzzles, and directors who have the wherewithal, guts and personal integrity to stick to their guns and project their distinct visions without caving in to corporate pressure or normal sensibilities. It is work like this at the cinematic vanguard that makes cinema the most aesthetic of all art forms and the greatest and most intrinsically satisfying component of my life. Though I have Glazer's previous two films, I have sadly not seen them yet, a condition I hope to remedy as soon as possible. A woman and actress of Johansson's beauty is perhaps one of only a select few currently out there who could pull this sort of thing off. And yes, this would make a remarkable double bill with 'The Man Who Fell to Earth'.", "created_at": "2016-08-08T19:24:00.220Z"}, {"movie_id": 97370, "review_id": "5851a4dec3a36827a5018566", "author_rating": 6.0, "review_text": "**The lady from the white van.**\r\n\r\nFirst of all, this is not an entertaining film, but an alien theme on a fictional plot like how they would come live among us. Before that, they need to look like us, so they steal human skins and that's what this film is about. Most of the film was in a van driving around in the Scottland. An alien disguised as a human, looking for the single men in the uncrowded places to seduce and steal their skins. But one day after got curious about being a human being, her routine work gets affected seriously and so what happens to her after is told in the remaining film.\r\n\r\nIt's certainly not the film I was looking for. That's the reason I did not watch it when it got out. But I kind of liked it, it was not as boring as the others advised me. Usually films are for pleasure and timepass and this film did not have those qualities. Hence it financially failed. Surely some people would enjoy it, particularly the critics praised it which is unusual.\r\n\r\nFrom the director of 'Birth', Scarlett Johansson in the lead and she was the only good thing in it. The story was a little complicated, so not everybody going the get it, not at the first glance, but if you do, you will enjoy it. The locations were awesome. Watching it on the cold stormy day brought me that original Scottish atmosphere here. I should have rated it better, but no regret for what I gave for it. Its not a suggestible kind, though worth a watch if you're fed up with the regular commercial films.\r\n\r\n_6/10_", "created_at": "2016-12-14T20:00:30.569Z"}, {"movie_id": 97370, "review_id": "59294e42c3a36877ee04a49c", "author_rating": 1.0, "review_text": "A total artistic wank piece. The plot moves at a glacial speed, thanks to all the filler in it. Sure, it's about a curious alien living among humans and consuming them in some mysterious black fluid that only said alien can walk on.\r\n\r\nOther than that, it is absolutely boring as hell and totally lacking in any amount of entertainment. The cinematography itself is great though only in some limited moments. I have a thing for beautiful landscapes but let's be realistic, I watch National Geographic and BBC documentaries for that. Otherwise, a lengthy look out in thick white fog from within a motor vehicle is not my idea of an entertaining nor intriguing scene.\r\n\r\nIn short. Absolute rubbish. After the first five minutes, I realised the glacial pace of this film and watched it at 8x playback speed to try and find some semblance of a climax. Nup, nothing.\r\n\r\nDon't waste your time. It failed financially and if you dare to still watch it, you will realise why.", "created_at": "2017-05-27T10:00:34.453Z"}]