[{"movie_id": 447404, "review_id": "5cd40f4d0e0a265dee60ddde", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI’m going to write it straight away: I didn’t enjoy Pokémon Detective Pikachu as much as I wanted to. In some ways, it disappointed me. Now, you’re probably thinking “oh, he’s one of those people who never saw or played Pokémon in his life, and now he’s going to destroy the film because he never understood it”. Not even close. There are always three groups of people when it comes to these famous franchises that have massive fandoms: the hardcore fans who follow the respective saga since it was created and never once stopped supporting it; the fans who like or even love it, but either skipped or gave up at a certain point in time; the non-fans who never really got into it and don’t relate to any of what the previous two groups do.\r\n\r\nI belong to the second group. I’m a fan of Pokémon, but since the end of the last decade that I stopped playing its video games and watching any series or movies about it. Nevertheless, I’m always as fair and impartial as possible to films and to the people who gave their all to deliver a great story. For hardcore fans, this movie might have everything you’ve ever wished for. Even I was able to understand that some scenes are filled (and I mean literally the whole screen) with references and Easter Eggs that the most dedicated fans will absolutely love. These moments alone can make you enjoy this film way more than fans like me.\r\n\r\nHowever, we all know that while these sequences look fantastic and offer a lot of excitement, they are not enough to hold a narrative together or make it captivating. The Pokémons are gorgeous, and I found myself constantly in awe! Live-action will always have that crowd of haters that think the animated versions should stay animated, no matter what. There will always be people hating on these type of movies solely by the fact that they’re live-action. Honestly, I try very hard, but I can’t understand how people find an incredibly realistic Pikachu ugly or disgusting when it looks absolutely adorable and visually impressive. This will be such a long and exhausting debate throughout the 2020s, every time a live-action remake or adaptation is released, but I have faith people will come to accept it or even love it eventually.\r\n\r\nDetective Pikachu main issues are the screenplay and most of the characters, no doubt about it. I understand that the production team had to shift the primary focus to the VFX regarding the actual Pokémons since a lot of the viewers will buy the ticket only to watch a beautiful real world filled with them, but the two pillars of any film should never be kept aside for too long: story and characters. Justice Smith portrays the only human character that has a compelling backstory and a likable personality. Yes, Kathryn Newton (Lucy Stevens) delivers a good performance, and she also might interpret a character that a lot of people can relate to, but from the moment Lucy has more to do in the movie, it’s like her development stagnated. However, Smith is brilliant as Tim and he showed a great range of emotions, making me not only laugh but also feel a bit emotional.\r\n\r\nSadly, these two are the only human characters that aren’t either a cliche villain who wants to rule the world or a paper-thin police or scientist who only serve as exposition devices. Honestly, this might be one of the most exposition-driven films of 2019. The amount of cheap and lazy information dumps spread across the runtime is too much to handle, especially when the same info is repeated several times. It unbalances the pacing and even the tone of the movie, making it dull during some periods. I’m rarely the guy who “wants more action”, but Detective Pikachu really needed more thrilling moments, preferably involving Pokémon. Of the few action sequences, most are just our protagonists running from something and jumping from cliffs. Very rarely we see actual Pokémons doing anything until the last act.\r\n\r\nRob Letterman shows that he has a lot of great qualities that a director should have, but he needs to work on his flaws and leave the screenwriting role to more experienced people. For such a mystery-driven story, the “mystery” part is pretty evident from the get-go, with a notable exception at the very end that I didn’t saw coming and ended the film on a high note. Pikachu is beautifully voiced by Ryan Reynolds and if you were worried that his voice wouldn’t blend with the yellow fellow, don’t be. Pikachu is extremely funny and charming, carrying the whole show on its shoulders with a little help of Psyduck. Cubone and Ditto also have some great moments, but Mewtwo is a beauty to behold, as expected. Even though I’m not a hardcore fan, I felt the “immersiveness” of the incredible Pokémon world that Warner Bros. built and that’s the best compliment I can give: I felt like I was in a real Pokémon universe.\r\n\r\nAll in all, Pokémon Detective Pikachu is fine. For hardcore fans, it might be everything you’ve ever wished for, but for fans of the 2000s Pokémon, who stopped following the franchise after the beginning of the new decade, the numerous Easter Eggs and references might not be enough to overcome the undeniable narrative issues. Justice Smith delivers an outstanding performance, and Ryan Reynolds nails Pikachu‘s voice, being extremely funny and unbelievably adorable. The CGI is ground-breaking, making the Pokémons astonishingly realistic and their world remarkably immersive. However, even if the movie ends with a terrific touch, the shallow characters, the heavy exposition dumps, and the not-that-mysterious mystery bring the pacing down and turn this live-action adaptation into just an okay one.\r\n\r\nPS: regarding the curse of the video games cinematic adaptations, I already believe that Tomb Raider broke it with a good margin, but both Warcraft and Pokémon Detective Pikachu managed to just scratch the positive side of my reviews. You’re on the right track, but step up Hollywood!\r\n\r\nRating: B-", "created_at": "2019-05-09T11:30:22.001Z"}, {"movie_id": 447404, "review_id": "5cfe47979251410c95b8ef22", "author_rating": 6.0, "review_text": "The core story is just... So dumb. And the dialogue between genuinely any two characters that doesn't involve the titular Pikachu made me **real** uncomfortable.\r\n\r\nBut I adore the world that holds it up. Watching _Detective Pikachu_ was like drinking hot chocolate by the campfire in winter. Even my roommate who had to be dragged to the thing kicking and screaming ended up having a wholesome good time.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-06-10T12:05:43.652Z"}, {"movie_id": 447404, "review_id": "5d06f5090e0a262e2ec9b46d", "author_rating": 7.0, "review_text": "The movie did not have the best story, it was very much like the original Pokemon the Movie where Ash dies, in the hands of Mewtwo, just switched up a little. The animation and visual affects were really well done. There were some funny parts, although a lot of it seemed really dry.", "created_at": "2019-06-17T02:03:53.857Z"}, {"movie_id": 447404, "review_id": "5d60fd2154f6eb00159b1c03", "author_rating": 6.0, "review_text": "Having never played the \"Detective Pikachu\" game, I can't attest as to the film's faithfulness to the source material. As a movie on its own merits and with a passing knowledge of Pokemon, I found that I enjoyed this more than I thought I would going in. It has a decent narrative structure (although the villain reveal is a little out-of-left-field; they probably could have used a little more buildup) and likable if somewhat cookie -cutter characters. But, WOW, is the tone inconsistent! Most of the movie gets surprisingly serious and dark early on, and for parts of the film Ryan Reynolds feels more like comic relief. Expect emotional whiplash from this one. Still, it's a fair movie that at least fans of Pokemon will likely enjoy.", "created_at": "2019-08-24T09:02:25.760Z"}, {"movie_id": 447404, "review_id": "62dfad5bdc1cb4004facf834", "author_rating": 10.0, "review_text": "I had no hope for this...\r\n\r\nIt made me a believer.\r\n\r\nLive action cgi based Pokemon CAN happen and CAN deliver.\r\n\r\nPerfect cast. Mr. Mime freaks me out. Ryan Reynolds as Pikachu just was the best casting decision ever.", "created_at": "2022-07-26T09:01:15.246Z"}, {"movie_id": 447404, "review_id": "63c5cf0412c60400db24f941", "author_rating": 6.0, "review_text": "**A decent kids' movie, but my lack of Pokémon fandom probably kept me from appreciating the film more than I did.**\r\n\r\nI heard good things about this movie for years but never sat down to watch it until my three-year-old started saying \"Pikachu\" when she saw him in an ad. So we gave it a shot, and she really liked all the little creatures and noises. I enjoyed the movie fine, but after watching the Sonic movies recently, I had high expectations that expected. Justice Smith did a great job interacting with the CG characters, and Ryan Reynolds' voice acting was as fantastic as I expected. Detective Pikachu wasn't bad, but I kept feeling like I needed to be more of a Pokémon fan to enjoy the movie more. The whole climax and reveal of the evil plot to merge people with Pokémon was kind of lame to me, so this movie fell short of Sonic or Puss in Boots or Minions. I didn't mind it, and I'm sure I will end up watching it more times than I wanted, but there are other kids' movies I enjoyed more.", "created_at": "2023-01-16T22:26:12.490Z"}]