[{"movie_id": 504, "review_id": "5e80aec01d6c5f00161d499c", "author_rating": 7.0, "review_text": "We can be as different as we wanna be, but you can't kill people!\r\n\r\nMonster is the bleak story of Aileen Wuornos, a prostitute and one of America's most notorious female serial killers. Based around facts of her life and death, the film primarily focuses on the last year of her freedom. Where after entering into a strange lesbian relationship with Selby Wall, Wuornos, fed up of being a abused by men, starts killing those calling on her services.\r\n\r\nSad and potent is Patty Jenkins' first full length directorial effort. Though perhaps a touch guilty of pandering to Wuornos' own self created \"monster\" image, the film none the less has the right blend of sympathy and revulsion to make it a fascinating, if uneasy, experience. Former model Charlize Theron goes through a major transformation to become Wuornos, so much so she's practically unrecognisable. Bulked up in weight and with beaten down make up withering her face, Theron goes on to give a towering performance as the troubled, on the edge killer. \r\n\r\nWithout any thrills or hints of histrionics, Theron is uncompromising throughout the picture. To garner empathy with such an abrasive character is quite a trick, then to switch to monstrosity with conviction seconds later? Well that's almost magical in itself. Theron is backed up well by Christina Ricci as Selby. Selby Wall, an immature young lady oblivious to the dark path she is walking down, is given a great portrayal from Ricci. In light of the powerhouse show from Theron, it's much credit to Ricci that she enhances the film with her own delicate characteristics. Helping to emphasise the strangeness of the union in the process.\r\n\r\nIt's a tough film for sure, and come the final credits one is left with a feeling of sympathy towards Wuornos and the life she lived. If that be right or wrong is of course up to the individual viewer. Or if that was even Jenkins' intention is probably up for debate. But Monster exists and survives as a bitter character study of a desperate woman, which through the medium of cinema, makes us the viewers privy to something very edgy indeed. 7.5/10", "created_at": "2020-03-29T14:20:48.789Z"}, {"movie_id": 504, "review_id": "64c9600085b10500ac15fd6a", "author_rating": 5.0, "review_text": "The movie was alright. It was more of a sadistic type of love story. What they failed to capture is really how nuts she was. Like do less of a love story and more of her psychoness. The bitch was crazy! All the crazy interviews with her and all the outbursts she did in court, where's that? This movie almost tried to make you feel sorry for her when they really didn't show just how crazy she really was.", "created_at": "2023-08-01T19:41:52.051Z"}]