[{"movie_id": 2059, "review_id": "5eeccb8759e8a90037c82126", "author_rating": 5.0, "review_text": "Maybe the real National Treasure was this movie we watched along the way.\r\n\r\nOkay so I didn't **love** _National Treasure_, but it 100% is what it's supposed to be. I never watched it as a kid, this was literally the first time I've ever seen more than about 5 minutes of it, so I don't have the nostalgia thing that a lot of people do, but I do think I'll watch it again. And, even though I didn't much like the sequel, I think I'd still definitely try out a 3rd _National Treasure_ if it ever got made.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-06-19T14:28:23.267Z"}, {"movie_id": 2059, "review_id": "60906990ae36680059a00268", "author_rating": 8.0, "review_text": "Seen this one many times over the years and still a lot of fun. Solid adventure-comedy with Nicolas Cage in his element with this sort of material. Diane Krueger's performance was a bit iffy at times but she had some okay scenes and never can go wrong with Sean Bean playing the villain, though the character is made out to be smart when all he does is some online searches and stealing from others. **3.75/5**", "created_at": "2021-05-03T21:22:24.261Z"}, {"movie_id": 2059, "review_id": "61f8b73d59e8a9001b1259c1", "author_rating": 8.0, "review_text": "_**Modern \"Raiders of the Lost Ark\" in America**_\r\n\r\nIf you can imagine a \"Raiders of the Lost Ark\"-type story taking place in modern America, you'd have a fairly good idea of what \"National Treasure\" is like. Nicolas Cage plays the Indiana Jones-type treasure hunter, Benjamin Franklin Gates, accompanied by his partner (Justin Bartha) and romantic interest (Diane Kruger), the latter a historical document scholar who gets dragged into the wild proceedings.\r\n\r\nTHE PLOT: Gates feels he has no choice but to audaciously steal the Declaration of Independence to save it from his nemesis (Sean Bean). The document has an invisible clue on its flip side, which supposedly leads to a vast, coveted 'national treasure.' Can Gates successfully swipe the document, elude the Feds, and ultimately find the ancient fortune before his murderous, greedy rival? And can he simultaneously \"get the babe\" as well? \r\n\r\n\"National Treasure\" put a big grin on my face throughout its entire runtime. Like 1981's \"Raiders of the Lost Ark,\" you're not supposed to dwell too deeply on the events because, if you do, the implausibilities will start to mount up. Nevertheless, even though this was made to be a fun, eminently entertaining ride, it still somehow stimulates ruminations and interest in American history. Not a bad byproduct, no? \r\n\r\nA handful of miscellaneous items: \r\n\r\n* Diane Kruger, who played 'the face that launched a thousand ships' in 2004's \"Troy,\" is sharp and all-around pleasant on the eyes.\r\n* The score is modern with thrilling orchestrations intermingled with HEAVY progressive guitar riffs. It was composed by, believe it or not, Yes' guitarist/songwriter Trevor Rabin. Like \"Conan the Barbarian,\" \"Last of the Mohicans\" and \"Where Eagles Dare,\" this is a soundtrack worth owning; it's that superlative.\r\n* The protagonists are all likable; heck, even the head Fed, played by Harvey Keitel, is likable.\r\n* The chases are thrilling.\r\n* The film was shot on location in Washington D.C., Philadelphia and New York City.\r\n* Jon Voight plays Gate's father.\r\n* Like \"Raiders\" this is a family-friendly experience -- upbeat with no needless cussing, sex or gore. The movie leaves you with a good feeling.\r\n\r\nCLOSING THOUGHT: Despite the fact that Roger Ebert and Richard Roeper gave it 'thumbs down' -- Roeper even calling it 'Howling, howling BAD' -- \"National Treasure\" was a huge hit with audiences in 2004. This shows that critics like Roeper see WAY too many movies. They can't even lighten-up enough to enjoy a fun, thrilling, historically-stimulating popcorn flick. Implausible? Yes (at times, anyway). Bad? No.\r\n\r\nMake no mistake, \"National Treasure\" is an entertaining quasi-believable adventure film. It's got the mojo.\r\n\r\nThe movie runs 2 hours, 11 minutes. \r\n\r\nGRADE: B+/A-", "created_at": "2022-02-01T04:29:49.127Z"}, {"movie_id": 2059, "review_id": "63262fb68d22fc007a30ed89", "author_rating": 8.0, "review_text": "**National Treasure catches the Indiana Jones lightning in a bottle with its clue-chasing treasure hunt, entertaining cast, and grand adventure.**\r\n\r\nNational Treasure successfully captures the fun adventure and quality of Indiana Jones while building an exciting universe to explore in future films and shows. Nicolas Cage is at his best teaming with producer Jerry Bruckheimer once again. The duo's collaboration gave us The Rock, Con Air, and Gone in Sixty Seconds, with National Treasure outdoing them all at the box office! This fast-paced family-friendly adventure film travels the globe hunting for clues and uncovering new mysteries. The witty dialogue and funny moments keep the movie lighthearted, contrasting the dangers and peril the characters constantly face. National Treasure is a nostalgic and entertaining film with Nicolas Cage at his best, a fantastic supporting cast, and an exciting globe-trotting treasure hunt that the whole family can enjoy.", "created_at": "2022-09-17T20:36:06.509Z"}, {"movie_id": 2059, "review_id": "6461139fa6725400e3d1e86c", "author_rating": 7.0, "review_text": "Nicolas Cage trying his damndest to be as un-Indian Jones as possible and succeeding. A good old-fashioned treasure hunt adventure you won't be able to help but enjoy. Cage is thoroughly enjoyable in this pacy romp. The unheroic hero is the best kind of hero, in my humble opinion.", "created_at": "2023-05-14T17:00:15.582Z"}]