[{"movie_id": 597208, "review_id": "61a8e86d180dea0025f58e2c", "author_rating": null, "review_text": "Stanton Carlisle (Bradley Cooper); is a man trying to get by in late 1930s America in the new film \"Nightmare Alley\". Our first introduction to Stanton is less than flattering and he soon finds himself employed at a Carnival after coming upon it by chance.\r\n\r\nThe eager Stanton is given advice and tools of the trade by his boss Clem (Willem Dafoe) as well as the mystic Zeena (Toni Collette) and Stanton eagerly wants to get ahead. While striking a friendship with fellow employee Molly (Rooney Mara); Stanton learns that Zeena's older and alcoholic husband has a skill from a former act where he learns to read people and use verbal cues to appear to have the power of clairvoyance.\r\n\r\nEventually, Stanton seeks bigger opportunities and leaves with Molly for the city where they in time develop a successful act that offers them two shows a night at a fancy hotel and some of the finer things in life.\r\n\r\nUnwilling to be content with what he has; Stanton becomes involved with a Psychologist named Lilith (Cate Blanchett) and uses her knowledge to set up higher-profile marks who will pay well for his supposed abilities and in doing so; sets a dangerous chain of events into motion.\r\n\r\nThe film is based on the 1946 book of the same name and an earlier 1947 film, and while it does an amazing job with the visuals and moody atmosphere of the era; it is a very long and slowly-paced film. The movie is over 2.5 hours long and comes across as overly long and self-indulgent as Director Guillermo del Toro could easily have shaved 30-45 minutes from the film and told the story without losing much.\r\n\r\nThe cast and performances are very good but a slow-paced and dour film is not an ideal way to spend 2.5 hours at the movies no matter how much it has going for it. The movie does have some good points but I think it will do much better on streaming and home video where audiences can pause and take a break.\r\n\r\nIf you are a fan of the Noir style of old; then this may be just what you are looking for, but I think it should have been so much more.\r\n\r\n3.5 stars out of 5.", "created_at": "2021-12-02T15:38:21.306Z"}, {"movie_id": 597208, "review_id": "61b7b71ce263bb0041cbaa16", "author_rating": 7.0, "review_text": "The duration of _Nightmare Alley_ may seem like a slog even as you’re watching it. On one hand, your mindset is essentially, “How many times do I have to watch Bradley Cooper read a book and point at his temple over and over for two and a half hours?”\r\n\r\nBut _Nightmare Alley_ is expertly crafted in a way that every sequence feels relevant later on and it leaves you with a lot to ponder after it ends. It’s a beautiful film with an incredible cast full of strong performances from del Toro regulars.\r\n\r\nIt may feel like an extreme case of a slow burn, but it’s also a rare instance where it’s worth your valuable time and the investment. The audience being in on the con from the start makes you feel like part of the carny family. At this point in his illustriously hellish career, _Nightmare Alley_ is arguably Guillermo del Toro’s best written film.\r\n\r\n**Full review:** https://boundingintocomics.com/2021/12/13/nightmare-alley-review-a-murky-noir-that-tinkers-with-greatness/", "created_at": "2021-12-13T21:11:56.573Z"}, {"movie_id": 597208, "review_id": "61fc84bc559d220043cd7305", "author_rating": 10.0, "review_text": "This is great! I loved it!\r\n\r\n<em>'Nightmare Alley'</em> is a superb watch! I particularly enjoyed the beginning and end, which are truly excellent; the middle part isn't as strong, but is still top notch in its own right. I love the dark atmosphere it sets from the get-go, the sound design is outstanding - some bits are so striking and I love it! It has a quality, engrossing story to boot.\r\n\r\nBradley Cooper leads the cast with quality, though he isn't even the sole standout of the film. He is joined by a whole host of terrific performers: Cate Blanchett, Rooney Mara, Toni Collette, Willem Dafoe, Richard Jenkins, David Strathairn ... I could go on, simply phenomenal casting! I wanted more of them all, and yet felt I got the perfect amount too.\r\n\r\nThe 150 minute run time went by incredibly quickly for me; if I hadn't known it was on for that long, I would never have guessed its length to be anywhere near that. It's a slow burn, but a slow burn done tremendously. Guillermo del Toro - this is the first film of his I've seen - & Co. did a super job, I have no complaints at all. I was toying for ages between a 9 or a 10 rating, it just about creeps its way into the latter.\r\n\r\nJust brilliant. Go watch!", "created_at": "2022-02-04T01:43:24.047Z"}, {"movie_id": 597208, "review_id": "62b0bd1777b1fb0052bd4f1c", "author_rating": 5.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/the-spook-show-must-go-on-nightmare-alley-review<a>\r\n\r\nWriter and director Guillermo del Toro has built his career on monster movies. He’s filled them with the Pale Man, the Crimson Woman, a fish man, all creatures you don’t want to find yourself alone with at night. And yet, time and again, del Toro shows us that the real monsters, the things that should scare us the most, are our fellow humans.", "created_at": "2022-06-20T18:31:51.559Z"}, {"movie_id": 597208, "review_id": "62c7451ecf62cd005108eb18", "author_rating": 7.0, "review_text": "Bradley Cooper picks up the baton from Tyrone Power (1948) as the ambitious \"Stanton Carlisle\", a shrewd young man who works the travelling shows with an eye for the main chance. That chance comes when he hooks up with Toni Collette's \"Zeena\", who shows him the tricks of their mentalist trade. Pretty soon they are fooling the great and the good - and he meets \"Dr. Ritter\" (Cate Blanchett). She is a psychiatrist, every bit as ambitious and ruthless as he and is content to share some of the innermost secrets of her clients with him so he can exploit their suffering. To the top of their list goes sceptical millionaire \"Ezra Grindle\". Together they conjure up one hell of a sting on this man - but can they succeed? This film looks great, but I found it took too long to become interesting. Cooper is handsome, but struggles with the unscrupulousness that the part needed to convey, and his scenes with Blanchett lack chemistry, indeed it is Collette who really steals the few scenes she is in - especially towards the rather twisted end of the tale. It is good, but maybe just had too much time and money and the story sacrificed some of it's soul here.", "created_at": "2022-07-07T20:42:06.613Z"}, {"movie_id": 597208, "review_id": "63002bb11da7a600a4cdc1dc", "author_rating": 3.0, "review_text": "**RUN! Save yourselves!**\r\n\r\nThe cinematography makes this movie lovely to watch while being miserable to experience. Filled with amazing actors trying to make sense of a film riddled with plot holes and disappointment. I was hoping for a good Del Toro horror movie and sadly was met with a poorly executed mystery romp... spent the whole movie hoping the ending would somehow save it... and sadly, it did not.", "created_at": "2022-08-20T00:32:49.427Z"}]