[{"movie_id": 640146, "review_id": "63eceb548e8702009ec2466f", "author_rating": null, "review_text": "In general, the Ant-Man films have been well received by critics and audiences alike, with the films' unique blend of humor, action, and heart, as well as the performances of the cast members, widely praised. particular Paul Rudd as the titular Ant-Man So \"Ant-Man 3\" is likely to be eagerly awaited by Marvel fans and moviegoers in general.\r\n\r\nYou can find the full review at https://aarcflick.blogspot.com/2022/12/ant-man-and-wasp-quantumania-2023-movie.html", "created_at": "2023-02-15T14:25:24.555Z"}, {"movie_id": 640146, "review_id": "63ed8802699fb7009e3dd88b", "author_rating": null, "review_text": "Life for Scott Lang (Paul Rudd) is good. He is basking in the recognition\r\n\r\nand fame that has come with his work with the Avengers and saving half the\r\n\r\nuniverse from Thanos and has even become a best-selling author.\r\n\r\nHe has a successful relationship with Hope (Evangeline Lilly) who has\r\ntaken her father’s company to new heights and they have managed to blend\r\ntheir personal and professional lives and enjoy a very happy life.\r\n\r\nScott does worry about his daughter Cassie (Kathryn Newton) as he lost\r\nseveral years with her during the Blip and she is an activist who has been\r\narrested for her efforts including a hysterical prank on the police with\r\nPym technology.\r\n\r\nCassie is constantly on her father for not doing more as she feels that he\r\nis more focused on the past battles with the Avengers and not the day to\r\nday struggles people are facing. Over dinner, she tells Hope and her dad as\r\nwell as Hank (Michael Douglas), and Janet (Michelle Pfeiffer), whom she\r\nstudied Hank’s journals while they were in the Blip and has developed a\r\nQuantum beacon which can map the Quantum Realm without having to venture\r\nto the sub-atomic relay where until recently nobody had been able to\r\nreturn from.\r\n\r\nThis news sends Janet into a panic during a demonstration and the four are\r\nsoon sucked into the realm and discover a diverse and thriving ecosystem\r\nas well as an abundance of strange and dangerous creatures.\r\n\r\nJanet is clearly hiding something and is frantic that they must leave but\r\ntheir party has been scattered and they soon learn that she fears and\r\nindividual known as Kang (Jonathan Majors).\r\nWhile she was trapped in the realm for thirty years, Janet encountered\r\nKing and helped him regain his power source but in doing so, learned he\r\nwas a banished conquerer who can manipulate time, space, and the\r\nmultiverse.\r\n\r\nHer actions to trap Kang and lead a resistance to the vast empire he\r\ncreated has set the stage as Janet has now returned to see what has\r\ndeveloped and Kang will stop at nothing to regain his power source to\r\nescape and wreck his wrath on trillions.\r\n\r\nNaturally, it is up to Scott, Hope, and the team to find a way to fight the\r\nevil and powerful Kang to save the day.\r\n\r\nThe film is a darker tale than people might expect from an Ant-man movie\r\nbut in kicking off Phase 5 of the Marvel Cinematic Universe, the movie is\r\na visual splendor filled with amazing visuals, landscapes, and characters.\r\n\r\nThe film takes a bit of time to get to the action but when it arrives it\r\ndelivers and the performance of Majors as Kang is captivating it will\r\nbe interesting to see where the storyline evolves over the next series of\r\nfilms leading up to “The Avengers: The Kang Dynasty” and beyond.\r\n\r\n“Ant-man and the Wasp: Quantumania may not break loads of new ground in\r\nterms of a Marvel film but Director Peyton Reed knows the characters well\r\nand delivers a story that should resonate with the fans and the strong\r\ncast and addition of Majors along with the great visuals make this\r\nanother winner for Marvel.\r\n\r\n4 stars out of 5", "created_at": "2023-02-16T01:33:54.605Z"}, {"movie_id": 640146, "review_id": "63ef89b135818f0081d2f4d9", "author_rating": 5.0, "review_text": "I was really excited for this film; the trailers made the stakes seem high with a story that was somewhat mature in tone. Unfortunately, I was ultimately let down.\r\n\r\nThe overarching plot was pretty good. I liked the arcs our characters had, particularly Scott and Cassie Lang. But the minor details are where things get messy. We get introduced to so many new characters, concepts, and story details in the quantum realm, resulting in an overall film that is not very digestible. There is too much going on and not enough time to fully flesh out the details.\r\n\r\nThe dialogue is pretty poorly written. At some points in the film, I was literally laughing out loud at what the characters were saying. It felt exactly like a TikTok skit exaggerating and mocking superhero movies. Cassie Lang has one line that is probably THE MOST CRINGY LINE EVER SPOKEN IN THE MCU.\r\n\r\nThe performances were decent overall. Most of the acting in the Ant-Man films is a little cheesy and campy, which mostly works in the small-scale stories they tell. But with the large, expanding story that the film is attempting to deliver, it just felt cheap. Kang is really amazing. Jonathan Majors was a tier above the rest of the cast; I can't wait to see more of him but also feel like he was wasted here.\r\n\r\nFinally, the visuals were really inconsistent. Some scenes looked quite good, with interesting and detailed settings, while others clearly featured three characters standing in front of a green screen. I mean, in some scenes I swear I could see slight black outlines from the keying technology. Where is the budget going in these films? They really need to slow down in postproduction because this is becoming a major theme. One thing I will note is that I thought MODOK looked really good. It was always going to be difficult to pull off a live action version of him, but they did a stellar job.\r\n\r\nOverall, I am pretty disappointed in the movie, but the movie gave me enough to make this a somewhat average experience. The MCU needs to pick it up this year because it is on a major downward trajectory.\r\n\r\nScore: 52% |\r\nVerdict: Average", "created_at": "2023-02-17T14:05:37.916Z"}, {"movie_id": 640146, "review_id": "63efaab235818f0085ea08a8", "author_rating": 6.0, "review_text": "**Quantumania is a step up from most of Phase Four. It felt like a Thor: Ragnarok impersonation, and lost the fun of the other Ant-Man films.**\r\n\r\nMy feelings are so mixed on Ant-Man and the Wasp: Quantumania. The first two Ant-Man movies were so great because they were low-stakes with self-contained stories that weren't consumed with saving the universe but instead were set in less a fantastical world that allowed the goofy size-changing antics really shine. Quantumania threw Ant-Man into an outrageous world, changing him from the zany character of the film to the normal character and stripping him of some of his charm. Quantumania felt like a cross between Thor: Ragnarok and Rise of Skywalker with some Power Rangers sprinkled in there, and the result was… decent. It really wasn't a bad movie. It has some funny parts and was better than most of Phase 4. Bill Murray was loads of fun for his brief part and Jonathan Majors is going to be an awesome big bad in the MCU. But it all felt like a familiar save the universe comic book movie and sadly made Ant-Man feel out of place in his own film.", "created_at": "2023-02-17T16:26:26.388Z"}, {"movie_id": 640146, "review_id": "63f10aeacaaca200892e0978", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/ant-man-and-the-wasp-quantumania-review\r\n\r\n\"Ant-Man and the Wasp: Quantumania warrants the divisive reception. Immersive visuals, more than satisfying action, and absolutely exceptional performances, aside from Kathryn Newton due to lack of direction. Unfortunately, the excessive, repetitive, unnecessary dialogue driven by exposition, along with a lack of stronger tonal balance - fewer jokes by Marvel standard, but the cringe level affects transitions to/from more serious moments - and an underdeveloped narrative devoid of true stakes - character arcs are almost non-existent - make this an overall very inconsistent watch. Still, JONATHAN MAJORS AS KANG! Wow!\"\r\n\r\nRating: C", "created_at": "2023-02-18T17:29:14.364Z"}, {"movie_id": 640146, "review_id": "63f7f54f46f35400bc6881fd", "author_rating": 6.0, "review_text": "\"Oh, Daddy - It's all my fault!\". Well no \"Cassie\" (Kathryn Newton), not quite. You certainly developed the piece of communications kit that lands everyone in the quantum soup, but the blame really must go to Peyton Reed and Jeff Loveness for directing and writing this latest emanation from Marvel's increasingly un-special film factory. It starts off with a great little device that could quickly put Papa John's out of business before we are sucked into the cantina from \"Star Wars\" (1977) where our recently arrived travellers find themselves pursued by the ridiculously un-menacing \"M.O.D.O.K\" - a sort of robotic killing version of the golden statue from the top of \"Raiders of the Lost Ark\" (1981) after it had had a good time with \"V.I.N.C.E.N.T\" from \"The Black Hole\" (1979) - before Michelle Pfeiffer \"Janet\" explains to her family (and to us) just what has led them to a predicament where they must avoid the evil clutches of \"Kang the Conqueror\" (Jonathan Majors). Now this gift that keeps on giving for this studio never struggles to impress visually, and the imagination of those who create these magical effects and alien shapes and sizes must be commended. However, this latest offering featuring, in my view, the weakest of their arsenal of characters is just entirely derivative and unremarkable. Aside from a very few bon-mots from Paul Rudd the dialogue is dry and the action scenes are all concentrated in one or two sequences whilst the rest of this serves as little better than colourful padding for the thinnest of storylines. Rudd is quite an unassuming kind of actor. Engaging, yes - but somehow just too lightweight for the grandness of the surrounding imagery. Michael Douglas (\"Pym\") features sparingly and the cameo from Bill Murray might have worked better in \"Guardians of the Galaxy\" - here it is almost laughable. If these are to keep coming off the production line as thickly and quickly as seems likely, then somebody somewhere is going to have to spend much more effort on developing stronger and more compelling stories because the audiences are surely immune to the vibrancy of the special effects by now. This is really forgettable fayre.", "created_at": "2023-02-23T23:22:55.565Z"}, {"movie_id": 640146, "review_id": "6411f541323eba010b927262", "author_rating": 9.0, "review_text": "A fun one!\r\n\r\nI had a terrific time watching <em>'Ant-Man and the Wasp: Quantumania'</em>, despite hearing 'meh' things about it here and there online. It surpassed my expectations, to be honest. Great cast, entertaining action, super interesting world building (my favourite from the MCU for a while, in that regard) and the humour is good.\r\n\r\nStar of the show in my opinion is Michelle Pfeiffer. I don't recall her standing out in <em>'Ant-Man and the Wasp'</em>, but here she's excellent from beginning to end. Elsewhere, Jonathan Majors is brilliant - great to see that guy all over the place recently. Paul Rudd remains a strong lead, while the likes of Michael Douglas and Kathryn Newton are positives too.\r\n\r\nLove the Quantum Realm setting. I'm nothing like an MCU nut, I'm only aware of the films, so didn't know what to expect, but the place looks fantastic - from the enviroment to the creatures; shoutout Veb. Like Pfeiffer, Corey Stoll didn't really register on my radar in prior films, but him as M.O.D.O.K. is a lot of fun.\r\n\r\nLooking at my personal MCU ranking, this goes in at no. 8 - I didn't anticipate that! A literal quick glance at the average rating on here suggests I'm in the minority but I truly found much enjoyment from this. Quite the improvement on Ant-Man 2, which is at the bottom of my aforementioned ranking.", "created_at": "2023-03-15T16:41:38.033Z"}, {"movie_id": 640146, "review_id": "644047b7dd47160775814fe9", "author_rating": 1.0, "review_text": "worst movie. Even that much money - too much btw - for special effects cant hide Reed's lacking effort to build a believable world. It's a poor and passionless visual copy of something like Star Wars Mini... with minimal humor and zero originality. RIP Marvel.", "created_at": "2023-04-19T19:57:43.688Z"}, {"movie_id": 640146, "review_id": "6444cbeb2c6b7b02fc7edd79", "author_rating": 3.0, "review_text": "When it comes to their Marvel properties, there’s this slightly morbid insistence by Disney to tie every teeny tiny detail of previous movies, television shows, and character arcs together in obsessive fashion. It’s becoming such an uncontrollable urge by the studio to engage in this behavior that the cause-and-effect is resulting in disasters like “Eternals,” “Thor: Love and Thunder,” and now, “Ant-Man and the Wasp: Quantumania.”\r\n\r\nTrying too hard to force a non-story into the already lame Ant-Man mythology, the film reunites superhero partners Scott Lang (Paul Rudd) and Hope Van Dyne (Evangeline Lilly) as Ant-Man and the Wasp. The pair find themselves thrust into the dangerous Quantum Realm along with Hope’s parents Hank Pym (Michael Douglas) and Janet Van Dyne (Michelle Pfeiffer), along with Scott’s teenage daughter, Cassie (Kathryn Newton). As they explore the unusual terrain and alien society filled with strange creatures, Janet reveals that she didn’t quite tell the group everything about the three decades she spent trapped in the realm. Facing new dangers from supervillan Kang the Conquerer (Jonathan Majors), the family must unite to stop a worldwide disaster.\r\n\r\nVery little about this project feels like a satisfying superhero movie and instead, it’s more like an assemblage of other (and far better) science fiction films. If not for the titanic budget and big-name stars, it could almost be mistaken for a Redbox “mockbuster” of “Star Wars,” “Mad Max,” “Avatar,” and “Godzilla” combined.\r\n\r\nThe film takes place extensively in the Quantum Realm, which provides an unsightly setting of muted, dark brown, washed-out visuals. It’s an ugly place, so who why would audiences want to spend time there? The Realm is a melting pot of exotic creatures and peculiar inhabitants that appear to have waltzed right out of the Mos Eisley Cantina on Tatooine. They’re cool to look at I guess, but was the point to make the film more appealing to children, or was it Disney’s way of appeasing the animators by letting them have some fun?\r\n\r\nThe first third of the film seems like it’s Janet’s show, as she keeps bringing up the fact that she has all these secrets that she won’t spill to Hope and Hank (even though they’re all stuck in the Realm together). There’s no compelling mystery nor reveal. Screenwriter Jeff Loveness is grasping at straws to craft a somewhat cohesive story while also struggling to make it fit into the MCU mythology. At some point, I wish someone would just make a damn standalone Marvel superhero movie and quit worrying about who and what goes where and how.\r\n\r\nThe story is frequently erratic. There’s plenty of energetic CGI action, but there also some moments that play like a touching family drama, some that create an anti-climatic post-apocalyptic narrative, and lots of failed attempts at comic relief. The film also has recurring (and awkward) socially conscious messaging that doesn’t entirely feel out of place, but it is aggressive (there’s even a direct mention of socialism by one of the characters, which will really aggravate already-angry conservatives).\r\n\r\nThe screenplay is peppered with dreadful one-liners like “it’s never too late to stop being a dick!” and “ants don’t give up!” I really, really wish I was joking about this.\r\n\r\nThe remainder of the movie features a lot of talk about time, the desire to get home, and — Marvel fans, you know what’s coming — the multiverse! It’s that one little word that means endless movies, endless stories, and endless money. It’s also the easy way to guarantee that all of these films in the canon always have a cop-out to lazily excuse away any inconsistencies (not that many of us could keep up or remember anyway).\r\n\r\nAnother major problem with the film is that it can only chug along on Rudd’s likeability (and the cast’s talent) for so long. It’s barely tolerable until Kang shows up, but he’s a wickedly delicious character portrayed by a terrific actor (it’s a real shame that this had to be the film for Majors’ MCU debut). In fact, the entire cast deserves better. Despite all of them turning in strong performances, they still feel mostly wasted here.\r\n\r\n“Ant-Man and the Wasp: Quantumania” lacks the memorable spectacle that most superhero films need in order to succeed. There’s no massively rousing, crowd-pleasing moment, and it’s one of the more unremarkable entries in the MCU.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS**", "created_at": "2023-04-23T06:10:51.993Z"}, {"movie_id": 640146, "review_id": "64498ab70f21c604ec28527a", "author_rating": 6.0, "review_text": "Okay, there are a plethora of reviews here by Marvelettes and more, so I will only give my gut response. Perhaps this movie was doomed to disappoint me, because Ant Man is still my favorite Marvel film of all for its wit and humor. That humor grew out of his interaction with his daughter and other people. This movie removes him to a strange complex world that struck me as a cross between the bar in Star Wars and the deserts of Dune. He was out of his element with his grown daughter and now-aged  cohorts and it left me rather bored, surprisingly. But without my baggage, I am sure others enjoyed it immensely.", "created_at": "2023-04-26T20:33:59.430Z"}, {"movie_id": 640146, "review_id": "648e9f50559d2200ad8278ad", "author_rating": 8.0, "review_text": "Honestly this is easily my favorite out of the series. Still funny as normal but there's a lot more action and cool looking stuff in this movie. Really good movie.", "created_at": "2023-06-18T06:08:16.836Z"}, {"movie_id": 640146, "review_id": "64d9ed77b77d4b113fc3ecc6", "author_rating": 8.0, "review_text": "This one was quite good actually. Marvel is quite a bit of hit and miss lately. It all depends on whether one of the woke retards has gotten their grubby hands on the script or not.\r\n\r\nIt was of course encouraging that the woke “critics” on the well known rubbish site Rotten Tomatoes declared it rotten while it got a 82% score from the actual audience. Always a good sign for a movie.\r\n\r\nThe movie is a pure adventure movie meant to entertain the audience. The script is decent and, as usual with a Marvel movie, serves mainly to create a reason for doing action sequences and lots and lots of special effects.\r\n\r\nThe adventure is mixed in with some humor but it is generally okay and not overdone.\r\n\r\nThe scenery in the quantum world is fantastic and the creatures are great ranging from terrifying to quite fun. Bringing in Bill Murray was a nice surprise even though he was a bit of a bad guy and quite short lived.\r\n\r\nThe one character I really didn’t like was Paul Rudd as the Ant-Man. His anti-hero bullshit, reluctance to fight and generally being a douche until he was forced to actually do what was right was really grating on me.\r\n\r\nOverall though this was some well spent two hours.", "created_at": "2023-08-14T09:01:43.895Z"}, {"movie_id": 640146, "review_id": "63eceb548e8702009ec2466f", "author_rating": null, "review_text": "In general, the Ant-Man films have been well received by critics and audiences alike, with the films' unique blend of humor, action, and heart, as well as the performances of the cast members, widely praised. particular Paul Rudd as the titular Ant-Man So \"Ant-Man 3\" is likely to be eagerly awaited by Marvel fans and moviegoers in general.\r\n\r\nYou can find the full review at https://aarcflick.blogspot.com/2022/12/ant-man-and-wasp-quantumania-2023-movie.html", "created_at": "2023-02-15T14:25:24.555Z"}, {"movie_id": 640146, "review_id": "63ed8802699fb7009e3dd88b", "author_rating": null, "review_text": "Life for Scott Lang (Paul Rudd) is good. He is basking in the recognition\r\n\r\nand fame that has come with his work with the Avengers and saving half the\r\n\r\nuniverse from Thanos and has even become a best-selling author.\r\n\r\nHe has a successful relationship with Hope (Evangeline Lilly) who has\r\ntaken her father’s company to new heights and they have managed to blend\r\ntheir personal and professional lives and enjoy a very happy life.\r\n\r\nScott does worry about his daughter Cassie (Kathryn Newton) as he lost\r\nseveral years with her during the Blip and she is an activist who has been\r\narrested for her efforts including a hysterical prank on the police with\r\nPym technology.\r\n\r\nCassie is constantly on her father for not doing more as she feels that he\r\nis more focused on the past battles with the Avengers and not the day to\r\nday struggles people are facing. Over dinner, she tells Hope and her dad as\r\nwell as Hank (Michael Douglas), and Janet (Michelle Pfeiffer), whom she\r\nstudied Hank’s journals while they were in the Blip and has developed a\r\nQuantum beacon which can map the Quantum Realm without having to venture\r\nto the sub-atomic relay where until recently nobody had been able to\r\nreturn from.\r\n\r\nThis news sends Janet into a panic during a demonstration and the four are\r\nsoon sucked into the realm and discover a diverse and thriving ecosystem\r\nas well as an abundance of strange and dangerous creatures.\r\n\r\nJanet is clearly hiding something and is frantic that they must leave but\r\ntheir party has been scattered and they soon learn that she fears and\r\nindividual known as Kang (Jonathan Majors).\r\nWhile she was trapped in the realm for thirty years, Janet encountered\r\nKing and helped him regain his power source but in doing so, learned he\r\nwas a banished conquerer who can manipulate time, space, and the\r\nmultiverse.\r\n\r\nHer actions to trap Kang and lead a resistance to the vast empire he\r\ncreated has set the stage as Janet has now returned to see what has\r\ndeveloped and Kang will stop at nothing to regain his power source to\r\nescape and wreck his wrath on trillions.\r\n\r\nNaturally, it is up to Scott, Hope, and the team to find a way to fight the\r\nevil and powerful Kang to save the day.\r\n\r\nThe film is a darker tale than people might expect from an Ant-man movie\r\nbut in kicking off Phase 5 of the Marvel Cinematic Universe, the movie is\r\na visual splendor filled with amazing visuals, landscapes, and characters.\r\n\r\nThe film takes a bit of time to get to the action but when it arrives it\r\ndelivers and the performance of Majors as Kang is captivating it will\r\nbe interesting to see where the storyline evolves over the next series of\r\nfilms leading up to “The Avengers: The Kang Dynasty” and beyond.\r\n\r\n“Ant-man and the Wasp: Quantumania may not break loads of new ground in\r\nterms of a Marvel film but Director Peyton Reed knows the characters well\r\nand delivers a story that should resonate with the fans and the strong\r\ncast and addition of Majors along with the great visuals make this\r\nanother winner for Marvel.\r\n\r\n4 stars out of 5", "created_at": "2023-02-16T01:33:54.605Z"}, {"movie_id": 640146, "review_id": "63ef89b135818f0081d2f4d9", "author_rating": 5.0, "review_text": "I was really excited for this film; the trailers made the stakes seem high with a story that was somewhat mature in tone. Unfortunately, I was ultimately let down.\r\n\r\nThe overarching plot was pretty good. I liked the arcs our characters had, particularly Scott and Cassie Lang. But the minor details are where things get messy. We get introduced to so many new characters, concepts, and story details in the quantum realm, resulting in an overall film that is not very digestible. There is too much going on and not enough time to fully flesh out the details.\r\n\r\nThe dialogue is pretty poorly written. At some points in the film, I was literally laughing out loud at what the characters were saying. It felt exactly like a TikTok skit exaggerating and mocking superhero movies. Cassie Lang has one line that is probably THE MOST CRINGY LINE EVER SPOKEN IN THE MCU.\r\n\r\nThe performances were decent overall. Most of the acting in the Ant-Man films is a little cheesy and campy, which mostly works in the small-scale stories they tell. But with the large, expanding story that the film is attempting to deliver, it just felt cheap. Kang is really amazing. Jonathan Majors was a tier above the rest of the cast; I can't wait to see more of him but also feel like he was wasted here.\r\n\r\nFinally, the visuals were really inconsistent. Some scenes looked quite good, with interesting and detailed settings, while others clearly featured three characters standing in front of a green screen. I mean, in some scenes I swear I could see slight black outlines from the keying technology. Where is the budget going in these films? They really need to slow down in postproduction because this is becoming a major theme. One thing I will note is that I thought MODOK looked really good. It was always going to be difficult to pull off a live action version of him, but they did a stellar job.\r\n\r\nOverall, I am pretty disappointed in the movie, but the movie gave me enough to make this a somewhat average experience. The MCU needs to pick it up this year because it is on a major downward trajectory.\r\n\r\nScore: 52% |\r\nVerdict: Average", "created_at": "2023-02-17T14:05:37.916Z"}, {"movie_id": 640146, "review_id": "63efaab235818f0085ea08a8", "author_rating": 6.0, "review_text": "**Quantumania is a step up from most of Phase Four. It felt like a Thor: Ragnarok impersonation, and lost the fun of the other Ant-Man films.**\r\n\r\nMy feelings are so mixed on Ant-Man and the Wasp: Quantumania. The first two Ant-Man movies were so great because they were low-stakes with self-contained stories that weren't consumed with saving the universe but instead were set in less a fantastical world that allowed the goofy size-changing antics really shine. Quantumania threw Ant-Man into an outrageous world, changing him from the zany character of the film to the normal character and stripping him of some of his charm. Quantumania felt like a cross between Thor: Ragnarok and Rise of Skywalker with some Power Rangers sprinkled in there, and the result was… decent. It really wasn't a bad movie. It has some funny parts and was better than most of Phase 4. Bill Murray was loads of fun for his brief part and Jonathan Majors is going to be an awesome big bad in the MCU. But it all felt like a familiar save the universe comic book movie and sadly made Ant-Man feel out of place in his own film.", "created_at": "2023-02-17T16:26:26.388Z"}, {"movie_id": 640146, "review_id": "63f10aeacaaca200892e0978", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/ant-man-and-the-wasp-quantumania-review\r\n\r\n\"Ant-Man and the Wasp: Quantumania warrants the divisive reception. Immersive visuals, more than satisfying action, and absolutely exceptional performances, aside from Kathryn Newton due to lack of direction. Unfortunately, the excessive, repetitive, unnecessary dialogue driven by exposition, along with a lack of stronger tonal balance - fewer jokes by Marvel standard, but the cringe level affects transitions to/from more serious moments - and an underdeveloped narrative devoid of true stakes - character arcs are almost non-existent - make this an overall very inconsistent watch. Still, JONATHAN MAJORS AS KANG! Wow!\"\r\n\r\nRating: C", "created_at": "2023-02-18T17:29:14.364Z"}, {"movie_id": 640146, "review_id": "63f7f54f46f35400bc6881fd", "author_rating": 6.0, "review_text": "\"Oh, Daddy - It's all my fault!\". Well no \"Cassie\" (Kathryn Newton), not quite. You certainly developed the piece of communications kit that lands everyone in the quantum soup, but the blame really must go to Peyton Reed and Jeff Loveness for directing and writing this latest emanation from Marvel's increasingly un-special film factory. It starts off with a great little device that could quickly put Papa John's out of business before we are sucked into the cantina from \"Star Wars\" (1977) where our recently arrived travellers find themselves pursued by the ridiculously un-menacing \"M.O.D.O.K\" - a sort of robotic killing version of the golden statue from the top of \"Raiders of the Lost Ark\" (1981) after it had had a good time with \"V.I.N.C.E.N.T\" from \"The Black Hole\" (1979) - before Michelle Pfeiffer \"Janet\" explains to her family (and to us) just what has led them to a predicament where they must avoid the evil clutches of \"Kang the Conqueror\" (Jonathan Majors). Now this gift that keeps on giving for this studio never struggles to impress visually, and the imagination of those who create these magical effects and alien shapes and sizes must be commended. However, this latest offering featuring, in my view, the weakest of their arsenal of characters is just entirely derivative and unremarkable. Aside from a very few bon-mots from Paul Rudd the dialogue is dry and the action scenes are all concentrated in one or two sequences whilst the rest of this serves as little better than colourful padding for the thinnest of storylines. Rudd is quite an unassuming kind of actor. Engaging, yes - but somehow just too lightweight for the grandness of the surrounding imagery. Michael Douglas (\"Pym\") features sparingly and the cameo from Bill Murray might have worked better in \"Guardians of the Galaxy\" - here it is almost laughable. If these are to keep coming off the production line as thickly and quickly as seems likely, then somebody somewhere is going to have to spend much more effort on developing stronger and more compelling stories because the audiences are surely immune to the vibrancy of the special effects by now. This is really forgettable fayre.", "created_at": "2023-02-23T23:22:55.565Z"}, {"movie_id": 640146, "review_id": "6411f541323eba010b927262", "author_rating": 9.0, "review_text": "A fun one!\r\n\r\nI had a terrific time watching <em>'Ant-Man and the Wasp: Quantumania'</em>, despite hearing 'meh' things about it here and there online. It surpassed my expectations, to be honest. Great cast, entertaining action, super interesting world building (my favourite from the MCU for a while, in that regard) and the humour is good.\r\n\r\nStar of the show in my opinion is Michelle Pfeiffer. I don't recall her standing out in <em>'Ant-Man and the Wasp'</em>, but here she's excellent from beginning to end. Elsewhere, Jonathan Majors is brilliant - great to see that guy all over the place recently. Paul Rudd remains a strong lead, while the likes of Michael Douglas and Kathryn Newton are positives too.\r\n\r\nLove the Quantum Realm setting. I'm nothing like an MCU nut, I'm only aware of the films, so didn't know what to expect, but the place looks fantastic - from the enviroment to the creatures; shoutout Veb. Like Pfeiffer, Corey Stoll didn't really register on my radar in prior films, but him as M.O.D.O.K. is a lot of fun.\r\n\r\nLooking at my personal MCU ranking, this goes in at no. 8 - I didn't anticipate that! A literal quick glance at the average rating on here suggests I'm in the minority but I truly found much enjoyment from this. Quite the improvement on Ant-Man 2, which is at the bottom of my aforementioned ranking.", "created_at": "2023-03-15T16:41:38.033Z"}, {"movie_id": 640146, "review_id": "644047b7dd47160775814fe9", "author_rating": 1.0, "review_text": "worst movie. Even that much money - too much btw - for special effects cant hide Reed's lacking effort to build a believable world. It's a poor and passionless visual copy of something like Star Wars Mini... with minimal humor and zero originality. RIP Marvel.", "created_at": "2023-04-19T19:57:43.688Z"}, {"movie_id": 640146, "review_id": "6444cbeb2c6b7b02fc7edd79", "author_rating": 3.0, "review_text": "When it comes to their Marvel properties, there’s this slightly morbid insistence by Disney to tie every teeny tiny detail of previous movies, television shows, and character arcs together in obsessive fashion. It’s becoming such an uncontrollable urge by the studio to engage in this behavior that the cause-and-effect is resulting in disasters like “Eternals,” “Thor: Love and Thunder,” and now, “Ant-Man and the Wasp: Quantumania.”\r\n\r\nTrying too hard to force a non-story into the already lame Ant-Man mythology, the film reunites superhero partners Scott Lang (Paul Rudd) and Hope Van Dyne (Evangeline Lilly) as Ant-Man and the Wasp. The pair find themselves thrust into the dangerous Quantum Realm along with Hope’s parents Hank Pym (Michael Douglas) and Janet Van Dyne (Michelle Pfeiffer), along with Scott’s teenage daughter, Cassie (Kathryn Newton). As they explore the unusual terrain and alien society filled with strange creatures, Janet reveals that she didn’t quite tell the group everything about the three decades she spent trapped in the realm. Facing new dangers from supervillan Kang the Conquerer (Jonathan Majors), the family must unite to stop a worldwide disaster.\r\n\r\nVery little about this project feels like a satisfying superhero movie and instead, it’s more like an assemblage of other (and far better) science fiction films. If not for the titanic budget and big-name stars, it could almost be mistaken for a Redbox “mockbuster” of “Star Wars,” “Mad Max,” “Avatar,” and “Godzilla” combined.\r\n\r\nThe film takes place extensively in the Quantum Realm, which provides an unsightly setting of muted, dark brown, washed-out visuals. It’s an ugly place, so who why would audiences want to spend time there? The Realm is a melting pot of exotic creatures and peculiar inhabitants that appear to have waltzed right out of the Mos Eisley Cantina on Tatooine. They’re cool to look at I guess, but was the point to make the film more appealing to children, or was it Disney’s way of appeasing the animators by letting them have some fun?\r\n\r\nThe first third of the film seems like it’s Janet’s show, as she keeps bringing up the fact that she has all these secrets that she won’t spill to Hope and Hank (even though they’re all stuck in the Realm together). There’s no compelling mystery nor reveal. Screenwriter Jeff Loveness is grasping at straws to craft a somewhat cohesive story while also struggling to make it fit into the MCU mythology. At some point, I wish someone would just make a damn standalone Marvel superhero movie and quit worrying about who and what goes where and how.\r\n\r\nThe story is frequently erratic. There’s plenty of energetic CGI action, but there also some moments that play like a touching family drama, some that create an anti-climatic post-apocalyptic narrative, and lots of failed attempts at comic relief. The film also has recurring (and awkward) socially conscious messaging that doesn’t entirely feel out of place, but it is aggressive (there’s even a direct mention of socialism by one of the characters, which will really aggravate already-angry conservatives).\r\n\r\nThe screenplay is peppered with dreadful one-liners like “it’s never too late to stop being a dick!” and “ants don’t give up!” I really, really wish I was joking about this.\r\n\r\nThe remainder of the movie features a lot of talk about time, the desire to get home, and — Marvel fans, you know what’s coming — the multiverse! It’s that one little word that means endless movies, endless stories, and endless money. It’s also the easy way to guarantee that all of these films in the canon always have a cop-out to lazily excuse away any inconsistencies (not that many of us could keep up or remember anyway).\r\n\r\nAnother major problem with the film is that it can only chug along on Rudd’s likeability (and the cast’s talent) for so long. It’s barely tolerable until Kang shows up, but he’s a wickedly delicious character portrayed by a terrific actor (it’s a real shame that this had to be the film for Majors’ MCU debut). In fact, the entire cast deserves better. Despite all of them turning in strong performances, they still feel mostly wasted here.\r\n\r\n“Ant-Man and the Wasp: Quantumania” lacks the memorable spectacle that most superhero films need in order to succeed. There’s no massively rousing, crowd-pleasing moment, and it’s one of the more unremarkable entries in the MCU.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS**", "created_at": "2023-04-23T06:10:51.993Z"}, {"movie_id": 640146, "review_id": "64498ab70f21c604ec28527a", "author_rating": 6.0, "review_text": "Okay, there are a plethora of reviews here by Marvelettes and more, so I will only give my gut response. Perhaps this movie was doomed to disappoint me, because Ant Man is still my favorite Marvel film of all for its wit and humor. That humor grew out of his interaction with his daughter and other people. This movie removes him to a strange complex world that struck me as a cross between the bar in Star Wars and the deserts of Dune. He was out of his element with his grown daughter and now-aged  cohorts and it left me rather bored, surprisingly. But without my baggage, I am sure others enjoyed it immensely.", "created_at": "2023-04-26T20:33:59.430Z"}, {"movie_id": 640146, "review_id": "648e9f50559d2200ad8278ad", "author_rating": 8.0, "review_text": "Honestly this is easily my favorite out of the series. Still funny as normal but there's a lot more action and cool looking stuff in this movie. Really good movie.", "created_at": "2023-06-18T06:08:16.836Z"}, {"movie_id": 640146, "review_id": "64d9ed77b77d4b113fc3ecc6", "author_rating": 8.0, "review_text": "This one was quite good actually. Marvel is quite a bit of hit and miss lately. It all depends on whether one of the woke retards has gotten their grubby hands on the script or not.\r\n\r\nIt was of course encouraging that the woke “critics” on the well known rubbish site Rotten Tomatoes declared it rotten while it got a 82% score from the actual audience. Always a good sign for a movie.\r\n\r\nThe movie is a pure adventure movie meant to entertain the audience. The script is decent and, as usual with a Marvel movie, serves mainly to create a reason for doing action sequences and lots and lots of special effects.\r\n\r\nThe adventure is mixed in with some humor but it is generally okay and not overdone.\r\n\r\nThe scenery in the quantum world is fantastic and the creatures are great ranging from terrifying to quite fun. Bringing in Bill Murray was a nice surprise even though he was a bit of a bad guy and quite short lived.\r\n\r\nThe one character I really didn’t like was Paul Rudd as the Ant-Man. His anti-hero bullshit, reluctance to fight and generally being a douche until he was forced to actually do what was right was really grating on me.\r\n\r\nOverall though this was some well spent two hours.", "created_at": "2023-08-14T09:01:43.895Z"}, {"movie_id": 640146, "review_id": "63eceb548e8702009ec2466f", "author_rating": null, "review_text": "In general, the Ant-Man films have been well received by critics and audiences alike, with the films' unique blend of humor, action, and heart, as well as the performances of the cast members, widely praised. particular Paul Rudd as the titular Ant-Man So \"Ant-Man 3\" is likely to be eagerly awaited by Marvel fans and moviegoers in general.\r\n\r\nYou can find the full review at https://aarcflick.blogspot.com/2022/12/ant-man-and-wasp-quantumania-2023-movie.html", "created_at": "2023-02-15T14:25:24.555Z"}, {"movie_id": 640146, "review_id": "63ed8802699fb7009e3dd88b", "author_rating": null, "review_text": "Life for Scott Lang (Paul Rudd) is good. He is basking in the recognition\r\n\r\nand fame that has come with his work with the Avengers and saving half the\r\n\r\nuniverse from Thanos and has even become a best-selling author.\r\n\r\nHe has a successful relationship with Hope (Evangeline Lilly) who has\r\ntaken her father’s company to new heights and they have managed to blend\r\ntheir personal and professional lives and enjoy a very happy life.\r\n\r\nScott does worry about his daughter Cassie (Kathryn Newton) as he lost\r\nseveral years with her during the Blip and she is an activist who has been\r\narrested for her efforts including a hysterical prank on the police with\r\nPym technology.\r\n\r\nCassie is constantly on her father for not doing more as she feels that he\r\nis more focused on the past battles with the Avengers and not the day to\r\nday struggles people are facing. Over dinner, she tells Hope and her dad as\r\nwell as Hank (Michael Douglas), and Janet (Michelle Pfeiffer), whom she\r\nstudied Hank’s journals while they were in the Blip and has developed a\r\nQuantum beacon which can map the Quantum Realm without having to venture\r\nto the sub-atomic relay where until recently nobody had been able to\r\nreturn from.\r\n\r\nThis news sends Janet into a panic during a demonstration and the four are\r\nsoon sucked into the realm and discover a diverse and thriving ecosystem\r\nas well as an abundance of strange and dangerous creatures.\r\n\r\nJanet is clearly hiding something and is frantic that they must leave but\r\ntheir party has been scattered and they soon learn that she fears and\r\nindividual known as Kang (Jonathan Majors).\r\nWhile she was trapped in the realm for thirty years, Janet encountered\r\nKing and helped him regain his power source but in doing so, learned he\r\nwas a banished conquerer who can manipulate time, space, and the\r\nmultiverse.\r\n\r\nHer actions to trap Kang and lead a resistance to the vast empire he\r\ncreated has set the stage as Janet has now returned to see what has\r\ndeveloped and Kang will stop at nothing to regain his power source to\r\nescape and wreck his wrath on trillions.\r\n\r\nNaturally, it is up to Scott, Hope, and the team to find a way to fight the\r\nevil and powerful Kang to save the day.\r\n\r\nThe film is a darker tale than people might expect from an Ant-man movie\r\nbut in kicking off Phase 5 of the Marvel Cinematic Universe, the movie is\r\na visual splendor filled with amazing visuals, landscapes, and characters.\r\n\r\nThe film takes a bit of time to get to the action but when it arrives it\r\ndelivers and the performance of Majors as Kang is captivating it will\r\nbe interesting to see where the storyline evolves over the next series of\r\nfilms leading up to “The Avengers: The Kang Dynasty” and beyond.\r\n\r\n“Ant-man and the Wasp: Quantumania may not break loads of new ground in\r\nterms of a Marvel film but Director Peyton Reed knows the characters well\r\nand delivers a story that should resonate with the fans and the strong\r\ncast and addition of Majors along with the great visuals make this\r\nanother winner for Marvel.\r\n\r\n4 stars out of 5", "created_at": "2023-02-16T01:33:54.605Z"}, {"movie_id": 640146, "review_id": "63ef89b135818f0081d2f4d9", "author_rating": 5.0, "review_text": "I was really excited for this film; the trailers made the stakes seem high with a story that was somewhat mature in tone. Unfortunately, I was ultimately let down.\r\n\r\nThe overarching plot was pretty good. I liked the arcs our characters had, particularly Scott and Cassie Lang. But the minor details are where things get messy. We get introduced to so many new characters, concepts, and story details in the quantum realm, resulting in an overall film that is not very digestible. There is too much going on and not enough time to fully flesh out the details.\r\n\r\nThe dialogue is pretty poorly written. At some points in the film, I was literally laughing out loud at what the characters were saying. It felt exactly like a TikTok skit exaggerating and mocking superhero movies. Cassie Lang has one line that is probably THE MOST CRINGY LINE EVER SPOKEN IN THE MCU.\r\n\r\nThe performances were decent overall. Most of the acting in the Ant-Man films is a little cheesy and campy, which mostly works in the small-scale stories they tell. But with the large, expanding story that the film is attempting to deliver, it just felt cheap. Kang is really amazing. Jonathan Majors was a tier above the rest of the cast; I can't wait to see more of him but also feel like he was wasted here.\r\n\r\nFinally, the visuals were really inconsistent. Some scenes looked quite good, with interesting and detailed settings, while others clearly featured three characters standing in front of a green screen. I mean, in some scenes I swear I could see slight black outlines from the keying technology. Where is the budget going in these films? They really need to slow down in postproduction because this is becoming a major theme. One thing I will note is that I thought MODOK looked really good. It was always going to be difficult to pull off a live action version of him, but they did a stellar job.\r\n\r\nOverall, I am pretty disappointed in the movie, but the movie gave me enough to make this a somewhat average experience. The MCU needs to pick it up this year because it is on a major downward trajectory.\r\n\r\nScore: 52% |\r\nVerdict: Average", "created_at": "2023-02-17T14:05:37.916Z"}, {"movie_id": 640146, "review_id": "63efaab235818f0085ea08a8", "author_rating": 6.0, "review_text": "**Quantumania is a step up from most of Phase Four. It felt like a Thor: Ragnarok impersonation, and lost the fun of the other Ant-Man films.**\r\n\r\nMy feelings are so mixed on Ant-Man and the Wasp: Quantumania. The first two Ant-Man movies were so great because they were low-stakes with self-contained stories that weren't consumed with saving the universe but instead were set in less a fantastical world that allowed the goofy size-changing antics really shine. Quantumania threw Ant-Man into an outrageous world, changing him from the zany character of the film to the normal character and stripping him of some of his charm. Quantumania felt like a cross between Thor: Ragnarok and Rise of Skywalker with some Power Rangers sprinkled in there, and the result was… decent. It really wasn't a bad movie. It has some funny parts and was better than most of Phase 4. Bill Murray was loads of fun for his brief part and Jonathan Majors is going to be an awesome big bad in the MCU. But it all felt like a familiar save the universe comic book movie and sadly made Ant-Man feel out of place in his own film.", "created_at": "2023-02-17T16:26:26.388Z"}, {"movie_id": 640146, "review_id": "63f10aeacaaca200892e0978", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/ant-man-and-the-wasp-quantumania-review\r\n\r\n\"Ant-Man and the Wasp: Quantumania warrants the divisive reception. Immersive visuals, more than satisfying action, and absolutely exceptional performances, aside from Kathryn Newton due to lack of direction. Unfortunately, the excessive, repetitive, unnecessary dialogue driven by exposition, along with a lack of stronger tonal balance - fewer jokes by Marvel standard, but the cringe level affects transitions to/from more serious moments - and an underdeveloped narrative devoid of true stakes - character arcs are almost non-existent - make this an overall very inconsistent watch. Still, JONATHAN MAJORS AS KANG! Wow!\"\r\n\r\nRating: C", "created_at": "2023-02-18T17:29:14.364Z"}, {"movie_id": 640146, "review_id": "63f7f54f46f35400bc6881fd", "author_rating": 6.0, "review_text": "\"Oh, Daddy - It's all my fault!\". Well no \"Cassie\" (Kathryn Newton), not quite. You certainly developed the piece of communications kit that lands everyone in the quantum soup, but the blame really must go to Peyton Reed and Jeff Loveness for directing and writing this latest emanation from Marvel's increasingly un-special film factory. It starts off with a great little device that could quickly put Papa John's out of business before we are sucked into the cantina from \"Star Wars\" (1977) where our recently arrived travellers find themselves pursued by the ridiculously un-menacing \"M.O.D.O.K\" - a sort of robotic killing version of the golden statue from the top of \"Raiders of the Lost Ark\" (1981) after it had had a good time with \"V.I.N.C.E.N.T\" from \"The Black Hole\" (1979) - before Michelle Pfeiffer \"Janet\" explains to her family (and to us) just what has led them to a predicament where they must avoid the evil clutches of \"Kang the Conqueror\" (Jonathan Majors). Now this gift that keeps on giving for this studio never struggles to impress visually, and the imagination of those who create these magical effects and alien shapes and sizes must be commended. However, this latest offering featuring, in my view, the weakest of their arsenal of characters is just entirely derivative and unremarkable. Aside from a very few bon-mots from Paul Rudd the dialogue is dry and the action scenes are all concentrated in one or two sequences whilst the rest of this serves as little better than colourful padding for the thinnest of storylines. Rudd is quite an unassuming kind of actor. Engaging, yes - but somehow just too lightweight for the grandness of the surrounding imagery. Michael Douglas (\"Pym\") features sparingly and the cameo from Bill Murray might have worked better in \"Guardians of the Galaxy\" - here it is almost laughable. If these are to keep coming off the production line as thickly and quickly as seems likely, then somebody somewhere is going to have to spend much more effort on developing stronger and more compelling stories because the audiences are surely immune to the vibrancy of the special effects by now. This is really forgettable fayre.", "created_at": "2023-02-23T23:22:55.565Z"}, {"movie_id": 640146, "review_id": "6411f541323eba010b927262", "author_rating": 9.0, "review_text": "A fun one!\r\n\r\nI had a terrific time watching <em>'Ant-Man and the Wasp: Quantumania'</em>, despite hearing 'meh' things about it here and there online. It surpassed my expectations, to be honest. Great cast, entertaining action, super interesting world building (my favourite from the MCU for a while, in that regard) and the humour is good.\r\n\r\nStar of the show in my opinion is Michelle Pfeiffer. I don't recall her standing out in <em>'Ant-Man and the Wasp'</em>, but here she's excellent from beginning to end. Elsewhere, Jonathan Majors is brilliant - great to see that guy all over the place recently. Paul Rudd remains a strong lead, while the likes of Michael Douglas and Kathryn Newton are positives too.\r\n\r\nLove the Quantum Realm setting. I'm nothing like an MCU nut, I'm only aware of the films, so didn't know what to expect, but the place looks fantastic - from the enviroment to the creatures; shoutout Veb. Like Pfeiffer, Corey Stoll didn't really register on my radar in prior films, but him as M.O.D.O.K. is a lot of fun.\r\n\r\nLooking at my personal MCU ranking, this goes in at no. 8 - I didn't anticipate that! A literal quick glance at the average rating on here suggests I'm in the minority but I truly found much enjoyment from this. Quite the improvement on Ant-Man 2, which is at the bottom of my aforementioned ranking.", "created_at": "2023-03-15T16:41:38.033Z"}, {"movie_id": 640146, "review_id": "644047b7dd47160775814fe9", "author_rating": 1.0, "review_text": "worst movie. Even that much money - too much btw - for special effects cant hide Reed's lacking effort to build a believable world. It's a poor and passionless visual copy of something like Star Wars Mini... with minimal humor and zero originality. RIP Marvel.", "created_at": "2023-04-19T19:57:43.688Z"}, {"movie_id": 640146, "review_id": "6444cbeb2c6b7b02fc7edd79", "author_rating": 3.0, "review_text": "When it comes to their Marvel properties, there’s this slightly morbid insistence by Disney to tie every teeny tiny detail of previous movies, television shows, and character arcs together in obsessive fashion. It’s becoming such an uncontrollable urge by the studio to engage in this behavior that the cause-and-effect is resulting in disasters like “Eternals,” “Thor: Love and Thunder,” and now, “Ant-Man and the Wasp: Quantumania.”\r\n\r\nTrying too hard to force a non-story into the already lame Ant-Man mythology, the film reunites superhero partners Scott Lang (Paul Rudd) and Hope Van Dyne (Evangeline Lilly) as Ant-Man and the Wasp. The pair find themselves thrust into the dangerous Quantum Realm along with Hope’s parents Hank Pym (Michael Douglas) and Janet Van Dyne (Michelle Pfeiffer), along with Scott’s teenage daughter, Cassie (Kathryn Newton). As they explore the unusual terrain and alien society filled with strange creatures, Janet reveals that she didn’t quite tell the group everything about the three decades she spent trapped in the realm. Facing new dangers from supervillan Kang the Conquerer (Jonathan Majors), the family must unite to stop a worldwide disaster.\r\n\r\nVery little about this project feels like a satisfying superhero movie and instead, it’s more like an assemblage of other (and far better) science fiction films. If not for the titanic budget and big-name stars, it could almost be mistaken for a Redbox “mockbuster” of “Star Wars,” “Mad Max,” “Avatar,” and “Godzilla” combined.\r\n\r\nThe film takes place extensively in the Quantum Realm, which provides an unsightly setting of muted, dark brown, washed-out visuals. It’s an ugly place, so who why would audiences want to spend time there? The Realm is a melting pot of exotic creatures and peculiar inhabitants that appear to have waltzed right out of the Mos Eisley Cantina on Tatooine. They’re cool to look at I guess, but was the point to make the film more appealing to children, or was it Disney’s way of appeasing the animators by letting them have some fun?\r\n\r\nThe first third of the film seems like it’s Janet’s show, as she keeps bringing up the fact that she has all these secrets that she won’t spill to Hope and Hank (even though they’re all stuck in the Realm together). There’s no compelling mystery nor reveal. Screenwriter Jeff Loveness is grasping at straws to craft a somewhat cohesive story while also struggling to make it fit into the MCU mythology. At some point, I wish someone would just make a damn standalone Marvel superhero movie and quit worrying about who and what goes where and how.\r\n\r\nThe story is frequently erratic. There’s plenty of energetic CGI action, but there also some moments that play like a touching family drama, some that create an anti-climatic post-apocalyptic narrative, and lots of failed attempts at comic relief. The film also has recurring (and awkward) socially conscious messaging that doesn’t entirely feel out of place, but it is aggressive (there’s even a direct mention of socialism by one of the characters, which will really aggravate already-angry conservatives).\r\n\r\nThe screenplay is peppered with dreadful one-liners like “it’s never too late to stop being a dick!” and “ants don’t give up!” I really, really wish I was joking about this.\r\n\r\nThe remainder of the movie features a lot of talk about time, the desire to get home, and — Marvel fans, you know what’s coming — the multiverse! It’s that one little word that means endless movies, endless stories, and endless money. It’s also the easy way to guarantee that all of these films in the canon always have a cop-out to lazily excuse away any inconsistencies (not that many of us could keep up or remember anyway).\r\n\r\nAnother major problem with the film is that it can only chug along on Rudd’s likeability (and the cast’s talent) for so long. It’s barely tolerable until Kang shows up, but he’s a wickedly delicious character portrayed by a terrific actor (it’s a real shame that this had to be the film for Majors’ MCU debut). In fact, the entire cast deserves better. Despite all of them turning in strong performances, they still feel mostly wasted here.\r\n\r\n“Ant-Man and the Wasp: Quantumania” lacks the memorable spectacle that most superhero films need in order to succeed. There’s no massively rousing, crowd-pleasing moment, and it’s one of the more unremarkable entries in the MCU.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS**", "created_at": "2023-04-23T06:10:51.993Z"}, {"movie_id": 640146, "review_id": "64498ab70f21c604ec28527a", "author_rating": 6.0, "review_text": "Okay, there are a plethora of reviews here by Marvelettes and more, so I will only give my gut response. Perhaps this movie was doomed to disappoint me, because Ant Man is still my favorite Marvel film of all for its wit and humor. That humor grew out of his interaction with his daughter and other people. This movie removes him to a strange complex world that struck me as a cross between the bar in Star Wars and the deserts of Dune. He was out of his element with his grown daughter and now-aged  cohorts and it left me rather bored, surprisingly. But without my baggage, I am sure others enjoyed it immensely.", "created_at": "2023-04-26T20:33:59.430Z"}, {"movie_id": 640146, "review_id": "648e9f50559d2200ad8278ad", "author_rating": 8.0, "review_text": "Honestly this is easily my favorite out of the series. Still funny as normal but there's a lot more action and cool looking stuff in this movie. Really good movie.", "created_at": "2023-06-18T06:08:16.836Z"}, {"movie_id": 640146, "review_id": "64d9ed77b77d4b113fc3ecc6", "author_rating": 8.0, "review_text": "This one was quite good actually. Marvel is quite a bit of hit and miss lately. It all depends on whether one of the woke retards has gotten their grubby hands on the script or not.\r\n\r\nIt was of course encouraging that the woke “critics” on the well known rubbish site Rotten Tomatoes declared it rotten while it got a 82% score from the actual audience. Always a good sign for a movie.\r\n\r\nThe movie is a pure adventure movie meant to entertain the audience. The script is decent and, as usual with a Marvel movie, serves mainly to create a reason for doing action sequences and lots and lots of special effects.\r\n\r\nThe adventure is mixed in with some humor but it is generally okay and not overdone.\r\n\r\nThe scenery in the quantum world is fantastic and the creatures are great ranging from terrifying to quite fun. Bringing in Bill Murray was a nice surprise even though he was a bit of a bad guy and quite short lived.\r\n\r\nThe one character I really didn’t like was Paul Rudd as the Ant-Man. His anti-hero bullshit, reluctance to fight and generally being a douche until he was forced to actually do what was right was really grating on me.\r\n\r\nOverall though this was some well spent two hours.", "created_at": "2023-08-14T09:01:43.895Z"}, {"movie_id": 640146, "review_id": "63eceb548e8702009ec2466f", "author_rating": null, "review_text": "In general, the Ant-Man films have been well received by critics and audiences alike, with the films' unique blend of humor, action, and heart, as well as the performances of the cast members, widely praised. particular Paul Rudd as the titular Ant-Man So \"Ant-Man 3\" is likely to be eagerly awaited by Marvel fans and moviegoers in general.\r\n\r\nYou can find the full review at https://aarcflick.blogspot.com/2022/12/ant-man-and-wasp-quantumania-2023-movie.html", "created_at": "2023-02-15T14:25:24.555Z"}, {"movie_id": 640146, "review_id": "63ed8802699fb7009e3dd88b", "author_rating": null, "review_text": "Life for Scott Lang (Paul Rudd) is good. He is basking in the recognition\r\n\r\nand fame that has come with his work with the Avengers and saving half the\r\n\r\nuniverse from Thanos and has even become a best-selling author.\r\n\r\nHe has a successful relationship with Hope (Evangeline Lilly) who has\r\ntaken her father’s company to new heights and they have managed to blend\r\ntheir personal and professional lives and enjoy a very happy life.\r\n\r\nScott does worry about his daughter Cassie (Kathryn Newton) as he lost\r\nseveral years with her during the Blip and she is an activist who has been\r\narrested for her efforts including a hysterical prank on the police with\r\nPym technology.\r\n\r\nCassie is constantly on her father for not doing more as she feels that he\r\nis more focused on the past battles with the Avengers and not the day to\r\nday struggles people are facing. Over dinner, she tells Hope and her dad as\r\nwell as Hank (Michael Douglas), and Janet (Michelle Pfeiffer), whom she\r\nstudied Hank’s journals while they were in the Blip and has developed a\r\nQuantum beacon which can map the Quantum Realm without having to venture\r\nto the sub-atomic relay where until recently nobody had been able to\r\nreturn from.\r\n\r\nThis news sends Janet into a panic during a demonstration and the four are\r\nsoon sucked into the realm and discover a diverse and thriving ecosystem\r\nas well as an abundance of strange and dangerous creatures.\r\n\r\nJanet is clearly hiding something and is frantic that they must leave but\r\ntheir party has been scattered and they soon learn that she fears and\r\nindividual known as Kang (Jonathan Majors).\r\nWhile she was trapped in the realm for thirty years, Janet encountered\r\nKing and helped him regain his power source but in doing so, learned he\r\nwas a banished conquerer who can manipulate time, space, and the\r\nmultiverse.\r\n\r\nHer actions to trap Kang and lead a resistance to the vast empire he\r\ncreated has set the stage as Janet has now returned to see what has\r\ndeveloped and Kang will stop at nothing to regain his power source to\r\nescape and wreck his wrath on trillions.\r\n\r\nNaturally, it is up to Scott, Hope, and the team to find a way to fight the\r\nevil and powerful Kang to save the day.\r\n\r\nThe film is a darker tale than people might expect from an Ant-man movie\r\nbut in kicking off Phase 5 of the Marvel Cinematic Universe, the movie is\r\na visual splendor filled with amazing visuals, landscapes, and characters.\r\n\r\nThe film takes a bit of time to get to the action but when it arrives it\r\ndelivers and the performance of Majors as Kang is captivating it will\r\nbe interesting to see where the storyline evolves over the next series of\r\nfilms leading up to “The Avengers: The Kang Dynasty” and beyond.\r\n\r\n“Ant-man and the Wasp: Quantumania may not break loads of new ground in\r\nterms of a Marvel film but Director Peyton Reed knows the characters well\r\nand delivers a story that should resonate with the fans and the strong\r\ncast and addition of Majors along with the great visuals make this\r\nanother winner for Marvel.\r\n\r\n4 stars out of 5", "created_at": "2023-02-16T01:33:54.605Z"}, {"movie_id": 640146, "review_id": "63ef89b135818f0081d2f4d9", "author_rating": 5.0, "review_text": "I was really excited for this film; the trailers made the stakes seem high with a story that was somewhat mature in tone. Unfortunately, I was ultimately let down.\r\n\r\nThe overarching plot was pretty good. I liked the arcs our characters had, particularly Scott and Cassie Lang. But the minor details are where things get messy. We get introduced to so many new characters, concepts, and story details in the quantum realm, resulting in an overall film that is not very digestible. There is too much going on and not enough time to fully flesh out the details.\r\n\r\nThe dialogue is pretty poorly written. At some points in the film, I was literally laughing out loud at what the characters were saying. It felt exactly like a TikTok skit exaggerating and mocking superhero movies. Cassie Lang has one line that is probably THE MOST CRINGY LINE EVER SPOKEN IN THE MCU.\r\n\r\nThe performances were decent overall. Most of the acting in the Ant-Man films is a little cheesy and campy, which mostly works in the small-scale stories they tell. But with the large, expanding story that the film is attempting to deliver, it just felt cheap. Kang is really amazing. Jonathan Majors was a tier above the rest of the cast; I can't wait to see more of him but also feel like he was wasted here.\r\n\r\nFinally, the visuals were really inconsistent. Some scenes looked quite good, with interesting and detailed settings, while others clearly featured three characters standing in front of a green screen. I mean, in some scenes I swear I could see slight black outlines from the keying technology. Where is the budget going in these films? They really need to slow down in postproduction because this is becoming a major theme. One thing I will note is that I thought MODOK looked really good. It was always going to be difficult to pull off a live action version of him, but they did a stellar job.\r\n\r\nOverall, I am pretty disappointed in the movie, but the movie gave me enough to make this a somewhat average experience. The MCU needs to pick it up this year because it is on a major downward trajectory.\r\n\r\nScore: 52% |\r\nVerdict: Average", "created_at": "2023-02-17T14:05:37.916Z"}, {"movie_id": 640146, "review_id": "63efaab235818f0085ea08a8", "author_rating": 6.0, "review_text": "**Quantumania is a step up from most of Phase Four. It felt like a Thor: Ragnarok impersonation, and lost the fun of the other Ant-Man films.**\r\n\r\nMy feelings are so mixed on Ant-Man and the Wasp: Quantumania. The first two Ant-Man movies were so great because they were low-stakes with self-contained stories that weren't consumed with saving the universe but instead were set in less a fantastical world that allowed the goofy size-changing antics really shine. Quantumania threw Ant-Man into an outrageous world, changing him from the zany character of the film to the normal character and stripping him of some of his charm. Quantumania felt like a cross between Thor: Ragnarok and Rise of Skywalker with some Power Rangers sprinkled in there, and the result was… decent. It really wasn't a bad movie. It has some funny parts and was better than most of Phase 4. Bill Murray was loads of fun for his brief part and Jonathan Majors is going to be an awesome big bad in the MCU. But it all felt like a familiar save the universe comic book movie and sadly made Ant-Man feel out of place in his own film.", "created_at": "2023-02-17T16:26:26.388Z"}, {"movie_id": 640146, "review_id": "63f10aeacaaca200892e0978", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/ant-man-and-the-wasp-quantumania-review\r\n\r\n\"Ant-Man and the Wasp: Quantumania warrants the divisive reception. Immersive visuals, more than satisfying action, and absolutely exceptional performances, aside from Kathryn Newton due to lack of direction. Unfortunately, the excessive, repetitive, unnecessary dialogue driven by exposition, along with a lack of stronger tonal balance - fewer jokes by Marvel standard, but the cringe level affects transitions to/from more serious moments - and an underdeveloped narrative devoid of true stakes - character arcs are almost non-existent - make this an overall very inconsistent watch. Still, JONATHAN MAJORS AS KANG! Wow!\"\r\n\r\nRating: C", "created_at": "2023-02-18T17:29:14.364Z"}, {"movie_id": 640146, "review_id": "63f7f54f46f35400bc6881fd", "author_rating": 6.0, "review_text": "\"Oh, Daddy - It's all my fault!\". Well no \"Cassie\" (Kathryn Newton), not quite. You certainly developed the piece of communications kit that lands everyone in the quantum soup, but the blame really must go to Peyton Reed and Jeff Loveness for directing and writing this latest emanation from Marvel's increasingly un-special film factory. It starts off with a great little device that could quickly put Papa John's out of business before we are sucked into the cantina from \"Star Wars\" (1977) where our recently arrived travellers find themselves pursued by the ridiculously un-menacing \"M.O.D.O.K\" - a sort of robotic killing version of the golden statue from the top of \"Raiders of the Lost Ark\" (1981) after it had had a good time with \"V.I.N.C.E.N.T\" from \"The Black Hole\" (1979) - before Michelle Pfeiffer \"Janet\" explains to her family (and to us) just what has led them to a predicament where they must avoid the evil clutches of \"Kang the Conqueror\" (Jonathan Majors). Now this gift that keeps on giving for this studio never struggles to impress visually, and the imagination of those who create these magical effects and alien shapes and sizes must be commended. However, this latest offering featuring, in my view, the weakest of their arsenal of characters is just entirely derivative and unremarkable. Aside from a very few bon-mots from Paul Rudd the dialogue is dry and the action scenes are all concentrated in one or two sequences whilst the rest of this serves as little better than colourful padding for the thinnest of storylines. Rudd is quite an unassuming kind of actor. Engaging, yes - but somehow just too lightweight for the grandness of the surrounding imagery. Michael Douglas (\"Pym\") features sparingly and the cameo from Bill Murray might have worked better in \"Guardians of the Galaxy\" - here it is almost laughable. If these are to keep coming off the production line as thickly and quickly as seems likely, then somebody somewhere is going to have to spend much more effort on developing stronger and more compelling stories because the audiences are surely immune to the vibrancy of the special effects by now. This is really forgettable fayre.", "created_at": "2023-02-23T23:22:55.565Z"}, {"movie_id": 640146, "review_id": "6411f541323eba010b927262", "author_rating": 9.0, "review_text": "A fun one!\r\n\r\nI had a terrific time watching <em>'Ant-Man and the Wasp: Quantumania'</em>, despite hearing 'meh' things about it here and there online. It surpassed my expectations, to be honest. Great cast, entertaining action, super interesting world building (my favourite from the MCU for a while, in that regard) and the humour is good.\r\n\r\nStar of the show in my opinion is Michelle Pfeiffer. I don't recall her standing out in <em>'Ant-Man and the Wasp'</em>, but here she's excellent from beginning to end. Elsewhere, Jonathan Majors is brilliant - great to see that guy all over the place recently. Paul Rudd remains a strong lead, while the likes of Michael Douglas and Kathryn Newton are positives too.\r\n\r\nLove the Quantum Realm setting. I'm nothing like an MCU nut, I'm only aware of the films, so didn't know what to expect, but the place looks fantastic - from the enviroment to the creatures; shoutout Veb. Like Pfeiffer, Corey Stoll didn't really register on my radar in prior films, but him as M.O.D.O.K. is a lot of fun.\r\n\r\nLooking at my personal MCU ranking, this goes in at no. 8 - I didn't anticipate that! A literal quick glance at the average rating on here suggests I'm in the minority but I truly found much enjoyment from this. Quite the improvement on Ant-Man 2, which is at the bottom of my aforementioned ranking.", "created_at": "2023-03-15T16:41:38.033Z"}, {"movie_id": 640146, "review_id": "644047b7dd47160775814fe9", "author_rating": 1.0, "review_text": "worst movie. Even that much money - too much btw - for special effects cant hide Reed's lacking effort to build a believable world. It's a poor and passionless visual copy of something like Star Wars Mini... with minimal humor and zero originality. RIP Marvel.", "created_at": "2023-04-19T19:57:43.688Z"}, {"movie_id": 640146, "review_id": "6444cbeb2c6b7b02fc7edd79", "author_rating": 3.0, "review_text": "When it comes to their Marvel properties, there’s this slightly morbid insistence by Disney to tie every teeny tiny detail of previous movies, television shows, and character arcs together in obsessive fashion. It’s becoming such an uncontrollable urge by the studio to engage in this behavior that the cause-and-effect is resulting in disasters like “Eternals,” “Thor: Love and Thunder,” and now, “Ant-Man and the Wasp: Quantumania.”\r\n\r\nTrying too hard to force a non-story into the already lame Ant-Man mythology, the film reunites superhero partners Scott Lang (Paul Rudd) and Hope Van Dyne (Evangeline Lilly) as Ant-Man and the Wasp. The pair find themselves thrust into the dangerous Quantum Realm along with Hope’s parents Hank Pym (Michael Douglas) and Janet Van Dyne (Michelle Pfeiffer), along with Scott’s teenage daughter, Cassie (Kathryn Newton). As they explore the unusual terrain and alien society filled with strange creatures, Janet reveals that she didn’t quite tell the group everything about the three decades she spent trapped in the realm. Facing new dangers from supervillan Kang the Conquerer (Jonathan Majors), the family must unite to stop a worldwide disaster.\r\n\r\nVery little about this project feels like a satisfying superhero movie and instead, it’s more like an assemblage of other (and far better) science fiction films. If not for the titanic budget and big-name stars, it could almost be mistaken for a Redbox “mockbuster” of “Star Wars,” “Mad Max,” “Avatar,” and “Godzilla” combined.\r\n\r\nThe film takes place extensively in the Quantum Realm, which provides an unsightly setting of muted, dark brown, washed-out visuals. It’s an ugly place, so who why would audiences want to spend time there? The Realm is a melting pot of exotic creatures and peculiar inhabitants that appear to have waltzed right out of the Mos Eisley Cantina on Tatooine. They’re cool to look at I guess, but was the point to make the film more appealing to children, or was it Disney’s way of appeasing the animators by letting them have some fun?\r\n\r\nThe first third of the film seems like it’s Janet’s show, as she keeps bringing up the fact that she has all these secrets that she won’t spill to Hope and Hank (even though they’re all stuck in the Realm together). There’s no compelling mystery nor reveal. Screenwriter Jeff Loveness is grasping at straws to craft a somewhat cohesive story while also struggling to make it fit into the MCU mythology. At some point, I wish someone would just make a damn standalone Marvel superhero movie and quit worrying about who and what goes where and how.\r\n\r\nThe story is frequently erratic. There’s plenty of energetic CGI action, but there also some moments that play like a touching family drama, some that create an anti-climatic post-apocalyptic narrative, and lots of failed attempts at comic relief. The film also has recurring (and awkward) socially conscious messaging that doesn’t entirely feel out of place, but it is aggressive (there’s even a direct mention of socialism by one of the characters, which will really aggravate already-angry conservatives).\r\n\r\nThe screenplay is peppered with dreadful one-liners like “it’s never too late to stop being a dick!” and “ants don’t give up!” I really, really wish I was joking about this.\r\n\r\nThe remainder of the movie features a lot of talk about time, the desire to get home, and — Marvel fans, you know what’s coming — the multiverse! It’s that one little word that means endless movies, endless stories, and endless money. It’s also the easy way to guarantee that all of these films in the canon always have a cop-out to lazily excuse away any inconsistencies (not that many of us could keep up or remember anyway).\r\n\r\nAnother major problem with the film is that it can only chug along on Rudd’s likeability (and the cast’s talent) for so long. It’s barely tolerable until Kang shows up, but he’s a wickedly delicious character portrayed by a terrific actor (it’s a real shame that this had to be the film for Majors’ MCU debut). In fact, the entire cast deserves better. Despite all of them turning in strong performances, they still feel mostly wasted here.\r\n\r\n“Ant-Man and the Wasp: Quantumania” lacks the memorable spectacle that most superhero films need in order to succeed. There’s no massively rousing, crowd-pleasing moment, and it’s one of the more unremarkable entries in the MCU.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS**", "created_at": "2023-04-23T06:10:51.993Z"}, {"movie_id": 640146, "review_id": "64498ab70f21c604ec28527a", "author_rating": 6.0, "review_text": "Okay, there are a plethora of reviews here by Marvelettes and more, so I will only give my gut response. Perhaps this movie was doomed to disappoint me, because Ant Man is still my favorite Marvel film of all for its wit and humor. That humor grew out of his interaction with his daughter and other people. This movie removes him to a strange complex world that struck me as a cross between the bar in Star Wars and the deserts of Dune. He was out of his element with his grown daughter and now-aged  cohorts and it left me rather bored, surprisingly. But without my baggage, I am sure others enjoyed it immensely.", "created_at": "2023-04-26T20:33:59.430Z"}, {"movie_id": 640146, "review_id": "648e9f50559d2200ad8278ad", "author_rating": 8.0, "review_text": "Honestly this is easily my favorite out of the series. Still funny as normal but there's a lot more action and cool looking stuff in this movie. Really good movie.", "created_at": "2023-06-18T06:08:16.836Z"}, {"movie_id": 640146, "review_id": "64d9ed77b77d4b113fc3ecc6", "author_rating": 8.0, "review_text": "This one was quite good actually. Marvel is quite a bit of hit and miss lately. It all depends on whether one of the woke retards has gotten their grubby hands on the script or not.\r\n\r\nIt was of course encouraging that the woke “critics” on the well known rubbish site Rotten Tomatoes declared it rotten while it got a 82% score from the actual audience. Always a good sign for a movie.\r\n\r\nThe movie is a pure adventure movie meant to entertain the audience. The script is decent and, as usual with a Marvel movie, serves mainly to create a reason for doing action sequences and lots and lots of special effects.\r\n\r\nThe adventure is mixed in with some humor but it is generally okay and not overdone.\r\n\r\nThe scenery in the quantum world is fantastic and the creatures are great ranging from terrifying to quite fun. Bringing in Bill Murray was a nice surprise even though he was a bit of a bad guy and quite short lived.\r\n\r\nThe one character I really didn’t like was Paul Rudd as the Ant-Man. His anti-hero bullshit, reluctance to fight and generally being a douche until he was forced to actually do what was right was really grating on me.\r\n\r\nOverall though this was some well spent two hours.", "created_at": "2023-08-14T09:01:43.895Z"}]