[{"movie_id": 68718, "review_id": "5207b0bb760ee36305225258", "author_rating": null, "review_text": "America, mid-nineteenth century, just prior to the Civil War. Winter. Two horsebacked slave-traders are leading half-a-dozen manacled negro slaves through a large, unspecified section of Texas. As they move one night through a wood, they cross paths with an affable, charming German fellow identified by the hokey model tooth affixed atop his carriage by a spring as a travelling dentist. He greets the traders cordially but he's struggling to be understood; not because English is his second language (although he deferentially concedes as much when instructed - more than once - to \"Speak English!\") but because his vocabulary is far wider than that of the simpler men here before him. It's not a chance passing, either; this German fellow, who identifies himself as Dr. King Schultz (played by Christoph Waltz with the same smiling, deadly menace that earned him an Oscar statue for his part as Col. Hans Landa in Inglourious Basterds) is looking for these traders. More specifically, their inventory of negro slaves. Even more specifically, one of those slaves in particular. Django (Jamie Foxx, Collateral, Ray). Attempting to buy Django, Schultz is met with short, suspicious shrift and ordered at gunpoint to be on his way. Within a second, one trader lies dead and the other lies incapacitated underneath the bulk of his dead horse. Schultz unchains Django, instructs Django to take the dead fellow's horse and coat, and pays the remaining trader for all that he's taken. He then tosses the manacle key to the other slaves and posits two choices to them, as he sees it: Carry their injured master thirty-plus miles to the nearest town for medical assistance, or unchain themselves, blow the injured slave-trader's head off with the gun Shultz has left them, bury the corpses and use the Pole Star to run for the Northern states, where slavery had been abolished, and for more than fifty years in some areas. Funnily enough, they take up the latter option.\r\n\r\nSo begins Django Unchained, an oater set in the slave states of the Deep South and the latest rollercoaster by Gen-X movieland wunderkind Quentin Tarantino. Always clearly a man heavily informed by the grindhouse subgenre of the Spaghetti Western, he's finally made one himself, and if Quentin's your thing it's a blast, though I doubt it'll convert many Tarantino sceptics; in fact it'll almost certainly reinforce those things that people dislike about him, about which more later.\r\n\r\nIt transpires that Dr. Schultz ISN'T a dentist (\"I haven't practised dentistry in five years,\" he confides to Django over a beer) but a bounty hunter, and a lethal one at that. He's chasing down the Brittles, a murderous gang of brothers currently plying their trades as plantation overseers. He doesn't know what they look like but he knows they were recently employed at the Carrucan plantation, which is why he was searching for Django - a slave recently sold by that very plantation - in the first place; Django can point them out for him. Schultz is no fan of the South's backwards-thinking propensity for slavery though, and he offers Django a deal: help Schultz find and kill the Brittle Brothers, Schultz will treat Django like a free man, pay him $75 (a decent little wedge in 1858) and rubber-stamp his freedom. Along the way, he'll also teach Django a thing or two about the art of gunfighting and about the macabre trade of bounty-hunting (both in which Django proves to be a natural). On the trail of the Brittles, Schultz wonders aloud as to Django's plans once this endeavour is over and he's free. Well, as it happens, Django is a married man and his intention, once free, is to find his wife and buy her freedom. They'd tried to run from the Carrucan plantation together but they'd been caught, branded (both Django and his wife - played with all of her nerves exposed by Kerry Washington - sport R-For-Runaway scars on their cheeks) and sold on, separately. So he doesn't know where she is but that's what he's going to try to do. Schultz, feeling responsible for Django as the man granting him his freedom, proposes a further deal: If this Brittle bounty goes well, he'll honour Django's freedom but if Django stays with him through the winter as partners, taking on bounties and earning money, he'll help Django locate his wife.\r\n\r\nWhat we have here is a large sequence of set-pieces - some funny, some tense, some action-packed - stretched across very-nearly three hours (though, like most QT films, it moves like a bullet train and those three hours just fly) strung together by a fairly simple revenge/rescue tale set against a geographically sprawling backdrop; a reasonably similar template to many of Quentin's movies and an almost identical template to that of previous outing Inglourious Basterds, to which Django Unchained could almost be considered a companion piece despite the wildly different global and historical settings. Like Inglourious Basterds, Django Unchained is quite a bit longer than the story need be, and like Inglourious Basterds that is because each scene is treated by Tarantino as a mini movie, a contained set-piece all of its own. Every scene is fleshed out and deepened for either heightened comic or dramatic effect by lengthened sequences of characters going about the mundane or by characters delivering enormous monologues - rambling shaggy-dog stories, usually - to one another, for context. Not every scene is entirely necessary, either. I wouldn't call that a flaw though, I'd call it a trait typical of Quentin Tarantino; whether it's a flaw or an outright treat depends entirely on whether that's an element of Tarantino's writing that the viewer appreciates. Personally, I love Tarantino's writer's voice and I could watch these scenes for hours (indeed, I watched Django Unchained three times over the course of yesterday), but I can fully undersand what those lamenting the decent 90-minute film that's lost somewhere within the sojourns and speeches of Django Unchained are saying.\r\n\r\nPerformances throughout are utterly mesmerising, from stars Foxx and Waltz but also - in fact, maybe more so - from principle antagonists Leonardo DiCaprio as \"Monsieur\" Calvin Candie, the horrifying owner of the \"Candyland\" plantation currently holding the ownership deeds on Django's wife, and Samuel L. Jackson in an if-anything even more monstrous role as Stephen, Candie's elderly head house slave, a man who has utterly abndoned the culture and torment of his people in return for a few material trappings as the slave-in-chief. Playing to superb comedic effect is Don Johnson as Big Daddy, a strutting, peacock-like Tennessee dandy and owner of the plantation currently employing the Brittle Brothers, and delightful in cameo roles are (among many others) James Remar (The Warriors, Dexter), Jonah Hill (Superbad, The Watch), John Jarratt (Wolf Creek, Rogue) and Michael Parks (Red State, Kill Bill). Quentin himself makes a cameo as usual and, as usual, he's not as charming as he probably thinks he is, but he's also not as bad as many think he is, either. There's even a quick cameo (raising an involuntary cheer from me!) by Franco Nero, the original Django from the magnificent 1966 film of the same name by Sergio Corbucci (that's not the only nod back to the first Django movie; the opening credits to Django Unchained are presented in exactly the same way as the original, and the theme song to Quentin's film comes directly from the Corbucci film too).\r\n\r\nDjango Unchained is likely to come under fire on a couple of counts; possibly for it's incredible levels of bloodshed (one particular gunfight is the most blood-splattered scene I've seen in a movie since those elevator doors opened in The Shining), and much more probably for the liberal use of what guilty white folks like to refer to as \"The 'N'-word\", uttered literally hundreds of times from first scene to last. However, neither criticism is warranted in my humble opinion. The bloodshed is of the overexaggerated cartoon quality. Heads, arteries and extremities explode upon bullet impact like detonated watermelons to a gloopy, \"BLAAAPP!\" sound effect, the blood itself translucent, syrupy and intentionally unrealistic. And if a tale is set against the backdrop of slavery in the 19th century deep South, you're going to hear the word \"Nigger\" in that tale. Often. Be assured though that just as Inglourious Basterds was a revenge fantasy of the downtrodden Jewish war refugees over the stupidly evil Nazi Germans, this is a tale of empowerment of the enslaved black man over his sadistic, pig-ignorant white overseers.\r\n\r\nIf you like Tarantino, you'll probably like Django Unchained. If you like Westerns (and the blood-drenched Spaghetti Westerns of the late sixties in particular), you'll probably like Django Unchained. If, like me, you're an admirer of both Tarantino AND westerns, this is a no-brainer. Get and see it, it's a blast.\r\n\r\nI'd like to have seen him pull a Gatling gun out of a coffin, though.", "created_at": "2013-08-11T15:41:47.060Z"}, {"movie_id": 68718, "review_id": "589cfcabc3a3681158003356", "author_rating": 9.0, "review_text": "A highly entertaining yet disturbing film with superb cast and performances for an audience who would likely never consider watching a film fundamentally about slavery, where Tarantino is masterfully and emphatically navigating and exposing the complex layers of the violent and dehumanizing system of slavery.", "created_at": "2017-02-09T23:35:07.102Z"}, {"movie_id": 68718, "review_id": "590b2c6e9251414fa10150d3", "author_rating": 10.0, "review_text": "**ENTERTAINING from start to finish !!**\r\n\r\nGiven I am a big fan of **Quentin's** works i knew this movie would be a treat to watch.But what i didn't know was violence can be so **COOL**... The movie is a treat to watch(including the blood and gore) from starting to end.The acting is superb.And the cinematography is just too good! The whole cast played their parts to perfection...Especially **Samuel L. Jackson** and **Jamie Foxx**..**Leo and Christopher Waltz** were superb too..And as Christopher said in the movie - \"It was hard to RESIST\".A must watch for everyone who likes QUALITY cinema..Even the ones who cant stand BOOMs and BANGs, you wouldn't regret spending about 3 hours watching this well written, well directed and well acted GREAT movie !!", "created_at": "2017-05-04T13:28:14.365Z"}, {"movie_id": 68718, "review_id": "5ad7255c9251413b2b00d193", "author_rating": 10.0, "review_text": "This is one of the best movies I have watched in a long time. It is a pure Tarantino blast. The somewhat unexpected and quite hilarious start of the movie catches your attention from the start and from then on it is 3 hours (almost) of pure enjoyment. \n\nThe main actors are playing their roles very well. The Dr. King Schultz character (Christop Walz) is incredibly funny without being ridiculous, Jamie Foxx is excellent as Django and Leonardo DiCaprio is doing his role well as a plantation owner and slave trader. None of the rest of the crew stood out as particularly bad. Well with the possible exception of Tarantino himself then when he made his usual in-movie appearance a’ la Hitchcock. Not that he was particularly bad but he is no actor either.\n\nThe movie starts of by Dr. Schulz liberating Django and proceeding to a small town showing Django what he is in the business of doing. Those first minutes of the movie are somewhat unexpected and very funny to watch. After that the movie gets more serious as Django gets to learn to be a bounty hunter and finally gets on with his quest to rescue his “Damsel in distress”. It still has quite a bit of “Tarantino humour” sprinkled around in it though.\n\nDuring the movie we are treated to a long series of stereotypical people with, let us say, an “attitude” towards African people. It is tempting to say “nigger haters” but that would not be true since a lot of these people did not exactly hate them. They just did not consider African people to be people but more than live stock for them to use as they wished. Unlike a lot of movies portraying these events this one never comes across as boringly finger pointing or overly morally lecturing. Nor does it in any way support or glorify the way things were at this time. It is a movie made to entertain set in a period where bad shit happened and using it for the story. Nothing more and nothing less.\n\nAs usual with a Tarantino movie there are some violent parts, some more violent parts and some bloody violent parts in it. The ending fights are a glorious show of destruction and blood splatter. I am sure some people are complaining about the “unnecessary violence”. I am not one of those people. Without these parts it would not be a real Tarantino movie. As always it is made with the usual exaggeration that Tarantino is so good and which reminds you that it is “only a movie”.\nThis is one of the few movies that I have given 10 out of 10 stars in a very long time. I enjoyed it immensely.", "created_at": "2018-04-18T11:00:44.822Z"}, {"movie_id": 68718, "review_id": "5b72389dc3a3681899183b04", "author_rating": 9.0, "review_text": "When Django is unchained (pronounced JANG-oh, not Duh-JANG-oh)\r\n\r\nReleased in 2012 and directed & written by Quentin Tarantino, \"Django Unchained\" stars Christoph Waltz as an ex-dentist who befriends an ex-slave, Django (Jamie Foxx) in West Texas a couple of years before the Civil War; they team-up as bounty hunters once they realize how good they jell. The second half focuses on their attempt to infiltrate a Mississippi plantation owned by pompous Southerner \"Monsieur\" Candie (Leonardo DiCaprio) in order to rescue Django's wife (Kerry Washington). Samuel L. Jackson plays Candie's overly loyal house slave.\r\n\r\nThis is an excellent American Western with Spaghetti Western elements featuring Tarantino's typical artistic flourishes. It takes place in the West AND in the South, which is reminiscent of the underrated \"Nevada Smith\" (1966), one of my favorite Westerns. Waltz is magnetic as the nonchalant protagonist and he & Foxx have good chemistry. There's a nice mix of interesting dialogues, amusing moments and over-the-top action. Unfortunately, but to be expected, Tarantino goes overboard with the 'n' word and the blood-letting, the latter to the point of cartoonish-ness. \r\n\r\nNevertheless, this is an original Western that is vibrant with creativity, including stunning locations, cinematography and a great amalgamated soundtrack/score, which includes cuts by Ennio Morricone, like the excellent \"Hornets' Nest,\" the imaginative \"The Braying Mule\" and the moving \"Ancora Qui.\" It's all-around superior to \"The Hateful Eight\" (2015) because it's not limited by a one-room whodunit plot (although \"Hateful\" has its unique points of interest).\r\n\r\nThe movie runs 165 minutes and was shot in Jackson Hole, Wyoming; Evergreen Plantation & New Orleans, Louisiana; and several locations in California (Lone Pine, Alabama Hills, Semi Valley, Melody Ranch, Santa Clarita, Independence & Los Angeles). The cast includes numerous peripheral notables, e.g. Ato Essandohs, Don Stroud, James Remar, Bruce Dern, Ato Essandoh, Franco Nero, Don Johnson, Amber Tamblyn and several others.\r\n\r\nGRADE: A", "created_at": "2018-08-14T02:04:13.047Z"}, {"movie_id": 68718, "review_id": "5f3bcc7829c626003485f9a1", "author_rating": 7.0, "review_text": "Django Unchained entertained me, for sure, with its taut storyline and its lack of predictability, but it doesn’t rise to the level of my few favorite Tarantino efforts.\r\n\r\nThe trademark violence is present, sometimes to the point of it being cartoonish to me. It would have been easy to present many of the characters as stereotypical, but the script avoided that. The DiCaprio slave owner is vicious and cruel, but there are flashes of flexibility concerning the status quo with his slaves. And his elderly house slave  seems to act more like a slave owner than he does.\r\n\r\nA chemistry develops between the two lead characters as they work as bounty hunters, and that is satisfying to see. There are the usual sometimes subtle nods to other films, and I felt the influence of Spaghetti Westerns here and there.\r\n\r\nAs I said, I enjoyed the film, even though I won’t be watching it multiple times as I do with other Tarantino movies. If you have the stomach for violence and portrayed extreme And presumably historically accurate racism, give it a look.", "created_at": "2020-08-18T12:41:28.598Z"}, {"movie_id": 68718, "review_id": "6339aaa4b0ba7e007c39bd68", "author_rating": 10.0, "review_text": "Mandingo. D'Artagnan. Slave abuse. Tarantino's technique of capturing the painful discrimination against blacks head-on and, on the contrary, making it cathartic in the final scene is brilliant. Starting with the impressive theme song, nonstop violence replaces it, giving us a glimpse into the kaleidoscope of horrific American society. Leonardo DiCaprio's monstrous performance and Christoph Waltz's near-perfect supporting turn are the main reasons for the film's appeal, but Quentin Tarantino's screenplay, which deliberately intersects revenge and black racism and ends up making us sneer at those who looked down on the slaves, is nothing short of brilliant.\r\nNext to \"Pulp Fiction\" this is Quentin's best film.", "created_at": "2022-10-02T15:13:40.900Z"}, {"movie_id": 68718, "review_id": "5207b0bb760ee36305225258", "author_rating": null, "review_text": "America, mid-nineteenth century, just prior to the Civil War. Winter. Two horsebacked slave-traders are leading half-a-dozen manacled negro slaves through a large, unspecified section of Texas. As they move one night through a wood, they cross paths with an affable, charming German fellow identified by the hokey model tooth affixed atop his carriage by a spring as a travelling dentist. He greets the traders cordially but he's struggling to be understood; not because English is his second language (although he deferentially concedes as much when instructed - more than once - to \"Speak English!\") but because his vocabulary is far wider than that of the simpler men here before him. It's not a chance passing, either; this German fellow, who identifies himself as Dr. King Schultz (played by Christoph Waltz with the same smiling, deadly menace that earned him an Oscar statue for his part as Col. Hans Landa in Inglourious Basterds) is looking for these traders. More specifically, their inventory of negro slaves. Even more specifically, one of those slaves in particular. Django (Jamie Foxx, Collateral, Ray). Attempting to buy Django, Schultz is met with short, suspicious shrift and ordered at gunpoint to be on his way. Within a second, one trader lies dead and the other lies incapacitated underneath the bulk of his dead horse. Schultz unchains Django, instructs Django to take the dead fellow's horse and coat, and pays the remaining trader for all that he's taken. He then tosses the manacle key to the other slaves and posits two choices to them, as he sees it: Carry their injured master thirty-plus miles to the nearest town for medical assistance, or unchain themselves, blow the injured slave-trader's head off with the gun Shultz has left them, bury the corpses and use the Pole Star to run for the Northern states, where slavery had been abolished, and for more than fifty years in some areas. Funnily enough, they take up the latter option.\r\n\r\nSo begins Django Unchained, an oater set in the slave states of the Deep South and the latest rollercoaster by Gen-X movieland wunderkind Quentin Tarantino. Always clearly a man heavily informed by the grindhouse subgenre of the Spaghetti Western, he's finally made one himself, and if Quentin's your thing it's a blast, though I doubt it'll convert many Tarantino sceptics; in fact it'll almost certainly reinforce those things that people dislike about him, about which more later.\r\n\r\nIt transpires that Dr. Schultz ISN'T a dentist (\"I haven't practised dentistry in five years,\" he confides to Django over a beer) but a bounty hunter, and a lethal one at that. He's chasing down the Brittles, a murderous gang of brothers currently plying their trades as plantation overseers. He doesn't know what they look like but he knows they were recently employed at the Carrucan plantation, which is why he was searching for Django - a slave recently sold by that very plantation - in the first place; Django can point them out for him. Schultz is no fan of the South's backwards-thinking propensity for slavery though, and he offers Django a deal: help Schultz find and kill the Brittle Brothers, Schultz will treat Django like a free man, pay him $75 (a decent little wedge in 1858) and rubber-stamp his freedom. Along the way, he'll also teach Django a thing or two about the art of gunfighting and about the macabre trade of bounty-hunting (both in which Django proves to be a natural). On the trail of the Brittles, Schultz wonders aloud as to Django's plans once this endeavour is over and he's free. Well, as it happens, Django is a married man and his intention, once free, is to find his wife and buy her freedom. They'd tried to run from the Carrucan plantation together but they'd been caught, branded (both Django and his wife - played with all of her nerves exposed by Kerry Washington - sport R-For-Runaway scars on their cheeks) and sold on, separately. So he doesn't know where she is but that's what he's going to try to do. Schultz, feeling responsible for Django as the man granting him his freedom, proposes a further deal: If this Brittle bounty goes well, he'll honour Django's freedom but if Django stays with him through the winter as partners, taking on bounties and earning money, he'll help Django locate his wife.\r\n\r\nWhat we have here is a large sequence of set-pieces - some funny, some tense, some action-packed - stretched across very-nearly three hours (though, like most QT films, it moves like a bullet train and those three hours just fly) strung together by a fairly simple revenge/rescue tale set against a geographically sprawling backdrop; a reasonably similar template to many of Quentin's movies and an almost identical template to that of previous outing Inglourious Basterds, to which Django Unchained could almost be considered a companion piece despite the wildly different global and historical settings. Like Inglourious Basterds, Django Unchained is quite a bit longer than the story need be, and like Inglourious Basterds that is because each scene is treated by Tarantino as a mini movie, a contained set-piece all of its own. Every scene is fleshed out and deepened for either heightened comic or dramatic effect by lengthened sequences of characters going about the mundane or by characters delivering enormous monologues - rambling shaggy-dog stories, usually - to one another, for context. Not every scene is entirely necessary, either. I wouldn't call that a flaw though, I'd call it a trait typical of Quentin Tarantino; whether it's a flaw or an outright treat depends entirely on whether that's an element of Tarantino's writing that the viewer appreciates. Personally, I love Tarantino's writer's voice and I could watch these scenes for hours (indeed, I watched Django Unchained three times over the course of yesterday), but I can fully undersand what those lamenting the decent 90-minute film that's lost somewhere within the sojourns and speeches of Django Unchained are saying.\r\n\r\nPerformances throughout are utterly mesmerising, from stars Foxx and Waltz but also - in fact, maybe more so - from principle antagonists Leonardo DiCaprio as \"Monsieur\" Calvin Candie, the horrifying owner of the \"Candyland\" plantation currently holding the ownership deeds on Django's wife, and Samuel L. Jackson in an if-anything even more monstrous role as Stephen, Candie's elderly head house slave, a man who has utterly abndoned the culture and torment of his people in return for a few material trappings as the slave-in-chief. Playing to superb comedic effect is Don Johnson as Big Daddy, a strutting, peacock-like Tennessee dandy and owner of the plantation currently employing the Brittle Brothers, and delightful in cameo roles are (among many others) James Remar (The Warriors, Dexter), Jonah Hill (Superbad, The Watch), John Jarratt (Wolf Creek, Rogue) and Michael Parks (Red State, Kill Bill). Quentin himself makes a cameo as usual and, as usual, he's not as charming as he probably thinks he is, but he's also not as bad as many think he is, either. There's even a quick cameo (raising an involuntary cheer from me!) by Franco Nero, the original Django from the magnificent 1966 film of the same name by Sergio Corbucci (that's not the only nod back to the first Django movie; the opening credits to Django Unchained are presented in exactly the same way as the original, and the theme song to Quentin's film comes directly from the Corbucci film too).\r\n\r\nDjango Unchained is likely to come under fire on a couple of counts; possibly for it's incredible levels of bloodshed (one particular gunfight is the most blood-splattered scene I've seen in a movie since those elevator doors opened in The Shining), and much more probably for the liberal use of what guilty white folks like to refer to as \"The 'N'-word\", uttered literally hundreds of times from first scene to last. However, neither criticism is warranted in my humble opinion. The bloodshed is of the overexaggerated cartoon quality. Heads, arteries and extremities explode upon bullet impact like detonated watermelons to a gloopy, \"BLAAAPP!\" sound effect, the blood itself translucent, syrupy and intentionally unrealistic. And if a tale is set against the backdrop of slavery in the 19th century deep South, you're going to hear the word \"Nigger\" in that tale. Often. Be assured though that just as Inglourious Basterds was a revenge fantasy of the downtrodden Jewish war refugees over the stupidly evil Nazi Germans, this is a tale of empowerment of the enslaved black man over his sadistic, pig-ignorant white overseers.\r\n\r\nIf you like Tarantino, you'll probably like Django Unchained. If you like Westerns (and the blood-drenched Spaghetti Westerns of the late sixties in particular), you'll probably like Django Unchained. If, like me, you're an admirer of both Tarantino AND westerns, this is a no-brainer. Get and see it, it's a blast.\r\n\r\nI'd like to have seen him pull a Gatling gun out of a coffin, though.", "created_at": "2013-08-11T15:41:47.060Z"}, {"movie_id": 68718, "review_id": "589cfcabc3a3681158003356", "author_rating": 9.0, "review_text": "A highly entertaining yet disturbing film with superb cast and performances for an audience who would likely never consider watching a film fundamentally about slavery, where Tarantino is masterfully and emphatically navigating and exposing the complex layers of the violent and dehumanizing system of slavery.", "created_at": "2017-02-09T23:35:07.102Z"}, {"movie_id": 68718, "review_id": "590b2c6e9251414fa10150d3", "author_rating": 10.0, "review_text": "**ENTERTAINING from start to finish !!**\r\n\r\nGiven I am a big fan of **Quentin's** works i knew this movie would be a treat to watch.But what i didn't know was violence can be so **COOL**... The movie is a treat to watch(including the blood and gore) from starting to end.The acting is superb.And the cinematography is just too good! The whole cast played their parts to perfection...Especially **Samuel L. Jackson** and **Jamie Foxx**..**Leo and Christopher Waltz** were superb too..And as Christopher said in the movie - \"It was hard to RESIST\".A must watch for everyone who likes QUALITY cinema..Even the ones who cant stand BOOMs and BANGs, you wouldn't regret spending about 3 hours watching this well written, well directed and well acted GREAT movie !!", "created_at": "2017-05-04T13:28:14.365Z"}, {"movie_id": 68718, "review_id": "5ad7255c9251413b2b00d193", "author_rating": 10.0, "review_text": "This is one of the best movies I have watched in a long time. It is a pure Tarantino blast. The somewhat unexpected and quite hilarious start of the movie catches your attention from the start and from then on it is 3 hours (almost) of pure enjoyment. \n\nThe main actors are playing their roles very well. The Dr. King Schultz character (Christop Walz) is incredibly funny without being ridiculous, Jamie Foxx is excellent as Django and Leonardo DiCaprio is doing his role well as a plantation owner and slave trader. None of the rest of the crew stood out as particularly bad. Well with the possible exception of Tarantino himself then when he made his usual in-movie appearance a’ la Hitchcock. Not that he was particularly bad but he is no actor either.\n\nThe movie starts of by Dr. Schulz liberating Django and proceeding to a small town showing Django what he is in the business of doing. Those first minutes of the movie are somewhat unexpected and very funny to watch. After that the movie gets more serious as Django gets to learn to be a bounty hunter and finally gets on with his quest to rescue his “Damsel in distress”. It still has quite a bit of “Tarantino humour” sprinkled around in it though.\n\nDuring the movie we are treated to a long series of stereotypical people with, let us say, an “attitude” towards African people. It is tempting to say “nigger haters” but that would not be true since a lot of these people did not exactly hate them. They just did not consider African people to be people but more than live stock for them to use as they wished. Unlike a lot of movies portraying these events this one never comes across as boringly finger pointing or overly morally lecturing. Nor does it in any way support or glorify the way things were at this time. It is a movie made to entertain set in a period where bad shit happened and using it for the story. Nothing more and nothing less.\n\nAs usual with a Tarantino movie there are some violent parts, some more violent parts and some bloody violent parts in it. The ending fights are a glorious show of destruction and blood splatter. I am sure some people are complaining about the “unnecessary violence”. I am not one of those people. Without these parts it would not be a real Tarantino movie. As always it is made with the usual exaggeration that Tarantino is so good and which reminds you that it is “only a movie”.\nThis is one of the few movies that I have given 10 out of 10 stars in a very long time. I enjoyed it immensely.", "created_at": "2018-04-18T11:00:44.822Z"}, {"movie_id": 68718, "review_id": "5b72389dc3a3681899183b04", "author_rating": 9.0, "review_text": "When Django is unchained (pronounced JANG-oh, not Duh-JANG-oh)\r\n\r\nReleased in 2012 and directed & written by Quentin Tarantino, \"Django Unchained\" stars Christoph Waltz as an ex-dentist who befriends an ex-slave, Django (Jamie Foxx) in West Texas a couple of years before the Civil War; they team-up as bounty hunters once they realize how good they jell. The second half focuses on their attempt to infiltrate a Mississippi plantation owned by pompous Southerner \"Monsieur\" Candie (Leonardo DiCaprio) in order to rescue Django's wife (Kerry Washington). Samuel L. Jackson plays Candie's overly loyal house slave.\r\n\r\nThis is an excellent American Western with Spaghetti Western elements featuring Tarantino's typical artistic flourishes. It takes place in the West AND in the South, which is reminiscent of the underrated \"Nevada Smith\" (1966), one of my favorite Westerns. Waltz is magnetic as the nonchalant protagonist and he & Foxx have good chemistry. There's a nice mix of interesting dialogues, amusing moments and over-the-top action. Unfortunately, but to be expected, Tarantino goes overboard with the 'n' word and the blood-letting, the latter to the point of cartoonish-ness. \r\n\r\nNevertheless, this is an original Western that is vibrant with creativity, including stunning locations, cinematography and a great amalgamated soundtrack/score, which includes cuts by Ennio Morricone, like the excellent \"Hornets' Nest,\" the imaginative \"The Braying Mule\" and the moving \"Ancora Qui.\" It's all-around superior to \"The Hateful Eight\" (2015) because it's not limited by a one-room whodunit plot (although \"Hateful\" has its unique points of interest).\r\n\r\nThe movie runs 165 minutes and was shot in Jackson Hole, Wyoming; Evergreen Plantation & New Orleans, Louisiana; and several locations in California (Lone Pine, Alabama Hills, Semi Valley, Melody Ranch, Santa Clarita, Independence & Los Angeles). The cast includes numerous peripheral notables, e.g. Ato Essandohs, Don Stroud, James Remar, Bruce Dern, Ato Essandoh, Franco Nero, Don Johnson, Amber Tamblyn and several others.\r\n\r\nGRADE: A", "created_at": "2018-08-14T02:04:13.047Z"}, {"movie_id": 68718, "review_id": "5f3bcc7829c626003485f9a1", "author_rating": 7.0, "review_text": "Django Unchained entertained me, for sure, with its taut storyline and its lack of predictability, but it doesn’t rise to the level of my few favorite Tarantino efforts.\r\n\r\nThe trademark violence is present, sometimes to the point of it being cartoonish to me. It would have been easy to present many of the characters as stereotypical, but the script avoided that. The DiCaprio slave owner is vicious and cruel, but there are flashes of flexibility concerning the status quo with his slaves. And his elderly house slave  seems to act more like a slave owner than he does.\r\n\r\nA chemistry develops between the two lead characters as they work as bounty hunters, and that is satisfying to see. There are the usual sometimes subtle nods to other films, and I felt the influence of Spaghetti Westerns here and there.\r\n\r\nAs I said, I enjoyed the film, even though I won’t be watching it multiple times as I do with other Tarantino movies. If you have the stomach for violence and portrayed extreme And presumably historically accurate racism, give it a look.", "created_at": "2020-08-18T12:41:28.598Z"}, {"movie_id": 68718, "review_id": "6339aaa4b0ba7e007c39bd68", "author_rating": 10.0, "review_text": "Mandingo. D'Artagnan. Slave abuse. Tarantino's technique of capturing the painful discrimination against blacks head-on and, on the contrary, making it cathartic in the final scene is brilliant. Starting with the impressive theme song, nonstop violence replaces it, giving us a glimpse into the kaleidoscope of horrific American society. Leonardo DiCaprio's monstrous performance and Christoph Waltz's near-perfect supporting turn are the main reasons for the film's appeal, but Quentin Tarantino's screenplay, which deliberately intersects revenge and black racism and ends up making us sneer at those who looked down on the slaves, is nothing short of brilliant.\r\nNext to \"Pulp Fiction\" this is Quentin's best film.", "created_at": "2022-10-02T15:13:40.900Z"}, {"movie_id": 68718, "review_id": "5207b0bb760ee36305225258", "author_rating": null, "review_text": "America, mid-nineteenth century, just prior to the Civil War. Winter. Two horsebacked slave-traders are leading half-a-dozen manacled negro slaves through a large, unspecified section of Texas. As they move one night through a wood, they cross paths with an affable, charming German fellow identified by the hokey model tooth affixed atop his carriage by a spring as a travelling dentist. He greets the traders cordially but he's struggling to be understood; not because English is his second language (although he deferentially concedes as much when instructed - more than once - to \"Speak English!\") but because his vocabulary is far wider than that of the simpler men here before him. It's not a chance passing, either; this German fellow, who identifies himself as Dr. King Schultz (played by Christoph Waltz with the same smiling, deadly menace that earned him an Oscar statue for his part as Col. Hans Landa in Inglourious Basterds) is looking for these traders. More specifically, their inventory of negro slaves. Even more specifically, one of those slaves in particular. Django (Jamie Foxx, Collateral, Ray). Attempting to buy Django, Schultz is met with short, suspicious shrift and ordered at gunpoint to be on his way. Within a second, one trader lies dead and the other lies incapacitated underneath the bulk of his dead horse. Schultz unchains Django, instructs Django to take the dead fellow's horse and coat, and pays the remaining trader for all that he's taken. He then tosses the manacle key to the other slaves and posits two choices to them, as he sees it: Carry their injured master thirty-plus miles to the nearest town for medical assistance, or unchain themselves, blow the injured slave-trader's head off with the gun Shultz has left them, bury the corpses and use the Pole Star to run for the Northern states, where slavery had been abolished, and for more than fifty years in some areas. Funnily enough, they take up the latter option.\r\n\r\nSo begins Django Unchained, an oater set in the slave states of the Deep South and the latest rollercoaster by Gen-X movieland wunderkind Quentin Tarantino. Always clearly a man heavily informed by the grindhouse subgenre of the Spaghetti Western, he's finally made one himself, and if Quentin's your thing it's a blast, though I doubt it'll convert many Tarantino sceptics; in fact it'll almost certainly reinforce those things that people dislike about him, about which more later.\r\n\r\nIt transpires that Dr. Schultz ISN'T a dentist (\"I haven't practised dentistry in five years,\" he confides to Django over a beer) but a bounty hunter, and a lethal one at that. He's chasing down the Brittles, a murderous gang of brothers currently plying their trades as plantation overseers. He doesn't know what they look like but he knows they were recently employed at the Carrucan plantation, which is why he was searching for Django - a slave recently sold by that very plantation - in the first place; Django can point them out for him. Schultz is no fan of the South's backwards-thinking propensity for slavery though, and he offers Django a deal: help Schultz find and kill the Brittle Brothers, Schultz will treat Django like a free man, pay him $75 (a decent little wedge in 1858) and rubber-stamp his freedom. Along the way, he'll also teach Django a thing or two about the art of gunfighting and about the macabre trade of bounty-hunting (both in which Django proves to be a natural). On the trail of the Brittles, Schultz wonders aloud as to Django's plans once this endeavour is over and he's free. Well, as it happens, Django is a married man and his intention, once free, is to find his wife and buy her freedom. They'd tried to run from the Carrucan plantation together but they'd been caught, branded (both Django and his wife - played with all of her nerves exposed by Kerry Washington - sport R-For-Runaway scars on their cheeks) and sold on, separately. So he doesn't know where she is but that's what he's going to try to do. Schultz, feeling responsible for Django as the man granting him his freedom, proposes a further deal: If this Brittle bounty goes well, he'll honour Django's freedom but if Django stays with him through the winter as partners, taking on bounties and earning money, he'll help Django locate his wife.\r\n\r\nWhat we have here is a large sequence of set-pieces - some funny, some tense, some action-packed - stretched across very-nearly three hours (though, like most QT films, it moves like a bullet train and those three hours just fly) strung together by a fairly simple revenge/rescue tale set against a geographically sprawling backdrop; a reasonably similar template to many of Quentin's movies and an almost identical template to that of previous outing Inglourious Basterds, to which Django Unchained could almost be considered a companion piece despite the wildly different global and historical settings. Like Inglourious Basterds, Django Unchained is quite a bit longer than the story need be, and like Inglourious Basterds that is because each scene is treated by Tarantino as a mini movie, a contained set-piece all of its own. Every scene is fleshed out and deepened for either heightened comic or dramatic effect by lengthened sequences of characters going about the mundane or by characters delivering enormous monologues - rambling shaggy-dog stories, usually - to one another, for context. Not every scene is entirely necessary, either. I wouldn't call that a flaw though, I'd call it a trait typical of Quentin Tarantino; whether it's a flaw or an outright treat depends entirely on whether that's an element of Tarantino's writing that the viewer appreciates. Personally, I love Tarantino's writer's voice and I could watch these scenes for hours (indeed, I watched Django Unchained three times over the course of yesterday), but I can fully undersand what those lamenting the decent 90-minute film that's lost somewhere within the sojourns and speeches of Django Unchained are saying.\r\n\r\nPerformances throughout are utterly mesmerising, from stars Foxx and Waltz but also - in fact, maybe more so - from principle antagonists Leonardo DiCaprio as \"Monsieur\" Calvin Candie, the horrifying owner of the \"Candyland\" plantation currently holding the ownership deeds on Django's wife, and Samuel L. Jackson in an if-anything even more monstrous role as Stephen, Candie's elderly head house slave, a man who has utterly abndoned the culture and torment of his people in return for a few material trappings as the slave-in-chief. Playing to superb comedic effect is Don Johnson as Big Daddy, a strutting, peacock-like Tennessee dandy and owner of the plantation currently employing the Brittle Brothers, and delightful in cameo roles are (among many others) James Remar (The Warriors, Dexter), Jonah Hill (Superbad, The Watch), John Jarratt (Wolf Creek, Rogue) and Michael Parks (Red State, Kill Bill). Quentin himself makes a cameo as usual and, as usual, he's not as charming as he probably thinks he is, but he's also not as bad as many think he is, either. There's even a quick cameo (raising an involuntary cheer from me!) by Franco Nero, the original Django from the magnificent 1966 film of the same name by Sergio Corbucci (that's not the only nod back to the first Django movie; the opening credits to Django Unchained are presented in exactly the same way as the original, and the theme song to Quentin's film comes directly from the Corbucci film too).\r\n\r\nDjango Unchained is likely to come under fire on a couple of counts; possibly for it's incredible levels of bloodshed (one particular gunfight is the most blood-splattered scene I've seen in a movie since those elevator doors opened in The Shining), and much more probably for the liberal use of what guilty white folks like to refer to as \"The 'N'-word\", uttered literally hundreds of times from first scene to last. However, neither criticism is warranted in my humble opinion. The bloodshed is of the overexaggerated cartoon quality. Heads, arteries and extremities explode upon bullet impact like detonated watermelons to a gloopy, \"BLAAAPP!\" sound effect, the blood itself translucent, syrupy and intentionally unrealistic. And if a tale is set against the backdrop of slavery in the 19th century deep South, you're going to hear the word \"Nigger\" in that tale. Often. Be assured though that just as Inglourious Basterds was a revenge fantasy of the downtrodden Jewish war refugees over the stupidly evil Nazi Germans, this is a tale of empowerment of the enslaved black man over his sadistic, pig-ignorant white overseers.\r\n\r\nIf you like Tarantino, you'll probably like Django Unchained. If you like Westerns (and the blood-drenched Spaghetti Westerns of the late sixties in particular), you'll probably like Django Unchained. If, like me, you're an admirer of both Tarantino AND westerns, this is a no-brainer. Get and see it, it's a blast.\r\n\r\nI'd like to have seen him pull a Gatling gun out of a coffin, though.", "created_at": "2013-08-11T15:41:47.060Z"}, {"movie_id": 68718, "review_id": "589cfcabc3a3681158003356", "author_rating": 9.0, "review_text": "A highly entertaining yet disturbing film with superb cast and performances for an audience who would likely never consider watching a film fundamentally about slavery, where Tarantino is masterfully and emphatically navigating and exposing the complex layers of the violent and dehumanizing system of slavery.", "created_at": "2017-02-09T23:35:07.102Z"}, {"movie_id": 68718, "review_id": "590b2c6e9251414fa10150d3", "author_rating": 10.0, "review_text": "**ENTERTAINING from start to finish !!**\r\n\r\nGiven I am a big fan of **Quentin's** works i knew this movie would be a treat to watch.But what i didn't know was violence can be so **COOL**... The movie is a treat to watch(including the blood and gore) from starting to end.The acting is superb.And the cinematography is just too good! The whole cast played their parts to perfection...Especially **Samuel L. Jackson** and **Jamie Foxx**..**Leo and Christopher Waltz** were superb too..And as Christopher said in the movie - \"It was hard to RESIST\".A must watch for everyone who likes QUALITY cinema..Even the ones who cant stand BOOMs and BANGs, you wouldn't regret spending about 3 hours watching this well written, well directed and well acted GREAT movie !!", "created_at": "2017-05-04T13:28:14.365Z"}, {"movie_id": 68718, "review_id": "5ad7255c9251413b2b00d193", "author_rating": 10.0, "review_text": "This is one of the best movies I have watched in a long time. It is a pure Tarantino blast. The somewhat unexpected and quite hilarious start of the movie catches your attention from the start and from then on it is 3 hours (almost) of pure enjoyment. \n\nThe main actors are playing their roles very well. The Dr. King Schultz character (Christop Walz) is incredibly funny without being ridiculous, Jamie Foxx is excellent as Django and Leonardo DiCaprio is doing his role well as a plantation owner and slave trader. None of the rest of the crew stood out as particularly bad. Well with the possible exception of Tarantino himself then when he made his usual in-movie appearance a’ la Hitchcock. Not that he was particularly bad but he is no actor either.\n\nThe movie starts of by Dr. Schulz liberating Django and proceeding to a small town showing Django what he is in the business of doing. Those first minutes of the movie are somewhat unexpected and very funny to watch. After that the movie gets more serious as Django gets to learn to be a bounty hunter and finally gets on with his quest to rescue his “Damsel in distress”. It still has quite a bit of “Tarantino humour” sprinkled around in it though.\n\nDuring the movie we are treated to a long series of stereotypical people with, let us say, an “attitude” towards African people. It is tempting to say “nigger haters” but that would not be true since a lot of these people did not exactly hate them. They just did not consider African people to be people but more than live stock for them to use as they wished. Unlike a lot of movies portraying these events this one never comes across as boringly finger pointing or overly morally lecturing. Nor does it in any way support or glorify the way things were at this time. It is a movie made to entertain set in a period where bad shit happened and using it for the story. Nothing more and nothing less.\n\nAs usual with a Tarantino movie there are some violent parts, some more violent parts and some bloody violent parts in it. The ending fights are a glorious show of destruction and blood splatter. I am sure some people are complaining about the “unnecessary violence”. I am not one of those people. Without these parts it would not be a real Tarantino movie. As always it is made with the usual exaggeration that Tarantino is so good and which reminds you that it is “only a movie”.\nThis is one of the few movies that I have given 10 out of 10 stars in a very long time. I enjoyed it immensely.", "created_at": "2018-04-18T11:00:44.822Z"}, {"movie_id": 68718, "review_id": "5b72389dc3a3681899183b04", "author_rating": 9.0, "review_text": "When Django is unchained (pronounced JANG-oh, not Duh-JANG-oh)\r\n\r\nReleased in 2012 and directed & written by Quentin Tarantino, \"Django Unchained\" stars Christoph Waltz as an ex-dentist who befriends an ex-slave, Django (Jamie Foxx) in West Texas a couple of years before the Civil War; they team-up as bounty hunters once they realize how good they jell. The second half focuses on their attempt to infiltrate a Mississippi plantation owned by pompous Southerner \"Monsieur\" Candie (Leonardo DiCaprio) in order to rescue Django's wife (Kerry Washington). Samuel L. Jackson plays Candie's overly loyal house slave.\r\n\r\nThis is an excellent American Western with Spaghetti Western elements featuring Tarantino's typical artistic flourishes. It takes place in the West AND in the South, which is reminiscent of the underrated \"Nevada Smith\" (1966), one of my favorite Westerns. Waltz is magnetic as the nonchalant protagonist and he & Foxx have good chemistry. There's a nice mix of interesting dialogues, amusing moments and over-the-top action. Unfortunately, but to be expected, Tarantino goes overboard with the 'n' word and the blood-letting, the latter to the point of cartoonish-ness. \r\n\r\nNevertheless, this is an original Western that is vibrant with creativity, including stunning locations, cinematography and a great amalgamated soundtrack/score, which includes cuts by Ennio Morricone, like the excellent \"Hornets' Nest,\" the imaginative \"The Braying Mule\" and the moving \"Ancora Qui.\" It's all-around superior to \"The Hateful Eight\" (2015) because it's not limited by a one-room whodunit plot (although \"Hateful\" has its unique points of interest).\r\n\r\nThe movie runs 165 minutes and was shot in Jackson Hole, Wyoming; Evergreen Plantation & New Orleans, Louisiana; and several locations in California (Lone Pine, Alabama Hills, Semi Valley, Melody Ranch, Santa Clarita, Independence & Los Angeles). The cast includes numerous peripheral notables, e.g. Ato Essandohs, Don Stroud, James Remar, Bruce Dern, Ato Essandoh, Franco Nero, Don Johnson, Amber Tamblyn and several others.\r\n\r\nGRADE: A", "created_at": "2018-08-14T02:04:13.047Z"}, {"movie_id": 68718, "review_id": "5f3bcc7829c626003485f9a1", "author_rating": 7.0, "review_text": "Django Unchained entertained me, for sure, with its taut storyline and its lack of predictability, but it doesn’t rise to the level of my few favorite Tarantino efforts.\r\n\r\nThe trademark violence is present, sometimes to the point of it being cartoonish to me. It would have been easy to present many of the characters as stereotypical, but the script avoided that. The DiCaprio slave owner is vicious and cruel, but there are flashes of flexibility concerning the status quo with his slaves. And his elderly house slave  seems to act more like a slave owner than he does.\r\n\r\nA chemistry develops between the two lead characters as they work as bounty hunters, and that is satisfying to see. There are the usual sometimes subtle nods to other films, and I felt the influence of Spaghetti Westerns here and there.\r\n\r\nAs I said, I enjoyed the film, even though I won’t be watching it multiple times as I do with other Tarantino movies. If you have the stomach for violence and portrayed extreme And presumably historically accurate racism, give it a look.", "created_at": "2020-08-18T12:41:28.598Z"}, {"movie_id": 68718, "review_id": "6339aaa4b0ba7e007c39bd68", "author_rating": 10.0, "review_text": "Mandingo. D'Artagnan. Slave abuse. Tarantino's technique of capturing the painful discrimination against blacks head-on and, on the contrary, making it cathartic in the final scene is brilliant. Starting with the impressive theme song, nonstop violence replaces it, giving us a glimpse into the kaleidoscope of horrific American society. Leonardo DiCaprio's monstrous performance and Christoph Waltz's near-perfect supporting turn are the main reasons for the film's appeal, but Quentin Tarantino's screenplay, which deliberately intersects revenge and black racism and ends up making us sneer at those who looked down on the slaves, is nothing short of brilliant.\r\nNext to \"Pulp Fiction\" this is Quentin's best film.", "created_at": "2022-10-02T15:13:40.900Z"}, {"movie_id": 68718, "review_id": "5207b0bb760ee36305225258", "author_rating": null, "review_text": "America, mid-nineteenth century, just prior to the Civil War. Winter. Two horsebacked slave-traders are leading half-a-dozen manacled negro slaves through a large, unspecified section of Texas. As they move one night through a wood, they cross paths with an affable, charming German fellow identified by the hokey model tooth affixed atop his carriage by a spring as a travelling dentist. He greets the traders cordially but he's struggling to be understood; not because English is his second language (although he deferentially concedes as much when instructed - more than once - to \"Speak English!\") but because his vocabulary is far wider than that of the simpler men here before him. It's not a chance passing, either; this German fellow, who identifies himself as Dr. King Schultz (played by Christoph Waltz with the same smiling, deadly menace that earned him an Oscar statue for his part as Col. Hans Landa in Inglourious Basterds) is looking for these traders. More specifically, their inventory of negro slaves. Even more specifically, one of those slaves in particular. Django (Jamie Foxx, Collateral, Ray). Attempting to buy Django, Schultz is met with short, suspicious shrift and ordered at gunpoint to be on his way. Within a second, one trader lies dead and the other lies incapacitated underneath the bulk of his dead horse. Schultz unchains Django, instructs Django to take the dead fellow's horse and coat, and pays the remaining trader for all that he's taken. He then tosses the manacle key to the other slaves and posits two choices to them, as he sees it: Carry their injured master thirty-plus miles to the nearest town for medical assistance, or unchain themselves, blow the injured slave-trader's head off with the gun Shultz has left them, bury the corpses and use the Pole Star to run for the Northern states, where slavery had been abolished, and for more than fifty years in some areas. Funnily enough, they take up the latter option.\r\n\r\nSo begins Django Unchained, an oater set in the slave states of the Deep South and the latest rollercoaster by Gen-X movieland wunderkind Quentin Tarantino. Always clearly a man heavily informed by the grindhouse subgenre of the Spaghetti Western, he's finally made one himself, and if Quentin's your thing it's a blast, though I doubt it'll convert many Tarantino sceptics; in fact it'll almost certainly reinforce those things that people dislike about him, about which more later.\r\n\r\nIt transpires that Dr. Schultz ISN'T a dentist (\"I haven't practised dentistry in five years,\" he confides to Django over a beer) but a bounty hunter, and a lethal one at that. He's chasing down the Brittles, a murderous gang of brothers currently plying their trades as plantation overseers. He doesn't know what they look like but he knows they were recently employed at the Carrucan plantation, which is why he was searching for Django - a slave recently sold by that very plantation - in the first place; Django can point them out for him. Schultz is no fan of the South's backwards-thinking propensity for slavery though, and he offers Django a deal: help Schultz find and kill the Brittle Brothers, Schultz will treat Django like a free man, pay him $75 (a decent little wedge in 1858) and rubber-stamp his freedom. Along the way, he'll also teach Django a thing or two about the art of gunfighting and about the macabre trade of bounty-hunting (both in which Django proves to be a natural). On the trail of the Brittles, Schultz wonders aloud as to Django's plans once this endeavour is over and he's free. Well, as it happens, Django is a married man and his intention, once free, is to find his wife and buy her freedom. They'd tried to run from the Carrucan plantation together but they'd been caught, branded (both Django and his wife - played with all of her nerves exposed by Kerry Washington - sport R-For-Runaway scars on their cheeks) and sold on, separately. So he doesn't know where she is but that's what he's going to try to do. Schultz, feeling responsible for Django as the man granting him his freedom, proposes a further deal: If this Brittle bounty goes well, he'll honour Django's freedom but if Django stays with him through the winter as partners, taking on bounties and earning money, he'll help Django locate his wife.\r\n\r\nWhat we have here is a large sequence of set-pieces - some funny, some tense, some action-packed - stretched across very-nearly three hours (though, like most QT films, it moves like a bullet train and those three hours just fly) strung together by a fairly simple revenge/rescue tale set against a geographically sprawling backdrop; a reasonably similar template to many of Quentin's movies and an almost identical template to that of previous outing Inglourious Basterds, to which Django Unchained could almost be considered a companion piece despite the wildly different global and historical settings. Like Inglourious Basterds, Django Unchained is quite a bit longer than the story need be, and like Inglourious Basterds that is because each scene is treated by Tarantino as a mini movie, a contained set-piece all of its own. Every scene is fleshed out and deepened for either heightened comic or dramatic effect by lengthened sequences of characters going about the mundane or by characters delivering enormous monologues - rambling shaggy-dog stories, usually - to one another, for context. Not every scene is entirely necessary, either. I wouldn't call that a flaw though, I'd call it a trait typical of Quentin Tarantino; whether it's a flaw or an outright treat depends entirely on whether that's an element of Tarantino's writing that the viewer appreciates. Personally, I love Tarantino's writer's voice and I could watch these scenes for hours (indeed, I watched Django Unchained three times over the course of yesterday), but I can fully undersand what those lamenting the decent 90-minute film that's lost somewhere within the sojourns and speeches of Django Unchained are saying.\r\n\r\nPerformances throughout are utterly mesmerising, from stars Foxx and Waltz but also - in fact, maybe more so - from principle antagonists Leonardo DiCaprio as \"Monsieur\" Calvin Candie, the horrifying owner of the \"Candyland\" plantation currently holding the ownership deeds on Django's wife, and Samuel L. Jackson in an if-anything even more monstrous role as Stephen, Candie's elderly head house slave, a man who has utterly abndoned the culture and torment of his people in return for a few material trappings as the slave-in-chief. Playing to superb comedic effect is Don Johnson as Big Daddy, a strutting, peacock-like Tennessee dandy and owner of the plantation currently employing the Brittle Brothers, and delightful in cameo roles are (among many others) James Remar (The Warriors, Dexter), Jonah Hill (Superbad, The Watch), John Jarratt (Wolf Creek, Rogue) and Michael Parks (Red State, Kill Bill). Quentin himself makes a cameo as usual and, as usual, he's not as charming as he probably thinks he is, but he's also not as bad as many think he is, either. There's even a quick cameo (raising an involuntary cheer from me!) by Franco Nero, the original Django from the magnificent 1966 film of the same name by Sergio Corbucci (that's not the only nod back to the first Django movie; the opening credits to Django Unchained are presented in exactly the same way as the original, and the theme song to Quentin's film comes directly from the Corbucci film too).\r\n\r\nDjango Unchained is likely to come under fire on a couple of counts; possibly for it's incredible levels of bloodshed (one particular gunfight is the most blood-splattered scene I've seen in a movie since those elevator doors opened in The Shining), and much more probably for the liberal use of what guilty white folks like to refer to as \"The 'N'-word\", uttered literally hundreds of times from first scene to last. However, neither criticism is warranted in my humble opinion. The bloodshed is of the overexaggerated cartoon quality. Heads, arteries and extremities explode upon bullet impact like detonated watermelons to a gloopy, \"BLAAAPP!\" sound effect, the blood itself translucent, syrupy and intentionally unrealistic. And if a tale is set against the backdrop of slavery in the 19th century deep South, you're going to hear the word \"Nigger\" in that tale. Often. Be assured though that just as Inglourious Basterds was a revenge fantasy of the downtrodden Jewish war refugees over the stupidly evil Nazi Germans, this is a tale of empowerment of the enslaved black man over his sadistic, pig-ignorant white overseers.\r\n\r\nIf you like Tarantino, you'll probably like Django Unchained. If you like Westerns (and the blood-drenched Spaghetti Westerns of the late sixties in particular), you'll probably like Django Unchained. If, like me, you're an admirer of both Tarantino AND westerns, this is a no-brainer. Get and see it, it's a blast.\r\n\r\nI'd like to have seen him pull a Gatling gun out of a coffin, though.", "created_at": "2013-08-11T15:41:47.060Z"}, {"movie_id": 68718, "review_id": "589cfcabc3a3681158003356", "author_rating": 9.0, "review_text": "A highly entertaining yet disturbing film with superb cast and performances for an audience who would likely never consider watching a film fundamentally about slavery, where Tarantino is masterfully and emphatically navigating and exposing the complex layers of the violent and dehumanizing system of slavery.", "created_at": "2017-02-09T23:35:07.102Z"}, {"movie_id": 68718, "review_id": "590b2c6e9251414fa10150d3", "author_rating": 10.0, "review_text": "**ENTERTAINING from start to finish !!**\r\n\r\nGiven I am a big fan of **Quentin's** works i knew this movie would be a treat to watch.But what i didn't know was violence can be so **COOL**... The movie is a treat to watch(including the blood and gore) from starting to end.The acting is superb.And the cinematography is just too good! The whole cast played their parts to perfection...Especially **Samuel L. Jackson** and **Jamie Foxx**..**Leo and Christopher Waltz** were superb too..And as Christopher said in the movie - \"It was hard to RESIST\".A must watch for everyone who likes QUALITY cinema..Even the ones who cant stand BOOMs and BANGs, you wouldn't regret spending about 3 hours watching this well written, well directed and well acted GREAT movie !!", "created_at": "2017-05-04T13:28:14.365Z"}, {"movie_id": 68718, "review_id": "5ad7255c9251413b2b00d193", "author_rating": 10.0, "review_text": "This is one of the best movies I have watched in a long time. It is a pure Tarantino blast. The somewhat unexpected and quite hilarious start of the movie catches your attention from the start and from then on it is 3 hours (almost) of pure enjoyment. \n\nThe main actors are playing their roles very well. The Dr. King Schultz character (Christop Walz) is incredibly funny without being ridiculous, Jamie Foxx is excellent as Django and Leonardo DiCaprio is doing his role well as a plantation owner and slave trader. None of the rest of the crew stood out as particularly bad. Well with the possible exception of Tarantino himself then when he made his usual in-movie appearance a’ la Hitchcock. Not that he was particularly bad but he is no actor either.\n\nThe movie starts of by Dr. Schulz liberating Django and proceeding to a small town showing Django what he is in the business of doing. Those first minutes of the movie are somewhat unexpected and very funny to watch. After that the movie gets more serious as Django gets to learn to be a bounty hunter and finally gets on with his quest to rescue his “Damsel in distress”. It still has quite a bit of “Tarantino humour” sprinkled around in it though.\n\nDuring the movie we are treated to a long series of stereotypical people with, let us say, an “attitude” towards African people. It is tempting to say “nigger haters” but that would not be true since a lot of these people did not exactly hate them. They just did not consider African people to be people but more than live stock for them to use as they wished. Unlike a lot of movies portraying these events this one never comes across as boringly finger pointing or overly morally lecturing. Nor does it in any way support or glorify the way things were at this time. It is a movie made to entertain set in a period where bad shit happened and using it for the story. Nothing more and nothing less.\n\nAs usual with a Tarantino movie there are some violent parts, some more violent parts and some bloody violent parts in it. The ending fights are a glorious show of destruction and blood splatter. I am sure some people are complaining about the “unnecessary violence”. I am not one of those people. Without these parts it would not be a real Tarantino movie. As always it is made with the usual exaggeration that Tarantino is so good and which reminds you that it is “only a movie”.\nThis is one of the few movies that I have given 10 out of 10 stars in a very long time. I enjoyed it immensely.", "created_at": "2018-04-18T11:00:44.822Z"}, {"movie_id": 68718, "review_id": "5b72389dc3a3681899183b04", "author_rating": 9.0, "review_text": "When Django is unchained (pronounced JANG-oh, not Duh-JANG-oh)\r\n\r\nReleased in 2012 and directed & written by Quentin Tarantino, \"Django Unchained\" stars Christoph Waltz as an ex-dentist who befriends an ex-slave, Django (Jamie Foxx) in West Texas a couple of years before the Civil War; they team-up as bounty hunters once they realize how good they jell. The second half focuses on their attempt to infiltrate a Mississippi plantation owned by pompous Southerner \"Monsieur\" Candie (Leonardo DiCaprio) in order to rescue Django's wife (Kerry Washington). Samuel L. Jackson plays Candie's overly loyal house slave.\r\n\r\nThis is an excellent American Western with Spaghetti Western elements featuring Tarantino's typical artistic flourishes. It takes place in the West AND in the South, which is reminiscent of the underrated \"Nevada Smith\" (1966), one of my favorite Westerns. Waltz is magnetic as the nonchalant protagonist and he & Foxx have good chemistry. There's a nice mix of interesting dialogues, amusing moments and over-the-top action. Unfortunately, but to be expected, Tarantino goes overboard with the 'n' word and the blood-letting, the latter to the point of cartoonish-ness. \r\n\r\nNevertheless, this is an original Western that is vibrant with creativity, including stunning locations, cinematography and a great amalgamated soundtrack/score, which includes cuts by Ennio Morricone, like the excellent \"Hornets' Nest,\" the imaginative \"The Braying Mule\" and the moving \"Ancora Qui.\" It's all-around superior to \"The Hateful Eight\" (2015) because it's not limited by a one-room whodunit plot (although \"Hateful\" has its unique points of interest).\r\n\r\nThe movie runs 165 minutes and was shot in Jackson Hole, Wyoming; Evergreen Plantation & New Orleans, Louisiana; and several locations in California (Lone Pine, Alabama Hills, Semi Valley, Melody Ranch, Santa Clarita, Independence & Los Angeles). The cast includes numerous peripheral notables, e.g. Ato Essandohs, Don Stroud, James Remar, Bruce Dern, Ato Essandoh, Franco Nero, Don Johnson, Amber Tamblyn and several others.\r\n\r\nGRADE: A", "created_at": "2018-08-14T02:04:13.047Z"}, {"movie_id": 68718, "review_id": "5f3bcc7829c626003485f9a1", "author_rating": 7.0, "review_text": "Django Unchained entertained me, for sure, with its taut storyline and its lack of predictability, but it doesn’t rise to the level of my few favorite Tarantino efforts.\r\n\r\nThe trademark violence is present, sometimes to the point of it being cartoonish to me. It would have been easy to present many of the characters as stereotypical, but the script avoided that. The DiCaprio slave owner is vicious and cruel, but there are flashes of flexibility concerning the status quo with his slaves. And his elderly house slave  seems to act more like a slave owner than he does.\r\n\r\nA chemistry develops between the two lead characters as they work as bounty hunters, and that is satisfying to see. There are the usual sometimes subtle nods to other films, and I felt the influence of Spaghetti Westerns here and there.\r\n\r\nAs I said, I enjoyed the film, even though I won’t be watching it multiple times as I do with other Tarantino movies. If you have the stomach for violence and portrayed extreme And presumably historically accurate racism, give it a look.", "created_at": "2020-08-18T12:41:28.598Z"}, {"movie_id": 68718, "review_id": "6339aaa4b0ba7e007c39bd68", "author_rating": 10.0, "review_text": "Mandingo. D'Artagnan. Slave abuse. Tarantino's technique of capturing the painful discrimination against blacks head-on and, on the contrary, making it cathartic in the final scene is brilliant. Starting with the impressive theme song, nonstop violence replaces it, giving us a glimpse into the kaleidoscope of horrific American society. Leonardo DiCaprio's monstrous performance and Christoph Waltz's near-perfect supporting turn are the main reasons for the film's appeal, but Quentin Tarantino's screenplay, which deliberately intersects revenge and black racism and ends up making us sneer at those who looked down on the slaves, is nothing short of brilliant.\r\nNext to \"Pulp Fiction\" this is Quentin's best film.", "created_at": "2022-10-02T15:13:40.900Z"}]