[{"movie_id": 495764, "review_id": "5e3df0ce98f1f100140de70c", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSince Wonder Woman that the DCEU has not missed a beat. Even though the latter is still my favorite of the universe, I have mostly a positive opinion about Justice League, Aquaman, and Shazam! Yes, these are not the greatest comic-book movies of all-time, but I would be lying if I denied that I was entertained. Birds of Prey follows the same path: it's fun, action-heavy, and it boasts a phenomenal cast. It has some issues regarding the actual plot and a few characters, but I'll get there.\r\n\r\nFirst of all, let me get the mandatory compliments to Margot Robbie's performance out of the way. If there's a DC character better than Harley Quinn for Robbie to portray, please let me know, because I think she's absolutely perfect as a lunatic, over-the-top psychiatrist-turned-psychopath. Suicide Squad might be a total mess, but I doubt anyone denies how Robbie fits seamlessly into the Harley persona. From her looks to the way she speaks and from her physical movement to her facial expressions, there's just no better casting.\r\n\r\nShe embodies the whole film's chaotic vibe and even contributes to the (very) colorful set design. However, she's not the only one who delivers a spectacular performance. Jurnee Smollett-Bell offers a surprisingly captivating display as Dinah Lance / Black Canary. Even though Harley Quinn is the main character, I found myself caring a lot about Dinah. Her way of living suits the character's personality like a glove, and she's undoubtedly the best-written secondary character of the movie. Unfortunately, I can't say the same about the others, and this is one of my biggest issues.\r\n\r\nIt's a film packed with cliches and attempts of making the characters aware of those cliches, which is also, well, something pretty overused. What's more generic? Having the bad guy telling the hero their masterplan or having the hero stating how the bad guy is incredibly dumb by thinking of doing that? At first, I laughed, and I thought it was funny the way Christina Hodson was avoiding to write straight-up cliche characters by making everyone else aware of the way these talk or move.\r\n\r\nBut the whole \"I know you're cliche, so you can get away with saying or doing cliche things\" only works for a couple of scenes, not an entire movie. This is why I wasn't able to connect with Renee Montoya or care about her narrative at all. Mary Elizabeth Winstead is one of my favorite actresses, but she has the least screentime of the entire cast. I never criticize a film for not giving an actor/actress I like a more important role (unlike other people, I believe it would be unfair to do so). Still, I do complain if I think a particular character should have been given more screentime, which is the case of Huntress.\r\n\r\nI find her backstory way more exciting and emotionally investing than Rosie Perez's character, but sadly Huntress' personal story serves only as a not-that-surprising third act twist. There are several past-present transitions in the storytelling, most work, but some feel extremely abrupt. Nevertheless, Winstead is outstanding every single time she's on camera! Ewan Mcgregor offers a good performance as the villain, but he leads me to my other major issue: the central plot. Trivia time: a MacGuffin is an object, device, or event necessary to the narrative and the motivation of the characters, but insignificant, unimportant, or irrelevant in itself.\r\n\r\nThe thread that connects every single character is based on one of the most overused MacGuffins ever. Now, don't get me wrong: a MacGuffin is NOT a synonym of bad writing or of a bad plot! It's merely something that leads to nothing. Having in mind that Birds of Prey is a character-driven movie, a plot centered around a MacGuffin is not unusual. As long as every character works, the primary story can simply be a passenger (Quentin Tarantino's Once Upon a Time in Hollywood applies this method). However, in Birds of Prey, not every character has an interesting story...\r\n\r\nBasically, Christina Hodson's screenplay isn't exactly bad, but it isn't great too. Just like the film, it has its ups and downs, and I saved some of the ups for last because I do want to end this review on a positive note. Finally, a DCEU movie where the action isn't overwhelmed with CGI, but with detailed choreography and long takes instead! Thank you, Cathy Yan, for bringing some of the best action sequences in this universe. Even if the third act gets a little sloppy due to the amount of characters, it's still a very satisfying ending. The score beautifully accompanies the action, and the visuals are truly gorgeous to look at. The comedy bits are on-point, I laughed quite often, but my final remark goes to a topic I rarely address...\r\n\r\nBirds of Prey is a filmmaking lesson on how to produce an incredibly diverse movie without it feeling forced or unnatural. Only AFTER leaving the theater, I acknowledged the fact that the cast and characters are from various races, cultures, and have different sexual preferences. Why? Because this film doesn't waste its runtime by having its characters mention how black, white, Latinas, Chinese, gay, or whatever they are. They simply are what they are, and we all have eyes to see them. Congrats to Yan, Hodson, and everyone else who decided to treat the characters as if they're humans like every one of us.\r\n\r\nIn the end, Birds of Prey (and the ridiculously long subtitle) continues DCEU's streak of (at least) good movies since Wonder Woman came out. With a phenomenal cast led by an outstanding Margot Robbie as Harley Quinn, Cathy Yan delivers some of the best action of the entire universe in a genuinely entertaining superhero flick. A colorful, chaotic, and fun vibe is present throughout the whole runtime, as well as a pretty neat score. However, Christina Hodson's screenplay lacks creativity. The main plot revolves around the most overused MacGuffin ever, and some characters are straight-up taken from the book of cliches. It's a generic comic-book film with a formulaic narrative, but one that possesses enough fun and entertainment to overlook the typical story.\r\n\r\nRating: B-", "created_at": "2020-02-07T23:20:46.102Z"}, {"movie_id": 495764, "review_id": "5e483ee5676ce20015fddb51", "author_rating": null, "review_text": "Pretty good Movie, I did not expect Harvey Quinn can kick ass like that. I can see some guy can be turn off this movie because all women hero team. I find it very entertaining and well made.", "created_at": "2020-02-15T18:56:37.020Z"}, {"movie_id": 495764, "review_id": "5e6685d2357c0000193a2151", "author_rating": 1.0, "review_text": "Garbage.\r\nNothing, and I REALLY MEAN NOTHING good to say about this.", "created_at": "2020-03-09T18:07:14.874Z"}, {"movie_id": 495764, "review_id": "5e7d5b33109dec213c02b68d", "author_rating": 7.0, "review_text": "I really dug “Birds of Prey (And the Fantabulous Emancipation of One Harley Quinn)” because it is unlike any movie I’ve seen before. There are the conventional-minded and flashy action scenes that accompany most superhero characters, but this is a violent, R-rated, naughty-joke, potty-mouthed comic book tour de force made for women over 25. It’s a boisterous good time for feminists and girl nerds everywhere.\r\n\r\nThe film is told from the twisted and deliciously sarcastic point of view of Harley Quinn (Margot Robbie), ex-girlfriend of the Joker. When the evil Roman Sionis (Ewan McGregor) puts out a hit on a young petty thief (Ella Jay Basco), the most nefarious villains turn Gotham City upside down looking for her. When Harley crosses paths with Huntress (Mary Elizabeth Winstead), Black Canary (Jurnee Smollett-Bell), and cop Renee Montoya (Rosie Perez), the women learn they have no choice but to team up in order to take Sionis down once and for all.\r\n\r\nThe heartbeat of the film lies in Robbie’s iconic character interpretation of Harley Quinn. She is terrific in making her naughty character with a mean streak easy to love. Harley isn’t exactly a woman you want to emulate, but it sure would be fun to hang out and be friends with her.\r\n\r\nAll of the supporting performances here really are first-rate too. McGregor chews scenery with audacious glee, and his villain is truly terrifying. With the addition of a diverse, kick-ass female supporting cast playing equally bad-ass superheros, the film takes a multicultural feminist slant that thankfully doesn’t seem forced by committee.\r\n\r\n“Birds of Prey” is the type of scrappy mayhem that gives a sparkle of excitement to the mostly bland and boring DCEU. It’s colorful and chaotic, reckless and energetic, and I am surprised that I enjoyed this movie as much as I did. This is a really, really fun spectacle that could bring new fans to the genre.", "created_at": "2020-03-27T01:47:31.782Z"}, {"movie_id": 495764, "review_id": "5e7e783190dde00013a22b50", "author_rating": 9.0, "review_text": "'Birds of Prey' its absolute thrill ride. It's unapologetically fun and crude and violent. To quote Saoirse Ronan from 'Little Woman'... \"Women.\"\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-birds-of-prey-im-here-to-report-a-terrible-crime-dc-has-saved-cinema", "created_at": "2020-03-27T22:03:29.342Z"}, {"movie_id": 495764, "review_id": "5e92333dd55e4d001317fb50", "author_rating": null, "review_text": "I am afraid to say,, but after watching Suicide Squad which was pretty good.\r\nThis is a let down and I was looking forward to watching it.\r\nAfter watching this I think if there was a plot/story behind the movie, I couldn't see it it was all over the place and nothing seemed to follow.\r\nAll I can say about this movie is the Actors/Actresses were paid to be stupid and not funny, I hoped for better things and got trash.", "created_at": "2020-04-11T21:14:37.757Z"}, {"movie_id": 495764, "review_id": "5ea0427ddd2589001fd177af", "author_rating": 7.0, "review_text": "**Very refreshing and funny**, The movie is very different from like any team-up movie I've ever seen, it will make you forget that it's a superhero movie entirely it feels like it's just a crazy movie with criminal minds all over the city moving quite freely in fancy dress until one scene of Black Canary where you realise yeah you're watching a super-hero movie they gota show their powers. **It's violent and humorous and Margot Robbie's Harley Quinn is Fantastic and I really loved the Crossbow Killer**,\r\nDCEU has come up with really great works since the Justice League (ignoring the Aquaman) and if you're counting the upcoming DCEU movies then you'll see a very great future for DC with Batman, Shazam 2 and Wonder Woman sequel.", "created_at": "2020-04-22T13:11:25.282Z"}, {"movie_id": 495764, "review_id": "5ec38b7f3d3557001de1e80e", "author_rating": 8.0, "review_text": "If COVID-19 ushered cinemas off this mortal coil, I'm kind of strangely okay with telling people this was the last thing I ever got to see on the big screen. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2020-05-19T07:32:15.704Z"}, {"movie_id": 495764, "review_id": "5ec431cf18b7510020cb6010", "author_rating": 5.0, "review_text": "Margot Robbie's Harley Quinn was one of the few highlights of Suicide Squad but once this one was announced, I felt indifferent and the trailers didn't do much to change that to the point I skipped this in theaters. Watching it now, I came away shrugging my shoulders. Some of the action scenes, supervised by Chad Stahelski, were okay but the pacing was all off and the actual BIRDS OF PREY, were sidelined and don't really get any memorable moments. Similarly, Ewan McGregor was alright but a weak villain.\r\n\r\nAs a fan of the Batman comic book, outside of HQ, none of these resemble their counterparts, most notably Cassandra Cain who was a great character (trained as an assassin as a little girl by her father, David Cain, before being taken in by Bruce Wayne).\r\n\r\nIDK, in the end this was a misfire and don't think it was the fault of an inexperienced director (using the same script, not sure anyone else would've made all that much better). Could be a case of being too much of a vanity project for Robbie. **2.75/5**", "created_at": "2020-05-19T19:21:51.158Z"}, {"movie_id": 495764, "review_id": "5eeaa75081da3900364db5d5", "author_rating": null, "review_text": "Whilst many films have a message its a fine line between informing and lecturing. \r\n\r\nFor me \"Birds of Prey\" fails to appreciate this distinction. Its incessant, brittle, feminist finger wagging, is downright tiresome and quickly exhausted any sense of pleasure, I might have derived from this film. \r\n\r\nIts a shame too, as the underyling mechanics of the story could have worked well as a basic, by the numbers, action mash up. \r\n\r\nRegrettably that was not to be and whats left, is not something I would pay to see again. Which also applies to any spin offs or future efforts, in this vein. \r\n\r\n2/10.", "created_at": "2020-06-17T23:29:20.730Z"}, {"movie_id": 495764, "review_id": "5f2bddea3009aa0035719338", "author_rating": 3.0, "review_text": "There's boring power fantasies for boys.\r\n\r\nThis is the same boring power fantasy, but for girls.\r\n\r\nThe characters are flat, the action well filmed but inconsequential, the story nonexistent, and the entertainment value... don't be sober if you want to be entertained. In the genre of mindless action entertainment, this is still at the bottom of the barrel - like some of the 80s action movies which are better off forgotten.\r\nNice styling and set design, though.\r\n\r\nThe actors did their best given what they had to work with, but it is only Margot Robbie who impresses by making the main character watchable by her acting.\r\n\r\nVerdict: Even if you are in for mindless action, don't waste your time on this. Clips are enough to see style and script.", "created_at": "2020-08-06T10:39:38.984Z"}, {"movie_id": 495764, "review_id": "5f4ea0d1b2681f0030dee660", "author_rating": 6.0, "review_text": "Average watch at best, might watch again, and can't recommend.\r\n\r\nThere are several ways to look at this movie:\r\n1) From a sequel stand point.\r\n2) From a comics stand point.\r\n3) From a stand alone movie stand point.\r\n\r\n\r\n1)  Sequel stand point\r\nTHERE IS AN ENTIRE MOVIE MISSING!  This is the 3rd part of the \"Harley Quinn Trilogy\".  We're missing an entire transformation of a character from one thing to another for this movie to even be able to happen.  And if you're picking at that thread, then there is probably 2 or 3 movies before \"Suicide Squad\".\r\n\r\n2)  From a comics standpoint\r\nOMG, they pooed all over almost every concept they borrowed from the comics.\r\n-Harley leaving the Joker- This was a huge Gotham event, not from a Gotham standpoint, but in the revolution and rebirth of a character that literally is left out of the story here.\r\n-Birds of Prey- Never mentioned in the movie, they come together our of necessity, like the Avengers, when the original concept was orchestrated by Oracle who hand picked women in the vigilante field to help her, but at least they included the originals, Huntress and Black Canary\r\n-Huntress- I've never loved Mary Elizabeth Winstead more, but they turned the \"Crossbow Killer\" vs Huntress thing into a really poor joke, making her seem sad instead of powerful, when should be saying, \"I am the Huntress\" to install the fear of the name into criminals as she was a killing vigilante, the only reason Batman wouldn't work with her, and a main contention with Oracle.\r\n-Black Canary- I understand that there are WAY too many white characters, but the solution is not to \"wash\" characters, just create new characters that help balance out the whole pool.  Jurnee Smollett is awesome, and she does a great job, but she's not the same Black Canary that I know, that was an international spy / mercenary (basically an American Black Widow).  The gritty reboot is good, I'd just rather it be her own character and have it stand on her own awesome footing.\r\n-Cassandra Cain-  What a creative way to ruin a future Batgirl movie.  And that has to be what it is.  They some contention with someone else wanting the rights (or they're elapsing) and we're seeing what happened to Spiderman and Venom, they're using the name so someone else can't.  She was supposed to be the assassin turned vigilante, the daughter of Deathstroke, raised in the League of Shadows, but sure 2 bit pickpocket works.\r\n-Harley Quinn- They are all over the place with her, from helpless girl to badass to bad fighter to lucky only to clueless to amazing intellect, to violent psychopath to emotional friend.  Pick a lane.  And the \"word on face\" thing didn't go over well with Joker, not sure why the kept such a distraction when her face is already the symbol with which she garners the desired attention.\r\n\r\n3)  Stand alone movie\r\nI hate the stupid way they jump around with the story: I didn't like in in \"Pulp Fiction\" where it had purpose, I doubt I'll ever like it anywhere else.\r\n\r\nThat aside, this is actually pretty great, they spent a lot of money to get the production value where it needs to be, the cast is awesome, the story (when understandable) is pretty good, and the characters are entertaining as hell, even if Harley Quinn now seems to be a lot more Deadpool than I want.\r\n\r\nMost of its problems are just that it is trying to be a Gotham Knights, DC movie when it absolutely doesn't have to be.  Using names that people don't recognize and giving them a different experience only turns your great movie into a good movie.\r\n\r\nI miss the days when people just made a thing they thought was good and saw if they were right.  All this spreadsheet analysis of world wide information is definitely skewing movies, and we haven't even been doing it long enough to see if it's really effective measurement.\r\n\r\nLong-short: it's a good enough movie to be potentially great if you just pretend you know nothing about anything else.", "created_at": "2020-09-01T19:28:17.909Z"}, {"movie_id": 495764, "review_id": "5f57b2d390cf510033a96160", "author_rating": null, "review_text": "If you found yourself internally screaming for Ryan Reynolds to shut the hell up during Deadpool, then the relentless, zany narration of Margot Robbie’s Harley Quinn will likely send you gibbering and ruined towards the emergency exit after, oh, 23 seconds.", "created_at": "2020-09-08T16:35:31.365Z"}, {"movie_id": 495764, "review_id": "5fda3918511d09003f5fe607", "author_rating": 6.0, "review_text": "Harley Quinn: Birds of Prey is DC entertainment's latest effort to conquer the territory of film-adapted comics, a different effort with a really interesting idea at its base. Making Harley Quinn the main character in your own movie after shining on the terrible Suicide Squad makes perfect sense, ridding her of the Joker’s abusive control makes the idea even more interesting (although I’m of the opinion that Joker should have been the great villain of this film).\r\n\r\nSometime after the events of Suicide Squad, and after ending his relationship with the Joker, Quinn breaks up with the factory where he gave himself up to his former crush, announcing to Gotham the whole time that he was no longer under the protection of the feared Crime Clown . Of course, in doing so, Quinn makes herself a target to shoot down, due to all the evil she had done in the past, inspiring the villain Roman Sionis (played by an eccentric Ewan McGregor) to chase her, that and a missing diamond causes Harley to cross paths with the group of women whose title the film refers to.\r\n\r\nI would say that the biggest problem with Harley Quinn: Birds of Prey is the combination of several elements that do not always make the most sense. There are times when the film seems to want to put Harley in the midst of a new team such a Suicide Squad, other times when it is only concerned with focusing on it, as if it were trying to follow a plot in which, in the end, it would face Joker (Since Joker doesn't even make any appearance in the film, being replaced by Roman Sionis).\r\n\r\nIn my opinion, Harley Quinn: Birds of Prey doesn't really know what he wants to be, and I can't help feeling that Joker was supposed to be part of the film, but due to the drama with the negative reception of Jared Leto's interpretation, it was excluded completely from the project. However, McGregor's interpretation gives Ronan Sionis an aura of threat, of terror, as he really seems to be dangerous and we still feel his ferocity emanating from the screen.\r\n\r\nThat said, all the interpretations are really excellent, Margot Robbie is enthusiastic on paper, her character is highly memorable and the only one in the film that is really 100% developed. Mary Elizabeth Winstead is incredible in the role of Huntress, despite the little material given to her, and brings a natural charisma to the character that makes her really special, without her this would be an easily forgotten character. Jurnee Smollett-Bell as Canary is also extremely convincing, and brings to the paper a special magnetism that leaves it as one of the most memorable parts of the film.\r\n\r\nHarley Quinn: Birds of Prey, on the whole, is not a bad film, although thematically confusing, it is extremely fun and will certainly get a lot of laughs from the audience. Again, Harley Quinn is also the piece that really makes this project so unique, and seeing it on the screen is something that will leave any audience member with a smile on their face.\r\n\r\nIt is also important to note that the film contains incredibly well choreographed action sequences, which become a visual delight as they become crazier. Their performance is delusional and fiery, as in the rest of the film, giving it a very extravagant and remarkable style.\r\n\r\nSo, while Harley Quinn: Birds of Prey is no Wonder Woman (2017) and contains a host of problems, it's also extremely fun, a good time spent in the cinema without the obligation to think about the general problems of life. I can't say that I loved the movie, but I didn't hate it either, it's a decent guilty pleasure and a decent hour spent in front of the big screen.", "created_at": "2020-12-16T16:43:04.797Z"}, {"movie_id": 495764, "review_id": "60f8097539a1a60082ff2b76", "author_rating": 5.0, "review_text": "About 'Birds of Prey' writing a lot in principle illegally and unnatural! Tape this clearly does not deserve! After all, the authors and producers completely forgot that people love not only with their eyes but also ears, soul, and brain. And with this love here is clearly stress.\r\nTotal: an empty bright one-time little interesting cocktail with two famous actors, flat jokes, absolutely not exciting plot.", "created_at": "2021-07-21T11:48:05.675Z"}, {"movie_id": 495764, "review_id": "62418bd097a4e60047a3a0fe", "author_rating": 4.0, "review_text": "Sorry, but this is a really poor attempt at an action film. Margot Robbie is Ok as the feisty heroine from the title, but the rest of the cast are instantly forgettable. I am guessing that Ewan McGregor - the dastardly villain of the piece - was only available for a few filming days as his appearances are pretty shallow from a characterisation perspective and add little to the plot. The interminable fight scenes reminded me of \"Bugsy Malone\" (1976) only without the custard pies.", "created_at": "2022-03-28T10:20:00.434Z"}, {"movie_id": 495764, "review_id": "62b0c4b277b1fb0062a56533", "author_rating": 9.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/fly-away-home-birds-of-prey-and-the-fantabulous-emancipation-of-one-harley-quinnnbspreview<a>\r\n\r\n_Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)_ is one of the few comic book movies that really gets the spirit of its source material. Director Cathy Yan understands that it should be a chaotic Technicolor feast of action and adventure, and her love letter to Harley Quinn (Margot Robbie) is a blast.", "created_at": "2022-06-20T19:04:18.185Z"}, {"movie_id": 495764, "review_id": "62bdf9adeb09320052396e64", "author_rating": 7.0, "review_text": "Birds of Prey starts off incredibly strong, with a fantastic introduction to Harley Quinn and her downfall post Joker break up, but the story starts to fall off the rails towards the end. It was hard to stay engaged in the movie with it jumping around so much due to the unreliable narrator that is Harley Quinn. Even though I get the direction they were going for, it just did not work for me. I really did not care about a couple characters in the main cast and found myself on really liking Harley and Black Canary, the other two felt underdeveloped. Ewan McGregor did a fantastic job as the villain in this film, every scene he captivated me with calm demeanor quickly spiraling into insanity, he stole the show. The fight choreography in this film was top notch too, with plenty of creative kills and interesting visuals to boot. I found myself mixed, where I like a part and got bored at others. Definitely inconsistent, but a fun watch none the less.\r\n\r\n**Verdict:** _Good_", "created_at": "2022-06-30T19:29:49.792Z"}, {"movie_id": 495764, "review_id": "62dfa7bf481382004cbd497a", "author_rating": 8.0, "review_text": "Nonstop mindfu#k journey through the eyes of Harley Quinn. So much fun to see her character arch. Margot makes it so much fun with putting so many little details like facial expressions, the way she delivers lines, and sometimes just her total awkwardness in the moment. Fun film.", "created_at": "2022-07-26T08:37:19.923Z"}]