[{"movie_id": 333339, "review_id": "5ac333d092514126c302d333", "author_rating": 3.0, "review_text": "There's a moment in this movie when the central character says \"I love her\". His friend hastily replies, \"Slow down bro... she could be a 300 lb man living in his mom's basement.\" In the very brief beat between the two lines, I thought FINALLY a movie about falling in love completely independent of what a person's genetics may be. And then the crushing cynicism in a dystopian world where there is little to live for and even less to hope for: even in a nightmare, a fat man is undateable.\r\n\r\nDon't worry though. If you have the skills you may end up on top. Just like Ben Mendelsohn's slave-owning antagonist almost did. Because in this story, it's not a world where anyone feels compassion or empathy. It's a world where everyone only thinks of themselves. A sociopath's dream. And that's what earns the top prize.\r\n\r\nI love looking at Tye Sheridan. But not enough to sit through this again.", "created_at": "2018-04-03T07:57:04.990Z"}, {"movie_id": 333339, "review_id": "5ac8816fc3a36834d7040f13", "author_rating": 7.0, "review_text": "I watched this movie because I was once working in the VR industry and really curious what it could tell us (even though I am not really interested after watching the trailer).\r\n\r\nAnyway, the experience is not bad (in 4DX). But not recommended for a second watch since there is little to dig and feel except for the numerous, eye-dazzling amount of Easter eggs.\r\n\r\nSorry.", "created_at": "2018-04-07T08:29:35.660Z"}, {"movie_id": 333339, "review_id": "5adc381c0e0a26144501a3c6", "author_rating": null, "review_text": "Another great movie from Steven Spielberg", "created_at": "2018-04-22T07:22:04.232Z"}, {"movie_id": 333339, "review_id": "5ae455889251416ce400528b", "author_rating": 5.0, "review_text": "Obviously everything from the book cannot go into the movie, however a lot of what got into the movie was not from the book. Too much focus on car chases and too little on solving a puzzle.\r\n\r\nIf you haven't read the book, read the book! it's much more awesome!", "created_at": "2018-04-28T11:05:44.540Z"}, {"movie_id": 333339, "review_id": "5b99d4c892514133c1000abb", "author_rating": 5.0, "review_text": "Can you imagine watching this if you didn't give a fuck about the '80s? Like there's nothing that happens in _Ready Player One_ that isn't a reference to **something** at least, but almost all of them are '80s references. I mean I worship at the altar of 1980s' references on a daily basis, and even for me this was only so-so, I fear to imagine what _Ready Player One_ might be like for someone who actually demands originality.\r\n\r\nHonestly, it was better than I was expecting, I'll front to that. The promotional campaign for this had the barometer for my excitement on this at a firm zero, and by the time I had finished watching it I was surprised to find I had actually enjoyed multiple things about it, but _Ready Player One_ is an exercise in lack of subtlety, and really tries your limits on suspension of disbelief. Not because of the fantastical endless virtual world inhabited by near every creation since the dawn of pop-culture, but because of the character interactions in their \"real world\".\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-09-13T03:08:56.285Z"}, {"movie_id": 333339, "review_id": "5ba74234c3a3680e52021def", "author_rating": 10.0, "review_text": "I did not know what I would really think about it when I started to watch this movie. I hoped that I would like it but I was not sure what I would actually get. I used to like Steven Spielberg a lot but later in his career he’s done movies that either was not my kind of movies or that I was simply not that impressed by. However, as it turned out, this one I liked a lot as you can see from my rating.\r\n\r\nAs a computer nerd and science fiction geek this movie was of course right up my alley. I have thought other movies would be my kind of movies before but been sorely disappointed by ignorant and incompetent screen writers and directors trying to cash in on subjects that they knew absolutely nothing about. Spielberg did a good job of not screwing this one up.\r\n\r\nThe core of this movie is of course plenty of action and computer generated special effects with a somewhat apocalyptic story to bind everything together. The story works but it is not really anything special and some of the stuff, like the loyalty centers, was frankly a bit silly. But, as I wrote, it works and does not get in the way so that’s good enough for me.\r\n\r\nAs the previously mentioned nerd and geek I absolutely loved the abundant references to science fiction, fantasy and gaming history and lore. For me those were soo cool. I will probably watch the movie again just to focus on the background and see how much stuff I can spot. Stuff that I missed when watching the movie the first time.\r\n\r\nThe CGI effects and the action was also pretty awesome. The movie starts off right away with a great and absolutely insanely wild car race and continues to go strong from there. The battle at Doom castle at the end is just epic.\r\n\r\nThe only thing that made me go WTF was at the end [SPOILER AHEAD] were Mr Asswipe Sorrento finally catches up with the High Five’s van and the he just freezes and looks at Wade with a silly look on his face. What the fuck was that? Just stupid for no good reason.\r\n\r\nWell, few are the movies where there’s nothing to gripe about. On the whole though this movie was great in my book. Also, I cannot say how pleased I am to finally watch a Hollywood movie that is not a remake or a sequel or a prequel or some other lame excuse to rehash a movie that has already been made.", "created_at": "2018-09-23T07:35:16.992Z"}, {"movie_id": 333339, "review_id": "5bf85fc00e0a2626740fe0ed", "author_rating": 7.0, "review_text": "\"Wild trip down memory lane... in a DeLorean\"\r\n\r\nIn 2045 people escape their harsh reality by going to a virtual world called the OASIS. After the creator dies, he challenges all users to go on a hunt for an Easter egg which gives them control over the OASIS.\r\n\r\n'Ready Player One' isn’t a movie you’d expect from a 71 year old filmmaker but Spielberg once again shows his range. It's an incredibly fun ride that’ll have you cracking up more than once (“It’s f***ing Chucky!”).\r\n\r\nWhile Spielberg switches seamlessly between real life and the virtual reality it’s rather difficult to get emotionally invested in the movie. Nonetheless most characters are fun and the love story between Parzival/Wade and Art3mis/Samantha gives it some depth.\r\nBen Mendelsohn is delightful as the villain and Mark Rylance is excellent once again.\r\n\r\nThe biggest treat of course is the nostalgia. You’ll have a blast simply by counting the pop culture references(Iron Giant’s thumbs up and the Shining among my personal favorites). The movie features a killer 80’s soundtrack and Alan Silvestri provides the finishing touch with a wonderful score.\r\n\r\nReady Player One is a visual feast. See it on the biggest screen you can find. Preferably in Imax. Especially during the race you’ll be blown away.", "created_at": "2018-11-23T20:14:56.217Z"}, {"movie_id": 333339, "review_id": "61312936c1ffbd0063110824", "author_rating": 5.0, "review_text": "### failing the splits\r\n\r\nOn one hand, this is a 1980s pop culture SciFi mash-up.\r\nOn the other, it is a 100% true-and-tested formulaic David-vs-Goliath, by the (Campbell) books youth adventure.\r\n\r\nThere are movies which can be enjoyed by young, older, and old; some even achieve that effortlessly.\r\n\r\nThis movie tries to cater to two target audiences, and fails. It's too constructed, too obvious to be enjoyable. All the CGI fireworks, multi-medial cues and in-jokes can't help its main flaw: it is boring. It's the same tired young-hero-story that has been remade thousands of time, and often better.\r\n\r\nMaybe younger kids enjoy it. But these days, even teenagers are media-savvy and will see the pattern.\r\n\r\nPity. I was ready to like it.", "created_at": "2021-09-02T19:42:46.100Z"}, {"movie_id": 333339, "review_id": "625a397be0ec511959294975", "author_rating": null, "review_text": "So I loved the movie very action packed and interesting in design. Now I do have to agree that most of the book of solving the puzzles and that would have been enjoyable to see but might have made the movie more boring. The action kept my family entertained. And the Easter eggs and music was it for me.", "created_at": "2022-04-16T03:35:23.219Z"}, {"movie_id": 333339, "review_id": "63bf8875df857c00bc20dd4a", "author_rating": 10.0, "review_text": "Wait, I didn't review this yet? How did I forget?\r\n\r\nWhat we have here is honest Nostalgia Candy, not the forced rebranding rebooting and reimaging that we are seeing in Hollywood today. It doesn't rely on a familiar brand to sell tickets to a movie that has nothing to do with the brand and really, ultimately trashes it.\r\n\r\nRather, it relies on nostalgia to tell a fun, dynamic, and entertaining story that features all the glorious creations that we loved back when, well, back when Hollywood was still making glorious creations.\r\n\r\nAnd, because of that, you walk away totally satisfied.", "created_at": "2023-01-12T04:11:33.606Z"}, {"movie_id": 333339, "review_id": "63e72f5f12777800931d00d3", "author_rating": 9.0, "review_text": "**Ready Player One is the pinnacle of video game films with extremely high replay value!**\r\n\r\nReady Player One puts Steven Spielberg right in his sweet spot with a nostalgic adventure love letter to movie fans, 80s kids, and gaming enthusiasts. This movie drips with Easter eggs to all kinds of pop culture, making every moment a fun scavenger hunt to see how much you recognize. Tye Sheridan and Olivia Cooke were delightful in their lead roles with classic bad guy Ben Mendelsohn in hot pursuit. Ready Player One felt like a familiar classic, even in its first viewing. Even with a unique plot and a fresh story, all the references to iconic franchises, both new and old, give the film nostalgic vibes that transport me back to find memories and the fun of my childhood. Spielberg creates a childlike sense of innocence, awe, and wonder while simultaneously creating adventure and peril. Even though this movie has high ratings, it’s still underrated! One of the most fun, feel-good adventure films I have seen and one of Spielberg’s most charming and thrilling movies.", "created_at": "2023-02-11T06:02:07.680Z"}, {"movie_id": 333339, "review_id": "6532962d6f8d9500ac5d121f", "author_rating": 3.0, "review_text": "Call me when the script is finished.", "created_at": "2023-10-20T15:01:01.802Z"}]