[{"movie_id": 504172, "review_id": "5d2906e8a294f000112a3b9e", "author_rating": 7.0, "review_text": "**_Laconic, measured and easy to digest, although it could have done with more substance_**\r\n\r\n> _How many addicts are out on the street simply because Mr. Sharp brought the cocaine here?_\r\n\r\n- Sam Dolnick quoting AUSA Chris Graveline; \"The Sinaloa Cartel's 90-Year-Old Drug Mule\"; _New York Times_ (June 11, 2014)\r\n\r\n63 years since he first appeared on-screen (an uncredited role in Jack Arnold's 1955 _Revenge of the Creature_), _The Mule_ is 88-year-old Clint Eastwood's first acting role since Robert Lorenz's _Trouble with the Curve_ in 2012, and his first film as a director since about a week ago. It is, however, the first time he's directed himself since the excellent _Gran Torino_ in 2008. Known for being incredibly efficient when it comes to filmmaking, Eastwood likes to get scripts into production before they've gone through too many rewrites, he rigidly shoots only what's on the page, he avoids multiple takes and on-set experimentation, and he keeps the editing process as simple as possible – so basically, he's the anti-Terrence Malick. With this in mind, he has maintained an extraordinary rate of turnover, with _The Mule_ the 37th feature he's directed since _Play Misty for Me_ in 1971.\r\n\r\nOf course, when you work at that rate for as long as he has, you're going to put out a few duds, and although his directorial output has gone through ups and downs in the past, his most recent work has been arguably the most disappointing of his career, with pretty much everything he's directed since _Gran Torino_ being subpar. Whether it's the hokey sentimentality of _Hereafter_ (2010), the oversimplification (and awful makeup) of _J. Edgar_ (2011), the lifeless _Jersey Boys_ (2014), the unashamed and troubling jingoism of _American Sniper_ (2015), the unnecessary embellishments of _Sully_ (2016), or the spectacularly misjudged experiment in casting that was _15:17 to Paris_ (2018), the days when he could direct no less than seven masterpieces – _Unforgiven_ (1992), _A Perfect World_ (1993), _The Bridges of Madison County_ (1995), _Mystic River_ (2003), _Million Dollar Baby_ (2004), _Flags of Our Fathers_ (2006), and _Letters from Iwo Jima_ (2006) – in a 14-year period are long gone. Indeed, the most notable thing he's done in the last decade is ramble somewhat incoherently to an empty chair.\r\n\r\nThe bad news is that _The Mule_ is a strangely formless film, almost a collection of only vaguely connected scenes rather than an actual narrative with forward momentum; it has precious little depth or nuance; there's some troubling casual racism, most of which we're encouraged to laugh at; the tone is all over the place; Eastwood's character has not one, but _two_ threesomes with young women; and it wastes almost all of its excellent cast. The good news is that, somehow, it's extremely enjoyable, and is easily the best film he's directed since _Gran Torino_.\r\n\r\nTelling the story of Earl Stone (Eastwood), a 90-year-old horticulturist and Korean War veteran, the film begins in 2005 as Stone is honoured at a daylily festival. Clearly enjoying the adulation (and the attention from the ladies), he doesn't seem to care that he's supposed to be attending the wedding of his daughter Iris (Eastwood's real daughter, Alison Eastwood). As she frets about his failure to turn up, Mary (Dianne Wiest), Stone's ex-wife and Iris's mother, points out that it's not a shock, as he has a history of letting his family down. The film then jumps to 2017 – Iris hasn't spoken to him since her wedding, and he is estranged from the whole family, except Iris's daughter, Ginny (Taissa Farmiga), who is herself getting married. His daylily business has gone bust, unable to compete with online shopping, and his house is in foreclosure. After a very public dressing down from Mary, Stone is approached by a friend of Ginny's who tells him that he knows some people who will pay anyone with a perfect driving record to \"_just drive_\" for them. Arriving at a garage guarded by heavily armed Hispanics, Stone is told to drive some duffle bags from El Paso to Chicago, with the only rule that he isn't to look inside the bags. He happily agrees, apparently unaware he has just signed on to mule for the Sinaloa Cartel. When he does inevitably look in the bags, finding cocaine, he isn't especially bothered, and as his first few runs go well, the Cartel start to increase the amount of drugs he's muling. So much so that cartel boss, Laton (Andy García), asks to personally meet this new mule, who has been nicknamed \"Tata\" (\"Grandfather\") by his handlers. Meanwhile, the leader of a DEA task force (Laurence Fishburne) is under pressure to start getting results, and so he gives agents Bates (Bradley Cooper) and Trevino (Michael Peña) instructions to start making arrests sooner rather than later, which they promise to do, explaining that they are nearing in on a prime target – a prolific mule known only as Tata.\r\n\r\nWritten by Nick Schenk, who also wrote _Gran Torino_, _The Mule_ is, extraordinarily, based on a true story. Specifically, it's inspired by Sam Dolnick's 2014 _New York Times_ article, \"The Sinaloa Cartel's 90-Year-Old Drug Mule\", which tells the story of Leo Sharp, an award-winning horticulturist and World War II veteran who became the Sinaloa Cartel's most reliable mule. Despondent from financial problems and the loss of his daylily business, Sharp began transporting cocaine from Arizona to Michigan in 2005. With Sinaloa quickly realising how reliable he was, he was soon moving up to 300 kilograms per trip and transporting as much as $2million dollars in the opposite direction. In October 2011, while in possession of 90 kilograms, Sharp was arrested by Michigan state police operating as part of a DEA task force. He was sentenced to three years in prison, but was released in 2015 after a year behind bars, due to declining health. He died of natural causes in 2016 at the age of 92.\r\n\r\nThe first thing to be said about _The Mule_ is that the trailer is misleading. And then some. Suggesting a tense, nail-biting thriller in which Stone is appalled to find out what he has been transporting, but is unable to back out of his deal, and must try to keep the Cartel on-side whilst evading the attention of the DEA, the trailer has next-to-no relationship with the actual film. It's not tense, my nails were thoroughly unbitten, Stone isn't overly concerned when he learns what's in the bags, and the very narrative structure means it's inevitable that Bates will catch up to him sooner or later. It most certainly isn't the Michael Mann-esque crime thriller it's being advertised as. Instead, _The Mule_ is laconic and contemplative, laid-back and not especially dramatic (there's more fireworks in the arguments Stone has with his family than in his relationship with the Cartel, and the film as a whole is more _Last of the Summer Wine_ than _Miami Vice_). Indeed, as drama, _The Mule_ is fairly insubstantial, telling a threadbare story populated by underwritten characters, void of much of an emotional core, and with next-to-nothing in the way of an exciting _dénouement_.\r\n\r\nAs a director, Eastwood's last three films (_American Sniper_, _Sully_, and _The 15:17 to Paris_) have all told true stories of ordinary people who have come to be seen as heroes for one reason or another, whether they wanted to or not. Earl Stone is definitely not a hero (any more than Leo Sharp), but he is an everyman, a person down on his luck who finds a way to stick it to the system. And that makes him, at best, empathetic, and at worst, an anti-hero (yes, the fact that he's literally transporting misery and suffering is problematic, but we'll get to that). Stone is charming, funny, and intelligent, and his attempts to make up for his mistakes with Iris by being there for Ginny seem genuine. Eastwood plays Stone as full of regret, someone who knows he was a terrible husband and father, and the fact that his estranged daughter is played by his real daughter gives the film the impression of being personal (Eastwood, like Stone, has an, let's be diplomatic, \"appreciation\" for the ladies). From a physical standpoint, Eastwood looks noticeably older than he did in _Trouble with the Curve_; he walks hunched over, he looks frail enough for a strong wind to knock him down, there's next-to-no meat on his arms. Almost all of that Eastwood-ruggedness is gone, and this is easily the most physically vulnerable we've ever seen him on screen, even more so than that other titan of old-school American masculinity, John Wayne, who made _The Shootist_ (1976) when he was literally dying.\r\n\r\nIn a lot of ways, Stone is not unlike Walt Kowalski, the hateful racist character Eastwood played in _Gran Torino_. They are both Korean War veterans who find themselves alienated from the world they live in, and who believe the next generation lack fortitude (at one point, Stone complains, \"_this generation can't open a fruit-box without calling the internet_\"). However, Stone is much softer, and on the universal scale of racism, whereas Kowalski is Mel Gibson-racist, Stone is Prince Philip-racist; the type of racism we forgive because he's 837 years old, half-senile, and grew up \"_in a different time_.\" Sure, he calls Hispanics \"beaners\" and jokes about them getting deported, but they don't seem to mind. Sure, he pulls over to help a black couple change a tire, proudly telling them he likes \"_to help the negro folks out_\", but they just politely inform him that people don't use the word \"negro\" anymore. And it isn't just ethnicities. Encountering a group of lesbian bikers, he refers to them as \"_dykes on bikes_\". All three of these examples are played for laughs, and whilst that might be fair enough in a film that depicts non-Caucasians with something resembling diversity, _The Mule_'s non-white characters are one-dimensional stereotypes; every Hispanic character, for example, is either a drug-running criminal (most of whom have neck tattoos) or an industrious labourer. If the film itself didn't come across as so racially reductive, Stone's racism would be easier to accept and defend.\r\n\r\nPerhaps the film's most egregious failing, however, is that it never once addresses the fact that Stone's criminal enterprise is fuelling addiction and destroying lives; as far as the film is concerned, he may as well be transporting oranges. The darker implications of his drug-running are kept firmly behind the curtain, out of sight of the audience. Instead, _The Mule_ presents Stone as almost a modern-day Robin Hood, using his new-found cash to pay for Ginny's wedding and education, and to renovate the local VA hall. This _could_ be a sly comment on Obama-era economics, suggesting that the country is in such a mess that issues like the exorbitant price of education and the mistreatment of veterans can only be addressed with the proceeds of crime. But honestly, that's a serious stretch, and it seems far more likely it's the film's way of ensuring we continue to admire Stone despite what he's doing. In any case, even when the film has no option but to directly deal with his criminality, it's done in such a way as to minimise the darker aspects. For example, Laton may be the most jovial and least-threatening drug lord ever put on screen. García does what he can with the part, but given the fact that most of his screen time sees him fooling about with a solid gold shotgun, his options are limited (one legitimately funny moment sees Stone marvelling at Laton's mansion, asking \"_who do I have to kill to get a place like this?_\" to which Laton responds, \"_many, many people_\"). A much more effective character is Gustavo (Clifton Collins Jr.), Laton's henchman. Collins Jr. is a superb actor, and can do legitimately intimidating in his sleep, but even an actor of his calibre can do little with only three scenes, in two of which he doesn't even have any dialogue (in a film with a wasted cast, the underuse of Collins Jr. stands out).\r\n\r\nHand-in-hand with the film's non-threatening drug runners is its depiction of local law enforcement, who are, for the most part, presented sarcastically (at one point, Stone distracts a pesky cop with a tub of caramel popcorn). The DEA characters are presented a little more respectfully, however. Fishburne's unnamed character, for example, is depicted as a good agent shackled by a bureaucracy that only cares for short-term wins. Thus, they pressure him to pressure his field agents to get results before the case has matured, meaning any arrests will be strictly low-level. This aspect of the film reminded me of the first season of _The Wire_, where Deputy Ops. Ervin Burrell (Frankie Faison) is constantly pressuring Lt. Daniels (Lance Reddick) to get some \"_dope on the table_\" – small scale arrests that provide a photo op for Baltimore PD brass to proudly display the confiscated dope on the table, irrespective of the fact that such operations result in the arrests of street hoppers rather than anyone in management.\r\n\r\nA key scene in relation to the film's depiction of both law-enforcement and minorities, but one which is disappointingly played for laughs, is when the cops pull over who they think is Tata only to quickly realise it's the wrong man (it's a young Hispanic) and they're guilty of racial profiling. The man is terrified, well aware of stats concerning police shootings of non-whites (there's something deeply unsettling about how well he knows the routine, and his line, \"_statistically speaking, this is the most dangerous five minutes of my life_\" speaks volumes about modern America). The scene should have given rise to a socio-political commentary – what is it like to be the victim of racial profiling, how does it feel to know that you've just committed racial profiling, what does it say about society in general when an innocent man knows enough about such instances as to fear for his life? Eastwood, however, is more interested in guffaws. We've seen racial profiling and resultant deaths examined in several recent films – Steve McQueen's _Widows_, George Tillman, Jr.'s _The Hate U Give_, and Reinaldo Marcus Green's _Monsters and Men_ (all 2018) – as well as slightly older titles such as Paul Haggis's _Crash_ (2004) and Ryan Coogler's _Fruitvale Station_ (2013), but the depiction here is, sadly, very shallow. The film is also silent on the inverse – that Stone is such a good mule because of his white privilege.\r\n\r\nAnother issue is that the film's structure is bizarre – there's no real sense of narrative cohesion, as one scene jumps to another without a huge amount connecting them. You could take the various driving scenes, cut them in a completely different manner, and you would still have the same film; Stone picks up the drugs, drives for a while, drops off the drugs and gets paid, drives some more, has a scene with his family, we check in on the DEA, Stone picks up the drugs, drives for a while etc. The whole thing feels void of urgency, and after a while you realise that the threadbare outline of a story is all the story you're going to get. Additionally, there's an utter lack of tension (for which Eastwood tries to compensate with silly scenes such as when Bates follows Stone into a parking lot and shouts \"Hey.\" Is he going to arrest our hero? Nah, Stone just left his flask behind). On top of this, the way Eastwood's camera leers at the bare asses of a bunch of women at a party in Laton's house is disconcerting, and pretty much a textbook example of the male gaze. Also, with the single exception of Stone, the characters are one-dimensional at best (Fishburne's character doesn't even get a name; Peña is nothing but the comic relief to Cooper's straight man).\r\n\r\nIf all that sounds negative, it should, because I focused on what I felt was wrong with the film. However, irrespective of these failings, I thoroughly enjoyed _The Mule_. It could and should have been a lot better. It could have been a socially conscious thriller looking at racial profiling, drug-dealing, American masculinity, generational conflict, socio-economic issues. But, in fairness, that isn't the film Eastwood set out to make. He has made many interesting political films in his career. _The Mule_ is not one of them. Instead, he's turned the material into a jaunty, congenial, inoffensive, and easy-to-watch meditation on age and family, set in a _milieu_ where the one-time trappings of male success are now considered character failings, and focused on a character unable to wrap his brain around this shift in ideology. Despite myself, I can forgive the casual racism, the structural problems, the wasted cast, the use of serious social issues to get cheap laughs, and I can do so because the film is simply enjoyable. _The Mule_ isn't going to change your life, nor is it going to win Eastwood a legion of new fans. But it was never supposed to. Instead, it accomplishes exactly what it set out to do. And it's immensely entertaining to boot.", "created_at": "2019-07-12T22:17:12.336Z"}, {"movie_id": 504172, "review_id": "5e89fa1ecf1afd00116d3143", "author_rating": 9.0, "review_text": "I wonder if Clint Eastwood is one of the few directors who could have gotten this movie made. It took me a while to get around to watching it, partly due to some of the negative buzz I heard out there in the Interworld.\r\n \r\nI suspect I liked this movie for the same reason a lot of the bad buzzy folks hated it. How many respected directors have the star power to get a movie made that, even with a violent Mexican drug cartel involved in the plot, turns out to be a thoughtful, mostly gentle character study of an old man awakening fully to regrets of how he treated his family in his younger years. This type of story even goes against the grain of the violent movies that made Eastwood a star in the first place. \r\n\r\nIt is not a movie I will likely watch again - there is just too much out there still to see for this movie to draw me in a second time. But it was entertaining, a fine addition to the library of diverse films directed by the Man with No Name.", "created_at": "2020-04-05T15:32:46.143Z"}, {"movie_id": 504172, "review_id": "62099c30d7fbda009322d76c", "author_rating": 7.0, "review_text": "This be good.\r\n\r\nI enjoyed <em>'The Mule'</em>. It's an entertaining and well paced flick from 2018, as Clint Eastwood fully stars in a film for the first time since 2012's <em>'<a href=\"https://letterboxd.com/film/trouble-with-the-curve/\" rel=\"nofollow\">Trouble with the Curve</a>'</em> - and first also as director since 2008's <em>'<a href=\"https://letterboxd.com/film/gran-torino/\" rel=\"nofollow\">Gran Torino</a>'</em>. The 1930-born actor still has it!\r\n\r\nThere's a good cast behind Eastwood, with performances given by the likes of Bradley Cooper, Laurence Fishburne and Michael Peña - all of whom have worked with Clint before. Neat to see <a href=\"https://www.theringer.com/movies/2021/6/22/22545318/the-fast-and-the-furious-original-movie-20th-anniversary#:~:text=Gugliemi%20has%20one%20of%20my%20favorite%20Weird%20Movie%20Tidbits%20ever%2C%20which%20is%3A%20He%20has%20played%20someone%20named%20%E2%80%9CHector%E2%80%9D%20in%20a%20movie%20or%20TV%20show%20more%20than%20a%20dozen%20times.\" rel=\"nofollow\">Hector</a> himself, Noel Gugliemi, involved. One half of the <em>'<a href=\"https://en.wikipedia.org/wiki/Breaking_Bad\" rel=\"nofollow\">Breaking Bad</a>'</em> Salamanca brothers, Daniel Moncada, is there too.\r\n\r\nIncredibly, the film is based on a <a href=\"https://en.wikipedia.org/wiki/Leo_Sharp\" rel=\"nofollow\">real dude</a>! Quite the geezer!", "created_at": "2022-02-14T00:02:56.309Z"}, {"movie_id": 504172, "review_id": "6241b11397a4e60047a3f6a3", "author_rating": 7.0, "review_text": "Clint Eastwood takes on the character of \"Earl Stone\", an elderly gent who takes great pride in his award winning flowers but one who is broke; facing the loss of his home and his business. He has to earn some cash, so takes on a job as a delivery driver. He's a Korean War vet, so whilst never quite sure what he is \"delivering\", he knows full well that the less police involvement with his antics, the better. Soon his success snowballs and he gets himself an unwanted minder. As his money worries dwindle, his personal ones start to rear their heads: his ex wife and his granddaughter who have both had occasion to feel abandoned by him. The DEA is also aware that something is amiss, and they've drafted in \"Agent Bates\" (Bradley Cooper) whose team is soon focussing in on the eponymous character and the net is beginning to tighten. It's not the best film made by Eastwood, this - though at 88, maybe any criticism ought to bear in mind that most folks that age have long stopped trying - it's very slow, almost plodding at times and the characterisations don't quite ignite. The pursuing agents and his cartel employers feature all to peripherally to add much impact to what is essentially the star doing what John Wayne did so well in \"True Grit\" (1969) - playing the part of a determined old man, and playing it well.", "created_at": "2022-03-28T12:58:59.163Z"}, {"movie_id": 504172, "review_id": "63bf826505a5330085a42c7a", "author_rating": 10.0, "review_text": "I never understood how people disagree with giving a movie either 10 or only 1 star here. Either it does it's job or it doesn't.\r\n\r\nThe Mule is the kind of movie that my dad, rest his soul, would beg me to see in the theater with him, and then rave about after.\r\n\r\nA lonely old man that breaks a few laws in order to provide for his family and, in the process, gets himself into trouble with some bad guys.\r\n\r\nAnd it's all done without over-the-top action and special effects, making for a film that is completely reliant on script and acting alone.\r\n\r\nIn other words, it's old school, dry, and honestly, a pleasure to watch. And it has actual meaning. There is a plot here and a moral to the story. It's a rarity these days.", "created_at": "2023-01-12T03:45:41.999Z"}, {"movie_id": 504172, "review_id": "6495d9a8d5ffcb00c594d7ee", "author_rating": 7.0, "review_text": "**_Good enough Eastwood flick based on a true story_**\r\n\r\nA 90 years-old horticulturalist and war veteran (Clint Eastwood) inadvertently becomes a courier for a Mexican drug cartel. Will he continue to neglect his family?\r\n\r\n“The Mule” (2018) was directed by Eastwood and inspired by the real-life Leo Sharp. There are similarities to “Gran Torino” (2008), but not as much action. Long stretches naturally involve Earl Stone (Eastwood) driving the highways of America. But things perk up in the second half and there’s some welcome human interest.\r\n\r\nThe flick runs 1 hour, 56 minutes, and was shot in Atlanta and Augusta, Georgia, as well as Las Cruces, New Mexico.\r\n\r\nGRADE: B/B-", "created_at": "2023-06-23T17:43:04.111Z"}, {"movie_id": 504172, "review_id": "5d2906e8a294f000112a3b9e", "author_rating": 7.0, "review_text": "**_Laconic, measured and easy to digest, although it could have done with more substance_**\r\n\r\n> _How many addicts are out on the street simply because Mr. Sharp brought the cocaine here?_\r\n\r\n- Sam Dolnick quoting AUSA Chris Graveline; \"The Sinaloa Cartel's 90-Year-Old Drug Mule\"; _New York Times_ (June 11, 2014)\r\n\r\n63 years since he first appeared on-screen (an uncredited role in Jack Arnold's 1955 _Revenge of the Creature_), _The Mule_ is 88-year-old Clint Eastwood's first acting role since Robert Lorenz's _Trouble with the Curve_ in 2012, and his first film as a director since about a week ago. It is, however, the first time he's directed himself since the excellent _Gran Torino_ in 2008. Known for being incredibly efficient when it comes to filmmaking, Eastwood likes to get scripts into production before they've gone through too many rewrites, he rigidly shoots only what's on the page, he avoids multiple takes and on-set experimentation, and he keeps the editing process as simple as possible – so basically, he's the anti-Terrence Malick. With this in mind, he has maintained an extraordinary rate of turnover, with _The Mule_ the 37th feature he's directed since _Play Misty for Me_ in 1971.\r\n\r\nOf course, when you work at that rate for as long as he has, you're going to put out a few duds, and although his directorial output has gone through ups and downs in the past, his most recent work has been arguably the most disappointing of his career, with pretty much everything he's directed since _Gran Torino_ being subpar. Whether it's the hokey sentimentality of _Hereafter_ (2010), the oversimplification (and awful makeup) of _J. Edgar_ (2011), the lifeless _Jersey Boys_ (2014), the unashamed and troubling jingoism of _American Sniper_ (2015), the unnecessary embellishments of _Sully_ (2016), or the spectacularly misjudged experiment in casting that was _15:17 to Paris_ (2018), the days when he could direct no less than seven masterpieces – _Unforgiven_ (1992), _A Perfect World_ (1993), _The Bridges of Madison County_ (1995), _Mystic River_ (2003), _Million Dollar Baby_ (2004), _Flags of Our Fathers_ (2006), and _Letters from Iwo Jima_ (2006) – in a 14-year period are long gone. Indeed, the most notable thing he's done in the last decade is ramble somewhat incoherently to an empty chair.\r\n\r\nThe bad news is that _The Mule_ is a strangely formless film, almost a collection of only vaguely connected scenes rather than an actual narrative with forward momentum; it has precious little depth or nuance; there's some troubling casual racism, most of which we're encouraged to laugh at; the tone is all over the place; Eastwood's character has not one, but _two_ threesomes with young women; and it wastes almost all of its excellent cast. The good news is that, somehow, it's extremely enjoyable, and is easily the best film he's directed since _Gran Torino_.\r\n\r\nTelling the story of Earl Stone (Eastwood), a 90-year-old horticulturist and Korean War veteran, the film begins in 2005 as Stone is honoured at a daylily festival. Clearly enjoying the adulation (and the attention from the ladies), he doesn't seem to care that he's supposed to be attending the wedding of his daughter Iris (Eastwood's real daughter, Alison Eastwood). As she frets about his failure to turn up, Mary (Dianne Wiest), Stone's ex-wife and Iris's mother, points out that it's not a shock, as he has a history of letting his family down. The film then jumps to 2017 – Iris hasn't spoken to him since her wedding, and he is estranged from the whole family, except Iris's daughter, Ginny (Taissa Farmiga), who is herself getting married. His daylily business has gone bust, unable to compete with online shopping, and his house is in foreclosure. After a very public dressing down from Mary, Stone is approached by a friend of Ginny's who tells him that he knows some people who will pay anyone with a perfect driving record to \"_just drive_\" for them. Arriving at a garage guarded by heavily armed Hispanics, Stone is told to drive some duffle bags from El Paso to Chicago, with the only rule that he isn't to look inside the bags. He happily agrees, apparently unaware he has just signed on to mule for the Sinaloa Cartel. When he does inevitably look in the bags, finding cocaine, he isn't especially bothered, and as his first few runs go well, the Cartel start to increase the amount of drugs he's muling. So much so that cartel boss, Laton (Andy García), asks to personally meet this new mule, who has been nicknamed \"Tata\" (\"Grandfather\") by his handlers. Meanwhile, the leader of a DEA task force (Laurence Fishburne) is under pressure to start getting results, and so he gives agents Bates (Bradley Cooper) and Trevino (Michael Peña) instructions to start making arrests sooner rather than later, which they promise to do, explaining that they are nearing in on a prime target – a prolific mule known only as Tata.\r\n\r\nWritten by Nick Schenk, who also wrote _Gran Torino_, _The Mule_ is, extraordinarily, based on a true story. Specifically, it's inspired by Sam Dolnick's 2014 _New York Times_ article, \"The Sinaloa Cartel's 90-Year-Old Drug Mule\", which tells the story of Leo Sharp, an award-winning horticulturist and World War II veteran who became the Sinaloa Cartel's most reliable mule. Despondent from financial problems and the loss of his daylily business, Sharp began transporting cocaine from Arizona to Michigan in 2005. With Sinaloa quickly realising how reliable he was, he was soon moving up to 300 kilograms per trip and transporting as much as $2million dollars in the opposite direction. In October 2011, while in possession of 90 kilograms, Sharp was arrested by Michigan state police operating as part of a DEA task force. He was sentenced to three years in prison, but was released in 2015 after a year behind bars, due to declining health. He died of natural causes in 2016 at the age of 92.\r\n\r\nThe first thing to be said about _The Mule_ is that the trailer is misleading. And then some. Suggesting a tense, nail-biting thriller in which Stone is appalled to find out what he has been transporting, but is unable to back out of his deal, and must try to keep the Cartel on-side whilst evading the attention of the DEA, the trailer has next-to-no relationship with the actual film. It's not tense, my nails were thoroughly unbitten, Stone isn't overly concerned when he learns what's in the bags, and the very narrative structure means it's inevitable that Bates will catch up to him sooner or later. It most certainly isn't the Michael Mann-esque crime thriller it's being advertised as. Instead, _The Mule_ is laconic and contemplative, laid-back and not especially dramatic (there's more fireworks in the arguments Stone has with his family than in his relationship with the Cartel, and the film as a whole is more _Last of the Summer Wine_ than _Miami Vice_). Indeed, as drama, _The Mule_ is fairly insubstantial, telling a threadbare story populated by underwritten characters, void of much of an emotional core, and with next-to-nothing in the way of an exciting _dénouement_.\r\n\r\nAs a director, Eastwood's last three films (_American Sniper_, _Sully_, and _The 15:17 to Paris_) have all told true stories of ordinary people who have come to be seen as heroes for one reason or another, whether they wanted to or not. Earl Stone is definitely not a hero (any more than Leo Sharp), but he is an everyman, a person down on his luck who finds a way to stick it to the system. And that makes him, at best, empathetic, and at worst, an anti-hero (yes, the fact that he's literally transporting misery and suffering is problematic, but we'll get to that). Stone is charming, funny, and intelligent, and his attempts to make up for his mistakes with Iris by being there for Ginny seem genuine. Eastwood plays Stone as full of regret, someone who knows he was a terrible husband and father, and the fact that his estranged daughter is played by his real daughter gives the film the impression of being personal (Eastwood, like Stone, has an, let's be diplomatic, \"appreciation\" for the ladies). From a physical standpoint, Eastwood looks noticeably older than he did in _Trouble with the Curve_; he walks hunched over, he looks frail enough for a strong wind to knock him down, there's next-to-no meat on his arms. Almost all of that Eastwood-ruggedness is gone, and this is easily the most physically vulnerable we've ever seen him on screen, even more so than that other titan of old-school American masculinity, John Wayne, who made _The Shootist_ (1976) when he was literally dying.\r\n\r\nIn a lot of ways, Stone is not unlike Walt Kowalski, the hateful racist character Eastwood played in _Gran Torino_. They are both Korean War veterans who find themselves alienated from the world they live in, and who believe the next generation lack fortitude (at one point, Stone complains, \"_this generation can't open a fruit-box without calling the internet_\"). However, Stone is much softer, and on the universal scale of racism, whereas Kowalski is Mel Gibson-racist, Stone is Prince Philip-racist; the type of racism we forgive because he's 837 years old, half-senile, and grew up \"_in a different time_.\" Sure, he calls Hispanics \"beaners\" and jokes about them getting deported, but they don't seem to mind. Sure, he pulls over to help a black couple change a tire, proudly telling them he likes \"_to help the negro folks out_\", but they just politely inform him that people don't use the word \"negro\" anymore. And it isn't just ethnicities. Encountering a group of lesbian bikers, he refers to them as \"_dykes on bikes_\". All three of these examples are played for laughs, and whilst that might be fair enough in a film that depicts non-Caucasians with something resembling diversity, _The Mule_'s non-white characters are one-dimensional stereotypes; every Hispanic character, for example, is either a drug-running criminal (most of whom have neck tattoos) or an industrious labourer. If the film itself didn't come across as so racially reductive, Stone's racism would be easier to accept and defend.\r\n\r\nPerhaps the film's most egregious failing, however, is that it never once addresses the fact that Stone's criminal enterprise is fuelling addiction and destroying lives; as far as the film is concerned, he may as well be transporting oranges. The darker implications of his drug-running are kept firmly behind the curtain, out of sight of the audience. Instead, _The Mule_ presents Stone as almost a modern-day Robin Hood, using his new-found cash to pay for Ginny's wedding and education, and to renovate the local VA hall. This _could_ be a sly comment on Obama-era economics, suggesting that the country is in such a mess that issues like the exorbitant price of education and the mistreatment of veterans can only be addressed with the proceeds of crime. But honestly, that's a serious stretch, and it seems far more likely it's the film's way of ensuring we continue to admire Stone despite what he's doing. In any case, even when the film has no option but to directly deal with his criminality, it's done in such a way as to minimise the darker aspects. For example, Laton may be the most jovial and least-threatening drug lord ever put on screen. García does what he can with the part, but given the fact that most of his screen time sees him fooling about with a solid gold shotgun, his options are limited (one legitimately funny moment sees Stone marvelling at Laton's mansion, asking \"_who do I have to kill to get a place like this?_\" to which Laton responds, \"_many, many people_\"). A much more effective character is Gustavo (Clifton Collins Jr.), Laton's henchman. Collins Jr. is a superb actor, and can do legitimately intimidating in his sleep, but even an actor of his calibre can do little with only three scenes, in two of which he doesn't even have any dialogue (in a film with a wasted cast, the underuse of Collins Jr. stands out).\r\n\r\nHand-in-hand with the film's non-threatening drug runners is its depiction of local law enforcement, who are, for the most part, presented sarcastically (at one point, Stone distracts a pesky cop with a tub of caramel popcorn). The DEA characters are presented a little more respectfully, however. Fishburne's unnamed character, for example, is depicted as a good agent shackled by a bureaucracy that only cares for short-term wins. Thus, they pressure him to pressure his field agents to get results before the case has matured, meaning any arrests will be strictly low-level. This aspect of the film reminded me of the first season of _The Wire_, where Deputy Ops. Ervin Burrell (Frankie Faison) is constantly pressuring Lt. Daniels (Lance Reddick) to get some \"_dope on the table_\" – small scale arrests that provide a photo op for Baltimore PD brass to proudly display the confiscated dope on the table, irrespective of the fact that such operations result in the arrests of street hoppers rather than anyone in management.\r\n\r\nA key scene in relation to the film's depiction of both law-enforcement and minorities, but one which is disappointingly played for laughs, is when the cops pull over who they think is Tata only to quickly realise it's the wrong man (it's a young Hispanic) and they're guilty of racial profiling. The man is terrified, well aware of stats concerning police shootings of non-whites (there's something deeply unsettling about how well he knows the routine, and his line, \"_statistically speaking, this is the most dangerous five minutes of my life_\" speaks volumes about modern America). The scene should have given rise to a socio-political commentary – what is it like to be the victim of racial profiling, how does it feel to know that you've just committed racial profiling, what does it say about society in general when an innocent man knows enough about such instances as to fear for his life? Eastwood, however, is more interested in guffaws. We've seen racial profiling and resultant deaths examined in several recent films – Steve McQueen's _Widows_, George Tillman, Jr.'s _The Hate U Give_, and Reinaldo Marcus Green's _Monsters and Men_ (all 2018) – as well as slightly older titles such as Paul Haggis's _Crash_ (2004) and Ryan Coogler's _Fruitvale Station_ (2013), but the depiction here is, sadly, very shallow. The film is also silent on the inverse – that Stone is such a good mule because of his white privilege.\r\n\r\nAnother issue is that the film's structure is bizarre – there's no real sense of narrative cohesion, as one scene jumps to another without a huge amount connecting them. You could take the various driving scenes, cut them in a completely different manner, and you would still have the same film; Stone picks up the drugs, drives for a while, drops off the drugs and gets paid, drives some more, has a scene with his family, we check in on the DEA, Stone picks up the drugs, drives for a while etc. The whole thing feels void of urgency, and after a while you realise that the threadbare outline of a story is all the story you're going to get. Additionally, there's an utter lack of tension (for which Eastwood tries to compensate with silly scenes such as when Bates follows Stone into a parking lot and shouts \"Hey.\" Is he going to arrest our hero? Nah, Stone just left his flask behind). On top of this, the way Eastwood's camera leers at the bare asses of a bunch of women at a party in Laton's house is disconcerting, and pretty much a textbook example of the male gaze. Also, with the single exception of Stone, the characters are one-dimensional at best (Fishburne's character doesn't even get a name; Peña is nothing but the comic relief to Cooper's straight man).\r\n\r\nIf all that sounds negative, it should, because I focused on what I felt was wrong with the film. However, irrespective of these failings, I thoroughly enjoyed _The Mule_. It could and should have been a lot better. It could have been a socially conscious thriller looking at racial profiling, drug-dealing, American masculinity, generational conflict, socio-economic issues. But, in fairness, that isn't the film Eastwood set out to make. He has made many interesting political films in his career. _The Mule_ is not one of them. Instead, he's turned the material into a jaunty, congenial, inoffensive, and easy-to-watch meditation on age and family, set in a _milieu_ where the one-time trappings of male success are now considered character failings, and focused on a character unable to wrap his brain around this shift in ideology. Despite myself, I can forgive the casual racism, the structural problems, the wasted cast, the use of serious social issues to get cheap laughs, and I can do so because the film is simply enjoyable. _The Mule_ isn't going to change your life, nor is it going to win Eastwood a legion of new fans. But it was never supposed to. Instead, it accomplishes exactly what it set out to do. And it's immensely entertaining to boot.", "created_at": "2019-07-12T22:17:12.336Z"}, {"movie_id": 504172, "review_id": "5e89fa1ecf1afd00116d3143", "author_rating": 9.0, "review_text": "I wonder if Clint Eastwood is one of the few directors who could have gotten this movie made. It took me a while to get around to watching it, partly due to some of the negative buzz I heard out there in the Interworld.\r\n \r\nI suspect I liked this movie for the same reason a lot of the bad buzzy folks hated it. How many respected directors have the star power to get a movie made that, even with a violent Mexican drug cartel involved in the plot, turns out to be a thoughtful, mostly gentle character study of an old man awakening fully to regrets of how he treated his family in his younger years. This type of story even goes against the grain of the violent movies that made Eastwood a star in the first place. \r\n\r\nIt is not a movie I will likely watch again - there is just too much out there still to see for this movie to draw me in a second time. But it was entertaining, a fine addition to the library of diverse films directed by the Man with No Name.", "created_at": "2020-04-05T15:32:46.143Z"}, {"movie_id": 504172, "review_id": "62099c30d7fbda009322d76c", "author_rating": 7.0, "review_text": "This be good.\r\n\r\nI enjoyed <em>'The Mule'</em>. It's an entertaining and well paced flick from 2018, as Clint Eastwood fully stars in a film for the first time since 2012's <em>'<a href=\"https://letterboxd.com/film/trouble-with-the-curve/\" rel=\"nofollow\">Trouble with the Curve</a>'</em> - and first also as director since 2008's <em>'<a href=\"https://letterboxd.com/film/gran-torino/\" rel=\"nofollow\">Gran Torino</a>'</em>. The 1930-born actor still has it!\r\n\r\nThere's a good cast behind Eastwood, with performances given by the likes of Bradley Cooper, Laurence Fishburne and Michael Peña - all of whom have worked with Clint before. Neat to see <a href=\"https://www.theringer.com/movies/2021/6/22/22545318/the-fast-and-the-furious-original-movie-20th-anniversary#:~:text=Gugliemi%20has%20one%20of%20my%20favorite%20Weird%20Movie%20Tidbits%20ever%2C%20which%20is%3A%20He%20has%20played%20someone%20named%20%E2%80%9CHector%E2%80%9D%20in%20a%20movie%20or%20TV%20show%20more%20than%20a%20dozen%20times.\" rel=\"nofollow\">Hector</a> himself, Noel Gugliemi, involved. One half of the <em>'<a href=\"https://en.wikipedia.org/wiki/Breaking_Bad\" rel=\"nofollow\">Breaking Bad</a>'</em> Salamanca brothers, Daniel Moncada, is there too.\r\n\r\nIncredibly, the film is based on a <a href=\"https://en.wikipedia.org/wiki/Leo_Sharp\" rel=\"nofollow\">real dude</a>! Quite the geezer!", "created_at": "2022-02-14T00:02:56.309Z"}, {"movie_id": 504172, "review_id": "6241b11397a4e60047a3f6a3", "author_rating": 7.0, "review_text": "Clint Eastwood takes on the character of \"Earl Stone\", an elderly gent who takes great pride in his award winning flowers but one who is broke; facing the loss of his home and his business. He has to earn some cash, so takes on a job as a delivery driver. He's a Korean War vet, so whilst never quite sure what he is \"delivering\", he knows full well that the less police involvement with his antics, the better. Soon his success snowballs and he gets himself an unwanted minder. As his money worries dwindle, his personal ones start to rear their heads: his ex wife and his granddaughter who have both had occasion to feel abandoned by him. The DEA is also aware that something is amiss, and they've drafted in \"Agent Bates\" (Bradley Cooper) whose team is soon focussing in on the eponymous character and the net is beginning to tighten. It's not the best film made by Eastwood, this - though at 88, maybe any criticism ought to bear in mind that most folks that age have long stopped trying - it's very slow, almost plodding at times and the characterisations don't quite ignite. The pursuing agents and his cartel employers feature all to peripherally to add much impact to what is essentially the star doing what John Wayne did so well in \"True Grit\" (1969) - playing the part of a determined old man, and playing it well.", "created_at": "2022-03-28T12:58:59.163Z"}, {"movie_id": 504172, "review_id": "63bf826505a5330085a42c7a", "author_rating": 10.0, "review_text": "I never understood how people disagree with giving a movie either 10 or only 1 star here. Either it does it's job or it doesn't.\r\n\r\nThe Mule is the kind of movie that my dad, rest his soul, would beg me to see in the theater with him, and then rave about after.\r\n\r\nA lonely old man that breaks a few laws in order to provide for his family and, in the process, gets himself into trouble with some bad guys.\r\n\r\nAnd it's all done without over-the-top action and special effects, making for a film that is completely reliant on script and acting alone.\r\n\r\nIn other words, it's old school, dry, and honestly, a pleasure to watch. And it has actual meaning. There is a plot here and a moral to the story. It's a rarity these days.", "created_at": "2023-01-12T03:45:41.999Z"}, {"movie_id": 504172, "review_id": "6495d9a8d5ffcb00c594d7ee", "author_rating": 7.0, "review_text": "**_Good enough Eastwood flick based on a true story_**\r\n\r\nA 90 years-old horticulturalist and war veteran (Clint Eastwood) inadvertently becomes a courier for a Mexican drug cartel. Will he continue to neglect his family?\r\n\r\n“The Mule” (2018) was directed by Eastwood and inspired by the real-life Leo Sharp. There are similarities to “Gran Torino” (2008), but not as much action. Long stretches naturally involve Earl Stone (Eastwood) driving the highways of America. But things perk up in the second half and there’s some welcome human interest.\r\n\r\nThe flick runs 1 hour, 56 minutes, and was shot in Atlanta and Augusta, Georgia, as well as Las Cruces, New Mexico.\r\n\r\nGRADE: B/B-", "created_at": "2023-06-23T17:43:04.111Z"}, {"movie_id": 504172, "review_id": "5d2906e8a294f000112a3b9e", "author_rating": 7.0, "review_text": "**_Laconic, measured and easy to digest, although it could have done with more substance_**\r\n\r\n> _How many addicts are out on the street simply because Mr. Sharp brought the cocaine here?_\r\n\r\n- Sam Dolnick quoting AUSA Chris Graveline; \"The Sinaloa Cartel's 90-Year-Old Drug Mule\"; _New York Times_ (June 11, 2014)\r\n\r\n63 years since he first appeared on-screen (an uncredited role in Jack Arnold's 1955 _Revenge of the Creature_), _The Mule_ is 88-year-old Clint Eastwood's first acting role since Robert Lorenz's _Trouble with the Curve_ in 2012, and his first film as a director since about a week ago. It is, however, the first time he's directed himself since the excellent _Gran Torino_ in 2008. Known for being incredibly efficient when it comes to filmmaking, Eastwood likes to get scripts into production before they've gone through too many rewrites, he rigidly shoots only what's on the page, he avoids multiple takes and on-set experimentation, and he keeps the editing process as simple as possible – so basically, he's the anti-Terrence Malick. With this in mind, he has maintained an extraordinary rate of turnover, with _The Mule_ the 37th feature he's directed since _Play Misty for Me_ in 1971.\r\n\r\nOf course, when you work at that rate for as long as he has, you're going to put out a few duds, and although his directorial output has gone through ups and downs in the past, his most recent work has been arguably the most disappointing of his career, with pretty much everything he's directed since _Gran Torino_ being subpar. Whether it's the hokey sentimentality of _Hereafter_ (2010), the oversimplification (and awful makeup) of _J. Edgar_ (2011), the lifeless _Jersey Boys_ (2014), the unashamed and troubling jingoism of _American Sniper_ (2015), the unnecessary embellishments of _Sully_ (2016), or the spectacularly misjudged experiment in casting that was _15:17 to Paris_ (2018), the days when he could direct no less than seven masterpieces – _Unforgiven_ (1992), _A Perfect World_ (1993), _The Bridges of Madison County_ (1995), _Mystic River_ (2003), _Million Dollar Baby_ (2004), _Flags of Our Fathers_ (2006), and _Letters from Iwo Jima_ (2006) – in a 14-year period are long gone. Indeed, the most notable thing he's done in the last decade is ramble somewhat incoherently to an empty chair.\r\n\r\nThe bad news is that _The Mule_ is a strangely formless film, almost a collection of only vaguely connected scenes rather than an actual narrative with forward momentum; it has precious little depth or nuance; there's some troubling casual racism, most of which we're encouraged to laugh at; the tone is all over the place; Eastwood's character has not one, but _two_ threesomes with young women; and it wastes almost all of its excellent cast. The good news is that, somehow, it's extremely enjoyable, and is easily the best film he's directed since _Gran Torino_.\r\n\r\nTelling the story of Earl Stone (Eastwood), a 90-year-old horticulturist and Korean War veteran, the film begins in 2005 as Stone is honoured at a daylily festival. Clearly enjoying the adulation (and the attention from the ladies), he doesn't seem to care that he's supposed to be attending the wedding of his daughter Iris (Eastwood's real daughter, Alison Eastwood). As she frets about his failure to turn up, Mary (Dianne Wiest), Stone's ex-wife and Iris's mother, points out that it's not a shock, as he has a history of letting his family down. The film then jumps to 2017 – Iris hasn't spoken to him since her wedding, and he is estranged from the whole family, except Iris's daughter, Ginny (Taissa Farmiga), who is herself getting married. His daylily business has gone bust, unable to compete with online shopping, and his house is in foreclosure. After a very public dressing down from Mary, Stone is approached by a friend of Ginny's who tells him that he knows some people who will pay anyone with a perfect driving record to \"_just drive_\" for them. Arriving at a garage guarded by heavily armed Hispanics, Stone is told to drive some duffle bags from El Paso to Chicago, with the only rule that he isn't to look inside the bags. He happily agrees, apparently unaware he has just signed on to mule for the Sinaloa Cartel. When he does inevitably look in the bags, finding cocaine, he isn't especially bothered, and as his first few runs go well, the Cartel start to increase the amount of drugs he's muling. So much so that cartel boss, Laton (Andy García), asks to personally meet this new mule, who has been nicknamed \"Tata\" (\"Grandfather\") by his handlers. Meanwhile, the leader of a DEA task force (Laurence Fishburne) is under pressure to start getting results, and so he gives agents Bates (Bradley Cooper) and Trevino (Michael Peña) instructions to start making arrests sooner rather than later, which they promise to do, explaining that they are nearing in on a prime target – a prolific mule known only as Tata.\r\n\r\nWritten by Nick Schenk, who also wrote _Gran Torino_, _The Mule_ is, extraordinarily, based on a true story. Specifically, it's inspired by Sam Dolnick's 2014 _New York Times_ article, \"The Sinaloa Cartel's 90-Year-Old Drug Mule\", which tells the story of Leo Sharp, an award-winning horticulturist and World War II veteran who became the Sinaloa Cartel's most reliable mule. Despondent from financial problems and the loss of his daylily business, Sharp began transporting cocaine from Arizona to Michigan in 2005. With Sinaloa quickly realising how reliable he was, he was soon moving up to 300 kilograms per trip and transporting as much as $2million dollars in the opposite direction. In October 2011, while in possession of 90 kilograms, Sharp was arrested by Michigan state police operating as part of a DEA task force. He was sentenced to three years in prison, but was released in 2015 after a year behind bars, due to declining health. He died of natural causes in 2016 at the age of 92.\r\n\r\nThe first thing to be said about _The Mule_ is that the trailer is misleading. And then some. Suggesting a tense, nail-biting thriller in which Stone is appalled to find out what he has been transporting, but is unable to back out of his deal, and must try to keep the Cartel on-side whilst evading the attention of the DEA, the trailer has next-to-no relationship with the actual film. It's not tense, my nails were thoroughly unbitten, Stone isn't overly concerned when he learns what's in the bags, and the very narrative structure means it's inevitable that Bates will catch up to him sooner or later. It most certainly isn't the Michael Mann-esque crime thriller it's being advertised as. Instead, _The Mule_ is laconic and contemplative, laid-back and not especially dramatic (there's more fireworks in the arguments Stone has with his family than in his relationship with the Cartel, and the film as a whole is more _Last of the Summer Wine_ than _Miami Vice_). Indeed, as drama, _The Mule_ is fairly insubstantial, telling a threadbare story populated by underwritten characters, void of much of an emotional core, and with next-to-nothing in the way of an exciting _dénouement_.\r\n\r\nAs a director, Eastwood's last three films (_American Sniper_, _Sully_, and _The 15:17 to Paris_) have all told true stories of ordinary people who have come to be seen as heroes for one reason or another, whether they wanted to or not. Earl Stone is definitely not a hero (any more than Leo Sharp), but he is an everyman, a person down on his luck who finds a way to stick it to the system. And that makes him, at best, empathetic, and at worst, an anti-hero (yes, the fact that he's literally transporting misery and suffering is problematic, but we'll get to that). Stone is charming, funny, and intelligent, and his attempts to make up for his mistakes with Iris by being there for Ginny seem genuine. Eastwood plays Stone as full of regret, someone who knows he was a terrible husband and father, and the fact that his estranged daughter is played by his real daughter gives the film the impression of being personal (Eastwood, like Stone, has an, let's be diplomatic, \"appreciation\" for the ladies). From a physical standpoint, Eastwood looks noticeably older than he did in _Trouble with the Curve_; he walks hunched over, he looks frail enough for a strong wind to knock him down, there's next-to-no meat on his arms. Almost all of that Eastwood-ruggedness is gone, and this is easily the most physically vulnerable we've ever seen him on screen, even more so than that other titan of old-school American masculinity, John Wayne, who made _The Shootist_ (1976) when he was literally dying.\r\n\r\nIn a lot of ways, Stone is not unlike Walt Kowalski, the hateful racist character Eastwood played in _Gran Torino_. They are both Korean War veterans who find themselves alienated from the world they live in, and who believe the next generation lack fortitude (at one point, Stone complains, \"_this generation can't open a fruit-box without calling the internet_\"). However, Stone is much softer, and on the universal scale of racism, whereas Kowalski is Mel Gibson-racist, Stone is Prince Philip-racist; the type of racism we forgive because he's 837 years old, half-senile, and grew up \"_in a different time_.\" Sure, he calls Hispanics \"beaners\" and jokes about them getting deported, but they don't seem to mind. Sure, he pulls over to help a black couple change a tire, proudly telling them he likes \"_to help the negro folks out_\", but they just politely inform him that people don't use the word \"negro\" anymore. And it isn't just ethnicities. Encountering a group of lesbian bikers, he refers to them as \"_dykes on bikes_\". All three of these examples are played for laughs, and whilst that might be fair enough in a film that depicts non-Caucasians with something resembling diversity, _The Mule_'s non-white characters are one-dimensional stereotypes; every Hispanic character, for example, is either a drug-running criminal (most of whom have neck tattoos) or an industrious labourer. If the film itself didn't come across as so racially reductive, Stone's racism would be easier to accept and defend.\r\n\r\nPerhaps the film's most egregious failing, however, is that it never once addresses the fact that Stone's criminal enterprise is fuelling addiction and destroying lives; as far as the film is concerned, he may as well be transporting oranges. The darker implications of his drug-running are kept firmly behind the curtain, out of sight of the audience. Instead, _The Mule_ presents Stone as almost a modern-day Robin Hood, using his new-found cash to pay for Ginny's wedding and education, and to renovate the local VA hall. This _could_ be a sly comment on Obama-era economics, suggesting that the country is in such a mess that issues like the exorbitant price of education and the mistreatment of veterans can only be addressed with the proceeds of crime. But honestly, that's a serious stretch, and it seems far more likely it's the film's way of ensuring we continue to admire Stone despite what he's doing. In any case, even when the film has no option but to directly deal with his criminality, it's done in such a way as to minimise the darker aspects. For example, Laton may be the most jovial and least-threatening drug lord ever put on screen. García does what he can with the part, but given the fact that most of his screen time sees him fooling about with a solid gold shotgun, his options are limited (one legitimately funny moment sees Stone marvelling at Laton's mansion, asking \"_who do I have to kill to get a place like this?_\" to which Laton responds, \"_many, many people_\"). A much more effective character is Gustavo (Clifton Collins Jr.), Laton's henchman. Collins Jr. is a superb actor, and can do legitimately intimidating in his sleep, but even an actor of his calibre can do little with only three scenes, in two of which he doesn't even have any dialogue (in a film with a wasted cast, the underuse of Collins Jr. stands out).\r\n\r\nHand-in-hand with the film's non-threatening drug runners is its depiction of local law enforcement, who are, for the most part, presented sarcastically (at one point, Stone distracts a pesky cop with a tub of caramel popcorn). The DEA characters are presented a little more respectfully, however. Fishburne's unnamed character, for example, is depicted as a good agent shackled by a bureaucracy that only cares for short-term wins. Thus, they pressure him to pressure his field agents to get results before the case has matured, meaning any arrests will be strictly low-level. This aspect of the film reminded me of the first season of _The Wire_, where Deputy Ops. Ervin Burrell (Frankie Faison) is constantly pressuring Lt. Daniels (Lance Reddick) to get some \"_dope on the table_\" – small scale arrests that provide a photo op for Baltimore PD brass to proudly display the confiscated dope on the table, irrespective of the fact that such operations result in the arrests of street hoppers rather than anyone in management.\r\n\r\nA key scene in relation to the film's depiction of both law-enforcement and minorities, but one which is disappointingly played for laughs, is when the cops pull over who they think is Tata only to quickly realise it's the wrong man (it's a young Hispanic) and they're guilty of racial profiling. The man is terrified, well aware of stats concerning police shootings of non-whites (there's something deeply unsettling about how well he knows the routine, and his line, \"_statistically speaking, this is the most dangerous five minutes of my life_\" speaks volumes about modern America). The scene should have given rise to a socio-political commentary – what is it like to be the victim of racial profiling, how does it feel to know that you've just committed racial profiling, what does it say about society in general when an innocent man knows enough about such instances as to fear for his life? Eastwood, however, is more interested in guffaws. We've seen racial profiling and resultant deaths examined in several recent films – Steve McQueen's _Widows_, George Tillman, Jr.'s _The Hate U Give_, and Reinaldo Marcus Green's _Monsters and Men_ (all 2018) – as well as slightly older titles such as Paul Haggis's _Crash_ (2004) and Ryan Coogler's _Fruitvale Station_ (2013), but the depiction here is, sadly, very shallow. The film is also silent on the inverse – that Stone is such a good mule because of his white privilege.\r\n\r\nAnother issue is that the film's structure is bizarre – there's no real sense of narrative cohesion, as one scene jumps to another without a huge amount connecting them. You could take the various driving scenes, cut them in a completely different manner, and you would still have the same film; Stone picks up the drugs, drives for a while, drops off the drugs and gets paid, drives some more, has a scene with his family, we check in on the DEA, Stone picks up the drugs, drives for a while etc. The whole thing feels void of urgency, and after a while you realise that the threadbare outline of a story is all the story you're going to get. Additionally, there's an utter lack of tension (for which Eastwood tries to compensate with silly scenes such as when Bates follows Stone into a parking lot and shouts \"Hey.\" Is he going to arrest our hero? Nah, Stone just left his flask behind). On top of this, the way Eastwood's camera leers at the bare asses of a bunch of women at a party in Laton's house is disconcerting, and pretty much a textbook example of the male gaze. Also, with the single exception of Stone, the characters are one-dimensional at best (Fishburne's character doesn't even get a name; Peña is nothing but the comic relief to Cooper's straight man).\r\n\r\nIf all that sounds negative, it should, because I focused on what I felt was wrong with the film. However, irrespective of these failings, I thoroughly enjoyed _The Mule_. It could and should have been a lot better. It could have been a socially conscious thriller looking at racial profiling, drug-dealing, American masculinity, generational conflict, socio-economic issues. But, in fairness, that isn't the film Eastwood set out to make. He has made many interesting political films in his career. _The Mule_ is not one of them. Instead, he's turned the material into a jaunty, congenial, inoffensive, and easy-to-watch meditation on age and family, set in a _milieu_ where the one-time trappings of male success are now considered character failings, and focused on a character unable to wrap his brain around this shift in ideology. Despite myself, I can forgive the casual racism, the structural problems, the wasted cast, the use of serious social issues to get cheap laughs, and I can do so because the film is simply enjoyable. _The Mule_ isn't going to change your life, nor is it going to win Eastwood a legion of new fans. But it was never supposed to. Instead, it accomplishes exactly what it set out to do. And it's immensely entertaining to boot.", "created_at": "2019-07-12T22:17:12.336Z"}, {"movie_id": 504172, "review_id": "5e89fa1ecf1afd00116d3143", "author_rating": 9.0, "review_text": "I wonder if Clint Eastwood is one of the few directors who could have gotten this movie made. It took me a while to get around to watching it, partly due to some of the negative buzz I heard out there in the Interworld.\r\n \r\nI suspect I liked this movie for the same reason a lot of the bad buzzy folks hated it. How many respected directors have the star power to get a movie made that, even with a violent Mexican drug cartel involved in the plot, turns out to be a thoughtful, mostly gentle character study of an old man awakening fully to regrets of how he treated his family in his younger years. This type of story even goes against the grain of the violent movies that made Eastwood a star in the first place. \r\n\r\nIt is not a movie I will likely watch again - there is just too much out there still to see for this movie to draw me in a second time. But it was entertaining, a fine addition to the library of diverse films directed by the Man with No Name.", "created_at": "2020-04-05T15:32:46.143Z"}, {"movie_id": 504172, "review_id": "62099c30d7fbda009322d76c", "author_rating": 7.0, "review_text": "This be good.\r\n\r\nI enjoyed <em>'The Mule'</em>. It's an entertaining and well paced flick from 2018, as Clint Eastwood fully stars in a film for the first time since 2012's <em>'<a href=\"https://letterboxd.com/film/trouble-with-the-curve/\" rel=\"nofollow\">Trouble with the Curve</a>'</em> - and first also as director since 2008's <em>'<a href=\"https://letterboxd.com/film/gran-torino/\" rel=\"nofollow\">Gran Torino</a>'</em>. The 1930-born actor still has it!\r\n\r\nThere's a good cast behind Eastwood, with performances given by the likes of Bradley Cooper, Laurence Fishburne and Michael Peña - all of whom have worked with Clint before. Neat to see <a href=\"https://www.theringer.com/movies/2021/6/22/22545318/the-fast-and-the-furious-original-movie-20th-anniversary#:~:text=Gugliemi%20has%20one%20of%20my%20favorite%20Weird%20Movie%20Tidbits%20ever%2C%20which%20is%3A%20He%20has%20played%20someone%20named%20%E2%80%9CHector%E2%80%9D%20in%20a%20movie%20or%20TV%20show%20more%20than%20a%20dozen%20times.\" rel=\"nofollow\">Hector</a> himself, Noel Gugliemi, involved. One half of the <em>'<a href=\"https://en.wikipedia.org/wiki/Breaking_Bad\" rel=\"nofollow\">Breaking Bad</a>'</em> Salamanca brothers, Daniel Moncada, is there too.\r\n\r\nIncredibly, the film is based on a <a href=\"https://en.wikipedia.org/wiki/Leo_Sharp\" rel=\"nofollow\">real dude</a>! Quite the geezer!", "created_at": "2022-02-14T00:02:56.309Z"}, {"movie_id": 504172, "review_id": "6241b11397a4e60047a3f6a3", "author_rating": 7.0, "review_text": "Clint Eastwood takes on the character of \"Earl Stone\", an elderly gent who takes great pride in his award winning flowers but one who is broke; facing the loss of his home and his business. He has to earn some cash, so takes on a job as a delivery driver. He's a Korean War vet, so whilst never quite sure what he is \"delivering\", he knows full well that the less police involvement with his antics, the better. Soon his success snowballs and he gets himself an unwanted minder. As his money worries dwindle, his personal ones start to rear their heads: his ex wife and his granddaughter who have both had occasion to feel abandoned by him. The DEA is also aware that something is amiss, and they've drafted in \"Agent Bates\" (Bradley Cooper) whose team is soon focussing in on the eponymous character and the net is beginning to tighten. It's not the best film made by Eastwood, this - though at 88, maybe any criticism ought to bear in mind that most folks that age have long stopped trying - it's very slow, almost plodding at times and the characterisations don't quite ignite. The pursuing agents and his cartel employers feature all to peripherally to add much impact to what is essentially the star doing what John Wayne did so well in \"True Grit\" (1969) - playing the part of a determined old man, and playing it well.", "created_at": "2022-03-28T12:58:59.163Z"}, {"movie_id": 504172, "review_id": "63bf826505a5330085a42c7a", "author_rating": 10.0, "review_text": "I never understood how people disagree with giving a movie either 10 or only 1 star here. Either it does it's job or it doesn't.\r\n\r\nThe Mule is the kind of movie that my dad, rest his soul, would beg me to see in the theater with him, and then rave about after.\r\n\r\nA lonely old man that breaks a few laws in order to provide for his family and, in the process, gets himself into trouble with some bad guys.\r\n\r\nAnd it's all done without over-the-top action and special effects, making for a film that is completely reliant on script and acting alone.\r\n\r\nIn other words, it's old school, dry, and honestly, a pleasure to watch. And it has actual meaning. There is a plot here and a moral to the story. It's a rarity these days.", "created_at": "2023-01-12T03:45:41.999Z"}, {"movie_id": 504172, "review_id": "6495d9a8d5ffcb00c594d7ee", "author_rating": 7.0, "review_text": "**_Good enough Eastwood flick based on a true story_**\r\n\r\nA 90 years-old horticulturalist and war veteran (Clint Eastwood) inadvertently becomes a courier for a Mexican drug cartel. Will he continue to neglect his family?\r\n\r\n“The Mule” (2018) was directed by Eastwood and inspired by the real-life Leo Sharp. There are similarities to “Gran Torino” (2008), but not as much action. Long stretches naturally involve Earl Stone (Eastwood) driving the highways of America. But things perk up in the second half and there’s some welcome human interest.\r\n\r\nThe flick runs 1 hour, 56 minutes, and was shot in Atlanta and Augusta, Georgia, as well as Las Cruces, New Mexico.\r\n\r\nGRADE: B/B-", "created_at": "2023-06-23T17:43:04.111Z"}, {"movie_id": 504172, "review_id": "5d2906e8a294f000112a3b9e", "author_rating": 7.0, "review_text": "**_Laconic, measured and easy to digest, although it could have done with more substance_**\r\n\r\n> _How many addicts are out on the street simply because Mr. Sharp brought the cocaine here?_\r\n\r\n- Sam Dolnick quoting AUSA Chris Graveline; \"The Sinaloa Cartel's 90-Year-Old Drug Mule\"; _New York Times_ (June 11, 2014)\r\n\r\n63 years since he first appeared on-screen (an uncredited role in Jack Arnold's 1955 _Revenge of the Creature_), _The Mule_ is 88-year-old Clint Eastwood's first acting role since Robert Lorenz's _Trouble with the Curve_ in 2012, and his first film as a director since about a week ago. It is, however, the first time he's directed himself since the excellent _Gran Torino_ in 2008. Known for being incredibly efficient when it comes to filmmaking, Eastwood likes to get scripts into production before they've gone through too many rewrites, he rigidly shoots only what's on the page, he avoids multiple takes and on-set experimentation, and he keeps the editing process as simple as possible – so basically, he's the anti-Terrence Malick. With this in mind, he has maintained an extraordinary rate of turnover, with _The Mule_ the 37th feature he's directed since _Play Misty for Me_ in 1971.\r\n\r\nOf course, when you work at that rate for as long as he has, you're going to put out a few duds, and although his directorial output has gone through ups and downs in the past, his most recent work has been arguably the most disappointing of his career, with pretty much everything he's directed since _Gran Torino_ being subpar. Whether it's the hokey sentimentality of _Hereafter_ (2010), the oversimplification (and awful makeup) of _J. Edgar_ (2011), the lifeless _Jersey Boys_ (2014), the unashamed and troubling jingoism of _American Sniper_ (2015), the unnecessary embellishments of _Sully_ (2016), or the spectacularly misjudged experiment in casting that was _15:17 to Paris_ (2018), the days when he could direct no less than seven masterpieces – _Unforgiven_ (1992), _A Perfect World_ (1993), _The Bridges of Madison County_ (1995), _Mystic River_ (2003), _Million Dollar Baby_ (2004), _Flags of Our Fathers_ (2006), and _Letters from Iwo Jima_ (2006) – in a 14-year period are long gone. Indeed, the most notable thing he's done in the last decade is ramble somewhat incoherently to an empty chair.\r\n\r\nThe bad news is that _The Mule_ is a strangely formless film, almost a collection of only vaguely connected scenes rather than an actual narrative with forward momentum; it has precious little depth or nuance; there's some troubling casual racism, most of which we're encouraged to laugh at; the tone is all over the place; Eastwood's character has not one, but _two_ threesomes with young women; and it wastes almost all of its excellent cast. The good news is that, somehow, it's extremely enjoyable, and is easily the best film he's directed since _Gran Torino_.\r\n\r\nTelling the story of Earl Stone (Eastwood), a 90-year-old horticulturist and Korean War veteran, the film begins in 2005 as Stone is honoured at a daylily festival. Clearly enjoying the adulation (and the attention from the ladies), he doesn't seem to care that he's supposed to be attending the wedding of his daughter Iris (Eastwood's real daughter, Alison Eastwood). As she frets about his failure to turn up, Mary (Dianne Wiest), Stone's ex-wife and Iris's mother, points out that it's not a shock, as he has a history of letting his family down. The film then jumps to 2017 – Iris hasn't spoken to him since her wedding, and he is estranged from the whole family, except Iris's daughter, Ginny (Taissa Farmiga), who is herself getting married. His daylily business has gone bust, unable to compete with online shopping, and his house is in foreclosure. After a very public dressing down from Mary, Stone is approached by a friend of Ginny's who tells him that he knows some people who will pay anyone with a perfect driving record to \"_just drive_\" for them. Arriving at a garage guarded by heavily armed Hispanics, Stone is told to drive some duffle bags from El Paso to Chicago, with the only rule that he isn't to look inside the bags. He happily agrees, apparently unaware he has just signed on to mule for the Sinaloa Cartel. When he does inevitably look in the bags, finding cocaine, he isn't especially bothered, and as his first few runs go well, the Cartel start to increase the amount of drugs he's muling. So much so that cartel boss, Laton (Andy García), asks to personally meet this new mule, who has been nicknamed \"Tata\" (\"Grandfather\") by his handlers. Meanwhile, the leader of a DEA task force (Laurence Fishburne) is under pressure to start getting results, and so he gives agents Bates (Bradley Cooper) and Trevino (Michael Peña) instructions to start making arrests sooner rather than later, which they promise to do, explaining that they are nearing in on a prime target – a prolific mule known only as Tata.\r\n\r\nWritten by Nick Schenk, who also wrote _Gran Torino_, _The Mule_ is, extraordinarily, based on a true story. Specifically, it's inspired by Sam Dolnick's 2014 _New York Times_ article, \"The Sinaloa Cartel's 90-Year-Old Drug Mule\", which tells the story of Leo Sharp, an award-winning horticulturist and World War II veteran who became the Sinaloa Cartel's most reliable mule. Despondent from financial problems and the loss of his daylily business, Sharp began transporting cocaine from Arizona to Michigan in 2005. With Sinaloa quickly realising how reliable he was, he was soon moving up to 300 kilograms per trip and transporting as much as $2million dollars in the opposite direction. In October 2011, while in possession of 90 kilograms, Sharp was arrested by Michigan state police operating as part of a DEA task force. He was sentenced to three years in prison, but was released in 2015 after a year behind bars, due to declining health. He died of natural causes in 2016 at the age of 92.\r\n\r\nThe first thing to be said about _The Mule_ is that the trailer is misleading. And then some. Suggesting a tense, nail-biting thriller in which Stone is appalled to find out what he has been transporting, but is unable to back out of his deal, and must try to keep the Cartel on-side whilst evading the attention of the DEA, the trailer has next-to-no relationship with the actual film. It's not tense, my nails were thoroughly unbitten, Stone isn't overly concerned when he learns what's in the bags, and the very narrative structure means it's inevitable that Bates will catch up to him sooner or later. It most certainly isn't the Michael Mann-esque crime thriller it's being advertised as. Instead, _The Mule_ is laconic and contemplative, laid-back and not especially dramatic (there's more fireworks in the arguments Stone has with his family than in his relationship with the Cartel, and the film as a whole is more _Last of the Summer Wine_ than _Miami Vice_). Indeed, as drama, _The Mule_ is fairly insubstantial, telling a threadbare story populated by underwritten characters, void of much of an emotional core, and with next-to-nothing in the way of an exciting _dénouement_.\r\n\r\nAs a director, Eastwood's last three films (_American Sniper_, _Sully_, and _The 15:17 to Paris_) have all told true stories of ordinary people who have come to be seen as heroes for one reason or another, whether they wanted to or not. Earl Stone is definitely not a hero (any more than Leo Sharp), but he is an everyman, a person down on his luck who finds a way to stick it to the system. And that makes him, at best, empathetic, and at worst, an anti-hero (yes, the fact that he's literally transporting misery and suffering is problematic, but we'll get to that). Stone is charming, funny, and intelligent, and his attempts to make up for his mistakes with Iris by being there for Ginny seem genuine. Eastwood plays Stone as full of regret, someone who knows he was a terrible husband and father, and the fact that his estranged daughter is played by his real daughter gives the film the impression of being personal (Eastwood, like Stone, has an, let's be diplomatic, \"appreciation\" for the ladies). From a physical standpoint, Eastwood looks noticeably older than he did in _Trouble with the Curve_; he walks hunched over, he looks frail enough for a strong wind to knock him down, there's next-to-no meat on his arms. Almost all of that Eastwood-ruggedness is gone, and this is easily the most physically vulnerable we've ever seen him on screen, even more so than that other titan of old-school American masculinity, John Wayne, who made _The Shootist_ (1976) when he was literally dying.\r\n\r\nIn a lot of ways, Stone is not unlike Walt Kowalski, the hateful racist character Eastwood played in _Gran Torino_. They are both Korean War veterans who find themselves alienated from the world they live in, and who believe the next generation lack fortitude (at one point, Stone complains, \"_this generation can't open a fruit-box without calling the internet_\"). However, Stone is much softer, and on the universal scale of racism, whereas Kowalski is Mel Gibson-racist, Stone is Prince Philip-racist; the type of racism we forgive because he's 837 years old, half-senile, and grew up \"_in a different time_.\" Sure, he calls Hispanics \"beaners\" and jokes about them getting deported, but they don't seem to mind. Sure, he pulls over to help a black couple change a tire, proudly telling them he likes \"_to help the negro folks out_\", but they just politely inform him that people don't use the word \"negro\" anymore. And it isn't just ethnicities. Encountering a group of lesbian bikers, he refers to them as \"_dykes on bikes_\". All three of these examples are played for laughs, and whilst that might be fair enough in a film that depicts non-Caucasians with something resembling diversity, _The Mule_'s non-white characters are one-dimensional stereotypes; every Hispanic character, for example, is either a drug-running criminal (most of whom have neck tattoos) or an industrious labourer. If the film itself didn't come across as so racially reductive, Stone's racism would be easier to accept and defend.\r\n\r\nPerhaps the film's most egregious failing, however, is that it never once addresses the fact that Stone's criminal enterprise is fuelling addiction and destroying lives; as far as the film is concerned, he may as well be transporting oranges. The darker implications of his drug-running are kept firmly behind the curtain, out of sight of the audience. Instead, _The Mule_ presents Stone as almost a modern-day Robin Hood, using his new-found cash to pay for Ginny's wedding and education, and to renovate the local VA hall. This _could_ be a sly comment on Obama-era economics, suggesting that the country is in such a mess that issues like the exorbitant price of education and the mistreatment of veterans can only be addressed with the proceeds of crime. But honestly, that's a serious stretch, and it seems far more likely it's the film's way of ensuring we continue to admire Stone despite what he's doing. In any case, even when the film has no option but to directly deal with his criminality, it's done in such a way as to minimise the darker aspects. For example, Laton may be the most jovial and least-threatening drug lord ever put on screen. García does what he can with the part, but given the fact that most of his screen time sees him fooling about with a solid gold shotgun, his options are limited (one legitimately funny moment sees Stone marvelling at Laton's mansion, asking \"_who do I have to kill to get a place like this?_\" to which Laton responds, \"_many, many people_\"). A much more effective character is Gustavo (Clifton Collins Jr.), Laton's henchman. Collins Jr. is a superb actor, and can do legitimately intimidating in his sleep, but even an actor of his calibre can do little with only three scenes, in two of which he doesn't even have any dialogue (in a film with a wasted cast, the underuse of Collins Jr. stands out).\r\n\r\nHand-in-hand with the film's non-threatening drug runners is its depiction of local law enforcement, who are, for the most part, presented sarcastically (at one point, Stone distracts a pesky cop with a tub of caramel popcorn). The DEA characters are presented a little more respectfully, however. Fishburne's unnamed character, for example, is depicted as a good agent shackled by a bureaucracy that only cares for short-term wins. Thus, they pressure him to pressure his field agents to get results before the case has matured, meaning any arrests will be strictly low-level. This aspect of the film reminded me of the first season of _The Wire_, where Deputy Ops. Ervin Burrell (Frankie Faison) is constantly pressuring Lt. Daniels (Lance Reddick) to get some \"_dope on the table_\" – small scale arrests that provide a photo op for Baltimore PD brass to proudly display the confiscated dope on the table, irrespective of the fact that such operations result in the arrests of street hoppers rather than anyone in management.\r\n\r\nA key scene in relation to the film's depiction of both law-enforcement and minorities, but one which is disappointingly played for laughs, is when the cops pull over who they think is Tata only to quickly realise it's the wrong man (it's a young Hispanic) and they're guilty of racial profiling. The man is terrified, well aware of stats concerning police shootings of non-whites (there's something deeply unsettling about how well he knows the routine, and his line, \"_statistically speaking, this is the most dangerous five minutes of my life_\" speaks volumes about modern America). The scene should have given rise to a socio-political commentary – what is it like to be the victim of racial profiling, how does it feel to know that you've just committed racial profiling, what does it say about society in general when an innocent man knows enough about such instances as to fear for his life? Eastwood, however, is more interested in guffaws. We've seen racial profiling and resultant deaths examined in several recent films – Steve McQueen's _Widows_, George Tillman, Jr.'s _The Hate U Give_, and Reinaldo Marcus Green's _Monsters and Men_ (all 2018) – as well as slightly older titles such as Paul Haggis's _Crash_ (2004) and Ryan Coogler's _Fruitvale Station_ (2013), but the depiction here is, sadly, very shallow. The film is also silent on the inverse – that Stone is such a good mule because of his white privilege.\r\n\r\nAnother issue is that the film's structure is bizarre – there's no real sense of narrative cohesion, as one scene jumps to another without a huge amount connecting them. You could take the various driving scenes, cut them in a completely different manner, and you would still have the same film; Stone picks up the drugs, drives for a while, drops off the drugs and gets paid, drives some more, has a scene with his family, we check in on the DEA, Stone picks up the drugs, drives for a while etc. The whole thing feels void of urgency, and after a while you realise that the threadbare outline of a story is all the story you're going to get. Additionally, there's an utter lack of tension (for which Eastwood tries to compensate with silly scenes such as when Bates follows Stone into a parking lot and shouts \"Hey.\" Is he going to arrest our hero? Nah, Stone just left his flask behind). On top of this, the way Eastwood's camera leers at the bare asses of a bunch of women at a party in Laton's house is disconcerting, and pretty much a textbook example of the male gaze. Also, with the single exception of Stone, the characters are one-dimensional at best (Fishburne's character doesn't even get a name; Peña is nothing but the comic relief to Cooper's straight man).\r\n\r\nIf all that sounds negative, it should, because I focused on what I felt was wrong with the film. However, irrespective of these failings, I thoroughly enjoyed _The Mule_. It could and should have been a lot better. It could have been a socially conscious thriller looking at racial profiling, drug-dealing, American masculinity, generational conflict, socio-economic issues. But, in fairness, that isn't the film Eastwood set out to make. He has made many interesting political films in his career. _The Mule_ is not one of them. Instead, he's turned the material into a jaunty, congenial, inoffensive, and easy-to-watch meditation on age and family, set in a _milieu_ where the one-time trappings of male success are now considered character failings, and focused on a character unable to wrap his brain around this shift in ideology. Despite myself, I can forgive the casual racism, the structural problems, the wasted cast, the use of serious social issues to get cheap laughs, and I can do so because the film is simply enjoyable. _The Mule_ isn't going to change your life, nor is it going to win Eastwood a legion of new fans. But it was never supposed to. Instead, it accomplishes exactly what it set out to do. And it's immensely entertaining to boot.", "created_at": "2019-07-12T22:17:12.336Z"}, {"movie_id": 504172, "review_id": "5e89fa1ecf1afd00116d3143", "author_rating": 9.0, "review_text": "I wonder if Clint Eastwood is one of the few directors who could have gotten this movie made. It took me a while to get around to watching it, partly due to some of the negative buzz I heard out there in the Interworld.\r\n \r\nI suspect I liked this movie for the same reason a lot of the bad buzzy folks hated it. How many respected directors have the star power to get a movie made that, even with a violent Mexican drug cartel involved in the plot, turns out to be a thoughtful, mostly gentle character study of an old man awakening fully to regrets of how he treated his family in his younger years. This type of story even goes against the grain of the violent movies that made Eastwood a star in the first place. \r\n\r\nIt is not a movie I will likely watch again - there is just too much out there still to see for this movie to draw me in a second time. But it was entertaining, a fine addition to the library of diverse films directed by the Man with No Name.", "created_at": "2020-04-05T15:32:46.143Z"}, {"movie_id": 504172, "review_id": "62099c30d7fbda009322d76c", "author_rating": 7.0, "review_text": "This be good.\r\n\r\nI enjoyed <em>'The Mule'</em>. It's an entertaining and well paced flick from 2018, as Clint Eastwood fully stars in a film for the first time since 2012's <em>'<a href=\"https://letterboxd.com/film/trouble-with-the-curve/\" rel=\"nofollow\">Trouble with the Curve</a>'</em> - and first also as director since 2008's <em>'<a href=\"https://letterboxd.com/film/gran-torino/\" rel=\"nofollow\">Gran Torino</a>'</em>. The 1930-born actor still has it!\r\n\r\nThere's a good cast behind Eastwood, with performances given by the likes of Bradley Cooper, Laurence Fishburne and Michael Peña - all of whom have worked with Clint before. Neat to see <a href=\"https://www.theringer.com/movies/2021/6/22/22545318/the-fast-and-the-furious-original-movie-20th-anniversary#:~:text=Gugliemi%20has%20one%20of%20my%20favorite%20Weird%20Movie%20Tidbits%20ever%2C%20which%20is%3A%20He%20has%20played%20someone%20named%20%E2%80%9CHector%E2%80%9D%20in%20a%20movie%20or%20TV%20show%20more%20than%20a%20dozen%20times.\" rel=\"nofollow\">Hector</a> himself, Noel Gugliemi, involved. One half of the <em>'<a href=\"https://en.wikipedia.org/wiki/Breaking_Bad\" rel=\"nofollow\">Breaking Bad</a>'</em> Salamanca brothers, Daniel Moncada, is there too.\r\n\r\nIncredibly, the film is based on a <a href=\"https://en.wikipedia.org/wiki/Leo_Sharp\" rel=\"nofollow\">real dude</a>! Quite the geezer!", "created_at": "2022-02-14T00:02:56.309Z"}, {"movie_id": 504172, "review_id": "6241b11397a4e60047a3f6a3", "author_rating": 7.0, "review_text": "Clint Eastwood takes on the character of \"Earl Stone\", an elderly gent who takes great pride in his award winning flowers but one who is broke; facing the loss of his home and his business. He has to earn some cash, so takes on a job as a delivery driver. He's a Korean War vet, so whilst never quite sure what he is \"delivering\", he knows full well that the less police involvement with his antics, the better. Soon his success snowballs and he gets himself an unwanted minder. As his money worries dwindle, his personal ones start to rear their heads: his ex wife and his granddaughter who have both had occasion to feel abandoned by him. The DEA is also aware that something is amiss, and they've drafted in \"Agent Bates\" (Bradley Cooper) whose team is soon focussing in on the eponymous character and the net is beginning to tighten. It's not the best film made by Eastwood, this - though at 88, maybe any criticism ought to bear in mind that most folks that age have long stopped trying - it's very slow, almost plodding at times and the characterisations don't quite ignite. The pursuing agents and his cartel employers feature all to peripherally to add much impact to what is essentially the star doing what John Wayne did so well in \"True Grit\" (1969) - playing the part of a determined old man, and playing it well.", "created_at": "2022-03-28T12:58:59.163Z"}, {"movie_id": 504172, "review_id": "63bf826505a5330085a42c7a", "author_rating": 10.0, "review_text": "I never understood how people disagree with giving a movie either 10 or only 1 star here. Either it does it's job or it doesn't.\r\n\r\nThe Mule is the kind of movie that my dad, rest his soul, would beg me to see in the theater with him, and then rave about after.\r\n\r\nA lonely old man that breaks a few laws in order to provide for his family and, in the process, gets himself into trouble with some bad guys.\r\n\r\nAnd it's all done without over-the-top action and special effects, making for a film that is completely reliant on script and acting alone.\r\n\r\nIn other words, it's old school, dry, and honestly, a pleasure to watch. And it has actual meaning. There is a plot here and a moral to the story. It's a rarity these days.", "created_at": "2023-01-12T03:45:41.999Z"}, {"movie_id": 504172, "review_id": "6495d9a8d5ffcb00c594d7ee", "author_rating": 7.0, "review_text": "**_Good enough Eastwood flick based on a true story_**\r\n\r\nA 90 years-old horticulturalist and war veteran (Clint Eastwood) inadvertently becomes a courier for a Mexican drug cartel. Will he continue to neglect his family?\r\n\r\n“The Mule” (2018) was directed by Eastwood and inspired by the real-life Leo Sharp. There are similarities to “Gran Torino” (2008), but not as much action. Long stretches naturally involve Earl Stone (Eastwood) driving the highways of America. But things perk up in the second half and there’s some welcome human interest.\r\n\r\nThe flick runs 1 hour, 56 minutes, and was shot in Atlanta and Augusta, Georgia, as well as Las Cruces, New Mexico.\r\n\r\nGRADE: B/B-", "created_at": "2023-06-23T17:43:04.111Z"}]