[{"movie_id": 696157, "review_id": "63aac6bedd926a00ef93e208", "author_rating": 6.0, "review_text": "I wonder why they added her name to the title? Might that be because the film makers knew that the \"legacy\" of this once celebrated singer has already largely wained? I can't think when I last heard one of her songs on the radio. Bigger then the \"Beatles\"? Well Naomi Ackie puts her heart and soul into this performance but do we ever see her tinkle on a piano, pick up a guitar, bang a tambourine even? Right from the start when she is discovered by established impresario (and one of this film's producers) Clive Davis (Stanley Tucci) we learn that she doesn't write songs. So what is there for us to remember? This film proceeds to tell us a rather sad and shallow story of a woman born into musical royalty who seems to lurch from one bad decision to another - fuelled by a confused sexuality, booze, drugs and ambition - a toxic mix for anyone to deal with. This highly speculative narrative doesn't try to give any depth to any of the characters. It doesn't try to involve us in the stresses faced by this woman who had the world beneath her feet for a while, but for whom it was all too much - especially when she discovers that those closest to her are betraying and/or embezzling from her. It asks us to be sympathetic but gives us few insights into what made her tick. The brief and superficial scenes with her wayward husband Bobby Brown (Ashton Sanders) are whirlwind in nature and so it's hardly surprising when he turns out to be wrong for her. The competent Tucci comes across as a benign, gentle, benefactor but again, there is little of substance to his role as he seems powerless to stop her descending into a maelstrom of despair and illness. The real story of this inspirational singer is full of twists, turns, successes and failures. Her emotional life was just about as turbulent as it is possible to get. Yet this film is sterile and procedural. I didn't feel involved, I didn't really feel that I cared for her very much. On the plus side, we are reminded on occasion of her brilliant original songs and astonishing vocal range (though Miss Ackie doesn't do the singing) and are reminded of just how good an entertainer she was, but I saw this on my own in a cinema and maybe that says quite a lot about the quality of this rather underwhelming and chronological biopic that could have been so much better had it focused more on the talents of this remarkable woman and less on the associated melodrama.", "created_at": "2022-12-27T10:19:42.747Z"}, {"movie_id": 696157, "review_id": "63bdf45ffc31d3007e330791", "author_rating": 8.0, "review_text": "A well done flick, I'd say.\r\n\r\nI didn't even know this existed until I was invited a week or two back to go watch it, which is a surprise as I'd imagine a Whitney Houston biopic would've got enough hype that I would've seen it mentioned around the web - perhaps I just happened to miss it? Either way, I'd very much recommend <em>'Whitney Houston: I Wanna Dance with Somebody'</em>.\r\n\r\nI'm no Houston brainiac but of course knew of her top songs and unfortunate personal issues, I feel like the film does a commendable job at covering all aspects - the pacing is top notch, in my opinion. I'd imagine it takes liberties with the truth, as per for this genre, here and there, but that doesn't bother me much if so.\r\n\r\nNaomi Ackie is terrific in the lead role, quite the first performance of her's to watch on my part. I hope to see more! The rest of the cast, from Stanley Tucci to Ashton Sanders to Tamara Tunie to Nafessa Williams to Clarke Peters, particularly the latter, are also very good throughout.\r\n\r\nI found the run time to be spot on, while the music is - as you'd expect - excellent. Houston sure did make a tonne of hits!", "created_at": "2023-01-10T23:27:27.411Z"}]