[{"movie_id": 166428, "review_id": "5c59b0a0c3a36830288a2e0b", "author_rating": 8.0, "review_text": "i got the pleasure of getting a sneak peek of this movie its pretty great i laughed out loud and really had feelings for the characters in this movie its a good choice for older kids i dont think however its a good idea for younger kids its more dark the villans more frightening then before the movie is good very good though", "created_at": "2019-02-05T15:49:52.544Z"}, {"movie_id": 166428, "review_id": "5c9a120d0e0a264cd3c53d47", "author_rating": null, "review_text": "The best dream-works movie yet for kids and <a hre=\"http://quizlets.co/\">quizlet</a> teens !!! It has a great story, great animation and great characters here's my review: The story: 10/10 the animation: 10/10 and the characters: 10/10 the movie: 10/10!!!", "created_at": "2019-03-26T11:50:37.952Z"}, {"movie_id": 166428, "review_id": "5d10b920c3a3681e231e748b", "author_rating": 5.0, "review_text": "I feel **veeeeery** much that we've done this dance before now. I definitely didn't hate _The Hidden World_, the animation's pretty speccy, Toothless is eternally adorable, some of the creature design is pretty cool (especially the new bad guy's beasties) and I appreciate ending a franchise on your own terms. But to me, this is still definitely the low point of the trilogy. Not crap, for sure, but hit on a lot of things I genuinely don't care for.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-06-24T11:50:56.245Z"}, {"movie_id": 166428, "review_id": "5e20f7238f26bc001372124e", "author_rating": null, "review_text": "The new villain added for another whole level of spice to the franchise. The development of the characters we followed since the first movie has nicely culminated in this third installment. I hope they'd continue to make a follow-up show/series.", "created_at": "2020-01-16T23:52:04.003Z"}, {"movie_id": 166428, "review_id": "5e24a0d8cf4b8b0012f6a4bc", "author_rating": null, "review_text": "THE DRAGONS OF BERK ARE BACK WITH A NEW MOVIE! I've been following the TV series while waiting for this one and it did not disappoint. Also, Hiccup did well on puberty.", "created_at": "2020-01-19T18:32:56.889Z"}, {"movie_id": 166428, "review_id": "5e24a5fabfeb8b0015d481b2", "author_rating": null, "review_text": "I loved the upgraded armors of the riders of Berk plus, the thrill of the scenes were as dauntless as ever. Exactly what I loved about this franchise: costume design--check, risky adventures in 3D--check, adorable dragons--CHECK!", "created_at": "2020-01-19T18:54:50.264Z"}, {"movie_id": 166428, "review_id": "5e24ad4a397df000129d9e40", "author_rating": null, "review_text": "The relationships of the dragons and their riders also grew and it was both heartwarming and awe-mazing to watch that development on screen. I look forward to the next movie the team that gave us The Hidden World would come up with.", "created_at": "2020-01-19T19:26:02.743Z"}, {"movie_id": 166428, "review_id": "5e24b6a3397df000149e3ed8", "author_rating": null, "review_text": "It might not have brought the same hype as the first two movies did for me but it made up with all those cool costume upgrades. The theme of friendship and family was still there and that made it a must-watch in my book.", "created_at": "2020-01-19T20:05:55.966Z"}, {"movie_id": 166428, "review_id": "5e24bd648f26bc0013796a62", "author_rating": null, "review_text": "I still can't help but see Stitch every time I look at Toothless, Chris Sanders really did right by both characters. I'd say Toothless' dance was the highlight of this movie along with the epic fight scenes and the fire-saber sword. Overall, I'd give it two thumbs up!", "created_at": "2020-01-19T20:34:44.284Z"}, {"movie_id": 166428, "review_id": "5e24c6c05ed8e9001560eadf", "author_rating": null, "review_text": "Berk is the people, not the place. This last movie closes in the franchise nice and good that it'll have you leaving the movie house with a satisfied disposition.", "created_at": "2020-01-19T21:14:40.679Z"}, {"movie_id": 166428, "review_id": "5e24cc3ecf4b8b0012f6e481", "author_rating": null, "review_text": "The first two movies felt like learning to ride and fly with a newfound friend while searching for the self. This third movie felt like doing a smooth landing after impressing with a spark blast and several loops. Great movie!", "created_at": "2020-01-19T21:38:06.850Z"}, {"movie_id": 166428, "review_id": "5e24d394d6c3000013427b5c", "author_rating": null, "review_text": "Toothless being jack-clueless on impressing a girl is too relatable. However, on a more serious note, the animation upped a notch. The fire and blast effects were gorgeous and eye-catching.", "created_at": "2020-01-19T22:09:24.678Z"}, {"movie_id": 166428, "review_id": "5e26f3b94ca676001a3ef99e", "author_rating": null, "review_text": "This franchise is one of DreamWorks' best aces to boot. Although the third movie did not excite as much as the first two, it still makes for a good franchise-closure. Kudos to the entire team behind HTTYD!", "created_at": "2020-01-21T12:51:05.076Z"}, {"movie_id": 166428, "review_id": "5e2704dced2ac2001239c0e4", "author_rating": null, "review_text": "Until the very end of the movie, everything was beautifully created. It was truly amazing to see all the characters grow.", "created_at": "2020-01-21T14:04:12.402Z"}, {"movie_id": 166428, "review_id": "5e27055d168935001834e90c", "author_rating": null, "review_text": "Until the very end of the movie, everything was beautifully created. It was truly amazing to see all the characters grow.", "created_at": "2020-01-21T14:06:21.550Z"}, {"movie_id": 166428, "review_id": "5e271073ed2ac2001239db08", "author_rating": null, "review_text": "FIERY! Toothless’ newfound ability was awesome. It gave justice to the \"Night Fury\" classification.", "created_at": "2020-01-21T14:53:39.094Z"}, {"movie_id": 166428, "review_id": "5e29097398f1f10014f5431a", "author_rating": null, "review_text": "It was wonderful to see Hiccup as the one who was helping Toothless. A friendship that was not selfish, but rather, giving.", "created_at": "2020-01-23T02:48:19.714Z"}, {"movie_id": 166428, "review_id": "5e2917364ca676001442034b", "author_rating": null, "review_text": "That was a tough decision for the main character to do! But no matter how hard it was to let go, it was the right choice indeed. Freedom is also love.", "created_at": "2020-01-23T03:47:02.225Z"}]