[{"movie_id": 615952, "review_id": "637858825b2f47009ba9252e", "author_rating": 6.0, "review_text": "After his strong effort in \"The Black Phone\" from earlier this year, Banks Repeta delivers another in this curious tale of a young boy (\"Paul\"), of Jewish antecedence, who must juggle the ambitions of his family to survive and thrive whilst adapting to a multi-racial community. His best (and possibly only) friend at school, \"Johnny\" (Jaylin Webb), is a bit of a mischief maker with whom his folks would rather he spent less time. His grandfather \"Aaron\" (Sir Anthony Hopkins) has a close bond with the young lad, and tries to encourage him to be fair and decent in an environment where that is not necessarily easy. There are multiple themes at work here. On the face of it, it is two children just trying to fit in - one from a more stable and prosperous background. There are also discriminatory overtones here too, delivered the more poignantly because they are not straightforward race-based themes, but ones of tolerance, aspiration and affection as can only really be seen effectively through the innocence of childhood; a childhood as yet untainted by an ingrained bigotry that even the most decent about him cannot claim to be immune from. Sir Anthony features sparingly, and his character is potent at serving as a conduit for the young \"Paul\" to try to make the right choices, however difficult and confusing. Webb also turns in a solid performance and offers us quite a contrast to the loved and cared for \"Paul\" as their friendship progresses towards a not altogether surprising conclusion. Anne Hathaway and Jeremy Strong are adequate as the parents, themselves striving to ensure that their two children attain a better life than they managed for themselves, and James Gray uses the New York environment well to give us an indication of the iniquities of their childhoods. It sort of peters out a bit, though, and somehow I felt that the ending rendered much of the film moot. Did \"Paul\" actually make any progress? See what you think. It's slow at times and is a bit on the lengthy side, but certainly worth a look.", "created_at": "2022-11-19T04:16:02.816Z"}]