[{"movie_id": 324542, "review_id": "5943086e9251417f9b012546", "author_rating": 6.0, "review_text": "**A night of twist and turn events.**\r\n\r\nMaybe if you haven't seen the original, you will enjoy it, particularly if you like a thrilling clash between the cops and gangsters. For me this is the third version from the last three consecutive years. After the original French film based on the same name of the book, followed by the Kollywood remake 'Thoongavanam'. The second film was not bad, considering the way it was made to the Indian standards. They did not change much, but in this one the initial parts were almost the same and the following developments were too much. I mean literally they turned it into twice thriller with tight action sequences. Their main idea was to leave the open conclusion for a possible sequel. Which was really too intentional that not everybody would be happy with, for like those who liked the previous versions.\r\n\r\nThe actors were good, but Michelle Monaghan was the best among. Unlike the same characters from other versions, I don't know how they turned Monaghan's role so powerful. That's the negative, as the film Jamie Foxx in the lead. Otherwise, as a neutral, this is not a bad remake. The Immigrant joke was trimmed off, since today's US is not in favour of such comedies in films. And many events, especially film scenes were accelerated. So the camera moves one place to another in a quick succession unlike other versions. Yeah, these changes were needed, since the film was not a fresh piece of work or even first remake. But like I said too muchness spoiled the party. Even though one time watchable film.\r\n\r\n_6/10_", "created_at": "2017-06-15T22:21:34.900Z"}, {"movie_id": 324542, "review_id": "5a5884cac3a3681e78006f67", "author_rating": 4.0, "review_text": "A far cry from the worst film of the year, but it does seem surprising that someone as talented as Jamie Foxx would bother with something this overpoweringly generic.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2018-01-12T09:50:02.572Z"}]