[{"movie_id": 604563, "review_id": "61c0a310a284eb0042ee39c5", "author_rating": 3.0, "review_text": "I have to admit that this was rather painful to watch.\r\n\r\nI have not seen any of the other OSS 117 movies. The main reason I watched this one was because my girlfriend wanted to watch it. Since she has seen the other two entries in the franchise (I have not though) and since this one takes place in Africa and as she is from Senegal she, of course, had a special interest in watching it.\r\n\r\nMyself, I thought since they have made three of these movies and since I’ve heard some people say they liked them I thought how bad can it be so last weekend we sat down and watched it. I guess I was wrong. For me, this was a bad movie.\r\n\r\nIt really tries hard to be some kind of spy movie (James Bond ?) parody but it just becomes plain silly. Most of the jokes are far from funny and the few that are funny are just mildly funny. OSS 117 is so bloody stupid that it is not at all funny.\r\n\r\nThe movie is largely a political parody about the French and their supposedly “colonial” aspirations. Political parodies are almost never entertaining and usually ends up offending someone so why bother? The hugely exaggerated “French mindset” is just bullshit. The Africans are not portrayed much better and in the middle of everything sits the biggest jerk of them all, a pinnacle of stupidity… OSS 117.\r\n\r\nOn top of everything they’ve made OSS 117, well let’s just say sexually challenged, and when he finally get’s laid he promptly screws it up just by opening his mouth and let his insanely stupid monologues blurt out.\r\n\r\nNot surprisingly the story was bland and unimaginative not to mention predictable and the acting was overall substandard.\r\n\r\nI do not know if the previous movies were any better. From the reviews a fair number of people seems to think so. I would like to think so. After all, I cannot see how they would have gotten financing for three movies if the first two where as bad as this one.", "created_at": "2021-12-20T15:36:48.214Z"}]