[{"movie_id": 484247, "review_id": "5bb58ae50e0a2633a3005b6c", "author_rating": 7.0, "review_text": "First and foremost, this film feels like someone went to their local grocery store, grabbed a random three-dollar mystery novel off the checkout shelf, and decided to make it a movie with some extremely popular and attractive people. In other words, it's a silly mystery movie with crazy, zany twists and turns.\r\n\r\nSome of those twists and turns were easy enough to see coming, but some of them were straight out of left field. In addition to the entertaining twists, the film does a decent job of not taking itself seriously. The humor in the movie is peppered in during great moments. Some of it is cheesy, but if you're going to this film for a deep, thought-provoking film, don't.\r\n\r\nThe characters themselves are all extremely exaggerated. Lively's Emily is over-the-top sophisticated, crass, and private to the point where she won't allow pictures or even paintings of her face. Kendrick's Stephanie is bubbly, eager, awkward, and overly friendly. The rest of the cast fills in the needs around them, and while the cast is filled with one-note characters, they fulfill the needs well. Golding's Sean was my least favorite, but mainly because he doesn't have a defined archetype in a film filled with single-aspect characters.\r\n\r\nThe biggest issue with the film is the plot itself. Emily contradicts herself with the motive for her faking her own death. She tells Sean that she did it for him and for Nicky. Then she says she did it for her. On top of it all, she doesn't appear to have a plan to get the insurance money after it comes through. The film could have easily alleviated all of these issues with a quick scene or a line about fake passports for Emily and Nicky.\r\n\r\nAll in all, A Simple Favor is a fun romp filled with crazy twists and turns, humor, and great acting. Don't think too much about the film itself, and just go have some fun. It's definitely worth a getaway matinee.", "created_at": "2018-10-04T03:37:10.000Z"}, {"movie_id": 484247, "review_id": "5c447cdd9251412bf6de0ea4", "author_rating": 6.0, "review_text": "I **really** don't know what vibe _A Simple Favor_ was going for, but I know I kinda liked it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T13:51:25.727Z"}, {"movie_id": 484247, "review_id": "5f1501856262080038589201", "author_rating": 7.0, "review_text": "_**Stylish, self-aware, and hilarious - a (mostly) enjoyable parody**_\r\n\r\n>_My mother used to say: Everyone has secrets. That's why you can never really know anyone else. Or trust anyone. It's why you can never know yourself. Sometimes we even keep secrets from ourselves. Growing up, I thought that was good advice, although I didn't completely understand it. Or maybe I did, a little. Kids have secrets. The imaginary friends, the things they'd get in trouble for if a grown-up ever found out._\r\n\r\n>_Later I discovered that Mom was speaking from personal experience. And I wonder if she was not jus__t preparing me but programming me for secrecy and mistrust. Did she sense that I would grow up to have darker and more shameful secrets than anyone else's? Secrets I mostly manage to keep - even from myself?_\r\n\r\n- Darcey Bell; _A Simple Favour_ (2017)\r\n\r\nExamining the rotten core beneath the surface urbanity of suburbia is something that has attracted filmmakers as diverse as Alfred Hitchcock (_Shadow of a Doubt_), David Lynch (_Blue Velvet_ and _Twin Peaks: Fire Walk With Me_), Joe Dante (_The 'Burbs)_, Gus Van Sant (_To Die For_), and Frank Oz (_The Stepford Wives_). More recently, novels such as Gillian Flynn's 2012 novel, _Gone Girl_ (and David Fincher's 2014 filmic adaptation), have expanded and popularised the suburban noir genre; the very genre that _A Simple Favour_'s satirical excesses primarily target. A comedic look at the lives of two young mothers in an affluent American suburb, coupled with a mystery plot, the film has an undeniable identity crisis due to its genre mash-up characteristics (it's a comic/satirical suburban noir murder mystery thriller). Although director Paul Feig proves adept at handling the parodic side of things, in the latter stages, he seems to be trying to ensure the film can exist (relatively) un-ironically within the very genre it's attempting to lampoon. And he doesn't particularly succeed. Despite this schizophrenic quality, however, the interplay between the two leads, the heavy stylisation, the playfully self-aware nature of the aesthetic, and the success of the burlesque elements all serve to make the film undeniably entertaining.\r\n\r\nAdapted by Jessica Sharzer from Darcey Bell's 2017 novel, _A Simple Favour_ tells the story of Stephanie Smothers (Anna Kendrick), a widowed single-mum who runs a life hacks vlog with minimal viewership. Overzealous in her desire to be liked, to the point where she's deeply unlikable, Stephanie is the kind of person who signs up for every volunteer project at her son's school, and then feigns surprise when she's told she can only work on one at a time. Enter Emily Nelson (Blake Lively), a public relations executive for a major fashion label. When Miles (Joshua Satine) and Nicky (Ian Ho), Stephanie and Emily's sons, respectively, ask for a playdate, Emily is initially unenthusiastic. However, she acquiesces, and she and Stephanie are soon bonding over increasingly strong martinis and girl chats, with Stephanie in awe of Emily, who seems to have it all; a good-looking novelist/lecturer husband, Sean (Henry Golding), a gorgeous house, a successful career, a great kid, and an acerbic attitude that Stephanie would kill for. However, all is not as perfect as it first seems; there are not insignificant financial problems; when Stephanie takes a photograph of Emily, Emily reacts angrily, demanding Stephanie delete it; although she and Sean have a great physical relationship, there isn't much else there, with Emily frustrated that his only successful novel was published over ten years ago. Several weeks later, with Emily held up at work, she asks Stephanie to pick up Nicky, and she'll collect him later. Except she doesn't collect him. As a few days go by, and no one seems to know where Emily is, Stephanie and Sean report her missing. However, unsatisfied with the direction the investigation is taking, Stephanie is soon amateur sleuthing her way across the country in an effort to track down her friend.\r\n\r\nObviously taking inspiration from suburban-based \"mommy murder mysteries\" such as _Gone Girl_ and Paula Hawkins's 2012 _The Girl on the Train_, as well as films such as Stanley Donen's _Charade_ (1963), _A Simple Favour_ is at its best when working as a parody/satire of such narratives, its own source material included. From what little I know of the book, it seems as if everything is played straight, with little discernible sense of sarcasm, even as the plot twists become ever more ludicrous. With this in mind, it makes sense that the filmmakers have elected to adapt such un-ironically thrashy material in a more self-reflexive manner, as this facilitates the gentle (and often not so gentle) ribbing of the genre, exposing some of its more ill-conceived and unrealistic tropes to ridicule. For example, the three main characters are all standard generic templates to the point of cliché; the _ingénue_ who feels honour-bound to do everything she can to find the truth, no matter the cost, ultimately learning as much about herself as anything else; the sardonic, caustic, and utterly shady plot catalyst, who always seems to have an ace up her sleeve and always seems to know more than anyone else; and, the brilliant but frustrated spouse who may, or may not, be in on the crime at the narrative's centre. However, their archetypal characteristics are dialled up to such a degree (Stephanie is the definition of innocence, Emily is the type of person that simply doesn't exist in the real world, Sean is impossibly attractive, funny, intelligent, and kind), that they can't help but seem caricatures. Similarly, everything is presented in such a nonchalant and laid back manner that the twists, which in a more self-serious film would occupy centre stage, are often rendered absurd. However, and this is the key point, _A Simple Favour_ is very much in on the joke. Most of the time.\r\n\r\nOpening with a late 1960s Europop-influenced Saul Bass-esque title sequence complete with sliding split-screens and pastel colours, scored to Jean Paul Keller's 1967 \"Ca s'est arrange\", the film signals its playful tone right from the off. This emphasis on stylisation is perhaps seen most clearly upon Emily's introduction. As Stephanie, Miles, and Nicky shelter from the rain, Emily emerges from a car in slow motion, with the camera starting on her feet before slowly moving up to her head as she raises an umbrella. Cutting to a mid-shot, she then begins to walk across the carpark (still in slow motion), as a broken umbrella blows past her, replacing the tumbleweed of a classic western shootout. Apart from being a memorable introduction to the character, the visual design of the scene is predicated on cine-literacy, showing that the filmmakers are more than aware of standard genre tropes, and, more importantly, how to employ them for comedic effect.\r\n\r\nIndeed, the entire film revels in its own intertextual awareness, with later references to such defining noir texts as George Cukor's _Gaslight_ (1944), Alfred Hitchcock's _Spellbound_ (1945), and Henri-Georges Clouzet's _Les diaboliques_ (1955). Another element of this awareness is the use of a fractured narrative structure, so beloved of classic noir mysteries. Large portions of the film feature narration within narration (and oftentimes narration within narration within narration), as well as making use of another classic noir staple; the unreliable narrator. The film gets significant mileage out of scenes where the aural narration doesn't even come close to matching the visuals; i.e., the narrator is lying, and both the narratee and the audience are aware of such. An especially funny example of this is when Stephanie tells Emily about kissing her step-brother after their father's funeral, and Emily immediately knows she is lying that she only kissed him (leading to her new nickname for Stephanie, \"_brotherfucker_\"). Whilst the narrator (Stephanie) flat-out denies she slept with him, the audience sees them having sex, confirming the narratee's (Emily) suspicions. This technique is used several times in the film, and it's an extremely well-handled narrative device.\r\n\r\nThe film's main target for satire, however, is not really a specific genre (suburban noir) or even the tropes that define that genre – it's the _milieu_ that enables the existence of that genre in the first place. Together, Stephanie, Emily, and Sean represent everything that's rotten with the sterilised, emotionally deadening middle-class suburban sphere in which they're (seemingly) trapped. However, the film doesn't condemn them for being horrible people, rather it exults in their awfulness, deftly directing, redirecting, and misdirecting the audience's sympathies, to the point where it becomes difficult to say who is screwing over whom. Every time the film seems to settle on who the villains are, it does something to disrupt the audience's perceptions, and oftentimes, so as to achieve maximum satirical impact, precisely when the character we are now being asked to empathise with is up to something somewhat less than moral. This is the very essence of black comedy – the film presents a hideous world populated by hideous people who do hideous things to one another, but it does so in such a cheerful and uplifting manner that you simply can't help but laugh at the shenanigans.\r\n\r\nIn relation to this, the film works especially well when jauntily charting the friendship between Stephanie and Emily, two women who have no businesses co-existing. I don't particularly understand Anna Kendrick's popularity. Although she seems perfectly amiable in real-life, she plays the exact same character in every film, and that character is Anna Kendrick. However, it works here because, a) it's the perfect foil to the \"screw-you\" persona of Emily, and b) Kendrick and Lively have such effortless chemistry (it's one of those films that, as you watch, you know they had a blast making). The two women are just so fundamentally different that it wouldn't take much to make their early scenes together work, but everything is in place to amplify the comedy – the lively script, the great acting, the unintrusive direction, the brightly-lit and garish interiors, the clashing wardrobes. Lively plays Emily as a mischievous, experienced charmer, the kind of person who acts like they know your secrets ten seconds after meeting you, whilst Kendrick's Stephanie is all self-deprecating intellectualism, trailed-off sentences, and statements phrased like questions. Frankly, I could have watched two hours of just the two of them trading good-natured barbs, pushing each other's buttons, and swapping sex stories.\r\n\r\nIf there was one element of the film that didn't work, however, it was the mystery plot. Yes, I get that it's all a satire of the multi-twist-for-twist's-sake suburban murder mystery, with the preposterousness of such plots played for maximum farcicality. However, the satirical underpinning doesn't change the fact that the entire mystery at the film's centre is insipid, uninteresting, and predictable, whilst Feig seems patently unable to bridge the tone of the frothier comic moments and the darker ones which become increasingly prevalent towards the end. Granted, the film is not a spoof, à la something like Jim Abrahams, David Zucker, and Jerry Zucker's _Airplane!_ (1980), so we can't expect absurdist humour throughout, but nevertheless, rather than choosing to employ a relatively even tone, Feig seems to have made the decision to mix scenes of outright comedy with predominantly serious scenes devoid of laughter. And it doesn't work. For example, the film features a scene in which someone who has just been ploughed by a car and is trying to crawl away is nonchalantly told if they don't stop, they're going to hurt their knees. That's pretty dark, but it's also pretty funny. However, it comes only a short while after a scene in which a drug-addict is held under the water and drowned. Not a huge amount to laugh at there. If scenes of this nature are supposed to be satiric, and hence feed into the film's engagement with the suburban noir, I couldn't see any evidence of it, and as a result, the tonal disparity becomes very jarring towards the end.\r\n\r\nFor all that, however, I found _A Simple Favour_ enjoyable. The purely-satirical early scenes earn enough goodwill so that the less successful more plot-heavy later scenes don't completely tear the whole thing down. The film as a whole shines a not unwelcome light on the increasingly self-important suburban noir, and for the most part, the parody is very well-judged. When the comedy is forced to retreat in the service of more serious material, the tonal balance is definitely knocked off, as the film comes dangerously close to valorising that which it has set out to mock. Despite this, however, _A Simple Favour_ remains entertaining. Distractingly attractive people wear ridiculously stylish clothes in a stylised cine-literate parody – it won't change your life, but it's a very rewarding couple of hours.", "created_at": "2020-07-20T02:29:25.580Z"}, {"movie_id": 484247, "review_id": "64b5182f12197e00c5f489d3", "author_rating": 8.0, "review_text": "You know I was confused a lot but interested. Suspense thriller it turned into. It all makes sense though in the end. Really enjoyed watching this.", "created_at": "2023-07-17T10:30:07.995Z"}, {"movie_id": 484247, "review_id": "5bb58ae50e0a2633a3005b6c", "author_rating": 7.0, "review_text": "First and foremost, this film feels like someone went to their local grocery store, grabbed a random three-dollar mystery novel off the checkout shelf, and decided to make it a movie with some extremely popular and attractive people. In other words, it's a silly mystery movie with crazy, zany twists and turns.\r\n\r\nSome of those twists and turns were easy enough to see coming, but some of them were straight out of left field. In addition to the entertaining twists, the film does a decent job of not taking itself seriously. The humor in the movie is peppered in during great moments. Some of it is cheesy, but if you're going to this film for a deep, thought-provoking film, don't.\r\n\r\nThe characters themselves are all extremely exaggerated. Lively's Emily is over-the-top sophisticated, crass, and private to the point where she won't allow pictures or even paintings of her face. Kendrick's Stephanie is bubbly, eager, awkward, and overly friendly. The rest of the cast fills in the needs around them, and while the cast is filled with one-note characters, they fulfill the needs well. Golding's Sean was my least favorite, but mainly because he doesn't have a defined archetype in a film filled with single-aspect characters.\r\n\r\nThe biggest issue with the film is the plot itself. Emily contradicts herself with the motive for her faking her own death. She tells Sean that she did it for him and for Nicky. Then she says she did it for her. On top of it all, she doesn't appear to have a plan to get the insurance money after it comes through. The film could have easily alleviated all of these issues with a quick scene or a line about fake passports for Emily and Nicky.\r\n\r\nAll in all, A Simple Favor is a fun romp filled with crazy twists and turns, humor, and great acting. Don't think too much about the film itself, and just go have some fun. It's definitely worth a getaway matinee.", "created_at": "2018-10-04T03:37:10.000Z"}, {"movie_id": 484247, "review_id": "5c447cdd9251412bf6de0ea4", "author_rating": 6.0, "review_text": "I **really** don't know what vibe _A Simple Favor_ was going for, but I know I kinda liked it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T13:51:25.727Z"}, {"movie_id": 484247, "review_id": "5f1501856262080038589201", "author_rating": 7.0, "review_text": "_**Stylish, self-aware, and hilarious - a (mostly) enjoyable parody**_\r\n\r\n>_My mother used to say: Everyone has secrets. That's why you can never really know anyone else. Or trust anyone. It's why you can never know yourself. Sometimes we even keep secrets from ourselves. Growing up, I thought that was good advice, although I didn't completely understand it. Or maybe I did, a little. Kids have secrets. The imaginary friends, the things they'd get in trouble for if a grown-up ever found out._\r\n\r\n>_Later I discovered that Mom was speaking from personal experience. And I wonder if she was not jus__t preparing me but programming me for secrecy and mistrust. Did she sense that I would grow up to have darker and more shameful secrets than anyone else's? Secrets I mostly manage to keep - even from myself?_\r\n\r\n- Darcey Bell; _A Simple Favour_ (2017)\r\n\r\nExamining the rotten core beneath the surface urbanity of suburbia is something that has attracted filmmakers as diverse as Alfred Hitchcock (_Shadow of a Doubt_), David Lynch (_Blue Velvet_ and _Twin Peaks: Fire Walk With Me_), Joe Dante (_The 'Burbs)_, Gus Van Sant (_To Die For_), and Frank Oz (_The Stepford Wives_). More recently, novels such as Gillian Flynn's 2012 novel, _Gone Girl_ (and David Fincher's 2014 filmic adaptation), have expanded and popularised the suburban noir genre; the very genre that _A Simple Favour_'s satirical excesses primarily target. A comedic look at the lives of two young mothers in an affluent American suburb, coupled with a mystery plot, the film has an undeniable identity crisis due to its genre mash-up characteristics (it's a comic/satirical suburban noir murder mystery thriller). Although director Paul Feig proves adept at handling the parodic side of things, in the latter stages, he seems to be trying to ensure the film can exist (relatively) un-ironically within the very genre it's attempting to lampoon. And he doesn't particularly succeed. Despite this schizophrenic quality, however, the interplay between the two leads, the heavy stylisation, the playfully self-aware nature of the aesthetic, and the success of the burlesque elements all serve to make the film undeniably entertaining.\r\n\r\nAdapted by Jessica Sharzer from Darcey Bell's 2017 novel, _A Simple Favour_ tells the story of Stephanie Smothers (Anna Kendrick), a widowed single-mum who runs a life hacks vlog with minimal viewership. Overzealous in her desire to be liked, to the point where she's deeply unlikable, Stephanie is the kind of person who signs up for every volunteer project at her son's school, and then feigns surprise when she's told she can only work on one at a time. Enter Emily Nelson (Blake Lively), a public relations executive for a major fashion label. When Miles (Joshua Satine) and Nicky (Ian Ho), Stephanie and Emily's sons, respectively, ask for a playdate, Emily is initially unenthusiastic. However, she acquiesces, and she and Stephanie are soon bonding over increasingly strong martinis and girl chats, with Stephanie in awe of Emily, who seems to have it all; a good-looking novelist/lecturer husband, Sean (Henry Golding), a gorgeous house, a successful career, a great kid, and an acerbic attitude that Stephanie would kill for. However, all is not as perfect as it first seems; there are not insignificant financial problems; when Stephanie takes a photograph of Emily, Emily reacts angrily, demanding Stephanie delete it; although she and Sean have a great physical relationship, there isn't much else there, with Emily frustrated that his only successful novel was published over ten years ago. Several weeks later, with Emily held up at work, she asks Stephanie to pick up Nicky, and she'll collect him later. Except she doesn't collect him. As a few days go by, and no one seems to know where Emily is, Stephanie and Sean report her missing. However, unsatisfied with the direction the investigation is taking, Stephanie is soon amateur sleuthing her way across the country in an effort to track down her friend.\r\n\r\nObviously taking inspiration from suburban-based \"mommy murder mysteries\" such as _Gone Girl_ and Paula Hawkins's 2012 _The Girl on the Train_, as well as films such as Stanley Donen's _Charade_ (1963), _A Simple Favour_ is at its best when working as a parody/satire of such narratives, its own source material included. From what little I know of the book, it seems as if everything is played straight, with little discernible sense of sarcasm, even as the plot twists become ever more ludicrous. With this in mind, it makes sense that the filmmakers have elected to adapt such un-ironically thrashy material in a more self-reflexive manner, as this facilitates the gentle (and often not so gentle) ribbing of the genre, exposing some of its more ill-conceived and unrealistic tropes to ridicule. For example, the three main characters are all standard generic templates to the point of cliché; the _ingénue_ who feels honour-bound to do everything she can to find the truth, no matter the cost, ultimately learning as much about herself as anything else; the sardonic, caustic, and utterly shady plot catalyst, who always seems to have an ace up her sleeve and always seems to know more than anyone else; and, the brilliant but frustrated spouse who may, or may not, be in on the crime at the narrative's centre. However, their archetypal characteristics are dialled up to such a degree (Stephanie is the definition of innocence, Emily is the type of person that simply doesn't exist in the real world, Sean is impossibly attractive, funny, intelligent, and kind), that they can't help but seem caricatures. Similarly, everything is presented in such a nonchalant and laid back manner that the twists, which in a more self-serious film would occupy centre stage, are often rendered absurd. However, and this is the key point, _A Simple Favour_ is very much in on the joke. Most of the time.\r\n\r\nOpening with a late 1960s Europop-influenced Saul Bass-esque title sequence complete with sliding split-screens and pastel colours, scored to Jean Paul Keller's 1967 \"Ca s'est arrange\", the film signals its playful tone right from the off. This emphasis on stylisation is perhaps seen most clearly upon Emily's introduction. As Stephanie, Miles, and Nicky shelter from the rain, Emily emerges from a car in slow motion, with the camera starting on her feet before slowly moving up to her head as she raises an umbrella. Cutting to a mid-shot, she then begins to walk across the carpark (still in slow motion), as a broken umbrella blows past her, replacing the tumbleweed of a classic western shootout. Apart from being a memorable introduction to the character, the visual design of the scene is predicated on cine-literacy, showing that the filmmakers are more than aware of standard genre tropes, and, more importantly, how to employ them for comedic effect.\r\n\r\nIndeed, the entire film revels in its own intertextual awareness, with later references to such defining noir texts as George Cukor's _Gaslight_ (1944), Alfred Hitchcock's _Spellbound_ (1945), and Henri-Georges Clouzet's _Les diaboliques_ (1955). Another element of this awareness is the use of a fractured narrative structure, so beloved of classic noir mysteries. Large portions of the film feature narration within narration (and oftentimes narration within narration within narration), as well as making use of another classic noir staple; the unreliable narrator. The film gets significant mileage out of scenes where the aural narration doesn't even come close to matching the visuals; i.e., the narrator is lying, and both the narratee and the audience are aware of such. An especially funny example of this is when Stephanie tells Emily about kissing her step-brother after their father's funeral, and Emily immediately knows she is lying that she only kissed him (leading to her new nickname for Stephanie, \"_brotherfucker_\"). Whilst the narrator (Stephanie) flat-out denies she slept with him, the audience sees them having sex, confirming the narratee's (Emily) suspicions. This technique is used several times in the film, and it's an extremely well-handled narrative device.\r\n\r\nThe film's main target for satire, however, is not really a specific genre (suburban noir) or even the tropes that define that genre – it's the _milieu_ that enables the existence of that genre in the first place. Together, Stephanie, Emily, and Sean represent everything that's rotten with the sterilised, emotionally deadening middle-class suburban sphere in which they're (seemingly) trapped. However, the film doesn't condemn them for being horrible people, rather it exults in their awfulness, deftly directing, redirecting, and misdirecting the audience's sympathies, to the point where it becomes difficult to say who is screwing over whom. Every time the film seems to settle on who the villains are, it does something to disrupt the audience's perceptions, and oftentimes, so as to achieve maximum satirical impact, precisely when the character we are now being asked to empathise with is up to something somewhat less than moral. This is the very essence of black comedy – the film presents a hideous world populated by hideous people who do hideous things to one another, but it does so in such a cheerful and uplifting manner that you simply can't help but laugh at the shenanigans.\r\n\r\nIn relation to this, the film works especially well when jauntily charting the friendship between Stephanie and Emily, two women who have no businesses co-existing. I don't particularly understand Anna Kendrick's popularity. Although she seems perfectly amiable in real-life, she plays the exact same character in every film, and that character is Anna Kendrick. However, it works here because, a) it's the perfect foil to the \"screw-you\" persona of Emily, and b) Kendrick and Lively have such effortless chemistry (it's one of those films that, as you watch, you know they had a blast making). The two women are just so fundamentally different that it wouldn't take much to make their early scenes together work, but everything is in place to amplify the comedy – the lively script, the great acting, the unintrusive direction, the brightly-lit and garish interiors, the clashing wardrobes. Lively plays Emily as a mischievous, experienced charmer, the kind of person who acts like they know your secrets ten seconds after meeting you, whilst Kendrick's Stephanie is all self-deprecating intellectualism, trailed-off sentences, and statements phrased like questions. Frankly, I could have watched two hours of just the two of them trading good-natured barbs, pushing each other's buttons, and swapping sex stories.\r\n\r\nIf there was one element of the film that didn't work, however, it was the mystery plot. Yes, I get that it's all a satire of the multi-twist-for-twist's-sake suburban murder mystery, with the preposterousness of such plots played for maximum farcicality. However, the satirical underpinning doesn't change the fact that the entire mystery at the film's centre is insipid, uninteresting, and predictable, whilst Feig seems patently unable to bridge the tone of the frothier comic moments and the darker ones which become increasingly prevalent towards the end. Granted, the film is not a spoof, à la something like Jim Abrahams, David Zucker, and Jerry Zucker's _Airplane!_ (1980), so we can't expect absurdist humour throughout, but nevertheless, rather than choosing to employ a relatively even tone, Feig seems to have made the decision to mix scenes of outright comedy with predominantly serious scenes devoid of laughter. And it doesn't work. For example, the film features a scene in which someone who has just been ploughed by a car and is trying to crawl away is nonchalantly told if they don't stop, they're going to hurt their knees. That's pretty dark, but it's also pretty funny. However, it comes only a short while after a scene in which a drug-addict is held under the water and drowned. Not a huge amount to laugh at there. If scenes of this nature are supposed to be satiric, and hence feed into the film's engagement with the suburban noir, I couldn't see any evidence of it, and as a result, the tonal disparity becomes very jarring towards the end.\r\n\r\nFor all that, however, I found _A Simple Favour_ enjoyable. The purely-satirical early scenes earn enough goodwill so that the less successful more plot-heavy later scenes don't completely tear the whole thing down. The film as a whole shines a not unwelcome light on the increasingly self-important suburban noir, and for the most part, the parody is very well-judged. When the comedy is forced to retreat in the service of more serious material, the tonal balance is definitely knocked off, as the film comes dangerously close to valorising that which it has set out to mock. Despite this, however, _A Simple Favour_ remains entertaining. Distractingly attractive people wear ridiculously stylish clothes in a stylised cine-literate parody – it won't change your life, but it's a very rewarding couple of hours.", "created_at": "2020-07-20T02:29:25.580Z"}, {"movie_id": 484247, "review_id": "64b5182f12197e00c5f489d3", "author_rating": 8.0, "review_text": "You know I was confused a lot but interested. Suspense thriller it turned into. It all makes sense though in the end. Really enjoyed watching this.", "created_at": "2023-07-17T10:30:07.995Z"}, {"movie_id": 484247, "review_id": "5bb58ae50e0a2633a3005b6c", "author_rating": 7.0, "review_text": "First and foremost, this film feels like someone went to their local grocery store, grabbed a random three-dollar mystery novel off the checkout shelf, and decided to make it a movie with some extremely popular and attractive people. In other words, it's a silly mystery movie with crazy, zany twists and turns.\r\n\r\nSome of those twists and turns were easy enough to see coming, but some of them were straight out of left field. In addition to the entertaining twists, the film does a decent job of not taking itself seriously. The humor in the movie is peppered in during great moments. Some of it is cheesy, but if you're going to this film for a deep, thought-provoking film, don't.\r\n\r\nThe characters themselves are all extremely exaggerated. Lively's Emily is over-the-top sophisticated, crass, and private to the point where she won't allow pictures or even paintings of her face. Kendrick's Stephanie is bubbly, eager, awkward, and overly friendly. The rest of the cast fills in the needs around them, and while the cast is filled with one-note characters, they fulfill the needs well. Golding's Sean was my least favorite, but mainly because he doesn't have a defined archetype in a film filled with single-aspect characters.\r\n\r\nThe biggest issue with the film is the plot itself. Emily contradicts herself with the motive for her faking her own death. She tells Sean that she did it for him and for Nicky. Then she says she did it for her. On top of it all, she doesn't appear to have a plan to get the insurance money after it comes through. The film could have easily alleviated all of these issues with a quick scene or a line about fake passports for Emily and Nicky.\r\n\r\nAll in all, A Simple Favor is a fun romp filled with crazy twists and turns, humor, and great acting. Don't think too much about the film itself, and just go have some fun. It's definitely worth a getaway matinee.", "created_at": "2018-10-04T03:37:10.000Z"}, {"movie_id": 484247, "review_id": "5c447cdd9251412bf6de0ea4", "author_rating": 6.0, "review_text": "I **really** don't know what vibe _A Simple Favor_ was going for, but I know I kinda liked it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T13:51:25.727Z"}, {"movie_id": 484247, "review_id": "5f1501856262080038589201", "author_rating": 7.0, "review_text": "_**Stylish, self-aware, and hilarious - a (mostly) enjoyable parody**_\r\n\r\n>_My mother used to say: Everyone has secrets. That's why you can never really know anyone else. Or trust anyone. It's why you can never know yourself. Sometimes we even keep secrets from ourselves. Growing up, I thought that was good advice, although I didn't completely understand it. Or maybe I did, a little. Kids have secrets. The imaginary friends, the things they'd get in trouble for if a grown-up ever found out._\r\n\r\n>_Later I discovered that Mom was speaking from personal experience. And I wonder if she was not jus__t preparing me but programming me for secrecy and mistrust. Did she sense that I would grow up to have darker and more shameful secrets than anyone else's? Secrets I mostly manage to keep - even from myself?_\r\n\r\n- Darcey Bell; _A Simple Favour_ (2017)\r\n\r\nExamining the rotten core beneath the surface urbanity of suburbia is something that has attracted filmmakers as diverse as Alfred Hitchcock (_Shadow of a Doubt_), David Lynch (_Blue Velvet_ and _Twin Peaks: Fire Walk With Me_), Joe Dante (_The 'Burbs)_, Gus Van Sant (_To Die For_), and Frank Oz (_The Stepford Wives_). More recently, novels such as Gillian Flynn's 2012 novel, _Gone Girl_ (and David Fincher's 2014 filmic adaptation), have expanded and popularised the suburban noir genre; the very genre that _A Simple Favour_'s satirical excesses primarily target. A comedic look at the lives of two young mothers in an affluent American suburb, coupled with a mystery plot, the film has an undeniable identity crisis due to its genre mash-up characteristics (it's a comic/satirical suburban noir murder mystery thriller). Although director Paul Feig proves adept at handling the parodic side of things, in the latter stages, he seems to be trying to ensure the film can exist (relatively) un-ironically within the very genre it's attempting to lampoon. And he doesn't particularly succeed. Despite this schizophrenic quality, however, the interplay between the two leads, the heavy stylisation, the playfully self-aware nature of the aesthetic, and the success of the burlesque elements all serve to make the film undeniably entertaining.\r\n\r\nAdapted by Jessica Sharzer from Darcey Bell's 2017 novel, _A Simple Favour_ tells the story of Stephanie Smothers (Anna Kendrick), a widowed single-mum who runs a life hacks vlog with minimal viewership. Overzealous in her desire to be liked, to the point where she's deeply unlikable, Stephanie is the kind of person who signs up for every volunteer project at her son's school, and then feigns surprise when she's told she can only work on one at a time. Enter Emily Nelson (Blake Lively), a public relations executive for a major fashion label. When Miles (Joshua Satine) and Nicky (Ian Ho), Stephanie and Emily's sons, respectively, ask for a playdate, Emily is initially unenthusiastic. However, she acquiesces, and she and Stephanie are soon bonding over increasingly strong martinis and girl chats, with Stephanie in awe of Emily, who seems to have it all; a good-looking novelist/lecturer husband, Sean (Henry Golding), a gorgeous house, a successful career, a great kid, and an acerbic attitude that Stephanie would kill for. However, all is not as perfect as it first seems; there are not insignificant financial problems; when Stephanie takes a photograph of Emily, Emily reacts angrily, demanding Stephanie delete it; although she and Sean have a great physical relationship, there isn't much else there, with Emily frustrated that his only successful novel was published over ten years ago. Several weeks later, with Emily held up at work, she asks Stephanie to pick up Nicky, and she'll collect him later. Except she doesn't collect him. As a few days go by, and no one seems to know where Emily is, Stephanie and Sean report her missing. However, unsatisfied with the direction the investigation is taking, Stephanie is soon amateur sleuthing her way across the country in an effort to track down her friend.\r\n\r\nObviously taking inspiration from suburban-based \"mommy murder mysteries\" such as _Gone Girl_ and Paula Hawkins's 2012 _The Girl on the Train_, as well as films such as Stanley Donen's _Charade_ (1963), _A Simple Favour_ is at its best when working as a parody/satire of such narratives, its own source material included. From what little I know of the book, it seems as if everything is played straight, with little discernible sense of sarcasm, even as the plot twists become ever more ludicrous. With this in mind, it makes sense that the filmmakers have elected to adapt such un-ironically thrashy material in a more self-reflexive manner, as this facilitates the gentle (and often not so gentle) ribbing of the genre, exposing some of its more ill-conceived and unrealistic tropes to ridicule. For example, the three main characters are all standard generic templates to the point of cliché; the _ingénue_ who feels honour-bound to do everything she can to find the truth, no matter the cost, ultimately learning as much about herself as anything else; the sardonic, caustic, and utterly shady plot catalyst, who always seems to have an ace up her sleeve and always seems to know more than anyone else; and, the brilliant but frustrated spouse who may, or may not, be in on the crime at the narrative's centre. However, their archetypal characteristics are dialled up to such a degree (Stephanie is the definition of innocence, Emily is the type of person that simply doesn't exist in the real world, Sean is impossibly attractive, funny, intelligent, and kind), that they can't help but seem caricatures. Similarly, everything is presented in such a nonchalant and laid back manner that the twists, which in a more self-serious film would occupy centre stage, are often rendered absurd. However, and this is the key point, _A Simple Favour_ is very much in on the joke. Most of the time.\r\n\r\nOpening with a late 1960s Europop-influenced Saul Bass-esque title sequence complete with sliding split-screens and pastel colours, scored to Jean Paul Keller's 1967 \"Ca s'est arrange\", the film signals its playful tone right from the off. This emphasis on stylisation is perhaps seen most clearly upon Emily's introduction. As Stephanie, Miles, and Nicky shelter from the rain, Emily emerges from a car in slow motion, with the camera starting on her feet before slowly moving up to her head as she raises an umbrella. Cutting to a mid-shot, she then begins to walk across the carpark (still in slow motion), as a broken umbrella blows past her, replacing the tumbleweed of a classic western shootout. Apart from being a memorable introduction to the character, the visual design of the scene is predicated on cine-literacy, showing that the filmmakers are more than aware of standard genre tropes, and, more importantly, how to employ them for comedic effect.\r\n\r\nIndeed, the entire film revels in its own intertextual awareness, with later references to such defining noir texts as George Cukor's _Gaslight_ (1944), Alfred Hitchcock's _Spellbound_ (1945), and Henri-Georges Clouzet's _Les diaboliques_ (1955). Another element of this awareness is the use of a fractured narrative structure, so beloved of classic noir mysteries. Large portions of the film feature narration within narration (and oftentimes narration within narration within narration), as well as making use of another classic noir staple; the unreliable narrator. The film gets significant mileage out of scenes where the aural narration doesn't even come close to matching the visuals; i.e., the narrator is lying, and both the narratee and the audience are aware of such. An especially funny example of this is when Stephanie tells Emily about kissing her step-brother after their father's funeral, and Emily immediately knows she is lying that she only kissed him (leading to her new nickname for Stephanie, \"_brotherfucker_\"). Whilst the narrator (Stephanie) flat-out denies she slept with him, the audience sees them having sex, confirming the narratee's (Emily) suspicions. This technique is used several times in the film, and it's an extremely well-handled narrative device.\r\n\r\nThe film's main target for satire, however, is not really a specific genre (suburban noir) or even the tropes that define that genre – it's the _milieu_ that enables the existence of that genre in the first place. Together, Stephanie, Emily, and Sean represent everything that's rotten with the sterilised, emotionally deadening middle-class suburban sphere in which they're (seemingly) trapped. However, the film doesn't condemn them for being horrible people, rather it exults in their awfulness, deftly directing, redirecting, and misdirecting the audience's sympathies, to the point where it becomes difficult to say who is screwing over whom. Every time the film seems to settle on who the villains are, it does something to disrupt the audience's perceptions, and oftentimes, so as to achieve maximum satirical impact, precisely when the character we are now being asked to empathise with is up to something somewhat less than moral. This is the very essence of black comedy – the film presents a hideous world populated by hideous people who do hideous things to one another, but it does so in such a cheerful and uplifting manner that you simply can't help but laugh at the shenanigans.\r\n\r\nIn relation to this, the film works especially well when jauntily charting the friendship between Stephanie and Emily, two women who have no businesses co-existing. I don't particularly understand Anna Kendrick's popularity. Although she seems perfectly amiable in real-life, she plays the exact same character in every film, and that character is Anna Kendrick. However, it works here because, a) it's the perfect foil to the \"screw-you\" persona of Emily, and b) Kendrick and Lively have such effortless chemistry (it's one of those films that, as you watch, you know they had a blast making). The two women are just so fundamentally different that it wouldn't take much to make their early scenes together work, but everything is in place to amplify the comedy – the lively script, the great acting, the unintrusive direction, the brightly-lit and garish interiors, the clashing wardrobes. Lively plays Emily as a mischievous, experienced charmer, the kind of person who acts like they know your secrets ten seconds after meeting you, whilst Kendrick's Stephanie is all self-deprecating intellectualism, trailed-off sentences, and statements phrased like questions. Frankly, I could have watched two hours of just the two of them trading good-natured barbs, pushing each other's buttons, and swapping sex stories.\r\n\r\nIf there was one element of the film that didn't work, however, it was the mystery plot. Yes, I get that it's all a satire of the multi-twist-for-twist's-sake suburban murder mystery, with the preposterousness of such plots played for maximum farcicality. However, the satirical underpinning doesn't change the fact that the entire mystery at the film's centre is insipid, uninteresting, and predictable, whilst Feig seems patently unable to bridge the tone of the frothier comic moments and the darker ones which become increasingly prevalent towards the end. Granted, the film is not a spoof, à la something like Jim Abrahams, David Zucker, and Jerry Zucker's _Airplane!_ (1980), so we can't expect absurdist humour throughout, but nevertheless, rather than choosing to employ a relatively even tone, Feig seems to have made the decision to mix scenes of outright comedy with predominantly serious scenes devoid of laughter. And it doesn't work. For example, the film features a scene in which someone who has just been ploughed by a car and is trying to crawl away is nonchalantly told if they don't stop, they're going to hurt their knees. That's pretty dark, but it's also pretty funny. However, it comes only a short while after a scene in which a drug-addict is held under the water and drowned. Not a huge amount to laugh at there. If scenes of this nature are supposed to be satiric, and hence feed into the film's engagement with the suburban noir, I couldn't see any evidence of it, and as a result, the tonal disparity becomes very jarring towards the end.\r\n\r\nFor all that, however, I found _A Simple Favour_ enjoyable. The purely-satirical early scenes earn enough goodwill so that the less successful more plot-heavy later scenes don't completely tear the whole thing down. The film as a whole shines a not unwelcome light on the increasingly self-important suburban noir, and for the most part, the parody is very well-judged. When the comedy is forced to retreat in the service of more serious material, the tonal balance is definitely knocked off, as the film comes dangerously close to valorising that which it has set out to mock. Despite this, however, _A Simple Favour_ remains entertaining. Distractingly attractive people wear ridiculously stylish clothes in a stylised cine-literate parody – it won't change your life, but it's a very rewarding couple of hours.", "created_at": "2020-07-20T02:29:25.580Z"}, {"movie_id": 484247, "review_id": "64b5182f12197e00c5f489d3", "author_rating": 8.0, "review_text": "You know I was confused a lot but interested. Suspense thriller it turned into. It all makes sense though in the end. Really enjoyed watching this.", "created_at": "2023-07-17T10:30:07.995Z"}, {"movie_id": 484247, "review_id": "5bb58ae50e0a2633a3005b6c", "author_rating": 7.0, "review_text": "First and foremost, this film feels like someone went to their local grocery store, grabbed a random three-dollar mystery novel off the checkout shelf, and decided to make it a movie with some extremely popular and attractive people. In other words, it's a silly mystery movie with crazy, zany twists and turns.\r\n\r\nSome of those twists and turns were easy enough to see coming, but some of them were straight out of left field. In addition to the entertaining twists, the film does a decent job of not taking itself seriously. The humor in the movie is peppered in during great moments. Some of it is cheesy, but if you're going to this film for a deep, thought-provoking film, don't.\r\n\r\nThe characters themselves are all extremely exaggerated. Lively's Emily is over-the-top sophisticated, crass, and private to the point where she won't allow pictures or even paintings of her face. Kendrick's Stephanie is bubbly, eager, awkward, and overly friendly. The rest of the cast fills in the needs around them, and while the cast is filled with one-note characters, they fulfill the needs well. Golding's Sean was my least favorite, but mainly because he doesn't have a defined archetype in a film filled with single-aspect characters.\r\n\r\nThe biggest issue with the film is the plot itself. Emily contradicts herself with the motive for her faking her own death. She tells Sean that she did it for him and for Nicky. Then she says she did it for her. On top of it all, she doesn't appear to have a plan to get the insurance money after it comes through. The film could have easily alleviated all of these issues with a quick scene or a line about fake passports for Emily and Nicky.\r\n\r\nAll in all, A Simple Favor is a fun romp filled with crazy twists and turns, humor, and great acting. Don't think too much about the film itself, and just go have some fun. It's definitely worth a getaway matinee.", "created_at": "2018-10-04T03:37:10.000Z"}, {"movie_id": 484247, "review_id": "5c447cdd9251412bf6de0ea4", "author_rating": 6.0, "review_text": "I **really** don't know what vibe _A Simple Favor_ was going for, but I know I kinda liked it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T13:51:25.727Z"}, {"movie_id": 484247, "review_id": "5f1501856262080038589201", "author_rating": 7.0, "review_text": "_**Stylish, self-aware, and hilarious - a (mostly) enjoyable parody**_\r\n\r\n>_My mother used to say: Everyone has secrets. That's why you can never really know anyone else. Or trust anyone. It's why you can never know yourself. Sometimes we even keep secrets from ourselves. Growing up, I thought that was good advice, although I didn't completely understand it. Or maybe I did, a little. Kids have secrets. The imaginary friends, the things they'd get in trouble for if a grown-up ever found out._\r\n\r\n>_Later I discovered that Mom was speaking from personal experience. And I wonder if she was not jus__t preparing me but programming me for secrecy and mistrust. Did she sense that I would grow up to have darker and more shameful secrets than anyone else's? Secrets I mostly manage to keep - even from myself?_\r\n\r\n- Darcey Bell; _A Simple Favour_ (2017)\r\n\r\nExamining the rotten core beneath the surface urbanity of suburbia is something that has attracted filmmakers as diverse as Alfred Hitchcock (_Shadow of a Doubt_), David Lynch (_Blue Velvet_ and _Twin Peaks: Fire Walk With Me_), Joe Dante (_The 'Burbs)_, Gus Van Sant (_To Die For_), and Frank Oz (_The Stepford Wives_). More recently, novels such as Gillian Flynn's 2012 novel, _Gone Girl_ (and David Fincher's 2014 filmic adaptation), have expanded and popularised the suburban noir genre; the very genre that _A Simple Favour_'s satirical excesses primarily target. A comedic look at the lives of two young mothers in an affluent American suburb, coupled with a mystery plot, the film has an undeniable identity crisis due to its genre mash-up characteristics (it's a comic/satirical suburban noir murder mystery thriller). Although director Paul Feig proves adept at handling the parodic side of things, in the latter stages, he seems to be trying to ensure the film can exist (relatively) un-ironically within the very genre it's attempting to lampoon. And he doesn't particularly succeed. Despite this schizophrenic quality, however, the interplay between the two leads, the heavy stylisation, the playfully self-aware nature of the aesthetic, and the success of the burlesque elements all serve to make the film undeniably entertaining.\r\n\r\nAdapted by Jessica Sharzer from Darcey Bell's 2017 novel, _A Simple Favour_ tells the story of Stephanie Smothers (Anna Kendrick), a widowed single-mum who runs a life hacks vlog with minimal viewership. Overzealous in her desire to be liked, to the point where she's deeply unlikable, Stephanie is the kind of person who signs up for every volunteer project at her son's school, and then feigns surprise when she's told she can only work on one at a time. Enter Emily Nelson (Blake Lively), a public relations executive for a major fashion label. When Miles (Joshua Satine) and Nicky (Ian Ho), Stephanie and Emily's sons, respectively, ask for a playdate, Emily is initially unenthusiastic. However, she acquiesces, and she and Stephanie are soon bonding over increasingly strong martinis and girl chats, with Stephanie in awe of Emily, who seems to have it all; a good-looking novelist/lecturer husband, Sean (Henry Golding), a gorgeous house, a successful career, a great kid, and an acerbic attitude that Stephanie would kill for. However, all is not as perfect as it first seems; there are not insignificant financial problems; when Stephanie takes a photograph of Emily, Emily reacts angrily, demanding Stephanie delete it; although she and Sean have a great physical relationship, there isn't much else there, with Emily frustrated that his only successful novel was published over ten years ago. Several weeks later, with Emily held up at work, she asks Stephanie to pick up Nicky, and she'll collect him later. Except she doesn't collect him. As a few days go by, and no one seems to know where Emily is, Stephanie and Sean report her missing. However, unsatisfied with the direction the investigation is taking, Stephanie is soon amateur sleuthing her way across the country in an effort to track down her friend.\r\n\r\nObviously taking inspiration from suburban-based \"mommy murder mysteries\" such as _Gone Girl_ and Paula Hawkins's 2012 _The Girl on the Train_, as well as films such as Stanley Donen's _Charade_ (1963), _A Simple Favour_ is at its best when working as a parody/satire of such narratives, its own source material included. From what little I know of the book, it seems as if everything is played straight, with little discernible sense of sarcasm, even as the plot twists become ever more ludicrous. With this in mind, it makes sense that the filmmakers have elected to adapt such un-ironically thrashy material in a more self-reflexive manner, as this facilitates the gentle (and often not so gentle) ribbing of the genre, exposing some of its more ill-conceived and unrealistic tropes to ridicule. For example, the three main characters are all standard generic templates to the point of cliché; the _ingénue_ who feels honour-bound to do everything she can to find the truth, no matter the cost, ultimately learning as much about herself as anything else; the sardonic, caustic, and utterly shady plot catalyst, who always seems to have an ace up her sleeve and always seems to know more than anyone else; and, the brilliant but frustrated spouse who may, or may not, be in on the crime at the narrative's centre. However, their archetypal characteristics are dialled up to such a degree (Stephanie is the definition of innocence, Emily is the type of person that simply doesn't exist in the real world, Sean is impossibly attractive, funny, intelligent, and kind), that they can't help but seem caricatures. Similarly, everything is presented in such a nonchalant and laid back manner that the twists, which in a more self-serious film would occupy centre stage, are often rendered absurd. However, and this is the key point, _A Simple Favour_ is very much in on the joke. Most of the time.\r\n\r\nOpening with a late 1960s Europop-influenced Saul Bass-esque title sequence complete with sliding split-screens and pastel colours, scored to Jean Paul Keller's 1967 \"Ca s'est arrange\", the film signals its playful tone right from the off. This emphasis on stylisation is perhaps seen most clearly upon Emily's introduction. As Stephanie, Miles, and Nicky shelter from the rain, Emily emerges from a car in slow motion, with the camera starting on her feet before slowly moving up to her head as she raises an umbrella. Cutting to a mid-shot, she then begins to walk across the carpark (still in slow motion), as a broken umbrella blows past her, replacing the tumbleweed of a classic western shootout. Apart from being a memorable introduction to the character, the visual design of the scene is predicated on cine-literacy, showing that the filmmakers are more than aware of standard genre tropes, and, more importantly, how to employ them for comedic effect.\r\n\r\nIndeed, the entire film revels in its own intertextual awareness, with later references to such defining noir texts as George Cukor's _Gaslight_ (1944), Alfred Hitchcock's _Spellbound_ (1945), and Henri-Georges Clouzet's _Les diaboliques_ (1955). Another element of this awareness is the use of a fractured narrative structure, so beloved of classic noir mysteries. Large portions of the film feature narration within narration (and oftentimes narration within narration within narration), as well as making use of another classic noir staple; the unreliable narrator. The film gets significant mileage out of scenes where the aural narration doesn't even come close to matching the visuals; i.e., the narrator is lying, and both the narratee and the audience are aware of such. An especially funny example of this is when Stephanie tells Emily about kissing her step-brother after their father's funeral, and Emily immediately knows she is lying that she only kissed him (leading to her new nickname for Stephanie, \"_brotherfucker_\"). Whilst the narrator (Stephanie) flat-out denies she slept with him, the audience sees them having sex, confirming the narratee's (Emily) suspicions. This technique is used several times in the film, and it's an extremely well-handled narrative device.\r\n\r\nThe film's main target for satire, however, is not really a specific genre (suburban noir) or even the tropes that define that genre – it's the _milieu_ that enables the existence of that genre in the first place. Together, Stephanie, Emily, and Sean represent everything that's rotten with the sterilised, emotionally deadening middle-class suburban sphere in which they're (seemingly) trapped. However, the film doesn't condemn them for being horrible people, rather it exults in their awfulness, deftly directing, redirecting, and misdirecting the audience's sympathies, to the point where it becomes difficult to say who is screwing over whom. Every time the film seems to settle on who the villains are, it does something to disrupt the audience's perceptions, and oftentimes, so as to achieve maximum satirical impact, precisely when the character we are now being asked to empathise with is up to something somewhat less than moral. This is the very essence of black comedy – the film presents a hideous world populated by hideous people who do hideous things to one another, but it does so in such a cheerful and uplifting manner that you simply can't help but laugh at the shenanigans.\r\n\r\nIn relation to this, the film works especially well when jauntily charting the friendship between Stephanie and Emily, two women who have no businesses co-existing. I don't particularly understand Anna Kendrick's popularity. Although she seems perfectly amiable in real-life, she plays the exact same character in every film, and that character is Anna Kendrick. However, it works here because, a) it's the perfect foil to the \"screw-you\" persona of Emily, and b) Kendrick and Lively have such effortless chemistry (it's one of those films that, as you watch, you know they had a blast making). The two women are just so fundamentally different that it wouldn't take much to make their early scenes together work, but everything is in place to amplify the comedy – the lively script, the great acting, the unintrusive direction, the brightly-lit and garish interiors, the clashing wardrobes. Lively plays Emily as a mischievous, experienced charmer, the kind of person who acts like they know your secrets ten seconds after meeting you, whilst Kendrick's Stephanie is all self-deprecating intellectualism, trailed-off sentences, and statements phrased like questions. Frankly, I could have watched two hours of just the two of them trading good-natured barbs, pushing each other's buttons, and swapping sex stories.\r\n\r\nIf there was one element of the film that didn't work, however, it was the mystery plot. Yes, I get that it's all a satire of the multi-twist-for-twist's-sake suburban murder mystery, with the preposterousness of such plots played for maximum farcicality. However, the satirical underpinning doesn't change the fact that the entire mystery at the film's centre is insipid, uninteresting, and predictable, whilst Feig seems patently unable to bridge the tone of the frothier comic moments and the darker ones which become increasingly prevalent towards the end. Granted, the film is not a spoof, à la something like Jim Abrahams, David Zucker, and Jerry Zucker's _Airplane!_ (1980), so we can't expect absurdist humour throughout, but nevertheless, rather than choosing to employ a relatively even tone, Feig seems to have made the decision to mix scenes of outright comedy with predominantly serious scenes devoid of laughter. And it doesn't work. For example, the film features a scene in which someone who has just been ploughed by a car and is trying to crawl away is nonchalantly told if they don't stop, they're going to hurt their knees. That's pretty dark, but it's also pretty funny. However, it comes only a short while after a scene in which a drug-addict is held under the water and drowned. Not a huge amount to laugh at there. If scenes of this nature are supposed to be satiric, and hence feed into the film's engagement with the suburban noir, I couldn't see any evidence of it, and as a result, the tonal disparity becomes very jarring towards the end.\r\n\r\nFor all that, however, I found _A Simple Favour_ enjoyable. The purely-satirical early scenes earn enough goodwill so that the less successful more plot-heavy later scenes don't completely tear the whole thing down. The film as a whole shines a not unwelcome light on the increasingly self-important suburban noir, and for the most part, the parody is very well-judged. When the comedy is forced to retreat in the service of more serious material, the tonal balance is definitely knocked off, as the film comes dangerously close to valorising that which it has set out to mock. Despite this, however, _A Simple Favour_ remains entertaining. Distractingly attractive people wear ridiculously stylish clothes in a stylised cine-literate parody – it won't change your life, but it's a very rewarding couple of hours.", "created_at": "2020-07-20T02:29:25.580Z"}, {"movie_id": 484247, "review_id": "64b5182f12197e00c5f489d3", "author_rating": 8.0, "review_text": "You know I was confused a lot but interested. Suspense thriller it turned into. It all makes sense though in the end. Really enjoyed watching this.", "created_at": "2023-07-17T10:30:07.995Z"}]