[{"movie_id": 1116, "review_id": "5245bf0019c2953df52424cc", "author_rating": 8.0, "review_text": "Intense drama about Ireland's independence from the UK and the ultimate reasons for the need of freedom.", "created_at": "2013-09-27T17:23:12.867Z"}, {"movie_id": 1116, "review_id": "63138444e63571007de00908", "author_rating": 6.0, "review_text": "After watching The Wind That Shakes the Barley, I'm tempted to say that Hollywood ruined Cillian Murphy, but the fact is that this drama written by Paul Laverty and directed by Ken Loach doesn’t really establish, for better or worse, a before and after in the career of the Irish actor; it's more a case of a blind squirrel finding a nut — which is still one more nut than most find (plus, Murphy's range is undeniable, being able to convincingly convey both the most abject cowardice and the most selfless heroism, even within the same film, as he does A Quiet Place Part II).\r\n\r\nThe Irish Republican Army (IRA) is a group whose main characteristic is separation, especially from itself; Loach deals with the original breakup, resulting in the first two iterations the IRA, drawing a parallel with the story of two brothers who feel compelled to put ideology before family because each is convinced they bleed greener than the other.\r\n\r\nIt is said that history repeats itself; first as a tragedy, then as a farce. TWTStB follows this pattern, except that in the end the farce ends up being even more tragic than the tragedy. The first half of the film takes place during the Irish War of Independence, a guerrilla war waged between 1919 and 1921 between the IRA and the British occupation forces in Ireland (which included Irish Unionists and Protestants, in contrast to Catholic Republicans).\r\n\r\nThe second part takes place during the Irish Civil War (1922-1923) which immediately followed the Anglo-Irish Treaty which resulted in the creation of the Irish Free State. Many of those who fought on both sides of the conflict had been members of the IRA during the War of Independence. The bitter irony is that an English character more or less foretells this when he says: \"God save Ireland if ever the [Irish republicans] take control.\"\r\n\r\nI'm making it sound like a history class, but TWTStB is far from it; indeed, there is a lesson here, but it is a timeless and universal moral about the fratricidal nature of all wars. Loach and Laverty make their protagonists, Damien (Murphy) and Teddy O'Donovan (Pádraic Delaney) biological brothers to emphasize that all men — Irish and Irish, or even, why not, Irish and English — are brothers and, as As Donne said, \"the death of any man diminishes me\" because \"no man is an island.\"\r\n\r\nNow, just because their characters are symbolic archetypes doesn't mean that Murphy and Delaney just stand there holding signs that say \"Cain\" and \"Abel\"; the former in particular turns in a performance in which we can find shades of Peter O'Toole in Lawrence of Arabia.", "created_at": "2022-09-03T16:43:48.777Z"}, {"movie_id": 1116, "review_id": "641fd6f853466100cd3fefe8", "author_rating": 6.0, "review_text": "Though quite provocative, I was really disappointed with the anti-British simplicity of this drama. It all centres around two brothers - \"Teddy\" (Pádraic Delaney) and \"Damien\" (Cillian Murphy) and the increasingly desperate - and violent - tactics they employed to eject the occupiers from their country. The latter man is not an instant convert to these activities. About to travel to the UK to be a doctor, it's the thuggish squaddies' brutality that convinces him to stay and join his local IRA branch to fight fire with fire. His war-weary brother, on the other hand, is gradually appreciating the stale-mate nature of the predicament and when a settlement is reached between Dublin and London for the \"Irish Free State\" we find that these siblings are no longer quite on the same side and the conflict turns in on itself. It's not that the British behaved well here, they certainly did not - but the film lacks a key British character to put forward their position. The odious position of Empire, sure, but what, also, of the aspirations of those of a great many Unionists who wanted the status quo and who wanted no truck with the (socialist) republicanism being proposed by \"Damien\" et al. Again, you can see so much of director Ken Loach's own political persuasion here that he makes no attempt to balance or explain the position from the opposing side, and after a while I found it became a bit of a pontificating rant of a film that illustrated well that expression about one man's terrorist being another's freedom fighter. The then all powerful Catholic church has virtually no role at all here. It's beautifully shot and there are plenty of solid and characterful supporting roles, but no - it could have been better had the director been more interested in offering us more of a objective history rather than his own version of history.", "created_at": "2023-03-26T05:24:08.611Z"}]