[{"movie_id": 953, "review_id": "64ac5c94b686b9010e0d2f16", "author_rating": 8.0, "review_text": "A surprisingly good and very funny movie. I laughed throughout this movie. Great family movie.", "created_at": "2023-07-10T19:31:32.287Z"}, {"movie_id": 953, "review_id": "65474637fd4f800101b6210c", "author_rating": 7.0, "review_text": "\"Alex\" the lion is quite literally king of the castle at the Central Park zoo in New York. He even has his own, built in, tanning machine. His pals, though - well they are not so enamoured of the place. After an encounter with the penguins doing their best to tunnel to Antarctica, \"Marty\" the zebra yearns for the wild and decides the best he can do is a train to Connecticut. When his friends discover that he has done a bunk, \"Gloria\" (the hippo), \"Melman\" (the giraffe) and \"Alex\" set off in hot pursuit. They don't get very far but inadvertently they do get their wish - the humans decide that these creatures should be free and so off they are shipped. En route, the pesky penguins realise that Africa is no use to them so they commandeer the ship and divert it to chillier climes. Not before, however, the crates carrying our intrepid travellers topple overboard and end up on the island of Madagascar. There they discover the population of lemurs ruled with a rod of lettuce by \"King Julius\" and terrorised by the local foussa (think very small lions). Of course when we hear the animals speak, we hear words. When the other creatures hear \"Alex\" it is a mighty roar - just what the lemurs need to keep their foes at bay. Will the visitors settle in, or miss their home comforts and want to head back home? Will their more natural instincts start to kick in and start to test the strength of their friendships? Although there is, for me at any rate, just way too much relentless dialogue - especially from the giraffe and the zebra, this is a fun family adventure with loads of action, some enjoyable pith from quite a witty and observational script and, of course, we have the message for all to adhere to about loyalty and friendship etc... The jungle animations are fun and there are not too many songs to clutter up the steady pace of the proceedings. Makes you wonder just how many animals in a zoo would actually want to be repatriated to the wild (assuming they were ever there in the first place!) to fend for themselves!", "created_at": "2023-11-05T07:37:27.424Z"}]