[{"movie_id": 661374, "review_id": "631e453a9c24fc0091e28b57", "author_rating": null, "review_text": "While the first **Knives Out** is undoubtedly more eerie and traditional when viewed alongside other murder mysteries, the modernity (both politically, and just through the characters and humour) is what makes this so dynamic, and so, so, great.\r\n\r\nDespite the already immense cast in the first production, this time around it still manages to feel so much grander. When actors like Ethan Hawke, Natasha Lyonne and Hugh Grant make mere cameos throughout, it just puts even more excitement into an already electrifying crowd. And each member of that crowd is amazing. The highlighting performances unsurprisingly include Daniel Craig, but Janelle Monet very well might take the cake. She completely surprised me and ended up bringing more to the film than anyone else, way more exuberant than I have ever seen her. Additionally, Kate Hudson and Dave Bautista were both so much fun, Norton was hilarious, and despite not having the largest role Madelyn Cline was really excellent too. The only two that I can't say I was the biggest fan of were Leslie Odom Jr. and Kathryn Hahn. Neither were exceptionally bad or anything, rather just a bit boring with the fact that they were two pretty large roles and not a lot of energy came from either of them.\r\n\r\nEven though the cast is the main attraction, the editing is also fantastic. Great use of split screens, timeline jumps, and just overall creativity too. \r\n\r\nAll in all, it's one of the most entertaining mysteries in a while, and a new highlight of the year for sure. I am not usually fond of franchises but when Johnson announced during the Q&A that he had the intention on making countless more of these I became quite excited. See this as soon as you can because it is actually brilliant.", "created_at": "2022-09-11T20:29:46.719Z"}, {"movie_id": 661374, "review_id": "6388f9e19512e1007cadc208", "author_rating": 8.0, "review_text": "_Glass Onion: A Knives Out Mystery_ is a lighthearted murder mystery filled with effective comedy, fantastic performances, and a somewhat predictable plot.\r\n\r\nOverall, I had a great time with this film and the theater experience was one of my favorites of the year. The plot is somewhat similar to the first, a murder happens and Benolt Blanc is there to solve it. It hits all the familiar beats but does not work quite as well as its predecessor, this is mainly due to the characters. The performances were great and they work well in isolation from the overarching story, but all of them are such over-the-top caricatures that are hard to believe their connections or motivations to kill. Their banter with each other is charming and funny and helps carry this movie forward.\r\n\r\nThe first quarter of this movie was pretty poorly done. A lot of the setup had pandemic references and humor that felt really out of place in 2022. So many movies before this have touched on those topics that it felt overdone and boring. Really interesting choice for this type of film, but once the characters get to the island all of that awkward setup is left on the mainland and the movie starts to find its footing.\r\n\r\nFrom this point forward, I had a great time. Daniel Craig was fantastic as Benolt Blanc and it was quite funny to see him as a fish out of water surrounded by corporate elites. The majority of the lines I laughed at were delivered by him with a dry pan sense of delivery. It was organic and played well on screen. Edward Norton was a fantastic addition and the majority of the cast did excellently. They were really funny and delivered the stereotyped character performances well.\r\n\r\nMuch like the beginning of the movie, the last ten minutes did not work tremendously well for me. It was quite corny, over the top, and unrealistic. It diminishes the greatness of the middle of the film.\r\n\r\nEven though this movie fails to reach the heights of the original, it does enough to deliver a very entertaining mystery that I thoroughly enjoyed. It is a shame that Netflix is only having a limited release for this film because it is best in a crowded theater on the silver screen.\r\n\r\n**Score:** _77%_ | \r\n**Verdict:** _Great_", "created_at": "2022-12-01T19:00:49.402Z"}, {"movie_id": 661374, "review_id": "638b35098a84d2008478f2b3", "author_rating": 7.0, "review_text": "Daniel Craig rather engagingly reprises his role as the \"Poirot\"-esque \"Benoit Blanc\" in this fairly unashamed rip-off of all things Agatha Christie. He finds himself an unexpected guest of billionaire \"Bron\" (Edward Norton) on his beautiful Greek island, amongst a slew of other notables who - of course - each have an axe to grind with this outwardly affable host. The purpose of the get-together is a traditional murder mystery, and after an hearty dinner, it will fall on the other guests to discover who has murdered \"Bron\". Well, that's the plan anyway - but of course it doesn't take long for all of that to be derailed and for us to become embroiled in lots of concentric plots and tales of betrayal and duplicity that will truly test the mettle of our sleuth and the audience. The assembled cast provide for a myriad of characterisations and as we discover, an equally fertile source for suspicion and comedy. Kate Hudson is good fun as the nice-but-dim \"Birdie\"; Dave Bautista keeps more than you'd think is his budgie-smugglers and Jackie Hoffman steals the show in the very few scenes she graces as his non-nonsense mother. The writing delivers a multi-layered feast - some of it basic and bawdy, some more sophisticated as the story gradually progresses towards a conclusion that navigates the red herrings before a denouement that wasn't quite what I was expecting. It looks really good, and it takes a swing at just about everything from corporate greed, vanity, vacuousness and stupidity - but it does it in a satisfyingly subtle fashion. Though rather slow to get off the ground, once it gets up and running it's a good watch.", "created_at": "2022-12-03T11:37:45.312Z"}, {"movie_id": 661374, "review_id": "63a65b2dfe077a00ae5eff57", "author_rating": 7.0, "review_text": "**Glass Onion lives up to the expectations and spirit established by Knives Out but doesn't bring anything new to a growing franchise.**\r\n\r\nGlass Onion is a fun follow-up to Knives Out that captures all the character and energy of its predecessor. While I enjoyed the original more, Glass Onion was still very entertaining. The powerhouse cast ensured that every character exploded to life through the excellent portrayals of Glass Onion's brilliantly chosen stars. Each role felt tailor-made to the actor cast for it. The group of entitled celebrities felt more wild and uncontrollable than the frustrated family of Knives Out, which raised Glass Onion's peril and unpredictability. Glass Onion brilliantly hid clues throughout the film that reveal the murderer if the audience is paying attention. It's a great whodunit, but I would like more development of Daniel Craig's Benoit Blanc. His character didn't get much more backstory or growth over the last film and even felt sidelined for the movie's second half. I wanted just a little more for Blanc, but I look forward to the next installment of this fantasy franchise.", "created_at": "2022-12-24T01:51:41.352Z"}, {"movie_id": 661374, "review_id": "63ab23a0c56d2d00d840cc1c", "author_rating": 8.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2022-edition/\r\n\r\n\"Glass Onion: A Knives Out Mystery would never disappoint. Rian Johnson succeeds, once again, with his clever, witty humor and continuous entertainment throughout just over two hours of yet another whodunnit classic with tremendous replay value.\r\n\r\nThe central mystery holds countless twists and turns, almost always captivating and amusing. Exceptional performances from a shockingly talented cast - Daniel Craig and Janelle Monáe are the standouts - elevate a screenplay slightly lacking in character depth as well as better control over its clear yet repetitive message concerning opportunism, vanity, and hypocrisy.\r\n\r\nOriginal remains supreme, but this sequel deserved a worldwide premiere on the big screen.\"\r\n\r\nRating: B+", "created_at": "2022-12-27T16:56:00.206Z"}, {"movie_id": 661374, "review_id": "63b10c881d1bf400a71c40a7", "author_rating": 9.0, "review_text": "Brilliant!\r\n\r\nMy first film of 2023, which has started with a bang! I adore the original film from 2019 so was expecting big things from this sequel and I'm glad to note that it didn't disappoint - it's a cracker. I did, admittedly, predict the general gist of what was going to happen, though (in this case, minor) predictability doesn't always equel badness - like here, I was thoroughly entertained no matter what.\r\n\r\nThe cast from the first film are better, though those that star in this 2022 release are excellent. Daniel Craig is, of course, superb as Benoit Blanc once again, every single moment with him is terrific. Janelle Monáe also gives a fantastic performance, I predominantly know of her from music but with this, and <em>'<a href=\"https://letterboxd.com/film/hidden-figures/\">Hidden Figures</a>'</em>, she can certainly act too.\r\n\r\nKate Hudson, Dave Bautista and Edward Norton are the best of the others, though even the likes of Kathryn Hahn, Leslie Odom Jr. and Madelyn Cline are good value as well. Like its predecessor, it's very astutely cast.\r\n\r\nThe film is put together in high quality fashion, Rian Johnson & Co. did a great job - particularly with the framing of certain shots, as well as the music which is real neat. As you'd expect for a film of this sort, there are some nice little details spread across the well utilised run time. Like <em>'Knives Out'</em>, I know I'll be revisiting <em>'Glass Onion: A Knives Out Mystery'</em> when possible.\r\n\r\nIt sounds like Johnson and Craig are up for making more of these, and to that I say bring it on!", "created_at": "2023-01-01T04:31:04.450Z"}, {"movie_id": 661374, "review_id": "63be1176f8595800f7202126", "author_rating": 8.0, "review_text": "As with the first Knives Out movie, I found the plot to be clever and intricate and the story very well told. There were a few interesting plot twists and, even though the dialogue could have been more witty, it was intelligent and realistic.\r\n\r\nI did find that the Renoir character reminded me of an Agatha Christie character, in that he reeled off suppositions he’d made based on information we hadn’t been given full access to. Also, he owed some of his success to a character who he asked to take a snoop around, and she proceeded to be in several spots just in time to hear critical details. Pretty lucky. Then again. I write novels in my spare time and the subtitle of one of them is “The Consequences of Coincidences.” And it features a few of them, so I guess I shouldn’t begrudge a few juicy coincidences in someone else’s work.\r\n\r\nUltimately the movie was enjoyable and smart, and that is the most important thing.", "created_at": "2023-01-11T01:31:34.449Z"}, {"movie_id": 661374, "review_id": "63c1a8e8a5743d007d11e5af", "author_rating": 1.0, "review_text": "What's great about this is that within the first minute or so of meeting every cast member you are told who they are and what their motivation is...\r\n\r\n... so it leaves out the tedious who done it guess work of murder mysteries.\r\n\r\nAnd you are told almost from the start who the killer is and what his motivation is..\r\n\r\n... so you don't have the tedious guess work there either.\r\n\r\nBut to keep you on your toes scenes are conveniently rewritten several ways to make it seem like a mystery even though the mystery aspect has been conveniently taken out for today's low IQ audiences.\r\n\r\nThe viewer conveniently doesn't have to uncover anything, nor try to determine any motivation, and all the clues are obvious and handed to you by virtue of Bond stumbling onto them in a way that leaves the viewer in no doubt despite already knowing who the killer is and what his motivation was.\r\n\r\nBut it's Johnson so people can pretend to be intelligent by claiming that he diverted expectations of a murder mystery by taking all the thought and mystery out of it and leaving you with the obvious that has been obviously stated for today's modern audience.\r\n\r\nBut, it does hit all the political check boxes... the ones that literally every other title hits per mandate of cancel culture... So the faux intellectuals can further proclaim how smart and original it is while having it nicely fit into the same box as everything else.", "created_at": "2023-01-13T18:54:32.479Z"}, {"movie_id": 661374, "review_id": "63c3c45d0231f2008a512a8c", "author_rating": 4.5, "review_text": "Almost everything is already told and you know who the killer is. \r\nMoreover: I hate when they put Covid into movies. We already lived two years full of stupid restrictions, and this film is like if it's trying to say:\"ehy, be a good ship and do as it's told you to do\", all this topped off with Google and Apple advertising.", "created_at": "2023-01-15T09:16:13.112Z"}, {"movie_id": 661374, "review_id": "63d285a066ae4d009e9ec236", "author_rating": 8.0, "review_text": "“Glass Onion: A Knives out Mystery” is a thoroughly entertaining, well crafted, thrilling step up from its predecessor “ Knives Out” \r\n\r\nBenoit Blanc ( Daniel Craig ) returns as the World Famous detective who unintentionally has been invited to a private island by the host of a murder mystery party, Myles Bronn ( Edward Norton) There is palpable tension within the select group of party guests well before proceedings begin, but after a real murder Benoit Blanc is called upon to solve the case. \r\n\r\nWithout giving anything away, “Glass Onion” twists and turns as it builds to both a fascinating and hilarious whodunnit while exploring themes of class and privilege. Daniel Craig gives an hilarious performance as The detective with Edward Norton giving an equally strong performance as the manipulative Elon Musk esc character.\r\n\r\n“Glass Onion” provides surprises, suspense and laughs in equal measure, delivering a fast paced comic mystery. With a well known cast and a few notable cameos, including the late Angela Lansbury as one of Benoit Blanc’s zoom quiz friends group , “Glass Onion” delivers everything anyone could desire from a film like this.", "created_at": "2023-01-26T13:52:32.379Z"}, {"movie_id": 661374, "review_id": "63d30fc1cb71b800a10d8e5b", "author_rating": 7.0, "review_text": "There's nothing spectacularly brilliant about the film, except that the mystery is a pure pleasure to watch. The cast and technical aspects are great. And while the film is dedicated, for one, to Angela Lansbury (author of long-running Murder She Wrote) the detective here is clearly Dame Agatha Christie's. The closing credits also say that it's dedicated to Stephen Sondheim whose connection escapes me, other than he died just before the film was made, and perhaps too, that his music is typically complicated layers - like onions.", "created_at": "2023-01-26T23:41:53.453Z"}, {"movie_id": 661374, "review_id": "65149aed1db65d011d1e7d26", "author_rating": 4.0, "review_text": "**A childish scenario that prevented me from participating in determining who the killer was?**\r\n\r\nThe first part was dazzling and surprising for those who watched the movie and the fans of movie type of: Who is the killer? The first part presented a group of well-known stars in a different format than the roles they played in previous acting works.\r\n\r\nIn the second part, I face many challenges: Will the second part be better than the first part, or at least equal to it? Secondly, yes it presents us with a group of stars with beautiful charisma on the screen.\r\n\r\nThis time, the events of the film take place during the pandemic. This time, the main investigator, the hero of the story, is facing deadly boredom due to him staying at home all the time due to the pandemic and the lockdown. This is what drives him, without hesitation, to participate in one of the games organized by a rich person. This game is to solve a crime, hypothetically a crime that didn't happen in reality. This invitation reaches the investigator and some close friends of this rich person, but during their arrival to the place of the invitation, we begin to discover many mysterious things.\r\n\r\nThe first is how the friends get to know each other. Each character is completely different from the other character, a rich person, a YouTuber model, a scientist, in addition to a political figure and an investigator. We begin to discover, by starting the conversation from the beginning, that there is a suspicious or unhealthy past for each character, but the most important thing is that it is far from the game and the hypothetical investigation. We begin to discover real crimes in the place of Al-Daghwa, and now everyone is a suspect, and through the story we will learn who the culprit is.\r\n\r\nYes, I am almost certain that the characters of the second part will continue on the same path as the movie of the first part. What I did not like about this movie. Yes, they showed us the motives and reasons, but I could not get behind any motive in them, and in these types of stories, the most beautiful thing is that it shows that you made a mistake about who the murderer is, not Only in deceiving you, but showing you that your deductions were wrong, makes you doubt one or two or three people, and in the end you discover that all your doubts were wrong. In this part, I was not able to doubt anyone.\r\n\r\nYes, it is true, there are many good plots in the scenario, and there is good manipulation, but I cannot be certain that I doubt any character, as if I was waiting and seeing the events for the vision to appear. I could not participate in the game, which is very important in this type of movie. In addition to clarifying things, there were many coincidences to the point of being so ridiculous. The only reason some mysteries and some indicators were discovered is that the character, for some reason, was present at the right time and the right place without any actual intelligence to find the information.\r\n\r\nI don't know. I feel that my feelings were confused towards the end of the movie. I would almost describe it as childish ending. the actions of some characters led to the flattening of this movie. The first part was so amazing that it cannot be described.", "created_at": "2023-09-27T21:13:17.297Z"}]