[{"movie_id": 284052, "review_id": "581bbdbbc3a36805c60001f1", "author_rating": null, "review_text": "With each new Marvel film one could expect the studio to push the limits of what a superhero film should consist of. Films such as Captain America: Winter Solider, Guardians of the Galaxy and Ant-Man all consisted of elements that we have never seen within a superhero film before. Now, Marvel Studios attempts to push the envelop once more by leaving the world of high tech armors and super soldiers and entering the mystical world of magic. Leading this charge is Benedict Cumberbatch's Doctor Stephen Strange and hopefully he could answer why there is this strange mystical feeling that we have seen this all before.\r\n\r\n\r\n\r\n> From Marvel comes “Doctor Strange,” the story of world-famous neurosurgeon Dr. Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place—a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a center for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange—armed with newly acquired magical powers—is forced to choose whether to return to his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.\r\n\r\nI am going to start off the review by discussing the only strong positive thing that came out of Doctor Strange and its by far the visuals. Beautiful vibrant colors pop at you throughout the film, the costume design is beyond extravagant and the framing is spot on. Doctor Strange and his fellow Sorcerers Supremes powers aren't fully on display until they enter the Mirror Dimension and my god, Tony Stark and Bruce Banner would hate this place. As they are men of science, they would hate that all rules of physics are thrown out the window as our Sorcerers Supremes are capable of breaking buildings apart and reforming to however they please. It is hard to not reference Inception but no one here is dreaming, these visuals are being created by the hand of mystical men and they use it to their power.\r\n\r\nIn all honestly, pushing the envelope when it comes to visuals was not a difficult task at all. Heck, if they didn't I would have been extremely disappointed as it was an obvious opportunity to take advantage of since we are dealing with magic. I am still extremely disappointed regardless as director Scott Derrickson completely missed another obvious opportunity to push the envelope this time in regards of character development.\r\n\r\nDoctor Stephen Strange is very much like a Tony Stark and other superheroes we have seen in films before as he is arrogant, egoistical and full of it. After Strange's accident in which he suffered extreme nerve damage to both hands, he dishes out every penny to his name to repair his hands in hopes he could continue his career as neurosurgeon. Every attempt fails and Strange becomes desperate enough to head to Nepal and finds himself under the guidance of Tilda Swinton's The Ancient One. Learning a whole new concept in the mystic arts forces Strange to reshape his way of thinking but Scott Derrickson does not let this have Strange reshape who he is as a person as well.\r\n\r\nDoctor Strange should have found himself being more like a Steve Rogers towards the end of the film as learning the mystic arts and his accident alone should have broken his ego. But instead everything still comes easy to him as he masters magic with ease with very little tension. He has a couple hiccups in the beginning but once The Ancient One puts him under her wing it is smooth sailing and Strange is stealing texts, wielding powerful weapons and defeating Supremes with decades of training with ease.\r\n\r\nYou cannot say that Strange was destined for the mystic arts and that is why everything came so easy for him. Strange is only learning the mystic arts due to circumstance. If he doesn't get into an accident, which happened to him due to being careless, he doesn't find himself in Nepal. Harry Potter was destined for magic, not Strange. Strange fails to grow as a character because he continues to be proven right and no consequences seem to happen due to his actions.\r\n\r\nIt is hard to get into the character development of our supporting characters Benedict Wong's Wong and Chiwetel Ejiofor's Mordo as I would utterly spoil the film for you. All I would say though is that they were both mishandled and deserved better developments. It is a shame too because Wong and Ejiofor are superb actors but wasting talent is something Marvel Studios is used to.\r\n\r\nWhen will Marvel Studios get a villain right?  With Mads Mikkelsen playing our lead villain, Kaecilius, I thought we might finally get a cinematic Marvel villain that is on par to Killgrave and Kingpin over at Marvel's television department. Ultimately, Kaecilius and Doctor Strange end up fighting due to the most silliest cliche: being at the wrong place at the wrong time. The two individuals meet at the New York Sanctum Sanctorum in which Strange accidentally gets blown in to. Kaecilius is there to kill the protector and Sanctum Sanctorum itself and has no knowledge of who Strange is. In fact, he honestly believes Strange's name is in fact \"Mister Doctor.\" Still learning his craft, Strange is capable of putting up a better fight than the protector who should be a matter. I mean, he is a protector after all. There are no stakes for Strange, strange.\r\n\r\nVisually appealing could only get you so far as Doctor Strange fails to focus on the development of their characters that they made so appealing to the eye. Doctor Strange will become a huge asset to the Marvel Cinematic Universe and lets hope we see the rest of Strange's development when he casts his next spell. There is so much untapped potential in Strange's character, we just haven't seen the best of him yet.", "created_at": "2016-11-03T22:44:11.348Z"}, {"movie_id": 284052, "review_id": "581e7bad9251410a0e01146e", "author_rating": null, "review_text": "All continues to be well in the Marvel Comics Universe as the film adaptation of another mischievous and majestic superhero from Stan Lee’s printed page empire emerges and reigns supreme on the big screen. The latest cure from the Marvel movie bag of explosive tricks is the entry of the dazzling and decorative **Doctor Strange**. Armed with a collection of notable performers, a convincing colorful scope of visual vibrancy and a hearty touch of spiritual and reflective potency the spellbinding **Doctor Strange** is an engaging and oddly sophisticated action-oriented comic book fantasy adding imaginative flavor to the typical escapist gem from the Marvel stable of powered personalities.\r\n\r\nSome may argue that **Doctor Strange** is merely another conveyor belt cinematic comics confection that follows a safe and similar makeup that constitutes the obligatory Marvel Comics movie foundation–excitable weirdness, overly splashes of wayward whimsy, copious characterizations attached to their brand of eccentric grandeur and larger-than-life gestures of dark and devious exploits grounded in the basic landscape of good versus evil. Listen, sometimes traveling down the conventional path of constructed and adventurous Marvel-made spectacles is not necessarily a bad thing to consider. After all, the well-known and more popular superhero icons such as _Spider-Man_, _The Incredible Hulk_, _Iron Man_, _The Avengers_, and _The X-Men_ for instance seem to benefit nicely from the anticipated formula that routinely delivers the entertaining goods for its avid core of fanboys. So why not wipe off the seemingly obscure and underrated **Doctor Strange** and provide the same kind of popcorn-pulsating mystique for blockbuster cinema?\r\n\r\n**Doctor Strange** started out as a comic book creation in 1963 by Steve Ditko and Stan Lee. Director Scott Derrickson (“Paradise Lost”, “The Exorcism of Emily Rose”, “Sinister”, “Deliver Us From Evil”) does an admirable job in giving shades of bizarre brilliance and magical manipulation to an unconventional Marvel comic book character hardly known for his capacity to translate his mystical mastery to celluloid with compelling curiosity. Derrickson, known primarily for his creative juices in the realm of horror fantasies, confidently serves up the off-kilter and hypnotic appeal of Dr. Stephen Strange as embodied by accomplished English actor Benedict Cumberbatch (“Black Mass”, “The Imitation Game”, “12 Years a Slave”). Interestingly, Derrickson and his handful of screenwriters craft **Doctor Strange** with a mind-blowing measurement of restraint and inquisitiveness. Indeed, **Doctor Strange** echoes its contemporary Marvel-established movies with predictable pluckiness to a certain extent but what is appreciated more is the uniqueness of the film’s ability to emphasize a cerebral superhero that is cut out of a different kind of creative cloth which feels quite distinctive from other brooding Marvel mavericks. Cumberbatch–mastering a rather effective American-accented sorcerer with skill–has injected a degree of inventive nobility and refinement that uplifts this calculating comic-book fantasy.\r\n\r\nCumberbatch’s egotistical Stephen Strange is an incredibly gifted neurosurgeon. His hands are truly miraculous tools of his medical trade and he takes pride in his abilities to treat the critical patients that have tremendous hope courtesy of his therapeutic capabilities. In a nutshell, Strange outshines his other surgical competitors because he is able to give to his patients on the operating table something other doctors cannot instantly muster up. However, cruel fate strikes its ugly head when Strange suffers the usage of his precious hands as a result of a horrific car wreck. The nerves in his hands are destroyed and the non-functioning of his limbs is an awful reminder that his surgical talents are something of the immediate past.\r\n\r\nAs Strange delves into self-pity and surfacing depression he cannot see just how supportive his fellow physician Christine Palmer (Rachel McAdam) is toward him. Clearly, Christine is in love with the alienating medical moper but Strange simply does not realize the extent of her affections because he is too busy sulking about his misfortune. The only factor that gets a promising rise out of Strange is his recent acknowledgement of the Tibetan community where there is a Kamar-Taj temple rumored to restore ailing body parts destined to make an individual “whole” and “complete” once again. Naturally, Strange wants to bypass the tedious and lengthy therapy sessions for a chance to experience the miracle of his once-amazing operating digits now ravaged by severe nerve damage.\r\n\r\nThe main source behind the Kamar-Taj temple’s heralded existence is The Ancient One (played by Tilda Swinton). She is instrumental in teaching the fundamentals of a selected Eastern mysticism that teaches the special concentration of healing the wounded and wasting human body when scientific medical practices fail to do so. Soon, Strange’s affiliation with The Ancient One and her mystical minions has more than a transfixing effect on gaining control of his ailing hands as he gains indescribable powers through the inner strength of mind and soul. Now, Dr. Strange can generate his own alternating state of philosophical wizardry that dictates shaping time and space dimensions. Strange’s out-of-body experiences supersede all his previous physical impairments as a force to be reckoned with at large. Whether observing Strange’s Cloak of Levitation methods or witnessing his supernatural prowess on the mean streets against wickedness Doctor Strange spins a wild and weird web of action-packed surrealism that is a welcomed addition to Marvel Comics’ showcasing of super-heroic protective cads feisty in flaws and frivolity.\r\n\r\nCumberbatch is mesmerizing as the self-absorbed genius Strange who perhaps is the best complex Marvel-related protagonist since Robert Downey Jr.’s flippant Tony Stark/Iron Man. The combination of heightened arrogance and high-brow self-doubt and vulnerability tactically works as Cumberbatch sells this portrayal solidly. Although Swinton’s The Ancient One is an intriguing enigma in her own right one must question why the absence of an Asian actor not considered for this particular role may have some scratching their heads in indignation? McAdam’s love interest Christine amounts to only being an afterthought not just in the eyes of her object of affection Strange but to the audience as well.\r\n\r\nThankfully, the other supporting players contribute marvelously to the festivities. Oscar nominee Chiwetel Ejiofor (Cumberbatch’s co-star from the Academy Award-winning “12 Years a Slave”) plays fellow sorcerer Mordo while Benedict Wong assumes the duty as another one of The Ancient One’s followers who guards the school’s sacred scriptures. Mads Mikkelsen is devilishly received as Kaecilius, the former disciple of The Ancient One gone rogue whose agenda in releasing an ominous demon Dormammu to the world will test the will of Doc Strange’s newfound mystical techniques and tactics.\r\n\r\nNo doubt that **Doctor Strange** is an impeccably surging superhero fable laced with stunning aesthetics and a richly robust score by Michael Giachinno. The high caliber of talent associated with this spry comic book actioner definitely ensures another superhero film franchise-in-the-making as Cumberbatch’s introspective doc administers his **Strange** dosage of Marvel movie-making medicine for the ages.\r\n\r\n**Doctor Strange** (2016)\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs. 10 mins.\r\n\r\nStarring: Benedict Cumberbatch, Tilda Swinton, Chiwetel Ejiofor, Mads Mikkelsen, Rachel McAdam, Benedict Wong, Benjamin Bratt\r\n\r\nDirected by: Scott Derrickson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction & Fantasy/Action & Adventures/Comic Book Fable\r\n\r\nCritic’s rating: *** 1/2 (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-11-06T00:39:09.902Z"}, {"movie_id": 284052, "review_id": "582540379251417b2c0033e2", "author_rating": 7.0, "review_text": "Though the core events may not be anything new for the MCU, particularly in so far as its origin stories go (Stephen Strange's A-to-B is virtually identical to Tony Stark's in the first _Iron Man_ film) the psychedelic filter through which we experience these events is entirely fresh!\r\n\r\nNot all of the humour lands, and in fact sometimes actually detracts from the story. While the effects are very impressive from a conceptual angle, the graphical end-products do sometimes fall short. Benedict Cumberbatch is a fantastic actor, and does a fine job as Doctor Strange, virtually the whole cast are proven actors, but none are really given the chance to flex those acting muscles to any sort of a newly impressive degree.\r\n\r\nThose minor nitpicks aside, _Doctor Strange_ is another very successful entry to the MCU, just further proving that Marvel really know what they're doing in this latest form the film industry has taken.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-11-11T03:51:19.208Z"}, {"movie_id": 284052, "review_id": "58ab3bdec3a36849fe0001bd", "author_rating": null, "review_text": "I will begin this by saying I was hyped about this film since it was announced because I was always attracted to magic and the supernatural and Doctor Strange is one of my favorite Marvel superheroes.\r\n PLOT:A simple enough story,a brilliant surgeon's journey from the peak of his career to a ruined man,incapacitated due to an accident.Losing all his money in an attempt to heal his hands,he finds out about a mysterious healer in a place called Kamar-Taj.With his last dollars, he gets a one-way ticket to Nepal to find this place and is introduced like so into a whole new world.He has an affinity for what he discovers to be called \"The Mystic Arts\".He learns and develops quickly but is thrown into a fight with the one who would become his first nemesis, Kaelcilius,too soon.He is almost killed but with the help of his ex-fiancée,Dr. Christine Palmer(who operates on him) he is saved and returns to the Sanctum Sanctorum.He tries to stop Kaelcilius but needs to be rescued again by his teacher,who is killed and leaves him with a valuable lesson.To finally defeated the Zealots he bargains with their boss,catching him into a time loop for all eternity if he does not call his servants off and sets everything right.In the end his ex-friend and mentor,Mordo goes on a quest of finding himself and ends up becoming a sorcerer murderer. \r\nCharacters: \r\n1)Dr.Stephen Strange:Benedict portrays him amazingly and is always on point with the character.I liked his journey and how he changed and grew to see that he is just a tiny bit of an infinite multiverse.He was pretty good using magic and I hope he will develop quicker to the Sorcerer Supreme. \r\n2)The Ancient One:My favorite character in the movie.She is a wise teacher,has the best quotes,best battle scenes,best entrances and an amazing battle costume.I loved how even she was aware that for higher goals she needed to cross the line and do things she teaches against and also isn't proud of. \r\n3)Kaelcilius:A tragedy of love brought him to Kamar-Taj where he ascended to the rank of master.Tired of following The Ancient One and still haunted by the death of his loved he seeks to stop time,to give his new teacher,Dormammu our world.Mads was amazing in the role,his whole ideology of time as the enemy of humans and them longing for eternity is interesting and really on point.He briefly achieved his goal,a shame he became a mindless one. \r\n4)Karl Mordo:Another prominent student,who doesn't ask questions,doesn't contradict and is pretty adamant about trust and has lots of issues with bending the rules.He was very disappointing and boring and his only interesting feat was that he became a villain. \r\n5)Wong:Decent but underused character,he will surely be seen a lot in the later movies as Strange's right hand. \r\nMagic:We are introduced to magic as an energy harnessed from various dimensions to create things of need,to conjure spells.An interesting take on such a vague but intriguing subject. \r\nPost-Credit Scenes:\r\n 1)Thor scene:takes place in 2017 with Thor asking our Doctor(has gloves,seems more powerful,informed) for help to find his father,trapped on Earth.He accepts with the condition that they would leave our realm as soon as they are reunited. \r\n2)Mordo scene:He went on a quest of getting rid of all the sorcerers of Earth. \r\nOverall:A very decent movie with amazing special effects and super acting.A must see.", "created_at": "2017-02-20T18:56:30.294Z"}, {"movie_id": 284052, "review_id": "58b34248c3a36852a300af85", "author_rating": 8.0, "review_text": "**When a science person was the chosen one in the spiritual world!**\r\n\r\nYou would have not expected it from this director if you had seen his previous films. This was based on the Marvel comics that I haven't touched. So basically I had high expectation to witness another side of Marvel universe with another set of (super)heroes. And surprisingly, it was very entertaining, nothing like other Marvel's heroes/story, except the possession of superpower to fight evil forces.\r\n\r\nFirstly, Benedict Cumberbatch in the lead in a Marvel film, I did not think it would work. All I knew is he was a great sidekick, but that image has changed here. He was wonderful, definitely I'll be looking forward to its sequel as they had confirmed at the end. The theme wise, it is similar to most of the superhero tales, but some new concepts were added to it, I mean the superpower and that's what made it so unique.\r\n\r\nJust like 'Thor', this film as well had taken the spiritual believes only for the basic platform. The rest of the developments are the clear mix of fantasy (illusion) and science. So it means the film is for theists and atheists. I am one of those who did not like 'Inception', which I think an ordinary action film with multiple layers. But this one was so awesome and it is for the people like me who think 'Inception' failed.\r\n\r\nVisually spectacular. I regret missing it out in digital 3D. Its Academy Awards nominee in the category of Best VFX tells the story. There will be a tough contest, even I'm up for 'Jungle Book', but I won't be sad if this wins. The success story of Marvel continues. Not everybody reads comic books, but film goers are the majority. So adaptations like this are people like me. Let them keep coming, I love this format better. This film is not just for the youngsters, but old, families, as well as kids can enjoy, so I hope you won't miss it.\r\n\r\n_8/10_", "created_at": "2017-02-26T21:02:00.192Z"}, {"movie_id": 284052, "review_id": "58ee26d992514168700096e9", "author_rating": 10.0, "review_text": "It is actually quite some time since I watched Doctor Strange but somehow the movie must have slipped between the cracks since I appear to have forgotten to review it. So I am about to remedy that now. To put it in simple terms: This is an excellent movie. It is a wonderful display of magical fireworks with a decent enough story to keep it together.\r\n\r\nI have to confess that I have not really read many of the comics containing Doctor Strange so it is a bit difficult for me to comment on the aspect of the film versus the comics. From the little that I have read I got the impression that the comic book version of Doctor Strange was a wee bit more dark, serious and mature. This movie starts from the beginning of his career though so I guess there is some justification for the less mature Doctor Strange in the movie.\r\n\r\nDoctor Strange is a skilled neurosurgeon but a bit of an asshole. Actually more than “a bit”. He gets involved in a accident, that he pretty much causes himself due to his arrogance. Fast forward to the interesting chapter were we get to see Doctor Strange being, reluctantly, admitted into a scruffy looking monastery on the other side of the planet. That is when the fun starts. Doctor Strange is in for a ride. Slowly Doctor Strange gets knocked into him that magic exists and he is expected to practice it.\r\n\r\nThe time at the monastery, or perhaps we should call it a school, leads to a few funny episodes and I do like the head monk’s bantering with Strange and the way she does things. Talk about getting thrown into the deep end of the swimmingpool first. Strange’s continued arrogance and immaturity is a bit annoying from time to time though. That has to be said.\r\n\r\nWhat is the use of super heroes if there are no bad guys around. So after Strange having trained for a while, and mostly failed miserably, the bad guys starts to crash the party. So no more pretty living room magic for Strange. It is time to go head to head with some serious competition. Unfortunately, for a good chunk of the first fights Strange mostly falls on his arse. They are still cool and beautiful to watch though.\r\n\r\nSlowly Strange starts to get to grip with this whole magic thing and he also starts to shed some of that arrogance of his and take some responsibility. About time since the despicable bad guy are, of course, working towards freeing the real BIG bad guy, father of all evil and mother of everything else bad you can think of. Time for a showdown.\r\n\r\nAs the fighting escalates so does the user of special effects and personally I though the special effects were both beautiful and spectacular. I really liked them.\r\n\r\nI am not sure Cumberbatch would have been my first choice for Doctor Strange though. To me he do not really project the image of the wise and skilled Wizard I expected. He is not bad though. The only other person that stood out for me was the chief monk and The Ancient One which I also quite liked. The rest of the characters, well to me they mostly lived in the shadows of these two, even though they were in general likable and sometimes fun.\r\n\r\nThere were a few rather hilarious parts where Strange has to reveal the truth about what he stepped in to his former girlfriend. I have a soft spot for the surprise moments in both movies and books.\r\n\r\nI rather not get started on time travel since I generally hate it as a story element since it almost always leads to paradoxes or is simply so poorly done that it is blatantly obvious that someone tried to cover up for a lazy and shoddy story. However I guess I have to mention that screwing around with time is an important part of the plot in this movie. Luckily it is done in such a way that it do not, in my opinion, negatively impact the movie. Actually, to my surprise, it is used in a rather cool way.\r\n\r\nSo, bottom line, a movie I liked quite a lot. 5 out 5 stars kind worth of liking.", "created_at": "2017-04-12T13:08:41.990Z"}, {"movie_id": 284052, "review_id": "58fbb562925141642f012f57", "author_rating": 9.0, "review_text": "I thought marvel was going to far with all the releases.I was right about this one,Dr Strange was like Inception on DMT.Far to much CGI!.And for the story it started off in the right direction then it just ended up going STRANGE.All in all worth a look.But nothing special.", "created_at": "2017-04-22T19:56:18.239Z"}, {"movie_id": 284052, "review_id": "5c8425e6c3a36839d4d28156", "author_rating": 7.0, "review_text": "It was only a matter of time before magic and time travel found their way into the MCU, but Doctor Strange is a really well put together origin story on a character that could have been a mess to adapt as a film. Chiwetel Ejiofor, Rachel McAdams, Mads Mikkelsen, along with the Benedicts give the film lots of charisma, but the real star here is the style that Scott Derrickson and his crew were able to create. This is such a cool looking movie, both beautiful to look at and impressively technical.\r\n\r\nLike most Marvel movies, Doctor Strange has a mediocre generic villain, but the characters combined with the visuals still make for a uniquely entertaining experience.", "created_at": "2019-03-09T20:45:26.372Z"}, {"movie_id": 284052, "review_id": "5e20f86b20af77001237b7ac", "author_rating": null, "review_text": "Doctor Strange gave me an Inception vibe with effects that were much on a grander scale. I'm a Nolan fan and even after seeing Dr. Strange, I'm impressed.", "created_at": "2020-01-16T23:57:31.222Z"}, {"movie_id": 284052, "review_id": "5e24a1e85ed8e9001760ad9b", "author_rating": null, "review_text": "This movie might give DCEU a run for their money. Doctor Strange is a personal best for 2016. Great watch!", "created_at": "2020-01-19T18:37:28.733Z"}, {"movie_id": 284052, "review_id": "5e24a6be8f26bc001179b4e3", "author_rating": null, "review_text": "\"Dormammu! I came to bargain! I hear the discounts are out of this dimension!\" Kidding aside, this movie had stunning visuals, I never thought I'd enjoy. Marvel keeps improving their game I hope the other studious are paying attention.", "created_at": "2020-01-19T18:58:06.835Z"}, {"movie_id": 284052, "review_id": "5e24ade0397df000169e6234", "author_rating": null, "review_text": "The quest for self and truth is heavily built into this movie and that's one thing that's innately relatable for all of us. I'm pretty stoked on how Doctor Strange integrates into the Marvel-verse and I am on the edge of my seat for the next Marvel movie! We are not savages.", "created_at": "2020-01-19T19:28:32.956Z"}, {"movie_id": 284052, "review_id": "5e24b788bfeb8b0011d4a8d8", "author_rating": null, "review_text": "Magic always has a cost. The team behind Doctor Strange knew that and never bargained! The visuals and storytelling do me in. This movie is a must-watch whether which side of the universes you're with.", "created_at": "2020-01-19T20:09:44.446Z"}, {"movie_id": 284052, "review_id": "5e24be138f26bc0013796b28", "author_rating": null, "review_text": "Benedict Cumberbatch is one actor who never disappoints. Another iconic character he nailed so well he's embedded Doctor Stephen Strange into the moviegoer's consciousness. Awesome movie!", "created_at": "2020-01-19T20:37:39.610Z"}, {"movie_id": 284052, "review_id": "5e24c75b8f26bc00137977f7", "author_rating": null, "review_text": "I was not prepared for the visuals this movie offered. Nevertheless, I absorbed it in its full glory. It was easy to enjoy this movie not only because of its visuals but also because of the quirkiness and lovable characters. A must-watch!", "created_at": "2020-01-19T21:17:15.328Z"}, {"movie_id": 284052, "review_id": "5e24ccedbfeb8b0011d4cfa0", "author_rating": null, "review_text": "Doctor Strange was a delight to watch. Like the doctor's cape, the dialogues were powerful all while more visual tricks were readied up on the sleeves. Marvel studios worked their magic again with this movie!", "created_at": "2020-01-19T21:41:01.870Z"}, {"movie_id": 284052, "review_id": "5e24d4a6d6c3000013427d93", "author_rating": null, "review_text": "Hats and capes tipped to Scott Derrickson for directing such a great movie! I can't wait for Doctor Strange's next flick as well as his role in the Avengers team! Kudos!!!!!", "created_at": "2020-01-19T22:13:58.198Z"}, {"movie_id": 284052, "review_id": "5e26f4a4c68b6900123d8ff2", "author_rating": null, "review_text": "I loved how they choreographed the scenes in this movie. Action-packed and with visuals that don't let up. Please stay for the post-credit clip.", "created_at": "2020-01-21T12:55:00.245Z"}, {"movie_id": 284052, "review_id": "5e270621168935001634d71a", "author_rating": null, "review_text": "Benedict Cumberbatch's portrayal as Stephen Strange was flawless. The arrogance, the confidence, the humor. He's really into it.", "created_at": "2020-01-21T14:09:37.100Z"}, {"movie_id": 284052, "review_id": "5e2711101685da0013df0a76", "author_rating": null, "review_text": "The optical illusion was psychedelic and mind-blowing! Every time they did that, I'm amazed.", "created_at": "2020-01-21T14:56:16.566Z"}, {"movie_id": 284052, "review_id": "5e290a381685da0013e241a9", "author_rating": null, "review_text": "This movie showed me that talent is not everything. If we got it, let's be humble and give a helping hand to those in need instead of bragging about the things we're good at.", "created_at": "2020-01-23T02:51:36.480Z"}, {"movie_id": 284052, "review_id": "5e29183f98f1f10018f54101", "author_rating": null, "review_text": "The main character's drive to learn and his thirst for knowledge was very compelling. It could make the viewers curious about how skillful he can get.", "created_at": "2020-01-23T03:51:27.992Z"}, {"movie_id": 284052, "review_id": "5f03f14d61bac400359af4d5", "author_rating": 8.0, "review_text": "In my re-viewing of some MCU films (and integral to the events of IW), Doctor Strange was just as much fun and entertaining as the last time. Benedict Cumberbatch more or less plays a similar character as Sherlock but still is perfect as Strange. **3.75/5**", "created_at": "2020-07-07T03:51:41.203Z"}, {"movie_id": 284052, "review_id": "60084354de11e50041321ee8", "author_rating": 7.0, "review_text": "One of my least favourites so far in the MCU. Still a good film, no doubt.\r\n\r\n<em>'Doctor Strange'</em> features a lot of intrigue and lore, which is certainly interesting to see unfold. I just felt a few pacing issues, nothing that frustrated me but it just felt a little slow moving in moments. I still enjoyed it, the story is a pleasant one and all the effects look splendid.\r\n\r\nBenedict Cumberbatch is great in the lead role, I thoroughly enjoyed his performance. Mads Mikkelsen and Tilda Swinton are good in this as well, especially the latter. Chiwetel Ejiofor and Rachel McAdams are likeable in their respective roles, also.\r\n\r\nNot one I love, but it is one I like.", "created_at": "2021-01-20T14:51:00.200Z"}, {"movie_id": 284052, "review_id": "624216ffdfe31d005bc63b57", "author_rating": 7.0, "review_text": "\"Stephen Strange\" (Benedict Cumberbatch) is a brilliant neurosurgeon who is involved in a terrible car accident. Frustrated by his new-found limitations he travels to the Himalayas where he is schooled in the mystic arts by Tilda Swinton. Together with her associate \"Mordo\" (Chiwetel Ejiofor) they must learn to work to thwart the ambitions of \"Kaecilius\" and his henchmen who are serving the powerful \"Dormammu\" who wishes to destroy the three Sanctums on the Earth that protect humanity from his dominance. It does take a while to get going this, and Cumberbatch's accent takes some getting used to, but once the period of initiation and learning is underway, we are presented with a well paced, magical adventure film that marries a decent script with some gorgeous visual effects, a slightly more cerebral storyline and leaves us in no doubt that this is just the first instalment for this developing super-hero. Cumberbatch grows into the role, and Swinton is effective as his slightly ethereal mentor. It comes in at the slightly shorter end of the MCU movies spectrum, and that's a good thing too.", "created_at": "2022-03-28T20:13:51.253Z"}, {"movie_id": 284052, "review_id": "64603836ef8b3200e3ad1f6e", "author_rating": 6.0, "review_text": "There was a lot of cool looking things in this movie and some cool fight scenes. Kind of a boring movie though and a lot of it don't make sense either.", "created_at": "2023-05-14T01:24:06.512Z"}]