[{"movie_id": 508439, "review_id": "5e5d3685357c0000192c1b79", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI always struggle to find reasons to dislike a Pixar film. One of the most annoying preconceived notions about genres is the one about animated movies. \"They're for children, how can you enjoy stuff like that, you're so childish\", people say. Little do they know that animated flicks have as much or more emotionally compelling narratives and characters than live-action films. The score is usually more important in the former genre, and the visuals always look stunning. The partnership Disney-Pixar is probably the best thing that could have happened to Hollywood.\r\n\r\nDan Scanlon delivered a surprisingly good sequel to Monsters Inc. back in 2013 with Monsters University. Making an efficient sequel twelve years after its original is a challenging task, and Scanlon succeed, so I had good expectations going in. Onward might not be one of Pixar's best movies, and I doubt that a lot of people will place it as one of their favorites when comparing with the studio's films of the same type. However, it still carries the trademark emotional narrative with relatable characters that Pixar always delivers.\r\n\r\nI grew up with a father, mother, and two older brothers. Just with this information, I know that I'm luckier than a whole bunch of people all around the world. Onward focuses on the relationship between two siblings (Chris Pratt and Tom Holland), and I love their adventure together. It made me recall my childhood and the awesome moments I shared with my brothers. If you're a fan of Dungeons & Dragons or other quest-based games, the main plot's structure will definitely please you as it did me, but it's connected to my biggest gripe...\r\n\r\nThe concept is pretty neat, but its execution lacks a little bit of more... magic, as ironic as it might be. For example, Frozen II isn't about a \"world full of magic\", but Elsa (Idina Menzel) alone has more magical scenes than Onward in its entirety. In the former, the actual magic feels the screen with stunning animation and chill-inducing music. Onward feels like a diminished version of its true potential. While it's true that the world where the main characters live in has lost its overwhelming magic from the past, their adventure is filled with obstacles which they deal with... you guessed it, magic.\r\n\r\nI don't want to sound like that guy who only wants \"action for the sake of action\". I hate when people dislike a movie simply because they didn't see enough stuff exploding or something. It's a bit about expectations and about what I know Pixar can do. Obviously, I'm expecting more from them now more than ever. It's not that the story isn't interesting or captivating because there's definitely an entertaining vibe throughout the whole runtime. It's well-paced, there's always something going on, and the humor is pitch-perfect. It's GOOD. Simple as that.\r\n\r\nThe voice acting is fantastic. Tom Holland and especially Chris Pratt really incorporate their characters' spirit, and it's almost palpable that the actors had tons of fun behind-the-scenes. Julia Louis-Dreyfus and Octavia Spencer are also quite good, but their characters' respective arcs aren't near as compelling as the primary narrative. Every moment I spent with them is every moment I wanted to go back to the brothers. However, the fun and entertainment never go away. The story never fails to be exciting, it just goes increases and decreases its level ever so slightly.\r\n\r\nI saved the best for last. Even though the second act feels a tad repetitive, the ending is incredibly satisfying. Predictable? Yes. Will it be underwhelming/disappointing for some people? Surely. But it delivers the most beautiful of messages in the most emotional way possible, as Pixar always manages to do. A lot of nice, small morals are learned throughout the story, but the final one is absolutely perfect, and it left some tears in my eyes. The ending is heartfelt and genuine for everyone, but it will have a tremendous impact on families that lost a member way too soon.\r\n\r\nAll in all, the Disney-Pixar's partnership continues to provide the world with the best animated films of each year. Onward is the most recent success, even though it lacks a bit of magic and creativity when compared to the studio's movies of the same genre. Boasting a talented voice cast, the two brothers go on a fun, quest-based adventure that concludes with a wonderful, heartfelt message to every family out there. Some people might find the ending too predictable and underwhelming, but the climax is emotionally powerful, and it will unquestionably cause an impact on everyone (tissues, anyone?). Its second act feels a bit repetitive, but the entertainment never fades away. Hilarious and clever humor, compelling main characters, not-that-interesting secondary characters, and gorgeous animation as always. The end credits song is pretty cool too. Can't wait for Soul...\r\n\r\nRating: B+", "created_at": "2020-03-02T16:38:29.168Z"}, {"movie_id": 508439, "review_id": "5e5f4a42357c0000132f80e0", "author_rating": 7.0, "review_text": "Animation has such an important job. The messages I was talking about earlier are not just intended to teach kids things - we learn from them too. I think that's what made 'Onward' a little disappointing: I didn't come out having learned something new in the context of my adult life. Nonetheless, it's still a lovely allegorical tale that promotes brotherhood, adventure and generosity. Animation's got a big duty of shaping up future generations from a young age, and they can't always deliver the goods for all. With that, I sign off - eagerly awaiting Pixar's next drop where, fingers crossed, I get to discover something new too... don't forget the big kids, Pixar.\r\n- Lily Meek\r\n\r\nRead Lily's full article...\r\nhttps://www.maketheswitch.com.au/article/review-onward-not-the-fairytale-pixar-film-we-wanted", "created_at": "2020-03-04T06:27:14.170Z"}, {"movie_id": 508439, "review_id": "5e6aedae55c926001966fdd6", "author_rating": 8.0, "review_text": "Onward is a family quest that delights (Boom Bastia!) and pulls at your heartstrings along the unpredictable Path of Peril. There is a delicate balance between tear-jerking moments and comic relief that Pixar and Disney have been known to master throughout many of their films. If you can look past the Pixar and Disney blueprint of the missing family member tragedy you’ll find many successful attempts to modernize the film to relate to many ages and families. \r\n\r\nRead the full review at FeaturedAnimation.com.", "created_at": "2020-03-13T02:19:26.798Z"}, {"movie_id": 508439, "review_id": "5e7d5b58fea0d710f5c933bd", "author_rating": 5.0, "review_text": "Unicorns, pixies, elves, and wizards have lost the magic of the past in “Onward,” a formulaic animated adventure from Pixar. Set in a suburban world of fantasy, the film tells the story of two teenage brothers who embark on a quest to find a magic gem that could hold the key to a little familial enchantment.\r\n\r\nIan (Tom Holland) and his older brother Barley (Chris Pratt) are still mourning the death of their father several years ago. Ian was just a baby when he died, and Barley barely has any memories of his dad. When mom (Julia Louis-Dreyfus) gives Ian a gift that his departed pop left for his 16th birthday, it turns out to be a wizard’s staff with instructions for a visitation spell that can bring the patriarch back for one day only. Something goes wrong, and the two siblings must set out on a danger-filled journey to find the missing piece of the puzzle before the sun sets.\r\n\r\nOnscreen adventures are supposed to be exciting, but this one is considerably dull. The story feels very personal yet unfortunately sanitized for broader audience appeal. It works best when the story leans on the theme of reconnecting with your family, especially as the two brothers use their road trip as a way to bond over their differing ways of dealing with grief and regret. It’s poignant, and the film’s sincerity is a heartwarming reminder that we shouldn’t waste what precious time we have left.\r\n\r\nThe movie has a weird “Weekend at Bernie’s” vibe as the two teens drive around in a rock n’ roll van with the bottom half of their reanimated dad in tow. It’s not very funny, and the heavy themes of loss and the meaning of family will likely resonate with those who’ve lost a loved one and still yearn for one more day. It’s a strange film with and unsatisfying ending that doesn’t really pay off.\r\n\r\n“Onward” doesn’t make the most of its solid premise, which is a real shame. The plot is repetitive and predictable; the story sentimental and drawn out. It’s one of the weakest films in the Pixar catalog, but it does meet the studio’s basic checklist for acceptable quality (great animation, good voice performances, mediocre story). It could benefit from a little extra sprinkling of magic.", "created_at": "2020-03-27T01:48:08.841Z"}, {"movie_id": 508439, "review_id": "5eef733eb0cd200036b807a1", "author_rating": 5.0, "review_text": "Chock full of contrivances and just straight up contradictions, both which annoyed me to a pretty severe degree, but there was enough cutesy stuff in my lane to keep me from actively disliking it. Not a fan of the naming convention though. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-06-21T14:48:30.162Z"}, {"movie_id": 508439, "review_id": "5f590f169dee58003a0f1687", "author_rating": 7.0, "review_text": "Solid.\r\n\r\nI enjoyed <em>'Onward'</em>. It sets up a cool world filled with intrigue, whilst also having a heartwarming story and good lead voice actors. It doesn't, at least for me, hit every hearty note it attempts but you definitely end up caring for the main two characters.\r\n\r\nTom Holland (Ian) and Chris Pratt (Barley) are a smart pairing, they work together nicely. I don't love those around the Lightfoot brothers, the stuff with Laurel and Corey isn't all that interesting even if Julia Louis-Dreyfus and Octavia Spencer are fine choices as their voices.\r\n\r\nOverall, a good watch.", "created_at": "2020-09-09T17:21:26.316Z"}, {"movie_id": 508439, "review_id": "648428cde2726000e8c08492", "author_rating": 7.0, "review_text": "This is my kind of action animation. Two elves go on the hunt for the teeny weeniest bit of magic that might just enable them to catch up with their late father who passed away before they really got much chance to know him. What they didn't do before they set off on their quest, though, was tell mum (\"Laurel\"). She's narked - and worried - so elicits the help of the powerful \"Manticore\" and sets off in hot pursuit. It's good fun this, from start to finish. The combination of a strong adventure story full of myth, magic, peril (and totally devoid of romance) is complemented by some super animation and some wonderful creatures - including the hybrid scorpion/lion/eagle creature travelling with their almost as menacing mum. The script is entertaining and sparing - it's not just endless gibbering as our not particularly intrepid or heroic brothers try to reconvene with their dad before all it's just too late. It's a big screen delight this, and has plenty for the grown ups - especially if you are into legends - to enjoy too. Perhaps not the best title, but it's good stuff!", "created_at": "2023-06-10T07:39:57.622Z"}]