[{"movie_id": 1771, "review_id": "4fce8dc6760ee336ce00008f", "author_rating": 8.5, "review_text": "True to \"Captain America,\" this is the modern (comic book) version of the All American movie.  Good guys versus bad guys without a lot of ambiguity.  _**NOTHING WRONG WITH THAT**_.  \r\n\r\nThis movie is pretty much perfection for the genre. Entertaining A to Z story with high-end Hollywood professional movie making throughout.", "created_at": "2012-06-05T22:52:54.000Z"}, {"movie_id": 1771, "review_id": "5b151dcc0e0a262df1008f28", "author_rating": 8.0, "review_text": "**This is a long form review initially published in 2011:**\r\n\r\nThough it ran at over two hours, I did feel that it had plenty of room to go further than it did. I honestly felt like Red Skull could have had a film all to himself, and actually kind of suffered for making him as intriguing as he was.\r\n\r\nChris Evans was an interesting choice as the titular role of Captain America, given that he's already played American sweetheart Marvel Super Hero \"The Human Torch\" in _Fantastic 4_ and _Fantastic 4: Rise of the Silver Surfer_. He didn't Oh-My-Gosh blow me away type-thing or what have you, but he was pretty great.\r\n\r\nSo far in the Marvel Cinematic Universe, I'd slot Captain America clean in the middle. I liked _Iron Man_ and _Thor_ more, but _Iron Man 2_ and _The Incredible Hulk_ less. Marvel Studios stated that the movie they wanted to make was set in the 40's, even though the rest of Marvel Cinematic is modern-day. This was 100% the right move to make, why? Not because of the setting, aesthetics or direction, but because it's fuckin' smart. How do you have the world appreciate an Uncle-Sam loving upper-middle class white male military blindly-loyal patriot? You make him fight the God damn Nazis, that's how.\r\n\r\nIt may seem strange, but I actually enjoyed the opening of _Captain America_ the most, which he spends a a meek, asthmatic Steve Rogers, yet to undergo the Deus Ex Machina Super Serum. It really showed the best of Evans acting ability, as well as the writing of Christopher Markus and Stephen McFeely whom together wrote _You Kill Me_ and The _The Chronicles of Narnia_ Trilogy.\r\n\r\nI watched it in 3D, which was more bearable than usual. As the films of MCU progress, each of them becomes more and more a prequel to _The Avengers_, _Captain America_ being the most to date. Despite its almost-entire lack of _Avenger_ cameos, this more than previous films felt like a prequel for what's to come, which is not strictly speaking a good thing.\r\n\r\nI had plenty of minor issues with _Captain America_, and though their was quite a number of them, all were minor, and ultimately, the only part of me that regrets watching it was the part that keeps thinking \"My fucking God, I have to wait a YEAR before _Avengers_ comes out?!\"\r\n\r\n79%\r\n\r\n-Gimly", "created_at": "2018-06-04T11:09:00.079Z"}, {"movie_id": 1771, "review_id": "5c493dfa92514154484fc958", "author_rating": 8.0, "review_text": "PLOT\r\n\r\nSteve Rogers, a scrawny young man, wants to enlist in the US Army and go overseas to fight in WWII. But his size and health means his attempts at enlistment always end the same way -- a 4F rating. Until a scientist sees him and recruits him to try out for a special training program to create a super soldier.\r\n\r\nWHAT I LIKED\r\n\r\nThe Marvel universe sticks pretty close to classic script with him being given a serum that jacks his body into super muscle mode. He's already brave and smart, so it would seem like a no-brainer to send him overseas? But the guy in charge of his training doesn't want him, he's just one man, so Rogers ends up doing public relations back home. And he is quite shocked that the men overseas don't react as positively when they see him as the crowds back home. I really enjoyed the way they handle the first battle scene for him, basically him figuring things out as he goes, a far cry from his battle-hardened approaches later.\r\n\r\nI even liked his interactions with Agent Carter. I had thought it would be more subtle than it was, and I hoped we'd see a bit more of her operating on her own (after all, they gave her character a whole series on TV!), but she was second fiddle to the hero.\r\n\r\nWHAT I DIDN'T LIKE\r\n\r\nThe challenge with a lot of American movies of the war is that it is as if they are the only actors in the war, no allies, just them, and that level of nationalistic narrowmindedness is a bit grating. That may be a small gripe when the show is called CAPTAIN AMERICA, not CAPTAIN OF WORKING WITH ALLIES, but still, it's annoying. I also was disappointed there wasn't a lot more on Red Skull. His history, his abilities, other pursuits, all of it was left basically unreferenced. Sure, some of it shows up elsewhere in the Marvel universe, but a bit more crosswalk would have been nice. I felt he really wasn't that well-fleshed out as the uber villain he could have been.\r\n\r\nTHE BOTTOM LINE / TWEET\r\n\r\nAs an origin story, it lacks pizazz", "created_at": "2019-01-24T04:24:26.709Z"}, {"movie_id": 1771, "review_id": "5c84271d92514127691f7aeb", "author_rating": 7.0, "review_text": "Definitely the most underrated of all the MCU films, Captain America: The First Avenger is a great war film done comic book style about a little guy making a big difference. Red Skull is one of the better villains simply because of how fantastic Hugo Weaving is. Peggy Carter is a great heroine and Hayley Atwell's performance is an absolute joy. Also, Tommy Lee Jones and Stanley Tucci light up the screen whenever they're on.\r\n\r\nWith strong action scenes, nicely developed characters, and seamless CGI, Captain America: The First Avenger is perfectly fine as a stand alone film. Shameful that so many audiences were just going out of obligation for The Avengers, because this movie has a lot to offer.", "created_at": "2019-03-09T20:50:37.730Z"}, {"movie_id": 1771, "review_id": "5ed3248c1b157d001f53be6b", "author_rating": 7.0, "review_text": "Probably only my third time viewing and first in at least 8 years and while it's not great, I did find it to be pretty entertaining and Chris Evans embodies the role so well. Red Skull and the heavy prosthetic they placed on Hugo Weaving still was pretty silly looking, however, making him one of many weak villains in the MCU. **3.25/5**", "created_at": "2020-05-31T03:29:16.685Z"}, {"movie_id": 1771, "review_id": "600235b3223e20003db704f2", "author_rating": 9.0, "review_text": "I had a great time with this, it narrowly surpasses <em>'Iron Man'</em> for me.\r\n\r\n<em>'Captain America: The First Avenger'</em> is thoroughly entertaining. I absolutely enjoyed the story and how it is told, while the 1940s style is done fantastically - love the settings and costumes. The only negative I have is about the body double effect of skinny Captain America - which looks, honestly, ridiculous... in an amusing way, at least.\r\n\r\nThis is, possibly, the most I've enjoyed the overall cast for an MCU film so far. Chris Evans is fun to watch in the lead role, he does a grand job. Behind him, the likes of Tommy Lee Jones, Hayley Atwell and Hugo Weaving are enjoyable too.\r\n\r\nA very pleasant experience, this. Good fun.", "created_at": "2021-01-16T00:39:15.009Z"}, {"movie_id": 1771, "review_id": "64529c1287a27a0138a61557", "author_rating": 8.0, "review_text": "Really good movie. I loved the little tiny skinny him. He looked hilarious. Lots of action and cool cgi stuff going on.", "created_at": "2023-05-03T17:38:26.948Z"}]