[{"movie_id": 329440, "review_id": "569ab28e9251410cca000b20", "author_rating": 6.0, "review_text": "Cool story, but I think it would've worked better as a psychological movie instead of a horror movie.", "created_at": "2016-01-16T21:13:50.745Z"}, {"movie_id": 329440, "review_id": "56ac6b209251417e1100562a", "author_rating": null, "review_text": "The backbone of _The Forest’s_ conception is probably more fascinating than the horror film in which the narrative is based upon. Some may be familiar with the backstory of the “real” _Forest_ and its disturbing legendary reputation. Of course the reference is reserved for Japan’s Aokigahara Forest (a.k.a. “Suicide Forest”) at the geographical base of Mount Fuji where historically this has been the morbid albeit visually stimulating resting place for that country’s despair-ridden segmented population to gravitate in hopes of ending their lives among the smothering trees and twisty hiking paths. Although the Aokigahara Forest (also nicknamed “The Sea of Tress”) acts as the last tranquil location for those desperate souls that want to meet their spiritual Maker it also doubles as a scenic and sumptuous tourist attraction for outsiders that embrace the essence of such a colorfully green, wooded paradise. So given the compelling inspiration for such an intriguing and real-life model of a Japanese posh and plentiful tree trunk haven of exceptional beauty and mystery then why does The Forest not resonate with the convincing chills and thrills of a harried horror showcase meant to capture the true scary decadence of the Aokigahara Forest’s mystique?\r\n\r\nThe motivating myth behind the genuine hysterics of an Asian region that distinctively boasts the world’s second largest destination for suicidal tendencies should have been the selling point for this plodding, predictable doom-and-gloom chiller. Instead, The Forest cannot seem to distinguish the light from its treacherous trees while delivering a hollow. horror-made shell of ghostly paranoia that never really musters up any majestic titillation beyond its basic boo-link manufacturing. _The Forest’s_ winning formula, as it seems, is to rely on flashbacks in its step-by-step storytelling, exhaustive close-up shots on the film’s photogenic lead Natalie Dormer from TV’s “Games of Thrones” (playing put-upon Sara and her twin sister simultaneously) and needling through the conventional creepy impulses that the movie routinely trots out in suggestive suspense mode.\r\n\r\nFirst-time director Jason Zada has an interesting premise in which to work his grim-inducing hocus-pocus as his nightmarish narrative had the potential to raise the stakes of psychological warfare between weak-minded human psyche fragility and the deceptive mask of nature’s beautification. Zada and screenwriters Sarah Cornwell, Nick Antosca and Ben Katai never fluidly marry the concept of despair and detachment with the ominous histrionics of the ghoulish Aokigahara Forest folklore. The saddened study of loss and hopelessness in an exquisite and mystifying woodland of wonderment is sacrificed for a serviceable chiller that sputters in its generic sense of dread and devastation.\r\n\r\nDormer’s Sara Price is on a menacing mission to find her missing identical twin sibling Jess in the Far East. Jess had decided to take a trip to Japan. The word got out that poor Jess was last seen frequenting the notorious Aokigahara Forest–certainly not an encouraging sign for both the country’s natives and visiting outsiders deeply intrigued by the Timberland of Terror. In addition to Sara wandering about to locate the absent Jess she must reconcile her personal demons  and confront the ghosts–both the ones in her worried mindset and the evil-minded forest’s creation–as she seeks out her disappearing twin. Sara is against all odds to find her missing sibling in a wooded wasteland of hopelessness. Importantly, Sara must overcome her inner fears of depression, disillusionment and disorientation and poking around in the infamous Aokigahara is not helping matters in the least.\r\n\r\nThere is much that can be said about the lackluster presentation of _The Forest_. For starters, Dormer’s startled siren Sara is supposed to be the fearing female presence with a decent lifestyle back in the States although still tackling her traumatic baggage from a questionable upbringing. The audience does get the uncanny bond that Dormer’s twin sibs share in both triumph and tragedy. No doubt that Zada tries to position the emotional and mental bridge of his look-a-like pretty protagonists and tailor a sordid background of frightening forethought that especially consumes the erratic Sara. Yet with all the set-up in place (Aokigahara’s spooky backstory, imperiled sisterhood, etc.) Zada seems to struggle in incorporating any convincing sizzle that can propel The Forest into a cultural creepfest that really tantalizes.\r\n\r\nDormer’s Sara is reduced to frantically running into the shadowy woods and giving off jittery vibes to the spontaneous apparitions that pop in and out. Surprisingly, _The Forest_ never seizes the moment to embrace the inherent value of the Aokigahara’s deadly hypnotism for life-ending finality. Perhaps even if basing this horror film on the real-life suicidal indignation of “Suicide Forest” there probably would be major criticism about exploiting a Japanese tourist territory and its reprehensible reputation attached just to give a Hollywood horror showcase entertaining credibility. Still, this potential controversy might have given The Forest an upgrade in its otherwise mechanical and sluggish execution.\r\n\r\n_The Forest_ tosses around a few supporting characters to surround Dormer’s damsel-in-distress Sara but to no real effect. Japanese tourist guide Michi (Yukiyoshi Ozawa) and journalist Aiden (Taylor Kinney) join Sara in her quest to track down Jess. Michi, using common sense, abandons the remaining twosome after learning that Sara insists on sticking around the forbidden forest as the darkness of night approaches. Thus, this gives Aiden a fighting chance to intimately cozy up to the determined Sara while covering an expose on the tedious travels through the scenic but sinister woods. Of course, the introduction of the Yurei (the harrowing woods-based spirits that supposedly influence the suicidal urges of its doomed visitors) is in full force to badger the beleaguered Sara as they reinforce her embedded delusions.\r\n\r\nSome bright spots do redeem _The Forest’s_ presentation such as Mattias Troelstrup’s crisp camerawork and the haunting and surreal visuals of strung-up stiff corpses hanging from the trees that accentuate the eeriness of lifeless souls lost in hidden pain. Otherwise, Zada’s thin and jittery payoff is nothing more than a toothless trek through the pseudo petrified _Forest_.\r\n\r\nThe Forest (2016)\r\n\r\n1 hr. 35 mins.\r\n\r\nStarring: Natalie Dormer, Taylor Kinney and Yukiyoshi Ozawa\r\n\r\nDirected by: Jason Zada\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror/Psychological Thriller\r\n\r\n(c) Frank Ochieng  2016", "created_at": "2016-01-30T07:49:52.107Z"}, {"movie_id": 329440, "review_id": "58318aeac3a3685b9d024730", "author_rating": 3.0, "review_text": "I gained absolutely nothing from this experience bar the knowledge that Natalie Dormer makes for an attractive goth.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2016-11-20T11:37:14.985Z"}, {"movie_id": 329440, "review_id": "5942acd59251417f7700e740", "author_rating": 2.0, "review_text": "I would rather peel a raw onion and squeeze the juices into my eyes than watch recent horror movies coming out of Hollywood at the moment. WHY DO YOU STILL HAVE NO IMAGINATION AND JUST RELY ON CHEAP SHITTY JUMP SCENES WITH WANK PLOTS?!\r\n\r\nOkay. GRR.\r\n\r\nRandom lady gets a casual phone call advising her sister has gone into the suicide forest and it’s been 48 hours so she’s presumed as a suicide and they’re not going to look for her. Absolutely fuck all background into any character at this point so I don’t know them from Adam. \r\nThe twin sister goes out to find her sister in Japan and instead of heading right to the mission, goes for some sushi and is that arsed about her quest is more bothered that the fish she’s been given is raw. Fuck off. In her dreams she sees a ghoul child in her tent which is cheap jump #1 and to me, fuck all relevance to the audience as we still have no background which to me, is vital when you want someone to be truly on the edge wondering what’s happening. \r\n\r\nObviously the main as a blonde, her twin who’s gone to apparently kill herself is dark haired and gothic looking as we clearly don’t want to be too stereotypical do we. Flashbacks contain her sister giving her a vase and saying “Grandpa’s in there” so blondie opens it, revealing he is not and laughs heartily. What a laugh. She finally starts having a deek for her sister at a local place (no idea what it was as I had sort of switched off by this point) and the woman indicates her sister is downstairs. Blondie walks down to the basement of corpses and in true fashion to what we see so far is more offended by the smell than the fact her sister could be one of the rotting deceased found in the forest. Surprised she’s not taking a fucking selfie at this point.\r\n\r\nShe meets a guy in a bar and after telling him her life story ignites a “cheers” over a beverage, cheers to what love? The fact your twin is probably hanging off a tree? He ends up taking her into the forest with an experienced ranger, after a painful journey (for me not them) they find sisters tent and she wants to stay, fair enough. She’s happy to find the tent…. alarm bells. An empty tent in the suicide forest, are you thick? \r\nWhen she sees her first shit ghoul, she tells the guy who she was warned off (cassanova from the bar) in a dead dramatic way, “I saw this girl last night…” as she clicked cassanova was who she was warned off the best she could come up with when he said “what did she say?” was “she said something in japanese.” Seriously. SERIOUSLY. You could have made up something like, she wanted to knife me and fuck the remains.\r\n\r\nThe rest of the movie is probably too pitch black to see anything as they’ve gone for the angle of it’s really dark so lets just have random people who look like Chucky pop up occasionally. \r\n\r\nEnding makes no sense, the plot is incredibly weak and I am angered yet again by the sheer shit that’s being released onto cinema at the moment.\r\nAokigahara is interesting, it’s real and in reality; fucking terrifying. How can you mess up this movie so badly? \r\n\r\nNo.\r\n2/10", "created_at": "2017-06-15T15:50:45.515Z"}, {"movie_id": 329440, "review_id": "5c2cd8cdc3a368291fa30a2c", "author_rating": 3.0, "review_text": "The Forest was certainly an interesting concept but was very poorly executed; riddled with unnecessary jump scares as well as simply being poorly directed the film just flops. The ending left much more to be desired as well. On the bright side, Natalie Dormer is some great eye candy.", "created_at": "2019-01-02T15:29:17.501Z"}, {"movie_id": 329440, "review_id": "569ab28e9251410cca000b20", "author_rating": 6.0, "review_text": "Cool story, but I think it would've worked better as a psychological movie instead of a horror movie.", "created_at": "2016-01-16T21:13:50.745Z"}, {"movie_id": 329440, "review_id": "56ac6b209251417e1100562a", "author_rating": null, "review_text": "The backbone of _The Forest’s_ conception is probably more fascinating than the horror film in which the narrative is based upon. Some may be familiar with the backstory of the “real” _Forest_ and its disturbing legendary reputation. Of course the reference is reserved for Japan’s Aokigahara Forest (a.k.a. “Suicide Forest”) at the geographical base of Mount Fuji where historically this has been the morbid albeit visually stimulating resting place for that country’s despair-ridden segmented population to gravitate in hopes of ending their lives among the smothering trees and twisty hiking paths. Although the Aokigahara Forest (also nicknamed “The Sea of Tress”) acts as the last tranquil location for those desperate souls that want to meet their spiritual Maker it also doubles as a scenic and sumptuous tourist attraction for outsiders that embrace the essence of such a colorfully green, wooded paradise. So given the compelling inspiration for such an intriguing and real-life model of a Japanese posh and plentiful tree trunk haven of exceptional beauty and mystery then why does The Forest not resonate with the convincing chills and thrills of a harried horror showcase meant to capture the true scary decadence of the Aokigahara Forest’s mystique?\r\n\r\nThe motivating myth behind the genuine hysterics of an Asian region that distinctively boasts the world’s second largest destination for suicidal tendencies should have been the selling point for this plodding, predictable doom-and-gloom chiller. Instead, The Forest cannot seem to distinguish the light from its treacherous trees while delivering a hollow. horror-made shell of ghostly paranoia that never really musters up any majestic titillation beyond its basic boo-link manufacturing. _The Forest’s_ winning formula, as it seems, is to rely on flashbacks in its step-by-step storytelling, exhaustive close-up shots on the film’s photogenic lead Natalie Dormer from TV’s “Games of Thrones” (playing put-upon Sara and her twin sister simultaneously) and needling through the conventional creepy impulses that the movie routinely trots out in suggestive suspense mode.\r\n\r\nFirst-time director Jason Zada has an interesting premise in which to work his grim-inducing hocus-pocus as his nightmarish narrative had the potential to raise the stakes of psychological warfare between weak-minded human psyche fragility and the deceptive mask of nature’s beautification. Zada and screenwriters Sarah Cornwell, Nick Antosca and Ben Katai never fluidly marry the concept of despair and detachment with the ominous histrionics of the ghoulish Aokigahara Forest folklore. The saddened study of loss and hopelessness in an exquisite and mystifying woodland of wonderment is sacrificed for a serviceable chiller that sputters in its generic sense of dread and devastation.\r\n\r\nDormer’s Sara Price is on a menacing mission to find her missing identical twin sibling Jess in the Far East. Jess had decided to take a trip to Japan. The word got out that poor Jess was last seen frequenting the notorious Aokigahara Forest–certainly not an encouraging sign for both the country’s natives and visiting outsiders deeply intrigued by the Timberland of Terror. In addition to Sara wandering about to locate the absent Jess she must reconcile her personal demons  and confront the ghosts–both the ones in her worried mindset and the evil-minded forest’s creation–as she seeks out her disappearing twin. Sara is against all odds to find her missing sibling in a wooded wasteland of hopelessness. Importantly, Sara must overcome her inner fears of depression, disillusionment and disorientation and poking around in the infamous Aokigahara is not helping matters in the least.\r\n\r\nThere is much that can be said about the lackluster presentation of _The Forest_. For starters, Dormer’s startled siren Sara is supposed to be the fearing female presence with a decent lifestyle back in the States although still tackling her traumatic baggage from a questionable upbringing. The audience does get the uncanny bond that Dormer’s twin sibs share in both triumph and tragedy. No doubt that Zada tries to position the emotional and mental bridge of his look-a-like pretty protagonists and tailor a sordid background of frightening forethought that especially consumes the erratic Sara. Yet with all the set-up in place (Aokigahara’s spooky backstory, imperiled sisterhood, etc.) Zada seems to struggle in incorporating any convincing sizzle that can propel The Forest into a cultural creepfest that really tantalizes.\r\n\r\nDormer’s Sara is reduced to frantically running into the shadowy woods and giving off jittery vibes to the spontaneous apparitions that pop in and out. Surprisingly, _The Forest_ never seizes the moment to embrace the inherent value of the Aokigahara’s deadly hypnotism for life-ending finality. Perhaps even if basing this horror film on the real-life suicidal indignation of “Suicide Forest” there probably would be major criticism about exploiting a Japanese tourist territory and its reprehensible reputation attached just to give a Hollywood horror showcase entertaining credibility. Still, this potential controversy might have given The Forest an upgrade in its otherwise mechanical and sluggish execution.\r\n\r\n_The Forest_ tosses around a few supporting characters to surround Dormer’s damsel-in-distress Sara but to no real effect. Japanese tourist guide Michi (Yukiyoshi Ozawa) and journalist Aiden (Taylor Kinney) join Sara in her quest to track down Jess. Michi, using common sense, abandons the remaining twosome after learning that Sara insists on sticking around the forbidden forest as the darkness of night approaches. Thus, this gives Aiden a fighting chance to intimately cozy up to the determined Sara while covering an expose on the tedious travels through the scenic but sinister woods. Of course, the introduction of the Yurei (the harrowing woods-based spirits that supposedly influence the suicidal urges of its doomed visitors) is in full force to badger the beleaguered Sara as they reinforce her embedded delusions.\r\n\r\nSome bright spots do redeem _The Forest’s_ presentation such as Mattias Troelstrup’s crisp camerawork and the haunting and surreal visuals of strung-up stiff corpses hanging from the trees that accentuate the eeriness of lifeless souls lost in hidden pain. Otherwise, Zada’s thin and jittery payoff is nothing more than a toothless trek through the pseudo petrified _Forest_.\r\n\r\nThe Forest (2016)\r\n\r\n1 hr. 35 mins.\r\n\r\nStarring: Natalie Dormer, Taylor Kinney and Yukiyoshi Ozawa\r\n\r\nDirected by: Jason Zada\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror/Psychological Thriller\r\n\r\n(c) Frank Ochieng  2016", "created_at": "2016-01-30T07:49:52.107Z"}, {"movie_id": 329440, "review_id": "58318aeac3a3685b9d024730", "author_rating": 3.0, "review_text": "I gained absolutely nothing from this experience bar the knowledge that Natalie Dormer makes for an attractive goth.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2016-11-20T11:37:14.985Z"}, {"movie_id": 329440, "review_id": "5942acd59251417f7700e740", "author_rating": 2.0, "review_text": "I would rather peel a raw onion and squeeze the juices into my eyes than watch recent horror movies coming out of Hollywood at the moment. WHY DO YOU STILL HAVE NO IMAGINATION AND JUST RELY ON CHEAP SHITTY JUMP SCENES WITH WANK PLOTS?!\r\n\r\nOkay. GRR.\r\n\r\nRandom lady gets a casual phone call advising her sister has gone into the suicide forest and it’s been 48 hours so she’s presumed as a suicide and they’re not going to look for her. Absolutely fuck all background into any character at this point so I don’t know them from Adam. \r\nThe twin sister goes out to find her sister in Japan and instead of heading right to the mission, goes for some sushi and is that arsed about her quest is more bothered that the fish she’s been given is raw. Fuck off. In her dreams she sees a ghoul child in her tent which is cheap jump #1 and to me, fuck all relevance to the audience as we still have no background which to me, is vital when you want someone to be truly on the edge wondering what’s happening. \r\n\r\nObviously the main as a blonde, her twin who’s gone to apparently kill herself is dark haired and gothic looking as we clearly don’t want to be too stereotypical do we. Flashbacks contain her sister giving her a vase and saying “Grandpa’s in there” so blondie opens it, revealing he is not and laughs heartily. What a laugh. She finally starts having a deek for her sister at a local place (no idea what it was as I had sort of switched off by this point) and the woman indicates her sister is downstairs. Blondie walks down to the basement of corpses and in true fashion to what we see so far is more offended by the smell than the fact her sister could be one of the rotting deceased found in the forest. Surprised she’s not taking a fucking selfie at this point.\r\n\r\nShe meets a guy in a bar and after telling him her life story ignites a “cheers” over a beverage, cheers to what love? The fact your twin is probably hanging off a tree? He ends up taking her into the forest with an experienced ranger, after a painful journey (for me not them) they find sisters tent and she wants to stay, fair enough. She’s happy to find the tent…. alarm bells. An empty tent in the suicide forest, are you thick? \r\nWhen she sees her first shit ghoul, she tells the guy who she was warned off (cassanova from the bar) in a dead dramatic way, “I saw this girl last night…” as she clicked cassanova was who she was warned off the best she could come up with when he said “what did she say?” was “she said something in japanese.” Seriously. SERIOUSLY. You could have made up something like, she wanted to knife me and fuck the remains.\r\n\r\nThe rest of the movie is probably too pitch black to see anything as they’ve gone for the angle of it’s really dark so lets just have random people who look like Chucky pop up occasionally. \r\n\r\nEnding makes no sense, the plot is incredibly weak and I am angered yet again by the sheer shit that’s being released onto cinema at the moment.\r\nAokigahara is interesting, it’s real and in reality; fucking terrifying. How can you mess up this movie so badly? \r\n\r\nNo.\r\n2/10", "created_at": "2017-06-15T15:50:45.515Z"}, {"movie_id": 329440, "review_id": "5c2cd8cdc3a368291fa30a2c", "author_rating": 3.0, "review_text": "The Forest was certainly an interesting concept but was very poorly executed; riddled with unnecessary jump scares as well as simply being poorly directed the film just flops. The ending left much more to be desired as well. On the bright side, Natalie Dormer is some great eye candy.", "created_at": "2019-01-02T15:29:17.501Z"}, {"movie_id": 329440, "review_id": "569ab28e9251410cca000b20", "author_rating": 6.0, "review_text": "Cool story, but I think it would've worked better as a psychological movie instead of a horror movie.", "created_at": "2016-01-16T21:13:50.745Z"}, {"movie_id": 329440, "review_id": "56ac6b209251417e1100562a", "author_rating": null, "review_text": "The backbone of _The Forest’s_ conception is probably more fascinating than the horror film in which the narrative is based upon. Some may be familiar with the backstory of the “real” _Forest_ and its disturbing legendary reputation. Of course the reference is reserved for Japan’s Aokigahara Forest (a.k.a. “Suicide Forest”) at the geographical base of Mount Fuji where historically this has been the morbid albeit visually stimulating resting place for that country’s despair-ridden segmented population to gravitate in hopes of ending their lives among the smothering trees and twisty hiking paths. Although the Aokigahara Forest (also nicknamed “The Sea of Tress”) acts as the last tranquil location for those desperate souls that want to meet their spiritual Maker it also doubles as a scenic and sumptuous tourist attraction for outsiders that embrace the essence of such a colorfully green, wooded paradise. So given the compelling inspiration for such an intriguing and real-life model of a Japanese posh and plentiful tree trunk haven of exceptional beauty and mystery then why does The Forest not resonate with the convincing chills and thrills of a harried horror showcase meant to capture the true scary decadence of the Aokigahara Forest’s mystique?\r\n\r\nThe motivating myth behind the genuine hysterics of an Asian region that distinctively boasts the world’s second largest destination for suicidal tendencies should have been the selling point for this plodding, predictable doom-and-gloom chiller. Instead, The Forest cannot seem to distinguish the light from its treacherous trees while delivering a hollow. horror-made shell of ghostly paranoia that never really musters up any majestic titillation beyond its basic boo-link manufacturing. _The Forest’s_ winning formula, as it seems, is to rely on flashbacks in its step-by-step storytelling, exhaustive close-up shots on the film’s photogenic lead Natalie Dormer from TV’s “Games of Thrones” (playing put-upon Sara and her twin sister simultaneously) and needling through the conventional creepy impulses that the movie routinely trots out in suggestive suspense mode.\r\n\r\nFirst-time director Jason Zada has an interesting premise in which to work his grim-inducing hocus-pocus as his nightmarish narrative had the potential to raise the stakes of psychological warfare between weak-minded human psyche fragility and the deceptive mask of nature’s beautification. Zada and screenwriters Sarah Cornwell, Nick Antosca and Ben Katai never fluidly marry the concept of despair and detachment with the ominous histrionics of the ghoulish Aokigahara Forest folklore. The saddened study of loss and hopelessness in an exquisite and mystifying woodland of wonderment is sacrificed for a serviceable chiller that sputters in its generic sense of dread and devastation.\r\n\r\nDormer’s Sara Price is on a menacing mission to find her missing identical twin sibling Jess in the Far East. Jess had decided to take a trip to Japan. The word got out that poor Jess was last seen frequenting the notorious Aokigahara Forest–certainly not an encouraging sign for both the country’s natives and visiting outsiders deeply intrigued by the Timberland of Terror. In addition to Sara wandering about to locate the absent Jess she must reconcile her personal demons  and confront the ghosts–both the ones in her worried mindset and the evil-minded forest’s creation–as she seeks out her disappearing twin. Sara is against all odds to find her missing sibling in a wooded wasteland of hopelessness. Importantly, Sara must overcome her inner fears of depression, disillusionment and disorientation and poking around in the infamous Aokigahara is not helping matters in the least.\r\n\r\nThere is much that can be said about the lackluster presentation of _The Forest_. For starters, Dormer’s startled siren Sara is supposed to be the fearing female presence with a decent lifestyle back in the States although still tackling her traumatic baggage from a questionable upbringing. The audience does get the uncanny bond that Dormer’s twin sibs share in both triumph and tragedy. No doubt that Zada tries to position the emotional and mental bridge of his look-a-like pretty protagonists and tailor a sordid background of frightening forethought that especially consumes the erratic Sara. Yet with all the set-up in place (Aokigahara’s spooky backstory, imperiled sisterhood, etc.) Zada seems to struggle in incorporating any convincing sizzle that can propel The Forest into a cultural creepfest that really tantalizes.\r\n\r\nDormer’s Sara is reduced to frantically running into the shadowy woods and giving off jittery vibes to the spontaneous apparitions that pop in and out. Surprisingly, _The Forest_ never seizes the moment to embrace the inherent value of the Aokigahara’s deadly hypnotism for life-ending finality. Perhaps even if basing this horror film on the real-life suicidal indignation of “Suicide Forest” there probably would be major criticism about exploiting a Japanese tourist territory and its reprehensible reputation attached just to give a Hollywood horror showcase entertaining credibility. Still, this potential controversy might have given The Forest an upgrade in its otherwise mechanical and sluggish execution.\r\n\r\n_The Forest_ tosses around a few supporting characters to surround Dormer’s damsel-in-distress Sara but to no real effect. Japanese tourist guide Michi (Yukiyoshi Ozawa) and journalist Aiden (Taylor Kinney) join Sara in her quest to track down Jess. Michi, using common sense, abandons the remaining twosome after learning that Sara insists on sticking around the forbidden forest as the darkness of night approaches. Thus, this gives Aiden a fighting chance to intimately cozy up to the determined Sara while covering an expose on the tedious travels through the scenic but sinister woods. Of course, the introduction of the Yurei (the harrowing woods-based spirits that supposedly influence the suicidal urges of its doomed visitors) is in full force to badger the beleaguered Sara as they reinforce her embedded delusions.\r\n\r\nSome bright spots do redeem _The Forest’s_ presentation such as Mattias Troelstrup’s crisp camerawork and the haunting and surreal visuals of strung-up stiff corpses hanging from the trees that accentuate the eeriness of lifeless souls lost in hidden pain. Otherwise, Zada’s thin and jittery payoff is nothing more than a toothless trek through the pseudo petrified _Forest_.\r\n\r\nThe Forest (2016)\r\n\r\n1 hr. 35 mins.\r\n\r\nStarring: Natalie Dormer, Taylor Kinney and Yukiyoshi Ozawa\r\n\r\nDirected by: Jason Zada\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror/Psychological Thriller\r\n\r\n(c) Frank Ochieng  2016", "created_at": "2016-01-30T07:49:52.107Z"}, {"movie_id": 329440, "review_id": "58318aeac3a3685b9d024730", "author_rating": 3.0, "review_text": "I gained absolutely nothing from this experience bar the knowledge that Natalie Dormer makes for an attractive goth.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2016-11-20T11:37:14.985Z"}, {"movie_id": 329440, "review_id": "5942acd59251417f7700e740", "author_rating": 2.0, "review_text": "I would rather peel a raw onion and squeeze the juices into my eyes than watch recent horror movies coming out of Hollywood at the moment. WHY DO YOU STILL HAVE NO IMAGINATION AND JUST RELY ON CHEAP SHITTY JUMP SCENES WITH WANK PLOTS?!\r\n\r\nOkay. GRR.\r\n\r\nRandom lady gets a casual phone call advising her sister has gone into the suicide forest and it’s been 48 hours so she’s presumed as a suicide and they’re not going to look for her. Absolutely fuck all background into any character at this point so I don’t know them from Adam. \r\nThe twin sister goes out to find her sister in Japan and instead of heading right to the mission, goes for some sushi and is that arsed about her quest is more bothered that the fish she’s been given is raw. Fuck off. In her dreams she sees a ghoul child in her tent which is cheap jump #1 and to me, fuck all relevance to the audience as we still have no background which to me, is vital when you want someone to be truly on the edge wondering what’s happening. \r\n\r\nObviously the main as a blonde, her twin who’s gone to apparently kill herself is dark haired and gothic looking as we clearly don’t want to be too stereotypical do we. Flashbacks contain her sister giving her a vase and saying “Grandpa’s in there” so blondie opens it, revealing he is not and laughs heartily. What a laugh. She finally starts having a deek for her sister at a local place (no idea what it was as I had sort of switched off by this point) and the woman indicates her sister is downstairs. Blondie walks down to the basement of corpses and in true fashion to what we see so far is more offended by the smell than the fact her sister could be one of the rotting deceased found in the forest. Surprised she’s not taking a fucking selfie at this point.\r\n\r\nShe meets a guy in a bar and after telling him her life story ignites a “cheers” over a beverage, cheers to what love? The fact your twin is probably hanging off a tree? He ends up taking her into the forest with an experienced ranger, after a painful journey (for me not them) they find sisters tent and she wants to stay, fair enough. She’s happy to find the tent…. alarm bells. An empty tent in the suicide forest, are you thick? \r\nWhen she sees her first shit ghoul, she tells the guy who she was warned off (cassanova from the bar) in a dead dramatic way, “I saw this girl last night…” as she clicked cassanova was who she was warned off the best she could come up with when he said “what did she say?” was “she said something in japanese.” Seriously. SERIOUSLY. You could have made up something like, she wanted to knife me and fuck the remains.\r\n\r\nThe rest of the movie is probably too pitch black to see anything as they’ve gone for the angle of it’s really dark so lets just have random people who look like Chucky pop up occasionally. \r\n\r\nEnding makes no sense, the plot is incredibly weak and I am angered yet again by the sheer shit that’s being released onto cinema at the moment.\r\nAokigahara is interesting, it’s real and in reality; fucking terrifying. How can you mess up this movie so badly? \r\n\r\nNo.\r\n2/10", "created_at": "2017-06-15T15:50:45.515Z"}, {"movie_id": 329440, "review_id": "5c2cd8cdc3a368291fa30a2c", "author_rating": 3.0, "review_text": "The Forest was certainly an interesting concept but was very poorly executed; riddled with unnecessary jump scares as well as simply being poorly directed the film just flops. The ending left much more to be desired as well. On the bright side, Natalie Dormer is some great eye candy.", "created_at": "2019-01-02T15:29:17.501Z"}, {"movie_id": 329440, "review_id": "569ab28e9251410cca000b20", "author_rating": 6.0, "review_text": "Cool story, but I think it would've worked better as a psychological movie instead of a horror movie.", "created_at": "2016-01-16T21:13:50.745Z"}, {"movie_id": 329440, "review_id": "56ac6b209251417e1100562a", "author_rating": null, "review_text": "The backbone of _The Forest’s_ conception is probably more fascinating than the horror film in which the narrative is based upon. Some may be familiar with the backstory of the “real” _Forest_ and its disturbing legendary reputation. Of course the reference is reserved for Japan’s Aokigahara Forest (a.k.a. “Suicide Forest”) at the geographical base of Mount Fuji where historically this has been the morbid albeit visually stimulating resting place for that country’s despair-ridden segmented population to gravitate in hopes of ending their lives among the smothering trees and twisty hiking paths. Although the Aokigahara Forest (also nicknamed “The Sea of Tress”) acts as the last tranquil location for those desperate souls that want to meet their spiritual Maker it also doubles as a scenic and sumptuous tourist attraction for outsiders that embrace the essence of such a colorfully green, wooded paradise. So given the compelling inspiration for such an intriguing and real-life model of a Japanese posh and plentiful tree trunk haven of exceptional beauty and mystery then why does The Forest not resonate with the convincing chills and thrills of a harried horror showcase meant to capture the true scary decadence of the Aokigahara Forest’s mystique?\r\n\r\nThe motivating myth behind the genuine hysterics of an Asian region that distinctively boasts the world’s second largest destination for suicidal tendencies should have been the selling point for this plodding, predictable doom-and-gloom chiller. Instead, The Forest cannot seem to distinguish the light from its treacherous trees while delivering a hollow. horror-made shell of ghostly paranoia that never really musters up any majestic titillation beyond its basic boo-link manufacturing. _The Forest’s_ winning formula, as it seems, is to rely on flashbacks in its step-by-step storytelling, exhaustive close-up shots on the film’s photogenic lead Natalie Dormer from TV’s “Games of Thrones” (playing put-upon Sara and her twin sister simultaneously) and needling through the conventional creepy impulses that the movie routinely trots out in suggestive suspense mode.\r\n\r\nFirst-time director Jason Zada has an interesting premise in which to work his grim-inducing hocus-pocus as his nightmarish narrative had the potential to raise the stakes of psychological warfare between weak-minded human psyche fragility and the deceptive mask of nature’s beautification. Zada and screenwriters Sarah Cornwell, Nick Antosca and Ben Katai never fluidly marry the concept of despair and detachment with the ominous histrionics of the ghoulish Aokigahara Forest folklore. The saddened study of loss and hopelessness in an exquisite and mystifying woodland of wonderment is sacrificed for a serviceable chiller that sputters in its generic sense of dread and devastation.\r\n\r\nDormer’s Sara Price is on a menacing mission to find her missing identical twin sibling Jess in the Far East. Jess had decided to take a trip to Japan. The word got out that poor Jess was last seen frequenting the notorious Aokigahara Forest–certainly not an encouraging sign for both the country’s natives and visiting outsiders deeply intrigued by the Timberland of Terror. In addition to Sara wandering about to locate the absent Jess she must reconcile her personal demons  and confront the ghosts–both the ones in her worried mindset and the evil-minded forest’s creation–as she seeks out her disappearing twin. Sara is against all odds to find her missing sibling in a wooded wasteland of hopelessness. Importantly, Sara must overcome her inner fears of depression, disillusionment and disorientation and poking around in the infamous Aokigahara is not helping matters in the least.\r\n\r\nThere is much that can be said about the lackluster presentation of _The Forest_. For starters, Dormer’s startled siren Sara is supposed to be the fearing female presence with a decent lifestyle back in the States although still tackling her traumatic baggage from a questionable upbringing. The audience does get the uncanny bond that Dormer’s twin sibs share in both triumph and tragedy. No doubt that Zada tries to position the emotional and mental bridge of his look-a-like pretty protagonists and tailor a sordid background of frightening forethought that especially consumes the erratic Sara. Yet with all the set-up in place (Aokigahara’s spooky backstory, imperiled sisterhood, etc.) Zada seems to struggle in incorporating any convincing sizzle that can propel The Forest into a cultural creepfest that really tantalizes.\r\n\r\nDormer’s Sara is reduced to frantically running into the shadowy woods and giving off jittery vibes to the spontaneous apparitions that pop in and out. Surprisingly, _The Forest_ never seizes the moment to embrace the inherent value of the Aokigahara’s deadly hypnotism for life-ending finality. Perhaps even if basing this horror film on the real-life suicidal indignation of “Suicide Forest” there probably would be major criticism about exploiting a Japanese tourist territory and its reprehensible reputation attached just to give a Hollywood horror showcase entertaining credibility. Still, this potential controversy might have given The Forest an upgrade in its otherwise mechanical and sluggish execution.\r\n\r\n_The Forest_ tosses around a few supporting characters to surround Dormer’s damsel-in-distress Sara but to no real effect. Japanese tourist guide Michi (Yukiyoshi Ozawa) and journalist Aiden (Taylor Kinney) join Sara in her quest to track down Jess. Michi, using common sense, abandons the remaining twosome after learning that Sara insists on sticking around the forbidden forest as the darkness of night approaches. Thus, this gives Aiden a fighting chance to intimately cozy up to the determined Sara while covering an expose on the tedious travels through the scenic but sinister woods. Of course, the introduction of the Yurei (the harrowing woods-based spirits that supposedly influence the suicidal urges of its doomed visitors) is in full force to badger the beleaguered Sara as they reinforce her embedded delusions.\r\n\r\nSome bright spots do redeem _The Forest’s_ presentation such as Mattias Troelstrup’s crisp camerawork and the haunting and surreal visuals of strung-up stiff corpses hanging from the trees that accentuate the eeriness of lifeless souls lost in hidden pain. Otherwise, Zada’s thin and jittery payoff is nothing more than a toothless trek through the pseudo petrified _Forest_.\r\n\r\nThe Forest (2016)\r\n\r\n1 hr. 35 mins.\r\n\r\nStarring: Natalie Dormer, Taylor Kinney and Yukiyoshi Ozawa\r\n\r\nDirected by: Jason Zada\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror/Psychological Thriller\r\n\r\n(c) Frank Ochieng  2016", "created_at": "2016-01-30T07:49:52.107Z"}, {"movie_id": 329440, "review_id": "58318aeac3a3685b9d024730", "author_rating": 3.0, "review_text": "I gained absolutely nothing from this experience bar the knowledge that Natalie Dormer makes for an attractive goth.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._", "created_at": "2016-11-20T11:37:14.985Z"}, {"movie_id": 329440, "review_id": "5942acd59251417f7700e740", "author_rating": 2.0, "review_text": "I would rather peel a raw onion and squeeze the juices into my eyes than watch recent horror movies coming out of Hollywood at the moment. WHY DO YOU STILL HAVE NO IMAGINATION AND JUST RELY ON CHEAP SHITTY JUMP SCENES WITH WANK PLOTS?!\r\n\r\nOkay. GRR.\r\n\r\nRandom lady gets a casual phone call advising her sister has gone into the suicide forest and it’s been 48 hours so she’s presumed as a suicide and they’re not going to look for her. Absolutely fuck all background into any character at this point so I don’t know them from Adam. \r\nThe twin sister goes out to find her sister in Japan and instead of heading right to the mission, goes for some sushi and is that arsed about her quest is more bothered that the fish she’s been given is raw. Fuck off. In her dreams she sees a ghoul child in her tent which is cheap jump #1 and to me, fuck all relevance to the audience as we still have no background which to me, is vital when you want someone to be truly on the edge wondering what’s happening. \r\n\r\nObviously the main as a blonde, her twin who’s gone to apparently kill herself is dark haired and gothic looking as we clearly don’t want to be too stereotypical do we. Flashbacks contain her sister giving her a vase and saying “Grandpa’s in there” so blondie opens it, revealing he is not and laughs heartily. What a laugh. She finally starts having a deek for her sister at a local place (no idea what it was as I had sort of switched off by this point) and the woman indicates her sister is downstairs. Blondie walks down to the basement of corpses and in true fashion to what we see so far is more offended by the smell than the fact her sister could be one of the rotting deceased found in the forest. Surprised she’s not taking a fucking selfie at this point.\r\n\r\nShe meets a guy in a bar and after telling him her life story ignites a “cheers” over a beverage, cheers to what love? The fact your twin is probably hanging off a tree? He ends up taking her into the forest with an experienced ranger, after a painful journey (for me not them) they find sisters tent and she wants to stay, fair enough. She’s happy to find the tent…. alarm bells. An empty tent in the suicide forest, are you thick? \r\nWhen she sees her first shit ghoul, she tells the guy who she was warned off (cassanova from the bar) in a dead dramatic way, “I saw this girl last night…” as she clicked cassanova was who she was warned off the best she could come up with when he said “what did she say?” was “she said something in japanese.” Seriously. SERIOUSLY. You could have made up something like, she wanted to knife me and fuck the remains.\r\n\r\nThe rest of the movie is probably too pitch black to see anything as they’ve gone for the angle of it’s really dark so lets just have random people who look like Chucky pop up occasionally. \r\n\r\nEnding makes no sense, the plot is incredibly weak and I am angered yet again by the sheer shit that’s being released onto cinema at the moment.\r\nAokigahara is interesting, it’s real and in reality; fucking terrifying. How can you mess up this movie so badly? \r\n\r\nNo.\r\n2/10", "created_at": "2017-06-15T15:50:45.515Z"}, {"movie_id": 329440, "review_id": "5c2cd8cdc3a368291fa30a2c", "author_rating": 3.0, "review_text": "The Forest was certainly an interesting concept but was very poorly executed; riddled with unnecessary jump scares as well as simply being poorly directed the film just flops. The ending left much more to be desired as well. On the bright side, Natalie Dormer is some great eye candy.", "created_at": "2019-01-02T15:29:17.501Z"}]