[{"movie_id": 424694, "review_id": "5c444e27c3a3681a1124553c", "author_rating": 4.0, "review_text": "If _Bohemian Rhapsody_ is so great, why was the best part of it Tom Hollander saying a single word? Don't get me wrong, Rami Malek deserves props for the role, that much is true (less perhaps than he's been getting, but still, props). But beyond that, _Bohemian Rhapsody_ is bland, choppy, arguably even offensive. There **might** be some value in one of those sing-along type deals if you can get enough Queen fans together for one, but I'll never know, because I have no interest in re-watching this.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-01-20T10:32:07.379Z"}, {"movie_id": 424694, "review_id": "5c46bd089251410e0c50473b", "author_rating": 4.0, "review_text": "If _Bohemian Rhapsody_ is so great, why was the best part of it Tom Hollander saying a single word? Don't get me wrong, Rami Malek deserves props for the role, that much is true (less perhaps than he's been getting, but still, props). But beyond that, _Bohemian Rhapsody_ is bland, choppy, arguably even offensive. There **might** be some value in one of those sing-along type deals if you can get enough Queen fans together for one, but I'll never know, because I have no interest in re-watching this.\r\n\r\nFinal rating:★★ - Had some things that appeal to me, but a poor finished product.", "created_at": "2019-01-22T06:49:44.015Z"}, {"movie_id": 424694, "review_id": "5c557b06c3a3684246823905", "author_rating": 10.0, "review_text": "Bohemian Rhapsody is not a biography of Freddie Mercury, nor a biopic of Queen. It's a story based on a selection of key events occurring between the formation of the band and their appearance at Live Aid.\r\nAs a Queen fan I found this film utterly engrossing and enjoyable. The acting brilliantly invokes the characters in the band and the music provides a thumping rhythm to carry the story along.\r\nQueen aficionados may be affronted by the out of sequence music performances and the highly selective approach to the story telling but if you can see past that, you'll enjoy a storming film with a spine-tingling conclusion as the Live Aid performance is brilliantly recreated.", "created_at": "2019-02-02T11:12:06.493Z"}, {"movie_id": 424694, "review_id": "62dfaa3d48138200541a804b", "author_rating": 8.0, "review_text": "Rami was beyond superb at bringing the light that was Freddie to life again. I almost couldn't tell the difference. It was so well done. Perfection. I wish all real life bio-pics could be as heartwarming, heartbreaking, and fun as this. We miss and love you Freddie.", "created_at": "2022-07-26T08:47:57.324Z"}, {"movie_id": 424694, "review_id": "63c1ffb6a5743d00891090b3", "author_rating": 1.0, "review_text": "I was scared to see this, mainly because most Biopics paint people in an absolutely horrible light and Queen was one of my favorite bands and Freddie one of my favorite rock vocalists. I was ready to rant and rave if it turned out to be a smear campaign of one of my rock heroes.\r\n\r\nFortunately it wasn't, it was actually a fair treatment of all of them. And, in fact, it was really generous towards May, but then he wasn't the focus of the film.\r\n\r\nAnd the cast actually looked like Queen. So that is a plus. Everyone did a great job and props have to go out to Rami Malek, he would have been great if they gave him actual dialogue.\r\n\r\nSo why the single star? Honestly, it's because of the trailer. As in, if you saw the trailer you pretty much have already seen the movie. Not just the highlights, but the entire movie.\r\n\r\nQueen was an epic band. Bohemian Rhapsody was an epic song. But Bohemian Rhapsody the movie has absolutely no meat on it.\r\n\r\nYou walk in with high hopes, and the cast is great, but the movie as a whole is a let down. It ends at Live Aid (as it probably should) but even then it doesn't seem anywhere near as epic a finale as it should have been for such a memorable and lauded performance.\r\n\r\nUltimately, there should have been more to it.", "created_at": "2023-01-14T01:04:54.982Z"}, {"movie_id": 424694, "review_id": "655e4a222b113d00ada23930", "author_rating": 8.0, "review_text": "**A good film about one of the great rock bands of the 20th century.**\r\n\r\nThis is one of those films that was made with the fans of a personality in mind, more than the rest of the public. This, however, is not exactly a problem in my eyes, it is rather a characteristic of this film, common to other biographical films that are centered on very popular figures such as sportsmen, musicians or others.\r\n\r\nDirected by Bryan Singer, the film covers the journey of the notable rock band “Queen” and its lead singer, Freddie Mercury, who immortalized himself with memorable performances and a sense of stage and spectacle that only big stars possess. Mercury was also notable for being one of the first major superstars to openly embrace his homosexuality and die of AIDS. As a biography, it is a very acceptable film and, as far as I was able to understand, it respects the essential aspects of the lives and artistic path of those concerned. Of course, being a film about a rock band, we cannot ignore the soundtrack, where we have the band's most famous and recognizable songs, and we can see a reenactment of the famous live performance they did at “Live Aid” in 1985, a one of the most acclaimed live musical performances ever in rock history.\r\n\r\nObviously, the film was fated to financial success and, without any major surprises, and after weeks of advertising investment, it found great support from the public and became one of the biggest box office successes of that year. Critics also had no major objections and the film arrived at the Oscars as one of the favorites: out of a total of five nominations, it won four statuettes (Best Actor, Best Editing, Best Sound Mixing and Best Sound Editing) losing only for Best Film.\r\n\r\nIn fact, in addition to the good songs and good script, the film offers us one of the best performances by Rami Malek, an actor who couldn't be better suited for the role of Freddie Mercury. In addition to all the physical similarities that he took advantage of to embody the character, he managed to interpret him in a dignified and respectful way, without transforming “his” Freddie into a kind of cheap imitation of the real person. However, as I watched the film, I couldn't help but feel that Malek was the only one in the scene who deserved the spotlight, and that the film lacked an equally good supporting cast that would give some charisma to the remaining band members, transformed into in extras in a story where only Mercury was taken into consideration.", "created_at": "2023-11-22T18:36:18.397Z"}]