[{"movie_id": 10687, "review_id": "55abdb1ec3a368648e0060a4", "author_rating": 8.0, "review_text": "Just because you wear those sergeant's stripes doesn't mean you ain't gonna die.\r\n\r\nTigerland was the name of a U.S. Army training camp located at Fort Polk, Louisiana. Tagged as the second worst part of the Earth, it was a recreation of the Vietnamese jungle and was used to prepare American soldiers for the hellish terrain they were soon to be fighting in. \r\n\r\nDirected by Joel Schumacher, Tigerland stars Colin Farrell as Private Roland Bozz, a reluctant recruit to the war effort who upsets his superiors by having a canny knack for exploiting loop holes in the rule book. However, it's evident that Bozz has leadership qualities, but can the officers convince him he is born to lead? \r\n\r\nBy the time of Tigerland's release, the Vietnam movie had apparently run its course. The announcement that Joel Schumacher was to delve into the conflict for his next movie was met with less than enthusiastic responses. This was after all the director who had not too long prior reduced the once darkly watchable Batman franchise to comedy campy ham overdrive. Alarm bells were further starting to go off when it was revealed that it was to be a short low budget shoot of 28 days, with a cast of unknowns and filmed in grainy 16 millimetre. Yet two things were forgotten by his many detractors. One was that Schumacher had showed himself capable of guiding a young vibrant cast to high levels of watch-ability (The Lost Boys), and two, that he had made Falling Down in the early 90s, thus tricky and darker edged material was not beyond him. \r\n\r\nTigerland is a fine film, there is no actual conflict to observe other than the interactions between Bozz, his fellow squadies and his superiors. This is more boot camp drama than a film about military engagements. But the impact is much the same as our group of young men prepare for a fate that doesn't exactly have favourable odds; their respective reasons for being there in the first place containing varying degrees of bravado or disbelief. To which, much to his initial bemusement, Bozz simultaneously becomes a beacon of hope to many and a figure for revilement. The out-shot of this is that Tigerland winds up an expertly crafted movie, one that is propelled by great acting and one that quietly sneaks up on you and cloaks you in sadness. \r\n\r\nSchumacher is not the sole reason for why the film works so well though, he had some quality help. Ross Klavan and Michael McGruther's screenplay rises above the character clichés that exist in every army training camp based movie. Helped enormously by Klavan drawing on his real life experiences in the army, Tigerland doesn't hurtle towards its climax (a climax that is understated and poignant), it takes its time, characters are formed and with the then unknown Farrell on stupendously bewitching form, it's as engaging as a Vietnam film gets. This in spite of the grim look of the piece as Matthew Libatique's cinematography strips away vibrant colours and uses murky greys and greens to put the viewer right in there with them at boot camp. The look, the feel and the story all pull together nicely, making Tigerland fit to be mentioned in the same breath as those popular Vietnam movies from the previous decades. 8/10", "created_at": "2015-07-19T17:15:10.139Z"}]