[{"movie_id": 503736, "review_id": "60a58352543398003eb17511", "author_rating": 8.0, "review_text": "Army of the Dead injects some much needed vitality into both zombie films as a whole and Zack Snyder’s career as a filmmaker. Dave Bautista is also the best he’s ever been as far as his acting ability goes. Gory as hell and entertaining through and through, Army of the Dead is a must-watch for action and horror film fans alike. We really needed more scenes with Vanderohe (Omari Hardwick) using that giant circular saw to tear through zombie flesh though. \r\n\r\nFull review here: http://geekshavegame.com/army-of-the-dead-review-zack-snyders-return-to-zombie-flesh-eating-form/", "created_at": "2021-05-19T21:29:54.532Z"}, {"movie_id": 503736, "review_id": "60a986ef7f4f21002a909c9f", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nZack Snyder is far from being a consensual director. Some viewers really love his work - Zack Snyder's Justice League was only possible due to passionate, hardcore fans - while others fail to understand the reasons behind the constant hype surrounding the filmmaker's projects. Personally, despite not belonging to his enormous fandom, I quite enjoy his work outside of the DCEU. From Dawn of the Dead to Watchmen, passing through 300, I hold these films in high regard. However, Batman v Superman: Dawn of Justice is unquestionably one of the biggest cinematic disappointments of my life, and it's arguably the movie that triggered the beginning of the controversial general opinion about the director.\r\n\r\nUsually, when people find themselves on a rough path, going back to their roots helps them get back on track, which is precisely what Snyder does here. The \"zombie apocalypse\" genre has been around for decades, but since the start of the new century, audiences all over the world were able to witness a narrative that was once unique and exciting become one of the most overdone, generic, formulaic pieces of storytelling. This last statement doesn't mean a few gems can't come out of it. From probably the greatest zombie film ever, Train to Busan, to the comedy classic Zombieland, there are truly great movies within the genre. So, where does Army of the Dead stand?\r\n\r\nSomewhere in the middle, labeled as \"good fun\", which is all I expected from this Netflix film. Let me get one thing out of the way immediately: this looks, sounds, and feels like a Snyder movie. Countless over-stylized shots, long slow-motion scenes, an overwhelming amount of gore and blood, bizarre song choices, a two-hour-and-a-half runtime... for better or worst, no one can complain about studio interferences this time. Clearly, the famous director had complete creative freedom, and it shows through all of the film's positives and negatives. Fortunately, Snyder's filmmaking style not only fits well within this genre, but it also works for the simple, entertainment-driven screenplay.\r\n\r\nA vast majority of viewers will press play in the hopes of receiving an action-heavy, fun, uncomplicated zombie movie with all the attributes that these flesh-eating characters possess. Except for a genuinely interesting storyline - though not new - concerning a specific type of zombies, everything else is pretty much what viewers have seen for the past two decades, which might be disappointing yet still highly enjoyable. From the way people can kill them to the time each infected person takes to become a zombie, every single cliche is present in this film. Honestly, none of them really annoy me unless they're repeated to exhaustion, which I don't believe Army of the Dead does that much.\r\n\r\nThe action sequences are all well-shot, but I did expect more from them. Most scenes are just characters randomly shooting, hitting insane headshots that viewers will just have to accept as something normal, which shouldn't be too hard, considering the recent action flicks. Occasionally, one-on-one or one-on-many combats ensue, and it elevates the excitement levels by focusing on that single character, but then it's brought down again by tiresome shootouts. Snyder asks the viewers to accept several dumb plot and character decisions, so it's always going to be a matter of how much you can take until it starts getting too much...\r\n\r\nPersonally, these logical issues don't really bother me - the ridiculous third act does push my limits, I admit. However, the lack of character development and overall care for everyone in the movie will always be a massive problem, especially when supposedly emotional, heartfelt moments end up having zero impact. I doubt anyone will be surprised to find out that people die in this film besides the zombies, consequently bringing tonal balance to the table. Obviously, not every character needs to receive a deep backstory and complex motivations, but it doesn't hurt to tell the viewers a bit about the people going into the danger zone so that the action sequences can carry more tension.\r\n\r\nWithout spoiling anything, there's a period in the movie where a deadly countdown begins, and everything that occurs from the starting time to the climactic moment just feels like any other scene in the film. The lack of tension and sense of urgency ultimately stops it from being one of the greats. Overall, it's an enjoyable zombie flick that offered me a blast of fun, but I still believe it could have been a lot better. Dave Bautista (My Spy, Avengers: Endgame) is the absolute standout, interpreting the only fully-developed character of the movie. Ella Purnell (Wildlike), Omari Hardwick (Sorry to Bother You), and Nora Arnezeder (Origin) are also quite good.\r\n\r\nFinally, a point must be made about the relationship between studios and filmmakers. While I'm all in favor of creative freedom, there must always be a compromise between both parties. Snyder didn't gain fame for badly editing his films for no reason. Army of the Dead is, like most of his movies, unnecessarily long. The \"deleted scenes\" feature on Blu-rays doesn't exist for show-off. There's no film in the history of cinema where every single second recorded is pure gold, and runtimes are something studios can *help* filmmakers nail perfectly. In the end, I still consider this movie to move quickly through its straightforward story, so the excess screentime might not be that big of an issue for other viewers.\r\n\r\nArmy of the Dead brings Zack Snyder back to the zombie apocalypse genre, delivering an entertaining, action-driven story that will please most spectators. With his distinct, divisive filmmaking style completely unrestrained, for better or worst, the standout Dave Bautista and his team fight through the cliches, lack of character development, and excessive runtime to still offer plenty of excitement. The lack of tension and urgency hurt some of the last action sequences, but all are well-shot and packed with energy. Exceptional production design and VFX aren't enough to compensate for the predictably formulaic screenplay, especially when the only interesting zombie storyline is only partially explored. Overall, it's the definition of \"good fun\", so if your weekend has a two-and-a-half-hour empty slot, Netflix has my endorsement.\r\n\r\nRating: B-", "created_at": "2021-05-22T22:34:23.079Z"}, {"movie_id": 503736, "review_id": "60ce5eab9c24fc002a2650aa", "author_rating": 8.0, "review_text": "Great watch, would watch again, and can recommend.\r\n\r\nProbably the worst part of this is a trend I'm noticing from some movies I've been seeing recently where they show you what could be a better movie, in the movie.\r\n\r\nWhile this starts with a \"patient zero\" style opening, they then skip past the movie I want to see to the last possible story from the opening event.\r\n\r\nThis movie does do a lot though, and has a lot of moving parts at any given time.\r\n\r\nBatista is amazing, and everyone sort of gets lost around him, I can't tell if that's because he's a giant or if the movie wants it that way: the cast all does a fantastic job in their roles.\r\n\r\nThe movie does a couple things that I don't typically enjoy in movies: smart zombies, obvious traitors, and secret motivations.  It's like if SHIELD was in \"I am Legend\" and Black Widow kept tripping everyone else to get a rare Pokemon card.\r\n\r\nThat said, they show a fantastic amount of detail and complexity to a society that is barely explored, adding a wonderful flavor to the story.", "created_at": "2021-06-19T21:16:27.842Z"}, {"movie_id": 503736, "review_id": "60e75017168ea300247bbf75", "author_rating": 6.0, "review_text": "Army of the DEAD typical zombie action movie, but its not the best that's out there. Movie starts off abit boring and then goes into hyper drive midway then slows down at the end. it was abit unbalanced but that's just my opinion.", "created_at": "2021-07-08T19:20:55.788Z"}, {"movie_id": 503736, "review_id": "61166e02151c5c00460d66ce", "author_rating": 4.0, "review_text": "Zach Snyder is a director I have an incredible amount of respect for. He has a truly original vision, he makes films unlike anyone else, and he seems to relish being a bit of an outsider who somehow gets to make whatever he wants. Sort of like this generation's version of 90's/00's Robert Rodriguez.\r\n\r\nYet, try as I might I just can't seem to actually enjoy his films. I won't bother going into it because personally I'd prefer not enjoying a wacky Zach Snyder film then being mildly entertained by most mainstream fluff that seem crafted by algorithms. \r\n\r\nIf you like Snyder's films this one will most likely be a real joy. If you don't this one won't win you over. Either way, I hope he gets to keep making his manic fever dreams because we need more films with authentic voices.", "created_at": "2021-08-13T13:05:06.969Z"}, {"movie_id": 503736, "review_id": "630bebde8f26bc007ebee534", "author_rating": 1.0, "review_text": "The only good thing about Zack Snyder's masturbatory exercise Army of the Dead, is that it's comparatively shorter than his version of Justice League – but what movie isn't? An hour and a half short of a four-hour movie is still too long, especially considering that if everything we've seen before were edited out of the film, AotD would be a short feature.\r\n\r\nTrue, we may not have seen a heist/zombie apocalypse movie, but we've seen dozens of heists and dozens of zombie apocalypses, and bringing the two genres together only serves to highlight the inconsistencies of each. But, let us start at the beginning. A US military convoy is transporting an unknown cargo from Area 51. The two soldiers in the cab of the truck debate the contents of the box (“the original draft of the Constitution written in the blood of the Founding Fathers… Amelia Earhart, long live \", etc.). Whatever it is, it’s highly inflammable, judging by how the truck instantly turns into a huge ball of fire the moment it makes contact with a considerably smaller vehicle.\r\n\r\nActually it is some kind of superhuman zombie that kills a bunch of soldiers and infects two of them. This entire scenario could easily have unfolded without the arbitrary and random explosion; the gigantic fireball is here solely because Snyder is such an impatient director that, in a 140-minute film, he can't wait even five minutes before blowing something to bits – the cinematic equivalent of premature ejaculation.\r\n\r\nOn the other hand, Snyder takes his time on plot points that we all know by heart. Hero is offered a job. Hero turns down job. Hero changes his mind and takes the job. Hero assembles team. And so on and so forth. So as to leave no cliché unused, the hero also has an estranged daughter, Kate (Ella Purnell); this, however, deserves some more attention.\r\n\r\nKate works in a quarantine camp for zombies, which is nothing short of a logic-defying concept. It is first established that the zombie bite takes immediate effect, transforming the victim into another zombie – and one does not quarantine a zombie; one shoots a zombie in the head and moves on.\r\n\r\nNow, it has always been a habit of zombie movies to play fast and loose, depending on the requirements of the script, with the time it takes for a bite to kick in, but two wrongs don’t make a right. All things considered, AotD is a rip-off that makes it a point of ripping off bad ideas – which might be all right if it were a parody, but the movie is too bloated and excessive to ever be able to take itself lightly.", "created_at": "2022-08-28T22:27:42.756Z"}, {"movie_id": 503736, "review_id": "63262f80511d090098539d89", "author_rating": 7.0, "review_text": "**What happens when you give Zack Snyder complete creative control? A crazy awesome zombie sci-fi action heist joyride!**\r\n\r\nSheer insanity at its ridiculous best! Zack Snyder goes all out with Army of the Dead by throwing as many plot ideas and spin-offs as he can to build his dream movie playground to play in for years at Netflix. Zombies plagues, zombie robots, time travel, multiverse, and who knows what else all flash across the scene and somehow don’t distract from the exciting central story. Dave Bautista leads a crew of expendable mercenaries to break into a vault in the middle of a zombie-filled quarantine zone once known as Las Vegas. The stand-out character in all this is Matthias Schweighöfer‘s Dieter. His comedy and goofiness breathe life into an otherwise wholly gritty film. The nonstop action and gore will satisfy any genre fan. Rather than the typical rescuing of a trapped loved one or VIP, I appreciate the new purpose for battling zombies - money. Zack Snyder goes full throttle, and it definitely pays off! I can wait to see more.", "created_at": "2022-09-17T20:35:12.657Z"}]