[{"movie_id": 460885, "review_id": "5b489f7fc3a3684536007782", "author_rating": 7.0, "review_text": "Saw this movie last week and disliked it at first. Without going into spoilers, I was probably in the wrong mindset to enjoy it properly. \r\n\r\nBut, it stuck with me for days later and I couldn't stop thinking about it. I ended up liking it a lot and will re-watch it as soon as I get the chance. \r\n\r\nIt's visually stunning and the soundtrack complements the visuals perfectly. Soundtrack is getting released in September and I will definitely get it.\r\n\r\nNot an easy movie to digest, even though there are some scenes that will definitely leave you wondering if they were meant as comedy or if they were just done wrong. \r\n\r\nThis mostly comes down to Cage's somewhat uneven performance - but it's nothing like Wicker Man and it only comes down to a couple of individual shots.\r\n\r\nHighly recommended!", "created_at": "2018-07-13T12:47:59.858Z"}, {"movie_id": 460885, "review_id": "5bb4e7b80e0a264c6d000fa9", "author_rating": 9.0, "review_text": "Definitely not for everyone, this is a niche-of-a-niche type of film: psychedelic-art-horror with a dash of comedy. And I loved it. Some incredible shots and scenes with tons of mind bending crap. So much going on. After a first watch, I think a few of the scenes could probably have been cut a little shorter but I don't know... I need to watch again. And I *want* to watch it again.\r\n\r\nI felt Nic Cage's particular brand of acting fit perfectly...\r\n\r\n<span style=\"background-color: black\">I think the bathroom scene, even though a little out of place, is such a classic Nic Cage scene. Jarring, the acting in that scenes was... not good, but so Nic Cage. </span>\r\n\r\nI knew going in that this was probably going to be a movie I'd like, but had prepared myself to be disappointed.  I wasn't disappointed at all. I think this is destined to be a cult classic.", "created_at": "2018-10-03T16:00:56.195Z"}, {"movie_id": 460885, "review_id": "5bb852089251410a1c005323", "author_rating": 7.0, "review_text": "_Mandy_ is very much my sort of movie. but it's still not perfect to me. Every trope that makes up _Mandy_, the neon, the synth, the gore, whatever gimmick nonsense, safe to assume I loved it. But _Mandy_ takes **so long** to get going. Normally that's not a mark against a movie in my book, but here's my problem: The entire first half of the movie that's all set-up, gave me absolutely no feel for the relationship between the two leads. It should be the most important part of the movie, it's the impetus for every worthwhile even that happened, but I honestly don't even know if they like each other. There was so much time to explore that dynamic, and they basically never did.\r\n\r\nBut then the real movie kicks in and that wasted time is sort of forgotten and you just enjoy that great, dumb, aesthetic shit.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-10-06T06:11:20.265Z"}, {"movie_id": 460885, "review_id": "5bd2539ac3a3687422000c55", "author_rating": 4.0, "review_text": "This is \"style over substance\" done to the extreme. While visually stunning, even hauntingly beautiful at times, there's utterly no point to any of it. Add to that the ridiculous and sometimes painful dialogue and extremely slow pacing, and you got quite a mess in my book. Now, that is not to say it does not have any redeeming qualities - the visual aspect is one, so is the soundtrack. And, well, Nick Cage is .. well, Nick Cage. (YOU RIPPED MY SHIRT?!)\r\n\r\nI have to assume it is an inspired watch if --and only if-- you're watching it while higher than high. That must also have been the state of those who made it, let alone greenlit and financed it, because despite having so very little to offer in terms of storytelling, it must have cost an arm and a leg to film and produce.\r\n\r\nAnyway. Unless you are extremely into artsy, pretentious, drawn-out gore-fests, give this a wide berth.", "created_at": "2018-10-25T23:36:58.903Z"}, {"movie_id": 460885, "review_id": "5be7742e0e0a263bf301c627", "author_rating": 7.0, "review_text": "Being very intrigued and in parts fascinated with Beyond the Black Rainbow from a pure cinephile perspective, I was quite eager to see a new film by Panos Cosmatos. After learning about Mandy and what it was about, and seeing it being a bigger budget and more thought-out endeavour, I was of course very eager to see it. After finally watching Mandy it feels to me that Panos Cosmatos failed to deliver on the promise of his first film's virtues, and actually re-established his weaknesses as a director. Not that this is a negative opinion on this film overall. Just explaining how and why Mandy failed my high expectations. Take those sentiments as you will. Besides elements familiar from his first film, with very carefully stylized and mostly beautiful shots and scenes overall, a dreamlike, menacing and off-worldly setting, slow and meditative pace, Mandy also managed to surprise me on several levels. I really appreciated how Mandy, the character, was written and performed, like sort of a person who naturally dislikes and distrusts people. I think Andrea Riseborough did a brilliant job here, although physically, she appeared a bit anorexic to me. I don’t know if she had weight issues that year, and I usually don’t care about those things, but in this particular case her appearance felt a bit jarring to me. But I digress. Other things that majorly surprised me is how the cult was realistically portrayed (if we ignore the biker gang), for better or worse. It's like they were very purposely demystified, in every possible opportunity. And all that in the setting of mystification and stylistic painting of the world as fantastical, which confused the hell out of me. And nothing in this regard changes toward the end. The director, I feel, even chooses to emphasize on this more and more as the movie goes on. It's worth mentioning that Cage's performance, while excellent, was not \"baroque\", how he calls some of his wild performances, but very controlled, adding little to film’s unearthly atmosphere. Most importantly, Mandy felt like a film with huge problems in both pace and elements that are tonally very disjointed, while each of these elements separately is excellent (faux fantastical setting versus the ugly reality of cult members' character and actions). Also, the part with the chemist really breaks down the narrative, in my opinion. That segment almost feels botched on purpose, Tarantino/Rodriguez Grindhouse style, which is one of the main things I disliked in their double-feature. Still, Mandy contains plenty of fascinating parts for the film to be worthy of re-watching, and is not dull or tedious in anyway. There is some point to Mandy’s fascination with pulp fantasy novels, and Red’s subsequent revenge portrayed as a fantastical quest, but this curious idea alone doesn’t help to liven up the film. Like I said earlier, this approach just doesn’t chafe well with the cult remaining a group of barely threatening and very flawed individuals. Especially given the fact Red managed to overpower a much more dangerous and menacing group earlier in the film. The movie simply fails to ramp up in any manner toward the end, while the story and style demands that. Finally, it’s just not the cult film I expected to see, and I think a lot of people felt the same, given the lukewarm scores. A kinetic, relentless, wild film, what it should have been. At least in its last third. It's just too...stilted. And sadly, I sense this is more a limitation of Cosmatos, than a strong, firm decision on his part. I am now much less excited after seeing Mandy about Cosmatos’ next film, and I think he failed to put himself on the map with Mandy. The future will show.", "created_at": "2018-11-11T00:13:34.193Z"}, {"movie_id": 460885, "review_id": "5bf2fae40e0a26266f084ded", "author_rating": null, "review_text": "_By JD Phillips, geekr.org_\r\n\r\nI think this is the strangest review I might ever write. Mostly because the film in question is a strange experience, unlike most others. It's simultaneously a brilliant piece of 80’s horror art and an overindulgent mess that never figures itself out outside its influences. Basically, it’s a film where it makes perfect sense for Nicolas Cage to scream, cry, laugh menacingly, and chug a whole bottle of vodka while on the toilet, wearing a tiger t-shirt and his tighty whities.\r\n\r\n\r\nIf that sounds horrible to you or if it sounds brilliant to you, you’re right.\r\n\r\n\r\nYou can tell within seconds that this movie is going to be a trippy arthouse ride like you’ve never seen before. Anyone familiar with director Panos Cosmatos knows his films are basically like falling through a portal on the side of a heavy metal album cover. It’s a dark 80’s grindhouse fantasy horror fest that is powerfully immersive in ways that most films don’t come close to.\r\n\r\n\r\nWhether you are watching scenes that take place within the Charles Mansonesque Jesus Freak cult, the animated tripfests, or Nicolas Cage chainsaw fighting (yes, you read that right) with a Mad Max style BDSM demon, you will find it nearly impossible to take your eyes off the screen.\r\n\r\n\r\nThat’s not to say that what you are watching will entirely be worth that attention. In the end, the film definitely feels like it’s more style over substance. It never feels like it ever reaches the heights that it sets up. It relies too much on cliches from the genre it loves to ever truly be more than a beautiful homage. If you don’t have a special place in your heart for heavy metal music and grindhouse action, there just won’t be much here for you.\r\n\r\n\r\nThat’s not to say that the cast doesn’t give their all to prove themselves. Nicolas Cage gives his most insane performance to date. Fans of his from films like “Raising Arizona” or “Adaptation” won’t find that actor here. Fans who love to watch clips of him being a mad-eyed psycho in “The Wicker Man” or “Face/Off” will want to watch this film immediately. The man forges a battle axe and takes on the forces of evil with bloody rage as you’ve never seen before.\r\n\r\n\r\nThe film drives into the actor’s wackiness and this time it really works. This is definitely a film that needed Nicolas Cage. Maybe if “Ghost Rider” would’ve embraced the B-movie potential of its star, that film would be more memorable.\r\n\r\n\r\nThe rest of the cast is pretty excellent too. Andrea Riseborough shines as the titular Mandy. She brings a unique but grounded style to the character that makes you understand why these men fall in love with her so heavily. Speaking of, Linus Roache’s cult leader Jeremiah Sand might be the best part of the whole movie.\r\n\r\n\r\nFans of “Vikings” will be pleased to hear that Roache once again throws himself into a creepily sexual role with both feet. It’s hard to match the level of weird Nicolas Cage can bring, but Roache gives him a run for his money. It doesn’t hurt that Jeremiah Sand is the best-written character of the bunch.\r\n\r\n\r\nThe rest of the cult members are pitch perfect in their roles. They all look like the director went to a bunch of real-life cults and picked his favorites. Each one brings a different kind of creep factor that really elevates the film.\r\n\r\n\r\nIn the end, “Mandy” is a wonderfully made love letter to its genre even if it fails to redefine said genre as much as it potentially could have. Its particular brand of artful bloody wackiness may not be for everyone, but those that love that sort of thing will have one hell of a good ride.\r\n\r\n\r\n**6.0 OR 9.0**\r\n_(DEPENDING ON WHICH WAY YOUR BREAD IS BUTTERED)_\r\n", "created_at": "2018-11-19T18:03:16.747Z"}, {"movie_id": 460885, "review_id": "5c3a936d0e0a2644370224ea", "author_rating": 4.0, "review_text": "Ok, I can see what Panos Cosmatos is going for; riding the 80s vibe but going for heavy metal instead of synthwave. Set in the eighties, there are plenty of references to the cultural conglomerate of the era with glam/speed/heavy metal and fantasy art, b-action machoismo, outsiderness and self-imposed isolation. It is even haunted by the counter culture seventies with the vicious religious hippie cult and their LSD fueled motorcycle gang lackeys. \r\n\r\nThough anachronistic, I can see Mandy as an attempt of a drone or sludge metal album in a movie format or concert experience, as said were more a nineties evolution. The key elements are there for all senses; excessive slow tempo, cross processed colors, heavy distortions, huge delays and massive reverbs. \r\n\r\nUnfortunately it loses itself in this gloss and ends up superficial and pretty with more tiresome slow motion that an entire season of sport of your choice. The story churns from A to B with little character or evolution. The raw expositions become flat and pretentious. The violence that should be shocking becomes a tedious grind without any build up or tension. \r\n\r\nHonestly, I wanted to like this movie. I tried to watch it as a art flick by an auteur director, as a hommage to an era and even as a deadpan pastiche. I don't know what I'm missing, because for me it ends up not a denim and studs speedball but rather a pubescent fever dream through an instagram filter. \r\n\r\nHad it not been for the multiple credible names involved and the over the top stylistic finish, I think it would have passad as a retro exploitation revenge flick without much attention.", "created_at": "2019-01-13T01:25:01.274Z"}, {"movie_id": 460885, "review_id": "5c9f37590e0a265977f837d8", "author_rating": 6.0, "review_text": "This is one weird movie. I have to confess that I am quite a fan of Nicholas Cage. I know he has made more than his share of really crappy movies but I can not help myself. When I see a movie with him in the lead role I still have to watch it. This movie is one of those.\r\n\r\nThere are definitely some interesting cinematic aspects to this movie. As a piece of cinematic art I would say that it is not bad at all. However, it is definitely weird and whoever wrote this script, well he was on drugs when he wrote it, there is no doubt in my mind about that.\r\n\r\nIt is part a grindhouse movie in the spirit of Tarantino and Rodriguez and part a far out  psychedelic visual experience. I do not regret watching it. It was a experience if nothing else. Was it a good movie in general? No, not really. The 3 out of 5 score from me is barely and it is largely due to the cinematics, a few cool (and violent) scenes and Nicholas Cage.\r\n\r\nThe movie seems to focus on delivering one weird scene after another. There is not really any explanation to most things. I especially would have liked to know more about and get more of a conclusion on this (supernatural?) bike gang. But they just show up and then they kind of disappear from the story.\r\n\r\nThe main bad-guy is an absolute nut-case but we never really get to understand what drives this weirdo. He has created some cult with a few followers but that is about it. His demise, although satisfactory, is just a show of insanity.\r\n\r\nIn short the movie is a mix of heavy metal, horror, violence and psychedelic weirdness and I would say that the audience for this movie is a quite small group of people. I’m not really sure that I am in that group.", "created_at": "2019-03-30T09:31:05.206Z"}, {"movie_id": 460885, "review_id": "5d0176d9c3a3682bdb1e7748", "author_rating": 7.0, "review_text": "**_Entertainingly insane_**\r\n\r\n> **Nick Allen**: _As a viewer, you step into a movie like this and you’re excited for its genre spectacle, but then you find out that it’s really sensitive. I was wondering how important that was to you, to have that more gentle nature?_\r\n> \r\n> **Panos Cosmatos**: _It was very important to me. I didn't want to make a purely testosterone-driven man film at all. I wanted to make a movie that everybody could connect with on some personal level. From that, I drew a little bit on my own relationship with my wife, where there are these moments where you're happy, and_ _you're alone together. Being in each other's presence. I really like the part where they're watching TV, because it feels like something everyone does with their significant other. Nobody goes horseback riding, that I know of. You eat and watch TV, or where I feel the most close to my wife._\r\n\r\n> **Allen**: _It's interesting that you say you didn't want to make a big manly movie, as Mandy seems to play with the macho aspect of it, whether it's different sizes of weapons, or Jeremiah's entitlement to Mandy. Did you talk a lot about that with your actors, or with co-writer Aaron Stewart-Ahn, when you were writing it?_\r\n>\r\n> **Cosmatos**: _Yeah, well we were interested in the male ego and what a nightmarish, poisonous mushroom that can be. But I wanted the audience, the last thing on earth I wanted to do was make a movie that plays directly to a sort-of frat boy audience, you know? I feel like if those people want to enjoy the movie, then they have to earn their way to that. Spending time with Red and Mandy, and connect with them on every level that you can. Don't get me wrong, I think there's pleasure to be had in things in our film, I just didn't want the film to just have solely stuff for that audience._\r\n\r\n- \"Panos Cosmatos on Crafting his Heavy Metal Valentine, _Mandy_\" (Nick Allen); _RogerEbert.com_ (September 12, 2018)\r\n\r\nEqual parts psychotropic horror and grindhouse revenge thriller, _Mandy_ is what you might get if David Lynch, Stanley Kubrick, and Andrei Tarkovsky teamed up to remake Michael Winner's _Death Wish_ (1974) in the style of a Giallo. The second feature from director and co-writer Panos Cosmatos, after the interesting, but not entirely convincing _Beyond the Black Rainbow_ (2010), _Mandy_ is a psychedelic experience in pretty much every way, and as midnight-y as a midnight B-movie could possibly be. And although it would be impossible to recommend to everyone, there is an undeniable brilliance here. An insane brilliance. But a brilliance none-the-less. Although it could (somewhat legitimately) be accused of too much style and not enough substance, Cosmatos pitch-perfectly mixes an expressionist aesthetic with horror tropes, a generic revenge narrative, and comedy beats. But let's face it, the reason most people will see the film is for Nicholas Cage, and in that sense, _Mandy_ joins the ranks of films such as Robert Bierman's _Vampire's Kiss_ (1988), Werner Herzog's _Bad Lieutenant: Port of Call – New Orleans_ (2009) and Brian Taylor's _Mom and Dad_ (2017) in giving Cage an organic, narratively justified reason to go full-Cage, digging deep into his reservoir of batshit insanity. And that's never a bad thing.\r\n\r\nSet in \"1983 A.D.\", the film tells the story of Red Miller (Cage), and his girlfriend, aspiring fantasy artist Mandy Bloom (Andrea Riseborough), who live a simple secluded life in the Shadow Mountains, in a cabin on the banks of Crystal Lake. Hugely supportive of one another, it's hinted that Red may have been an alcoholic and/or drug addict in his youth, whilst Mandy has a significant facial scar, possibly the result of a troubled childhood, which she alludes to from time to time. All is calm in their life until Mandy is spotted by the Children of the New Dawn, a religious cult led by failed folk singer Jeremiah Sand (Linus Roache). Taken with Mandy's beauty, Sand tells his right-hand-man, Brother Swan (Ned Dennehy), that he wants Mandy, saying \"_you know what to do_.\" Using the \"Horn of Abraxas\", Swan summons the Black Skulls, a trio of demonic bikers addicted to a highly potent form of LSD, and along with the Skulls, the Children invade Red and Mandy's cabin, tying Red up in barbed wire outside, and leaving him for dead. Meanwhile, two female Children, Mother Marlene (Olwen Fouéré) and Sister Lucy (Line Pillet), drug Mandy with LSD and venom from a giant wasp, before presenting her to Sand. Singing his own song, \"Amulet of the Weeping Maze\", Sand attempts to seduce Mandy, but things quickly go awry when he proves unable to get an erection. Unbeknownst to the Children, however, Red has survived and set out in pursuit of both the cult and the Skulls.\r\n\r\nOne of the things that will jump out at you as you watch _Mandy_ is that Cosmatos packs the narrative with an extraordinary amount of cultural references, some oblique, others more obvious. Prior to hearing any dialogue, there is an audio extract of President Ronald Reagan speaking about how the vast majority of Americans are disgusted by porn. Mandy's art is not dissimilar to the work of Roger Dean, whilst the film's animated sections (of which there are several) recall the kind of material found in _Heavy Metal_. Indeed, the general aesthetic of the film is equal parts _Bat Out of Hell_ and Iron Maiden. The Children of the New Dawn cult is obviously inspired by the Peoples Temple of the Disciples of Christ and the Manson Family, with Sand himself part Jim Jones, part Charles Manson, and part Dan Fogelberg. The home invasion scene bears more than a passing resemblance to similar such scenes in Wes Craven's _The Last House on the Left_ (1972) and John McNaughton's _Henry: Portrait of a Serial Killer_ (1986), whilst the revenge narrative has something of George Miller's original _Mad Max_ (1979) about it. The film also recalls Nicholas Winding Refn's _Valhalla Rising_ (2009) in places. Sand's \"Amulet of the Weeping Maze\" is inspired by the work of The Carpenters (which he admits himself). Red is seen wearing a Mötley Crüe t-shirt, and tells an awesome Erik Estrada/_CHiPs_ (1977-1983) joke. During a discussion about which planet is their favourite, Mandy selects Jupiter, but Red argues for Galactus. The Black Skulls are obviously inspired by the Cenobites from Clive Barker's _Hellraiser_ (1987). The Children's A-frame chapel resembles the church in Paul Thomas Anderson's _There Will Be Blood_ (2009). This is as culturally-literate a film as you're likely to see all year, and as much as the narrative exists in a kind of shattered-mirror version of reality, these references do help ground it, even if many of them are purposely anachronistic.\r\n\r\n_Mandy_ gets off to a cracking start by using the old Universal logo, complete with scratches and dirt on the celluloid. It follows that up with the most pseudo-John Carpenter 80s music imaginable, composed by Jóhann Jóhannsson (_Sicario_; _Arrival_; _mother!_), in one of his last compositions prior to his untimely death, with guitar chords played by Stephen O'Malley of Sunn 0))). To give you an idea of the type of music featured throughout the film, there's an early shot moving across the forest scored to King Crimson's \"Starless\". Indeed, the score is almost another character entirely, and the film simply wouldn't work half as well if the music wasn't as good.\r\n\r\nAside from the music, the most immediately attention-grabbing aspect of the film is the use of colour, with director of photography Benjamin Loeb's compositions bathed in deep purples, reds, indigos, yellows, greens, and oranges, with the occasional blue (primarily associated with Mandy herself). Often the colours are non-diegetic and unexplained (for example the Horn of Abraxas always appears in green light, irrespective of location). The cinematography also employs a plethora of subjective techniques, such as double lens flares, animation, slow-motion fades and dissolves, telephoto shots, what can only be described as psychedelic lighting, and a hell of a lot of dry ice.\r\n\r\nVery much a film of two halves, if the first brings us the gates to hell, the second pushes us in and slams the gates shut behind us. The first half runs up until just prior to the beginning of Red's revenge, whilst the second depicts that revenge. The first half focuses primarily on Mandy, with Red very much a supporting character, whilst the second, obviously, focuses on him. However, it's not just in terms of narrative content in which the two halves differ, they are also aesthetically different, particularly the editing rhythms. The first is languid and dream-like, almost graceful, whilst the second is like something out of Dante Alighieri or William Blake, filtered through H.R. Giger on acid. The two halves are divided by an extraordinary single-shot 45-second scene of Red (wearing only underpants and a t-shirt) pouring vodka all over his wounds, drinking what's left, and screaming. It's a scene of extraordinarily raw emotion that works brilliantly, partly because scenes like it are so rare. You simply don't often see a male protagonist this vulnerable. This is _Mandy_'s \"suit up\" scene, and here is Cage crying like a starving baby. It's a brave choice by both actor and director, and it works perfectly both as a stand-alone scene and as a transition from the first to the second half of the film. Indeed, it's not beyond the realms of possibility that one could read _Mandy_, at least in part, as a meditation on the destructive nature of profound grief, and if so, that interpretation begins right here. Yes, there is more than a hint of an archetypal dualistic cosmology underpinning Red's revenge, particularly Zoroastrianism and Manichaeism, but so too is it a deeply personalised quest.\r\n\r\nEspecially in the second half of the film (and particularly in the last few minutes), Cosmatos strives to place us in Red's head, which has the effect of elevating the carnage beyond that of your standard ultra-violent revenge movie. As Red's mission progresses, and he becomes more and more unhinged, so too does the film become less and less interested in what we would refer to as reality, introducing such aspects as cannibalism, a bow named \"The Reaper\" and arrows which \"_cut through bone like a fat kid through cake_\", a chemist who can smell where the Black Skulls are, a stoned tiger, eels, a cigarette being lit via a flaming body part, choking via knife, (several) decapitations, a chainsaw duel, a church in the forest with secret underground passages, a skull crushing, hallucinations, even a cosmic event.\r\n\r\nThere are some problems, however. For starters, it's kind of disappointing when you realise that for all its technical prowess and fascinating aesthetic gymnastics, when it comes down to it, _Mandy_ is just a revenge flick, and at just over two hours, it tends to drag a little in places. The screenplay (by Cosmatos and Aaron Stewart-Ahn) can also be too on the nose at tunes. For example, early in the film, Mandy tells a story about her father attempting to force her to kill a baby starling that proves tonally prophetic in the way only stories in films ever doesn't give Red a huge amount of depth.\r\n\r\nIs there an element of the emperor's new clothes about the entire endeavour? Yes, to a certain extent there is. And, yes, most of the best bits are in the trailer (or at least are spoiled by the trailer – the chainsaw duel would have been much funnier if I hadn't known it was coming). And yes, it's all kind of pointless. However, love it or loathe it, there's no denying it's brilliantly assembled. As an audio-visual experience, it's unlike anything I've seen in a long time, and it's almost certainly destined for cult status.", "created_at": "2019-06-12T22:04:09.428Z"}, {"movie_id": 460885, "review_id": "5f965124fcf9070036e9ec12", "author_rating": 7.0, "review_text": "\"Mandy\" is a surreal mind trip of a movie. Shot in reddish-neon colors with a haunting bizarre soundtrack, it starts with logger Nicolas Cage as the most grounded and mellow he's been in years as he cuddles with his girl Mandy in a bedroom with floor-to-ceiling windows in the forest somewhere. When a skeevy cult leader lusts after and kidnaps Mandy after a random drive by, the inner \"Cage\" beast is released. \r\n\r\nTo say this movie is bizarre is an understatement, The mood lighting, odd musical score, and half-crazed characters create an unsettling mix that provides the backdrop for a Cage when he goes completely off the rails. If you are a fan of Cage when he gets in these fits, you'll love it. If not, then skip it, although you'll miss an epic chainsaw battle for the ages.", "created_at": "2020-10-26T04:31:32.256Z"}, {"movie_id": 460885, "review_id": "5f9652361cc4ff003643e6ac", "author_rating": 7.0, "review_text": "\"Mandy\" is a surreal mind trip of a movie. Shot in reddish-neon colors with a haunting bizarre soundtrack, it starts with logger Nicolas Cage as the most grounded and mellow he's been in years as he cuddles with his girl Mandy in a bedroom with floor-to-ceiling windows in the forest somewhere. When a skeevy cult leader lusts after and kidnaps Mandy after a random drive by, the inner \"Cage\" beast is released.\r\n\r\nTo say this movie is bizarre is an understatement, The mood lighting, odd musical score, and half-crazed characters create an unsettling mix that provides the backdrop for Cage when he goes completely off the rails. If you are a fan of Cage when he gets in these fits, you'll love it. If not, then skip it, although you'll miss an epic chainsaw battle for the ages.", "created_at": "2020-10-26T04:36:06.442Z"}]