[{"movie_id": 9270, "review_id": "5346d6110e0a265fec001c03", "author_rating": 8.5, "review_text": "With its hip lyrics and 50's styled character speak BRICK is an instant classic. It has a streak of REBEL WITHOUT A CAUSE in it. The eclectic arrangement of the deranged is inventive and full of texture. I own it and watch it often!", "created_at": "2014-04-10T17:34:09.561Z"}, {"movie_id": 9270, "review_id": "5ed83dfbfea0d7001d8aadf1", "author_rating": 10.0, "review_text": "Brick is a detective/noir film but to the viewer’s surprise, in a high-school setting. It is written and independently directed by Rian Johnson. At the mention of any movie revolving around high school or teenagers, all that comes to mind are the various stereotypes but this movie gives a surprise to the viewer.\r\nThe story revolves around a particular, rather abrupt and frantic phone call received by the high school misfit, Brendan Frye (Joseph Gordon-Levitt) from his terrified ex-girlfriend, Emily Kostich (Emilie de Ravin) who begs him for his help. Brendan vows to investigate and solve her murder himself and is - in the process - forced to mingle with the very same high school stereotypes that he so diligently avoided. The character of Brendan is quite the risk taker, fearless to investigate all possible sources of information with the help of his only friend and a stereotypical nerd ‘The Brain’. With his vigilant tactics, he is determined to get his way into the neighborhood’s suspicious drug and crime network connected by some of the high school students and the local gang/drug leader ‘The Pin’; in order to get around to solving the mystery.\r\nRian Johnson took some time to write the script which took inspiration from multiple sources like the noir film era of the 30s-40s. While taking its plot and feel from the celebrated American author Dashiell Hammett’s detective novels, the film is also largely inspired by the Anime “Cowboy Bebop”. Brendan’s character shows a huge influence of the lead character from the anime. Rian has focused greatly on minute details. Each character in the film has a connection with the other making the plot more complex and intricate. Also, a really vague (or maybe not so vague) thing I observed was the alliteration. The title of the film is “Brick”, the characters are “Brendan”, “Brain” & “Brad”. I think this was done deliberately to provoke the thinking of the audience.\r\nA hard to miss fact is that there are only two adults in the movie. One, The Pin's mother; she is in the kitchen as her son makes his deals, making breakfast and pouring juice for his friends, while the film's only other adult, the school vice-president who is using Brendan as an informant. Another amusing writing wonder was the absence of education and parents from the entire high-school/ teenage setup. Small humorous elements keep the film going. The scene when Brendan reaches the coffee place and messes with the straw (a kid is drinking juice from) there will surely make one laugh. Another one is when The Pin’s mother searches for milk to serve Brendan and her son is there with his muscle power making a crime deal.\r\nNow coming to another major aspect that makes the film do wonders is the cast: led by a young Joseph Gordon-Levitt as loner Brendan Frye. It is a film that he made before he was getting big. He was in that transitional phase between child star and adult actor and this is one of the first movies that displayed the true talent that he really has. His character shows such grit that he takes huge amounts of beatings from “Tugger” just to meet “The Pin” Some of the other characters in the film that steal the show are that of the local drug lord “The Pin” played by Lucas Haas and the geeky/nerdy character of “The Brain” played by Matt 0’Leary. It was so enticing that a big number of fan theories suggest that the character of Brain didn’t exist at all and it was just Brendan taking the help of his conscience. Basically, like Sherlock’s ‘Mind Palace.’\r\nThe visual set up, lighting and sound design also perfectly compliment the vibe of the film, with effective variations to fit the intensity of what is going on. For the kind of small budget involved; a short 20-day shooting period; the use of feasible editing; production and VFX equipment, the film definitely does not disappoint on screen. The edit team did a great job on the various transitions involved. The ones that mesmerised me in particular were the ‘time transitions’ and the ‘light to dark transitions’. In a couple shots, the scene transitions into another with the focus on the digital clock in Brendan’s bedroom. As a lover of inventive cinematography, the biggest standout for me was the framing, everything is shot from a lower angle, and many characters are defined as much by their shoes as anything else. DP Steve Yedlin made a point that each character’s establishing shot begins with their shoes (making the audience more curious and confused) and then gradually reaches to a close-up. This creativity is well-thought and well-executed. The impressive background score is composed by director Rian Johnson’s own cousin Nathan Johnson. It is mainly made up of Xylophone-like sounds but during fight scenes it shifts to percussion sounds and strings sounds during intense/climax scenes. The combination score is a mixture of both traditional and home invented instruments giving a strange balance in the background.\r\nBrick is a thoroughly enjoyable film, an experimental debut by the director that was surely a huge risk. It is a perfect homage to the noir classics and at the same time, it is a dark and effective take on a high school student’s life belonging to a small town. The viewer is intrigued by the blunt character of the protagonist and is forced to get into his universe. However, those who are not fascinated by indie/experimental films in general might find it boring or confusing. But it surely won’t disappoint anyone.", "created_at": "2020-06-04T00:19:07.891Z"}]