[{"movie_id": 267860, "review_id": "57602d6b925141660700145a", "author_rating": 6.0, "review_text": "> From an action packed flick to a game mode!\r\n\r\nThe first film was a decent entertainer, I kind of liked that and a box office hit as well. So the producers saw an opportunity to bring another film and yep, this film did slightly better than the original, but the product was qualityless. The graphics were just okay, but overall very poor in those blow-up scenes which were the most essential for a theme like this.\r\n\r\nNot all, though some of the action sequences were terrible and the story was very weak. In fact, there's no story, the whole film was an action- thriller just like the previous film. But that's how this theme revolves, yet as a one, it is a bit disappointing follow-up without surprises. Anyway, I'm with the original film director who backed out of the project for giving him a bad script to direct.\r\n\r\nSo the London is the latest victim of the plot for the US president's assassination. Particularly this 2nd part looked so much more alike a computer game than actors who are exhibiting their roles. Like the London is a battlefield and level after level the story making its progress till the game over, but we know who wins in the end. I don't know whose performance was much better, because I did not find anyone with par to appreciate.\r\n\r\nWhat this film did at the box office was a miracle, so I don't think the filmmakers go for another script anytime soon. But if they do, I'm wondering which capitol would be the next victim of a terror attack. Expecting Tokyo or Canberra, especially Mumbai would be an ideal location. This is not a bad film, you can try it once, but watching it like sitting next to who's with xbox joystick.\r\n\r\n6/10", "created_at": "2016-06-14T16:14:35.802Z"}, {"movie_id": 267860, "review_id": "594a19be925141456a0088d3", "author_rating": 4.0, "review_text": "_If Olympus Has Fallen_ wasn't big enough and dumb enough for you, try _London Has Fallen_!\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-06-21T07:01:18.321Z"}, {"movie_id": 267860, "review_id": "642b164d9cc67b059cc53a22", "author_rating": 1.0, "review_text": "**Real name of this film: How to insult half the allied countries in the name of one's own ego.**\r\n\r\nOccasionally, American cinema seems to need an injection of idiotic nationalism. “Olympus Has Fallen” did that, but there are still some technical and entertaining qualities there. This film fails to do the same, besides treating other countries (especially the British) like morons. And so, Americans continue to think they are the greatest nation in the world and to compete with others like teenagers measuring their… you get the point.\r\n\r\nThe film is a sequel to “Olympus” and shows how the American president will escape by a hair (it can't even be considered a spoiler to say this, because the plot is so cliché that we already know more or less what will happen here in the act in which we decided to see the film!) to a terrorist attack which, in fact, is more like an act of war. Yes, a terrorist decides to send an army to kill Western prime ministers and presidents who gather in London for a state funeral and all the police and security agencies in the West were asleep and didn't see them. As expected, God saves the Queen and the entire Windsor family, who are not even targeted by the attacks and continue to have their tea in Buckingham without appearing in the film. On the other hand (or maybe a bonus?) the British still have the unusual pleasure of seeing the French president become food for fish in the River Thames... but, judging by the continued protests in France for a few years until now, perhaps the French are not mourning their loss...\r\n\r\nI know I'm being deeply sarcastic, but there's no other way to watch this movie without feeling deeply insulted. The way the film places the USA as the greatest thing in the world and belittles allied countries, (but) direct competitors in defense and economy (Canada, Germany, UK, France, Japan, Italy etc.) makes us want to watch the US committing failure after failure which, in real life, ends up happening. Seeing all the international leaders casually strolling and dating when, in real life, they would be surrounded by security guards on their way to the ceremony is a very incorrect idea of how these events are organised. But it's wrong to expect a movie like this to care about things as silly and puerile as that thing called verisimilitude. When you have tons of action and a world-renowned city being blown up like a village in Syria or Afghanistan, what does it matter if all that stuff is credible? There might even be Mickey Mouse there with a machine gun! Who cares?\r\n\r\nAs for the cast… what can we say? We can say that, certainly, the fee was good, and that the film did wonders to the bank balance of the actors, in particular Aaron Eckhart, Morgan Freeman and Gerard Butler, who did not have to make any effort to play the characters and who are here for the money. And if we take into account that Freeman is the most outstanding actor, and even he is far from revealing the enormous talent that we know he has, that says a lot about the overall performance of the cast, doesn't it?\r\n\r\nThe film tries everything to entertain, but fails. The weakness of the dialogues and the meager attempts to introduce humor would have deserved a punch in the face of the screenwriter who wrote them, who must have thought that we, the audience, don't have a brain. The action scenes are noisy, with the Americans running around London like a bunch of cowboys shooting and blowing things up, but the special effects and CGI are extraordinarily weak. Editing is another problem: unlike the previous film, which practically threw us into the middle of the action without much foreplay, this film drags on in the introduction without it being very necessary. What do we care if the Canadian PM's daughter fails her driving test, or if the German Chancellor likes men in uniform? And if Freeman's character is so fond of fishing, after this film he can go to New Bedford, Massachusetts, and choose the biggest boat he can find there.", "created_at": "2023-04-03T18:09:17.218Z"}, {"movie_id": 267860, "review_id": "64ecabc3c613ce00ac42d384", "author_rating": 7.0, "review_text": "Great storyline of the movie but not as much action as the first. They went with the more drama side of things on this movie.", "created_at": "2023-08-28T14:14:27.538Z"}]