[{"movie_id": 316154, "review_id": "595265b9c3a36813880245ee", "author_rating": 5.0, "review_text": "_The Bad Batch_ ticked so many of my aesthetic boxes going in, that I didn't see any possible way that I could hate it. And I didn't, but it does make me worry, that if someone like me could come out of _The Bad Batch_ just \"liking\" it, then how will a more general audience respond? My assumption is that it's probably not favourably.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-06-27T14:03:37.654Z"}, {"movie_id": 316154, "review_id": "59d5ab9c9251417f400073a1", "author_rating": 3.0, "review_text": "I liked the look of this film. It reminded a lot of Fallout 4, especially the two major settlements could be made into settlements in the game easily, and the special effects were amazing. What I didn't like was the story, as it confused the hell out of me. I couldn't understand the motivations of the main character, or really any other character in the movie as they really gave no reasons for anything they did nor could those motivations be inferred, and the lack of dialogue meant no one asked why about anything. Or if anyone questioned anything, the best answer you get is thats just the way it is. I could accept that if what it was made any sense, and most of the time it didn't. I'm going with a bold idea that was mishandled.\r\n\r\nFinal rating:★½ - Style over substance.", "created_at": "2017-10-05T03:48:44.577Z"}, {"movie_id": 316154, "review_id": "5a7723770e0a26642d04d724", "author_rating": 5.0, "review_text": "**In the land of savages!**\r\n\r\nThe overall concept was good, but I did not like the initiation. I don't like any film of cannibalism. I don't know why such films are made. What's the point! Definitely not entertainment or art. It could only encourage such savage culture. So I thought I made a mistake picking it to watch. Except the opening, the rest of the film was different. Then ended as a just below average product.\r\n\r\nIn a near future, where all the criminals, illegal immigrants are dumped in a waste desert land. So they have made their own system, divided by two. One the savages and the other is kind of civilised, but not without flaws. A new arrival who experience from both the end, had to decide where she belongs when a series of bad events had taken place.\r\n\r\nHere comes another film from a woman director. Her previous film was one of the worst in the history of filmdom. And again this is not her best work either. Though I liked the cast. They all performed well, particularly Jim Carrey. Yes, I did not recognise him at first. Then there's Keanu Reeves. But Waterhouse was good. I wish her a good future. Generally not recommended, but then it's your choice!\r\n\r\n_5/10_", "created_at": "2018-02-04T15:15:03.762Z"}, {"movie_id": 316154, "review_id": "5f195548519bbb00336f116f", "author_rating": 2.0, "review_text": "My ten word review:\r\n\r\n_Just your average beautiful looking but utterly non-sensical indie film._\r\n\r\nClick here for a video version of this review: https://youtu.be/IpZ5m4fbq1E", "created_at": "2020-07-23T09:15:52.081Z"}]