[{"movie_id": 315664, "review_id": "580e4a3ec3a36859a4001ce4", "author_rating": 8.0, "review_text": "**Nothing is greater than to have a supportive life partner by side.**\r\n\r\nI follow closely what films are announced and what are getting released. Sometimes its common that some films comes out without my knowledge, particularly non-Hollywood English language films. This British film was about a wealthy couple from the New York, especially the husband who tries his best to fulfill his seriously ill wife's dream to be an opera singer. The problem is she's not any good. Not just him, but everybody who is close to them and once laughed at her, try to understand them and give their support. But not all the occasion seems to remain the same. So on one such a big event, the disaster strikes and how it affects the couple is the rest of the tale to disclose.\r\n\r\nA very surprising film. I thought it was just a comedy like it brings small smiles on our face, but I laughed out loud on many occasions. This is definitely a right time, because I felt like it was a music and cinematic version of the American presidential candidate Don Trump. Yep, there not much difference, but still this film is some way inspiring, not Trump. It says you must never give up on your dream. As much as you laugh watching it, as much you realise how hard chasing a dream to be if one is very passionate about something, but does not have the talent to reach the height. The message is very similar to the film 'Eddie the Eagle'. Do you think everybody got talent in the world, so I believe you should watch this and you will know why I'm telling you to watch it.\r\n\r\nWhen I read about the film's storyline, I thought it was so silly. But when I learnt it is a biographical film, that interested me to have a look at it. It is truly an unbelievable film, in a sense of humour and overall a good way. The couple was rich, so they could do anything they want just like what Donald Trump believes. But both the things are not the same, especially this one is more about the real life struggle against the odds. In some parts, it gets more emotional and I loved that final line said by the wife. It's always, the participation that counts, not how you fared it.\r\n\r\nOh my god, another Oscars nominee is almost certain for the record holder Meryl Streep. Hugh Grant was equally amazing and this is one of the best of him I have seen, particularly in the recent times. One of the best main roles for Simon Helberg, he was not next best after the Streep and Grant. I still feel this film is underrated. The director of 'Phenomena' was very good at handling the stuff for the film to get its best shape. I think this is one of this year's must see film and surely recommend it to all.\r\n\r\n_8/10_", "created_at": "2016-10-24T17:51:58.841Z"}, {"movie_id": 315664, "review_id": "63575b0cf8e98200817c9ad7", "author_rating": 10.0, "review_text": "**One of the best and most elegant comedies I've seen in recent times. Bravo! Bravíssimo!**\r\n\r\nThere aren't enough adjectives for someone like Florence Foster Jenkins. On the one hand, it's beautiful to see someone who doggedly pursues the dream of a lifetime. On the other hand, the technical incapacity of this well-meaning and friendly lady for the task to which she so wanted to dedicate herself is quite evident. She didn't know how to sing, she didn't really care about it, and she wouldn't allow anyone to try to advise her against. As she said before she died, no one can say she didn't sing. I don't know exactly if the film was faithful to the real Foster Jenkins… I don't know her life and her historical figure that well. However, I want to believe so.\r\n\r\nThe movie is truly funny, and the script is delicious. This movie had everything to not be very interesting, but it turned out to be a little gem and one of the funniest family comedies I've seen in a long time. Interestingly, it never addresses an issue, which is Florence's poor health, greatly affected by the syphilis she contracted from her husband, from whom she soon separated, and which she never treated properly. The dialogues were very well written and deserve to be listened to carefully.\r\n\r\nBut what makes this film truly precious is the extraordinary performance by Merryl Streep. I have no doubt that it must have been difficult for the actress, who has good vocal qualities, to sing so badly, but she is deeply committed and gives Florence Foster Jenkins an unusual and extremely pleasant sweetness. In fact, Streep even seems to have fun with this job and her character. Hugh Grant, back in the movies after a break in his career, is also in good shape and does a good job. A further note for the good support work by Simon Helberg, Rebecca Ferguson and David Haig.\r\n\r\nTechnically, the film relies heavily on the adequate and historically accurate recreation of the entire historical period in question. I really liked the cars, the sets and the costumes, particularly those designed for Streep. The cinematography is good but understated, and the effects do their job without distracting us from the humor, witty and elegant. Alexandre Desplat writes a very competent soundtrack, but the film would not work well without the priceless and hilarious performances of Streep and Helberg, in singing and piano, recreating as far as possible some of the still existing recordings of the true “diva of din”, the which can be heard over the end credits, where some authentic recordings were used.", "created_at": "2022-10-25T03:42:04.404Z"}]