[{"movie_id": 60304, "review_id": "51cd332f760ee35e0e0aea08", "author_rating": 6.0, "review_text": "Nice fantasy and action movie. Interesting to see again Gemma Arterton and good FX but nothing else to remark.", "created_at": "2013-06-28T06:54:39.842Z"}, {"movie_id": 60304, "review_id": "5a57be43c3a36825ab003936", "author_rating": 8.0, "review_text": "This is a movie which you watch for the action and the special effects and pretty much nothing else. As such it is a excellent movie. The original story of Hansel & Gretel is essentially only used to boot this movie. The movie itself plays out when Hansel & Gretel are adult witch hunters.\r\n\r\nThe movie is pretty much action all the way. It is fairly violent and goory action at that. It is not a movie for the kids. To me this is an advantage. I do not think I would have liked it as much if they had dumbed it down to a standard PG-rated Hollywood creation. I really enjoyed the hard-ass Hansel & Gretel duo kicking witch ass in so many way.\r\n\r\nThe special effects are not bad and the medieval yet kind of modern weaponry that Hansel & Gretel swings around are quite cool looking. Not very believable perhaps but then neither are witches so… The witches themselves are also fairly cool. Especially the witch-gathering near the end of the movie is indeed a grim (ha ha) collection of freaky creatures.\r\n\r\nI was not too thrilled about the idiot law keeper. His utter stupidity bugged me throughout the entire movie. I really whished they would have dragged out the end for him a bit more. Well he did meet a suitable end at least.\r\n\r\nOverall, I enjoyed this movie a lot. If you though this was to be “just” a Hansel & Gretel movie the you are probably going to be disappointed. I knew more or less what I went for so I was just enjoying myself. I was surprised at the level of gore, exploding heads, troll-squished humans etc… but, as I said above, I think it was a good thing that they did let it be done in the way the producer/director obviously intended for it to be made.", "created_at": "2018-01-11T19:42:59.715Z"}, {"movie_id": 60304, "review_id": "5cd5bb8d92514173973b85f8", "author_rating": 9.0, "review_text": "***Kick axx continuation of the sylvan fairy tale about slaying diabolical witches***\r\n\r\nIn Medieval Germany, Hansel & Gretel (Jeremy Renner & Gemma Arterton) are now adults and formidable witch slayers, not to mention considered heroes in the community. When numerous children turn-up missing, they trace the problem to an unholy celebration orchestrated by a grand witch (Famke Janssen). Fetching Pihla Viitala plays a redhead villager accused of witchcraft.\r\n\r\n\"Hansel & Gretel: Witch Hunters\" (2013) is a dark fantasy/action/comedy/horror that takes the German fairy tale by the Brothers Grimm and envisions events about twenty years later. Imagine the excellent “Season of the Witch” (2011) meshed with the fantasy elements of the fable and you’d have a good idea of this movie. “Dracula Untold” (2014) and “Snow White and the Huntsman” (2012) are good contemporary associations, but “Hansel & Gretel: Witch Hunters” is noticeably superior.\r\n\r\nThis movie just kicks total axx from beginning to end with Gemma jaw-dropping as the take-no-sheet heroine and Renner rising to the challenge. The witches are ee-vil and worthy of nothing other than immediate slaughter, which is basically the siblings’ modus operandi. There’s a lot of thrilling action and gore, some of it so over-the-top it’s amusing; there’s even a terrible troll. And the movie LOOKs great. If you like dark woodsy adventure and don’t mind fantasy, don’t miss out on this excellent film.   \r\n\r\nThe film is doesn’t overstay its welcome at 1 hour, 28 minutes; and was fittingly shot completely in Germany.\r\n\r\nGRADE: A", "created_at": "2019-05-10T17:57:33.621Z"}, {"movie_id": 60304, "review_id": "64d4b6abdd926a01e627a66d", "author_rating": 6.0, "review_text": "This might have done better had they just stuck to a plain old witch-hunting adventure film, rather than embroil us in a rather dull familial back story that really just clutters the whole thing up. If you are familiar with the fairy tale, you will know that \"Hansel\" (Jeremy Renner) and sister \"Gretel\" (Gemma Arterton) were enticed to the house made of sweets by an evil witch. On the menu, luckily they are able to turn the tables on her and it is her who goes into the oven rather than them! Ten years on, and our siblings are legendary and regularly summoned to rid other villages of their menaces. It's on one such mission the they discover that an impending Blood Moon is going to empower an whole coven of witches who have already stolen a dozen innocent children to use as ingredients in a broth. Can they thwart this (actually quite appealing) plan? Well along the way they make some friends and some foes before quite a spectacular, if I felt rather disappointing, denouement. There is an hint of chemistry between Renner and a distinctly underwhelming Arterton, Famke Janssen fares fine as the nasty \"Muriel\" and when it works, it's quite a pacy and enjoyable fantasy. There's way too much dialogue though, and when we start to delve into their past, I started to delve into the Maltesers. It's fine, and actually does look better on a big screen as the cinematography and visual effects are good enough. It's just a missed opportunity to darken this myth and deliver something just a little more evil! Watchable, just not memorable.", "created_at": "2023-08-10T10:06:35.328Z"}]