[{"movie_id": 369557, "review_id": "57b503249251413d44000085", "author_rating": 9.0, "review_text": "> Back to the 80s with rock and roll and romance.\r\n\r\nI seriously thought this might be an overrated film. I knew it was too early to judge it, so I was not expecting anything extraordinary and then it struck me with its progress, I was clean bowled by its style and cuteness. I don't what others think, but this is John Carney's masterpiece according to me. I liked his other films, but this is something I think a perfect dose of contents. In two words to say it is a Golden Touch. I rarely like music and musical films, and it had been long since one I had enjoyed very much like this. Definitely this should be one of the top ten films of the years.\r\n\r\nThis is an Irish-British film that is set in the Dublin, 1985. It is about a high school boy named Conor, who just got transferred from a private school to a free state-run boy's school after his parents imposed a plan on the budget cut. New school and problems are ahead where he has to come out of it on his own. During getting used to it, he meets a girl who lives nearby the school and to impress her, he lies that he has a band and looking for a female singer. So then he forms one with the amateur musicians and the journey begins for these teenagers that reveals in the remaining film how long they are willing to go.\r\n\r\n> \"Your problem is that you're not happy being sad. But that's what love is, Cosmo. Happy-sad.\"\r\n\r\nAt the end of the final scene, there is a note that says 'For brothers everywhere'. I was impressed by that, because I did not pay attention on that while watching the film. What I meant was, this is not some teenage love story, actually it was about the brothers, but overshadowed by romance theme. I recalled my memories on those parts and quickly realised the centre of the story that how it was developed. The one who played the older brother of Conor simply looked alike Seth Rogan and that is the character you have to watch out for. He's only a supporting character, but the impact was indirectly larger on the story.\r\n\r\nOf course, falling in love might make you do crazy things, even you can become a rockstar overnight. But there's a first step for everything and it is not assured that you will be succeed by those attempts. That is where comes the experienced hand, the brother, a close friend who stood by us since our birth. It is easy to fall in love, but it is not easy to have a brother who guides us in every move on that.\r\n\r\nIn this film the sreenspace between them was very little, but that did not stop to disclose how one's inspiration that got from love to mold accurate shape and to lead the right path. I don't have any brother, but I felt how it would be to have one. So all the brothers in the world must see it, this is dedicated to them.\r\n\r\n> \"It's like when you don't know someone, they are more interesting. They can be anything you want them to be. But when you know them, there's limits to them.\"\r\n\r\nI did not grow up in the 80s, but was very close to it and I know how it would feel to be born in that generation. Jeans, thick hair and curls, everybody was so thin, weird make-ups with strong eyeliner, big eyeglasses, cassettes, you would love this film if you remember those stuffs from your fading memories.\r\n\r\nA very stylish music-comedy and on the romance side, this film was very cute. All the actors were brilliant, especially the lead boy whose first film was this and the girl amazing with her totally electrifying look. They both going have a great future in filmdom. Not to miss out the supporting cast who did their part so well, especially the brother I talked about in the other paragraph.\r\n\r\nAll the sound tracks were awesome. I should start adding them to my 'film songs' collection, especially 'The Riddle of the Model' which defines this title and the film's climax song 'Go Now'. So from the cast to crew, equal credits must given to the music composers and lyricists from the real 80s bands. The film had a perfect runtime, I would have had no issue if it was extended for another half an hour.\r\n\r\nThe pace of the narration always kept in a same position, but towards the final quarter it has gone up. Yes, I loved the ending, it was touching, but I don't know how to describe it, only one can experience it by himself. A film I watched without any anticipation, now it is one of my favourite films. Todays generation might take it as another rock and roll inspired theme, but only the middle aged guys and some old ones would know how to enjoy it. So don't miss it out if you are one of them.\r\n\r\n8.5/10", "created_at": "2016-08-18T00:36:52.237Z"}, {"movie_id": 369557, "review_id": "57cfd4709251411dcd002c2b", "author_rating": 8.0, "review_text": "Take it with a grain of bias, because I too went to a Christian Brothers school and hated it, but I absolutely adored _Sing Street_.\r\n\r\nIt rehashes a lot of things you will have seen before, but if you're a lover of the 80's, alternative music, coming of age stories or even just good cinema, you could do a lot worse than _Sing Street_.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2016-09-07T08:48:48.843Z"}]