[{"movie_id": 13825, "review_id": "53c33983c3a3684ce9008fc2", "author_rating": 7.0, "review_text": "Lazarus of Oregon.\r\n\r\nThe Lazarus Project is directed by John Patrick Glen, who also co-writes the screenplay with Evan Astrowsky. It stars Paul Walker, Linda Cardellini, Piper Perabo, Bob Gunton, Malcolm Goodwin and Tony Curran. Music is by Brian Tyler and cinematography by Jerzy Zielinski. \r\n\r\nA reformed criminal out on parole is beset by bad luck and finds himself sentenced to die by lethal injection. Strange then that once the lethal dose is administered, he wakes up working as a grounds-keeper at a psychiatric hospital… \r\n\r\nJohn Glen's first directing assignment is very much a mixed bag, but if landing in the DVD/Blu-ray players of the right audience it could well gain some momentum in the wake of Walker's untimely death. \r\n\r\nIt's one of those films that operates at a funereal pace and thrives on other worldly atmosphere. After the introductions to the main character and his psychological make-up is out the way, pic shifts into a realm where we, as well as Walker's character, are never sure what is real or what is going on. Is he in some afterlife place? Is it all in his head? A dream? Drug induced? And etc. One of the smart things about the movie is that it binds the audience to the mystery by asking us to fill in the gaps with our own logic. While crucially the reveal comes at the right time so as to give us viewers the opportunity to re-evaluate the various quandaries that the piece has thrown up. \r\n\r\nFor those who like films like Jacob's Ladder, Shutter Island, The Jacket et al, then this has to be at the very least of interest, to warrant the chance to sell itself to those particular sub-genre fans, besides which, it also shows a string to Walker's acting bow that was rarely tapped into by other directors. And it's beautifully shot by Zielinski too. Contemplative, intriguing and even chilling as regards the various themes it deals with, this Lazarus deserves its own second coming. 7/10", "created_at": "2014-07-14T01:59:31.841Z"}, {"movie_id": 13825, "review_id": "63be1d3ba6e2d200a867662d", "author_rating": 5.0, "review_text": "It's a poor film, but Paul Walker saves it from coming out much worse.\r\n\r\nThis performance of Walker's is the best I've seen of him away from the <em>'Fast & Furious'</em> franchise, as everything else around him in <em>'The Lazarus Project'</em> fails to make an impression his showing is terrific. Bob Gunton, if I had to pick someone, is the pick of the others.\r\n\r\nThe story features an intriguing concept, but I can't say I was ever all that interested in it due to the way the film portrays it; which is a bit too episodic. They just show one thing, then the next and then the next and it never feels well connected. There is no mystique, despite a mystique-filled premise.", "created_at": "2023-01-11T02:21:47.596Z"}]