[{"movie_id": 566525, "review_id": "6123ce44a80236004580f8de", "author_rating": null, "review_text": "The latest film in the Marvel Cinematic Universe has arrived with “Shang Chi and The Legend of the Ten Rings”.\r\n\r\nThe film introduces audiences to Shang Chi (Simu Liu); an easygoing San Francisco resident who spends his time parking cars and hanging out with his friend Katy (Awkwafina) and her family.\r\n\r\nLife is steady if unspectacular until he is accosted on a city bus by a group looking to take a pendant his mother gave him. When Shang Chi shocks Katy and the occupants of the bus with his martial arts abilities; he attempts to find his sister Xialing (Meng’er Zhang); who runs an underground fight club. While Xialing is estranged from her brother; their father Wenwu (Tony Chiu-Wai Leung) has conspired to bring them and their pendants before him.\r\n\r\nTheir father uses the power of sacred devices known as the Ten Rings to rule for over a thousand years and destroys all who would oppose him thanks to their power and the army he has gathered over the centuries.\r\n\r\nWenwu wants to revive their long-dead mother as he is convinced that she is calling to him and he wants to be with her as he was able to be a better man and forsake the power and abilities the rings offered him.\r\n\r\nWhen it is learned that Wenwu plans to go to a mythical realm that their mother came from and free her or burn the place to the ground; Shang Chi must make some hard choices between family and doing what he believes is right.\r\n\r\nWhat follows is an action-filled thriller with plenty of mysticism and humor.  The film has a very engaging visual style that combines Asian and Western cinematic styles which results in some very engaging visuals as well as action sequences.\r\n\r\nWhat really sets the film apart from many Super Hero films is that the characters have a solid base to them as they have a complexity to them in regards to their past and their motivations. Their relationships with one another are key to the film as family, honor, and justice are key elements to the film but they are not given lip service but are developed well along with their characters.\r\nWhile the final act may be a bit FX heavy for some; I found it in keeping with the story and the characters and the great Sir Ben Kingsley provides some very welcome comic relief in his return as Trevor.\r\n\r\nAwkwafina is also great as she provides some very laugh-out-loud moments but is not afraid to mix it up when the situation calls for him. Simu Liu was very enjoyable in the lead role as he performed the physical aspects of his character well but added a restrained sensitivity to his character as he is a complicated individual who is conflicted by choices he made in his youth and the ramifications of them now as an adult.\r\n\r\nThere are bonus scenes that set up future adventures well including one that will no doubt have Marvel fans heatedly debating when the film premieres.\r\n\r\nOnce again Marvel has shown why they have had such a sustained success with their films as they have done a great job again of introducing a new character to the Cinematic Universe but also connecting him to their cinematic past and future.\r\n\r\n4 stars out of 5", "created_at": "2021-08-23T16:35:16.352Z"}, {"movie_id": 566525, "review_id": "61325315cede69002a10e72f", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/shang-chi-spoiler-free-review\r\n\r\n\"Shang-Chi and the Legend of the Ten Rings just became one of my absolute favorites of the entire MCU! Destin Daniel Cretton delivers an entertainment-heavy movie with arguably the best action ever seen in the cinematic universe. Through the outstanding mix of long takes, impressive fighting choreography, and jaw-dropping stunt work, Simu Liu shines with his martial arts skills, but also in tackling the identity issues of the protagonist. Marvel gains yet another emotionally compelling antagonist, as well as a relatable female character that embodies many elements of the Asian-American culture. Despite an overreliance on unnecessary, excessive exposition devices (narration, flashbacks, foreshadowing), the story behind all the tales and legends never loses interest. From the breaking of stereotypes to a remarkable depiction of their culture, most Asian viewers will certainly love this film, even more than I do. Phase Four is off to a remarkable start…\"\r\n\r\nRating: A-", "created_at": "2021-09-03T16:53:41.944Z"}, {"movie_id": 566525, "review_id": "6152ba7c158c850061bf918d", "author_rating": 9.0, "review_text": "**Take That 👊 💥 DELTA-21 . . . . . .  Marvel Studios Presents The \" _M o t h e r_ \" Of All Superhero -{ FANTASlES }- . You've Been Warned . . . . . . The Bonkers Level Here Is, Er, Well :\r\n\" _E X P O N E N T I A L_  😂 🐲❗\" .**\r\n\r\nA **- _B I G_ -** Screen MINI Review. Viewed Sept. 5, '21. \r\n\r\n______________________________________________________ \r\n\r\nKaty : \"That's fine...... you can just explain on the plane\". { Said to Shaun a.k.a Shang-Chi, marking a \"sudden and unexpected\" twist of events }. \r\n\r\n______________________________________________________ \r\n\r\n**1. \" So -{ MANY }- Upsides : \"Crouching Tiger, Hidden MARVEL\" { Gosh . . . . where do I even start❓} \" :** Ang Lee's circa 2000 quasi-mystical Martial arts spectacular is the -Very- first film that came to my mind whilst watching a certain beautifully -{ \" Atmospheric \" }- segment of the opening-act of 'Shang-Chi And The Legend Of The Ten Rings' ( 'Shang-Chi' for short ) . . . . you'll know it -Immediately- upon seeing it . . . . featuring \"ever-fabulous\" Malaysian Mega Star Michelle Yeoh ; who of course was one of the -Principal- characters in 'Crouching Tiger, Hidden Dragon', -As well- . { FYI : this is by no means intended to be a spoiler ; -several- of the movie -official- teasers & trailers 'gallantly' feature the said scene, albeit briefly }. And what's more ...( trailers also )... if you're someone with 'even the slightest bit' of true passion for all things within the realm of sheer cinematic **-{ FANTASY 🌠 }- ,** then you'll be absolutely -delighted- to know that Shang Chi -Also- has a distinct 'Harry Potter' aspect to it . . . & if even -that's- not enough for you . . . then, get this, its got a 'full-blown dollop of Narnia' thrown in there for good measure, at that. To be -Really- honest, it felt a bit disorienting , -At First- , seeing all \"those types of elements\" in an 'MCU' ( 'Marvel Cinematic Universe' ) picture, but then I suddenly realized that 'Infinity War' -And- 'Endgame' both -Very- prominently feature, well ...{ a walking, -\"Talking\"- demolition derby of a, err, -\"Raccoon\"- }... in them, & I began to feel at home again, pretty darn quick. \r\n\r\n**2. \" There -Is- One 'Stark' Downside, Alas . . . . The MCU has had -{ WAY }- Too Much \"Muddled & Obfuscatory\" Messaging  Vis-a-vis 'The Ten Rings', Over The Years \" :** In 2008's -superbly- received { and completely -iconic- } 'Ironman', which is where we were all introduced to the bespoke militant organization, ( 'TTR' for short ), for the -Very- first time . . . . there is an \"Explicit And Unequivocal\" reference to the film's ( initial ) setting as being sometime within the  USA's long 'War In Afghanistan', ( where the -Official- state religion is Islam ). Hence, by **-{ EXTENSION 💡 }- ,** there is the correspondingly \"Glaring\", ( although tad more \"Implicit\" ), suggestion that TTR is . . . . . { from the immediately apparent ethnic backgrounds of the mostly Urdu & Arabic speaking members portrayed, to the group's visually -Distinctive- flag, right down to the undeniably frightening 'Imminent-Beheading' type video featuring a thoroughly bruised & bloodied Tony Stark as its centerpiece ( all too reminiscent of the -Horribly- tragic & bloodcurdling news stories that we've been, sadly, accustomed to reading about, hearing about and watching over the years ) } . . . . . 'yet another' archetypal, classic \"Islamist-fundamentalist\" type group. When in fact, as is -Strongly- conveyed to us in -This- particular picture, ( beginning all the way with the trailers itself ), that this is simply -{ Not }- the case. The said militia does, of course, turn out to be, ( at its very 'Core' ), & by way of, this, its Origins-Story ; \"Not Arab Or Middle Eastern -At All-\" , but in fact . . . . **-{ \" 100% _CHINESE_ \" }-** . Certainly very confusing, -especially- for the majority of us, who -haven't- read any 'Mandarin vs. Shang-Chi' comics . . . . . . . . . . Go Figure 🤷‍♂️ 🤔\r\n\r\n**3. \" Final Analysis \" :** -{ If }- you can get yourself to basically -Overlook- the aforementioned, & \"Legitimate Inconsistencies\" pertaining to Marvel's cinematic representation of its Ten Rings Organization, then . . . . -Yes- , for the most part at least, you -{ Should }- believe all the \"Rave Reviews\" that this 'Utter Delight Of A Movie' has -already- garnered, 'Globally'. A -Huge- Shoutout to its 'rookie' ( -relatively speaking- ) Director 'Destin Daniel Cretton', who\"s been able to achieve this feat with, get this, just his -\"5th\"- Directorial-venture . . . Ever 👏 . What started as a humble yet impassioned little comic book effort about 10 very magical, & { Phenomenally Empowered Alien **\" _MAKLUAN_ \"** Rings } . . . by the \"Truly-Legendary\" Stan Lee & Don Heck in Feb. 1964 ( \"Tales Of Suspense, No.50\" ) . . . has now become the supremely enthralling \"Fresh New Face\" of Marvel's 'BOLD NEW ERA' { that started with 'Phase Four' }. The film's 'Star' is newcomer Simu Liu, whose portrayal of the outwardly nerdy-seeming yet immensely likeable 'Shaun' works wonderfully { not to mention all his ( \" Super 😉 \" )-impressive Kung Fu skills, of course }, with his ever-jocular best companion 'Katy', ( Awkwafina ), showing an absolute -ton- of heart, courage, & most of all, -{ \" Fierce \" }- Loyalty, throughout. Tony Leung, Meng'er Zhang, Fala Chen, Michelle Yeoh, & of course Shang-Chi's Big, Fun, \"Open-Surprise\" .....the 'one & only' Ben Kingsley.... perform their respective roles with -{ \" Panache \" }- . So, all told, it's going to be **\" A Completely Charmed, Fiery 9.50 Marks Out 10 From Me . . . . ROCK ON, MARVEL 👊 🔥❗\"**", "created_at": "2021-09-28T06:47:24.287Z"}, {"movie_id": 566525, "review_id": "61badf86e72fe800615f2382", "author_rating": 7.0, "review_text": "**Shang-chi** is the 25th film in the marvel cinematic universe, it is deep without canyons of emotion but also comedic (with occasional comedic failures).\r\n\r\nThis film embarks the MCU into a different world where tradition intertwines with modern societal problem,the film tackles this elegantly with a few stutters at the seams. As is usual with marvel property this film is a minefield of links to past and future marvel ventures, but is done in such a way that it truly can be an entry point into the extensive universe without having seen the others.\r\n\r\nThe story develops slowly unwrapping the setting but it also serves to highlight the beautiful cinematic choices Destin Daniel Cretton has made, cinematic shots build to a grand climax with a sufficiently marvel-esque battle between relatable family struggles in unrelatable places and circumstances\r\n\r\nThe end to the fight is satisfyingly predictable and leaves a numbness upon the audience because of the climax's grandeur and its fizzle into the marvel trope of comedic endings.\r\n\r\nThere are 2 Pre and post credit scenes who for the marvel enthusiasts add a great deal of pleasure adn completion to the story and set up the shang-chi subfranchise.\r\n\r\nThis film through all of its achievements feels disjointed and only becomes a cinematic feat  at its climax leaving the audience feeeling as if they could have missed the first 50 minutes and still understood the majority of storyline.\r\n\r\nThis is an great feat of film through its inevitable cinematic, it is extremely enjoyable nevertheless.", "created_at": "2021-12-16T06:41:10.529Z"}, {"movie_id": 566525, "review_id": "61e3ecaf6aa8e000427354f0", "author_rating": 9.0, "review_text": "I have to say that this was a surprisingly good movie. I say surprisingly because Marvel (or DC for that matter) have not exactly excelled in making even decent movies for quite some time. That the woke “critics” on Rotten Tomatoes gave it high ratings was a bit of a red flag as well but not only was the movie rather free from woke ramblings and preaching but it was a very fun and entertaining movie to watch.\r\n\r\nThe movie starts off in a somewhat bizarre way with Shang-Chi and his girlfriend swiping a car from a valet parking and going for a joy ride. It turns out that they are telling their story to a couple of friends and that is pretty much how this movie is told.\r\n\r\nIt begins more or less right away with some nice action and it continues that away with plenty of action sequences intermixed with story telling. The action and martial arts is really good in my opinion. They are in stark contrast to the mediocre rubbish we were treated to in Snake Eyes. The latter which was quite a disappointment.\r\n\r\nThis movie relies heavily on fantasy elements with tie ins to Doctor Strange, especially towards the end. Another movie that I liked a lot by the way. Thus there are of course plenty of special effects and CGI. Most of them good or very good. I really liked the beautiful world of Ta Lo. The combat scenes, especially when the rings are in action are both cool and beautiful.\r\n\r\nThere are quite a lot of comical relief in the movie as well and, for once, it is not to silly, outrageous or plain stupid. It contributes well to the enjoyment factor of the movie. The washed out actor is a bit on the limit but otherwise it works well with the rest of the movie. That guy on the bus starting to film and make commentaries was quite hilarious for instance.\r\n\r\nThe story? Well it is a Marvel special effects movie so one should not expect too much but the story is not bad. It mostly holds together and works well enough to tie all the action together. The acting is pretty much the same thing. One should not expect too much but it is good enough. It was nice to see Michelle Yeoh as Ying Nan though. She was one of the few cool characters in Discovery and she does know how to act.\r\n\r\nOverall I very much enjoyed this movie. It is a simple super hero and fantasy adventure story with lots of action and special effects and with the single purpose of entertaining the audience that doesn’t fall in the trap of trying to “educate” said audience.", "created_at": "2022-01-16T10:00:15.617Z"}, {"movie_id": 566525, "review_id": "620cd62c706e56006a4d8e89", "author_rating": null, "review_text": "I'll be straight forward with you; I'm old.  And I have a great pleathora of movie viewing history behind these eyes.  Me being old, I am bitter most times from jealously of lost youth and a firey contempt toward lazy boneheaded braindead youth of today.  But I digress...the review.  \r\n\r\nMy review will be short as are my praises, while my critique shall be terse.  Deal with it.  \r\nThis movie is not bad.  I wouldn't call it a waste of money to see, but on the same turn it's not \"OMG, I have to come see this again with Pauly.\"  \r\n\r\nThe special effects (I'm old. Deal) are pretty good, specially when the hero vists the magical homeland his mother gave up gaurding to be with his father.  The fight scenes, while they make an earnest attempt, are not Jackie Chan or Jet Li smooth but they are done with a compentent hand. (So much for being the first Chinese Superhero)\r\n\r\nThere are only few downsides and those are the inconsistencies only a trained eye might see.  If you follow the action and the movie you can simply dismiss them as \"It's in the script.\"  But if you are like me certain questions born of observation nag at you during and after seeing the movie.  Such as, _\"Is the co-star female sidekick supposed to be his girlfriend or sister?!?\"  \"Why does she walk & sound like an old woman if they are supposed to be the same age???\" \"Why does the woman playing his sister look older than he is, but she's supposed to be a few years younger???\"_  I'm not kidding, the woman (While fit) is very UN-easy on the eyes in the beauty department.  And that's saying something considering how dainty most Chinese women appear.  And my last \"knit-pick\" if you will, is that the studio called the rings, rings.  They are not.  They are bracelets since these are worn on the arms instead of the fingers.  But I believe it was done because it was easier to do the special effects for them. \r\n \r\nThe movie is not bad at all, overall.  Good way to pass the time if you happen to run into it on a channel surf. But like _**Black Panther 1**_, not really considered a must-see.", "created_at": "2022-02-16T10:47:08.235Z"}, {"movie_id": 566525, "review_id": "6414f2a10d5d85009ba12fd9", "author_rating": 7.0, "review_text": "One thing that the MCU hasn't been spectacular at is branching out into other genres. Most have been scifi/fantasy fare. An attempt at horror with \"Doctor Strange in the Multiverse of Madness.\" Some more comedic entries like \"Thor: Ragnarok.\" \"Shang Chi\" is their attempt to bring the classic Kung Fu fantasy genre into the fold. And it sort of works. It's not wholly original in the idea, but can be taken more as a tribute to the Kung Fu fantasies of old. There are some changes made to established Marvel lore, but nothing that couldn't be lived with and accepted and really are necessary for the story. The story is good, not great, the performances are mostly good. The effects...are mostly decent, but there are some issues. The constructed sets are good, but the green screens are obviously green screens.\r\n\r\nThe main problem this movie has is that it shines a spotlight on a problem the MCU as whole is developing, which happens in the comics and any long running shared universe: It's getting really bogged down by its lore and interconnectedness. It not good for newcomers to the MCU and will likely only appeal to fans of both classic Kung Fu films and the MCU films.\r\n\r\nIt's good. It's entertaining. It provides some new stuff for the MCU, but it falls short of actually being a great film.", "created_at": "2023-03-17T23:07:13.492Z"}]