[{"movie_id": 451915, "review_id": "5b9016d50e0a267972000d70", "author_rating": null, "review_text": "Inspired by a father and son’s dual memoirs (Beatiful Boy and Tweak, respectively), Felix Van Groeningen’s heartfelt adaptation portrays the relationship between David (Steve Carell) and Nic Sheff (Timothée Chalamet), as both struggle through the latter’s drug addiction.\r\n\r\nThere are about a billion reasons to see this movie: 1) Basically everyone in the cast has been nominated for an Oscar (save for Maura Tierney, who has a Golden Globe and two Emmy noms); 2) Timothée Chalamet; 3) The memoirs are incredible (and not super expensive on Amazon, so you can catch up before the movie comes out); 4) It sets the scene for a quasi Office reunion between Carell and Amy Ryan (who played Holly Flax).\r\n\r\nBut perhaps the most significant — and overlooked — reason is this: director Felix Van Groeningen’s 2012 film The Broken Circle Breakdown is, in my humble opinion, one of the best movies of all time (and available to stream on Amazon, who I promise I don’t work for). Stakes are high", "created_at": "2018-09-05T17:48:05.762Z"}, {"movie_id": 451915, "review_id": "5d27f03e5f6c4965105dfd88", "author_rating": 6.0, "review_text": "_**Earnest and heartfelt, but narratively awkward, and emotionally unengaging**_\r\n\r\n> _They say suicide is a permanent solution to a temporary problem. The problem with being human isn't really so temporary._\r\n\r\n- Nic Sheff; _Tweak: Growing Up on Methamphetamines_ (2008)\r\n\r\n> _Anyone who has lived through it, or those who are now living through it, knows that caring about an addict is as complex and fraught and debilitating as addiction itself._\r\n\r\n- David Sheff; _Beautiful Boy: A Father's Journey Through His Son's Addiction_ (2008)\r\n\r\nBased on the memoirs _Beautiful Boy: A Father's Journey Th__rough His Son's Addiction_ by David Sheff and _Tweak: Growing Up on Methamphetamines_ by Nic Sheff, written for the screen by Luke Davies (_Life_; _Lion_) and Felix van Groeningen (_The Broken Circle Breakdown_), and directed by van Groeningen in his English language debut, _Beautiful Boy_ is a film about the horrors of addiction, told from the perspective of both an addict and his father. Focusing primarily on David's attempts to understand and fight against his son's addiction to crystal meth, the film aims for a no frills _sans_-sentimental authenticity (Davies is himself a former heroin addict, who based _Candy: A Novel of Love and Addiction_ (1997) on his experiences; he also co-wrote the script for the 2006 film adaptation, _Candy_, directed by Neil Armfield). Serving as something of a showcase for the two lead actors (Steve Carell and Timothée Chalamet, both of whom are exceptional), there's little in the way of plot, with the film instead adopting a non-linear cyclical structure designed to mirror the repetitive nature of addiction-rehab-relapse-addiction-rehab etc. And whilst it is certainly heartfelt and respectfully told, there's little in the way of emotional engagement. The structure is also problematic insofar as because there's no real cohesive plot providing forward momentum, the highs and lows are undifferentiated, becoming repetitive. Van Groeningen also overuses flash-backs. So although the film may have an inherent degree of authenticity that's to be applauded, as drama, it isn't especially compelling, with the structure tending to work against the actors, blunting any emotional impact, and keeping the characters always at one step removed.\r\n\r\nLiving in Marin County, Nic Sheff (Chalamet) is an intelligent, popular, and kind teenager, who has a close relationship with his father, David (Carell), his stepmother Karen (Maura Tierney), and his two younger half-siblings, Jasper (Christian Convery) and Daisy (Oakley Bull). He is less close to his birthmother Vicki (Amy Ryan), who moved to LA after she and David divorced. David is a journalist for the _New York Times_, and Karen is a painter, with the family enjoying a comfortable bohemian middle-class existence. The film begins as David attends the offices of a drug counsellor and psychologist, Dr. Brown (Timothy Hutton). Explaining that Nic has become addicted to crystal meth, he wants to learn everything he can about the drug in order to best help his son. The story then cuts to a year previously. Nic has been missing for two days, and when he nonchalantly re-appears, David insists on taking him to rehab. He initially responds well, and soon requests to be transferred to a halfway-house, to which David agrees. A few days later, however, he flees the facility, and David later finds him strung-out in an alley. Taking him to hospital, Nic reveals he has been abusing not only marijuana and alcohol, but cocaine, ecstasy, and, especially, crystal meth. Back in rehab, Nic makes a full recovery, and heads to college to study as a writer, beginning a relationship with a fellow student, Julia (Stefanie Scott). However, having dinner in her house one evening, Nic finds a bottle of painkillers in the bathroom, and once more relapses, except this time he turns to heroin. With David still determined to help him overcome his demons, Karen tells David that he is neglecting his two younger children, and that Nic might be beyond a father's ability to help. Heartbroken, David agrees she is probably correct.\r\n\r\nThe most notable aspect of _Beautiful Boy_ is the structure, which is both cyclical and non-linear – the film is made up of a series of high and lows following Nic and David through relapse and recovery, whilst at the same time, there are multiple flashbacks, with scenes in the present giving characters occasion to think about moments from the past. For example, as David sits in a diner waiting for Nic to arrive, he thinks back to a much happier meal he had with his son in that same diner many years previously. This technique is used throughout the film, often flashing back to happier memories of Nic's childhood. The problem with this non-linear structure is that it's overused; there's barely a scene that doesn't have some kind of temporal cutaway. This overuse also dulls the impact of such editing, as after 45 minutes, you're just yearning for the film to stay put for a while. Sometimes the flashbacks do work, revealing something interesting, juxtaposing the past and present evocatively, or changing how we view the present, but a lot of the time, it feels like an unjustified piece of trickery, an end unto itself, insofar as there often isn't a great deal of establishing context. This leaves the viewer wondering, \"how did we get from that scene to this one. Why did what happened there make David think of this?\" This is pretty much the last thing you should be thinking about in a narrative of this nature, and it completely pulls you out of the film. Indeed, there are parts of the movie that so overuse the technique as to seem like a montage rather than a collection of actual scenes.\r\n\r\nAdditionally, the timeline itself becomes confused within all of this, especially in the sense of where the movie's present is supposed to be. For example, there's a scene where we see David dropping Nic off to college, and the two of them enjoy a joint. As I understood it, this scene came after Nic had owned up to his meth addiction and gotten clean, but before he had met Julia and relapsed. Which obviously makes no sense, as the scene gives the impression David has no idea that Nic has been using drugs, surprised he even knows how to smoke a joint. So is his trip to college much earlier in the narrative? But if so, when, as it doesn't seem to fit anywhere else in the timeline? Again, these are not the kinds of things you should be concentrating on when watching what is supposed to be an emotive story, but more often than not, the editing foregrounds itself (the film is cut by van Groeningen's regular editor, Nico Leunen), pulling you out of the narrative.\r\n\r\nAs regards the repetitive nature of the story, I understand what van Groeningen was going for – it is supposed to mirror the back and forth nature of addiction (\"_relapse is part of rehab_\" as David is told), a two steps forward, one step back staccato motion. However, the film falls into a pattern of Nic showing up looking a little more dishevelled than he did before, followed by David doing everything he can to help, followed by his failure to get through to Nic, followed by Nic disappearing, followed by Nic showing up looking a little more dishevelled than he did before, etc. And whilst this may lend itself to a certain authenticity, it doesn't make for very effective drama. In any case, other filmmakers have found ways to depict the repetitive nature of addiction without compromising the story, not the least of whom would be Darren Aronofsky in _Requiem for a Dream_ (2000), who constantly uses a quick montage of the characters doing drugs to suggest the habitual nature of addiction.\r\n\r\nObviously enough, the main theme of the film is addiction, and in this sense, it gets a lot right. For example, in his journal, Nic outlines the vicious-circle that addicts fall into; he needs drugs so he does things of which he's ashamed to get money with which to buy them, but then because he feels so guilty about what he's done, he needs more drugs to cover the shame, so he does things of which he's ashamed to get money with which to buy them, and so on. He's also especially clear when describing the fact that after you've done crystal meth a few times, you don't get the same high from it, and so the addiction becomes all about attempting to recreate that first high (which Nic describes as making a black-and-white world appear in Technicolour).\r\n\r\nPerhaps the most fascinating aspect of the movie is that Nic is a prosperous and intelligent middle-class young man with a strong support system. He is a child of divorce, yes, but he has a good relationship with both of his parents. This is a far cry from the typical addict we see in film and TV, who are usually at the extreme ends of the monetary spectrum, either poverty-stricken and destitute (such as, say, Bubbles (Andre Royo) in _The Wire_) or extremely wealthy and high-functioning (such as Caspar (Geoffrey Rush) in _Candy_). Additionally, as he explains himself, he first tried drugs to see what they were like, and when he liked how they made him feel, he kept on doing them. As he says at one point, the first time he did hard drugs was the best feeling he'd ever had. During the aforementioned scene where Nic and David share a joint, Nic summates this, telling David that marijuana \"_takes the edge off the stupid all day stuff_\". There was no precipitating event, no great emotional trauma which made him turn to narcotics; his addiction is just something that happened, a disease to which anyone could succumb\r\n\r\nThe other main theme is that of the father-son relationship, and this too is well-presented. With both actors giving superb performances, one really sees the bond between the two, and how much Nic's addiction is destroying both of them. In this sense, the real tragedy of Nic's situation isn't the rehabs and relapses, it's seeing him drift further and further away from a man who would literally die to protect him. Given the source material, one does wonder a little if the relationship is idealised somewhat, but irrespective of that, Carell and Chalamet give a masterclass in acting, and I was genuinely shocked neither of them was nominated at the 2019 Oscars.\r\n\r\nWith lesser performances, the film would crumble under the weight of van Groeningen's heavy-handed direction. Thankfully the performances are strong enough that the style distracts rather than undermines. That said, the benefit of the non-linear storytelling is that it allows Chalamet and Carell to really drive home how much their relationship changes, with their playful and happy earlier scenes contrasting heart-breakingly with the fraught and destructive times of later years. Chalamet's is the more physical of the two performances, conveying so much via his body language. It's a world apart from his work in Luca Guadagnino's _Call Me by Your Name_, Elijah Bynum's _Hot Summer Nights_, or Greta Grewig's _Lady Bird_ (all 2017), as he completely inhabits the character, alternating between playing Nic as a sweet, loving, almost immature teenager, and a stressed addict, old before his years, and capable of anything to get money for his next hit. When he is rehabbing, there's a regret and humility in his performance that is nowhere to be seen when he relapses, as he becomes more manic and unpredictable, and much less self-aware.\r\n\r\nCarell, for his part, does most of his best work with his eyes, conveying the sadness and desperation he feels. His helplessness is written across his face, conveying how little he can actually do for his son. He initially approaches the problem in a logical manner (he does methodical pseudo-journalistic research on crystal meth to better understand it, he snorts cocaine to try to put himself in Nic's shoes), before eventually realising there is no logic at play here, and tackling the subject as he would an article for the _New York Times_ is not going to work. Carell plays David as confused, haunted, and desperate, with Nic's addiction, specifically his inability to break it, having as profound a psychological effect on David as it has a physical effect on Nic.\r\n\r\nDespite all of these positives, however, as indicated above, there are a number of problems. For one, van Groeningen chooses not to present some of the darker aspects of Nic's story. For example, he turned to prostitution at one point to fund his addiction. Additionally, as his hits from crystal meth continued to diminish over time, he started shooting it up, which is insanely dangerous. Leaving out aspects such as this gives the film a kind of sanitised feeling, as if we're looking at addiction through a gauze which the director refuses to pull back to let us see it directly. This kind of heart-breaking sordid detail would have helped the film immeasurably, especially in relation to its lack of emotional engagement.\r\n\r\nThis lack is probably the most egregious problem. A film of this nature, detailing something like this, and based on a true story, should be an emotional rollercoaster, but the audience is always removed, the emotions are seen rather than experienced, as if we're looking at the rollercoaster instead of riding it. Because the film introduces us to the characters mid-crisis, and because there's literally not a single scene that isn't either related to Nic's addiction, or a flashback from a scene related to his addiction, we never really get to know David or Nic outside this situation, with the script never really moving beyond David as \"dutiful father\" and Nic as \"desperate son\". Any sense we have of these two people comes almost entirely from the acting, and even then, although you certainly feel empathy and sympathy for them, you don't feel a huge amount else. The problem is that the plot (such as it is) never seems compelling, partly due to how narrowly focused the film is. It's also not a good sign that, for me, the most emotive part of the whole thing was hearing Nic himself reading a monologue from his book over the closing credits.\r\n\r\nThis dearth of characterisation is even more pronounced in relation to the two women, who may as well not be there. Karen has nothing to do but wander around in the background painting trees, whilst Vicki doesn't even get that much – she's a disembodied voice on the phone most of the time, and although I know she appeared in a couple of scenes, by the next day, I'd forgotten what she did in either of them. It's a real waste of two extremely talented performers.\r\n\r\nThere have been some truly great films made about addiction; Otto Preminger's _The Man With the Golden Arm_ (1955), Blake Edwards's _Days of Wine and Roses_ (1962), Jerry Schatzberg's _The Panic in Needle Park_ (1971), Gus Van Sant's _Drugstore Cowboy_ (1989), Danny Boyle's _Trainspotting_ (1996), Mike Figgis's _Leaving Las Vegas_ (1995), Scott Klalvert's _The Basketball Diaries_ (1995), Darren Aronofsky's _Requiem for a Dream_ (2000). Beautiful Boy is absolutely nowhere near anything of this calibre. In fact, it's probably more successful as a kind of instructional installation for relatives of people going through addiction than it is as a film evoking emotions. Told from the perspective of people living through this nightmare, the story is incredibly straightforward and forgettable, when it should be shocking, disturbing, and emotionally devastating. And whilst the film is definitely heartfelt, its lack of emotional engagement, its repetitiveness, its distracting structure, its lack of a plot, all serve to grate against the incredible performances.", "created_at": "2019-07-12T02:28:14.636Z"}, {"movie_id": 451915, "review_id": "5b9016d50e0a267972000d70", "author_rating": null, "review_text": "Inspired by a father and son’s dual memoirs (Beatiful Boy and Tweak, respectively), Felix Van Groeningen’s heartfelt adaptation portrays the relationship between David (Steve Carell) and Nic Sheff (Timothée Chalamet), as both struggle through the latter’s drug addiction.\r\n\r\nThere are about a billion reasons to see this movie: 1) Basically everyone in the cast has been nominated for an Oscar (save for Maura Tierney, who has a Golden Globe and two Emmy noms); 2) Timothée Chalamet; 3) The memoirs are incredible (and not super expensive on Amazon, so you can catch up before the movie comes out); 4) It sets the scene for a quasi Office reunion between Carell and Amy Ryan (who played Holly Flax).\r\n\r\nBut perhaps the most significant — and overlooked — reason is this: director Felix Van Groeningen’s 2012 film The Broken Circle Breakdown is, in my humble opinion, one of the best movies of all time (and available to stream on Amazon, who I promise I don’t work for). Stakes are high", "created_at": "2018-09-05T17:48:05.762Z"}, {"movie_id": 451915, "review_id": "5d27f03e5f6c4965105dfd88", "author_rating": 6.0, "review_text": "_**Earnest and heartfelt, but narratively awkward, and emotionally unengaging**_\r\n\r\n> _They say suicide is a permanent solution to a temporary problem. The problem with being human isn't really so temporary._\r\n\r\n- Nic Sheff; _Tweak: Growing Up on Methamphetamines_ (2008)\r\n\r\n> _Anyone who has lived through it, or those who are now living through it, knows that caring about an addict is as complex and fraught and debilitating as addiction itself._\r\n\r\n- David Sheff; _Beautiful Boy: A Father's Journey Through His Son's Addiction_ (2008)\r\n\r\nBased on the memoirs _Beautiful Boy: A Father's Journey Th__rough His Son's Addiction_ by David Sheff and _Tweak: Growing Up on Methamphetamines_ by Nic Sheff, written for the screen by Luke Davies (_Life_; _Lion_) and Felix van Groeningen (_The Broken Circle Breakdown_), and directed by van Groeningen in his English language debut, _Beautiful Boy_ is a film about the horrors of addiction, told from the perspective of both an addict and his father. Focusing primarily on David's attempts to understand and fight against his son's addiction to crystal meth, the film aims for a no frills _sans_-sentimental authenticity (Davies is himself a former heroin addict, who based _Candy: A Novel of Love and Addiction_ (1997) on his experiences; he also co-wrote the script for the 2006 film adaptation, _Candy_, directed by Neil Armfield). Serving as something of a showcase for the two lead actors (Steve Carell and Timothée Chalamet, both of whom are exceptional), there's little in the way of plot, with the film instead adopting a non-linear cyclical structure designed to mirror the repetitive nature of addiction-rehab-relapse-addiction-rehab etc. And whilst it is certainly heartfelt and respectfully told, there's little in the way of emotional engagement. The structure is also problematic insofar as because there's no real cohesive plot providing forward momentum, the highs and lows are undifferentiated, becoming repetitive. Van Groeningen also overuses flash-backs. So although the film may have an inherent degree of authenticity that's to be applauded, as drama, it isn't especially compelling, with the structure tending to work against the actors, blunting any emotional impact, and keeping the characters always at one step removed.\r\n\r\nLiving in Marin County, Nic Sheff (Chalamet) is an intelligent, popular, and kind teenager, who has a close relationship with his father, David (Carell), his stepmother Karen (Maura Tierney), and his two younger half-siblings, Jasper (Christian Convery) and Daisy (Oakley Bull). He is less close to his birthmother Vicki (Amy Ryan), who moved to LA after she and David divorced. David is a journalist for the _New York Times_, and Karen is a painter, with the family enjoying a comfortable bohemian middle-class existence. The film begins as David attends the offices of a drug counsellor and psychologist, Dr. Brown (Timothy Hutton). Explaining that Nic has become addicted to crystal meth, he wants to learn everything he can about the drug in order to best help his son. The story then cuts to a year previously. Nic has been missing for two days, and when he nonchalantly re-appears, David insists on taking him to rehab. He initially responds well, and soon requests to be transferred to a halfway-house, to which David agrees. A few days later, however, he flees the facility, and David later finds him strung-out in an alley. Taking him to hospital, Nic reveals he has been abusing not only marijuana and alcohol, but cocaine, ecstasy, and, especially, crystal meth. Back in rehab, Nic makes a full recovery, and heads to college to study as a writer, beginning a relationship with a fellow student, Julia (Stefanie Scott). However, having dinner in her house one evening, Nic finds a bottle of painkillers in the bathroom, and once more relapses, except this time he turns to heroin. With David still determined to help him overcome his demons, Karen tells David that he is neglecting his two younger children, and that Nic might be beyond a father's ability to help. Heartbroken, David agrees she is probably correct.\r\n\r\nThe most notable aspect of _Beautiful Boy_ is the structure, which is both cyclical and non-linear – the film is made up of a series of high and lows following Nic and David through relapse and recovery, whilst at the same time, there are multiple flashbacks, with scenes in the present giving characters occasion to think about moments from the past. For example, as David sits in a diner waiting for Nic to arrive, he thinks back to a much happier meal he had with his son in that same diner many years previously. This technique is used throughout the film, often flashing back to happier memories of Nic's childhood. The problem with this non-linear structure is that it's overused; there's barely a scene that doesn't have some kind of temporal cutaway. This overuse also dulls the impact of such editing, as after 45 minutes, you're just yearning for the film to stay put for a while. Sometimes the flashbacks do work, revealing something interesting, juxtaposing the past and present evocatively, or changing how we view the present, but a lot of the time, it feels like an unjustified piece of trickery, an end unto itself, insofar as there often isn't a great deal of establishing context. This leaves the viewer wondering, \"how did we get from that scene to this one. Why did what happened there make David think of this?\" This is pretty much the last thing you should be thinking about in a narrative of this nature, and it completely pulls you out of the film. Indeed, there are parts of the movie that so overuse the technique as to seem like a montage rather than a collection of actual scenes.\r\n\r\nAdditionally, the timeline itself becomes confused within all of this, especially in the sense of where the movie's present is supposed to be. For example, there's a scene where we see David dropping Nic off to college, and the two of them enjoy a joint. As I understood it, this scene came after Nic had owned up to his meth addiction and gotten clean, but before he had met Julia and relapsed. Which obviously makes no sense, as the scene gives the impression David has no idea that Nic has been using drugs, surprised he even knows how to smoke a joint. So is his trip to college much earlier in the narrative? But if so, when, as it doesn't seem to fit anywhere else in the timeline? Again, these are not the kinds of things you should be concentrating on when watching what is supposed to be an emotive story, but more often than not, the editing foregrounds itself (the film is cut by van Groeningen's regular editor, Nico Leunen), pulling you out of the narrative.\r\n\r\nAs regards the repetitive nature of the story, I understand what van Groeningen was going for – it is supposed to mirror the back and forth nature of addiction (\"_relapse is part of rehab_\" as David is told), a two steps forward, one step back staccato motion. However, the film falls into a pattern of Nic showing up looking a little more dishevelled than he did before, followed by David doing everything he can to help, followed by his failure to get through to Nic, followed by Nic disappearing, followed by Nic showing up looking a little more dishevelled than he did before, etc. And whilst this may lend itself to a certain authenticity, it doesn't make for very effective drama. In any case, other filmmakers have found ways to depict the repetitive nature of addiction without compromising the story, not the least of whom would be Darren Aronofsky in _Requiem for a Dream_ (2000), who constantly uses a quick montage of the characters doing drugs to suggest the habitual nature of addiction.\r\n\r\nObviously enough, the main theme of the film is addiction, and in this sense, it gets a lot right. For example, in his journal, Nic outlines the vicious-circle that addicts fall into; he needs drugs so he does things of which he's ashamed to get money with which to buy them, but then because he feels so guilty about what he's done, he needs more drugs to cover the shame, so he does things of which he's ashamed to get money with which to buy them, and so on. He's also especially clear when describing the fact that after you've done crystal meth a few times, you don't get the same high from it, and so the addiction becomes all about attempting to recreate that first high (which Nic describes as making a black-and-white world appear in Technicolour).\r\n\r\nPerhaps the most fascinating aspect of the movie is that Nic is a prosperous and intelligent middle-class young man with a strong support system. He is a child of divorce, yes, but he has a good relationship with both of his parents. This is a far cry from the typical addict we see in film and TV, who are usually at the extreme ends of the monetary spectrum, either poverty-stricken and destitute (such as, say, Bubbles (Andre Royo) in _The Wire_) or extremely wealthy and high-functioning (such as Caspar (Geoffrey Rush) in _Candy_). Additionally, as he explains himself, he first tried drugs to see what they were like, and when he liked how they made him feel, he kept on doing them. As he says at one point, the first time he did hard drugs was the best feeling he'd ever had. During the aforementioned scene where Nic and David share a joint, Nic summates this, telling David that marijuana \"_takes the edge off the stupid all day stuff_\". There was no precipitating event, no great emotional trauma which made him turn to narcotics; his addiction is just something that happened, a disease to which anyone could succumb\r\n\r\nThe other main theme is that of the father-son relationship, and this too is well-presented. With both actors giving superb performances, one really sees the bond between the two, and how much Nic's addiction is destroying both of them. In this sense, the real tragedy of Nic's situation isn't the rehabs and relapses, it's seeing him drift further and further away from a man who would literally die to protect him. Given the source material, one does wonder a little if the relationship is idealised somewhat, but irrespective of that, Carell and Chalamet give a masterclass in acting, and I was genuinely shocked neither of them was nominated at the 2019 Oscars.\r\n\r\nWith lesser performances, the film would crumble under the weight of van Groeningen's heavy-handed direction. Thankfully the performances are strong enough that the style distracts rather than undermines. That said, the benefit of the non-linear storytelling is that it allows Chalamet and Carell to really drive home how much their relationship changes, with their playful and happy earlier scenes contrasting heart-breakingly with the fraught and destructive times of later years. Chalamet's is the more physical of the two performances, conveying so much via his body language. It's a world apart from his work in Luca Guadagnino's _Call Me by Your Name_, Elijah Bynum's _Hot Summer Nights_, or Greta Grewig's _Lady Bird_ (all 2017), as he completely inhabits the character, alternating between playing Nic as a sweet, loving, almost immature teenager, and a stressed addict, old before his years, and capable of anything to get money for his next hit. When he is rehabbing, there's a regret and humility in his performance that is nowhere to be seen when he relapses, as he becomes more manic and unpredictable, and much less self-aware.\r\n\r\nCarell, for his part, does most of his best work with his eyes, conveying the sadness and desperation he feels. His helplessness is written across his face, conveying how little he can actually do for his son. He initially approaches the problem in a logical manner (he does methodical pseudo-journalistic research on crystal meth to better understand it, he snorts cocaine to try to put himself in Nic's shoes), before eventually realising there is no logic at play here, and tackling the subject as he would an article for the _New York Times_ is not going to work. Carell plays David as confused, haunted, and desperate, with Nic's addiction, specifically his inability to break it, having as profound a psychological effect on David as it has a physical effect on Nic.\r\n\r\nDespite all of these positives, however, as indicated above, there are a number of problems. For one, van Groeningen chooses not to present some of the darker aspects of Nic's story. For example, he turned to prostitution at one point to fund his addiction. Additionally, as his hits from crystal meth continued to diminish over time, he started shooting it up, which is insanely dangerous. Leaving out aspects such as this gives the film a kind of sanitised feeling, as if we're looking at addiction through a gauze which the director refuses to pull back to let us see it directly. This kind of heart-breaking sordid detail would have helped the film immeasurably, especially in relation to its lack of emotional engagement.\r\n\r\nThis lack is probably the most egregious problem. A film of this nature, detailing something like this, and based on a true story, should be an emotional rollercoaster, but the audience is always removed, the emotions are seen rather than experienced, as if we're looking at the rollercoaster instead of riding it. Because the film introduces us to the characters mid-crisis, and because there's literally not a single scene that isn't either related to Nic's addiction, or a flashback from a scene related to his addiction, we never really get to know David or Nic outside this situation, with the script never really moving beyond David as \"dutiful father\" and Nic as \"desperate son\". Any sense we have of these two people comes almost entirely from the acting, and even then, although you certainly feel empathy and sympathy for them, you don't feel a huge amount else. The problem is that the plot (such as it is) never seems compelling, partly due to how narrowly focused the film is. It's also not a good sign that, for me, the most emotive part of the whole thing was hearing Nic himself reading a monologue from his book over the closing credits.\r\n\r\nThis dearth of characterisation is even more pronounced in relation to the two women, who may as well not be there. Karen has nothing to do but wander around in the background painting trees, whilst Vicki doesn't even get that much – she's a disembodied voice on the phone most of the time, and although I know she appeared in a couple of scenes, by the next day, I'd forgotten what she did in either of them. It's a real waste of two extremely talented performers.\r\n\r\nThere have been some truly great films made about addiction; Otto Preminger's _The Man With the Golden Arm_ (1955), Blake Edwards's _Days of Wine and Roses_ (1962), Jerry Schatzberg's _The Panic in Needle Park_ (1971), Gus Van Sant's _Drugstore Cowboy_ (1989), Danny Boyle's _Trainspotting_ (1996), Mike Figgis's _Leaving Las Vegas_ (1995), Scott Klalvert's _The Basketball Diaries_ (1995), Darren Aronofsky's _Requiem for a Dream_ (2000). Beautiful Boy is absolutely nowhere near anything of this calibre. In fact, it's probably more successful as a kind of instructional installation for relatives of people going through addiction than it is as a film evoking emotions. Told from the perspective of people living through this nightmare, the story is incredibly straightforward and forgettable, when it should be shocking, disturbing, and emotionally devastating. And whilst the film is definitely heartfelt, its lack of emotional engagement, its repetitiveness, its distracting structure, its lack of a plot, all serve to grate against the incredible performances.", "created_at": "2019-07-12T02:28:14.636Z"}, {"movie_id": 451915, "review_id": "5b9016d50e0a267972000d70", "author_rating": null, "review_text": "Inspired by a father and son’s dual memoirs (Beatiful Boy and Tweak, respectively), Felix Van Groeningen’s heartfelt adaptation portrays the relationship between David (Steve Carell) and Nic Sheff (Timothée Chalamet), as both struggle through the latter’s drug addiction.\r\n\r\nThere are about a billion reasons to see this movie: 1) Basically everyone in the cast has been nominated for an Oscar (save for Maura Tierney, who has a Golden Globe and two Emmy noms); 2) Timothée Chalamet; 3) The memoirs are incredible (and not super expensive on Amazon, so you can catch up before the movie comes out); 4) It sets the scene for a quasi Office reunion between Carell and Amy Ryan (who played Holly Flax).\r\n\r\nBut perhaps the most significant — and overlooked — reason is this: director Felix Van Groeningen’s 2012 film The Broken Circle Breakdown is, in my humble opinion, one of the best movies of all time (and available to stream on Amazon, who I promise I don’t work for). Stakes are high", "created_at": "2018-09-05T17:48:05.762Z"}, {"movie_id": 451915, "review_id": "5d27f03e5f6c4965105dfd88", "author_rating": 6.0, "review_text": "_**Earnest and heartfelt, but narratively awkward, and emotionally unengaging**_\r\n\r\n> _They say suicide is a permanent solution to a temporary problem. The problem with being human isn't really so temporary._\r\n\r\n- Nic Sheff; _Tweak: Growing Up on Methamphetamines_ (2008)\r\n\r\n> _Anyone who has lived through it, or those who are now living through it, knows that caring about an addict is as complex and fraught and debilitating as addiction itself._\r\n\r\n- David Sheff; _Beautiful Boy: A Father's Journey Through His Son's Addiction_ (2008)\r\n\r\nBased on the memoirs _Beautiful Boy: A Father's Journey Th__rough His Son's Addiction_ by David Sheff and _Tweak: Growing Up on Methamphetamines_ by Nic Sheff, written for the screen by Luke Davies (_Life_; _Lion_) and Felix van Groeningen (_The Broken Circle Breakdown_), and directed by van Groeningen in his English language debut, _Beautiful Boy_ is a film about the horrors of addiction, told from the perspective of both an addict and his father. Focusing primarily on David's attempts to understand and fight against his son's addiction to crystal meth, the film aims for a no frills _sans_-sentimental authenticity (Davies is himself a former heroin addict, who based _Candy: A Novel of Love and Addiction_ (1997) on his experiences; he also co-wrote the script for the 2006 film adaptation, _Candy_, directed by Neil Armfield). Serving as something of a showcase for the two lead actors (Steve Carell and Timothée Chalamet, both of whom are exceptional), there's little in the way of plot, with the film instead adopting a non-linear cyclical structure designed to mirror the repetitive nature of addiction-rehab-relapse-addiction-rehab etc. And whilst it is certainly heartfelt and respectfully told, there's little in the way of emotional engagement. The structure is also problematic insofar as because there's no real cohesive plot providing forward momentum, the highs and lows are undifferentiated, becoming repetitive. Van Groeningen also overuses flash-backs. So although the film may have an inherent degree of authenticity that's to be applauded, as drama, it isn't especially compelling, with the structure tending to work against the actors, blunting any emotional impact, and keeping the characters always at one step removed.\r\n\r\nLiving in Marin County, Nic Sheff (Chalamet) is an intelligent, popular, and kind teenager, who has a close relationship with his father, David (Carell), his stepmother Karen (Maura Tierney), and his two younger half-siblings, Jasper (Christian Convery) and Daisy (Oakley Bull). He is less close to his birthmother Vicki (Amy Ryan), who moved to LA after she and David divorced. David is a journalist for the _New York Times_, and Karen is a painter, with the family enjoying a comfortable bohemian middle-class existence. The film begins as David attends the offices of a drug counsellor and psychologist, Dr. Brown (Timothy Hutton). Explaining that Nic has become addicted to crystal meth, he wants to learn everything he can about the drug in order to best help his son. The story then cuts to a year previously. Nic has been missing for two days, and when he nonchalantly re-appears, David insists on taking him to rehab. He initially responds well, and soon requests to be transferred to a halfway-house, to which David agrees. A few days later, however, he flees the facility, and David later finds him strung-out in an alley. Taking him to hospital, Nic reveals he has been abusing not only marijuana and alcohol, but cocaine, ecstasy, and, especially, crystal meth. Back in rehab, Nic makes a full recovery, and heads to college to study as a writer, beginning a relationship with a fellow student, Julia (Stefanie Scott). However, having dinner in her house one evening, Nic finds a bottle of painkillers in the bathroom, and once more relapses, except this time he turns to heroin. With David still determined to help him overcome his demons, Karen tells David that he is neglecting his two younger children, and that Nic might be beyond a father's ability to help. Heartbroken, David agrees she is probably correct.\r\n\r\nThe most notable aspect of _Beautiful Boy_ is the structure, which is both cyclical and non-linear – the film is made up of a series of high and lows following Nic and David through relapse and recovery, whilst at the same time, there are multiple flashbacks, with scenes in the present giving characters occasion to think about moments from the past. For example, as David sits in a diner waiting for Nic to arrive, he thinks back to a much happier meal he had with his son in that same diner many years previously. This technique is used throughout the film, often flashing back to happier memories of Nic's childhood. The problem with this non-linear structure is that it's overused; there's barely a scene that doesn't have some kind of temporal cutaway. This overuse also dulls the impact of such editing, as after 45 minutes, you're just yearning for the film to stay put for a while. Sometimes the flashbacks do work, revealing something interesting, juxtaposing the past and present evocatively, or changing how we view the present, but a lot of the time, it feels like an unjustified piece of trickery, an end unto itself, insofar as there often isn't a great deal of establishing context. This leaves the viewer wondering, \"how did we get from that scene to this one. Why did what happened there make David think of this?\" This is pretty much the last thing you should be thinking about in a narrative of this nature, and it completely pulls you out of the film. Indeed, there are parts of the movie that so overuse the technique as to seem like a montage rather than a collection of actual scenes.\r\n\r\nAdditionally, the timeline itself becomes confused within all of this, especially in the sense of where the movie's present is supposed to be. For example, there's a scene where we see David dropping Nic off to college, and the two of them enjoy a joint. As I understood it, this scene came after Nic had owned up to his meth addiction and gotten clean, but before he had met Julia and relapsed. Which obviously makes no sense, as the scene gives the impression David has no idea that Nic has been using drugs, surprised he even knows how to smoke a joint. So is his trip to college much earlier in the narrative? But if so, when, as it doesn't seem to fit anywhere else in the timeline? Again, these are not the kinds of things you should be concentrating on when watching what is supposed to be an emotive story, but more often than not, the editing foregrounds itself (the film is cut by van Groeningen's regular editor, Nico Leunen), pulling you out of the narrative.\r\n\r\nAs regards the repetitive nature of the story, I understand what van Groeningen was going for – it is supposed to mirror the back and forth nature of addiction (\"_relapse is part of rehab_\" as David is told), a two steps forward, one step back staccato motion. However, the film falls into a pattern of Nic showing up looking a little more dishevelled than he did before, followed by David doing everything he can to help, followed by his failure to get through to Nic, followed by Nic disappearing, followed by Nic showing up looking a little more dishevelled than he did before, etc. And whilst this may lend itself to a certain authenticity, it doesn't make for very effective drama. In any case, other filmmakers have found ways to depict the repetitive nature of addiction without compromising the story, not the least of whom would be Darren Aronofsky in _Requiem for a Dream_ (2000), who constantly uses a quick montage of the characters doing drugs to suggest the habitual nature of addiction.\r\n\r\nObviously enough, the main theme of the film is addiction, and in this sense, it gets a lot right. For example, in his journal, Nic outlines the vicious-circle that addicts fall into; he needs drugs so he does things of which he's ashamed to get money with which to buy them, but then because he feels so guilty about what he's done, he needs more drugs to cover the shame, so he does things of which he's ashamed to get money with which to buy them, and so on. He's also especially clear when describing the fact that after you've done crystal meth a few times, you don't get the same high from it, and so the addiction becomes all about attempting to recreate that first high (which Nic describes as making a black-and-white world appear in Technicolour).\r\n\r\nPerhaps the most fascinating aspect of the movie is that Nic is a prosperous and intelligent middle-class young man with a strong support system. He is a child of divorce, yes, but he has a good relationship with both of his parents. This is a far cry from the typical addict we see in film and TV, who are usually at the extreme ends of the monetary spectrum, either poverty-stricken and destitute (such as, say, Bubbles (Andre Royo) in _The Wire_) or extremely wealthy and high-functioning (such as Caspar (Geoffrey Rush) in _Candy_). Additionally, as he explains himself, he first tried drugs to see what they were like, and when he liked how they made him feel, he kept on doing them. As he says at one point, the first time he did hard drugs was the best feeling he'd ever had. During the aforementioned scene where Nic and David share a joint, Nic summates this, telling David that marijuana \"_takes the edge off the stupid all day stuff_\". There was no precipitating event, no great emotional trauma which made him turn to narcotics; his addiction is just something that happened, a disease to which anyone could succumb\r\n\r\nThe other main theme is that of the father-son relationship, and this too is well-presented. With both actors giving superb performances, one really sees the bond between the two, and how much Nic's addiction is destroying both of them. In this sense, the real tragedy of Nic's situation isn't the rehabs and relapses, it's seeing him drift further and further away from a man who would literally die to protect him. Given the source material, one does wonder a little if the relationship is idealised somewhat, but irrespective of that, Carell and Chalamet give a masterclass in acting, and I was genuinely shocked neither of them was nominated at the 2019 Oscars.\r\n\r\nWith lesser performances, the film would crumble under the weight of van Groeningen's heavy-handed direction. Thankfully the performances are strong enough that the style distracts rather than undermines. That said, the benefit of the non-linear storytelling is that it allows Chalamet and Carell to really drive home how much their relationship changes, with their playful and happy earlier scenes contrasting heart-breakingly with the fraught and destructive times of later years. Chalamet's is the more physical of the two performances, conveying so much via his body language. It's a world apart from his work in Luca Guadagnino's _Call Me by Your Name_, Elijah Bynum's _Hot Summer Nights_, or Greta Grewig's _Lady Bird_ (all 2017), as he completely inhabits the character, alternating between playing Nic as a sweet, loving, almost immature teenager, and a stressed addict, old before his years, and capable of anything to get money for his next hit. When he is rehabbing, there's a regret and humility in his performance that is nowhere to be seen when he relapses, as he becomes more manic and unpredictable, and much less self-aware.\r\n\r\nCarell, for his part, does most of his best work with his eyes, conveying the sadness and desperation he feels. His helplessness is written across his face, conveying how little he can actually do for his son. He initially approaches the problem in a logical manner (he does methodical pseudo-journalistic research on crystal meth to better understand it, he snorts cocaine to try to put himself in Nic's shoes), before eventually realising there is no logic at play here, and tackling the subject as he would an article for the _New York Times_ is not going to work. Carell plays David as confused, haunted, and desperate, with Nic's addiction, specifically his inability to break it, having as profound a psychological effect on David as it has a physical effect on Nic.\r\n\r\nDespite all of these positives, however, as indicated above, there are a number of problems. For one, van Groeningen chooses not to present some of the darker aspects of Nic's story. For example, he turned to prostitution at one point to fund his addiction. Additionally, as his hits from crystal meth continued to diminish over time, he started shooting it up, which is insanely dangerous. Leaving out aspects such as this gives the film a kind of sanitised feeling, as if we're looking at addiction through a gauze which the director refuses to pull back to let us see it directly. This kind of heart-breaking sordid detail would have helped the film immeasurably, especially in relation to its lack of emotional engagement.\r\n\r\nThis lack is probably the most egregious problem. A film of this nature, detailing something like this, and based on a true story, should be an emotional rollercoaster, but the audience is always removed, the emotions are seen rather than experienced, as if we're looking at the rollercoaster instead of riding it. Because the film introduces us to the characters mid-crisis, and because there's literally not a single scene that isn't either related to Nic's addiction, or a flashback from a scene related to his addiction, we never really get to know David or Nic outside this situation, with the script never really moving beyond David as \"dutiful father\" and Nic as \"desperate son\". Any sense we have of these two people comes almost entirely from the acting, and even then, although you certainly feel empathy and sympathy for them, you don't feel a huge amount else. The problem is that the plot (such as it is) never seems compelling, partly due to how narrowly focused the film is. It's also not a good sign that, for me, the most emotive part of the whole thing was hearing Nic himself reading a monologue from his book over the closing credits.\r\n\r\nThis dearth of characterisation is even more pronounced in relation to the two women, who may as well not be there. Karen has nothing to do but wander around in the background painting trees, whilst Vicki doesn't even get that much – she's a disembodied voice on the phone most of the time, and although I know she appeared in a couple of scenes, by the next day, I'd forgotten what she did in either of them. It's a real waste of two extremely talented performers.\r\n\r\nThere have been some truly great films made about addiction; Otto Preminger's _The Man With the Golden Arm_ (1955), Blake Edwards's _Days of Wine and Roses_ (1962), Jerry Schatzberg's _The Panic in Needle Park_ (1971), Gus Van Sant's _Drugstore Cowboy_ (1989), Danny Boyle's _Trainspotting_ (1996), Mike Figgis's _Leaving Las Vegas_ (1995), Scott Klalvert's _The Basketball Diaries_ (1995), Darren Aronofsky's _Requiem for a Dream_ (2000). Beautiful Boy is absolutely nowhere near anything of this calibre. In fact, it's probably more successful as a kind of instructional installation for relatives of people going through addiction than it is as a film evoking emotions. Told from the perspective of people living through this nightmare, the story is incredibly straightforward and forgettable, when it should be shocking, disturbing, and emotionally devastating. And whilst the film is definitely heartfelt, its lack of emotional engagement, its repetitiveness, its distracting structure, its lack of a plot, all serve to grate against the incredible performances.", "created_at": "2019-07-12T02:28:14.636Z"}, {"movie_id": 451915, "review_id": "5b9016d50e0a267972000d70", "author_rating": null, "review_text": "Inspired by a father and son’s dual memoirs (Beatiful Boy and Tweak, respectively), Felix Van Groeningen’s heartfelt adaptation portrays the relationship between David (Steve Carell) and Nic Sheff (Timothée Chalamet), as both struggle through the latter’s drug addiction.\r\n\r\nThere are about a billion reasons to see this movie: 1) Basically everyone in the cast has been nominated for an Oscar (save for Maura Tierney, who has a Golden Globe and two Emmy noms); 2) Timothée Chalamet; 3) The memoirs are incredible (and not super expensive on Amazon, so you can catch up before the movie comes out); 4) It sets the scene for a quasi Office reunion between Carell and Amy Ryan (who played Holly Flax).\r\n\r\nBut perhaps the most significant — and overlooked — reason is this: director Felix Van Groeningen’s 2012 film The Broken Circle Breakdown is, in my humble opinion, one of the best movies of all time (and available to stream on Amazon, who I promise I don’t work for). Stakes are high", "created_at": "2018-09-05T17:48:05.762Z"}, {"movie_id": 451915, "review_id": "5d27f03e5f6c4965105dfd88", "author_rating": 6.0, "review_text": "_**Earnest and heartfelt, but narratively awkward, and emotionally unengaging**_\r\n\r\n> _They say suicide is a permanent solution to a temporary problem. The problem with being human isn't really so temporary._\r\n\r\n- Nic Sheff; _Tweak: Growing Up on Methamphetamines_ (2008)\r\n\r\n> _Anyone who has lived through it, or those who are now living through it, knows that caring about an addict is as complex and fraught and debilitating as addiction itself._\r\n\r\n- David Sheff; _Beautiful Boy: A Father's Journey Through His Son's Addiction_ (2008)\r\n\r\nBased on the memoirs _Beautiful Boy: A Father's Journey Th__rough His Son's Addiction_ by David Sheff and _Tweak: Growing Up on Methamphetamines_ by Nic Sheff, written for the screen by Luke Davies (_Life_; _Lion_) and Felix van Groeningen (_The Broken Circle Breakdown_), and directed by van Groeningen in his English language debut, _Beautiful Boy_ is a film about the horrors of addiction, told from the perspective of both an addict and his father. Focusing primarily on David's attempts to understand and fight against his son's addiction to crystal meth, the film aims for a no frills _sans_-sentimental authenticity (Davies is himself a former heroin addict, who based _Candy: A Novel of Love and Addiction_ (1997) on his experiences; he also co-wrote the script for the 2006 film adaptation, _Candy_, directed by Neil Armfield). Serving as something of a showcase for the two lead actors (Steve Carell and Timothée Chalamet, both of whom are exceptional), there's little in the way of plot, with the film instead adopting a non-linear cyclical structure designed to mirror the repetitive nature of addiction-rehab-relapse-addiction-rehab etc. And whilst it is certainly heartfelt and respectfully told, there's little in the way of emotional engagement. The structure is also problematic insofar as because there's no real cohesive plot providing forward momentum, the highs and lows are undifferentiated, becoming repetitive. Van Groeningen also overuses flash-backs. So although the film may have an inherent degree of authenticity that's to be applauded, as drama, it isn't especially compelling, with the structure tending to work against the actors, blunting any emotional impact, and keeping the characters always at one step removed.\r\n\r\nLiving in Marin County, Nic Sheff (Chalamet) is an intelligent, popular, and kind teenager, who has a close relationship with his father, David (Carell), his stepmother Karen (Maura Tierney), and his two younger half-siblings, Jasper (Christian Convery) and Daisy (Oakley Bull). He is less close to his birthmother Vicki (Amy Ryan), who moved to LA after she and David divorced. David is a journalist for the _New York Times_, and Karen is a painter, with the family enjoying a comfortable bohemian middle-class existence. The film begins as David attends the offices of a drug counsellor and psychologist, Dr. Brown (Timothy Hutton). Explaining that Nic has become addicted to crystal meth, he wants to learn everything he can about the drug in order to best help his son. The story then cuts to a year previously. Nic has been missing for two days, and when he nonchalantly re-appears, David insists on taking him to rehab. He initially responds well, and soon requests to be transferred to a halfway-house, to which David agrees. A few days later, however, he flees the facility, and David later finds him strung-out in an alley. Taking him to hospital, Nic reveals he has been abusing not only marijuana and alcohol, but cocaine, ecstasy, and, especially, crystal meth. Back in rehab, Nic makes a full recovery, and heads to college to study as a writer, beginning a relationship with a fellow student, Julia (Stefanie Scott). However, having dinner in her house one evening, Nic finds a bottle of painkillers in the bathroom, and once more relapses, except this time he turns to heroin. With David still determined to help him overcome his demons, Karen tells David that he is neglecting his two younger children, and that Nic might be beyond a father's ability to help. Heartbroken, David agrees she is probably correct.\r\n\r\nThe most notable aspect of _Beautiful Boy_ is the structure, which is both cyclical and non-linear – the film is made up of a series of high and lows following Nic and David through relapse and recovery, whilst at the same time, there are multiple flashbacks, with scenes in the present giving characters occasion to think about moments from the past. For example, as David sits in a diner waiting for Nic to arrive, he thinks back to a much happier meal he had with his son in that same diner many years previously. This technique is used throughout the film, often flashing back to happier memories of Nic's childhood. The problem with this non-linear structure is that it's overused; there's barely a scene that doesn't have some kind of temporal cutaway. This overuse also dulls the impact of such editing, as after 45 minutes, you're just yearning for the film to stay put for a while. Sometimes the flashbacks do work, revealing something interesting, juxtaposing the past and present evocatively, or changing how we view the present, but a lot of the time, it feels like an unjustified piece of trickery, an end unto itself, insofar as there often isn't a great deal of establishing context. This leaves the viewer wondering, \"how did we get from that scene to this one. Why did what happened there make David think of this?\" This is pretty much the last thing you should be thinking about in a narrative of this nature, and it completely pulls you out of the film. Indeed, there are parts of the movie that so overuse the technique as to seem like a montage rather than a collection of actual scenes.\r\n\r\nAdditionally, the timeline itself becomes confused within all of this, especially in the sense of where the movie's present is supposed to be. For example, there's a scene where we see David dropping Nic off to college, and the two of them enjoy a joint. As I understood it, this scene came after Nic had owned up to his meth addiction and gotten clean, but before he had met Julia and relapsed. Which obviously makes no sense, as the scene gives the impression David has no idea that Nic has been using drugs, surprised he even knows how to smoke a joint. So is his trip to college much earlier in the narrative? But if so, when, as it doesn't seem to fit anywhere else in the timeline? Again, these are not the kinds of things you should be concentrating on when watching what is supposed to be an emotive story, but more often than not, the editing foregrounds itself (the film is cut by van Groeningen's regular editor, Nico Leunen), pulling you out of the narrative.\r\n\r\nAs regards the repetitive nature of the story, I understand what van Groeningen was going for – it is supposed to mirror the back and forth nature of addiction (\"_relapse is part of rehab_\" as David is told), a two steps forward, one step back staccato motion. However, the film falls into a pattern of Nic showing up looking a little more dishevelled than he did before, followed by David doing everything he can to help, followed by his failure to get through to Nic, followed by Nic disappearing, followed by Nic showing up looking a little more dishevelled than he did before, etc. And whilst this may lend itself to a certain authenticity, it doesn't make for very effective drama. In any case, other filmmakers have found ways to depict the repetitive nature of addiction without compromising the story, not the least of whom would be Darren Aronofsky in _Requiem for a Dream_ (2000), who constantly uses a quick montage of the characters doing drugs to suggest the habitual nature of addiction.\r\n\r\nObviously enough, the main theme of the film is addiction, and in this sense, it gets a lot right. For example, in his journal, Nic outlines the vicious-circle that addicts fall into; he needs drugs so he does things of which he's ashamed to get money with which to buy them, but then because he feels so guilty about what he's done, he needs more drugs to cover the shame, so he does things of which he's ashamed to get money with which to buy them, and so on. He's also especially clear when describing the fact that after you've done crystal meth a few times, you don't get the same high from it, and so the addiction becomes all about attempting to recreate that first high (which Nic describes as making a black-and-white world appear in Technicolour).\r\n\r\nPerhaps the most fascinating aspect of the movie is that Nic is a prosperous and intelligent middle-class young man with a strong support system. He is a child of divorce, yes, but he has a good relationship with both of his parents. This is a far cry from the typical addict we see in film and TV, who are usually at the extreme ends of the monetary spectrum, either poverty-stricken and destitute (such as, say, Bubbles (Andre Royo) in _The Wire_) or extremely wealthy and high-functioning (such as Caspar (Geoffrey Rush) in _Candy_). Additionally, as he explains himself, he first tried drugs to see what they were like, and when he liked how they made him feel, he kept on doing them. As he says at one point, the first time he did hard drugs was the best feeling he'd ever had. During the aforementioned scene where Nic and David share a joint, Nic summates this, telling David that marijuana \"_takes the edge off the stupid all day stuff_\". There was no precipitating event, no great emotional trauma which made him turn to narcotics; his addiction is just something that happened, a disease to which anyone could succumb\r\n\r\nThe other main theme is that of the father-son relationship, and this too is well-presented. With both actors giving superb performances, one really sees the bond between the two, and how much Nic's addiction is destroying both of them. In this sense, the real tragedy of Nic's situation isn't the rehabs and relapses, it's seeing him drift further and further away from a man who would literally die to protect him. Given the source material, one does wonder a little if the relationship is idealised somewhat, but irrespective of that, Carell and Chalamet give a masterclass in acting, and I was genuinely shocked neither of them was nominated at the 2019 Oscars.\r\n\r\nWith lesser performances, the film would crumble under the weight of van Groeningen's heavy-handed direction. Thankfully the performances are strong enough that the style distracts rather than undermines. That said, the benefit of the non-linear storytelling is that it allows Chalamet and Carell to really drive home how much their relationship changes, with their playful and happy earlier scenes contrasting heart-breakingly with the fraught and destructive times of later years. Chalamet's is the more physical of the two performances, conveying so much via his body language. It's a world apart from his work in Luca Guadagnino's _Call Me by Your Name_, Elijah Bynum's _Hot Summer Nights_, or Greta Grewig's _Lady Bird_ (all 2017), as he completely inhabits the character, alternating between playing Nic as a sweet, loving, almost immature teenager, and a stressed addict, old before his years, and capable of anything to get money for his next hit. When he is rehabbing, there's a regret and humility in his performance that is nowhere to be seen when he relapses, as he becomes more manic and unpredictable, and much less self-aware.\r\n\r\nCarell, for his part, does most of his best work with his eyes, conveying the sadness and desperation he feels. His helplessness is written across his face, conveying how little he can actually do for his son. He initially approaches the problem in a logical manner (he does methodical pseudo-journalistic research on crystal meth to better understand it, he snorts cocaine to try to put himself in Nic's shoes), before eventually realising there is no logic at play here, and tackling the subject as he would an article for the _New York Times_ is not going to work. Carell plays David as confused, haunted, and desperate, with Nic's addiction, specifically his inability to break it, having as profound a psychological effect on David as it has a physical effect on Nic.\r\n\r\nDespite all of these positives, however, as indicated above, there are a number of problems. For one, van Groeningen chooses not to present some of the darker aspects of Nic's story. For example, he turned to prostitution at one point to fund his addiction. Additionally, as his hits from crystal meth continued to diminish over time, he started shooting it up, which is insanely dangerous. Leaving out aspects such as this gives the film a kind of sanitised feeling, as if we're looking at addiction through a gauze which the director refuses to pull back to let us see it directly. This kind of heart-breaking sordid detail would have helped the film immeasurably, especially in relation to its lack of emotional engagement.\r\n\r\nThis lack is probably the most egregious problem. A film of this nature, detailing something like this, and based on a true story, should be an emotional rollercoaster, but the audience is always removed, the emotions are seen rather than experienced, as if we're looking at the rollercoaster instead of riding it. Because the film introduces us to the characters mid-crisis, and because there's literally not a single scene that isn't either related to Nic's addiction, or a flashback from a scene related to his addiction, we never really get to know David or Nic outside this situation, with the script never really moving beyond David as \"dutiful father\" and Nic as \"desperate son\". Any sense we have of these two people comes almost entirely from the acting, and even then, although you certainly feel empathy and sympathy for them, you don't feel a huge amount else. The problem is that the plot (such as it is) never seems compelling, partly due to how narrowly focused the film is. It's also not a good sign that, for me, the most emotive part of the whole thing was hearing Nic himself reading a monologue from his book over the closing credits.\r\n\r\nThis dearth of characterisation is even more pronounced in relation to the two women, who may as well not be there. Karen has nothing to do but wander around in the background painting trees, whilst Vicki doesn't even get that much – she's a disembodied voice on the phone most of the time, and although I know she appeared in a couple of scenes, by the next day, I'd forgotten what she did in either of them. It's a real waste of two extremely talented performers.\r\n\r\nThere have been some truly great films made about addiction; Otto Preminger's _The Man With the Golden Arm_ (1955), Blake Edwards's _Days of Wine and Roses_ (1962), Jerry Schatzberg's _The Panic in Needle Park_ (1971), Gus Van Sant's _Drugstore Cowboy_ (1989), Danny Boyle's _Trainspotting_ (1996), Mike Figgis's _Leaving Las Vegas_ (1995), Scott Klalvert's _The Basketball Diaries_ (1995), Darren Aronofsky's _Requiem for a Dream_ (2000). Beautiful Boy is absolutely nowhere near anything of this calibre. In fact, it's probably more successful as a kind of instructional installation for relatives of people going through addiction than it is as a film evoking emotions. Told from the perspective of people living through this nightmare, the story is incredibly straightforward and forgettable, when it should be shocking, disturbing, and emotionally devastating. And whilst the film is definitely heartfelt, its lack of emotional engagement, its repetitiveness, its distracting structure, its lack of a plot, all serve to grate against the incredible performances.", "created_at": "2019-07-12T02:28:14.636Z"}]