[{"movie_id": 878361, "review_id": "64620b3ee3fa2f0145ed0a7d", "author_rating": 6.0, "review_text": "Khris Davis is competent in this otherwise rather pedestrian and chronological biopic of this hugely enigmatic world heavyweight champion. We start with his youthful days when, as a substantial unit (Austin David Jones), he realises that his can settle matters with his fists more easily than he can with his brain. This, of course, leads to some time in juvey where he encounters \"Doc\" (Forest Whitaker) who cuts him some slack after he loses the plot with a guy who stole his sneakers, and enrols him at his boxing gym. What now ensues is history. His run of unbeaten fights, his development from small-time regional character to big-hitting title contender is rather rapidly gone through before we discover the adult character, married to Nancy (Sonja Soon) but philandering as he goes. His boxing is not his only love though, and after losing to Muhammad Ali (Sullivan Jones) he decides to hang up his gloves and take to preaching. He funds his own chapel, funds his own gym to help the local - impoverished - youngsters to find purpose and then, runs out of money... That requires him to return to the ring - at the age of 45 - and try to regain his title! Foreman was heavily involved with this depiction so we can assume it's true in the most part. To be fair, he doesn't set out to depict a saintly man - his peccadillos are there to be seen, but somehow for a man who must have had such a passionate and visceral existence this film is all rather tame and placid. The stats are there to read, this was an opportunity to put some flesh on the character's bones - and I felt this didn't really do that. It skipped across so many of the developmental aspects of the man and his personality only to dwell a bit too often on the less interesting (or domestic) aspects of his undoubtedly roller-coaster life. Whitaker is adequate, nothing more, and though some effort has been made to recreate the bouts in the ring, they had little of the potency of those we saw in the first \"Rocky\" (1976). It's interesting seeing a professional fighter reconcile his wayward behaviour and his love for god, but I thought this could have delivered so much more than it does.", "created_at": "2023-05-15T10:36:46.440Z"}]