[{"movie_id": 646380, "review_id": "61c203ff162bc3008f659c50", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/dont-look-up-spoiler-free-review\r\n\r\n\"Don't Look Up hilariously approaches almost every theme worthy of discussion through Adam McKay's satirical screenplay that will undoubtedly leave viewers either incredibly satisfied or extremely triggered, depending on their opinion about certain subject matters.\r\n\r\nBoasting an absolutely stellar cast, Netflix grabs a bold, divisive awards contender. Packed with allegories, references, and direct jokes surrounding all kinds of media, governments, socio-political topics, and environmental issues, McKay doesn't hold back, which might be a decisive factor in the audience's response.\r\n\r\nThe cast offers unbelievably great performances, but without the protagonists Leonardo DiCaprio and Jennifer Lawrence, viewers would definitely look down to their phones instead of paying attention to the film.\r\n\r\nA fun flick to watch during the Christmas season.\"\r\n\r\nRating: B+", "created_at": "2021-12-21T16:42:39.201Z"}, {"movie_id": 646380, "review_id": "61cc5fdc41aac40088d22d26", "author_rating": 8.0, "review_text": "This is of course social and political satire, and it is sad how much of it rings true. It can be difficult to satirize the excesses of the rich and famous — or even the redneck poor — and the social media juggernaut.\r\n\r\nBut the script clicks on all cylinders a lot of the time and entertains as it eviscerates. I have always liked Mark Ryland’s roles, and this is a real departure for him as the media giant and third richest human ever. But I mostly found it difficult to like Dr. Mindy as he gradually adjusts his beliefs and personality to suit his new fame. My sympathy was with his wife and family, afterthoughts for 95% of the movie.\r\n\r\nBut it was an entertaining movie and I would be willing to watch it again someday, not because of the serious issues it raised (slightly) but just to catch more of the social media and television images that flash across the screen too quickly to take them all in. The social media satire works better, I think, than the political side, which seemed sometimes to just choose an actual person and thrust a version of them into the scene.", "created_at": "2021-12-29T13:17:16.252Z"}, {"movie_id": 646380, "review_id": "61dda0cd8cfcc700654acb47", "author_rating": 9.0, "review_text": "Full Analysis at **Spotamovie.com** **_Intro _**The movie offers several denounces about our society, politicians, and media. We will tell you more in the analysis section of this post. But, on the other hand, the film is sharp, enlightening and it tries to wake up our minds because we lost our ability to think with our brain and see the reality of what is happening around us. **The Story**   Two astronomers discover a comet orbiting within the solar system. Although the scientific community may be excited, the reality is that the comet will crash on earth precisely in 6 months and 14 days. Kate Dibiasky (Jennifer Lawrence) and her professor Dr Randall Mindy (Leonardo Di Caprio), immediately understand the apocalyptical consequences because the impact will wipe out any form of life from our beloved planet.Their mission is to inform the president of the United States of America and find a way to change the comet’s trajectory. The world must unite its strengths and save the life from a tragic end.How is the world going to react? After the comet, what else are our astronomers going to find out? And what the movie wants to teach us? **Discover more at https://www.spotamovie.com/dont-look-up-movie-review-and-analysis-2021-movie/**", "created_at": "2022-01-11T15:22:53.647Z"}, {"movie_id": 646380, "review_id": "62419231c50ad2005cd57273", "author_rating": 7.0, "review_text": "Poor old \"Kate Dibiansky\" (Jennifer Lawrence) and her professor \"Mindy\" (Leonardo DiCaprio) have the misfortune to discover an huge comet heading on a collision course with Earth. When they report this to \"Oglethorpe\" (Rob Morgan) - the man at NASA charged with coping with such existential threats, the three are now exposed to the upper echelons of the US administration that frequently elicits a smile and a grimace from the audience. The real star of the movie, Meryl Streep, is \"President Orlean\" (Yes, guess what her Christian name is?) who presides over her government with the aid of her hapless chief of staff son \"Jason\" (Jonah Hill) in what is a very thinly veiled swipe at all things Trumpian. The story pretty much follows the thread of \"Meteor\" (1979) only with better special effects, and the corporate machinations of the \"Blofeld\"-esque \"Isherwell\" (Sir Mark Rylance) add quite a bit of faux-menace to this rather entertaining parody of disaster movie meets political drama by way of some manipulative and fickle television journalism (epitomised by a fun contribution from Cate Blanchett). The pace of the film is a bit hit-and-miss, but keep an eye out for a nice couple of scenes from Ron Perlman as the archetypally gung-ho, militaristic, \"Drask\" and from Timothée Chalamet (where does he find the time?) as the hippy love interest \"Yule\" that both add some bulk and humour to the otherwise quite flimsy plot that enjoys quite a really fitting end. At the top end of Netflix' productions this - for a change some decent writing accompanies an on-form cast and i enjoyed it.", "created_at": "2022-03-28T10:47:13.047Z"}]