[{"movie_id": 718789, "review_id": "62a7ac84a8b2ca0052c6a57b", "author_rating": null, "review_text": "The digital magicians at Pixar have returned with an origin story of one of their most famous characters. “Lightyear” opens with an explanation that Andy from “A Toy Story” was given a toy based on his favorite movie in 1995 and that this is the movie upon which the toy was based.\r\n\r\nWith that explanation out of the way, the film centers on a giant ship deep in space that encounters a planet and awakens Space Ranger Buzz Lightyear (Chris Evans) to investigate. Along with a fellow ranger and a recruit, Buzz scopes out the planet only to discover it is hostile and makes a hasty exit from the planet. Unfortunately, in doing so their ship is damaged and they are left stranded on the planet and forced to establish a colony.\r\n\r\nYears later Buzz is about to undergo a test flight based on a new fuel that the colony hopes will replicate their previous source and will allow them to travel at the insane velocities needed to cover millions of light-years.\r\n\r\nThings seem to go as planned until a critical failure and Buzz learns that his four-minute flight actually covered several years on the planet. Undaunted Buzz tries again and again and returns to find his friends aging, having children, and passing away with only his robotic cat Sox (Peter Sohn) to keep him connected to his past and assist him.\r\n\r\nWhile this would make for an interesting enough film it is actually just the setup to the larger story which involves a hostile Robot army and an evil menace named Zurg who threatens Buzz and his hastily assembled team of volunteers to save the day.\r\n\r\nThe film has amazing animation and all the humor and charm that one associates with the best Pixar films and is not above giving the audience an emotional tug here and there along the way as I can remember more than a few Pixar films that caused audiences to tear up.\r\n\r\nSince this is the first of the last three Pixar films to make a cinematic release it would be easy to say that it is a return to form for Disney/Pixar but I would say that is an understatement as the film mixes humor, action, and interesting characters to form a very enjoyable and engaging adventure which is one of the most satisfying Pixar films in recent memory and one every bit worthy of their name.\r\n\r\nIt will be interesting to see what the future holds for this crew as I would very much like to see Buzz and his crew return for new adventures soon as “Lightyear” is a new Pixar classic that the entire family will love.\r\n\r\n4.5 stars out of 5", "created_at": "2022-06-13T21:30:44.577Z"}, {"movie_id": 718789, "review_id": "62abe05234e1520051e34c21", "author_rating": 7.0, "review_text": "Like _Toy Story 4_, _Lightyear_ is an unnecessary installment to the Toy Story franchise, but is enjoyable nevertheless. Its homage to science fiction makes the animated film feel more like a sci-fi actioner rather than an animated film the majority of the time. It has a rich and palpable atmosphere that is gorgeously animated and is filled with the laugh out loud and heartfelt moments Pixar is typically known for.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Lightyear-2022-Review-A-Visually-Gorgeous-Nod-to-Science-Fiction", "created_at": "2022-06-17T02:00:50.622Z"}, {"movie_id": 718789, "review_id": "62ace8f4f859580093e6dcf1", "author_rating": 3.0, "review_text": "Where has the \"magic\" gone? Disney muddles the mix once again and ruins a childhood favorite by removing the accomplished Buzz frontman Tim Allen for Chris Evans? I was so wanting to see the quick quips and humor a comedian such as Allen has always brought to the Toy Story franchise and sadly they went the other direction here. Formulaic and predictable. This could have been any other space-based children's animation.", "created_at": "2022-06-17T20:49:56.811Z"}, {"movie_id": 718789, "review_id": "62ae04c9595a5600513f1ab6", "author_rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/lightyear-spoiler-free-review\r\n\r\n\"Lightyear is far from yet another incredibly memorable Pixar film, but it's still an adventure filled with tons of entertainment, inspiring messages, and breathtaking animation.\r\n\r\nAngus MacLane doesn't deviate from the studio's well-known formulas, delivering a narrative without notable deviations from the most predictable, safest path. Except for an unnecessary, overly complex twist for the target audience in the third act, Buzz Lightyear and his team take viewers through space on a remarkably immersive audiovisual journey.\r\n\r\nThe voice cast is extraordinary, most notably Chris Evans - born to play captains - and Peter Sohn - non-stop hilarious as the robotic cat Sox, Disney's most popular new toy-to-be.\r\n\r\nI highly recommend to see it in theaters!\"\r\n\r\nRating: B+", "created_at": "2022-06-18T17:00:57.040Z"}, {"movie_id": 718789, "review_id": "62b0272262e86f0060852039", "author_rating": 6.0, "review_text": "Just like in \"Alien\" (1979) a ship's computer wakes some of the crew mid-trip when it detects an uncharted planet. Space Rangers \"Buzz\", \"Hawthorne\" and a rookie take the ship down for a look, but are soon facing some hungry plants and big bugs. He attempts to escape, but the ship (the \"Turnip\") clips a mountain top and crashes, destroying their power crystal. He determines to find a way to replace it - but each time he tests it out, his off-world moments become 4 years for those left behind, and so his repeated attempts to get them all home safely merely see him stay the same age as his companions grow old, marry, have children - grandchildren, even - then die. It's on return from one of his tests, with a functioning power source designed by his auto-cat \"Sox\" - that he discovers their settlement is being besieged by the robot soldiers of \"Emperor Zurg\" and he, together with his cat and an enthusiastic youth training team must destroy the enemy ship and save the day. Director Angus MacLane did pretty much everything here and though it isn't a bad animation, it could possibly have been doing with a few more objective eyeballs to keep it sharp. The story starts off strongly with some fast-paced dialogue and a bit of fun with the inhabitants of their new home. Quickly, though, it becomes a bit repetitive and starts to drag. Sentimentality creeps in a bit too much and as the plot unfolds, it does become a bit harder to establish just what this film has to do with \"Toy Story\" (1995) for which it is supposed to be a prequel (the plot towards the end reminded me of \"Guardians of the Galaxy II\" from 2017). The conclusion doesn't fit at all - indeed, I wondered if this were merely the first of a few films that might, eventually, explain how \"Buzz\" ended up as the new favourite of \"Andy\". The production is good, but that is no longer anything to shout about with Disney/Pixar - it is what they do. This needed to build more on why we cared about \"Buzz\" in the first place, and it doesn't really manage that. It picks up in the last fifteen minutes as the messages of teamwork and collaboration start to flow through the narrative but is really too long. It is still worth a watch on a big screen to appreciate the colourful visual effects.", "created_at": "2022-06-20T07:52:02.706Z"}, {"movie_id": 718789, "review_id": "62ebc1c7273648005ac01542", "author_rating": 8.0, "review_text": "Lightyear is a lighthearted and fun sci-fi adventure. Let me get this out of the way first and foremost, the visuals in this film are spectacular. The artists who did this deserve a raise because this might be the best looking animated film I have ever scene. I really enjoyed the touch of changing the resolution at a certain point. With that out of the way, I really enjoyed this film, the exploration of a new world was really well done. I liked the time traveling elements that were presented, borrowing some from Interstellar, and it brought some really sad moments that nearly drew a tear from me. The cast of characters were funny and their evolution throughout the story was a joy to watch. I was not super impressed with this movies interpretation of Zurg. I just felt like there was more that could have been done with that. \r\n\r\n**Score:** _82%_\r\n**Verdict:** _Great_", "created_at": "2022-08-04T12:55:35.455Z"}, {"movie_id": 718789, "review_id": "635c2ac4fd63000079a87683", "author_rating": 6.0, "review_text": "**Lightyear is a decent film that overshoots its primary audience and crash lands as a decent movie but with a confused plot focused on adults rather than children.**\r\n\r\nLightyear is a confusing film. It’s definitely not bad. It fills its runtime with funny characters and engaging conflict, but the story is a bad choice for a kids’ movie. It borrowed Interstellar’s time dilation concept and mixed it with an evil future self plot which felt out of place and left my toddler disengaged. I did enjoy the film, but its themes and script felt like a space adventure written for adults shoved into Pixar animated packaging. Lightyear’s identity crisis distracted some from the overall film, and its story bit off more than it could chew.", "created_at": "2022-10-28T19:17:24.979Z"}]