[{"movie_id": 698508, "review_id": "630b08970f5265007aac3486", "author_rating": 2.0, "review_text": "Redeeming Love looks great. It features great locations shot with great cinematography, but that’s about all director D.J. Caruso can do to entice us to keep watching. It’s terrific to see a story unfolding in a non-CGI, true-to-life setting, even if it’s Cape Town standing in for California (but then some of the greatest westerns were filmed in Europe, so there’s that), but while this movie arguably achieves the western look, it fails to conjure up any sort of western feel.\r\n\r\nThe script concerns a Hooker with a Heart of Gold known as Angel, who is so sought after that the local Madame, who calls herself Duchess, holds a daily raffle to determine which lucky slack-jawed gold miners – there is more than one winner per day – get to hold sexual congress with her. This is such a cumbersome arrangement that it actually gets in the way of the plot, so that co-writers Francine Rivers and Caruso Hand Wave it not long after they have introduced it.\r\n\r\nSo-called “dirt farmer” Michael Hosea becomes smitten with Angel, so what does he do to get near her? Does he buy all the numbers in the raffle? Does he have the raffle rigged? No and no; he simply “pays double”. That’s it. Why this hasn’t occurred to at least some of the yokels who form a daily scrum outside the brothel is anybody’s guess. Another good question is where Michael, who is not a miner, finds enough “gold dust” to gain access to Angel on three different occasions.\r\n\r\nAngel wants nothing to do with Michael owing to a deep-seated hatred and distrust of men, which is established in a series of flashbacks that are so many and so long they could make up an entire, separate movie all by themselves. They are also the reason that Redeeming Love unnecessarily breaks the 120-minute mark. But the oddest part about these flashbacks is that they show Angel escaping a life of compulsory whoredom only to enter a life of voluntary whoredom. Twice. Maybe even thrice, but that last time is once again against her will. In any case, it gets to be quite repetitive after a while.\r\n\r\nIt is only after Angel gets the tar beaten out of her by the Duchess’s lackey Magowan that she relents and agrees to marry Michael – but first he has to pay off her “debt” to the Duchess, and the irony that he literally buys Angel off in order to make an honest woman out of her is lost on Michael and Caruso alike.\r\n\r\nRedeeming Love’s greatest achievement, other than its photography, is how well it masks its biblical pedigree. According to Wikipedia this is a “Christian Western” based on an homonymous novel by Rivers (unread by me, though it wouldn’t surprise if she had first published it under the pseudonym F.R. Ancine), which in turn is inspired by an obscure Old Testament book – not that you would even guess at any of this by watching the movie, and that’s actually a good thing. It may be long and boring, but at least it’s not overtly preachy.", "created_at": "2022-08-28T06:17:59.796Z"}]