[{"movie_id": 324786, "review_id": "58a8afd79251410a0a001d8b", "author_rating": 7.0, "review_text": "Out of all the films nominated for best picture, there is one that isn’t getting much attention at all. In Hacksaw Ridge, the narrative surrounding the film doesn’t have much to do the film at all because it’s identity seems to be centered on Mel Gibson’s comeback.\r\n\r\nRead More: https://reviews.boxofficebuz.com/review/hacksaw-ridge", "created_at": "2017-02-18T20:34:31.484Z"}, {"movie_id": 324786, "review_id": "58ac0bfc925141590e01166b", "author_rating": 10.0, "review_text": "I first saw Hacksaw Ridge, back in November when it first came out.. Went to an afternoon screening and it was packed. From the very first scene to the last , I was in awe. This is the best movie I have seen in a long time. The last 30 minutes of the film, I had tears rolling down my cheeks. After it ended, it got a 5 minute standing ovation. Braveheart is my all time favourite movie and have seen it over 200 times., but this might just be my new favourite movie. I have seen it 6 times now, and cried every time. It is such an emotional film. The story of the HERO Desmond Doss is truly inspiring.Thank you Mel Gibson and Desmond Doss Jr. for letting us know more about this remarkable man. Hugo Weaving was robbed of an Oscar nomination. Andrew Garfield blew my away with his performance and it is Vince Vaughn's best performance as well. It is the best film of 2016.", "created_at": "2017-02-21T09:44:28.379Z"}, {"movie_id": 324786, "review_id": "58b097d5c3a3682354000338", "author_rating": 8.0, "review_text": "**On the battlefront, his intention was to save the lives.**\r\n\r\nThe film was awesome, mainly because of the good message it carried out. That's not it, the film was well made with the wonderful cast and their great performances. The special effects were top notch, as well as the location where the majority of the second half takes place. This is a US-Australian co-production. Mel Gibson returned to the director's chair with a bang after exactly a decade. It got six Oscars nominees, so let's wait and see how many awards it grabs.\r\n\r\nIt was the World War II theme, based on a real person and events. It tells the story of an American youngster named Desmond Doss, who joins the army to contribute to his nation. But for his religious point of view, he struggles during the training. After managing to make through, the remaining film focused to reveal his bravery on the battlefield against the Japanese armed forces at Okinawa in a place called Hacsaw Ridge.\r\n\r\nThe story was based on one of the ten commandments. Doss, who strongly believes in that carries the same ideology to the combat zone. But all the initial part of the film reflects why he is very on to it. Especially after a fight with his brother in his childhood, followed by saving a severely injured man in a road accident just before deciding to join the army. So it is like both, a war film, as well as an anti-war theme. Most importantly, it tells us the bravery of a man, like of something Gandhi in the battlefield.\r\n\r\nHe did it in what he had believed, but my perspective differs. I liked the film, as a biopic and the message it delivered. Very entertaining too, but when it comes to Doss' belief, I think it was flawed. In the first place he would have not joined the army if he's true to the commandment. That's the basic rule of the commandment if one wants to adopt it.\r\n\r\nHe was just one of the unique person with such idea and luckily succeeded following it in a hostile situation. Only if you think all his episodes from an atheist perspective, that's how you would feel. One of the major reasons for that is, when he saves his men by letting his enemy die. But appreciable effort, at least from the Americans perspective. A true hero for his nation. One of the best war films ever. Instead of saying a must see film, I would say don't miss it.\r\n\r\n_7.5/10_", "created_at": "2017-02-24T20:30:13.897Z"}, {"movie_id": 324786, "review_id": "5cea38820e0a261bf2ca8ba3", "author_rating": 8.0, "review_text": "Most of these men don't believe the same way you do, but they believe so much in how much you believe. \r\n\r\nHacksaw Ridge is directed by Mel Gibson and written by Robert Schenkkan and Andrew Knight. It is based on the 2004 documentary The Conscientious Objector. It stars Andrew Garfield, Sam Worthington, Vince Vaughn, Luke Bracey, Teresa Palmer, Ryan Corr, Hugo Weaving and Rachel Griffiths. Music is by Rupert Gregson-Williams and cinematography by Simon Duggan.\r\n\r\nFilm is a depiction of the real life heroics of Desmond Doss, an American pacifist combat medic in WWII during The Battle of Okinawa.\r\n\r\nHow great to have Gibson back directing, more so when he's tackling the brutalities of war and the critical human interest stories within. The story of Desmond Doss is inspirational stuff and Gibson and his team have done his story proud. \r\n\r\nFirst half of the picture details Doss' upbringing, getting to know his family background, his beliefs and the forming of his loving relationship with Dorothy Schutte. Then after Pearl Harbour he enlists in service and we are then witness to boot camp, which comes with the horrors of bullying and ostracization due to Doss refusing to even touch a rifle - let alone use one! After the military based political thunder has exhausted its armoury, Doss and the rest of the 77th Infantry Division are sent to Okinawa to try and capture the Maeda Escarpment (Hacksaw Ridge). From where a true legend is born.\r\n\r\nAs is a Gibson trademark, the battle scenes are terrifyingly real and bloody as can be, the horrors of war laid bare for dramatic impact. Amongst the carnage, which is magnificently framed in smoky hazes and a landscape obliterated by weaponry, Doss (brilliantly brought to life by Garfield) comes to the fore. From within the madness comes humanity in its purest and most genuine form, and it makes for edge of the seat viewing whilst stirring the blood of those invested fully in this remarkable story. 9/10", "created_at": "2019-05-26T06:56:02.051Z"}, {"movie_id": 324786, "review_id": "5de41be5a7e36300196bca18", "author_rating": 6.0, "review_text": "***Tribute to a real-life WW2 “conscientious collaborator”*** \r\n\r\nAfter Pearl Harbor, Desmond Doss of Lynchburg, Virginia, joins the US Army to become a medic and serves at the Battle of Okinawa. As a Seventh Day Adventist and conscientious objector, his goal was to save lives, not kill, which naturally causes problems with his fellow soldiers; until they observe his bravery in combat. Teresa Palmer is on hand as Doss’ potential babe while Vince Vaughn plays the drill sergeant. \r\n\r\nBased on a true story and directed by Mel Gibson, \"Hacksaw Ridge\" (2016) is a reverent and compelling WW2 flick that includes the usual training sequences in the first half balanced by intense combat sequences in the second. The unique factor here is that the brave protagonist refuses to use a weapon and is determined to only save lives in the midst of the insanity of war. This is an interesting real-life tale that needs to be told and “Hacksaw Ridge” is a good war movie only marred by laying on the heroics too thick as well as the lack of depth in the peripheral characters, which makes them uninteresting. The latter is in contrast to the outstanding “Platoon” (1986) which featured several well-defined characters.\r\n\r\nThe movie’s about an individual who believes in ABSOLUTE pacifism, which is a peaceable attitude that refuses to ever turn to violence, even in response to evil or for the purpose of national defense. He thinks this is supported by the Bible and, specifically, the New Testament, but it isn’t. The Scriptures support LIMITED pacifism, which is a peaceable attitude that only resorts to violence when justified. Christ' instructions to \"turn the cheek\" related to responding to a backhanded slap to the face, which was an insult in that culture. In other words, we could all save ourselves a lot of trouble in life if we learn to ignore the antagonism of various morons who would like to divert our focus and ruin our day. The Old Testament teaches this as well: \"A fool shows his annoyance at once, but a prudent man overlooks an insult\" (Proverbs 12:16). So Christ was talking about giving an antagonist a break for the sake of peace in situations of personal offense; he wasn't referring to cases of severe criminal acts or defense of one’s nation. \r\n\r\nFor proof, Jesus' ministry team had a treasury box and some of his workers carried swords for protection from thieves/murderers in their travels. You see, Christ & his disciples weren’t absolute pacifists. On two occasions, the Messiah got a whip out and chased all the fools out of the Temple – throwing over tables, swinging the whip and yelling. He was a Holy Terror, pure & simple, and this caused the legalistic religious leaders to fear him and plot murder (Mark 11:15-18). Harmless pacifists don't inspire fear and provoke murder plots. Moreover, Romans 13 clearly states that the righteous laws of human governments are ordained of God for the purpose of punishing criminals, domestic & foreign, who threaten the lives of citizens. This includes the right to execute when appropriate. The majority of sane Christians realize this, but there are a few extremists, like Doss in the movie, who refuse to be balanced with the Scriptures on this matter and insist that violent conflict is never appropriate. They’re wrong. Sometimes it’s necessary, like after the Japanese attacked Pearl Harbor, unprovoked, murdering over 2300 innocents and wounding 1100.\r\n\r\nThe film runs 2 hour, 19 minutes, and was shot in New South Wales, Australia.\r\n\r\nGRADE: B-", "created_at": "2019-12-01T20:00:37.566Z"}, {"movie_id": 324786, "review_id": "6319e3f446e75f007e41de83", "author_rating": 8.0, "review_text": "**A really good movie, which only lacks in some details.**\r\n\r\nThis was not the first war film directed by Mel Gibson. He had previously made at least one military-themed film, “We Were Soldiers”, set in Vietnam. However, it is a film that addresses much more human and intimate themes, in my opinion, by following the Doss family, a family from rural Virginia, and the trajectory of one of their children, Desmond.\r\n\r\nSon of an extraordinarily devout mother, raised an Adventist, Desmond learns as a child to deny violence (the film shows a fight between brothers that could have ended very badly, but in real life it was a fight between Desmond's father and his brother-in-law) and to strictly follow his faith and religion. When the US joins the Allies in World War II, the brothers decide to enlist, but Desmond insists on doing so on his own terms, that is, as a combat rescuer, exempt from the use and carrying of any weapon. Of course, the US military isn't going to take this in the best light.\r\n\r\nThe film exposes itself in a somewhat lengthy way and captures our sympathy very well, but despite many people complaining that the first part of the film is slow and tiring, I felt this more in the prolonged combat scenes, despite understanding what led Gibson to detail them so exhaustively. Still, it is necessary to be frank: they are excellent battle scenes, with rich details and a very accentuated degree of rawness. Unfortunately, the dialogues aren't very good, they sound a bit cliché, and it's annoying to see that in a movie with so many qualities. The film also makes efforts to create a romantic subplot around Desmond's first wife, but things don't go well, and the material is frankly poor.\r\n\r\nIn general, Gibson does a good job of directing, although that won't come as a surprise to the most attentive observer. He already has a number of hits in his filmography and, together with Clint Eastwood and Bradley Cooper, is one of the actors I most like to see in the director's chair. Until now, I never really considered the value of the actors involved in this project. Some I just don't know very well. Andrew Garfield is an example: I've seen him in other works, but the actor never completely convinced me, so I was very impressed with his work here. Sam Worthington also impressed me very well, although he's an actor I recognize more easily, and I've seen him work well in other films. Hugo Weaving is excellent, and Vince Vaughn also deserves praise. Only Teresa Palmer seems to have more difficulty to disentangling herself from the work at hand, perhaps due to the weak material received.\r\n\r\nTechnically, the film has a lot of good things to look at, starting with the reasonably rigorous way in which Gibson seeks to re-enact the combat and war environment, from the recruiting camp to the field. Unlike many films from his past, where the director trampled on historical truth, he seems to make sincere efforts to respect it here. The visual and special effects are really very good, and the CGI used is truly excellent and gives the film a remarkable realism, especially in the combat scenes. The sets are interesting and the costumes too. I especially liked the old uniform that Weaving wears in a brief scene, given the difference with the uniforms in use at the time. The cinematography takes advantage of all this and more, and the camera moves intelligently, putting us in the fight, making us suffer with those soldiers, and feel what they felt, what Gregson's soundtrack -Williams accentuates even more.", "created_at": "2022-09-08T12:45:40.704Z"}, {"movie_id": 324786, "review_id": "63be0b08fc31d30092c672fb", "author_rating": 10.0, "review_text": "I don't want to say that I dislike Mel Gibson as an actor, I mean he's been in plenty of movies that I love... but like Clint Eastwood, he makes a FAR better director than he ever made an actor.\r\n\r\nHacksaw Ridge is just one of those films where he does a great job... unfortunately it is Mel Gibson, so it's over-the-top carnage that is not at all underplayed. But you can't fault Gibson for making a Gibson film, you should really know as much coming in.\r\n\r\nAnd he actually got Andre Garfield to act, which might not win him a reward, but it certainly should, that is a something that could get a man canonized... and it was his involvement that made me mistakenly put off viewing it for a few years. He seems like a real actor in this, accent and all.\r\n\r\nAnd then, of course, it's the story of a pacifist who went to war to save lives... and in the end that's pretty noble by the strictest definition and you feel it though out, which is probably the point... despite the over-the-top carnage.", "created_at": "2023-01-11T01:04:08.227Z"}]