[{"movie_id": 331, "review_id": "5bacc4ae0e0a2664c903d508", "author_rating": 5.0, "review_text": "Just as pointless to make as the last film. At least the raptor effects were back up to specs.\r\n\r\n**_Alan!_**\r\n\r\n_Final rating: ★★½ - Had a lot that appealed to me, didn’t quite work as a whole_.", "created_at": "2018-09-27T11:53:18.274Z"}, {"movie_id": 331, "review_id": "5d927be97cffda0019fb53d4", "author_rating": 5.0, "review_text": "Reverse Darwinism - survival of the most idiotic.\r\n\r\nEight years after the horrors of Jurassic Park, we find Dr. Alan Grant happy with his lot, nothing on Earth could coax him back on to one of the \"InGen Islands.\" Trouble is, is that Paul and Amanda Kirby, in the search for their missing son, get him to Isla Sorna without his knowing anything about it, and sure enough, dinosaurs are set to rule their evolved world once more.\r\n\r\nClocking in at just about 83 minutes in actuality, you sense that director Joe Johnston (Jumanji) knew he had to get in quickly, do his job, and get the hell out of Dodge ASAP. Sure enough, JP3 feels like (is) a quick coin in, the formula is straight up simple from the executive desks, dump a load of annoying characters on an island and see if they can survive being chomped on by dinosaurs. That the makers managed to get Sam Neil and William H. Macy on board with such a turgid script, is nothing short of amazing. Perhaps just as Neil's character is duped in the film, so shall it be in real life...\r\n\r\nStill, it's no abomination by any stretch of the imagination. Johnston, realising that the audience wants dino action, wastes no time in letting the critters loose on our motley crew. Which in spite of the child friendly nature of the piece (think more chase movie adventure than monster peril) is all rather spiffing and enjoyable. You may find yourself hoping the irritable Téa Leoni gets eaten, and you may find yourself laughing at some of Alessandro Nivola's scenes when you are not meant to (is that a Superman homage?), but at least it's fun enough to get away with the bad points. Thanks in the main to the creatures and the relatively short running time. 5/10", "created_at": "2019-09-30T22:04:25.529Z"}, {"movie_id": 331, "review_id": "629e7fa953866e009c06740c", "author_rating": 2.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nI can understand why some viewers find Jurassic Park III fun enough. I just can't tolerate it, sorry. It feels more like a parody than a serious attempt at making a good sequel. The suspense and sense of wonder are totally gone. Even the CGI-animatronics combo looks terrible.\r\n\r\nI also couldn't stand the new characters, ugh. I may come back tomorrow and think differently, but Fallen Kingdom has more redeemable qualities, despite it also being pretty awful and even offensive to fans of the saga.\r\n\r\nI just don't imagine myself rewatching III ever again.\r\n\r\nRating: D-", "created_at": "2022-06-06T22:28:57.436Z"}, {"movie_id": 331, "review_id": "62e663909f51af005f922d81", "author_rating": 10.0, "review_text": "I guess you could call this Jurassic Park Lite.  Everything about it is reduced. It has a much shorter running time and the plot is contracted to the point that it is just about a handful of people looking for a child in a violently wild zoo. They enticed Sam Neil back into the cast, and to a lesser extent Laura Dern, but the movie seems to feel the absence of Jeff Goldblum’s Ian character. The script seems to recognize this lack as they have Alan Grant whipping out quotes and theories of Ian’s. Meanwhile I think William H. Macy’s talents might have been a bit wasted in his role.\r\n\r\nIt is an entertaining little film, at least, as they threw in the obligatory sigh-inspiring shots of herds of large dinosaurs and spots of humor. I could have done without the ascension of the raptors to the status of being thinking, plotting creatures who would have been superior to humans if they only hadn’t been wiped out by that pesky asteroid. I thought that was a bit extreme.  I thought the best moment came when Alan realized the the bridge they were crossing was part of an aviary for the pterodactyls.", "created_at": "2022-07-31T11:12:16.640Z"}, {"movie_id": 331, "review_id": "64a8196965c26c00aedd71ba", "author_rating": 6.0, "review_text": "No longer a theme park. People still go to the island. A small group gets stranded on the island, and encounters the dinosaurs.", "created_at": "2023-07-07T13:55:53.027Z"}, {"movie_id": 331, "review_id": "64f2ea15e0ca7f00ae3a0d6b", "author_rating": 6.0, "review_text": "I have to say that I found this, though still a poor relation of the first film, eminently better than the second. Sam Neill is lured to the Isla Sorna (the reserve isle) by a businessman - ostensibly as a glorified aerial tourist guide - only to discover it is a rouse to help \"Kirby\" (William H. Macy) & his wife \"Amanda\" (Téa Leoni) recover their son who went missing whilst paragliding over the island some weeks earlier. It's the usual adventure fayre with loads of great big beasties, velociraptors and dodgy sat-phones. There's plenty of fantasy gore and roar and it does it's job well enough - though I have to say I would gladly have fed Blake Michael Bryan (\"Charlie\") to any one of the carnivorous monsters from about 30 seconds after his fiercely irritating character hit the screen.", "created_at": "2023-09-02T07:53:57.906Z"}, {"movie_id": 331, "review_id": "65155a2993bd69011b8c6b61", "author_rating": 4.0, "review_text": "I figured I saw the first two, I might as well see this one, too. Dr. Alan Grant (Sam Neill) is tricked into going to the second island by Amanda (Tea Leoni) and Paul (William H. Macy) Kirby, who are looking for their missing son Eric (Trevor Morgan). A few supporting players go, too, to provide food for the dinosaurs without caring about the loss of their characters. There is lots of running, a climax that never happens, and the promise of another sequel that wouldn't come.\r\n\r\nForgive the short synopsis, the truth is this film steals tons from the first two films. There is a \"dinosaur poop\" scene, and another character supposedly dies and we must waste our time watching for him to appear hurt but alive. I would compare this film to the awful \"Back to the Future Part II.\" It was also released to kind of tie-in the future episodes, but does not stand well on its own. If you are going to continue a major action franchise, you would think the third film would be even bigger than the first two. No such luck here. The special effects run hot and cold. Good dinosaur graphics, but what is with the script? The film makers decided the audience wants nothing but dinosaur attacks, and throws in all sorts of them. These do not seem to take on any sort of breakneck speed, this just looks like a resume tape for Stan Winston's special effects. This is a greatest hits compilation of people getting chased, attacked, and eaten, in all its PG-13 gory glory, without any sort of suspense or scares. Action scenes would start, like the dinosaur at the steel fence, then end as the humans would run away, talk, then get chased again. Would everyone stop teaming Sam Neill with children? The teenage boy here is better than the lovey-dovey cutesy-wutesey duo from the first film, but I was sick of seeing his heart melted by youth. Speaking of youth, I literally cannot remember anything about Neill's young protege, Billy (Alessandro Nivola). His character is so vacuous and laid back, he disappears from the screen. I kept thinking \"who is that? oh, yeah, Billy with some stolen raptor eggs.\" Macy and Leoni are okay, but better than this material. If you have seen the first two, you might as well see \"Jurassic Park III\" as well. It is not any good, but when has that stopped a major motion picture studio from shoving a middling franchise down our  throats?", "created_at": "2023-09-28T10:49:13.921Z"}]