[{"movie_id": 201, "review_id": "5f9331e47c6de30033f23b5c", "author_rating": 6.0, "review_text": "Good watch, could watch again and can recommend (at least for dedicated \"Star Trek\" fans).\r\n\r\nI feel like I just enjoy \"Star Trek\" TNG just enough that I just like that we have movies.  I thought this was good, but I completely understand if other people didn't appreciate it.\r\n\r\nWhile the core of the concept is a little wonky, the look into the Romulan Empire and it's caste system is somewhat interesting on its own.  It does create a lot of questions though, such as why the \"untouchable\" caste would be given enough resources to create such an impressive warship.\r\n\r\nWe get another look into the significance of Data's character, particularly that he isn't an easy creation and cannot be copied simply.\r\n\r\nIt's not the best movie, but it is fun to see some more of \"Star Trek\" TNG.", "created_at": "2020-10-23T19:41:24.780Z"}, {"movie_id": 201, "review_id": "605f6c2fb84f94006bfa8111", "author_rating": 7.0, "review_text": "_**Solid Trek Film**_\r\n\r\nSo many people inexplicably love to hate \"Star Trek: Nemesis\" (2002), but it's actually a solid Trek film featuring the Next Generation cast. The lengthy space battle in the final act is second to none in the Star Trek franchise. But that's not the main reason I like it.\r\n\r\nI like the whole exploration of the conflict of flesh (Shinzon) and spirit (Picard) and the debate over nature (Picard) vs. Nurture (Shinzon), or is it nature (Shinzon) vs. Nurture (Picard)? Like \"Star Trek VII: Generations\" (1994), it entertains while delving into deeper themes, although \"Generations\" is better (a near masterpiece, in fact; see my review for details).\r\n\r\nData's course of action at the end is way more compelling and moving than a similar scene in \"Star Trek II: The Wrath of Khan\" (1982). Think about it, Data becomes the Christ figure by making the ultimate gesture of love and loyalty; an android, no less.\r\n\r\nSpeaking of TWOK, \"Nemesis\" is often said to be a quasi-remake of that film. It shares some plot elements of the trilogy (TWOK, TSFS and TVH), but that's it (more specifically, the space stand-off, Data's sacrifice and the \"resurrection\" of a blank-version of himself). It's an homage, not a remake, and better than the overrated TWOK.\r\n\r\nWhile NEMESIS may not rank with the greatest of Trek films, it's certainly a solid Trek movie, along the lines of \"Star Trek VI: The Undiscovered Country\" (1991). It has the most beautiful space sequences in the series and the score by Jerry Goldsmith is superlative as usual, not to mention welcomely familiar.\r\n\r\nConcerning the incredible ire the dune buggy sequence has provoked, I'm at a loss. The landing party had to cover a lot of terrain, how else would they do it without something to travel in? Why walk miles on end when you don't have to? Besides, it's a fun scene and gives the austere proceedings a much-needed jolt at that particular point.\r\n\r\nBe sure to check out the deleted scenes; there are a couple that shouldn't have been cut, like the one involving Riker's joke on Picard's new First Officer and an amusing one involving Picard and Data having a discussion over wine.\r\n\r\nThe film runs 1 hour, 55 minutes.\r\n\r\nGRADE: B+", "created_at": "2021-03-27T17:32:31.721Z"}, {"movie_id": 201, "review_id": "636d01eb81383100772f7b60", "author_rating": 6.0, "review_text": "This time it's the \"Next Generation\" who take to the silver screen in what I found to be a passable adventure film. Even for a \"Star Trek\" film, it starts of implausibly though with \"Riker\" and \"Troi\" getting married and having their first dance - but there was no \"Lady in Red\" or \"I Will Always Love You\"... we didn't even get Tammy Wynette singing \"DIVORCE\"... Cleary this film was going to be lacking in realism then... Anyway, shortly afterwards \"Capt. Picard\" (Patrick Stewart) and the crew head to \"Romulus\" for a summit only to find that Alan Dale and the entire senate have been assassinated and that Praetor \"Shinzon\" (Tom Hardy) is in charge of a very heavily armed warship. The two men meet and it is quite clear that the former has megalomaniacal tendencies that involve a personal relationship with our brave Captain. The story is not so hot, the plot - as ever with this strand of ST couldn't just have a straightforward action theme - phasers and photon torpedos at the ready. No, we had to have some dull familial sub-plots and the always annoying \"Data\" (Brent Spiner) finds himself a brother (think \"C3PO\" on the Cloud City above \"Bespin\"). Anyway, trust wains, tempers flare and the last twenty minutes are genuinely at the better end of ST moviedom - loads of pyrotechnics and hammy acting. Hardy does fine as the baddie (he was only 25) and the rest of the established cast turn up and go through the motions as usual. It benefits from less moralising and more action, and is perfectly watchable - if entirely forgettable afterwards.", "created_at": "2022-11-10T13:51:39.078Z"}]