[{"movie_id": 64690, "review_id": "57c044f7c3a368733200086d", "author_rating": 6.0, "review_text": "The patient-man's _Transporter_.\r\n\r\nI've never been much of a Ryan Gosling fan (probably why it took me five years to get around to watching _Drive_). I am a fan of virtually every other cast member in the movie, but I didn't know any of them were in it before I started watching it. _Drive_ wasn't enough to bring me around on to the Ryan Gosling train, but I'll tell you who it definitely did put me on to: Director Nicolas Winding Refn.\r\n\r\nThe direction is truly king here in _Drive_. There are a couple of stylistic choices that didn't work for me, like the repetitive vocal-heavy montages, and I was not at all enamoured by Gosling's character (he seemed like kind of a dick). But overall I was impressed, and will definitely be on the look out for Refn's work in future.\r\n\r\nNot only did _Drive_ feature some grandly intense bursts of ultra-violence, it also gave me my first jump scare to make me actually jump in... God... Years. At least.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2016-08-26T13:32:39.736Z"}, {"movie_id": 64690, "review_id": "5c5bb116925141337cb95e9a", "author_rating": 10.0, "review_text": "Fate? Unknown... \r\n\r\nDrive is directed by Nicolas Winding Refn and adapted to screenplay by Hossein Amini from the novel of the same name written by James Sallis. It stars Ryan Gosling, Carey Mulligan, Bryan Cranston, Albert Brooks, Oscar Isaac, Christina Hendricks and Ron Perlman. Music is by Cliff Martinez and cinematography by Newton Thomas Sigel.\r\n\r\nDriver (Gosling) has a day job, he's a Hollywood stunt man, but by night he makes the serious cash as a getaway driver for the criminal fraternity. Into his life comes married next door neighbour Irene (Mulligan) and her little boy Benicio (Kaden Leos), pitching him right into the middle of two wars; one is for his emotional worth, the other with the criminal underworld.\r\n\r\nReal human being, and a real hero.\r\n\r\nThey cheered at Cannes, it has garnered instant cult classic status as well as gushing critical praise, Drive is arguably the biggest surprise of 2011. Some would debate that it arrived in a year that was dominated by blockbuster brain drains and pretentious parables, meaning it wouldn't take much for something like Drive to find a favourable audience. Yet Drive is a special movie, the surprise being that it delivers a different film to what the plot synopsis suggests. There would have been many disappointed that it didn't turn out to be something akin to The Fast & The Furious 19, but as its reputation grows, one likes to think that many also had their senses tingled unexpectedly by Refn's western done out in 1980s neo noir attire.\r\n\r\nYes, at first glance it looks like a simple story given over to style over substance leanings, where the fact that our laconic protagonist is not prone to dialogue expansion, could lend argumentative weight to those potential dissenters only skimming the surface of the picture. But the material is in excellent hands, with Refn, Sigel, Gosling and co, calmly unravelling Amini's stripped down screenplay to reveal a gritty urban fable that's laced with ethereal overtones. A picture where a look means more than any words can express, a subtle holding of hands reveals many layers peeling, and then the serene state of play often gets punctured by bouts of shocking violence, yet always it remains a picture big on intelligence, beating a mighty heart in the process.\r\n\r\nPropelling the picture forward is the complexity of Gosling's driver character. He has no back story for us to work from, and he gives nothing away outside of the tender bond formed with Irene and child. He is actually one of many purposeful grey areas (or should that be gris areas?) within the plot structure. We learn just enough to be on his side, a noble but flawed hero battling against fate as he fights for the innocent, he be Shane for a modern pot boiling Los Angeles. Helps, too, that he's so cool behind the wheel, where he mines Steve McQueen's effortless charisma. Refn delivers magic moments of car play, from the near ten minute opening getaway extended sequence, to a high speed kill or be killed pursuit, when the action flows it really pumps the adrenalin.\r\n\r\nGosling is amazing, instantly iconic, soft voice matching his soft blue eyes, toothpick perched between teeth, it's a testament to his acting ability that the requisite homages to iconic characters of movies past never veers into parody territory. It's with the calm moments that he triumphs most, be it watching TV with the boy Benicio or just gazing intensely into Irene's eyes, Gosling has a magnetic quality of some significance. Mulligan, too, is wonderful, deftly underplaying Irene to work off of Gosling to create heart aching tenderness, their chemistry superb. Isaac does fine work with the ex-con/husband character that is thankfully not stereotypical, Brooks is Colm Meaney like, thriving on simmering badness, while Cranston puts real heart into the role of Driver's garage boss, the closest thing the Driver has to a pal. The only one dimensional character lands in Perlman's court, but Perlman is such an ebullient and watchable life force the film survives the character's oafness.\r\n\r\nFrom the opening pink neon credits, accompanied by the synth plink of a retro 80s soundtrack (a soundtrack so memorable it lands in the ears and stays there for days), it's evident that Refn is a man who takes his style serious. Drive is full of classy (yes arty) passages, fluid camera movements, single takes, non central framing of characters, slow motion unfurls and eye dazzling chopper shots of a neon lighted L.A., the director has an eye for the quality required to cloak his story. He of course is aided considerably by his editor Matthew Newman, and Sigel's photography. The former is dealing in seamless precision, the latter a master of shades (a lift sequence is to, ahem, die for) and colour toning delights. Marking this out as a Blu-ray essential.\r\n\r\nYou can name about ten films that Drive has been either likened too or put forward as an influence, and Refn's work here has been touted as an offspring created by Michael Mann, Walter Hill, William Friedkin and Sergio Leone (all viable and all actually high praise indeed). But rest assured, Drive is still fresh and exciting, the perfect movie package. Refn's masterpiece and one of the best films of 2011. 10/10", "created_at": "2019-02-07T04:16:22.954Z"}, {"movie_id": 64690, "review_id": "5f3ff8ea47721500345a763c", "author_rating": 10.0, "review_text": "One of the best films ever made in my opinion. Nothing about this felt boring like people said. Just don't go in expecting an action movie. 10/10 Masterpiece.", "created_at": "2020-08-21T16:40:10.111Z"}, {"movie_id": 64690, "review_id": "637ea95ba3d02700ca071292", "author_rating": 6.0, "review_text": "**Ironically, a movie about getaway drivers and car chases was much too slow for me.**\r\n\r\nLots and lots of silent staring. Drive cuts most of its dialogue, creating a mysterious and captivating main character, but its slow pacing that drags despite some fantastic car chases and gore-filled moments of action drained most of the excitement. The lack of dialogue forces actors to give incredible performances with their eyes, body language, and demeanor which the cast nails with impressive skill. The atmosphere and aesthetic of the film are beautiful and unique, enhancing the cinematography and visuals. While the film has plenty of great ideas, solid performances, and gorgeous scenes, the pacing and style kept me checking my watch and getting up to grab snacks while the movie continued in the background. I’m going to assume that this is just a case of “not my kind of movie,” but in the end, not one I can recommend.", "created_at": "2022-11-23T23:14:35.873Z"}, {"movie_id": 64690, "review_id": "6463a88bdbbb420170aa73e3", "author_rating": 9.0, "review_text": "Drive is a cinematic triumph that delivers an unforgettable ride from beginning to end. While the storyline may seem simple at first, the film's attention to detail and intricacy of world-building truly sets it apart from the rest. Every character introduced has a connection to the crime world that is slowly pieced together, creating a puzzle that's both engaging and intriguing. This aspect of the film is truly captivating and highlights the excellent writing.\r\n\r\nWhat's more, the family elements of the movie really shine. Ryan Gosling delivers an outstanding performance as a protagonist forced to do bad things to survive. However, the connection he forms with the family across the hall is heartwarming, slowly evolving from a romantic interest to a bond of familiarity and care. In the meantime, Oscar Isaac also gives a remarkable performance as a character initially portrayed as off-putting and egotistical, but whose love for his family slowly emerges as the movie progresses. His character's desire to get out of the criminal life and make good on his past mistakes is admirable and heartbreaking.\r\n\r\nAs the story unfolds, the movie takes a dramatic turn, introducing graphic violence and jaw-dropping moments that are genuinely wild. It accelerates to full speed, never letting up, and keeps you on the edge of your seat until the very end. The movie's unique 80s aesthetic is also a standout, even though it takes place in modern times. It is visually impressive, especially when combined with the superb cinematography.\r\n\r\nOverall, Drive is a movie that gets so much right and turns a seemingly generic formula into a film that is truly special. Its superb storytelling, memorable characters, intense action, and unique style make it a must-watch for any cinephile.\r\n\r\nScore: 92% 🏅\r\nVerdict: Excellent", "created_at": "2023-05-16T16:00:11.219Z"}, {"movie_id": 64690, "review_id": "652c0b3e358da701406ccbe6", "author_rating": 6.0, "review_text": "If you take out the staring and slow motion scenes in the movie, you're left with an hour or less. I liked it in general, but it wasn't as good as it was hyped. It could have been shot at a much faster pace with a different director. Ryan Gosling may be like this, but he looks extremely tense throughout the whole movie. If we write down the dialogues he says in an hour and a half on a piece of paper, it wouldn't even be a page, there are no facial expressions either. That's how anyone can become an actor and act. There is nothing special about the movie except the music. I watched the movie years later just because I loved the intro music so much.", "created_at": "2023-10-15T15:54:38.974Z"}, {"movie_id": 64690, "review_id": "57c044f7c3a368733200086d", "author_rating": 6.0, "review_text": "The patient-man's _Transporter_.\r\n\r\nI've never been much of a Ryan Gosling fan (probably why it took me five years to get around to watching _Drive_). I am a fan of virtually every other cast member in the movie, but I didn't know any of them were in it before I started watching it. _Drive_ wasn't enough to bring me around on to the Ryan Gosling train, but I'll tell you who it definitely did put me on to: Director Nicolas Winding Refn.\r\n\r\nThe direction is truly king here in _Drive_. There are a couple of stylistic choices that didn't work for me, like the repetitive vocal-heavy montages, and I was not at all enamoured by Gosling's character (he seemed like kind of a dick). But overall I was impressed, and will definitely be on the look out for Refn's work in future.\r\n\r\nNot only did _Drive_ feature some grandly intense bursts of ultra-violence, it also gave me my first jump scare to make me actually jump in... God... Years. At least.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2016-08-26T13:32:39.736Z"}, {"movie_id": 64690, "review_id": "5c5bb116925141337cb95e9a", "author_rating": 10.0, "review_text": "Fate? Unknown... \r\n\r\nDrive is directed by Nicolas Winding Refn and adapted to screenplay by Hossein Amini from the novel of the same name written by James Sallis. It stars Ryan Gosling, Carey Mulligan, Bryan Cranston, Albert Brooks, Oscar Isaac, Christina Hendricks and Ron Perlman. Music is by Cliff Martinez and cinematography by Newton Thomas Sigel.\r\n\r\nDriver (Gosling) has a day job, he's a Hollywood stunt man, but by night he makes the serious cash as a getaway driver for the criminal fraternity. Into his life comes married next door neighbour Irene (Mulligan) and her little boy Benicio (Kaden Leos), pitching him right into the middle of two wars; one is for his emotional worth, the other with the criminal underworld.\r\n\r\nReal human being, and a real hero.\r\n\r\nThey cheered at Cannes, it has garnered instant cult classic status as well as gushing critical praise, Drive is arguably the biggest surprise of 2011. Some would debate that it arrived in a year that was dominated by blockbuster brain drains and pretentious parables, meaning it wouldn't take much for something like Drive to find a favourable audience. Yet Drive is a special movie, the surprise being that it delivers a different film to what the plot synopsis suggests. There would have been many disappointed that it didn't turn out to be something akin to The Fast & The Furious 19, but as its reputation grows, one likes to think that many also had their senses tingled unexpectedly by Refn's western done out in 1980s neo noir attire.\r\n\r\nYes, at first glance it looks like a simple story given over to style over substance leanings, where the fact that our laconic protagonist is not prone to dialogue expansion, could lend argumentative weight to those potential dissenters only skimming the surface of the picture. But the material is in excellent hands, with Refn, Sigel, Gosling and co, calmly unravelling Amini's stripped down screenplay to reveal a gritty urban fable that's laced with ethereal overtones. A picture where a look means more than any words can express, a subtle holding of hands reveals many layers peeling, and then the serene state of play often gets punctured by bouts of shocking violence, yet always it remains a picture big on intelligence, beating a mighty heart in the process.\r\n\r\nPropelling the picture forward is the complexity of Gosling's driver character. He has no back story for us to work from, and he gives nothing away outside of the tender bond formed with Irene and child. He is actually one of many purposeful grey areas (or should that be gris areas?) within the plot structure. We learn just enough to be on his side, a noble but flawed hero battling against fate as he fights for the innocent, he be Shane for a modern pot boiling Los Angeles. Helps, too, that he's so cool behind the wheel, where he mines Steve McQueen's effortless charisma. Refn delivers magic moments of car play, from the near ten minute opening getaway extended sequence, to a high speed kill or be killed pursuit, when the action flows it really pumps the adrenalin.\r\n\r\nGosling is amazing, instantly iconic, soft voice matching his soft blue eyes, toothpick perched between teeth, it's a testament to his acting ability that the requisite homages to iconic characters of movies past never veers into parody territory. It's with the calm moments that he triumphs most, be it watching TV with the boy Benicio or just gazing intensely into Irene's eyes, Gosling has a magnetic quality of some significance. Mulligan, too, is wonderful, deftly underplaying Irene to work off of Gosling to create heart aching tenderness, their chemistry superb. Isaac does fine work with the ex-con/husband character that is thankfully not stereotypical, Brooks is Colm Meaney like, thriving on simmering badness, while Cranston puts real heart into the role of Driver's garage boss, the closest thing the Driver has to a pal. The only one dimensional character lands in Perlman's court, but Perlman is such an ebullient and watchable life force the film survives the character's oafness.\r\n\r\nFrom the opening pink neon credits, accompanied by the synth plink of a retro 80s soundtrack (a soundtrack so memorable it lands in the ears and stays there for days), it's evident that Refn is a man who takes his style serious. Drive is full of classy (yes arty) passages, fluid camera movements, single takes, non central framing of characters, slow motion unfurls and eye dazzling chopper shots of a neon lighted L.A., the director has an eye for the quality required to cloak his story. He of course is aided considerably by his editor Matthew Newman, and Sigel's photography. The former is dealing in seamless precision, the latter a master of shades (a lift sequence is to, ahem, die for) and colour toning delights. Marking this out as a Blu-ray essential.\r\n\r\nYou can name about ten films that Drive has been either likened too or put forward as an influence, and Refn's work here has been touted as an offspring created by Michael Mann, Walter Hill, William Friedkin and Sergio Leone (all viable and all actually high praise indeed). But rest assured, Drive is still fresh and exciting, the perfect movie package. Refn's masterpiece and one of the best films of 2011. 10/10", "created_at": "2019-02-07T04:16:22.954Z"}, {"movie_id": 64690, "review_id": "5f3ff8ea47721500345a763c", "author_rating": 10.0, "review_text": "One of the best films ever made in my opinion. Nothing about this felt boring like people said. Just don't go in expecting an action movie. 10/10 Masterpiece.", "created_at": "2020-08-21T16:40:10.111Z"}, {"movie_id": 64690, "review_id": "637ea95ba3d02700ca071292", "author_rating": 6.0, "review_text": "**Ironically, a movie about getaway drivers and car chases was much too slow for me.**\r\n\r\nLots and lots of silent staring. Drive cuts most of its dialogue, creating a mysterious and captivating main character, but its slow pacing that drags despite some fantastic car chases and gore-filled moments of action drained most of the excitement. The lack of dialogue forces actors to give incredible performances with their eyes, body language, and demeanor which the cast nails with impressive skill. The atmosphere and aesthetic of the film are beautiful and unique, enhancing the cinematography and visuals. While the film has plenty of great ideas, solid performances, and gorgeous scenes, the pacing and style kept me checking my watch and getting up to grab snacks while the movie continued in the background. I’m going to assume that this is just a case of “not my kind of movie,” but in the end, not one I can recommend.", "created_at": "2022-11-23T23:14:35.873Z"}, {"movie_id": 64690, "review_id": "6463a88bdbbb420170aa73e3", "author_rating": 9.0, "review_text": "Drive is a cinematic triumph that delivers an unforgettable ride from beginning to end. While the storyline may seem simple at first, the film's attention to detail and intricacy of world-building truly sets it apart from the rest. Every character introduced has a connection to the crime world that is slowly pieced together, creating a puzzle that's both engaging and intriguing. This aspect of the film is truly captivating and highlights the excellent writing.\r\n\r\nWhat's more, the family elements of the movie really shine. Ryan Gosling delivers an outstanding performance as a protagonist forced to do bad things to survive. However, the connection he forms with the family across the hall is heartwarming, slowly evolving from a romantic interest to a bond of familiarity and care. In the meantime, Oscar Isaac also gives a remarkable performance as a character initially portrayed as off-putting and egotistical, but whose love for his family slowly emerges as the movie progresses. His character's desire to get out of the criminal life and make good on his past mistakes is admirable and heartbreaking.\r\n\r\nAs the story unfolds, the movie takes a dramatic turn, introducing graphic violence and jaw-dropping moments that are genuinely wild. It accelerates to full speed, never letting up, and keeps you on the edge of your seat until the very end. The movie's unique 80s aesthetic is also a standout, even though it takes place in modern times. It is visually impressive, especially when combined with the superb cinematography.\r\n\r\nOverall, Drive is a movie that gets so much right and turns a seemingly generic formula into a film that is truly special. Its superb storytelling, memorable characters, intense action, and unique style make it a must-watch for any cinephile.\r\n\r\nScore: 92% 🏅\r\nVerdict: Excellent", "created_at": "2023-05-16T16:00:11.219Z"}, {"movie_id": 64690, "review_id": "652c0b3e358da701406ccbe6", "author_rating": 6.0, "review_text": "If you take out the staring and slow motion scenes in the movie, you're left with an hour or less. I liked it in general, but it wasn't as good as it was hyped. It could have been shot at a much faster pace with a different director. Ryan Gosling may be like this, but he looks extremely tense throughout the whole movie. If we write down the dialogues he says in an hour and a half on a piece of paper, it wouldn't even be a page, there are no facial expressions either. That's how anyone can become an actor and act. There is nothing special about the movie except the music. I watched the movie years later just because I loved the intro music so much.", "created_at": "2023-10-15T15:54:38.974Z"}, {"movie_id": 64690, "review_id": "57c044f7c3a368733200086d", "author_rating": 6.0, "review_text": "The patient-man's _Transporter_.\r\n\r\nI've never been much of a Ryan Gosling fan (probably why it took me five years to get around to watching _Drive_). I am a fan of virtually every other cast member in the movie, but I didn't know any of them were in it before I started watching it. _Drive_ wasn't enough to bring me around on to the Ryan Gosling train, but I'll tell you who it definitely did put me on to: Director Nicolas Winding Refn.\r\n\r\nThe direction is truly king here in _Drive_. There are a couple of stylistic choices that didn't work for me, like the repetitive vocal-heavy montages, and I was not at all enamoured by Gosling's character (he seemed like kind of a dick). But overall I was impressed, and will definitely be on the look out for Refn's work in future.\r\n\r\nNot only did _Drive_ feature some grandly intense bursts of ultra-violence, it also gave me my first jump scare to make me actually jump in... God... Years. At least.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2016-08-26T13:32:39.736Z"}, {"movie_id": 64690, "review_id": "5c5bb116925141337cb95e9a", "author_rating": 10.0, "review_text": "Fate? Unknown... \r\n\r\nDrive is directed by Nicolas Winding Refn and adapted to screenplay by Hossein Amini from the novel of the same name written by James Sallis. It stars Ryan Gosling, Carey Mulligan, Bryan Cranston, Albert Brooks, Oscar Isaac, Christina Hendricks and Ron Perlman. Music is by Cliff Martinez and cinematography by Newton Thomas Sigel.\r\n\r\nDriver (Gosling) has a day job, he's a Hollywood stunt man, but by night he makes the serious cash as a getaway driver for the criminal fraternity. Into his life comes married next door neighbour Irene (Mulligan) and her little boy Benicio (Kaden Leos), pitching him right into the middle of two wars; one is for his emotional worth, the other with the criminal underworld.\r\n\r\nReal human being, and a real hero.\r\n\r\nThey cheered at Cannes, it has garnered instant cult classic status as well as gushing critical praise, Drive is arguably the biggest surprise of 2011. Some would debate that it arrived in a year that was dominated by blockbuster brain drains and pretentious parables, meaning it wouldn't take much for something like Drive to find a favourable audience. Yet Drive is a special movie, the surprise being that it delivers a different film to what the plot synopsis suggests. There would have been many disappointed that it didn't turn out to be something akin to The Fast & The Furious 19, but as its reputation grows, one likes to think that many also had their senses tingled unexpectedly by Refn's western done out in 1980s neo noir attire.\r\n\r\nYes, at first glance it looks like a simple story given over to style over substance leanings, where the fact that our laconic protagonist is not prone to dialogue expansion, could lend argumentative weight to those potential dissenters only skimming the surface of the picture. But the material is in excellent hands, with Refn, Sigel, Gosling and co, calmly unravelling Amini's stripped down screenplay to reveal a gritty urban fable that's laced with ethereal overtones. A picture where a look means more than any words can express, a subtle holding of hands reveals many layers peeling, and then the serene state of play often gets punctured by bouts of shocking violence, yet always it remains a picture big on intelligence, beating a mighty heart in the process.\r\n\r\nPropelling the picture forward is the complexity of Gosling's driver character. He has no back story for us to work from, and he gives nothing away outside of the tender bond formed with Irene and child. He is actually one of many purposeful grey areas (or should that be gris areas?) within the plot structure. We learn just enough to be on his side, a noble but flawed hero battling against fate as he fights for the innocent, he be Shane for a modern pot boiling Los Angeles. Helps, too, that he's so cool behind the wheel, where he mines Steve McQueen's effortless charisma. Refn delivers magic moments of car play, from the near ten minute opening getaway extended sequence, to a high speed kill or be killed pursuit, when the action flows it really pumps the adrenalin.\r\n\r\nGosling is amazing, instantly iconic, soft voice matching his soft blue eyes, toothpick perched between teeth, it's a testament to his acting ability that the requisite homages to iconic characters of movies past never veers into parody territory. It's with the calm moments that he triumphs most, be it watching TV with the boy Benicio or just gazing intensely into Irene's eyes, Gosling has a magnetic quality of some significance. Mulligan, too, is wonderful, deftly underplaying Irene to work off of Gosling to create heart aching tenderness, their chemistry superb. Isaac does fine work with the ex-con/husband character that is thankfully not stereotypical, Brooks is Colm Meaney like, thriving on simmering badness, while Cranston puts real heart into the role of Driver's garage boss, the closest thing the Driver has to a pal. The only one dimensional character lands in Perlman's court, but Perlman is such an ebullient and watchable life force the film survives the character's oafness.\r\n\r\nFrom the opening pink neon credits, accompanied by the synth plink of a retro 80s soundtrack (a soundtrack so memorable it lands in the ears and stays there for days), it's evident that Refn is a man who takes his style serious. Drive is full of classy (yes arty) passages, fluid camera movements, single takes, non central framing of characters, slow motion unfurls and eye dazzling chopper shots of a neon lighted L.A., the director has an eye for the quality required to cloak his story. He of course is aided considerably by his editor Matthew Newman, and Sigel's photography. The former is dealing in seamless precision, the latter a master of shades (a lift sequence is to, ahem, die for) and colour toning delights. Marking this out as a Blu-ray essential.\r\n\r\nYou can name about ten films that Drive has been either likened too or put forward as an influence, and Refn's work here has been touted as an offspring created by Michael Mann, Walter Hill, William Friedkin and Sergio Leone (all viable and all actually high praise indeed). But rest assured, Drive is still fresh and exciting, the perfect movie package. Refn's masterpiece and one of the best films of 2011. 10/10", "created_at": "2019-02-07T04:16:22.954Z"}, {"movie_id": 64690, "review_id": "5f3ff8ea47721500345a763c", "author_rating": 10.0, "review_text": "One of the best films ever made in my opinion. Nothing about this felt boring like people said. Just don't go in expecting an action movie. 10/10 Masterpiece.", "created_at": "2020-08-21T16:40:10.111Z"}, {"movie_id": 64690, "review_id": "637ea95ba3d02700ca071292", "author_rating": 6.0, "review_text": "**Ironically, a movie about getaway drivers and car chases was much too slow for me.**\r\n\r\nLots and lots of silent staring. Drive cuts most of its dialogue, creating a mysterious and captivating main character, but its slow pacing that drags despite some fantastic car chases and gore-filled moments of action drained most of the excitement. The lack of dialogue forces actors to give incredible performances with their eyes, body language, and demeanor which the cast nails with impressive skill. The atmosphere and aesthetic of the film are beautiful and unique, enhancing the cinematography and visuals. While the film has plenty of great ideas, solid performances, and gorgeous scenes, the pacing and style kept me checking my watch and getting up to grab snacks while the movie continued in the background. I’m going to assume that this is just a case of “not my kind of movie,” but in the end, not one I can recommend.", "created_at": "2022-11-23T23:14:35.873Z"}, {"movie_id": 64690, "review_id": "6463a88bdbbb420170aa73e3", "author_rating": 9.0, "review_text": "Drive is a cinematic triumph that delivers an unforgettable ride from beginning to end. While the storyline may seem simple at first, the film's attention to detail and intricacy of world-building truly sets it apart from the rest. Every character introduced has a connection to the crime world that is slowly pieced together, creating a puzzle that's both engaging and intriguing. This aspect of the film is truly captivating and highlights the excellent writing.\r\n\r\nWhat's more, the family elements of the movie really shine. Ryan Gosling delivers an outstanding performance as a protagonist forced to do bad things to survive. However, the connection he forms with the family across the hall is heartwarming, slowly evolving from a romantic interest to a bond of familiarity and care. In the meantime, Oscar Isaac also gives a remarkable performance as a character initially portrayed as off-putting and egotistical, but whose love for his family slowly emerges as the movie progresses. His character's desire to get out of the criminal life and make good on his past mistakes is admirable and heartbreaking.\r\n\r\nAs the story unfolds, the movie takes a dramatic turn, introducing graphic violence and jaw-dropping moments that are genuinely wild. It accelerates to full speed, never letting up, and keeps you on the edge of your seat until the very end. The movie's unique 80s aesthetic is also a standout, even though it takes place in modern times. It is visually impressive, especially when combined with the superb cinematography.\r\n\r\nOverall, Drive is a movie that gets so much right and turns a seemingly generic formula into a film that is truly special. Its superb storytelling, memorable characters, intense action, and unique style make it a must-watch for any cinephile.\r\n\r\nScore: 92% 🏅\r\nVerdict: Excellent", "created_at": "2023-05-16T16:00:11.219Z"}, {"movie_id": 64690, "review_id": "652c0b3e358da701406ccbe6", "author_rating": 6.0, "review_text": "If you take out the staring and slow motion scenes in the movie, you're left with an hour or less. I liked it in general, but it wasn't as good as it was hyped. It could have been shot at a much faster pace with a different director. Ryan Gosling may be like this, but he looks extremely tense throughout the whole movie. If we write down the dialogues he says in an hour and a half on a piece of paper, it wouldn't even be a page, there are no facial expressions either. That's how anyone can become an actor and act. There is nothing special about the movie except the music. I watched the movie years later just because I loved the intro music so much.", "created_at": "2023-10-15T15:54:38.974Z"}, {"movie_id": 64690, "review_id": "57c044f7c3a368733200086d", "author_rating": 6.0, "review_text": "The patient-man's _Transporter_.\r\n\r\nI've never been much of a Ryan Gosling fan (probably why it took me five years to get around to watching _Drive_). I am a fan of virtually every other cast member in the movie, but I didn't know any of them were in it before I started watching it. _Drive_ wasn't enough to bring me around on to the Ryan Gosling train, but I'll tell you who it definitely did put me on to: Director Nicolas Winding Refn.\r\n\r\nThe direction is truly king here in _Drive_. There are a couple of stylistic choices that didn't work for me, like the repetitive vocal-heavy montages, and I was not at all enamoured by Gosling's character (he seemed like kind of a dick). But overall I was impressed, and will definitely be on the look out for Refn's work in future.\r\n\r\nNot only did _Drive_ feature some grandly intense bursts of ultra-violence, it also gave me my first jump scare to make me actually jump in... God... Years. At least.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2016-08-26T13:32:39.736Z"}, {"movie_id": 64690, "review_id": "5c5bb116925141337cb95e9a", "author_rating": 10.0, "review_text": "Fate? Unknown... \r\n\r\nDrive is directed by Nicolas Winding Refn and adapted to screenplay by Hossein Amini from the novel of the same name written by James Sallis. It stars Ryan Gosling, Carey Mulligan, Bryan Cranston, Albert Brooks, Oscar Isaac, Christina Hendricks and Ron Perlman. Music is by Cliff Martinez and cinematography by Newton Thomas Sigel.\r\n\r\nDriver (Gosling) has a day job, he's a Hollywood stunt man, but by night he makes the serious cash as a getaway driver for the criminal fraternity. Into his life comes married next door neighbour Irene (Mulligan) and her little boy Benicio (Kaden Leos), pitching him right into the middle of two wars; one is for his emotional worth, the other with the criminal underworld.\r\n\r\nReal human being, and a real hero.\r\n\r\nThey cheered at Cannes, it has garnered instant cult classic status as well as gushing critical praise, Drive is arguably the biggest surprise of 2011. Some would debate that it arrived in a year that was dominated by blockbuster brain drains and pretentious parables, meaning it wouldn't take much for something like Drive to find a favourable audience. Yet Drive is a special movie, the surprise being that it delivers a different film to what the plot synopsis suggests. There would have been many disappointed that it didn't turn out to be something akin to The Fast & The Furious 19, but as its reputation grows, one likes to think that many also had their senses tingled unexpectedly by Refn's western done out in 1980s neo noir attire.\r\n\r\nYes, at first glance it looks like a simple story given over to style over substance leanings, where the fact that our laconic protagonist is not prone to dialogue expansion, could lend argumentative weight to those potential dissenters only skimming the surface of the picture. But the material is in excellent hands, with Refn, Sigel, Gosling and co, calmly unravelling Amini's stripped down screenplay to reveal a gritty urban fable that's laced with ethereal overtones. A picture where a look means more than any words can express, a subtle holding of hands reveals many layers peeling, and then the serene state of play often gets punctured by bouts of shocking violence, yet always it remains a picture big on intelligence, beating a mighty heart in the process.\r\n\r\nPropelling the picture forward is the complexity of Gosling's driver character. He has no back story for us to work from, and he gives nothing away outside of the tender bond formed with Irene and child. He is actually one of many purposeful grey areas (or should that be gris areas?) within the plot structure. We learn just enough to be on his side, a noble but flawed hero battling against fate as he fights for the innocent, he be Shane for a modern pot boiling Los Angeles. Helps, too, that he's so cool behind the wheel, where he mines Steve McQueen's effortless charisma. Refn delivers magic moments of car play, from the near ten minute opening getaway extended sequence, to a high speed kill or be killed pursuit, when the action flows it really pumps the adrenalin.\r\n\r\nGosling is amazing, instantly iconic, soft voice matching his soft blue eyes, toothpick perched between teeth, it's a testament to his acting ability that the requisite homages to iconic characters of movies past never veers into parody territory. It's with the calm moments that he triumphs most, be it watching TV with the boy Benicio or just gazing intensely into Irene's eyes, Gosling has a magnetic quality of some significance. Mulligan, too, is wonderful, deftly underplaying Irene to work off of Gosling to create heart aching tenderness, their chemistry superb. Isaac does fine work with the ex-con/husband character that is thankfully not stereotypical, Brooks is Colm Meaney like, thriving on simmering badness, while Cranston puts real heart into the role of Driver's garage boss, the closest thing the Driver has to a pal. The only one dimensional character lands in Perlman's court, but Perlman is such an ebullient and watchable life force the film survives the character's oafness.\r\n\r\nFrom the opening pink neon credits, accompanied by the synth plink of a retro 80s soundtrack (a soundtrack so memorable it lands in the ears and stays there for days), it's evident that Refn is a man who takes his style serious. Drive is full of classy (yes arty) passages, fluid camera movements, single takes, non central framing of characters, slow motion unfurls and eye dazzling chopper shots of a neon lighted L.A., the director has an eye for the quality required to cloak his story. He of course is aided considerably by his editor Matthew Newman, and Sigel's photography. The former is dealing in seamless precision, the latter a master of shades (a lift sequence is to, ahem, die for) and colour toning delights. Marking this out as a Blu-ray essential.\r\n\r\nYou can name about ten films that Drive has been either likened too or put forward as an influence, and Refn's work here has been touted as an offspring created by Michael Mann, Walter Hill, William Friedkin and Sergio Leone (all viable and all actually high praise indeed). But rest assured, Drive is still fresh and exciting, the perfect movie package. Refn's masterpiece and one of the best films of 2011. 10/10", "created_at": "2019-02-07T04:16:22.954Z"}, {"movie_id": 64690, "review_id": "5f3ff8ea47721500345a763c", "author_rating": 10.0, "review_text": "One of the best films ever made in my opinion. Nothing about this felt boring like people said. Just don't go in expecting an action movie. 10/10 Masterpiece.", "created_at": "2020-08-21T16:40:10.111Z"}, {"movie_id": 64690, "review_id": "637ea95ba3d02700ca071292", "author_rating": 6.0, "review_text": "**Ironically, a movie about getaway drivers and car chases was much too slow for me.**\r\n\r\nLots and lots of silent staring. Drive cuts most of its dialogue, creating a mysterious and captivating main character, but its slow pacing that drags despite some fantastic car chases and gore-filled moments of action drained most of the excitement. The lack of dialogue forces actors to give incredible performances with their eyes, body language, and demeanor which the cast nails with impressive skill. The atmosphere and aesthetic of the film are beautiful and unique, enhancing the cinematography and visuals. While the film has plenty of great ideas, solid performances, and gorgeous scenes, the pacing and style kept me checking my watch and getting up to grab snacks while the movie continued in the background. I’m going to assume that this is just a case of “not my kind of movie,” but in the end, not one I can recommend.", "created_at": "2022-11-23T23:14:35.873Z"}, {"movie_id": 64690, "review_id": "6463a88bdbbb420170aa73e3", "author_rating": 9.0, "review_text": "Drive is a cinematic triumph that delivers an unforgettable ride from beginning to end. While the storyline may seem simple at first, the film's attention to detail and intricacy of world-building truly sets it apart from the rest. Every character introduced has a connection to the crime world that is slowly pieced together, creating a puzzle that's both engaging and intriguing. This aspect of the film is truly captivating and highlights the excellent writing.\r\n\r\nWhat's more, the family elements of the movie really shine. Ryan Gosling delivers an outstanding performance as a protagonist forced to do bad things to survive. However, the connection he forms with the family across the hall is heartwarming, slowly evolving from a romantic interest to a bond of familiarity and care. In the meantime, Oscar Isaac also gives a remarkable performance as a character initially portrayed as off-putting and egotistical, but whose love for his family slowly emerges as the movie progresses. His character's desire to get out of the criminal life and make good on his past mistakes is admirable and heartbreaking.\r\n\r\nAs the story unfolds, the movie takes a dramatic turn, introducing graphic violence and jaw-dropping moments that are genuinely wild. It accelerates to full speed, never letting up, and keeps you on the edge of your seat until the very end. The movie's unique 80s aesthetic is also a standout, even though it takes place in modern times. It is visually impressive, especially when combined with the superb cinematography.\r\n\r\nOverall, Drive is a movie that gets so much right and turns a seemingly generic formula into a film that is truly special. Its superb storytelling, memorable characters, intense action, and unique style make it a must-watch for any cinephile.\r\n\r\nScore: 92% 🏅\r\nVerdict: Excellent", "created_at": "2023-05-16T16:00:11.219Z"}, {"movie_id": 64690, "review_id": "652c0b3e358da701406ccbe6", "author_rating": 6.0, "review_text": "If you take out the staring and slow motion scenes in the movie, you're left with an hour or less. I liked it in general, but it wasn't as good as it was hyped. It could have been shot at a much faster pace with a different director. Ryan Gosling may be like this, but he looks extremely tense throughout the whole movie. If we write down the dialogues he says in an hour and a half on a piece of paper, it wouldn't even be a page, there are no facial expressions either. That's how anyone can become an actor and act. There is nothing special about the movie except the music. I watched the movie years later just because I loved the intro music so much.", "created_at": "2023-10-15T15:54:38.974Z"}]