[{"movie_id": 9532, "review_id": "55acc12cc3a3682ff40098c3", "author_rating": 9.0, "review_text": "I'll see you soon!\r\n\r\nBefore taking off for Paris, Alex Browning has a vision that the plane is going to explode. Pannicking he gets off the plane and in the mêlée a teacher and a group of his class mates are forced off the flight, the plane goes on to explode in mid air, killing everyone on board. But pretty soon after the disaster strange accidents start to befall those who got off the plane, it seems that death is out to get them.\r\n\r\nWith the number of hugely disappointing teens in peril movies that were made post the success of Wes Craven's hugely successful Scream, it's refreshing to find one that was, well, refreshing. Not purporting to be anything other than a wickedly entertaining piece of horror based nonsense, Final Destination is inventive, funny and above all else, shock laden.\r\n\r\nFrom the opening, and terrifying air crash sequence to the clever and gross way that our protagonists shake hands with the grim reaper, this film is gloriously proud of its horror intent. One peak at the surnames of the characters will tell you just how into their horror roots the makers are here, whilst not a homage movie as such, James Wong and his team clearly know what makes a modern horror picture work.\r\n\r\nIf you find yourself complaining about the writing then you clearly are missing the point of Final Destination's existence, either that or you are in fact dead yourself! Four fun but vastly inferior sequels would follow, but really this is the one to watch, as good a 100 minutes of horror fun as you could wish to have. I dare you not to jump out your seat at least once! 9/10", "created_at": "2015-07-20T09:36:44.334Z"}, {"movie_id": 9532, "review_id": "5bd89132c3a368213d00e4e6", "author_rating": 6.0, "review_text": "***Innovative premise for a 'Dead Teenager Movie,' but the last act isn’t compelling***  \r\n\r\nThis first \"Final Destination\" movie from 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, the Grim Reaper. A group of people escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying those who cheated Death in various creative ways. The opening tragedy in this case is a plane crash; in the second film it's a horrible highway pile-up; in the third it's a roller-coaster mishap and so on.\r\n\r\nI've seen (and own) the first four of the currently five-film franchise, but they all tell the same basic story with different characters and a different location and are all of the same high quality of technical filmmaking. Whether you prefer one or another depends on whether you like the cast and the death sequences (and the locations) because, other than these factors, they're all basically the same.\r\n\r\nThis first one has a quality heroine or 'final girl' in Ali Larter. Amanda Detmer is also on hand as a fellow student while Kristen Cloke plays a freaked-out teacher. They coulda done better showcasing these women IMHO. On the opposite side of the gender spectrum there’s Devon Sawa, Kerr Smith, Seann William Scott and Chad Donella. Their importance to the story is in that order. Meanwhile Tony Todd makes his first of four appearances in the series as a mortician who curiously knows more than he should.\r\n\r\nFor me, what makes these movies kinda dull is the fact that it's impossible to cheat Death. Sure, you can escape it here or there, but Death's been in business for millennia and expertly knows what he's doing. As such, everyone's gonna die except maybe the 'final girl,' who will most certainly die in the sequel.\r\n\r\nThe script began as an X-Files teleplay and, indeed, the movie was made by two veterans of that series. And you can tell due to the basic feel of the movie and the inclusion of two government agents. I’d give “Final Destination” a higher grade because I love the concept, but this one curiously gets dull in the final act (despite all the ‘exciting’ things going on) and they coulda done more with the women.\r\n\r\nThe film runs 1 hour, 37 minutes and was shot in the Vancouver, British Columbia, area (although the events take place around New York City).\r\n\r\nGRADE: B-", "created_at": "2018-10-30T17:13:22.184Z"}, {"movie_id": 9532, "review_id": "64630bb3e3fa2f00e40486c6", "author_rating": 10.0, "review_text": "Love this movie. A person has visions of a disaster or people dieing. All his visions come true. This one is my favorite out of the series.", "created_at": "2023-05-16T04:50:59.769Z"}]