[{"movie_id": 535581, "review_id": "5d03ac3d0e0a26134acbd943", "author_rating": 8.0, "review_text": "‘The Dead Don’t Die’ is a luxuriously paced, wittily gory zombie comedy. It’s part social commentary, part homage to cinema, and all ridiculous. With yet another pleasing genre film on offer from Jim Jarmusch, you’d be dead right to want to check it out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-dead-dont-die-a-zombie-comedy-thats-anything-but-grave\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-14T14:16:29.182Z"}, {"movie_id": 535581, "review_id": "5d89529d79b3d4001782e01d", "author_rating": 7.0, "review_text": "_**Very funny, but very peculiar (and somewhat preachy)**_\r\n\r\n>_I don't like making statement films. I just don't feel comfortable with that. I like to weave certain themes and different layers into films. This one's a little more blatant in certain ways, but we have a bigger problem, which is the sixth mass extinction that we are currently in. I am appalled by people's denial of these things. You can run from things, you can hide facts, you can hide science, but you can't change it by hiding it. And we're in a very severe state right now and this is not a political issue. This is an issue of_ _survival of species. This is a real concern. I'm not an activist. I'm not in the middle of Pennsylvania, digging a sea wall or whatever we should be doing. I'm making a silly film with my friends. But I am very concerned. I'm saddened and disappointed by human behaviour._\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch's New Comedy _The Dead Don't Die_ was Inspired by his Serious Fears for Humanity\" (Brandon Katz); _Observer_ (June 12, 2019)\r\n\r\n>_I think of the film as a comedy, very much so. It's not agitprop. It definitely has a sociopolitical thread in it, which is reflective and therefore dark. But hey, everyone, wake up! We're in the sixth mass extinction on this planet. To not have that darkness would have been a little superficial. There is a sadness in human behaviour for me, and zombies are the most obvious metaphor you could employ. We were also trying to make a kind of extension or homage to George Romero because of his postmodern reinvention of zombies, and those sociopolitical threads are evident in his films. Romero does a lot of fascinating things. The zombies are monsters, but they're not Godzilla. They don't come from outside the social order. They come from within a collapsing social order. They're us, or any of us who have died, so they are also victims because they don't choose to be undead. It's because of some stupid shit humans did that caused them to become undead. The problems of mass consumerism, the things that are woven into Romero's films, have only gotten worse. They haven't changed. We're at a crisis because of what his films were warning. And now we're at the endgame of that. What is more terrifying than having 1 million species going extinct in the last decade?_\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch Believes in the Teens, But Not Joe Biden\" (Bilge Ebiri); _Vulture_ (June 17, 2019)\r\n\r\n_The Dead Don't Die_ is such an unexpected film that when the trailer first dropped, a lot of people assumed it to be a joke of some kind; that the film purportedly being advertised couldn't possibly be real. And there's a good reason for that, as who could have predicted that celebrated indie writer/director Jim Jarmusch would have any interest in making an ensemble zombie comedy? Well, the thing about that is that, as it turns out, he doesn't. Jarmusch has certainly made genre films in the past – _Down By Law_ (1986) is a prison break film, _Dead Man_ (1995) is a western, _Ghost Dog: Way of the Samurai_ (1999) is a samurai film, _The Limits of Control_ (2009) is the story of an assassin, _Only Lovers Left Alive _(2013) is about vampires. Usually, he is exceptionally successful at grafting his worldview onto the generic tropes, often to such an extent that it can be difficult to separate the two – these films are undeniably genre pieces, but so too are they undeniably Jim Jarmusch films. With _The Dead Don't Die_, however, he's not quite as successful; this is very much a Jarmusch film before it's a zombie movie, with these two components often rubbing awkwardly up against one another.\r\n\r\nUnexpectedly chosen as the opening film at Cannes 2019, the film has met with mixed responses from both critics and audiences, and it's not hard to see why – glib socio-political commentary is introduced without really going anywhere; heavily promoted performers have nothing more than one or two-scene cameos; some of the characters know they're in a movie, even referring to Jarmusch himself, whilst others do not; a lot of the humour is of the flippant self-congratulatory kind; things become very preachy towards the end as Jarmusch abandons all semblance of narrative progression and shifts gears into a pseudo-TED talk. However, for all that, I enjoyed it. A zombie apocalypse movie set very much in Trump's America, it embraces all the weirdness that such a scenario suggests; the awkward humour works well for the most part, the meta elements are intriguing but not too distracting, and as for the didacticism? Well, nothing that Jarmusch says is incorrect; we _are_ a culture ruled by materialism and we _are_ sticking our collective heads in the sand regarding the fact that we're destroying the only home we have. So it might be inelegant (and Jarmusch has never been a satirist of Swiftian pedigree), but it's not wrong.\r\n\r\nSet in the fictional town of Centerville (pop. 738), the film begins as Chief Cliff Robertson (Bill Murray) and Officer Ronnie Peterson (Adam Driver) are following up a complaint from farmer Frank Miller (Steve Buscemi), who claims that a local vagrant, Hermit Bob (Tom Waits), has stolen one of his chickens. Issuing Bob with a warning, the duo are returning to the station when they realise that despite it being 8pm, the sun is still shining brightly, also noticing that their watches have stopped and they can't get any signal on their phones. Meanwhile, at the local diner, Frank and hardware store owner Hank Thompson (Danny Glover) watch a news report about recent \"polar fracking\", which some believe has knocked the earth off its axis. Returning to the police station, Cliff and Ronnie discuss the situation with Officer Mindy Morrison (Chloë Sevigny), also talking about the town's strange new undertaker, Zelda Winston (Tilda Swinton), a white-haired Scottish woman with a collection of samurai swords and a statue of Buddha. Ronnie and Mindy head home for the night, leaving Cliff with the body of Mallory O'Brien (Carol Kane), a local drunk who recently died. As the sun finally sets on Centerville, however, two zombies (Sara Driver and Iggy Pop) rise from the dead and set out in pursuit of the one thing all zombies crave...eh, coffee. \r\n\r\nVery much an ensemble piece, aside from the above characters, we're also introduced to a litany of additional Centerville residents - diner waitress Fern (Eszter Balint); detainees at a juvenile detention facility Stella (Maya Delmont), Olivia (Taliyah Whitaker), and Geronimo (Jahi Di'Allo Winston); gas station owner Bobby Wiggins (Caleb Landry Jones); delivery man Dean (RZA); motel owner Danny Perkins (Larry Fessenden); journalist Posie Juarez (Rosie Perez); cleaner Lily (Rosal Colon); and out-of-towners Zoe (Selena Gomez), Jack (Austin Butler) and Zack (Luka Sabbat).\r\n\r\nIf _The Dead Don't Die_ has a salient theme, it's apathy, suggesting that humanity is sleepwalking its way towards its own extinction. The zombie apocalypse is depicted as initially slow and distant, not something about which to be overly concerned, until, without us realising how it has happened, there's no escape or chance of salvation. In this sense, Jarmusch uses zombies as double signifiers – they not only represent the apocalypse towards which we are moving, they also represent us, indifferently shuffling our way to an oblivion we know is coming, but which we choose to ignore (at one point, Cliff literally falls into an open grave because he isn't looking where he's going). Targeting rampant materialism, capitalist greed, and moral idiocy in elected officials, the film does provide a narrative explanation for why the dead are rising from the grave (the oft-discussed polar fracking), but really, Jarmusch isn't as interested in the \"why\" as he is in the \"how\", castigating a moribund and materialist society which has become blind to everything but trivial consumerist gratification.\r\n\r\nIn short, Jarmusch is suggesting that as a society, we've become zombified; lazy, instinctual, addicted to things that don't matter (whilst the first zombies we meet want coffee, others are on the hunt for WiFi, Siri, Chardonnay, Xanax, and \"Fashion\"). Indeed, in this sense, one of the film's more subtle (and interesting) points is that the best way to remain outside such societal calcification is to avoid conformism and remain on the edges of the social contract – the characters who do best against the zombies are the socially ostracised Zelda, the three kids in the detention centre, and the philosophical Hermit Bob, who suggests that \"_hunger for more stuff_\" has become society's primary motivator. Indeed, the way most of the characters react to the zombies is itself part of the critique – the vast majority respond in a blasé manner, suggesting that in these insane times, when so many people are falling all over themselves to normalise the rantings of the racist, misogynistic, incoherent manchild in the Oval Office, even something like the dead rising from the ground is no big deal.\r\n\r\nOf course, using zombies as vehicles for social satire isn't exactly new; George A. Romero did it as far back as _Night of the Living Dead_ (1968), which is more about endemic racism than zombies. He did it to even greater effect in _Dawn of the Dead_ (1978), where he targeted materialistic vapidity. Later, he looked at issues such as Reagan-era militarism in _Day of the Dead_ (1985), economic disparity in _Land of the Dead_ (2005), media impartiality in _Diary of the Dead_ (2007), and tribalism in _Survival of the Dead_ (2009). In this tradition, _The Dead Don't Die_ has its eye very much on the climate change-denying administration in Washington; Frank is introduced wearing a MAGA-style baseball cap with a \"Keep America White Again\" logo, whilst his dog is called Rumsfeld. Indeed, Centerville itself is very much a quintessential Heartland town, the kind where Trump so successfully mobilised his blue collar base. And whilst it remains a comedy, much of what _The Dead Don't Die_ says is deadly serious – the current xenophobic American government is incompetent to an almost surrealistic degree; facts are no longer considered irrefutable, vying for space with blatant lies, amidst paranoid accusations of \"Fake News\"; the planet _is_ dying; the polar ice caps _are_ melting, and with them, the future of our species; universal scientific guarantees of impending extinction _are_ largely ignored, whilst the idiots in power discard the warnings of their own people, strip away environmental protections, and continually confuse weather and climate.\r\n\r\nOne element of the film that's especially interesting is the Pirandellian self-reflexivity, with some of the characters aware that they're in a movie, but the rest seemingly oblivious. For example, the opening credits are scored to Sturgill Simpson's \"The Dead Don't Die\", and only a few minutes later, the song begins playing on the radio in Cliff and Ronnie's car. When Cliff asks why the song sounds so familiar, Ronnie explains that it's probably because \"_it's the theme song_\". In another scene, Ronnie is shown wearing a _Star Wars_ key-ring, alluding to his portrayal of Kylo Ren in that franchise. Later, after Ronnie has declared about a million times that \"_this isn't going to end well_\", an exasperated Cliff asks him how he can be so certain, and Ronnie says it's because he's read the script. This upsets Cliff because he was only allowed to read the scenes in which he appeared, prompting him to complain that he's helped \"Jim\" out many times in the past and this is the thanks he gets. A few minutes later, when something especially bizarre happens with Zelda (like, really bizarre), an incredulous Cliff asks Ronnie \"_was that in the script?_\" (according to Ronnie, it was not). And the point of all this self-reflexivity? Honestly, I'm not entirely sure. The fact that only Cliff and Ronnie seem to know they're in a movie is, in and of itself, a little strange, and the fact that it only comes up a few times means that it never really gels as a motif. If I was to guess, I'd say that Jarmusch may be using it in the Brechtian sense to ensure the audience remains a consciously critical observer, more engaged with the narrative on an intellectual level than an emotional level.\r\n\r\nFor all its positives, however, the film does have some problems. For one thing, the last ten minutes or so will irritate a lot of people, as Jarmusch abandons all semblance of narrative, and gives us a scene over which Hermit Bob delivers a dire assessment of who we are as a species. It's very preachy, it's very didactic, and it will rub some people up the wrong way. Another issue is the humour, which is best described as Jarmuschian – all awkward stilted dialogue, deadpan one-liners, people repeating things other people have said, and subtle winking at the audience. It definitely isn't the kind of broad stroke humour one finds in zombie comedies such as Edgar Wright's _Shaun of the Dead_ (2004) or Ruben Fleischer's _Zombieland_ (2009). Some of the political themes are also underexplored. For example, Frank's MAGA hat is a pointed critique of Trump and those who blindly vote for him and excuse his behaviour, but to what end? Aside from introducing the hat, Jarmusch doesn't really say anything more on the subject. The trio of kids from the detention centre are also introduced as if they will be major players, but they're gradually forgotten about, and ultimately don't play much of a role the story. Also, as Jarmusch himself is well aware, the film isn't really saying anything that Romero hasn't already said.\r\n\r\nNevertheless, I enjoyed _The Dead Don't Die_. It's certainly nowhere near Jarmusch's best, and I can totally understand people who dislike it; a lot of the themes have been explored before, a lot of the jokes have been made before, and the film ends up as neither a terrifying thriller nor a self-conscious meta-comedy, instead occupying a strange middle ground between the two. In this sense, it doesn't do a huge amount to stand out in a crowded field. Having said that, however, the socio-political commentary is undeniably relevant and the cast is universally impressive. And ultimately, you may have a problem with the cynical manner with which the film communicates its message, but that doesn't alter the fact that that message is absolutely legitimate.", "created_at": "2019-09-23T23:17:49.367Z"}, {"movie_id": 535581, "review_id": "5d94a037c613ce001d112f65", "author_rating": 3.0, "review_text": "This was really disappointing. That I **almost** laughed **one** time is the nicest thing I can say about _The Dead Don't Die_. I don't adore Jim Jarmusch as much as some, but I did expect more than this. Now you could argue that's on me, but I don't think it's **too** out of line to hope that a horror be scary, a comedy be funny, or a respected director's shot at horror comedy to be at least a little bit of at least one of the above. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-10-02T13:03:51.901Z"}, {"movie_id": 535581, "review_id": "5d03ac3d0e0a26134acbd943", "author_rating": 8.0, "review_text": "‘The Dead Don’t Die’ is a luxuriously paced, wittily gory zombie comedy. It’s part social commentary, part homage to cinema, and all ridiculous. With yet another pleasing genre film on offer from Jim Jarmusch, you’d be dead right to want to check it out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-dead-dont-die-a-zombie-comedy-thats-anything-but-grave\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-14T14:16:29.182Z"}, {"movie_id": 535581, "review_id": "5d89529d79b3d4001782e01d", "author_rating": 7.0, "review_text": "_**Very funny, but very peculiar (and somewhat preachy)**_\r\n\r\n>_I don't like making statement films. I just don't feel comfortable with that. I like to weave certain themes and different layers into films. This one's a little more blatant in certain ways, but we have a bigger problem, which is the sixth mass extinction that we are currently in. I am appalled by people's denial of these things. You can run from things, you can hide facts, you can hide science, but you can't change it by hiding it. And we're in a very severe state right now and this is not a political issue. This is an issue of_ _survival of species. This is a real concern. I'm not an activist. I'm not in the middle of Pennsylvania, digging a sea wall or whatever we should be doing. I'm making a silly film with my friends. But I am very concerned. I'm saddened and disappointed by human behaviour._\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch's New Comedy _The Dead Don't Die_ was Inspired by his Serious Fears for Humanity\" (Brandon Katz); _Observer_ (June 12, 2019)\r\n\r\n>_I think of the film as a comedy, very much so. It's not agitprop. It definitely has a sociopolitical thread in it, which is reflective and therefore dark. But hey, everyone, wake up! We're in the sixth mass extinction on this planet. To not have that darkness would have been a little superficial. There is a sadness in human behaviour for me, and zombies are the most obvious metaphor you could employ. We were also trying to make a kind of extension or homage to George Romero because of his postmodern reinvention of zombies, and those sociopolitical threads are evident in his films. Romero does a lot of fascinating things. The zombies are monsters, but they're not Godzilla. They don't come from outside the social order. They come from within a collapsing social order. They're us, or any of us who have died, so they are also victims because they don't choose to be undead. It's because of some stupid shit humans did that caused them to become undead. The problems of mass consumerism, the things that are woven into Romero's films, have only gotten worse. They haven't changed. We're at a crisis because of what his films were warning. And now we're at the endgame of that. What is more terrifying than having 1 million species going extinct in the last decade?_\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch Believes in the Teens, But Not Joe Biden\" (Bilge Ebiri); _Vulture_ (June 17, 2019)\r\n\r\n_The Dead Don't Die_ is such an unexpected film that when the trailer first dropped, a lot of people assumed it to be a joke of some kind; that the film purportedly being advertised couldn't possibly be real. And there's a good reason for that, as who could have predicted that celebrated indie writer/director Jim Jarmusch would have any interest in making an ensemble zombie comedy? Well, the thing about that is that, as it turns out, he doesn't. Jarmusch has certainly made genre films in the past – _Down By Law_ (1986) is a prison break film, _Dead Man_ (1995) is a western, _Ghost Dog: Way of the Samurai_ (1999) is a samurai film, _The Limits of Control_ (2009) is the story of an assassin, _Only Lovers Left Alive _(2013) is about vampires. Usually, he is exceptionally successful at grafting his worldview onto the generic tropes, often to such an extent that it can be difficult to separate the two – these films are undeniably genre pieces, but so too are they undeniably Jim Jarmusch films. With _The Dead Don't Die_, however, he's not quite as successful; this is very much a Jarmusch film before it's a zombie movie, with these two components often rubbing awkwardly up against one another.\r\n\r\nUnexpectedly chosen as the opening film at Cannes 2019, the film has met with mixed responses from both critics and audiences, and it's not hard to see why – glib socio-political commentary is introduced without really going anywhere; heavily promoted performers have nothing more than one or two-scene cameos; some of the characters know they're in a movie, even referring to Jarmusch himself, whilst others do not; a lot of the humour is of the flippant self-congratulatory kind; things become very preachy towards the end as Jarmusch abandons all semblance of narrative progression and shifts gears into a pseudo-TED talk. However, for all that, I enjoyed it. A zombie apocalypse movie set very much in Trump's America, it embraces all the weirdness that such a scenario suggests; the awkward humour works well for the most part, the meta elements are intriguing but not too distracting, and as for the didacticism? Well, nothing that Jarmusch says is incorrect; we _are_ a culture ruled by materialism and we _are_ sticking our collective heads in the sand regarding the fact that we're destroying the only home we have. So it might be inelegant (and Jarmusch has never been a satirist of Swiftian pedigree), but it's not wrong.\r\n\r\nSet in the fictional town of Centerville (pop. 738), the film begins as Chief Cliff Robertson (Bill Murray) and Officer Ronnie Peterson (Adam Driver) are following up a complaint from farmer Frank Miller (Steve Buscemi), who claims that a local vagrant, Hermit Bob (Tom Waits), has stolen one of his chickens. Issuing Bob with a warning, the duo are returning to the station when they realise that despite it being 8pm, the sun is still shining brightly, also noticing that their watches have stopped and they can't get any signal on their phones. Meanwhile, at the local diner, Frank and hardware store owner Hank Thompson (Danny Glover) watch a news report about recent \"polar fracking\", which some believe has knocked the earth off its axis. Returning to the police station, Cliff and Ronnie discuss the situation with Officer Mindy Morrison (Chloë Sevigny), also talking about the town's strange new undertaker, Zelda Winston (Tilda Swinton), a white-haired Scottish woman with a collection of samurai swords and a statue of Buddha. Ronnie and Mindy head home for the night, leaving Cliff with the body of Mallory O'Brien (Carol Kane), a local drunk who recently died. As the sun finally sets on Centerville, however, two zombies (Sara Driver and Iggy Pop) rise from the dead and set out in pursuit of the one thing all zombies crave...eh, coffee. \r\n\r\nVery much an ensemble piece, aside from the above characters, we're also introduced to a litany of additional Centerville residents - diner waitress Fern (Eszter Balint); detainees at a juvenile detention facility Stella (Maya Delmont), Olivia (Taliyah Whitaker), and Geronimo (Jahi Di'Allo Winston); gas station owner Bobby Wiggins (Caleb Landry Jones); delivery man Dean (RZA); motel owner Danny Perkins (Larry Fessenden); journalist Posie Juarez (Rosie Perez); cleaner Lily (Rosal Colon); and out-of-towners Zoe (Selena Gomez), Jack (Austin Butler) and Zack (Luka Sabbat).\r\n\r\nIf _The Dead Don't Die_ has a salient theme, it's apathy, suggesting that humanity is sleepwalking its way towards its own extinction. The zombie apocalypse is depicted as initially slow and distant, not something about which to be overly concerned, until, without us realising how it has happened, there's no escape or chance of salvation. In this sense, Jarmusch uses zombies as double signifiers – they not only represent the apocalypse towards which we are moving, they also represent us, indifferently shuffling our way to an oblivion we know is coming, but which we choose to ignore (at one point, Cliff literally falls into an open grave because he isn't looking where he's going). Targeting rampant materialism, capitalist greed, and moral idiocy in elected officials, the film does provide a narrative explanation for why the dead are rising from the grave (the oft-discussed polar fracking), but really, Jarmusch isn't as interested in the \"why\" as he is in the \"how\", castigating a moribund and materialist society which has become blind to everything but trivial consumerist gratification.\r\n\r\nIn short, Jarmusch is suggesting that as a society, we've become zombified; lazy, instinctual, addicted to things that don't matter (whilst the first zombies we meet want coffee, others are on the hunt for WiFi, Siri, Chardonnay, Xanax, and \"Fashion\"). Indeed, in this sense, one of the film's more subtle (and interesting) points is that the best way to remain outside such societal calcification is to avoid conformism and remain on the edges of the social contract – the characters who do best against the zombies are the socially ostracised Zelda, the three kids in the detention centre, and the philosophical Hermit Bob, who suggests that \"_hunger for more stuff_\" has become society's primary motivator. Indeed, the way most of the characters react to the zombies is itself part of the critique – the vast majority respond in a blasé manner, suggesting that in these insane times, when so many people are falling all over themselves to normalise the rantings of the racist, misogynistic, incoherent manchild in the Oval Office, even something like the dead rising from the ground is no big deal.\r\n\r\nOf course, using zombies as vehicles for social satire isn't exactly new; George A. Romero did it as far back as _Night of the Living Dead_ (1968), which is more about endemic racism than zombies. He did it to even greater effect in _Dawn of the Dead_ (1978), where he targeted materialistic vapidity. Later, he looked at issues such as Reagan-era militarism in _Day of the Dead_ (1985), economic disparity in _Land of the Dead_ (2005), media impartiality in _Diary of the Dead_ (2007), and tribalism in _Survival of the Dead_ (2009). In this tradition, _The Dead Don't Die_ has its eye very much on the climate change-denying administration in Washington; Frank is introduced wearing a MAGA-style baseball cap with a \"Keep America White Again\" logo, whilst his dog is called Rumsfeld. Indeed, Centerville itself is very much a quintessential Heartland town, the kind where Trump so successfully mobilised his blue collar base. And whilst it remains a comedy, much of what _The Dead Don't Die_ says is deadly serious – the current xenophobic American government is incompetent to an almost surrealistic degree; facts are no longer considered irrefutable, vying for space with blatant lies, amidst paranoid accusations of \"Fake News\"; the planet _is_ dying; the polar ice caps _are_ melting, and with them, the future of our species; universal scientific guarantees of impending extinction _are_ largely ignored, whilst the idiots in power discard the warnings of their own people, strip away environmental protections, and continually confuse weather and climate.\r\n\r\nOne element of the film that's especially interesting is the Pirandellian self-reflexivity, with some of the characters aware that they're in a movie, but the rest seemingly oblivious. For example, the opening credits are scored to Sturgill Simpson's \"The Dead Don't Die\", and only a few minutes later, the song begins playing on the radio in Cliff and Ronnie's car. When Cliff asks why the song sounds so familiar, Ronnie explains that it's probably because \"_it's the theme song_\". In another scene, Ronnie is shown wearing a _Star Wars_ key-ring, alluding to his portrayal of Kylo Ren in that franchise. Later, after Ronnie has declared about a million times that \"_this isn't going to end well_\", an exasperated Cliff asks him how he can be so certain, and Ronnie says it's because he's read the script. This upsets Cliff because he was only allowed to read the scenes in which he appeared, prompting him to complain that he's helped \"Jim\" out many times in the past and this is the thanks he gets. A few minutes later, when something especially bizarre happens with Zelda (like, really bizarre), an incredulous Cliff asks Ronnie \"_was that in the script?_\" (according to Ronnie, it was not). And the point of all this self-reflexivity? Honestly, I'm not entirely sure. The fact that only Cliff and Ronnie seem to know they're in a movie is, in and of itself, a little strange, and the fact that it only comes up a few times means that it never really gels as a motif. If I was to guess, I'd say that Jarmusch may be using it in the Brechtian sense to ensure the audience remains a consciously critical observer, more engaged with the narrative on an intellectual level than an emotional level.\r\n\r\nFor all its positives, however, the film does have some problems. For one thing, the last ten minutes or so will irritate a lot of people, as Jarmusch abandons all semblance of narrative, and gives us a scene over which Hermit Bob delivers a dire assessment of who we are as a species. It's very preachy, it's very didactic, and it will rub some people up the wrong way. Another issue is the humour, which is best described as Jarmuschian – all awkward stilted dialogue, deadpan one-liners, people repeating things other people have said, and subtle winking at the audience. It definitely isn't the kind of broad stroke humour one finds in zombie comedies such as Edgar Wright's _Shaun of the Dead_ (2004) or Ruben Fleischer's _Zombieland_ (2009). Some of the political themes are also underexplored. For example, Frank's MAGA hat is a pointed critique of Trump and those who blindly vote for him and excuse his behaviour, but to what end? Aside from introducing the hat, Jarmusch doesn't really say anything more on the subject. The trio of kids from the detention centre are also introduced as if they will be major players, but they're gradually forgotten about, and ultimately don't play much of a role the story. Also, as Jarmusch himself is well aware, the film isn't really saying anything that Romero hasn't already said.\r\n\r\nNevertheless, I enjoyed _The Dead Don't Die_. It's certainly nowhere near Jarmusch's best, and I can totally understand people who dislike it; a lot of the themes have been explored before, a lot of the jokes have been made before, and the film ends up as neither a terrifying thriller nor a self-conscious meta-comedy, instead occupying a strange middle ground between the two. In this sense, it doesn't do a huge amount to stand out in a crowded field. Having said that, however, the socio-political commentary is undeniably relevant and the cast is universally impressive. And ultimately, you may have a problem with the cynical manner with which the film communicates its message, but that doesn't alter the fact that that message is absolutely legitimate.", "created_at": "2019-09-23T23:17:49.367Z"}, {"movie_id": 535581, "review_id": "5d94a037c613ce001d112f65", "author_rating": 3.0, "review_text": "This was really disappointing. That I **almost** laughed **one** time is the nicest thing I can say about _The Dead Don't Die_. I don't adore Jim Jarmusch as much as some, but I did expect more than this. Now you could argue that's on me, but I don't think it's **too** out of line to hope that a horror be scary, a comedy be funny, or a respected director's shot at horror comedy to be at least a little bit of at least one of the above. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-10-02T13:03:51.901Z"}, {"movie_id": 535581, "review_id": "5d03ac3d0e0a26134acbd943", "author_rating": 8.0, "review_text": "‘The Dead Don’t Die’ is a luxuriously paced, wittily gory zombie comedy. It’s part social commentary, part homage to cinema, and all ridiculous. With yet another pleasing genre film on offer from Jim Jarmusch, you’d be dead right to want to check it out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-dead-dont-die-a-zombie-comedy-thats-anything-but-grave\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-14T14:16:29.182Z"}, {"movie_id": 535581, "review_id": "5d89529d79b3d4001782e01d", "author_rating": 7.0, "review_text": "_**Very funny, but very peculiar (and somewhat preachy)**_\r\n\r\n>_I don't like making statement films. I just don't feel comfortable with that. I like to weave certain themes and different layers into films. This one's a little more blatant in certain ways, but we have a bigger problem, which is the sixth mass extinction that we are currently in. I am appalled by people's denial of these things. You can run from things, you can hide facts, you can hide science, but you can't change it by hiding it. And we're in a very severe state right now and this is not a political issue. This is an issue of_ _survival of species. This is a real concern. I'm not an activist. I'm not in the middle of Pennsylvania, digging a sea wall or whatever we should be doing. I'm making a silly film with my friends. But I am very concerned. I'm saddened and disappointed by human behaviour._\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch's New Comedy _The Dead Don't Die_ was Inspired by his Serious Fears for Humanity\" (Brandon Katz); _Observer_ (June 12, 2019)\r\n\r\n>_I think of the film as a comedy, very much so. It's not agitprop. It definitely has a sociopolitical thread in it, which is reflective and therefore dark. But hey, everyone, wake up! We're in the sixth mass extinction on this planet. To not have that darkness would have been a little superficial. There is a sadness in human behaviour for me, and zombies are the most obvious metaphor you could employ. We were also trying to make a kind of extension or homage to George Romero because of his postmodern reinvention of zombies, and those sociopolitical threads are evident in his films. Romero does a lot of fascinating things. The zombies are monsters, but they're not Godzilla. They don't come from outside the social order. They come from within a collapsing social order. They're us, or any of us who have died, so they are also victims because they don't choose to be undead. It's because of some stupid shit humans did that caused them to become undead. The problems of mass consumerism, the things that are woven into Romero's films, have only gotten worse. They haven't changed. We're at a crisis because of what his films were warning. And now we're at the endgame of that. What is more terrifying than having 1 million species going extinct in the last decade?_\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch Believes in the Teens, But Not Joe Biden\" (Bilge Ebiri); _Vulture_ (June 17, 2019)\r\n\r\n_The Dead Don't Die_ is such an unexpected film that when the trailer first dropped, a lot of people assumed it to be a joke of some kind; that the film purportedly being advertised couldn't possibly be real. And there's a good reason for that, as who could have predicted that celebrated indie writer/director Jim Jarmusch would have any interest in making an ensemble zombie comedy? Well, the thing about that is that, as it turns out, he doesn't. Jarmusch has certainly made genre films in the past – _Down By Law_ (1986) is a prison break film, _Dead Man_ (1995) is a western, _Ghost Dog: Way of the Samurai_ (1999) is a samurai film, _The Limits of Control_ (2009) is the story of an assassin, _Only Lovers Left Alive _(2013) is about vampires. Usually, he is exceptionally successful at grafting his worldview onto the generic tropes, often to such an extent that it can be difficult to separate the two – these films are undeniably genre pieces, but so too are they undeniably Jim Jarmusch films. With _The Dead Don't Die_, however, he's not quite as successful; this is very much a Jarmusch film before it's a zombie movie, with these two components often rubbing awkwardly up against one another.\r\n\r\nUnexpectedly chosen as the opening film at Cannes 2019, the film has met with mixed responses from both critics and audiences, and it's not hard to see why – glib socio-political commentary is introduced without really going anywhere; heavily promoted performers have nothing more than one or two-scene cameos; some of the characters know they're in a movie, even referring to Jarmusch himself, whilst others do not; a lot of the humour is of the flippant self-congratulatory kind; things become very preachy towards the end as Jarmusch abandons all semblance of narrative progression and shifts gears into a pseudo-TED talk. However, for all that, I enjoyed it. A zombie apocalypse movie set very much in Trump's America, it embraces all the weirdness that such a scenario suggests; the awkward humour works well for the most part, the meta elements are intriguing but not too distracting, and as for the didacticism? Well, nothing that Jarmusch says is incorrect; we _are_ a culture ruled by materialism and we _are_ sticking our collective heads in the sand regarding the fact that we're destroying the only home we have. So it might be inelegant (and Jarmusch has never been a satirist of Swiftian pedigree), but it's not wrong.\r\n\r\nSet in the fictional town of Centerville (pop. 738), the film begins as Chief Cliff Robertson (Bill Murray) and Officer Ronnie Peterson (Adam Driver) are following up a complaint from farmer Frank Miller (Steve Buscemi), who claims that a local vagrant, Hermit Bob (Tom Waits), has stolen one of his chickens. Issuing Bob with a warning, the duo are returning to the station when they realise that despite it being 8pm, the sun is still shining brightly, also noticing that their watches have stopped and they can't get any signal on their phones. Meanwhile, at the local diner, Frank and hardware store owner Hank Thompson (Danny Glover) watch a news report about recent \"polar fracking\", which some believe has knocked the earth off its axis. Returning to the police station, Cliff and Ronnie discuss the situation with Officer Mindy Morrison (Chloë Sevigny), also talking about the town's strange new undertaker, Zelda Winston (Tilda Swinton), a white-haired Scottish woman with a collection of samurai swords and a statue of Buddha. Ronnie and Mindy head home for the night, leaving Cliff with the body of Mallory O'Brien (Carol Kane), a local drunk who recently died. As the sun finally sets on Centerville, however, two zombies (Sara Driver and Iggy Pop) rise from the dead and set out in pursuit of the one thing all zombies crave...eh, coffee. \r\n\r\nVery much an ensemble piece, aside from the above characters, we're also introduced to a litany of additional Centerville residents - diner waitress Fern (Eszter Balint); detainees at a juvenile detention facility Stella (Maya Delmont), Olivia (Taliyah Whitaker), and Geronimo (Jahi Di'Allo Winston); gas station owner Bobby Wiggins (Caleb Landry Jones); delivery man Dean (RZA); motel owner Danny Perkins (Larry Fessenden); journalist Posie Juarez (Rosie Perez); cleaner Lily (Rosal Colon); and out-of-towners Zoe (Selena Gomez), Jack (Austin Butler) and Zack (Luka Sabbat).\r\n\r\nIf _The Dead Don't Die_ has a salient theme, it's apathy, suggesting that humanity is sleepwalking its way towards its own extinction. The zombie apocalypse is depicted as initially slow and distant, not something about which to be overly concerned, until, without us realising how it has happened, there's no escape or chance of salvation. In this sense, Jarmusch uses zombies as double signifiers – they not only represent the apocalypse towards which we are moving, they also represent us, indifferently shuffling our way to an oblivion we know is coming, but which we choose to ignore (at one point, Cliff literally falls into an open grave because he isn't looking where he's going). Targeting rampant materialism, capitalist greed, and moral idiocy in elected officials, the film does provide a narrative explanation for why the dead are rising from the grave (the oft-discussed polar fracking), but really, Jarmusch isn't as interested in the \"why\" as he is in the \"how\", castigating a moribund and materialist society which has become blind to everything but trivial consumerist gratification.\r\n\r\nIn short, Jarmusch is suggesting that as a society, we've become zombified; lazy, instinctual, addicted to things that don't matter (whilst the first zombies we meet want coffee, others are on the hunt for WiFi, Siri, Chardonnay, Xanax, and \"Fashion\"). Indeed, in this sense, one of the film's more subtle (and interesting) points is that the best way to remain outside such societal calcification is to avoid conformism and remain on the edges of the social contract – the characters who do best against the zombies are the socially ostracised Zelda, the three kids in the detention centre, and the philosophical Hermit Bob, who suggests that \"_hunger for more stuff_\" has become society's primary motivator. Indeed, the way most of the characters react to the zombies is itself part of the critique – the vast majority respond in a blasé manner, suggesting that in these insane times, when so many people are falling all over themselves to normalise the rantings of the racist, misogynistic, incoherent manchild in the Oval Office, even something like the dead rising from the ground is no big deal.\r\n\r\nOf course, using zombies as vehicles for social satire isn't exactly new; George A. Romero did it as far back as _Night of the Living Dead_ (1968), which is more about endemic racism than zombies. He did it to even greater effect in _Dawn of the Dead_ (1978), where he targeted materialistic vapidity. Later, he looked at issues such as Reagan-era militarism in _Day of the Dead_ (1985), economic disparity in _Land of the Dead_ (2005), media impartiality in _Diary of the Dead_ (2007), and tribalism in _Survival of the Dead_ (2009). In this tradition, _The Dead Don't Die_ has its eye very much on the climate change-denying administration in Washington; Frank is introduced wearing a MAGA-style baseball cap with a \"Keep America White Again\" logo, whilst his dog is called Rumsfeld. Indeed, Centerville itself is very much a quintessential Heartland town, the kind where Trump so successfully mobilised his blue collar base. And whilst it remains a comedy, much of what _The Dead Don't Die_ says is deadly serious – the current xenophobic American government is incompetent to an almost surrealistic degree; facts are no longer considered irrefutable, vying for space with blatant lies, amidst paranoid accusations of \"Fake News\"; the planet _is_ dying; the polar ice caps _are_ melting, and with them, the future of our species; universal scientific guarantees of impending extinction _are_ largely ignored, whilst the idiots in power discard the warnings of their own people, strip away environmental protections, and continually confuse weather and climate.\r\n\r\nOne element of the film that's especially interesting is the Pirandellian self-reflexivity, with some of the characters aware that they're in a movie, but the rest seemingly oblivious. For example, the opening credits are scored to Sturgill Simpson's \"The Dead Don't Die\", and only a few minutes later, the song begins playing on the radio in Cliff and Ronnie's car. When Cliff asks why the song sounds so familiar, Ronnie explains that it's probably because \"_it's the theme song_\". In another scene, Ronnie is shown wearing a _Star Wars_ key-ring, alluding to his portrayal of Kylo Ren in that franchise. Later, after Ronnie has declared about a million times that \"_this isn't going to end well_\", an exasperated Cliff asks him how he can be so certain, and Ronnie says it's because he's read the script. This upsets Cliff because he was only allowed to read the scenes in which he appeared, prompting him to complain that he's helped \"Jim\" out many times in the past and this is the thanks he gets. A few minutes later, when something especially bizarre happens with Zelda (like, really bizarre), an incredulous Cliff asks Ronnie \"_was that in the script?_\" (according to Ronnie, it was not). And the point of all this self-reflexivity? Honestly, I'm not entirely sure. The fact that only Cliff and Ronnie seem to know they're in a movie is, in and of itself, a little strange, and the fact that it only comes up a few times means that it never really gels as a motif. If I was to guess, I'd say that Jarmusch may be using it in the Brechtian sense to ensure the audience remains a consciously critical observer, more engaged with the narrative on an intellectual level than an emotional level.\r\n\r\nFor all its positives, however, the film does have some problems. For one thing, the last ten minutes or so will irritate a lot of people, as Jarmusch abandons all semblance of narrative, and gives us a scene over which Hermit Bob delivers a dire assessment of who we are as a species. It's very preachy, it's very didactic, and it will rub some people up the wrong way. Another issue is the humour, which is best described as Jarmuschian – all awkward stilted dialogue, deadpan one-liners, people repeating things other people have said, and subtle winking at the audience. It definitely isn't the kind of broad stroke humour one finds in zombie comedies such as Edgar Wright's _Shaun of the Dead_ (2004) or Ruben Fleischer's _Zombieland_ (2009). Some of the political themes are also underexplored. For example, Frank's MAGA hat is a pointed critique of Trump and those who blindly vote for him and excuse his behaviour, but to what end? Aside from introducing the hat, Jarmusch doesn't really say anything more on the subject. The trio of kids from the detention centre are also introduced as if they will be major players, but they're gradually forgotten about, and ultimately don't play much of a role the story. Also, as Jarmusch himself is well aware, the film isn't really saying anything that Romero hasn't already said.\r\n\r\nNevertheless, I enjoyed _The Dead Don't Die_. It's certainly nowhere near Jarmusch's best, and I can totally understand people who dislike it; a lot of the themes have been explored before, a lot of the jokes have been made before, and the film ends up as neither a terrifying thriller nor a self-conscious meta-comedy, instead occupying a strange middle ground between the two. In this sense, it doesn't do a huge amount to stand out in a crowded field. Having said that, however, the socio-political commentary is undeniably relevant and the cast is universally impressive. And ultimately, you may have a problem with the cynical manner with which the film communicates its message, but that doesn't alter the fact that that message is absolutely legitimate.", "created_at": "2019-09-23T23:17:49.367Z"}, {"movie_id": 535581, "review_id": "5d94a037c613ce001d112f65", "author_rating": 3.0, "review_text": "This was really disappointing. That I **almost** laughed **one** time is the nicest thing I can say about _The Dead Don't Die_. I don't adore Jim Jarmusch as much as some, but I did expect more than this. Now you could argue that's on me, but I don't think it's **too** out of line to hope that a horror be scary, a comedy be funny, or a respected director's shot at horror comedy to be at least a little bit of at least one of the above. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-10-02T13:03:51.901Z"}, {"movie_id": 535581, "review_id": "5d03ac3d0e0a26134acbd943", "author_rating": 8.0, "review_text": "‘The Dead Don’t Die’ is a luxuriously paced, wittily gory zombie comedy. It’s part social commentary, part homage to cinema, and all ridiculous. With yet another pleasing genre film on offer from Jim Jarmusch, you’d be dead right to want to check it out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-dead-dont-die-a-zombie-comedy-thats-anything-but-grave\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-14T14:16:29.182Z"}, {"movie_id": 535581, "review_id": "5d89529d79b3d4001782e01d", "author_rating": 7.0, "review_text": "_**Very funny, but very peculiar (and somewhat preachy)**_\r\n\r\n>_I don't like making statement films. I just don't feel comfortable with that. I like to weave certain themes and different layers into films. This one's a little more blatant in certain ways, but we have a bigger problem, which is the sixth mass extinction that we are currently in. I am appalled by people's denial of these things. You can run from things, you can hide facts, you can hide science, but you can't change it by hiding it. And we're in a very severe state right now and this is not a political issue. This is an issue of_ _survival of species. This is a real concern. I'm not an activist. I'm not in the middle of Pennsylvania, digging a sea wall or whatever we should be doing. I'm making a silly film with my friends. But I am very concerned. I'm saddened and disappointed by human behaviour._\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch's New Comedy _The Dead Don't Die_ was Inspired by his Serious Fears for Humanity\" (Brandon Katz); _Observer_ (June 12, 2019)\r\n\r\n>_I think of the film as a comedy, very much so. It's not agitprop. It definitely has a sociopolitical thread in it, which is reflective and therefore dark. But hey, everyone, wake up! We're in the sixth mass extinction on this planet. To not have that darkness would have been a little superficial. There is a sadness in human behaviour for me, and zombies are the most obvious metaphor you could employ. We were also trying to make a kind of extension or homage to George Romero because of his postmodern reinvention of zombies, and those sociopolitical threads are evident in his films. Romero does a lot of fascinating things. The zombies are monsters, but they're not Godzilla. They don't come from outside the social order. They come from within a collapsing social order. They're us, or any of us who have died, so they are also victims because they don't choose to be undead. It's because of some stupid shit humans did that caused them to become undead. The problems of mass consumerism, the things that are woven into Romero's films, have only gotten worse. They haven't changed. We're at a crisis because of what his films were warning. And now we're at the endgame of that. What is more terrifying than having 1 million species going extinct in the last decade?_\r\n\r\n- Jim Jarmusch; \"Jim Jarmusch Believes in the Teens, But Not Joe Biden\" (Bilge Ebiri); _Vulture_ (June 17, 2019)\r\n\r\n_The Dead Don't Die_ is such an unexpected film that when the trailer first dropped, a lot of people assumed it to be a joke of some kind; that the film purportedly being advertised couldn't possibly be real. And there's a good reason for that, as who could have predicted that celebrated indie writer/director Jim Jarmusch would have any interest in making an ensemble zombie comedy? Well, the thing about that is that, as it turns out, he doesn't. Jarmusch has certainly made genre films in the past – _Down By Law_ (1986) is a prison break film, _Dead Man_ (1995) is a western, _Ghost Dog: Way of the Samurai_ (1999) is a samurai film, _The Limits of Control_ (2009) is the story of an assassin, _Only Lovers Left Alive _(2013) is about vampires. Usually, he is exceptionally successful at grafting his worldview onto the generic tropes, often to such an extent that it can be difficult to separate the two – these films are undeniably genre pieces, but so too are they undeniably Jim Jarmusch films. With _The Dead Don't Die_, however, he's not quite as successful; this is very much a Jarmusch film before it's a zombie movie, with these two components often rubbing awkwardly up against one another.\r\n\r\nUnexpectedly chosen as the opening film at Cannes 2019, the film has met with mixed responses from both critics and audiences, and it's not hard to see why – glib socio-political commentary is introduced without really going anywhere; heavily promoted performers have nothing more than one or two-scene cameos; some of the characters know they're in a movie, even referring to Jarmusch himself, whilst others do not; a lot of the humour is of the flippant self-congratulatory kind; things become very preachy towards the end as Jarmusch abandons all semblance of narrative progression and shifts gears into a pseudo-TED talk. However, for all that, I enjoyed it. A zombie apocalypse movie set very much in Trump's America, it embraces all the weirdness that such a scenario suggests; the awkward humour works well for the most part, the meta elements are intriguing but not too distracting, and as for the didacticism? Well, nothing that Jarmusch says is incorrect; we _are_ a culture ruled by materialism and we _are_ sticking our collective heads in the sand regarding the fact that we're destroying the only home we have. So it might be inelegant (and Jarmusch has never been a satirist of Swiftian pedigree), but it's not wrong.\r\n\r\nSet in the fictional town of Centerville (pop. 738), the film begins as Chief Cliff Robertson (Bill Murray) and Officer Ronnie Peterson (Adam Driver) are following up a complaint from farmer Frank Miller (Steve Buscemi), who claims that a local vagrant, Hermit Bob (Tom Waits), has stolen one of his chickens. Issuing Bob with a warning, the duo are returning to the station when they realise that despite it being 8pm, the sun is still shining brightly, also noticing that their watches have stopped and they can't get any signal on their phones. Meanwhile, at the local diner, Frank and hardware store owner Hank Thompson (Danny Glover) watch a news report about recent \"polar fracking\", which some believe has knocked the earth off its axis. Returning to the police station, Cliff and Ronnie discuss the situation with Officer Mindy Morrison (Chloë Sevigny), also talking about the town's strange new undertaker, Zelda Winston (Tilda Swinton), a white-haired Scottish woman with a collection of samurai swords and a statue of Buddha. Ronnie and Mindy head home for the night, leaving Cliff with the body of Mallory O'Brien (Carol Kane), a local drunk who recently died. As the sun finally sets on Centerville, however, two zombies (Sara Driver and Iggy Pop) rise from the dead and set out in pursuit of the one thing all zombies crave...eh, coffee. \r\n\r\nVery much an ensemble piece, aside from the above characters, we're also introduced to a litany of additional Centerville residents - diner waitress Fern (Eszter Balint); detainees at a juvenile detention facility Stella (Maya Delmont), Olivia (Taliyah Whitaker), and Geronimo (Jahi Di'Allo Winston); gas station owner Bobby Wiggins (Caleb Landry Jones); delivery man Dean (RZA); motel owner Danny Perkins (Larry Fessenden); journalist Posie Juarez (Rosie Perez); cleaner Lily (Rosal Colon); and out-of-towners Zoe (Selena Gomez), Jack (Austin Butler) and Zack (Luka Sabbat).\r\n\r\nIf _The Dead Don't Die_ has a salient theme, it's apathy, suggesting that humanity is sleepwalking its way towards its own extinction. The zombie apocalypse is depicted as initially slow and distant, not something about which to be overly concerned, until, without us realising how it has happened, there's no escape or chance of salvation. In this sense, Jarmusch uses zombies as double signifiers – they not only represent the apocalypse towards which we are moving, they also represent us, indifferently shuffling our way to an oblivion we know is coming, but which we choose to ignore (at one point, Cliff literally falls into an open grave because he isn't looking where he's going). Targeting rampant materialism, capitalist greed, and moral idiocy in elected officials, the film does provide a narrative explanation for why the dead are rising from the grave (the oft-discussed polar fracking), but really, Jarmusch isn't as interested in the \"why\" as he is in the \"how\", castigating a moribund and materialist society which has become blind to everything but trivial consumerist gratification.\r\n\r\nIn short, Jarmusch is suggesting that as a society, we've become zombified; lazy, instinctual, addicted to things that don't matter (whilst the first zombies we meet want coffee, others are on the hunt for WiFi, Siri, Chardonnay, Xanax, and \"Fashion\"). Indeed, in this sense, one of the film's more subtle (and interesting) points is that the best way to remain outside such societal calcification is to avoid conformism and remain on the edges of the social contract – the characters who do best against the zombies are the socially ostracised Zelda, the three kids in the detention centre, and the philosophical Hermit Bob, who suggests that \"_hunger for more stuff_\" has become society's primary motivator. Indeed, the way most of the characters react to the zombies is itself part of the critique – the vast majority respond in a blasé manner, suggesting that in these insane times, when so many people are falling all over themselves to normalise the rantings of the racist, misogynistic, incoherent manchild in the Oval Office, even something like the dead rising from the ground is no big deal.\r\n\r\nOf course, using zombies as vehicles for social satire isn't exactly new; George A. Romero did it as far back as _Night of the Living Dead_ (1968), which is more about endemic racism than zombies. He did it to even greater effect in _Dawn of the Dead_ (1978), where he targeted materialistic vapidity. Later, he looked at issues such as Reagan-era militarism in _Day of the Dead_ (1985), economic disparity in _Land of the Dead_ (2005), media impartiality in _Diary of the Dead_ (2007), and tribalism in _Survival of the Dead_ (2009). In this tradition, _The Dead Don't Die_ has its eye very much on the climate change-denying administration in Washington; Frank is introduced wearing a MAGA-style baseball cap with a \"Keep America White Again\" logo, whilst his dog is called Rumsfeld. Indeed, Centerville itself is very much a quintessential Heartland town, the kind where Trump so successfully mobilised his blue collar base. And whilst it remains a comedy, much of what _The Dead Don't Die_ says is deadly serious – the current xenophobic American government is incompetent to an almost surrealistic degree; facts are no longer considered irrefutable, vying for space with blatant lies, amidst paranoid accusations of \"Fake News\"; the planet _is_ dying; the polar ice caps _are_ melting, and with them, the future of our species; universal scientific guarantees of impending extinction _are_ largely ignored, whilst the idiots in power discard the warnings of their own people, strip away environmental protections, and continually confuse weather and climate.\r\n\r\nOne element of the film that's especially interesting is the Pirandellian self-reflexivity, with some of the characters aware that they're in a movie, but the rest seemingly oblivious. For example, the opening credits are scored to Sturgill Simpson's \"The Dead Don't Die\", and only a few minutes later, the song begins playing on the radio in Cliff and Ronnie's car. When Cliff asks why the song sounds so familiar, Ronnie explains that it's probably because \"_it's the theme song_\". In another scene, Ronnie is shown wearing a _Star Wars_ key-ring, alluding to his portrayal of Kylo Ren in that franchise. Later, after Ronnie has declared about a million times that \"_this isn't going to end well_\", an exasperated Cliff asks him how he can be so certain, and Ronnie says it's because he's read the script. This upsets Cliff because he was only allowed to read the scenes in which he appeared, prompting him to complain that he's helped \"Jim\" out many times in the past and this is the thanks he gets. A few minutes later, when something especially bizarre happens with Zelda (like, really bizarre), an incredulous Cliff asks Ronnie \"_was that in the script?_\" (according to Ronnie, it was not). And the point of all this self-reflexivity? Honestly, I'm not entirely sure. The fact that only Cliff and Ronnie seem to know they're in a movie is, in and of itself, a little strange, and the fact that it only comes up a few times means that it never really gels as a motif. If I was to guess, I'd say that Jarmusch may be using it in the Brechtian sense to ensure the audience remains a consciously critical observer, more engaged with the narrative on an intellectual level than an emotional level.\r\n\r\nFor all its positives, however, the film does have some problems. For one thing, the last ten minutes or so will irritate a lot of people, as Jarmusch abandons all semblance of narrative, and gives us a scene over which Hermit Bob delivers a dire assessment of who we are as a species. It's very preachy, it's very didactic, and it will rub some people up the wrong way. Another issue is the humour, which is best described as Jarmuschian – all awkward stilted dialogue, deadpan one-liners, people repeating things other people have said, and subtle winking at the audience. It definitely isn't the kind of broad stroke humour one finds in zombie comedies such as Edgar Wright's _Shaun of the Dead_ (2004) or Ruben Fleischer's _Zombieland_ (2009). Some of the political themes are also underexplored. For example, Frank's MAGA hat is a pointed critique of Trump and those who blindly vote for him and excuse his behaviour, but to what end? Aside from introducing the hat, Jarmusch doesn't really say anything more on the subject. The trio of kids from the detention centre are also introduced as if they will be major players, but they're gradually forgotten about, and ultimately don't play much of a role the story. Also, as Jarmusch himself is well aware, the film isn't really saying anything that Romero hasn't already said.\r\n\r\nNevertheless, I enjoyed _The Dead Don't Die_. It's certainly nowhere near Jarmusch's best, and I can totally understand people who dislike it; a lot of the themes have been explored before, a lot of the jokes have been made before, and the film ends up as neither a terrifying thriller nor a self-conscious meta-comedy, instead occupying a strange middle ground between the two. In this sense, it doesn't do a huge amount to stand out in a crowded field. Having said that, however, the socio-political commentary is undeniably relevant and the cast is universally impressive. And ultimately, you may have a problem with the cynical manner with which the film communicates its message, but that doesn't alter the fact that that message is absolutely legitimate.", "created_at": "2019-09-23T23:17:49.367Z"}, {"movie_id": 535581, "review_id": "5d94a037c613ce001d112f65", "author_rating": 3.0, "review_text": "This was really disappointing. That I **almost** laughed **one** time is the nicest thing I can say about _The Dead Don't Die_. I don't adore Jim Jarmusch as much as some, but I did expect more than this. Now you could argue that's on me, but I don't think it's **too** out of line to hope that a horror be scary, a comedy be funny, or a respected director's shot at horror comedy to be at least a little bit of at least one of the above. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-10-02T13:03:51.901Z"}]