[{"movie_id": 41733, "review_id": "589c416cc3a3687734002515", "author_rating": null, "review_text": "I really wanted to watch this movie mainly because of Robert Downy Jr. Just looking at the poster...he's hot! \r\n\r\n\r\nSo the movie is funny but not LMAO-funny. It has a touching side to it. Of course, I felt so happy seeing Robert Downey Jr. just being his plain hot self. He looks good when he's clean and he looks good when he's dirty.  And then there's Zach Galifianakis. I loved him in Hangover. He's super funny there. But I was surprised to watch him in this movie because not only is he in his funny self, he did a couple of crying scenes which were touching. \r\n\r\nThis movie is tiring. YES. Tiring. All the adventures and misadventures that they had made me really tired. My rate for this movie is B+. I can never give Robert a low rating hehehe.", "created_at": "2017-02-09T10:16:12.822Z"}, {"movie_id": 41733, "review_id": "5b78cf13c3a36860e601a105", "author_rating": 2.0, "review_text": "A generic road trip movie with two terrible people who continuously make bad choices in a predictable plot rife with even more predictable \"gags\". Galifianakis portrays an even dumber and less funny version of the Hangover while Downey plays a less intelligent and less humorous version of Tony Stark.\r\n\r\nSeriously, it isn't worth your time. If you want a funny road trip film then go watch 'Planes, Trains and Automobiles' instead. Doesn't matter if you've seen it before. You will still feel a lot happier than if you had wasted your life on this film.", "created_at": "2018-08-19T01:59:47.745Z"}, {"movie_id": 41733, "review_id": "5f57f6dce8131d003613c1bb", "author_rating": 5.0, "review_text": "Decent watch, probably won't watch again, and can't whole-heartedly recommend.\r\n\r\nThis is an interesting movie to look at critically.  The writing, mostly in the character work, feels weak.  It actually has an interesting plot, for the most part: an idiot, through deceit, drags a jerk with him on a cross country road trip.  It's a decent story, and I'd like to think of it as an spiritual predecessor to \"The Hangover\".  The problem I have with it is that it feels like if there were better actors, then the characters would sell better.  Then I remember it was Robert Downey Jr and Zach Galifinakas, and I'm not sure how much \"better\" you can get for these characters, meaning that they've probably already elevated the characters somewhat.\r\n\r\nIt feels like a lot of the movie is unnecessary, like antithetical Chekov's guns.  Either it's for a tiny one time joke with little payoff, or it's part of a lot of work for situational comedy.\r\n\r\nAn example would be the dog, it really only has one significant joke in the entire movie (maybe 2), otherwise it's just a lot of maintenance.\r\n\r\nThe coffee can on the other hand is repetitively used to throughout the movie as it's part of the character themes.\r\n\r\nI'm not saying it's not funny, if you like \"Anger Management\", then you might like this one, but I just think there are a lot better movies out there to watch.", "created_at": "2020-09-08T21:25:48.426Z"}]