[{"movie_id": 10393, "review_id": "5d43a101ea7b0e0012894b30", "author_rating": 8.0, "review_text": "If you are a wanna-be, a has-been or a never-have, THIS is the movie for you. Celebrating the Everyman who never got his shot, The Replacements takes the Mediocre and gives them their chance in the spotlight.\r\n\r\nThe movie starts out with the professional football players going on strike, mid-season, to demand even more money to play a kid's game. The league owners decide to finish out the season with whatever players they can acquire (mirroring the 1987 NFL strike). The Washington Sentinels' owner goes a completely different direction by re-hiring one of his old coaches and giving him complete control of the team. Coach McGinty then goes about putting together his Dream Team of Wanna-Be's and Never-Were's who, if the stars aligned just right, might just reach their full potential.\r\n\r\nAn EXCELLENT popcorn movie that would have received 5 stars if there had been more football in the football movie. Nevertheless, it is packed full of great one-liners (He's Wiry) and will have you tossing off non-sequiturs the next day all day long. That'll do pig. That'll do.", "created_at": "2019-08-02T02:33:37.640Z"}, {"movie_id": 10393, "review_id": "630014dc7dfda6007a619017", "author_rating": 10.0, "review_text": "**Overall : Hilarious characters and a heartwarming story perfect the formula of Major League delivering one of the best and funniest sports movies ever made.**\r\n\r\nWith all the charm of Major League and a cast of zany lovable characters, The Replacements stands out as my favorite sports movie of all time! Led by Keanu Reeves and Gene Hackman, this team of hilarious scrappy nobodies and has-beens get their shot as pros, but this goofy comedy disguises a heartwarming story as these crazy characters find redemption and family in each other. A classic in every way, The Replacements shines through its entertaining cast, excellent writing, and satisfying story anchored by one of Keanu's many iconic roles.", "created_at": "2022-08-19T22:55:24.605Z"}]