[{"movie_id": 401545, "review_id": "5d48d401a0be287cf6a13c8c", "author_rating": 6.0, "review_text": "**_Aesthetically flawless and brilliantly acted, but too melodramatic and generic for me_**\r\n\r\n>_I think there are several layers. There is the first layer of the film that is a thriller - though not necessarily in the meaning of a detective story or a film trying to surprise and confuse the viewer - but this aspect is just a pretext to plunge into the path of my characters. That's where the interest lies, in the path and the secret and the mystery of the characters. So there is this first layer, this general aspect, but if someone is really searching for a thriller, they would not find it her__e. And it was not my intention to make a thriller for the sake of making one._\r\n\r\n- Asghar Farhadi; \"Director Asghar Farhadi Interview: _Everybody Knows_\" (Justin Quinzon); _ScreenRant_ (February 15, 2019)\r\n\r\nRarely has a filmmaker been so intimately tied to a place as two-time Academy Award-winning writer/director Asghar Farhadi is to his native Iran. Since his 2003 directorial debut, _Raghs dar ghobar_ [_Dancing in the Dust_], six of his eight films have been set there, collectively mapping out the socio-political soul of the country, examining such socially-realist topics as divorce (_Raghs dar ghobar_, _Jodaeiye Nader az Simin_ [_A Separation_]), crime (_Shah-re ziba_ [_Beautiful City_], _Forushande_ [_The Salesman_]), secrets and lies (_Chaharshanbe-soori_ [_Fireworks Wednesday_], _Darbareye Elly_ [_About Elly_]), and the themes for which he's best known; class and the importance of the past in the present. In 2013, he made his first film outside Iran, _Le Passé_ [_The Past_], which was set in France, although it did feature an Iranian protagonist, and was thematically uniform with his previous work. His second such film, _Todos lo saben_ [lit. trans. _Everybody Knows It_], is set in Spain, and although it finds him working for the first time with a relatively conventional genre template, it remains thematically very much a Farhadi film.\r\n\r\nMore a dark psychological study of people under extreme pressure than the kidnapping thriller as which it's been marketed, the film examines what can happen when such pressure causes long-buried secrets to rise to the surface, how they can bring some together and tear others apart, often because of misunderstandings as to what is and what isn't common knowledge, with characters both underestimating and overestimating what others know about their lives. However, although beautifully shot and exceptionally well-acted, _Todos_ is easily the weakest film in Farhadi's filmography. Whereas his previous work is elegant, nuanced, and perfectly formed, _Todos_ clumsily falls back on clichéd genre tropes and heavy-handed melodramatic plotting, with the narrative hinging on the revelation of a secret so obvious, I'm not even sure you can call it a plot twist.\r\n\r\nThe film tells the story of Laura (Penélope Cruz), a Spanish woman living in Buenos Aires, who returns to her hometown outside Madrid with her 16-year-old daughter Irene (Carla Campra) and eight-year-old son Diego (Iván Chavero) for her sister Ana's (Inma Cuesta) wedding. Laura's husband, Alejandro (Ricardo Darín), a successful architect and recovering alcoholic, has stayed behind in Argentina due to unexpected work commitments. Laura is particularly looking forward to seeing Paco (Cruz's real-life husband, Javier Bardem), the son of the family maid, with whom she grew up and was in love for many years. Now married to local girl Bea (Bárbara Lennie), Paco co-owns a local vineyard, having bought the land from Laura at a low rate, with Antonio (Ramón Barea), Laura's bitter and drunken father, still resenting Paco's success with land to which he believes his family is entitled. That night, as the wedding guests are celebrating, there is a power outage, during which Irene disappears from her bedroom. Shortly thereafter, Laura receives a text message demanding €300,000 and warning her not to contact the police or Irene will be killed. Believing the kidnapping may have been perpetrated by the same people who kidnapped and murdered a young girl several years previously, Laura's brother-in-law Fernando (Eduard Fernández) contacts his friend Jorge (José Ángel Egido), a former cop, to begin looking into things. When he suggests the kidnapping may have been perpetrated by someone at the wedding, it doesn't take long until the family is at one another's throats, with old animosities resurfacing, and distrust spreading between them. To make matters worse, Irene is ill, and without her medication, she will die.\r\n\r\nAs one would expect from Farhadi, _Todos_ is aesthetically flawless. Shot by Pedro Almodóvar's regular cinematographer, José Luis Alcaine (_Volver_, _La piel que habito_, _Passion_), the film captures the sun-kissed Spanish countryside beautifully, with a gorgeous palette of rich browns, golds, and reds emphasising tradition and pride in the past. Drawing the audience's attention to the importance of the passage of time, the film opens by depicting the workings of a cathedral clock. However, the scene also strikes a more ominous note - the bell tower features a hole through which smaller birds can fly, but it is too small for the pigeon who also flits around the clock, trapping him inside; a visual metaphor to which we return several times. Also aesthetically impressive is the opening montage, which introduces us to a dizzying number of characters. Farhadi is at his most economical and leisurely in these quick-fire early scenes, drawing a complex web of blood relations and friendships (if this were a novel, there'd be a family tree included), whilst still creating a sense of intimacy and tight-knit community. It's also worth noting from an aesthetic perspective that although Alberto Iglesias (_Todo sobre mi madre_, _The Constant Gardner_, _Tinker Tailor Soldier Spy_) is credited as the composer, the film only features one piece of non-diegetic music, which plays over the closing credits.\r\n\r\nThematically, as with all of Farhadi's previous films, _Todos_ touches on a number of issues. Racism and class prejudice, for example, are looked at (albeit briefly) in how the family instinctively ask Paco if any of his staff at the vineyard, all immigrants, could be behind the kidnapping. Later, suspicion falls on some youths from the school where Bea works, whom she employed to film the wedding; when Jorge learns they all have petty crimes on their record, many of the family immediately assume their guilt.\r\n\r\nGiven the nature of the story, a major issue is the weight of the past on the present - seen most clearly in how Antonio still resents Paco's purchase of Laura's land and how Bea believes that Paco is still in love with Laura (when Irene disappears, there is a scene where Paco hugs Laura, and Farhadi immediately cuts to Bea watching them). More specifically, the film looks at secrets, examining not only the importance of who knows what and how secrets can sometimes bring people closer, but also looking at the more complex issue that much of what we do in any given situation is based on what we assume other people do and do not know. Set in a small community where everybody knows everybody else, Farhadi gets a lot of mileage out of revealing that what some thought were secrets were actually common knowledge (hence the title). Speaking to Slant, he states,\r\n\r\n>_because I wanted to deal with the notion of secrets, and secrets being related to the past of the characters, I had to choose a society in which people are aware of each other's pasts. If I had put my story in a big city it wouldn't have made sense. People don't know where the others come from; they aren't aware of each other's background. I wanted it to be in a small community in which people pretend that they don't know anything about the others, but in reality they know everything._\r\n\r\nHowever, it's in relation to secrets where the narrative begins to fall down. Introducing a huge number of red herrings, false leads, and dead ends, Farhadi uses the revelation of secrets as a structural principle, much as he has in his past work. Some of these revelations could be seen as plot twists (such as how Alejandro's construction business is doing), some not so much (why Paco and Bea have no children, for example). The film builds the tension reasonably well until about two-thirds of the way through, when it unveils the biggest secret/plot-twist, and the moment upon which the entire last act hinges. However, it's a revelation so telegraphed, when the scene came, I literally had to consciously remind myself that the character involved was unaware of the information being shared - \"hang on, why is he flipping out about this, he already knows...oh, wait, that's right, he doesn't.\" The actors play the hell out of the scene, but Farhadi is so self-serious about the profundity of the moment that it almost has a comic effect, like a magician too interested in the audience's reaction to a trick to notice he is screwing the trick up.\r\n\r\nThe film also strays into outright melodrama far more than in any of Farhadi's previous work. The above-mentioned twist is one example. Another is that there's a late-night thunderstorm (although, thankfully, no one has sex in front of a raging fireplace during it). The more the film goes on, and the more twists and turns Farhadi throws into the mix, the less I cared about any of the characters, and the more clumsy his script becomes, something I would never say about any of his previous work, which is uniformly graceful and light-handed. Even his only flirtation with genre prior to this, _Darbareye Elly_, has nuance and grace utterly lacking in the more heavy-handed deterministic plotting of _Todos_. The fact that Irene needs medication or will die in a couple of days is a particularly egregious example of this; a detail shoehorned into the narrative to arbitrarily create extra time-sensitive tension. It's a clichéd genre trope more suited to something like _Law & Order_ (\"_the girl is in a coffin, and only has six hours more oxygen_\"), that is, quite frankly, beneath an _auteur_ of Farhadi's calibre.\r\n\r\nIndeed, speaking of genre, how he approaches the kidnapping plot itself is a little unusual. Obviously, the film is not about the kidnapping, it's about how people react to it. However, even with that in mind, he sketches things very thinly. When the kidnappers are revealed, for example, apart from a couple of throwaway lines, he completely ignores what motivated them to do it. Additionally, there are so many twists, so many secrets, so many false leads, and so many scenes of characters having moments of portentous revelation, it becomes narrative chaos - like a pizza with every single available topping. Also, Farhadi never really connects the kidnapping plot to the secrets of the past, so although Irene's abduction does serve as the impetus for the characters to come clean about various issues, it all seems so random that you could imagine any crisis having similar results.\r\n\r\nAnother issue is that the central conflicts aren't as well-grounded in the milieu as in Farhadi's Iran-set work, where the issues explored in each film arise directly from that film's immediate environment. This was also a problem in _La Passé_, but it's more pronounced here (compare _Todos_ to something like Francesco Rosi's _Cronaca di una morte annuciata_ (1987), for example, in which the tensions at the heart of the film are indistinguishable from their social context). This could be because Farhadi is simply unfamiliar with the environment (like _La Passé_, he wrote the script in Persian, and had it translated), but whatever the case, in comparison to the nuance of his previous work, _Todos_ feels like a step backwards. For example, the kidnapping plot, by definition, suggests a villain with a motive, whereas one of the more striking aspects of his _oeuvre_ to date is the lack of antagonists, and the difficulty in assigning the majority of blame to any one person. Additionally, what often went relatively unspoken (class resentment in _Jodaeiye Nader az Simin_, for example, or domestic violence in _Darbareye Elly_), is here much more overt, with the characters presented in a more open manner, their prejudices, hopes, and desires more explicit, and thus far less interesting.\r\n\r\nI didn't hate _Todos lo saben_, but given the pedigree of the director, it did leave me massively disappointed, especially in how he falls back on genre clichés and melodramatic tropes. Farhadi is on his game aesthetically, and, once again dealing with issues of class and the destructive power of the past, so too thematically. The problem is the narrative. He piles so much on that I just stopped caring, as the plot lurched from secret/twist to secret/twist to secret/twist. There's nothing wrong with grafting one's thematic preoccupations onto a genre framework, of course; filmmakers as varied as Alfred Hitchcock, John Ford, Michael Mann, David Fincher, and Christopher Nolan work within genre conventions, but are very much auteurs. However, when doing so, one must pay attention to the genre elements of one's film or they will be overwhelmed and seem like a poorly thought-out distraction, bumping against the themes rather than organically co-existing with them. That's exactly what happens in _Todos_. Nevertheless, Farhadi remains a supremely talented filmmaker, and his worst is still better than a lot of director's best. Beautiful to look at, and thematically interesting, the film is, unfortunately, let down by a disappointing narrative.", "created_at": "2019-08-06T01:12:33.845Z"}, {"movie_id": 401545, "review_id": "5d48d401a0be287cf6a13c8c", "author_rating": 6.0, "review_text": "**_Aesthetically flawless and brilliantly acted, but too melodramatic and generic for me_**\r\n\r\n>_I think there are several layers. There is the first layer of the film that is a thriller - though not necessarily in the meaning of a detective story or a film trying to surprise and confuse the viewer - but this aspect is just a pretext to plunge into the path of my characters. That's where the interest lies, in the path and the secret and the mystery of the characters. So there is this first layer, this general aspect, but if someone is really searching for a thriller, they would not find it her__e. And it was not my intention to make a thriller for the sake of making one._\r\n\r\n- Asghar Farhadi; \"Director Asghar Farhadi Interview: _Everybody Knows_\" (Justin Quinzon); _ScreenRant_ (February 15, 2019)\r\n\r\nRarely has a filmmaker been so intimately tied to a place as two-time Academy Award-winning writer/director Asghar Farhadi is to his native Iran. Since his 2003 directorial debut, _Raghs dar ghobar_ [_Dancing in the Dust_], six of his eight films have been set there, collectively mapping out the socio-political soul of the country, examining such socially-realist topics as divorce (_Raghs dar ghobar_, _Jodaeiye Nader az Simin_ [_A Separation_]), crime (_Shah-re ziba_ [_Beautiful City_], _Forushande_ [_The Salesman_]), secrets and lies (_Chaharshanbe-soori_ [_Fireworks Wednesday_], _Darbareye Elly_ [_About Elly_]), and the themes for which he's best known; class and the importance of the past in the present. In 2013, he made his first film outside Iran, _Le Passé_ [_The Past_], which was set in France, although it did feature an Iranian protagonist, and was thematically uniform with his previous work. His second such film, _Todos lo saben_ [lit. trans. _Everybody Knows It_], is set in Spain, and although it finds him working for the first time with a relatively conventional genre template, it remains thematically very much a Farhadi film.\r\n\r\nMore a dark psychological study of people under extreme pressure than the kidnapping thriller as which it's been marketed, the film examines what can happen when such pressure causes long-buried secrets to rise to the surface, how they can bring some together and tear others apart, often because of misunderstandings as to what is and what isn't common knowledge, with characters both underestimating and overestimating what others know about their lives. However, although beautifully shot and exceptionally well-acted, _Todos_ is easily the weakest film in Farhadi's filmography. Whereas his previous work is elegant, nuanced, and perfectly formed, _Todos_ clumsily falls back on clichéd genre tropes and heavy-handed melodramatic plotting, with the narrative hinging on the revelation of a secret so obvious, I'm not even sure you can call it a plot twist.\r\n\r\nThe film tells the story of Laura (Penélope Cruz), a Spanish woman living in Buenos Aires, who returns to her hometown outside Madrid with her 16-year-old daughter Irene (Carla Campra) and eight-year-old son Diego (Iván Chavero) for her sister Ana's (Inma Cuesta) wedding. Laura's husband, Alejandro (Ricardo Darín), a successful architect and recovering alcoholic, has stayed behind in Argentina due to unexpected work commitments. Laura is particularly looking forward to seeing Paco (Cruz's real-life husband, Javier Bardem), the son of the family maid, with whom she grew up and was in love for many years. Now married to local girl Bea (Bárbara Lennie), Paco co-owns a local vineyard, having bought the land from Laura at a low rate, with Antonio (Ramón Barea), Laura's bitter and drunken father, still resenting Paco's success with land to which he believes his family is entitled. That night, as the wedding guests are celebrating, there is a power outage, during which Irene disappears from her bedroom. Shortly thereafter, Laura receives a text message demanding €300,000 and warning her not to contact the police or Irene will be killed. Believing the kidnapping may have been perpetrated by the same people who kidnapped and murdered a young girl several years previously, Laura's brother-in-law Fernando (Eduard Fernández) contacts his friend Jorge (José Ángel Egido), a former cop, to begin looking into things. When he suggests the kidnapping may have been perpetrated by someone at the wedding, it doesn't take long until the family is at one another's throats, with old animosities resurfacing, and distrust spreading between them. To make matters worse, Irene is ill, and without her medication, she will die.\r\n\r\nAs one would expect from Farhadi, _Todos_ is aesthetically flawless. Shot by Pedro Almodóvar's regular cinematographer, José Luis Alcaine (_Volver_, _La piel que habito_, _Passion_), the film captures the sun-kissed Spanish countryside beautifully, with a gorgeous palette of rich browns, golds, and reds emphasising tradition and pride in the past. Drawing the audience's attention to the importance of the passage of time, the film opens by depicting the workings of a cathedral clock. However, the scene also strikes a more ominous note - the bell tower features a hole through which smaller birds can fly, but it is too small for the pigeon who also flits around the clock, trapping him inside; a visual metaphor to which we return several times. Also aesthetically impressive is the opening montage, which introduces us to a dizzying number of characters. Farhadi is at his most economical and leisurely in these quick-fire early scenes, drawing a complex web of blood relations and friendships (if this were a novel, there'd be a family tree included), whilst still creating a sense of intimacy and tight-knit community. It's also worth noting from an aesthetic perspective that although Alberto Iglesias (_Todo sobre mi madre_, _The Constant Gardner_, _Tinker Tailor Soldier Spy_) is credited as the composer, the film only features one piece of non-diegetic music, which plays over the closing credits.\r\n\r\nThematically, as with all of Farhadi's previous films, _Todos_ touches on a number of issues. Racism and class prejudice, for example, are looked at (albeit briefly) in how the family instinctively ask Paco if any of his staff at the vineyard, all immigrants, could be behind the kidnapping. Later, suspicion falls on some youths from the school where Bea works, whom she employed to film the wedding; when Jorge learns they all have petty crimes on their record, many of the family immediately assume their guilt.\r\n\r\nGiven the nature of the story, a major issue is the weight of the past on the present - seen most clearly in how Antonio still resents Paco's purchase of Laura's land and how Bea believes that Paco is still in love with Laura (when Irene disappears, there is a scene where Paco hugs Laura, and Farhadi immediately cuts to Bea watching them). More specifically, the film looks at secrets, examining not only the importance of who knows what and how secrets can sometimes bring people closer, but also looking at the more complex issue that much of what we do in any given situation is based on what we assume other people do and do not know. Set in a small community where everybody knows everybody else, Farhadi gets a lot of mileage out of revealing that what some thought were secrets were actually common knowledge (hence the title). Speaking to Slant, he states,\r\n\r\n>_because I wanted to deal with the notion of secrets, and secrets being related to the past of the characters, I had to choose a society in which people are aware of each other's pasts. If I had put my story in a big city it wouldn't have made sense. People don't know where the others come from; they aren't aware of each other's background. I wanted it to be in a small community in which people pretend that they don't know anything about the others, but in reality they know everything._\r\n\r\nHowever, it's in relation to secrets where the narrative begins to fall down. Introducing a huge number of red herrings, false leads, and dead ends, Farhadi uses the revelation of secrets as a structural principle, much as he has in his past work. Some of these revelations could be seen as plot twists (such as how Alejandro's construction business is doing), some not so much (why Paco and Bea have no children, for example). The film builds the tension reasonably well until about two-thirds of the way through, when it unveils the biggest secret/plot-twist, and the moment upon which the entire last act hinges. However, it's a revelation so telegraphed, when the scene came, I literally had to consciously remind myself that the character involved was unaware of the information being shared - \"hang on, why is he flipping out about this, he already knows...oh, wait, that's right, he doesn't.\" The actors play the hell out of the scene, but Farhadi is so self-serious about the profundity of the moment that it almost has a comic effect, like a magician too interested in the audience's reaction to a trick to notice he is screwing the trick up.\r\n\r\nThe film also strays into outright melodrama far more than in any of Farhadi's previous work. The above-mentioned twist is one example. Another is that there's a late-night thunderstorm (although, thankfully, no one has sex in front of a raging fireplace during it). The more the film goes on, and the more twists and turns Farhadi throws into the mix, the less I cared about any of the characters, and the more clumsy his script becomes, something I would never say about any of his previous work, which is uniformly graceful and light-handed. Even his only flirtation with genre prior to this, _Darbareye Elly_, has nuance and grace utterly lacking in the more heavy-handed deterministic plotting of _Todos_. The fact that Irene needs medication or will die in a couple of days is a particularly egregious example of this; a detail shoehorned into the narrative to arbitrarily create extra time-sensitive tension. It's a clichéd genre trope more suited to something like _Law & Order_ (\"_the girl is in a coffin, and only has six hours more oxygen_\"), that is, quite frankly, beneath an _auteur_ of Farhadi's calibre.\r\n\r\nIndeed, speaking of genre, how he approaches the kidnapping plot itself is a little unusual. Obviously, the film is not about the kidnapping, it's about how people react to it. However, even with that in mind, he sketches things very thinly. When the kidnappers are revealed, for example, apart from a couple of throwaway lines, he completely ignores what motivated them to do it. Additionally, there are so many twists, so many secrets, so many false leads, and so many scenes of characters having moments of portentous revelation, it becomes narrative chaos - like a pizza with every single available topping. Also, Farhadi never really connects the kidnapping plot to the secrets of the past, so although Irene's abduction does serve as the impetus for the characters to come clean about various issues, it all seems so random that you could imagine any crisis having similar results.\r\n\r\nAnother issue is that the central conflicts aren't as well-grounded in the milieu as in Farhadi's Iran-set work, where the issues explored in each film arise directly from that film's immediate environment. This was also a problem in _La Passé_, but it's more pronounced here (compare _Todos_ to something like Francesco Rosi's _Cronaca di una morte annuciata_ (1987), for example, in which the tensions at the heart of the film are indistinguishable from their social context). This could be because Farhadi is simply unfamiliar with the environment (like _La Passé_, he wrote the script in Persian, and had it translated), but whatever the case, in comparison to the nuance of his previous work, _Todos_ feels like a step backwards. For example, the kidnapping plot, by definition, suggests a villain with a motive, whereas one of the more striking aspects of his _oeuvre_ to date is the lack of antagonists, and the difficulty in assigning the majority of blame to any one person. Additionally, what often went relatively unspoken (class resentment in _Jodaeiye Nader az Simin_, for example, or domestic violence in _Darbareye Elly_), is here much more overt, with the characters presented in a more open manner, their prejudices, hopes, and desires more explicit, and thus far less interesting.\r\n\r\nI didn't hate _Todos lo saben_, but given the pedigree of the director, it did leave me massively disappointed, especially in how he falls back on genre clichés and melodramatic tropes. Farhadi is on his game aesthetically, and, once again dealing with issues of class and the destructive power of the past, so too thematically. The problem is the narrative. He piles so much on that I just stopped caring, as the plot lurched from secret/twist to secret/twist to secret/twist. There's nothing wrong with grafting one's thematic preoccupations onto a genre framework, of course; filmmakers as varied as Alfred Hitchcock, John Ford, Michael Mann, David Fincher, and Christopher Nolan work within genre conventions, but are very much auteurs. However, when doing so, one must pay attention to the genre elements of one's film or they will be overwhelmed and seem like a poorly thought-out distraction, bumping against the themes rather than organically co-existing with them. That's exactly what happens in _Todos_. Nevertheless, Farhadi remains a supremely talented filmmaker, and his worst is still better than a lot of director's best. Beautiful to look at, and thematically interesting, the film is, unfortunately, let down by a disappointing narrative.", "created_at": "2019-08-06T01:12:33.845Z"}, {"movie_id": 401545, "review_id": "5d48d401a0be287cf6a13c8c", "author_rating": 6.0, "review_text": "**_Aesthetically flawless and brilliantly acted, but too melodramatic and generic for me_**\r\n\r\n>_I think there are several layers. There is the first layer of the film that is a thriller - though not necessarily in the meaning of a detective story or a film trying to surprise and confuse the viewer - but this aspect is just a pretext to plunge into the path of my characters. That's where the interest lies, in the path and the secret and the mystery of the characters. So there is this first layer, this general aspect, but if someone is really searching for a thriller, they would not find it her__e. And it was not my intention to make a thriller for the sake of making one._\r\n\r\n- Asghar Farhadi; \"Director Asghar Farhadi Interview: _Everybody Knows_\" (Justin Quinzon); _ScreenRant_ (February 15, 2019)\r\n\r\nRarely has a filmmaker been so intimately tied to a place as two-time Academy Award-winning writer/director Asghar Farhadi is to his native Iran. Since his 2003 directorial debut, _Raghs dar ghobar_ [_Dancing in the Dust_], six of his eight films have been set there, collectively mapping out the socio-political soul of the country, examining such socially-realist topics as divorce (_Raghs dar ghobar_, _Jodaeiye Nader az Simin_ [_A Separation_]), crime (_Shah-re ziba_ [_Beautiful City_], _Forushande_ [_The Salesman_]), secrets and lies (_Chaharshanbe-soori_ [_Fireworks Wednesday_], _Darbareye Elly_ [_About Elly_]), and the themes for which he's best known; class and the importance of the past in the present. In 2013, he made his first film outside Iran, _Le Passé_ [_The Past_], which was set in France, although it did feature an Iranian protagonist, and was thematically uniform with his previous work. His second such film, _Todos lo saben_ [lit. trans. _Everybody Knows It_], is set in Spain, and although it finds him working for the first time with a relatively conventional genre template, it remains thematically very much a Farhadi film.\r\n\r\nMore a dark psychological study of people under extreme pressure than the kidnapping thriller as which it's been marketed, the film examines what can happen when such pressure causes long-buried secrets to rise to the surface, how they can bring some together and tear others apart, often because of misunderstandings as to what is and what isn't common knowledge, with characters both underestimating and overestimating what others know about their lives. However, although beautifully shot and exceptionally well-acted, _Todos_ is easily the weakest film in Farhadi's filmography. Whereas his previous work is elegant, nuanced, and perfectly formed, _Todos_ clumsily falls back on clichéd genre tropes and heavy-handed melodramatic plotting, with the narrative hinging on the revelation of a secret so obvious, I'm not even sure you can call it a plot twist.\r\n\r\nThe film tells the story of Laura (Penélope Cruz), a Spanish woman living in Buenos Aires, who returns to her hometown outside Madrid with her 16-year-old daughter Irene (Carla Campra) and eight-year-old son Diego (Iván Chavero) for her sister Ana's (Inma Cuesta) wedding. Laura's husband, Alejandro (Ricardo Darín), a successful architect and recovering alcoholic, has stayed behind in Argentina due to unexpected work commitments. Laura is particularly looking forward to seeing Paco (Cruz's real-life husband, Javier Bardem), the son of the family maid, with whom she grew up and was in love for many years. Now married to local girl Bea (Bárbara Lennie), Paco co-owns a local vineyard, having bought the land from Laura at a low rate, with Antonio (Ramón Barea), Laura's bitter and drunken father, still resenting Paco's success with land to which he believes his family is entitled. That night, as the wedding guests are celebrating, there is a power outage, during which Irene disappears from her bedroom. Shortly thereafter, Laura receives a text message demanding €300,000 and warning her not to contact the police or Irene will be killed. Believing the kidnapping may have been perpetrated by the same people who kidnapped and murdered a young girl several years previously, Laura's brother-in-law Fernando (Eduard Fernández) contacts his friend Jorge (José Ángel Egido), a former cop, to begin looking into things. When he suggests the kidnapping may have been perpetrated by someone at the wedding, it doesn't take long until the family is at one another's throats, with old animosities resurfacing, and distrust spreading between them. To make matters worse, Irene is ill, and without her medication, she will die.\r\n\r\nAs one would expect from Farhadi, _Todos_ is aesthetically flawless. Shot by Pedro Almodóvar's regular cinematographer, José Luis Alcaine (_Volver_, _La piel que habito_, _Passion_), the film captures the sun-kissed Spanish countryside beautifully, with a gorgeous palette of rich browns, golds, and reds emphasising tradition and pride in the past. Drawing the audience's attention to the importance of the passage of time, the film opens by depicting the workings of a cathedral clock. However, the scene also strikes a more ominous note - the bell tower features a hole through which smaller birds can fly, but it is too small for the pigeon who also flits around the clock, trapping him inside; a visual metaphor to which we return several times. Also aesthetically impressive is the opening montage, which introduces us to a dizzying number of characters. Farhadi is at his most economical and leisurely in these quick-fire early scenes, drawing a complex web of blood relations and friendships (if this were a novel, there'd be a family tree included), whilst still creating a sense of intimacy and tight-knit community. It's also worth noting from an aesthetic perspective that although Alberto Iglesias (_Todo sobre mi madre_, _The Constant Gardner_, _Tinker Tailor Soldier Spy_) is credited as the composer, the film only features one piece of non-diegetic music, which plays over the closing credits.\r\n\r\nThematically, as with all of Farhadi's previous films, _Todos_ touches on a number of issues. Racism and class prejudice, for example, are looked at (albeit briefly) in how the family instinctively ask Paco if any of his staff at the vineyard, all immigrants, could be behind the kidnapping. Later, suspicion falls on some youths from the school where Bea works, whom she employed to film the wedding; when Jorge learns they all have petty crimes on their record, many of the family immediately assume their guilt.\r\n\r\nGiven the nature of the story, a major issue is the weight of the past on the present - seen most clearly in how Antonio still resents Paco's purchase of Laura's land and how Bea believes that Paco is still in love with Laura (when Irene disappears, there is a scene where Paco hugs Laura, and Farhadi immediately cuts to Bea watching them). More specifically, the film looks at secrets, examining not only the importance of who knows what and how secrets can sometimes bring people closer, but also looking at the more complex issue that much of what we do in any given situation is based on what we assume other people do and do not know. Set in a small community where everybody knows everybody else, Farhadi gets a lot of mileage out of revealing that what some thought were secrets were actually common knowledge (hence the title). Speaking to Slant, he states,\r\n\r\n>_because I wanted to deal with the notion of secrets, and secrets being related to the past of the characters, I had to choose a society in which people are aware of each other's pasts. If I had put my story in a big city it wouldn't have made sense. People don't know where the others come from; they aren't aware of each other's background. I wanted it to be in a small community in which people pretend that they don't know anything about the others, but in reality they know everything._\r\n\r\nHowever, it's in relation to secrets where the narrative begins to fall down. Introducing a huge number of red herrings, false leads, and dead ends, Farhadi uses the revelation of secrets as a structural principle, much as he has in his past work. Some of these revelations could be seen as plot twists (such as how Alejandro's construction business is doing), some not so much (why Paco and Bea have no children, for example). The film builds the tension reasonably well until about two-thirds of the way through, when it unveils the biggest secret/plot-twist, and the moment upon which the entire last act hinges. However, it's a revelation so telegraphed, when the scene came, I literally had to consciously remind myself that the character involved was unaware of the information being shared - \"hang on, why is he flipping out about this, he already knows...oh, wait, that's right, he doesn't.\" The actors play the hell out of the scene, but Farhadi is so self-serious about the profundity of the moment that it almost has a comic effect, like a magician too interested in the audience's reaction to a trick to notice he is screwing the trick up.\r\n\r\nThe film also strays into outright melodrama far more than in any of Farhadi's previous work. The above-mentioned twist is one example. Another is that there's a late-night thunderstorm (although, thankfully, no one has sex in front of a raging fireplace during it). The more the film goes on, and the more twists and turns Farhadi throws into the mix, the less I cared about any of the characters, and the more clumsy his script becomes, something I would never say about any of his previous work, which is uniformly graceful and light-handed. Even his only flirtation with genre prior to this, _Darbareye Elly_, has nuance and grace utterly lacking in the more heavy-handed deterministic plotting of _Todos_. The fact that Irene needs medication or will die in a couple of days is a particularly egregious example of this; a detail shoehorned into the narrative to arbitrarily create extra time-sensitive tension. It's a clichéd genre trope more suited to something like _Law & Order_ (\"_the girl is in a coffin, and only has six hours more oxygen_\"), that is, quite frankly, beneath an _auteur_ of Farhadi's calibre.\r\n\r\nIndeed, speaking of genre, how he approaches the kidnapping plot itself is a little unusual. Obviously, the film is not about the kidnapping, it's about how people react to it. However, even with that in mind, he sketches things very thinly. When the kidnappers are revealed, for example, apart from a couple of throwaway lines, he completely ignores what motivated them to do it. Additionally, there are so many twists, so many secrets, so many false leads, and so many scenes of characters having moments of portentous revelation, it becomes narrative chaos - like a pizza with every single available topping. Also, Farhadi never really connects the kidnapping plot to the secrets of the past, so although Irene's abduction does serve as the impetus for the characters to come clean about various issues, it all seems so random that you could imagine any crisis having similar results.\r\n\r\nAnother issue is that the central conflicts aren't as well-grounded in the milieu as in Farhadi's Iran-set work, where the issues explored in each film arise directly from that film's immediate environment. This was also a problem in _La Passé_, but it's more pronounced here (compare _Todos_ to something like Francesco Rosi's _Cronaca di una morte annuciata_ (1987), for example, in which the tensions at the heart of the film are indistinguishable from their social context). This could be because Farhadi is simply unfamiliar with the environment (like _La Passé_, he wrote the script in Persian, and had it translated), but whatever the case, in comparison to the nuance of his previous work, _Todos_ feels like a step backwards. For example, the kidnapping plot, by definition, suggests a villain with a motive, whereas one of the more striking aspects of his _oeuvre_ to date is the lack of antagonists, and the difficulty in assigning the majority of blame to any one person. Additionally, what often went relatively unspoken (class resentment in _Jodaeiye Nader az Simin_, for example, or domestic violence in _Darbareye Elly_), is here much more overt, with the characters presented in a more open manner, their prejudices, hopes, and desires more explicit, and thus far less interesting.\r\n\r\nI didn't hate _Todos lo saben_, but given the pedigree of the director, it did leave me massively disappointed, especially in how he falls back on genre clichés and melodramatic tropes. Farhadi is on his game aesthetically, and, once again dealing with issues of class and the destructive power of the past, so too thematically. The problem is the narrative. He piles so much on that I just stopped caring, as the plot lurched from secret/twist to secret/twist to secret/twist. There's nothing wrong with grafting one's thematic preoccupations onto a genre framework, of course; filmmakers as varied as Alfred Hitchcock, John Ford, Michael Mann, David Fincher, and Christopher Nolan work within genre conventions, but are very much auteurs. However, when doing so, one must pay attention to the genre elements of one's film or they will be overwhelmed and seem like a poorly thought-out distraction, bumping against the themes rather than organically co-existing with them. That's exactly what happens in _Todos_. Nevertheless, Farhadi remains a supremely talented filmmaker, and his worst is still better than a lot of director's best. Beautiful to look at, and thematically interesting, the film is, unfortunately, let down by a disappointing narrative.", "created_at": "2019-08-06T01:12:33.845Z"}, {"movie_id": 401545, "review_id": "5d48d401a0be287cf6a13c8c", "author_rating": 6.0, "review_text": "**_Aesthetically flawless and brilliantly acted, but too melodramatic and generic for me_**\r\n\r\n>_I think there are several layers. There is the first layer of the film that is a thriller - though not necessarily in the meaning of a detective story or a film trying to surprise and confuse the viewer - but this aspect is just a pretext to plunge into the path of my characters. That's where the interest lies, in the path and the secret and the mystery of the characters. So there is this first layer, this general aspect, but if someone is really searching for a thriller, they would not find it her__e. And it was not my intention to make a thriller for the sake of making one._\r\n\r\n- Asghar Farhadi; \"Director Asghar Farhadi Interview: _Everybody Knows_\" (Justin Quinzon); _ScreenRant_ (February 15, 2019)\r\n\r\nRarely has a filmmaker been so intimately tied to a place as two-time Academy Award-winning writer/director Asghar Farhadi is to his native Iran. Since his 2003 directorial debut, _Raghs dar ghobar_ [_Dancing in the Dust_], six of his eight films have been set there, collectively mapping out the socio-political soul of the country, examining such socially-realist topics as divorce (_Raghs dar ghobar_, _Jodaeiye Nader az Simin_ [_A Separation_]), crime (_Shah-re ziba_ [_Beautiful City_], _Forushande_ [_The Salesman_]), secrets and lies (_Chaharshanbe-soori_ [_Fireworks Wednesday_], _Darbareye Elly_ [_About Elly_]), and the themes for which he's best known; class and the importance of the past in the present. In 2013, he made his first film outside Iran, _Le Passé_ [_The Past_], which was set in France, although it did feature an Iranian protagonist, and was thematically uniform with his previous work. His second such film, _Todos lo saben_ [lit. trans. _Everybody Knows It_], is set in Spain, and although it finds him working for the first time with a relatively conventional genre template, it remains thematically very much a Farhadi film.\r\n\r\nMore a dark psychological study of people under extreme pressure than the kidnapping thriller as which it's been marketed, the film examines what can happen when such pressure causes long-buried secrets to rise to the surface, how they can bring some together and tear others apart, often because of misunderstandings as to what is and what isn't common knowledge, with characters both underestimating and overestimating what others know about their lives. However, although beautifully shot and exceptionally well-acted, _Todos_ is easily the weakest film in Farhadi's filmography. Whereas his previous work is elegant, nuanced, and perfectly formed, _Todos_ clumsily falls back on clichéd genre tropes and heavy-handed melodramatic plotting, with the narrative hinging on the revelation of a secret so obvious, I'm not even sure you can call it a plot twist.\r\n\r\nThe film tells the story of Laura (Penélope Cruz), a Spanish woman living in Buenos Aires, who returns to her hometown outside Madrid with her 16-year-old daughter Irene (Carla Campra) and eight-year-old son Diego (Iván Chavero) for her sister Ana's (Inma Cuesta) wedding. Laura's husband, Alejandro (Ricardo Darín), a successful architect and recovering alcoholic, has stayed behind in Argentina due to unexpected work commitments. Laura is particularly looking forward to seeing Paco (Cruz's real-life husband, Javier Bardem), the son of the family maid, with whom she grew up and was in love for many years. Now married to local girl Bea (Bárbara Lennie), Paco co-owns a local vineyard, having bought the land from Laura at a low rate, with Antonio (Ramón Barea), Laura's bitter and drunken father, still resenting Paco's success with land to which he believes his family is entitled. That night, as the wedding guests are celebrating, there is a power outage, during which Irene disappears from her bedroom. Shortly thereafter, Laura receives a text message demanding €300,000 and warning her not to contact the police or Irene will be killed. Believing the kidnapping may have been perpetrated by the same people who kidnapped and murdered a young girl several years previously, Laura's brother-in-law Fernando (Eduard Fernández) contacts his friend Jorge (José Ángel Egido), a former cop, to begin looking into things. When he suggests the kidnapping may have been perpetrated by someone at the wedding, it doesn't take long until the family is at one another's throats, with old animosities resurfacing, and distrust spreading between them. To make matters worse, Irene is ill, and without her medication, she will die.\r\n\r\nAs one would expect from Farhadi, _Todos_ is aesthetically flawless. Shot by Pedro Almodóvar's regular cinematographer, José Luis Alcaine (_Volver_, _La piel que habito_, _Passion_), the film captures the sun-kissed Spanish countryside beautifully, with a gorgeous palette of rich browns, golds, and reds emphasising tradition and pride in the past. Drawing the audience's attention to the importance of the passage of time, the film opens by depicting the workings of a cathedral clock. However, the scene also strikes a more ominous note - the bell tower features a hole through which smaller birds can fly, but it is too small for the pigeon who also flits around the clock, trapping him inside; a visual metaphor to which we return several times. Also aesthetically impressive is the opening montage, which introduces us to a dizzying number of characters. Farhadi is at his most economical and leisurely in these quick-fire early scenes, drawing a complex web of blood relations and friendships (if this were a novel, there'd be a family tree included), whilst still creating a sense of intimacy and tight-knit community. It's also worth noting from an aesthetic perspective that although Alberto Iglesias (_Todo sobre mi madre_, _The Constant Gardner_, _Tinker Tailor Soldier Spy_) is credited as the composer, the film only features one piece of non-diegetic music, which plays over the closing credits.\r\n\r\nThematically, as with all of Farhadi's previous films, _Todos_ touches on a number of issues. Racism and class prejudice, for example, are looked at (albeit briefly) in how the family instinctively ask Paco if any of his staff at the vineyard, all immigrants, could be behind the kidnapping. Later, suspicion falls on some youths from the school where Bea works, whom she employed to film the wedding; when Jorge learns they all have petty crimes on their record, many of the family immediately assume their guilt.\r\n\r\nGiven the nature of the story, a major issue is the weight of the past on the present - seen most clearly in how Antonio still resents Paco's purchase of Laura's land and how Bea believes that Paco is still in love with Laura (when Irene disappears, there is a scene where Paco hugs Laura, and Farhadi immediately cuts to Bea watching them). More specifically, the film looks at secrets, examining not only the importance of who knows what and how secrets can sometimes bring people closer, but also looking at the more complex issue that much of what we do in any given situation is based on what we assume other people do and do not know. Set in a small community where everybody knows everybody else, Farhadi gets a lot of mileage out of revealing that what some thought were secrets were actually common knowledge (hence the title). Speaking to Slant, he states,\r\n\r\n>_because I wanted to deal with the notion of secrets, and secrets being related to the past of the characters, I had to choose a society in which people are aware of each other's pasts. If I had put my story in a big city it wouldn't have made sense. People don't know where the others come from; they aren't aware of each other's background. I wanted it to be in a small community in which people pretend that they don't know anything about the others, but in reality they know everything._\r\n\r\nHowever, it's in relation to secrets where the narrative begins to fall down. Introducing a huge number of red herrings, false leads, and dead ends, Farhadi uses the revelation of secrets as a structural principle, much as he has in his past work. Some of these revelations could be seen as plot twists (such as how Alejandro's construction business is doing), some not so much (why Paco and Bea have no children, for example). The film builds the tension reasonably well until about two-thirds of the way through, when it unveils the biggest secret/plot-twist, and the moment upon which the entire last act hinges. However, it's a revelation so telegraphed, when the scene came, I literally had to consciously remind myself that the character involved was unaware of the information being shared - \"hang on, why is he flipping out about this, he already knows...oh, wait, that's right, he doesn't.\" The actors play the hell out of the scene, but Farhadi is so self-serious about the profundity of the moment that it almost has a comic effect, like a magician too interested in the audience's reaction to a trick to notice he is screwing the trick up.\r\n\r\nThe film also strays into outright melodrama far more than in any of Farhadi's previous work. The above-mentioned twist is one example. Another is that there's a late-night thunderstorm (although, thankfully, no one has sex in front of a raging fireplace during it). The more the film goes on, and the more twists and turns Farhadi throws into the mix, the less I cared about any of the characters, and the more clumsy his script becomes, something I would never say about any of his previous work, which is uniformly graceful and light-handed. Even his only flirtation with genre prior to this, _Darbareye Elly_, has nuance and grace utterly lacking in the more heavy-handed deterministic plotting of _Todos_. The fact that Irene needs medication or will die in a couple of days is a particularly egregious example of this; a detail shoehorned into the narrative to arbitrarily create extra time-sensitive tension. It's a clichéd genre trope more suited to something like _Law & Order_ (\"_the girl is in a coffin, and only has six hours more oxygen_\"), that is, quite frankly, beneath an _auteur_ of Farhadi's calibre.\r\n\r\nIndeed, speaking of genre, how he approaches the kidnapping plot itself is a little unusual. Obviously, the film is not about the kidnapping, it's about how people react to it. However, even with that in mind, he sketches things very thinly. When the kidnappers are revealed, for example, apart from a couple of throwaway lines, he completely ignores what motivated them to do it. Additionally, there are so many twists, so many secrets, so many false leads, and so many scenes of characters having moments of portentous revelation, it becomes narrative chaos - like a pizza with every single available topping. Also, Farhadi never really connects the kidnapping plot to the secrets of the past, so although Irene's abduction does serve as the impetus for the characters to come clean about various issues, it all seems so random that you could imagine any crisis having similar results.\r\n\r\nAnother issue is that the central conflicts aren't as well-grounded in the milieu as in Farhadi's Iran-set work, where the issues explored in each film arise directly from that film's immediate environment. This was also a problem in _La Passé_, but it's more pronounced here (compare _Todos_ to something like Francesco Rosi's _Cronaca di una morte annuciata_ (1987), for example, in which the tensions at the heart of the film are indistinguishable from their social context). This could be because Farhadi is simply unfamiliar with the environment (like _La Passé_, he wrote the script in Persian, and had it translated), but whatever the case, in comparison to the nuance of his previous work, _Todos_ feels like a step backwards. For example, the kidnapping plot, by definition, suggests a villain with a motive, whereas one of the more striking aspects of his _oeuvre_ to date is the lack of antagonists, and the difficulty in assigning the majority of blame to any one person. Additionally, what often went relatively unspoken (class resentment in _Jodaeiye Nader az Simin_, for example, or domestic violence in _Darbareye Elly_), is here much more overt, with the characters presented in a more open manner, their prejudices, hopes, and desires more explicit, and thus far less interesting.\r\n\r\nI didn't hate _Todos lo saben_, but given the pedigree of the director, it did leave me massively disappointed, especially in how he falls back on genre clichés and melodramatic tropes. Farhadi is on his game aesthetically, and, once again dealing with issues of class and the destructive power of the past, so too thematically. The problem is the narrative. He piles so much on that I just stopped caring, as the plot lurched from secret/twist to secret/twist to secret/twist. There's nothing wrong with grafting one's thematic preoccupations onto a genre framework, of course; filmmakers as varied as Alfred Hitchcock, John Ford, Michael Mann, David Fincher, and Christopher Nolan work within genre conventions, but are very much auteurs. However, when doing so, one must pay attention to the genre elements of one's film or they will be overwhelmed and seem like a poorly thought-out distraction, bumping against the themes rather than organically co-existing with them. That's exactly what happens in _Todos_. Nevertheless, Farhadi remains a supremely talented filmmaker, and his worst is still better than a lot of director's best. Beautiful to look at, and thematically interesting, the film is, unfortunately, let down by a disappointing narrative.", "created_at": "2019-08-06T01:12:33.845Z"}]