[{"movie_id": 487558, "review_id": "5c448390c3a3681a0e250636", "author_rating": 7.0, "review_text": "The way _BlacKkKlansman_ ends, felt in terms of formula almost as if I was supposed to have just seen some unsubtle propaganda, which seemed a very unusual note to go out on. It did sort of make me step back a bit, but it absolutely did not temper my enjoyment of the movie. I was engaged from the word go, and everybody in it is **so good**.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T14:20:00.360Z"}, {"movie_id": 487558, "review_id": "5cdccb750e0a262d10cd1636", "author_rating": 8.0, "review_text": "**_Polemical, didactic, confrontational, angry, trenchant - a state-of-the-nation address_**\r\n\r\n> _We made a contemporary-period film, and it's about what's happening in the world today. Don't make the mistake that this stuff is just happening in the United States; it's worldwide._\r\n> \r\n[...]\r\n> \r\n_One of the things I know will happen is that when this guy in the White House, when he's gone, and historians look back on him, they're going to look at what he said, his comments about Charlottesville, where he cannot make the distinction between love and hate. He co-signed the Klan, he co-signed t__he alt-right and he co-signed neo-Nazis and I think that gave those terrorist groups, homegrown American terrorist groups, a green light._\r\n\r\n- Spike Lee; \"_BlacKkKlansman_'s Spike Lee On Trump's Legacy, Harry Belafonte & 2020 Election - Awardsline Screening Series\"; _Deadline_ (January 10, 2019)\r\n\r\n_BlacKkKlansman_ is a film with a whole hell of a lot on its mind. It opens with one of the most (in)famous scenes from Victor Fleming's _Gone with the Wind_ (1939), before pivoting to a fictional precursor of Alex Jones lecturing the audience on the dangers of the \"negroid\", and later takes in everything from Kwame Ture and the All-African People's Revolutionary Party to David Duke and his political aspirations, before lambasting D.W. Griffith's _The Birth of a Nation_ (1915), criticising the tropes of classic Blaxploitation films such as Gordon Parks's _Shaft_ (1971), Gordon Parks Jr.'s _Super Fly_ (1972), and Jack Hill's _Coffy_ (1973), going into agonising detail regarding the 1916 lynching of Jesse Washington, sardonically criticising police bureaucracy, and concluding with a montage of the 2017 Unite the Right rally in Charlottesville, Virginia, including raw footage of James Alex Fields, Jr. ploughing a car into a crowd of counter-protestors, resulting in the death of Heather Heyer, intercut with Duke championing Donald Trump's presidency, and Trump's own reluctance to condemn the Neo Nazi/white supremacist component of the rally. The film then ends with an evocatively worded tribute to Heyer, before fading to an upside-down black and white American flag (which is not, as is often stated, a political protest, but is actually a governmentally approved signal for \"dire distress\"). Yep; this is a film with a lot to say.\r\n\r\nAt its core, _BlacKkKlansman_ is about institutional racism in the United States. Ostensibly dealing with the 1970s manifestation of such, the film's real point is that in 2018, not only is such racism still a problem, it's now even more endemic, due to its pseudo-legitimacy in the wake of Trump's election, and the concomitant upsurge in hate crime across the country. The film holds a mirror up to the contemporary era by way of presenting an historical event which both underlines the inherent nonsensicality of white supremacist attitudes, whilst also pointing out just how dangerous idiots like this can be in a country where guns are so readily available, where being a member of an organised hate group is not illegal, and where the belief that \"white is right\" reaches to the upper echelons of power.\r\n\r\nOn the surface, the film plays out as you would expect from the trailer - it's a frequently hilarious look at the true story of how a black police officer infiltrated the Ku Klux Klan. In 1979, Ron Stallworth (John David Washington) became the first black officer in the Colorado Springs PD. Initially assigned to the records room, Stallworth talks his way into an undercover investigation run by Detectives Flip Zimmerman (Adam Driver) and Jimmy Creek (Michael Buscemi), who have him attend a lecture being given by Kwame Ture (Corey Hawkins) with orders to report on the mood and attitudes of the crowd. Although taken with Ture's rhetoric, Stallworth nevertheless carries out his assignment, and is subsequently transferred to intelligence. Seeing an advert for KKK membership in the newspaper, Stallworth rings the number on a whim. Pretending to hate everyone who doesn't have \"pure white Aryan blood running through their veins\", Stallworth is invited to meet. He then hatches an insane plan to use Zimmerman as the in-person Stallworth, whilst Stallworth himself will continue the phone conversations. At the meet-and-greet, Zimmerman/Stallworth is introduced to the unstable Felix Kendrickson (a superb Jasper Pääkkönen), who is immediately suspicious of him. Nevertheless, he's approved for membership. However, unhappy with how long the paperwork is taking, Stallworth rings KKK headquarters, and is shocked to find himself on the phone with \"Grand Wizard\" David Duke (Topher Grace), who he impresses to such an extent that Duke promises to expedite his membership.\r\n\r\nAnd with this completely barmy premise as the hook, co-writer/director Spike Lee (_Do the Right Thing_; _Malcolm X_) has made his best film since _25th Hour_ (2002), and his funniest since _Bamboozled_ (2000), possibly the funniest of his career. Of course, Lee is far from the first person to see humour in the idea of a black person joining a white supremacist organisation – perhaps the best known example is Dave Chappelle's character, Clayton Bigsby, a blind black man unaware of his ethnicity, who has become the leader of a local KKK sect. However, where the film is unique, and where it excels, is in how Lee uses history to offer viciously trenchant commentary on race relations in 2018.\r\n\r\nHis combative intent is signalled in the first scene, which is actually a scene from another film; _Gone with the Wind_, as Scarlett O'Hara (Vivian Leigh) looks for Dr. Meade (Harry Davenport) in the wake of the Battle of Atlanta in July 1864. A resounding victory for the Union, the battle bolstered confidence in Abraham Lincoln's leadership, and precipitated the Confederate States of America's surrender the following year. The scene depicts O'Hara picking her way through the thousands of wounded and dead Confederate States' soldiers as a crane shot pulls back to show the devastation, finally coming to rest on a tattered Confederate Navy Jack. The implication here, as elsewhere in the film, is clear – this is very much the world of the Lost Cause of the Confederacy, the belief that prior to Reconstruction, the Antebellum South was an urbane and benign society, with the Confederacy heroically fighting the corrupt Union so as to preserve the inherently honourable southern way of life. Important in this skewered worldview is the contention that the practice of slavery was a benevolent institution, protecting the \"coloureds\" from their own worst predilections, and who, rather than being abused, were treated like members of the family who owned them. Lee first saw Gone with the Wind on a third-grade class trip, and of the experience, he states,\r\n\r\n> _that film disturbed me. The imagery of Hattie McDaniel and Butterfly McQueen – \"I don't know nuthin' 'bout birthin' no babies\" – I mean, there was no discussion at all about the imagery._\r\n\r\nLee keeps up the confrontational tack in the film's second scene, as _BlacKkKlansman_ segues into the first of two key scenes to reference another important filmic text set during the Civil War; D.W. Griffith's 1915 masterpiece _The Birth of a Nation_. This scene depicts the fictional cultural anthropologist Dr. Kennebrew Beauregard (Alec Baldwin), who, in grainy black-and-white footage tries to alert the audience to the fact that the negorids are attempting to take over the country. Obviously inspired by maniacs like Alex Jones, Beauregard is about as irrational as they come, and his frustration as he continually flubs his lines superbly undercuts any claim he may have to seriousness. But what's especially well done is how Lee uses _Birth_ to mock this type of individual. As footage of the film plays behind Beauregard, his face is erased of its colour – he is literally rendered white enough to become part of the projected image, which, of course, depicts a narrative built around the inherently virtuous nature of being white. It's a powerful shot that clearly tells us, yes, this is a comedy, and yes, these people are ridiculous, but also alerting us to the fact that Lee is not playing around here; he's going to use every filmic tool in his arsenal to get his point across.\r\n\r\nAnd what is that point? The cultural instability of the United States in 2018, with its entrenched institutional racism, an entire race of people once again being treated like second class citizens because of the amount of melanin in their skin, hateful rhetoric masquerading as national pride, the breakdown of the distinction between xenophobia and patriotism, and the transition of hate crimes from the fringes of society into the realm of social acceptability. The film suggests that organisational racism once existed half-way between the absurd and the dangerous, but in recent years, it has moved in the wrong direction. Even before we get to the chilling closing montage, Lee and his co-writers (Charlie Wachtel, David Rabinowitz, and Kevin Willmott) have dropped a few subtle allusions to Trump's presidency. In one scene, Stallworth confidently asserts that it doesn't matter how much of a legitimate businessman Duke becomes, and no matter how much he hides his racism behind more patriotic rhetoric such as immigration and crime, the country would never elect a crass, hate-filled racist as president. In another scene, Duke explains he and the KKK are \"_making America great again_.\" These two allusions would be enough to get the point across, but it would also mean that that point remains in the realm of comedy, and is therefore easily dismissed. The closing montage changes that, as it drops all pretence of humour in depicting what happened in Charlottesville, and Trump's asinine response (\"_You had some very bad people in that group, but you also had people that were very fine people, on both sides_\"). This is very much a state-of-the-nation address.\r\n\r\nIn relation to _Birth of a Nation_, of course, things are more complicated than they are in relation to _Gone with the Wind_. Yes, the film is horrifically racist, and yes, it was singlehandedly responsible for the 20th-century revival of the KKK, but it is also probably the most important film ever made, and literally wrote the book on screen grammar. Conceivably, _Gone with the Wind_ could be removed from the canon and no longer taught, but _Birth_ absolutely could not. It is a foundational text, an undeniable landmark film, completely independent of its politics. Lee saw it during his first year at NYU, stating,\r\n\r\n> _they taught us all of the cinematic innovations Griffith had come up with, but they left out everything that had to do with the social impact of the film. That this film re-energized the Klan. The Klan was dormant, it was dead, and the film brought about a rebirth. Therefore, because of the rebirth of the Klan, it led to black people being lynched, strung up, castrated and murdered, but that was never discussed! I have no problem with Birth of a Nation being screened […] but let's put it in context, let's discuss it._\r\n\r\n_Birth_ is based on Thomas F. Dixon, Jr.'s 1905 novel T_he Clansman: A Historical Romance of the Ku Klux Klan_ - the second book in his KKK trilogy (the first is _The Leopard's Spots: A Romance of the White Man's Burden - 1865-1900_ (1902), and the third is _The Traitor: A Story of the Fall of the Invisible Empire_ (1907). As these titles suggest, all three novels valorise the practises and institutions designed to oppress black people, whilst depicting emancipated slaves and Yankee carpetbaggers as the \"real\" villains behind the Civil War, positing that the plight of the freedmen during Reconstruction was a direct result of their liberation (i.e., they (and the south in general) would have been better off had they remained slaves). In Dixon's depiction of the lawless society of the south, created by the Union, where coloureds can walk around freely, southern whites have become the target of racial violence, with freedmen being particularly fond of raping white women. In the trilogy, the Klan are depicted as arising from this maelstrom, honourable and heroic men forced to reluctantly take the law into their own hands so as to stop the rampage. So influential was the film that the modern KKK practices of wearing white hoods and burning crosses come from it, not from the original 1865-1871 incarnation of the Klan.\r\n\r\nAs mentioned, Lee uses the film twice – in the Beauregard scene, and in a later scene where his use of it speaks to the formal complexity of his own work. One of the most important of Griffith's innovations was that of parallel editing (better known today as cross-cutting), something we all take for granted in everything from films to commercials to music videos. In a nutshell, parallel editing is when two separate actions from two separate locations are intercut to suggest they are happening simultaneously, often, but not always, to heighten tension. It's one of the most fundamental components of screen grammar, so much so we don't even think about it today – we just take it as given. However, Lee's genius in this scene is that he uses _Birth_ to mock the Klan by way of, you guessed it, parallel editing. As the KKK sit down to watch _Birth_, Lee intercuts their enjoyment of its absurdities with Jerome Turner (Harry Belafonte) telling the story of the barbaric lynching of Jesse Washington, which saw a crowd of over 10,000 people in Waco, Texas, cheering on as his testicles and fingers were cut off, after which he was slowly burned to death by being continually raised over a fire. Lee uses parallel editing here so as to have one scene comment on the other – he is literally using _Birth_'s own innovations against it and what it represents. _Birth_ may be politically abhorrent, but Lee is savvy enough to not only recognise its technological importance, but to co-opt that importance and use it for his own ends, showing us the stunned reaction to a vicious murder contrasted with a celebration of the conditions which led to that murder.\r\n\r\nAs all of this may suggest, yes, the film is preachy, but that's because Lee is preaching. He makes no apology for such. This is polemic filmmaking, and the move into heavy didacticism in the final montage is completely earned.\r\n\r\nOn a more formal level, Lee thematically employs many of the aesthetic devices for which he has become known – whether it's a pronounced dutch angle during Stallworth's phone conversations with the KKK to indicate just how surreal the whole thing is, disembodied heads fading into one another during a powerful Ture speech, or, of course, the double dolly shot, which he has used in most of his films to suggest disillusionment and/or the characters' inability to control their own actions as they are inexorably pushed forward, divested of the contextualisation of their environment.\r\n\r\nAll of this is not to say the film is perfect, however. For example, it relates the apocryphal story that when Woodrow Wilson saw _Birth_, he commented, \"_it is like writing history with lightning_.\" Wilson never said this; the quote was most likely the invention of Thomas F. Dixon Jr., who was promoting the film at the time. Lee must know this, and it does his cause no good to perpetuate a lie. How he employs the double dolly also raises some interesting problems, suggesting, as it does, that orthodox black activism and underground black militancy must combine forces in the face of hate. The film also glosses over Stallworth's time in COINTELPRO, where he worked to sabotage radical black organisations, because this doesn't fit into the overarching theme the film is constructing. Making Zimmerman Jewish is also troubling (the real person he was based upon is known only as Chuck, and all we know about him is that he definitely wasn't Jewish). Is Zimmerman supposed to represent Republican voters who abhor the KKK as much as the political left do? Who knows, because beyond being Jewish, there's no further character development; he's more of a rhetorical device, a meme rather than a person with an inner life. Similarly, the fictional explosion towards the end of the story serves to distastefully simplify everything, once more making the KKK look foolish, something which is wholly unnecessary at this point in the film, whilst also positing Stallworth as a clichéd movie hero, something Lee has avoided up until this point.\r\n\r\nThese are relatively minor complaints, however. Look, Lee is far from my favourite filmmaker. I really disliked _Malcolm X_ (1992), for example, probably his most celebrated film, and he has justifiably been accused of racism himself on multiple occasions. None of that, however, changes the fact that this is an hilarious, powerful, insightful, and frightening piece of work.\r\n\r\nVital filmmaking from an angry filmmaker.\r\n\r\nAlso nice to see Clay Davis…sorry, Isaiah Whitlock, Jr. pop up in a throwaway part, but still get to deliver his catchphrase. Seriously, how many actors these days have a catchphrase? Sheeeeeeeeeeeettttttttttttttt.", "created_at": "2019-05-16T02:31:17.361Z"}, {"movie_id": 487558, "review_id": "62bdfa27abdafc0092c9580f", "author_rating": 10.0, "review_text": "BlacKkKlansman is an incredible bio-flick that shows the parallels between the 1970s and todays political landscape. The performances by Washington and Driver were absolutely brilliant. With the addition to all the Klansman performances, they really sell the world and the treatment towards minorities in a very serious but brutal way which I really appreciated. For a biographical piece, it really keeps you engaged and interested in the bigger message of what they are trying to deliver. I think this is an incredibly important film that everyone should watch in their life.\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-06-30T19:31:51.778Z"}, {"movie_id": 487558, "review_id": "63bf5b27e16e5a00d4029133", "author_rating": 1.0, "review_text": "I think the last film of Lee's watched and enjoyed was his Malcolm X biopic... but to be honest I don't think I really enjoyed the film so much as I did Denzel's performance. I mean, isn't it nice to see Denzel Washington playing something other than the smart law enforcement officer and actually bring his all to a film?\r\n\r\nI guess I should be fair and say that it's not as horribly bad as Son of Sam was... but it's bad in a way that Nicholas Cage is had to watch in all of his movies... almost all of his movies. He actually has a few good ones.\r\n\r\nI guess Lee's approach to this was to tell all of his actors to over-act as much as humanely possible for even the smallest roles. There is not a line that isn't over done, not a part that isn't over-acted. There is nothing naturalistic about this and it makes it so very hard to watch.\r\n\r\nThe result is a serious subject that could have been a compelling biopic, that was turned into a cartoonish mess.", "created_at": "2023-01-12T00:58:15.845Z"}]