[{"movie_id": 290859, "review_id": "5db78f7ad2c0c100181681bb", "author_rating": 6.0, "review_text": "Leaving ‘Terminator: Dark Fate’, I never felt like they managed to save the franchise, nor overwhelmingly glad this movie exists. It’s an adequate addition in a messy franchise that never reaches the heights of the first two films but is just above the three films before it, and because of this a lot of people will like it much more than they should. It’s not the ‘Halloween’ or even the ‘X-Men: Days of Future Past’ of the 'Terminator' franchise; it’s a fine follow up, and sadly nothing more.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-terminator-dark-fate-say-hasta-la-vista-you-wont-want-to-be-back", "created_at": "2019-10-29T01:01:46.095Z"}, {"movie_id": 290859, "review_id": "5dc065fe7d2bc1001338b963", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWhen it comes to the Terminator franchise, I share the same opinion as most people. The 1984’s original became a cult classic, and it’s one of the most influential sci-fi/action films of all-time. Terminator 2: Judgment Day is one of the (very) few sequels to such a beloved movie that actually improves on its predecessor, standing as the number one film of the saga, quality- and entertainment-wise. James Cameron left the franchise, and suddenly it all went down the sewer. While Terminator 3: Rise of the Machines is still tolerable, Salvation is absolutely terrible, and the reboot, Genisys, failed to change the saga’s history compellingly. So, obviously, even with the return of Cameron to the production team, my expectations were moderately low.\r\n\r\nThat said, Dark Fate is the best Terminator installment since T2 … which is not saying much. The last two flicks have great casts (from Christian Bale to Emilia Clarke), but their scripts are baffling bad. This time around, the cast has amazing chemistry, and their characters have better dialogue, but it comes at a cost. The last three movies possess stories that are not as captivating or entertaining (or even rational) as the first two films. Dark Fate has a much better screenplay, but again it comes at a cost. What cost is this? Basically, it repeats the exact same bits as The Terminator.\r\n\r\nAn extremely thin line exists between paying homage to a movie and blatantly copying it. Tim Miller’s team of screenwriters walk that line, stumbling to both sides several times along the way. Some scenes are indeed wonderful nods to the saga’s first two installments, but a lot of other moments (too many, to be honest) are pretty much a copy-paste version of a significant plot point or character development arc from one of those films. In case you’re wondering, this is the reason behind some of the “hate” from both critics and fans all over the world. Nowadays, people are harsher with this sort of homages, and the previously mentioned line is getting thinner and thinner.\r\n\r\nAnother reason for the divisive opinions is the opening sequence. Don’t worry, I won’t spoil. They simply make a sudden and surprising narrative decision that takes some of T2’s emotional impact, at least without first clarifying why they made such a call. Therefore, I gave the movie a chance to develop its idea, but it doesn’t. It just goes with it, and it never returns to this initial moment. Having this in mind, I understand if people instantly decided to hate the film based on just that very first scene…. Because it really doesn’t have any justification besides “well, we need a story”.\r\n\r\nDark Fate’s screenplay is emotionally resonant, and it’s also packed with (mostly) well-directed action sequences, but it resembles the 1984’s original plot too much. There’s even a direct line from Sarah Connor saying that a particular character is the equivalent of her son, John. This unnecessary and lazy exposition is surprisingly not as used as I expected it to be, but when it occurs, it’s like they chose the lamest, silliest, worse possible moments to place it. However, I can’t deny I actually had fun with the movie.\r\n\r\nWith a much better script than the last films, the cast was able to not only shine in a few scenes, but their incredible chemistry allowed for outstanding moments. Seeing Linda Hamilton portray Sarah Connor once again is a delight to my eyes, and Arnold Schwarzenegger is an awesome badass with hilarious lines. These two are phenomenal! Nevertheless, Mackenzie Davis steals the show as the enhanced soldier, Grace, especially regarding the action scenes. I don’t think Natalia Reyes offered what her character needed since she’s the protagonist, after all, but she’s able to stand her ground. I did enjoy Gabriel Luna take on the Terminator Rev-9, but I wish he had a little bit of more screentime besides the action.\r\n\r\nTim Miller brings his talented directing chops from Deadpool and applies his action techniques to deliver a lot of entertaining sequences. The VFX team provides with some impeccable CGI, but there are a couple of shots concerning a few speed bursts that should have received better treatment.\r\n\r\nAll in all, Terminator: Dark Fate is the best Terminator installment since Judgment Day, but it still doesn’t even reach the latter’s heels. It boasts a fantastic cast, with Linda Hamilton and Arnold Schwarzenegger returning to their respective iconic roles, but Mackenzie Davis outshines both with some badass moments and great acting. Natalia Reyes, as the protagonist, is disappointingly fine. Despite the action being well-directed and the screenplay being well-written, it all comes at the cost of essentially replicating the 1984 original’s plot. Some homages are notable, but it’s so identical story-wise that it takes away any sort of surprise, severely lacking creativity. In addition to this, it makes a narrative decision in the opening sequence that removes some of T2’s emotional impact, damaging the saga’s best movie and one of the greatest sci-fi/action films of all-time. I don’t exactly recommend it, but if you’re a fan of the franchise, go see it but with moderate expectations.\r\n\r\nRating: C", "created_at": "2019-11-04T17:55:10.268Z"}, {"movie_id": 290859, "review_id": "5e2caa54c2823a001197bd25", "author_rating": 7.0, "review_text": "Pretty good (second) reboot for this long-running franchise with some decent action, respectable enough visual effects (some parts looked off, though) and I did genuinely liked the two new cast members while Linda Hamilton and Arnold Schwarzenegger were fine.\r\n\r\nThat being said, it's also pretty clear this is not a franchise that needed to have gone beyond the two movies (and I might give leniency to \"The Sara Connor Chronicles\"). The saving grace is that on the technical front, it was an entertaining popcorn flick but like Genysis (which I also liked tbh), not really sure when I would revisit. **3.5/5**", "created_at": "2020-01-25T20:51:32.752Z"}, {"movie_id": 290859, "review_id": "5e2f270f1685da0011e9c7da", "author_rating": 4.0, "review_text": "\"For John.\"\r\n\r\n'Dark Fate' was meh. I mean it's basically the Force Awakens of the franchise just more cash grab. Like...how many times can they keep alternating T1 & T2, and yet it's astounding that it never ruins the legacy of the series. \r\n\r\nDespite all that, it's the third best in the series. At least this movie knows that Terminator is not for kids! I had some engagement in the movie, even through the reason being that it follows a familiar plot line.\r\n\r\nLinda Hamilton and Arnold Schwarzenegger are both the stand outs. Hamilton playing a cranky bad-ass and Arnold playing an involved machine that has a life of his own. Mackenzie Davis was surprisingly not as annoying as I thought she will be just from the marketing alone. Her character was straight forward in terms of motivation and can take damage.\r\n\r\nTim Miller really knows how to direct action scenes effectively and in this movie he delivers some grand action set pieces. However, after seeing the movie a few days ago, only a small selection stick to memory.\r\n\r\nGabriel Luna did a decent job playing the new advance Terminator. They took the \"Robert Patrick\" approach with picking an ordinary looking guy and making him into the biggest threat of humanity. Although it was a bit hard for me to feel threaten by him as throughout the movie he seemed easily out match by pretty much everyone. \r\n\r\nI didn't really buy into Dani played by Natalia Reyes as the main \"saviour of the future\", mainly because of her stiff acting and everytime she holds a gun it's twice her size.\r\n\r\nThe visual effects at times looked pretty OK, but the rest looked really bad. It really doesn't help when there's close ups on the effects where you can see the fakeness. At times the movie was a little too dark and I don't mean in tone, just whenever it's night time.\r\n\r\nOverall rating: Not as great as T1 & T2, but nothing will without James Cameron magic touch.", "created_at": "2020-01-27T18:08:15.622Z"}, {"movie_id": 290859, "review_id": "5ec37fd918b7510020ca6a41", "author_rating": 5.0, "review_text": "Let it never be said that they aren't trying. Everybody's trying, even the cast, and there was a genuine question mark over the head of that one going in, but people have been trying to make a great _Terminator_ sequel for a very long time, and not a one of them has succeeded at the job since before I was even born, so maybe what we really need, is for the film industry to just stop trying for a little while. Not stop trying to make good movies, just stop trying to make Terminator movies. Like, at all. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-05-19T06:42:33.294Z"}, {"movie_id": 290859, "review_id": "5f82389ed861af0039866f41", "author_rating": 8.0, "review_text": "Great watch, would watch again, and do recommend.\r\n\r\nFirst, time travel is the worst, but it's what allows the premise.\r\n\r\nI don't like divergent timelines, but it allows for some interesting scenarios, so when an android that never would have been created kills someone that would had stopped it from existing had it not been erased from existence, I'm a little interested.\r\n\r\nThe other big difference, and I'm not really opposed, is that they turned this into a women's empowerment movie when it could have just been bad ass women on screen and it wouldn't have slapped the audience so hard.  Plus there is a weird parallel there where they still need a \"big strong man\" to save them, but it's a machines, so the only man a woman really needs is a \"machine\"?  I don't know, I really liked the movie, and I sure wouldn't change the cast, just maybe point it in a more linear direction than the \"protect the womb\" mislead they threw in to throw shade at the original.\r\n\r\nLinda Hamilton is just as bad ass as ever, and Arnold Schwarzenegger is really keeping up too.  I love Mackenzie Davis in this: she plays a no-nonsense, dedicated soldier so well.\r\n\r\nUnfortunately Natalia Reyes just doesn't sell the character she's supposed to be to me, and Gabriel Luna doesn't quite pop for some reason.  Granted the T-1000 has some surprise and charm to it that the REV-9 doesn't quite have just in the nature of it.\r\n\r\nI will say the REV-9 does bring a very specific flavor to the action, being 1, 1.5, or even 2 separate characters really has a lot of potential to it, and I do want to see a different story that does intelligence work with a similar concept, but the action this gives is pretty sweet.\r\n\r\nAnd that's where it is special, mostly in the nano-bot effects.  Most of the rest of the action is pretty standard, but good, and Mackenzie Davis does such a great job playing up being super powered against such a crazy machine.  I do how she joins the Marvel Universe.\r\n\r\nFans of the Terminator franchise, androids, action should like this, though I'll admit it's not a return for formula, but it better than some of the other movies in the franchise.", "created_at": "2020-10-10T22:41:34.661Z"}, {"movie_id": 290859, "review_id": "60650bf0a06645002ae348f4", "author_rating": 6.0, "review_text": "It has its fair share of time travel nonsense and weird timeline stuff, but it's still **so much better than Terminator Genisys**. The cast is pretty good and the action is great to watch. If this is the last Terminator movie, at least it ends on a decent note.", "created_at": "2021-03-31T23:55:28.064Z"}, {"movie_id": 290859, "review_id": "62405d4197a4e600479edf2f", "author_rating": 5.0, "review_text": "Terrible film... the use of CGI was very imaginative (if repetitive) but the acting was wooden and the storyline (?) was pathetic. Better than Hellboy 3 - but a damn close thing...", "created_at": "2022-03-27T12:49:05.376Z"}, {"movie_id": 290859, "review_id": "63bf72d0e16e5a00afca8646", "author_rating": 1.0, "review_text": "So right away they kill off John in the most insulting way possible... making everything in 1-3 absolutely worthless.\r\n\r\nAnd then they replaced him with a 115lbs woman who is the new John Conner because... Woke.  And the new terminator is a woman because woke.\r\n\r\nAnd the Terminators before this are bad because not woke.\r\n\r\nAnd politics politics politics politics.\r\n\r\nAnd I am sick of politics in my entertainment", "created_at": "2023-01-12T02:39:13.027Z"}, {"movie_id": 290859, "review_id": "648d56762f8d0900ad345b99", "author_rating": 8.0, "review_text": "This is a great instalment of the whole Terminator franchise, produced by the only man who counts when it comes to The Terminator, James Cameron. After some more than disappointing additions to the movie lineup, this one is back to what we know, love and want. You can't reinvent the wheel so they don't even try here, they've just re-chromed, polished and added some spinners to the original setup. Dark Fate is simply Judgement Day with modern movie magic and I have no problem with that. And Linda Hamilton as a salty old lady wielding all kinds of assault weapons as if she's almost bored with the whole thing is a treat.", "created_at": "2023-06-17T06:45:10.646Z"}]