[{"movie_id": 7553, "review_id": "5b13dc180e0a263de600f4dc", "author_rating": 8.0, "review_text": "_Waiting..._ is incredible for three reasons.\r\n\r\nFirstly, it was one of the films that helped rocket forward the careers of both Ryan Reynolds (_Buried, Deadpool_) and Justin Long (_Accepted, Dodgeball, Jeepers Creepers_).\r\n\r\nSecondly, it glorifies what is in my opinion the best American Comedy ever made, _Super Troopers_, as well as Kevin Smith (director of _Clerks I & II, Jay and Silent Bob Strike Back, Dogma, Chasing Amy, Mallrats_)\r\n\r\nFinally, it's an American Comedy movie, and I paid actual money for it. I then watched it. I've watched it before. I'll probably even watch it again. BOOM! This probably means nothing to anyone who's reading this (there's also probably nobody reading this) but regardless, it's quite a big deal.\r\n\r\nManaging to take something as mundane as one day in a repetitive dead-end catering job, and make it even vaguely humorous is rather an achievement. You should watch it and play the other-other \"The Game\" (sidenote: I lost the game) like we used to in High School. 'Cause I'm classy like that.\r\n\r\nSeriously though, and I can't believe my thoughts even as I'm typing this, but I honestly think Waiting... is an underrated American Comedy gem, maybe I'm just seeing that comparatively, or with the rose-tinted glasses of nostalgia, but I really do enjoy the film.\r\n\r\n76%\r\n\r\n-Gimly", "created_at": "2018-06-03T12:16:24.275Z"}, {"movie_id": 7553, "review_id": "5f788d3d7b7b4d0039720a3e", "author_rating": 8.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nGranted it's a little raunchy, but it should be somewhat relatable to everyone.\r\n\r\nThis joins a movies like \"Clerks\" (basically any Kevin Smith movie), and \"The Concessionaires Must Die\" for it's fantastic dialogue and interesting characters.  Even if they're not \"good\" characters, each character has their own little gimmick that this awesome cast brings to life.\r\n\r\nNot everyone can be Ryan Reynolds, Justin Long, Anna Faris or Luis Guzmán, but it all comes down to each and everyone's stellar delivery with the multitude of stories happening on top of each other.\r\n\r\nThe movie is very funny with deep thoughts sewn into it, mostly life philosophy.", "created_at": "2020-10-03T14:39:57.400Z"}]