[{"movie_id": 817758, "review_id": "63ce9a327f054000d9cd4d58", "author_rating": 7.0, "review_text": "Cate Blanchett is superb as the eponymous, ruthlessly focussed and highly accomplished, maestra who lives with her violinist wife \"Sharon\" (Nina Hoss) and young daughter \"Petra\" (Mila Bogojivic). Acclaimed by her peers, she is now the principal conductor of the Berlin Philharmonic. A job not without it's complications - she must select music, inspire musicians, and deal with her less then competent assistant \"Sebastian\" (Allan Corduner) who was a favourite of the previous occupant of her job \"Davis\" (Julian Glover) whilst juggling the ambitions of her funding partner \"Kaplan\" (Mark Strong). This spinning plates operation means she is constantly making compromises and that impacts on all of those around her. Frequently, she must rely on her assistant \"Francesca\" (Noémie Merlant) and it's around this relationship that we see some cracks start to appear in the otherwise formidable armour of \"Tár\". One of her erstwhile musicians has taken her own life - and subsequently the rumour mill starts to suggest that maybe, just maybe, there could have been an element of the good old casting couch mentality going on. No smoke without fire or totally made up? Well the last half of the film unfolds as the allegations gather pace and, well... I wasn't exactly enamoured of development of the story. It reminded me a little of that surrounding acclaimed British choreographer Liam Scarlett - and with that in mind I found the theme a little undercooked. It does illustrate well the Humty Dumpty effect of gossip, though. Do we believe she is guilty of abusing her position and of manipulation? Or is she a powerless victim of someone else's failure? I had nowhere near enough evidence to draw any meaningful conclusion - and I didn't like that. The ending is rather powerful, though - a vindication or a terrible wronging? You must decide... Blanchett is, regardless of that, at the top of her game and there is some spectacular orchestral music to enjoy here, too.", "created_at": "2023-01-23T14:31:14.103Z"}, {"movie_id": 817758, "review_id": "63ef87be0f0da500bd673f60", "author_rating": 6.0, "review_text": "I wanted to like TÁR, but I just found it boring. Way too long and drawn out. I thought the story was decent with fantastic performances but it just did not work for me. I can appreciate it as a masterpiece in film making, even though I considered it a pretty poor watch.\r\n\r\nScore: 60% | \r\nVerdict: Decent", "created_at": "2023-02-17T13:57:18.113Z"}, {"movie_id": 817758, "review_id": "640db3d51ac29200f6312acc", "author_rating": 5.0, "review_text": "The downfall of a great conductor (conductress??) could have been an interesting topic. But ‘TÁR’ is 2h38mins of leaving out major plot points and instead showing details in dreadful scenes that often don’t lead anywhere. The viewer has to make all this up for themselves, such as whether Tár is victim or culprit. In a way, this is all quite well done. Unfortunately, the film is too boring and incomprehensible to care. \r\n\r\nThis being a film about conducting, I found Blanchett’s conducting style ridiculous, though she was good otherwise. At least the Mahler 5 excerpts sounded wonderful, and so let’s just conclude with that number as my rating.\r\n\r\n5/10", "created_at": "2023-03-12T11:13:25.614Z"}]