[{"movie_id": 491283, "review_id": "5d900d17172d7f002756853b", "author_rating": 7.0, "review_text": "‘Judy’ is a film that celebrates Garland's legacy, and while the film is a little generic in its storytelling, Zellweger’s truly phenomenal performance pulls you into this behind the scenes to look at one of Hollywood’s greatest stars.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-judy-zellweger-goes-for-oscar-gold-in-mid-core-biopic", "created_at": "2019-09-29T01:47:03.848Z"}, {"movie_id": 491283, "review_id": "5dffab4e9824c80013e2624d", "author_rating": 6.0, "review_text": "Renée Zellweger remembers how to act in this simple biopic, delivering her best performance since Cold Mountain in 2003, however despite the good intentions, the film cannot help feeling like a vehicle to grant nominations to its lead actress in the coming awards season, instead of saying something more interesting about Judy Garland.", "created_at": "2019-12-22T17:43:42.399Z"}, {"movie_id": 491283, "review_id": "5e21db46cf4b8b0017f19bd4", "author_rating": 7.0, "review_text": "Judy clicks her heels three times to transport us to a world of melancholy and self-destruction. Somewhere over the rainbow lies Judy Garland. An innocent, fragile and talented young actress who infiltrated silver screens and rapidly shot to fame. The voice of an ethereal angel. MGM’s golden girl.\r\n\r\nBut behind the lavish productions and beneath that unimpeachable smile, was an undisputed amount of pressure. A malleable marionette susceptible to the puppetry of Hollywood. A product of ruthless executives. Garland was no longer a person. Her individuality brutally reaped by higher authorities, manipulating her into believing she was physically unattractive. Starving, pill-popping and overworked. That was the cruel life of Judy Garland. The glistening glitter and the iconic voice, mere facades masquerading the suppressed pain. Unfortunately though, her repressed childhood and early stardom steered Garland into a life of alcohol and substance abuse. The yellow brick road wasn’t so golden after all.\r\n\r\nGoold’s biopic (and part adaptation of the Broadway play) dramatises her later career, forced to perform a sell-out tour in London due to her unreliability in the States. Her unworkable state being a consequence of substance abuse. Clumsily walking out into the spotlight that she undoubtedly adored. That inevitable lust for fame. A legendary status. Trapped, her battle for the custody of her children raged on. Torn between the natural instinct of motherhood, and the only element of her life she’s ever known. Her profession. Edge’s screenplay, whilst surface level on certain aspects which merely imitated a biographical article instead of further sentimentalising Judy as an individual, eloquently explored the dangers of fame at such a vulnerable age. The inability to have a voice. To be bossed around by studio executives who see her as an asset rather than a human being.\r\n\r\nIt’s very much a by-the-numbers biopic, and Goold’s blend of light and darkness within his direction made this comparable to the equally melancholic ‘My Week With Marilyn’. Snippets of fans announcing their adoration for their idol, empowering the eponymous star even further. That joyous search for justification. But the sorrow never fades. Goold’s constant tone of desolation throughout, whilst teetered on unnecessary melodrama, honed in on the impact Garland made. There’s nothing more tragic than witnessing an individual undergo self-destruction, and Goold rarely distracts us from this.\r\n\r\nIt all comes down to the central performance. The actress who is in every scene, devoting her soul into the character. Ladies and gentlemen, Zellweger became Garland. Astonishingly embodying her right from the immediate title card. I’ll be irrefutably disappointed if she does not garner awards for her performance. Not only is it a career best, it’s quite simply the best of the year. The nuances, the voice, the erratic body movement. Rarely does a performance make me lose sight of who is actually acting. During that final rendition of “Over The Rainbow”, my eyes moistened. No longer was I seeing Zellweger, but Judy herself. It was cathartic. It was reincarnation. It was divine. Goold bravely shot the performances as one take sequences for the most part, which has to be applauded for artistic integrity. It did however make the lip syncing incredibly obvious which frustratingly pulled me out of the film. No fault of Zellweger’s stunning performance though. Rising star herself Buckley deserves some praise for her crystal clear performance. Such delicate clarity against the chaotic Garland. Would’ve liked to have seen more from Gambon and Sewell, but appreciate the film is solely focussed on Zellweger.\r\n\r\nThe film wouldn’t work without her. Garland has never been depicted with such compassion before, and it's an amalgamation of quality over quantity. It’s not big. It’s not flashy. It’s just honest. Garland herself would’ve been proud, and we will never forget her. But please, do bring a box of tissues with you...", "created_at": "2020-01-17T16:05:26.125Z"}, {"movie_id": 491283, "review_id": "5e74c4fecabfe400111e4955", "author_rating": 4.0, "review_text": "I don't want to dismiss the hard work that Zellwegger put into playing a version of Judy Garland, but I **do** want to dismiss the script entirely. _Judy_ takes the most boring, trite and overused direction that it possibly can at every single opportunity.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-03-20T13:28:30.496Z"}]