[{"movie_id": 363676, "review_id": "57e116cd92514104490053d5", "author_rating": null, "review_text": "Segera bergabung dengan Lapakqq dapatkan hadiah dan bonus menarik. \r\nNikmati bagaimana rasanya menjadi bandar yang sesungguhnya. \r\nJangan sampai ketinggalan ya.\r\n\r\nLapakqq Menyediakan Promo Menarik :\r\n\r\n• Bonus Referral 10%+10%\r\n• Bonus TurnOver 0.5% \r\n\r\nDengan Proses DEPO & WD cepat.\r\nPelayanan yang selalu mengutamakan anda, di jamin tidak bosen dan nyaman dengan apa yang di berikan.\r\nJADI ??Tunggu apa Lagi. Kunjungi www.lapakqq.com sekarang.\r\n\r\nkami menyediakan website untuk anda, 6 permainan dalam 1 web.\r\n? Poker Online\r\n? DominoQQ\r\n? BandarQ\r\n? AduQ\r\n? Capsa Susun\r\n? Bandar Poker\r\n\r\n\r\nKAMI MELAYANI 24JAM UNTUK ANDA!", "created_at": "2016-09-20T11:00:29.900Z"}, {"movie_id": 363676, "review_id": "57e21174c3a36808c3007274", "author_rating": null, "review_text": "Filmmaker Clint Eastwood is certainly no stranger to overseeing exploratory biopics and his latest effort in **Sully** definitely supports his cinematic vision for spotlighting an unknown everyday aviation professional into an overnight national hero. Thus, airline pilot Captain Chesley \"Sully\" Sullenberger became an inspirational savior courtesy of the potentially fateful day on January 15, 2009 when US Airways Flight 1749 morphed into the celebrated newsworthy incident dubbed \"Miracle on the Hudson\" \r\n\r\nIn **Sully** Eastwood and screenwriter Todd Kormarinski presents Captain Sullenberger as an understated hero in the unconventional sense. Indeed, Sullenberger had his personal demons and doubts about that critical day years ago when his quick decision to land the doomed aircraft in the icy waters of the Hudson River in the aftermath of a freakish occurrence when a flock of birds managed to disable the engine's operation shortly after takeover from LaGuardia Airport. The label of \"hero\" may have been somewhat flattering for the veteran pilot in light of his accomplishment in saving the lives of his 155 passengers and crew courtesy of a risky landing that could have been their hellish watery graves. However, the burdensome christening of \"hero\" weighed heavily on Sullenberger especially when insulting suspicions arose questioning the pilot's actions. Sure, Sullenberger basked in instant adulation but his private torment was almost as haunting as the near tragedy he prevented when ensuring the airborne safety of those jeopardized on board.  \r\n\r\nThe challenging task in **Sully** was to create the tension and psychological strife behind an infamous 6-minute flight headed for disaster. Thankfully, Eastwood's steady direction and Komarnicki's adventurous script captures the tense and anxiety-driven moments that fuels **Sully's** soulful foundation. More important, two-time Oscar winner Tom Hanks diligently fits the bill as the beleaguered Captain Sullenberger whose personalized battles with heroism caused pressured ambivalence and self-inflicted guilt. It has been an awful long time since Hanks was tapped for an Oscar nomination so let's hope that his solid work in **Sully** warrants Academy Award consideration. \r\n\r\nSome may be rather cynical about Eastwood's daring narrative as the self-explanatory story has been interpreted in so many news accounts, documentaries, the personal accounts from the Flight 1749 survivors and to a certain extent Captain Sullenberger himself. Still, **Sully** sets out to examine a conflicted and confused man second guessing his aviation skills and instincts as an individual thrust into the national spotlight with a combination of hope and hesitation. \r\n\r\nNot only had the quick-thinking Sully and co-pilot Jeff Skiles (Aaron Eckhart in a welcomed, absorbing supporting role) dodged a major catastrophe when accidentally flying into the cluttered Canadian geese that caused the ice-cold water landing in the Hudson but they were actually scrutinized by the National Transportation Safety Board (NTSB) regarding Sully's decision not to return the malfunctioning plane to LaGuardia Airport or toward a nearby airport therefore opting to gamble using the Hudson River as the immediate surface available to land.  \r\n\r\nNaturally, the sudden media attention anointing the heralded pilot as a heroic soul coupled with the mixed reception of the buzz-killers in the NTSB speculating that foul play may have been involved for the piloting tandem of Flight 1549 understandably heightened the self-doubts and generated Sully's Post-Traumatic Stress Disorder. In the meantime, Sullenberger's wife Lorrie (Academy Award nominee Laura Linney) as well as other close family and associates are constantly being hounded by intrusive reporters in their attempt to get an exclusive piece of the cherished \"man of the moment\" in Chesley \"Sully\" Sullenberger.\r\n\r\nGranted that **Sully** will not go down as one of the flashiest biopics to cross our paths on the big screen in recent years. But Eastwood does deserve credit for showcasing the somber and beleaguered Sullenberger as a low-key, loyal isolationist dealing with the newfound fame and appreciation he is awkwardly at odds with facing as the Hudson River landing/rescue still chomps at his tainted psyche. Hanks's portrayal of the extremely likable but reluctant hero with lingering reservations is a stark contrast to contemporary cinematic heroes that routinely defeat monsters and aliens, parade around as slick and resilient super spies, wear superhero masks and capes, solemnly walk the mean streets with ready-made badges and firearms or are war-torn warriors from ancient historical times. Quite frankly, Chesley \"Sully\" Sullemberger is a flawed yet conscientious man urged to question his own courageousness and professional conviction.  \r\n\r\nEckhart's Stiles is effectively drawn as Sully's ardent supporter whose disbelief is tested when the NTSB has the nervy gumption to place his capable colleague under the dubious microscope after his amazing endeavor in protecting the sacred lives all on board the panicky plane destined for its doomsday fate. Conveniently, Eastwood inserts Anna Gunn (from TV's \"Breaking Bad\") as one of the perceived NTSB interrogating \"baddies\" trying to pin the wrap on Sully's numb shoulders in reference to his troubling flight methods. Linney, always the talented and involving actress, is merely reduced to displaying the commonplace hysterics of Sully's concerned spouse. \r\n\r\nPerhaps **Sully** is not the most thoroughly in-depth biopic one would have imagined because we are working with the perplexing man whose heroic actions made us aware of this seasoned phenomenal flyboy glorified in our living rooms nearly two decades ago. There is not much to ponder about Eastwood's fictitious Sullenberger from his past that gives insight to his current-day characterization as the media-praised hero-in-healing. In all fairness, Captain Chesley \"Sully\" Sullenberger's claim to fame was his hasty option to spare the endangered existences of his passengers and crew so Eastwood allows his problematic protagonist's questionable heroics to paint the picture as the incredible individual whose January 2009 resourcefulness spoke more truthfully than any miscellaneous flashbacks could do to justify Sully's angst-ridden tendencies.  \r\n\r\nOverall, **Sully** establishes a different kind of turbulence for an introspective yet gently intense wounded wonder tip toeing on the borderline of deserved and deceptive worship.  \r\n\r\n**Sully** (2016)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Tom Hanks, Aaron Eckhart, Laura Linney, Jeffrey Nordling, Jamey Sheridan, Michael Rappaport, Anna Gunn, Valarie Mahaffey\r\n\r\nDirected by: Clint Eastwood\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Drama/Biopic\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-09-21T04:49:56.832Z"}, {"movie_id": 363676, "review_id": "585ea0dec3a3681a6201055d", "author_rating": 8.0, "review_text": "**When a real human bravery wasn't appreciated till the computers confirmed it.**\r\n\r\nAnother excellent biographical drama for Tom Hanks in the title role. He has transformed from captain Phillips to captain Sully. Another great addition to Clint Eastwood's filmography as well, he never disappoints us. This film was based on the real event of the January 15, 2009. When a US passenger plane got hit by birds just after the take off, losing both the engines, landed on the New York's Hudson river. So the film reveals the heroic event, as well as followed by the investigation of the crash landing.\r\n\r\nAs it is a Hollywood film what should I expect, another American bravery? Yep, but still a good film, very engaging plot. It's not all about the plane event, because I thought one of the film poster is a spoiler. So the film covers more story, about the drama surrounding the main event. Especially saving the lives, that inspires even for the outside Americans. The entire narration is about two-three day affair, but most of the film was about the crash landing. From the actors to the visuals, all were top class. One of the best biopic that's not based on one's whole life, but one heroic attempt which will be remembered him and this film for forever.\r\n\r\n_8/10_", "created_at": "2016-12-24T16:22:54.521Z"}, {"movie_id": 363676, "review_id": "6056be1a6e3deb0054e7b24a", "author_rating": 9.0, "review_text": "Top class, as expected.\r\n\r\n<em>'Sully'</em> is great. Tom Hanks absolutely nails it as the titular character, he is undoubtedly the perfect cast for the role. An outstanding actor, as we all know. The plot is told in a way that I personally enjoyed, I liked seeing the different snippets of time.\r\n\r\nThough no-one is on the same level as Hanks in this, there are a few other good performers. Aaron Eckhart (Jeff) does well, while there are less important roles for people like Anna Gunn (Elizabeth) and Michael Rapaport (Pete). I have no issues with the casting, that's for sure.\r\n\r\nIt's a crazy true story, mad that it happened way back in 2009 - feels more recent, strangely. I assume it uses the usual creative license that practically every film does, which I'm fine with. It delivers as a quality film, which is all I truly care about.", "created_at": "2021-03-21T03:31:38.363Z"}, {"movie_id": 363676, "review_id": "62fc2f615f6c49007d22ace3", "author_rating": 6.0, "review_text": "**Based on real events, the film does full justice to what happened, despite not being a particularly memorable film for any of those involved.**\r\n\r\nOn January 15, 2009, the American people (and the entire world) saw with amazement and great joy the way in which a commercial airliner, after hitting a flock of birds and losing its two engines, managed to cheat death and land safely in the waters of the Hudson River in New York. The pilot, Chelsey Sullenberger, was widely credited for the aerial feat, having managed to save everyone on the plane and limit the incident to material damage. In fact, the veteran pilot largely ignored the instructions from the Tower, trusted his instincts and experience, and made the right decision.\r\n\r\nNo wonder, then, that it all ended up on film. Clint Eastwood has done better and more notable works in his directing career, but he's in good shape here, and the film fully honors what happened that day. However, the film lacks tension and drama, and most of the action takes place after the accident, throughout the long investigation in which the authorities tried to verify what happened, and to what extent could they blame the pilots of that plane.\r\n\r\nTom Hanks is one of those actors that we can call a “safe bet”. Whatever film he decides to make, it's almost guaranteed that the actor will put in his best effort and do his job to the best of his ability. And this film was no exception, with a good performance, in which Hanks managed to capture very well the voice, gestures and mannerisms of the real person he imitated, and who he knew to be able to do so. Aaron Eckhart also rose to the challenge, giving his character a touch of unpretentious humor that suits him well, as well as giving Hanks a very welcome backing. Unfortunately, on the part of the cast, there is nothing else good to point out. Laura Linney did everything she could with her character, but she doesn't have any material or relevance to help her. The evaluators who analyze what happened, however, are the film's most ungrateful and poorly written characters because, for increased dramatic effects, they are virtually demonized.\r\n\r\nTechnically, the film is pretty decent. There are glaring flaws of anachronism in between, that the most attentive eye can easily find, such as the deciduous trees that are green despite the fact that the film takes place in the middle of winter, and also there is not a single person on that crashed plane that we can see the breath of (something common on colder days, when we see our breath as a vapor). The plane scenes were very well done and the CGI used was really good. The cinematography is good, the film makes good use of the scenic beauty of New York and its Hudson River, and the filming locations were chosen and used in the best way possible. The soundtrack is essentially banal and unremarkable.", "created_at": "2022-08-16T23:59:29.971Z"}, {"movie_id": 363676, "review_id": "57e116cd92514104490053d5", "author_rating": null, "review_text": "Segera bergabung dengan Lapakqq dapatkan hadiah dan bonus menarik. \r\nNikmati bagaimana rasanya menjadi bandar yang sesungguhnya. \r\nJangan sampai ketinggalan ya.\r\n\r\nLapakqq Menyediakan Promo Menarik :\r\n\r\n• Bonus Referral 10%+10%\r\n• Bonus TurnOver 0.5% \r\n\r\nDengan Proses DEPO & WD cepat.\r\nPelayanan yang selalu mengutamakan anda, di jamin tidak bosen dan nyaman dengan apa yang di berikan.\r\nJADI ??Tunggu apa Lagi. Kunjungi www.lapakqq.com sekarang.\r\n\r\nkami menyediakan website untuk anda, 6 permainan dalam 1 web.\r\n? Poker Online\r\n? DominoQQ\r\n? BandarQ\r\n? AduQ\r\n? Capsa Susun\r\n? Bandar Poker\r\n\r\n\r\nKAMI MELAYANI 24JAM UNTUK ANDA!", "created_at": "2016-09-20T11:00:29.900Z"}, {"movie_id": 363676, "review_id": "57e21174c3a36808c3007274", "author_rating": null, "review_text": "Filmmaker Clint Eastwood is certainly no stranger to overseeing exploratory biopics and his latest effort in **Sully** definitely supports his cinematic vision for spotlighting an unknown everyday aviation professional into an overnight national hero. Thus, airline pilot Captain Chesley \"Sully\" Sullenberger became an inspirational savior courtesy of the potentially fateful day on January 15, 2009 when US Airways Flight 1749 morphed into the celebrated newsworthy incident dubbed \"Miracle on the Hudson\" \r\n\r\nIn **Sully** Eastwood and screenwriter Todd Kormarinski presents Captain Sullenberger as an understated hero in the unconventional sense. Indeed, Sullenberger had his personal demons and doubts about that critical day years ago when his quick decision to land the doomed aircraft in the icy waters of the Hudson River in the aftermath of a freakish occurrence when a flock of birds managed to disable the engine's operation shortly after takeover from LaGuardia Airport. The label of \"hero\" may have been somewhat flattering for the veteran pilot in light of his accomplishment in saving the lives of his 155 passengers and crew courtesy of a risky landing that could have been their hellish watery graves. However, the burdensome christening of \"hero\" weighed heavily on Sullenberger especially when insulting suspicions arose questioning the pilot's actions. Sure, Sullenberger basked in instant adulation but his private torment was almost as haunting as the near tragedy he prevented when ensuring the airborne safety of those jeopardized on board.  \r\n\r\nThe challenging task in **Sully** was to create the tension and psychological strife behind an infamous 6-minute flight headed for disaster. Thankfully, Eastwood's steady direction and Komarnicki's adventurous script captures the tense and anxiety-driven moments that fuels **Sully's** soulful foundation. More important, two-time Oscar winner Tom Hanks diligently fits the bill as the beleaguered Captain Sullenberger whose personalized battles with heroism caused pressured ambivalence and self-inflicted guilt. It has been an awful long time since Hanks was tapped for an Oscar nomination so let's hope that his solid work in **Sully** warrants Academy Award consideration. \r\n\r\nSome may be rather cynical about Eastwood's daring narrative as the self-explanatory story has been interpreted in so many news accounts, documentaries, the personal accounts from the Flight 1749 survivors and to a certain extent Captain Sullenberger himself. Still, **Sully** sets out to examine a conflicted and confused man second guessing his aviation skills and instincts as an individual thrust into the national spotlight with a combination of hope and hesitation. \r\n\r\nNot only had the quick-thinking Sully and co-pilot Jeff Skiles (Aaron Eckhart in a welcomed, absorbing supporting role) dodged a major catastrophe when accidentally flying into the cluttered Canadian geese that caused the ice-cold water landing in the Hudson but they were actually scrutinized by the National Transportation Safety Board (NTSB) regarding Sully's decision not to return the malfunctioning plane to LaGuardia Airport or toward a nearby airport therefore opting to gamble using the Hudson River as the immediate surface available to land.  \r\n\r\nNaturally, the sudden media attention anointing the heralded pilot as a heroic soul coupled with the mixed reception of the buzz-killers in the NTSB speculating that foul play may have been involved for the piloting tandem of Flight 1549 understandably heightened the self-doubts and generated Sully's Post-Traumatic Stress Disorder. In the meantime, Sullenberger's wife Lorrie (Academy Award nominee Laura Linney) as well as other close family and associates are constantly being hounded by intrusive reporters in their attempt to get an exclusive piece of the cherished \"man of the moment\" in Chesley \"Sully\" Sullenberger.\r\n\r\nGranted that **Sully** will not go down as one of the flashiest biopics to cross our paths on the big screen in recent years. But Eastwood does deserve credit for showcasing the somber and beleaguered Sullenberger as a low-key, loyal isolationist dealing with the newfound fame and appreciation he is awkwardly at odds with facing as the Hudson River landing/rescue still chomps at his tainted psyche. Hanks's portrayal of the extremely likable but reluctant hero with lingering reservations is a stark contrast to contemporary cinematic heroes that routinely defeat monsters and aliens, parade around as slick and resilient super spies, wear superhero masks and capes, solemnly walk the mean streets with ready-made badges and firearms or are war-torn warriors from ancient historical times. Quite frankly, Chesley \"Sully\" Sullemberger is a flawed yet conscientious man urged to question his own courageousness and professional conviction.  \r\n\r\nEckhart's Stiles is effectively drawn as Sully's ardent supporter whose disbelief is tested when the NTSB has the nervy gumption to place his capable colleague under the dubious microscope after his amazing endeavor in protecting the sacred lives all on board the panicky plane destined for its doomsday fate. Conveniently, Eastwood inserts Anna Gunn (from TV's \"Breaking Bad\") as one of the perceived NTSB interrogating \"baddies\" trying to pin the wrap on Sully's numb shoulders in reference to his troubling flight methods. Linney, always the talented and involving actress, is merely reduced to displaying the commonplace hysterics of Sully's concerned spouse. \r\n\r\nPerhaps **Sully** is not the most thoroughly in-depth biopic one would have imagined because we are working with the perplexing man whose heroic actions made us aware of this seasoned phenomenal flyboy glorified in our living rooms nearly two decades ago. There is not much to ponder about Eastwood's fictitious Sullenberger from his past that gives insight to his current-day characterization as the media-praised hero-in-healing. In all fairness, Captain Chesley \"Sully\" Sullenberger's claim to fame was his hasty option to spare the endangered existences of his passengers and crew so Eastwood allows his problematic protagonist's questionable heroics to paint the picture as the incredible individual whose January 2009 resourcefulness spoke more truthfully than any miscellaneous flashbacks could do to justify Sully's angst-ridden tendencies.  \r\n\r\nOverall, **Sully** establishes a different kind of turbulence for an introspective yet gently intense wounded wonder tip toeing on the borderline of deserved and deceptive worship.  \r\n\r\n**Sully** (2016)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Tom Hanks, Aaron Eckhart, Laura Linney, Jeffrey Nordling, Jamey Sheridan, Michael Rappaport, Anna Gunn, Valarie Mahaffey\r\n\r\nDirected by: Clint Eastwood\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Drama/Biopic\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-09-21T04:49:56.832Z"}, {"movie_id": 363676, "review_id": "585ea0dec3a3681a6201055d", "author_rating": 8.0, "review_text": "**When a real human bravery wasn't appreciated till the computers confirmed it.**\r\n\r\nAnother excellent biographical drama for Tom Hanks in the title role. He has transformed from captain Phillips to captain Sully. Another great addition to Clint Eastwood's filmography as well, he never disappoints us. This film was based on the real event of the January 15, 2009. When a US passenger plane got hit by birds just after the take off, losing both the engines, landed on the New York's Hudson river. So the film reveals the heroic event, as well as followed by the investigation of the crash landing.\r\n\r\nAs it is a Hollywood film what should I expect, another American bravery? Yep, but still a good film, very engaging plot. It's not all about the plane event, because I thought one of the film poster is a spoiler. So the film covers more story, about the drama surrounding the main event. Especially saving the lives, that inspires even for the outside Americans. The entire narration is about two-three day affair, but most of the film was about the crash landing. From the actors to the visuals, all were top class. One of the best biopic that's not based on one's whole life, but one heroic attempt which will be remembered him and this film for forever.\r\n\r\n_8/10_", "created_at": "2016-12-24T16:22:54.521Z"}, {"movie_id": 363676, "review_id": "6056be1a6e3deb0054e7b24a", "author_rating": 9.0, "review_text": "Top class, as expected.\r\n\r\n<em>'Sully'</em> is great. Tom Hanks absolutely nails it as the titular character, he is undoubtedly the perfect cast for the role. An outstanding actor, as we all know. The plot is told in a way that I personally enjoyed, I liked seeing the different snippets of time.\r\n\r\nThough no-one is on the same level as Hanks in this, there are a few other good performers. Aaron Eckhart (Jeff) does well, while there are less important roles for people like Anna Gunn (Elizabeth) and Michael Rapaport (Pete). I have no issues with the casting, that's for sure.\r\n\r\nIt's a crazy true story, mad that it happened way back in 2009 - feels more recent, strangely. I assume it uses the usual creative license that practically every film does, which I'm fine with. It delivers as a quality film, which is all I truly care about.", "created_at": "2021-03-21T03:31:38.363Z"}, {"movie_id": 363676, "review_id": "62fc2f615f6c49007d22ace3", "author_rating": 6.0, "review_text": "**Based on real events, the film does full justice to what happened, despite not being a particularly memorable film for any of those involved.**\r\n\r\nOn January 15, 2009, the American people (and the entire world) saw with amazement and great joy the way in which a commercial airliner, after hitting a flock of birds and losing its two engines, managed to cheat death and land safely in the waters of the Hudson River in New York. The pilot, Chelsey Sullenberger, was widely credited for the aerial feat, having managed to save everyone on the plane and limit the incident to material damage. In fact, the veteran pilot largely ignored the instructions from the Tower, trusted his instincts and experience, and made the right decision.\r\n\r\nNo wonder, then, that it all ended up on film. Clint Eastwood has done better and more notable works in his directing career, but he's in good shape here, and the film fully honors what happened that day. However, the film lacks tension and drama, and most of the action takes place after the accident, throughout the long investigation in which the authorities tried to verify what happened, and to what extent could they blame the pilots of that plane.\r\n\r\nTom Hanks is one of those actors that we can call a “safe bet”. Whatever film he decides to make, it's almost guaranteed that the actor will put in his best effort and do his job to the best of his ability. And this film was no exception, with a good performance, in which Hanks managed to capture very well the voice, gestures and mannerisms of the real person he imitated, and who he knew to be able to do so. Aaron Eckhart also rose to the challenge, giving his character a touch of unpretentious humor that suits him well, as well as giving Hanks a very welcome backing. Unfortunately, on the part of the cast, there is nothing else good to point out. Laura Linney did everything she could with her character, but she doesn't have any material or relevance to help her. The evaluators who analyze what happened, however, are the film's most ungrateful and poorly written characters because, for increased dramatic effects, they are virtually demonized.\r\n\r\nTechnically, the film is pretty decent. There are glaring flaws of anachronism in between, that the most attentive eye can easily find, such as the deciduous trees that are green despite the fact that the film takes place in the middle of winter, and also there is not a single person on that crashed plane that we can see the breath of (something common on colder days, when we see our breath as a vapor). The plane scenes were very well done and the CGI used was really good. The cinematography is good, the film makes good use of the scenic beauty of New York and its Hudson River, and the filming locations were chosen and used in the best way possible. The soundtrack is essentially banal and unremarkable.", "created_at": "2022-08-16T23:59:29.971Z"}, {"movie_id": 363676, "review_id": "57e116cd92514104490053d5", "author_rating": null, "review_text": "Segera bergabung dengan Lapakqq dapatkan hadiah dan bonus menarik. \r\nNikmati bagaimana rasanya menjadi bandar yang sesungguhnya. \r\nJangan sampai ketinggalan ya.\r\n\r\nLapakqq Menyediakan Promo Menarik :\r\n\r\n• Bonus Referral 10%+10%\r\n• Bonus TurnOver 0.5% \r\n\r\nDengan Proses DEPO & WD cepat.\r\nPelayanan yang selalu mengutamakan anda, di jamin tidak bosen dan nyaman dengan apa yang di berikan.\r\nJADI ??Tunggu apa Lagi. Kunjungi www.lapakqq.com sekarang.\r\n\r\nkami menyediakan website untuk anda, 6 permainan dalam 1 web.\r\n? Poker Online\r\n? DominoQQ\r\n? BandarQ\r\n? AduQ\r\n? Capsa Susun\r\n? Bandar Poker\r\n\r\n\r\nKAMI MELAYANI 24JAM UNTUK ANDA!", "created_at": "2016-09-20T11:00:29.900Z"}, {"movie_id": 363676, "review_id": "57e21174c3a36808c3007274", "author_rating": null, "review_text": "Filmmaker Clint Eastwood is certainly no stranger to overseeing exploratory biopics and his latest effort in **Sully** definitely supports his cinematic vision for spotlighting an unknown everyday aviation professional into an overnight national hero. Thus, airline pilot Captain Chesley \"Sully\" Sullenberger became an inspirational savior courtesy of the potentially fateful day on January 15, 2009 when US Airways Flight 1749 morphed into the celebrated newsworthy incident dubbed \"Miracle on the Hudson\" \r\n\r\nIn **Sully** Eastwood and screenwriter Todd Kormarinski presents Captain Sullenberger as an understated hero in the unconventional sense. Indeed, Sullenberger had his personal demons and doubts about that critical day years ago when his quick decision to land the doomed aircraft in the icy waters of the Hudson River in the aftermath of a freakish occurrence when a flock of birds managed to disable the engine's operation shortly after takeover from LaGuardia Airport. The label of \"hero\" may have been somewhat flattering for the veteran pilot in light of his accomplishment in saving the lives of his 155 passengers and crew courtesy of a risky landing that could have been their hellish watery graves. However, the burdensome christening of \"hero\" weighed heavily on Sullenberger especially when insulting suspicions arose questioning the pilot's actions. Sure, Sullenberger basked in instant adulation but his private torment was almost as haunting as the near tragedy he prevented when ensuring the airborne safety of those jeopardized on board.  \r\n\r\nThe challenging task in **Sully** was to create the tension and psychological strife behind an infamous 6-minute flight headed for disaster. Thankfully, Eastwood's steady direction and Komarnicki's adventurous script captures the tense and anxiety-driven moments that fuels **Sully's** soulful foundation. More important, two-time Oscar winner Tom Hanks diligently fits the bill as the beleaguered Captain Sullenberger whose personalized battles with heroism caused pressured ambivalence and self-inflicted guilt. It has been an awful long time since Hanks was tapped for an Oscar nomination so let's hope that his solid work in **Sully** warrants Academy Award consideration. \r\n\r\nSome may be rather cynical about Eastwood's daring narrative as the self-explanatory story has been interpreted in so many news accounts, documentaries, the personal accounts from the Flight 1749 survivors and to a certain extent Captain Sullenberger himself. Still, **Sully** sets out to examine a conflicted and confused man second guessing his aviation skills and instincts as an individual thrust into the national spotlight with a combination of hope and hesitation. \r\n\r\nNot only had the quick-thinking Sully and co-pilot Jeff Skiles (Aaron Eckhart in a welcomed, absorbing supporting role) dodged a major catastrophe when accidentally flying into the cluttered Canadian geese that caused the ice-cold water landing in the Hudson but they were actually scrutinized by the National Transportation Safety Board (NTSB) regarding Sully's decision not to return the malfunctioning plane to LaGuardia Airport or toward a nearby airport therefore opting to gamble using the Hudson River as the immediate surface available to land.  \r\n\r\nNaturally, the sudden media attention anointing the heralded pilot as a heroic soul coupled with the mixed reception of the buzz-killers in the NTSB speculating that foul play may have been involved for the piloting tandem of Flight 1549 understandably heightened the self-doubts and generated Sully's Post-Traumatic Stress Disorder. In the meantime, Sullenberger's wife Lorrie (Academy Award nominee Laura Linney) as well as other close family and associates are constantly being hounded by intrusive reporters in their attempt to get an exclusive piece of the cherished \"man of the moment\" in Chesley \"Sully\" Sullenberger.\r\n\r\nGranted that **Sully** will not go down as one of the flashiest biopics to cross our paths on the big screen in recent years. But Eastwood does deserve credit for showcasing the somber and beleaguered Sullenberger as a low-key, loyal isolationist dealing with the newfound fame and appreciation he is awkwardly at odds with facing as the Hudson River landing/rescue still chomps at his tainted psyche. Hanks's portrayal of the extremely likable but reluctant hero with lingering reservations is a stark contrast to contemporary cinematic heroes that routinely defeat monsters and aliens, parade around as slick and resilient super spies, wear superhero masks and capes, solemnly walk the mean streets with ready-made badges and firearms or are war-torn warriors from ancient historical times. Quite frankly, Chesley \"Sully\" Sullemberger is a flawed yet conscientious man urged to question his own courageousness and professional conviction.  \r\n\r\nEckhart's Stiles is effectively drawn as Sully's ardent supporter whose disbelief is tested when the NTSB has the nervy gumption to place his capable colleague under the dubious microscope after his amazing endeavor in protecting the sacred lives all on board the panicky plane destined for its doomsday fate. Conveniently, Eastwood inserts Anna Gunn (from TV's \"Breaking Bad\") as one of the perceived NTSB interrogating \"baddies\" trying to pin the wrap on Sully's numb shoulders in reference to his troubling flight methods. Linney, always the talented and involving actress, is merely reduced to displaying the commonplace hysterics of Sully's concerned spouse. \r\n\r\nPerhaps **Sully** is not the most thoroughly in-depth biopic one would have imagined because we are working with the perplexing man whose heroic actions made us aware of this seasoned phenomenal flyboy glorified in our living rooms nearly two decades ago. There is not much to ponder about Eastwood's fictitious Sullenberger from his past that gives insight to his current-day characterization as the media-praised hero-in-healing. In all fairness, Captain Chesley \"Sully\" Sullenberger's claim to fame was his hasty option to spare the endangered existences of his passengers and crew so Eastwood allows his problematic protagonist's questionable heroics to paint the picture as the incredible individual whose January 2009 resourcefulness spoke more truthfully than any miscellaneous flashbacks could do to justify Sully's angst-ridden tendencies.  \r\n\r\nOverall, **Sully** establishes a different kind of turbulence for an introspective yet gently intense wounded wonder tip toeing on the borderline of deserved and deceptive worship.  \r\n\r\n**Sully** (2016)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Tom Hanks, Aaron Eckhart, Laura Linney, Jeffrey Nordling, Jamey Sheridan, Michael Rappaport, Anna Gunn, Valarie Mahaffey\r\n\r\nDirected by: Clint Eastwood\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Drama/Biopic\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-09-21T04:49:56.832Z"}, {"movie_id": 363676, "review_id": "585ea0dec3a3681a6201055d", "author_rating": 8.0, "review_text": "**When a real human bravery wasn't appreciated till the computers confirmed it.**\r\n\r\nAnother excellent biographical drama for Tom Hanks in the title role. He has transformed from captain Phillips to captain Sully. Another great addition to Clint Eastwood's filmography as well, he never disappoints us. This film was based on the real event of the January 15, 2009. When a US passenger plane got hit by birds just after the take off, losing both the engines, landed on the New York's Hudson river. So the film reveals the heroic event, as well as followed by the investigation of the crash landing.\r\n\r\nAs it is a Hollywood film what should I expect, another American bravery? Yep, but still a good film, very engaging plot. It's not all about the plane event, because I thought one of the film poster is a spoiler. So the film covers more story, about the drama surrounding the main event. Especially saving the lives, that inspires even for the outside Americans. The entire narration is about two-three day affair, but most of the film was about the crash landing. From the actors to the visuals, all were top class. One of the best biopic that's not based on one's whole life, but one heroic attempt which will be remembered him and this film for forever.\r\n\r\n_8/10_", "created_at": "2016-12-24T16:22:54.521Z"}, {"movie_id": 363676, "review_id": "6056be1a6e3deb0054e7b24a", "author_rating": 9.0, "review_text": "Top class, as expected.\r\n\r\n<em>'Sully'</em> is great. Tom Hanks absolutely nails it as the titular character, he is undoubtedly the perfect cast for the role. An outstanding actor, as we all know. The plot is told in a way that I personally enjoyed, I liked seeing the different snippets of time.\r\n\r\nThough no-one is on the same level as Hanks in this, there are a few other good performers. Aaron Eckhart (Jeff) does well, while there are less important roles for people like Anna Gunn (Elizabeth) and Michael Rapaport (Pete). I have no issues with the casting, that's for sure.\r\n\r\nIt's a crazy true story, mad that it happened way back in 2009 - feels more recent, strangely. I assume it uses the usual creative license that practically every film does, which I'm fine with. It delivers as a quality film, which is all I truly care about.", "created_at": "2021-03-21T03:31:38.363Z"}, {"movie_id": 363676, "review_id": "62fc2f615f6c49007d22ace3", "author_rating": 6.0, "review_text": "**Based on real events, the film does full justice to what happened, despite not being a particularly memorable film for any of those involved.**\r\n\r\nOn January 15, 2009, the American people (and the entire world) saw with amazement and great joy the way in which a commercial airliner, after hitting a flock of birds and losing its two engines, managed to cheat death and land safely in the waters of the Hudson River in New York. The pilot, Chelsey Sullenberger, was widely credited for the aerial feat, having managed to save everyone on the plane and limit the incident to material damage. In fact, the veteran pilot largely ignored the instructions from the Tower, trusted his instincts and experience, and made the right decision.\r\n\r\nNo wonder, then, that it all ended up on film. Clint Eastwood has done better and more notable works in his directing career, but he's in good shape here, and the film fully honors what happened that day. However, the film lacks tension and drama, and most of the action takes place after the accident, throughout the long investigation in which the authorities tried to verify what happened, and to what extent could they blame the pilots of that plane.\r\n\r\nTom Hanks is one of those actors that we can call a “safe bet”. Whatever film he decides to make, it's almost guaranteed that the actor will put in his best effort and do his job to the best of his ability. And this film was no exception, with a good performance, in which Hanks managed to capture very well the voice, gestures and mannerisms of the real person he imitated, and who he knew to be able to do so. Aaron Eckhart also rose to the challenge, giving his character a touch of unpretentious humor that suits him well, as well as giving Hanks a very welcome backing. Unfortunately, on the part of the cast, there is nothing else good to point out. Laura Linney did everything she could with her character, but she doesn't have any material or relevance to help her. The evaluators who analyze what happened, however, are the film's most ungrateful and poorly written characters because, for increased dramatic effects, they are virtually demonized.\r\n\r\nTechnically, the film is pretty decent. There are glaring flaws of anachronism in between, that the most attentive eye can easily find, such as the deciduous trees that are green despite the fact that the film takes place in the middle of winter, and also there is not a single person on that crashed plane that we can see the breath of (something common on colder days, when we see our breath as a vapor). The plane scenes were very well done and the CGI used was really good. The cinematography is good, the film makes good use of the scenic beauty of New York and its Hudson River, and the filming locations were chosen and used in the best way possible. The soundtrack is essentially banal and unremarkable.", "created_at": "2022-08-16T23:59:29.971Z"}, {"movie_id": 363676, "review_id": "57e116cd92514104490053d5", "author_rating": null, "review_text": "Segera bergabung dengan Lapakqq dapatkan hadiah dan bonus menarik. \r\nNikmati bagaimana rasanya menjadi bandar yang sesungguhnya. \r\nJangan sampai ketinggalan ya.\r\n\r\nLapakqq Menyediakan Promo Menarik :\r\n\r\n• Bonus Referral 10%+10%\r\n• Bonus TurnOver 0.5% \r\n\r\nDengan Proses DEPO & WD cepat.\r\nPelayanan yang selalu mengutamakan anda, di jamin tidak bosen dan nyaman dengan apa yang di berikan.\r\nJADI ??Tunggu apa Lagi. Kunjungi www.lapakqq.com sekarang.\r\n\r\nkami menyediakan website untuk anda, 6 permainan dalam 1 web.\r\n? Poker Online\r\n? DominoQQ\r\n? BandarQ\r\n? AduQ\r\n? Capsa Susun\r\n? Bandar Poker\r\n\r\n\r\nKAMI MELAYANI 24JAM UNTUK ANDA!", "created_at": "2016-09-20T11:00:29.900Z"}, {"movie_id": 363676, "review_id": "57e21174c3a36808c3007274", "author_rating": null, "review_text": "Filmmaker Clint Eastwood is certainly no stranger to overseeing exploratory biopics and his latest effort in **Sully** definitely supports his cinematic vision for spotlighting an unknown everyday aviation professional into an overnight national hero. Thus, airline pilot Captain Chesley \"Sully\" Sullenberger became an inspirational savior courtesy of the potentially fateful day on January 15, 2009 when US Airways Flight 1749 morphed into the celebrated newsworthy incident dubbed \"Miracle on the Hudson\" \r\n\r\nIn **Sully** Eastwood and screenwriter Todd Kormarinski presents Captain Sullenberger as an understated hero in the unconventional sense. Indeed, Sullenberger had his personal demons and doubts about that critical day years ago when his quick decision to land the doomed aircraft in the icy waters of the Hudson River in the aftermath of a freakish occurrence when a flock of birds managed to disable the engine's operation shortly after takeover from LaGuardia Airport. The label of \"hero\" may have been somewhat flattering for the veteran pilot in light of his accomplishment in saving the lives of his 155 passengers and crew courtesy of a risky landing that could have been their hellish watery graves. However, the burdensome christening of \"hero\" weighed heavily on Sullenberger especially when insulting suspicions arose questioning the pilot's actions. Sure, Sullenberger basked in instant adulation but his private torment was almost as haunting as the near tragedy he prevented when ensuring the airborne safety of those jeopardized on board.  \r\n\r\nThe challenging task in **Sully** was to create the tension and psychological strife behind an infamous 6-minute flight headed for disaster. Thankfully, Eastwood's steady direction and Komarnicki's adventurous script captures the tense and anxiety-driven moments that fuels **Sully's** soulful foundation. More important, two-time Oscar winner Tom Hanks diligently fits the bill as the beleaguered Captain Sullenberger whose personalized battles with heroism caused pressured ambivalence and self-inflicted guilt. It has been an awful long time since Hanks was tapped for an Oscar nomination so let's hope that his solid work in **Sully** warrants Academy Award consideration. \r\n\r\nSome may be rather cynical about Eastwood's daring narrative as the self-explanatory story has been interpreted in so many news accounts, documentaries, the personal accounts from the Flight 1749 survivors and to a certain extent Captain Sullenberger himself. Still, **Sully** sets out to examine a conflicted and confused man second guessing his aviation skills and instincts as an individual thrust into the national spotlight with a combination of hope and hesitation. \r\n\r\nNot only had the quick-thinking Sully and co-pilot Jeff Skiles (Aaron Eckhart in a welcomed, absorbing supporting role) dodged a major catastrophe when accidentally flying into the cluttered Canadian geese that caused the ice-cold water landing in the Hudson but they were actually scrutinized by the National Transportation Safety Board (NTSB) regarding Sully's decision not to return the malfunctioning plane to LaGuardia Airport or toward a nearby airport therefore opting to gamble using the Hudson River as the immediate surface available to land.  \r\n\r\nNaturally, the sudden media attention anointing the heralded pilot as a heroic soul coupled with the mixed reception of the buzz-killers in the NTSB speculating that foul play may have been involved for the piloting tandem of Flight 1549 understandably heightened the self-doubts and generated Sully's Post-Traumatic Stress Disorder. In the meantime, Sullenberger's wife Lorrie (Academy Award nominee Laura Linney) as well as other close family and associates are constantly being hounded by intrusive reporters in their attempt to get an exclusive piece of the cherished \"man of the moment\" in Chesley \"Sully\" Sullenberger.\r\n\r\nGranted that **Sully** will not go down as one of the flashiest biopics to cross our paths on the big screen in recent years. But Eastwood does deserve credit for showcasing the somber and beleaguered Sullenberger as a low-key, loyal isolationist dealing with the newfound fame and appreciation he is awkwardly at odds with facing as the Hudson River landing/rescue still chomps at his tainted psyche. Hanks's portrayal of the extremely likable but reluctant hero with lingering reservations is a stark contrast to contemporary cinematic heroes that routinely defeat monsters and aliens, parade around as slick and resilient super spies, wear superhero masks and capes, solemnly walk the mean streets with ready-made badges and firearms or are war-torn warriors from ancient historical times. Quite frankly, Chesley \"Sully\" Sullemberger is a flawed yet conscientious man urged to question his own courageousness and professional conviction.  \r\n\r\nEckhart's Stiles is effectively drawn as Sully's ardent supporter whose disbelief is tested when the NTSB has the nervy gumption to place his capable colleague under the dubious microscope after his amazing endeavor in protecting the sacred lives all on board the panicky plane destined for its doomsday fate. Conveniently, Eastwood inserts Anna Gunn (from TV's \"Breaking Bad\") as one of the perceived NTSB interrogating \"baddies\" trying to pin the wrap on Sully's numb shoulders in reference to his troubling flight methods. Linney, always the talented and involving actress, is merely reduced to displaying the commonplace hysterics of Sully's concerned spouse. \r\n\r\nPerhaps **Sully** is not the most thoroughly in-depth biopic one would have imagined because we are working with the perplexing man whose heroic actions made us aware of this seasoned phenomenal flyboy glorified in our living rooms nearly two decades ago. There is not much to ponder about Eastwood's fictitious Sullenberger from his past that gives insight to his current-day characterization as the media-praised hero-in-healing. In all fairness, Captain Chesley \"Sully\" Sullenberger's claim to fame was his hasty option to spare the endangered existences of his passengers and crew so Eastwood allows his problematic protagonist's questionable heroics to paint the picture as the incredible individual whose January 2009 resourcefulness spoke more truthfully than any miscellaneous flashbacks could do to justify Sully's angst-ridden tendencies.  \r\n\r\nOverall, **Sully** establishes a different kind of turbulence for an introspective yet gently intense wounded wonder tip toeing on the borderline of deserved and deceptive worship.  \r\n\r\n**Sully** (2016)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Tom Hanks, Aaron Eckhart, Laura Linney, Jeffrey Nordling, Jamey Sheridan, Michael Rappaport, Anna Gunn, Valarie Mahaffey\r\n\r\nDirected by: Clint Eastwood\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Drama/Biopic\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-09-21T04:49:56.832Z"}, {"movie_id": 363676, "review_id": "585ea0dec3a3681a6201055d", "author_rating": 8.0, "review_text": "**When a real human bravery wasn't appreciated till the computers confirmed it.**\r\n\r\nAnother excellent biographical drama for Tom Hanks in the title role. He has transformed from captain Phillips to captain Sully. Another great addition to Clint Eastwood's filmography as well, he never disappoints us. This film was based on the real event of the January 15, 2009. When a US passenger plane got hit by birds just after the take off, losing both the engines, landed on the New York's Hudson river. So the film reveals the heroic event, as well as followed by the investigation of the crash landing.\r\n\r\nAs it is a Hollywood film what should I expect, another American bravery? Yep, but still a good film, very engaging plot. It's not all about the plane event, because I thought one of the film poster is a spoiler. So the film covers more story, about the drama surrounding the main event. Especially saving the lives, that inspires even for the outside Americans. The entire narration is about two-three day affair, but most of the film was about the crash landing. From the actors to the visuals, all were top class. One of the best biopic that's not based on one's whole life, but one heroic attempt which will be remembered him and this film for forever.\r\n\r\n_8/10_", "created_at": "2016-12-24T16:22:54.521Z"}, {"movie_id": 363676, "review_id": "6056be1a6e3deb0054e7b24a", "author_rating": 9.0, "review_text": "Top class, as expected.\r\n\r\n<em>'Sully'</em> is great. Tom Hanks absolutely nails it as the titular character, he is undoubtedly the perfect cast for the role. An outstanding actor, as we all know. The plot is told in a way that I personally enjoyed, I liked seeing the different snippets of time.\r\n\r\nThough no-one is on the same level as Hanks in this, there are a few other good performers. Aaron Eckhart (Jeff) does well, while there are less important roles for people like Anna Gunn (Elizabeth) and Michael Rapaport (Pete). I have no issues with the casting, that's for sure.\r\n\r\nIt's a crazy true story, mad that it happened way back in 2009 - feels more recent, strangely. I assume it uses the usual creative license that practically every film does, which I'm fine with. It delivers as a quality film, which is all I truly care about.", "created_at": "2021-03-21T03:31:38.363Z"}, {"movie_id": 363676, "review_id": "62fc2f615f6c49007d22ace3", "author_rating": 6.0, "review_text": "**Based on real events, the film does full justice to what happened, despite not being a particularly memorable film for any of those involved.**\r\n\r\nOn January 15, 2009, the American people (and the entire world) saw with amazement and great joy the way in which a commercial airliner, after hitting a flock of birds and losing its two engines, managed to cheat death and land safely in the waters of the Hudson River in New York. The pilot, Chelsey Sullenberger, was widely credited for the aerial feat, having managed to save everyone on the plane and limit the incident to material damage. In fact, the veteran pilot largely ignored the instructions from the Tower, trusted his instincts and experience, and made the right decision.\r\n\r\nNo wonder, then, that it all ended up on film. Clint Eastwood has done better and more notable works in his directing career, but he's in good shape here, and the film fully honors what happened that day. However, the film lacks tension and drama, and most of the action takes place after the accident, throughout the long investigation in which the authorities tried to verify what happened, and to what extent could they blame the pilots of that plane.\r\n\r\nTom Hanks is one of those actors that we can call a “safe bet”. Whatever film he decides to make, it's almost guaranteed that the actor will put in his best effort and do his job to the best of his ability. And this film was no exception, with a good performance, in which Hanks managed to capture very well the voice, gestures and mannerisms of the real person he imitated, and who he knew to be able to do so. Aaron Eckhart also rose to the challenge, giving his character a touch of unpretentious humor that suits him well, as well as giving Hanks a very welcome backing. Unfortunately, on the part of the cast, there is nothing else good to point out. Laura Linney did everything she could with her character, but she doesn't have any material or relevance to help her. The evaluators who analyze what happened, however, are the film's most ungrateful and poorly written characters because, for increased dramatic effects, they are virtually demonized.\r\n\r\nTechnically, the film is pretty decent. There are glaring flaws of anachronism in between, that the most attentive eye can easily find, such as the deciduous trees that are green despite the fact that the film takes place in the middle of winter, and also there is not a single person on that crashed plane that we can see the breath of (something common on colder days, when we see our breath as a vapor). The plane scenes were very well done and the CGI used was really good. The cinematography is good, the film makes good use of the scenic beauty of New York and its Hudson River, and the filming locations were chosen and used in the best way possible. The soundtrack is essentially banal and unremarkable.", "created_at": "2022-08-16T23:59:29.971Z"}]