[{"movie_id": 9543, "review_id": "563da826c3a3681b4b027490", "author_rating": 7.0, "review_text": "Sands to the future.\r\n\r\nI guess ultimately it is what it is, a Disney backed video game adaptation of the blockbuster kind.\r\n\r\nIn truth it works just fine and dandy as a family fantasy adventure, with swords and sandals - shields and sarongs, all in abundance. There's the mythical and the magical, the swish and the swash, the HD photography a treat for the eyes. The leads are pretty, likable and energetic, and even though it consistently reminds us that it is based on a video game (jumping and rolling, jumping and rolling), the choreography is niftily arranged and there's a lovely old fashioned feel to the story; which works in that wonderful Sinbadish way.\r\n\r\nNot perfect by any stretch of the imagination, and if one was so inclined? One could deconstruct the faults of the production with the same clinical impact of that achieved by Ben Kingsley's (Sir) wallet when it hit the floor after this paycheck was deposited. It should be viewed in the spirit of how Alfred Molina plays his character, with tongue in cheek and a complete understanding of how to have a good time with popcorn fluff. Prince of Persia is forgettable come the end credits, but at least it was a fun date. And for that we are truly grateful. 7/10", "created_at": "2015-11-07T07:28:38.834Z"}, {"movie_id": 9543, "review_id": "5ec3be268e2e0000201b9ccc", "author_rating": 5.0, "review_text": "It's very, very bad but I guess I was in just the right mood for it because I actually kind of enjoyed watching _Prince of Persia_. I can't pinpoint even a single good thing about it, whereas I can immediately conjure many of its failings, but I just remember having some fun. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-05-19T11:08:22.529Z"}, {"movie_id": 9543, "review_id": "5fa88f40ffc9de003c8c8a4f", "author_rating": 7.0, "review_text": "Never played the video game, but I enjoyed this film suitably.\r\n\r\nIt has flaws, though there's enough to like about <em>'Prince of Persia: The Sands of Time'</em>. I rate Jake Gyllenhaal as an actor, while I don't think he's perfect for this role I did enjoy his performance all in all. The special effects are neat, especially for the dagger. The support cast are satisfactory, Alfred Molina being the standout behind Gyllenhaal.\r\n\r\nThe premise is a pretty fascinating one, but I don't feel there is enough there for a near 2hr production. It felt, a number of times, that the story was going round in circles and overextending itself in order to fill the run time, there are many times where 'A' runs from 'B', 'B' finds 'A' instantly, 'A' gets away. In many different guises, but it kept happening.\r\n\r\nCould've been far greater, but I still come away from viewing this fairly positively.", "created_at": "2020-11-09T00:37:20.208Z"}, {"movie_id": 9543, "review_id": "63cc5055cee481007cdcc274", "author_rating": 7.0, "review_text": "**Prince of Persia has plenty of flaws but ultimately is a great action adventure film full of fun and worth your time.**\r\n\r\nPrince of Persia is a great action adventure with elements of Indiana Jones, The Mummy, and Tomb Raider. While it doesn’t rise to the heights of those films, it’s still an entertaining film filled with beautiful set pieces, excellent action, and a unique story. There are a lot of complaints about this film, such as casting choices and mediocre CGI, and while some of that might be valid, if accepted for what it is, Prince of Persia is a ton of fun! While a surprising choice for the role, Gyllenhaal commits to the action and stunts and makes Dastan a likable hero. Ben Kingsley is always excellent in whatever he does, and so is Gemma Arterton. I really do enjoy this movie and would recommend it to anyone who loves a good, fun adventure film.", "created_at": "2023-01-21T20:51:33.767Z"}]