[{"movie_id": 20526, "review_id": "51ec287319c295369c3a2e05", "author_rating": null, "review_text": "Where do you start with Tron: Legacy? It’s a sequel to a minor cult hit that arrived in theaters 28 years ago, a film more renown for its (at the time) state-of-the-art design than its coherent story or classic characters, rekindled now not as a reboot or remake, but as a direct sequel to that long-ago work.\r\n\r\nTron's esteem may have grown in the intervening years (much the same fate as another maligned-at-the-time science fiction film, Blade Runner), but time has been mostly unkind to it; Disney attempted to stage a run of pre-LEGACY screenings of the original film, but modern audiences greeted its dated appeal as unintentionally hilarious. Frightened by the impact this might have had on their $170 million spectacle, they pulled plans for a theatrical release, and whisked the recent 25th anniversary DVD off of store shelves. And so, bereft of a childhood that contained Tron, I went into the sequel with naught but a Wikipedia plot breakdown (which was, to be honest, frustratingly informative) to fill in what turned out to be largely irrelevant narrative gaps. I say that to say that I am reviewing Legacy solely for Legacy's sake, untainted by nostalgia or high expectations.\r\n\r\nMore than two decades after the events of the first film (which, for the uninitiated, involve a computer programmer [Jeff Bridges, reprising his role] being zapped from the physical world into the computer world he created and fighting an oppressive digital tyrant within), we’re introduced to that computer programmer’s twenty-something kid, heir to his father’s tech empire and not terribly happy about it. It seems he’s still hung up on his father’s mysterious disappearance long ago, and a mysterious message leads to him discovering Dear Old Dad’s secret underground lab, where he’s accidentally zapped into the digital world as well. I’m afraid I’m not spoiling anything to go ahead and say that within he finds his trapped father, and they must fight their way back out. To give more plot details would be unfair and pointless. Suffice to say that once within the digital realm, it becomes action beat after action beat wherein our young hero rescues dad and his requisite romantic interest until the film ends.\r\n\r\nOh sure, there are good guys, and there are bad guys, and there’s a token stab at depth, but what does it matter? That digital world looks really cool, right? And that’s why we go. The sad truth of the matter, however, is that what looks awesome in a two-minute trailer begins to wear on the eyes when presented long-form. “The Grid” exists in three colors: neon blue, neon orange, and black. Well, two colors and an absence of color, I suppose. As nifty as this may seem, two-plus hours of this (particularly at the reduced light offered by 3D projection) robs it of interest, and the whole thing becomes a dull slog. 3D works by enhancing depth, but little to no depth is present when the film is lit and shot in such a stylized manner. To boot, only the bad guys are orange. And as our audience proxy characters are good, we’re robbed even of the contrasting orange to break up the monotony.\r\n\r\nThere are some neat sequences, of course: the initial lightcycle battle, a digital dogfight later on, etc. Garret Hedlund and Oliva Wilde are perfectly fine in their frankly bland roles, and Jeff Bridges squeezes what depth he can into his dual characters (actual Kevin Flynn and his twenty-years-younger digital duplicate, thanks to some unnerving but nifty visual trickery). The film is far from the unwatchable dreck of, say, The Chronicles of Narnia: Voyage of the Dawn Treader. It’s just...not very interesting. Techno group Daft Punk’s score was easily the best part of the film, and something I’d actually recommend picking up with no hesitations. At its best, the Daft Punk score and stylized imagery (early in the film, before it wears you down) do provide a unique and imaginative experience. It’s just one fit for the length of a music video, not a feature film.\r\n\r\nBut let’s not kid ourselves: Tron: Legacy is a flashy, ridiculous spectacle that exists solely to put pretty pictures onscreen for two hours and drive a $4+ 3D surcharge. And I say that with no judgment. Some films simply are what they are, and you’ve no more right to expect a dog to meow than to glean from them deep meditations on the human condition. The history of cinema is full of this kind of shallow but aloofly entertaining distraction. But is it wrong to want more of these kinds of films? Take Star Wars, for instance: its strength lies mainly in its revolutionary aesthetic and special effects, but it’s the characters that we remember from the film, not just how cool some set-piece looked. And Lucas isn’t even a terribly good writer; the strength of his characters came from that universal pull all great archetypes have, that ability for audience identification and empathy. Will the name Sam Flynn have the same kind of longevity? What about...uh, Oliva Wilde’s character? Apparently not, at least for me. (Note: IMDb says it’s “Quorra.”) If nostalgia for the first film is strong for you, or you’ve no qualms about paying $14+ for a mildly-distracting if uninvolving experience, go for it. Everyone else may as well save themselves the money. Maybe catch it on Blu-ray.\r\n\r\nI should note, though, that I can honestly say 3D added nothing to the experience, so if you want to be able to actually see in The Grid, save yourself the money and hop into a 2D seat.", "created_at": "2013-07-21T18:29:07.589Z"}, {"movie_id": 20526, "review_id": "5fab1cec53866e004016a6ad", "author_rating": 8.0, "review_text": "A massive upgrade on the first film, at least for someone like me who certainly doesn't enjoy the 1982 production.\r\n\r\n<em>'TRON: Legacy'</em> is much more vibrant, developed and tangible. I actually formed a connection with the characters in this one, which is the complete opposite to the original. The special effects (bar the de-aging) are a vast improvement, which is to be expected in fairness; I love the look of this.\r\n\r\nIt's nice to get a proper view into the 'outside' lives of the protagonists, rather than receiving a tiny backstory before shoving them into the new universe; I appreciated the build-up to the eventual entry. The score is also terrific, even if it's strange hearing Daft Punk's \"Outlands\" due to my familiarity of it coming from Sky Sports UK's Formula 1 opening credits.\r\n\r\nGarrett Hedlund is great in the role Sam, I enjoyed his performance from the get-go. Jeff Bridges is excellent too, I feel all the actors in general were given much more to work with in this one; I barely took notice of Bridges (& Co.) in the predecessor, but he stands out big here. Olivia Wilde and Michael Sheen are good, also. Cillian Murphy even makes a minute appearance.\r\n\r\nIt does, at least to me, feel like a very different film when compared to <em>'Tron'</em>, which may disappoint lovers of the latter but will be relief to opposing folk; e.g. me.\r\n\r\nWasn't sure what to expect from this, but thankfully it produces an entertaining time.", "created_at": "2020-11-10T23:06:20.606Z"}, {"movie_id": 20526, "review_id": "630015f93e6f2b007a9d6fa4", "author_rating": 8.0, "review_text": "**Overall : Kosinski upgrades TRON in every way for a new generation with this stunning sci-fi adventure.**\r\n\r\nBelieve it or not, Top Gun was not the first franchise Joseph Kosinski revives with a legacy sequel over 30 years after the original. And just like Top Gun: Maverick, Kosinski did a masterful job bringing a series back to life. TRON: Legacy improved on its predecessor in every way. I remember seeing it in 3D IMAX and being completely blown away at the effects (although the de-aging effects are pretty dated but were impressive at the time), the soundtrack, the story, and the acting. Kosinski connected the past with the modern age by bringing back Jeff Bridges and Bruce Boxleitner while providing a story that engages and intrigues a new generation. I can't say I was a major fan of the original, but I loved this movie. This sci-fi adventure felt like the beginning of something incredible, but sadly Disney acquired Marvel shortly after the release of TRON: Legacy and shifted their focus to the MCU. Hopefully, after Kosinski's success with Top Gun: Maverick, the chances of a TRON 3 will be reignited because I am ready for more!", "created_at": "2022-08-19T23:00:09.075Z"}, {"movie_id": 20526, "review_id": "6375645e3c3ab000b822eb0d", "author_rating": 3.0, "review_text": "**Lots of style, lots of high-quality visuals, but little substance.**\r\n\r\nThere are things that are inexplicable, and one of them is how “Tron” managed to become popular, even after not being a big hit in its time. I have already written about it and I stand by what I said: it is a film that I understand, that came in the wake of a popular fever around everything electronic, but that was made before its time, with visual and special effects that, today, seem as archaic as a 1990s cell phone. I don't know if this movie should be a sequel or if it should have been made a remake instead, but there's no doubt about the superiority of this movie: not only does it feature visual effects and CGI of great beauty and quality, as it has a frankly better script (which does not mean perfection).\r\n\r\nIndeed, the script is satisfactory, presenting an unlikely story, where a very rich young man decides to sabotage his own company thinking he is doing what his father, who disappeared for years, would approve. After that, he receives a message from his father, and the clue leads him to an old arcade, long closed, and to his father's old computer. It is there that the young man is sucked into a cybernetic space, controlled by a vile and dictatorial program. Yes, humans sucked, physically speaking, into computers. As if social media weren't enough! Added to this, the worn-out clichés of the relationship between an absent father and a needy son, an essay on a loving sub-plot without any logic, a cartoon villain without personality and made to hate.\r\n\r\nJeff Bridges returns to the character he played in the first film, both in the person of the actor we know, and in the figure of a young alter-ego, created digitally. The actor is good, and we already know his merits, but the truth is that he doesn't seem to be in great shape. He accompanies the film, following the action, but he is not particularly noticeable in this work, as he was not in the initial film. Garrett Hedlund has a little more visibility and is, in fact, the protagonist here, but he doesn't do much more than be an action figure.\r\n\r\nIt is in the technical aspects that the film stands out and deserves some praise, particularly thanks to the extraordinary design of the visual effects and the CGI, which are among the most elegant and well-executed we have seen. Recreating the concepts of the original film, they show a cleaner and more finished look, without obvious gimmicks that are unbelievable to the eyes, and with much better worked colors. However, a film is not made of style and extraordinary visuals, and there are many recent examples of visually amazing films that are worthless because they do not have quality stories. Also noteworthy are the sets and costumes, as well as the electronic soundtrack, by the French dJ duo Daft Punk.", "created_at": "2022-11-16T22:29:50.137Z"}, {"movie_id": 20526, "review_id": "645d509a1b70ae0145efd180", "author_rating": 7.0, "review_text": "I was a huge fan of the original Tron when I was a wee scamp, so when the sequel finally came about I was well up for it. Unfortunately, it missed the mark by a mile. It looks gorgeous but that's about all it can offer, unless incredibly irritating characters are your thing. The original might look naff by today's standards but it's still a far better movie. Having said that I still can't stop watching this new one, go figure.|", "created_at": "2023-05-11T20:31:22.586Z"}, {"movie_id": 20526, "review_id": "51ec287319c295369c3a2e05", "author_rating": null, "review_text": "Where do you start with Tron: Legacy? It’s a sequel to a minor cult hit that arrived in theaters 28 years ago, a film more renown for its (at the time) state-of-the-art design than its coherent story or classic characters, rekindled now not as a reboot or remake, but as a direct sequel to that long-ago work.\r\n\r\nTron's esteem may have grown in the intervening years (much the same fate as another maligned-at-the-time science fiction film, Blade Runner), but time has been mostly unkind to it; Disney attempted to stage a run of pre-LEGACY screenings of the original film, but modern audiences greeted its dated appeal as unintentionally hilarious. Frightened by the impact this might have had on their $170 million spectacle, they pulled plans for a theatrical release, and whisked the recent 25th anniversary DVD off of store shelves. And so, bereft of a childhood that contained Tron, I went into the sequel with naught but a Wikipedia plot breakdown (which was, to be honest, frustratingly informative) to fill in what turned out to be largely irrelevant narrative gaps. I say that to say that I am reviewing Legacy solely for Legacy's sake, untainted by nostalgia or high expectations.\r\n\r\nMore than two decades after the events of the first film (which, for the uninitiated, involve a computer programmer [Jeff Bridges, reprising his role] being zapped from the physical world into the computer world he created and fighting an oppressive digital tyrant within), we’re introduced to that computer programmer’s twenty-something kid, heir to his father’s tech empire and not terribly happy about it. It seems he’s still hung up on his father’s mysterious disappearance long ago, and a mysterious message leads to him discovering Dear Old Dad’s secret underground lab, where he’s accidentally zapped into the digital world as well. I’m afraid I’m not spoiling anything to go ahead and say that within he finds his trapped father, and they must fight their way back out. To give more plot details would be unfair and pointless. Suffice to say that once within the digital realm, it becomes action beat after action beat wherein our young hero rescues dad and his requisite romantic interest until the film ends.\r\n\r\nOh sure, there are good guys, and there are bad guys, and there’s a token stab at depth, but what does it matter? That digital world looks really cool, right? And that’s why we go. The sad truth of the matter, however, is that what looks awesome in a two-minute trailer begins to wear on the eyes when presented long-form. “The Grid” exists in three colors: neon blue, neon orange, and black. Well, two colors and an absence of color, I suppose. As nifty as this may seem, two-plus hours of this (particularly at the reduced light offered by 3D projection) robs it of interest, and the whole thing becomes a dull slog. 3D works by enhancing depth, but little to no depth is present when the film is lit and shot in such a stylized manner. To boot, only the bad guys are orange. And as our audience proxy characters are good, we’re robbed even of the contrasting orange to break up the monotony.\r\n\r\nThere are some neat sequences, of course: the initial lightcycle battle, a digital dogfight later on, etc. Garret Hedlund and Oliva Wilde are perfectly fine in their frankly bland roles, and Jeff Bridges squeezes what depth he can into his dual characters (actual Kevin Flynn and his twenty-years-younger digital duplicate, thanks to some unnerving but nifty visual trickery). The film is far from the unwatchable dreck of, say, The Chronicles of Narnia: Voyage of the Dawn Treader. It’s just...not very interesting. Techno group Daft Punk’s score was easily the best part of the film, and something I’d actually recommend picking up with no hesitations. At its best, the Daft Punk score and stylized imagery (early in the film, before it wears you down) do provide a unique and imaginative experience. It’s just one fit for the length of a music video, not a feature film.\r\n\r\nBut let’s not kid ourselves: Tron: Legacy is a flashy, ridiculous spectacle that exists solely to put pretty pictures onscreen for two hours and drive a $4+ 3D surcharge. And I say that with no judgment. Some films simply are what they are, and you’ve no more right to expect a dog to meow than to glean from them deep meditations on the human condition. The history of cinema is full of this kind of shallow but aloofly entertaining distraction. But is it wrong to want more of these kinds of films? Take Star Wars, for instance: its strength lies mainly in its revolutionary aesthetic and special effects, but it’s the characters that we remember from the film, not just how cool some set-piece looked. And Lucas isn’t even a terribly good writer; the strength of his characters came from that universal pull all great archetypes have, that ability for audience identification and empathy. Will the name Sam Flynn have the same kind of longevity? What about...uh, Oliva Wilde’s character? Apparently not, at least for me. (Note: IMDb says it’s “Quorra.”) If nostalgia for the first film is strong for you, or you’ve no qualms about paying $14+ for a mildly-distracting if uninvolving experience, go for it. Everyone else may as well save themselves the money. Maybe catch it on Blu-ray.\r\n\r\nI should note, though, that I can honestly say 3D added nothing to the experience, so if you want to be able to actually see in The Grid, save yourself the money and hop into a 2D seat.", "created_at": "2013-07-21T18:29:07.589Z"}, {"movie_id": 20526, "review_id": "5fab1cec53866e004016a6ad", "author_rating": 8.0, "review_text": "A massive upgrade on the first film, at least for someone like me who certainly doesn't enjoy the 1982 production.\r\n\r\n<em>'TRON: Legacy'</em> is much more vibrant, developed and tangible. I actually formed a connection with the characters in this one, which is the complete opposite to the original. The special effects (bar the de-aging) are a vast improvement, which is to be expected in fairness; I love the look of this.\r\n\r\nIt's nice to get a proper view into the 'outside' lives of the protagonists, rather than receiving a tiny backstory before shoving them into the new universe; I appreciated the build-up to the eventual entry. The score is also terrific, even if it's strange hearing Daft Punk's \"Outlands\" due to my familiarity of it coming from Sky Sports UK's Formula 1 opening credits.\r\n\r\nGarrett Hedlund is great in the role Sam, I enjoyed his performance from the get-go. Jeff Bridges is excellent too, I feel all the actors in general were given much more to work with in this one; I barely took notice of Bridges (& Co.) in the predecessor, but he stands out big here. Olivia Wilde and Michael Sheen are good, also. Cillian Murphy even makes a minute appearance.\r\n\r\nIt does, at least to me, feel like a very different film when compared to <em>'Tron'</em>, which may disappoint lovers of the latter but will be relief to opposing folk; e.g. me.\r\n\r\nWasn't sure what to expect from this, but thankfully it produces an entertaining time.", "created_at": "2020-11-10T23:06:20.606Z"}, {"movie_id": 20526, "review_id": "630015f93e6f2b007a9d6fa4", "author_rating": 8.0, "review_text": "**Overall : Kosinski upgrades TRON in every way for a new generation with this stunning sci-fi adventure.**\r\n\r\nBelieve it or not, Top Gun was not the first franchise Joseph Kosinski revives with a legacy sequel over 30 years after the original. And just like Top Gun: Maverick, Kosinski did a masterful job bringing a series back to life. TRON: Legacy improved on its predecessor in every way. I remember seeing it in 3D IMAX and being completely blown away at the effects (although the de-aging effects are pretty dated but were impressive at the time), the soundtrack, the story, and the acting. Kosinski connected the past with the modern age by bringing back Jeff Bridges and Bruce Boxleitner while providing a story that engages and intrigues a new generation. I can't say I was a major fan of the original, but I loved this movie. This sci-fi adventure felt like the beginning of something incredible, but sadly Disney acquired Marvel shortly after the release of TRON: Legacy and shifted their focus to the MCU. Hopefully, after Kosinski's success with Top Gun: Maverick, the chances of a TRON 3 will be reignited because I am ready for more!", "created_at": "2022-08-19T23:00:09.075Z"}, {"movie_id": 20526, "review_id": "6375645e3c3ab000b822eb0d", "author_rating": 3.0, "review_text": "**Lots of style, lots of high-quality visuals, but little substance.**\r\n\r\nThere are things that are inexplicable, and one of them is how “Tron” managed to become popular, even after not being a big hit in its time. I have already written about it and I stand by what I said: it is a film that I understand, that came in the wake of a popular fever around everything electronic, but that was made before its time, with visual and special effects that, today, seem as archaic as a 1990s cell phone. I don't know if this movie should be a sequel or if it should have been made a remake instead, but there's no doubt about the superiority of this movie: not only does it feature visual effects and CGI of great beauty and quality, as it has a frankly better script (which does not mean perfection).\r\n\r\nIndeed, the script is satisfactory, presenting an unlikely story, where a very rich young man decides to sabotage his own company thinking he is doing what his father, who disappeared for years, would approve. After that, he receives a message from his father, and the clue leads him to an old arcade, long closed, and to his father's old computer. It is there that the young man is sucked into a cybernetic space, controlled by a vile and dictatorial program. Yes, humans sucked, physically speaking, into computers. As if social media weren't enough! Added to this, the worn-out clichés of the relationship between an absent father and a needy son, an essay on a loving sub-plot without any logic, a cartoon villain without personality and made to hate.\r\n\r\nJeff Bridges returns to the character he played in the first film, both in the person of the actor we know, and in the figure of a young alter-ego, created digitally. The actor is good, and we already know his merits, but the truth is that he doesn't seem to be in great shape. He accompanies the film, following the action, but he is not particularly noticeable in this work, as he was not in the initial film. Garrett Hedlund has a little more visibility and is, in fact, the protagonist here, but he doesn't do much more than be an action figure.\r\n\r\nIt is in the technical aspects that the film stands out and deserves some praise, particularly thanks to the extraordinary design of the visual effects and the CGI, which are among the most elegant and well-executed we have seen. Recreating the concepts of the original film, they show a cleaner and more finished look, without obvious gimmicks that are unbelievable to the eyes, and with much better worked colors. However, a film is not made of style and extraordinary visuals, and there are many recent examples of visually amazing films that are worthless because they do not have quality stories. Also noteworthy are the sets and costumes, as well as the electronic soundtrack, by the French dJ duo Daft Punk.", "created_at": "2022-11-16T22:29:50.137Z"}, {"movie_id": 20526, "review_id": "645d509a1b70ae0145efd180", "author_rating": 7.0, "review_text": "I was a huge fan of the original Tron when I was a wee scamp, so when the sequel finally came about I was well up for it. Unfortunately, it missed the mark by a mile. It looks gorgeous but that's about all it can offer, unless incredibly irritating characters are your thing. The original might look naff by today's standards but it's still a far better movie. Having said that I still can't stop watching this new one, go figure.|", "created_at": "2023-05-11T20:31:22.586Z"}, {"movie_id": 20526, "review_id": "51ec287319c295369c3a2e05", "author_rating": null, "review_text": "Where do you start with Tron: Legacy? It’s a sequel to a minor cult hit that arrived in theaters 28 years ago, a film more renown for its (at the time) state-of-the-art design than its coherent story or classic characters, rekindled now not as a reboot or remake, but as a direct sequel to that long-ago work.\r\n\r\nTron's esteem may have grown in the intervening years (much the same fate as another maligned-at-the-time science fiction film, Blade Runner), but time has been mostly unkind to it; Disney attempted to stage a run of pre-LEGACY screenings of the original film, but modern audiences greeted its dated appeal as unintentionally hilarious. Frightened by the impact this might have had on their $170 million spectacle, they pulled plans for a theatrical release, and whisked the recent 25th anniversary DVD off of store shelves. And so, bereft of a childhood that contained Tron, I went into the sequel with naught but a Wikipedia plot breakdown (which was, to be honest, frustratingly informative) to fill in what turned out to be largely irrelevant narrative gaps. I say that to say that I am reviewing Legacy solely for Legacy's sake, untainted by nostalgia or high expectations.\r\n\r\nMore than two decades after the events of the first film (which, for the uninitiated, involve a computer programmer [Jeff Bridges, reprising his role] being zapped from the physical world into the computer world he created and fighting an oppressive digital tyrant within), we’re introduced to that computer programmer’s twenty-something kid, heir to his father’s tech empire and not terribly happy about it. It seems he’s still hung up on his father’s mysterious disappearance long ago, and a mysterious message leads to him discovering Dear Old Dad’s secret underground lab, where he’s accidentally zapped into the digital world as well. I’m afraid I’m not spoiling anything to go ahead and say that within he finds his trapped father, and they must fight their way back out. To give more plot details would be unfair and pointless. Suffice to say that once within the digital realm, it becomes action beat after action beat wherein our young hero rescues dad and his requisite romantic interest until the film ends.\r\n\r\nOh sure, there are good guys, and there are bad guys, and there’s a token stab at depth, but what does it matter? That digital world looks really cool, right? And that’s why we go. The sad truth of the matter, however, is that what looks awesome in a two-minute trailer begins to wear on the eyes when presented long-form. “The Grid” exists in three colors: neon blue, neon orange, and black. Well, two colors and an absence of color, I suppose. As nifty as this may seem, two-plus hours of this (particularly at the reduced light offered by 3D projection) robs it of interest, and the whole thing becomes a dull slog. 3D works by enhancing depth, but little to no depth is present when the film is lit and shot in such a stylized manner. To boot, only the bad guys are orange. And as our audience proxy characters are good, we’re robbed even of the contrasting orange to break up the monotony.\r\n\r\nThere are some neat sequences, of course: the initial lightcycle battle, a digital dogfight later on, etc. Garret Hedlund and Oliva Wilde are perfectly fine in their frankly bland roles, and Jeff Bridges squeezes what depth he can into his dual characters (actual Kevin Flynn and his twenty-years-younger digital duplicate, thanks to some unnerving but nifty visual trickery). The film is far from the unwatchable dreck of, say, The Chronicles of Narnia: Voyage of the Dawn Treader. It’s just...not very interesting. Techno group Daft Punk’s score was easily the best part of the film, and something I’d actually recommend picking up with no hesitations. At its best, the Daft Punk score and stylized imagery (early in the film, before it wears you down) do provide a unique and imaginative experience. It’s just one fit for the length of a music video, not a feature film.\r\n\r\nBut let’s not kid ourselves: Tron: Legacy is a flashy, ridiculous spectacle that exists solely to put pretty pictures onscreen for two hours and drive a $4+ 3D surcharge. And I say that with no judgment. Some films simply are what they are, and you’ve no more right to expect a dog to meow than to glean from them deep meditations on the human condition. The history of cinema is full of this kind of shallow but aloofly entertaining distraction. But is it wrong to want more of these kinds of films? Take Star Wars, for instance: its strength lies mainly in its revolutionary aesthetic and special effects, but it’s the characters that we remember from the film, not just how cool some set-piece looked. And Lucas isn’t even a terribly good writer; the strength of his characters came from that universal pull all great archetypes have, that ability for audience identification and empathy. Will the name Sam Flynn have the same kind of longevity? What about...uh, Oliva Wilde’s character? Apparently not, at least for me. (Note: IMDb says it’s “Quorra.”) If nostalgia for the first film is strong for you, or you’ve no qualms about paying $14+ for a mildly-distracting if uninvolving experience, go for it. Everyone else may as well save themselves the money. Maybe catch it on Blu-ray.\r\n\r\nI should note, though, that I can honestly say 3D added nothing to the experience, so if you want to be able to actually see in The Grid, save yourself the money and hop into a 2D seat.", "created_at": "2013-07-21T18:29:07.589Z"}, {"movie_id": 20526, "review_id": "5fab1cec53866e004016a6ad", "author_rating": 8.0, "review_text": "A massive upgrade on the first film, at least for someone like me who certainly doesn't enjoy the 1982 production.\r\n\r\n<em>'TRON: Legacy'</em> is much more vibrant, developed and tangible. I actually formed a connection with the characters in this one, which is the complete opposite to the original. The special effects (bar the de-aging) are a vast improvement, which is to be expected in fairness; I love the look of this.\r\n\r\nIt's nice to get a proper view into the 'outside' lives of the protagonists, rather than receiving a tiny backstory before shoving them into the new universe; I appreciated the build-up to the eventual entry. The score is also terrific, even if it's strange hearing Daft Punk's \"Outlands\" due to my familiarity of it coming from Sky Sports UK's Formula 1 opening credits.\r\n\r\nGarrett Hedlund is great in the role Sam, I enjoyed his performance from the get-go. Jeff Bridges is excellent too, I feel all the actors in general were given much more to work with in this one; I barely took notice of Bridges (& Co.) in the predecessor, but he stands out big here. Olivia Wilde and Michael Sheen are good, also. Cillian Murphy even makes a minute appearance.\r\n\r\nIt does, at least to me, feel like a very different film when compared to <em>'Tron'</em>, which may disappoint lovers of the latter but will be relief to opposing folk; e.g. me.\r\n\r\nWasn't sure what to expect from this, but thankfully it produces an entertaining time.", "created_at": "2020-11-10T23:06:20.606Z"}, {"movie_id": 20526, "review_id": "630015f93e6f2b007a9d6fa4", "author_rating": 8.0, "review_text": "**Overall : Kosinski upgrades TRON in every way for a new generation with this stunning sci-fi adventure.**\r\n\r\nBelieve it or not, Top Gun was not the first franchise Joseph Kosinski revives with a legacy sequel over 30 years after the original. And just like Top Gun: Maverick, Kosinski did a masterful job bringing a series back to life. TRON: Legacy improved on its predecessor in every way. I remember seeing it in 3D IMAX and being completely blown away at the effects (although the de-aging effects are pretty dated but were impressive at the time), the soundtrack, the story, and the acting. Kosinski connected the past with the modern age by bringing back Jeff Bridges and Bruce Boxleitner while providing a story that engages and intrigues a new generation. I can't say I was a major fan of the original, but I loved this movie. This sci-fi adventure felt like the beginning of something incredible, but sadly Disney acquired Marvel shortly after the release of TRON: Legacy and shifted their focus to the MCU. Hopefully, after Kosinski's success with Top Gun: Maverick, the chances of a TRON 3 will be reignited because I am ready for more!", "created_at": "2022-08-19T23:00:09.075Z"}, {"movie_id": 20526, "review_id": "6375645e3c3ab000b822eb0d", "author_rating": 3.0, "review_text": "**Lots of style, lots of high-quality visuals, but little substance.**\r\n\r\nThere are things that are inexplicable, and one of them is how “Tron” managed to become popular, even after not being a big hit in its time. I have already written about it and I stand by what I said: it is a film that I understand, that came in the wake of a popular fever around everything electronic, but that was made before its time, with visual and special effects that, today, seem as archaic as a 1990s cell phone. I don't know if this movie should be a sequel or if it should have been made a remake instead, but there's no doubt about the superiority of this movie: not only does it feature visual effects and CGI of great beauty and quality, as it has a frankly better script (which does not mean perfection).\r\n\r\nIndeed, the script is satisfactory, presenting an unlikely story, where a very rich young man decides to sabotage his own company thinking he is doing what his father, who disappeared for years, would approve. After that, he receives a message from his father, and the clue leads him to an old arcade, long closed, and to his father's old computer. It is there that the young man is sucked into a cybernetic space, controlled by a vile and dictatorial program. Yes, humans sucked, physically speaking, into computers. As if social media weren't enough! Added to this, the worn-out clichés of the relationship between an absent father and a needy son, an essay on a loving sub-plot without any logic, a cartoon villain without personality and made to hate.\r\n\r\nJeff Bridges returns to the character he played in the first film, both in the person of the actor we know, and in the figure of a young alter-ego, created digitally. The actor is good, and we already know his merits, but the truth is that he doesn't seem to be in great shape. He accompanies the film, following the action, but he is not particularly noticeable in this work, as he was not in the initial film. Garrett Hedlund has a little more visibility and is, in fact, the protagonist here, but he doesn't do much more than be an action figure.\r\n\r\nIt is in the technical aspects that the film stands out and deserves some praise, particularly thanks to the extraordinary design of the visual effects and the CGI, which are among the most elegant and well-executed we have seen. Recreating the concepts of the original film, they show a cleaner and more finished look, without obvious gimmicks that are unbelievable to the eyes, and with much better worked colors. However, a film is not made of style and extraordinary visuals, and there are many recent examples of visually amazing films that are worthless because they do not have quality stories. Also noteworthy are the sets and costumes, as well as the electronic soundtrack, by the French dJ duo Daft Punk.", "created_at": "2022-11-16T22:29:50.137Z"}, {"movie_id": 20526, "review_id": "645d509a1b70ae0145efd180", "author_rating": 7.0, "review_text": "I was a huge fan of the original Tron when I was a wee scamp, so when the sequel finally came about I was well up for it. Unfortunately, it missed the mark by a mile. It looks gorgeous but that's about all it can offer, unless incredibly irritating characters are your thing. The original might look naff by today's standards but it's still a far better movie. Having said that I still can't stop watching this new one, go figure.|", "created_at": "2023-05-11T20:31:22.586Z"}, {"movie_id": 20526, "review_id": "51ec287319c295369c3a2e05", "author_rating": null, "review_text": "Where do you start with Tron: Legacy? It’s a sequel to a minor cult hit that arrived in theaters 28 years ago, a film more renown for its (at the time) state-of-the-art design than its coherent story or classic characters, rekindled now not as a reboot or remake, but as a direct sequel to that long-ago work.\r\n\r\nTron's esteem may have grown in the intervening years (much the same fate as another maligned-at-the-time science fiction film, Blade Runner), but time has been mostly unkind to it; Disney attempted to stage a run of pre-LEGACY screenings of the original film, but modern audiences greeted its dated appeal as unintentionally hilarious. Frightened by the impact this might have had on their $170 million spectacle, they pulled plans for a theatrical release, and whisked the recent 25th anniversary DVD off of store shelves. And so, bereft of a childhood that contained Tron, I went into the sequel with naught but a Wikipedia plot breakdown (which was, to be honest, frustratingly informative) to fill in what turned out to be largely irrelevant narrative gaps. I say that to say that I am reviewing Legacy solely for Legacy's sake, untainted by nostalgia or high expectations.\r\n\r\nMore than two decades after the events of the first film (which, for the uninitiated, involve a computer programmer [Jeff Bridges, reprising his role] being zapped from the physical world into the computer world he created and fighting an oppressive digital tyrant within), we’re introduced to that computer programmer’s twenty-something kid, heir to his father’s tech empire and not terribly happy about it. It seems he’s still hung up on his father’s mysterious disappearance long ago, and a mysterious message leads to him discovering Dear Old Dad’s secret underground lab, where he’s accidentally zapped into the digital world as well. I’m afraid I’m not spoiling anything to go ahead and say that within he finds his trapped father, and they must fight their way back out. To give more plot details would be unfair and pointless. Suffice to say that once within the digital realm, it becomes action beat after action beat wherein our young hero rescues dad and his requisite romantic interest until the film ends.\r\n\r\nOh sure, there are good guys, and there are bad guys, and there’s a token stab at depth, but what does it matter? That digital world looks really cool, right? And that’s why we go. The sad truth of the matter, however, is that what looks awesome in a two-minute trailer begins to wear on the eyes when presented long-form. “The Grid” exists in three colors: neon blue, neon orange, and black. Well, two colors and an absence of color, I suppose. As nifty as this may seem, two-plus hours of this (particularly at the reduced light offered by 3D projection) robs it of interest, and the whole thing becomes a dull slog. 3D works by enhancing depth, but little to no depth is present when the film is lit and shot in such a stylized manner. To boot, only the bad guys are orange. And as our audience proxy characters are good, we’re robbed even of the contrasting orange to break up the monotony.\r\n\r\nThere are some neat sequences, of course: the initial lightcycle battle, a digital dogfight later on, etc. Garret Hedlund and Oliva Wilde are perfectly fine in their frankly bland roles, and Jeff Bridges squeezes what depth he can into his dual characters (actual Kevin Flynn and his twenty-years-younger digital duplicate, thanks to some unnerving but nifty visual trickery). The film is far from the unwatchable dreck of, say, The Chronicles of Narnia: Voyage of the Dawn Treader. It’s just...not very interesting. Techno group Daft Punk’s score was easily the best part of the film, and something I’d actually recommend picking up with no hesitations. At its best, the Daft Punk score and stylized imagery (early in the film, before it wears you down) do provide a unique and imaginative experience. It’s just one fit for the length of a music video, not a feature film.\r\n\r\nBut let’s not kid ourselves: Tron: Legacy is a flashy, ridiculous spectacle that exists solely to put pretty pictures onscreen for two hours and drive a $4+ 3D surcharge. And I say that with no judgment. Some films simply are what they are, and you’ve no more right to expect a dog to meow than to glean from them deep meditations on the human condition. The history of cinema is full of this kind of shallow but aloofly entertaining distraction. But is it wrong to want more of these kinds of films? Take Star Wars, for instance: its strength lies mainly in its revolutionary aesthetic and special effects, but it’s the characters that we remember from the film, not just how cool some set-piece looked. And Lucas isn’t even a terribly good writer; the strength of his characters came from that universal pull all great archetypes have, that ability for audience identification and empathy. Will the name Sam Flynn have the same kind of longevity? What about...uh, Oliva Wilde’s character? Apparently not, at least for me. (Note: IMDb says it’s “Quorra.”) If nostalgia for the first film is strong for you, or you’ve no qualms about paying $14+ for a mildly-distracting if uninvolving experience, go for it. Everyone else may as well save themselves the money. Maybe catch it on Blu-ray.\r\n\r\nI should note, though, that I can honestly say 3D added nothing to the experience, so if you want to be able to actually see in The Grid, save yourself the money and hop into a 2D seat.", "created_at": "2013-07-21T18:29:07.589Z"}, {"movie_id": 20526, "review_id": "5fab1cec53866e004016a6ad", "author_rating": 8.0, "review_text": "A massive upgrade on the first film, at least for someone like me who certainly doesn't enjoy the 1982 production.\r\n\r\n<em>'TRON: Legacy'</em> is much more vibrant, developed and tangible. I actually formed a connection with the characters in this one, which is the complete opposite to the original. The special effects (bar the de-aging) are a vast improvement, which is to be expected in fairness; I love the look of this.\r\n\r\nIt's nice to get a proper view into the 'outside' lives of the protagonists, rather than receiving a tiny backstory before shoving them into the new universe; I appreciated the build-up to the eventual entry. The score is also terrific, even if it's strange hearing Daft Punk's \"Outlands\" due to my familiarity of it coming from Sky Sports UK's Formula 1 opening credits.\r\n\r\nGarrett Hedlund is great in the role Sam, I enjoyed his performance from the get-go. Jeff Bridges is excellent too, I feel all the actors in general were given much more to work with in this one; I barely took notice of Bridges (& Co.) in the predecessor, but he stands out big here. Olivia Wilde and Michael Sheen are good, also. Cillian Murphy even makes a minute appearance.\r\n\r\nIt does, at least to me, feel like a very different film when compared to <em>'Tron'</em>, which may disappoint lovers of the latter but will be relief to opposing folk; e.g. me.\r\n\r\nWasn't sure what to expect from this, but thankfully it produces an entertaining time.", "created_at": "2020-11-10T23:06:20.606Z"}, {"movie_id": 20526, "review_id": "630015f93e6f2b007a9d6fa4", "author_rating": 8.0, "review_text": "**Overall : Kosinski upgrades TRON in every way for a new generation with this stunning sci-fi adventure.**\r\n\r\nBelieve it or not, Top Gun was not the first franchise Joseph Kosinski revives with a legacy sequel over 30 years after the original. And just like Top Gun: Maverick, Kosinski did a masterful job bringing a series back to life. TRON: Legacy improved on its predecessor in every way. I remember seeing it in 3D IMAX and being completely blown away at the effects (although the de-aging effects are pretty dated but were impressive at the time), the soundtrack, the story, and the acting. Kosinski connected the past with the modern age by bringing back Jeff Bridges and Bruce Boxleitner while providing a story that engages and intrigues a new generation. I can't say I was a major fan of the original, but I loved this movie. This sci-fi adventure felt like the beginning of something incredible, but sadly Disney acquired Marvel shortly after the release of TRON: Legacy and shifted their focus to the MCU. Hopefully, after Kosinski's success with Top Gun: Maverick, the chances of a TRON 3 will be reignited because I am ready for more!", "created_at": "2022-08-19T23:00:09.075Z"}, {"movie_id": 20526, "review_id": "6375645e3c3ab000b822eb0d", "author_rating": 3.0, "review_text": "**Lots of style, lots of high-quality visuals, but little substance.**\r\n\r\nThere are things that are inexplicable, and one of them is how “Tron” managed to become popular, even after not being a big hit in its time. I have already written about it and I stand by what I said: it is a film that I understand, that came in the wake of a popular fever around everything electronic, but that was made before its time, with visual and special effects that, today, seem as archaic as a 1990s cell phone. I don't know if this movie should be a sequel or if it should have been made a remake instead, but there's no doubt about the superiority of this movie: not only does it feature visual effects and CGI of great beauty and quality, as it has a frankly better script (which does not mean perfection).\r\n\r\nIndeed, the script is satisfactory, presenting an unlikely story, where a very rich young man decides to sabotage his own company thinking he is doing what his father, who disappeared for years, would approve. After that, he receives a message from his father, and the clue leads him to an old arcade, long closed, and to his father's old computer. It is there that the young man is sucked into a cybernetic space, controlled by a vile and dictatorial program. Yes, humans sucked, physically speaking, into computers. As if social media weren't enough! Added to this, the worn-out clichés of the relationship between an absent father and a needy son, an essay on a loving sub-plot without any logic, a cartoon villain without personality and made to hate.\r\n\r\nJeff Bridges returns to the character he played in the first film, both in the person of the actor we know, and in the figure of a young alter-ego, created digitally. The actor is good, and we already know his merits, but the truth is that he doesn't seem to be in great shape. He accompanies the film, following the action, but he is not particularly noticeable in this work, as he was not in the initial film. Garrett Hedlund has a little more visibility and is, in fact, the protagonist here, but he doesn't do much more than be an action figure.\r\n\r\nIt is in the technical aspects that the film stands out and deserves some praise, particularly thanks to the extraordinary design of the visual effects and the CGI, which are among the most elegant and well-executed we have seen. Recreating the concepts of the original film, they show a cleaner and more finished look, without obvious gimmicks that are unbelievable to the eyes, and with much better worked colors. However, a film is not made of style and extraordinary visuals, and there are many recent examples of visually amazing films that are worthless because they do not have quality stories. Also noteworthy are the sets and costumes, as well as the electronic soundtrack, by the French dJ duo Daft Punk.", "created_at": "2022-11-16T22:29:50.137Z"}, {"movie_id": 20526, "review_id": "645d509a1b70ae0145efd180", "author_rating": 7.0, "review_text": "I was a huge fan of the original Tron when I was a wee scamp, so when the sequel finally came about I was well up for it. Unfortunately, it missed the mark by a mile. It looks gorgeous but that's about all it can offer, unless incredibly irritating characters are your thing. The original might look naff by today's standards but it's still a far better movie. Having said that I still can't stop watching this new one, go figure.|", "created_at": "2023-05-11T20:31:22.586Z"}]