[{"movie_id": 1738, "review_id": "5eef06ccd2b2090035ff1687", "author_rating": 4.0, "review_text": "I don't really know how to put the thought that came to me while watching _Next_ in a way that makes any actual sense, so I'm just gonna out myself as kind of an idiot and tell you all what that thought literally was: \"I'd like to see this movie in a different movie\". \r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-06-21T07:05:48.378Z"}, {"movie_id": 1738, "review_id": "5fb7f43e875d1a003e464992", "author_rating": 8.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nWhile I wouldn't normally consider clairvoyance \"time travel\", the way it is implemented in this movie is essentially time shifting.  He \"thinks\" himself forward in time, and then essentially time shifts himself backwards to a time before he witnesses the consequence.\r\n\r\nIt's such an interesting concept, but potentially un-cinematic.  They honestly do an amazing job of displaying Nicholas Cage standing in place to \"see\" and making it seem interesting.\r\n\r\nJuliane Moore helps by being a badass lady in charge, but Jessica Biel (a proven entity herself) just doesn't have the opportunity to be little more than a damsel.  Cage carries most of the movie, but is a lot less \"crazy\" than he is in other movies, if that is any comfort.\r\n\r\nDefinitely check this out next time you're looking for an \"out of the box\" action flick.", "created_at": "2020-11-20T16:52:14.911Z"}, {"movie_id": 1738, "review_id": "60f5021a5545ca007c9198ea", "author_rating": 6.0, "review_text": "Entertaining if not uneven sci-fi thriller. Nic Cage was fine but it was weird having a guy in his mid-50s (adding black hair coloring didn't make him look younger) wooing a woman in her early 30s, and given the romance was a good part, that is a big strike against. Another strike was some shoddy CGI, seems like they didn't have the budget that would match the action sequences. All that said, found it to be an okay time-waster and an interesting idea that probably would work as a TV series. **3.0/5**", "created_at": "2021-07-19T04:39:54.816Z"}, {"movie_id": 1738, "review_id": "6328375820af770080fca847", "author_rating": 5.0, "review_text": "Someone here has been watching too much \"Dr. Who\"!. Sadly, though neither the acting nor the writing can really capitalise on the quirky theme of this sci-fi thriller. Nicolas Cage is \"Cris\" (the man clearly has an issue with the letter \"h\"). Anyway, he has the ability to see two minutes into the future and he uses his skill to best effect as a low-key magician in Las Vegas. He is coasting along fine until FBI agent \"Ferris\" (Julianne Moore) alights on a plan to use his unique quirk to thwart a plan by some unscrupulous Russian terrorists to detonate a nuclear bomb in California. Things take a turn for the more dangerous for poor old Cage when his girlfriend \"Liz\" (Jessica Biel) becomes a pawn in the game too. To be fair, it does move along swiftly enough, but there isn't even the merest hint of jeopardy. The dialogue and the action scenarios are straight out of the Janet and John book of join-the-dots disaster thrillers, and Moore is distinctly out-of-sorts trying to hold this derivative and disjointed story together - getting little help from a terribly wooden leading man. It's got straight to video written all over it, and even the most die-hard fans of the genre and these actors are bound, surely, to leave disappointed.", "created_at": "2022-09-19T09:33:12.248Z"}, {"movie_id": 1738, "review_id": "648f4733c3c891014ebe5449", "author_rating": 7.0, "review_text": "Ok, yes, this is a pretty bad movie, and no movie ever matches up to the Philip K Dick book it's based on, and yes that does go for Blade Runner too. The script is lazy, the plot holes are a mile wide and the technical inconsistencies are eye-roll-inducing. But you know what, it's an entertaining little adventure. Nicolas Cage is always worth a watch and I'll watch anything featuring Jessica Beil. It looks big, beautiful and colourful onscreen. Not everything has to be Shakespeare people, and thank the Gods for that fact.", "created_at": "2023-06-18T18:04:35.053Z"}]