[{"movie_id": 1571, "review_id": "54194cd8c3a3686d96000edb", "author_rating": null, "review_text": "It is not a just a DIE HARD MOVIE! Eyes feasting....lot of action scenes,lot of intelligence and lot of technology, Bruce Wills is rocking the film. There is nothing to say about his action. Justin long well and good supported role and he is the main guy who is dealing with technology...Timothy Olyphant awesome acting as a villian....and elizabethwinstead acts as a daughter of brucewills i.e., John Mclane. When coming to the story fully packed once when we got that situation really no one will going to surive us. An excellent actions,stunts,technology,etc. It is totally a full pack \"FIRE SALE\".:) Superb MOVIE", "created_at": "2014-09-17T08:56:56.981Z"}, {"movie_id": 1571, "review_id": "5b2be68e925141651a007e5b", "author_rating": 7.0, "review_text": "Big, dumb action flick delivers\r\n\r\nRELEASED IN 2007 and directed by Len Wiseman, \"Live Free or Die Hard\" is the fourth installment in the Die Hard series. John McClane (Bruce Willis) is ordered to pick up a youth hacker (Justin Long) who's targeted by cyber-terrorists led by Thomas Gabriel and Mai Linh (Timothy Olyphant & Maggie Q). Their goal is to create chaos by taking over the USA's transportation grids and stock market. Mary Elizabeth Winstead plays McClane's cute and feisty daughter while Kevin Smith has a small role as a computer geek living in his Mom’s basement.\r\n\r\nRigid fans complain that this sequel is \"Die Hard in name only\" because I guess it deviates from formula but, really, the Die Hard series is ANY challenging adventure that John McClane experiences just as the 007 flicks consist of James Bond in differing challenges; same thing with Dirty Harry. In any case, “Live Free or Die Hard” works as Die Hard sequel or as a stand-alone action flick with Bruce Willis. The story holds your attention while the action scenes are out of this world. They're so over-the-top that some write the movie off as absurd, but everything's done with a quasi-realistic tone so it helps the viewer go along with the ridiculous things that happen rather than tune out.\r\n\r\n\"Live Free or Die Hard\" is the natural progeny of over-the-top films like 1977's \"The Gauntlet\" where the action scenes are so overdone they're cartoony, but entertaining. There's a thin line that filmmakers must tread with these kinds of blockbusters because they can easily fall into overKILL, like 2001's \"The Mummy Returns,\" but \"Live Free or Die Hard\" evades that ditch by giving us fairly interesting characters and a compelling story. It may not be great but it certainly fills the bill if you're in the mood for a wild action flick.\r\n\r\nI like the continuity of the series: McClane’s wife (Bonnie Bedelia) is acknowledged here and we meet his daughter, now a hottie, and hear of his son, Jack. We learn of the severe price that John’s bold, serious approach to his profession has had on his personal life. These things are further explored in “A Good Day to Die Hard” (2013), which is basically just as good as this installment.\r\n\r\nTHE MOVIE RUNS 128 minutes and was shot in Baltimore, Washington DC, Philadelphia, Los Angeles and other parts of Southern California. WRITERS: Mark Bomback and David Marconi conceived the story/script based on an article by John Carlin.\r\n\r\nGRADE: B", "created_at": "2018-06-21T17:55:26.497Z"}]