[{"movie_id": 38810, "review_id": "55d9073192514143e6002fa9", "author_rating": 5.0, "review_text": "Doogtooth, the official Greek entry to the 2011 Academy Awards, is nominated for Best Foreign Film.  Released in 2009, and directed by Giorgos Lanthimos, Dogtooth is a strikingly original film that captures a world that is at once like nothing you’ve ever seen, but oddly familiar at the same time.\r\n\r\nThe story is about a family of five who live in a beautiful walled villa in Greece.  It’s more like a compound because the patriarch (Christos Stergioglou) is the only one who ever gets to venture into the world beyond the tall fences that surround the property.  His wife (Michele Valley) and three teenaged children live in a world that at first seems oddly Edenic.\r\n\r\nThe film opens with the children listening to an instructional cassette.  They learn that the word “sea” means a leather armchair, “motorway” means a strong wind, and “excursion” means a strong, resilient material.  Anything that hints at the world outside the walls of their home is obscured.  Even the airplanes that fly in the air are construed to be toys, and when one is spotted, one of the parents will run into the house and through a toy plane out into the garden so the children will believe the lie.\r\n\r\nThe only outsider allowed into the compound is a woman named Christina (Anna Kalaitzidou), a security guard at the father’s place of employment who moonlights as a kind of private prostitute whom the father hires to satisfy his son’s budding sexual urges.  Christina is brought to the compound blindfolded, but on the rides to and from the family home, the father tries to engage her in small talk, which amounts to questions about her hygiene, and whether she wears the perfume he has bought her as a gift.\r\n\r\nMuch time is devoted to daily routine of the family.\r\n\r\nWe see the father at work, where he has created yet another elaborate ruse to get out of having his boss over for dinner (he says that his wife, a former handball champion, is confined to a wheel chair – the result of a tragic accident).  He’s such a cipher of a man that the boss, along with the children, buys into the lie without a hint of suspicion.\r\n\r\nLife at home, though, is where the film really shines.  We see the kids at play.  The eldest child is the son (Hristos Passalis), who looks to be 18 or 19.  Two sisters (Angelika Papoulia and Mary Toni) look to be 18 and 17.  Though they are on the verge of adulthood, the behavior of the children is more pre-adolescent.  There is an innocence about them that is both sad and endearing.  The actors playing the kids beautifully capture the behavior and mental territory of young kids that comes through in the games they play and the way they bicker with one another and depend on their parents for all their information about the world – a world they will only be ready to experience when either their left or right dogtooth falls out.\r\n\r\nWhat is a dogtooth?  Exactly.\r\n\r\nWhen the son asks the mother what a zombie is, she asks where he heard the word.  He lies and says that he thinks he heard the father say the word.  The mother pauses, then tells him a zombie is a small yellow flower.  Later, the joke is paid off when the son stops in the middle of his play in the garden and yells for the mother to come and see two zombies he’s found.\r\n\r\nTricking children is one thing, but as they grow, certain fantasies and myths that parents create are found out to be lies.  Of course, this often happens when our kids come home with conflicting information from the outside world, which is what happens to make the artificial world of the father begin to unravel.\r\n\r\nChristina, the prostitute, wants oral sex, which the son doesn’t like, so she bribes the oldest daughter into satisfying her by bringing videos, like Rocky and Flashdance, that give the daughter a notion of what goes on in the world her father has taught her to fear.\r\n\r\nThese videos are like the bite from the fruit of the tree of knowledge of good and evil, and even though the father finds out about them and banishes both them and Christina from their lives, the damage has been done.  Things will never be the same again.\r\n\r\nThe acting in Dogtooth is beautifully realized.\r\n\r\nStergioglou doesn’t play the father as a tyrant, but as a kind, loving, but firm parent, with only the best interests of his family – as he sees them – in mind.  This father, despite what happens in the movie, never comes across as a villain, which is to Stergioglou’s great credit.\r\n\r\nThe children, especially Papoulia and Tsoni, capture a prolonged innocence that doesn’t rely on tricks or costuming, but on finely observed performances.  What’s weird is that these are very damaged people, but until they are told so or try to live in the outside world, they’re just kids.\r\n\r\nBecause of how perfectly Lanthimos sets up this alternate world, I never once questioned anything that went on there.  It all made sense.  Dogtooth is a well constructed escape that takes a long, hard look at family and parenting and the choices we sometimes make as parents to both lock out the world and lock in our kids – and the toll those decisions sometimes take.  Sometimes sad, sometimes funny, Dogtooth is a film deserving of its nomination – and your attention.", "created_at": "2015-08-22T23:35:13.642Z"}]