[{"movie_id": 245703, "review_id": "57c8b4a4c3a3685be6000b65", "author_rating": 7.0, "review_text": "> A secret road adventure during the dark hours!\r\n\r\nSo the Jeff Nichols and Micahel Shannon saga continues. This is theirs 4th film together in the last nine years and all of them were well accepted. Now they are into sci-fi for this, which is kind of a road movie that resembles hundreds of other films. Only thematically, but in parts it looks different, especially for being too realistic as what the director is famous for. Finally, something is not a comedy or a full of CGI, yet still it is a wonderful sci-fi-drama with some thrill moments.\r\n\r\nIt opened like the midway of the story. We obviously have to wait for a proper explanation to know what's going on, who is the child and where they're taking him. So it all begins with two armed men driving a young kid on the dark hours. Only we know is that they are protecting the boy from the government people, but the film took some time to give a clear picture of the condition. In the meantime, I started my prediction game, but I expected the film to clarify how it all began. It never cared about that part, only moved forward and that's how we're going to get some answers where a few might feel its a let down.\r\n\r\nThe negative of the film is you won't fully understand it, but it is not an incomplete story, just designed that way that leaves for the viewer to add their own perspectives to where the writer left blank spaces. Like I said the people are comparing it with the similar films and I did not care about that, but I disappointed with the conclusion. It was neatly folded, I actually liked it, but it was not fresh, especially it totally mirrors 'Tomorrowland'. Now I know why Warner Bros moved it from last year to this year's release.\r\n\r\nIt might be a coincident because the director who is also the writer has a good reputation, so I believe it is definitely not a steal, just a common creative that we've already seen many films like that. Overall, this film is worth, but might not satisfy the Jeff Nichols fans, because like I said plenty of times before in my reviews, now it the sci-fi era and every filmmaker and film-star want to board on that plane. So it did not spare Jeff Nichols as well.\r\n\r\n7/10", "created_at": "2016-09-01T23:07:16.149Z"}, {"movie_id": 245703, "review_id": "57d94a6592514168b800569b", "author_rating": 7.0, "review_text": "It's like _Donnie Darko_ and _Looper_ had a baby. A less talented baby, but still, pretty impressive.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-09-14T13:02:29.763Z"}, {"movie_id": 245703, "review_id": "58cfdbb4c3a36811ce005a39", "author_rating": 7.0, "review_text": "Midnight Special is an entertaining Sci-fi flick that ultimately never reaches it's full potential. The father son on the run story is griping and well played with the talent of Michael Shannon who is believable as a father who will do anything to get his gifted son to where he needs to be. Dunst and Edgerton do some fairly solid work also as Altons mother and I believe step father. The dialogue is believable, the action and Sci-fi elements are all well put together. The concept almost ET like is interesting. The CGI is acceptable if not spectacular. The music well scored if not memorable. I personally found this movie felt long at 1h52mins and for some reason I felt the movie should of been set in an earlier time period like the 70s or 80's. These are small personal gripes and you may ask why it does not achieve it's full potential. The answer is simply the way it ends, it felt small or empty. These characters had done so much,  for this child and somehow the movie had left me with zero emotional connection to how the story played out. The father and son connection was the strongest element in the movie and this I felt needed a bigger part in the ending of this film, but for some reason they chose to pull back on this right at the buzzer. I would recommend this to anyone who likes Science fiction as a worthy watch. My final score 3.5 stars.", "created_at": "2017-03-20T13:40:04.490Z"}]