[{"movie_id": 157544, "review_id": "591ee1439251414ab1030f48", "author_rating": 5.0, "review_text": "A bit nice with the rating perhaps.\r\n\r\nI mean it has alot of issues, Michael Pena (whom I usually like alot) is very stiff in this one (no not in his pants, it's not that kind of a movie) feels like he phoned it in as they say.\r\n\r\nDjimoun Hinsou being in it was something that interested me to see it as well but he was only in it for a couple minutes.\r\n\r\nNicely shot but the editing is a bit wonky, whoever edited it doesn't get it to flow very well and it seems like they were deliberatly trying to make it as short as possible cutting from one scene to the next leaving as little dead time as possible.\r\n\r\nClocking in at less than 90 minutes (the credits start rolling at around the 83 mark).\r\n\r\nNot a whole lot of surprises to be found, the idea of the ending was alright but again very rushed.\r\n\r\nShould be added that despite what the plotsummario suggests this is not found footage.", "created_at": "2017-05-19T12:12:51.883Z"}, {"movie_id": 157544, "review_id": "6020c7de54a098003f3dcfc8", "author_rating": 8.0, "review_text": "A relatively successful horror film with an interesting story that depicts the arrival and birth of the antichrist.  Of course, this one definitely doesn't belong to the top horror movies, but even so an interesting spectacle that I wasn't bored after a long time.  For those who like various films about exorcism, this film is definitely worth watching.  Don't expect any miracles from this film, but for a good average it will be enough.", "created_at": "2021-02-08T05:10:54.491Z"}, {"movie_id": 157544, "review_id": "642a849aa3e4ba272935af14", "author_rating": 3.0, "review_text": "**Another horror film for teenagers that will not please anyone looking for something serious.**\r\n\r\nIt looks like the teen horror movie fad has really taken root. I'm not a fan, not least because, for me, either horror movies really scare, bother, or they don't deserve to be called horror. However, if the producers' idea was to create a film capable of convincing the 15-year-old couples to go to the cinema in the hope of some naughty hugs when she gets scared, or with the intention of seeing who will be more scared in the group, maybe they got what they wanted.\r\n\r\nFor someone like me, who is part of the backstage of the Catholic Church, and who lived for years with all sorts of priests, it is a little difficult to understand all the “hype” around exorcism. I recognize that it is one of those Catholic rituals that is unknown to even the most unfailing Catholics, but this is due to the strict secrecy with which everything is done, and which aims above all to protect the person targeted by the ritual. Informed Catholics know that it is a special kind of ritual, that it is only done in specific circumstances and with caution, but it does not have the cinema's “show off”! It is effective in its own way, and the exorcist is not a conspicuous or strange priest. He is, above all, a priest trained to the highest level for what he has at hand (I mean the real Catholic exorcists, not any cheap imitations). The film, as always happens in cinema, transforms a religious ritual into a garish show that has nothing to do with reality, but which entertains the audience quite well.\r\n\r\nMark Neveldine is not a director to be taken seriously. So far, he's only directed terribly dubious films. The cast has several good actors – Djimon Hounsou, Dougray Scott, Michael Peña – but none of them are used properly. The material given is poor, the characters are very bad, and the constructed narrative is a mere excuse for exorcism. The use of VCRs is also an old horror cliché, which will remind us of several films that are frankly better than this one.", "created_at": "2023-04-03T07:47:38.897Z"}]