[{"movie_id": 72976, "review_id": "51e8bd8b760ee3601d007204", "author_rating": null, "review_text": "Very powerful journey back into history!", "created_at": "2013-07-19T04:16:12.008Z"}, {"movie_id": 72976, "review_id": "54de8d5892514103bb001d05", "author_rating": 7.0, "review_text": "It lacked a big deal of rhythm but the revision of the history and, specially, the great performance by Day-Lewis makes it a movie worth watching.", "created_at": "2015-02-13T23:48:40.355Z"}, {"movie_id": 72976, "review_id": "5fadfcbde86017003b91c175", "author_rating": 9.0, "review_text": "This is a flat out great movie. I first watched it several years ago and enjoyed it, so recently I noticed it on the IMDB streaming service and decided to watch it again. I still think it is great. I guess I had forgotten that it was a Spielberg film, so why wouldn’t it be great? It was many years in the making and was partially based on Doris Goodwin Kearns excellent non-fiction book Team of Rivals.\r\n\r\nThe cast is excellent: Daniel Day-Lewis is really impressive as President Lincoln. Lincoln is believable, human, showing several sides of his personality. He is at times funny, wise, empathetic, coarse, tortured and — well, everything I would expect after reading so much about him over the years.\r\n\r\nFor me, the movie lost a little of its energy when it shifted to the political maneuvers undertaken concerning the obtaining of votes to pass the amendment Lincoln wants to push through Congress, but it is integral to the plot, illustrating that Lincoln was pragmatic and willing to play the game to achieve his goals. Because he narrowed the scope of this Lincoln biopic to the last months of the great president’s life, Spielberg was able to cover a lot of ground, and explore the issue of slavery and the war from numerous perspectives.\r\n\r\nI do regret watching it through that streaming service. I don’t mind ads, but they popped in randomly, sometimes twenty minutes apart, once five minutes apart, and always right in the middle of scenes. I plan to watch it again, with no commercials. I suggest you do the same.", "created_at": "2020-11-13T03:25:49.460Z"}]