[{"movie_id": 338967, "review_id": "5da7b85670309f001463f30a", "author_rating": 6.0, "review_text": "Even with its flaws, ‘Zombieland: Double Tap’ doesn’t overstay its welcome with its 99-minute run time, and remains a solid piece of popcorn entertainment. Although it doesn’t push any boundaries, it’s harmless fun (the Homer zombie of horror films, if you will... that’ll make more sense after you’ve seen it). So stumble into a cinema and join these friends on a reunion - sure, one filled with endless blood, guts and brains, but that’s half the fun of a zombie comedy, right?\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-zombieland-double-tap-the-gangs-back-for-a-brainless-zombie-comedy-sequel", "created_at": "2019-10-17T00:39:50.100Z"}, {"movie_id": 338967, "review_id": "5db485a2f056d500120ef77e", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nAs you probably know by now, since I posted the original film's review a few hours ago, I loved the first Zombieland. I defend that it's a zombie cult classic, and I was genuinely pumped for its sequel. It didn't go through any external controversy (something quite rare nowadays), the cast didn't say anything wrong in the interviews (haters didn't have enough words to twist this time around), Ruben Fleischer returns as the director, as well as Rhett Reese and Paul Wernick (plus a new member, Dave Callaham) as the screenwriters. If a studio wants to do a 10-year sequel, it might as well get the creators and original cast back together, right?!\r\n\r\nThat's what I love the most about Double Tap. It didn't lose the original's essence, and it didn't forget what made it so successful. The cast's chemistry can be felt thousands of miles away, but the new additions also fit in seamlessly. Zoey Deutch portrays Madison, a purposefully stereotypical \"dumb blonde girl\" who has some of the funniest scenes as well as some of the most cringe-worthy (Deutch gives an excellent performance, though). And Rosario Dawson plays Nevada, basically a women version of Tallahassee (Woody Harrelson), which means she has a bunch of badass action sequences. As for the old gang, well…\r\n\r\nEveryone delivers great performances, but this time, Harrelson really elevated his character. Not only does he have the expected awesome kickass moments, but he also offers some emotionally compelling displays. Emma Stone (Wichita) and Abigail Breslin (Little Rock) keep being amazing as their characters, and Jesse Eisenberg (Columbus) does get a bit too … Jesse Eisenberg, but it never stops feeling natural, having in mind how his character acts. These four are the heart of the whole show. Hence, getting the original cast back together is halfway through success, even more than in the first movie. Story-wise is where I do have some complaints, unfortunately.\r\n\r\nMaybe it's due to the fact that I watched 2009's Zombieland just a couple of hours before Double Tap's screening, but I wish that Fleischer and his team were more creative. Sure, the original was 10 years ago, and not everyone is going to rewatch the original (especially not right before), so it's expected that a lot of classic moments are recreated in some shape or form. However, for an extended period, I felt that I was watching the exact same film, just with older characters. I know I'm going to hear some of Columbus' original famous rules, but there's a surprising lack of new ones. I know Tal is going to repeat some of his catchphrases, but he's an imaginative guy, he can think of fresh ones (which he does say in the last minutes, but still).\r\n\r\nTo move the plot forward or actually make the story happen, a lot of questionable things occur, and not in the sense of them not being rational (it's not like Zombieland is a groundbreaking piece of storytelling). It's the apparent lack of character development through all of the years that have passed, and I'm not addressing their personalities being the same (it's pretty normal). To create this movie, characters make decisions that don't feel right, having in mind they spent so much time together. It's impossible for love, trust, and emotional attachment not to be developed throughout such a long time. So, while Little Rock's arc is understandable and relatable, Wichita and Columbus' lacks convincing arguments, in my opinion. Both make decisions too dumb for such intelligent characters, but I guess \"that's love\".\r\n\r\nOnce again, the technical features that defined the original so clearly are seamlessly employed in its sequel. Beautiful production design, cool soundtrack, fantastic application of practical effects and real sets, which nowadays are getting rarer. The slightly longer runtime still manages to carry a fast pace, which is always a good attribute, and it's packed with thrilling, hilarious, bloody action sequences. Amusing pop culture references, and the most significant moment of all: Double Tap has one of the best, if not THE best, mid-credits scene of the year! Don't you dare leave the theater, it's right at the beginning of the credits, so stay in your seat!\r\n\r\nAll in all, Zombieland: Double Tap pays a decent homage to the original zombie cult classic by getting everyone (cast and crew) back together, and delivering yet another entertaining flick. By maintaining the essence of the first film, Ruben Fleischer is able to capture the outstanding cast's chemistry, as well as present those amazingly entertaining action sequences. Even though the central narrative isn't as straightforward and interesting as in the original, it's still captivating enough for the audience to care about. There is an excessive amount of callbacks to classic catchphrases, rules, or moments, which shows a bit of a lack of imagination to create new material. While it's not as funny or entertaining as the 2009's movie, it's still a good time. If you're a fan of Zombieland, definitely watch it! If not, well… Nut up and watch it or shut up and let others enjoy it.\r\n\r\nRating: B", "created_at": "2019-10-26T17:42:58.532Z"}, {"movie_id": 338967, "review_id": "5dbf9442f1b5710013e7de25", "author_rating": 7.0, "review_text": "_**Just as funny and irreverent as the original, even if it hits all the same beats**_\r\n\r\n> _I'd rather die while I'm living than live while I'm dead._\r\n\r\n- Jimmy Buffett; \"Growing Older But Not Up\" (1981)\r\n\r\nThe original _Zombieland_ (2009) was something of a sleeper hit, earning over $100 million against a $24 million budget, becoming the most financially successful zombie movie ever made, until it was surpassed by Marc Forster's asinine _World War Z_ (2013). Smart, funny, and self-aware, it didn't take itself too seriously, and it had bucket-loads of heart, but it was hardly a film crying out for a sequel. And as time passed, it seemed more and more unlikely such a sequel would happen. However, after a decade in development hell, _Zombieland: Double Tap_ has arrived, and boy is it one of the most unnecessary sequels I've seen in quite some time. However, as unnecessary as it is, it's also extremely enjoyable. It doesn't do a whole lot that wasn't in the original, but the irreverent sense of humour, fourth wall breaks, sharp character interactions, and, most importantly, shedloads of charm are all present and accounted for. Directed by Ruben Fleischer (who helmed the original) and written by Rhett Rees and Paul Wernick (who wrote the original), along with Dave Callaham, _Double Tap_ may not take too many risks, but it's a fine companion piece.\r\n\r\n10 years after the events in the first film, the quartet is still together and still getting on one another's nerves – there's the neurotic but sweet Columbus (Jesse Eisenberg doing his Jessie Eisenberg thing), the crass but caring Tallahassee (a wonderfully acerbic Woody Harrelson), the sarcastic Wichita (a dead-pan Emma Stone) and the laidback Little Rock (Abigail Breslin doing a lot with the little she's given). As we meet them, they're in the process of taking up residence in the White House – Columbus and Wichita are still a couple, but recently, she's started to wonder if perhaps their relationship is more important to him than it is to her; Little Rock is now a young woman who resents the fact that Tallahassee still treats her like she's 11; and Tallahassee, for his part, hasn't changed an iota. After Columbus proposes to Wichita (using the Hope Diamond), she and Little Rock skip town, but she returns a month later, telling the others that Little Rock ditched her and headed to a supposed zombie-free commune. And so the trio reluctantly set out to find her. Along the way, we're introduced to Madison (Zoey Deutch, who completely steals the film), a millennial bimbo who's been holed up in walk-in freezer; Berkeley (Avan Jogia), a peace-loving hippie; Nevada (Rosario Dawson), a tough-as-nails Elvis aficionado; and Albuquerque (Luke Wilson) and Flagstaff (Thomas Middleditch), who are eerily similar to Tallahassee and Columbus (the reveal of which was spoiled by the trailer). There's also a new breed of zombie, which is faster, stronger, and more intelligent than the regular kind, and which can only be killed with multiple head-shots.\r\n\r\nAnd that's about it as far as the plot goes. The original film came at a time when the zombie genre was just starting to be taken more seriously – Danny Boyle's _28 Days Later_ and Juan Carlos Fresnadillo's _28 Weeks Later_ were released in 2002 and 2007, respectively, introducing all manner of innovations and turning many of the genre tropes on their head; Jaume Balagueró and Paco Plaza's _[•REC]_ films were released in 2007 and 2009, setting a new standard for found footage films; _The Walking Dead_ debuted in 2010, and for the first few seasons it was as well-reviewed a show as you could find (until it turned into repetitive self-parody). Zombies also featured heavily in video game franchises of the era, such as _Siren_ (2003), _Dead Rising_ (2006), _Dead Space_ (2008), and _Dead Island_ (2011). _Zombieland_ cared about none of that – it was, in fact, the inverse of such titles, a film that didn't take anything seriously, least of all itself. \r\n\r\nWith this in mind, although 10 years have passed and the landscape is very different, one of the sequel's most successful elements is that next to nothing has changed; in essence, it acknowledges the gap precisely by ignoring it. So, Columbus's opening voiceover specifically refers to the long break as he thanks us for choosing _Double Tap_ when there is such \"_a wide choice of zombie entertainment_\" and Madison tells Tallahassee his catchphrase is \"_very 2009_\", but the film as a whole feels as if it was shot immediately after the original. Of course, this is important insofar as in the universe of the franchise, the last decade has been very different to the last decade of our reality, so the filmmakers can't layer in too many contemporary references – although Columbus does mention how \"_unrealistic_\" _The Walking Dead_ comics are, there's a hilarious deconstruction of the concept of Uber, and there's a subtle allusion to Trump when Wichita sarcastically tells Tallassee he'd have brought \"a real dignity\" to the office of the presidency.\r\n\r\nThis factors into the performances as well, insofar as Columbus, Tallahassee, and Wichita are all broadly similar to how they were 10 years ago. Little Rock has changed significantly, but that's as much to do with the fact that she was a child in the original and is now a young woman. This lack of character development may sound like a bad thing, but really, the familiarity of the characters and their group dynamic has its own inherent charm, we welcome it because it's familiar, with the cast essentially doing the same things they did in the original. Speaking of performances, Zoey Deutch completely owns every scene she's in. Sure, the character is clichéd as all hell and, on paper, she should be all kinds of annoying, but that she isn't, is a testament to Deutch's warm performance, finding genuine pathos amidst the perpetually peppy and cheerful high-energy ditz. She also has great chemistry with the original cast, especially Harrelson. In fact, all of the new actors have terrific chemistry, which is nice to see insofar as effortless chemistry was one of the hallmarks of the original.\r\n\r\nIn terms of problems, as mentioned, the film doesn't do a whole lot that wasn't in the original – the characters are the same, the narrative beats are the same, the group dynamic is the same, the sense of humour is the same – and for some, this will certainly be an issue. Indeed, as much as I enjoyed the film, I would have liked to see it take more risks (there's certainly nothing here to rival the inspired Bill Murray cameo). Because of this blanket similarity, there is a sense in which the sequel isn't really its own thing, it's defined primarily by what the original did rather than forging its own path, and a lot of the meta-humour only works if you know the original. Another problem is that it fails to do much with an interesting set-up, which sees women chaffing against traditional gender roles and the identities conferred on them by men. Once the gang end up on the road, this theme is pretty much forgotten (even with the introduction of Nevada, who seems more like a man's idea of what a tough woman should be than her own person). There are also more than a few clichés, primarily in relation to Madison (as blond a character as you'll ever meet) and the one-note Berkeley (a weed-smoking gun-hating hippie, who is literally introduced by way of a sitar on the soundtrack).\r\n\r\n_Zombieland: Double Tap_ is undemanding and doesn't completely justify its existence, but it also does justice to the original, and never for one second does it take itself seriously. The effortlessness with which it slots into the original's groove is either funny in its own right or poor writing, depending on your perspective, but the film is smart enough to know and acknowledge that it feels slightly out of place in 2019, in a way the 2009 original did not. And if a little of the spark has been lost, the warmth, the characters, the jokes, and the playfulness more than make up for it.", "created_at": "2019-11-04T03:00:18.087Z"}, {"movie_id": 338967, "review_id": "6463724adbbb420136386cb4", "author_rating": 2.0, "review_text": "The first film was a lot of fun but this is a very tired and very unfunny cash grab could not even bring myself to finish it.", "created_at": "2023-05-16T12:08:42.874Z"}]