[{"movie_id": 1417, "review_id": "5d93dcbdd2b2090012123650", "author_rating": 8.0, "review_text": "Beautiful movie from Guillermo del Toro and while I did like the movie and its World War II-era plot, I can't say I was totally in love, feeling this was more style over substance, though the acting from the young Ivana Baquero was really good. **4.0/5**", "created_at": "2019-10-01T23:09:49.200Z"}, {"movie_id": 1417, "review_id": "63e9de7a63aad200e05e034e", "author_rating": 7.0, "review_text": "I think this is my favourite film, as yet, from Guillermo del Toro - and it gets better the more you watch it. Set against at backdrop of a Spain still trying to recover from it's civil war, the young \"Ofelia\" and her pregnant mother \"Carmen\" are sent to live with the rather brutish \"Capt. Vidal\". Now he is a singularly nasty piece of work and the girl longs to meet her own real father. It's in the middle of the night that \"Ofelia\" encounters a sprite who offers her some hope. It knows of a faun in the middle of a maze who might be able to help, and so they set of in search of this ostensibly sagely and benign creature. The meeting offers her far more than a glimmer, she need only complete three tasks and will find herself taking up her inheritance as a princess and reunited with her kingly father. What now ensues is a fairy tale full of dark magic and untrustworthy characters whom the young girl must face if she is to succeed. Given the atrocities being carried out in the real world around her, she seeks more and more solace in this nether world that is probably just as dangerous - it certainly has it's fair share of malevolence and duplicity - but with her father the ultimate goal, she perseveres with wisdom and gritty determination. What makes this work is the delicious permutations of evil it offers. Contrasting the real with the fabled, the human with the fantasy - and the decency the young girl epitomises is by no means certain of success. The visual effects cleverly integrate both of her worlds without dominating the look of the film or the potency of the story - one of love, ambition, fear, trickery. It's creatively exciting and captivating too. This is storytelling at it's best, and on a big screen can be appreciate to it's full - and dazzling - effect.", "created_at": "2023-02-13T06:53:46.269Z"}]