[{"movie_id": 227719, "review_id": "561a191292514111c3001c4a", "author_rating": null, "review_text": "Look…one can never have enough time travel movies for our escapist needs, correct? After all, the possibilities are endless in terms of how filmmakers could explore the surreal dynamics of different dimensions thus allowing audiences to suspend their disbelief and engage in the wonderment of SF exuberance. So the question remains: can first-time director Dan Israelite instill some fresh distinction into the ubiquitous genre with the teen-oriented time travel vehicle ‘Project Almanac’? Well, let’s just say that superior spectacles such as ‘Looper’ and this year’s engaging ‘Predestination’ have nothing to worry about in terms of giving way to Israelite’s featherweight found footage fantasy. In fact, ‘Bill And Ted’s Excellent Adventure’ looks appetizing and inspired in comparison.  Relentlessly sketchy and as exhilarating as a PBS-televised high school science project during summer vacation, ‘Project Almanac’ fails to bounce sufficiently with its erratic presentation of cockeyed camerawork and crew of stock character whiz kids along for the surreal joyride.\r\n\r\nIsraelite and screenwriters Jason Harry Pagan and Andrew Deutschman concoct a breezy kiddie escapist flick where the scientific impishness feels somewhat upbeat and the young cast seem to be engaged in the time-traveling adventure that giddily plays out. However, whatever spry momentum that ‘Project Almanac’ manages to achieve is undermined by the distracting shaky hand-held camera movements and choppy jump cuts that turn this sci-fi caper into a disjointed B-movie bubble. Furthermore, the inclusive found footage material is overblown and exhausting. The gimmick, when used sparingly, was a treasured touch to heighten the anticipated tension. But ‘Project Almanac’ is not the only guilty party to spoil the essence of such a ‘trick of the trade’. The reality is that contemporary cinema–especially in horror and sci-fi–resort to these technical tactics to the point of no return.\r\n\r\nIt is no surprise that the arbitrary jittery cosmetics behind ‘Project Almanac’ is under the producing credit of Michael Bay whose reputation for exorbitant twitchy filmmaking has been documented in previous pulsating actioners.  Brilliant high school science mastermind David Raskin (Jonny Weston) has ambitions for attending prestigious MIT and needs the appropriate experimental project to be conducted in his attic for acceptance to his choice of prestigious schooling. The finances are tight and David is chasing after a scholarship that should ease the economic burden on his widowed mother (David’s scientific father had recently died).\r\n\r\nSo David is a chip off the old block like his late father. Daddy Dearest, however, did provide some incentive for his son to to realise his MIT dreams. David had discovered an unfinished experiment of his dad’s – a mysterious machine that has the capability of relocating individuals through time. This discovery is in the company of his ‘herd of nerd’ friends plus his younger sister Christina (Ginny Gardner) along to record the curious contraption that will eventually take them all on a back-and-forth odyssey where they can pop into time traveling moments that range from dealing with school bullies to being placed in front of chemistry class testing sheets.\r\n\r\nInterestingly, ‘Project Almanac’ never seizes the opportunity to think big in its time-traveling exploration. Instead, the movie mopes around with trivial tidbits such as petty scholarly set-ups and never really delves into grand confrontational entanglements that one would expect young impressionable brainiacs to face while awkwardly placing them in sensitive settings that all the book learning in the classroom cannot solve. The concept of this so-called time machine that David found in the basement by the skilled hands of his deceased old man should have predictably brought both father and son briefly together immediately in the name of their beloved interest in science, an irony nearly overlooked that could have been both poignant and profound. The nonsense of the kids cheating through invading the lottery result and retaking tests is a mere slap-on-the-hand cautionary tale that comes off somewhat corny and predictable.\r\n\r\nSadly,  ‘Project Almanac’ morphs into teen soap opera territory and sinks the minimal sci-fi flavoring it had for a nonsensical diversion punctuated by the aforementioned shoddy camera fluctuation and lack of time-traveling zest beyond small-time incidental dilemmas. Weston’s David Raskin had the potential to be the second coming of ‘Back To The Future’s Marty McFly but the lame plot and punchless exploits handcuffs him from answering the call.\r\n\r\nProject Almanac (2015)\r\n\r\nParamount Pictures\r\n\r\n1 hr.  46 mins.\r\n\r\nStarring: Jonny Weston, Allen Evangelista, Sam Lerner, Ginny Gardner and Sofia Black-D’Elia\r\n\r\nDirected by: Dean Israelite\r\n\r\nRated: PG-13\r\n\r\nGenre: Science Fiction/Teen Time Travel Adventurer/Sci-Fi and Fantasy\r\n\r\nCritic’s rating: ** stars (out of four stars)", "created_at": "2015-10-11T08:08:50.960Z"}, {"movie_id": 227719, "review_id": "5c5d60f1c3a3684c238a5df6", "author_rating": null, "review_text": "Project Almanac is a film based on time travel. A bunch of students find a device which allows them to make jumps to the past. While the film starts off well, the second half of the movie has way to many plot-holes leaving the viewers with too many questions. The cast is young and is good for the film but nothing out of the world. It's worth a one time watch if you aren't one who complains about timeline consistencies.", "created_at": "2019-02-08T10:58:57.744Z"}, {"movie_id": 227719, "review_id": "5e89b838b84f940014cbaccc", "author_rating": 6.0, "review_text": "I have always been drawn to stories of time travel. The best book I have read was Time and Again, by Jack Finney. I am sorry they never made a movie out of it, probably because it was more subtle with less action than other sci-fi stories for most of the book. But there are plenty of time travel movies out there, like this one.\r\n\r\nThe fact that teenagers are using the device to travel in time, plus the fact that - at first - they can't travel back more than a few weeks, obviously was put in place to limit their ability to travel whenever they want. So instead of trying to prevent a horrific world event, for instance, they are jumping back in time to tweak their own lives and mistakes. If you have watched many time travel movies, it isn't a spoiler for me to say things don't go exactly as planned.\r\n\r\nThere are a few clever plot twists here, and I mostly liked the chemistry between the lead characters. The dialogue became a bit wooden here and there, but overall the writing wasn't bad. I have to say my biggest gripe was with the hand-held camera routine. I almost wonder if they used it just to honor another movie with the word \"Project\" in the title, if you are wondering 'witch' movie I am referring to. But whatever the reason, it didn't really work for me.Their reasons for always lugging the camera around, even when there was just one character, fell flat for me. For the loss in camera work quality, there wasn't enough of a gain in plot or character interaction. But it didn't cause me to give up on it, just to wish it lived up to its potential. I am not going to comment on the ending and risk giving anything away, except to say that it felt a bit anti-climactic to me.", "created_at": "2020-04-05T10:51:36.206Z"}]