[{"movie_id": 474350, "review_id": "5d6fc492e22d28000fb54250", "author_rating": 8.0, "review_text": "‘It Chapter 2’ isn’t as stable or as refined a film as its predecessor, and while it feels lacking by comparison, it’s still far better than most studio horror films. It’s epic, ambitious, crazy, witty and unafraid to go for the heart as well as the throat. As a whole, this adaptation of maybe Stephen King’s greatest work feels singular in the landscape of modern horror cinema: two films built on strong interconnected relationships spread over decades, as sentimental as they are vicious, and executed on the scale of a fantasy epic. They also may be amongst the best adaptations of King’s work, understanding what makes his writing (and this novel in particular) so horrifying and so arresting, the human horror amongst the fantastical. Andy Muschietti aimed big with ‘It’, and even in the moments its reach exceeds its grasp, you’re still so glad it reached so high in the first place.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-it-chapter-2-the-ambitious-conclusion-to-the-beloved-horror-epic", "created_at": "2019-09-04T14:05:06.156Z"}, {"movie_id": 474350, "review_id": "5d7a7a93069f0e10db322bcc", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nSo, Chapter Two is a sequel to It (2017), and my expectations were a bit high. I really enjoyed the latter to the point of considering it one of the year’s best, as well as one of the best Stephen King cinematic adaptations. Andy Muschietti returning to the director’s chair and having such a fantastic cast portraying the adult versions of the Losers (not only in terms of quality acting but also regarding how well the adults look like the older versions of the young actors) are two of the main reasons why I was genuinely excited. Also, the runtime (longest horror movie ever?!) definitely left me wondering how a horror flick could have the same duration of some of the most epic films in cinema…\r\n\r\nWell, I got to be honest: I’m disappointed. It’s not a bad movie, at all, but it doesn’t even come close to its predecessor’s heels. I disagree with some headlines I’ve read though. Some say the comedy was misplaced, taking away impact from emotional or dark moments. There’s barely a moment where it was expected seriousness and laughter kicked in instead, but when it does occur, it actually works. I just think it wasn’t as funny as the previous film, overall. Granted, Bill Hader as Richie Tozier is hilarious, and a perfect cast as an adult Finn Wolfhard. His chemistry with James Ransone (Eddie Kaspbrak) resembles the one Wolfhard, and Jack Dylan Grazer had, therefore this/these duo(s) being the comedy highlight.\r\n\r\nSome say the movie is too long. Now, this is a tricky one. Usually, when people feel bored or not as entertained as they wanted to be, they tend to blame it on the film’s runtime, especially if it’s over 100 minutes. I agree that the movie FEELS long, but I disagree that the runtime is too long. There’s more than enough story to explore, and literally, every single character from the Losers Club has an interesting arc. The problem here is that not all of them are explored in a way that’s funny, scary, or just captivating enough. The fact that Jessica Chastain’s (Beverly Marsh) sequence with the old lady is entirely displayed in one of the trailers (and consequently shown at every single screening) doesn’t help the pacing.\r\n\r\nThe first act is pretty decent. As expected, it shows us where everyone is, what they’re doing for a living, and how they get back together. During this act, it’s pretty clear that Muschietti is going to give time to develop each character and follow their respective arcs to the end, hence the lengthy runtime. However, the second act falls flat. Bill Denbrough (James McAvoy / Jaeden Martell) has the most emotionally impactful storyline, one that affects the main plot, making the time that is spent with him worth it. Same goes for Richie’s subplot. On the opposite side, the rest of the group doesn’t have entertaining sequences or new developments whatsoever.\r\n\r\nBeverly continues to be affected by her childhood of abuse from her father. Ben Hanscom (Jay Ryan / Jeremy Ray Taylor) keeps being in love with Bev. Eddie is still a whiny little “kid” who’s scared of everything that might make him ill. Stanley Uris (Andy Bean / Wyatt Oleff) doesn’t do anything, and Mike Hanlon is surprisingly the engine that moves the plot forward, which is a problem of its own since I never really cared for that character (he was definitely the one put aside in the 2017’s movie). Honestly, he just serves as an exposition device considering he spends the whole time just explaining everything the audience needs to know to understand where the film is going.\r\n\r\nFinally, the third act is a mixed bag. While it does provide a climactic ending with a sweet message, it feels very much like its predecessor. I don’t want to spoil anything, but it’s incredibly repetitive comparing to the first movie. Considering all things together, it’s a big letdown since it feels like the exact same film, but with older versions of the characters. Obviously, each of them has a different arc in this one, something the first didn’t have the time to explore, but looking at the main story, it’s pretty much the exact same thing, including how it ends (just with a minor twitch). Nevertheless, the performances are all great… \r\n\r\nJames McAvoy continues his streak of amazing displays, and Bill Hader has to be the MVP for the range he demonstrates. I wish Skarsgård had more time to shine as Pennywise, though. In 2017, I thought he really nailed the character and made it his own. Unfortunately, this time around, Pennywise doesn’t have that much screentime (such a disappointment), and when it appears, it often looks too CGI-ish, taking away from the gripping performance of its actor. The finale has almost no Bill Skarsgård since there’s so much CGI. Despite that, I congratulate the team(s) behind the makeup, hairstyling, costume, and production design. Derry looks terrific, and the time jumps between the young and the old gang worked seamlessly partially due to these visual achievements.\r\n\r\nAndy Muschietti knows how to work a camera, and the movie is very well-shot. However, he should have been able to come up with creative sequences to deliver a different level of entertainment, especially during the tiresome second act. Gary Dauberman’s screenplay is clever, and it brings this enormous story to a fitting conclusion, but he also could have imagined some new ideas for some of the characters. There are a couple of great sequences though, especially one with Bill going through a theme park tent with illusions. \r\n\r\nIn the end, It Chapter Two fails to deliver a conclusion worthy of its epic runtime. Even with a phenomenal cast, it isn’t as funny, as scary or even as captivating as its predecessor. Its runtime is appropriated having in mind that each character has a personal arc, but only a couple of them are genuinely compelling and entertaining. Therefore, the film feels too long, uneven, and it could have used a bit more creativity when it comes to its climactic finale. Its central story feels very similar to the last movie, its scary sequences are nowhere near the quality seen before, and even though the costume and production design are top-notch, there’s excessive use of CGI on Pennywise. It still carries some emotionally convincing moments, as well as a couple of cool sequences. Overall, it’s … okay.\r\n\r\nRating: C", "created_at": "2019-09-12T17:04:19.099Z"}, {"movie_id": 474350, "review_id": "5d8e4a85221ba60029b5a0fe", "author_rating": 9.0, "review_text": "It's the love story between Richie and Eddie that makes this movie worth viewing twice. Looking forward to the conclusion!", "created_at": "2019-09-27T17:44:37.030Z"}, {"movie_id": 474350, "review_id": "5d9490aca06efe001e5b0700", "author_rating": 7.0, "review_text": "A pretty odd choice too undercut every scare in the movie, but I was less disappointed with _Chapter Two_ than everyone else seems to be. I gave it the same star rating as the first Muscietti _It_ movie, but if I'm being honest, that one was definitely better. Doesn't make this bad though. \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-10-02T11:57:32.720Z"}, {"movie_id": 474350, "review_id": "5deb24515c5cc80014cba2e4", "author_rating": 7.0, "review_text": "Wasn't a huge fan of the first but did like the young cast but the scares were non-existent. This sequel had a couple okay moments and I did like the characters as adults, but Bill Hader easily was the standout. Still wasn't very scary yet even with the lengthy running time never felt like it dragged. One day I may try watching the two back to back, but between the two, not overly impressive. **3.5/5**", "created_at": "2019-12-07T04:02:25.853Z"}, {"movie_id": 474350, "review_id": "5e2f26341685da0019e932b9", "author_rating": 7.0, "review_text": "“You lied and I died!”\r\n\r\nMaking us proud Georgie.\r\n\r\nI re-watched the 1990 mini-series and 2017 remake last month in preparation for this movie in terms of judging in quality. The 90's version had it moments, but I find some scenes unintentionally funny where it reeked of early Stephen King adaptations. 2017 was surprisingly good and a massive improvement, but laid back on cheap thrills.\r\n\r\n‘IT: Chapter Two’ was a tough act to follow up on after the monster success of the first and with the second chapter being the hardest to adapt. I thought the movie both succeeds and stumbles in parts. Although reflecting back makes it feel more like a parody than a serious horror movie. An epic finale that ended in a over the top fashion - with themes of childhood trauma and the idea of holding on to the past despite growing up with age are sprinkled through out. The loser club are all grown up now and returning home to kill IT.\r\n\r\nWhoever cast the grow up version of the loser club deserves massive praise here, because it’s pitch perfect casting and I could definitely see the child stars growing up to be the adult stars. James McAvoy, Jessica Chastain, Jay Ryan, and Isaiah Mustafa were all great in bringing the more dramatic aspects to the film. While Bill Hader and James Ranson bring the comedic aspects, but not to say they weren't dramatic as well, even making me tear up at one point.\r\n\r\nBill Skarsgard was truly amazing as Pennywise. The physicality in his movement has a certain silliness that you would expect to see from a clown, yet predatory with his animal-like attacks with drool running down his mouth and eyes staring in opposite directions despite looking straight at you. I find the dancing clown incredibly terrifying whenever he becomes playful and kind to deceive children.\r\n\r\nAndy Muschietti truly shines as a director when it comes to bizarre imagery and unsettling camera angles, while also capturing some real emotions through the lens. The opening scene at the bridge where a homophobic attack takes place was really brutal and starts the movie off strong - on par with the Georgie meets Pennywise scene in the first movie.\r\n\r\nDespite the run time being nearly three hours long, but I can’t recall ever being bored. It moved at a even pace in my opinion. I guess a few scenes could’ve been cut as most of it is unused footage from the first movie. Although it would be difficult to cut scenes as everything follows up to the next scene and that emotional punch towards the end wouldn’t be earned.\r\n\r\nNow for the issues:\r\n\r\nHenry Bowers was completely pointless in this movie and was only used for jump scars. Same thing with Mike, who through out these movies has nothing to do and the important things he did in the book was given to different characters.\r\n\r\nI didn’t like how Stan’s suicide was handle, because you find out he actually “sacrificed” himself to save the others.\r\n\r\nSome of the humor didn’t always land, especially if it’s right after a tense scene where it kinda deflates the horror. At times I struggled to gasp what the film marker was going for in certain scenes. Is this scene suppose to be scary or funny? Both maybe?\r\n\r\nI wish there was more practical work for the monster scenes instead of CGI, because at times it looked really terrible. The finale battle at the end could’ve been in a video game boss fight.\r\n\r\n* Overall rating: Not as strong as the first, but still enjoyed it. Still, let’s kill this f**king clown.**strong text**", "created_at": "2020-01-27T18:04:36.238Z"}, {"movie_id": 474350, "review_id": "5feb5f1364f716003e0f6ff8", "author_rating": 8.0, "review_text": "A step down, but <em>'It Chapter Two'</em> is still a very good film.\r\n\r\nIt is, I will say, overly long, it did bore me a little at the midway point; not in a necessarily negative way, I just wanted more. However, it regains its footing with an entertaining ending. I'm usually not a fan of cast changes in film series, but this does it to good effect. I love the characters, whether it be in this film or the preceding entry.\r\n\r\nJessica Chastain and Bill Hader are great choices to play the older versions of Sophia Lillis and Finn Wolfhard, they are very convincing casts. James McAvoy is also a positive addition, while Bill Skarsgård remains enjoyable as It.\r\n\r\nThe score is, again, strong. I like the plot, even if I do feel like it's stretched out and could've had more freshness added to it. It isn't as creepy as the first film either, but still has a solid amount of uneasiness.", "created_at": "2020-12-29T16:53:39.443Z"}, {"movie_id": 474350, "review_id": "624047fe706e56008bd236c8", "author_rating": 5.0, "review_text": "I watched the two films in a double bill and I really did want to enjoy this as much as I did the first - but boy, could this have been much more of a let down? The original has a far better cast; snappier direction and a much tighter script. This just rumbles along with a staccato, portmanteau-style storyline that robs the narrative of much of the cohesion of it's earlier iteration. The ending is straight out of \"Harry Potter and the Prisoner of Azkaban\" without the roller skates!. Sadly disappointing.", "created_at": "2022-03-27T11:18:22.063Z"}, {"movie_id": 474350, "review_id": "63bf7025df857c009f432e49", "author_rating": 1.0, "review_text": "How does a movie with no story become 3 hours long?\r\n\r\nSeriously, it's a real question.\r\n\r\nNothing seems to happen... ever... and they virtue signal by changing a character, because you have to now... but nothing really happens for most of the movie.\r\n\r\nAnd the horror felt a bit like a kids movie.\r\n\r\nBut ultimately it's 3 hours with no real plot.", "created_at": "2023-01-12T02:27:49.112Z"}, {"movie_id": 474350, "review_id": "64a59b16158c8500e24abffd", "author_rating": 10.0, "review_text": "Chapter 2 was more awesome then the first. I even got a little freaked out myself on some parts. This has easily become one of my favorite horror films of all time.", "created_at": "2023-07-05T16:32:22.363Z"}]