[{"movie_id": 7555, "review_id": "5d66ea506082eb0015a57270", "author_rating": 9.0, "review_text": "Kick-ass action all around and although the story is on the basic side and has minimal character development for Rambo himself, just a bloody, albeit too much of it CGI'd, entertaining especially an action-fest finale. Amazing, especially being the fourth entry into the series.", "created_at": "2019-08-28T20:55:44.445Z"}, {"movie_id": 7555, "review_id": "5eac577ec8a2d4001e4ae2ef", "author_rating": 9.0, "review_text": "_**Intense with more depth than you might think**_\r\n\r\nJohn Rambo (Sylvester Stallone) is alone, bitter and living hand-to-mouth in Thailand when a group of Christian missionaries enlist him to take them into Burma (aka Myanmar) to aid a village. Rambo discourages them in light of the political instability, which includes persecutions and mass slayings, but they insist. Weeks later he learns that the missionaries are missing so he goes back with a group of mercenaries.\r\n\r\n\"Rambo\" (2008) is the fourth installment in the franchise after \"First Blood\" (1982), \"Rambo: First Blood Part II\" (1985) and \"Rambo III\" (1988). I'm a huge fan of the first one, which I think is an action/adventure masterpiece, but the next two films are too comic-booky and the characters are cardboard, although Stallone never looked better and the locations are fabulous. \r\n\r\nThis third sequel makes up for that because it's not comic booky at all and there's quite a bit of depth, albeit not much in dialogue form. It combines elements of \"Apocalypse Now,\" \"The Killing Fields\" & the first two Rambo films and is grim & intense from beginning to end, not to mention it's one of the most violent films ever made. The picture powerfully illustrates the best and worst in humanity. The Christian missionaries are willing to risk everything to help the villagers, whereas the Myanmar militarists revel in slaughtering scores of unarmed people for \"fun\"; they're also shown abusing/raping women and boys. Obviously they've given themselves wholly over to the darkside of their natures. Such reprobates are only worthy of one thing: Utter annihilation.\r\n\r\nSeveral important themes are addressed in the picture besides the main one:\r\n\r\n* BITTERNESS/DESPAIR AND DELIVERANCE. The beginning of the film shows Rambo in a state of utter bitterness: He's just existing. He has no friends. He doesn't talk much and, when he does, it's few words laced with expletives. The male leader of the missionaries is completely unable to talk him into helping them. Two Biblical proverbs state \"a gentle answer turns away wrath\" and \"a gentle tongue can break a bone.\" The female missionary (Julie Benz) knows this and skillfully talks John into helping them. Yet there's more going on here. This woman with a heart of gold is Rambo's \"golden connection\" out of the rut of bitterness. Despite his gruff exterior, she sees something in him, something in his eyes – a good heart, even greatness, a genuine glimmer, however faint. Is Rambo helping the missionaries or is she the one helping him? John instinctively realizes the rope she's throwing him and takes hold of it. There's nothing sensual about their relationship, despite her attractiveness; it's solely spiritual. She stirs in him the hope and faith he's been longing for.\r\n\r\n* VIOLENCE IS NOT ALWAYS NECESSARY. Although this is a very violent film it skillfully shows when pacifism _is_ appropriate. Note the incident on Rambo's riverboat when the lead mercenary continually insults John and tries to provoke him into a fight. Rambo just ignores him, not even saying a word. In other words, he refuses to allow someone to victimize him and draw him into a conflict that has no positive purpose. It takes true strength to do this and Rambo has this strength. Indeed, John treats the guy as if he's a bothersome gnat. What do you do when a gnat bothers you? Do you break out a machine gun or merely ignore it? This is the \"turn the cheek\" principle.\r\n\r\n* TOTAL PACIFISM DOES NOT WORK. The New Testament does not support the idea of absolute pacifism, but rather limited pacifism (only resorting to violence when justified). For instance, Christ’s ministry team had a treasury box with loads of money and some of his workers carried swords for protection from thieves & murderers. Also, Romans 13 clearly states that the righteous laws of human governments are God-ordained for the purpose of punishing criminals, including the right to execute when appropriate. The vast majority of sane Christians realize this, but there are a few extremists who refuse to be BALANCED with the Scriptures on this topic and insist that conflict, and especially armed conflict, is never appropriate. The lead male missionary represents such a person, but perhaps he'll learn the error of his ways. The simple fact is: Some people are so degenerate and evil that execution is the only just ultimate reaction (notice I said \"ultimate\").\r\n\r\n* RAMBO’S SPIRITUAL REBIRTH. The first two sequels show Rambo searching for truth and flirting with religion and spirituality. In the second film he gets a Buddhist necklace off the Asian woman he befriends and at the beginning of \"Rambo III\" he is shown living & working at a Buddhist temple helping the priests; later, he meets and wins the hearts of moderate Islamic villagers and gives his necklace to a Muslim boy who helped him. In this movie the female missionary is key to John's positive transformation; at one point she gently asks him whether or not he has any family in the USA. He mumbles that he might have a father, he wasn't sure, and didn't seem to care. Shortly later she gives him a cross necklace for helping them (he wouldn't take money). Anyway, the end of the film shows Rambo walking to his family ranch in southern Arizona. Obviously John had a positive spiritual metamorphosis in the story that leads to a decade of peace & love before the next film, “Last Blood” (2019).\r\n\r\n\"Rambo\" was written & directed by Stallone and shot in Thailand (and Arizona). It’s short & sweet at 1 hour, 32 minutes.\r\n\r\nGrade: A", "created_at": "2020-05-01T17:08:14.734Z"}, {"movie_id": 7555, "review_id": "62404a625a991500483bdf2b", "author_rating": 7.0, "review_text": "Sylvester Stallone is in his element as the eponymous Vietnam veteran who has retreated to a rural community where he acts as a tourist guide for visitors on his ramshackle old PT boat. When he is approached by some human rights folks who want to charter his boat to seek out some missing Christian Aid missionaries up-river in strife-ridden Burma, he eventually acquiesces and they are soon in a world of pain at the hands of the brutally sadistic \"Maj. Tint\" (Muang Muang Khin). It's an end-to-end action movie, pyrotechnics galore with some seriously graphic - thereby authentic - scenes of violence that have their roots in a plausible storyline based on well documented abuses from South East Asia in the 1970s. The dialogue is a bit gung-ho, but this is about characterisations and Stallone, Graham McTavish (\"Lewis\") and Julie Benz (\"Sarah\") help create a suspenseful drama that is light on message and heavy on delivery...", "created_at": "2022-03-27T11:28:34.923Z"}]