[{"movie_id": 16320, "review_id": "51a44026760ee33bdc0c4e1e", "author_rating": null, "review_text": "A nice wrap-up to Firefly, unfortunately far too condensed. In may ways it felt like they took the major events that would have spanned the next 2 or 3 seasons and crammed it all into a 2 hour movie.\r\n\r\nNonetheless, it provides a decent sense of closure to the series.", "created_at": "2013-05-28T05:27:02.071Z"}, {"movie_id": 16320, "review_id": "52e5b3e4760ee34a5e0fa5d0", "author_rating": 0.5, "review_text": "This was an extremely poor movie. The weakest character during the TV series, River Tam, confusingly became the story focus in this movie.\r\n\r\nDespite never exercising and having a small frame, River fought and K.O.ed a room full of bar patrons.\r\n\r\nThe crew, mysteriously, were devoted to going to the planet River wanted to visit to help her discover her past despite showing various degrees of hostility toward her during the series ranging from open contempt to advocating her murder.\r\n\r\nThe main villains do not make sense. They are, supposedly, so wild that they regularly sack planets and cannibalize its inhabitants, but can still work together well enough to fly space ships. The entire population of these wild people came from the planet River wants to visit and from a single research facility. I'd guess about 1,000 research and support personnel were initially infected. They have no way of infecting further individuals, the facility was shut down, and yet their current population is many times the original amount. How?\r\n\r\nThe plot does not make sense. It is not engaging. None of the characters are interesting. The characters die without emotional impact. Pass on this movie. Like the TV series, this is a waste of time.", "created_at": "2014-01-27T01:18:28.627Z"}, {"movie_id": 16320, "review_id": "5d8a1bffc58acd00192ef36b", "author_rating": 7.0, "review_text": "This is the captain. We have a little problem with our entry sequence, so we may experience some slight turbulence and then - explode.\r\n\r\nSerenity is written and directed by Josh Whedon. It stars Nathan Fillion, Gina Torres, Alan Tudyk, Morena Baccarin, Adam Baldwin, Jewel Staite, Sean Maher, Summer Glau, Ron Glass and Chiwetel Ejiofor. Music is by David Newman and cinematography by Jack N. Green. \r\n\r\nWhen the captain Mal Reynolds (Fillion) of the space craft Serenity takes on board Dr. Simon Tam (Maher) and his troubled sister River (Glau), it thrusts the entire crew into a world of conspiracy and galactic despots. \r\n\r\nComing at it as a complete novice as regards \"Firefly\", the short lived TV show that Serenity is spawned from, I personally have no frame of reference to work from. What I found was a hugely enjoyable sci-fi Western hybrid that deserved a better box office than it got. The cast are all comfortable with each other and very watchable, which isn't surprising since Whedon has transported them all over from \"Firefly\", good move that, while the action quota is high and the black comedy rich.\r\n\r\nWhere the itches start to appear for newcomers like myself, is that it does feel like an extended TV episode. With a twisty plot that sees Whedon cram much into the 2 hour running time, it demands the utmost attention. Which is fair enough to a degree, but many go (or more pertinently would have gone) into \"Serenity\" for a sci-fi action adventure, not for a tickle of the cranium. If this contributed to the poor show at the box office? I'm not sure. But you have to think this really was only made for the die-hard fans of the show.\r\n\r\nGalling really, because the last third is a ripper of a blockbuster. The action sequences are expertly crafted, the story explodes still further and the principal characters really let loose, particularly the excellent Fillion. Biggest plus of all, the finale doesn't cop out by insulting those who have stayed the course chartered by the good ship Serenity and its crew. It's smart genre film making, a very enjoyable film without doubt, but really it's not got mainstream appeal. Which might suit those die-hards in a selfish kind of why, but that also means we are unlikely to get a sequel. And that's a shame because a newbie like me could easily stand some more of this whizz bangery. 7/10", "created_at": "2019-09-24T13:37:03.356Z"}]