[{"movie_id": 10330, "review_id": "5f0c951013a32000357f5b3d", "author_rating": 7.0, "review_text": "Really good watch, will watch again, and can recommend.\r\n\r\nI'm not sure what it is about this movie, but it's just an easy, fun watch.  Jamie Lee Curtis is a seasoned actress, and Lindsey Lohan had finally built enough experience to be reliable in this role where she's basically doing an impression of Jamie Lee Curtis being her mom.  I'm not a huge fan of either one, but I'm not going to deny their acting \"chops\" and they bring it here, giving the audience a natural and fun atmosphere to the dilemma.\r\n\r\nThere are several very good improvements on original movie in this: cutting a lot of the thought narrative, adding a medium for the swap magic, having them wake up different instead of insta-switching, and several of the added plot lines really help fill out the world better.  A career woman is more interesting to follow than a housewife (not that it's necessarily more important), the romance line(s) in this are surprising and slightly less creepy, and swapping a sports game out for musical show not only allowed for the cross competition between character events, but also allows for some great alt rock music throughout the movie: I'll admit to enjoying a movie more when I can relate to the music better.\r\n\r\nThere are several good supporting actors (big and small), to include the Chinese restaurant family which, I think is a very nice cherry on top of the story.  By having the source of the magic be an outside party, I think it helps the complexity of the story without causing confusion.\r\n\r\nIt's a fun watch, give it a go.", "created_at": "2020-07-13T17:08:32.825Z"}, {"movie_id": 10330, "review_id": "5f9f4aabede1b00038e45680", "author_rating": 8.0, "review_text": "Unlike with <em>'The Parent Trap'</em> films, there is a fair gap in favour of the original for <em>'Freaky Friday'</em>.\r\n\r\nThis 2003 remake is still very good, I definitely enjoyed it. It just feels a little hollow in some areas, at least until the sweet ending. Lindsay Lohan is great as the daughter, giving Jodie Foster a solid match. Jamie Lee Curtis gives a fairly strong performance, though Barbara Harris' portrayal of the mother is superior in my opinion.\r\n\r\nThere's fun to be had here for sure, it's just not on the same level as the excellent original for me.", "created_at": "2020-11-01T23:54:19.749Z"}]