[{"movie_id": 158852, "review_id": "56c331999251414b0a001bda", "author_rating": 7.0, "review_text": "I have to say that I quite enjoyed Tomorrowland despite its way too common mistake of being quite a bit nonsensically preachy to satisfy the current politically correct view of what is “wrong” with the world today. Filtering out those parts this is a quite enjoyable, visually very entertaining, family movie. If you have strong opinions about certain things then you might want to be with your kids when watching this one. Personally I consider my oldest son to be quite capable of making his own opinions and as for the two younger kinds I try to point out the pro’s and con’s and let them grow up to make their own mistakes.\r\n\r\nHaving that out of the way this is a visually quite wonderful movie. it is of course quite CGI enhanced but in a good way. It is a Disney movie after all so you would expect, at least I did, some “artistic freedom” as far as the scenery is concerned.\r\n\r\nThe story is actually a quite lovely “fairy tale” kind of story about a “wonderland” far far away. Initially it is a wee bit difficult to get a grip of what is happening since it all moves about all over the place a bit. If you can overcome that first disorientation it does indeed get somewhat sensible after a while. Having said that I mean “sensible” in the context of not only a wild and whacky science fiction movie but in the context of a wild and wacky science fiction movie aimed at the younger part of the audience. Despite the scientific blurb thrown around in the last half of the movie do not for a minute believe that any of the script writers have more scientific knowledge than the average Hollywood script writer which is…zero.\r\n\r\nTo me the enjoyment of this movie came from the childish fantasy style (it does have quite a bit of a fairly tale story over it), from the rather enjoyable cinematic effects, quite a bit of cool action and last but not least … George Clooney. Actually that is not entirely fair. George was part of it but what I really liked was the recruiting android all the way from the start. When Clooney entered the scene both him and the android pretty much stole the scene. I am afraid that the Newton girl, for a lot of the time, felt more like a “plot element” than a main character to me.\r\n\r\nI have to say that I quite liked the scenes in Paris as well. Sorry guys but I do live in France after all. The Eiffel Tower scenes where quite enjoyable and I do like the touch where they used Mr. Eiffel’s apartment at the top of the tower as a scenery. Actually I am not sure how many people actually know that there is an apartment (now a museum) up there. The stuff about a hidden room and a hidden [naah, that would be a spoiler] beneath the tower is of course truly nonsensical.\r\n\r\nSo, bottom line, if Disney would not have gone down the line of trying to make a political statement, and I do not care what that statement was except that it was blunt, obvious and unconcealed, then this movie would have gotten another star or two. I cannot justify giving it much lower than what I did since it was, technically speaking, a quite good and entertaining movie. However, movies for children is not the medium to make a statement unless you believe that you are living in a socialist state a ‘la the Soviet Union.", "created_at": "2016-02-16T14:26:33.136Z"}, {"movie_id": 158852, "review_id": "5fb09e057352050041155c85", "author_rating": 7.0, "review_text": "Wish it was greater, but for what it is it's still enjoyable.\r\n\r\n<em>'Tomorrowland'</em> is an intriguing futuristic film, it doesn't really delve as deep into its potential-filled premise as it should but it scratches the surface and it makes for - just about - solid viewing. The special effects are very nice, also.\r\n\r\nAs for the casting, I guess it could've been better. However, I did like the main quartet of Britt Robertson (Casey), George Clooney (Frank), Raffey Cassidy (Athena) and Hugh Laurie (David) - the latter has a good rant late on. I rate the way the story is told, mostly in retrospective by Robertson and Clooney - it keeps it interesting.\r\n\r\nI just feel more should've been done with this, given it's fairly entertaining even in its current state and has a load of potential. Either way, I did narrowly like it.", "created_at": "2020-11-15T03:18:29.489Z"}, {"movie_id": 158852, "review_id": "6471c89ddd731b00ddf05188", "author_rating": 7.0, "review_text": "A mega-grumpy George Cluney is always worth watching. A nice upbeat \"We can change our own future for the better\" movie. It's bright, colourful and inoffensive.", "created_at": "2023-05-27T09:08:45.813Z"}]