[{"movie_id": 429197, "review_id": "5c43ec1a0e0a266d5cd258d7", "author_rating": 6.0, "review_text": "Being Australian and under 30, Dick Cheney is not someone I ever payed a lot of attention to. I knew he shot that dude and the dude he shot is the one who had to apologise somehow, and that he was one of the evil puppet-master types who stood behind George W. That's it. So while Cheney as a subject matter isn't something I can say I **care** about, it's also not material that's old hat to me either. I ended up watching it only because that's what my mate wanted to do for his birthday, but I'm glad I did. I did not **love** _Vice_, but for the sort of thing I don't normally gravitate towards, I was riveted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T03:33:46.468Z"}, {"movie_id": 429197, "review_id": "5d290381be4b3612f6a27860", "author_rating": 6.0, "review_text": "**_Pretty enjoyable, very funny, but doesn't tell us anything we didn't already know_**\r\n\r\n> _We have guaranteed freedom, security, and peace for a larger share of humanity than has any other nation in all of history. There is no other like us. There never has been. We are, as a matter of empirical fact and undeniable history, the greatest force for good the world has ever known._\r\n\r\n- Dick Cheney; _Exceptional: Why the World Needs a Powerful America_ (2015)\r\n\r\nAs a non-American, I've always been fascinated by the concept of a two party system. Breeding rancour and division by its very nature, with only two sides from which to choose on any issue, the more controversial a subject is, the wider the ideological gap becomes. I'm not sure if it's a cause or a symptom, but intricately intertwined with such deep-rooted partisanship is the fact that everyone seems to be preaching to their own choir; Republicans have Sean Hannity, Tucker Carlson, and Ben Shapiro (and Alex Jones), whilst Democrats have Bill Maher, Anderson Cooper, and Chris Cuomo (and Cenk Uygar). The problem is that the people watching _Fox and Friends_ and reading _Breitbart_ are already staunchly on the right, whilst those watching CNN and reading _The New York Times_ are already firmly on the left; everyone is sermonising to the already converted, and no one is listening to what the other camp is saying. Written and directed by Adam McKay, _Vice_ is a good example of this; it's a left-leaning film made by left-leaning people for a left-leaning audience. When McKay was asked by the _ACLU_ if he had any theories as to why Jared Kushner and Ivanka Trump allegedly walked out of a screening, his response was telling; \"_I think the bigger question is: Why did they buy two tickets and walk in?_\"\r\n\r\nOstensibly a biopic of former Vice President Dick Cheney, _Vice_ argues that he was actually the _de facto_ President, with George W. Bush taking a back seat, particularly in the globally crucial years from 2001-2003. Very much a political satire in the vein of Decimus Iunius Iuvenalis and Jonathan Swift, or films such as Barry Levinson's _Wag the Dog_ and Joe Dante's _The Second Civil War_ (both 1997), _Vice_ eschews conventional narrative structure, breaks the fourth wall regularly, intercuts shots of fly-fishing and animals hunting into the middle of tense plot-heavy dialogue scenes, features several self-reflexive references to itself, has a false ending, has a scene in which characters speak in iambic pentameter, and in a deleted scene, the entire cast breaks into song. Much as was the case with recent \"based on a true story\" films such as Spike Lee's _BlacKkKlansman_ and Jason Reitman's _The Front Runner_ (both 2018), _Vice_ has one eye on the here and now, using Cheney's story as a vehicle to examine the current political situation in the US, positing that without the power-mad Dick Cheney and the Unitary Executive Theory, there would never have been a Donald Trump. However, although there are many individual moments of brilliance, the film is unsure if it's a straightforward biopic or an excoriating satire, ultimately finding a kind of ideological middle ground that mixes comedy with pathos, not always successfully.\r\n\r\nNarrated by Kurt (Jesse Plemons), a fictitious veteran of the Afghanistan and Iraq Wars, who claims to have a unique connection to Cheney, the film begins in Wyoming in 1963 as a young Dick Cheney (Christian Bale) is arrested for drunk driving for the second time. It then cuts to the Presidential Emergency Operations Center in the immediate aftermath of 9/11, as Cheney orders the shooting down of any suspicious commercial airliners, despite President Bush (who was en route to Washington from Florida) not signing off on such an order. How Cheney got from being a drunk in 1963 to taking control of the government in 2001 is the film's primary focus, introducing us to a huge cast of characters (played by an extraordinary ensemble), all of whom feature in Cheney's rise to power in some manner – Lynne Vincent (Amy Adams), Cheney's fiancée and later wife; Donald Rumsfeld (Steve Carell), under whom Cheney worked from 1969, later White House Chief of Staff (1970-1971) and Secretary of Defense (1975-1977 and 2001-2006); Gerald Ford (Bill Camp), President (1974-1977), for whom Cheney was White House Chief of Staff; George H.W. Bush (John Hillner), President (1989-1993), for whom Cheney was Secretary for Defense; Liz (Lily Rabe) and Mary (Allison Pill), Cheney's two daughters; Roger Ailes (Kyle S. More), founder of Fox News; George W. Bush (Sam Rockwell), President (2001-2009), for whom Cheney was Vice President; Scooter Libby (Justin Kirk), Chief of Staff to the Vice President (2001-2005); David Addington (Don McManus), Cheney's legal counsel (2001-2005) and Chief of Staff to the Vice President (2005-2009); Colin Powell (Tyler Perry), Secretary of State (2001-2005); Condoleezza Rice (LiaGay Hamilton), National Security Advisor (2001-2005) and Secretary of State (2005-2009); Paul Wolfowitz (Eddie Marsan), Deputy Secretary of Defense (2001-2005); George Tenet (Stephen Adly Guirgis), Director of Central Intelligence (1996-2004); Karl Rove (Joseph Beck), Senior Advisor to the President (2001-2007); Trent Lott (Paul Perri), Senate Minority Leader (2001-2003); Jay Bybee (Brandon Firla), Assistant Attorney General (2001-2003); and John Yoo (Paul Yoo) Deputy Assistant Attorney General (2001-2003). Within this framework, the film hits all the beats you'd expect – the bombing of Cambodia (1969-1970); the formation of Al-Qaeda (1988); the outbreak of the Somali Civil War (1988); the invasion of Panama (1989); the Gulf War (1990-1991); Cheney's time as CEO of Halliburton (1995-2000); 9/11 and the invasion of Afghanistan (2001); the \"Torture Memos\" and \"enhanced interrogation techniques\" (2002); the invasion of Iraq (2003); the Plame affair (2003); the accidental shooting of Harry Whittington (2006); the rise of IS; Cheney's 13% approval rating upon leaving office (2009); his heart transplant (2012); and the breakdown in Mary's relationship with her family when Cheney gives Liz permission to oppose gay marriage whilst running for the Senate, despite Mary being a married to a woman (2013).\r\n\r\nIn writing Vice, McKay focused on five main sources – David Corn's _The Lies of George W. Bush: Mastering the Politics of Deception_ (2003), Ron Suskind's _The One Percent Doctrine: Deep Inside America's Pursuit of Its Enemies Since 9/11_ (2006), Michael Isikoff and David Corn's _Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War_ (2006), Barton Gellman's _Angler: The Cheney Vice Presidency_ (2008), and Jane Mayer's _The Dark Side: The Inside Story of How the War on Terror Turned Into a War on American Ideals_ (2008).\r\n\r\n_Vice_ presents Cheney as devoid of ideology, with a Zelig-esque ability to alter his manner so as to best deal with whomever it is in whose company he finds himself. In this sense, his political ambition is portrayed as cynical and mercenary; McKay's Cheney has no interest in attaining power so as to influence policy or stimulate ideological change, he is obsessed only with power-for-power's sake. One of the most telling scenes in the film happens quite early when he learns that President Richard Nixon and National Security Advisor Henry Kissinger are planning to bomb Cambodia without going through Congress. Asking Rumsfeld, \"_what do we believe?_\", he is met by Rumsfeld laughing hysterically at being asked such a ridiculous question. Speaking to The New Yorker, McKay explains,\r\n\r\n> _what I found – and I know there are people who disagree with this – was a surprising lack of ideology. I found beliefs that would flip and flop, based on what was convenient and what was strategically useful._\r\n\r\nHowever, although the film presents Cheney as lacking ideology, it does show him as passionate when he adopts (and later usurps) the Unitary Executive Theory (essentially, the idea that the President should have virtually unchecked power to direct the Executive Branch, particularly during times of crisis). McKay tells _The New Yorker_,\r\n\r\n> _at one point, he even says the President should have certain monarchical prerogatives._\r\n\r\nSpeaking to _ACLU_, he says of Cheney's adoption of the Theory,\r\n\r\n> _you see it constantly throughout his career – his attempts to expand executive reach, expand executive authority, to operate without transparency, to operate with impunity._\r\n\r\nKey lines in this respect include Cheney arguing, \"_if the president does it, it's legal_\", and, when discussing the issue of the US using torture, \"_if the US does it, by definition, it can't be torture_\".\r\n\r\nNowhere is his character shown as more ruthless than in a scene towards the end of the film. In 2013, Liz is running for the Senate when a TV advert from a group affiliated with the incumbent Senator for Wyoming, Mike Enzi, claimed that she \"_aggressively promotes gay marriage_\". Mary had been married to Heather Poe since 2012, and although Cheney and Liz knew it went against their party's doctrines, they had supported her. However, the day after the advert aired, Liz appeared on _Fox News Sunday_ and said she did not support gay marriage. The following day, Cheney and Lynne released a statement supporting Liz, and causing a rift between the family and Mary which remains to this day. The film features a scene the night before Liz goes on TV, in which she asks permission to say she opposes gay marriage. In a chilling moment lifted right out of Francis Ford Coppola's _The Godfather Part II_ (1974), Cheney indicates his approval with a single silent nod of his head. Speaking to _ACLU_ about this scene, McKay states,\r\n\r\n> _that to me is what made it a complete and total tragedy and that's the final kind of tally, the final destructive count of power. Is what he did to the country, what he did to countries like Iraq, punching holes in the Geneva Convention, what he did to the checks and balances of our democracy, what he did to the spirit of the American voter, the spirit of the American nation. And then the final thing, the tools that he used_ […] _eventually took down his own family. So to me at that point the tragedy was complete on every level: personal, family, country, world._\r\n\r\nMuch as in _BlacKkKlansman_, _Vice_ concludes with a haunting montage that brings the story up to date, showing some of the long-term effects of the Bush-Cheney years (instability in the Middle East, irreparable damage to the environment, the rise of IS). In relation to the here and now, although Trump is never explicitly mentioned (and is only shown for a split second in archive footage), McKay is unafraid to admit that the film is not entirely focused on the past. Speaking to the _New York Times_ about Cheney's dismantling of executive checks on power, McKay states,\r\n\r\n> _Cheney was the expert safecracker who opened up the safe, and now the orangutan is in there, throwing around the money and the jewels._\r\n\r\nHe also sees the film as something of a corrective, a reminder of just how bad it was during Bush's time in office, telling _ACLU_\r\n\r\n> _somewhere along the line, Donald Trump got elected, and all of a sudden we started hearing people say, \"Hey, I kind of miss George W. Bush. You know, he wasn't that bad, him and Cheney.\" And then I really felt like I got to make the movie. I was like, this is crazy that people are saying this._\r\n\r\nAs with McKay's previous film, _The Big Short_ (2015), _Vice_ is aesthetically audacious. While there are fewer self-reflexive celebratory cameos explaining difficult terminology in direct-to-camera monologues (sadly, there's no Margot Robbie in a bath this time around), the film is edited in such a way as to remind me of Oliver Stone's \"horizontal editing\" in films such as _JFK_ (1991), _Natural Born Killers_ (1994), _Nixon_ (1995), and _U-Turn_ (1997). It's no coincidence that Vice was cut by Hank Corwin, who cut all of the above except _JFK_. This style of hyperkinetic editing can be seen throughout the film. For example, as Chaney attempts to manipulate Bush into agreeing to give him more power, there are intercepts of fly-fishing. It's not subtle, but it is effective. Indeed, this recalls an earlier scene when Cheney is teaching his daughters to fish, explaining,\r\n\r\n> _you have to find out what the fish wants, and then you use that to catch the fish._\r\n\r\nElsewhere, much as Stone uses Coke commercials and footage from old films in _Natural Born Killers_, Vice features excerpts from the Budweiser \"Whassup?\" commercial (1999) and _Survivor_. In another scene, when Cheney first learns of the Unitary Executive Theory from Antonin Scalia (Matthew Jacobs), he immediately realises it is his road to power, and the film cuts to a lion bringing down a gazelle. For me though, some of the most effective editing in the film is more conventional. One particularly strong example is as Bush declares war on Iraq, the camera tilts down to show his leg is shaking. The film then cuts to a shot of an Iraqi civilian's leg shaking as the bombs begin to drop.\r\n\r\nAlso similar to _The Big Short_ is the film's sense of humour, with a tone of irreverence established from the very beginning, as the opening legend states,\r\n\r\n> _the following is a true story. Or as true as it can be given that Dick Cheney is known as one of the most secretive leaders in recent history. But we did our fucking best._\r\n\r\nA particularly sardonic scene comes about an hour in, as the film shows Cheney stepping away from politics in 1993 and later turning down Bush when he asks him to be his running mate in 2000. At this point, the legend explains that Cheney had chosen his family over politics, and that he happily lived out his days in Wyoming, becoming known as a great philanthropist and fly fisherman. As the Cheneys gather around a family barbeque, triumphant music swells, and the closing credits start to roll, only for the movie to interrupt itself, pointing out that that's not what happened at all, and then continuing with the narrative. It's a very meta technique, and one which both mocks feel-good biopics, whilst also providing a sly criticism of Cheney himself – had he not returned in 2000, the world could have had this happy ending.\r\n\r\nAnother very funny sequence sees Cheney and Lynne in bed discussing whether or not he should accept Bush's offer, with the narrator explaining,\r\n\r\n> _sadly there is no real way to know exactly what was going on with the Cheneys at this history-changing moment. We can't just snap into a Shakespearean soliloquy that dramatises every feeling and emotion. That's just not the way the world works._\r\n\r\nThis is immediately followed by Cheney and Lynne speaking in _faux_-Shakespearean blank verse (\"_Hast blindness usurped vision in you my wife?_\", \"_Mine own blood and will are yours til pierc'd be the last soldier's breastplate, spilling open its jellied ruby treasures_\") as they work themselves up into a sexual frenzy (although technically, this is a duologue, not a soliloquy). There is also a scene in which Cheney meets two oil executives, whose faces are blurred out, and whose names are bleeped every time they are spoken. In another scene, a waiter (Alfred Molina), reads from a menu that features various forms of Cheney-endorsed torture;\r\n\r\n> _tonight, we're offering the enemy combatant, whereby a person is not a prisoner of war, or a criminal, which means, of course, that he has absolutely no protection under the law._\r\n\r\nAfter listening to their options, Cheney gleefully declares, \"_we'll take it all_\". There is also a hilarious mid-credit scene, which sees a focus group descend into chaos when a conservative calls a liberal a \"_libtard_\", prompting a mass brawl. Ignoring the fight, however, are two young girls who are instead interested only in speculating as to the quality of the new _Fast & the Furious_ film.\r\n\r\nFor all that, however, _Vice_ isn't a patch on _The Big Short_, for a number of reasons. For example, whereas in _The Big Short_, the self-reflexive _Tristram Shandy_-style narrative structure worked to the film's advantage, providing a way into the complex story, here it has the exact opposite effect, oftentimes distracting from McKay's thematic concerns, preventing the film from focusing on telling us how (and why) Cheney exploited loopholes in executive power to restructure US foreign policy. McKay is also less successful at moving from scenes of quiet tragedy to scenes of comedy than he was in _The Big Short_.\r\n\r\nThe most egregious problem, however, is that the film fails to give any kind of psychological verisimilitude or interiority to Cheney. Presenting him in an almost robotic manner, there is very little on what drives him, depicting his various deeds without offering anything cogent in terms of his motivations. Is he simply an ideologically-weak opportunist? Is he an evil megalomaniac fuelled by a deeper purpose, and if so, what purpose, and how? Could it all really have been about power, viewing the global geopolitical sphere as his own personal playground and nothing more? And if the film is arguing this, suggesting that this man, responsible for so much pain and suffering, did it all simply because he liked power, isn't that to downplay his agency, to allow one to argue that he didn't really know how much damage he was causing? Depriving him of psychology weakens any attempt to censure his actions. The film's Cheney is ultimately unknowable, and that makes his acts more easily forgivable. The argument that it was all because of power and greed really does next-to-nothing to help explain the man. And in any case, if we accept the thesis that Cheney cared only for power, then surely he warrants serious moral scrutiny, not a self-reflexive and, at times, self-congratulatory narrative that assumes the audience agrees with it before it has even said anything.\r\n\r\n_Vice_ traces all of Cheney's acts back to Lynne dressing him down when he was younger, suggesting that without her prodding, this unambitious two-time Yale dropout would never have gotten into politics in the first place (it's telling, perhaps, that Lynne is unenthusiastic when she learns Cheney is thinking of accepting Bush's offer to be his running mate, pointing out, \"_the VP just sits around and waits for the president to die_\"). But to reduce all of it to being told off by wife, seems far too easy, although it could, I suppose, be cited as an example of the banality of evil. Except that the film's Cheney is anything but banal. In fact, he's terrifying.\r\n\r\nCheney pressured the CIA to find links between Al-Qaeda and Saddam Hussein so as to justify invading Iraq. He oversaw the public relations campaign to build popular support for the war. He encouraged the torture of terror suspects all the while denying it was torture. He was responsible for the worst strategic blunder in US history, the growth of a domestic surveillance state, the dictatorialisation of the office of the President, and the deaths of 4,000 American troops and at least 100,000 Iraqi civilians, although possibly as many as 500,000. His contempt for and willingness to rewrite the rule of law makes him a precursor of Trump. Positing him as a man who was power-mad and little else, _Vice_ remains always on the outside, trying to listen through the wall, never managing to open the door and expose his actual inner workings. The comedy and structural experimentation make it entertaining as a film, but it tells us very little about Cheney that we didn't already know. Strip away the artifice, and you'll find it doesn't have a huge amount to say. Never attaining the scale of tragedy to which it clearly aspires, the film functions instead to remind critics of Bush's cabinet why they became critics of Bush's cabinet. In the end, rather than exposing Cheney's dark soul, the film argues that he doesn't have one. And that is a far less interesting thesis.", "created_at": "2019-07-12T22:02:41.368Z"}, {"movie_id": 429197, "review_id": "5e6ffc35357c00001945e0c2", "author_rating": 8.0, "review_text": "Vice (2018)\r\n\r\nDirection: 8/10\r\n\r\nFilmmaking: 7.5/10\r\n\r\nStory: 8/10\r\n\r\nActing: 9.5/10\r\n\r\nEntertainment: 8/10\r\n\r\nMusical Score: 9/10\r\n\r\nFinal Grade: 8.3/10\r\n\r\nStandout Performance: Christian Bale \r\n\r\nSummary: Vice rises up against many of its competitors in the American Political genre of film as Director Adam McKay delivers a very informative, dramatic, and what I can assume to be as accurate as possible tale of Vice President Dick Cheney, and the George W. Bush administration.", "created_at": "2020-03-16T22:22:45.254Z"}, {"movie_id": 429197, "review_id": "63bf8299a5743d00890f7891", "author_rating": 1.0, "review_text": "Well, it's not at all hard to make Dick Cheney look like an evil man. Unfortunately this film goes a bit beyond that and comes across as completely and totally bias About ten minutes into the film, it doesn't seem like you are watching something as fair and critical as Stone's W, or even as critical as Liman's Fair Game.\r\n\r\nInstead what you get is a film that, well, that feels like a hit piece from start to finish and it comes as a shock when the film ends and the director didn't take the opportunity to blame him for the Reichstag fire.\r\n\r\nAnd, mind you, this is Dick Cheney we are talking about, a man that you can make out to be a monster without turning a film about him into a hit piece. So, when you get the sense that it's taking things a bit far...it's REALLY taking things a bit far.\r\n\r\nThe plus side is that Bale does deliver and do a really great Cheney, despite the fact he's in a Leni Riefenstahl film. Sam Rockwell, however, plays an absolutely horrible W, to the point where it makes you wish they had cast Will Ferrell.\r\n\r\nBut, in the end, you have a hit piece that makes little attempt to disguise itself as a hit piece, while covering a man that could easily look like an absolute monster without the over-exaggerations.", "created_at": "2023-01-12T03:46:33.817Z"}, {"movie_id": 429197, "review_id": "5c43ec1a0e0a266d5cd258d7", "author_rating": 6.0, "review_text": "Being Australian and under 30, Dick Cheney is not someone I ever payed a lot of attention to. I knew he shot that dude and the dude he shot is the one who had to apologise somehow, and that he was one of the evil puppet-master types who stood behind George W. That's it. So while Cheney as a subject matter isn't something I can say I **care** about, it's also not material that's old hat to me either. I ended up watching it only because that's what my mate wanted to do for his birthday, but I'm glad I did. I did not **love** _Vice_, but for the sort of thing I don't normally gravitate towards, I was riveted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T03:33:46.468Z"}, {"movie_id": 429197, "review_id": "5d290381be4b3612f6a27860", "author_rating": 6.0, "review_text": "**_Pretty enjoyable, very funny, but doesn't tell us anything we didn't already know_**\r\n\r\n> _We have guaranteed freedom, security, and peace for a larger share of humanity than has any other nation in all of history. There is no other like us. There never has been. We are, as a matter of empirical fact and undeniable history, the greatest force for good the world has ever known._\r\n\r\n- Dick Cheney; _Exceptional: Why the World Needs a Powerful America_ (2015)\r\n\r\nAs a non-American, I've always been fascinated by the concept of a two party system. Breeding rancour and division by its very nature, with only two sides from which to choose on any issue, the more controversial a subject is, the wider the ideological gap becomes. I'm not sure if it's a cause or a symptom, but intricately intertwined with such deep-rooted partisanship is the fact that everyone seems to be preaching to their own choir; Republicans have Sean Hannity, Tucker Carlson, and Ben Shapiro (and Alex Jones), whilst Democrats have Bill Maher, Anderson Cooper, and Chris Cuomo (and Cenk Uygar). The problem is that the people watching _Fox and Friends_ and reading _Breitbart_ are already staunchly on the right, whilst those watching CNN and reading _The New York Times_ are already firmly on the left; everyone is sermonising to the already converted, and no one is listening to what the other camp is saying. Written and directed by Adam McKay, _Vice_ is a good example of this; it's a left-leaning film made by left-leaning people for a left-leaning audience. When McKay was asked by the _ACLU_ if he had any theories as to why Jared Kushner and Ivanka Trump allegedly walked out of a screening, his response was telling; \"_I think the bigger question is: Why did they buy two tickets and walk in?_\"\r\n\r\nOstensibly a biopic of former Vice President Dick Cheney, _Vice_ argues that he was actually the _de facto_ President, with George W. Bush taking a back seat, particularly in the globally crucial years from 2001-2003. Very much a political satire in the vein of Decimus Iunius Iuvenalis and Jonathan Swift, or films such as Barry Levinson's _Wag the Dog_ and Joe Dante's _The Second Civil War_ (both 1997), _Vice_ eschews conventional narrative structure, breaks the fourth wall regularly, intercuts shots of fly-fishing and animals hunting into the middle of tense plot-heavy dialogue scenes, features several self-reflexive references to itself, has a false ending, has a scene in which characters speak in iambic pentameter, and in a deleted scene, the entire cast breaks into song. Much as was the case with recent \"based on a true story\" films such as Spike Lee's _BlacKkKlansman_ and Jason Reitman's _The Front Runner_ (both 2018), _Vice_ has one eye on the here and now, using Cheney's story as a vehicle to examine the current political situation in the US, positing that without the power-mad Dick Cheney and the Unitary Executive Theory, there would never have been a Donald Trump. However, although there are many individual moments of brilliance, the film is unsure if it's a straightforward biopic or an excoriating satire, ultimately finding a kind of ideological middle ground that mixes comedy with pathos, not always successfully.\r\n\r\nNarrated by Kurt (Jesse Plemons), a fictitious veteran of the Afghanistan and Iraq Wars, who claims to have a unique connection to Cheney, the film begins in Wyoming in 1963 as a young Dick Cheney (Christian Bale) is arrested for drunk driving for the second time. It then cuts to the Presidential Emergency Operations Center in the immediate aftermath of 9/11, as Cheney orders the shooting down of any suspicious commercial airliners, despite President Bush (who was en route to Washington from Florida) not signing off on such an order. How Cheney got from being a drunk in 1963 to taking control of the government in 2001 is the film's primary focus, introducing us to a huge cast of characters (played by an extraordinary ensemble), all of whom feature in Cheney's rise to power in some manner – Lynne Vincent (Amy Adams), Cheney's fiancée and later wife; Donald Rumsfeld (Steve Carell), under whom Cheney worked from 1969, later White House Chief of Staff (1970-1971) and Secretary of Defense (1975-1977 and 2001-2006); Gerald Ford (Bill Camp), President (1974-1977), for whom Cheney was White House Chief of Staff; George H.W. Bush (John Hillner), President (1989-1993), for whom Cheney was Secretary for Defense; Liz (Lily Rabe) and Mary (Allison Pill), Cheney's two daughters; Roger Ailes (Kyle S. More), founder of Fox News; George W. Bush (Sam Rockwell), President (2001-2009), for whom Cheney was Vice President; Scooter Libby (Justin Kirk), Chief of Staff to the Vice President (2001-2005); David Addington (Don McManus), Cheney's legal counsel (2001-2005) and Chief of Staff to the Vice President (2005-2009); Colin Powell (Tyler Perry), Secretary of State (2001-2005); Condoleezza Rice (LiaGay Hamilton), National Security Advisor (2001-2005) and Secretary of State (2005-2009); Paul Wolfowitz (Eddie Marsan), Deputy Secretary of Defense (2001-2005); George Tenet (Stephen Adly Guirgis), Director of Central Intelligence (1996-2004); Karl Rove (Joseph Beck), Senior Advisor to the President (2001-2007); Trent Lott (Paul Perri), Senate Minority Leader (2001-2003); Jay Bybee (Brandon Firla), Assistant Attorney General (2001-2003); and John Yoo (Paul Yoo) Deputy Assistant Attorney General (2001-2003). Within this framework, the film hits all the beats you'd expect – the bombing of Cambodia (1969-1970); the formation of Al-Qaeda (1988); the outbreak of the Somali Civil War (1988); the invasion of Panama (1989); the Gulf War (1990-1991); Cheney's time as CEO of Halliburton (1995-2000); 9/11 and the invasion of Afghanistan (2001); the \"Torture Memos\" and \"enhanced interrogation techniques\" (2002); the invasion of Iraq (2003); the Plame affair (2003); the accidental shooting of Harry Whittington (2006); the rise of IS; Cheney's 13% approval rating upon leaving office (2009); his heart transplant (2012); and the breakdown in Mary's relationship with her family when Cheney gives Liz permission to oppose gay marriage whilst running for the Senate, despite Mary being a married to a woman (2013).\r\n\r\nIn writing Vice, McKay focused on five main sources – David Corn's _The Lies of George W. Bush: Mastering the Politics of Deception_ (2003), Ron Suskind's _The One Percent Doctrine: Deep Inside America's Pursuit of Its Enemies Since 9/11_ (2006), Michael Isikoff and David Corn's _Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War_ (2006), Barton Gellman's _Angler: The Cheney Vice Presidency_ (2008), and Jane Mayer's _The Dark Side: The Inside Story of How the War on Terror Turned Into a War on American Ideals_ (2008).\r\n\r\n_Vice_ presents Cheney as devoid of ideology, with a Zelig-esque ability to alter his manner so as to best deal with whomever it is in whose company he finds himself. In this sense, his political ambition is portrayed as cynical and mercenary; McKay's Cheney has no interest in attaining power so as to influence policy or stimulate ideological change, he is obsessed only with power-for-power's sake. One of the most telling scenes in the film happens quite early when he learns that President Richard Nixon and National Security Advisor Henry Kissinger are planning to bomb Cambodia without going through Congress. Asking Rumsfeld, \"_what do we believe?_\", he is met by Rumsfeld laughing hysterically at being asked such a ridiculous question. Speaking to The New Yorker, McKay explains,\r\n\r\n> _what I found – and I know there are people who disagree with this – was a surprising lack of ideology. I found beliefs that would flip and flop, based on what was convenient and what was strategically useful._\r\n\r\nHowever, although the film presents Cheney as lacking ideology, it does show him as passionate when he adopts (and later usurps) the Unitary Executive Theory (essentially, the idea that the President should have virtually unchecked power to direct the Executive Branch, particularly during times of crisis). McKay tells _The New Yorker_,\r\n\r\n> _at one point, he even says the President should have certain monarchical prerogatives._\r\n\r\nSpeaking to _ACLU_, he says of Cheney's adoption of the Theory,\r\n\r\n> _you see it constantly throughout his career – his attempts to expand executive reach, expand executive authority, to operate without transparency, to operate with impunity._\r\n\r\nKey lines in this respect include Cheney arguing, \"_if the president does it, it's legal_\", and, when discussing the issue of the US using torture, \"_if the US does it, by definition, it can't be torture_\".\r\n\r\nNowhere is his character shown as more ruthless than in a scene towards the end of the film. In 2013, Liz is running for the Senate when a TV advert from a group affiliated with the incumbent Senator for Wyoming, Mike Enzi, claimed that she \"_aggressively promotes gay marriage_\". Mary had been married to Heather Poe since 2012, and although Cheney and Liz knew it went against their party's doctrines, they had supported her. However, the day after the advert aired, Liz appeared on _Fox News Sunday_ and said she did not support gay marriage. The following day, Cheney and Lynne released a statement supporting Liz, and causing a rift between the family and Mary which remains to this day. The film features a scene the night before Liz goes on TV, in which she asks permission to say she opposes gay marriage. In a chilling moment lifted right out of Francis Ford Coppola's _The Godfather Part II_ (1974), Cheney indicates his approval with a single silent nod of his head. Speaking to _ACLU_ about this scene, McKay states,\r\n\r\n> _that to me is what made it a complete and total tragedy and that's the final kind of tally, the final destructive count of power. Is what he did to the country, what he did to countries like Iraq, punching holes in the Geneva Convention, what he did to the checks and balances of our democracy, what he did to the spirit of the American voter, the spirit of the American nation. And then the final thing, the tools that he used_ […] _eventually took down his own family. So to me at that point the tragedy was complete on every level: personal, family, country, world._\r\n\r\nMuch as in _BlacKkKlansman_, _Vice_ concludes with a haunting montage that brings the story up to date, showing some of the long-term effects of the Bush-Cheney years (instability in the Middle East, irreparable damage to the environment, the rise of IS). In relation to the here and now, although Trump is never explicitly mentioned (and is only shown for a split second in archive footage), McKay is unafraid to admit that the film is not entirely focused on the past. Speaking to the _New York Times_ about Cheney's dismantling of executive checks on power, McKay states,\r\n\r\n> _Cheney was the expert safecracker who opened up the safe, and now the orangutan is in there, throwing around the money and the jewels._\r\n\r\nHe also sees the film as something of a corrective, a reminder of just how bad it was during Bush's time in office, telling _ACLU_\r\n\r\n> _somewhere along the line, Donald Trump got elected, and all of a sudden we started hearing people say, \"Hey, I kind of miss George W. Bush. You know, he wasn't that bad, him and Cheney.\" And then I really felt like I got to make the movie. I was like, this is crazy that people are saying this._\r\n\r\nAs with McKay's previous film, _The Big Short_ (2015), _Vice_ is aesthetically audacious. While there are fewer self-reflexive celebratory cameos explaining difficult terminology in direct-to-camera monologues (sadly, there's no Margot Robbie in a bath this time around), the film is edited in such a way as to remind me of Oliver Stone's \"horizontal editing\" in films such as _JFK_ (1991), _Natural Born Killers_ (1994), _Nixon_ (1995), and _U-Turn_ (1997). It's no coincidence that Vice was cut by Hank Corwin, who cut all of the above except _JFK_. This style of hyperkinetic editing can be seen throughout the film. For example, as Chaney attempts to manipulate Bush into agreeing to give him more power, there are intercepts of fly-fishing. It's not subtle, but it is effective. Indeed, this recalls an earlier scene when Cheney is teaching his daughters to fish, explaining,\r\n\r\n> _you have to find out what the fish wants, and then you use that to catch the fish._\r\n\r\nElsewhere, much as Stone uses Coke commercials and footage from old films in _Natural Born Killers_, Vice features excerpts from the Budweiser \"Whassup?\" commercial (1999) and _Survivor_. In another scene, when Cheney first learns of the Unitary Executive Theory from Antonin Scalia (Matthew Jacobs), he immediately realises it is his road to power, and the film cuts to a lion bringing down a gazelle. For me though, some of the most effective editing in the film is more conventional. One particularly strong example is as Bush declares war on Iraq, the camera tilts down to show his leg is shaking. The film then cuts to a shot of an Iraqi civilian's leg shaking as the bombs begin to drop.\r\n\r\nAlso similar to _The Big Short_ is the film's sense of humour, with a tone of irreverence established from the very beginning, as the opening legend states,\r\n\r\n> _the following is a true story. Or as true as it can be given that Dick Cheney is known as one of the most secretive leaders in recent history. But we did our fucking best._\r\n\r\nA particularly sardonic scene comes about an hour in, as the film shows Cheney stepping away from politics in 1993 and later turning down Bush when he asks him to be his running mate in 2000. At this point, the legend explains that Cheney had chosen his family over politics, and that he happily lived out his days in Wyoming, becoming known as a great philanthropist and fly fisherman. As the Cheneys gather around a family barbeque, triumphant music swells, and the closing credits start to roll, only for the movie to interrupt itself, pointing out that that's not what happened at all, and then continuing with the narrative. It's a very meta technique, and one which both mocks feel-good biopics, whilst also providing a sly criticism of Cheney himself – had he not returned in 2000, the world could have had this happy ending.\r\n\r\nAnother very funny sequence sees Cheney and Lynne in bed discussing whether or not he should accept Bush's offer, with the narrator explaining,\r\n\r\n> _sadly there is no real way to know exactly what was going on with the Cheneys at this history-changing moment. We can't just snap into a Shakespearean soliloquy that dramatises every feeling and emotion. That's just not the way the world works._\r\n\r\nThis is immediately followed by Cheney and Lynne speaking in _faux_-Shakespearean blank verse (\"_Hast blindness usurped vision in you my wife?_\", \"_Mine own blood and will are yours til pierc'd be the last soldier's breastplate, spilling open its jellied ruby treasures_\") as they work themselves up into a sexual frenzy (although technically, this is a duologue, not a soliloquy). There is also a scene in which Cheney meets two oil executives, whose faces are blurred out, and whose names are bleeped every time they are spoken. In another scene, a waiter (Alfred Molina), reads from a menu that features various forms of Cheney-endorsed torture;\r\n\r\n> _tonight, we're offering the enemy combatant, whereby a person is not a prisoner of war, or a criminal, which means, of course, that he has absolutely no protection under the law._\r\n\r\nAfter listening to their options, Cheney gleefully declares, \"_we'll take it all_\". There is also a hilarious mid-credit scene, which sees a focus group descend into chaos when a conservative calls a liberal a \"_libtard_\", prompting a mass brawl. Ignoring the fight, however, are two young girls who are instead interested only in speculating as to the quality of the new _Fast & the Furious_ film.\r\n\r\nFor all that, however, _Vice_ isn't a patch on _The Big Short_, for a number of reasons. For example, whereas in _The Big Short_, the self-reflexive _Tristram Shandy_-style narrative structure worked to the film's advantage, providing a way into the complex story, here it has the exact opposite effect, oftentimes distracting from McKay's thematic concerns, preventing the film from focusing on telling us how (and why) Cheney exploited loopholes in executive power to restructure US foreign policy. McKay is also less successful at moving from scenes of quiet tragedy to scenes of comedy than he was in _The Big Short_.\r\n\r\nThe most egregious problem, however, is that the film fails to give any kind of psychological verisimilitude or interiority to Cheney. Presenting him in an almost robotic manner, there is very little on what drives him, depicting his various deeds without offering anything cogent in terms of his motivations. Is he simply an ideologically-weak opportunist? Is he an evil megalomaniac fuelled by a deeper purpose, and if so, what purpose, and how? Could it all really have been about power, viewing the global geopolitical sphere as his own personal playground and nothing more? And if the film is arguing this, suggesting that this man, responsible for so much pain and suffering, did it all simply because he liked power, isn't that to downplay his agency, to allow one to argue that he didn't really know how much damage he was causing? Depriving him of psychology weakens any attempt to censure his actions. The film's Cheney is ultimately unknowable, and that makes his acts more easily forgivable. The argument that it was all because of power and greed really does next-to-nothing to help explain the man. And in any case, if we accept the thesis that Cheney cared only for power, then surely he warrants serious moral scrutiny, not a self-reflexive and, at times, self-congratulatory narrative that assumes the audience agrees with it before it has even said anything.\r\n\r\n_Vice_ traces all of Cheney's acts back to Lynne dressing him down when he was younger, suggesting that without her prodding, this unambitious two-time Yale dropout would never have gotten into politics in the first place (it's telling, perhaps, that Lynne is unenthusiastic when she learns Cheney is thinking of accepting Bush's offer to be his running mate, pointing out, \"_the VP just sits around and waits for the president to die_\"). But to reduce all of it to being told off by wife, seems far too easy, although it could, I suppose, be cited as an example of the banality of evil. Except that the film's Cheney is anything but banal. In fact, he's terrifying.\r\n\r\nCheney pressured the CIA to find links between Al-Qaeda and Saddam Hussein so as to justify invading Iraq. He oversaw the public relations campaign to build popular support for the war. He encouraged the torture of terror suspects all the while denying it was torture. He was responsible for the worst strategic blunder in US history, the growth of a domestic surveillance state, the dictatorialisation of the office of the President, and the deaths of 4,000 American troops and at least 100,000 Iraqi civilians, although possibly as many as 500,000. His contempt for and willingness to rewrite the rule of law makes him a precursor of Trump. Positing him as a man who was power-mad and little else, _Vice_ remains always on the outside, trying to listen through the wall, never managing to open the door and expose his actual inner workings. The comedy and structural experimentation make it entertaining as a film, but it tells us very little about Cheney that we didn't already know. Strip away the artifice, and you'll find it doesn't have a huge amount to say. Never attaining the scale of tragedy to which it clearly aspires, the film functions instead to remind critics of Bush's cabinet why they became critics of Bush's cabinet. In the end, rather than exposing Cheney's dark soul, the film argues that he doesn't have one. And that is a far less interesting thesis.", "created_at": "2019-07-12T22:02:41.368Z"}, {"movie_id": 429197, "review_id": "5e6ffc35357c00001945e0c2", "author_rating": 8.0, "review_text": "Vice (2018)\r\n\r\nDirection: 8/10\r\n\r\nFilmmaking: 7.5/10\r\n\r\nStory: 8/10\r\n\r\nActing: 9.5/10\r\n\r\nEntertainment: 8/10\r\n\r\nMusical Score: 9/10\r\n\r\nFinal Grade: 8.3/10\r\n\r\nStandout Performance: Christian Bale \r\n\r\nSummary: Vice rises up against many of its competitors in the American Political genre of film as Director Adam McKay delivers a very informative, dramatic, and what I can assume to be as accurate as possible tale of Vice President Dick Cheney, and the George W. Bush administration.", "created_at": "2020-03-16T22:22:45.254Z"}, {"movie_id": 429197, "review_id": "63bf8299a5743d00890f7891", "author_rating": 1.0, "review_text": "Well, it's not at all hard to make Dick Cheney look like an evil man. Unfortunately this film goes a bit beyond that and comes across as completely and totally bias About ten minutes into the film, it doesn't seem like you are watching something as fair and critical as Stone's W, or even as critical as Liman's Fair Game.\r\n\r\nInstead what you get is a film that, well, that feels like a hit piece from start to finish and it comes as a shock when the film ends and the director didn't take the opportunity to blame him for the Reichstag fire.\r\n\r\nAnd, mind you, this is Dick Cheney we are talking about, a man that you can make out to be a monster without turning a film about him into a hit piece. So, when you get the sense that it's taking things a bit far...it's REALLY taking things a bit far.\r\n\r\nThe plus side is that Bale does deliver and do a really great Cheney, despite the fact he's in a Leni Riefenstahl film. Sam Rockwell, however, plays an absolutely horrible W, to the point where it makes you wish they had cast Will Ferrell.\r\n\r\nBut, in the end, you have a hit piece that makes little attempt to disguise itself as a hit piece, while covering a man that could easily look like an absolute monster without the over-exaggerations.", "created_at": "2023-01-12T03:46:33.817Z"}, {"movie_id": 429197, "review_id": "5c43ec1a0e0a266d5cd258d7", "author_rating": 6.0, "review_text": "Being Australian and under 30, Dick Cheney is not someone I ever payed a lot of attention to. I knew he shot that dude and the dude he shot is the one who had to apologise somehow, and that he was one of the evil puppet-master types who stood behind George W. That's it. So while Cheney as a subject matter isn't something I can say I **care** about, it's also not material that's old hat to me either. I ended up watching it only because that's what my mate wanted to do for his birthday, but I'm glad I did. I did not **love** _Vice_, but for the sort of thing I don't normally gravitate towards, I was riveted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T03:33:46.468Z"}, {"movie_id": 429197, "review_id": "5d290381be4b3612f6a27860", "author_rating": 6.0, "review_text": "**_Pretty enjoyable, very funny, but doesn't tell us anything we didn't already know_**\r\n\r\n> _We have guaranteed freedom, security, and peace for a larger share of humanity than has any other nation in all of history. There is no other like us. There never has been. We are, as a matter of empirical fact and undeniable history, the greatest force for good the world has ever known._\r\n\r\n- Dick Cheney; _Exceptional: Why the World Needs a Powerful America_ (2015)\r\n\r\nAs a non-American, I've always been fascinated by the concept of a two party system. Breeding rancour and division by its very nature, with only two sides from which to choose on any issue, the more controversial a subject is, the wider the ideological gap becomes. I'm not sure if it's a cause or a symptom, but intricately intertwined with such deep-rooted partisanship is the fact that everyone seems to be preaching to their own choir; Republicans have Sean Hannity, Tucker Carlson, and Ben Shapiro (and Alex Jones), whilst Democrats have Bill Maher, Anderson Cooper, and Chris Cuomo (and Cenk Uygar). The problem is that the people watching _Fox and Friends_ and reading _Breitbart_ are already staunchly on the right, whilst those watching CNN and reading _The New York Times_ are already firmly on the left; everyone is sermonising to the already converted, and no one is listening to what the other camp is saying. Written and directed by Adam McKay, _Vice_ is a good example of this; it's a left-leaning film made by left-leaning people for a left-leaning audience. When McKay was asked by the _ACLU_ if he had any theories as to why Jared Kushner and Ivanka Trump allegedly walked out of a screening, his response was telling; \"_I think the bigger question is: Why did they buy two tickets and walk in?_\"\r\n\r\nOstensibly a biopic of former Vice President Dick Cheney, _Vice_ argues that he was actually the _de facto_ President, with George W. Bush taking a back seat, particularly in the globally crucial years from 2001-2003. Very much a political satire in the vein of Decimus Iunius Iuvenalis and Jonathan Swift, or films such as Barry Levinson's _Wag the Dog_ and Joe Dante's _The Second Civil War_ (both 1997), _Vice_ eschews conventional narrative structure, breaks the fourth wall regularly, intercuts shots of fly-fishing and animals hunting into the middle of tense plot-heavy dialogue scenes, features several self-reflexive references to itself, has a false ending, has a scene in which characters speak in iambic pentameter, and in a deleted scene, the entire cast breaks into song. Much as was the case with recent \"based on a true story\" films such as Spike Lee's _BlacKkKlansman_ and Jason Reitman's _The Front Runner_ (both 2018), _Vice_ has one eye on the here and now, using Cheney's story as a vehicle to examine the current political situation in the US, positing that without the power-mad Dick Cheney and the Unitary Executive Theory, there would never have been a Donald Trump. However, although there are many individual moments of brilliance, the film is unsure if it's a straightforward biopic or an excoriating satire, ultimately finding a kind of ideological middle ground that mixes comedy with pathos, not always successfully.\r\n\r\nNarrated by Kurt (Jesse Plemons), a fictitious veteran of the Afghanistan and Iraq Wars, who claims to have a unique connection to Cheney, the film begins in Wyoming in 1963 as a young Dick Cheney (Christian Bale) is arrested for drunk driving for the second time. It then cuts to the Presidential Emergency Operations Center in the immediate aftermath of 9/11, as Cheney orders the shooting down of any suspicious commercial airliners, despite President Bush (who was en route to Washington from Florida) not signing off on such an order. How Cheney got from being a drunk in 1963 to taking control of the government in 2001 is the film's primary focus, introducing us to a huge cast of characters (played by an extraordinary ensemble), all of whom feature in Cheney's rise to power in some manner – Lynne Vincent (Amy Adams), Cheney's fiancée and later wife; Donald Rumsfeld (Steve Carell), under whom Cheney worked from 1969, later White House Chief of Staff (1970-1971) and Secretary of Defense (1975-1977 and 2001-2006); Gerald Ford (Bill Camp), President (1974-1977), for whom Cheney was White House Chief of Staff; George H.W. Bush (John Hillner), President (1989-1993), for whom Cheney was Secretary for Defense; Liz (Lily Rabe) and Mary (Allison Pill), Cheney's two daughters; Roger Ailes (Kyle S. More), founder of Fox News; George W. Bush (Sam Rockwell), President (2001-2009), for whom Cheney was Vice President; Scooter Libby (Justin Kirk), Chief of Staff to the Vice President (2001-2005); David Addington (Don McManus), Cheney's legal counsel (2001-2005) and Chief of Staff to the Vice President (2005-2009); Colin Powell (Tyler Perry), Secretary of State (2001-2005); Condoleezza Rice (LiaGay Hamilton), National Security Advisor (2001-2005) and Secretary of State (2005-2009); Paul Wolfowitz (Eddie Marsan), Deputy Secretary of Defense (2001-2005); George Tenet (Stephen Adly Guirgis), Director of Central Intelligence (1996-2004); Karl Rove (Joseph Beck), Senior Advisor to the President (2001-2007); Trent Lott (Paul Perri), Senate Minority Leader (2001-2003); Jay Bybee (Brandon Firla), Assistant Attorney General (2001-2003); and John Yoo (Paul Yoo) Deputy Assistant Attorney General (2001-2003). Within this framework, the film hits all the beats you'd expect – the bombing of Cambodia (1969-1970); the formation of Al-Qaeda (1988); the outbreak of the Somali Civil War (1988); the invasion of Panama (1989); the Gulf War (1990-1991); Cheney's time as CEO of Halliburton (1995-2000); 9/11 and the invasion of Afghanistan (2001); the \"Torture Memos\" and \"enhanced interrogation techniques\" (2002); the invasion of Iraq (2003); the Plame affair (2003); the accidental shooting of Harry Whittington (2006); the rise of IS; Cheney's 13% approval rating upon leaving office (2009); his heart transplant (2012); and the breakdown in Mary's relationship with her family when Cheney gives Liz permission to oppose gay marriage whilst running for the Senate, despite Mary being a married to a woman (2013).\r\n\r\nIn writing Vice, McKay focused on five main sources – David Corn's _The Lies of George W. Bush: Mastering the Politics of Deception_ (2003), Ron Suskind's _The One Percent Doctrine: Deep Inside America's Pursuit of Its Enemies Since 9/11_ (2006), Michael Isikoff and David Corn's _Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War_ (2006), Barton Gellman's _Angler: The Cheney Vice Presidency_ (2008), and Jane Mayer's _The Dark Side: The Inside Story of How the War on Terror Turned Into a War on American Ideals_ (2008).\r\n\r\n_Vice_ presents Cheney as devoid of ideology, with a Zelig-esque ability to alter his manner so as to best deal with whomever it is in whose company he finds himself. In this sense, his political ambition is portrayed as cynical and mercenary; McKay's Cheney has no interest in attaining power so as to influence policy or stimulate ideological change, he is obsessed only with power-for-power's sake. One of the most telling scenes in the film happens quite early when he learns that President Richard Nixon and National Security Advisor Henry Kissinger are planning to bomb Cambodia without going through Congress. Asking Rumsfeld, \"_what do we believe?_\", he is met by Rumsfeld laughing hysterically at being asked such a ridiculous question. Speaking to The New Yorker, McKay explains,\r\n\r\n> _what I found – and I know there are people who disagree with this – was a surprising lack of ideology. I found beliefs that would flip and flop, based on what was convenient and what was strategically useful._\r\n\r\nHowever, although the film presents Cheney as lacking ideology, it does show him as passionate when he adopts (and later usurps) the Unitary Executive Theory (essentially, the idea that the President should have virtually unchecked power to direct the Executive Branch, particularly during times of crisis). McKay tells _The New Yorker_,\r\n\r\n> _at one point, he even says the President should have certain monarchical prerogatives._\r\n\r\nSpeaking to _ACLU_, he says of Cheney's adoption of the Theory,\r\n\r\n> _you see it constantly throughout his career – his attempts to expand executive reach, expand executive authority, to operate without transparency, to operate with impunity._\r\n\r\nKey lines in this respect include Cheney arguing, \"_if the president does it, it's legal_\", and, when discussing the issue of the US using torture, \"_if the US does it, by definition, it can't be torture_\".\r\n\r\nNowhere is his character shown as more ruthless than in a scene towards the end of the film. In 2013, Liz is running for the Senate when a TV advert from a group affiliated with the incumbent Senator for Wyoming, Mike Enzi, claimed that she \"_aggressively promotes gay marriage_\". Mary had been married to Heather Poe since 2012, and although Cheney and Liz knew it went against their party's doctrines, they had supported her. However, the day after the advert aired, Liz appeared on _Fox News Sunday_ and said she did not support gay marriage. The following day, Cheney and Lynne released a statement supporting Liz, and causing a rift between the family and Mary which remains to this day. The film features a scene the night before Liz goes on TV, in which she asks permission to say she opposes gay marriage. In a chilling moment lifted right out of Francis Ford Coppola's _The Godfather Part II_ (1974), Cheney indicates his approval with a single silent nod of his head. Speaking to _ACLU_ about this scene, McKay states,\r\n\r\n> _that to me is what made it a complete and total tragedy and that's the final kind of tally, the final destructive count of power. Is what he did to the country, what he did to countries like Iraq, punching holes in the Geneva Convention, what he did to the checks and balances of our democracy, what he did to the spirit of the American voter, the spirit of the American nation. And then the final thing, the tools that he used_ […] _eventually took down his own family. So to me at that point the tragedy was complete on every level: personal, family, country, world._\r\n\r\nMuch as in _BlacKkKlansman_, _Vice_ concludes with a haunting montage that brings the story up to date, showing some of the long-term effects of the Bush-Cheney years (instability in the Middle East, irreparable damage to the environment, the rise of IS). In relation to the here and now, although Trump is never explicitly mentioned (and is only shown for a split second in archive footage), McKay is unafraid to admit that the film is not entirely focused on the past. Speaking to the _New York Times_ about Cheney's dismantling of executive checks on power, McKay states,\r\n\r\n> _Cheney was the expert safecracker who opened up the safe, and now the orangutan is in there, throwing around the money and the jewels._\r\n\r\nHe also sees the film as something of a corrective, a reminder of just how bad it was during Bush's time in office, telling _ACLU_\r\n\r\n> _somewhere along the line, Donald Trump got elected, and all of a sudden we started hearing people say, \"Hey, I kind of miss George W. Bush. You know, he wasn't that bad, him and Cheney.\" And then I really felt like I got to make the movie. I was like, this is crazy that people are saying this._\r\n\r\nAs with McKay's previous film, _The Big Short_ (2015), _Vice_ is aesthetically audacious. While there are fewer self-reflexive celebratory cameos explaining difficult terminology in direct-to-camera monologues (sadly, there's no Margot Robbie in a bath this time around), the film is edited in such a way as to remind me of Oliver Stone's \"horizontal editing\" in films such as _JFK_ (1991), _Natural Born Killers_ (1994), _Nixon_ (1995), and _U-Turn_ (1997). It's no coincidence that Vice was cut by Hank Corwin, who cut all of the above except _JFK_. This style of hyperkinetic editing can be seen throughout the film. For example, as Chaney attempts to manipulate Bush into agreeing to give him more power, there are intercepts of fly-fishing. It's not subtle, but it is effective. Indeed, this recalls an earlier scene when Cheney is teaching his daughters to fish, explaining,\r\n\r\n> _you have to find out what the fish wants, and then you use that to catch the fish._\r\n\r\nElsewhere, much as Stone uses Coke commercials and footage from old films in _Natural Born Killers_, Vice features excerpts from the Budweiser \"Whassup?\" commercial (1999) and _Survivor_. In another scene, when Cheney first learns of the Unitary Executive Theory from Antonin Scalia (Matthew Jacobs), he immediately realises it is his road to power, and the film cuts to a lion bringing down a gazelle. For me though, some of the most effective editing in the film is more conventional. One particularly strong example is as Bush declares war on Iraq, the camera tilts down to show his leg is shaking. The film then cuts to a shot of an Iraqi civilian's leg shaking as the bombs begin to drop.\r\n\r\nAlso similar to _The Big Short_ is the film's sense of humour, with a tone of irreverence established from the very beginning, as the opening legend states,\r\n\r\n> _the following is a true story. Or as true as it can be given that Dick Cheney is known as one of the most secretive leaders in recent history. But we did our fucking best._\r\n\r\nA particularly sardonic scene comes about an hour in, as the film shows Cheney stepping away from politics in 1993 and later turning down Bush when he asks him to be his running mate in 2000. At this point, the legend explains that Cheney had chosen his family over politics, and that he happily lived out his days in Wyoming, becoming known as a great philanthropist and fly fisherman. As the Cheneys gather around a family barbeque, triumphant music swells, and the closing credits start to roll, only for the movie to interrupt itself, pointing out that that's not what happened at all, and then continuing with the narrative. It's a very meta technique, and one which both mocks feel-good biopics, whilst also providing a sly criticism of Cheney himself – had he not returned in 2000, the world could have had this happy ending.\r\n\r\nAnother very funny sequence sees Cheney and Lynne in bed discussing whether or not he should accept Bush's offer, with the narrator explaining,\r\n\r\n> _sadly there is no real way to know exactly what was going on with the Cheneys at this history-changing moment. We can't just snap into a Shakespearean soliloquy that dramatises every feeling and emotion. That's just not the way the world works._\r\n\r\nThis is immediately followed by Cheney and Lynne speaking in _faux_-Shakespearean blank verse (\"_Hast blindness usurped vision in you my wife?_\", \"_Mine own blood and will are yours til pierc'd be the last soldier's breastplate, spilling open its jellied ruby treasures_\") as they work themselves up into a sexual frenzy (although technically, this is a duologue, not a soliloquy). There is also a scene in which Cheney meets two oil executives, whose faces are blurred out, and whose names are bleeped every time they are spoken. In another scene, a waiter (Alfred Molina), reads from a menu that features various forms of Cheney-endorsed torture;\r\n\r\n> _tonight, we're offering the enemy combatant, whereby a person is not a prisoner of war, or a criminal, which means, of course, that he has absolutely no protection under the law._\r\n\r\nAfter listening to their options, Cheney gleefully declares, \"_we'll take it all_\". There is also a hilarious mid-credit scene, which sees a focus group descend into chaos when a conservative calls a liberal a \"_libtard_\", prompting a mass brawl. Ignoring the fight, however, are two young girls who are instead interested only in speculating as to the quality of the new _Fast & the Furious_ film.\r\n\r\nFor all that, however, _Vice_ isn't a patch on _The Big Short_, for a number of reasons. For example, whereas in _The Big Short_, the self-reflexive _Tristram Shandy_-style narrative structure worked to the film's advantage, providing a way into the complex story, here it has the exact opposite effect, oftentimes distracting from McKay's thematic concerns, preventing the film from focusing on telling us how (and why) Cheney exploited loopholes in executive power to restructure US foreign policy. McKay is also less successful at moving from scenes of quiet tragedy to scenes of comedy than he was in _The Big Short_.\r\n\r\nThe most egregious problem, however, is that the film fails to give any kind of psychological verisimilitude or interiority to Cheney. Presenting him in an almost robotic manner, there is very little on what drives him, depicting his various deeds without offering anything cogent in terms of his motivations. Is he simply an ideologically-weak opportunist? Is he an evil megalomaniac fuelled by a deeper purpose, and if so, what purpose, and how? Could it all really have been about power, viewing the global geopolitical sphere as his own personal playground and nothing more? And if the film is arguing this, suggesting that this man, responsible for so much pain and suffering, did it all simply because he liked power, isn't that to downplay his agency, to allow one to argue that he didn't really know how much damage he was causing? Depriving him of psychology weakens any attempt to censure his actions. The film's Cheney is ultimately unknowable, and that makes his acts more easily forgivable. The argument that it was all because of power and greed really does next-to-nothing to help explain the man. And in any case, if we accept the thesis that Cheney cared only for power, then surely he warrants serious moral scrutiny, not a self-reflexive and, at times, self-congratulatory narrative that assumes the audience agrees with it before it has even said anything.\r\n\r\n_Vice_ traces all of Cheney's acts back to Lynne dressing him down when he was younger, suggesting that without her prodding, this unambitious two-time Yale dropout would never have gotten into politics in the first place (it's telling, perhaps, that Lynne is unenthusiastic when she learns Cheney is thinking of accepting Bush's offer to be his running mate, pointing out, \"_the VP just sits around and waits for the president to die_\"). But to reduce all of it to being told off by wife, seems far too easy, although it could, I suppose, be cited as an example of the banality of evil. Except that the film's Cheney is anything but banal. In fact, he's terrifying.\r\n\r\nCheney pressured the CIA to find links between Al-Qaeda and Saddam Hussein so as to justify invading Iraq. He oversaw the public relations campaign to build popular support for the war. He encouraged the torture of terror suspects all the while denying it was torture. He was responsible for the worst strategic blunder in US history, the growth of a domestic surveillance state, the dictatorialisation of the office of the President, and the deaths of 4,000 American troops and at least 100,000 Iraqi civilians, although possibly as many as 500,000. His contempt for and willingness to rewrite the rule of law makes him a precursor of Trump. Positing him as a man who was power-mad and little else, _Vice_ remains always on the outside, trying to listen through the wall, never managing to open the door and expose his actual inner workings. The comedy and structural experimentation make it entertaining as a film, but it tells us very little about Cheney that we didn't already know. Strip away the artifice, and you'll find it doesn't have a huge amount to say. Never attaining the scale of tragedy to which it clearly aspires, the film functions instead to remind critics of Bush's cabinet why they became critics of Bush's cabinet. In the end, rather than exposing Cheney's dark soul, the film argues that he doesn't have one. And that is a far less interesting thesis.", "created_at": "2019-07-12T22:02:41.368Z"}, {"movie_id": 429197, "review_id": "5e6ffc35357c00001945e0c2", "author_rating": 8.0, "review_text": "Vice (2018)\r\n\r\nDirection: 8/10\r\n\r\nFilmmaking: 7.5/10\r\n\r\nStory: 8/10\r\n\r\nActing: 9.5/10\r\n\r\nEntertainment: 8/10\r\n\r\nMusical Score: 9/10\r\n\r\nFinal Grade: 8.3/10\r\n\r\nStandout Performance: Christian Bale \r\n\r\nSummary: Vice rises up against many of its competitors in the American Political genre of film as Director Adam McKay delivers a very informative, dramatic, and what I can assume to be as accurate as possible tale of Vice President Dick Cheney, and the George W. Bush administration.", "created_at": "2020-03-16T22:22:45.254Z"}, {"movie_id": 429197, "review_id": "63bf8299a5743d00890f7891", "author_rating": 1.0, "review_text": "Well, it's not at all hard to make Dick Cheney look like an evil man. Unfortunately this film goes a bit beyond that and comes across as completely and totally bias About ten minutes into the film, it doesn't seem like you are watching something as fair and critical as Stone's W, or even as critical as Liman's Fair Game.\r\n\r\nInstead what you get is a film that, well, that feels like a hit piece from start to finish and it comes as a shock when the film ends and the director didn't take the opportunity to blame him for the Reichstag fire.\r\n\r\nAnd, mind you, this is Dick Cheney we are talking about, a man that you can make out to be a monster without turning a film about him into a hit piece. So, when you get the sense that it's taking things a bit far...it's REALLY taking things a bit far.\r\n\r\nThe plus side is that Bale does deliver and do a really great Cheney, despite the fact he's in a Leni Riefenstahl film. Sam Rockwell, however, plays an absolutely horrible W, to the point where it makes you wish they had cast Will Ferrell.\r\n\r\nBut, in the end, you have a hit piece that makes little attempt to disguise itself as a hit piece, while covering a man that could easily look like an absolute monster without the over-exaggerations.", "created_at": "2023-01-12T03:46:33.817Z"}, {"movie_id": 429197, "review_id": "5c43ec1a0e0a266d5cd258d7", "author_rating": 6.0, "review_text": "Being Australian and under 30, Dick Cheney is not someone I ever payed a lot of attention to. I knew he shot that dude and the dude he shot is the one who had to apologise somehow, and that he was one of the evil puppet-master types who stood behind George W. That's it. So while Cheney as a subject matter isn't something I can say I **care** about, it's also not material that's old hat to me either. I ended up watching it only because that's what my mate wanted to do for his birthday, but I'm glad I did. I did not **love** _Vice_, but for the sort of thing I don't normally gravitate towards, I was riveted.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T03:33:46.468Z"}, {"movie_id": 429197, "review_id": "5d290381be4b3612f6a27860", "author_rating": 6.0, "review_text": "**_Pretty enjoyable, very funny, but doesn't tell us anything we didn't already know_**\r\n\r\n> _We have guaranteed freedom, security, and peace for a larger share of humanity than has any other nation in all of history. There is no other like us. There never has been. We are, as a matter of empirical fact and undeniable history, the greatest force for good the world has ever known._\r\n\r\n- Dick Cheney; _Exceptional: Why the World Needs a Powerful America_ (2015)\r\n\r\nAs a non-American, I've always been fascinated by the concept of a two party system. Breeding rancour and division by its very nature, with only two sides from which to choose on any issue, the more controversial a subject is, the wider the ideological gap becomes. I'm not sure if it's a cause or a symptom, but intricately intertwined with such deep-rooted partisanship is the fact that everyone seems to be preaching to their own choir; Republicans have Sean Hannity, Tucker Carlson, and Ben Shapiro (and Alex Jones), whilst Democrats have Bill Maher, Anderson Cooper, and Chris Cuomo (and Cenk Uygar). The problem is that the people watching _Fox and Friends_ and reading _Breitbart_ are already staunchly on the right, whilst those watching CNN and reading _The New York Times_ are already firmly on the left; everyone is sermonising to the already converted, and no one is listening to what the other camp is saying. Written and directed by Adam McKay, _Vice_ is a good example of this; it's a left-leaning film made by left-leaning people for a left-leaning audience. When McKay was asked by the _ACLU_ if he had any theories as to why Jared Kushner and Ivanka Trump allegedly walked out of a screening, his response was telling; \"_I think the bigger question is: Why did they buy two tickets and walk in?_\"\r\n\r\nOstensibly a biopic of former Vice President Dick Cheney, _Vice_ argues that he was actually the _de facto_ President, with George W. Bush taking a back seat, particularly in the globally crucial years from 2001-2003. Very much a political satire in the vein of Decimus Iunius Iuvenalis and Jonathan Swift, or films such as Barry Levinson's _Wag the Dog_ and Joe Dante's _The Second Civil War_ (both 1997), _Vice_ eschews conventional narrative structure, breaks the fourth wall regularly, intercuts shots of fly-fishing and animals hunting into the middle of tense plot-heavy dialogue scenes, features several self-reflexive references to itself, has a false ending, has a scene in which characters speak in iambic pentameter, and in a deleted scene, the entire cast breaks into song. Much as was the case with recent \"based on a true story\" films such as Spike Lee's _BlacKkKlansman_ and Jason Reitman's _The Front Runner_ (both 2018), _Vice_ has one eye on the here and now, using Cheney's story as a vehicle to examine the current political situation in the US, positing that without the power-mad Dick Cheney and the Unitary Executive Theory, there would never have been a Donald Trump. However, although there are many individual moments of brilliance, the film is unsure if it's a straightforward biopic or an excoriating satire, ultimately finding a kind of ideological middle ground that mixes comedy with pathos, not always successfully.\r\n\r\nNarrated by Kurt (Jesse Plemons), a fictitious veteran of the Afghanistan and Iraq Wars, who claims to have a unique connection to Cheney, the film begins in Wyoming in 1963 as a young Dick Cheney (Christian Bale) is arrested for drunk driving for the second time. It then cuts to the Presidential Emergency Operations Center in the immediate aftermath of 9/11, as Cheney orders the shooting down of any suspicious commercial airliners, despite President Bush (who was en route to Washington from Florida) not signing off on such an order. How Cheney got from being a drunk in 1963 to taking control of the government in 2001 is the film's primary focus, introducing us to a huge cast of characters (played by an extraordinary ensemble), all of whom feature in Cheney's rise to power in some manner – Lynne Vincent (Amy Adams), Cheney's fiancée and later wife; Donald Rumsfeld (Steve Carell), under whom Cheney worked from 1969, later White House Chief of Staff (1970-1971) and Secretary of Defense (1975-1977 and 2001-2006); Gerald Ford (Bill Camp), President (1974-1977), for whom Cheney was White House Chief of Staff; George H.W. Bush (John Hillner), President (1989-1993), for whom Cheney was Secretary for Defense; Liz (Lily Rabe) and Mary (Allison Pill), Cheney's two daughters; Roger Ailes (Kyle S. More), founder of Fox News; George W. Bush (Sam Rockwell), President (2001-2009), for whom Cheney was Vice President; Scooter Libby (Justin Kirk), Chief of Staff to the Vice President (2001-2005); David Addington (Don McManus), Cheney's legal counsel (2001-2005) and Chief of Staff to the Vice President (2005-2009); Colin Powell (Tyler Perry), Secretary of State (2001-2005); Condoleezza Rice (LiaGay Hamilton), National Security Advisor (2001-2005) and Secretary of State (2005-2009); Paul Wolfowitz (Eddie Marsan), Deputy Secretary of Defense (2001-2005); George Tenet (Stephen Adly Guirgis), Director of Central Intelligence (1996-2004); Karl Rove (Joseph Beck), Senior Advisor to the President (2001-2007); Trent Lott (Paul Perri), Senate Minority Leader (2001-2003); Jay Bybee (Brandon Firla), Assistant Attorney General (2001-2003); and John Yoo (Paul Yoo) Deputy Assistant Attorney General (2001-2003). Within this framework, the film hits all the beats you'd expect – the bombing of Cambodia (1969-1970); the formation of Al-Qaeda (1988); the outbreak of the Somali Civil War (1988); the invasion of Panama (1989); the Gulf War (1990-1991); Cheney's time as CEO of Halliburton (1995-2000); 9/11 and the invasion of Afghanistan (2001); the \"Torture Memos\" and \"enhanced interrogation techniques\" (2002); the invasion of Iraq (2003); the Plame affair (2003); the accidental shooting of Harry Whittington (2006); the rise of IS; Cheney's 13% approval rating upon leaving office (2009); his heart transplant (2012); and the breakdown in Mary's relationship with her family when Cheney gives Liz permission to oppose gay marriage whilst running for the Senate, despite Mary being a married to a woman (2013).\r\n\r\nIn writing Vice, McKay focused on five main sources – David Corn's _The Lies of George W. Bush: Mastering the Politics of Deception_ (2003), Ron Suskind's _The One Percent Doctrine: Deep Inside America's Pursuit of Its Enemies Since 9/11_ (2006), Michael Isikoff and David Corn's _Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War_ (2006), Barton Gellman's _Angler: The Cheney Vice Presidency_ (2008), and Jane Mayer's _The Dark Side: The Inside Story of How the War on Terror Turned Into a War on American Ideals_ (2008).\r\n\r\n_Vice_ presents Cheney as devoid of ideology, with a Zelig-esque ability to alter his manner so as to best deal with whomever it is in whose company he finds himself. In this sense, his political ambition is portrayed as cynical and mercenary; McKay's Cheney has no interest in attaining power so as to influence policy or stimulate ideological change, he is obsessed only with power-for-power's sake. One of the most telling scenes in the film happens quite early when he learns that President Richard Nixon and National Security Advisor Henry Kissinger are planning to bomb Cambodia without going through Congress. Asking Rumsfeld, \"_what do we believe?_\", he is met by Rumsfeld laughing hysterically at being asked such a ridiculous question. Speaking to The New Yorker, McKay explains,\r\n\r\n> _what I found – and I know there are people who disagree with this – was a surprising lack of ideology. I found beliefs that would flip and flop, based on what was convenient and what was strategically useful._\r\n\r\nHowever, although the film presents Cheney as lacking ideology, it does show him as passionate when he adopts (and later usurps) the Unitary Executive Theory (essentially, the idea that the President should have virtually unchecked power to direct the Executive Branch, particularly during times of crisis). McKay tells _The New Yorker_,\r\n\r\n> _at one point, he even says the President should have certain monarchical prerogatives._\r\n\r\nSpeaking to _ACLU_, he says of Cheney's adoption of the Theory,\r\n\r\n> _you see it constantly throughout his career – his attempts to expand executive reach, expand executive authority, to operate without transparency, to operate with impunity._\r\n\r\nKey lines in this respect include Cheney arguing, \"_if the president does it, it's legal_\", and, when discussing the issue of the US using torture, \"_if the US does it, by definition, it can't be torture_\".\r\n\r\nNowhere is his character shown as more ruthless than in a scene towards the end of the film. In 2013, Liz is running for the Senate when a TV advert from a group affiliated with the incumbent Senator for Wyoming, Mike Enzi, claimed that she \"_aggressively promotes gay marriage_\". Mary had been married to Heather Poe since 2012, and although Cheney and Liz knew it went against their party's doctrines, they had supported her. However, the day after the advert aired, Liz appeared on _Fox News Sunday_ and said she did not support gay marriage. The following day, Cheney and Lynne released a statement supporting Liz, and causing a rift between the family and Mary which remains to this day. The film features a scene the night before Liz goes on TV, in which she asks permission to say she opposes gay marriage. In a chilling moment lifted right out of Francis Ford Coppola's _The Godfather Part II_ (1974), Cheney indicates his approval with a single silent nod of his head. Speaking to _ACLU_ about this scene, McKay states,\r\n\r\n> _that to me is what made it a complete and total tragedy and that's the final kind of tally, the final destructive count of power. Is what he did to the country, what he did to countries like Iraq, punching holes in the Geneva Convention, what he did to the checks and balances of our democracy, what he did to the spirit of the American voter, the spirit of the American nation. And then the final thing, the tools that he used_ […] _eventually took down his own family. So to me at that point the tragedy was complete on every level: personal, family, country, world._\r\n\r\nMuch as in _BlacKkKlansman_, _Vice_ concludes with a haunting montage that brings the story up to date, showing some of the long-term effects of the Bush-Cheney years (instability in the Middle East, irreparable damage to the environment, the rise of IS). In relation to the here and now, although Trump is never explicitly mentioned (and is only shown for a split second in archive footage), McKay is unafraid to admit that the film is not entirely focused on the past. Speaking to the _New York Times_ about Cheney's dismantling of executive checks on power, McKay states,\r\n\r\n> _Cheney was the expert safecracker who opened up the safe, and now the orangutan is in there, throwing around the money and the jewels._\r\n\r\nHe also sees the film as something of a corrective, a reminder of just how bad it was during Bush's time in office, telling _ACLU_\r\n\r\n> _somewhere along the line, Donald Trump got elected, and all of a sudden we started hearing people say, \"Hey, I kind of miss George W. Bush. You know, he wasn't that bad, him and Cheney.\" And then I really felt like I got to make the movie. I was like, this is crazy that people are saying this._\r\n\r\nAs with McKay's previous film, _The Big Short_ (2015), _Vice_ is aesthetically audacious. While there are fewer self-reflexive celebratory cameos explaining difficult terminology in direct-to-camera monologues (sadly, there's no Margot Robbie in a bath this time around), the film is edited in such a way as to remind me of Oliver Stone's \"horizontal editing\" in films such as _JFK_ (1991), _Natural Born Killers_ (1994), _Nixon_ (1995), and _U-Turn_ (1997). It's no coincidence that Vice was cut by Hank Corwin, who cut all of the above except _JFK_. This style of hyperkinetic editing can be seen throughout the film. For example, as Chaney attempts to manipulate Bush into agreeing to give him more power, there are intercepts of fly-fishing. It's not subtle, but it is effective. Indeed, this recalls an earlier scene when Cheney is teaching his daughters to fish, explaining,\r\n\r\n> _you have to find out what the fish wants, and then you use that to catch the fish._\r\n\r\nElsewhere, much as Stone uses Coke commercials and footage from old films in _Natural Born Killers_, Vice features excerpts from the Budweiser \"Whassup?\" commercial (1999) and _Survivor_. In another scene, when Cheney first learns of the Unitary Executive Theory from Antonin Scalia (Matthew Jacobs), he immediately realises it is his road to power, and the film cuts to a lion bringing down a gazelle. For me though, some of the most effective editing in the film is more conventional. One particularly strong example is as Bush declares war on Iraq, the camera tilts down to show his leg is shaking. The film then cuts to a shot of an Iraqi civilian's leg shaking as the bombs begin to drop.\r\n\r\nAlso similar to _The Big Short_ is the film's sense of humour, with a tone of irreverence established from the very beginning, as the opening legend states,\r\n\r\n> _the following is a true story. Or as true as it can be given that Dick Cheney is known as one of the most secretive leaders in recent history. But we did our fucking best._\r\n\r\nA particularly sardonic scene comes about an hour in, as the film shows Cheney stepping away from politics in 1993 and later turning down Bush when he asks him to be his running mate in 2000. At this point, the legend explains that Cheney had chosen his family over politics, and that he happily lived out his days in Wyoming, becoming known as a great philanthropist and fly fisherman. As the Cheneys gather around a family barbeque, triumphant music swells, and the closing credits start to roll, only for the movie to interrupt itself, pointing out that that's not what happened at all, and then continuing with the narrative. It's a very meta technique, and one which both mocks feel-good biopics, whilst also providing a sly criticism of Cheney himself – had he not returned in 2000, the world could have had this happy ending.\r\n\r\nAnother very funny sequence sees Cheney and Lynne in bed discussing whether or not he should accept Bush's offer, with the narrator explaining,\r\n\r\n> _sadly there is no real way to know exactly what was going on with the Cheneys at this history-changing moment. We can't just snap into a Shakespearean soliloquy that dramatises every feeling and emotion. That's just not the way the world works._\r\n\r\nThis is immediately followed by Cheney and Lynne speaking in _faux_-Shakespearean blank verse (\"_Hast blindness usurped vision in you my wife?_\", \"_Mine own blood and will are yours til pierc'd be the last soldier's breastplate, spilling open its jellied ruby treasures_\") as they work themselves up into a sexual frenzy (although technically, this is a duologue, not a soliloquy). There is also a scene in which Cheney meets two oil executives, whose faces are blurred out, and whose names are bleeped every time they are spoken. In another scene, a waiter (Alfred Molina), reads from a menu that features various forms of Cheney-endorsed torture;\r\n\r\n> _tonight, we're offering the enemy combatant, whereby a person is not a prisoner of war, or a criminal, which means, of course, that he has absolutely no protection under the law._\r\n\r\nAfter listening to their options, Cheney gleefully declares, \"_we'll take it all_\". There is also a hilarious mid-credit scene, which sees a focus group descend into chaos when a conservative calls a liberal a \"_libtard_\", prompting a mass brawl. Ignoring the fight, however, are two young girls who are instead interested only in speculating as to the quality of the new _Fast & the Furious_ film.\r\n\r\nFor all that, however, _Vice_ isn't a patch on _The Big Short_, for a number of reasons. For example, whereas in _The Big Short_, the self-reflexive _Tristram Shandy_-style narrative structure worked to the film's advantage, providing a way into the complex story, here it has the exact opposite effect, oftentimes distracting from McKay's thematic concerns, preventing the film from focusing on telling us how (and why) Cheney exploited loopholes in executive power to restructure US foreign policy. McKay is also less successful at moving from scenes of quiet tragedy to scenes of comedy than he was in _The Big Short_.\r\n\r\nThe most egregious problem, however, is that the film fails to give any kind of psychological verisimilitude or interiority to Cheney. Presenting him in an almost robotic manner, there is very little on what drives him, depicting his various deeds without offering anything cogent in terms of his motivations. Is he simply an ideologically-weak opportunist? Is he an evil megalomaniac fuelled by a deeper purpose, and if so, what purpose, and how? Could it all really have been about power, viewing the global geopolitical sphere as his own personal playground and nothing more? And if the film is arguing this, suggesting that this man, responsible for so much pain and suffering, did it all simply because he liked power, isn't that to downplay his agency, to allow one to argue that he didn't really know how much damage he was causing? Depriving him of psychology weakens any attempt to censure his actions. The film's Cheney is ultimately unknowable, and that makes his acts more easily forgivable. The argument that it was all because of power and greed really does next-to-nothing to help explain the man. And in any case, if we accept the thesis that Cheney cared only for power, then surely he warrants serious moral scrutiny, not a self-reflexive and, at times, self-congratulatory narrative that assumes the audience agrees with it before it has even said anything.\r\n\r\n_Vice_ traces all of Cheney's acts back to Lynne dressing him down when he was younger, suggesting that without her prodding, this unambitious two-time Yale dropout would never have gotten into politics in the first place (it's telling, perhaps, that Lynne is unenthusiastic when she learns Cheney is thinking of accepting Bush's offer to be his running mate, pointing out, \"_the VP just sits around and waits for the president to die_\"). But to reduce all of it to being told off by wife, seems far too easy, although it could, I suppose, be cited as an example of the banality of evil. Except that the film's Cheney is anything but banal. In fact, he's terrifying.\r\n\r\nCheney pressured the CIA to find links between Al-Qaeda and Saddam Hussein so as to justify invading Iraq. He oversaw the public relations campaign to build popular support for the war. He encouraged the torture of terror suspects all the while denying it was torture. He was responsible for the worst strategic blunder in US history, the growth of a domestic surveillance state, the dictatorialisation of the office of the President, and the deaths of 4,000 American troops and at least 100,000 Iraqi civilians, although possibly as many as 500,000. His contempt for and willingness to rewrite the rule of law makes him a precursor of Trump. Positing him as a man who was power-mad and little else, _Vice_ remains always on the outside, trying to listen through the wall, never managing to open the door and expose his actual inner workings. The comedy and structural experimentation make it entertaining as a film, but it tells us very little about Cheney that we didn't already know. Strip away the artifice, and you'll find it doesn't have a huge amount to say. Never attaining the scale of tragedy to which it clearly aspires, the film functions instead to remind critics of Bush's cabinet why they became critics of Bush's cabinet. In the end, rather than exposing Cheney's dark soul, the film argues that he doesn't have one. And that is a far less interesting thesis.", "created_at": "2019-07-12T22:02:41.368Z"}, {"movie_id": 429197, "review_id": "5e6ffc35357c00001945e0c2", "author_rating": 8.0, "review_text": "Vice (2018)\r\n\r\nDirection: 8/10\r\n\r\nFilmmaking: 7.5/10\r\n\r\nStory: 8/10\r\n\r\nActing: 9.5/10\r\n\r\nEntertainment: 8/10\r\n\r\nMusical Score: 9/10\r\n\r\nFinal Grade: 8.3/10\r\n\r\nStandout Performance: Christian Bale \r\n\r\nSummary: Vice rises up against many of its competitors in the American Political genre of film as Director Adam McKay delivers a very informative, dramatic, and what I can assume to be as accurate as possible tale of Vice President Dick Cheney, and the George W. Bush administration.", "created_at": "2020-03-16T22:22:45.254Z"}, {"movie_id": 429197, "review_id": "63bf8299a5743d00890f7891", "author_rating": 1.0, "review_text": "Well, it's not at all hard to make Dick Cheney look like an evil man. Unfortunately this film goes a bit beyond that and comes across as completely and totally bias About ten minutes into the film, it doesn't seem like you are watching something as fair and critical as Stone's W, or even as critical as Liman's Fair Game.\r\n\r\nInstead what you get is a film that, well, that feels like a hit piece from start to finish and it comes as a shock when the film ends and the director didn't take the opportunity to blame him for the Reichstag fire.\r\n\r\nAnd, mind you, this is Dick Cheney we are talking about, a man that you can make out to be a monster without turning a film about him into a hit piece. So, when you get the sense that it's taking things a bit far...it's REALLY taking things a bit far.\r\n\r\nThe plus side is that Bale does deliver and do a really great Cheney, despite the fact he's in a Leni Riefenstahl film. Sam Rockwell, however, plays an absolutely horrible W, to the point where it makes you wish they had cast Will Ferrell.\r\n\r\nBut, in the end, you have a hit piece that makes little attempt to disguise itself as a hit piece, while covering a man that could easily look like an absolute monster without the over-exaggerations.", "created_at": "2023-01-12T03:46:33.817Z"}]