[{"movie_id": 20533, "review_id": "52d0f7a219c29530e63b5404", "author_rating": 7.0, "review_text": "I have to admit that, apart from a couple of episodes, I never really read Jonah Hex when I was a kid. I did not like Western comics very much. Thus, I have no point of reference as to whether the movie is true to the original comic series. Maybe that is an advantage when seeing this movie in that I cannot get upset by the movie not being true to the original. Actually I am reasonably sure that this movie with it supernatural and steampunk influences are not entirely true to the original comic series.\r\n\r\nDespite what seems to be the general opinion I quite liked this movie. The story is mostly comic book material but then this is a comic book character after all. I thought the story was good enough. There is plenty of quite enjoyable action in it. Josh Brolin is doing a good job of portraying the bad-ass Jonah Hex and John Malkowich is perhaps not managing to project the diabolical übervillain image that the Turnbull character is supposed to have but he is still not doing a bad job. Megan Fox is, well…Megan Fox. She is fitting the character and the movie fairly well though.\r\n\r\nIt is my understanding that the supernatural element of the movie is not something that can be found in the original comic series. It did not really disturb me. I am not sure that it added very much but it was okay.\r\n\r\nI understand that people having read and being fans of the original comic series would be upset if the movie did not follow the original but I have to say that I do not understand why everyone else seems to bash it as well. It was an enjoyable hour and a half of fun action. Jonah Hex was the bad-ass that you hoped for. This movie was a much better “interpretation” of a comic series than the abysmal Green Hornet for instance where the hero was turned into a fumbling idiot.\r\n\r\nFor me personally, this movie was definitely on the upper half of the enjoyment-factor scale.", "created_at": "2014-01-11T07:49:54.436Z"}, {"movie_id": 20533, "review_id": "609605abab6849003d842617", "author_rating": 7.0, "review_text": "_**Comic book Western with an excellent metal score**_\r\n\r\nI was never a big Jonah Hex fan, but I have a handful of the comics from the 70s and was therefore mildly interested in this cinematic adaption from 2010, especially since Megan Fox looked so good in the promo pics, lol.\r\n\r\n\"Jonah Hex\" reminds me of those gazillions of spaghetti Westerns from the 60s and 70s, like \"Django\" and Leone's \"Man with No Name\" trilogy except that it's more modern and entertaining.\r\n\r\nTo be expected, the atmosphere is very comic booky and the filmmakers do an outstanding job with the title character's hideously scarred face. It's like the comic come to life. Josh Brolin is fine in the eponymous role. On top of this, Megan Fox proves in her peripheral part that she was the foxiest woman in Hollywood at the time.\r\n\r\nAt only 82 minutes, the story is simple and the pace is fast, which I don't mind since too many films overstay their welcome. But the writers did strive for some depth and that's commendable. If there was more depth and epic-ness I wouldn't hesitate to raise my rating. As it is, \"Jonah Hex\" plays like a spaghetti Western that's actually decent. Imagine the style and pizazz of \"The Good, the Bad and the Ugly\" updated to 2010, but half as long, no tedious stretches and less one-dimensional characters and you'd have a pretty good approximation of \"Jonah Hex.\"\r\n\r\nOne of the film's highlights is the incredible metalized score by Marco Beltrami and none other than Mastodon. The movie's worth seeing for the music alone, no kidding.\r\n\r\nThe film was shot in Louisiana with some re-shoots in California.\r\n\r\nGRADE: B", "created_at": "2021-05-08T03:29:47.310Z"}]