[{"movie_id": 5279, "review_id": "5ebfa83e3d3557001dde31ee", "author_rating": 6.0, "review_text": "6/10 Good acting and a solid plot for a murder mystery, but has at least 20-30 minutes of scenes that could have been trimmed, esp as it takes 90min for the murder to occur.  I had figured out the key points and was falling asleep at the end...I'm still tired now, writing this.", "created_at": "2020-05-16T08:45:50.764Z"}, {"movie_id": 5279, "review_id": "64d0e55185090f00ae845c1e", "author_rating": 7.0, "review_text": "I remember watching this and thinking it reminded me of a very exclusive game of Cleudo! The great and the (not so) good assemble at the stately home of \"Sir William McCordle\" (Sir Michael Gambon). Now what becomes clear as this gathering gets steadily more sloshed and satiated is that their host has been subsidising many of these high-class scroungers for quite a while and some have become a bit more dependent than others. What might they do to secure a share of his loot? Might they even slay the fatted calf himself? Well that's the mystery part that Julian Fellowes and an on-form Robert Altman deliver in this quite quirkily crafted upstairs/downstairs whodunit that swipes at just about everyone from all levels of the social scale using cruelty, lust and loads of dark, often sarcastic, humour in the process. Ryan Philippe is the obvious fish out of water amongst their glittering array of Knights and Dames, but he brings a freshness to his rather odious character (\"Denton\") and in many ways provides a good foil to the otherwise rather well trammelled plot portrayal of the landed vacuous and the well meaning; the pompous and the selfish. It is well written and well paced after a bit of a slow start that serves to introduce just one too many a character all at once. Kristin Scott Thomas is a natural for these sort of parts; Stephen Fry delivers effectively as the policeman \"Thompson\" and, of course, Dame Maggie Smith is another who takes to these roles like the proverbial duck to water. Now it is a bit long, but when juggling so many characters, potential red herrings, character assassinations and general mischief then I think this is probably about the shortest it could be. It sustains the momentum once it's got up an head of steam, looks splendid and is comfortably amongst the best of the period drama genre - without, thankfully, a sign of Jane Austen!", "created_at": "2023-08-07T12:36:33.980Z"}]