[{"movie_id": 313297, "review_id": "57bea80ec3a3682c4a005667", "author_rating": null, "review_text": "Every once in a while there is family-friendly entertainment that lives up to its wonderment in imaginative storytelling and stunning visual scope. Certainly this is the case with the stimulating yet meditative Japanese animated fantasy-adventure **Kubo and the Two Strings**. Undeniably vibrant and philosophical in committed heart and soul, **Kubo and the Two Strings** is a majestic masterpiece in its colorfully realized presentation that ambitiously binds together opulent elements of ancient Far East folklore, eye-opening anime and origami (the finesse art of paper-folding). The competition for jaw-dropping animation within recent years (or even this year) has been remarkably stellar thus far but Kubo confirms its superiority above the ranks. No one can doubt the masterful film-making technique administered by the film’s director Travis Knight in this glossy, whimsical medieval gem.\r\n\r\nAs with the majority of adventurous and challenging narratives that seek the high-minded exploratory vibes in its execution, **Kubo and the Two Strings** is about the creative coming-of-age quest of a young boy and the spellbinding encounters that materialize as a result. Knight and screenwriters Marc Haimes and Chris Butler oversees a profound and aesthetically remarkable production highlighted by notable voiceover performers (such as Academy Award-winners Charlize Theron and Matthew McConaughey), stylish and glowing animation and a hypnotic showcase that is an exquisite treat for moviegoers from all walks of life.\r\n\r\nImportantly,** Kubo and the Two Strings** is aided by its heralded association with the Oregon-based studio Laika whose treasured reputation in the stop-motion animation process is tremendously noteworthy. Among Laika’s previously outstanding cinematic samples include 2009’s _Coraline_, 2011’s criminally underrated _ParaNorman_ and 2014’s _The Boxtrolls_ so indeed Knight’s superlative **Kubo and the Two Strings** is among exceptional stock. The detailed imagery in **Kubo** is indescribably luscious and the brilliant artistic manufacturing of Laika’s refined flourishes only elevates Knight’s enticing animated vehicle as a compelling journey into the ancient Japanese Edo period mythology.\r\n\r\nOne can tell that the coveted **Kubo and the Two Strings** is destined to stay true to its mystical leanings especially when the beginning film’s sequence features the caustic quote: ““If you must blink, do it now” …because “if you look away, even for an instant, our hero will surely perish.” As previously mentioned the story takes place in ancient Japan where we find the gifted 11-year old Kubo (voiced by Art Parkinson from “Game of Thrones”) existing with his ailing mother on the outskirts of a nearby village. The young Kubo’s talents is such that he is a natural story-telling magician that can skillfully convey his expressive communication through origami. Kubo enjoys the gesture of entertaining the local villagers. However, his mother advises that Kubo must be home before nightfall. Unfortunately, Kubo does not heed her advice but that is not due to his personal defiance or negligence.\r\n\r\nIn fact, Kubo’s no-show at home is large in part cue to the dubious agenda of his grandfather Moon Father (Academy Award nominee Ralph Fiennes). In instructing his dastardly daughters to track down their beleaguered nephew the stakes are high especially when Moon Father was instrumental in the demise of his slain samurai father. Hence, Kubo must locate his late father’s magical armor-related belongings and reclaim a sense of honor. The tag-a-longs at Kubo’s side include the woolly-looking snow Monkey (Theron) and buff warrior Beetle (McConaughey). Together, the travelling trio is confronted by beastly specimens and other deceptive supernatural forces en route to the ultimate showdown with his sinister grandfather Moon Father. Armed with resiliency and determination Kubo and his crafty companions face uncertainties that are quite unimaginable to say the least.\r\n\r\n**Kubo and the Two Strings** is an astonishing offering that taps into its pulsating pulse with its mild intensity that should not deter the youngsters from fully experiencing the escapist vision of young Kubo and his offbeat sidekicks. Parkinson’s Kubo is idealistic and has a fearless approach to questioning the unassuming world around him. The combination of roguishness and wide-eyed innocence is certainly appealing to the intrigued tots that may view Kubo’s wily exploits as exciting and surreal in the name of his heroic daddy’s destiny. Theron’s acid-tongued Monkey is inspired in grand impishness with snarky flair. As for McConaughey’s flippant gung-ho Beetle he is an odd serving of comical relief and well-intentional courageousness. Fiennes makes for an ideal unctuous rival as his Moon Father is the Darth Vader to Kubo’s impressionable Luke Skywalker blueprint. Also, Academy Award nominee Rooney Mara is wickedly delicious as the scheming aunts–the twin sisters of Kubo’s sickly mother. Rounding out the supporting cast are the supplied voices of Asian contributors such as George Takei’s (“TV Star Trek’s original Sulu”) Hosato, Cary-Hiroyuki Tagawa’s Hashi and Minae Noji’s Minae among the Kubo personalities that populate Knight’s dazzling display of a transcendent Japanese-flavored Grimm fairy tale.\r\n\r\nNaturally the real selling point for **Kubo and the Two Strings** is the standout computer-generated technology and other incorporated genres of animation that gives this polished fantasy fable its magnificent sheen. Knight, a first-time director whose background as Laika’s primary animator is evidenced in the celebrated animation studio’s first three films, demonstrates the authenticity of his amazing craft courtesy of the stop-motion precision that defines his sensual cinematic landscape.\r\n\r\nOverall, **Kubo and the Two Strings** radiates with sweeping charm, boldness, curiosity and depth as it exemplifies the epitome of the awestruck construction of an enlightening, sophisticated feature length animation. The mixture of humor, thrills, drama and tragedy is decidedly triumphant allowing **Kubo and the Two Strings** to flex its reflective, throbbing mysterious muscles.\r\n\r\n**Kubo and the Two Strings** (2016)\r\n\r\nFocus Features\r\n\r\n1 hr. 41 mins.\r\n\r\nStarring: Art Parkinson, Charlize Theron, Matthew McConaughey, Ralph Fiennes, Rooney Mara, George Takei, Cary-Hiroyuki Tagawa, Brenda Vaccaro\r\n\r\nDirected by: Travis Knight\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Fantasy & Sci-Fi/ Action & Adventure/Animation\r\n\r\nCritic’s rating: **** stars (out of 4)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-25T08:10:54.796Z"}, {"movie_id": 313297, "review_id": "58446af8c3a3683e1600c1ec", "author_rating": 7.0, "review_text": "**A boy, a monkey and a giant beetle team up for a quest.**\r\n\r\nThis is not an old fashioned stop-motion animation. This is a very modern, a hybrid of multiple techniques that includes 3D printing and digital special effects. The directional debut for the producer of 'ParaNorman' and 'The Boxtrolls'. The tale is about a one eyed boy named Kubo, who has been hiding in a seaside mountain cave near a small village from his grandfather, the moon king, ever since his birth, protected by his mother. He grew up listening the stories of a legendary samurai warrior Hanzo. But one day after he himself exposed to the moonlight, the troubles follow. Now his only chance to survive is to find his father's armours and so the quest begins where he teams up with other two.\r\n\r\nThis is a Japanese story, takes place somewhere in a fictional ancient Japan. Technically, this film was so good, very pleasant for viewing, especially the framerate was higher than normal stop-motion animation. The character models, music, the length of the film, the pace of the narration, all were so brilliant, but not the story. It was average, I mean very, very simple and familiar. Still, it is a very likable film, particularly the children would love it. I'm going to repeat again like I always say while reviewing stop-motion animation films that this kind of films are rare, so when they make one, that automatically goes to a must see list. Whether you're going to like it or not, I hope you won't miss it.\r\n\r\n_7/10_", "created_at": "2016-12-04T19:14:00.845Z"}, {"movie_id": 313297, "review_id": "5ff1c6c621118f003c2489cc", "author_rating": 8.0, "review_text": "Great, creative story.\r\n\r\n<em>'Kubo and the Two Strings'</em> is a fun film, I enjoyed it all. I love the animation style that Laika use, they also tend to get the vibe of their stories pretty bang on. This is my favourite work of the studio's so far, at least before I watch <em>'Missing Link'</em>.\r\n\r\nThe casting could've been more appropriate, though I'm a believer of anyone playing anyone when it comes to voice roles. Art Parkinson, Charlize Theron and Matthew McConaughey make for an undeniably strong trio. Parkinson and Theron do particularly good jobs, though McConaughey is my standout. Elsewhere, Ralph Fiennes and George Takei are, minorly, involved.\r\n\r\nThe lovely story and top animation are the biggest takeaways from this. Recommended.", "created_at": "2021-01-03T13:29:42.741Z"}, {"movie_id": 313297, "review_id": "636779951684f7008aeb068a", "author_rating": 7.0, "review_text": "Every now and again there is an unexpected advantage in having a cinema membership. This was billed yesterday at our local Cineworld and so, to avoid the biblical torrents outside, I thought - why not? Well I am really glad I did. This is a really enjoyable story about a young, one-eyed, lad \"Kubo\" who lives with his mother in a cave high above their village where he regularly regales the townsfolk's with his magical stories, augmented by some wizardry with origami characters. His only rule is that he must return to his mother by sundown. She is a curiously detached character, whose dreams provide the substance for the young man's engaging and characterful stories. It is festival time and his elderly friend suggests that he stay a while later and light a lantern so that he may try to chat with his later father. The sun sets and suddenly he is being sought by his two evil, shape-shifting, aunties. His mother manages to stave them off but at considerable sacrifice, and soon young \"Kudo\" and his friends monkey and beetle must race to find an unbreakable sword and some armour that may offer his some protection from his pursuing grandfather who, it turns out, wants his other eye too! The animation is delicate and charming. From the origami samurai through to the leaf-built boat, this young man uses his powers to stay one step ahead of his nemeses and the whole story is really quite engaging. There are a few combat scenes, but they are short, sharp and sweet. This is really about the relationship between him and his two friends, and as it progresses we soon discover that they are far more than just his travelling companions. Dario Marianelli has provided a good score that mixes the jollity and the menacing and the script delivers some humour to mix well with the adventure. This looks great on a big screen - the animation is vidid and colourful and I was really pleasantly surprised here. Well worth a watch.", "created_at": "2022-11-06T09:08:37.450Z"}, {"movie_id": 313297, "review_id": "57bea80ec3a3682c4a005667", "author_rating": null, "review_text": "Every once in a while there is family-friendly entertainment that lives up to its wonderment in imaginative storytelling and stunning visual scope. Certainly this is the case with the stimulating yet meditative Japanese animated fantasy-adventure **Kubo and the Two Strings**. Undeniably vibrant and philosophical in committed heart and soul, **Kubo and the Two Strings** is a majestic masterpiece in its colorfully realized presentation that ambitiously binds together opulent elements of ancient Far East folklore, eye-opening anime and origami (the finesse art of paper-folding). The competition for jaw-dropping animation within recent years (or even this year) has been remarkably stellar thus far but Kubo confirms its superiority above the ranks. No one can doubt the masterful film-making technique administered by the film’s director Travis Knight in this glossy, whimsical medieval gem.\r\n\r\nAs with the majority of adventurous and challenging narratives that seek the high-minded exploratory vibes in its execution, **Kubo and the Two Strings** is about the creative coming-of-age quest of a young boy and the spellbinding encounters that materialize as a result. Knight and screenwriters Marc Haimes and Chris Butler oversees a profound and aesthetically remarkable production highlighted by notable voiceover performers (such as Academy Award-winners Charlize Theron and Matthew McConaughey), stylish and glowing animation and a hypnotic showcase that is an exquisite treat for moviegoers from all walks of life.\r\n\r\nImportantly,** Kubo and the Two Strings** is aided by its heralded association with the Oregon-based studio Laika whose treasured reputation in the stop-motion animation process is tremendously noteworthy. Among Laika’s previously outstanding cinematic samples include 2009’s _Coraline_, 2011’s criminally underrated _ParaNorman_ and 2014’s _The Boxtrolls_ so indeed Knight’s superlative **Kubo and the Two Strings** is among exceptional stock. The detailed imagery in **Kubo** is indescribably luscious and the brilliant artistic manufacturing of Laika’s refined flourishes only elevates Knight’s enticing animated vehicle as a compelling journey into the ancient Japanese Edo period mythology.\r\n\r\nOne can tell that the coveted **Kubo and the Two Strings** is destined to stay true to its mystical leanings especially when the beginning film’s sequence features the caustic quote: ““If you must blink, do it now” …because “if you look away, even for an instant, our hero will surely perish.” As previously mentioned the story takes place in ancient Japan where we find the gifted 11-year old Kubo (voiced by Art Parkinson from “Game of Thrones”) existing with his ailing mother on the outskirts of a nearby village. The young Kubo’s talents is such that he is a natural story-telling magician that can skillfully convey his expressive communication through origami. Kubo enjoys the gesture of entertaining the local villagers. However, his mother advises that Kubo must be home before nightfall. Unfortunately, Kubo does not heed her advice but that is not due to his personal defiance or negligence.\r\n\r\nIn fact, Kubo’s no-show at home is large in part cue to the dubious agenda of his grandfather Moon Father (Academy Award nominee Ralph Fiennes). In instructing his dastardly daughters to track down their beleaguered nephew the stakes are high especially when Moon Father was instrumental in the demise of his slain samurai father. Hence, Kubo must locate his late father’s magical armor-related belongings and reclaim a sense of honor. The tag-a-longs at Kubo’s side include the woolly-looking snow Monkey (Theron) and buff warrior Beetle (McConaughey). Together, the travelling trio is confronted by beastly specimens and other deceptive supernatural forces en route to the ultimate showdown with his sinister grandfather Moon Father. Armed with resiliency and determination Kubo and his crafty companions face uncertainties that are quite unimaginable to say the least.\r\n\r\n**Kubo and the Two Strings** is an astonishing offering that taps into its pulsating pulse with its mild intensity that should not deter the youngsters from fully experiencing the escapist vision of young Kubo and his offbeat sidekicks. Parkinson’s Kubo is idealistic and has a fearless approach to questioning the unassuming world around him. The combination of roguishness and wide-eyed innocence is certainly appealing to the intrigued tots that may view Kubo’s wily exploits as exciting and surreal in the name of his heroic daddy’s destiny. Theron’s acid-tongued Monkey is inspired in grand impishness with snarky flair. As for McConaughey’s flippant gung-ho Beetle he is an odd serving of comical relief and well-intentional courageousness. Fiennes makes for an ideal unctuous rival as his Moon Father is the Darth Vader to Kubo’s impressionable Luke Skywalker blueprint. Also, Academy Award nominee Rooney Mara is wickedly delicious as the scheming aunts–the twin sisters of Kubo’s sickly mother. Rounding out the supporting cast are the supplied voices of Asian contributors such as George Takei’s (“TV Star Trek’s original Sulu”) Hosato, Cary-Hiroyuki Tagawa’s Hashi and Minae Noji’s Minae among the Kubo personalities that populate Knight’s dazzling display of a transcendent Japanese-flavored Grimm fairy tale.\r\n\r\nNaturally the real selling point for **Kubo and the Two Strings** is the standout computer-generated technology and other incorporated genres of animation that gives this polished fantasy fable its magnificent sheen. Knight, a first-time director whose background as Laika’s primary animator is evidenced in the celebrated animation studio’s first three films, demonstrates the authenticity of his amazing craft courtesy of the stop-motion precision that defines his sensual cinematic landscape.\r\n\r\nOverall, **Kubo and the Two Strings** radiates with sweeping charm, boldness, curiosity and depth as it exemplifies the epitome of the awestruck construction of an enlightening, sophisticated feature length animation. The mixture of humor, thrills, drama and tragedy is decidedly triumphant allowing **Kubo and the Two Strings** to flex its reflective, throbbing mysterious muscles.\r\n\r\n**Kubo and the Two Strings** (2016)\r\n\r\nFocus Features\r\n\r\n1 hr. 41 mins.\r\n\r\nStarring: Art Parkinson, Charlize Theron, Matthew McConaughey, Ralph Fiennes, Rooney Mara, George Takei, Cary-Hiroyuki Tagawa, Brenda Vaccaro\r\n\r\nDirected by: Travis Knight\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Fantasy & Sci-Fi/ Action & Adventure/Animation\r\n\r\nCritic’s rating: **** stars (out of 4)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-25T08:10:54.796Z"}, {"movie_id": 313297, "review_id": "58446af8c3a3683e1600c1ec", "author_rating": 7.0, "review_text": "**A boy, a monkey and a giant beetle team up for a quest.**\r\n\r\nThis is not an old fashioned stop-motion animation. This is a very modern, a hybrid of multiple techniques that includes 3D printing and digital special effects. The directional debut for the producer of 'ParaNorman' and 'The Boxtrolls'. The tale is about a one eyed boy named Kubo, who has been hiding in a seaside mountain cave near a small village from his grandfather, the moon king, ever since his birth, protected by his mother. He grew up listening the stories of a legendary samurai warrior Hanzo. But one day after he himself exposed to the moonlight, the troubles follow. Now his only chance to survive is to find his father's armours and so the quest begins where he teams up with other two.\r\n\r\nThis is a Japanese story, takes place somewhere in a fictional ancient Japan. Technically, this film was so good, very pleasant for viewing, especially the framerate was higher than normal stop-motion animation. The character models, music, the length of the film, the pace of the narration, all were so brilliant, but not the story. It was average, I mean very, very simple and familiar. Still, it is a very likable film, particularly the children would love it. I'm going to repeat again like I always say while reviewing stop-motion animation films that this kind of films are rare, so when they make one, that automatically goes to a must see list. Whether you're going to like it or not, I hope you won't miss it.\r\n\r\n_7/10_", "created_at": "2016-12-04T19:14:00.845Z"}, {"movie_id": 313297, "review_id": "5ff1c6c621118f003c2489cc", "author_rating": 8.0, "review_text": "Great, creative story.\r\n\r\n<em>'Kubo and the Two Strings'</em> is a fun film, I enjoyed it all. I love the animation style that Laika use, they also tend to get the vibe of their stories pretty bang on. This is my favourite work of the studio's so far, at least before I watch <em>'Missing Link'</em>.\r\n\r\nThe casting could've been more appropriate, though I'm a believer of anyone playing anyone when it comes to voice roles. Art Parkinson, Charlize Theron and Matthew McConaughey make for an undeniably strong trio. Parkinson and Theron do particularly good jobs, though McConaughey is my standout. Elsewhere, Ralph Fiennes and George Takei are, minorly, involved.\r\n\r\nThe lovely story and top animation are the biggest takeaways from this. Recommended.", "created_at": "2021-01-03T13:29:42.741Z"}, {"movie_id": 313297, "review_id": "636779951684f7008aeb068a", "author_rating": 7.0, "review_text": "Every now and again there is an unexpected advantage in having a cinema membership. This was billed yesterday at our local Cineworld and so, to avoid the biblical torrents outside, I thought - why not? Well I am really glad I did. This is a really enjoyable story about a young, one-eyed, lad \"Kubo\" who lives with his mother in a cave high above their village where he regularly regales the townsfolk's with his magical stories, augmented by some wizardry with origami characters. His only rule is that he must return to his mother by sundown. She is a curiously detached character, whose dreams provide the substance for the young man's engaging and characterful stories. It is festival time and his elderly friend suggests that he stay a while later and light a lantern so that he may try to chat with his later father. The sun sets and suddenly he is being sought by his two evil, shape-shifting, aunties. His mother manages to stave them off but at considerable sacrifice, and soon young \"Kudo\" and his friends monkey and beetle must race to find an unbreakable sword and some armour that may offer his some protection from his pursuing grandfather who, it turns out, wants his other eye too! The animation is delicate and charming. From the origami samurai through to the leaf-built boat, this young man uses his powers to stay one step ahead of his nemeses and the whole story is really quite engaging. There are a few combat scenes, but they are short, sharp and sweet. This is really about the relationship between him and his two friends, and as it progresses we soon discover that they are far more than just his travelling companions. Dario Marianelli has provided a good score that mixes the jollity and the menacing and the script delivers some humour to mix well with the adventure. This looks great on a big screen - the animation is vidid and colourful and I was really pleasantly surprised here. Well worth a watch.", "created_at": "2022-11-06T09:08:37.450Z"}, {"movie_id": 313297, "review_id": "57bea80ec3a3682c4a005667", "author_rating": null, "review_text": "Every once in a while there is family-friendly entertainment that lives up to its wonderment in imaginative storytelling and stunning visual scope. Certainly this is the case with the stimulating yet meditative Japanese animated fantasy-adventure **Kubo and the Two Strings**. Undeniably vibrant and philosophical in committed heart and soul, **Kubo and the Two Strings** is a majestic masterpiece in its colorfully realized presentation that ambitiously binds together opulent elements of ancient Far East folklore, eye-opening anime and origami (the finesse art of paper-folding). The competition for jaw-dropping animation within recent years (or even this year) has been remarkably stellar thus far but Kubo confirms its superiority above the ranks. No one can doubt the masterful film-making technique administered by the film’s director Travis Knight in this glossy, whimsical medieval gem.\r\n\r\nAs with the majority of adventurous and challenging narratives that seek the high-minded exploratory vibes in its execution, **Kubo and the Two Strings** is about the creative coming-of-age quest of a young boy and the spellbinding encounters that materialize as a result. Knight and screenwriters Marc Haimes and Chris Butler oversees a profound and aesthetically remarkable production highlighted by notable voiceover performers (such as Academy Award-winners Charlize Theron and Matthew McConaughey), stylish and glowing animation and a hypnotic showcase that is an exquisite treat for moviegoers from all walks of life.\r\n\r\nImportantly,** Kubo and the Two Strings** is aided by its heralded association with the Oregon-based studio Laika whose treasured reputation in the stop-motion animation process is tremendously noteworthy. Among Laika’s previously outstanding cinematic samples include 2009’s _Coraline_, 2011’s criminally underrated _ParaNorman_ and 2014’s _The Boxtrolls_ so indeed Knight’s superlative **Kubo and the Two Strings** is among exceptional stock. The detailed imagery in **Kubo** is indescribably luscious and the brilliant artistic manufacturing of Laika’s refined flourishes only elevates Knight’s enticing animated vehicle as a compelling journey into the ancient Japanese Edo period mythology.\r\n\r\nOne can tell that the coveted **Kubo and the Two Strings** is destined to stay true to its mystical leanings especially when the beginning film’s sequence features the caustic quote: ““If you must blink, do it now” …because “if you look away, even for an instant, our hero will surely perish.” As previously mentioned the story takes place in ancient Japan where we find the gifted 11-year old Kubo (voiced by Art Parkinson from “Game of Thrones”) existing with his ailing mother on the outskirts of a nearby village. The young Kubo’s talents is such that he is a natural story-telling magician that can skillfully convey his expressive communication through origami. Kubo enjoys the gesture of entertaining the local villagers. However, his mother advises that Kubo must be home before nightfall. Unfortunately, Kubo does not heed her advice but that is not due to his personal defiance or negligence.\r\n\r\nIn fact, Kubo’s no-show at home is large in part cue to the dubious agenda of his grandfather Moon Father (Academy Award nominee Ralph Fiennes). In instructing his dastardly daughters to track down their beleaguered nephew the stakes are high especially when Moon Father was instrumental in the demise of his slain samurai father. Hence, Kubo must locate his late father’s magical armor-related belongings and reclaim a sense of honor. The tag-a-longs at Kubo’s side include the woolly-looking snow Monkey (Theron) and buff warrior Beetle (McConaughey). Together, the travelling trio is confronted by beastly specimens and other deceptive supernatural forces en route to the ultimate showdown with his sinister grandfather Moon Father. Armed with resiliency and determination Kubo and his crafty companions face uncertainties that are quite unimaginable to say the least.\r\n\r\n**Kubo and the Two Strings** is an astonishing offering that taps into its pulsating pulse with its mild intensity that should not deter the youngsters from fully experiencing the escapist vision of young Kubo and his offbeat sidekicks. Parkinson’s Kubo is idealistic and has a fearless approach to questioning the unassuming world around him. The combination of roguishness and wide-eyed innocence is certainly appealing to the intrigued tots that may view Kubo’s wily exploits as exciting and surreal in the name of his heroic daddy’s destiny. Theron’s acid-tongued Monkey is inspired in grand impishness with snarky flair. As for McConaughey’s flippant gung-ho Beetle he is an odd serving of comical relief and well-intentional courageousness. Fiennes makes for an ideal unctuous rival as his Moon Father is the Darth Vader to Kubo’s impressionable Luke Skywalker blueprint. Also, Academy Award nominee Rooney Mara is wickedly delicious as the scheming aunts–the twin sisters of Kubo’s sickly mother. Rounding out the supporting cast are the supplied voices of Asian contributors such as George Takei’s (“TV Star Trek’s original Sulu”) Hosato, Cary-Hiroyuki Tagawa’s Hashi and Minae Noji’s Minae among the Kubo personalities that populate Knight’s dazzling display of a transcendent Japanese-flavored Grimm fairy tale.\r\n\r\nNaturally the real selling point for **Kubo and the Two Strings** is the standout computer-generated technology and other incorporated genres of animation that gives this polished fantasy fable its magnificent sheen. Knight, a first-time director whose background as Laika’s primary animator is evidenced in the celebrated animation studio’s first three films, demonstrates the authenticity of his amazing craft courtesy of the stop-motion precision that defines his sensual cinematic landscape.\r\n\r\nOverall, **Kubo and the Two Strings** radiates with sweeping charm, boldness, curiosity and depth as it exemplifies the epitome of the awestruck construction of an enlightening, sophisticated feature length animation. The mixture of humor, thrills, drama and tragedy is decidedly triumphant allowing **Kubo and the Two Strings** to flex its reflective, throbbing mysterious muscles.\r\n\r\n**Kubo and the Two Strings** (2016)\r\n\r\nFocus Features\r\n\r\n1 hr. 41 mins.\r\n\r\nStarring: Art Parkinson, Charlize Theron, Matthew McConaughey, Ralph Fiennes, Rooney Mara, George Takei, Cary-Hiroyuki Tagawa, Brenda Vaccaro\r\n\r\nDirected by: Travis Knight\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Fantasy & Sci-Fi/ Action & Adventure/Animation\r\n\r\nCritic’s rating: **** stars (out of 4)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-25T08:10:54.796Z"}, {"movie_id": 313297, "review_id": "58446af8c3a3683e1600c1ec", "author_rating": 7.0, "review_text": "**A boy, a monkey and a giant beetle team up for a quest.**\r\n\r\nThis is not an old fashioned stop-motion animation. This is a very modern, a hybrid of multiple techniques that includes 3D printing and digital special effects. The directional debut for the producer of 'ParaNorman' and 'The Boxtrolls'. The tale is about a one eyed boy named Kubo, who has been hiding in a seaside mountain cave near a small village from his grandfather, the moon king, ever since his birth, protected by his mother. He grew up listening the stories of a legendary samurai warrior Hanzo. But one day after he himself exposed to the moonlight, the troubles follow. Now his only chance to survive is to find his father's armours and so the quest begins where he teams up with other two.\r\n\r\nThis is a Japanese story, takes place somewhere in a fictional ancient Japan. Technically, this film was so good, very pleasant for viewing, especially the framerate was higher than normal stop-motion animation. The character models, music, the length of the film, the pace of the narration, all were so brilliant, but not the story. It was average, I mean very, very simple and familiar. Still, it is a very likable film, particularly the children would love it. I'm going to repeat again like I always say while reviewing stop-motion animation films that this kind of films are rare, so when they make one, that automatically goes to a must see list. Whether you're going to like it or not, I hope you won't miss it.\r\n\r\n_7/10_", "created_at": "2016-12-04T19:14:00.845Z"}, {"movie_id": 313297, "review_id": "5ff1c6c621118f003c2489cc", "author_rating": 8.0, "review_text": "Great, creative story.\r\n\r\n<em>'Kubo and the Two Strings'</em> is a fun film, I enjoyed it all. I love the animation style that Laika use, they also tend to get the vibe of their stories pretty bang on. This is my favourite work of the studio's so far, at least before I watch <em>'Missing Link'</em>.\r\n\r\nThe casting could've been more appropriate, though I'm a believer of anyone playing anyone when it comes to voice roles. Art Parkinson, Charlize Theron and Matthew McConaughey make for an undeniably strong trio. Parkinson and Theron do particularly good jobs, though McConaughey is my standout. Elsewhere, Ralph Fiennes and George Takei are, minorly, involved.\r\n\r\nThe lovely story and top animation are the biggest takeaways from this. Recommended.", "created_at": "2021-01-03T13:29:42.741Z"}, {"movie_id": 313297, "review_id": "636779951684f7008aeb068a", "author_rating": 7.0, "review_text": "Every now and again there is an unexpected advantage in having a cinema membership. This was billed yesterday at our local Cineworld and so, to avoid the biblical torrents outside, I thought - why not? Well I am really glad I did. This is a really enjoyable story about a young, one-eyed, lad \"Kubo\" who lives with his mother in a cave high above their village where he regularly regales the townsfolk's with his magical stories, augmented by some wizardry with origami characters. His only rule is that he must return to his mother by sundown. She is a curiously detached character, whose dreams provide the substance for the young man's engaging and characterful stories. It is festival time and his elderly friend suggests that he stay a while later and light a lantern so that he may try to chat with his later father. The sun sets and suddenly he is being sought by his two evil, shape-shifting, aunties. His mother manages to stave them off but at considerable sacrifice, and soon young \"Kudo\" and his friends monkey and beetle must race to find an unbreakable sword and some armour that may offer his some protection from his pursuing grandfather who, it turns out, wants his other eye too! The animation is delicate and charming. From the origami samurai through to the leaf-built boat, this young man uses his powers to stay one step ahead of his nemeses and the whole story is really quite engaging. There are a few combat scenes, but they are short, sharp and sweet. This is really about the relationship between him and his two friends, and as it progresses we soon discover that they are far more than just his travelling companions. Dario Marianelli has provided a good score that mixes the jollity and the menacing and the script delivers some humour to mix well with the adventure. This looks great on a big screen - the animation is vidid and colourful and I was really pleasantly surprised here. Well worth a watch.", "created_at": "2022-11-06T09:08:37.450Z"}, {"movie_id": 313297, "review_id": "57bea80ec3a3682c4a005667", "author_rating": null, "review_text": "Every once in a while there is family-friendly entertainment that lives up to its wonderment in imaginative storytelling and stunning visual scope. Certainly this is the case with the stimulating yet meditative Japanese animated fantasy-adventure **Kubo and the Two Strings**. Undeniably vibrant and philosophical in committed heart and soul, **Kubo and the Two Strings** is a majestic masterpiece in its colorfully realized presentation that ambitiously binds together opulent elements of ancient Far East folklore, eye-opening anime and origami (the finesse art of paper-folding). The competition for jaw-dropping animation within recent years (or even this year) has been remarkably stellar thus far but Kubo confirms its superiority above the ranks. No one can doubt the masterful film-making technique administered by the film’s director Travis Knight in this glossy, whimsical medieval gem.\r\n\r\nAs with the majority of adventurous and challenging narratives that seek the high-minded exploratory vibes in its execution, **Kubo and the Two Strings** is about the creative coming-of-age quest of a young boy and the spellbinding encounters that materialize as a result. Knight and screenwriters Marc Haimes and Chris Butler oversees a profound and aesthetically remarkable production highlighted by notable voiceover performers (such as Academy Award-winners Charlize Theron and Matthew McConaughey), stylish and glowing animation and a hypnotic showcase that is an exquisite treat for moviegoers from all walks of life.\r\n\r\nImportantly,** Kubo and the Two Strings** is aided by its heralded association with the Oregon-based studio Laika whose treasured reputation in the stop-motion animation process is tremendously noteworthy. Among Laika’s previously outstanding cinematic samples include 2009’s _Coraline_, 2011’s criminally underrated _ParaNorman_ and 2014’s _The Boxtrolls_ so indeed Knight’s superlative **Kubo and the Two Strings** is among exceptional stock. The detailed imagery in **Kubo** is indescribably luscious and the brilliant artistic manufacturing of Laika’s refined flourishes only elevates Knight’s enticing animated vehicle as a compelling journey into the ancient Japanese Edo period mythology.\r\n\r\nOne can tell that the coveted **Kubo and the Two Strings** is destined to stay true to its mystical leanings especially when the beginning film’s sequence features the caustic quote: ““If you must blink, do it now” …because “if you look away, even for an instant, our hero will surely perish.” As previously mentioned the story takes place in ancient Japan where we find the gifted 11-year old Kubo (voiced by Art Parkinson from “Game of Thrones”) existing with his ailing mother on the outskirts of a nearby village. The young Kubo’s talents is such that he is a natural story-telling magician that can skillfully convey his expressive communication through origami. Kubo enjoys the gesture of entertaining the local villagers. However, his mother advises that Kubo must be home before nightfall. Unfortunately, Kubo does not heed her advice but that is not due to his personal defiance or negligence.\r\n\r\nIn fact, Kubo’s no-show at home is large in part cue to the dubious agenda of his grandfather Moon Father (Academy Award nominee Ralph Fiennes). In instructing his dastardly daughters to track down their beleaguered nephew the stakes are high especially when Moon Father was instrumental in the demise of his slain samurai father. Hence, Kubo must locate his late father’s magical armor-related belongings and reclaim a sense of honor. The tag-a-longs at Kubo’s side include the woolly-looking snow Monkey (Theron) and buff warrior Beetle (McConaughey). Together, the travelling trio is confronted by beastly specimens and other deceptive supernatural forces en route to the ultimate showdown with his sinister grandfather Moon Father. Armed with resiliency and determination Kubo and his crafty companions face uncertainties that are quite unimaginable to say the least.\r\n\r\n**Kubo and the Two Strings** is an astonishing offering that taps into its pulsating pulse with its mild intensity that should not deter the youngsters from fully experiencing the escapist vision of young Kubo and his offbeat sidekicks. Parkinson’s Kubo is idealistic and has a fearless approach to questioning the unassuming world around him. The combination of roguishness and wide-eyed innocence is certainly appealing to the intrigued tots that may view Kubo’s wily exploits as exciting and surreal in the name of his heroic daddy’s destiny. Theron’s acid-tongued Monkey is inspired in grand impishness with snarky flair. As for McConaughey’s flippant gung-ho Beetle he is an odd serving of comical relief and well-intentional courageousness. Fiennes makes for an ideal unctuous rival as his Moon Father is the Darth Vader to Kubo’s impressionable Luke Skywalker blueprint. Also, Academy Award nominee Rooney Mara is wickedly delicious as the scheming aunts–the twin sisters of Kubo’s sickly mother. Rounding out the supporting cast are the supplied voices of Asian contributors such as George Takei’s (“TV Star Trek’s original Sulu”) Hosato, Cary-Hiroyuki Tagawa’s Hashi and Minae Noji’s Minae among the Kubo personalities that populate Knight’s dazzling display of a transcendent Japanese-flavored Grimm fairy tale.\r\n\r\nNaturally the real selling point for **Kubo and the Two Strings** is the standout computer-generated technology and other incorporated genres of animation that gives this polished fantasy fable its magnificent sheen. Knight, a first-time director whose background as Laika’s primary animator is evidenced in the celebrated animation studio’s first three films, demonstrates the authenticity of his amazing craft courtesy of the stop-motion precision that defines his sensual cinematic landscape.\r\n\r\nOverall, **Kubo and the Two Strings** radiates with sweeping charm, boldness, curiosity and depth as it exemplifies the epitome of the awestruck construction of an enlightening, sophisticated feature length animation. The mixture of humor, thrills, drama and tragedy is decidedly triumphant allowing **Kubo and the Two Strings** to flex its reflective, throbbing mysterious muscles.\r\n\r\n**Kubo and the Two Strings** (2016)\r\n\r\nFocus Features\r\n\r\n1 hr. 41 mins.\r\n\r\nStarring: Art Parkinson, Charlize Theron, Matthew McConaughey, Ralph Fiennes, Rooney Mara, George Takei, Cary-Hiroyuki Tagawa, Brenda Vaccaro\r\n\r\nDirected by: Travis Knight\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Fantasy & Sci-Fi/ Action & Adventure/Animation\r\n\r\nCritic’s rating: **** stars (out of 4)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-25T08:10:54.796Z"}, {"movie_id": 313297, "review_id": "58446af8c3a3683e1600c1ec", "author_rating": 7.0, "review_text": "**A boy, a monkey and a giant beetle team up for a quest.**\r\n\r\nThis is not an old fashioned stop-motion animation. This is a very modern, a hybrid of multiple techniques that includes 3D printing and digital special effects. The directional debut for the producer of 'ParaNorman' and 'The Boxtrolls'. The tale is about a one eyed boy named Kubo, who has been hiding in a seaside mountain cave near a small village from his grandfather, the moon king, ever since his birth, protected by his mother. He grew up listening the stories of a legendary samurai warrior Hanzo. But one day after he himself exposed to the moonlight, the troubles follow. Now his only chance to survive is to find his father's armours and so the quest begins where he teams up with other two.\r\n\r\nThis is a Japanese story, takes place somewhere in a fictional ancient Japan. Technically, this film was so good, very pleasant for viewing, especially the framerate was higher than normal stop-motion animation. The character models, music, the length of the film, the pace of the narration, all were so brilliant, but not the story. It was average, I mean very, very simple and familiar. Still, it is a very likable film, particularly the children would love it. I'm going to repeat again like I always say while reviewing stop-motion animation films that this kind of films are rare, so when they make one, that automatically goes to a must see list. Whether you're going to like it or not, I hope you won't miss it.\r\n\r\n_7/10_", "created_at": "2016-12-04T19:14:00.845Z"}, {"movie_id": 313297, "review_id": "5ff1c6c621118f003c2489cc", "author_rating": 8.0, "review_text": "Great, creative story.\r\n\r\n<em>'Kubo and the Two Strings'</em> is a fun film, I enjoyed it all. I love the animation style that Laika use, they also tend to get the vibe of their stories pretty bang on. This is my favourite work of the studio's so far, at least before I watch <em>'Missing Link'</em>.\r\n\r\nThe casting could've been more appropriate, though I'm a believer of anyone playing anyone when it comes to voice roles. Art Parkinson, Charlize Theron and Matthew McConaughey make for an undeniably strong trio. Parkinson and Theron do particularly good jobs, though McConaughey is my standout. Elsewhere, Ralph Fiennes and George Takei are, minorly, involved.\r\n\r\nThe lovely story and top animation are the biggest takeaways from this. Recommended.", "created_at": "2021-01-03T13:29:42.741Z"}, {"movie_id": 313297, "review_id": "636779951684f7008aeb068a", "author_rating": 7.0, "review_text": "Every now and again there is an unexpected advantage in having a cinema membership. This was billed yesterday at our local Cineworld and so, to avoid the biblical torrents outside, I thought - why not? Well I am really glad I did. This is a really enjoyable story about a young, one-eyed, lad \"Kubo\" who lives with his mother in a cave high above their village where he regularly regales the townsfolk's with his magical stories, augmented by some wizardry with origami characters. His only rule is that he must return to his mother by sundown. She is a curiously detached character, whose dreams provide the substance for the young man's engaging and characterful stories. It is festival time and his elderly friend suggests that he stay a while later and light a lantern so that he may try to chat with his later father. The sun sets and suddenly he is being sought by his two evil, shape-shifting, aunties. His mother manages to stave them off but at considerable sacrifice, and soon young \"Kudo\" and his friends monkey and beetle must race to find an unbreakable sword and some armour that may offer his some protection from his pursuing grandfather who, it turns out, wants his other eye too! The animation is delicate and charming. From the origami samurai through to the leaf-built boat, this young man uses his powers to stay one step ahead of his nemeses and the whole story is really quite engaging. There are a few combat scenes, but they are short, sharp and sweet. This is really about the relationship between him and his two friends, and as it progresses we soon discover that they are far more than just his travelling companions. Dario Marianelli has provided a good score that mixes the jollity and the menacing and the script delivers some humour to mix well with the adventure. This looks great on a big screen - the animation is vidid and colourful and I was really pleasantly surprised here. Well worth a watch.", "created_at": "2022-11-06T09:08:37.450Z"}]