[{"movie_id": 49047, "review_id": "5286a24d19c29569be0752f2", "author_rating": 9.0, "review_text": "Great story, great cast and performances, great direction, FX, photography, care for the details, OST and editing.\r\n\r\nAlfonso Cuarón is a real titan and Sandra Bullock goes for the Oscar.\r\n\r\nIt is not a 10 because at some point the chain of events goes further that it should.", "created_at": "2013-11-15T22:38:05.884Z"}, {"movie_id": 49047, "review_id": "5a3a65100e0a264cd0212412", "author_rating": 6.0, "review_text": "There is no doubt that this is a very pleasing movie from a purely visual point of view. This is probably a movie that would benefit from being watched in a good theater with its grandiose scenery.\n\nHowever, I have to say that I found the rest of the movie somewhat mediocre. The part that I felt dragged down the movie the most is that Dr. Ryan is behaving rather clumsily and amateurish first being real slow in obeying the order to evacuate and then floating around huffing and puffing, talking a lot when she should really conserve oxygen. Did they not give her the basic course before letting her up in space? I also found it soooo Hollywood that she was able to get onto the Chinese space station and seconds later it starts to descend into the atmosphere. In general I felt that the script writer was not really very technically knowledgeable.\n\nOverlooking these, unfortunately all too often occurring issues, the movie is fairly okay as a whole. Obviously I cannot agree with the glowing all-star ratings that some people have been giving it but it is far from the single star trashing that other people have been giving it. Technically it was very good with nice special effects. Bullock performed as well as can be expected with the script she was given. Clooney felt a bit out-of-place as a skilled astronaut to me but then he was not really in the movie that much.\n\nTo me it was a fairly enjoyable popcorn movie.", "created_at": "2017-12-20T13:26:40.379Z"}, {"movie_id": 49047, "review_id": "63002aabb39e35007a84cbcf", "author_rating": 9.0, "review_text": "**A cinematography masterclass!**\r\n\r\nThe cinematography of this movie is a breathtaking feat, unlike anything I have ever seen! The commitment to realism influenced every decision throwing the audience into the intensity of every moment. An enthralling ride from beginning to end with overwhelming effects and masterful storytelling that makes you feel every second. This movie absolutely earned its place on the list of “1001 Movies to See Before You Die.”", "created_at": "2022-08-20T00:28:27.094Z"}, {"movie_id": 49047, "review_id": "63b891db43250f008a9effc1", "author_rating": 8.0, "review_text": "Gravity is an epic thrill ride that starts and never ends. I have not felt continued tension like this film in some time. The entire movie is so isolated and desperate, it is incredibly immersive. It had me on the edge of my seat the entire time. The script is a bit rough at times, a large portion of the dialogue does not seem realistic and can come off as corny sometimes, especially with George Clooney's character. Overall, it is short, face paced, and thrilling and I would highly recommend.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-01-06T21:25:47.523Z"}]