[{"movie_id": 6947, "review_id": "5c5ba8cec3a3683cd188e50b", "author_rating": 8.0, "review_text": "A lovely shot tale that has resonance in the modern age.\r\n\r\nThis user comment is my own personal feelings, it is not a review that I make in the hope of turning anyone's opinion to that of my own, no mater what anyone says or does, my feelings for the film will never change.\r\n\r\nI see a smartly crafted movie about fear and hope, a community living in fear of the outside world, I see involving characters to follow with interest, I see a gorgeous setting that intrigues and engages me.\r\n\r\nManoj Night Shyamalan's fourth mainstream picture is now, as we can all agree, a victim of a terrible marketing campaign, wasn't it? For there are horror elements in the film, of which I don't wish to spoiler write about, the horror elements are there, they just aren't the boo jump scary monster variety that many had hoped for. The ending to the film disappoints many it would seem, but it doesn't to me because it is here that the film has most resonance and the point is well and truly made. It's acted out with style from the majority of the cast, and Shyamalan directs with a steady caring approach. It's not without flaws for sure, but this is a very tidy piece that's saying quite a bit if the viewer is so inclined to jump on board. All told, it's a very solid and thought provoking piece that's made with much film making care. 8/10", "created_at": "2019-02-07T03:41:02.736Z"}, {"movie_id": 6947, "review_id": "5f7066a8fbe36f00376c51a0", "author_rating": 8.0, "review_text": "Great watch, will watch again, and can recommend.\r\n\r\nBeing this is in the Shamallama-verse, it catches a lot of flak for having a \"twist\", and being a bit of a intellectual weight lift, but even knowing the \"twist\", I find it to be a very interesting watch.\r\n\r\nA blind protagonist is immediately interesting to me because it tends to lend itself to the non-traditional elements of a movie and is usually very refreshing for those of us that watch a lot of movies.\r\n\r\nBryce Dallas Howard, especially, does much of the heavy lifting in this movie, but there really is a stacked cast that all give a good amount of quality support through their roles: it's not just about the blind girl travelling for days through the woods, it is about the community.  Stories that focus on things larger than a single person as a \"character\" tend to lose people as they like to immerse themselves in a character and still feel they're bigger than the world in the setting.\r\n\r\nThe initial concept of a \"big bad wolf\" in the woods is interesting, but they do go a different way with it: they're almost a society of creatures the way they're given to behave where werewolves might have actually been a more effective choice for a \"monster\".\r\n\r\nLikely this has been spoiled for you, but if not, then you should definitely give it a shot, and if so, then you should see how it is for yourself.", "created_at": "2020-09-27T10:17:12.895Z"}]