[{"movie_id": 492188, "review_id": "5dce1bfbcc277c0017e4401b", "author_rating": 9.0, "review_text": "I wish so badly I could separate the art from the artist, and this is the only reason I cannot give ‘Marriage Story’ the five stars it actually deserves. My own issues with Baumbach aside, however, and it’s shocking to me that a film so simple can be so nearly flawless (I mean this technically too; the film is shot, edited, paced and scored beautifully). Despite how much I cried, it finds beauty and comedy in the tiniest of moments. It’s an ugly portrait of two flawed people and therefore never easy to watch, but it is one of the most rewarding experiences I have had with a film in years. I just hope I never have to experience it myself.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-marriage-story-simply-extraordinary", "created_at": "2019-11-15T03:31:07.449Z"}, {"movie_id": 492188, "review_id": "5deeb495688cd000172077fb", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI don't even know how to start this review… Marriage Story is one of those movies that stays with me long after I've finished it. I've been thinking about it a lot, and it's undoubtedly one of the most realistic dramas I've ever seen. That's due to the award-worthy performances of Adam Driver (Charlie Barber) and Scarlett Johansson (Nicole Barber), but also because of Noah Baumbach's incredibly layered screenplay. In addition to this, Baumbach is undeniably one of the best directors of the year. With the help of his DP, Robbie Ryan, he sets the platform for Driver and Johansson to shine as the astonishing actors that they are.\r\n\r\nSome people watch films to forget their daily issues. Some just want to have fun. Some want to learn more about a particular true story. However, there's not a single person alive who wants to watch a movie and not be able to leave the theater (or, in this case, their couch) entertained. Marriage Story has such an emotionally complicated premise that it's tough to convince people to sit and watch. I mean, who wants to watch a divorce develop throughout more than two hours? Who wants to watch two people who were once in love with each other become the worst of themselves? Yelling, fighting, court, custody, lawyers… It's not exactly an attention-grabber.\r\n\r\nI imagine people who went through the same situation getting triggered and remember a phase of their lives that was probably one of their worst. I'm writing this because I've seen some negativity towards people who simply don't want to watch Baumbach's depiction of a depressing event. It's perfectly understandable if anyone decides to skip this one, especially if it hits too close to home. In my case, I've never gone through a divorce (hopefully, I'll never will), and usually I can \"enjoy\" this type of sad, frustrating, bittersweet films (Manchester by the Sea, A Ghost Story) for what they are, no matter how tragic.\r\n\r\nIf I had to choose one-word praise: realistic. There's no way around it. The palpable emotions are the main reason why this story works so well. Only people who have never been in a relationship of any kind can't understand the moment when a fight starts to escalate, and the couple begins to say terrible stuff at each other that they don't exactly mean. The exaggeration and over-the-top arguments are part of every couple's life. They can occur due to a hundred reasons related to stress, work, accumulation of little things, or simply because it's just not a good day.\r\n\r\nMarriage Story doesn’t deliver a hopeful message or a sweet story because that’s not what divorces are. It’s not difficult to imagine how hard it is to separate yourself from the person you love(d) for years without end, even more when there’s a kid involved in the process. Baumbach could have followed the genre cliches and provide moments of pure happiness, but that’s not something that happens during a situation like this. It’s a heart-wrenching phase to live through, and I believe that this movie is going to be thoroughly analyzed in film school in the next decade or so.\r\n\r\nTHE scene with Driver and Johansson going at each other exponentially harder and heavier criticism-wise is one of the most emotionally powerful dialogues of the millennium. The raw emotion and the physical movements that both actors can bring into the fight are absurdly impressive. Their chemistry is so inexplicably real. I never, not even for a single second, thought that I was watching fictional characters. Nicole and Charlie can very well be our neighbors or part of our family. Baumbach's use of long takes really elevate every single sequence, allowing the protagonists to move around the set and actually act.\r\n\r\nTechnically, there's no better acting this year than what Driver and Johansson deliver. Both are always moving and doing a lot of things while giving their lines. Making dinner, drinking tea, going to the bathroom, chopping a carrot, blowing their nose, standing up, sitting down, walking around the room, crying, smiling, laughing… All of this in a single take! Several times!! Scarlett shows more emotion throughout the runtime than her counterpart, but Adam proves why he's the frontrunner at the 2019's Oscars. His restraint when Charlie is trying to be polite even though he's mad, or his explosive behavior when his character decides to finally let go (excellent build-up), are some of the attributes that make his performance my favorite of the year.\r\n\r\nNot trying to diminish Johansson's display. Both deliver career-best performances, in my opinion. Both deserve every award that exists. The supporting cast is also impeccable, and I know that Laura Dern (Nora Fanshaw) is probably going to be nominated. Still, the two leads are so engaging and captivating that I couldn't be impressed with anyone else. The only person to rise to the main actors' level is Noah Baumbach himself. With the best screenplay of 2019, he offers the audience an incredibly complex story, filled with subtle details and exceptional dialogue.\r\n\r\nHe controls the movie's pacing beautifully, and he knows the right moments to insert a little joke to lighten up the dark, depressing mood. My only issue with the film has to do with its replay value. We all have been through this situation: watching a fantastic movie, only once, and never again. Marriage Story is going to be one of those films for me. I love everything about it, but I know the chances of a rewatch are very, very small. It's a profoundly unsettling story, super uncomfortable at times, and I really don't want to go through the sadness and frustration all over again.\r\n\r\nAll in all, Noah Baumbach delivers what I believe to be its career-best flick, Marriage Story. With the best screenplay of 2019, as well as one the best directions, this is the closest the world is ever going to get to a realistic depiction of a divorce. Scarlett Johansson and Adam Driver also give the best performances of their lives, elevating every single scene, dialogue, argument, or joke. The long takes allow them to shine and actually work as actors, moving around the set and doing domestic/job tasks, while delivering their lines. Technically, both Baumbach and the entire cast are absolutely perfect. It's an extremely emotional narrative, very depressing, sad, and even uncomfortable at times, which might scare some people off, especially if they've been through this. Despite its replay value being affected (a rewatch is very unlikely), it's a phenomenal lesson in storytelling that stays with us long after it's finished. Easily, one of the best movies of 2019. Don't miss it, and try not to cry.\r\n\r\nRating: A", "created_at": "2019-12-09T20:54:45.912Z"}, {"movie_id": 492188, "review_id": "5dfd26409824c80015de1413", "author_rating": 7.0, "review_text": "This movie is a thoroughly humane and sensitive portrayal of the painful process that is \"divorce\". Noah Baumbach, who himself had a divorce with actress Jennifer Jason Leigh, seems to have drawn from his own life experiences for this film. The characters are all balanced and multilayered; the acting of the leads, specially Johansson and Driver, lend a particular personality to their characters. Everyone plays their role to the perfection, even the supporting cast including Laura Dern, Alan Alda, and the criminally underused Merritt Wever. This movie shows how a process as messy as divorce turns two people who love and respect each other into one wishing death on the other. No, they are not bad people , they are just people under \"bad\" circumstances, and Marriage story drives that point home. Overall: a brilliant movie, and a great way to end the year.", "created_at": "2019-12-20T19:51:28.355Z"}, {"movie_id": 492188, "review_id": "5e214f45397df000169797df", "author_rating": 5.0, "review_text": "I don't have a kid. I've never been divorced. Or even married. Though I guess I was once a kid myself, I'm not the product of a divorced couple. I'm not even the product of a married one. Everyone I know who has gotten married or had kids did it before I met them, or stopped hanging out with me almost immediately afterward. Everyone I've ever met who got divorced either did it before I met them, or is someone I stopped hanging out with beforehand. So I don't come to the subject of _Marriage Story_ with a wealth of experience, which means it doesn't exactly scream \"relatable content\" to me.\r\n\r\nLet me start where it's easiest and everyone seems to agree: The performances. Everyone in _Marriage Story_ is pretty great, none of the characterisations changed my life, but I get it. As a chance to display what these actors are capable of in a mundane setting where all that matters is their performance, yes, absolutely, _Marriage Story_ has buckets of success.\r\n\r\nOutside of this though... I'm not even going to say that it \"fails\" elsewhere, just that it didn't win me. I like bleak movies, I like movies that make me feel something, even if it's sad. But _Marriage Story_ isn't really that. It poses you the question of whether both Charlie and Nicole are good or bad people, and shows you each from their own and other's perspective. The ending seems to imply that they're good, or at the very least both good and bad (and aren't we all?) but that really doesn't matter very much when we just spent all this time watching both of them be horrible. I know that's life, that's real, that's people, and blah bl-blah bl-blah, but that's little consolation when I've just spent two-plus hours of my life being not at all compelled by a bunch of people being awful. Being awful convincingly, to the actors' respective credits, but in this setting that is not my idea of a good time at the movies.\r\n\r\n46%\r\n\r\n-Gimly", "created_at": "2020-01-17T06:08:05.825Z"}, {"movie_id": 492188, "review_id": "5e2f2d271685da0011e9cffc", "author_rating": 9.0, "review_text": "“I never really came alive for myself; I was only feeding his aliveness.”\r\n\r\nI’ve said some harsh things about Netflix movies in the past, but recently I’m starting to warm up to them.\r\n\r\n‘Marriage Story’ was absolutely excellent. A devastating portrayal of divorce that can bring out the ugly in people, especially with child custody. But it’s not all doom and gloom. It’s incredibly heartfelt with plenty of humorous moments. I guess you have to find the comedy during the difficulties in life. Lets just say my cheeks wasn’t dry afterwards.\r\n\r\nAnd yes, I wept.\r\n\r\nAdam Driver and Scarlett Johansson both gave masterclass performances. And I do mean some power house acting. Driver plays Charlie, a competitive and undaunted theater director that he is very clear about what he wants. Johansson plays Nicole, a mother who’s a delightful presence and loves to play, but is also a dedicated actor. This is the best I’ve seen from Johnasson. Her character delivers a monologue where she’s explains the issues in her life that’s all shot in one take, which brilliantly displays her acting chops where she naturally shifts from emotion to emotion - it was impeccable.\r\n\r\nThe supporting cast were all fantastic. Lauren Dern, Ray Liotta, Merritt Wever, Julie Hagerty, and Alan Alda were all brilliant and really bounce off the energy from Driver and Johansson. Even the child actor held his own between these juggernauts of actors.\r\n\r\nNot only are the performances the strongest element of the movie, but so is the writing. Every character is so uniquely fleshed out that the conflict feels so incredibly raw. It’s one of the reasons why I was so glued to the movie from start to finish. One of the best screenplays of the year.\r\n\r\nThis is the first Noah Baumbach movie I’ve seen from him and I am aware of his other work, just haven’t got around to watching them. However, I feel like this was the best introduction to him as a director, because he crafted such a sympathetic look on marriage dissolving away. We don’t see the full relationship, but we do get to hear Nicole and Charlie individually describe what their love about each other, while there’s a montage that flash’s through their routine life together with their son. Nothing visually striking in the presentation, but not once did it feel stale.\r\n\r\nThe score from Randy Newman was terrific and fitted wonderfully with the movie. I loved the aspect ratio as it added a lot to the overall mood of the movie. When the two go head to head in the custody battle - that doesn't mean they’re enemies. They still talk to each other as if they are still a thing. It’s also hard to pick aside, because you understand where each of them are coming from, and even if you do choose, you still feel bad for either one.\r\n\r\nOverall rating: Any other relationship movie ain't sh*t compared to this.", "created_at": "2020-01-27T18:34:15.774Z"}, {"movie_id": 492188, "review_id": "5f499be2ce6c4c00359f246a", "author_rating": 8.0, "review_text": "Very well acted and bittersweet for sure, this is a movie that didn't really touch me deeply, mainly because didn't grow up in a split family or ever been married or have kids, so this I'm sure speaks to those with those kind of experiences. Still, can appreciate the performances from both Scarlet Johansson and Adam Driver, proving once more how great actors they are and more than their respective blockbuster franchises. **4.0/5**", "created_at": "2020-08-29T00:05:54.368Z"}, {"movie_id": 492188, "review_id": "5dce1bfbcc277c0017e4401b", "author_rating": 9.0, "review_text": "I wish so badly I could separate the art from the artist, and this is the only reason I cannot give ‘Marriage Story’ the five stars it actually deserves. My own issues with Baumbach aside, however, and it’s shocking to me that a film so simple can be so nearly flawless (I mean this technically too; the film is shot, edited, paced and scored beautifully). Despite how much I cried, it finds beauty and comedy in the tiniest of moments. It’s an ugly portrait of two flawed people and therefore never easy to watch, but it is one of the most rewarding experiences I have had with a film in years. I just hope I never have to experience it myself.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-marriage-story-simply-extraordinary", "created_at": "2019-11-15T03:31:07.449Z"}, {"movie_id": 492188, "review_id": "5deeb495688cd000172077fb", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI don't even know how to start this review… Marriage Story is one of those movies that stays with me long after I've finished it. I've been thinking about it a lot, and it's undoubtedly one of the most realistic dramas I've ever seen. That's due to the award-worthy performances of Adam Driver (Charlie Barber) and Scarlett Johansson (Nicole Barber), but also because of Noah Baumbach's incredibly layered screenplay. In addition to this, Baumbach is undeniably one of the best directors of the year. With the help of his DP, Robbie Ryan, he sets the platform for Driver and Johansson to shine as the astonishing actors that they are.\r\n\r\nSome people watch films to forget their daily issues. Some just want to have fun. Some want to learn more about a particular true story. However, there's not a single person alive who wants to watch a movie and not be able to leave the theater (or, in this case, their couch) entertained. Marriage Story has such an emotionally complicated premise that it's tough to convince people to sit and watch. I mean, who wants to watch a divorce develop throughout more than two hours? Who wants to watch two people who were once in love with each other become the worst of themselves? Yelling, fighting, court, custody, lawyers… It's not exactly an attention-grabber.\r\n\r\nI imagine people who went through the same situation getting triggered and remember a phase of their lives that was probably one of their worst. I'm writing this because I've seen some negativity towards people who simply don't want to watch Baumbach's depiction of a depressing event. It's perfectly understandable if anyone decides to skip this one, especially if it hits too close to home. In my case, I've never gone through a divorce (hopefully, I'll never will), and usually I can \"enjoy\" this type of sad, frustrating, bittersweet films (Manchester by the Sea, A Ghost Story) for what they are, no matter how tragic.\r\n\r\nIf I had to choose one-word praise: realistic. There's no way around it. The palpable emotions are the main reason why this story works so well. Only people who have never been in a relationship of any kind can't understand the moment when a fight starts to escalate, and the couple begins to say terrible stuff at each other that they don't exactly mean. The exaggeration and over-the-top arguments are part of every couple's life. They can occur due to a hundred reasons related to stress, work, accumulation of little things, or simply because it's just not a good day.\r\n\r\nMarriage Story doesn’t deliver a hopeful message or a sweet story because that’s not what divorces are. It’s not difficult to imagine how hard it is to separate yourself from the person you love(d) for years without end, even more when there’s a kid involved in the process. Baumbach could have followed the genre cliches and provide moments of pure happiness, but that’s not something that happens during a situation like this. It’s a heart-wrenching phase to live through, and I believe that this movie is going to be thoroughly analyzed in film school in the next decade or so.\r\n\r\nTHE scene with Driver and Johansson going at each other exponentially harder and heavier criticism-wise is one of the most emotionally powerful dialogues of the millennium. The raw emotion and the physical movements that both actors can bring into the fight are absurdly impressive. Their chemistry is so inexplicably real. I never, not even for a single second, thought that I was watching fictional characters. Nicole and Charlie can very well be our neighbors or part of our family. Baumbach's use of long takes really elevate every single sequence, allowing the protagonists to move around the set and actually act.\r\n\r\nTechnically, there's no better acting this year than what Driver and Johansson deliver. Both are always moving and doing a lot of things while giving their lines. Making dinner, drinking tea, going to the bathroom, chopping a carrot, blowing their nose, standing up, sitting down, walking around the room, crying, smiling, laughing… All of this in a single take! Several times!! Scarlett shows more emotion throughout the runtime than her counterpart, but Adam proves why he's the frontrunner at the 2019's Oscars. His restraint when Charlie is trying to be polite even though he's mad, or his explosive behavior when his character decides to finally let go (excellent build-up), are some of the attributes that make his performance my favorite of the year.\r\n\r\nNot trying to diminish Johansson's display. Both deliver career-best performances, in my opinion. Both deserve every award that exists. The supporting cast is also impeccable, and I know that Laura Dern (Nora Fanshaw) is probably going to be nominated. Still, the two leads are so engaging and captivating that I couldn't be impressed with anyone else. The only person to rise to the main actors' level is Noah Baumbach himself. With the best screenplay of 2019, he offers the audience an incredibly complex story, filled with subtle details and exceptional dialogue.\r\n\r\nHe controls the movie's pacing beautifully, and he knows the right moments to insert a little joke to lighten up the dark, depressing mood. My only issue with the film has to do with its replay value. We all have been through this situation: watching a fantastic movie, only once, and never again. Marriage Story is going to be one of those films for me. I love everything about it, but I know the chances of a rewatch are very, very small. It's a profoundly unsettling story, super uncomfortable at times, and I really don't want to go through the sadness and frustration all over again.\r\n\r\nAll in all, Noah Baumbach delivers what I believe to be its career-best flick, Marriage Story. With the best screenplay of 2019, as well as one the best directions, this is the closest the world is ever going to get to a realistic depiction of a divorce. Scarlett Johansson and Adam Driver also give the best performances of their lives, elevating every single scene, dialogue, argument, or joke. The long takes allow them to shine and actually work as actors, moving around the set and doing domestic/job tasks, while delivering their lines. Technically, both Baumbach and the entire cast are absolutely perfect. It's an extremely emotional narrative, very depressing, sad, and even uncomfortable at times, which might scare some people off, especially if they've been through this. Despite its replay value being affected (a rewatch is very unlikely), it's a phenomenal lesson in storytelling that stays with us long after it's finished. Easily, one of the best movies of 2019. Don't miss it, and try not to cry.\r\n\r\nRating: A", "created_at": "2019-12-09T20:54:45.912Z"}, {"movie_id": 492188, "review_id": "5dfd26409824c80015de1413", "author_rating": 7.0, "review_text": "This movie is a thoroughly humane and sensitive portrayal of the painful process that is \"divorce\". Noah Baumbach, who himself had a divorce with actress Jennifer Jason Leigh, seems to have drawn from his own life experiences for this film. The characters are all balanced and multilayered; the acting of the leads, specially Johansson and Driver, lend a particular personality to their characters. Everyone plays their role to the perfection, even the supporting cast including Laura Dern, Alan Alda, and the criminally underused Merritt Wever. This movie shows how a process as messy as divorce turns two people who love and respect each other into one wishing death on the other. No, they are not bad people , they are just people under \"bad\" circumstances, and Marriage story drives that point home. Overall: a brilliant movie, and a great way to end the year.", "created_at": "2019-12-20T19:51:28.355Z"}, {"movie_id": 492188, "review_id": "5e214f45397df000169797df", "author_rating": 5.0, "review_text": "I don't have a kid. I've never been divorced. Or even married. Though I guess I was once a kid myself, I'm not the product of a divorced couple. I'm not even the product of a married one. Everyone I know who has gotten married or had kids did it before I met them, or stopped hanging out with me almost immediately afterward. Everyone I've ever met who got divorced either did it before I met them, or is someone I stopped hanging out with beforehand. So I don't come to the subject of _Marriage Story_ with a wealth of experience, which means it doesn't exactly scream \"relatable content\" to me.\r\n\r\nLet me start where it's easiest and everyone seems to agree: The performances. Everyone in _Marriage Story_ is pretty great, none of the characterisations changed my life, but I get it. As a chance to display what these actors are capable of in a mundane setting where all that matters is their performance, yes, absolutely, _Marriage Story_ has buckets of success.\r\n\r\nOutside of this though... I'm not even going to say that it \"fails\" elsewhere, just that it didn't win me. I like bleak movies, I like movies that make me feel something, even if it's sad. But _Marriage Story_ isn't really that. It poses you the question of whether both Charlie and Nicole are good or bad people, and shows you each from their own and other's perspective. The ending seems to imply that they're good, or at the very least both good and bad (and aren't we all?) but that really doesn't matter very much when we just spent all this time watching both of them be horrible. I know that's life, that's real, that's people, and blah bl-blah bl-blah, but that's little consolation when I've just spent two-plus hours of my life being not at all compelled by a bunch of people being awful. Being awful convincingly, to the actors' respective credits, but in this setting that is not my idea of a good time at the movies.\r\n\r\n46%\r\n\r\n-Gimly", "created_at": "2020-01-17T06:08:05.825Z"}, {"movie_id": 492188, "review_id": "5e2f2d271685da0011e9cffc", "author_rating": 9.0, "review_text": "“I never really came alive for myself; I was only feeding his aliveness.”\r\n\r\nI’ve said some harsh things about Netflix movies in the past, but recently I’m starting to warm up to them.\r\n\r\n‘Marriage Story’ was absolutely excellent. A devastating portrayal of divorce that can bring out the ugly in people, especially with child custody. But it’s not all doom and gloom. It’s incredibly heartfelt with plenty of humorous moments. I guess you have to find the comedy during the difficulties in life. Lets just say my cheeks wasn’t dry afterwards.\r\n\r\nAnd yes, I wept.\r\n\r\nAdam Driver and Scarlett Johansson both gave masterclass performances. And I do mean some power house acting. Driver plays Charlie, a competitive and undaunted theater director that he is very clear about what he wants. Johansson plays Nicole, a mother who’s a delightful presence and loves to play, but is also a dedicated actor. This is the best I’ve seen from Johnasson. Her character delivers a monologue where she’s explains the issues in her life that’s all shot in one take, which brilliantly displays her acting chops where she naturally shifts from emotion to emotion - it was impeccable.\r\n\r\nThe supporting cast were all fantastic. Lauren Dern, Ray Liotta, Merritt Wever, Julie Hagerty, and Alan Alda were all brilliant and really bounce off the energy from Driver and Johansson. Even the child actor held his own between these juggernauts of actors.\r\n\r\nNot only are the performances the strongest element of the movie, but so is the writing. Every character is so uniquely fleshed out that the conflict feels so incredibly raw. It’s one of the reasons why I was so glued to the movie from start to finish. One of the best screenplays of the year.\r\n\r\nThis is the first Noah Baumbach movie I’ve seen from him and I am aware of his other work, just haven’t got around to watching them. However, I feel like this was the best introduction to him as a director, because he crafted such a sympathetic look on marriage dissolving away. We don’t see the full relationship, but we do get to hear Nicole and Charlie individually describe what their love about each other, while there’s a montage that flash’s through their routine life together with their son. Nothing visually striking in the presentation, but not once did it feel stale.\r\n\r\nThe score from Randy Newman was terrific and fitted wonderfully with the movie. I loved the aspect ratio as it added a lot to the overall mood of the movie. When the two go head to head in the custody battle - that doesn't mean they’re enemies. They still talk to each other as if they are still a thing. It’s also hard to pick aside, because you understand where each of them are coming from, and even if you do choose, you still feel bad for either one.\r\n\r\nOverall rating: Any other relationship movie ain't sh*t compared to this.", "created_at": "2020-01-27T18:34:15.774Z"}, {"movie_id": 492188, "review_id": "5f499be2ce6c4c00359f246a", "author_rating": 8.0, "review_text": "Very well acted and bittersweet for sure, this is a movie that didn't really touch me deeply, mainly because didn't grow up in a split family or ever been married or have kids, so this I'm sure speaks to those with those kind of experiences. Still, can appreciate the performances from both Scarlet Johansson and Adam Driver, proving once more how great actors they are and more than their respective blockbuster franchises. **4.0/5**", "created_at": "2020-08-29T00:05:54.368Z"}, {"movie_id": 492188, "review_id": "5dce1bfbcc277c0017e4401b", "author_rating": 9.0, "review_text": "I wish so badly I could separate the art from the artist, and this is the only reason I cannot give ‘Marriage Story’ the five stars it actually deserves. My own issues with Baumbach aside, however, and it’s shocking to me that a film so simple can be so nearly flawless (I mean this technically too; the film is shot, edited, paced and scored beautifully). Despite how much I cried, it finds beauty and comedy in the tiniest of moments. It’s an ugly portrait of two flawed people and therefore never easy to watch, but it is one of the most rewarding experiences I have had with a film in years. I just hope I never have to experience it myself.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-marriage-story-simply-extraordinary", "created_at": "2019-11-15T03:31:07.449Z"}, {"movie_id": 492188, "review_id": "5deeb495688cd000172077fb", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI don't even know how to start this review… Marriage Story is one of those movies that stays with me long after I've finished it. I've been thinking about it a lot, and it's undoubtedly one of the most realistic dramas I've ever seen. That's due to the award-worthy performances of Adam Driver (Charlie Barber) and Scarlett Johansson (Nicole Barber), but also because of Noah Baumbach's incredibly layered screenplay. In addition to this, Baumbach is undeniably one of the best directors of the year. With the help of his DP, Robbie Ryan, he sets the platform for Driver and Johansson to shine as the astonishing actors that they are.\r\n\r\nSome people watch films to forget their daily issues. Some just want to have fun. Some want to learn more about a particular true story. However, there's not a single person alive who wants to watch a movie and not be able to leave the theater (or, in this case, their couch) entertained. Marriage Story has such an emotionally complicated premise that it's tough to convince people to sit and watch. I mean, who wants to watch a divorce develop throughout more than two hours? Who wants to watch two people who were once in love with each other become the worst of themselves? Yelling, fighting, court, custody, lawyers… It's not exactly an attention-grabber.\r\n\r\nI imagine people who went through the same situation getting triggered and remember a phase of their lives that was probably one of their worst. I'm writing this because I've seen some negativity towards people who simply don't want to watch Baumbach's depiction of a depressing event. It's perfectly understandable if anyone decides to skip this one, especially if it hits too close to home. In my case, I've never gone through a divorce (hopefully, I'll never will), and usually I can \"enjoy\" this type of sad, frustrating, bittersweet films (Manchester by the Sea, A Ghost Story) for what they are, no matter how tragic.\r\n\r\nIf I had to choose one-word praise: realistic. There's no way around it. The palpable emotions are the main reason why this story works so well. Only people who have never been in a relationship of any kind can't understand the moment when a fight starts to escalate, and the couple begins to say terrible stuff at each other that they don't exactly mean. The exaggeration and over-the-top arguments are part of every couple's life. They can occur due to a hundred reasons related to stress, work, accumulation of little things, or simply because it's just not a good day.\r\n\r\nMarriage Story doesn’t deliver a hopeful message or a sweet story because that’s not what divorces are. It’s not difficult to imagine how hard it is to separate yourself from the person you love(d) for years without end, even more when there’s a kid involved in the process. Baumbach could have followed the genre cliches and provide moments of pure happiness, but that’s not something that happens during a situation like this. It’s a heart-wrenching phase to live through, and I believe that this movie is going to be thoroughly analyzed in film school in the next decade or so.\r\n\r\nTHE scene with Driver and Johansson going at each other exponentially harder and heavier criticism-wise is one of the most emotionally powerful dialogues of the millennium. The raw emotion and the physical movements that both actors can bring into the fight are absurdly impressive. Their chemistry is so inexplicably real. I never, not even for a single second, thought that I was watching fictional characters. Nicole and Charlie can very well be our neighbors or part of our family. Baumbach's use of long takes really elevate every single sequence, allowing the protagonists to move around the set and actually act.\r\n\r\nTechnically, there's no better acting this year than what Driver and Johansson deliver. Both are always moving and doing a lot of things while giving their lines. Making dinner, drinking tea, going to the bathroom, chopping a carrot, blowing their nose, standing up, sitting down, walking around the room, crying, smiling, laughing… All of this in a single take! Several times!! Scarlett shows more emotion throughout the runtime than her counterpart, but Adam proves why he's the frontrunner at the 2019's Oscars. His restraint when Charlie is trying to be polite even though he's mad, or his explosive behavior when his character decides to finally let go (excellent build-up), are some of the attributes that make his performance my favorite of the year.\r\n\r\nNot trying to diminish Johansson's display. Both deliver career-best performances, in my opinion. Both deserve every award that exists. The supporting cast is also impeccable, and I know that Laura Dern (Nora Fanshaw) is probably going to be nominated. Still, the two leads are so engaging and captivating that I couldn't be impressed with anyone else. The only person to rise to the main actors' level is Noah Baumbach himself. With the best screenplay of 2019, he offers the audience an incredibly complex story, filled with subtle details and exceptional dialogue.\r\n\r\nHe controls the movie's pacing beautifully, and he knows the right moments to insert a little joke to lighten up the dark, depressing mood. My only issue with the film has to do with its replay value. We all have been through this situation: watching a fantastic movie, only once, and never again. Marriage Story is going to be one of those films for me. I love everything about it, but I know the chances of a rewatch are very, very small. It's a profoundly unsettling story, super uncomfortable at times, and I really don't want to go through the sadness and frustration all over again.\r\n\r\nAll in all, Noah Baumbach delivers what I believe to be its career-best flick, Marriage Story. With the best screenplay of 2019, as well as one the best directions, this is the closest the world is ever going to get to a realistic depiction of a divorce. Scarlett Johansson and Adam Driver also give the best performances of their lives, elevating every single scene, dialogue, argument, or joke. The long takes allow them to shine and actually work as actors, moving around the set and doing domestic/job tasks, while delivering their lines. Technically, both Baumbach and the entire cast are absolutely perfect. It's an extremely emotional narrative, very depressing, sad, and even uncomfortable at times, which might scare some people off, especially if they've been through this. Despite its replay value being affected (a rewatch is very unlikely), it's a phenomenal lesson in storytelling that stays with us long after it's finished. Easily, one of the best movies of 2019. Don't miss it, and try not to cry.\r\n\r\nRating: A", "created_at": "2019-12-09T20:54:45.912Z"}, {"movie_id": 492188, "review_id": "5dfd26409824c80015de1413", "author_rating": 7.0, "review_text": "This movie is a thoroughly humane and sensitive portrayal of the painful process that is \"divorce\". Noah Baumbach, who himself had a divorce with actress Jennifer Jason Leigh, seems to have drawn from his own life experiences for this film. The characters are all balanced and multilayered; the acting of the leads, specially Johansson and Driver, lend a particular personality to their characters. Everyone plays their role to the perfection, even the supporting cast including Laura Dern, Alan Alda, and the criminally underused Merritt Wever. This movie shows how a process as messy as divorce turns two people who love and respect each other into one wishing death on the other. No, they are not bad people , they are just people under \"bad\" circumstances, and Marriage story drives that point home. Overall: a brilliant movie, and a great way to end the year.", "created_at": "2019-12-20T19:51:28.355Z"}, {"movie_id": 492188, "review_id": "5e214f45397df000169797df", "author_rating": 5.0, "review_text": "I don't have a kid. I've never been divorced. Or even married. Though I guess I was once a kid myself, I'm not the product of a divorced couple. I'm not even the product of a married one. Everyone I know who has gotten married or had kids did it before I met them, or stopped hanging out with me almost immediately afterward. Everyone I've ever met who got divorced either did it before I met them, or is someone I stopped hanging out with beforehand. So I don't come to the subject of _Marriage Story_ with a wealth of experience, which means it doesn't exactly scream \"relatable content\" to me.\r\n\r\nLet me start where it's easiest and everyone seems to agree: The performances. Everyone in _Marriage Story_ is pretty great, none of the characterisations changed my life, but I get it. As a chance to display what these actors are capable of in a mundane setting where all that matters is their performance, yes, absolutely, _Marriage Story_ has buckets of success.\r\n\r\nOutside of this though... I'm not even going to say that it \"fails\" elsewhere, just that it didn't win me. I like bleak movies, I like movies that make me feel something, even if it's sad. But _Marriage Story_ isn't really that. It poses you the question of whether both Charlie and Nicole are good or bad people, and shows you each from their own and other's perspective. The ending seems to imply that they're good, or at the very least both good and bad (and aren't we all?) but that really doesn't matter very much when we just spent all this time watching both of them be horrible. I know that's life, that's real, that's people, and blah bl-blah bl-blah, but that's little consolation when I've just spent two-plus hours of my life being not at all compelled by a bunch of people being awful. Being awful convincingly, to the actors' respective credits, but in this setting that is not my idea of a good time at the movies.\r\n\r\n46%\r\n\r\n-Gimly", "created_at": "2020-01-17T06:08:05.825Z"}, {"movie_id": 492188, "review_id": "5e2f2d271685da0011e9cffc", "author_rating": 9.0, "review_text": "“I never really came alive for myself; I was only feeding his aliveness.”\r\n\r\nI’ve said some harsh things about Netflix movies in the past, but recently I’m starting to warm up to them.\r\n\r\n‘Marriage Story’ was absolutely excellent. A devastating portrayal of divorce that can bring out the ugly in people, especially with child custody. But it’s not all doom and gloom. It’s incredibly heartfelt with plenty of humorous moments. I guess you have to find the comedy during the difficulties in life. Lets just say my cheeks wasn’t dry afterwards.\r\n\r\nAnd yes, I wept.\r\n\r\nAdam Driver and Scarlett Johansson both gave masterclass performances. And I do mean some power house acting. Driver plays Charlie, a competitive and undaunted theater director that he is very clear about what he wants. Johansson plays Nicole, a mother who’s a delightful presence and loves to play, but is also a dedicated actor. This is the best I’ve seen from Johnasson. Her character delivers a monologue where she’s explains the issues in her life that’s all shot in one take, which brilliantly displays her acting chops where she naturally shifts from emotion to emotion - it was impeccable.\r\n\r\nThe supporting cast were all fantastic. Lauren Dern, Ray Liotta, Merritt Wever, Julie Hagerty, and Alan Alda were all brilliant and really bounce off the energy from Driver and Johansson. Even the child actor held his own between these juggernauts of actors.\r\n\r\nNot only are the performances the strongest element of the movie, but so is the writing. Every character is so uniquely fleshed out that the conflict feels so incredibly raw. It’s one of the reasons why I was so glued to the movie from start to finish. One of the best screenplays of the year.\r\n\r\nThis is the first Noah Baumbach movie I’ve seen from him and I am aware of his other work, just haven’t got around to watching them. However, I feel like this was the best introduction to him as a director, because he crafted such a sympathetic look on marriage dissolving away. We don’t see the full relationship, but we do get to hear Nicole and Charlie individually describe what their love about each other, while there’s a montage that flash’s through their routine life together with their son. Nothing visually striking in the presentation, but not once did it feel stale.\r\n\r\nThe score from Randy Newman was terrific and fitted wonderfully with the movie. I loved the aspect ratio as it added a lot to the overall mood of the movie. When the two go head to head in the custody battle - that doesn't mean they’re enemies. They still talk to each other as if they are still a thing. It’s also hard to pick aside, because you understand where each of them are coming from, and even if you do choose, you still feel bad for either one.\r\n\r\nOverall rating: Any other relationship movie ain't sh*t compared to this.", "created_at": "2020-01-27T18:34:15.774Z"}, {"movie_id": 492188, "review_id": "5f499be2ce6c4c00359f246a", "author_rating": 8.0, "review_text": "Very well acted and bittersweet for sure, this is a movie that didn't really touch me deeply, mainly because didn't grow up in a split family or ever been married or have kids, so this I'm sure speaks to those with those kind of experiences. Still, can appreciate the performances from both Scarlet Johansson and Adam Driver, proving once more how great actors they are and more than their respective blockbuster franchises. **4.0/5**", "created_at": "2020-08-29T00:05:54.368Z"}, {"movie_id": 492188, "review_id": "5dce1bfbcc277c0017e4401b", "author_rating": 9.0, "review_text": "I wish so badly I could separate the art from the artist, and this is the only reason I cannot give ‘Marriage Story’ the five stars it actually deserves. My own issues with Baumbach aside, however, and it’s shocking to me that a film so simple can be so nearly flawless (I mean this technically too; the film is shot, edited, paced and scored beautifully). Despite how much I cried, it finds beauty and comedy in the tiniest of moments. It’s an ugly portrait of two flawed people and therefore never easy to watch, but it is one of the most rewarding experiences I have had with a film in years. I just hope I never have to experience it myself.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-marriage-story-simply-extraordinary", "created_at": "2019-11-15T03:31:07.449Z"}, {"movie_id": 492188, "review_id": "5deeb495688cd000172077fb", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI don't even know how to start this review… Marriage Story is one of those movies that stays with me long after I've finished it. I've been thinking about it a lot, and it's undoubtedly one of the most realistic dramas I've ever seen. That's due to the award-worthy performances of Adam Driver (Charlie Barber) and Scarlett Johansson (Nicole Barber), but also because of Noah Baumbach's incredibly layered screenplay. In addition to this, Baumbach is undeniably one of the best directors of the year. With the help of his DP, Robbie Ryan, he sets the platform for Driver and Johansson to shine as the astonishing actors that they are.\r\n\r\nSome people watch films to forget their daily issues. Some just want to have fun. Some want to learn more about a particular true story. However, there's not a single person alive who wants to watch a movie and not be able to leave the theater (or, in this case, their couch) entertained. Marriage Story has such an emotionally complicated premise that it's tough to convince people to sit and watch. I mean, who wants to watch a divorce develop throughout more than two hours? Who wants to watch two people who were once in love with each other become the worst of themselves? Yelling, fighting, court, custody, lawyers… It's not exactly an attention-grabber.\r\n\r\nI imagine people who went through the same situation getting triggered and remember a phase of their lives that was probably one of their worst. I'm writing this because I've seen some negativity towards people who simply don't want to watch Baumbach's depiction of a depressing event. It's perfectly understandable if anyone decides to skip this one, especially if it hits too close to home. In my case, I've never gone through a divorce (hopefully, I'll never will), and usually I can \"enjoy\" this type of sad, frustrating, bittersweet films (Manchester by the Sea, A Ghost Story) for what they are, no matter how tragic.\r\n\r\nIf I had to choose one-word praise: realistic. There's no way around it. The palpable emotions are the main reason why this story works so well. Only people who have never been in a relationship of any kind can't understand the moment when a fight starts to escalate, and the couple begins to say terrible stuff at each other that they don't exactly mean. The exaggeration and over-the-top arguments are part of every couple's life. They can occur due to a hundred reasons related to stress, work, accumulation of little things, or simply because it's just not a good day.\r\n\r\nMarriage Story doesn’t deliver a hopeful message or a sweet story because that’s not what divorces are. It’s not difficult to imagine how hard it is to separate yourself from the person you love(d) for years without end, even more when there’s a kid involved in the process. Baumbach could have followed the genre cliches and provide moments of pure happiness, but that’s not something that happens during a situation like this. It’s a heart-wrenching phase to live through, and I believe that this movie is going to be thoroughly analyzed in film school in the next decade or so.\r\n\r\nTHE scene with Driver and Johansson going at each other exponentially harder and heavier criticism-wise is one of the most emotionally powerful dialogues of the millennium. The raw emotion and the physical movements that both actors can bring into the fight are absurdly impressive. Their chemistry is so inexplicably real. I never, not even for a single second, thought that I was watching fictional characters. Nicole and Charlie can very well be our neighbors or part of our family. Baumbach's use of long takes really elevate every single sequence, allowing the protagonists to move around the set and actually act.\r\n\r\nTechnically, there's no better acting this year than what Driver and Johansson deliver. Both are always moving and doing a lot of things while giving their lines. Making dinner, drinking tea, going to the bathroom, chopping a carrot, blowing their nose, standing up, sitting down, walking around the room, crying, smiling, laughing… All of this in a single take! Several times!! Scarlett shows more emotion throughout the runtime than her counterpart, but Adam proves why he's the frontrunner at the 2019's Oscars. His restraint when Charlie is trying to be polite even though he's mad, or his explosive behavior when his character decides to finally let go (excellent build-up), are some of the attributes that make his performance my favorite of the year.\r\n\r\nNot trying to diminish Johansson's display. Both deliver career-best performances, in my opinion. Both deserve every award that exists. The supporting cast is also impeccable, and I know that Laura Dern (Nora Fanshaw) is probably going to be nominated. Still, the two leads are so engaging and captivating that I couldn't be impressed with anyone else. The only person to rise to the main actors' level is Noah Baumbach himself. With the best screenplay of 2019, he offers the audience an incredibly complex story, filled with subtle details and exceptional dialogue.\r\n\r\nHe controls the movie's pacing beautifully, and he knows the right moments to insert a little joke to lighten up the dark, depressing mood. My only issue with the film has to do with its replay value. We all have been through this situation: watching a fantastic movie, only once, and never again. Marriage Story is going to be one of those films for me. I love everything about it, but I know the chances of a rewatch are very, very small. It's a profoundly unsettling story, super uncomfortable at times, and I really don't want to go through the sadness and frustration all over again.\r\n\r\nAll in all, Noah Baumbach delivers what I believe to be its career-best flick, Marriage Story. With the best screenplay of 2019, as well as one the best directions, this is the closest the world is ever going to get to a realistic depiction of a divorce. Scarlett Johansson and Adam Driver also give the best performances of their lives, elevating every single scene, dialogue, argument, or joke. The long takes allow them to shine and actually work as actors, moving around the set and doing domestic/job tasks, while delivering their lines. Technically, both Baumbach and the entire cast are absolutely perfect. It's an extremely emotional narrative, very depressing, sad, and even uncomfortable at times, which might scare some people off, especially if they've been through this. Despite its replay value being affected (a rewatch is very unlikely), it's a phenomenal lesson in storytelling that stays with us long after it's finished. Easily, one of the best movies of 2019. Don't miss it, and try not to cry.\r\n\r\nRating: A", "created_at": "2019-12-09T20:54:45.912Z"}, {"movie_id": 492188, "review_id": "5dfd26409824c80015de1413", "author_rating": 7.0, "review_text": "This movie is a thoroughly humane and sensitive portrayal of the painful process that is \"divorce\". Noah Baumbach, who himself had a divorce with actress Jennifer Jason Leigh, seems to have drawn from his own life experiences for this film. The characters are all balanced and multilayered; the acting of the leads, specially Johansson and Driver, lend a particular personality to their characters. Everyone plays their role to the perfection, even the supporting cast including Laura Dern, Alan Alda, and the criminally underused Merritt Wever. This movie shows how a process as messy as divorce turns two people who love and respect each other into one wishing death on the other. No, they are not bad people , they are just people under \"bad\" circumstances, and Marriage story drives that point home. Overall: a brilliant movie, and a great way to end the year.", "created_at": "2019-12-20T19:51:28.355Z"}, {"movie_id": 492188, "review_id": "5e214f45397df000169797df", "author_rating": 5.0, "review_text": "I don't have a kid. I've never been divorced. Or even married. Though I guess I was once a kid myself, I'm not the product of a divorced couple. I'm not even the product of a married one. Everyone I know who has gotten married or had kids did it before I met them, or stopped hanging out with me almost immediately afterward. Everyone I've ever met who got divorced either did it before I met them, or is someone I stopped hanging out with beforehand. So I don't come to the subject of _Marriage Story_ with a wealth of experience, which means it doesn't exactly scream \"relatable content\" to me.\r\n\r\nLet me start where it's easiest and everyone seems to agree: The performances. Everyone in _Marriage Story_ is pretty great, none of the characterisations changed my life, but I get it. As a chance to display what these actors are capable of in a mundane setting where all that matters is their performance, yes, absolutely, _Marriage Story_ has buckets of success.\r\n\r\nOutside of this though... I'm not even going to say that it \"fails\" elsewhere, just that it didn't win me. I like bleak movies, I like movies that make me feel something, even if it's sad. But _Marriage Story_ isn't really that. It poses you the question of whether both Charlie and Nicole are good or bad people, and shows you each from their own and other's perspective. The ending seems to imply that they're good, or at the very least both good and bad (and aren't we all?) but that really doesn't matter very much when we just spent all this time watching both of them be horrible. I know that's life, that's real, that's people, and blah bl-blah bl-blah, but that's little consolation when I've just spent two-plus hours of my life being not at all compelled by a bunch of people being awful. Being awful convincingly, to the actors' respective credits, but in this setting that is not my idea of a good time at the movies.\r\n\r\n46%\r\n\r\n-Gimly", "created_at": "2020-01-17T06:08:05.825Z"}, {"movie_id": 492188, "review_id": "5e2f2d271685da0011e9cffc", "author_rating": 9.0, "review_text": "“I never really came alive for myself; I was only feeding his aliveness.”\r\n\r\nI’ve said some harsh things about Netflix movies in the past, but recently I’m starting to warm up to them.\r\n\r\n‘Marriage Story’ was absolutely excellent. A devastating portrayal of divorce that can bring out the ugly in people, especially with child custody. But it’s not all doom and gloom. It’s incredibly heartfelt with plenty of humorous moments. I guess you have to find the comedy during the difficulties in life. Lets just say my cheeks wasn’t dry afterwards.\r\n\r\nAnd yes, I wept.\r\n\r\nAdam Driver and Scarlett Johansson both gave masterclass performances. And I do mean some power house acting. Driver plays Charlie, a competitive and undaunted theater director that he is very clear about what he wants. Johansson plays Nicole, a mother who’s a delightful presence and loves to play, but is also a dedicated actor. This is the best I’ve seen from Johnasson. Her character delivers a monologue where she’s explains the issues in her life that’s all shot in one take, which brilliantly displays her acting chops where she naturally shifts from emotion to emotion - it was impeccable.\r\n\r\nThe supporting cast were all fantastic. Lauren Dern, Ray Liotta, Merritt Wever, Julie Hagerty, and Alan Alda were all brilliant and really bounce off the energy from Driver and Johansson. Even the child actor held his own between these juggernauts of actors.\r\n\r\nNot only are the performances the strongest element of the movie, but so is the writing. Every character is so uniquely fleshed out that the conflict feels so incredibly raw. It’s one of the reasons why I was so glued to the movie from start to finish. One of the best screenplays of the year.\r\n\r\nThis is the first Noah Baumbach movie I’ve seen from him and I am aware of his other work, just haven’t got around to watching them. However, I feel like this was the best introduction to him as a director, because he crafted such a sympathetic look on marriage dissolving away. We don’t see the full relationship, but we do get to hear Nicole and Charlie individually describe what their love about each other, while there’s a montage that flash’s through their routine life together with their son. Nothing visually striking in the presentation, but not once did it feel stale.\r\n\r\nThe score from Randy Newman was terrific and fitted wonderfully with the movie. I loved the aspect ratio as it added a lot to the overall mood of the movie. When the two go head to head in the custody battle - that doesn't mean they’re enemies. They still talk to each other as if they are still a thing. It’s also hard to pick aside, because you understand where each of them are coming from, and even if you do choose, you still feel bad for either one.\r\n\r\nOverall rating: Any other relationship movie ain't sh*t compared to this.", "created_at": "2020-01-27T18:34:15.774Z"}, {"movie_id": 492188, "review_id": "5f499be2ce6c4c00359f246a", "author_rating": 8.0, "review_text": "Very well acted and bittersweet for sure, this is a movie that didn't really touch me deeply, mainly because didn't grow up in a split family or ever been married or have kids, so this I'm sure speaks to those with those kind of experiences. Still, can appreciate the performances from both Scarlet Johansson and Adam Driver, proving once more how great actors they are and more than their respective blockbuster franchises. **4.0/5**", "created_at": "2020-08-29T00:05:54.368Z"}]