[{"movie_id": 9792, "review_id": "5bd29e980e0a2616e80053a7", "author_rating": 8.0, "review_text": "One of the best horror remakes to come out in this most recent trend. Rather than ignoring its source material, or taking the other extreme of drearily rehashing it scene for scene, Aja and Levasseur's _The Hills Have Eyes_ simply expands and improves upon the original.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2018-10-26T04:56:56.300Z"}, {"movie_id": 9792, "review_id": "6260d3d2322b2b00a106363e", "author_rating": 6.0, "review_text": "Aside from some pretty significant plausibility issues, this is actually quite a decent shock horror. A family stop off at gas station where the elderly attendant tells them of a dirt track shortcut across the desert that will save them a few hours. Towing their caravan, off they go, but when a puncture causes them to lose control and crash into a big rock, they begin to realise that they are not the only folks nearby - and I use the term \"folks\" loosely. What now follows sees our travellers terrorised by some hideously mutated people who had been left there ever since the US Government carried out nuclear tests. Reduced to just 3, \"Big Bob\" (Ted Levine) and his faithful hound have to track down his kidnapped baby grandchild - a perilous journey indeed. Now quite why they decided to take the shortcut is just one of a few dodgy decision taken by the \"Carter\" family that made me wonder, and rendered the plot increasingly silly as we progress to an ending that seems to drag on a bit too long. That said, there are plenty of jump moments and Alexandre Aja manages to keep the annoyingly screaming hysteria to a minimum. Once it eventually gets going, it becomes decently paced and the photography is tightly cut to maximise the impact of some pretty gruesome scenarios (and prosthetics!). Though not as gritty as the 1977 original, I think it's still just as good.", "created_at": "2022-04-21T03:47:30.201Z"}]