[{"movie_id": 278924, "review_id": "57c3994b925141532a002173", "author_rating": null, "review_text": "British badass Jason Statham is back and doing what he does best: kicking butt and taking targeted names in the process. The veteran action star is out for more blood in the labored sequel **Mechanic: Resurrection**. The trouble, however, is that fist-swinging wrecking ball Statham’s taste for boisterous blood in his latest toothless and meandering globe-trotting caper may be in desperate need of a transfusion. Woefully repetitive, aimless, strained and riddled with formulaic sharp-shooting shenanigans, **Mechanic: Resurrection** is yet another bombastic Bond knock-off that synthetically strut its stuff in stunt-driven oblivion. The majority of Statham fans may find this latest installment of **Mechanic** worth tinkering with due to its kinetic action-pack parts in motion with its stylish bald-headed anti-hero at the helm of voyeuristic mayhem. Still, for others the excitable human bullet factor routine that the aging Statham has perfected in his past furious film exploits (read: “The Transporter” film series in particular) is getting long in the tooth as **Mechanic: Resurrection** is yet another familiar and feisty vehicle that the punishing tough guy has predictably driven before.\r\n\r\n**Resurrection** is the follow-up to the 2011 blueprint _The Mechanic_ where Statham portrayed a stone-faced iron man “gun-for-hire” whose mission is to travel the world while eradicating high-profiled baddies–a specialty that he mechanically and skillfully carries out with polished precision. Naturally Statham’s charged take as the combative assassin is based upon the 1972 flick _The Mechanic_ featuring the late great gravel-faced action icon Charles Bronson who was no stranger to vigilante-style cinema.  Statham’s “take-no-prisoners” approach as the hardened terminator Arthur Bishop is definitely inspired when the English acrobatic avenger is summoned to brandish exotic weaponry, engage in calculating yet cockeyed ways to utilize boobytraps to exterminate his assigned targets and find time to occasionally court the hot chicks that dig his masculine, mischievous charm. No doubt that Statham’s blue-collar Bishop tries to echo the eye-popping sentiments of the aforementioned Bond’s debonair endeavors in intrigue, over-the-top villains, lavish locales and luscious ladies. As for watching the five decade-old adventurous James Bond it feels like an excitable surreal vacation laced with imaginative dare and danger. In witnessing Statham’s stiffened and procedural Arthur Bishop it seems somewhat like an assigned chore in chronicling the gadget-loving gumption of this action-oriented covert clone.\r\n\r\nSure, **Mechanic: Resurrection** derives its occasional chilly appeal from the scenic locations that allows the athletic Bishop to bounce around the globe on an elaborated whim. Plus, some may get an aesthetic rise out of the choreographed in-your-face confrontational fights and showy staged daredevil stunts that feature Bishop’s physical prowess. This is all well and good but the dubious dalliances and action-oriented swaggering that is demonstrated by Statham’s bone-crushing Bishop is rather uneventful and recycled. Unfortunately, **Resurrection** refuses to allow Statham any flexible growth or depth to differentiate his caustic characterization or the high-wire dilemmas beyond the previous antics regurgitated from his earlier copycat fare as _Crank_, _The Bank Job_ and yes…the obvious mention of _The Transporter_ series.\r\n\r\nHit man Arthur Bishop is basking in the scenic Rio de Janeiro  surroundings in hopes of drowning out his deadly duties from yesteryear. Soon, Bishop’s wake-up call to resume his treacherous trade in taking out toxic targets is encouraged by his archenemy in warped businessman Riah Crain (Sam Hazeldine). Specifically, Crain wants Bishop to assassinate three persons of interest in particular that has him roaming three different continents. Bishop is not too receptive to getting back in “the grusome game” but of course the crooked Crain has a twisted way of convincing him otherwise. The critical key to changing a reluctant Bishop’s mind was to hit him where is heart hurts…that is, abduct his gorgeous girlfriend Gina (Jessica Alba from “Sin City”).\r\n\r\nHolding Gina captive clearly gives Crain the upper hand to urge the beleaguered Bishop to return to the fatalistic fold of his poisonous profession–wiping out the assigned undesirables while making it look like accidental incidents. Thus, Bishop puts on his traveling shoes as he hunts down an imprisoned African warlord, an Australian human trafficker and finally a Bulgaria-based arms dealer Max Adams (Oscar winner Tommy Lee Jones). If and when Bishop delivers his three kills for the ruthless Crain then Gina’s release is assured. It is a no-brainer that Bishop wants to ensure the safety of the exotic beauty Gina.\r\n\r\nAlba’s Gina is not the only lovely lady that is attached to Bishop’s hip affectionately. In Thailand, Bishop manages to catch up with another cute bombshell in buddy Mei (martial arts goddess Michelle Yeoh wasted in a transparent role), an innkeeper that worries about her friend’s worldly welfare. Curiously, German director Dennis Gansel’s decision not to give the desirable ageless Asian actress anything to do constructive in this by-the-numbers actioner besides providing sideline concern for Statham’s Bishop is inexcusable. Why not play to Yeoh’s cinematic strengths as a karate-kicking cutie pie with a deadly disposition…you know, what movie audiences have come to expect and cherish about the beautiful Malaysian performer’s film-related credibility? The 1997 Bond film _Tomorrow Never Dies_ effectively used the curvaceous Yeoh to compliment Pierce Brosnan’s Agent 007 so Gansel could not oblige her more on-screen activity with the robotic Statham?\r\n\r\nOf course any Statham-oriented movie would not be complete without the arbitrary display of colorful explosions, glorified chases, exaggerated gunplay and a no-nonsense Bishop predictably flexing his acrobatic leaping, climbing, swimming and fighting muscles as if he was participating in his own self-indulgent Olympic games. There is no real rhyme or reason behind Mechanic: Resurrection other than to revisit the nostalgic relevance of Statham’s left-over box office heft from yesteryear. Perhaps the proven off-kilter spark that Statham generated in the Melissa McCarthy well-received espionage laugher _Spy_ could have been injected in this gimmicky and pointless pot-boiler that has all the succulent juices of a dried-up meatloaf. All the challenging stunt work and exquisite locations cannot excuse the lack of lubrication that Mechanic desires in its insipid, loud execution.\r\n\r\nThere is not much to chew on the bone concerning the so-called return of Statham’s harried hit man that constitutes round two of another dazzling but dense **Mechanic** offering. Alba’s distressed diva is nothing more than stand-by eye candy and the convenient motivating factor for Statham’s/Bishop’s worldwide witch-hunt. Hazeldine’s Crain barely passes muster as a second-rate Bond villain left on the cutting room floor. Jones, who has played wacky villains in the past, merely going through the tiresome motions as pseudo-flashy Max Adams with off-the-cuff irreverence.\r\n\r\nPerhaps Arthur Bishop’s glossy gadgets could prevent an unwelcoming third edition of another **Mechanic** entry from blasting away in boorish fashion?\r\n\r\n**Mechanic: Resurrection** (2016)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 50 mins.\r\n\r\nStarring: Jason Statham, Jessica Alba, Tommy Lee Jones, Sam Hazeldine, Michelle Yeoh, Natalie Burn, Yayaying Rhatha Phongam\r\n\r\nDirected by: Dennis Gansel\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Action and Adventure/Suspense Thriller/International Crime Drama\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-29T02:09:15.227Z"}, {"movie_id": 278924, "review_id": "584467c5925141676400c697", "author_rating": 6.0, "review_text": "**Falling in love is a trap, but some men risk everything for it.**\r\n\r\nThis is an unexpected sequel. Actually, I was looking for other sequels from Statham's filmography, particularly the third 'Crank'. I think the idea of going for it was good and the film was not that bad, if your purpose of a watch is time pass. The story was so bad, but the filmmaking was excellent. Because it was made by a renowned German director. Only if he had got a better script, the outcome would have been different. So it's the actors and the director makes it watchable. Other than that, this film falls into the average category.\r\n\r\nThe story follows after Arthur Bishop was found living in Brasil by some people who know him. Then he narrowly escapes from there and lands in Southeast Asia, where he meets Gina, a woman struggling from domestic violence. But he soon discovers that's a setup. After she was taken captive by an international criminal, now he has to follow his instruction to set her free. So the action begins where he takes a series of missions across the globe and how it all ends follows in the rest of the narration,\r\n\r\nIt's good to see Jason Statham back to his signature role. This is what he's good at. Even if the story is not good, that's okay, because Statham's presence is a very comfortable to watch without any trouble. Jessica Alba as well, I haven't seen her in any major hit film at the recent time. Even though the film was received below average, it kind of puts them both back on the track.\r\n\r\nDefinitely they both needed this breakthrough. There's a third film is coming, it's not official yet, but the conclusion was a hint where Tommy Lee Jones can be seen in an important role in the next part. You won't like this film, but surely enjoy it if you are a Statham's fan, that's the only reason to go for it.\r\n\r\n_6/10_", "created_at": "2016-12-04T19:00:21.414Z"}, {"movie_id": 278924, "review_id": "591ee0469251414ab1030e5d", "author_rating": 6.0, "review_text": "A sequel that no one asked for, the first one was alright but didn't even stand out by Statham standards. The sequel isn't quite as 'alright', a bit sloppily put together and not very well thought of but if you liked the original and Statham in general it's still watchable.\r\n\r\n5.5/10", "created_at": "2017-05-19T12:08:38.576Z"}, {"movie_id": 278924, "review_id": "5f0b9b0155bc35003329dba5", "author_rating": 7.0, "review_text": "Improves upon the first film, which is a rather impressive feat.\r\n\r\nI felt thoroughly entertained throughout this. I do like Jason Statham films admittedly, sure he plays very similar roles each time but I find myself enjoying the vast majority of his work. <em>'Mechanic: Resurrection'</em> is no different.\r\n\r\nStatham is excellent as he reprises Bishop. I rate his performance, just like in <em>'The Mechanic'</em>. I find what Bishop encounters in this film much more riveting than what happens in the 2011 production, it's class watching him go piece by piece; even if you have a fair idea what's going to happen.\r\n\r\nThe aforementioned lead is notably joined by Tommy Lee Jones (Adams), Jessica Alba (Gina) and Michelle Yeoh (Mei). The latter two are unfortunately pretty basic characters, but Jones is very good in his role - I love the look and behaviour of Adams, entirely thanks to the actor himself. Sam Hazeldine (Crain) isn't a great villain, mind... kinda dull in fact.\r\n\r\nI always enjoy seeing films travel the world, as this visits numerous countries including Brazil, Malaysia, Australia and Bulgaria - it allows the story to feel global, as opposed to being limited to a random American state. I like the music, also.\r\n\r\nThis beats its predecessor, which I did enjoy by the way. I'm not saying it is anything incredible, or even one of Statham's best, but all I can state is that I had a fun time.", "created_at": "2020-07-12T23:21:37.933Z"}, {"movie_id": 278924, "review_id": "57c3994b925141532a002173", "author_rating": null, "review_text": "British badass Jason Statham is back and doing what he does best: kicking butt and taking targeted names in the process. The veteran action star is out for more blood in the labored sequel **Mechanic: Resurrection**. The trouble, however, is that fist-swinging wrecking ball Statham’s taste for boisterous blood in his latest toothless and meandering globe-trotting caper may be in desperate need of a transfusion. Woefully repetitive, aimless, strained and riddled with formulaic sharp-shooting shenanigans, **Mechanic: Resurrection** is yet another bombastic Bond knock-off that synthetically strut its stuff in stunt-driven oblivion. The majority of Statham fans may find this latest installment of **Mechanic** worth tinkering with due to its kinetic action-pack parts in motion with its stylish bald-headed anti-hero at the helm of voyeuristic mayhem. Still, for others the excitable human bullet factor routine that the aging Statham has perfected in his past furious film exploits (read: “The Transporter” film series in particular) is getting long in the tooth as **Mechanic: Resurrection** is yet another familiar and feisty vehicle that the punishing tough guy has predictably driven before.\r\n\r\n**Resurrection** is the follow-up to the 2011 blueprint _The Mechanic_ where Statham portrayed a stone-faced iron man “gun-for-hire” whose mission is to travel the world while eradicating high-profiled baddies–a specialty that he mechanically and skillfully carries out with polished precision. Naturally Statham’s charged take as the combative assassin is based upon the 1972 flick _The Mechanic_ featuring the late great gravel-faced action icon Charles Bronson who was no stranger to vigilante-style cinema.  Statham’s “take-no-prisoners” approach as the hardened terminator Arthur Bishop is definitely inspired when the English acrobatic avenger is summoned to brandish exotic weaponry, engage in calculating yet cockeyed ways to utilize boobytraps to exterminate his assigned targets and find time to occasionally court the hot chicks that dig his masculine, mischievous charm. No doubt that Statham’s blue-collar Bishop tries to echo the eye-popping sentiments of the aforementioned Bond’s debonair endeavors in intrigue, over-the-top villains, lavish locales and luscious ladies. As for watching the five decade-old adventurous James Bond it feels like an excitable surreal vacation laced with imaginative dare and danger. In witnessing Statham’s stiffened and procedural Arthur Bishop it seems somewhat like an assigned chore in chronicling the gadget-loving gumption of this action-oriented covert clone.\r\n\r\nSure, **Mechanic: Resurrection** derives its occasional chilly appeal from the scenic locations that allows the athletic Bishop to bounce around the globe on an elaborated whim. Plus, some may get an aesthetic rise out of the choreographed in-your-face confrontational fights and showy staged daredevil stunts that feature Bishop’s physical prowess. This is all well and good but the dubious dalliances and action-oriented swaggering that is demonstrated by Statham’s bone-crushing Bishop is rather uneventful and recycled. Unfortunately, **Resurrection** refuses to allow Statham any flexible growth or depth to differentiate his caustic characterization or the high-wire dilemmas beyond the previous antics regurgitated from his earlier copycat fare as _Crank_, _The Bank Job_ and yes…the obvious mention of _The Transporter_ series.\r\n\r\nHit man Arthur Bishop is basking in the scenic Rio de Janeiro  surroundings in hopes of drowning out his deadly duties from yesteryear. Soon, Bishop’s wake-up call to resume his treacherous trade in taking out toxic targets is encouraged by his archenemy in warped businessman Riah Crain (Sam Hazeldine). Specifically, Crain wants Bishop to assassinate three persons of interest in particular that has him roaming three different continents. Bishop is not too receptive to getting back in “the grusome game” but of course the crooked Crain has a twisted way of convincing him otherwise. The critical key to changing a reluctant Bishop’s mind was to hit him where is heart hurts…that is, abduct his gorgeous girlfriend Gina (Jessica Alba from “Sin City”).\r\n\r\nHolding Gina captive clearly gives Crain the upper hand to urge the beleaguered Bishop to return to the fatalistic fold of his poisonous profession–wiping out the assigned undesirables while making it look like accidental incidents. Thus, Bishop puts on his traveling shoes as he hunts down an imprisoned African warlord, an Australian human trafficker and finally a Bulgaria-based arms dealer Max Adams (Oscar winner Tommy Lee Jones). If and when Bishop delivers his three kills for the ruthless Crain then Gina’s release is assured. It is a no-brainer that Bishop wants to ensure the safety of the exotic beauty Gina.\r\n\r\nAlba’s Gina is not the only lovely lady that is attached to Bishop’s hip affectionately. In Thailand, Bishop manages to catch up with another cute bombshell in buddy Mei (martial arts goddess Michelle Yeoh wasted in a transparent role), an innkeeper that worries about her friend’s worldly welfare. Curiously, German director Dennis Gansel’s decision not to give the desirable ageless Asian actress anything to do constructive in this by-the-numbers actioner besides providing sideline concern for Statham’s Bishop is inexcusable. Why not play to Yeoh’s cinematic strengths as a karate-kicking cutie pie with a deadly disposition…you know, what movie audiences have come to expect and cherish about the beautiful Malaysian performer’s film-related credibility? The 1997 Bond film _Tomorrow Never Dies_ effectively used the curvaceous Yeoh to compliment Pierce Brosnan’s Agent 007 so Gansel could not oblige her more on-screen activity with the robotic Statham?\r\n\r\nOf course any Statham-oriented movie would not be complete without the arbitrary display of colorful explosions, glorified chases, exaggerated gunplay and a no-nonsense Bishop predictably flexing his acrobatic leaping, climbing, swimming and fighting muscles as if he was participating in his own self-indulgent Olympic games. There is no real rhyme or reason behind Mechanic: Resurrection other than to revisit the nostalgic relevance of Statham’s left-over box office heft from yesteryear. Perhaps the proven off-kilter spark that Statham generated in the Melissa McCarthy well-received espionage laugher _Spy_ could have been injected in this gimmicky and pointless pot-boiler that has all the succulent juices of a dried-up meatloaf. All the challenging stunt work and exquisite locations cannot excuse the lack of lubrication that Mechanic desires in its insipid, loud execution.\r\n\r\nThere is not much to chew on the bone concerning the so-called return of Statham’s harried hit man that constitutes round two of another dazzling but dense **Mechanic** offering. Alba’s distressed diva is nothing more than stand-by eye candy and the convenient motivating factor for Statham’s/Bishop’s worldwide witch-hunt. Hazeldine’s Crain barely passes muster as a second-rate Bond villain left on the cutting room floor. Jones, who has played wacky villains in the past, merely going through the tiresome motions as pseudo-flashy Max Adams with off-the-cuff irreverence.\r\n\r\nPerhaps Arthur Bishop’s glossy gadgets could prevent an unwelcoming third edition of another **Mechanic** entry from blasting away in boorish fashion?\r\n\r\n**Mechanic: Resurrection** (2016)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 50 mins.\r\n\r\nStarring: Jason Statham, Jessica Alba, Tommy Lee Jones, Sam Hazeldine, Michelle Yeoh, Natalie Burn, Yayaying Rhatha Phongam\r\n\r\nDirected by: Dennis Gansel\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Action and Adventure/Suspense Thriller/International Crime Drama\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-29T02:09:15.227Z"}, {"movie_id": 278924, "review_id": "584467c5925141676400c697", "author_rating": 6.0, "review_text": "**Falling in love is a trap, but some men risk everything for it.**\r\n\r\nThis is an unexpected sequel. Actually, I was looking for other sequels from Statham's filmography, particularly the third 'Crank'. I think the idea of going for it was good and the film was not that bad, if your purpose of a watch is time pass. The story was so bad, but the filmmaking was excellent. Because it was made by a renowned German director. Only if he had got a better script, the outcome would have been different. So it's the actors and the director makes it watchable. Other than that, this film falls into the average category.\r\n\r\nThe story follows after Arthur Bishop was found living in Brasil by some people who know him. Then he narrowly escapes from there and lands in Southeast Asia, where he meets Gina, a woman struggling from domestic violence. But he soon discovers that's a setup. After she was taken captive by an international criminal, now he has to follow his instruction to set her free. So the action begins where he takes a series of missions across the globe and how it all ends follows in the rest of the narration,\r\n\r\nIt's good to see Jason Statham back to his signature role. This is what he's good at. Even if the story is not good, that's okay, because Statham's presence is a very comfortable to watch without any trouble. Jessica Alba as well, I haven't seen her in any major hit film at the recent time. Even though the film was received below average, it kind of puts them both back on the track.\r\n\r\nDefinitely they both needed this breakthrough. There's a third film is coming, it's not official yet, but the conclusion was a hint where Tommy Lee Jones can be seen in an important role in the next part. You won't like this film, but surely enjoy it if you are a Statham's fan, that's the only reason to go for it.\r\n\r\n_6/10_", "created_at": "2016-12-04T19:00:21.414Z"}, {"movie_id": 278924, "review_id": "591ee0469251414ab1030e5d", "author_rating": 6.0, "review_text": "A sequel that no one asked for, the first one was alright but didn't even stand out by Statham standards. The sequel isn't quite as 'alright', a bit sloppily put together and not very well thought of but if you liked the original and Statham in general it's still watchable.\r\n\r\n5.5/10", "created_at": "2017-05-19T12:08:38.576Z"}, {"movie_id": 278924, "review_id": "5f0b9b0155bc35003329dba5", "author_rating": 7.0, "review_text": "Improves upon the first film, which is a rather impressive feat.\r\n\r\nI felt thoroughly entertained throughout this. I do like Jason Statham films admittedly, sure he plays very similar roles each time but I find myself enjoying the vast majority of his work. <em>'Mechanic: Resurrection'</em> is no different.\r\n\r\nStatham is excellent as he reprises Bishop. I rate his performance, just like in <em>'The Mechanic'</em>. I find what Bishop encounters in this film much more riveting than what happens in the 2011 production, it's class watching him go piece by piece; even if you have a fair idea what's going to happen.\r\n\r\nThe aforementioned lead is notably joined by Tommy Lee Jones (Adams), Jessica Alba (Gina) and Michelle Yeoh (Mei). The latter two are unfortunately pretty basic characters, but Jones is very good in his role - I love the look and behaviour of Adams, entirely thanks to the actor himself. Sam Hazeldine (Crain) isn't a great villain, mind... kinda dull in fact.\r\n\r\nI always enjoy seeing films travel the world, as this visits numerous countries including Brazil, Malaysia, Australia and Bulgaria - it allows the story to feel global, as opposed to being limited to a random American state. I like the music, also.\r\n\r\nThis beats its predecessor, which I did enjoy by the way. I'm not saying it is anything incredible, or even one of Statham's best, but all I can state is that I had a fun time.", "created_at": "2020-07-12T23:21:37.933Z"}, {"movie_id": 278924, "review_id": "57c3994b925141532a002173", "author_rating": null, "review_text": "British badass Jason Statham is back and doing what he does best: kicking butt and taking targeted names in the process. The veteran action star is out for more blood in the labored sequel **Mechanic: Resurrection**. The trouble, however, is that fist-swinging wrecking ball Statham’s taste for boisterous blood in his latest toothless and meandering globe-trotting caper may be in desperate need of a transfusion. Woefully repetitive, aimless, strained and riddled with formulaic sharp-shooting shenanigans, **Mechanic: Resurrection** is yet another bombastic Bond knock-off that synthetically strut its stuff in stunt-driven oblivion. The majority of Statham fans may find this latest installment of **Mechanic** worth tinkering with due to its kinetic action-pack parts in motion with its stylish bald-headed anti-hero at the helm of voyeuristic mayhem. Still, for others the excitable human bullet factor routine that the aging Statham has perfected in his past furious film exploits (read: “The Transporter” film series in particular) is getting long in the tooth as **Mechanic: Resurrection** is yet another familiar and feisty vehicle that the punishing tough guy has predictably driven before.\r\n\r\n**Resurrection** is the follow-up to the 2011 blueprint _The Mechanic_ where Statham portrayed a stone-faced iron man “gun-for-hire” whose mission is to travel the world while eradicating high-profiled baddies–a specialty that he mechanically and skillfully carries out with polished precision. Naturally Statham’s charged take as the combative assassin is based upon the 1972 flick _The Mechanic_ featuring the late great gravel-faced action icon Charles Bronson who was no stranger to vigilante-style cinema.  Statham’s “take-no-prisoners” approach as the hardened terminator Arthur Bishop is definitely inspired when the English acrobatic avenger is summoned to brandish exotic weaponry, engage in calculating yet cockeyed ways to utilize boobytraps to exterminate his assigned targets and find time to occasionally court the hot chicks that dig his masculine, mischievous charm. No doubt that Statham’s blue-collar Bishop tries to echo the eye-popping sentiments of the aforementioned Bond’s debonair endeavors in intrigue, over-the-top villains, lavish locales and luscious ladies. As for watching the five decade-old adventurous James Bond it feels like an excitable surreal vacation laced with imaginative dare and danger. In witnessing Statham’s stiffened and procedural Arthur Bishop it seems somewhat like an assigned chore in chronicling the gadget-loving gumption of this action-oriented covert clone.\r\n\r\nSure, **Mechanic: Resurrection** derives its occasional chilly appeal from the scenic locations that allows the athletic Bishop to bounce around the globe on an elaborated whim. Plus, some may get an aesthetic rise out of the choreographed in-your-face confrontational fights and showy staged daredevil stunts that feature Bishop’s physical prowess. This is all well and good but the dubious dalliances and action-oriented swaggering that is demonstrated by Statham’s bone-crushing Bishop is rather uneventful and recycled. Unfortunately, **Resurrection** refuses to allow Statham any flexible growth or depth to differentiate his caustic characterization or the high-wire dilemmas beyond the previous antics regurgitated from his earlier copycat fare as _Crank_, _The Bank Job_ and yes…the obvious mention of _The Transporter_ series.\r\n\r\nHit man Arthur Bishop is basking in the scenic Rio de Janeiro  surroundings in hopes of drowning out his deadly duties from yesteryear. Soon, Bishop’s wake-up call to resume his treacherous trade in taking out toxic targets is encouraged by his archenemy in warped businessman Riah Crain (Sam Hazeldine). Specifically, Crain wants Bishop to assassinate three persons of interest in particular that has him roaming three different continents. Bishop is not too receptive to getting back in “the grusome game” but of course the crooked Crain has a twisted way of convincing him otherwise. The critical key to changing a reluctant Bishop’s mind was to hit him where is heart hurts…that is, abduct his gorgeous girlfriend Gina (Jessica Alba from “Sin City”).\r\n\r\nHolding Gina captive clearly gives Crain the upper hand to urge the beleaguered Bishop to return to the fatalistic fold of his poisonous profession–wiping out the assigned undesirables while making it look like accidental incidents. Thus, Bishop puts on his traveling shoes as he hunts down an imprisoned African warlord, an Australian human trafficker and finally a Bulgaria-based arms dealer Max Adams (Oscar winner Tommy Lee Jones). If and when Bishop delivers his three kills for the ruthless Crain then Gina’s release is assured. It is a no-brainer that Bishop wants to ensure the safety of the exotic beauty Gina.\r\n\r\nAlba’s Gina is not the only lovely lady that is attached to Bishop’s hip affectionately. In Thailand, Bishop manages to catch up with another cute bombshell in buddy Mei (martial arts goddess Michelle Yeoh wasted in a transparent role), an innkeeper that worries about her friend’s worldly welfare. Curiously, German director Dennis Gansel’s decision not to give the desirable ageless Asian actress anything to do constructive in this by-the-numbers actioner besides providing sideline concern for Statham’s Bishop is inexcusable. Why not play to Yeoh’s cinematic strengths as a karate-kicking cutie pie with a deadly disposition…you know, what movie audiences have come to expect and cherish about the beautiful Malaysian performer’s film-related credibility? The 1997 Bond film _Tomorrow Never Dies_ effectively used the curvaceous Yeoh to compliment Pierce Brosnan’s Agent 007 so Gansel could not oblige her more on-screen activity with the robotic Statham?\r\n\r\nOf course any Statham-oriented movie would not be complete without the arbitrary display of colorful explosions, glorified chases, exaggerated gunplay and a no-nonsense Bishop predictably flexing his acrobatic leaping, climbing, swimming and fighting muscles as if he was participating in his own self-indulgent Olympic games. There is no real rhyme or reason behind Mechanic: Resurrection other than to revisit the nostalgic relevance of Statham’s left-over box office heft from yesteryear. Perhaps the proven off-kilter spark that Statham generated in the Melissa McCarthy well-received espionage laugher _Spy_ could have been injected in this gimmicky and pointless pot-boiler that has all the succulent juices of a dried-up meatloaf. All the challenging stunt work and exquisite locations cannot excuse the lack of lubrication that Mechanic desires in its insipid, loud execution.\r\n\r\nThere is not much to chew on the bone concerning the so-called return of Statham’s harried hit man that constitutes round two of another dazzling but dense **Mechanic** offering. Alba’s distressed diva is nothing more than stand-by eye candy and the convenient motivating factor for Statham’s/Bishop’s worldwide witch-hunt. Hazeldine’s Crain barely passes muster as a second-rate Bond villain left on the cutting room floor. Jones, who has played wacky villains in the past, merely going through the tiresome motions as pseudo-flashy Max Adams with off-the-cuff irreverence.\r\n\r\nPerhaps Arthur Bishop’s glossy gadgets could prevent an unwelcoming third edition of another **Mechanic** entry from blasting away in boorish fashion?\r\n\r\n**Mechanic: Resurrection** (2016)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 50 mins.\r\n\r\nStarring: Jason Statham, Jessica Alba, Tommy Lee Jones, Sam Hazeldine, Michelle Yeoh, Natalie Burn, Yayaying Rhatha Phongam\r\n\r\nDirected by: Dennis Gansel\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Action and Adventure/Suspense Thriller/International Crime Drama\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-29T02:09:15.227Z"}, {"movie_id": 278924, "review_id": "584467c5925141676400c697", "author_rating": 6.0, "review_text": "**Falling in love is a trap, but some men risk everything for it.**\r\n\r\nThis is an unexpected sequel. Actually, I was looking for other sequels from Statham's filmography, particularly the third 'Crank'. I think the idea of going for it was good and the film was not that bad, if your purpose of a watch is time pass. The story was so bad, but the filmmaking was excellent. Because it was made by a renowned German director. Only if he had got a better script, the outcome would have been different. So it's the actors and the director makes it watchable. Other than that, this film falls into the average category.\r\n\r\nThe story follows after Arthur Bishop was found living in Brasil by some people who know him. Then he narrowly escapes from there and lands in Southeast Asia, where he meets Gina, a woman struggling from domestic violence. But he soon discovers that's a setup. After she was taken captive by an international criminal, now he has to follow his instruction to set her free. So the action begins where he takes a series of missions across the globe and how it all ends follows in the rest of the narration,\r\n\r\nIt's good to see Jason Statham back to his signature role. This is what he's good at. Even if the story is not good, that's okay, because Statham's presence is a very comfortable to watch without any trouble. Jessica Alba as well, I haven't seen her in any major hit film at the recent time. Even though the film was received below average, it kind of puts them both back on the track.\r\n\r\nDefinitely they both needed this breakthrough. There's a third film is coming, it's not official yet, but the conclusion was a hint where Tommy Lee Jones can be seen in an important role in the next part. You won't like this film, but surely enjoy it if you are a Statham's fan, that's the only reason to go for it.\r\n\r\n_6/10_", "created_at": "2016-12-04T19:00:21.414Z"}, {"movie_id": 278924, "review_id": "591ee0469251414ab1030e5d", "author_rating": 6.0, "review_text": "A sequel that no one asked for, the first one was alright but didn't even stand out by Statham standards. The sequel isn't quite as 'alright', a bit sloppily put together and not very well thought of but if you liked the original and Statham in general it's still watchable.\r\n\r\n5.5/10", "created_at": "2017-05-19T12:08:38.576Z"}, {"movie_id": 278924, "review_id": "5f0b9b0155bc35003329dba5", "author_rating": 7.0, "review_text": "Improves upon the first film, which is a rather impressive feat.\r\n\r\nI felt thoroughly entertained throughout this. I do like Jason Statham films admittedly, sure he plays very similar roles each time but I find myself enjoying the vast majority of his work. <em>'Mechanic: Resurrection'</em> is no different.\r\n\r\nStatham is excellent as he reprises Bishop. I rate his performance, just like in <em>'The Mechanic'</em>. I find what Bishop encounters in this film much more riveting than what happens in the 2011 production, it's class watching him go piece by piece; even if you have a fair idea what's going to happen.\r\n\r\nThe aforementioned lead is notably joined by Tommy Lee Jones (Adams), Jessica Alba (Gina) and Michelle Yeoh (Mei). The latter two are unfortunately pretty basic characters, but Jones is very good in his role - I love the look and behaviour of Adams, entirely thanks to the actor himself. Sam Hazeldine (Crain) isn't a great villain, mind... kinda dull in fact.\r\n\r\nI always enjoy seeing films travel the world, as this visits numerous countries including Brazil, Malaysia, Australia and Bulgaria - it allows the story to feel global, as opposed to being limited to a random American state. I like the music, also.\r\n\r\nThis beats its predecessor, which I did enjoy by the way. I'm not saying it is anything incredible, or even one of Statham's best, but all I can state is that I had a fun time.", "created_at": "2020-07-12T23:21:37.933Z"}, {"movie_id": 278924, "review_id": "57c3994b925141532a002173", "author_rating": null, "review_text": "British badass Jason Statham is back and doing what he does best: kicking butt and taking targeted names in the process. The veteran action star is out for more blood in the labored sequel **Mechanic: Resurrection**. The trouble, however, is that fist-swinging wrecking ball Statham’s taste for boisterous blood in his latest toothless and meandering globe-trotting caper may be in desperate need of a transfusion. Woefully repetitive, aimless, strained and riddled with formulaic sharp-shooting shenanigans, **Mechanic: Resurrection** is yet another bombastic Bond knock-off that synthetically strut its stuff in stunt-driven oblivion. The majority of Statham fans may find this latest installment of **Mechanic** worth tinkering with due to its kinetic action-pack parts in motion with its stylish bald-headed anti-hero at the helm of voyeuristic mayhem. Still, for others the excitable human bullet factor routine that the aging Statham has perfected in his past furious film exploits (read: “The Transporter” film series in particular) is getting long in the tooth as **Mechanic: Resurrection** is yet another familiar and feisty vehicle that the punishing tough guy has predictably driven before.\r\n\r\n**Resurrection** is the follow-up to the 2011 blueprint _The Mechanic_ where Statham portrayed a stone-faced iron man “gun-for-hire” whose mission is to travel the world while eradicating high-profiled baddies–a specialty that he mechanically and skillfully carries out with polished precision. Naturally Statham’s charged take as the combative assassin is based upon the 1972 flick _The Mechanic_ featuring the late great gravel-faced action icon Charles Bronson who was no stranger to vigilante-style cinema.  Statham’s “take-no-prisoners” approach as the hardened terminator Arthur Bishop is definitely inspired when the English acrobatic avenger is summoned to brandish exotic weaponry, engage in calculating yet cockeyed ways to utilize boobytraps to exterminate his assigned targets and find time to occasionally court the hot chicks that dig his masculine, mischievous charm. No doubt that Statham’s blue-collar Bishop tries to echo the eye-popping sentiments of the aforementioned Bond’s debonair endeavors in intrigue, over-the-top villains, lavish locales and luscious ladies. As for watching the five decade-old adventurous James Bond it feels like an excitable surreal vacation laced with imaginative dare and danger. In witnessing Statham’s stiffened and procedural Arthur Bishop it seems somewhat like an assigned chore in chronicling the gadget-loving gumption of this action-oriented covert clone.\r\n\r\nSure, **Mechanic: Resurrection** derives its occasional chilly appeal from the scenic locations that allows the athletic Bishop to bounce around the globe on an elaborated whim. Plus, some may get an aesthetic rise out of the choreographed in-your-face confrontational fights and showy staged daredevil stunts that feature Bishop’s physical prowess. This is all well and good but the dubious dalliances and action-oriented swaggering that is demonstrated by Statham’s bone-crushing Bishop is rather uneventful and recycled. Unfortunately, **Resurrection** refuses to allow Statham any flexible growth or depth to differentiate his caustic characterization or the high-wire dilemmas beyond the previous antics regurgitated from his earlier copycat fare as _Crank_, _The Bank Job_ and yes…the obvious mention of _The Transporter_ series.\r\n\r\nHit man Arthur Bishop is basking in the scenic Rio de Janeiro  surroundings in hopes of drowning out his deadly duties from yesteryear. Soon, Bishop’s wake-up call to resume his treacherous trade in taking out toxic targets is encouraged by his archenemy in warped businessman Riah Crain (Sam Hazeldine). Specifically, Crain wants Bishop to assassinate three persons of interest in particular that has him roaming three different continents. Bishop is not too receptive to getting back in “the grusome game” but of course the crooked Crain has a twisted way of convincing him otherwise. The critical key to changing a reluctant Bishop’s mind was to hit him where is heart hurts…that is, abduct his gorgeous girlfriend Gina (Jessica Alba from “Sin City”).\r\n\r\nHolding Gina captive clearly gives Crain the upper hand to urge the beleaguered Bishop to return to the fatalistic fold of his poisonous profession–wiping out the assigned undesirables while making it look like accidental incidents. Thus, Bishop puts on his traveling shoes as he hunts down an imprisoned African warlord, an Australian human trafficker and finally a Bulgaria-based arms dealer Max Adams (Oscar winner Tommy Lee Jones). If and when Bishop delivers his three kills for the ruthless Crain then Gina’s release is assured. It is a no-brainer that Bishop wants to ensure the safety of the exotic beauty Gina.\r\n\r\nAlba’s Gina is not the only lovely lady that is attached to Bishop’s hip affectionately. In Thailand, Bishop manages to catch up with another cute bombshell in buddy Mei (martial arts goddess Michelle Yeoh wasted in a transparent role), an innkeeper that worries about her friend’s worldly welfare. Curiously, German director Dennis Gansel’s decision not to give the desirable ageless Asian actress anything to do constructive in this by-the-numbers actioner besides providing sideline concern for Statham’s Bishop is inexcusable. Why not play to Yeoh’s cinematic strengths as a karate-kicking cutie pie with a deadly disposition…you know, what movie audiences have come to expect and cherish about the beautiful Malaysian performer’s film-related credibility? The 1997 Bond film _Tomorrow Never Dies_ effectively used the curvaceous Yeoh to compliment Pierce Brosnan’s Agent 007 so Gansel could not oblige her more on-screen activity with the robotic Statham?\r\n\r\nOf course any Statham-oriented movie would not be complete without the arbitrary display of colorful explosions, glorified chases, exaggerated gunplay and a no-nonsense Bishop predictably flexing his acrobatic leaping, climbing, swimming and fighting muscles as if he was participating in his own self-indulgent Olympic games. There is no real rhyme or reason behind Mechanic: Resurrection other than to revisit the nostalgic relevance of Statham’s left-over box office heft from yesteryear. Perhaps the proven off-kilter spark that Statham generated in the Melissa McCarthy well-received espionage laugher _Spy_ could have been injected in this gimmicky and pointless pot-boiler that has all the succulent juices of a dried-up meatloaf. All the challenging stunt work and exquisite locations cannot excuse the lack of lubrication that Mechanic desires in its insipid, loud execution.\r\n\r\nThere is not much to chew on the bone concerning the so-called return of Statham’s harried hit man that constitutes round two of another dazzling but dense **Mechanic** offering. Alba’s distressed diva is nothing more than stand-by eye candy and the convenient motivating factor for Statham’s/Bishop’s worldwide witch-hunt. Hazeldine’s Crain barely passes muster as a second-rate Bond villain left on the cutting room floor. Jones, who has played wacky villains in the past, merely going through the tiresome motions as pseudo-flashy Max Adams with off-the-cuff irreverence.\r\n\r\nPerhaps Arthur Bishop’s glossy gadgets could prevent an unwelcoming third edition of another **Mechanic** entry from blasting away in boorish fashion?\r\n\r\n**Mechanic: Resurrection** (2016)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 50 mins.\r\n\r\nStarring: Jason Statham, Jessica Alba, Tommy Lee Jones, Sam Hazeldine, Michelle Yeoh, Natalie Burn, Yayaying Rhatha Phongam\r\n\r\nDirected by: Dennis Gansel\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Action and Adventure/Suspense Thriller/International Crime Drama\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-29T02:09:15.227Z"}, {"movie_id": 278924, "review_id": "584467c5925141676400c697", "author_rating": 6.0, "review_text": "**Falling in love is a trap, but some men risk everything for it.**\r\n\r\nThis is an unexpected sequel. Actually, I was looking for other sequels from Statham's filmography, particularly the third 'Crank'. I think the idea of going for it was good and the film was not that bad, if your purpose of a watch is time pass. The story was so bad, but the filmmaking was excellent. Because it was made by a renowned German director. Only if he had got a better script, the outcome would have been different. So it's the actors and the director makes it watchable. Other than that, this film falls into the average category.\r\n\r\nThe story follows after Arthur Bishop was found living in Brasil by some people who know him. Then he narrowly escapes from there and lands in Southeast Asia, where he meets Gina, a woman struggling from domestic violence. But he soon discovers that's a setup. After she was taken captive by an international criminal, now he has to follow his instruction to set her free. So the action begins where he takes a series of missions across the globe and how it all ends follows in the rest of the narration,\r\n\r\nIt's good to see Jason Statham back to his signature role. This is what he's good at. Even if the story is not good, that's okay, because Statham's presence is a very comfortable to watch without any trouble. Jessica Alba as well, I haven't seen her in any major hit film at the recent time. Even though the film was received below average, it kind of puts them both back on the track.\r\n\r\nDefinitely they both needed this breakthrough. There's a third film is coming, it's not official yet, but the conclusion was a hint where Tommy Lee Jones can be seen in an important role in the next part. You won't like this film, but surely enjoy it if you are a Statham's fan, that's the only reason to go for it.\r\n\r\n_6/10_", "created_at": "2016-12-04T19:00:21.414Z"}, {"movie_id": 278924, "review_id": "591ee0469251414ab1030e5d", "author_rating": 6.0, "review_text": "A sequel that no one asked for, the first one was alright but didn't even stand out by Statham standards. The sequel isn't quite as 'alright', a bit sloppily put together and not very well thought of but if you liked the original and Statham in general it's still watchable.\r\n\r\n5.5/10", "created_at": "2017-05-19T12:08:38.576Z"}, {"movie_id": 278924, "review_id": "5f0b9b0155bc35003329dba5", "author_rating": 7.0, "review_text": "Improves upon the first film, which is a rather impressive feat.\r\n\r\nI felt thoroughly entertained throughout this. I do like Jason Statham films admittedly, sure he plays very similar roles each time but I find myself enjoying the vast majority of his work. <em>'Mechanic: Resurrection'</em> is no different.\r\n\r\nStatham is excellent as he reprises Bishop. I rate his performance, just like in <em>'The Mechanic'</em>. I find what Bishop encounters in this film much more riveting than what happens in the 2011 production, it's class watching him go piece by piece; even if you have a fair idea what's going to happen.\r\n\r\nThe aforementioned lead is notably joined by Tommy Lee Jones (Adams), Jessica Alba (Gina) and Michelle Yeoh (Mei). The latter two are unfortunately pretty basic characters, but Jones is very good in his role - I love the look and behaviour of Adams, entirely thanks to the actor himself. Sam Hazeldine (Crain) isn't a great villain, mind... kinda dull in fact.\r\n\r\nI always enjoy seeing films travel the world, as this visits numerous countries including Brazil, Malaysia, Australia and Bulgaria - it allows the story to feel global, as opposed to being limited to a random American state. I like the music, also.\r\n\r\nThis beats its predecessor, which I did enjoy by the way. I'm not saying it is anything incredible, or even one of Statham's best, but all I can state is that I had a fun time.", "created_at": "2020-07-12T23:21:37.933Z"}]