[{"movie_id": 565028, "review_id": "612f6b04c1ffbd00630ddff9", "author_rating": 5.0, "review_text": "I rewatched the 1992's Candyman in preparation for Nia DaCosta's (Little Woods) direct sequel, so I could get the most out of it without having to force my memory to kick in. Despite being addicted to Philip Glass' score of the original film, Bernard Rose's take on Clive Barker's short story isn't exactly one of my favorite classics, even though I appreciate it quite a bit. Expectations-wise, I didn't know the director beforehand, but I was curious to see what DaCosta could bring to the famous tale.\r\n\r\nUnfortunately, I'm not the right person to tackle the heavy themes depicted in the filmmaker's sophomore flick. From an evident, strong opinion about gentrification to the biased white critical lenses, the director has a clear vision and firm messages concerning cultural injustice. As a white European young man, I'm not going to pretend to have experience or even enough knowledge to approach these necessary, sensitive debates, so I'll let other critics, namely Black authors, spread their voices.\r\n\r\nNevertheless, I have mixed feelings about this sequel. Despite being beautifully shot (John Guleserian), edited (Catrin Hedström), and scored (Robert A. A. Lowe), the thematically driven screenplay often feels forced and occasionally preachy. Characters are thinly developed through an uncommonly too short runtime. The never-ending silhouette recaps of the previous movie are unnecessary, and weirdly enough, a major revelation of this sequel is partially ruined by simply (re)watching the original film. The extreme gore is still present, though slightly toned down, at least from my perspective.\r\n\r\nTechnically and visually, it's truly one of the most interesting movies of the year. Sadly, it isn't able to transmit the same quality to the two pillars of filmmaking - story and characters.\"\r\n\r\nRating: C", "created_at": "2021-09-01T11:59:00.128Z"}, {"movie_id": 565028, "review_id": "62dfa32a5aba320050d6df48", "author_rating": 6.0, "review_text": "I'm a huge fan of Tony Todd as Candyman and always have been, this was a good story and the actors play their parts very well. However afterward it was kind of ruined for me when they all started talking about it being about racism.\r\n\r\nWhy did they have to make it about racism when it was enjoyable as a horror movie?", "created_at": "2022-07-26T08:17:46.376Z"}, {"movie_id": 565028, "review_id": "62dfdc63e9da691497589941", "author_rating": 6.0, "review_text": "_Candyman's_ story was intriguing and with spectacular visuals it is a decent watch, but for a horror film there was a significant lack of... horror. At no point in the film was there tension, dread, or a sense that I was being lead to a thrilling climax, it was more of a character study on Candyman. The character study aspect was great, I loved hearing the mythos of Candyman from different people in the community. The investigation into the backstory of Candyman paired with commentary on police brutality was really well done, but this was marketed as a horror film and it did not deliver. The cinematography was excellent, there were some really great shots utilizing mirrors and different angles but is that enough? In the end, this movie left me wanting much more.\r\n\r\n**Score:** _58%_\r\n**Verdict:** _Decent_", "created_at": "2022-07-26T12:21:55.133Z"}, {"movie_id": 565028, "review_id": "6316e65b7fcab30091ddbbc0", "author_rating": 6.0, "review_text": "I like the new Candyman. I don't love it, but I like it a lot. This film co-written and directed by Nia DaCosta wants to be the Wes Craven's New Nightmare of this franchise, and whenever it reaches that level, it hits a home run — especially when it comes to the eponymous monster, who has never been more sinister or menacing (Tony Todd, who originated the role in 1992, appears in a limited but effective capacity that transcends mere fanservice).\r\n\r\nSpeaking of 1992, DaCosta, who was three years old at the time, would not have been able to bring this project to fruition without the invaluable help of co-writers Jordan Peele and Win Rosenfeld, who know the material inside out and treat it with the same reverence that they it doubtless without inspired in them when they first encounter it in their teens. The filmmakers even get the comic relief right, and that’s not something too many horror flicks can brag about.\r\n\r\nThe original Candyman \"was a horror movie that scared with ideas and blood, instead of just blood\" (Ebert); the new version lives up to this standard, creating a foreboding atmosphere with practical special effects rather than CGI. \r\n\r\nFor example, mirrors are Candyman's portal into our world, and the film makes the most of every reflecting surface — like when the protagonist, Anthony McCoy (Yahya Abdul-Mateen II) gets into an elevator that somehow doubles as hall of mirrors.\r\n\r\nThe present co-exists nicely with the past (another touch as brilliant as bringing Todd back is using Virginia Madsen's voice on recordings made by her character in the first film) in Candyman, but the future is cause for concern. \r\n\r\nThis is not a remake, much less a reboot, but there is a 'passing the torch' — or, in this case, the hook — which I fear is meant to pave the way for more sequels. I can only hope that DaCosta, Peele, and Rosenfeld really appreciate Candyman as much as I think they do, and that having restored his dignity, they allow him to ride off into the sunset with it intact.", "created_at": "2022-09-06T06:19:07.966Z"}]