[{"movie_id": 310131, "review_id": "5752f8509251410915000042", "author_rating": 8.0, "review_text": "> While an evil force slowly possessing them, the family bond is put on a test.\r\n\r\nThe film was based on the collection of a series of the real events that takes place in the 17th century New England. The story of a farmer family who came across the ocean, but now lives on the edge of the forest after denied permission to build a house in a village. When the newborn baby disappears in a thin air, the family begins to experience the mysterious events. Without a clue about the happenings, the evil force begins to possess them while the unity of the family is tested.\r\n\r\nWow, finally a wonderful horror-psychological-thriller. Usually horror films are the worst kind compared with other genres, because most of them overly rely on the sudden sound/noise and gore. But there are many awesome horror films I had liked which were better story than the graphical presentation, like this one. So I love good narration than those try to scare me with make-ups, stunts and sound mixings.\r\n\r\nIt was a limited cast film, sets in a beautiful remote place and the language was awesome that perfectly suits for the horror theme like this. Everyone's performance was brilliant. It is just a one million dollar film and the entire film was shot within a month. The records are not matter when the writing and the direction were top notch. Especially for a first timer it was a remarkable achievement.\r\n\r\nA simple plot, developed greatly and the suspense was the highlight. Yet viewers expect more explanation, but I'm happy for what it is and it should not go deeper than that which might spoil its unique flavour. Not just horror film fans, everyone should try it if they're capable to handle the slow narration. Finally, like usual, here I won't ask for a sequel, because it'll make an amazing one off film than the dozens of crappy follow ups.\r\n\r\n8/10", "created_at": "2016-06-04T15:48:32.490Z"}, {"movie_id": 310131, "review_id": "58c16fb5c3a36825db00a96c", "author_rating": 8.0, "review_text": "This was a really good horror film. The direction was very interesting and Robert Egger plays with darkness and shadows in a really horrifying way. The tension is unbearable at times.\r\n\r\nThe dialogue is a bit hard to follow as it is very \"oldé English\" to add to the historical accuracy of the piece. The actors are all good at reciting this strange dialect and demonstrating the paranoia spreading through the family thanks to religion and superstition.The film is based on accounts and texts found from the era and so everything seen on screen has been taken from sources and barely been touched. Every part of the film seems authentic.\r\n\r\nIt is refreshing to see a film that doesn't really on jump-scares and annoying \"cattle-prod\" techniques to make audiences scared. 'The Witch' is genuinely disturbing without resorting to these techniques. It is very strange and gory when it needs to be. I also found these strange scenes quite fascinating and educational as the film almost seems like a historical document.\r\n\r\n★★★★", "created_at": "2017-03-09T15:07:33.901Z"}, {"movie_id": 310131, "review_id": "5db17f2b629b2c00152e0216", "author_rating": 8.0, "review_text": "Talk about old school!\r\n\r\n“The Witch” is a painstaking recreation of Puritan life in New England. The lifestyle is mimicked. The clothes are period-accurate. The dialogue is actually based off of documents and speeches from that time. It’s as if Mel Gibson decided to update “The Passion of the Christ” by 1600 years.\r\n\r\nAs mentioned, the movie is set in Puritan New England as a family is banished from the larger community and has to make their own way out in the wilderness. As they build their home, strange things begin to happen, starting with the abduction of the infant Samuel. Things continue to get worse and worse, until… okay, no spoilers. See the movie.\r\n\r\nThis is a dark and effective movie. I can’t remember the last time I actually had a start from the all too often used jump scares, but the movie is absorbing enough that it did manage to “get” me a couple times. Robert Eggers seems to have kicked off a new wave in old-school, deep supernatural and existential horror. I won’t lie that I drew some comparisons between this and Ari Aster’s “Hereditary,” if nothing else than by simply the way the movie felt and left me feeling at the end.\r\n\r\nThat being said, the film isn’t perfect. In fact, oddly enough, it’s perfection is what gives it imperfection. The period is so painstakingly recreated, in particular the dialogue, that sometimes hearing it can be jarring, making me stop for just a second to think about what was just said, which unfortunately interrupts the flow and managed to pull me out of the film. It’s kind of a strange complaint that something could be so accurate that it fails to suspend disbelief, but here we are.\r\n\r\n“The Witch” is quite an achievement and I’m glad that this film, which would otherwise be relegated to underground status, has managed to achieve a following, enough so that Robert Eggers got to do a follow-up with the Lovecraftian-looking “The Lighthouse.” Definitely worth checking out.", "created_at": "2019-10-24T10:38:35.925Z"}]