[{"movie_id": 302401, "review_id": "585eda00c3a3681a770125a0", "author_rating": 7.0, "review_text": "**He who became a people's hero by betraying his own nation!**\r\n\r\nI had like to begin by saying I'm not an American and I haven't seen the Oscar winning documentary 'Citizenfour'. But I'm very much aware of everything about it through the all kinds of coverages. So my perspective about the film will be true and about the content will be neutral. I have known about what this film dealt since the day it all began. I did not care much, but there are things to concern about it. Like if it is necessary to tap to prevent the serious threats, there's nothing wrong it that. Because, even if they have our private contents, they are not going to publish it or make money out of it. So that makes what Ed did was unethical and betrayal for his own country.\r\n\r\nIn another angle, NSA's illegal surveillance questionable in many ways, but wrong is only a tiny thing. Because eyeing every single one of us seems wrong, though without examining all, nothing confirms, differentiate between right and wrong. So coming to the film, it was decently made one. The main reason is it was too long and many parts were boring. The theme was powerful like it was a one liner, but the film contents were very weak. Except Snowden passing the security, the rest of the story like why he did, including his personal life, particularly his romance was not good enough to make a film. This is very much suitable for a documentary than a feature film.\r\n\r\nBut I liked the actors. Joseph Gordon-Levitt was good, but not great. If he gets the Oscars nod, that's only because of the issue which the film inspired by, not because his phenomenal character display. The direction was decent, but not the screenplay. The film is not for everyone, but I recommend it to all as a must see. The main reason why you should watch it is to educate yourself. To learn what they are doing and how. Particularly, you will definitely come to know how to avoid being eyed by the government in a simple way. So that's a good thing than whining over what homeland security does to protect the nation. It is not an inspiring biopic, or a masterpiece, but don't miss it for any cost.\r\n\r\nP.S. Whatever the form of the governments, the nations won't stop doing what in this film they said was wrong. Because there's no Edward Snowden in every nation to expose it. In that perspective, the US was really embarrassed for their own man letting them down. The China is the number one in this kind of activity. The point is, these things happening right now or not, but should never come to public notice like that happened in here, never should leave the compound. Suppose if we come to know, we will protect, at least in the democratic countries that's what we do. But not to forget it also safeguards us. That means it is like the stars and planets on the sky that we watch and take notes, but they are untouchable. We only monitor them for threats like asteroids and fractionally thinking about the alien invasion.\r\n\r\n_7/10_", "created_at": "2016-12-24T20:26:40.207Z"}, {"movie_id": 302401, "review_id": "58716165925141356400d3af", "author_rating": 8.0, "review_text": "JGL plays a pretty convincing Snowden or at least I think he does as I've only seen the real Snowden in video and Citizenfour. I don't know exactly how correct the movie is to the actual story but as most of these things go, the movie will have been created with a slightly exaggerated storyline and version of events.\r\n\r\nAn enjoyable watch and a big tick for me was that the coding and terminology used in the movie were relatively correct and true to real life!", "created_at": "2017-01-07T21:45:09.425Z"}, {"movie_id": 302401, "review_id": "5972739f9251412d4c05524c", "author_rating": 9.0, "review_text": "Although the movie is not perfect, it's flaws are limited, minute and easily ignored. **A must-watch for anyone using a computer!**\r\n\r\nThis adaptation of Snowden's transformation from a talented programmer working for the United States secret service into a planetary hero really takes the viewer deeper into the true story on which this film is based. It shows the human side of the path towards revealing the truth. Relational tensions, covertly supportive colleagues and the need to stay cool are all part of this film.\r\n\r\nBest spy thriller I've ever seen. _Beyond believable_.", "created_at": "2017-07-21T21:35:27.698Z"}, {"movie_id": 302401, "review_id": "63c1fcbde16e5a008ac83c07", "author_rating": 1.0, "review_text": "What happened to Oliver Stone? Once upon a time you could sit down and watch a film, and knew he was the director just by the cuts alone, not to mention the atmosphere and over-all look of the presentation.\r\n\r\nThis doesn't look like an Oliver Stone film.\r\n\r\nThe script sounds like a Stone film. The plot is certainly an Oliver Stone plot. The subject matter and how it's handled is totally Stone. But the film, well, it's an Oliver Stone film.\r\n\r\nThe actors involved, well, Joseph Gordon-Levitt is certainly someone Stone would cast, but the long list of cameos of A and B grade stars comes down to a sprinkle and not a downpour like they used to.\r\n\r\nAnd the look of the film, where are the Stone cuts? It looks like anyone in Hollywood could have directed the script and made it into the movie that it is.\r\n\r\nThe director doesn't leave his mark Snowden like he had on his earlier work. And, honestly, agree with his politics or not, the reason people go to see his movies is because he's directing them.\r\n\r\nSnowden doesn't feel like he really directed it, and you walk away feeling robbed because of it. The movie would have been great with anyone else, but, honestly, we didn't want to see this film made by anyone else, we wanted to see it made by Oliver Stone.", "created_at": "2023-01-14T00:52:13.510Z"}, {"movie_id": 302401, "review_id": "641dae05ae6f0900eadc6040", "author_rating": 5.0, "review_text": "**It's a forgettable film, with nothing remarkable about it other than the fact that it makes an open defense of Edward Snowden and what he did.**\r\n\r\nOliver Stone has given us a film that could not be more controversial: a biography of Edward Snowden, an ex-military and former US spy who worked as an intelligence analyst for the CIA and the NSA. It's not worth getting into the script, almost everyone knows who Snowden is and what he did. What varies a lot is how each person faces it. To many Americans, he is a traitor who has endangered world security and the fight against terrorism. For others, he denounced the way the US controls the world and uses information (and the way people practically abdicate their private life through social networks) in order to gain advantages in the field of macroeconomics and geostrategy.\r\n\r\nActing as a panegyric, the film is militant, takes sides and defends Snowden and his view of things, portraying him as someone of courage, a man of integrity who served his country and the fight against terrorism, but who found that he was part of the problem rather than the solution, and that he was serving much darker interests than he realized. Seeing the film is the same thing as listening to Snowden himself, who has been exiled in Moscow for several years (to what extent did Putin not take the opportunity to recruit him, or use everything he knew?). So it's a film that will upset those who see Snowden as a traitor to their country, and even some people who would prefer a more neutral approach, better able to show both sides of the problem, as I would have preferred.\r\n\r\nJoseph Gordon-Levitt does a good job as the protagonist. While we're not sure if he managed to be faithful to the real Edward Snowden, the actor creates someone who is easy to like: one of those computer and math geniuses who observe people and the rest of the world with a mixture of curiosity and naivety. On the one hand, I feel inclined to sympathize with the character... on the other hand, the naive way in which he acts seems forced and hard to believe, particularly after what the character experiences in Japan. Shailene Woodley also does a good job by giving life to Snowden's girlfriend (now wife), an outgoing and communicative girl. The film features the collaboration of Melissa Leo, Tom Wilkinson, Zachary Quinto, Rhys Ifans and Nicolas Cage.\r\n\r\nTechnically, it has the characteristics of an ordinary mainstream American film. There are good sets and the cinematography has some well-done moments, in addition to some notes of good CGI. However, it's a relatively forgettable film, with nothing to make it stand out other than the fact that it's about Snowden.", "created_at": "2023-03-24T14:04:53.882Z"}]