[{"movie_id": 14359, "review_id": "57e47427c3a36875a100a395", "author_rating": 9.0, "review_text": "Knee-deep in the throes of my first love, I was quite surprised to hear that my lady's favourite movie was 'Joe Versus the Volcano'. (I still haven't seen the film). It dawned on me, when I wanted to check out an American film which, to my knowledge, had a plethora of fine acting, that this was written and directed by the same guy who made that film much earlier. Being raised Christian and hearing in the press over the past few years about misdeeds, especially involving leaders of the Catholic church (represented in films as diverse as 'The Boys of St. Vincent' (John N. Smith, 1992) and 'In Bruges' (Martin McDonagh, 2008), I was especially intrigued by this, his work of more recent vintage.\r\n\r\nThe ambiguity at the core of the film (and hence the 'doubt') really acts in the movie's favour. The script and direction are both tense and flawless, and the beautiful New York locations chosen to illustrate The Bronx in 1964 help air the play out, and give it more cinematic scope. It features some of the finest work I have seen from Philip Seymour Hoffman (though my favourites will always be 'Happiness' and 'The Master'), Meryl Streep (my most-esteemed works of hers are 'The Deer Hunter' and 'The Devil Wears Prada') and Amy Adams (this is her finest performance IMHO) as well as a breakthrough role for Viola Davis, who steals every scene she's in. This easily holds up well even with Shanley's Oscar-winning screenplay for 'Moonstruck', and, though dark and depressing, is thoroughly recommended for those who can stomach its subject matter, and peer into that abyss without flinching, as these fine exemplars of 21st-century American cinema so easily do here.\r\n\r\nThat it didn't win any of its five Oscar nominations is almost as ghastly, to the cinephile, as the misdeeds insinuated here are to the community at large. Must have been a strong year for film, methinks.", "created_at": "2016-09-23T00:15:35.073Z"}, {"movie_id": 14359, "review_id": "62b96297e1faed142136d44d", "author_rating": 7.0, "review_text": "There is wonderful scene in this film where \"Fr. Flynn\" (Philip Seymour Hoffman) tries to explain, using feathers, just how wicked gossip can be. He is the victim of such nefarious chatter - but is he guilty? Well \"Sister Aloysius\" (Meryl Streep) believes so. She sees the father with a student on the street outside the school, then her colleague \"Sister James\" (Amy Adams) mentions that another, their first young black child \"Donald\" (Joseph Foster), looked a bit distressed after meeting with the priest in is vestry. She is determined to get to the truth and to be rid of this man. Streep is very convincing here. She portrays a woman who, based on the thinnest of actual evidence, relies on the certainty of her belief to level accusations against the man. Using that certainly, she confronts him imploring confession but is there anything to confess? Hoffman is also effective as a man that I initially had sympathies for - he was, after all, being victimised by his colleague with no evidence from the supposed victims and the first lad - \"London\" (Mike Roukis) was a distinctly untrustworthy boy. Viola Davis offers just the one principal scene as the affected boy's stoic mother, and that is a potent rationalisation of not just where she felt a young black kid sat on the ladder of society at the time, but also of where she felt the church sat on her own. She is a loving mother conflicted, and this is portrayed with intensity. I wasn't sold on the ending, either way it was unsatisfactory but this is still a well crafted and thought provoking assembly of strong acting talent and a solid story.", "created_at": "2022-06-27T07:56:07.745Z"}]