[{"movie_id": 122, "review_id": "51ea5256760ee3601d252c51", "author_rating": 10.0, "review_text": "And so all good things come to an end. For three years in a row, Peter Jackson has banished our winter blues with the individual instalments of his Tolkien trilogy, effectively shifting the focus of our cinematic excitement from the summer months to the end of the year. But now that his epic has been unveiled in its entirety, what will be the lasting effects of his achievement?\r\n\r\nWell, grand-scale fantasy filmmaking is back on the menu, laying down the gauntlet to George Lucas and Star Wars Episode III. Jackson has also proved that notions of risk and ambition needn't be confined to the low-budget, indie end of the spectrum; nor does California have an exclusive stranglehold on groundbreaking special effects.\r\n\r\nAnd then there's the DVD factor. Just as The Lord Of The Rings was upping the stakes in theatres, so too was its DVD release pattern defining what can (and should) be done on disc for major movies.\r\n\r\nIn particular, the four-disc extended editions seem to have affected the director's thinking as to what he can get away with in his theatrical final cut. Hence the public grumbles from Christopher Lee about the non-appearance of Saruman in this final instalment. While it might have been fair to grant Lee a curtain call, Jackson quite rightly realises that it is Sauron, not Saruman, whose fiery eye encompasses all the narrative strands of the climax.\r\n\r\nThe Return Of The King marks the first time in the series when Jackson's roots as a horror filmmaker creep through. As the orcs catapult severed Gondorian heads beyond the walls of Minas Tirith, flesh-rotted ghosts draw swords alongside Aragorn and giant spider Shelob stalks Frodo through dark, web-shrouded tunnels, the film pushes the boundaries of its 12A certificate.\r\n\r\nAnd so it should, because the look and tone must necessarily grow darker as the Hobbits near Mount Doom and Mordor's evil hand grips Middle-earth ever tighter.\r\n\r\nCharacter nuances have been crafted over an unprecedented ten hours-plus of cinematic storytelling: from Strider lurking in the shadowy corner to Aragorn rallying the troops; from Merry and Pippin as bumbling fools to stout-hearted, pint-sized warriors. Only Legolas and Gimli seem to have regressed (in screen time at least) to set-piece archer and comedy sidekick respectively. At least Andy Serkis is rewarded for his Gollum voice work with an early flashback that gets his face on screen, as well as warning us that, under the ring's power, Smeagol can be as murderous as Gollum.\r\n\r\nJackson has kept the momentum of the series rolling on and on though the traditionally 'difficult' middle part and 'weak' finale, delivering a climax to the story that's neater and more affecting than what Tolkien managed on the printed page. Some viewers might feel that the director sprinkles some cheese on his extended coda, adding at least one false ending too many (even if he does ignore the book's Scouring of The Shire).\r\n\r\nBut those who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll. Yes, the Ring is dead. Long live King Kong.\r\n\r\n\r\nVerdict - The resounding climax to a landmark in cinema history. But the King has now returned, the story is over and the ships are leaving Middle-earth. Ladies and gentlemen, Elvish has left the building.\r\n\r\n5/5\r\n\r\n- Alan Morrison, Empire Magazine", "created_at": "2013-07-20T09:03:18.749Z"}, {"movie_id": 122, "review_id": "5aa586ae0e0a26074b02abf1", "author_rating": 5.0, "review_text": "Too much CGI, redundancy, clichés and drawn out “looks of love” for my tastes.\r\n\r\nRELEASED 2003 and directed by Peter Jackson, “The Lord of the Rings: The Return of the King” adapts the third part of JRR Tolkien’s popular fantasy trilogy about adventures on Middle-Earth: Frodo (Elijah Wood), Sam (Sean Astin) and Gollum (Andy Serkis) continue to try to make their way to Mount Doom to destroy the One Ring. Meanwhile Aragorn (Viggo Mortensen), Legolas the Elf (Orlando Bloom), Gimli the Dwarf (John Rhys-Davies), Gandalf the wizard (Ian McKellen), King Theoden (Bernard Hill) and Faramir (David Wenham) join forces to fight Sauron's army at the stone city of Minas Tirith and, later, draw the forces of Modor out as a distraction for Frodo to accomplish his goal. Billy Boyd and Dominic Monaghan are on hand as Hobbits Pippin and Merry.        \r\n\r\nWhile I’m a casual fantasy/adventure fan and have read numerous books of the genre (e.g. Conan, Tarzan, Gor, etc.), I’ve never read Tokien, likely because I’m not into Hobbits, Elves and Dwarfs. After viewing the three movies, The Lord of the Rings strikes me as a mixture of Robin Hood, Conan and The Wizard of Oz, which all possibly influenced Tolkien’s writing of the Rings trilogy in 1937-1949. So, if you think a meshing of “Conan the Barbarian” (1982) and “Robin Hood: Prince of Thieves” (1991) with “The Wizard of Oz” (1939) sounds good, then you’ll probably like these movies more than me. \r\n\r\n“The Return of the King” is just more of the same showcased in the first two movies, but even LONGER. Take the Battle of Minas Tirith, for example. It’s basically the same as The Battle at Helms Deep in the previous movie, except with colossal elephant-like creatures and the Army of the Dead. These two battles are similar enough that they could’ve been condensed into one conflict. Speaking of the Army of the Dead, this was an interesting new element, as was the horrifying spider-monster that Frodo & Sam face inside the caves.   \r\n\r\nLike the first two movies, the characters are diverse, the tale is creative, there’s a lot of dark action rounded out by softer scenes and everything LOOKS and SOUNDS magnificent. Unfortunately, as with “The Two Towers,” there’s excessive use of CGI (aka CGI porn). If cartoony CGI is your thang then you’ll likely appreciate this installment more than me.        \r\n\r\nThere are other problems: While the characters are inspired, they’re also thin and rather uninteresting, at least for mature people who require more depth to hold their attention. Take Legolas (Bloom), for example; we never get to know him. Or consider Aragorn: Mortensen is perfect as the noble warrior, but in the ENTIRE trilogy he probably only has like two full pages of dialog, maybe three. Also, I found the story generally disengaging. I was never much enthralled by the characters and their pursuits, although devotees of Tolkien might be. \r\n\r\nThen there are WAY too many “looks of love” between characters, particularly Frodo and Sam (I was so happy to see one character get married and have kids, if you catch my drift). There’s also a sense of redundancy, like the aforementioned battles (Helms Deep and Minas Tirith). Or consider the hokey dangling from a cliff by one’s fingers: This was already done with Gandalf at the end of the first part and beginning of the next. Did we really need the entire trilogy to come down to this type of eye-rolling cliché?    \r\n\r\nAnother problem is the lack of feminine protagonists. There’s Miranda Otto as Éowyn, Théoden's niece, who becomes infatuated with Aragorn and masquerades as a warrior-ess. Other than that all we have are cameos by Liv Tyler (Arwen), Cate Blanchett (Galadriel) and a Hobbit’s wife. “Mythica: A Quest for Heroes” (2014) cost LESS THAN $100,000 to make, which is a mere fraction of the $94 million it cost to make this blockbuster and the creators knew enough to throw in a couple of prominent babes as heroines in the story. So did “Conan the Barbarian” and “Dungeons & Dragons: Wrath of the Dragon God” (2005). It’s not rocket science. \r\n\r\nAs noted above, the movie’s needlessly overlong and things could’ve been condensed in the trilogy or omitted altogether. When the main storyline ultimately ends at Mount Doom I was thinking there was maybe 12-15 minutes left with half of that time being credits. Nope, there was STILL 30 MINUTES LEFT wherein boring goodbyes and “looks of love” are tacked on. \r\n\r\nDespite these honest quibbles, “The Return of the King,” and the trilogy in general, was an ultra-ambitious undertaking and is a must for fantasy/adventure aficionados, particularly those who favor Tolkien, Hobbits, Elves, Gnomes and the like.                      \r\n\r\nTHE MOVIE RUNS 3 hours 21 minutes and was shot in New Zealand.  \r\n\r\nGRADE: C", "created_at": "2018-03-11T19:42:38.678Z"}, {"movie_id": 122, "review_id": "5f682f2f1b1f3c0039ad9373", "author_rating": 10.0, "review_text": "Great finale to a great trilogy. The action and battle sequences were amazing and even though I've seen this a few times over the years, still thrilling to the end. I didn't even mind the multiple endings as I had in the past, nice each character got their due. **4.75/5**", "created_at": "2020-09-21T04:42:23.963Z"}, {"movie_id": 122, "review_id": "602f328f64f716003e55e98e", "author_rating": 10.0, "review_text": "An outstanding end to the trilogy.\r\n\r\nI expected a lot from <em>'The Lord of the Rings: The Return of the King'</em> so I am delighted to see it produce on so many levels. I, funnily enough, wouldn't actually say it's necessarily the most perfect execution - what with the plot coincidences and extreme character armour. But that doesn't matter one jot whatsoever, as the story wraps up in arguably the best way - at least to watch - possible. It has so much heart and feeling to it.\r\n\r\nThe story involving the characters of Elijah Wood, Sean Astin and Andy Serkis remained the most interesting to me, I was very satisfied with how it concluded in regards to them. I also enjoyed the bits we got of Viggo Mortensen, Ian McKellen & Co. All that added to the beautiful look and creation of the film, with the world coming alive splendidly.\r\n\r\nIf I were to nit-pick further, I would say the run time is slightly too long. The pacing is absolutely fine, very good in fact, but I coulda done without a few of the many end scenes - a lot of which are necessary and welcome, but a couple could've been left out to allow the viewer to imagine how the world continued. That's just how I feel mind, I'm sure I'm one of only a few that think that way.\r\n\r\nBack onto the positives: how about those battle sequences? Astonishingly good. A sensational trilogy, no question about it. I look forward to seeing <em>'The Hobbit'</em> films.", "created_at": "2021-02-19T03:37:51.613Z"}, {"movie_id": 122, "review_id": "6193b27dccde04008c25e8b8", "author_rating": null, "review_text": "As an avid fan of Tolkien's The Lord of the Rings from long before New Line announced this movie \"trilogy,\" I must say all three films were fairly large disappointments.  Now, mind you, I am not your usual, \"The book is better\" movie reviewer.  But it is almost like Peter Jackson went out of his way to take out the most crucial elements of the books and replace it with drivel.  Also every line that sounds even remotely cool in the books must be given to Gandalf, no matter who actually said it...  That's just frustrating, despite Sir Ian McKellen's stellar performance.  With what I would hope is the obvious exception of Orlando Bloom's third dismal performance as Legolas, the actors all did quite well; the characters were just not allowed to shine as they do in the books.\r\n\r\nI see that the common consensus is that this movie is too long, and I agree.  What's most frustrating about that to me is that this movie had to finish The Two Towers since that film did not complete, and then this film left out the pivotal ending of the saga.  The Return of the King is actually the shortest volume of the three (there are six books, two in each volume).  As some have noted, the film noticeably scraps the scouring of the Shire, but for those who might have hoped for a fourth installment to finish that story, Peter Jackson dashed all hopes by disturbingly killing off Saruman at the beginning of the extended edition.  By the by, I understand many people feel that the scouring of the Shire is anticlimactic after the final defeat of Sauron, but for myself, I think the point that there is still evil in the world, and that heroes must still rise to fight it, is one of Tolkien's triumphs.  Back to my main point, though: the books were shorter while telling more story, because despite his depth and detail, Tolkien understood how to drive  a story along.  Peter Jackson, on the other hand, fails on that count.\r\n\r\nAnyway, I am someone who always hoped that these movies would be made (I grew up watching the animations produced by Rankin/Bass and Fantasy Films).  But now I suppose I'll have to wait until someone is daring enough to try again, despite the overwhelming success of these films (which will probably not happen in my lifetime).  In the meantime, I'll continue to read the books every year.", "created_at": "2021-11-16T13:30:37.745Z"}, {"movie_id": 122, "review_id": "643e267143250f055450ed85", "author_rating": 10.0, "review_text": "A fitting end to a classic trilogy.\r\nFrodo, Samwise, and Gollum journey through a Hell on what is called \"Middle Earth\", while Gandalf, Aragorn, Gimli, and Legolas go to war. King Theoden must decide whether to help those who would not help him. Merry wants to war, but is too small. Pippin finds himself getting in more and more mischief.\r\nLots of subplots. Never a dull second. Masterfully dierected.\r\nWhat more can be said? Truly mesmerizing every step of the way, and a movie with maybe four endings that just lead into each other, and we still can't get enough.", "created_at": "2023-04-18T05:11:13.193Z"}, {"movie_id": 122, "review_id": "64f4caf69e4586013af92859", "author_rating": 8.0, "review_text": "I've just seen this on the big screen for the first time since I saw it at London's sadly now long-gone Odeon at Marble Arch, which - at the time - boasted the biggest screen in the UK, and it has lost little of it's magic. Continuing with the interwoven tales of \"Frodo\", \"Sam\" and their treacherous guide \"Gollum\" as they trek through fire and brimstone to get the ring to Mount Doom; whilst Gandalf, Aragorn and the surviving members of the fellowship try to stem the might of \"Sauron\" and his armies of orcs and their allies. While this is undoubtedly a magnificent piece of cinema, I find the story drags a bit. I found the the focus to be too much on the less interesting characters - the lovelorn \"Eowyn\" (Miranda Otto); the delusional \"Denethor\" (John Noble) and decent but rather wimpish \"Faramir\" (David Wenham) as \"Gondor\" faces the wrath of their nemesis, and that slows the pace from the action just when it ought to be building. The delightful, friendly, rivalry between \"Gimli\" & \"Legolas\" features all too sparingly and it's got too ponderous a narrative to sustain the four hours the otherwise visionary Peter Jackson has created. Fortunately, the triple-header quest with Elijah Wood, Sean Astin and a superb Andy Serkis keep the other strand moving along suspensefully and tensely. The battle scenes are superb, though - when we get them, the effects really do rise to the occasion and, of course, the striking cinematography coupled with the inspired themes from Howard Shore contribute to a thoroughly entertaining adaptation of a thoroughly captivating fantasy adventure. If you make it past the start of the credits, there is the gloriously haunting \"Into the West\" from Annie Lennox to top off this finest of trilogies. The Oscar/BAFTA awards this achieved are a just reward for years of stunningly creative effort from thousands of people who turned the imagination of a 20th Century English academic into films that will last forever.", "created_at": "2023-09-03T18:05:42.222Z"}]