[{"movie_id": 138222, "review_id": "577aab0792514155f4001d9f", "author_rating": 8.0, "review_text": "> How one sad event that changed many peoples' lives.\r\n\r\nOriginally it was known as 'Lumpy', but this new title seems much better. Even though this title name is somewhat misleading regarding the film subject. I saw it a couple of years delayed, because I was not interested after knowing the title thinking it might be some kind of a silly B comedy. Surprisingly, this was one of the best films of the 2013 I've seen. This is not a comedy alone as it was classified, but a beautiful semi-emotional drama just like the film 'The Guilt Trip'.\r\n\r\nThe cast was so good, I loved everyone's performances. But in the opening, it looked like a mindless comedy with dumb characters. Only while the film progress, it slowly developed many awesome plots and I was totally impressed with it, especially for the way it ended. Yep, it concluded on a high note compared to the ordinary initiation. I think credit should go the writer-come-director, as well as the actors.\r\n\r\nIt was a two layered narration that sets in two different cities where one of it was a flashback, but both of them meets during the middle. So what comes later was the best segment. The second half is what made this film a better product. This is not an extraordinary film, but for a small project and its not so popular cast, it really excelled my expectation.\r\n\r\nWell maintained suspense, and I don't think anybody could guess them out that easily. Till the final scene, it'll keep you alive, especially if you like melodrama you'll surely enjoy it better than others. Lately Justin Long has been doing some of the interesting small-scale films and this is one of them that you should try it if you're a film fanatic without barriers in viewing any category films.\r\n\r\n7.5/10", "created_at": "2016-07-04T18:29:27.811Z"}, {"movie_id": 138222, "review_id": "5f349e1593828e00323bd419", "author_rating": 7.0, "review_text": "Really good watch, could watch again, and can recommend.\r\n\r\nThis honestly isn't a traditional comedy: it's more a mystery than a comedy.\r\n\r\nI'm not a big fan of Tyler Labine, but he does do charmingly hapless really well, and he carries the movie, even in the scenes where he's not there because the impression he lands is so palatable as they talk about him it really builds the character.\r\n\r\nWhile the rest of the supporting cast is incredibly well balanced, Justin Long and Addison Tomlin really run away with it.  For a movie that is half about a couple with newly wed problems, all that really slids away in wake of this wonderful, heart warming tale of friendship and what it means to be family, blood or no.", "created_at": "2020-08-13T01:57:41.053Z"}]