[{"movie_id": 1907, "review_id": "559194c7925141757a001c45", "author_rating": 8.0, "review_text": "Getting away from it all may not be perfection paradise after all?\r\n\r\nI first viewed this film upon its release and felt that the final third did the film down - and that the voice-over took away from the essence of the story, thus it's average. My subsequent viewings over the years would see me lament about an arcade game sequence and bemoaning that Robert Carlyle wasn't given a more extended role, yet it has become a film that sees me totally on board with director Danny Boyle's production and it's now that I think it puts the story together with poignant precision.\r\n\r\nLeonardo DiCaprio is Richard, a backpacker searching for a bit more in life, after a meeting with pot smoking loony Daffy (the wonderful Robert Carlyle), he learns of an island paradise that is everything he has yearned for in his life. Getting there will give him the adventure and danger he craves, because once there it apparently will be the thing of dreams, the perfect paradise cut off from civilisation...\r\n\r\nThe film is very much split in two, the first half introduces us to Richard and the people he would convince to travel with him to this island paradise, we then follow their journey that is perfect in fleshing out the characters, they come up against obstacles and learn about each other on the way. The second half is well worth waiting for because it's here that the story kicks in to make the viewer think, it's idyllic, it's gorgeous, it's near perfect, but wherever there is a community, there will be personal hang ups, jealousies, power seekers and etc, in short, the surroundings may be perfect but the human condition is far from flawless.\r\n\r\nI love this film now, I love DiCaprio's performance, a cocky smart-arse thrill seeker about to get a wake up call is tailor made for him, and he delivers it with a  skillful array of emotions. Director Danny Boyle does a great job of juggling the joys of paradise with the uneasy distortion of the various characters in the community, and the cinematography from Darius Khondji is truly beautiful (Thailand locales). The film suffers with the inevitable comparisons to Lord Of The Flies & Hearts Of Darkness, and yes these are fair comparisons, but it doesn't take away from the fact that it's a fine film for the modern generation in its own right, with the core point of the story relevant to all and sundry.\r\n\r\nFans of the novel would prove to be very ambivalent towards this filmic adaptation, but in my book it gets better on repeat viewings. 8/10", "created_at": "2015-06-29T18:56:07.436Z"}]