[{"movie_id": 197796, "review_id": "57e7bfa0925141413f013890", "author_rating": null, "review_text": "It seems as if big screen dueling cinematic fairy tales are the trend within the last few years at the box office. Back in 2012 movie audiences were bombarded by the _Snow White_ avalanche when filmmaker Rupert Sanders’s _Snow White and the Huntsman_ had the share the releasing spotlight with director Tarsem Singh’s _Mirror Mirror_ (although Singh’s whimsical narrative had the head start in hitting the movie theaters first by a mere two months). Now in skipping ahead four years later we seem to have a repeat performance with another classic tale involving youthful fairy tale femininity as the focus shifts to the “Beauty” from Jeanne-Marie Laprince’s **Beauty and the Beast** (or for the French-speaking movie-goers “Le Belle et Le Bete”). In 2016, co-writer/director Christophe Gans’s (“Brotherhood of the Wolf”, “Silent Hill”) **Beauty and the Beast** makes its lavish entrance into the movie mindset of viewers waiting to see what amounts to be another stagy screen adaptation of Laprince’s vintage and unconventional fairy tale romancer. Bill Condon’s musical film version of **Beauty and the Beast** will makes its entry a few months later in March 2017.\r\n\r\nNo doubt that Gans’s French live-action version of **Beauty** has a breathtaking visual vibrancy to its opulent production. Plus, it certainly does not hurt the polished product when the film features a couple of France’s big-time smooth cinema stars in leads Vincent Cassel and Lea Seydoux. In any event, **Le Belle et La Bete/Beauty and the Beast** was originally produced in 2014 so now it is making the rounds to the U.S. shores and elsewhere. As imaginative and sleek that Gans’s colorful showcase is in its elegant presentation the film fails to offer anything dramatically darker or delirious that dares to separate any distinction from past interpretations of this famously familiar story for the ages.\r\n\r\nThe sentiment has always been realized that if you are going to regurgitate epic fairy tales that have been done countless times over with richer reception then your current installment better bring something more stimulating and introspective to the creative table for feasting. For the longest time Disney, in particular, had the notable monopoly on the animated musical _Beauty and the Beast_ from the early nineties. Also, Jean Cocteau’s nostalgically hypnotic 1946 fantasy offering still manages to resonate as well. Somehow Gans’s elaborate and eye-popping take on the photogenic cutie and the misunderstood creature does not quite translate or connect beyond its obvious sumptuousness. **Beauty and the Beast**, at least in modern-day and future outings, should strive to the accountability of being more than a serviceable non-traditional love story saddled in sparkling trivialities.\r\n\r\nA French widowed merchant (Andre Dussollier) is practically destitute after his ships are lost on the high sea. So the bankrupt family man of six children packs up and moves to a quaint  countryside home to try and reclaim his chaotic life. His absent ships are not the only thing that is considered lost as his brood of problematic offspring are a handful. However, the one bright spot out of the unruly bunch is youngest daughter Belle (Sedoux, “Blue is the Warmest Color”). Whereas Belle’s dissatisfied siblings are not thrilled with the relocation and overall less-than-stellar circumstances she in fact is taking a positive approach to the land and her father’s unsettling situation at hand.\r\n\r\nFeeling underappreciated and disillusioned by his vain children (with the exception of his beloved and sensible Belle of course) the Merchant roams into the forest where he eventually ends up lost until he stumbles upon a castle owned by the ominous Beast (Cassel). The Merchant decides to take a gorgeous red rose from the property as a kind gesture to give to his only grateful child Belle. However, the Merchant absconding with the red rose did not quite sit right with the retaliatory Beast. This treasured red rose is the symbolic reminder of the Beast’s cherished late wife. As a result the Merchant must pay the ultimate price in the eyes of the demanding Beast by holding him for rightful compensation. Specifically, the Merchant must be in life-long servitude to the fearsome Beast as selected punishment. Should the Merchant not comply with his indefinite servant role then the Beast promises to eradicate his entire family. Yikes!\r\n\r\nThankfully, the Merchant is given one day off from the Beast’s clutches to inform his selfish-minded children of his dilemma at large. When the Merchant says his last goodbyes to his family a concerned Belle gets word of her father’s inescapable fate. Feeling guilty and somewhat responsible as the recipient of the so-called forbidden red rose Belle rushes over to the castle and offers herself as a suitable replacement for her father’s harsh sentence as the Beast’s human piece of property. Fortunately, the Beast accepts the swap as Belle is allowed to assume her father’s servicing duties. Thus, Belle benefits from the Beast greatly as he occasionally spoils her with pretty outfits and lets her enjoy the castle’s majestic surroundings–a far cry from where she hails from domestically. The stipulation is that Belle must have a mandatory dinner with the Beast each and every evening. Otherwise, the co-existence between the duo is solid and non-confrontational.\r\n\r\nSoon, the lonely Beast would start to develop romantic feelings for his acquired comely helper. At first Belle is repulsed by the fact that her hideous-looking overseer would dare to suggest that his heart yearns for her especially when this seemingly corrosive creature had her father (and currently now her) in a reluctant arrangement to serve his anti-social, personalized needs. Belle eventually realizes that the Beast is rather intriguing to her and not as sinister as she first imagined. Their bond tightens as the days go by and Belle cannot help but dream about how the Beast came to be from ages ago. Surely he must have been captivating in his regal heyday and stylized existence despite whatever heavy-handed pathos that had destroyed this once passionate soul. Clearly, the Beast is in search of true love and companionship so the golden question remains: can Belle be the beauty that finally eases his inner pain and comes to the rescue of his empty heart?\r\n\r\nWhen Belle requests a reprieve from the Beast for a day to check in on her father he grants her his permission but nevertheless insists that her betrayal in not returning to him may invite more devastating grieve and sadness. Surely Belle does not want the Beast to be overcome with wrought based on her potential deception. It does not get any easier when Belle learns of her riff raffish older brother and his crew that are planning on raiding the castle and killing the Beast in the process of stealing all his wealthy possessions. Naturally, Belle’s love and attraction for the Beast is set in stone as she cringes at the potential harm her misguided family has on the mind to lift his riches and end his life. Will Belle’s deep-seeded affections for the Beast be enough to prevent her wayward clan from harming a hair on her beleaguered suitor’s hunted head?\r\n\r\nGans skillfully deploys the showy special effects techniques that give glorious sheen and wonderment to this French fantasy trying to invigorate a sense of surreal romanticism. Indeed, **Beauty and the Beast** boasts a robust landscape riddled with its telling brand of atmospheric charm and escapist curiosity. Besides, a French-made re-imagining of this glossy folktale should scream volumes of a dream-like aura that paints an alluring picture. Although Gans strikes a boisterous balance in conveying his exposition with the gumption of a rousing spectacle worthy of its welcomed glitter **Beauty** still feels rather distant and incomplete without adequately generating any substantive chemistry between its lovelorn leads.\r\n\r\nIndividually, both Seydoux and Cassel bring a refreshing vitality to their suffering characterizations. Cassel’s Beast is effective as the languishing, wounded wonder imprisoned by his past emotional demons while Seydoux’s Beauty/Belle demonstrates a feisty heroine not afraid to embrace the loveliness of her persona. But Gans fails to provide any consistent rapport between Seydoux and Cassel collectively as they share awkward dinners and matter-of-fact conversations that do not seem to register with much gusto. Seydoux’s Belle aimlessly parades around in designer dresses as Cassel’s beastly kidnapper methodically pines for his curvaceous captive. In fact, Cassel’s Beast has more romantic reverence in flashbacks towards his departed wife than he does in contemporary times with his desired Belle. When the third act involves Belle’s villainous brother and the plot to ruin the Beast’s livelihood the film turns into a recycled revenge period piece that places more emphasis on the Beast’s periled predicament than the intended juicy love story between a mismatched pair of lovers building a tenet of belonging.\r\n\r\nGans (and co-writer Sandra Vo-Anh) deliver a _Beauty_ of a package that befittingly wallows in the shadows of previous_ Beast_ editions. This fairy tale falls short of its entertaining goal despite its pleasing, tangy wrapping.\r\n\r\n**Beauty and the Beast (La Belle et La Bete)** 2016\r\n\r\nShout! Factory Films\r\n\r\n1 hr. 48 mins\r\n\r\nStarring: Vincent Cassel, Lea Seydoux, Andre Dussollier, Eduardo Noriega, Audrey Lamy, Myriam Charleins, Nicolas Gob, Jonathan Demurger, Yvonne Catterfeld, Louka Meliava, Sara Giraudeau\r\n\r\nDirected and Co-Written by: Christophe Gans\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Fantasy and Romance/Sci-Fi/Mystery and Suspense\r\n\r\nCritic’s Rating: ** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-09-25T12:14:24.268Z"}, {"movie_id": 197796, "review_id": "59b1ebfbc3a3682443037569", "author_rating": 7.0, "review_text": "**The French version of the famous fairy-tale.**\r\n\r\nI should have seen this before the latest Disney version of the tale. It came a couple of years ago, with a wonderful cast and visuals. French cinema is not a great vfx powerhouse. Unlike most of the famous Hollywood mythical and fairy tales originated from Europe, it's rare to see them converted to films in the similar fashion in its homeland. One of the reasons was the international market, to earn back everything they have spent for it, and more. When such projects do happen, sometimes the filmmakers tie up with Hollywood co-production to secure returns. Even if you take this film's worldwide box office, nothing overwhelming. But the challenge they had taken was truly appreciable.\r\n\r\nThat's not it, this is the most redesigned versions of them all I've seen so far. Because I haven't seen any other than Disney's, excluding the modern timeline adaptation like 'Beastly', 'I' et cetera. Yeah, even the Disney's live-action retained original from their animated version, but visually extraordinary. And in here, the story was same, thought told in a different way. The graphics too were very nice, I did not expect that. Despite it is being a fantasy and a children's tale, the contents were more serious. That reveals they were very keen to bring the adults to the screens than the kids. Yet nothing too seriously targeted the grownups like 'Tale of Tales'.\r\n\r\nEveryone knows the basic storyline of this tale. A recently lost their fortune, a family of six siblings with their father relocates to a small farmhouse. No one other than the youngest daughter, Belle, was happy to be in such nature surrounded place. But one day when her father got into a big trouble, she takes his position and becomes a prisoner in an abandoned castle. Since then she begins to learn about the mystery man of the castle, particularly his past, reason to be ended like that. And following, a twist in the narration leading to the finale, everyone's fate will be revealed.\r\n\r\n> ❝Remember... A life for a rose.❞\r\n\r\nThe film was two hours long and well filled with the scenes in it all over. It doesn't feel like we're watching a fantasy film. The colours, costumes, medieval story, misty mountain, all is the major reminder that you are watching a fairy-tale. Though you won't get anything magical from the story right away. Not until the third act. As for the story, from such vastly known tale, you can't expect any major surprise. As I said, some minor changes can be witnessed throughout. But such kind of scale the flick has in all the department, that too coming from Europe makes it a very special.\r\n\r\nDefinitely no to comparison with the Disney's. Both of them were fine products on their own way. But people would compare and pick one when they are based on the same source. That can't be stopped. Disney had created their own brand, aiming for kids. You can find the people who liked both the live-actions. I never knew the original tale, I mean from the original source/text. Those who are familiar with are saying, this is most closest one. But something I did not understand was the Beast was cute furry Beast, just like Disney's. I anticipated something tough physique, hard character, I mean Beast as a real Beastly.\r\n\r\nExcluding that slight displeasure, I have had no other complaints with the film. I enjoyed it, yet there's another thing which is actually a question rather than a disagreement. The actors did their parts, though I felt the Beast character should have been played by a younger one. Vincent Cassel is a brilliant French actor and he did his best for it. Lea Seydoux as Beauty surely an excellent pick. The direction was good. Cautiously spent for everything in the film. So they have got a fine final product. Most of the people going for it, only keeping in mind Disney. You won't get that Disney's singing, dancing, overall appeal. One must clear off his mind from any great ideas and then only give it a try. Remember, it is not a very good film, but simply a good film.\r\n\r\n_7/10_", "created_at": "2017-09-08T01:01:47.495Z"}]