[{"movie_id": 507076, "review_id": "5cc83f090e0a2633d0f12d32", "author_rating": 8.0, "review_text": "A french dance troupe, staying for a long weekend in some sort of school building, decide to party after rehearsal, while a wintry blizzard rages outside. Someone spikes the punch, and all hell breaks loose. \r\n\r\nThe dance scenes are engaging, the visuals hypnotic, the performances are somehow real and completely over the top, and the chaos and carnage intense and memorable. Long, drawn out tracking shots, one of which lasts for 40+ minutes, follow the dancers as the drugs take hold and any hint of humanity falls by the wayside.\r\n\r\nAwful, intense, nightmarish film that I would never recommend to anyone, and would probably never watch again, but was so insanely good. Makes me want to take more acid, but also never take it again...\r\n\r\nBe warned, not for the feint of heart, the most intense film I have seen in a long, long time.", "created_at": "2019-04-30T12:26:49.568Z"}, {"movie_id": 507076, "review_id": "5ceef7fa0e0a2615b5cb7355", "author_rating": 9.0, "review_text": "**_A disgusting, morally reprehensible work of insane genius_**\r\n\r\n>_LSD or mainly alcohol can bring you back to a more reptilian way of thinking, you are not human anymore. It is all about survival, about reproducing the species, about sex and domination. The moment we start losing control of the logical brain we go to a psychotic way of thinking._\r\n\r\n- Gaspar Noé; \"Gaspar Noé on why his orgiastic Cannes sensation Climax should be shown to kids: 'It's very educational'\" (Kaleem Aftab); _The Telegraph_ (May 15, 2018)\r\n\r\n_Climax_, the latest film from Argentinian-French provocateur Gaspar Noé, is a disturbing, depraved, disgusting, and debauched piece of absolute insane genius that I thoroughly adored from beginning to end, and which I never, ever, want to see again.\r\n\r\n_Lord of the Flies_ (1954) by way of Heronimus Bosch or Zdzisław Beksiński, _Climax_ is what you might get if you mashed-up Pier Paolo Pasolini's _Salò o le 120 giornate di Sodoma_ (1975), Darren Aronofsky's _mother!_ (2017), and Anne Fletcher's _Step Up_ (2006); a dance movie that morphs into a horror film, which then attempts to show the audience a literal hell on Earth. In this sense, it's a perfect fit for Noé's oeuvre, focusing as it does on physical disintegration, psychological collapse, and what could be termed \"scorched psyche(s)\". However, considering he is such an infamous figure in world cinema, and considering how honed his overriding thematic preoccupations are, it's strange when you consider that in a career spanning twenty years, Noé has directed only four features prior to _Climax_; _Seul contre tous_ (1998), _Irréversible_ (2002), _Enter the Void_ (2009), and _Love_ (2015). If you've seen any of them, you'll know that his reputation for excess and pushing both his characters and his audiences to the extreme is well earned, and with _Climax_, he takes that audience and those characters further than ever before. Granted, there's nothing here to rival Le Boucher's sickening attack on his pregnant wife from _Seul contre tous_, or the near-unwatchable rape or fire extinguisher scenes from _Irréversible_. However, whereas those films feature sudden moments of barbaric violence punctuating (relatively) quotidian narratives, in _Climax_, the oppressive feeling of dread is unrelenting, affording the audience not even a moment to drop their guard, as not only is there a possibility that something horrific might be around the corner, chances are something definitely is; once everything kicks off, there is simply no reprieve. So even though the acts of violence are not, in themselves, as extreme as some of those in Noé's back-catalogue, the cumulative effect is far worse. Obviously, this makes the film something of an endurance test, even at only 96 minutes, but this is precisely the point – Noé _wants_ the audience to be utterly exhausted by the end, and he employs numerous confrontational and disorientating techniques to achieve such. Disney this most definitely is not.\r\n\r\nSet in the winter of 1996, and allegedly based on a real incident in France that year, the film focuses on a dance troupe putting the finishing touches to a performance before embarking on a national tour, to be followed by a series of dates in the US. Apart from the opening shot, and a couple of quick shots towards the end, the entire film is set in the rehearsal space; an isolated and unoccupied hall. Upon finishing rehearsals, the troupe starts to party, with most pairing off to discuss who they've slept with, who they want to sleep with, and who they've unsuccessfully attempted to sleep with, as well as all manner of sexual, drug-related, and hedonistic topics (the conversation about the logistics of anal sex is particularly funny). Although we primarily follow Selva (Sofia Boutella), the group's choreographer, several of the others receive a decent amount of characterisation; the troupe's manager Emmanuelle (Claude Gajan Maull) who has brought her son, Tito (Vince Galliot Cumant), along to rehearsals; Selva's best friend, Lou (Souheila Yacoub), who is hiding a secret from the troupe; self-styled ladies' man and \"_walking invitation to an STD_\" David (Romain Guillermic), who is desperate to sleep with Selva; Daddy (Kiddy Smile), the troupe's DJ; unhappy lesbian couple Psyche (Thea Carla Schøtt) and Ivana (Sharleen Temple); and Gazelle (Giselle Palmer), of whom her brother, Taylor (Taylor Kastle), seems a little overprotective. As the night wears on, it becomes apparent that one of their members has spiked the sangria with powerful LSD. Briefly remaining lucid enough to begin pointing fingers at one another, they round on the one person who wasn't drinking, Omar (Adrien Sissoko), and throw him out into the snow. However, shortly thereafter, the drug kicks in, and each of the troupe descends into their own personal Hades of paranoia, aggression, and/or uninhibited sexuality.\r\n\r\nIn lieu of any kind of title card or opening credits, _Climax_ begins with an abstract and non-descript shot of pure white. So visually indeterminate is the image (it could literally be anything) that at the screening I attended, most people (myself included) didn't even realise the film had begun. Scored to the disconcerting and otherworldly sounds of Gary Numan's \"Trois Gymnopedies (First Movement)\" (1980), it is only as a girl staggers into shot from the top of the frame that it becomes apparent we are looking directly downwards onto a snowfield. The girl, dressed in a black dress, is in great distress, leaving a trail of blood in her wake. After a moment, she collapses onto the snow, her body convulsing, unable to go any further. The camera then revolves upwards along the vertical-axis through 360°, a shot anyone familiar with Noé's work will immediately recognise. Revealing the bare branches of a few nearby threadbare trees, the movement immediately establishes that we are in an isolated location in the dead of winter. By the time the frame returns to its starting position, the girl's struggles have fashioned a hideously disproportioned and asymmetrical red-tinted snow angel. She struggles for another moment, and then she is still. Theoretically, this could be the clichéd opening scene to any generic slasher movie (the innocent and already injured victim desperately trying to get away from the killer, but too exhausted to continue). However, the striking imagistic composition, the economy with which the shot conveys so much information, and the unusual musical choice, all serve to betray the fact that this is not the work of an anonymous journeyman for hire, but is instead the meticulously composed opening salvo of an auteur who knows precisely what he's doing.\r\n\r\nA moment after the girl falls still, the film surprised me for the first (and certainly not the last) time, as the entire closing credits roll (upwards, obviously), right to the copyright information. Initially, I didn't fully understand the point of this. Obviously, the opening shot is, chronologically speaking, pretty late in the narrative, so I was thinking it was just Noé being cute, alerting us to the fact that we'd just seen the closing scene. However, it was only when the film ended that I realised the absolute genius of this aesthetic decision; with no closing credits at the end, the audience is allowed no transition from the film to reality, the buffer that we all take for granted is absent, and the effect is startlingly disorientating. As the film ended, the lights immediately popped on, with no music to play us out, no darkened theatre to recompose ourselves, we're just suddenly back in the garish real world, afforded no opportunity to decompress. Indeed, to enhance the sense of discombobulation for which Noé is obviously striving, the last 15 minutes or so of the film are literally upside-down, with the silhouetted dancers looking like bats hanging from the ceiling (this effect is even extended to an intertitle, which every single person in the theatre tilted their head to try to read). The audience is thus placed in the same position as the characters – the absence of closing credits, and the inverted image create a sense of confusion and discomfort, just as the film is depicting the surviving dancers coming out of their drug-induced mania and back to the real world. As he attempts to do throughout the film, Noé places the audience directly into the psychological reality of the characters. This is extraordinarily proficient filmmaking of the highest calibre.\r\n\r\nAfter the opening scene, the film then cuts to a TV screen showing the dancers' audition interviews. Surrounding the TV are books and films which announce some of _Climax_'s influences, and speak to its genesis. The films include Luis Buñuel's free-associative surrealist masterpiece, _Un Chien Andalou_ (1929); Kenneth Anger's surrealist occult film dealing with the Thelema religion, _The Inauguration of the Pleasure Dome_ (1954), which, importantly for Climax, features footage from the hell sequence in Francesco Bertolini, Adolfo Padovan, and Giuseppe De Liguoro's _L'inferno_, a 1911 adaption of the _Inferno_ book from Dante Alighieri's _Divina Commedia_; Masaki Kobatashi's dark samurai film, _Harakiri_ (1962); Dario Argento's dance-hall-based horror film, _Suspiria_ (1977); Lucio Fulci's voodoo/zombie film _Zombi 2_ (1979); Andrzej Żuławski's domestic drama-cum-horror film, _Possession_ (1981); and Rainer Werner Fassbinder's serial killer/LGBT film, _Querelle_ (1982). The books include Franz Kafka's 1915 novella, _Die Verwandlung_, in which a man mysteriously begins to change into an insect; Georges Bataille's 1928 novella _L'histoire de l'oeil_, which charts the increasingly extreme sexual perversions of a young couple; and Pierre Petit's 1992 biography of the homosexual and transvestite painter and photographer Pierre Molinier, _Molinier, une vie d'enfer_. This in-your-face intertextuality at the outset of the film very much sets up the tone of the work to come, alerting the audience as to the style and intentions of the filmmakers. Aside from that, the interviews also do a terrific job of establishing yourself the differing characters, as do the dialogue scenes after the rehearsal but before the LSD has kicked in.\r\n\r\nThe next scene is the much-talked-about dance number, which is easily the best dance sequence I've ever seen on film. Scored to remixed versions of Cerrone's \"Supernature\" (1977), Patrick Hernandez's \"Born to be Alive\" (1978), and M|A|R|R|S's \"Pump Up the Volume\", the scene is simply breath-taking. Shot in a continuous 20 minute take, the dancers move at extraordinary speeds, with no single position held for more than a second or two. I know very little about dance, so I'm unable to really articulate just how extraordinary and original the scene is. I'm also not even sure as to the style of dancing. Krumping? Waacking? Voguing? An amalgamation of all three? The single-take grants the scene a sense of real-time immediacy and in-camera verisimilitude which one can usually only acquire from a live performance – this isn't something constructed by an editor from a series of individual takes, this is something literally happening before our eyes, no cheating, no effects, simply a group of insanely talented and utterly mesmerising performers. Put it this way, the dancing is so impressive, if I hadn't known it was being performed by professional dancers, I would be convinced some of it was CGI. Indeed, although it's shot in one take, the camera is anything but stationary, moving back and forth, and oftentimes directly above the dancers. In this sense, the viewer is not only watching the dance, they are, in effect, participants. Speaking to _The Telegraph_, Noé states,\r\n\r\n> _I wanted the camera to feel like another dancer. We saw the joy of the dancers moving and I wanted to replicate that with the camera moves._\r\n\r\nAgain, he is working to transpose the audience into the world of the film – he doesn't simply show us a dance sequence, he tries to include us in it.\r\n\r\nThus ends the first section of the film. The second, and much shorter, section is the dancers engaged in conversation with one another (and, in contrast to the first section, is made up of a multitude of edits eschewing any sense of match-cutting). The third, and longest, section sees Selva realise the sangria is spiked, the troupe attempt to find out who did it, and the chaos that ensues when the drugs take hold. These three sections (dance, conversations, and drugs) roughly correspond to the three books of the _Divina Commedia_ - _Paradiso_, _Purgatorio_, and _Inferno_. However, in the poem, the order is _Inferno_, _Purgatorio_, and _Paradiso_, charting the ascension of the soul from the Inferno of Hades to the Paradiso of spiritual unification with God and Christ in heaven. In the film, the movement is in the opposite direction, as the Paradiso of the harmonious and unified perfection in the dance sequence gives way to the calm Purgatorio after the consumption of the LSD, but before it has taken over their reason. Finally, they descend to the Inferno – the dance-hall becomes a deadly battleground, a hell on Earth, bathed in deep reds and greens, as the entire troupe are overtaken by psychic torment, manifested as physical destruction, with the body itself both the implement of ruination and the primary victim.\r\n\r\nIn charting this allegorical journey, one of the most immediately interesting things is the obvious visual contrast to the dance sequence. Whilst the dance sees the group acting in unison, all of a single mind, the third section of the film shows them fragmented and in disarray, each individual driving towards their own purpose, whether it be paranoia, hedonism, or what they believe they need to do to survive. The harmony of the troupe has given way to the horror of individualised disintegration and psychological collapse. This reminded me a little of the fall of Lear, sinking from grandiose threats such as \"_Come not between the dragon and his wrath_\" (I.i.130) and \"_The bow is bent and drawn, make from the shaft_\" (I.i.152), to his pathetic \"_I am a man more sinned against than sinning_\" (III.ii.49) and \"_I am a very foolish, fond old man_\" (IV.vii.60) - in the context of the film, the fall from the height of the dance to the bestial nature of the third section is no less epic.\r\n\r\nSomething that bridges the two sections, however, is the music, which literally never stops once the film begins. Consisting of a mixture of '80s and '90s electronica and anachronistic early 21st century techno, as the film progresses, and in keeping with the descent into hell, the softer sounds of the dance sequence give way to more intense pieces such as Suburban Knights' \"The Worlds\" (1990), Dopplereffekt's \"Superior Race\" (1995), and Aphex Twin's \"Windowlicker\" (1999), whilst the film closes, bizarrely, with a remix of The Rolling Stones' \"Angie\" (1973).\r\n\r\nPerhaps the most noticeable similarity between the dance sequence and the third section of the film is that both are shot in single-takes. The drug sequence lasts 42 minutes, and is presented as one continuous shot of the world collapsing in front of the characters' eyes - although in reality, it is several long takes where the edits have been disguised, à la _Birdman: or (The Unexpected Virtue of Ignorance)_. Following first one character before trading off to someone with whom they have interacted, director of photography Benoît Debie's (_The Runaways_; _Spring Breakers_; _Lost River_) camera moves almost ballet-like throughout the space, sweeping in and around the characters as they fall apart. The lack of any editing, as with the dance sequence, enhances the immediacy of the image, heightening the sense of paranoia from which the entire group are now suffering, and leaving the audience as exposed as the characters themselves.\r\n\r\nAs the rehearsal space turns into a nightmarish landscape comparable with Hans Memling's, \"The Last Judgement\" (1467-1471), Pieter Bruegel the Elder's \"The Triumph of Death\" (c.1562) and \"Dull Gret\" (1593), Peter Paul Rubens's \"Massacre of the Innocents\" (1636-1638), or Francisco Goya's \"Saturn Devouring His Son\" (1819-1823), the film treats us to a girl's head being set on fire, a pregnant girl being kicked repeatedly in the stomach, a girl slashing her own arm and face, a contortionist contorting to the point where he literally splinters his own bones, a child locked in a room full of cockroaches, a man scratching his chest to the point that it turns into four red bloody streaks, public urination, lesbian rape, incest, and suicide. The troupe descend into a kind of deeply twisted and barbaric gang-mentality, what we might expect if _Lord of the Flies_ had been written by the Marquis de Sade, urging one another on to acts of unimaginable and ever-increasing violence and degradation. As the veneer of civilisation is stripped away, the characters devolve before our eyes; some become concerned only with sex, others with violence, whilst a small few try to help their fellow sufferers, although even they ultimately give in to their basest instincts. Indeed, Noé tells _The Telegraph_,\r\n\r\n> _it's like the start of 2001, we see the apes and then they evolve into humans, and in the case of my film it is like the humans go back to being apes. Humans are going back to their original forces […] LSD or mainly alcohol can bring you back to a more reptilian way of thinking, you are not human anymore. It is all about survival, about reproducing species, about sex and domination. The moment we start losing control of the logical brain we go to a psychotic way of thinking._\r\n\r\nBut what is it all about? Is there any kind of theme underpinning the whole thing, in the same way that _Salò_ isn't really about forcing young girls to eat faeces or cutting off boy's tongues, it is actually about (amongst other things) political corruption, the abuse of power, fascism, and economic inequality. It would certainly be easy to dismiss _Climax_ as thematically empty, arguing that the brilliant camerawork and pumping soundtrack serve only to cover up the vapidity at its core, to argue that the depravity and excess is not in the service of any grand universal point or allegorical thinking, but simply to show attractive young people tearing one another apart. Even if one buys into Noé's devolution argument, the idea that the film presents \"man as beast\", it still doesn't offer thematic relevance. So, in a nutshell, is _Climax_ shocking for the sake of being shocking?\r\n\r\nNot exactly.\r\n\r\nYes, this is exhibitionist cinema through and through, the type of film that dares you to look at it intently until you can't look anymore, as if the filmmaker is standing behind you saying, \"I knew you'd look away.\" But there is definitely more to it than that. For example, there is some kind of political point buried beneath the carnage and broken bodies; the dance sequence takes place in front of a massive French flag, whilst the credits declare, \"_A French Film. And proud of it_.\" Perhaps related to this, the troupe is made up of a cross-section of Europeans – gay, straight, men, women, transsexual, black, white, eastern, western. In the explosion of excess hedonism and hysterical mayhem, does this cross-section of ethnicities, genders, and sexual orientations come to represent European multiculturalism tearing itself apart? Is Noé saying that if France continues to accommodate such a diversity of disparate cultures, chaos will ensue? Possibly. In this sense, the early parts of the film would represent the liberal ideal of perfect multicultural harmony, whilst the later section is a conservative's wet dream, showing what could happen in such a melting pot. The dance sequence thus represents a politically harmonious multicultural society composed of a barrage of norms and peoples, all working together for the greater good. In relation to this, perhaps tellingly, Omar, the person who is initially blamed for spiking the sangria, is Muslim (which is how everyone immediately knows he wasn't drinking). Is this merely a plot point, or is it part of the larger allegorical canvas?\r\n\r\nTo flip this argument, is Noé saying that in such a multicultural _milieu_, with fear of Islam at a high, it's very easy to blame everything on the Islamic \"Other\". Additionally, Noé depicts that dance scene with such reverence and awe that this kind of social critique, barely straddling the line between patriotism and xenophobia, doesn't seem to sit especially comfortably. Not to mention that Noé himself is an immigrant – he was born in Argentina, moving to France when he was 13. Maybe he's simply criticising the hedonistic youth of today, and their love of excess. However, whilst the political allegory might be reading too much into the film, suggesting the whole thing is simply so Noé can proclaim \"kids today\" is reducing it all to a far too simplistic degree. He is no Pier Paolo Pasolini, but neither is he a curmudgeonly old man!\r\n\r\nThe fact is, I don't have a clue what _Climax_ is about. Nor do I care. Nor is it important. I would argue instead that if you spend the duration of the film trying to figure out what it's all about, then you have missed what it's all about. You can only see the film for the first time once, and it's better to let it carry you into the nether-regions rather than trying to analyse it. With that in mind, I take it for what it appears on the surface; an incredibly technically proficient depiction of a contemporary Inferno, as aesthetically impressive as it is morally questionable, as enthralling as it is disturbing, and as evocative as it is shocking, a film of unparalleled barbarism, that also stands as one of the most extraordinary cinematic achievements in recent years.\r\n\r\nIt's a work of genius. Twisted, sick, deraved genius, but genius nonetheless. It disturbed me like no film in at least a decade, and I couldn't get it out of my head for days afterwards. I absolutely loved every single crazy minute of it. And I don't ever wish to see it again. For Noé, I can think of no higher compliment.", "created_at": "2019-05-29T21:22:02.985Z"}]