[{"movie_id": 1040148, "review_id": "64bbb52dac6c7908e085dd32", "author_rating": 6.0, "review_text": "The eponymous young girl lives with her family under strict instructions never to go near the water. That all goes fine until one day she must leap to the rescue of a friend and discovers just why she ought to avoid the ocean. Her family are mortified, but quickly she discovers another family, of which she is a princess, and life-changing choices will soon have to be made. I was quite disappointed with this. The animation is really pretty basic and the story certainly does not do much justice to the mythological elements of the Kraken we might recall from \"Clash of the Titans\". Indeed, it's a sort of \"Little Mermaid\" in reverse that I actually found a bit predictable and dull. It's also unclear as to whom this film is for. The kids at the screening I was at were largely disinterested in the whole enterprise, it was too old for some and too young for others - and there is very little for the adults to take away either. Colourful and lively, yes and the characterisation of \"Uncle Brill\" is quite fun, but it's all eminently forgettable stuff, I'm afraid.", "created_at": "2023-07-22T10:53:33.521Z"}, {"movie_id": 1040148, "review_id": "653ec5cc50733c013e34f7ec", "author_rating": 1.0, "review_text": "\"Down with the White Male Patriarchy\" Literally that is almost every other sentence, coupled with the \"Anti-Colonialism\" ethos that is currently seeing people support the execution of children and call for Holocaust 2.0...\r\n\r\n... the Meh Messaging didn't exactly age well now that we know how violent it is in practice did it?  And it took less than a year.\r\n\r\nOtherwise, it has a plot, a Kraken trying to pass as human turns into a Kraken and meh-essaging.  \r\n\r\nUltimately, it's another cartoon that cares more about pushing a political message than it does entertaining the audience.\r\n\r\nAnd it's made for children... do you really want to bring little boys to a movie who's primary narrative is that white males are evil and irredeemably so?  That sort of message isn't exactly child friendly, unless you are raising your child to hate.", "created_at": "2023-10-29T20:51:24.091Z"}]