[{"movie_id": 348668, "review_id": "59288d60c3a368780a03a084", "author_rating": 6.0, "review_text": "**With an old clue, a new hunt begins.**\r\n\r\nThe third film in the 'Department Q' series that adapted from the book series of the same name. For this the director has changed, the one from 'In Order of Disappearance' and I think it was a good move, but the result was not as expected, at least not for me. As the sequels proceeding, it's losing its charm. Yeah, for me still the first film was the best one. That following parts were just okay, which rely highly on the great foundation that laid in the first.\r\n\r\nActually this story was good, despite like any cop-and-kidnapper- chase-thriller. But it was developed on the sensitive issue like faith which made the film a little shy. Because they don't want to bring in any serious debate, but wanted to balance everything as much as possible to be neutral from all kinds of this film series' fans/viewer's perspective. So you will be entertained as the title promised, but at the end if you consider it just a film, then it's okay. Otherwise, particularly from the atheist's viewpoint, its not any favourable.\r\n\r\nThe story has a clear explanation for whatever happens, especially about the film character who commits the crime. So it is a challenging time for what Carl Morck believes in. So far we saw him as a tough cop, but this particular case he's dealing with is like he had never encountered before. There are some great scenes, like chasing a train which is actually a turning point in the narration. But the rest of the film was mostly has cliché like any cop who tries to solve the crime.\r\n\r\n> ❝With that attitude you'll never enjoy a pork roast.❞\r\n\r\nThe plot for the crime was focused on the initial stage of the tale. The following narration was highly influenced by the cops and their attempt to resolve the issue. But before coming to that, an intentional connection between the two cases was not definitely a masterstroke as I expected. Although it looked something new on the screenplay, which might have worked so good in the dark and slow paced crime-thriller.\r\n\r\nWhile they are, Carl and Acid are looking to decipher the puzzle they have got which is dated back nearly a decade, now they come to know that two kids were kidnapped in a similar fashion. They begin to dig deeper from the previous clue for the new incident. If they are right, it is much closer than they have thought to solve it. But how it helps to plan for the fight and their full efforts which told in the final act with a fast pace.\r\n\r\nLittle disappointing was they wanted to remain those two cops as the heroes. So all the heroic acts were a build up from them alone in most of the accounts for the cinematic edgy moments. Especially how the finale turns out, is not appreciable from the writing perspective, other than giving satisfactory episode to the hardcore fans of the film franchise.\r\n\r\nFor me the locations were awesome, all the scenes shot at the right time of the day and its light that sets a fine tone regarding all the developments taking place. A decent follow-up and surely worth a watch if you had liked previous two films, but don't expect it to be the best in the series. Anyway, still some people think it is the best one so far. Now I think it's time to wait for 'The Purity of Vengeance' if they are on to it.\r\n\r\n_6/10_", "created_at": "2017-05-26T20:17:36.595Z"}]