[{"movie_id": 254320, "review_id": "56f3e9ae9251411a94002784", "author_rating": 7.0, "review_text": "> Another peculiar dystopian tale set in the future.\r\n\r\nFrom the director of the Oscars nominated movie 'Dogtooth'. If you are familiar with his signature movie, you will find it so good. This is not the best movie I had seen that set in the future, but like any other it was another dystopian tale. A black comedy-romance with a decent storyline, performances and overall a nice entertainer.\r\n\r\nThe pace was very depressing, but I kept hooked to it for its frequent unpredictable scenes. The first act took place in a hotel which is the introduction to the odd world and the situation where the plot opens. When it moved to the 2nd half, especially after Rachel Weisz come into the frame, the entire scenario changed to atypical romance mode and kept that way till the last with a simple twist in the finale.\r\n\r\nColin Ferrell's character was something like the one from the movie 'Her'. But not the same movie, or the theme, except the combination of the genres. It was a good movie, I enjoyed it, but not as much as others say they did. IMPO, it is a one time watch movie for its peculiarness.\r\n\r\n7/10", "created_at": "2016-03-24T13:20:46.118Z"}, {"movie_id": 254320, "review_id": "57bb8abdc3a368358d000457", "author_rating": 9.0, "review_text": "This was an odd experience, as I just recently ended a self-imposed 12-year moratorium on relationships, due to a couple of bad ones I had within a short period of time in the early 2000's. It was very intriguing to see a type of dystopia exist in which 'singledom' was so vilified to the point of actually being against the law. I would never have previously thought that such a state of events was possible, but recent trends in 'political correctedness' on the one hand and both religious and political radicalism on the other means that, sadly, nothing is impossible anymore. I thought it was a remarkable idea for a film, and both the soundtrack and cinematography were outstanding. The bizarre script and bold direction brought forth some of the best acting I have yet seen from Colin Ferrell, Rachel Weisz and John C. Reilly, as well.\r\n\r\nI'm definitely looking forward to seeing other films by this brazenly original writer/director. Long may his almost-Bunuelian take on things go forth.", "created_at": "2016-08-22T23:29:01.330Z"}, {"movie_id": 254320, "review_id": "58c17173925141731a00ad2f", "author_rating": 8.0, "review_text": "This was Yorgos Lanthimos' English language debut. It was really funny. All of the actors had to perform their lines straight-faced and with no emotion which is very strange at first.\r\n\r\nThe screenplay and direction of the film was very intelligent and perfectly highlights the themes of the film. This film was very quirky and unique and so I really enjoyed it.\r\n\r\n★★★★", "created_at": "2017-03-09T15:14:59.407Z"}, {"movie_id": 254320, "review_id": "62c8ec0a05f9cf004c835316", "author_rating": 7.0, "review_text": "_The Lobster_ is the most awkward love story I have ever watched, but despite how off putting it was it touched me in ways I did not quite expect. The plot of this film is incredibly unique. The idea of being turned into an animal if you cannot find love is so weird in the best kind of way. I found the entire movie to be very sinister in nature, always keeping me on edge about what was to come next, and that was enhanced by the sharp orchestra playing underneath every scene. Yorgos Lanthimos wrote the entire film in a very awkward way. I understand that it was aiming for that type of sharp and poignant feel, but it just did not work for me. I could not help but wonder how much better the film would have impacted me if it felt more natural. The acting in this movie is incredible, the way that everyone could act so emotionless while still feeling genuine was fantastic, even if I did not particularly care for the style. Despite all my complaints, I still genuinely enjoyed the experience, even with its ups and downs. I am still left pondering the ending of the film and that is how a movie should leave you feeling.\r\n\r\n**Verdict:** _Good_", "created_at": "2022-07-09T02:46:34.615Z"}]