[{"movie_id": 1584, "review_id": "539e1fcfc3a3683b410048dc", "author_rating": 8.5, "review_text": "You are not hardcore unless you live hardcore.\r\n\r\nThe perfect vehicle for Jack Black, a film to show that given the right material he’s a bona fide comedic actor of some worth. Plot has Black as Dewey Finn, a wastrel musician who has no job prospects and who spends his time mooching off of his best mate Ned Sheebly (Mike White). When Dewey is fired from his rock band he’s left in limbo and in danger of being homeless. But when he answers a phone call offering Ned a job assignment, Dewey decides to take it upon himself to impersonate Ned and take the employment himself; as a schoolteacher!\r\n\r\nSo it’s Jack Black in a classroom full of kids, it probably shouldn’t work, and even might seem like some sort of cruel and unusual punishment to anyone with an aversion to Black, but this is feel good nirvana and a paean to rock and roll. It’s perhaps unsurprising that it’s crammed with clichés from the classroom splinter of moviedom, the kids a roll call of characters we have seen numerous times. The spoilt swot, the roughneck, the one suffering parental peer pressure, the weight issue one and on it goes, but boy can they play music when Dewey takes them out of classical mode and into rock central.\r\n\r\nHow nice to find that director Richard Linklater and writer Mike White have managed to rise above the clichés and avoid syrupy fodder, there’s such a zest and earnestness to it all, and the kids acting is high in quality as well, led by the big kid himself, Black on full tilt. But most of all, even as the morals and life affirming threads come wading in with the pulsing rock soundtrack, it’s a very funny picture, the gag quota enormously high. Be it Black trying to bluff the kids, the kids trying to bluff everyone else - or the wonderful Joan Cusack as the scatty stickler for the rules Principal Mullins – a laugh is never far away. Rock on! 8.5/10", "created_at": "2014-06-15T22:35:59.761Z"}, {"movie_id": 1584, "review_id": "5b5ef01e925141523704077a", "author_rating": null, "review_text": "Our family loved this movie. While the language is a little strong, compared to other movies that are rated the same, it is relatively mild. If your children like rock, it is a lot of fun. If you are a family who tolerates no swearing whatsoever, or if \"kick some ass\" would shock or offend you, then it's not for you. The overall message is that uptight kids use their skills to create a rock show, a slacker finds a calling and realizes what is really important in life, and forgiveness abounds.\r\n", "created_at": "2018-07-30T11:01:50.227Z"}]