[{"movie_id": 1656, "review_id": "61f5785281140f00bd25f80b", "author_rating": 3.0, "review_text": "I finally got around to watching this yesterday. I'm sorry to say that this movie is a laughable sequel to the first one also starring Bandaras and Jones. It would be hard to convince me that the same director was involved with both projects if I hadn't read it in the credits for myself. \r\n\r\nZorro 'never kills anyone' with his sword. He smacks them on the backside, slaps them on the face, or flips them on their butts. This doesn't stop the villains from killing folks; they have a field day while Bandaras is more concerned about waving to the cheering crowds than saving his friends.\r\n\r\nThe hired henchman is within Zorro's killing field from the very first scenes right through the movie. However, for some mystical reason not (revealed by the film makers), Zorro lets him and his friends escape each time, until Jones finally puts him down near the end.\r\n\r\nConstant bickering between Bandaras and Jones throughout the flick, and Zorro's playful heroic non lethal fighting style, ruin this potentially good film. \r\n\r\n1&1/2 stars out of 4, for the great performance by 'Tornado' (the horse), or it would be a complete flop.", "created_at": "2022-01-29T17:24:34.120Z"}, {"movie_id": 1656, "review_id": "644c1824e2ff320953d24c22", "author_rating": 9.0, "review_text": "**A clever and dextrous sequel, and a good adventure movie to spend some family time.**\r\n\r\nI really liked the first film, one of the best modern swashbuckling films, and I didn't expect anything too inferior from this one, which has the ability to create a good continuity with its predecessor. The action takes place a few years later, during the ephemeral Republic of California, which had achieved independence to join the USA. In the film, Diego and Elena's marriage is falling apart, and they end up separated. She is then coerced into working for the Pinkerton's, who seek to keep tabs on a European aristocrat who has just moved to the region, and whom Elena already knew from her youth. Meanwhile, Diego tries to stay active as Zorro and reconcile that with his obligations as the father of the young and willful Joaquin, a deep admirer of the masked hero who is not yet aware of his father's double life.\r\n\r\nDespite being undoubtedly a good film, it is slightly weaker than its predecessor because it has a more complicated script and tries to do more things at the same time. Diego, Elena and Joaquin act by themselves against different opponents. That's not a bad thing, just different: the film is full of action and adventure, it's aesthetically beautiful and fun. What I really didn't like is the predictability of the story, roughly from the middle onwards, and that story of the Knights of Aragon which, besides being a very stupid cliché, is something absolutely far-fetched.\r\n\r\nAntónio Banderas and Catherine Zeta Jones return to their characters, and they are very good at bringing them to life, which is an excellent point in favor of the whole film. The best scenes here, in addition to the fights and action, are the various scenes where both act together, with excellent chemistry and wonderfully developed joint work. The young actor who gave life to the son of both characters, Adrian Alonso, is not particularly brilliant, but he does what he needs to and is effective. Rufus Sewell is not unpleasant, he exudes an almost aristocratic presence, and that made his character more believable, but it doesn't make him a really fearsome villain.\r\n\r\nTechnically, it's a pretty standard film with nothing special, and the most common ingredients of Hollywood adventure blockbusters: extremely choreographed fights with no chance of happening in a real situation, but cinematic and fun, a light, polite style, a lot of political correctness very common in family films, absence of dead moments thanks to an edition that gave rhythm and some velocity to the story, good sets and costumes that look beautiful, even if they are not exactly rigorous from the historical point of view, and a lively soundtrack, which pulls the atmosphere up and makes the film livelier and more dynamic, harmoniously blending with the cinematography, where warm colors dominate the look.", "created_at": "2023-04-28T19:01:56.735Z"}]