[{"movie_id": 302156, "review_id": "57d30896925141548d000720", "author_rating": 6.0, "review_text": "**A man with the two minds!**\r\n\r\nThis is a very familiar theme, but a different format and gives a different scientific excuse to execute the story. It is kind of 'Face/off' and 'Self/less' meets the 'Hardcore Henry'. It has some decent stunt sequences, but most of the film was just running and chasing around. And then there's a youngster whose involvement was the centre of the narration.\r\n\r\nIt all begins when an American secret agent was killed before completing his mission in the London. The important data from his brain were transmitted to a prison serving convict and then after the surgery he goes loose. So the man hunt begins against the running out of the time where the original mission needs to be accomplished. How the rest of the story shapes up were a fast paced action-thriller.\r\n\r\nSomething I don't like in the todays films are the open ending keeping in mind a sequel. This was an average box office film, but they might make another film. Wonderful cast, though. There are too many big names and everybody did the brief roles, except Kevin Costner in the main character, a tough one. But I did not know it was his film till I watch. In the poster he looked like somebody else. Though he did well along with the others, particularly Gal Gadot who I saw recently as Wonder Woman and now as an ordinary wife. A swift pace, but the story was nothing, overly depended on the star value as well as the stunts and the technical quality. Overall film was okay kind, partially entertaining, because of the performances.\r\n\r\n6/10", "created_at": "2016-09-09T19:08:06.854Z"}, {"movie_id": 302156, "review_id": "5f6b2428d55e4d00346a71ab", "author_rating": 6.0, "review_text": "Another knock-off of well-known subjects.\r\n\r\nSolid making, good cast, some action and brutality, big stakes; all the formula components are there. \r\nBut the big drama fails to be emotionally engaging.\r\n\r\nOK to watch with lowered expectations, waste of time if you expect more.", "created_at": "2020-09-23T10:32:08.503Z"}]