[{"movie_id": 526019, "review_id": "5e7d577feec4f30547aa3d18", "author_rating": 4.0, "review_text": "The dead of winter is the time studios like to shove their bottom-basement junk into theaters, bringing us movies that are instantly forgettable and brimming with mediocrity. The female-driven buddy comedy “Like A Boss” is a great example. This tolerable movie is perfectly fine for a mindless girls’ night out, but it never sets its standards high enough to achieve much more. But why would it?\r\n\r\nBest friends Mia (Tiffany Haddish) and Mel (Rose Byrne) are living their best lives running a makeup company they’ve built from the ground up. Things haven’t been going so well on the financial front, and the women find themselves over their heads in debt. When cosmetics industry titan Claire Luna (Salma Hayek) presents them with a huge buyout offer, it puts a strain on their friendship that the two may not ever be able to repair.\r\n\r\nIf you’re looking for a fun and insightful view at the real-life experience of female business owners, you won’t find it here. What you will find is yet another male-written movie that feeds the narrative that the beauty industry equals female empowerment. It’s not offensive, but it’s a stale idea. How many movies can you count that use the old “you need makeup to feel pretty, but also never forget to be yourself!” narrative? It’s not offensive, but it’s another Hollywood rubber stamp on what the industry thinks are the ingredients necessary for a movie that’s supposed to be made for women.\r\n\r\nThe comedy is sometimes funny but mostly strained, as Haddish and Byrne are constantly struggling in an effort to sell the lousy one-liners. Their chemistry is terrific, but there’s only so much these two talented ladies can do with such a lackluster script. Hayek is an over-the-top caricature who is given very little to do. Her shtick can be amusing in the right place at the right time, but it isn’t here.\r\n\r\nThis isn’t a terrible movie, but it’s light years away from being an instant classic. In fact, this tired effort wouldn’t even orbit the general conversation. But “Like a Boss” is still just barely good enough if you are a fan of the two leads or if you’re looking for easy-to-swallow entertainment.", "created_at": "2020-03-27T01:31:43.781Z"}, {"movie_id": 526019, "review_id": "6020659fdd2589003eb632fd", "author_rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nIt's a middle-class business versus high-class business trope, which normally would be a poor vs the rich / elite trope, so it's a slightly different spin on on a family setup.\r\n\r\nThe real story seems to be a dysfunctional family sister-sister trope as they're going through the first.\r\n\r\nThere is a lot of fun in watching the 3 ladies \"fight\" each other, but it's doesn't feel like a very impactful or eventful story.\r\n\r\nA decent throw away watch designed for lady business people.", "created_at": "2021-02-07T22:11:43.148Z"}]