[{"movie_id": 274870, "review_id": "58bee2e49251416084066b13", "author_rating": null, "review_text": "A science-fiction movie that has dazzling scenery but also goes into some disturbing territory.  Two people (Jennifer Lawrence, Chris Pratt)  are stranded on a malfunctioning starship over which they have little control.  At first they can divert themselves with all the material wealth at their disposal.  But when one commits a crime against the other, there is no society and no judicial system that can handle the offense.  How can they work it out the ethics of punishment, penance, and rehabilitation between them?\r\n\r\nThe movie is marred by some scenes that look impressive but aren't scientifically accurate, particularly where gravity is concerned.  Probably added by studio suits who wanted to wow the audience but didn't understand or care about the underlying science.  But that's par for the course for most science fiction movies.", "created_at": "2017-03-07T16:42:12.276Z"}, {"movie_id": 274870, "review_id": "598ca85d9251411078000b8c", "author_rating": 8.0, "review_text": "**A space-travel tale!**\r\n\r\nI was going to watch it, but not expecting it to be a masterpiece. It was not, yet surprised to be a lot better film when it comes to todays film overcrowded with space themes. The entire story takes place on a spaceship. It's a space journey tale, when the mankind with 5,000 on-board heading for a new home planet, but one of them unexpectedly wakes up from his hibernation pod. It's supposed to wake him and everybody a few months before their destination, so now he's up nearly a century early, and what he plans to do is what the adventures covered in the rest of the film.\r\n\r\nThere's no connection to the 2008 film of the same name. Initially I thought it was like a live-action version of 'Wall-E'. Not entirely, only a few scenes and the main two characters remind Wall-E and Eva. It is also a limited cast film and I loved the simple screenplay, but strong enough to be one of the best in its kind. The actors were very good. The visuals were beautiful, a perfect film for the late night to watch alone peacefully.\r\n\r\nFrom the Norwegian director of 'Headhunters' fame. This is not his Hollywood debut, but previously he had got an Oscar nomination for the film 'The Imitation Game'. The concept was like 'The Blue Lagoon' or kind of the space version of the Eden Garden tale. I had predicted a few scenes, those were too simple to do that. The real big thing came in the later part, especially when all the focus shifts to more than the initial narration. Scientifically, not everything believable, but cinematically, anything can be possible. So with a such concept, the film headed to the conclusion where a twist came into play. Entertainment is guaranteed. One of the year's best that should not be missed. Recommended!\r\n\r\n8/10", "created_at": "2017-08-10T18:39:25.838Z"}, {"movie_id": 274870, "review_id": "59b534679251410f92000a8f", "author_rating": 7.0, "review_text": "Crusoe and Girl Friday.\r\n\r\nPretty much reviled by professional critics, Passengers has overcome that to hold affection with a good portion of the sci-fi loving public. More safe sci-fi footings than anything remotely ground breaking, it ends up a a tidy romantic piece that's laced with pertinent questions involving man and his/her reactions to extraordinary scenario's.\r\n\r\nAlthough the viewer is for the most part hankering for action to explode off the screen, it's only when - in the film's last quarter - you realise that it was actually working fine as a character study without the fireworks.\r\n\r\nChris Pratt and Jennifer Lawrence have bunches of charisma, in fact more than enough to carry the story through its more shaky elements. They in turn are aided by Michael Sheen who is perfectly cast as the Android (not Robot!) bartender Arthur.\r\n\r\nThe effects work is impressive and director Morten Tyldum stitches the set pieces together admirably, the highlight being a rather superb gravity loss sequence. While the sound mix is also to be applauded.\r\n\r\nNewcomers should expect a Robinson Crusoe love story in space as opposed to a sci-fi actioner, though one with more cerebral strains than at first hinted, because then the pic delivers a good time and adds to what is turning out to be a rather great decade for sci-fi fans. 7/10", "created_at": "2017-09-10T12:47:35.847Z"}]