[{"movie_id": 319993, "review_id": "56cdf1c692514152ab0001b9", "author_rating": 9.0, "review_text": "> Adventurous,  funny, thrilling and shocking!\r\n\r\nThe second movie for me from this director after a beautiful child custody dramedy, 'Everybody in Our Family'. This was totally different, a historical theme that takes place 200 years early to the present. This is a black and white flick that perfectly blends with the timeline of the narration. The Romania's submission for the 2016's Oscars. I have not seen all the foreign movie nominees, but having seen the out of the contest films like this and Brasil's 'The Second Mother', they are a lot better than the actually in the race film, 'A War'.\r\n\r\nComing to this movie, I was almost certain that I wasn't going to write a review after knowing about it through the trailer and the synopsis despite good ratings and praised by the critics. Because I felt this must be a boring kind, so was thinking to get over with it. Like there's a saying, don't judge a book by its cover, it happened right here for me with this movie. So this is where I realised after the watch that the Academy Awards was totally wrong for snubbing it. In fact, this was one of the best foreign movies I have seen in the last six months or so.\r\n\r\n> \"When a wise man opens his mouth, open your ear.\"\r\n\r\nThey might have had a solid reason for that, that I don't know, but my guess is the film's ending. The opening was slow, the dialogues were loud, but sometime foolishly funny and sometimes wisely funny. Overall you must pay close attention, so that you can enjoy jokes. Definitely a wonderful adventure, like any other man hunt films, this was so serious on that affair, but viewers won't realise that till the final scene. A well supported music throughout to tell an incredible tale about two men on the mission who meet different people, land, culture and language.\r\n\r\nIt is 1835, in the Eastern Europe region, Wallachia, the father-son duo from the police force on a trail to track down a runaway slave. They must go beyond their territorial limits to find him. On their way, they came forwards to the people they just met needed help, and vice versa, After the intense search they grab him in the remote place, but his version of the story to flee differs. So what comes later is the final act and a very shocking conclusion.\r\n\r\n> \"Fear is shameful, but healthy. It's God's gift.\"\r\n\r\nNot so interested to very into it is something that I was not expected. The reason was obvious it was funnier than I thought. Besides that, I was uncomfortable with the slavery theme. It's turning me off from having a good time and beginning to concern. But that's how the old world was, as it was based on the old documents and texts of the real event. After that horrifying finale, the bold statement from the father to son that goes like this 'God, even looks after worms and we can't look after each other' is what made me think we had come a long way since, yet do everything has changed now? And you know the answer to that.\r\n\r\nIt was not an unusual storyline, I have seen hundreds of other similar films, but it was from the different country, hence different language, culture, comedies, landscapes and different outcome result. Well, this film gets you at with the different moods at the different level of the narration. A fine merges of multiple genre, and yet delivers more than you anticipating. If you are wondering what is the meaning of the title, 'Well Done' or 'Bravo' is the English translation.\r\n\r\nLow budget movie? But, that's the reason this movie makes a very interesting. Because the 19th century tale and this film that kind feels like made in the early 30s (except the high framerate) pretty unlike to any modern black and white films. Definitely a must see if you're interested in this year's Oscar nominees for the best foreign movies, even though it did not make.\r\n\r\n8½/10", "created_at": "2016-02-24T18:09:10.500Z"}]