[{"movie_id": 88794, "review_id": "620834d126dac1001b8326b8", "author_rating": 6.0, "review_text": "A bit of a bore, is <em>'J. Edgar'</em>.\r\n\r\nLeonardo DiCaprio puts in a very good performance as the titular character and his co-stars are all solid, but I just found the way that the story is told to be lacklustre. There aren't, at least for me, any memorable scenes and I wasn't invested in the plot at any point really. It's semi-watchable, but goes on for too long to be passably so.\r\n\r\nIt does, as noted, have a neat cast list, with Armie Hammer, Naomi Watts and Judi Dench, among others, involved behind DiCaprio. I think they all give their best, with any issues I have with this 2011 release being away from them. Two duds in a row to start the 2010s from Mr. Eastwood; in my humble opinion, of course.", "created_at": "2022-02-12T22:29:37.211Z"}, {"movie_id": 88794, "review_id": "63c21cbc8efe7300c83fea21", "author_rating": 10.0, "review_text": "My only real complaint about Leonardo DiCaprio is that he looks like, well, Leonardo DiCaprio and that is a shame given that given that he doesn't play Lenardo DiCaprio, he plays whoever the script says he is and we all think he's the greatest thing since sliced bread because of that.\r\n\r\nExcept in J. Edgar where, for the first real time, DiCaprio doesn't look like DiCaprio, he looks a lot like the cross-dressing fascist he's portraying.\r\n\r\nAnd being Leo, he acts like him too.\r\n\r\nTHANK YOU. For once the studio didn't bank on his face and it paid out.\r\n\r\nSo we not only get to see Leo acting the part, but for the first time we get to really see him looking the part too and the last time he did that was in \"What's Eating Gilbert Grape.\" And on top of it all we have Clint Eastwood directing and, honestly, not a fan of him as an actor, love him as a director.\r\n\r\nGiven his politics I walked in thinking Right Wing Love Story...I walked out with \"honest depiction\" and that helps a lot.\r\n\r\nNot only does that help, but the scandal around Hoover's sexuality was done appropriately, that is to say it didn't take center stage, J. Edgar did...and, as I said, you were watching J. Edgar and not Leo doing his best to be the man while having to still look like himself.\r\n\r\nit's just a win all around...except it could have benefited for time. Trim it down a bit. I know he's hugely important to history and Eastwood is a great director with a great cast but...it got a bit long in the tooth at places and that hurt the flow of the film.", "created_at": "2023-01-14T03:08:44.641Z"}]