[{"movie_id": 446101, "review_id": "5c4467ff9251412be8ddfd73", "author_rating": 7.0, "review_text": "Bit of an odd one, good odd. The sort of thing that'd usually earn all of its points out of pure catharsis, but is to confronting to be any way actually cathartic, and hits the message over and over again instead, which normally I hate, but _Assassination Nation_ works because of the hate. It's a very hateful movie, with just a sliver of what you might have expected it would be like based on the trailer right at the very end, but otherwise, grim.\r\n\r\nIn a good way though. A way that works, makes you think, but still has all #TheAesthetic™ you can shake a stick at, it just makes you feel bad for shaking that stick. Do you like _The Purge_ but feel that the mirror it holds up is too general? Wanna feel bad about feeling good? Give _Assassination Nation_ a crack.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T12:22:23.954Z"}, {"movie_id": 446101, "review_id": "5d17a5e9ca0e1700217008fa", "author_rating": 8.0, "review_text": "**_Hilarious, disturbing, and unexpectedly intelligent (if you don't get too triggered)_**\r\n\r\n> _I remember the Sony hack and the leak of all those actresses' private photos. I always remember, it's like, you read some article and in the article, they just link to it. Here's the link to read this person's emails, this person's photos. What fascinated me about it - and also troubled me about it - was the industry that hacks and leaks create. The sheer economics of it. They tend to outweigh everything else. Even if you're writing a think piece against it, against this invasion of privacy, they'r__e literally still linking to it because they know it will garner clicks. This idea kept playing over and over in my head. We as a country, our lust for entertainment has sort of superseded our sense of self-preservation. Everything is spectacle. Everything is entertainment, whether it's shame, invasion of privacy, abuse, no matter what it is it's become almost a sporting event. It's like the new Roman Coliseum in a way. I find that to be quite troubling. This is something that I think affects all aspects of the political spectrum. It's not reserved for one or the other, it's truly American._\r\n\r\n- Sam Levinson; \"Sam Levinson on Creating Chaos in _Assassination Nation_\"; filmschoolrejects.com (September 26, 2018)\r\n\r\nCentred around a quartet of unapologetically (or perhaps unknowingly) shallow teen girls more concerned with getting likes on Instagram than decent grades, and culminating in an orgy of gender-demarcated violence, _Assassination Nation_ is one of those films that seems to set out to try to offend everyone – from the social justice warriors on the left to the second amendment fetishisers on the right, from Millennial snowflakes who have never known life without social media to Baby boomers who just can't get their head around why going viral is so important. And pretty much everyone in between. The satirical ire of writer/director Sam Levinson's (son of Barry Levinson) second feature, however, is aimed more specifically at those who tend to see the proclivities of sexually \"aggressive\" (i.e., sexually confident) young women through misogyny-tinted glasses as the ruination of society (the type of insecure males who believe the term \"toxic masculinity\" is an oxymoron). Presumably inspired by the \"Sukeban\" [boss girl] phenomenon in Japan during the 70s and 80s, the film essentially depicts what might have happened if both the accused and the accusers during the Salem witch trials had had access to social media and assault rifles. Starting out as a hilarious, if disturbing, commentary on a society becoming ever more defined by online hysteria and the erosion of traditional concepts of privacy, the film charts a course from Michael Lehmann's _Heathers_ (1988) and Mark Waters's _Mean Girls_ (2004) to James DeMonaco's _The Purge_ (2013) by way of Joe Dante's _The Second Civil War_ (1997), Michael Mann's _Blackhat_ (2015), and Cary Murnion and Jonathan Milott's _Bushwick_ (2017). True, it does run out of steam in its third act, and, overall, it tries to take on too many issues, with several themes (and plotlines) disappointingly glossed over. Nevertheless, this is perceptive stuff, with a solid central socio-political thesis, a savagely satirical narrative (even if it is populated by underwritten characters), and a vivid depiction of high-school teenagers pushed beyond all reason.\r\n\r\nSet in a town called Salem in an undesignated state (it is NOT supposed to be Salem, Massachusetts, as so many reviews have claimed), Lily Colson (Odessa Young) is a fairly typical 18-year-old high-school senior. Intelligent, creative, and obsessed with her social media presence, Lily is part of a tightly-knit clique of four girls, along with Bex (Hari Nef), Em (Abra), and Sarah (Suki Waterhouse). Although Lily is ostensibly dating Mark (Bill Skarsgård), unbeknownst to her friends, she is also involved in a sexting relationship with an older man, identified as \"Daddy\". Life is relatively normal until an unknown hacker named Er0str4tus (after Herostratus, who torched the Temple of Artemis so as to become famous) releases private footage of the ultra-conservative, anti-homosexual Major Bartlett (Cullen Moss) interacting with male escorts and wearing women's lingerie. Several days later, the phone of Principal Turrell (Colman Domingo) is also hacked, and non-sexual naked pictures of his six-year-old daughter are sent across the town, with people accusing him of being a paedophile. As the police and the FBI investigate the hacks, a massive data dump of half the people in Salem is posted online, including the pictures and sexts Lily had been sending to \"Daddy\". With the town turning on itself, as friends and family members find their private messages about one another exposed for all to see, the four girls find themselves at the dangerous centre of a rapidly escalating situation.\r\n\r\n_Assassination Nation_ made news in January 2018, when it was the biggest sale at the Sundance Film Festival, purchased by NEON for $10 million. However, when it went on wide release in North America in September, it flopped badly, taking only $1 million in its opening weekend, and finishing 15th at the box office. Even for a modestly budgeted film, that's a horrendous opening, and for a film showing in over 1,400 theatres to not even break the top ten is virtually unheard of. Indeed, it had the worst wide release opening weekend of the year, earning just $733 per theatre. This is a real shame, but perhaps it's not unexpected. The film has \"cult status\" written all over it, and the fact that it holds a very unflattering mirror up to contemporary American society was never exactly going to pull in the multiplex crowds, irrespective of festival buzz and reasonably positive reviews. That that mirror is satirical probably didn't help either. 31% of Americans believe that a second Civil War will happen within their lifetime, almost certainly race related, and I can't imagine people who think this way being especially receptive to the kind of satire seen in this film.\r\n\r\n_Assassination Nation_ works primarily, if not wholly, by way of exaggeration, as with so much great Juvenalian satire – from the writings of Decimus Iunius Iuvenalis himself to Jonathan Swift's mastering of the form in works such as \"A Modest Proposal For preventing the Children of Poor People From being a Burthen to Their Parents or Country, And For making them Beneficial to the Publick\" (1729) to modern novels such as Tom Wolfe's _The Bonfire of the Vanities_ (1987) and Bret Easton Ellis's _American Psycho_ (1991), onto films such as Oliver Stone's _Natural Born Killers_ (1994) and Barry Levinson's _Wag the Dog_ (1997). The _milieu_ of the film is not such as would be found in a piece of social realism, nor does it claim to be. Instead, it works to draw attention to various cultural aspects by way of hyperbole, embellishment, and outlandish exaggeration. Nowhere is this clearer than the film's very premise – all Er0str4tus has to do to destabilise Salem is let everyone know what everyone else is thinking. Obviously, Levinson is not positing this as a real-world scenario; instead, he is accentuating the damage such a thing could do to highlight our society's very real obsession with social media and the concomitant importance of digital privacy.\r\n\r\nPossible to either deride the film as the worst imaginable type of excess of #MeToo, or celebrate it as an insightful examination of the origins of a fempowerment created by those very forces which led to #MeToo in the first place, you know you're situated firmly in outrage culture when you hear characters refer to the LGBTQ community as the LGBTQQIAAP community. Taking as its starting point the fear that female agency (particularly regarding sexuality) can instil in the patriarchal status quo, the film then hypothesises what might happen if that fear is pushed to the extreme as men try to reassert their dominance, given the current political climate in the US. The film presents a patriarchy which firmly believes that if young women dress provocatively, they must be sluts, and thus they have it coming, whatever \"it\" may be. In this sense, Levinson addresses how previously frowned-upon right-wing and/or misogynist views have gained a degree of social acceptability and mainstream visibility during Donald Trump's presidency, and although Trump is never mentioned by name, there are several allusions to him. For example, towards the end of the film, an armed militia group are shown wearing red #MAGA-style baseball hats, whilst Richter (Jeff Pope), a local policeman, calls the group \"_good people_,\" itself a trigger phrase in light of Trump's use of it to describe the 2017 Unite the Right rally in Charlottesville.\r\n\r\nHowever, the film is cognisant enough to acknowledge that racial disharmony, sexism, and toxic masculinity were not invented by Trump, positing instead that such views have long been a part of the American anthropological character, with Trump simply exacerbating and, in terms of far-right hate groups, legitimising such thinking. This has led to an American society more sharply demarcated along partisan lines than perhaps at any time since the Civil War, certainly any time since Vietnam. Speaking to Seventh Row, Suki Waterhouse states,\r\n\r\n> _right now, in America at least, we're in this sort of stand-off. And standoffs don't normally end well._\r\n\r\n_Assassination Nation_ is, in part, about what happens when this stand-off erupts.\r\n\r\nLevinson sets the tone immediately. The opening shot shows a camera moving along a suburban street, passing by idyllic white picket fences, _Blue Velvet_-style, with people performing mundane tasks such as emptying the trash and watering the lawn. Except everyone is wearing a mask of some kind. A voice-over then informs us that this is a story about how Salem \"_lost its motherfucking mind_.\" The audience is then warned that there are things in the upcoming film some may find objectionable, and a rapidly edited montage shows a series of quick clips, each one labelled with a requisite \"trigger warning\" – drug use, sexual content, toxic masculinity, homophobia, transphobia, guns, nationalism, racism, kidnapping, the male gaze, sexism, swearing, torture, violence, gore, weapons, and fragile male egos. This abrasive, confrontational, self-reflexive style continues for much of the film, which is purposely designed to confront, provoke, and challenge people, not only thematically, but aesthetically.\r\n\r\nOne particularly good example of this concerns the aforementioned male gaze. An early shot shows the four girls walking into school in slow motion as the camera starts at their feet and slowly pans up their bare legs before moving around behind them. You couldn't get a more textbook example of a cinematic male gaze. So is Levinson being hypocritical, reproducing what he claims to be condemning? Not at all. Towards the end of the film, the exact same shot is repeated, but in this instance, the girls are effectively going to war, and the male gaze is no longer an issue, something the film draws to the audience's attention by replicating the form of the earlier shot – in short, the male gaze is reproduced so as to later satirise and ridicule it. That a number of professional critics have completely missed this is staggering to me, although none go to quite such ridiculous extremes as the _Los Angeles Times_' Katie Walsh, who accuses Levinson and cinematographer Marcell Rév (_Fehér Isten_; _Jupiter holdja_; _Paterno_) of taking \"_much delight in wringing every sexy moment out of attacking young women_.\" Which is precisely what the film doesn't do. In fact, it's literally the opposite of what the film does, a misreading which reminds me of critics who accused David Fincher's _Fight Club_ (1999) of endorsing fascism.\r\n\r\nAesthetically, the data dump and its effects are also well-rendered. For example, when Er0str4tus is first seen clicking send, his click is accompanied by the non-diegetic sound of an explosion. Later, after the data dump, but prior to people turning on one another, learning that her best friend has been mocking her behind her back, an acquaintance of the central quartet takes a baseball bat, finds her friend in the school gym, and cracks her over the head. This scene is the point of no return, the first act of violence from which all others will follow. The scene starts out normal enough, but soon the camera turns upside-down and we see the girl standing against an unrealistically large American flag. Turning the camera upside-down like this mid-shot and using the flag in this way indicates that something within the social fabric has fundamentally changed; there has been some kind of paradigm shift. Indeed, speaking of the American flag, it's a recurring motif throughout the film, but we rarely see it without a gun nearby, usually in the same shot. Make of that what you will. Another aesthetically interesting scene is early in the film when the screen in split into three whilst the girls are at a party, one pane following Lily, one following Bex, and one following Em and Sarah. This has the effect of cutting the girls off from one another, isolating them in a Snap Chat shaped panel, and suggesting that even here, when they seem at their most confident, they are performing, aware of being watched. Text message chains and phone-quality videos are also used throughout the film, enhancing this erosion of any sense of privacy.\r\n\r\nThe film's most aesthetically accomplished scene, however, is a five-minute single-take shot depicting a home invasion, with the camera remaining outside the house, following the action as it moves from window to window. It's a dazzling sequence that has the effect of positioning the audience as passive spectators. Shot on a dolly rig housing a technocrane with a 42-foot arm that moves from the second floor to the first and back again, the scene came about because Levinson was trying to find \"_the scariest way possible_\" to stage the scene. Designed to depict an event that \"_was continually in motion_,\" Levinson tells the _New York Times_,\r\n\r\n> _there was something very apropos about watching this horror unfold, and being helpless in relation to it._\r\n\r\nThis, of course, is one of the film's main themes – the idea of passively and emotionlessly watching videos of tragedies online.\r\n\r\nSpeaking of themes, one of the film's strengths, but also one of its weaknesses, is the sheer volume of issues with which it engages; misogyny, feminism, fempowerment, social media, sexual assault, #MeToo, bullying, gun culture, toxic masculinity, the male gaze, racism, gang mentality, digital privacy, desensitisation, mansplaining. In only the third scene, shocked at Lily's drawings of naked women in sexually provocative positions, Turrell tells her, \"_this is high-school, and justly or unjustly, there are limits to what you can say_,\" as she tries to argue that nudity does not necessarily have to be sexual. Adopting a feminist defence, she posits that her art is reflective of how difficult it is for women in a misogynistic selfie-obsessed social media-saturated culture, explaining,\r\n\r\n> _it's not about the nudity. It's about the thousands of naked selfies you took to get just one right._\r\n\r\nSomething which men (generally) don't have to worry about.\r\n\r\nArising from this are a plethora of other issues, some vital to the story Levinson is telling, some not so much. For example, firmly of the belief that privacy is a thing of the past, Lily claims that her generation accepts that their lives are for mass consumption, and all they can do are try to choose how they are consumed. But even that choice isn't a given. In relation to this, the film addresses the myriad ways that young girls are represented on social media, deconstructing and satirising the inherently misogynistic assumptions that underpin so many of our attitudes to online behaviour (if a guy shows off his washboard abs, it's no big deal, but if a woman shows off her cleavage, we must call the elders!!). Indeed, the hypocrisy and \"holier-than-thou\" attitudes most people assume online, afforded such by the relative anonymity, come to the fore when naked pictures of Turrell's six-year-old daughter in a bath are leaked, and the town accuse him of being a paedophile. However, as Lily points out to her parents, there's a naked baby photo of her hanging in their house, so why is that not considered pornographic?\r\n\r\nThe film also asks the question of why a woman, generally speaking, cannot dress provocatively without being labelled (by some) a slut, all-but asking to be sexually assaulted. Victim shaming is an especially hot topic here in Ireland at the moment because of a recent case in which the lawyer for a man accused of rape told jurors,\r\n\r\n> _you have to look at the way she was dressed. She was wearing a thong with a lace front,_\r\n\r\nleading to #ThisIsNotConsent trending on Twitter, protests in several cities, and women across the world sharing pictures of their underwear. The callousness and indifference of social media is addressed when the girls respond to pictures of Bartlett cross-dressing by laughing at his taste in lingerie. Another major issue in the film is, obviously, sexuality. For example, Bex is transgender (as is actress Hari Nef), and after she has sex with Diamond (Danny Ramírez), a fellow pupil, he casually asks her not to tell anyone, and then subsequently blanks her in school. Elsewhere, the girls are shocked to learn that Mark won't go down on Lily, with Sarah proclaiming, \"_men who don't go down are sociopaths_.\" Very possibly.\r\n\r\nUnfortunately, because the film tries to deal with so much, many of the issues are raised only to be touched on once or twice, and then dropped. This has the side-effect of making the film seem a little thematically scattershot, and it would have worked far better if Levinson had threaded a core group through the narrative rather than jumping around as much as he does. Aside from dealing with too many themes, if the film has a defining flaw, it's that the last act essentially turns into _The Purge_, wherein the girls, as complicit as everyone else in the early part of the film, now turn into the leaders of a righteous avenging vigilante group facing off against the intolerance born of right-wing jingoism, a conflict drawn primarily along gender lines, although not exclusively (there are a few men on the girls' side, and vice versa). Of the violence, Levinson tells filmschoolrejects.com,\r\n\r\n> _it's real people imitating movie violence, in a way. It is informed by the symbolism of film violence._\r\n\r\nHari Nef tells Seventh Row,\r\n\r\n> _the context of all of this hate and all of this judgment cues up the violence. You see the source of the violence, and you see the multiple forces — discursively, psychologically, culturally — that lead up to that moment. Obviously, the violence is shocking to see, but the fact that it's going on is as American as cherry pie. It's what happens in this country to people, to women, who are deemed guilty of something egregious. The fact that we get to see it is shocking, but the fact that it goes on should be very familiar._\r\n\r\nNevertheless, it's a disappointingly simplistic _dénouement_ given the complexity and thematic depth of the preceding narrative.\r\n\r\nAnother problem is that the characters are underwritten across the board, with only Lily and Bex really getting any degree of interiority. Sarah barely registers as a character at all, Em is only marginally better, and none of the other characters are developed beyond their archetypal role – Reagan Hall (Bella Thorne), a self-obsessed cheerleader; Nick Mathers (Joel McHale), Em's neighbour with a secret to hide; Grace (Maude Apatow), Reagan's quiet and submissive best friend; Marty (Noah Galvin), a local computer nerd; Nance (Anika Noni Rose), Em's adopted mother with terrible taste in men; Chief Patterson (J.D. Evermore), Salem's clueless chief of police; Rose Mathers (Susan Misner), Nick's wife; Lawrence Colson (Joe Chrest), Lily's old-fashioned father; Rebecca Colson (Kathryn Erbe), Lily's even more old-fashioned mother; and Donny Colson (Caden Swain), Lily's desensitised younger brother.\r\n\r\nDepicting a cultural anxiety that is uniquely contemporary, _Assassination Nation_ is an unexpectedly smart film examining weighty topics of great importance to the socio-political moment, irrespective of your political affiliation. While it is immensely strong (both hilarious and disturbing) in its depiction of teenage gender politics, gun culture, political correctness, online behaviour etc, it falters when it comes to the dynamics of the narrative, setting up several strands which never pay off, and ending a little weakly. Nevertheless, the questions it raises are important ones, and they are asked very well. Levinson isn't interested in providing answers though. That, he suggests, is our job.", "created_at": "2019-06-29T17:54:49.968Z"}, {"movie_id": 446101, "review_id": "64a3253be9da69011e57bfa0", "author_rating": 6.0, "review_text": "I would have to say this is probably my least favorite out of the series. It is funny but I'd rather watch the chipmunks get into mischief then his girlfriends son being jelly.", "created_at": "2023-07-03T19:44:59.931Z"}, {"movie_id": 446101, "review_id": "64a32e6f8289a000caf10c8b", "author_rating": 6.0, "review_text": "Crazy ass movie. What people can really be driven to do when necessary is crazy. I liked this movie.", "created_at": "2023-07-03T20:24:15.753Z"}, {"movie_id": 446101, "review_id": "5c4467ff9251412be8ddfd73", "author_rating": 7.0, "review_text": "Bit of an odd one, good odd. The sort of thing that'd usually earn all of its points out of pure catharsis, but is to confronting to be any way actually cathartic, and hits the message over and over again instead, which normally I hate, but _Assassination Nation_ works because of the hate. It's a very hateful movie, with just a sliver of what you might have expected it would be like based on the trailer right at the very end, but otherwise, grim.\r\n\r\nIn a good way though. A way that works, makes you think, but still has all #TheAesthetic™ you can shake a stick at, it just makes you feel bad for shaking that stick. Do you like _The Purge_ but feel that the mirror it holds up is too general? Wanna feel bad about feeling good? Give _Assassination Nation_ a crack.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T12:22:23.954Z"}, {"movie_id": 446101, "review_id": "5d17a5e9ca0e1700217008fa", "author_rating": 8.0, "review_text": "**_Hilarious, disturbing, and unexpectedly intelligent (if you don't get too triggered)_**\r\n\r\n> _I remember the Sony hack and the leak of all those actresses' private photos. I always remember, it's like, you read some article and in the article, they just link to it. Here's the link to read this person's emails, this person's photos. What fascinated me about it - and also troubled me about it - was the industry that hacks and leaks create. The sheer economics of it. They tend to outweigh everything else. Even if you're writing a think piece against it, against this invasion of privacy, they'r__e literally still linking to it because they know it will garner clicks. This idea kept playing over and over in my head. We as a country, our lust for entertainment has sort of superseded our sense of self-preservation. Everything is spectacle. Everything is entertainment, whether it's shame, invasion of privacy, abuse, no matter what it is it's become almost a sporting event. It's like the new Roman Coliseum in a way. I find that to be quite troubling. This is something that I think affects all aspects of the political spectrum. It's not reserved for one or the other, it's truly American._\r\n\r\n- Sam Levinson; \"Sam Levinson on Creating Chaos in _Assassination Nation_\"; filmschoolrejects.com (September 26, 2018)\r\n\r\nCentred around a quartet of unapologetically (or perhaps unknowingly) shallow teen girls more concerned with getting likes on Instagram than decent grades, and culminating in an orgy of gender-demarcated violence, _Assassination Nation_ is one of those films that seems to set out to try to offend everyone – from the social justice warriors on the left to the second amendment fetishisers on the right, from Millennial snowflakes who have never known life without social media to Baby boomers who just can't get their head around why going viral is so important. And pretty much everyone in between. The satirical ire of writer/director Sam Levinson's (son of Barry Levinson) second feature, however, is aimed more specifically at those who tend to see the proclivities of sexually \"aggressive\" (i.e., sexually confident) young women through misogyny-tinted glasses as the ruination of society (the type of insecure males who believe the term \"toxic masculinity\" is an oxymoron). Presumably inspired by the \"Sukeban\" [boss girl] phenomenon in Japan during the 70s and 80s, the film essentially depicts what might have happened if both the accused and the accusers during the Salem witch trials had had access to social media and assault rifles. Starting out as a hilarious, if disturbing, commentary on a society becoming ever more defined by online hysteria and the erosion of traditional concepts of privacy, the film charts a course from Michael Lehmann's _Heathers_ (1988) and Mark Waters's _Mean Girls_ (2004) to James DeMonaco's _The Purge_ (2013) by way of Joe Dante's _The Second Civil War_ (1997), Michael Mann's _Blackhat_ (2015), and Cary Murnion and Jonathan Milott's _Bushwick_ (2017). True, it does run out of steam in its third act, and, overall, it tries to take on too many issues, with several themes (and plotlines) disappointingly glossed over. Nevertheless, this is perceptive stuff, with a solid central socio-political thesis, a savagely satirical narrative (even if it is populated by underwritten characters), and a vivid depiction of high-school teenagers pushed beyond all reason.\r\n\r\nSet in a town called Salem in an undesignated state (it is NOT supposed to be Salem, Massachusetts, as so many reviews have claimed), Lily Colson (Odessa Young) is a fairly typical 18-year-old high-school senior. Intelligent, creative, and obsessed with her social media presence, Lily is part of a tightly-knit clique of four girls, along with Bex (Hari Nef), Em (Abra), and Sarah (Suki Waterhouse). Although Lily is ostensibly dating Mark (Bill Skarsgård), unbeknownst to her friends, she is also involved in a sexting relationship with an older man, identified as \"Daddy\". Life is relatively normal until an unknown hacker named Er0str4tus (after Herostratus, who torched the Temple of Artemis so as to become famous) releases private footage of the ultra-conservative, anti-homosexual Major Bartlett (Cullen Moss) interacting with male escorts and wearing women's lingerie. Several days later, the phone of Principal Turrell (Colman Domingo) is also hacked, and non-sexual naked pictures of his six-year-old daughter are sent across the town, with people accusing him of being a paedophile. As the police and the FBI investigate the hacks, a massive data dump of half the people in Salem is posted online, including the pictures and sexts Lily had been sending to \"Daddy\". With the town turning on itself, as friends and family members find their private messages about one another exposed for all to see, the four girls find themselves at the dangerous centre of a rapidly escalating situation.\r\n\r\n_Assassination Nation_ made news in January 2018, when it was the biggest sale at the Sundance Film Festival, purchased by NEON for $10 million. However, when it went on wide release in North America in September, it flopped badly, taking only $1 million in its opening weekend, and finishing 15th at the box office. Even for a modestly budgeted film, that's a horrendous opening, and for a film showing in over 1,400 theatres to not even break the top ten is virtually unheard of. Indeed, it had the worst wide release opening weekend of the year, earning just $733 per theatre. This is a real shame, but perhaps it's not unexpected. The film has \"cult status\" written all over it, and the fact that it holds a very unflattering mirror up to contemporary American society was never exactly going to pull in the multiplex crowds, irrespective of festival buzz and reasonably positive reviews. That that mirror is satirical probably didn't help either. 31% of Americans believe that a second Civil War will happen within their lifetime, almost certainly race related, and I can't imagine people who think this way being especially receptive to the kind of satire seen in this film.\r\n\r\n_Assassination Nation_ works primarily, if not wholly, by way of exaggeration, as with so much great Juvenalian satire – from the writings of Decimus Iunius Iuvenalis himself to Jonathan Swift's mastering of the form in works such as \"A Modest Proposal For preventing the Children of Poor People From being a Burthen to Their Parents or Country, And For making them Beneficial to the Publick\" (1729) to modern novels such as Tom Wolfe's _The Bonfire of the Vanities_ (1987) and Bret Easton Ellis's _American Psycho_ (1991), onto films such as Oliver Stone's _Natural Born Killers_ (1994) and Barry Levinson's _Wag the Dog_ (1997). The _milieu_ of the film is not such as would be found in a piece of social realism, nor does it claim to be. Instead, it works to draw attention to various cultural aspects by way of hyperbole, embellishment, and outlandish exaggeration. Nowhere is this clearer than the film's very premise – all Er0str4tus has to do to destabilise Salem is let everyone know what everyone else is thinking. Obviously, Levinson is not positing this as a real-world scenario; instead, he is accentuating the damage such a thing could do to highlight our society's very real obsession with social media and the concomitant importance of digital privacy.\r\n\r\nPossible to either deride the film as the worst imaginable type of excess of #MeToo, or celebrate it as an insightful examination of the origins of a fempowerment created by those very forces which led to #MeToo in the first place, you know you're situated firmly in outrage culture when you hear characters refer to the LGBTQ community as the LGBTQQIAAP community. Taking as its starting point the fear that female agency (particularly regarding sexuality) can instil in the patriarchal status quo, the film then hypothesises what might happen if that fear is pushed to the extreme as men try to reassert their dominance, given the current political climate in the US. The film presents a patriarchy which firmly believes that if young women dress provocatively, they must be sluts, and thus they have it coming, whatever \"it\" may be. In this sense, Levinson addresses how previously frowned-upon right-wing and/or misogynist views have gained a degree of social acceptability and mainstream visibility during Donald Trump's presidency, and although Trump is never mentioned by name, there are several allusions to him. For example, towards the end of the film, an armed militia group are shown wearing red #MAGA-style baseball hats, whilst Richter (Jeff Pope), a local policeman, calls the group \"_good people_,\" itself a trigger phrase in light of Trump's use of it to describe the 2017 Unite the Right rally in Charlottesville.\r\n\r\nHowever, the film is cognisant enough to acknowledge that racial disharmony, sexism, and toxic masculinity were not invented by Trump, positing instead that such views have long been a part of the American anthropological character, with Trump simply exacerbating and, in terms of far-right hate groups, legitimising such thinking. This has led to an American society more sharply demarcated along partisan lines than perhaps at any time since the Civil War, certainly any time since Vietnam. Speaking to Seventh Row, Suki Waterhouse states,\r\n\r\n> _right now, in America at least, we're in this sort of stand-off. And standoffs don't normally end well._\r\n\r\n_Assassination Nation_ is, in part, about what happens when this stand-off erupts.\r\n\r\nLevinson sets the tone immediately. The opening shot shows a camera moving along a suburban street, passing by idyllic white picket fences, _Blue Velvet_-style, with people performing mundane tasks such as emptying the trash and watering the lawn. Except everyone is wearing a mask of some kind. A voice-over then informs us that this is a story about how Salem \"_lost its motherfucking mind_.\" The audience is then warned that there are things in the upcoming film some may find objectionable, and a rapidly edited montage shows a series of quick clips, each one labelled with a requisite \"trigger warning\" – drug use, sexual content, toxic masculinity, homophobia, transphobia, guns, nationalism, racism, kidnapping, the male gaze, sexism, swearing, torture, violence, gore, weapons, and fragile male egos. This abrasive, confrontational, self-reflexive style continues for much of the film, which is purposely designed to confront, provoke, and challenge people, not only thematically, but aesthetically.\r\n\r\nOne particularly good example of this concerns the aforementioned male gaze. An early shot shows the four girls walking into school in slow motion as the camera starts at their feet and slowly pans up their bare legs before moving around behind them. You couldn't get a more textbook example of a cinematic male gaze. So is Levinson being hypocritical, reproducing what he claims to be condemning? Not at all. Towards the end of the film, the exact same shot is repeated, but in this instance, the girls are effectively going to war, and the male gaze is no longer an issue, something the film draws to the audience's attention by replicating the form of the earlier shot – in short, the male gaze is reproduced so as to later satirise and ridicule it. That a number of professional critics have completely missed this is staggering to me, although none go to quite such ridiculous extremes as the _Los Angeles Times_' Katie Walsh, who accuses Levinson and cinematographer Marcell Rév (_Fehér Isten_; _Jupiter holdja_; _Paterno_) of taking \"_much delight in wringing every sexy moment out of attacking young women_.\" Which is precisely what the film doesn't do. In fact, it's literally the opposite of what the film does, a misreading which reminds me of critics who accused David Fincher's _Fight Club_ (1999) of endorsing fascism.\r\n\r\nAesthetically, the data dump and its effects are also well-rendered. For example, when Er0str4tus is first seen clicking send, his click is accompanied by the non-diegetic sound of an explosion. Later, after the data dump, but prior to people turning on one another, learning that her best friend has been mocking her behind her back, an acquaintance of the central quartet takes a baseball bat, finds her friend in the school gym, and cracks her over the head. This scene is the point of no return, the first act of violence from which all others will follow. The scene starts out normal enough, but soon the camera turns upside-down and we see the girl standing against an unrealistically large American flag. Turning the camera upside-down like this mid-shot and using the flag in this way indicates that something within the social fabric has fundamentally changed; there has been some kind of paradigm shift. Indeed, speaking of the American flag, it's a recurring motif throughout the film, but we rarely see it without a gun nearby, usually in the same shot. Make of that what you will. Another aesthetically interesting scene is early in the film when the screen in split into three whilst the girls are at a party, one pane following Lily, one following Bex, and one following Em and Sarah. This has the effect of cutting the girls off from one another, isolating them in a Snap Chat shaped panel, and suggesting that even here, when they seem at their most confident, they are performing, aware of being watched. Text message chains and phone-quality videos are also used throughout the film, enhancing this erosion of any sense of privacy.\r\n\r\nThe film's most aesthetically accomplished scene, however, is a five-minute single-take shot depicting a home invasion, with the camera remaining outside the house, following the action as it moves from window to window. It's a dazzling sequence that has the effect of positioning the audience as passive spectators. Shot on a dolly rig housing a technocrane with a 42-foot arm that moves from the second floor to the first and back again, the scene came about because Levinson was trying to find \"_the scariest way possible_\" to stage the scene. Designed to depict an event that \"_was continually in motion_,\" Levinson tells the _New York Times_,\r\n\r\n> _there was something very apropos about watching this horror unfold, and being helpless in relation to it._\r\n\r\nThis, of course, is one of the film's main themes – the idea of passively and emotionlessly watching videos of tragedies online.\r\n\r\nSpeaking of themes, one of the film's strengths, but also one of its weaknesses, is the sheer volume of issues with which it engages; misogyny, feminism, fempowerment, social media, sexual assault, #MeToo, bullying, gun culture, toxic masculinity, the male gaze, racism, gang mentality, digital privacy, desensitisation, mansplaining. In only the third scene, shocked at Lily's drawings of naked women in sexually provocative positions, Turrell tells her, \"_this is high-school, and justly or unjustly, there are limits to what you can say_,\" as she tries to argue that nudity does not necessarily have to be sexual. Adopting a feminist defence, she posits that her art is reflective of how difficult it is for women in a misogynistic selfie-obsessed social media-saturated culture, explaining,\r\n\r\n> _it's not about the nudity. It's about the thousands of naked selfies you took to get just one right._\r\n\r\nSomething which men (generally) don't have to worry about.\r\n\r\nArising from this are a plethora of other issues, some vital to the story Levinson is telling, some not so much. For example, firmly of the belief that privacy is a thing of the past, Lily claims that her generation accepts that their lives are for mass consumption, and all they can do are try to choose how they are consumed. But even that choice isn't a given. In relation to this, the film addresses the myriad ways that young girls are represented on social media, deconstructing and satirising the inherently misogynistic assumptions that underpin so many of our attitudes to online behaviour (if a guy shows off his washboard abs, it's no big deal, but if a woman shows off her cleavage, we must call the elders!!). Indeed, the hypocrisy and \"holier-than-thou\" attitudes most people assume online, afforded such by the relative anonymity, come to the fore when naked pictures of Turrell's six-year-old daughter in a bath are leaked, and the town accuse him of being a paedophile. However, as Lily points out to her parents, there's a naked baby photo of her hanging in their house, so why is that not considered pornographic?\r\n\r\nThe film also asks the question of why a woman, generally speaking, cannot dress provocatively without being labelled (by some) a slut, all-but asking to be sexually assaulted. Victim shaming is an especially hot topic here in Ireland at the moment because of a recent case in which the lawyer for a man accused of rape told jurors,\r\n\r\n> _you have to look at the way she was dressed. She was wearing a thong with a lace front,_\r\n\r\nleading to #ThisIsNotConsent trending on Twitter, protests in several cities, and women across the world sharing pictures of their underwear. The callousness and indifference of social media is addressed when the girls respond to pictures of Bartlett cross-dressing by laughing at his taste in lingerie. Another major issue in the film is, obviously, sexuality. For example, Bex is transgender (as is actress Hari Nef), and after she has sex with Diamond (Danny Ramírez), a fellow pupil, he casually asks her not to tell anyone, and then subsequently blanks her in school. Elsewhere, the girls are shocked to learn that Mark won't go down on Lily, with Sarah proclaiming, \"_men who don't go down are sociopaths_.\" Very possibly.\r\n\r\nUnfortunately, because the film tries to deal with so much, many of the issues are raised only to be touched on once or twice, and then dropped. This has the side-effect of making the film seem a little thematically scattershot, and it would have worked far better if Levinson had threaded a core group through the narrative rather than jumping around as much as he does. Aside from dealing with too many themes, if the film has a defining flaw, it's that the last act essentially turns into _The Purge_, wherein the girls, as complicit as everyone else in the early part of the film, now turn into the leaders of a righteous avenging vigilante group facing off against the intolerance born of right-wing jingoism, a conflict drawn primarily along gender lines, although not exclusively (there are a few men on the girls' side, and vice versa). Of the violence, Levinson tells filmschoolrejects.com,\r\n\r\n> _it's real people imitating movie violence, in a way. It is informed by the symbolism of film violence._\r\n\r\nHari Nef tells Seventh Row,\r\n\r\n> _the context of all of this hate and all of this judgment cues up the violence. You see the source of the violence, and you see the multiple forces — discursively, psychologically, culturally — that lead up to that moment. Obviously, the violence is shocking to see, but the fact that it's going on is as American as cherry pie. It's what happens in this country to people, to women, who are deemed guilty of something egregious. The fact that we get to see it is shocking, but the fact that it goes on should be very familiar._\r\n\r\nNevertheless, it's a disappointingly simplistic _dénouement_ given the complexity and thematic depth of the preceding narrative.\r\n\r\nAnother problem is that the characters are underwritten across the board, with only Lily and Bex really getting any degree of interiority. Sarah barely registers as a character at all, Em is only marginally better, and none of the other characters are developed beyond their archetypal role – Reagan Hall (Bella Thorne), a self-obsessed cheerleader; Nick Mathers (Joel McHale), Em's neighbour with a secret to hide; Grace (Maude Apatow), Reagan's quiet and submissive best friend; Marty (Noah Galvin), a local computer nerd; Nance (Anika Noni Rose), Em's adopted mother with terrible taste in men; Chief Patterson (J.D. Evermore), Salem's clueless chief of police; Rose Mathers (Susan Misner), Nick's wife; Lawrence Colson (Joe Chrest), Lily's old-fashioned father; Rebecca Colson (Kathryn Erbe), Lily's even more old-fashioned mother; and Donny Colson (Caden Swain), Lily's desensitised younger brother.\r\n\r\nDepicting a cultural anxiety that is uniquely contemporary, _Assassination Nation_ is an unexpectedly smart film examining weighty topics of great importance to the socio-political moment, irrespective of your political affiliation. While it is immensely strong (both hilarious and disturbing) in its depiction of teenage gender politics, gun culture, political correctness, online behaviour etc, it falters when it comes to the dynamics of the narrative, setting up several strands which never pay off, and ending a little weakly. Nevertheless, the questions it raises are important ones, and they are asked very well. Levinson isn't interested in providing answers though. That, he suggests, is our job.", "created_at": "2019-06-29T17:54:49.968Z"}, {"movie_id": 446101, "review_id": "64a3253be9da69011e57bfa0", "author_rating": 6.0, "review_text": "I would have to say this is probably my least favorite out of the series. It is funny but I'd rather watch the chipmunks get into mischief then his girlfriends son being jelly.", "created_at": "2023-07-03T19:44:59.931Z"}, {"movie_id": 446101, "review_id": "64a32e6f8289a000caf10c8b", "author_rating": 6.0, "review_text": "Crazy ass movie. What people can really be driven to do when necessary is crazy. I liked this movie.", "created_at": "2023-07-03T20:24:15.753Z"}, {"movie_id": 446101, "review_id": "5c4467ff9251412be8ddfd73", "author_rating": 7.0, "review_text": "Bit of an odd one, good odd. The sort of thing that'd usually earn all of its points out of pure catharsis, but is to confronting to be any way actually cathartic, and hits the message over and over again instead, which normally I hate, but _Assassination Nation_ works because of the hate. It's a very hateful movie, with just a sliver of what you might have expected it would be like based on the trailer right at the very end, but otherwise, grim.\r\n\r\nIn a good way though. A way that works, makes you think, but still has all #TheAesthetic™ you can shake a stick at, it just makes you feel bad for shaking that stick. Do you like _The Purge_ but feel that the mirror it holds up is too general? Wanna feel bad about feeling good? Give _Assassination Nation_ a crack.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T12:22:23.954Z"}, {"movie_id": 446101, "review_id": "5d17a5e9ca0e1700217008fa", "author_rating": 8.0, "review_text": "**_Hilarious, disturbing, and unexpectedly intelligent (if you don't get too triggered)_**\r\n\r\n> _I remember the Sony hack and the leak of all those actresses' private photos. I always remember, it's like, you read some article and in the article, they just link to it. Here's the link to read this person's emails, this person's photos. What fascinated me about it - and also troubled me about it - was the industry that hacks and leaks create. The sheer economics of it. They tend to outweigh everything else. Even if you're writing a think piece against it, against this invasion of privacy, they'r__e literally still linking to it because they know it will garner clicks. This idea kept playing over and over in my head. We as a country, our lust for entertainment has sort of superseded our sense of self-preservation. Everything is spectacle. Everything is entertainment, whether it's shame, invasion of privacy, abuse, no matter what it is it's become almost a sporting event. It's like the new Roman Coliseum in a way. I find that to be quite troubling. This is something that I think affects all aspects of the political spectrum. It's not reserved for one or the other, it's truly American._\r\n\r\n- Sam Levinson; \"Sam Levinson on Creating Chaos in _Assassination Nation_\"; filmschoolrejects.com (September 26, 2018)\r\n\r\nCentred around a quartet of unapologetically (or perhaps unknowingly) shallow teen girls more concerned with getting likes on Instagram than decent grades, and culminating in an orgy of gender-demarcated violence, _Assassination Nation_ is one of those films that seems to set out to try to offend everyone – from the social justice warriors on the left to the second amendment fetishisers on the right, from Millennial snowflakes who have never known life without social media to Baby boomers who just can't get their head around why going viral is so important. And pretty much everyone in between. The satirical ire of writer/director Sam Levinson's (son of Barry Levinson) second feature, however, is aimed more specifically at those who tend to see the proclivities of sexually \"aggressive\" (i.e., sexually confident) young women through misogyny-tinted glasses as the ruination of society (the type of insecure males who believe the term \"toxic masculinity\" is an oxymoron). Presumably inspired by the \"Sukeban\" [boss girl] phenomenon in Japan during the 70s and 80s, the film essentially depicts what might have happened if both the accused and the accusers during the Salem witch trials had had access to social media and assault rifles. Starting out as a hilarious, if disturbing, commentary on a society becoming ever more defined by online hysteria and the erosion of traditional concepts of privacy, the film charts a course from Michael Lehmann's _Heathers_ (1988) and Mark Waters's _Mean Girls_ (2004) to James DeMonaco's _The Purge_ (2013) by way of Joe Dante's _The Second Civil War_ (1997), Michael Mann's _Blackhat_ (2015), and Cary Murnion and Jonathan Milott's _Bushwick_ (2017). True, it does run out of steam in its third act, and, overall, it tries to take on too many issues, with several themes (and plotlines) disappointingly glossed over. Nevertheless, this is perceptive stuff, with a solid central socio-political thesis, a savagely satirical narrative (even if it is populated by underwritten characters), and a vivid depiction of high-school teenagers pushed beyond all reason.\r\n\r\nSet in a town called Salem in an undesignated state (it is NOT supposed to be Salem, Massachusetts, as so many reviews have claimed), Lily Colson (Odessa Young) is a fairly typical 18-year-old high-school senior. Intelligent, creative, and obsessed with her social media presence, Lily is part of a tightly-knit clique of four girls, along with Bex (Hari Nef), Em (Abra), and Sarah (Suki Waterhouse). Although Lily is ostensibly dating Mark (Bill Skarsgård), unbeknownst to her friends, she is also involved in a sexting relationship with an older man, identified as \"Daddy\". Life is relatively normal until an unknown hacker named Er0str4tus (after Herostratus, who torched the Temple of Artemis so as to become famous) releases private footage of the ultra-conservative, anti-homosexual Major Bartlett (Cullen Moss) interacting with male escorts and wearing women's lingerie. Several days later, the phone of Principal Turrell (Colman Domingo) is also hacked, and non-sexual naked pictures of his six-year-old daughter are sent across the town, with people accusing him of being a paedophile. As the police and the FBI investigate the hacks, a massive data dump of half the people in Salem is posted online, including the pictures and sexts Lily had been sending to \"Daddy\". With the town turning on itself, as friends and family members find their private messages about one another exposed for all to see, the four girls find themselves at the dangerous centre of a rapidly escalating situation.\r\n\r\n_Assassination Nation_ made news in January 2018, when it was the biggest sale at the Sundance Film Festival, purchased by NEON for $10 million. However, when it went on wide release in North America in September, it flopped badly, taking only $1 million in its opening weekend, and finishing 15th at the box office. Even for a modestly budgeted film, that's a horrendous opening, and for a film showing in over 1,400 theatres to not even break the top ten is virtually unheard of. Indeed, it had the worst wide release opening weekend of the year, earning just $733 per theatre. This is a real shame, but perhaps it's not unexpected. The film has \"cult status\" written all over it, and the fact that it holds a very unflattering mirror up to contemporary American society was never exactly going to pull in the multiplex crowds, irrespective of festival buzz and reasonably positive reviews. That that mirror is satirical probably didn't help either. 31% of Americans believe that a second Civil War will happen within their lifetime, almost certainly race related, and I can't imagine people who think this way being especially receptive to the kind of satire seen in this film.\r\n\r\n_Assassination Nation_ works primarily, if not wholly, by way of exaggeration, as with so much great Juvenalian satire – from the writings of Decimus Iunius Iuvenalis himself to Jonathan Swift's mastering of the form in works such as \"A Modest Proposal For preventing the Children of Poor People From being a Burthen to Their Parents or Country, And For making them Beneficial to the Publick\" (1729) to modern novels such as Tom Wolfe's _The Bonfire of the Vanities_ (1987) and Bret Easton Ellis's _American Psycho_ (1991), onto films such as Oliver Stone's _Natural Born Killers_ (1994) and Barry Levinson's _Wag the Dog_ (1997). The _milieu_ of the film is not such as would be found in a piece of social realism, nor does it claim to be. Instead, it works to draw attention to various cultural aspects by way of hyperbole, embellishment, and outlandish exaggeration. Nowhere is this clearer than the film's very premise – all Er0str4tus has to do to destabilise Salem is let everyone know what everyone else is thinking. Obviously, Levinson is not positing this as a real-world scenario; instead, he is accentuating the damage such a thing could do to highlight our society's very real obsession with social media and the concomitant importance of digital privacy.\r\n\r\nPossible to either deride the film as the worst imaginable type of excess of #MeToo, or celebrate it as an insightful examination of the origins of a fempowerment created by those very forces which led to #MeToo in the first place, you know you're situated firmly in outrage culture when you hear characters refer to the LGBTQ community as the LGBTQQIAAP community. Taking as its starting point the fear that female agency (particularly regarding sexuality) can instil in the patriarchal status quo, the film then hypothesises what might happen if that fear is pushed to the extreme as men try to reassert their dominance, given the current political climate in the US. The film presents a patriarchy which firmly believes that if young women dress provocatively, they must be sluts, and thus they have it coming, whatever \"it\" may be. In this sense, Levinson addresses how previously frowned-upon right-wing and/or misogynist views have gained a degree of social acceptability and mainstream visibility during Donald Trump's presidency, and although Trump is never mentioned by name, there are several allusions to him. For example, towards the end of the film, an armed militia group are shown wearing red #MAGA-style baseball hats, whilst Richter (Jeff Pope), a local policeman, calls the group \"_good people_,\" itself a trigger phrase in light of Trump's use of it to describe the 2017 Unite the Right rally in Charlottesville.\r\n\r\nHowever, the film is cognisant enough to acknowledge that racial disharmony, sexism, and toxic masculinity were not invented by Trump, positing instead that such views have long been a part of the American anthropological character, with Trump simply exacerbating and, in terms of far-right hate groups, legitimising such thinking. This has led to an American society more sharply demarcated along partisan lines than perhaps at any time since the Civil War, certainly any time since Vietnam. Speaking to Seventh Row, Suki Waterhouse states,\r\n\r\n> _right now, in America at least, we're in this sort of stand-off. And standoffs don't normally end well._\r\n\r\n_Assassination Nation_ is, in part, about what happens when this stand-off erupts.\r\n\r\nLevinson sets the tone immediately. The opening shot shows a camera moving along a suburban street, passing by idyllic white picket fences, _Blue Velvet_-style, with people performing mundane tasks such as emptying the trash and watering the lawn. Except everyone is wearing a mask of some kind. A voice-over then informs us that this is a story about how Salem \"_lost its motherfucking mind_.\" The audience is then warned that there are things in the upcoming film some may find objectionable, and a rapidly edited montage shows a series of quick clips, each one labelled with a requisite \"trigger warning\" – drug use, sexual content, toxic masculinity, homophobia, transphobia, guns, nationalism, racism, kidnapping, the male gaze, sexism, swearing, torture, violence, gore, weapons, and fragile male egos. This abrasive, confrontational, self-reflexive style continues for much of the film, which is purposely designed to confront, provoke, and challenge people, not only thematically, but aesthetically.\r\n\r\nOne particularly good example of this concerns the aforementioned male gaze. An early shot shows the four girls walking into school in slow motion as the camera starts at their feet and slowly pans up their bare legs before moving around behind them. You couldn't get a more textbook example of a cinematic male gaze. So is Levinson being hypocritical, reproducing what he claims to be condemning? Not at all. Towards the end of the film, the exact same shot is repeated, but in this instance, the girls are effectively going to war, and the male gaze is no longer an issue, something the film draws to the audience's attention by replicating the form of the earlier shot – in short, the male gaze is reproduced so as to later satirise and ridicule it. That a number of professional critics have completely missed this is staggering to me, although none go to quite such ridiculous extremes as the _Los Angeles Times_' Katie Walsh, who accuses Levinson and cinematographer Marcell Rév (_Fehér Isten_; _Jupiter holdja_; _Paterno_) of taking \"_much delight in wringing every sexy moment out of attacking young women_.\" Which is precisely what the film doesn't do. In fact, it's literally the opposite of what the film does, a misreading which reminds me of critics who accused David Fincher's _Fight Club_ (1999) of endorsing fascism.\r\n\r\nAesthetically, the data dump and its effects are also well-rendered. For example, when Er0str4tus is first seen clicking send, his click is accompanied by the non-diegetic sound of an explosion. Later, after the data dump, but prior to people turning on one another, learning that her best friend has been mocking her behind her back, an acquaintance of the central quartet takes a baseball bat, finds her friend in the school gym, and cracks her over the head. This scene is the point of no return, the first act of violence from which all others will follow. The scene starts out normal enough, but soon the camera turns upside-down and we see the girl standing against an unrealistically large American flag. Turning the camera upside-down like this mid-shot and using the flag in this way indicates that something within the social fabric has fundamentally changed; there has been some kind of paradigm shift. Indeed, speaking of the American flag, it's a recurring motif throughout the film, but we rarely see it without a gun nearby, usually in the same shot. Make of that what you will. Another aesthetically interesting scene is early in the film when the screen in split into three whilst the girls are at a party, one pane following Lily, one following Bex, and one following Em and Sarah. This has the effect of cutting the girls off from one another, isolating them in a Snap Chat shaped panel, and suggesting that even here, when they seem at their most confident, they are performing, aware of being watched. Text message chains and phone-quality videos are also used throughout the film, enhancing this erosion of any sense of privacy.\r\n\r\nThe film's most aesthetically accomplished scene, however, is a five-minute single-take shot depicting a home invasion, with the camera remaining outside the house, following the action as it moves from window to window. It's a dazzling sequence that has the effect of positioning the audience as passive spectators. Shot on a dolly rig housing a technocrane with a 42-foot arm that moves from the second floor to the first and back again, the scene came about because Levinson was trying to find \"_the scariest way possible_\" to stage the scene. Designed to depict an event that \"_was continually in motion_,\" Levinson tells the _New York Times_,\r\n\r\n> _there was something very apropos about watching this horror unfold, and being helpless in relation to it._\r\n\r\nThis, of course, is one of the film's main themes – the idea of passively and emotionlessly watching videos of tragedies online.\r\n\r\nSpeaking of themes, one of the film's strengths, but also one of its weaknesses, is the sheer volume of issues with which it engages; misogyny, feminism, fempowerment, social media, sexual assault, #MeToo, bullying, gun culture, toxic masculinity, the male gaze, racism, gang mentality, digital privacy, desensitisation, mansplaining. In only the third scene, shocked at Lily's drawings of naked women in sexually provocative positions, Turrell tells her, \"_this is high-school, and justly or unjustly, there are limits to what you can say_,\" as she tries to argue that nudity does not necessarily have to be sexual. Adopting a feminist defence, she posits that her art is reflective of how difficult it is for women in a misogynistic selfie-obsessed social media-saturated culture, explaining,\r\n\r\n> _it's not about the nudity. It's about the thousands of naked selfies you took to get just one right._\r\n\r\nSomething which men (generally) don't have to worry about.\r\n\r\nArising from this are a plethora of other issues, some vital to the story Levinson is telling, some not so much. For example, firmly of the belief that privacy is a thing of the past, Lily claims that her generation accepts that their lives are for mass consumption, and all they can do are try to choose how they are consumed. But even that choice isn't a given. In relation to this, the film addresses the myriad ways that young girls are represented on social media, deconstructing and satirising the inherently misogynistic assumptions that underpin so many of our attitudes to online behaviour (if a guy shows off his washboard abs, it's no big deal, but if a woman shows off her cleavage, we must call the elders!!). Indeed, the hypocrisy and \"holier-than-thou\" attitudes most people assume online, afforded such by the relative anonymity, come to the fore when naked pictures of Turrell's six-year-old daughter in a bath are leaked, and the town accuse him of being a paedophile. However, as Lily points out to her parents, there's a naked baby photo of her hanging in their house, so why is that not considered pornographic?\r\n\r\nThe film also asks the question of why a woman, generally speaking, cannot dress provocatively without being labelled (by some) a slut, all-but asking to be sexually assaulted. Victim shaming is an especially hot topic here in Ireland at the moment because of a recent case in which the lawyer for a man accused of rape told jurors,\r\n\r\n> _you have to look at the way she was dressed. She was wearing a thong with a lace front,_\r\n\r\nleading to #ThisIsNotConsent trending on Twitter, protests in several cities, and women across the world sharing pictures of their underwear. The callousness and indifference of social media is addressed when the girls respond to pictures of Bartlett cross-dressing by laughing at his taste in lingerie. Another major issue in the film is, obviously, sexuality. For example, Bex is transgender (as is actress Hari Nef), and after she has sex with Diamond (Danny Ramírez), a fellow pupil, he casually asks her not to tell anyone, and then subsequently blanks her in school. Elsewhere, the girls are shocked to learn that Mark won't go down on Lily, with Sarah proclaiming, \"_men who don't go down are sociopaths_.\" Very possibly.\r\n\r\nUnfortunately, because the film tries to deal with so much, many of the issues are raised only to be touched on once or twice, and then dropped. This has the side-effect of making the film seem a little thematically scattershot, and it would have worked far better if Levinson had threaded a core group through the narrative rather than jumping around as much as he does. Aside from dealing with too many themes, if the film has a defining flaw, it's that the last act essentially turns into _The Purge_, wherein the girls, as complicit as everyone else in the early part of the film, now turn into the leaders of a righteous avenging vigilante group facing off against the intolerance born of right-wing jingoism, a conflict drawn primarily along gender lines, although not exclusively (there are a few men on the girls' side, and vice versa). Of the violence, Levinson tells filmschoolrejects.com,\r\n\r\n> _it's real people imitating movie violence, in a way. It is informed by the symbolism of film violence._\r\n\r\nHari Nef tells Seventh Row,\r\n\r\n> _the context of all of this hate and all of this judgment cues up the violence. You see the source of the violence, and you see the multiple forces — discursively, psychologically, culturally — that lead up to that moment. Obviously, the violence is shocking to see, but the fact that it's going on is as American as cherry pie. It's what happens in this country to people, to women, who are deemed guilty of something egregious. The fact that we get to see it is shocking, but the fact that it goes on should be very familiar._\r\n\r\nNevertheless, it's a disappointingly simplistic _dénouement_ given the complexity and thematic depth of the preceding narrative.\r\n\r\nAnother problem is that the characters are underwritten across the board, with only Lily and Bex really getting any degree of interiority. Sarah barely registers as a character at all, Em is only marginally better, and none of the other characters are developed beyond their archetypal role – Reagan Hall (Bella Thorne), a self-obsessed cheerleader; Nick Mathers (Joel McHale), Em's neighbour with a secret to hide; Grace (Maude Apatow), Reagan's quiet and submissive best friend; Marty (Noah Galvin), a local computer nerd; Nance (Anika Noni Rose), Em's adopted mother with terrible taste in men; Chief Patterson (J.D. Evermore), Salem's clueless chief of police; Rose Mathers (Susan Misner), Nick's wife; Lawrence Colson (Joe Chrest), Lily's old-fashioned father; Rebecca Colson (Kathryn Erbe), Lily's even more old-fashioned mother; and Donny Colson (Caden Swain), Lily's desensitised younger brother.\r\n\r\nDepicting a cultural anxiety that is uniquely contemporary, _Assassination Nation_ is an unexpectedly smart film examining weighty topics of great importance to the socio-political moment, irrespective of your political affiliation. While it is immensely strong (both hilarious and disturbing) in its depiction of teenage gender politics, gun culture, political correctness, online behaviour etc, it falters when it comes to the dynamics of the narrative, setting up several strands which never pay off, and ending a little weakly. Nevertheless, the questions it raises are important ones, and they are asked very well. Levinson isn't interested in providing answers though. That, he suggests, is our job.", "created_at": "2019-06-29T17:54:49.968Z"}, {"movie_id": 446101, "review_id": "64a3253be9da69011e57bfa0", "author_rating": 6.0, "review_text": "I would have to say this is probably my least favorite out of the series. It is funny but I'd rather watch the chipmunks get into mischief then his girlfriends son being jelly.", "created_at": "2023-07-03T19:44:59.931Z"}, {"movie_id": 446101, "review_id": "64a32e6f8289a000caf10c8b", "author_rating": 6.0, "review_text": "Crazy ass movie. What people can really be driven to do when necessary is crazy. I liked this movie.", "created_at": "2023-07-03T20:24:15.753Z"}, {"movie_id": 446101, "review_id": "5c4467ff9251412be8ddfd73", "author_rating": 7.0, "review_text": "Bit of an odd one, good odd. The sort of thing that'd usually earn all of its points out of pure catharsis, but is to confronting to be any way actually cathartic, and hits the message over and over again instead, which normally I hate, but _Assassination Nation_ works because of the hate. It's a very hateful movie, with just a sliver of what you might have expected it would be like based on the trailer right at the very end, but otherwise, grim.\r\n\r\nIn a good way though. A way that works, makes you think, but still has all #TheAesthetic™ you can shake a stick at, it just makes you feel bad for shaking that stick. Do you like _The Purge_ but feel that the mirror it holds up is too general? Wanna feel bad about feeling good? Give _Assassination Nation_ a crack.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T12:22:23.954Z"}, {"movie_id": 446101, "review_id": "5d17a5e9ca0e1700217008fa", "author_rating": 8.0, "review_text": "**_Hilarious, disturbing, and unexpectedly intelligent (if you don't get too triggered)_**\r\n\r\n> _I remember the Sony hack and the leak of all those actresses' private photos. I always remember, it's like, you read some article and in the article, they just link to it. Here's the link to read this person's emails, this person's photos. What fascinated me about it - and also troubled me about it - was the industry that hacks and leaks create. The sheer economics of it. They tend to outweigh everything else. Even if you're writing a think piece against it, against this invasion of privacy, they'r__e literally still linking to it because they know it will garner clicks. This idea kept playing over and over in my head. We as a country, our lust for entertainment has sort of superseded our sense of self-preservation. Everything is spectacle. Everything is entertainment, whether it's shame, invasion of privacy, abuse, no matter what it is it's become almost a sporting event. It's like the new Roman Coliseum in a way. I find that to be quite troubling. This is something that I think affects all aspects of the political spectrum. It's not reserved for one or the other, it's truly American._\r\n\r\n- Sam Levinson; \"Sam Levinson on Creating Chaos in _Assassination Nation_\"; filmschoolrejects.com (September 26, 2018)\r\n\r\nCentred around a quartet of unapologetically (or perhaps unknowingly) shallow teen girls more concerned with getting likes on Instagram than decent grades, and culminating in an orgy of gender-demarcated violence, _Assassination Nation_ is one of those films that seems to set out to try to offend everyone – from the social justice warriors on the left to the second amendment fetishisers on the right, from Millennial snowflakes who have never known life without social media to Baby boomers who just can't get their head around why going viral is so important. And pretty much everyone in between. The satirical ire of writer/director Sam Levinson's (son of Barry Levinson) second feature, however, is aimed more specifically at those who tend to see the proclivities of sexually \"aggressive\" (i.e., sexually confident) young women through misogyny-tinted glasses as the ruination of society (the type of insecure males who believe the term \"toxic masculinity\" is an oxymoron). Presumably inspired by the \"Sukeban\" [boss girl] phenomenon in Japan during the 70s and 80s, the film essentially depicts what might have happened if both the accused and the accusers during the Salem witch trials had had access to social media and assault rifles. Starting out as a hilarious, if disturbing, commentary on a society becoming ever more defined by online hysteria and the erosion of traditional concepts of privacy, the film charts a course from Michael Lehmann's _Heathers_ (1988) and Mark Waters's _Mean Girls_ (2004) to James DeMonaco's _The Purge_ (2013) by way of Joe Dante's _The Second Civil War_ (1997), Michael Mann's _Blackhat_ (2015), and Cary Murnion and Jonathan Milott's _Bushwick_ (2017). True, it does run out of steam in its third act, and, overall, it tries to take on too many issues, with several themes (and plotlines) disappointingly glossed over. Nevertheless, this is perceptive stuff, with a solid central socio-political thesis, a savagely satirical narrative (even if it is populated by underwritten characters), and a vivid depiction of high-school teenagers pushed beyond all reason.\r\n\r\nSet in a town called Salem in an undesignated state (it is NOT supposed to be Salem, Massachusetts, as so many reviews have claimed), Lily Colson (Odessa Young) is a fairly typical 18-year-old high-school senior. Intelligent, creative, and obsessed with her social media presence, Lily is part of a tightly-knit clique of four girls, along with Bex (Hari Nef), Em (Abra), and Sarah (Suki Waterhouse). Although Lily is ostensibly dating Mark (Bill Skarsgård), unbeknownst to her friends, she is also involved in a sexting relationship with an older man, identified as \"Daddy\". Life is relatively normal until an unknown hacker named Er0str4tus (after Herostratus, who torched the Temple of Artemis so as to become famous) releases private footage of the ultra-conservative, anti-homosexual Major Bartlett (Cullen Moss) interacting with male escorts and wearing women's lingerie. Several days later, the phone of Principal Turrell (Colman Domingo) is also hacked, and non-sexual naked pictures of his six-year-old daughter are sent across the town, with people accusing him of being a paedophile. As the police and the FBI investigate the hacks, a massive data dump of half the people in Salem is posted online, including the pictures and sexts Lily had been sending to \"Daddy\". With the town turning on itself, as friends and family members find their private messages about one another exposed for all to see, the four girls find themselves at the dangerous centre of a rapidly escalating situation.\r\n\r\n_Assassination Nation_ made news in January 2018, when it was the biggest sale at the Sundance Film Festival, purchased by NEON for $10 million. However, when it went on wide release in North America in September, it flopped badly, taking only $1 million in its opening weekend, and finishing 15th at the box office. Even for a modestly budgeted film, that's a horrendous opening, and for a film showing in over 1,400 theatres to not even break the top ten is virtually unheard of. Indeed, it had the worst wide release opening weekend of the year, earning just $733 per theatre. This is a real shame, but perhaps it's not unexpected. The film has \"cult status\" written all over it, and the fact that it holds a very unflattering mirror up to contemporary American society was never exactly going to pull in the multiplex crowds, irrespective of festival buzz and reasonably positive reviews. That that mirror is satirical probably didn't help either. 31% of Americans believe that a second Civil War will happen within their lifetime, almost certainly race related, and I can't imagine people who think this way being especially receptive to the kind of satire seen in this film.\r\n\r\n_Assassination Nation_ works primarily, if not wholly, by way of exaggeration, as with so much great Juvenalian satire – from the writings of Decimus Iunius Iuvenalis himself to Jonathan Swift's mastering of the form in works such as \"A Modest Proposal For preventing the Children of Poor People From being a Burthen to Their Parents or Country, And For making them Beneficial to the Publick\" (1729) to modern novels such as Tom Wolfe's _The Bonfire of the Vanities_ (1987) and Bret Easton Ellis's _American Psycho_ (1991), onto films such as Oliver Stone's _Natural Born Killers_ (1994) and Barry Levinson's _Wag the Dog_ (1997). The _milieu_ of the film is not such as would be found in a piece of social realism, nor does it claim to be. Instead, it works to draw attention to various cultural aspects by way of hyperbole, embellishment, and outlandish exaggeration. Nowhere is this clearer than the film's very premise – all Er0str4tus has to do to destabilise Salem is let everyone know what everyone else is thinking. Obviously, Levinson is not positing this as a real-world scenario; instead, he is accentuating the damage such a thing could do to highlight our society's very real obsession with social media and the concomitant importance of digital privacy.\r\n\r\nPossible to either deride the film as the worst imaginable type of excess of #MeToo, or celebrate it as an insightful examination of the origins of a fempowerment created by those very forces which led to #MeToo in the first place, you know you're situated firmly in outrage culture when you hear characters refer to the LGBTQ community as the LGBTQQIAAP community. Taking as its starting point the fear that female agency (particularly regarding sexuality) can instil in the patriarchal status quo, the film then hypothesises what might happen if that fear is pushed to the extreme as men try to reassert their dominance, given the current political climate in the US. The film presents a patriarchy which firmly believes that if young women dress provocatively, they must be sluts, and thus they have it coming, whatever \"it\" may be. In this sense, Levinson addresses how previously frowned-upon right-wing and/or misogynist views have gained a degree of social acceptability and mainstream visibility during Donald Trump's presidency, and although Trump is never mentioned by name, there are several allusions to him. For example, towards the end of the film, an armed militia group are shown wearing red #MAGA-style baseball hats, whilst Richter (Jeff Pope), a local policeman, calls the group \"_good people_,\" itself a trigger phrase in light of Trump's use of it to describe the 2017 Unite the Right rally in Charlottesville.\r\n\r\nHowever, the film is cognisant enough to acknowledge that racial disharmony, sexism, and toxic masculinity were not invented by Trump, positing instead that such views have long been a part of the American anthropological character, with Trump simply exacerbating and, in terms of far-right hate groups, legitimising such thinking. This has led to an American society more sharply demarcated along partisan lines than perhaps at any time since the Civil War, certainly any time since Vietnam. Speaking to Seventh Row, Suki Waterhouse states,\r\n\r\n> _right now, in America at least, we're in this sort of stand-off. And standoffs don't normally end well._\r\n\r\n_Assassination Nation_ is, in part, about what happens when this stand-off erupts.\r\n\r\nLevinson sets the tone immediately. The opening shot shows a camera moving along a suburban street, passing by idyllic white picket fences, _Blue Velvet_-style, with people performing mundane tasks such as emptying the trash and watering the lawn. Except everyone is wearing a mask of some kind. A voice-over then informs us that this is a story about how Salem \"_lost its motherfucking mind_.\" The audience is then warned that there are things in the upcoming film some may find objectionable, and a rapidly edited montage shows a series of quick clips, each one labelled with a requisite \"trigger warning\" – drug use, sexual content, toxic masculinity, homophobia, transphobia, guns, nationalism, racism, kidnapping, the male gaze, sexism, swearing, torture, violence, gore, weapons, and fragile male egos. This abrasive, confrontational, self-reflexive style continues for much of the film, which is purposely designed to confront, provoke, and challenge people, not only thematically, but aesthetically.\r\n\r\nOne particularly good example of this concerns the aforementioned male gaze. An early shot shows the four girls walking into school in slow motion as the camera starts at their feet and slowly pans up their bare legs before moving around behind them. You couldn't get a more textbook example of a cinematic male gaze. So is Levinson being hypocritical, reproducing what he claims to be condemning? Not at all. Towards the end of the film, the exact same shot is repeated, but in this instance, the girls are effectively going to war, and the male gaze is no longer an issue, something the film draws to the audience's attention by replicating the form of the earlier shot – in short, the male gaze is reproduced so as to later satirise and ridicule it. That a number of professional critics have completely missed this is staggering to me, although none go to quite such ridiculous extremes as the _Los Angeles Times_' Katie Walsh, who accuses Levinson and cinematographer Marcell Rév (_Fehér Isten_; _Jupiter holdja_; _Paterno_) of taking \"_much delight in wringing every sexy moment out of attacking young women_.\" Which is precisely what the film doesn't do. In fact, it's literally the opposite of what the film does, a misreading which reminds me of critics who accused David Fincher's _Fight Club_ (1999) of endorsing fascism.\r\n\r\nAesthetically, the data dump and its effects are also well-rendered. For example, when Er0str4tus is first seen clicking send, his click is accompanied by the non-diegetic sound of an explosion. Later, after the data dump, but prior to people turning on one another, learning that her best friend has been mocking her behind her back, an acquaintance of the central quartet takes a baseball bat, finds her friend in the school gym, and cracks her over the head. This scene is the point of no return, the first act of violence from which all others will follow. The scene starts out normal enough, but soon the camera turns upside-down and we see the girl standing against an unrealistically large American flag. Turning the camera upside-down like this mid-shot and using the flag in this way indicates that something within the social fabric has fundamentally changed; there has been some kind of paradigm shift. Indeed, speaking of the American flag, it's a recurring motif throughout the film, but we rarely see it without a gun nearby, usually in the same shot. Make of that what you will. Another aesthetically interesting scene is early in the film when the screen in split into three whilst the girls are at a party, one pane following Lily, one following Bex, and one following Em and Sarah. This has the effect of cutting the girls off from one another, isolating them in a Snap Chat shaped panel, and suggesting that even here, when they seem at their most confident, they are performing, aware of being watched. Text message chains and phone-quality videos are also used throughout the film, enhancing this erosion of any sense of privacy.\r\n\r\nThe film's most aesthetically accomplished scene, however, is a five-minute single-take shot depicting a home invasion, with the camera remaining outside the house, following the action as it moves from window to window. It's a dazzling sequence that has the effect of positioning the audience as passive spectators. Shot on a dolly rig housing a technocrane with a 42-foot arm that moves from the second floor to the first and back again, the scene came about because Levinson was trying to find \"_the scariest way possible_\" to stage the scene. Designed to depict an event that \"_was continually in motion_,\" Levinson tells the _New York Times_,\r\n\r\n> _there was something very apropos about watching this horror unfold, and being helpless in relation to it._\r\n\r\nThis, of course, is one of the film's main themes – the idea of passively and emotionlessly watching videos of tragedies online.\r\n\r\nSpeaking of themes, one of the film's strengths, but also one of its weaknesses, is the sheer volume of issues with which it engages; misogyny, feminism, fempowerment, social media, sexual assault, #MeToo, bullying, gun culture, toxic masculinity, the male gaze, racism, gang mentality, digital privacy, desensitisation, mansplaining. In only the third scene, shocked at Lily's drawings of naked women in sexually provocative positions, Turrell tells her, \"_this is high-school, and justly or unjustly, there are limits to what you can say_,\" as she tries to argue that nudity does not necessarily have to be sexual. Adopting a feminist defence, she posits that her art is reflective of how difficult it is for women in a misogynistic selfie-obsessed social media-saturated culture, explaining,\r\n\r\n> _it's not about the nudity. It's about the thousands of naked selfies you took to get just one right._\r\n\r\nSomething which men (generally) don't have to worry about.\r\n\r\nArising from this are a plethora of other issues, some vital to the story Levinson is telling, some not so much. For example, firmly of the belief that privacy is a thing of the past, Lily claims that her generation accepts that their lives are for mass consumption, and all they can do are try to choose how they are consumed. But even that choice isn't a given. In relation to this, the film addresses the myriad ways that young girls are represented on social media, deconstructing and satirising the inherently misogynistic assumptions that underpin so many of our attitudes to online behaviour (if a guy shows off his washboard abs, it's no big deal, but if a woman shows off her cleavage, we must call the elders!!). Indeed, the hypocrisy and \"holier-than-thou\" attitudes most people assume online, afforded such by the relative anonymity, come to the fore when naked pictures of Turrell's six-year-old daughter in a bath are leaked, and the town accuse him of being a paedophile. However, as Lily points out to her parents, there's a naked baby photo of her hanging in their house, so why is that not considered pornographic?\r\n\r\nThe film also asks the question of why a woman, generally speaking, cannot dress provocatively without being labelled (by some) a slut, all-but asking to be sexually assaulted. Victim shaming is an especially hot topic here in Ireland at the moment because of a recent case in which the lawyer for a man accused of rape told jurors,\r\n\r\n> _you have to look at the way she was dressed. She was wearing a thong with a lace front,_\r\n\r\nleading to #ThisIsNotConsent trending on Twitter, protests in several cities, and women across the world sharing pictures of their underwear. The callousness and indifference of social media is addressed when the girls respond to pictures of Bartlett cross-dressing by laughing at his taste in lingerie. Another major issue in the film is, obviously, sexuality. For example, Bex is transgender (as is actress Hari Nef), and after she has sex with Diamond (Danny Ramírez), a fellow pupil, he casually asks her not to tell anyone, and then subsequently blanks her in school. Elsewhere, the girls are shocked to learn that Mark won't go down on Lily, with Sarah proclaiming, \"_men who don't go down are sociopaths_.\" Very possibly.\r\n\r\nUnfortunately, because the film tries to deal with so much, many of the issues are raised only to be touched on once or twice, and then dropped. This has the side-effect of making the film seem a little thematically scattershot, and it would have worked far better if Levinson had threaded a core group through the narrative rather than jumping around as much as he does. Aside from dealing with too many themes, if the film has a defining flaw, it's that the last act essentially turns into _The Purge_, wherein the girls, as complicit as everyone else in the early part of the film, now turn into the leaders of a righteous avenging vigilante group facing off against the intolerance born of right-wing jingoism, a conflict drawn primarily along gender lines, although not exclusively (there are a few men on the girls' side, and vice versa). Of the violence, Levinson tells filmschoolrejects.com,\r\n\r\n> _it's real people imitating movie violence, in a way. It is informed by the symbolism of film violence._\r\n\r\nHari Nef tells Seventh Row,\r\n\r\n> _the context of all of this hate and all of this judgment cues up the violence. You see the source of the violence, and you see the multiple forces — discursively, psychologically, culturally — that lead up to that moment. Obviously, the violence is shocking to see, but the fact that it's going on is as American as cherry pie. It's what happens in this country to people, to women, who are deemed guilty of something egregious. The fact that we get to see it is shocking, but the fact that it goes on should be very familiar._\r\n\r\nNevertheless, it's a disappointingly simplistic _dénouement_ given the complexity and thematic depth of the preceding narrative.\r\n\r\nAnother problem is that the characters are underwritten across the board, with only Lily and Bex really getting any degree of interiority. Sarah barely registers as a character at all, Em is only marginally better, and none of the other characters are developed beyond their archetypal role – Reagan Hall (Bella Thorne), a self-obsessed cheerleader; Nick Mathers (Joel McHale), Em's neighbour with a secret to hide; Grace (Maude Apatow), Reagan's quiet and submissive best friend; Marty (Noah Galvin), a local computer nerd; Nance (Anika Noni Rose), Em's adopted mother with terrible taste in men; Chief Patterson (J.D. Evermore), Salem's clueless chief of police; Rose Mathers (Susan Misner), Nick's wife; Lawrence Colson (Joe Chrest), Lily's old-fashioned father; Rebecca Colson (Kathryn Erbe), Lily's even more old-fashioned mother; and Donny Colson (Caden Swain), Lily's desensitised younger brother.\r\n\r\nDepicting a cultural anxiety that is uniquely contemporary, _Assassination Nation_ is an unexpectedly smart film examining weighty topics of great importance to the socio-political moment, irrespective of your political affiliation. While it is immensely strong (both hilarious and disturbing) in its depiction of teenage gender politics, gun culture, political correctness, online behaviour etc, it falters when it comes to the dynamics of the narrative, setting up several strands which never pay off, and ending a little weakly. Nevertheless, the questions it raises are important ones, and they are asked very well. Levinson isn't interested in providing answers though. That, he suggests, is our job.", "created_at": "2019-06-29T17:54:49.968Z"}, {"movie_id": 446101, "review_id": "64a3253be9da69011e57bfa0", "author_rating": 6.0, "review_text": "I would have to say this is probably my least favorite out of the series. It is funny but I'd rather watch the chipmunks get into mischief then his girlfriends son being jelly.", "created_at": "2023-07-03T19:44:59.931Z"}, {"movie_id": 446101, "review_id": "64a32e6f8289a000caf10c8b", "author_rating": 6.0, "review_text": "Crazy ass movie. What people can really be driven to do when necessary is crazy. I liked this movie.", "created_at": "2023-07-03T20:24:15.753Z"}]