[{"movie_id": 330459, "review_id": "58547871c3a3683150031bca", "author_rating": null, "review_text": "\"It carries the burden of being about odds and stakes, of legacies and consequences, of understanding destiny...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/12/17/rogue-one-a-star-wars-story.html", "created_at": "2016-12-16T23:27:45.243Z"}, {"movie_id": 330459, "review_id": "5897f3459251417a82003b4e", "author_rating": 7.0, "review_text": "Is not my new favourite _Star Wars_ movie. But does contain my new favourite _Star Wars_ scene.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-02-06T03:53:41.055Z"}, {"movie_id": 330459, "review_id": "58a720ecc3a368672e00abda", "author_rating": 10.0, "review_text": "Fun Star Wars movie. Plenty of homages and nods to the original trilogy throughout the film, Andy plenty of cameos as well. Has amazing action sequences and enough thrills to keep any true Star Wars fan hooked right from the beginning. No opening crawl at the start for a change and a great score by Michael Giachinno, but still includes the original end credits with John Williams' original music. K-2SO is a show stealer and is very funny as a character. Overall the best Star Wars film since Empire Strikes Back in my opinion. The force is with this one.", "created_at": "2017-02-17T16:12:28.821Z"}, {"movie_id": 330459, "review_id": "59133d2dc3a36864fc056b2c", "author_rating": 5.0, "review_text": "On the surface, this is a well-made action movie set within the Star Wars universe filled with nods and homages to \"A New Hope\" that will make you tingle with warm nostalgia. The reappearance of sets, costumes and characters from our favorite childhood movies might make you say \"Now, THIS is a Star Wars movie!\"\r\n\r\nHowever, nostalgia and making copious amounts of money on that nostalgia seemed to be Disney's primary strategy with this movie. It's mimicry, plain and simple. The CGI recreations of Peter Cushing and Carrie Fisher felt very dirty and a flagrant disrespect to the departed actors, not to mention jarring, for a first time viewer. The digital appearance of Grand Moff Tarkin disengaged me from the frail story and made me settle my stomach with a handful of antacid tablets. \r\n\r\nThe story, writing, characterization is on-par with what you'd expect from modern cinema and the movie serves it's primary purpose of being entertaining. But, as a long-time Star Wars fan, I just couldn't help but feeling pandered to while watching this movie.", "created_at": "2017-05-10T16:17:49.785Z"}, {"movie_id": 330459, "review_id": "592d3f1dc3a3680f7700cc8c", "author_rating": 10.0, "review_text": "Oups! I just realized that, for some reason, this movie had fallen between the cracks. It was quite some time since I watched it but I seem to have forgotten to write a post about it.\r\n\r\nFor me this was one of the best of the new (after the original trilogy) Star Wars movies. It was fun, entertaining with plenty of good, old-fashioned Star Wars action. I generally do not like prequels but this time I felt it was nice to get a bit of the background to the statement that “a number of spies died to get this information” in episode IV. We were even provided with a bit of an explanation as to why the Death Star had this silly weakness in the first place.\r\n\r\nThe actors were doing a decent enough job of it. The chatty android was fun without being totally silly. It was a nice roller coaster ride of action, improvisations, and gung ho ludicrous stunts inside and outside of various forms of transportation means.\r\n\r\nAs usual with Star Wars the science part of science fiction is somewhat lacking. What looks cool is what is put on the screen and screw science. When reading books I am more sensitive to such things but for a Star Wars movie it works well enough.\r\n\r\nSome people seem to be dissecting the characters and dialogue, trying to put logic into it as well as wanting to have more emotions and “character development”. Come on! It is a Star Wars movie. It is supposed to be all action and visually stunning.\r\n\r\nOn that this movie delivers. Sure the plot is not really the most developed one and has plenty of faults. The movie is till a hugely fun Star Wars based science romp though.", "created_at": "2017-05-30T09:45:01.722Z"}, {"movie_id": 330459, "review_id": "59fe17cac3a36868a701f618", "author_rating": 8.0, "review_text": "**The episode III½.**\r\n\r\nSo this is like a bridge between the original trilogy and the next three prequels. A story where the main characters from the original tale are not involved. Being a big fan of this franchise, I loved it. I did not expect big, so got entertained well. But pity that this wonderful characters are not going to return. This is just a one-off film. For seeing its overwhelming success, there could be a prequel, which has a very very slim chance.\r\n\r\nThe story was like that had started in a half way. That's why I wanted a prequel to tell us the Galen Erso's point of view story. When he has been taken back to the base to work for the Empire, his daughter is the only one who escapes from there. After a few years later the grown- up daughter, Jyn, end up on the rebel's side. When she hints a plan for them to strike the Empire, nobody considers it. But a rogue gang forms where they all does according to her saying. That's the story, and how it all ends are the rest.\r\n\r\nThe story was simple, but the action-adventures were good. Like what a 'Star Wars' fans want to see. The main drawback was there's no familiar faces around. Even the original franchise style of title and credit presentation was off the beat. Though there were cameos. Darth Vade, Princess Leia, R2D2 and 3PO, including a small lightsabre fight at the end, just to satisfy the fanboys. Overall a worthy film, otherwise it would have not earned one billion at the box office, making one of the top 10 of all time.\r\n\r\n_8/10_", "created_at": "2017-11-04T19:40:58.909Z"}, {"movie_id": 330459, "review_id": "5e2f2b801685da0013e9f8be", "author_rating": 7.0, "review_text": "Dark Vader: \"Be careful not to choke on your aspirations, Director.\" \r\n\r\nRogue One follows Jyn Erso (played by Felicity Jones) a Rebellion soldier and criminal, who is about to experience her biggest challenge yet when Mon Mothma sets her out on a mission to steal the plans for the Death Star. With help from the Rebels, a master swordsman, and non-allied forces, Jyn will be in for something bigger than she thinks. \r\n\r\nI had my worries with Rogue One, if I must admit. After the massive success of \"The Force Awakens\", the universe of Star Wars has now expanded even more. There's going to be more sequels, prequels, and spin-offs every year now. Why this worries me is because I fear I'm going to be sick of theses and not really get exited anymore. Star Wars should be treated like a three year event like before, it gives more time for the writers & director to really flesh out the story. It may seem like a long wait, but it'll be worth the wait. But that's not all. The trouble re shoots this went through and the ridiculous short deadlines during post-production. But after seeing the film myself, I can safely say that this new prequel isn't a bad one. \r\n\r\n\"Rogue One: A Star Wars Story\" is a good movie. Not great or amazing, just decent. In my opinion, it's not up there with \"A New Hope\" or \"Empire Strikes Back\". It's more in the middle for me. If I have to be honest, I actually enjoyed \"Force Awakens\" more than this. Yeah, I said it. The movie is flawed, but it dose have a lot to like about it. \r\n\r\nI can't imagine the pressure Gareth Edwards must have felt making this, kinda like what Abrams was feeling. In interviews, Gareth has said he was a Star Wars fan and it was the reason why he wanted to make movies. So this is very dear to him and while there where some slip ups in parts, but I must say that he handed the material really well. Gareth Edward is very good at making things feel huge and the heavy scale of things. The action scenes were directed so brilliantly that it actually felt like a war movie. \r\n\r\nThat's what really surprised me about \"Rogue One\" is how dark and depressing it is. Some people may have a problem with that, since everyone is use to these adventures with are favorite characters. For me, I didn't have an issue with it. Heck, I'm kinda glad it had the balls to go that far and be violent. The humor is very limited, but when there is humor is mostly from K-2SO (played by Alan Tudyk), who was just the best. \r\n\r\nThe CGI in this movie was incredible and quite groundbreaking. I mean, it's TOO GOOD. The way it blended with the real life environment and the action scenes was so good that half of the time I was watching computer effect's on screen. How it was executed was so beautiful and quite the achievement. \r\n\r\nNow the biggest complaint I've been hearing from Star Wars fans is about Peter Cushing Digital Resurrection. Yep, he's back to cinematic life through the use of state-of-the-art visual effects wizardry. He's character Grand Moff Tarkin is in the movie, but instead of re-casting the role or kept his digital face in the shadows, but that's surprisingly not the case. He's in the movie quite a lot as you see him in full form and up close. This is getting a mix response from people and even I was a bit mixed on it. I was a bit weird out by it, as Peter Cushing has been dead for 22 years and seeing up there was hard to digest. But after letting it sink in, I thought it wasn't too noticeable and in a few scene I actually brought into it. I thought it looked real when he wasn't moving around or any close ups to his face. But that's just my thoughts.\r\n\r\nSpeaking of bringing back old characters, Dark Vader makes a appears in this. While he's screen time is very short, but he steals every scene he's in. Eventually the hallway scene, that was so bad-ass and one of my favorite moments in the movie. It's great to see him and James Earl Jones back as one of greatest villains of all time. \r\n\r\nNow for the problems: The first half of \"Rogue One\" was a bit rough for me and I was kinda bored at times. I didn't care or got attracted to the characters. The characterization was lacking and that's a real shame, because Star Wars is all about the characters, as it's the thing we remember from these movies. It's not all about Lightsabers and battles, it's the characters. Felicity Jones, Alan Tudyk & Mads Mikkelsen characters were the only ones that I cared about. The others not so much. \r\n\r\nAnother major part of the Star Wars movies is the score. John Williams score is so iconic that it's hard to top it. It's the heart of the series and I kinda wish he did the score for this, because Michael Giacchino score wasn't that good. But I'll cut Giacchino a little slack, he only had 4 weeks to compose it and it is a tough act to follow. That goes back to what I said about the deadlines being too short. \r\n\r\nOverall rating: \"Rogue One: A Star Wars Story\" is a good entry to the series and it dose feel like a dark Star Wars movie. I may have problems with the movie and I have to be honest with that, but I do think it ties in very well with \"A New Hope\". A plot like this was needed to fill in the 40 year old plot gap.", "created_at": "2020-01-27T18:27:12.263Z"}, {"movie_id": 330459, "review_id": "601b7a57bb1057003e9d95b0", "author_rating": 7.0, "review_text": "A pretty cool prequel to 1977's <em>'Star Wars'</em>. I wouldn't say I overly enjoyed it, but it's worthy for the purpose it serves.\r\n\r\nWhat stopped me from loving <em>'Rogue One: A Star Wars Story'</em> was probably, mostly, the pacing, which I found to be too slow in parts. It never majorly affected my viewing experience, but I could feel it slightly dragging here and there. I also didn't like the cast on anything more than a neutral/standard level.\r\n\r\nFelicity Jones does an admirable job in the lead role, I did like how they set her story up at the beginning. I also found any scene with Mads Mikkelsen good to watch, while Riz Ahmed and Forest Whitaker are solid; Alan Tudyk is OK as well. Diego Luna and Ben Mendelsohn, however, didn't do anything for me.\r\n\r\nThe story itself is satisfactory, the ending to it is more meaningful than I was expecting and features a few nice shots; the whole film looks lovely in fairness. I personally would've shaved 10-20 minutes off the run time and got more devilish antagonists, though.\r\n\r\nStill, it's at the very least a good film no doubt.", "created_at": "2021-02-04T04:38:47.083Z"}, {"movie_id": 330459, "review_id": "602edd3d0443c90041d11e0f", "author_rating": 8.0, "review_text": "One of the better \"side stories\" of the Star Wars universe. Being mid 40'ies :) my first experience with Star Wars was the original movies on the telly, but I have since seen the remastered editions on the big screen as well as the new aditions to the franchise. In that perspective, Rogue One is among my top 5. It can be seen on its own but has good references to the original movies for the devoted fans.", "created_at": "2021-02-18T21:33:49.026Z"}, {"movie_id": 330459, "review_id": "6379bb343d35570078df2341", "author_rating": 9.0, "review_text": "**Rogue One feels familiar within the Star Wars franchise but still bold and new! A great on-ramp for people new to Star Wars and a favorite for Star Wars enthusiasts.**\r\n\r\nRogue One brought back the gritty struggle of the fledgling resistance returning the franchise to the feel and excellence of the original franchise. While the Force and the Jedi's influence could be felt throughout, Rogue One didn't get caught up in lightsaber duels and prophecies, focusing instead on the underground espionage of the Rebellion. Without returning fan favorites safe with plot armor, the stakes were much higher with new characters in jeopardy and danger, and some not surviving. The cast's risk and morally flexible nature made this Star Wars movie focus on the themes of war, unlike the other films. The writing, cinematography, performances, effects, and story were all among the best of the entire franchise. Rogue One is one of the best Star Wars movies and an exceptional spy film!", "created_at": "2022-11-20T05:29:24.870Z"}, {"movie_id": 330459, "review_id": "63c2168d8efe7300f0a34af8", "author_rating": 10.0, "review_text": "So, there seems to be two main points that the real haters are focusing on.\r\n\r\n1) Fanfiction 2) SJW propaganda.\r\n\r\nNow, I do believe these are both reactions to, well, The Force Awakens. The first just being a hatred for Rey, who was a Mary Sue and one that gave the entire movie a fanfiction feel.\r\n\r\nAnd where that is true for The Force Awakens, its not Rogue One, at least it is not Rogue One if we are staying in the Star Wars universe...it COULD be fanfiction if someone warped Saving Private Ryan into the Star Wars universe and...yeah, not, It's not fan fiction.\r\n\r\nThe Second point, the SJW one, well, that could honestly also be a backlash against The Force Awakens as, yeah, anyone that called Rey a Mary Sue was accused of being a misogynist for, well...reasons.\r\n\r\nSpecifically for reasons that had NOTHING to do with why they didn't like Rey--at least why most people didn't like her...most.\r\n\r\nAnd, in Rogue One, if the cast is multi-cultural of ominous political agenda reasons...it doesn't really feel that way. The diversity works and it works because you don't really notice it unless people point it out to complain about it..\r\n\r\n...and the people that do, yeah, it is likely because of The Force Awakens and they are forgetting that this takes place in a Galaxy Far, Far Away and, well, by definition they are all aliens anyway, so, you know, trying to force diversity in a movie entirely comprised of according to Hoyle aliens...wouldn't that mean a LOT more alien looking aliens? So, a lot of that is lingering from The Force Awakens and, well, some of it is understandable, if not for the movie itself than because of the backlash against people that thought Rey was entirely too perfect.\r\n\r\nAnother reason for that hate could be a lack of lightsaber battles and, I really feel the fanboys on this one...but, no, really this was a Star Wars movie that felt like a war movie and the lack of blatant force powers and lightsabers until the very end worked...\r\n\r\nIn fact it worked so well you did kind of get a Saving Private Ryan feel off the movie, a lone rogue squad taking on the entire Nazi?...Sith?...the entire Intergalactic Empire.\r\n\r\nIt was really fun to watch and, not sense the Evacuation at Dunkirk that was the planet Hoth, did we see a Star Wars ground battle that really looked like it was a war. So this was pretty cool.\r\n\r\nAnd then there is Jyn. Now a lot of hate gores to her and I can't figure out why. She seemed like a real character. Rey could have been a feminist SJW transplant that was made super awesome because...reasons. But Jyn had serious flaws, she had issues, she seemed like a real person. So props to Felicity Jones for bringing that awesomeness to life.\r\n\r\nNo, seriously, props to her. Outside of Solo, I really don't think I've seen a Star Wars character I thought was that, well, cool, real, just fun in the way that you could point to her and say \"I could know someone like that.\" There were other cool characters in the saga...but none as realistically portrayed. And that doesn't just go for Jones.\r\n\r\nThe only main character that doesn't seem like a real person was Chirrut Îmwe and, well, we can forgive him for that because he was the kung-fu movie awesome that helped make the movie not just a war movie in space. He was the guy that brought the Force into the film and made it a Star Wars flick...so, who really cares if he doesn't feel like a real person? I know I don't.\r\n\r\nAnd the last bit of hate is because, well, it doesn't have any of the real main characters, no Solo, no Skywalker and...well...it IS a stand alone movie, so if you came in expecting them, well, that is your fault. Disney made it clear from the get-go.\r\n\r\nWhat you have here is a cool science fiction war movie. It fits into the saga and it doesn't, but that isn't a bad thing--prequels, the Force Awakens--as only 3/7th of the saga movies are really any good.\r\n\r\nAnd, as a war movie, it stands on its own. It is actually better than a LOT of the war movies people tout as masterpieces **cough** **Thin Red Line** **cough** So, watch it, you should have no complaints...\r\n\r\n...unless you are complaining about the SJW, the Fanfiction, and the lack of Skywalker or Solo, and if you are, well, there is going to be no pleasing you no matter what you watch.", "created_at": "2023-01-14T02:42:21.788Z"}, {"movie_id": 330459, "review_id": "58547871c3a3683150031bca", "author_rating": null, "review_text": "\"It carries the burden of being about odds and stakes, of legacies and consequences, of understanding destiny...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/12/17/rogue-one-a-star-wars-story.html", "created_at": "2016-12-16T23:27:45.243Z"}, {"movie_id": 330459, "review_id": "5897f3459251417a82003b4e", "author_rating": 7.0, "review_text": "Is not my new favourite _Star Wars_ movie. But does contain my new favourite _Star Wars_ scene.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-02-06T03:53:41.055Z"}, {"movie_id": 330459, "review_id": "58a720ecc3a368672e00abda", "author_rating": 10.0, "review_text": "Fun Star Wars movie. Plenty of homages and nods to the original trilogy throughout the film, Andy plenty of cameos as well. Has amazing action sequences and enough thrills to keep any true Star Wars fan hooked right from the beginning. No opening crawl at the start for a change and a great score by Michael Giachinno, but still includes the original end credits with John Williams' original music. K-2SO is a show stealer and is very funny as a character. Overall the best Star Wars film since Empire Strikes Back in my opinion. The force is with this one.", "created_at": "2017-02-17T16:12:28.821Z"}, {"movie_id": 330459, "review_id": "59133d2dc3a36864fc056b2c", "author_rating": 5.0, "review_text": "On the surface, this is a well-made action movie set within the Star Wars universe filled with nods and homages to \"A New Hope\" that will make you tingle with warm nostalgia. The reappearance of sets, costumes and characters from our favorite childhood movies might make you say \"Now, THIS is a Star Wars movie!\"\r\n\r\nHowever, nostalgia and making copious amounts of money on that nostalgia seemed to be Disney's primary strategy with this movie. It's mimicry, plain and simple. The CGI recreations of Peter Cushing and Carrie Fisher felt very dirty and a flagrant disrespect to the departed actors, not to mention jarring, for a first time viewer. The digital appearance of Grand Moff Tarkin disengaged me from the frail story and made me settle my stomach with a handful of antacid tablets. \r\n\r\nThe story, writing, characterization is on-par with what you'd expect from modern cinema and the movie serves it's primary purpose of being entertaining. But, as a long-time Star Wars fan, I just couldn't help but feeling pandered to while watching this movie.", "created_at": "2017-05-10T16:17:49.785Z"}, {"movie_id": 330459, "review_id": "592d3f1dc3a3680f7700cc8c", "author_rating": 10.0, "review_text": "Oups! I just realized that, for some reason, this movie had fallen between the cracks. It was quite some time since I watched it but I seem to have forgotten to write a post about it.\r\n\r\nFor me this was one of the best of the new (after the original trilogy) Star Wars movies. It was fun, entertaining with plenty of good, old-fashioned Star Wars action. I generally do not like prequels but this time I felt it was nice to get a bit of the background to the statement that “a number of spies died to get this information” in episode IV. We were even provided with a bit of an explanation as to why the Death Star had this silly weakness in the first place.\r\n\r\nThe actors were doing a decent enough job of it. The chatty android was fun without being totally silly. It was a nice roller coaster ride of action, improvisations, and gung ho ludicrous stunts inside and outside of various forms of transportation means.\r\n\r\nAs usual with Star Wars the science part of science fiction is somewhat lacking. What looks cool is what is put on the screen and screw science. When reading books I am more sensitive to such things but for a Star Wars movie it works well enough.\r\n\r\nSome people seem to be dissecting the characters and dialogue, trying to put logic into it as well as wanting to have more emotions and “character development”. Come on! It is a Star Wars movie. It is supposed to be all action and visually stunning.\r\n\r\nOn that this movie delivers. Sure the plot is not really the most developed one and has plenty of faults. The movie is till a hugely fun Star Wars based science romp though.", "created_at": "2017-05-30T09:45:01.722Z"}, {"movie_id": 330459, "review_id": "59fe17cac3a36868a701f618", "author_rating": 8.0, "review_text": "**The episode III½.**\r\n\r\nSo this is like a bridge between the original trilogy and the next three prequels. A story where the main characters from the original tale are not involved. Being a big fan of this franchise, I loved it. I did not expect big, so got entertained well. But pity that this wonderful characters are not going to return. This is just a one-off film. For seeing its overwhelming success, there could be a prequel, which has a very very slim chance.\r\n\r\nThe story was like that had started in a half way. That's why I wanted a prequel to tell us the Galen Erso's point of view story. When he has been taken back to the base to work for the Empire, his daughter is the only one who escapes from there. After a few years later the grown- up daughter, Jyn, end up on the rebel's side. When she hints a plan for them to strike the Empire, nobody considers it. But a rogue gang forms where they all does according to her saying. That's the story, and how it all ends are the rest.\r\n\r\nThe story was simple, but the action-adventures were good. Like what a 'Star Wars' fans want to see. The main drawback was there's no familiar faces around. Even the original franchise style of title and credit presentation was off the beat. Though there were cameos. Darth Vade, Princess Leia, R2D2 and 3PO, including a small lightsabre fight at the end, just to satisfy the fanboys. Overall a worthy film, otherwise it would have not earned one billion at the box office, making one of the top 10 of all time.\r\n\r\n_8/10_", "created_at": "2017-11-04T19:40:58.909Z"}, {"movie_id": 330459, "review_id": "5e2f2b801685da0013e9f8be", "author_rating": 7.0, "review_text": "Dark Vader: \"Be careful not to choke on your aspirations, Director.\" \r\n\r\nRogue One follows Jyn Erso (played by Felicity Jones) a Rebellion soldier and criminal, who is about to experience her biggest challenge yet when Mon Mothma sets her out on a mission to steal the plans for the Death Star. With help from the Rebels, a master swordsman, and non-allied forces, Jyn will be in for something bigger than she thinks. \r\n\r\nI had my worries with Rogue One, if I must admit. After the massive success of \"The Force Awakens\", the universe of Star Wars has now expanded even more. There's going to be more sequels, prequels, and spin-offs every year now. Why this worries me is because I fear I'm going to be sick of theses and not really get exited anymore. Star Wars should be treated like a three year event like before, it gives more time for the writers & director to really flesh out the story. It may seem like a long wait, but it'll be worth the wait. But that's not all. The trouble re shoots this went through and the ridiculous short deadlines during post-production. But after seeing the film myself, I can safely say that this new prequel isn't a bad one. \r\n\r\n\"Rogue One: A Star Wars Story\" is a good movie. Not great or amazing, just decent. In my opinion, it's not up there with \"A New Hope\" or \"Empire Strikes Back\". It's more in the middle for me. If I have to be honest, I actually enjoyed \"Force Awakens\" more than this. Yeah, I said it. The movie is flawed, but it dose have a lot to like about it. \r\n\r\nI can't imagine the pressure Gareth Edwards must have felt making this, kinda like what Abrams was feeling. In interviews, Gareth has said he was a Star Wars fan and it was the reason why he wanted to make movies. So this is very dear to him and while there where some slip ups in parts, but I must say that he handed the material really well. Gareth Edward is very good at making things feel huge and the heavy scale of things. The action scenes were directed so brilliantly that it actually felt like a war movie. \r\n\r\nThat's what really surprised me about \"Rogue One\" is how dark and depressing it is. Some people may have a problem with that, since everyone is use to these adventures with are favorite characters. For me, I didn't have an issue with it. Heck, I'm kinda glad it had the balls to go that far and be violent. The humor is very limited, but when there is humor is mostly from K-2SO (played by Alan Tudyk), who was just the best. \r\n\r\nThe CGI in this movie was incredible and quite groundbreaking. I mean, it's TOO GOOD. The way it blended with the real life environment and the action scenes was so good that half of the time I was watching computer effect's on screen. How it was executed was so beautiful and quite the achievement. \r\n\r\nNow the biggest complaint I've been hearing from Star Wars fans is about Peter Cushing Digital Resurrection. Yep, he's back to cinematic life through the use of state-of-the-art visual effects wizardry. He's character Grand Moff Tarkin is in the movie, but instead of re-casting the role or kept his digital face in the shadows, but that's surprisingly not the case. He's in the movie quite a lot as you see him in full form and up close. This is getting a mix response from people and even I was a bit mixed on it. I was a bit weird out by it, as Peter Cushing has been dead for 22 years and seeing up there was hard to digest. But after letting it sink in, I thought it wasn't too noticeable and in a few scene I actually brought into it. I thought it looked real when he wasn't moving around or any close ups to his face. But that's just my thoughts.\r\n\r\nSpeaking of bringing back old characters, Dark Vader makes a appears in this. While he's screen time is very short, but he steals every scene he's in. Eventually the hallway scene, that was so bad-ass and one of my favorite moments in the movie. It's great to see him and James Earl Jones back as one of greatest villains of all time. \r\n\r\nNow for the problems: The first half of \"Rogue One\" was a bit rough for me and I was kinda bored at times. I didn't care or got attracted to the characters. The characterization was lacking and that's a real shame, because Star Wars is all about the characters, as it's the thing we remember from these movies. It's not all about Lightsabers and battles, it's the characters. Felicity Jones, Alan Tudyk & Mads Mikkelsen characters were the only ones that I cared about. The others not so much. \r\n\r\nAnother major part of the Star Wars movies is the score. John Williams score is so iconic that it's hard to top it. It's the heart of the series and I kinda wish he did the score for this, because Michael Giacchino score wasn't that good. But I'll cut Giacchino a little slack, he only had 4 weeks to compose it and it is a tough act to follow. That goes back to what I said about the deadlines being too short. \r\n\r\nOverall rating: \"Rogue One: A Star Wars Story\" is a good entry to the series and it dose feel like a dark Star Wars movie. I may have problems with the movie and I have to be honest with that, but I do think it ties in very well with \"A New Hope\". A plot like this was needed to fill in the 40 year old plot gap.", "created_at": "2020-01-27T18:27:12.263Z"}, {"movie_id": 330459, "review_id": "601b7a57bb1057003e9d95b0", "author_rating": 7.0, "review_text": "A pretty cool prequel to 1977's <em>'Star Wars'</em>. I wouldn't say I overly enjoyed it, but it's worthy for the purpose it serves.\r\n\r\nWhat stopped me from loving <em>'Rogue One: A Star Wars Story'</em> was probably, mostly, the pacing, which I found to be too slow in parts. It never majorly affected my viewing experience, but I could feel it slightly dragging here and there. I also didn't like the cast on anything more than a neutral/standard level.\r\n\r\nFelicity Jones does an admirable job in the lead role, I did like how they set her story up at the beginning. I also found any scene with Mads Mikkelsen good to watch, while Riz Ahmed and Forest Whitaker are solid; Alan Tudyk is OK as well. Diego Luna and Ben Mendelsohn, however, didn't do anything for me.\r\n\r\nThe story itself is satisfactory, the ending to it is more meaningful than I was expecting and features a few nice shots; the whole film looks lovely in fairness. I personally would've shaved 10-20 minutes off the run time and got more devilish antagonists, though.\r\n\r\nStill, it's at the very least a good film no doubt.", "created_at": "2021-02-04T04:38:47.083Z"}, {"movie_id": 330459, "review_id": "602edd3d0443c90041d11e0f", "author_rating": 8.0, "review_text": "One of the better \"side stories\" of the Star Wars universe. Being mid 40'ies :) my first experience with Star Wars was the original movies on the telly, but I have since seen the remastered editions on the big screen as well as the new aditions to the franchise. In that perspective, Rogue One is among my top 5. It can be seen on its own but has good references to the original movies for the devoted fans.", "created_at": "2021-02-18T21:33:49.026Z"}, {"movie_id": 330459, "review_id": "6379bb343d35570078df2341", "author_rating": 9.0, "review_text": "**Rogue One feels familiar within the Star Wars franchise but still bold and new! A great on-ramp for people new to Star Wars and a favorite for Star Wars enthusiasts.**\r\n\r\nRogue One brought back the gritty struggle of the fledgling resistance returning the franchise to the feel and excellence of the original franchise. While the Force and the Jedi's influence could be felt throughout, Rogue One didn't get caught up in lightsaber duels and prophecies, focusing instead on the underground espionage of the Rebellion. Without returning fan favorites safe with plot armor, the stakes were much higher with new characters in jeopardy and danger, and some not surviving. The cast's risk and morally flexible nature made this Star Wars movie focus on the themes of war, unlike the other films. The writing, cinematography, performances, effects, and story were all among the best of the entire franchise. Rogue One is one of the best Star Wars movies and an exceptional spy film!", "created_at": "2022-11-20T05:29:24.870Z"}, {"movie_id": 330459, "review_id": "63c2168d8efe7300f0a34af8", "author_rating": 10.0, "review_text": "So, there seems to be two main points that the real haters are focusing on.\r\n\r\n1) Fanfiction 2) SJW propaganda.\r\n\r\nNow, I do believe these are both reactions to, well, The Force Awakens. The first just being a hatred for Rey, who was a Mary Sue and one that gave the entire movie a fanfiction feel.\r\n\r\nAnd where that is true for The Force Awakens, its not Rogue One, at least it is not Rogue One if we are staying in the Star Wars universe...it COULD be fanfiction if someone warped Saving Private Ryan into the Star Wars universe and...yeah, not, It's not fan fiction.\r\n\r\nThe Second point, the SJW one, well, that could honestly also be a backlash against The Force Awakens as, yeah, anyone that called Rey a Mary Sue was accused of being a misogynist for, well...reasons.\r\n\r\nSpecifically for reasons that had NOTHING to do with why they didn't like Rey--at least why most people didn't like her...most.\r\n\r\nAnd, in Rogue One, if the cast is multi-cultural of ominous political agenda reasons...it doesn't really feel that way. The diversity works and it works because you don't really notice it unless people point it out to complain about it..\r\n\r\n...and the people that do, yeah, it is likely because of The Force Awakens and they are forgetting that this takes place in a Galaxy Far, Far Away and, well, by definition they are all aliens anyway, so, you know, trying to force diversity in a movie entirely comprised of according to Hoyle aliens...wouldn't that mean a LOT more alien looking aliens? So, a lot of that is lingering from The Force Awakens and, well, some of it is understandable, if not for the movie itself than because of the backlash against people that thought Rey was entirely too perfect.\r\n\r\nAnother reason for that hate could be a lack of lightsaber battles and, I really feel the fanboys on this one...but, no, really this was a Star Wars movie that felt like a war movie and the lack of blatant force powers and lightsabers until the very end worked...\r\n\r\nIn fact it worked so well you did kind of get a Saving Private Ryan feel off the movie, a lone rogue squad taking on the entire Nazi?...Sith?...the entire Intergalactic Empire.\r\n\r\nIt was really fun to watch and, not sense the Evacuation at Dunkirk that was the planet Hoth, did we see a Star Wars ground battle that really looked like it was a war. So this was pretty cool.\r\n\r\nAnd then there is Jyn. Now a lot of hate gores to her and I can't figure out why. She seemed like a real character. Rey could have been a feminist SJW transplant that was made super awesome because...reasons. But Jyn had serious flaws, she had issues, she seemed like a real person. So props to Felicity Jones for bringing that awesomeness to life.\r\n\r\nNo, seriously, props to her. Outside of Solo, I really don't think I've seen a Star Wars character I thought was that, well, cool, real, just fun in the way that you could point to her and say \"I could know someone like that.\" There were other cool characters in the saga...but none as realistically portrayed. And that doesn't just go for Jones.\r\n\r\nThe only main character that doesn't seem like a real person was Chirrut Îmwe and, well, we can forgive him for that because he was the kung-fu movie awesome that helped make the movie not just a war movie in space. He was the guy that brought the Force into the film and made it a Star Wars flick...so, who really cares if he doesn't feel like a real person? I know I don't.\r\n\r\nAnd the last bit of hate is because, well, it doesn't have any of the real main characters, no Solo, no Skywalker and...well...it IS a stand alone movie, so if you came in expecting them, well, that is your fault. Disney made it clear from the get-go.\r\n\r\nWhat you have here is a cool science fiction war movie. It fits into the saga and it doesn't, but that isn't a bad thing--prequels, the Force Awakens--as only 3/7th of the saga movies are really any good.\r\n\r\nAnd, as a war movie, it stands on its own. It is actually better than a LOT of the war movies people tout as masterpieces **cough** **Thin Red Line** **cough** So, watch it, you should have no complaints...\r\n\r\n...unless you are complaining about the SJW, the Fanfiction, and the lack of Skywalker or Solo, and if you are, well, there is going to be no pleasing you no matter what you watch.", "created_at": "2023-01-14T02:42:21.788Z"}, {"movie_id": 330459, "review_id": "58547871c3a3683150031bca", "author_rating": null, "review_text": "\"It carries the burden of being about odds and stakes, of legacies and consequences, of understanding destiny...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/12/17/rogue-one-a-star-wars-story.html", "created_at": "2016-12-16T23:27:45.243Z"}, {"movie_id": 330459, "review_id": "5897f3459251417a82003b4e", "author_rating": 7.0, "review_text": "Is not my new favourite _Star Wars_ movie. But does contain my new favourite _Star Wars_ scene.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-02-06T03:53:41.055Z"}, {"movie_id": 330459, "review_id": "58a720ecc3a368672e00abda", "author_rating": 10.0, "review_text": "Fun Star Wars movie. Plenty of homages and nods to the original trilogy throughout the film, Andy plenty of cameos as well. Has amazing action sequences and enough thrills to keep any true Star Wars fan hooked right from the beginning. No opening crawl at the start for a change and a great score by Michael Giachinno, but still includes the original end credits with John Williams' original music. K-2SO is a show stealer and is very funny as a character. Overall the best Star Wars film since Empire Strikes Back in my opinion. The force is with this one.", "created_at": "2017-02-17T16:12:28.821Z"}, {"movie_id": 330459, "review_id": "59133d2dc3a36864fc056b2c", "author_rating": 5.0, "review_text": "On the surface, this is a well-made action movie set within the Star Wars universe filled with nods and homages to \"A New Hope\" that will make you tingle with warm nostalgia. The reappearance of sets, costumes and characters from our favorite childhood movies might make you say \"Now, THIS is a Star Wars movie!\"\r\n\r\nHowever, nostalgia and making copious amounts of money on that nostalgia seemed to be Disney's primary strategy with this movie. It's mimicry, plain and simple. The CGI recreations of Peter Cushing and Carrie Fisher felt very dirty and a flagrant disrespect to the departed actors, not to mention jarring, for a first time viewer. The digital appearance of Grand Moff Tarkin disengaged me from the frail story and made me settle my stomach with a handful of antacid tablets. \r\n\r\nThe story, writing, characterization is on-par with what you'd expect from modern cinema and the movie serves it's primary purpose of being entertaining. But, as a long-time Star Wars fan, I just couldn't help but feeling pandered to while watching this movie.", "created_at": "2017-05-10T16:17:49.785Z"}, {"movie_id": 330459, "review_id": "592d3f1dc3a3680f7700cc8c", "author_rating": 10.0, "review_text": "Oups! I just realized that, for some reason, this movie had fallen between the cracks. It was quite some time since I watched it but I seem to have forgotten to write a post about it.\r\n\r\nFor me this was one of the best of the new (after the original trilogy) Star Wars movies. It was fun, entertaining with plenty of good, old-fashioned Star Wars action. I generally do not like prequels but this time I felt it was nice to get a bit of the background to the statement that “a number of spies died to get this information” in episode IV. We were even provided with a bit of an explanation as to why the Death Star had this silly weakness in the first place.\r\n\r\nThe actors were doing a decent enough job of it. The chatty android was fun without being totally silly. It was a nice roller coaster ride of action, improvisations, and gung ho ludicrous stunts inside and outside of various forms of transportation means.\r\n\r\nAs usual with Star Wars the science part of science fiction is somewhat lacking. What looks cool is what is put on the screen and screw science. When reading books I am more sensitive to such things but for a Star Wars movie it works well enough.\r\n\r\nSome people seem to be dissecting the characters and dialogue, trying to put logic into it as well as wanting to have more emotions and “character development”. Come on! It is a Star Wars movie. It is supposed to be all action and visually stunning.\r\n\r\nOn that this movie delivers. Sure the plot is not really the most developed one and has plenty of faults. The movie is till a hugely fun Star Wars based science romp though.", "created_at": "2017-05-30T09:45:01.722Z"}, {"movie_id": 330459, "review_id": "59fe17cac3a36868a701f618", "author_rating": 8.0, "review_text": "**The episode III½.**\r\n\r\nSo this is like a bridge between the original trilogy and the next three prequels. A story where the main characters from the original tale are not involved. Being a big fan of this franchise, I loved it. I did not expect big, so got entertained well. But pity that this wonderful characters are not going to return. This is just a one-off film. For seeing its overwhelming success, there could be a prequel, which has a very very slim chance.\r\n\r\nThe story was like that had started in a half way. That's why I wanted a prequel to tell us the Galen Erso's point of view story. When he has been taken back to the base to work for the Empire, his daughter is the only one who escapes from there. After a few years later the grown- up daughter, Jyn, end up on the rebel's side. When she hints a plan for them to strike the Empire, nobody considers it. But a rogue gang forms where they all does according to her saying. That's the story, and how it all ends are the rest.\r\n\r\nThe story was simple, but the action-adventures were good. Like what a 'Star Wars' fans want to see. The main drawback was there's no familiar faces around. Even the original franchise style of title and credit presentation was off the beat. Though there were cameos. Darth Vade, Princess Leia, R2D2 and 3PO, including a small lightsabre fight at the end, just to satisfy the fanboys. Overall a worthy film, otherwise it would have not earned one billion at the box office, making one of the top 10 of all time.\r\n\r\n_8/10_", "created_at": "2017-11-04T19:40:58.909Z"}, {"movie_id": 330459, "review_id": "5e2f2b801685da0013e9f8be", "author_rating": 7.0, "review_text": "Dark Vader: \"Be careful not to choke on your aspirations, Director.\" \r\n\r\nRogue One follows Jyn Erso (played by Felicity Jones) a Rebellion soldier and criminal, who is about to experience her biggest challenge yet when Mon Mothma sets her out on a mission to steal the plans for the Death Star. With help from the Rebels, a master swordsman, and non-allied forces, Jyn will be in for something bigger than she thinks. \r\n\r\nI had my worries with Rogue One, if I must admit. After the massive success of \"The Force Awakens\", the universe of Star Wars has now expanded even more. There's going to be more sequels, prequels, and spin-offs every year now. Why this worries me is because I fear I'm going to be sick of theses and not really get exited anymore. Star Wars should be treated like a three year event like before, it gives more time for the writers & director to really flesh out the story. It may seem like a long wait, but it'll be worth the wait. But that's not all. The trouble re shoots this went through and the ridiculous short deadlines during post-production. But after seeing the film myself, I can safely say that this new prequel isn't a bad one. \r\n\r\n\"Rogue One: A Star Wars Story\" is a good movie. Not great or amazing, just decent. In my opinion, it's not up there with \"A New Hope\" or \"Empire Strikes Back\". It's more in the middle for me. If I have to be honest, I actually enjoyed \"Force Awakens\" more than this. Yeah, I said it. The movie is flawed, but it dose have a lot to like about it. \r\n\r\nI can't imagine the pressure Gareth Edwards must have felt making this, kinda like what Abrams was feeling. In interviews, Gareth has said he was a Star Wars fan and it was the reason why he wanted to make movies. So this is very dear to him and while there where some slip ups in parts, but I must say that he handed the material really well. Gareth Edward is very good at making things feel huge and the heavy scale of things. The action scenes were directed so brilliantly that it actually felt like a war movie. \r\n\r\nThat's what really surprised me about \"Rogue One\" is how dark and depressing it is. Some people may have a problem with that, since everyone is use to these adventures with are favorite characters. For me, I didn't have an issue with it. Heck, I'm kinda glad it had the balls to go that far and be violent. The humor is very limited, but when there is humor is mostly from K-2SO (played by Alan Tudyk), who was just the best. \r\n\r\nThe CGI in this movie was incredible and quite groundbreaking. I mean, it's TOO GOOD. The way it blended with the real life environment and the action scenes was so good that half of the time I was watching computer effect's on screen. How it was executed was so beautiful and quite the achievement. \r\n\r\nNow the biggest complaint I've been hearing from Star Wars fans is about Peter Cushing Digital Resurrection. Yep, he's back to cinematic life through the use of state-of-the-art visual effects wizardry. He's character Grand Moff Tarkin is in the movie, but instead of re-casting the role or kept his digital face in the shadows, but that's surprisingly not the case. He's in the movie quite a lot as you see him in full form and up close. This is getting a mix response from people and even I was a bit mixed on it. I was a bit weird out by it, as Peter Cushing has been dead for 22 years and seeing up there was hard to digest. But after letting it sink in, I thought it wasn't too noticeable and in a few scene I actually brought into it. I thought it looked real when he wasn't moving around or any close ups to his face. But that's just my thoughts.\r\n\r\nSpeaking of bringing back old characters, Dark Vader makes a appears in this. While he's screen time is very short, but he steals every scene he's in. Eventually the hallway scene, that was so bad-ass and one of my favorite moments in the movie. It's great to see him and James Earl Jones back as one of greatest villains of all time. \r\n\r\nNow for the problems: The first half of \"Rogue One\" was a bit rough for me and I was kinda bored at times. I didn't care or got attracted to the characters. The characterization was lacking and that's a real shame, because Star Wars is all about the characters, as it's the thing we remember from these movies. It's not all about Lightsabers and battles, it's the characters. Felicity Jones, Alan Tudyk & Mads Mikkelsen characters were the only ones that I cared about. The others not so much. \r\n\r\nAnother major part of the Star Wars movies is the score. John Williams score is so iconic that it's hard to top it. It's the heart of the series and I kinda wish he did the score for this, because Michael Giacchino score wasn't that good. But I'll cut Giacchino a little slack, he only had 4 weeks to compose it and it is a tough act to follow. That goes back to what I said about the deadlines being too short. \r\n\r\nOverall rating: \"Rogue One: A Star Wars Story\" is a good entry to the series and it dose feel like a dark Star Wars movie. I may have problems with the movie and I have to be honest with that, but I do think it ties in very well with \"A New Hope\". A plot like this was needed to fill in the 40 year old plot gap.", "created_at": "2020-01-27T18:27:12.263Z"}, {"movie_id": 330459, "review_id": "601b7a57bb1057003e9d95b0", "author_rating": 7.0, "review_text": "A pretty cool prequel to 1977's <em>'Star Wars'</em>. I wouldn't say I overly enjoyed it, but it's worthy for the purpose it serves.\r\n\r\nWhat stopped me from loving <em>'Rogue One: A Star Wars Story'</em> was probably, mostly, the pacing, which I found to be too slow in parts. It never majorly affected my viewing experience, but I could feel it slightly dragging here and there. I also didn't like the cast on anything more than a neutral/standard level.\r\n\r\nFelicity Jones does an admirable job in the lead role, I did like how they set her story up at the beginning. I also found any scene with Mads Mikkelsen good to watch, while Riz Ahmed and Forest Whitaker are solid; Alan Tudyk is OK as well. Diego Luna and Ben Mendelsohn, however, didn't do anything for me.\r\n\r\nThe story itself is satisfactory, the ending to it is more meaningful than I was expecting and features a few nice shots; the whole film looks lovely in fairness. I personally would've shaved 10-20 minutes off the run time and got more devilish antagonists, though.\r\n\r\nStill, it's at the very least a good film no doubt.", "created_at": "2021-02-04T04:38:47.083Z"}, {"movie_id": 330459, "review_id": "602edd3d0443c90041d11e0f", "author_rating": 8.0, "review_text": "One of the better \"side stories\" of the Star Wars universe. Being mid 40'ies :) my first experience with Star Wars was the original movies on the telly, but I have since seen the remastered editions on the big screen as well as the new aditions to the franchise. In that perspective, Rogue One is among my top 5. It can be seen on its own but has good references to the original movies for the devoted fans.", "created_at": "2021-02-18T21:33:49.026Z"}, {"movie_id": 330459, "review_id": "6379bb343d35570078df2341", "author_rating": 9.0, "review_text": "**Rogue One feels familiar within the Star Wars franchise but still bold and new! A great on-ramp for people new to Star Wars and a favorite for Star Wars enthusiasts.**\r\n\r\nRogue One brought back the gritty struggle of the fledgling resistance returning the franchise to the feel and excellence of the original franchise. While the Force and the Jedi's influence could be felt throughout, Rogue One didn't get caught up in lightsaber duels and prophecies, focusing instead on the underground espionage of the Rebellion. Without returning fan favorites safe with plot armor, the stakes were much higher with new characters in jeopardy and danger, and some not surviving. The cast's risk and morally flexible nature made this Star Wars movie focus on the themes of war, unlike the other films. The writing, cinematography, performances, effects, and story were all among the best of the entire franchise. Rogue One is one of the best Star Wars movies and an exceptional spy film!", "created_at": "2022-11-20T05:29:24.870Z"}, {"movie_id": 330459, "review_id": "63c2168d8efe7300f0a34af8", "author_rating": 10.0, "review_text": "So, there seems to be two main points that the real haters are focusing on.\r\n\r\n1) Fanfiction 2) SJW propaganda.\r\n\r\nNow, I do believe these are both reactions to, well, The Force Awakens. The first just being a hatred for Rey, who was a Mary Sue and one that gave the entire movie a fanfiction feel.\r\n\r\nAnd where that is true for The Force Awakens, its not Rogue One, at least it is not Rogue One if we are staying in the Star Wars universe...it COULD be fanfiction if someone warped Saving Private Ryan into the Star Wars universe and...yeah, not, It's not fan fiction.\r\n\r\nThe Second point, the SJW one, well, that could honestly also be a backlash against The Force Awakens as, yeah, anyone that called Rey a Mary Sue was accused of being a misogynist for, well...reasons.\r\n\r\nSpecifically for reasons that had NOTHING to do with why they didn't like Rey--at least why most people didn't like her...most.\r\n\r\nAnd, in Rogue One, if the cast is multi-cultural of ominous political agenda reasons...it doesn't really feel that way. The diversity works and it works because you don't really notice it unless people point it out to complain about it..\r\n\r\n...and the people that do, yeah, it is likely because of The Force Awakens and they are forgetting that this takes place in a Galaxy Far, Far Away and, well, by definition they are all aliens anyway, so, you know, trying to force diversity in a movie entirely comprised of according to Hoyle aliens...wouldn't that mean a LOT more alien looking aliens? So, a lot of that is lingering from The Force Awakens and, well, some of it is understandable, if not for the movie itself than because of the backlash against people that thought Rey was entirely too perfect.\r\n\r\nAnother reason for that hate could be a lack of lightsaber battles and, I really feel the fanboys on this one...but, no, really this was a Star Wars movie that felt like a war movie and the lack of blatant force powers and lightsabers until the very end worked...\r\n\r\nIn fact it worked so well you did kind of get a Saving Private Ryan feel off the movie, a lone rogue squad taking on the entire Nazi?...Sith?...the entire Intergalactic Empire.\r\n\r\nIt was really fun to watch and, not sense the Evacuation at Dunkirk that was the planet Hoth, did we see a Star Wars ground battle that really looked like it was a war. So this was pretty cool.\r\n\r\nAnd then there is Jyn. Now a lot of hate gores to her and I can't figure out why. She seemed like a real character. Rey could have been a feminist SJW transplant that was made super awesome because...reasons. But Jyn had serious flaws, she had issues, she seemed like a real person. So props to Felicity Jones for bringing that awesomeness to life.\r\n\r\nNo, seriously, props to her. Outside of Solo, I really don't think I've seen a Star Wars character I thought was that, well, cool, real, just fun in the way that you could point to her and say \"I could know someone like that.\" There were other cool characters in the saga...but none as realistically portrayed. And that doesn't just go for Jones.\r\n\r\nThe only main character that doesn't seem like a real person was Chirrut Îmwe and, well, we can forgive him for that because he was the kung-fu movie awesome that helped make the movie not just a war movie in space. He was the guy that brought the Force into the film and made it a Star Wars flick...so, who really cares if he doesn't feel like a real person? I know I don't.\r\n\r\nAnd the last bit of hate is because, well, it doesn't have any of the real main characters, no Solo, no Skywalker and...well...it IS a stand alone movie, so if you came in expecting them, well, that is your fault. Disney made it clear from the get-go.\r\n\r\nWhat you have here is a cool science fiction war movie. It fits into the saga and it doesn't, but that isn't a bad thing--prequels, the Force Awakens--as only 3/7th of the saga movies are really any good.\r\n\r\nAnd, as a war movie, it stands on its own. It is actually better than a LOT of the war movies people tout as masterpieces **cough** **Thin Red Line** **cough** So, watch it, you should have no complaints...\r\n\r\n...unless you are complaining about the SJW, the Fanfiction, and the lack of Skywalker or Solo, and if you are, well, there is going to be no pleasing you no matter what you watch.", "created_at": "2023-01-14T02:42:21.788Z"}, {"movie_id": 330459, "review_id": "58547871c3a3683150031bca", "author_rating": null, "review_text": "\"It carries the burden of being about odds and stakes, of legacies and consequences, of understanding destiny...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/12/17/rogue-one-a-star-wars-story.html", "created_at": "2016-12-16T23:27:45.243Z"}, {"movie_id": 330459, "review_id": "5897f3459251417a82003b4e", "author_rating": 7.0, "review_text": "Is not my new favourite _Star Wars_ movie. But does contain my new favourite _Star Wars_ scene.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-02-06T03:53:41.055Z"}, {"movie_id": 330459, "review_id": "58a720ecc3a368672e00abda", "author_rating": 10.0, "review_text": "Fun Star Wars movie. Plenty of homages and nods to the original trilogy throughout the film, Andy plenty of cameos as well. Has amazing action sequences and enough thrills to keep any true Star Wars fan hooked right from the beginning. No opening crawl at the start for a change and a great score by Michael Giachinno, but still includes the original end credits with John Williams' original music. K-2SO is a show stealer and is very funny as a character. Overall the best Star Wars film since Empire Strikes Back in my opinion. The force is with this one.", "created_at": "2017-02-17T16:12:28.821Z"}, {"movie_id": 330459, "review_id": "59133d2dc3a36864fc056b2c", "author_rating": 5.0, "review_text": "On the surface, this is a well-made action movie set within the Star Wars universe filled with nods and homages to \"A New Hope\" that will make you tingle with warm nostalgia. The reappearance of sets, costumes and characters from our favorite childhood movies might make you say \"Now, THIS is a Star Wars movie!\"\r\n\r\nHowever, nostalgia and making copious amounts of money on that nostalgia seemed to be Disney's primary strategy with this movie. It's mimicry, plain and simple. The CGI recreations of Peter Cushing and Carrie Fisher felt very dirty and a flagrant disrespect to the departed actors, not to mention jarring, for a first time viewer. The digital appearance of Grand Moff Tarkin disengaged me from the frail story and made me settle my stomach with a handful of antacid tablets. \r\n\r\nThe story, writing, characterization is on-par with what you'd expect from modern cinema and the movie serves it's primary purpose of being entertaining. But, as a long-time Star Wars fan, I just couldn't help but feeling pandered to while watching this movie.", "created_at": "2017-05-10T16:17:49.785Z"}, {"movie_id": 330459, "review_id": "592d3f1dc3a3680f7700cc8c", "author_rating": 10.0, "review_text": "Oups! I just realized that, for some reason, this movie had fallen between the cracks. It was quite some time since I watched it but I seem to have forgotten to write a post about it.\r\n\r\nFor me this was one of the best of the new (after the original trilogy) Star Wars movies. It was fun, entertaining with plenty of good, old-fashioned Star Wars action. I generally do not like prequels but this time I felt it was nice to get a bit of the background to the statement that “a number of spies died to get this information” in episode IV. We were even provided with a bit of an explanation as to why the Death Star had this silly weakness in the first place.\r\n\r\nThe actors were doing a decent enough job of it. The chatty android was fun without being totally silly. It was a nice roller coaster ride of action, improvisations, and gung ho ludicrous stunts inside and outside of various forms of transportation means.\r\n\r\nAs usual with Star Wars the science part of science fiction is somewhat lacking. What looks cool is what is put on the screen and screw science. When reading books I am more sensitive to such things but for a Star Wars movie it works well enough.\r\n\r\nSome people seem to be dissecting the characters and dialogue, trying to put logic into it as well as wanting to have more emotions and “character development”. Come on! It is a Star Wars movie. It is supposed to be all action and visually stunning.\r\n\r\nOn that this movie delivers. Sure the plot is not really the most developed one and has plenty of faults. The movie is till a hugely fun Star Wars based science romp though.", "created_at": "2017-05-30T09:45:01.722Z"}, {"movie_id": 330459, "review_id": "59fe17cac3a36868a701f618", "author_rating": 8.0, "review_text": "**The episode III½.**\r\n\r\nSo this is like a bridge between the original trilogy and the next three prequels. A story where the main characters from the original tale are not involved. Being a big fan of this franchise, I loved it. I did not expect big, so got entertained well. But pity that this wonderful characters are not going to return. This is just a one-off film. For seeing its overwhelming success, there could be a prequel, which has a very very slim chance.\r\n\r\nThe story was like that had started in a half way. That's why I wanted a prequel to tell us the Galen Erso's point of view story. When he has been taken back to the base to work for the Empire, his daughter is the only one who escapes from there. After a few years later the grown- up daughter, Jyn, end up on the rebel's side. When she hints a plan for them to strike the Empire, nobody considers it. But a rogue gang forms where they all does according to her saying. That's the story, and how it all ends are the rest.\r\n\r\nThe story was simple, but the action-adventures were good. Like what a 'Star Wars' fans want to see. The main drawback was there's no familiar faces around. Even the original franchise style of title and credit presentation was off the beat. Though there were cameos. Darth Vade, Princess Leia, R2D2 and 3PO, including a small lightsabre fight at the end, just to satisfy the fanboys. Overall a worthy film, otherwise it would have not earned one billion at the box office, making one of the top 10 of all time.\r\n\r\n_8/10_", "created_at": "2017-11-04T19:40:58.909Z"}, {"movie_id": 330459, "review_id": "5e2f2b801685da0013e9f8be", "author_rating": 7.0, "review_text": "Dark Vader: \"Be careful not to choke on your aspirations, Director.\" \r\n\r\nRogue One follows Jyn Erso (played by Felicity Jones) a Rebellion soldier and criminal, who is about to experience her biggest challenge yet when Mon Mothma sets her out on a mission to steal the plans for the Death Star. With help from the Rebels, a master swordsman, and non-allied forces, Jyn will be in for something bigger than she thinks. \r\n\r\nI had my worries with Rogue One, if I must admit. After the massive success of \"The Force Awakens\", the universe of Star Wars has now expanded even more. There's going to be more sequels, prequels, and spin-offs every year now. Why this worries me is because I fear I'm going to be sick of theses and not really get exited anymore. Star Wars should be treated like a three year event like before, it gives more time for the writers & director to really flesh out the story. It may seem like a long wait, but it'll be worth the wait. But that's not all. The trouble re shoots this went through and the ridiculous short deadlines during post-production. But after seeing the film myself, I can safely say that this new prequel isn't a bad one. \r\n\r\n\"Rogue One: A Star Wars Story\" is a good movie. Not great or amazing, just decent. In my opinion, it's not up there with \"A New Hope\" or \"Empire Strikes Back\". It's more in the middle for me. If I have to be honest, I actually enjoyed \"Force Awakens\" more than this. Yeah, I said it. The movie is flawed, but it dose have a lot to like about it. \r\n\r\nI can't imagine the pressure Gareth Edwards must have felt making this, kinda like what Abrams was feeling. In interviews, Gareth has said he was a Star Wars fan and it was the reason why he wanted to make movies. So this is very dear to him and while there where some slip ups in parts, but I must say that he handed the material really well. Gareth Edward is very good at making things feel huge and the heavy scale of things. The action scenes were directed so brilliantly that it actually felt like a war movie. \r\n\r\nThat's what really surprised me about \"Rogue One\" is how dark and depressing it is. Some people may have a problem with that, since everyone is use to these adventures with are favorite characters. For me, I didn't have an issue with it. Heck, I'm kinda glad it had the balls to go that far and be violent. The humor is very limited, but when there is humor is mostly from K-2SO (played by Alan Tudyk), who was just the best. \r\n\r\nThe CGI in this movie was incredible and quite groundbreaking. I mean, it's TOO GOOD. The way it blended with the real life environment and the action scenes was so good that half of the time I was watching computer effect's on screen. How it was executed was so beautiful and quite the achievement. \r\n\r\nNow the biggest complaint I've been hearing from Star Wars fans is about Peter Cushing Digital Resurrection. Yep, he's back to cinematic life through the use of state-of-the-art visual effects wizardry. He's character Grand Moff Tarkin is in the movie, but instead of re-casting the role or kept his digital face in the shadows, but that's surprisingly not the case. He's in the movie quite a lot as you see him in full form and up close. This is getting a mix response from people and even I was a bit mixed on it. I was a bit weird out by it, as Peter Cushing has been dead for 22 years and seeing up there was hard to digest. But after letting it sink in, I thought it wasn't too noticeable and in a few scene I actually brought into it. I thought it looked real when he wasn't moving around or any close ups to his face. But that's just my thoughts.\r\n\r\nSpeaking of bringing back old characters, Dark Vader makes a appears in this. While he's screen time is very short, but he steals every scene he's in. Eventually the hallway scene, that was so bad-ass and one of my favorite moments in the movie. It's great to see him and James Earl Jones back as one of greatest villains of all time. \r\n\r\nNow for the problems: The first half of \"Rogue One\" was a bit rough for me and I was kinda bored at times. I didn't care or got attracted to the characters. The characterization was lacking and that's a real shame, because Star Wars is all about the characters, as it's the thing we remember from these movies. It's not all about Lightsabers and battles, it's the characters. Felicity Jones, Alan Tudyk & Mads Mikkelsen characters were the only ones that I cared about. The others not so much. \r\n\r\nAnother major part of the Star Wars movies is the score. John Williams score is so iconic that it's hard to top it. It's the heart of the series and I kinda wish he did the score for this, because Michael Giacchino score wasn't that good. But I'll cut Giacchino a little slack, he only had 4 weeks to compose it and it is a tough act to follow. That goes back to what I said about the deadlines being too short. \r\n\r\nOverall rating: \"Rogue One: A Star Wars Story\" is a good entry to the series and it dose feel like a dark Star Wars movie. I may have problems with the movie and I have to be honest with that, but I do think it ties in very well with \"A New Hope\". A plot like this was needed to fill in the 40 year old plot gap.", "created_at": "2020-01-27T18:27:12.263Z"}, {"movie_id": 330459, "review_id": "601b7a57bb1057003e9d95b0", "author_rating": 7.0, "review_text": "A pretty cool prequel to 1977's <em>'Star Wars'</em>. I wouldn't say I overly enjoyed it, but it's worthy for the purpose it serves.\r\n\r\nWhat stopped me from loving <em>'Rogue One: A Star Wars Story'</em> was probably, mostly, the pacing, which I found to be too slow in parts. It never majorly affected my viewing experience, but I could feel it slightly dragging here and there. I also didn't like the cast on anything more than a neutral/standard level.\r\n\r\nFelicity Jones does an admirable job in the lead role, I did like how they set her story up at the beginning. I also found any scene with Mads Mikkelsen good to watch, while Riz Ahmed and Forest Whitaker are solid; Alan Tudyk is OK as well. Diego Luna and Ben Mendelsohn, however, didn't do anything for me.\r\n\r\nThe story itself is satisfactory, the ending to it is more meaningful than I was expecting and features a few nice shots; the whole film looks lovely in fairness. I personally would've shaved 10-20 minutes off the run time and got more devilish antagonists, though.\r\n\r\nStill, it's at the very least a good film no doubt.", "created_at": "2021-02-04T04:38:47.083Z"}, {"movie_id": 330459, "review_id": "602edd3d0443c90041d11e0f", "author_rating": 8.0, "review_text": "One of the better \"side stories\" of the Star Wars universe. Being mid 40'ies :) my first experience with Star Wars was the original movies on the telly, but I have since seen the remastered editions on the big screen as well as the new aditions to the franchise. In that perspective, Rogue One is among my top 5. It can be seen on its own but has good references to the original movies for the devoted fans.", "created_at": "2021-02-18T21:33:49.026Z"}, {"movie_id": 330459, "review_id": "6379bb343d35570078df2341", "author_rating": 9.0, "review_text": "**Rogue One feels familiar within the Star Wars franchise but still bold and new! A great on-ramp for people new to Star Wars and a favorite for Star Wars enthusiasts.**\r\n\r\nRogue One brought back the gritty struggle of the fledgling resistance returning the franchise to the feel and excellence of the original franchise. While the Force and the Jedi's influence could be felt throughout, Rogue One didn't get caught up in lightsaber duels and prophecies, focusing instead on the underground espionage of the Rebellion. Without returning fan favorites safe with plot armor, the stakes were much higher with new characters in jeopardy and danger, and some not surviving. The cast's risk and morally flexible nature made this Star Wars movie focus on the themes of war, unlike the other films. The writing, cinematography, performances, effects, and story were all among the best of the entire franchise. Rogue One is one of the best Star Wars movies and an exceptional spy film!", "created_at": "2022-11-20T05:29:24.870Z"}, {"movie_id": 330459, "review_id": "63c2168d8efe7300f0a34af8", "author_rating": 10.0, "review_text": "So, there seems to be two main points that the real haters are focusing on.\r\n\r\n1) Fanfiction 2) SJW propaganda.\r\n\r\nNow, I do believe these are both reactions to, well, The Force Awakens. The first just being a hatred for Rey, who was a Mary Sue and one that gave the entire movie a fanfiction feel.\r\n\r\nAnd where that is true for The Force Awakens, its not Rogue One, at least it is not Rogue One if we are staying in the Star Wars universe...it COULD be fanfiction if someone warped Saving Private Ryan into the Star Wars universe and...yeah, not, It's not fan fiction.\r\n\r\nThe Second point, the SJW one, well, that could honestly also be a backlash against The Force Awakens as, yeah, anyone that called Rey a Mary Sue was accused of being a misogynist for, well...reasons.\r\n\r\nSpecifically for reasons that had NOTHING to do with why they didn't like Rey--at least why most people didn't like her...most.\r\n\r\nAnd, in Rogue One, if the cast is multi-cultural of ominous political agenda reasons...it doesn't really feel that way. The diversity works and it works because you don't really notice it unless people point it out to complain about it..\r\n\r\n...and the people that do, yeah, it is likely because of The Force Awakens and they are forgetting that this takes place in a Galaxy Far, Far Away and, well, by definition they are all aliens anyway, so, you know, trying to force diversity in a movie entirely comprised of according to Hoyle aliens...wouldn't that mean a LOT more alien looking aliens? So, a lot of that is lingering from The Force Awakens and, well, some of it is understandable, if not for the movie itself than because of the backlash against people that thought Rey was entirely too perfect.\r\n\r\nAnother reason for that hate could be a lack of lightsaber battles and, I really feel the fanboys on this one...but, no, really this was a Star Wars movie that felt like a war movie and the lack of blatant force powers and lightsabers until the very end worked...\r\n\r\nIn fact it worked so well you did kind of get a Saving Private Ryan feel off the movie, a lone rogue squad taking on the entire Nazi?...Sith?...the entire Intergalactic Empire.\r\n\r\nIt was really fun to watch and, not sense the Evacuation at Dunkirk that was the planet Hoth, did we see a Star Wars ground battle that really looked like it was a war. So this was pretty cool.\r\n\r\nAnd then there is Jyn. Now a lot of hate gores to her and I can't figure out why. She seemed like a real character. Rey could have been a feminist SJW transplant that was made super awesome because...reasons. But Jyn had serious flaws, she had issues, she seemed like a real person. So props to Felicity Jones for bringing that awesomeness to life.\r\n\r\nNo, seriously, props to her. Outside of Solo, I really don't think I've seen a Star Wars character I thought was that, well, cool, real, just fun in the way that you could point to her and say \"I could know someone like that.\" There were other cool characters in the saga...but none as realistically portrayed. And that doesn't just go for Jones.\r\n\r\nThe only main character that doesn't seem like a real person was Chirrut Îmwe and, well, we can forgive him for that because he was the kung-fu movie awesome that helped make the movie not just a war movie in space. He was the guy that brought the Force into the film and made it a Star Wars flick...so, who really cares if he doesn't feel like a real person? I know I don't.\r\n\r\nAnd the last bit of hate is because, well, it doesn't have any of the real main characters, no Solo, no Skywalker and...well...it IS a stand alone movie, so if you came in expecting them, well, that is your fault. Disney made it clear from the get-go.\r\n\r\nWhat you have here is a cool science fiction war movie. It fits into the saga and it doesn't, but that isn't a bad thing--prequels, the Force Awakens--as only 3/7th of the saga movies are really any good.\r\n\r\nAnd, as a war movie, it stands on its own. It is actually better than a LOT of the war movies people tout as masterpieces **cough** **Thin Red Line** **cough** So, watch it, you should have no complaints...\r\n\r\n...unless you are complaining about the SJW, the Fanfiction, and the lack of Skywalker or Solo, and if you are, well, there is going to be no pleasing you no matter what you watch.", "created_at": "2023-01-14T02:42:21.788Z"}]