[{"movie_id": 301875, "review_id": "5f23827e5b2f47003858f23b", "author_rating": 6.0, "review_text": "Decent watch, probably won't watch again, and can't recommend.\r\n\r\nDon't get me wrong, I like the movie, but it is HIGH concept, low execution, despite being a beautifully produced and shot flick.\r\n\r\nNicholas Hoult and Kristen Stewart carry the movie, and for those haters Stewart is playing a girl that is not supposed to show emotions so there, but there are some solid actors in support roles as well: Guy Pearce (Memento), Bel Powley (Carrie Pilby), and David Selby (who I thought was Alan Alda from MASH: This was like a Mandela effect: I had his voice in my head.)\r\n\r\nThere just isn't a lot that is actively interesting to watch a movie where everyone is a robot without emotion, but it is a cool concept, especially when it becomes a survival concept.  People who can't manage their emotions as if they don't have them get sent to a place where they're basically electro-shocked into committing suicide if they hadn't beforehand.\r\n\r\nThe tension of it definitely ramps up a bit, but the focus eventually becomes more on the romantic connection than survival, even during a part primarily focused on surviving.\r\n\r\nThe last couple of scenes are really subtle too, I actually had to re-watch them to just to make sure I knew how it ended.\r\n\r\nSo while I like it and there is definitely something to like here, I think less people than more are going to be into it.", "created_at": "2020-07-31T02:31:26.187Z"}, {"movie_id": 301875, "review_id": "624ab58b8eda8700625a588b", "author_rating": 5.0, "review_text": "Maybe this looked better on paper, but on a big screen it is a sterile and really rather plodding story. Nicholas Hoult - who takes an annoyingly unrevealing series of hot showers - lives a routine life as a glorified android, his daily grind in his pristine environment; his clothes, food, sleep all exactly the same from day to day. He encounters \"Nia\" (Kristen Stewart) and over a relatively short period of time (felt longer) the two begin to have a few tingles for each other. Turns out that this is all as a result of some existential event, and mankind is rationing and controlling just about everything that is left - and that includes sex. Can these two break free of their delicate, invisible, chains? Well, what do you think? The thing I can say, is that everything they do is done at a glacial pace. The soporific score adds very little excitement to this really pretty pedestrian affair. Even the one scene of mad \"passion\" is more a testament to the skill of the cameraman at keeping it rated U, than at relating anything like the desire the two are supposed to feel for each other. The production standards are high, but the dialogue is pretty sparing - their environment renders their conversation about as interesting as their sex lives, and I am afraid that I was just a bit bored by the whole thing.", "created_at": "2022-04-04T09:08:27.941Z"}]