[{"movie_id": 22972, "review_id": "5dd4a1b1e267de00169c2663", "author_rating": null, "review_text": "Its about the false allegation of US that Iraq had WMD. Which turns out to be a manipulated intel for personal gains of few people.", "created_at": "2019-11-20T02:15:13.433Z"}, {"movie_id": 22972, "review_id": "5dd4c85a3faba00019f3db03", "author_rating": null, "review_text": "Good Action Movie.", "created_at": "2019-11-20T05:00:10.100Z"}, {"movie_id": 22972, "review_id": "6298d4edd71fb416ca295a08", "author_rating": 5.0, "review_text": "Whilst I didn't hate this film, I really did wonder who on earth it was for? Is it just one of those retrospective conscience-salving efforts designed to deflect the attention of the audience as to just who told us all what ahead of the invasion or Iraq? In any case, the plot seems to suggest that that whole invasion was predicated on an elaborate American scheme to install a puppet administrations in that country. Based on what, precisely? Well - that's what \"Miller\" (Matt Damon) and his team of elite WMD hunters are on site to discover. What now follows is a rather pedestrian affair with loads of CIA cloak and dagger drama as the team constantly come up empty in their search. Is there a leak somewhere? Did the things just simply never exist? Is their a broader game afoot? Well those are the questions about which I couldn't say I was really very bothered. To make these intrigues work effectively, the writing and the acting have to be far sharper and nuanced than here in this rather simplistic take on not just the Allied (i.e. not just US involvement in Iraq) activities, but on the attitudes of the local population who are portrayed here as either little better than sheep farmers, or as duplicitous murderers. Damon is going through the motions, as is a slightly oddly cast Jason Isaacs (\"Briggs\") and a completely underwhelming Greg Kinnear as \"Poundstone\" - the Pentagon man charged with leading the search. Add to the mix the faintly annoying interventions of investigative journalist \"Lawrie Dayne\" (Amy Ryan) and the whole thing is, frankly, a derivate mess. At times the pace is active, but for the most part is just plods along towards an ending that is probably all that this speculative and weak script could hope to offer us.", "created_at": "2022-06-02T15:19:09.570Z"}]