[{"movie_id": 13809, "review_id": "53585721c3a3685609008308", "author_rating": 5.0, "review_text": "Ritchie repeats again the same template and this is not one of his best shots.", "created_at": "2014-04-24T00:13:21.745Z"}, {"movie_id": 13809, "review_id": "549c1fbc925141311f003994", "author_rating": 5.0, "review_text": "Someone is trying to make easy money, but gets screwed. However, there is always a bigger fish in the pond looking to eat the smaller fish. In this movie, lowly criminals meets councillors, junkies, dead musicians, dirty accountants, nasty crime bosses and filthy rich russians. Sounds like another movie by Guy Ritchie, more or less, and it does indeed follow the same rhythm (and theme) as Lock, Stock and Two Smoking Barrels.\r\n\r\nThe movie opens with the narrator, Archy, who breaks down the plot for us in tiny, easy-to-digest bits, and thats definitely my least favorite bit in the movie, but sadly, needed. This plot is a twisted labyrinth, that constantly shifts from one person to the next. There are no real heroes here, just fish eaten by sharks, hunted by humans, killed by... you get the point.\r\n\r\nRocknRolla has a huge cast, and some big names too. In smaller roles, you'll see names such as Tom Hardy (Handsome Bob), Jeremy Piven (Roman), Thandie Newton (Stella) and Idris Elba (Mumbles), and in the bigger, you find names like Gerard Butler (One Two), Mark Strong (Archy) and Tom Wilkinson (Lenny Cole). Most of them delivers quirky and fun characters, and some of them even gives us a bit to think about, like Tom Hardy's role, Handsome Bob, who is coming to terms with being gay.\r\n\r\nThe movie is fast-paced to begin with, but slows down a bit later on. It has the obligatory violent Guy Ritchie scenes that reminds us of the early movies of Quentin Tarantino, but in the end, it is all a bit hollow. This is a movie about greed, about screwing over those with money, or even, those without.\r\n\r\n_Last words... looking for a bit of solid entertainment, a good plot (not too easy to get your head around, but not too hard to loose you either) and some nice solid actors (and actresses), this is definitely the movie you are looking for._", "created_at": "2014-12-25T14:31:24.964Z"}, {"movie_id": 13809, "review_id": "62404a1397a4e6005bd289f9", "author_rating": 7.0, "review_text": "I really enjoyed this. A great ensemble cast delivering a gangster thriller that pokes it's tongue out at just about everything/body whilst still retaining enough menace to keep it engaging. As ever with Ritchie films, it does run a bit to dialogue - and this one has an, at times, irritating narrative. Tom Wilkinson (\"Lenny\") is quite good as the mob boss who facilitates - and takes a cut from - most big property transactions in London; and he makes a good living from it. A Russian oligarch arrives on the scene and engages Lenny, and his slimy but ruthless sidekick \"Archy\" (Mark Strong) to help his with a fairly mammoth development. At this stage it all starts to go a bit pear shaped and we slowly become aware that there is much more afoot. There are several fun subplots with Gerard Butler, Idris Elba, Tom Hardy and Thandie Newton all having some skin in at least part of the game; and Toby Kebbell is cracking as his dead-loss, rockstar, coke-head son \"Johnny Quid\". The writing is taut and humorous, and the violence much more \"fantasy\" and implied - even kinky, on occasion, than gory. The whole thing is a thoroughly entertaining piece of cinema - complete with killer lobsters and the smallest of cameos from Hugh Grant!", "created_at": "2022-03-27T11:27:15.344Z"}]