[{"movie_id": 490132, "review_id": "5c43ff6ec3a36819fd23c24d", "author_rating": 6.0, "review_text": "Sadly, didn't end racism, but still very cute.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T04:56:14.531Z"}, {"movie_id": 490132, "review_id": "5c49ff1cc3a36847778b6ca2", "author_rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nLiving in Portugal has a ton of pros, but regarding movies, it lacks serious advantages. The price of admission is expensive, there is only one film theater in my city (every time I want to watch a movie on IMAX or Dolby Atmos, it's a financial effort and time-consuming) and the worst of all, a whole bunch of films aren't released in their original date, especially November/December Oscar-bait movies. Only now I had the opportunity to see Green Book, and I am so mad I wasn't able to write its review in 2018 because this is undoubtedly the best comedy-drama of last year and one of the best overall!\r\n\r\nWith the help of a terrific cast, Peter Farrelly and his writing crew (which counts with Vallelonga's son, Nick) deliver what I think is the best screenplay of 2018. I can't remember the last time I cried of so much laughter in a film. I can't remember the last time I did the latter and still got emotional with the dramatic arc. This comedy-drama sent me through a roller coaster of emotions I wasn't expecting, at all. I went in anticipating outstanding performances (check) and solely that. Since 2019 has already begun, I'm watching the Oscar-bait movies with no real hopes of being utterly amazed.\r\n\r\nHowever, Green Book completely took me by surprise. I genuinely don't know why everyone was so shocked when it won Best Screenplay at the Golden Globe Awards. It possesses such a well-written story, filled with brilliant narratives about the most sensitive subjects. It takes the two main characters and elevates their individual arcs into subplots where you begin and end with two completely different personas. It's an extremely relevant film that shows how our world evolved and fought back racism and discrimination, without ever becoming too dark or even dull. It's not more of the same, it's not another movie produced exclusively to send a social message and catch some Oscar nominations. It's a truly captivating story of how two men can change their perspective of another race or even the entire world, by actually spending time with another culture and ignoring preconceived notions.\r\n\r\nNevertheless, this well-structured, beautifully-directed and cleverly-written film would be just \"good\" if not for the two incredible actors, who take this movie to a whole other level. Viggo Mortensen and Mahershala Ali have such compelling chemistry that I wouldn't mind watching them interact for two hours on a car trip. Every single car sequence either produces hilarious moments, filled with tearful laughter, or it drastically changes into a more dramatic and emotional tone, subtly touching delicate topics. I knew Mortensen had a humorous side to him, but I never saw this coming! His timing, his expressions, his Italian accent, his body movements, everything about his performance is perfect. He absolutely nailed his part, by giving me the best time I had at a film theater in a long time, and his Oscar nomination is more than fair. He made a 130-min feature movie feel like a short flick.\r\n\r\nAli doesn't come far behind. Obviously, since Viggo has a funnier role to portray, the audience members might feel that he's just there to help his co-star shine, but he does much more than that. Since he brings the drama element to the story, he has a more restrained performance during the first half of the film. However, once Shirley starts getting along with Tony Lip, Ali gradually offers more and more splendid acting moments. He's definitely a supporting actor, but God is he a phenomenal one! Linda Cardellini (Dolores Vallelonga), even though she's only on-screen for a few minutes spread throughout the runtime, also delivers a great performance.\r\n\r\nTony Lip and Dr. Don Shirley have quite distinct personalities, besides being from different races. Each character's arc is brilliantly illustrated by Peter Farrelly, who gradually shows how Tony and Don are changing their view of the world and of each other's culture. Either through the witty car sequences or through unfortunate and horrible experiences, these two characters carry the audience on a journey of growth. Change in behavior, mindset and preconceived ideas, by sharing their own culture with another. Even though they were born in different countries and lived through distinguished lifestyles, with contrasting quality of life, they eventually start realizing that what they think of the world and everything else might not be entirely right.\r\n\r\nTechnically, Farrelly controls the movie's pacing exceptionally well, by making a two-hour-ish film feel like half of it. Remarkably-balanced tone and some great cinematography is showed in a couple of scenes. Consistently-filmed and well-edited, even though the latter has small hiccups here and there. Nevertheless, this isn't a film with extraordinary technical attributes, nor it needs them. Farrelly only needed to do \"ok\" with the producing and filming of a standout screenplay to achieve a fantastic result, and that's exactly what he did.\r\n\r\nFinally, regarding the controversy surrounding this movie ... See how easy it is to watch a film without being affected by outside matters which don't have a single thing to do with the movie itself? I don't care if someone who worked in the film tweeted something wrong today, let alone years ago. I don't care if someone misinterprets Viggo Mortensen's speech about racism. I don't care if the family of Don Shirley doesn't like how the movie approaches his way of being or his way of life. I don't care if the story isn't 100% true, as long as it succeeds in transmitting the vital message it wants to deliver, while actually being a good film. So, please, stop trying to listen to everything everyone says about a movie or the people working on it, especially nowadays, where chaos is easy to create.\r\n\r\nGreen Book surprised the hell out of me and left me speechless in the end. One of the best comedy-dramas I've seen in a long time, one of the best films of 2017 and, by far, the best original screenplay of the last year. Peter Farrelly and his fellow co-writers delivered a seamlessly-written story, filled with wonderful character arcs and with a quite important message to the audiences around the world. Viggo Mortensen and Mahershala Ali deliver award-worthy performances, especially the former who shows his incredible comedic timing and dramatic range. Still, the most compelling and emotional scenes come from Ali, and he does not deserve to be forgotten. I thought 2018 was going to be the first year without me giving an A+, but guess what ...\r\n\r\nRating: A+", "created_at": "2019-01-24T18:08:28.265Z"}, {"movie_id": 490132, "review_id": "5e4a08fa1e92250015c349aa", "author_rating": 9.0, "review_text": "\"Frequently, when someone tries to portray the overwhelming decade of the 1960s, they usually misuse the concept of discrimination towards African Americans, which is accurate to describe this social issue. Nevertheless, the way Peter Farrelly and staff go into detail about this social wretchedness embodying the psychological impact it has in the main character makes the film an outstanding one\".\r\n\r\nThe year is 1962, and the film begins inside Copacabana restaurant where we get introduced the imposing personality of Tony Lip, an Italian descendant whose family came from a lower middle class coping with some financial difficulties. The way Viggo Mortensen performs the character is a proper model of then American racism; therefore he attempted to keep them out until the occasion arrived and Don Shirley appeared in his path, offering him a two-month lifetime opportunity. We all need to bear in mind the precise dates because, in real life, it was nearly a year they spent together. Despite his gifted pianist skills and his upper-class status, he was still a victim of the convulsed cultural impact. Both of them, during the film, learn from each other and fight against the unsettling behaviour of determined people. \r\n\r\nAlthough it may seem simple, their interaction is one of the primary reasons why it succeeds. Believe it or not, it arouses curiosity, reaches the climax when they finally let them know as they are, and sometimes it results as a plot twister due to the radical temperament change of each actor. It has been ages since I watched such a pleasant film; afterwards, I felt refreshed as though it renewed me.\r\n\r\nThe contextualisation was imperative to build up each one's personality; moreover, it was visually dazzling owing to the costumes, the space and the background advertisement of the decade. Comedy is present as well so that you won't be missing from genuine laughs. Everything appears to be perfectly balanced, even the role of secondary personages such as Tony's wife and the cheeky cards experience. I'm chuffed to bits!\r\n\r\nOn the whole, the film \"Green Book\" is an exceptional example of the conception of a masterpiece without spending loads of money in production and without creating plenty of trifling scenarios.\r\n\r\n\r\n[85/100]", "created_at": "2020-02-17T03:31:06.453Z"}, {"movie_id": 490132, "review_id": "5e800ad376484100133c9d6d", "author_rating": 9.0, "review_text": "***A white streetwise bouncer and an articulate black pianist tour the Deep South in 1962***\r\n\r\nA tough, working class Italian New Yawker (Viggo Mortensen) is forced to take a gig driving a refined African-American concert pianist (Mahershala Ali) through the Midwest and Deep South in 1962. Linda Cardellini plays the wife of the Italian.             \r\n\r\n“Green Book” (2018) was inspired by the real-life story and written by the son of Tony Lip (Mortensen). Like all great dramas, it’s compelling from the get-go and the road movie approach provides an entertaining and revelatory string of episodes, not to mention occasionally amusing. While the movie’s been accused of reverse racism, it’s actually balanced, showing plenty of poor, inarticulate blacks and vice versa. The message is to base your perceptions on the individual rather than ignorant generalizations.\r\n\r\nThe film runs 2 hours, 10 minutes, and was shot in New York City and Louisiana.\r\n\r\nGRADE: A", "created_at": "2020-03-29T02:41:23.492Z"}, {"movie_id": 490132, "review_id": "612b00d5e04aca0043e2a4a1", "author_rating": null, "review_text": "This movie has a weak understanding of not only the truth in the relationship between the two characters based on actual people, but simplifies the subject of race relations. It was a terrible choice for best picture.", "created_at": "2021-08-29T03:36:53.105Z"}, {"movie_id": 490132, "review_id": "61e323cb544c410042696551", "author_rating": 8.0, "review_text": "After a superb opening scene we get a heartwarming feel-good film that plays it a little too safe, but the chemistry between the two leads and some humor make ‘Green Book’ funny and highly enjoyable.\r\n\r\n8/10", "created_at": "2022-01-15T19:43:07.027Z"}, {"movie_id": 490132, "review_id": "63bf5afae16e5a00d402910c", "author_rating": 1.0, "review_text": "I guess that this made it to the Academy Awards for saying something that has been said a thousand times before. But because it was made in 2018 and everyone below 30 and everyone in Hollywood pretends that cinema didn't exist until 2016 it had high praise.\r\n\r\nThe acting is not bad, but for a movie set in the South, it could have used to actually show some of the beauty of the region they were driving through. Independent films have done a better job than this.\r\n\r\nBut, because of the message, because of the statement we have heard a thousand times before, I guess you are supposed to love this and treat it like it's new.\r\n\r\nIt's not, the 70s and 80s had a lot of movies like this and they carried over into the 90s.", "created_at": "2023-01-12T00:57:30.476Z"}]