[{"movie_id": 9889, "review_id": "5464c053c3a36804ce001da1", "author_rating": 7.0, "review_text": "Shallow Hal wants a gal.\r\n\r\nHal Larsen (Jack Black) only ever dates beautiful trophy women on account of advice he received on his death bed from his father. However, a chance meeting with a self-help guru helps him to see inner beauty first and foremost. Soon after, he falls in love with his boss' severely overweight daughter, which as it raises eyebrows everywhere the couple go, Hal is oblivious as to what everyone else is on about.\r\n\r\nTender, sweet and subtle are not words one readily attributes to the Farrelly Brothers, but in Shallow Hal they have managed to blend all three with their penchant for close to the knuckle humour.\r\n\r\nGwyneth Paltrow in the dual role dons the fat-suit and once again showcases her unheralded comic timing, while Jack Black proves ebullient and engaging in a role that calls for him to shut out what he is actually meant to be seeing. In support Jason Alexander gets the weasel best friend comedy sidekick role, and is wonderfully abhorrent and good at keeping the cards close to his chest.\r\n\r\nIt's never uproariously funny, but it doesn't need to be, it tickles where it needs to, and it prods the emotional psyche with requisite impact. In a world that has become obsessed with the girth and weight of a person, especially with women - and as it happens is led by Hollywood, Shallow Hal is refreshing entertainment. 7/10", "created_at": "2014-11-13T14:29:39.496Z"}, {"movie_id": 9889, "review_id": "5c27a152c3a3683a62d271b6", "author_rating": 7.0, "review_text": "***Fun romcom with a worthy message***\r\n\r\nA shallow man (Jack Black) from Charlotte, North Carolina, falls in love with a 300 lb. woman (Gwyneth Paltrow) after Tony Robbins enables him to see inner merit. Jason Alexander is on hand as his best friend.\r\n\r\n“Shallow Hal” (2001) is a romcom that’s both amusing and meaningful. The movie stresses the importance of inward beauty, which Hal was incapable of seeing because of his focus on solely physical attractiveness. When the latter is removed through Tony Robbins' mesmerism he's finally able to see the former. Whiney libs that are unable to grasp fantasy and humor might be offended by the fat jokes, but the overall moral is commendable.\r\n\r\nThe flick scores pretty well in the feminine department with Paltrow in her prime and never looking better, speaking as someone who was never overly wowed by her. She’s jaw-dropping here and the movie doesn’t fail to spotlight her beauty. Other beautiful women are featured, like Susan Ward as Hal’s neighbor, Jill.\r\n\r\nThe film runs 1 hour, 54 minutes and was shot in Charlotte, North Carolina.\r\n\r\nGRADE: B+", "created_at": "2018-12-29T16:31:14.141Z"}, {"movie_id": 9889, "review_id": "5f1daf09f5f1c50037de2c96", "author_rating": 7.0, "review_text": "Really good watch, could watch again, and can recommend.\r\n\r\nNow, I'm honestly not the biggest fans of this cast: Jack Black, Gwyneth Paltrow, and Jason Alexander, but that's not to discredit their acting abilities, and I don't just limit that to these performances as everyone did a great job.\r\n\r\nBecause of the complexity of the story itself, they clearly wanted to make this as silly and palatable as possible so everything essentially has rounded corners and rubberized edges.  Hal is purposely left as a generic stock character to endear the audience as lesser but relatable, when it's actually a representation of the expectant audience.  Mauricio is clearly a similar representation of our self-loathing, self-sabotaging selves: anytime we actually get something we think we might not deserve we take it away.  Even Rosemarie is a generic representation of women's self-view (granted it is wildly simplified in this \"guy's\" movie), and by \"blurring\" the view between taught beauty (very clearly Jack learned from his dad) and personal connection you're able to find real happiness with people that might actually matter to you past an image.\r\n\r\nI and the movie aren't \"glorifying fatness\" (people say weird stuff), you should of course continue to work and be the best version of you that you can be, but \"but he/she/it is fat\" shouldn't be the only factor.\r\n\r\nIt touches on real issues in the work and that ruins the escapism for me a little bit, but it does it in such a odd, fun, philosophical way it's easy enough to overlook.", "created_at": "2020-07-26T16:27:53.971Z"}, {"movie_id": 9889, "review_id": "63222707f14dad007d61b173", "author_rating": 8.0, "review_text": "**Shallow Hal might have a pretty divisive premise in today's culture, but the message and character growth champion worth and dignity while making you laugh.**\r\n\r\nThis movie would never be allowed to release in today's world, but it was a hit when it came out in 2001, and it's because it really is a funny, sweet movie. What could be a crude and offensive movie is thoughtful and even deep at moments while being laugh-out-loud hilarious. Jack Black plays the same lovable goofball as always, except this time, his character struggles with only caring about a person's appearance and his particular expectations on how they should look. But as the movie progresses, Hal grows and matures, discovering the beauty in everyone, both inside and out. Shallow Hal ultimately shares a meaningful message while also pouring on the laughs and poking fun at every character in the film. So don't balk at the premise of the movie. Instead, give it a shot, and you might just enjoy it.", "created_at": "2022-09-14T19:09:59.557Z"}]