[{"movie_id": 417830, "review_id": "5a1ec67c925141033607c033", "author_rating": 5.0, "review_text": "**Wimpy Kid in a National Lampoon's Vacation!**\r\n\r\nI'm not the first one to say this, but this film is in the wrong franchise. Of course it was different than previous ones. It is a road movie, though all it reminded me was 'National Lampoon's Vaction'. It has been five years since the last film in the 'Wimpy Kid' series. I understand the reason for recasting, but still I expected to be what it is famous for.\r\n\r\nThe family decides to take a road trip, instead of flying to attend the grandma's 90th birthday. The mother wants it in an old way. That means no technology throughout the trip. But the kids are so addictive of their phones and so her husband. How they make it, and other troubles that they face during a long journey was told with some fun.\r\n\r\nYeah, I did not say the film isn't any fun. You would enjoy it, as a time pass film, but the laugh is hard to come by. Every bit of the film is one way or other, resembles other films. The actors were good, the direction was good, but not the writing. Despite all these flaws, the kids might enjoy it better than the adults. Just an average film, but not the worst film **as others saying.\r\n\r\n5/10**", "created_at": "2017-11-29T14:38:52.009Z"}, {"movie_id": 417830, "review_id": "5a1ec693c3a3680b8f07b06d", "author_rating": 5.0, "review_text": "**Wimpy Kid in a National Lampoon's Vacation!**\r\n\r\nI'm not the first one to say this, but this film is in the wrong franchise. Of course it was different than previous ones. It is a road movie, though all it reminded me was 'National Lampoon's Vaction'. It has been five years since the last film in the 'Wimpy Kid' series. I understand the reason for recasting, but still I expected to be what it is famous for.\r\n\r\nThe family decides to take a road trip, instead of flying to attend the grandma's 90th birthday. The mother wants it in an old way. That means no technology throughout the trip. But the kids are so addictive of their phones and so her husband. How they make it, and other troubles that they face during a long journey was told with some fun.\r\n\r\nYeah, I did not say the film isn't any fun. You would enjoy it, as a time pass film, but the laugh is hard to come by. Every bit of the film is one way or other, resembles other films. The actors were good, the direction was good, but not the writing. Despite all these flaws, the kids might enjoy it better than the adults. Just an average film, but not the worst film as others saying.\r\n\r\n**5/10**", "created_at": "2017-11-29T14:39:15.583Z"}]