[{"movie_id": 62214, "review_id": "5f4400583f8ede0034ef68fe", "author_rating": 7.0, "review_text": "Good stuff, unmistakably Tim Burton.\r\n\r\n<em>Frankenweenie</em> is a solid stop-motion horror film from Disney. Interesting plot, coupled with a suitable cast and untypical animation. It's also in black-and-white, which doesn't hamper things at all - I, in a weird sort of way, kinda forgot it was b/w for vast portions.\r\n\r\nCharlie Tahan voices the lead character, Victor Frankenstein. You also have well-known names in Winona Ryder (Elsa), Martin Short (Edward) and Catherine O'Hara (Susan). I also liked Martin Landau as Rzykruski. There's decent humour amongst those characters, too.\r\n\r\nWorth a watch, for sure.", "created_at": "2020-08-24T18:00:56.908Z"}, {"movie_id": 62214, "review_id": "6351648ca0f1a2007cdd4ff9", "author_rating": 7.0, "review_text": "This time it's the Frankenstein story that gets the Tim Burton treatment delivering us an hybrid of \"Edward Scissorhands\" (1990) and Karloff's \"Frankenstein\" (1935) with a little pooch throw in for good measure. It's the eponymous mutt that gets hit by car whilst fetching a baseball hit, surprisingly, out of the park by his young master \"Victor\". Distraught, the scientifically minded youngster concocts a cunning plan to use the attic windows, some toy seahorses and loads and loads of lightning to bring \"Sparky\" back from the dead. What now ensues is quite a fun series of escapades as the young man resurrects his friend and tries to keep it a secret from his schoolmates ahead of a looming science fair that causes his friends to try to mimic his skills and create monstrous mayhem en route. The monochrome stop-motion animation (especially their eyes!) and typically fun Danny Elfman score make for an effective comedy-horror and it is hard not to engage with the reincarnated patchwork puppy. Their rather menacing science teacher \"Rzykruski\" reminded me of Christopher Lee, too. It's a quickly paced and engaging tale with a gentle morality to it - love, loyalty, friendship all feature strongly in a narrative that goes some way to illustrate how, illogically sometimes, people can become attached to their pets. Good fun, this film.", "created_at": "2022-10-20T15:09:00.891Z"}]