[{"movie_id": 112336, "review_id": "51ec272219c29551d90f39a2", "author_rating": null, "review_text": "Good evening. Our film tonight is about a man obsessed with murder. It is a tale of violence, of lies and deceit, of envy and greed. It is, naturally, a love story.\r\n\r\nIn the year 1960, the film Psycho burst onto theatre screens, beginning one of the greatest decades of change in American cinema with shrieking violins and a blood-curdling scream. The man behind the movie, director extraordinaire Alfred Hitchcock, was as much a public figure as his leading ladies and men. He managed to thrust the unsuspecting (and unprepared) public into violence and perversion that was (at the time) beyond the pale, unlike anything they'd ever seen before in a film. And they came out loving it. Wanting more. So who was the man who pulled it off? What secrets lay inside the unique mind of one of the greatest directors of all time?\r\n\r\n\"Let's get the director of Anvil! The Story of Anvil to answer that question!\" said...someone, apparently.\r\n\r\nThat's not a knock, mind. Director Sacha Gervasi acquits himself well in this behind-the-scenes story of the making of one of the greatest films of all time. The thing is...it's not, really. Hitchcock might more accurately be titled Hitchcocks, pluralizing the name for the inclusion of one Alma Reville, Hitchcock's wife and creative partner. With the making of Psycho a backdrop, Gervasi chronicles the painful, often tumultuous, but ultimately rewarding relationship between the two British emigrants. Hitchcock was a notoriously difficult chap with which to work, his sheer talent manifesting itself in exacting, often confusingly obtuse direction of his creative staff. Alma's talent matched the great director's, and she was his lifelong editor, script doctor, confidante, and advisor.\r\n\r\nHere, the lead roles are played by Sir Anthony Hopkins and Dame Helen Mirren, with the cast of Psycho filled out by Scarlett Johansson (leading lady Janet Leigh), James D'Arcy (mama's boy Anthony Perkins), and Jessica Biel (spurned starlet Vera Miles). The actors all apply themselves whole-heartedly, particularly two: Johansson gives a fantastic performance capturing Janet Leigh's class, warmth, and intelligence, while the other supporting standout, James D'Arcy, perfectly embodies the bundle of nervous energy that was Anthony Perkins. Danny Huston, as a screenwriter and potential wooer of the neglected Alma, turns in the film's only bad performance; he seems to be trying to play to the cheap seats, as though he just wandered in from a film actually made in 1960. It's a performance that clashes mightily with the naturalistic acting on display everywhere else in the film, and doesn't work at all.\r\n\r\nBut this is Hopkins' and Mirren's show, and they make their roles sing, obviously enjoying playing two of England's favored children. Hopkins is slathered with gobs of makeup and rolls of fat to approximate Hitchcock's unique physique, and while his voice is different, his mimicry of Hitch's signature elocution (combined with the way he embodies the movement of a large man) make him a dead ringer, superficially. But it's his performance as a man, not a historical figure, that sells it. His Hitchcock retains the original's mordant humor and droll aloofness, but infuses a real human being who could easily be mistaken for a character with genuine pathos and fragility. Mirren seems to relish her role as the wind beneath Hitchcock's wings, exuding strength from her eyes as she steels up for any fight that comes, be it from meddling executives or her husband. Their electric interactions are the pulse that keeps Hitchcock alive and vibrant.\r\n\r\nThe film itself is largely well-crafted, though the subplot with Whitfield Cook (Houston) attempting to court Alma doesn't seem necessary or even handled very well. There's also an oddity to scenes where Hitchcock is haunted by Ed Gein (Michael Wincott), the murderer used by Robert Bloch as inspiration for the original novel Psycho, but this worked as a strange sort of dramatization of the creative process; anyone who's lived with a work in their head knows that the characters in it are rarely silent.\r\n\r\nThat's largely indicative of this confection of a film as a whole: it's messy and a little odd, but immensely enjoyable. It trundles along at its own pace, in a structured-but-not-really sort of way. Many of the technicals are handsomely mounted (particularly the cinematography by The Social Network's Jeff Cronenweth, and the art and set direction), though it's not flawless. The editing in particular is weak, and when you're making a film about two of the greatest frame-cutters of all time, you'd be best served to bring your A game. But by the time the credits roll, you'll be glad to have spent time with these folks.", "created_at": "2013-07-21T18:23:30.267Z"}]