[{"movie_id": 394117, "review_id": "59bb35e7c3a3680f0b004361", "author_rating": 9.0, "review_text": "_The Florida Project_ is a beautiful film about people and life and survival. Sean Baker has shown us the underbelly of American culture that we normally don't get to see; these people aren't known and are the outcasts of society. Much like Andrea Arnold's masterpiece from last year, _American Honey_, this film brings to light many issues that are insanely topical in the current American political climate such as classism and racism.\r\n\r\nGorgeously shot on 35mm, this film is a feast for the eyes. It uses every colour in the crayon box from the gloriously purple exterior to the dilapidated Magic Kingdom motel to the impossibly bright oranges, reds, and greens of the local shops where the kids venture every day. While plasticky and candy-like during the day scenes, the film is even more stunning at sundown - the dusty, sun-drenched shots here are sublime.\r\n\r\nEveryone has been abuzz about Willem Dafoe's performance in this. He's absolutely charming and is the glue that holds these dejected people's lives together in this film. He's the father figure to all of them and he does the absolute most with his character. The breakthrough star of this film, however, is 7-year-old Brooklynn Prince. She's an absolute superstar. During the Q&A at the North American premiere she wore a baby blue princess gown and simultaneously waved like Queen Elizabeth II and blew kisses at the audience as they gave her a standing ovation. Child performers lately have been better and better - remember how good Jacob Tremblay was in _Room_? Just you wait for Prince to wow you in this. She has a scene at the very end of the movie that requires her to break down and cry and it tore my heart out.", "created_at": "2017-09-15T02:07:35.769Z"}, {"movie_id": 394117, "review_id": "59d402efc3a36844e1006814", "author_rating": null, "review_text": "\"Sean Baker’s neo-realistic eye for humour, honesty and heartbreak has crafted a slow burn, potent commentary on America’s struggling underclass...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/10/4/the-florida-project.html", "created_at": "2017-10-03T21:36:47.815Z"}, {"movie_id": 394117, "review_id": "5a58809d925141021b0069e8", "author_rating": 5.0, "review_text": "I think Wayne put it best when he said: _\"Don't, uh... Don't care much for kids, so...\"_\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2018-01-12T09:32:13.779Z"}]