[{"movie_id": 346685, "review_id": "58a50ed3c3a3684ee3001ba2", "author_rating": 5.0, "review_text": "Relentlessly grim yet unengaging, despite a committed performance from Emily Blunt at the centre of it.\r\n\r\nFractured narrative can work brilliantly when a master like Christopher Nolan is in charge. This just felt like a boilerplate chick-lit murder mystery thrown into a blender to hide the thinness of its story.", "created_at": "2017-02-16T02:30:43.919Z"}, {"movie_id": 346685, "review_id": "58f6bb46c3a368416d0050eb", "author_rating": null, "review_text": "ColinJ was right, there's nothing I would add.", "created_at": "2017-04-19T01:20:06.338Z"}, {"movie_id": 346685, "review_id": "597e0e879251415daa01a431", "author_rating": 7.0, "review_text": "**The mystery man and the gone girl!**\r\n\r\nIt is one of those films that I thought I saw everything from its trailer. Not just me, many others said the same. Those we were never read the original source. Yes, it was based on the book of the same name. I really liked it. Unpredictable, but once it reveals its secret, it feels so simple that we'd missed. Straightforward storytelling. No flashbacks. Great characters, but that's where the story had a strong grip. Especially when the suspense unveiled, you might say all the earlier events were in the wrong direction, which were intentionally done to divert viewer's envision.\r\n\r\nAn alcoholic woman who daily takes the train to work, witnesses out of the window a woman happily married and living the life of her dream. When one day she sees a mysterious man with her, the tale takes a twist. Following the suspense, what she finds and how the film ends are the remaining part. Emily Blunt was very good. There are other characters, but it was Emily's story, told from her perspective. Recognisable role with an award, but the film's theme was an adult. Not like sexual exploration, but the basic outline was drawn out of such concept. One of the finest crime-mystery in the recent time, so surely worth a watch.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:51:19.850Z"}, {"movie_id": 346685, "review_id": "5d696b25343430000f1de711", "author_rating": 4.0, "review_text": "***Tortuous, tedious and unpleasant psychological crime drama***\r\n\r\nA divorced alcoholic (Emily Blunt) who regularly travels the train that parallels the Hudson River north of New York City is fixated on a house in her old neighborhood. When the woman of that house comes up missing, the girl on the train becomes entangled in the investigation. Justin Theroux plays her ex-husband, Rebecca Ferguson his new wife, Haley Bennett the missing woman, Luke Evans the missing woman’s husband and Edgar Ramírez her therapist.   \r\n\r\n“The Girl on the Train” (2016) is a melancholy adult-oriented crime drama/mystery in the mold of “Derailed” (2005), “The Clearing” (2004), \"Snow Angels\" (2007), “The River King” (2005) and even “Mystic River” (2003). But it’s by far the least of these. As far as technical filmmaking and cast go, there’s no issue. The problem is the unpleasant story, its lack of sympathetic characters and the partly-troubling message at the end. \r\n\r\nThe tale starts off confusing, but everything naturally comes together by the end and makes sense. Unfortunately, the journey there isn’t very compelling and, like I said, the more you get to know the main characters the less you care for them, with one exception. The ultimate message is worthy, but also troubling if you think about it. I can’t say anymore without giving anything away. \r\n\r\nAt the end of the day this is an ugly flick with not enough to redeem it. The movies cited above also have seriously unsavory elements, but they override the ugliness one way or another.  \r\n\r\nThe film runs 1 hour, 52 minutes, and was shot entirely in New York: the Hudson River area north of the city, as well as the city itself from Bear Mountain in the closing scene.\r\n\r\nGRADE: C/C-", "created_at": "2019-08-30T18:29:57.350Z"}, {"movie_id": 346685, "review_id": "651fafbcf04d01011c465016", "author_rating": 6.0, "review_text": "**A very feminine film with a good mystery, but is no better due to several small problems and the total absence of dramatic tension.**\r\n\r\nGood books usually give rise to good films… if they have people who are skilled enough to translate them intelligently onto the screen. I heard great things about the original book, but as I never found it on sale in my language, I ended up never being able to read it. All I can do is talk strictly about the film, and overall I was satisfied.\r\n\r\nI couldn't help but feel that the film took a while to really capture attention: I think it was only twenty minutes after the beginning that I felt that there was something interesting here. However, I can understand the need to clearly introduce the three central female characters in the plot. I also liked seeing the way the script treated the main character: the film starts with her, and she seems like someone very friendly. Little by little, this changes: the character is confronted by others and reacts in unfriendly, abrupt or thoughtless ways (I'm being nice). After all, she is the villain! Only very close to the end, with the clarification of the plot after new twists, do we understand more. This is well done and the film, decently directed by Tate Taylor, knows how to use mystery well.\r\n\r\nThere are, however, some problems that prevent the film from being really good: despite the mysteries and twists, it feels like it is a tepid film, without the dramatic tension that is needed and which would be a very pleasant bonus. I also found the film slow, although that seems like a minor problem to me. It wastes time in some scenes, yes, but I handled the subject well. A friend of mine also said that the film's story resembled a Brazilian soap opera script. I'm not going to argue that, I partly agree with the way she saw things, but it didn't seem so melodramatic to me that it merited comparison. In fact, if there is one thing that seems absent from this film, it is love or, at least, the sweet romantic notion that we have of it.\r\n\r\nBeing such a feminine film and aimed at female audiences (at least, I had that feeling), it is quite natural that the male actors do not stand out, but what happens here is more radical: the male characters are quite sketchy and even ignored. , and I felt that they only appeared when they really had to. It's a shame, because the film has a good performance by Justin Theroux, who even seems to want to give us more and do better, even without the material for it. Edgar Ramírez does a decent job, but Luke Evans doesn't make much of an effort. The spotlight goes to Emily Blunt, who gives us one of the most interesting works of her career (up to that point) and deserves our attention whenever she appears on the scene. It's a shame that Rebecca Ferguson and Haley Bennett can't keep up with her and are always in her shadow.", "created_at": "2023-10-06T06:57:00.055Z"}]