[{"movie_id": 36669, "review_id": "57ae40269251411c6700047d", "author_rating": 8.0, "review_text": "Most definitely the worst 'official' James Bond film I have ever seen (haven't seen 'The World Is Not Enough', 'Quantum of Solace' or 'Spectre' yet) but still has its moments, and like The Rolling Stones or Pink Floyd, even the bad stuff is better than 80% of the other stuff out there. Still I wish it wasn't Brosnan's last one--and though Craig was truly a refreshing change in his realistic tone that hearkened back to the great days of Connery, that too got old, even for the actor himself.", "created_at": "2016-08-12T21:31:18.314Z"}, {"movie_id": 36669, "review_id": "5e6fcc87cabfe4001516a617", "author_rating": 5.0, "review_text": "Sigh Another Way. \r\n\r\nDie Another Day is directed by Lee Tamahori and written by Neil Purvis and Robert Wade. It stars Pierce Brosnan, Halle Berry, Toby Stephens, Rick Yune, Rosamund Pike, John Cleese, Judi Dench and Michael Madsen. Music is scored by David Arnold and cinematography by David Tattersall.\r\n\r\nBond 20 and 007 is captured and tortured by the North Koreans after being betrayed by an MI6 mole. After being exchanged for a deadly enemy operative, Bond has his 007 status revoked and is forced to go rogue to find who the mole is.\r\n\r\nAs the Bond franchise celebrated 40 years of being, the film to mark the occasion, ironically, forgot the subtle ingredients that make up the best Bond movies. What we get is a chaotic movie, excess is the order of the day, with Eon allowing Tamahori to stack up scene after scene of video game standard ideas. There is no lack of effort here, the heart is full of good intentions, but some big cheese in a suit should have reined the director in. It's also a sad day in the Bond universe when a Bond film uses homage's to homage itself, only for that idea to tire itself out as well. There is barely any time for reflective silences, for a show of character depth, on the odd occasion the film slows down, gasping for air, Tamahori rushes into the next bit of noise annoys. While the action is often as laughable as the dialogue. This may have made a pot load of cash, but few serious Bond fans would have returned to see this again at the cinema. It's Bond for the non Bond fans, a lazy popcorn no brain for the gamers who just want crash, bang and wallop with no substance. Ssshh, did someone say Batman & Robin?\r\n\r\nAs the film unfolds in a blur of sledgehammer editing and lack of restraint, not to forget CGI that is shameful, the cast struggle to keep the good ship Bond afloat. Brosnan is on smug auto-pilot, this film proving to be a sad farewell for him from a role he had previously graced with some distinction. Berry is gorgeous but looks awkward with the action scenes and can't carry off the chirpy aspects of the script, though in her defence she's not done any favours by the writers and Tamahori is more concerned with showcasing her twin assets. Pike is OK, sexy and feisty, if a little difficult to accept as a MI6 agent. Stephens, who went on to do very good acting work later in his career, hams it up for all he is worth. Meant to be a shadow characterisation of Bond, Stephens plays Gustav Graves as some posh cartoon character from a Brit sit-com, a world away from the much needed dastard villain opposing Bond. His motives unclear and a victim of one of the film's more berserker twists. Yune is fun with his diamond studded face and old pros Cleese and Dench at least come out of it with reputations still intact. While Madsen is criminally underused.\r\n\r\nElsewhere on a technical front there's also not much to shout about. Madonna's title song, the worst in the series by far, is only beaten in awfulness by her cameo in the film. Tattersall's photography barely registers above the ordinary, with sub-standard location filming not helping either, and Arnold's score is about as far removed from Bond flavours as it can get. There are some good scenes within, a machismo pumped sword fight between Bond and Graves and a laser beam (hello Goldfinger my old friend) dodging fist fight stand tall above the messy quagmire, but the memory of the good sequences are quickly vanquished once the \"invisible car\" is put to field duty use! And with that there really is no more to say about the \"quality\" of Die Another Day. For Bond fans it's about a 5/10 movie, for casual blockbuster fans after a cheap thrill it will no doubt score higher.", "created_at": "2020-03-16T18:59:19.595Z"}, {"movie_id": 36669, "review_id": "60bbc7b47464570059b1e013", "author_rating": 8.0, "review_text": "_**One of the top two in Brosnan's stint**_\r\n\r\nAgent 007 (Pierce Brosnan) is sent to North Korea to investigate a colonel illegally trading weapons for African blood diamonds. The trail eventually leads from Hong Kong to Cuba where Bond meets Jinx (Halle Berry) and infiltrates a gene therapy clinic in a veritable fortress off the coast. Next, Bond has a thrilling fencing match at a swank club in London with the main villain (Toby Stephens). The final act switches to an incredible ice palace in Iceland and back to Korea. Rick Yune is on hand as the secondary villain, Zao.\r\n\r\n\"Die Another Day\" (2002) was Pierce Brosnan's fourth and final performance as James Bond and it has the most pizazz of his four movies by far. Its heightened comic book-ness gives it a bad rap, but that’s what makes it stand out from the previous two installments, which had a muted palette and were somewhat forgettable (although entertaining enough). The villains are more memorable in this one and the Bond women are certainly acceptable. The best part of the film, for me, is the over-the-top sword fight at the manor. Although it's so overdone it's somewhat goofy, it may very well be the best sword fight in the history of cinema.\r\n\r\nThe second half, which mostly takes place in Iceland, has several good action sequences as well, even goofier than the sword fight, like the iceberg tsunami on which Bond surfs (Why Sure!). But it's not like this is the first time an action scene was totally ludicrous in a Bond picture (Remember the ‘Bat Boat’ in the opening of “The World is Not Enough”?).\r\n\r\nThe first time I saw Brosnan my initial thought was, \"He'd make a great Bond,” and so he does; but it's a different Bond than Connery or Moore and it takes time to get used to him.\r\n\r\nMadonna sings the title song (and has a cameo). \r\n\r\nThe film runs 2 hours, 13 minutes, and was shot in Maui, Hawaii (opening surfing scene); England (including as a stand-in for Korea); Andalucía, Spain (Cuba); Austurland, Iceland, and Norway (ice car chase and ice palace environs).\r\n\r\nGRADE: B+/A-", "created_at": "2021-06-05T18:51:32.303Z"}, {"movie_id": 36669, "review_id": "62950f9ef5483600506dc85e", "author_rating": 5.0, "review_text": "Without a doubt, the worst James Bond theme song ever - and it tees up quite possibly the worst James Bond film ever made too. The trail features that now iconic shot of Halle Berry coming out of the water and thereafter there is quite literally nothing at all memorable about this long and meandering espionage thriller. I did find Pierce Brosnan to be a more engaging \"007\" than Timothy Dalton, but here he struggles to make any headway with this particularly, and quite violently, ludicrous plot. It all starts off quite well, actually, with an exciting pre-titles scene that sees our hero stuck in a Korean prison, seemingly abandoned by all. It's only via a prisoner exchange that he finds his freedom and then by way of some diamond smugglers and a bit of sword play with the least intimidating baddie this franchise has ever produced - \"Gustav Graves\" (Toby Stephens), we build to a denouement set amidst an Arctic wilderness. The early films included the roles of \"M\", \"Q\" and \"Moneypenny\" as foils to the star and to his character. Here, we start to see these parts being embellished to fit the status of their actors. Judi Dench is adequate, but dear heaven - what is John Cleese doing here? Another divorce settlement to fund? Rosamund Pike rarely shines for me in a film and she doesn't generate an ounce of menace here - a task left solely to the broadly competent Rick Yune's all but indestructible \"Zhao\". Certainly, there are gadgets - including a nifty Aston Martin with an invisibility cloak. Had I had one at the cinema whilst this was showing, I may well have availed myself of it and skulked out. Time for a change methinks.", "created_at": "2022-05-30T18:40:30.065Z"}, {"movie_id": 36669, "review_id": "63bf410a23be4600817b9bfa", "author_rating": 1.0, "review_text": "This STANK.\r\n\r\nThe Fx were horrible for a Bond movie, especially one made in 2002... and that isn't even getting to the theme song yet. Madonna set the record for the all time worst Bond song in the history of Bond songs.\r\n\r\nAnd she set the record for one of the all time worst Bond villains in franchise history.\r\n\r\nIt doesn't really feel like a Bond movie, it feels like a movie that was trying to make a mockery out of past Bond movies.\r\n\r\nNothing comes together, everything is just flat out horrible, and, in the end, you want it all to be over.\r\n\r\nIt's honestly worse than Moonraker", "created_at": "2023-01-11T23:06:50.123Z"}, {"movie_id": 36669, "review_id": "643e1519d7a70a0314aae358", "author_rating": 7.0, "review_text": "The last of the \"very good\" 007 films.\r\nIt isn't spectacular, but it works. \r\nThere's intrigue, and lots of action, and the dynamics of the heroine-villainess and hero-villain are very good.\r\nThe \"gadgets\" are a bit sillier than usual, like the visible invisible car(?) but who cares?\r\nThe \"over the top\" action is always in every Bond film. Some films just don't try to lie about it. This one doesn't try to lie about it, so that also works.\r\nThis one has a lot of \"people aren't who they appear to be\", and there's a bit of detective work involved.\r\nStill, it isn't a \"classic\" movie, but very watchable and entertaining, and very 007 with lots of action, scenery, women, and some attempts at wit, although wit is being crowded out in modern Bond films.", "created_at": "2023-04-18T03:57:13.226Z"}]