[{"movie_id": 440298, "review_id": "5cde013f9251416b5bd3c1a7", "author_rating": 6.0, "review_text": "**_Aesthetically perfect, narratively frustrating_**\r\n\r\n>_It's very much to do with my parents - the world they lived in that kind of shaped them, tripped them up. But it's also about two people who are very strong individuals, and very attractive. My father was an old-fashioned guy who said a woman has to fit in, and my mother just didn't at all. Their story had betrayal, and separations, getting together again, having a baby, then divorcing and really falling out horribly, then leaving the country separately. My father escaped. My mom married an English guy in order to leave Poland, with me_ _in tow, when I was 14. But then my parents met abroad again a couple of years later and fell in love, and decided they wanted to be together. They dumped their spouses and got married, and ended up living together in Germany, in exile. Then they quarrelled, and she had an affair with some other guy, much younger. But they ended up together because they were both tired, too tired to fight after 40 years of this stuff._\r\n\r\n>_My mother was a ballerina in the first half of her life and she screwed up her back. She had scoliosis, which she didn't look after, and then she had three operations that went wrong. She was in corsets, and there was morphine. My father had three heart attacks; he was a heavy smoker and drinker. They were quite young when they died, 57 and 67, but they died together in a not dissimilar fashion to what you see in the film. Just before they died they were, for two or three years, the happiest couple. They came to realise they had nothing but each other. The countries change. The boyfriends, girlfriends, wives change. Politics change. But they realized that the only thing in the world is her, is him._\r\n\r\n>_It's the mother of all love stories in a way. But it didn't seem like a love story throughout. It felt like a really bad marriage. God forbid you have such a love story. You'd rather have just a normal relationship. In this stable place. In one country, ideally._\r\n\r\n- Paweł Pawlikowski; \"\"I wanted to make it a beautiful disaster\": Paweł Pawlikowski on his new film _Cold War_\" (Alissa Wilkinson); _Vox_ (December 21, 2018)\r\n\r\nReading around some of the reviews of _Zimna wojna_ [_Cold War_], I recognise that this should have been a film I liked, loved even, as so much of what these critics are praising are exactly the kinds of things I myself often look for in a film, and I genuinely wish I had been able to get what people like _The Guardian_'s Peter Bradshaw or the _Los Angeles Times_'s Justin Cheng have gotten from it. It's one of the best-reviewed films of the year (94% approval rating on Rotten Tomatoes at the time of writing), and I freely acknowledge there's a huge amount to praise here, with elements of the visual design borderline genius. However, all the aesthetic brilliance in the world doesn't hide what, for me, is its single greatest flaw - it just left me utterly cold; I didn't care about the two main characters, and I didn't buy their relationship. Yes, I'm aware that emotional detachment is exactly what it was going for, and it's probably unfair to criticise a film for successfully doing what it intended to do, but when it ended, all I could think was \"meh.\" Now, I know what you're thinking, because I've thought it myself in relation to any number of user reviews for any number of films – you're probably already formulating your \"_go back to Michael Bay_\" comments, and I can't say I blame you. But, whilst I can certainly appreciate much of what is on offer, and understand why critics have loved it, the end result for me was one of indifference. Although, to be fair, that may say more about myself than the film.\r\n\r\nWritten by Paweł Pawlikowski (_My Summer of Love_; _The Woman in the Fifth_; _Ida_), Janusz Głowacki (_Wałęsa. Człowiek z nadziei_), and Piotr Borkowski (_Lek wysokosci_), and directed by Pawlikowski, who loosely based the story on events in his parents' lives, to whom the film is also dedicated, the plot of Zimna wojna is simplicity itself. The film begins in 1949, two years since a communist government came to power and the country was provisionally renamed _Rzeczpospolita ludowa_ [Polish People's Republic]. It opens with composer and pianist Wiktor (Tomasz Kot), his ethnomusicologist producer Irena (Agata Kulesza), and rigid state-sponsored overseer Kaczmarek (Borys Szyc) travelling through the isolated rural communities of the Polish countryside, recording folk songs and attempting to find recruits for a folk music school, with the aim of putting together an ensemble to perform nationally, and hopefully, internationally. Wiktor is bored out of his mind with the repetitive nature of the work, until a young woman named Zula (an extraordinary Joanna Kulig) comes to the school to audition. Although she doesn't fit the profile of what they are looking for – she's from the city rather than the countryside, is rumoured to have spent time in prison for killing her father, and performs not a folk song at her audition, but a piece from a Soviet film – and although Irena points out there are better singers, Wiktor argues that she has \"_something different_.\" Irena, who may or may not be in love with Wiktor, immediately recognises that he's enamoured with Zula, but he assures her he's acting out of pure professionalism. Of course, he isn't, and soon enough, he and Zula are in the midst of a passionate relationship. And that's pretty much it as far as the plot goes. The rest of the film takes place over 20 years and four countries (Poland, France, Yugoslavia, and East Germany), but it never branches out from the central relationship. There are no subplots or significant supporting characters; the narrative is pared down to within an inch of its life, with every scene, every line of dialogue, every action, existing only in relation to this focal driving force.\r\n\r\nSo, to look first at some aspects of the film which I liked. The aesthetic is absolutely unparalleled, as Pawlikowski and director of photography Łukasz Żal (_Ida_; _Loving Vincent_) allow the visual design to both originate from and convey thematic points, a truly extraordinary example of form and content blending into one another. As an example, the film is exquisitely shot in Academy ratio (1.37:1), which has the effect of confining the characters within the frame. The nature of the film lends itself to sweeping vistas and cityscapes captured in anamorphic (2.39:1), but, instead, Pawlikowski and Żal use the box-like nature of the Academy frame to trap the characters, meaning they don't seem free even when standing in the vast open countryside or in Paris at night. The epic nature of the narrative and the confined frame work in a kind of ironic symbiosis to visually convey the important theme of the tensions within and between the characters; freedom and confinement constantly working against one another.\r\n\r\nAnother example of the synergy between form and content is the use of focus. For example, in the opening scene, the shallow focus creates a depth of field so small that the village just behind the in-focus singers is completely flattened. This renders it visually inaccessible, and thus compels the audience to concentrate fully on nothing except the foreground singers. Compare this with the scene where Kaczmarek is giving a speech extolling the glory of the state and the prestige of the school to a collection of bored students, all the while a cow is wandering around in the mud behind him. The use of a deeper focus here than in the opening means that the cow falls within the larger depth of field, and can be clearly seen, once again directing the audience's attention, only this time that attention is directed away from the foreground character as opposed towards him. The cow, obviously enough, serves as a commentary, telling us exactly what Pawlikowski thinks of Kaczmarek's speech, and the ideologies underpinning it.\r\n\r\nAnother scene of this ilk is when a worker is attempting to hang a \"_We welcome tomorrow_\" banner on the front of the music school, under directions from Kaczmarek. However, falling from his ladder (and by the sounds of it, falling to his death), the banner is never hung, hanging limply across one side of the building. Again, as with the cow, this is Pawlikowski criticising the state-sanctioned machinery introduced by the _Polska Zjednoczona Partia Robotnicza_ [Polish United Workers' Party] since 1948. Of course, the communists are not \"welcoming tomorrow\" – they are far more interested in the past, which is why they are collecting folk songs; in an effort to create a Politburo-approved musical tradition designed to instil both national pride and political conformity, by rejecting the \"western\" rock & roll music of tomorrow in favour of a musical past.\r\n\r\nSpeaking of music, in relation to the way the opening scene is shot, it instantly becomes clear how vital a part of the story music and singing are. As the narrative develops, music becomes Wiktor and Zula's everything – they derive hope from it, they imbue it with their feelings, it brings them together, it drives them apart, it even comes to symbolise the strange bond between them, never moreso than when Wiktor refers to an album on which they have been collaborating as \"_our child_.\"\r\n\r\nAnother structural aspect that is exceptionally well handled is how Pawlikowski designs the time jumps, as the film skips forward to the next instalment in the story. When a sequence is finished, the film cuts to black, and then, using a variation of a J cut, the sound from the next scene can be heard a few seconds prior to the image being seen. Furthermore, that sound is usually music, reemphasising just how important music is to these characters. Interestingly however, the last few time jumps don't use music to introduce the incoming scene, perhaps referring to the changes in the characters' circumstances at this stage of the film, the darker ideological underpinnings of their psyches. In relation to this, it's also worth pointing out that once we get to the second half of the film, the two leads almost never smile (not that they smiled that much in the first half). Ironically enough, the character who smiles the most is probably Kaczmarek.\r\n\r\nSo, having spent all this time waxing lyrical about aspects of the film which impressed me, why did I not enjoy it? As I said above, there's a huge amount to admire here, the craft is exceptional, but, at the end of the day, this is a romance. And it doesn't work as a romance. Yes, it's not what you would call a standard romance by any means, the character motivations and justifications that you'd see in other narratives of this ilk (not just filmic texts) are absent here, and maybe because of that, although there was undeniable chemistry between the leads, I just didn't buy their seemingly insatiable compulsion to seek one another out, sleep together, hurt one another, and then split up. The problem is, this exact template happens about five times – they meet, have a great time for a while, argue over something, and one runs off. Wash, rinse, repeat. And even at only 85 minutes, this kind of structural repetition becomes, well, repetitive, as I increasingly found myself asking \"why are these two even together?\"\r\n\r\nTo give you an example of what I'm talking about, during one particular argument, after Zula finds out Wiktor has been lying to people about her background, he explains, \"_I wanted to give you more colour_\". Seriously? These are two people who have precious little respect for one another; beneath all the eroticism and physical attraction, they are simply two irreparably damaged people trying to save one another, living with a co-dependency, but instead hastening each other towards destruction. And as I couldn't buy into the believability of the romance, the entire enterprise floundered; it never achieves the status it seems to be aiming for, that of cathartic high-tragedy. And although the end is very well done, and the last line is spectacular, it left me unmoved, because, by that stage, I just didn't care. True, the structure of the film and the insanely tight editing means that events in their lives are glanced at rather than lingered over, so the kind of nuances and character beats you'd often expect are absent, with the audience being allocated no time to become enveloped by the emotions on screen. As the narrative is built on ellipses and omissions, many (in fact, almost all) of the standard romantic tropes simply aren't present. By design, the film is barren and emotionally impenetrable, and in that sense, Pawlikowski seems to have been attempting to construct as detached a narrative as he possibly could. If anything, he succeeds too well.", "created_at": "2019-05-17T00:33:03.881Z"}, {"movie_id": 440298, "review_id": "5cde013f9251416b5bd3c1a7", "author_rating": 6.0, "review_text": "**_Aesthetically perfect, narratively frustrating_**\r\n\r\n>_It's very much to do with my parents - the world they lived in that kind of shaped them, tripped them up. But it's also about two people who are very strong individuals, and very attractive. My father was an old-fashioned guy who said a woman has to fit in, and my mother just didn't at all. Their story had betrayal, and separations, getting together again, having a baby, then divorcing and really falling out horribly, then leaving the country separately. My father escaped. My mom married an English guy in order to leave Poland, with me_ _in tow, when I was 14. But then my parents met abroad again a couple of years later and fell in love, and decided they wanted to be together. They dumped their spouses and got married, and ended up living together in Germany, in exile. Then they quarrelled, and she had an affair with some other guy, much younger. But they ended up together because they were both tired, too tired to fight after 40 years of this stuff._\r\n\r\n>_My mother was a ballerina in the first half of her life and she screwed up her back. She had scoliosis, which she didn't look after, and then she had three operations that went wrong. She was in corsets, and there was morphine. My father had three heart attacks; he was a heavy smoker and drinker. They were quite young when they died, 57 and 67, but they died together in a not dissimilar fashion to what you see in the film. Just before they died they were, for two or three years, the happiest couple. They came to realise they had nothing but each other. The countries change. The boyfriends, girlfriends, wives change. Politics change. But they realized that the only thing in the world is her, is him._\r\n\r\n>_It's the mother of all love stories in a way. But it didn't seem like a love story throughout. It felt like a really bad marriage. God forbid you have such a love story. You'd rather have just a normal relationship. In this stable place. In one country, ideally._\r\n\r\n- Paweł Pawlikowski; \"\"I wanted to make it a beautiful disaster\": Paweł Pawlikowski on his new film _Cold War_\" (Alissa Wilkinson); _Vox_ (December 21, 2018)\r\n\r\nReading around some of the reviews of _Zimna wojna_ [_Cold War_], I recognise that this should have been a film I liked, loved even, as so much of what these critics are praising are exactly the kinds of things I myself often look for in a film, and I genuinely wish I had been able to get what people like _The Guardian_'s Peter Bradshaw or the _Los Angeles Times_'s Justin Cheng have gotten from it. It's one of the best-reviewed films of the year (94% approval rating on Rotten Tomatoes at the time of writing), and I freely acknowledge there's a huge amount to praise here, with elements of the visual design borderline genius. However, all the aesthetic brilliance in the world doesn't hide what, for me, is its single greatest flaw - it just left me utterly cold; I didn't care about the two main characters, and I didn't buy their relationship. Yes, I'm aware that emotional detachment is exactly what it was going for, and it's probably unfair to criticise a film for successfully doing what it intended to do, but when it ended, all I could think was \"meh.\" Now, I know what you're thinking, because I've thought it myself in relation to any number of user reviews for any number of films – you're probably already formulating your \"_go back to Michael Bay_\" comments, and I can't say I blame you. But, whilst I can certainly appreciate much of what is on offer, and understand why critics have loved it, the end result for me was one of indifference. Although, to be fair, that may say more about myself than the film.\r\n\r\nWritten by Paweł Pawlikowski (_My Summer of Love_; _The Woman in the Fifth_; _Ida_), Janusz Głowacki (_Wałęsa. Człowiek z nadziei_), and Piotr Borkowski (_Lek wysokosci_), and directed by Pawlikowski, who loosely based the story on events in his parents' lives, to whom the film is also dedicated, the plot of Zimna wojna is simplicity itself. The film begins in 1949, two years since a communist government came to power and the country was provisionally renamed _Rzeczpospolita ludowa_ [Polish People's Republic]. It opens with composer and pianist Wiktor (Tomasz Kot), his ethnomusicologist producer Irena (Agata Kulesza), and rigid state-sponsored overseer Kaczmarek (Borys Szyc) travelling through the isolated rural communities of the Polish countryside, recording folk songs and attempting to find recruits for a folk music school, with the aim of putting together an ensemble to perform nationally, and hopefully, internationally. Wiktor is bored out of his mind with the repetitive nature of the work, until a young woman named Zula (an extraordinary Joanna Kulig) comes to the school to audition. Although she doesn't fit the profile of what they are looking for – she's from the city rather than the countryside, is rumoured to have spent time in prison for killing her father, and performs not a folk song at her audition, but a piece from a Soviet film – and although Irena points out there are better singers, Wiktor argues that she has \"_something different_.\" Irena, who may or may not be in love with Wiktor, immediately recognises that he's enamoured with Zula, but he assures her he's acting out of pure professionalism. Of course, he isn't, and soon enough, he and Zula are in the midst of a passionate relationship. And that's pretty much it as far as the plot goes. The rest of the film takes place over 20 years and four countries (Poland, France, Yugoslavia, and East Germany), but it never branches out from the central relationship. There are no subplots or significant supporting characters; the narrative is pared down to within an inch of its life, with every scene, every line of dialogue, every action, existing only in relation to this focal driving force.\r\n\r\nSo, to look first at some aspects of the film which I liked. The aesthetic is absolutely unparalleled, as Pawlikowski and director of photography Łukasz Żal (_Ida_; _Loving Vincent_) allow the visual design to both originate from and convey thematic points, a truly extraordinary example of form and content blending into one another. As an example, the film is exquisitely shot in Academy ratio (1.37:1), which has the effect of confining the characters within the frame. The nature of the film lends itself to sweeping vistas and cityscapes captured in anamorphic (2.39:1), but, instead, Pawlikowski and Żal use the box-like nature of the Academy frame to trap the characters, meaning they don't seem free even when standing in the vast open countryside or in Paris at night. The epic nature of the narrative and the confined frame work in a kind of ironic symbiosis to visually convey the important theme of the tensions within and between the characters; freedom and confinement constantly working against one another.\r\n\r\nAnother example of the synergy between form and content is the use of focus. For example, in the opening scene, the shallow focus creates a depth of field so small that the village just behind the in-focus singers is completely flattened. This renders it visually inaccessible, and thus compels the audience to concentrate fully on nothing except the foreground singers. Compare this with the scene where Kaczmarek is giving a speech extolling the glory of the state and the prestige of the school to a collection of bored students, all the while a cow is wandering around in the mud behind him. The use of a deeper focus here than in the opening means that the cow falls within the larger depth of field, and can be clearly seen, once again directing the audience's attention, only this time that attention is directed away from the foreground character as opposed towards him. The cow, obviously enough, serves as a commentary, telling us exactly what Pawlikowski thinks of Kaczmarek's speech, and the ideologies underpinning it.\r\n\r\nAnother scene of this ilk is when a worker is attempting to hang a \"_We welcome tomorrow_\" banner on the front of the music school, under directions from Kaczmarek. However, falling from his ladder (and by the sounds of it, falling to his death), the banner is never hung, hanging limply across one side of the building. Again, as with the cow, this is Pawlikowski criticising the state-sanctioned machinery introduced by the _Polska Zjednoczona Partia Robotnicza_ [Polish United Workers' Party] since 1948. Of course, the communists are not \"welcoming tomorrow\" – they are far more interested in the past, which is why they are collecting folk songs; in an effort to create a Politburo-approved musical tradition designed to instil both national pride and political conformity, by rejecting the \"western\" rock & roll music of tomorrow in favour of a musical past.\r\n\r\nSpeaking of music, in relation to the way the opening scene is shot, it instantly becomes clear how vital a part of the story music and singing are. As the narrative develops, music becomes Wiktor and Zula's everything – they derive hope from it, they imbue it with their feelings, it brings them together, it drives them apart, it even comes to symbolise the strange bond between them, never moreso than when Wiktor refers to an album on which they have been collaborating as \"_our child_.\"\r\n\r\nAnother structural aspect that is exceptionally well handled is how Pawlikowski designs the time jumps, as the film skips forward to the next instalment in the story. When a sequence is finished, the film cuts to black, and then, using a variation of a J cut, the sound from the next scene can be heard a few seconds prior to the image being seen. Furthermore, that sound is usually music, reemphasising just how important music is to these characters. Interestingly however, the last few time jumps don't use music to introduce the incoming scene, perhaps referring to the changes in the characters' circumstances at this stage of the film, the darker ideological underpinnings of their psyches. In relation to this, it's also worth pointing out that once we get to the second half of the film, the two leads almost never smile (not that they smiled that much in the first half). Ironically enough, the character who smiles the most is probably Kaczmarek.\r\n\r\nSo, having spent all this time waxing lyrical about aspects of the film which impressed me, why did I not enjoy it? As I said above, there's a huge amount to admire here, the craft is exceptional, but, at the end of the day, this is a romance. And it doesn't work as a romance. Yes, it's not what you would call a standard romance by any means, the character motivations and justifications that you'd see in other narratives of this ilk (not just filmic texts) are absent here, and maybe because of that, although there was undeniable chemistry between the leads, I just didn't buy their seemingly insatiable compulsion to seek one another out, sleep together, hurt one another, and then split up. The problem is, this exact template happens about five times – they meet, have a great time for a while, argue over something, and one runs off. Wash, rinse, repeat. And even at only 85 minutes, this kind of structural repetition becomes, well, repetitive, as I increasingly found myself asking \"why are these two even together?\"\r\n\r\nTo give you an example of what I'm talking about, during one particular argument, after Zula finds out Wiktor has been lying to people about her background, he explains, \"_I wanted to give you more colour_\". Seriously? These are two people who have precious little respect for one another; beneath all the eroticism and physical attraction, they are simply two irreparably damaged people trying to save one another, living with a co-dependency, but instead hastening each other towards destruction. And as I couldn't buy into the believability of the romance, the entire enterprise floundered; it never achieves the status it seems to be aiming for, that of cathartic high-tragedy. And although the end is very well done, and the last line is spectacular, it left me unmoved, because, by that stage, I just didn't care. True, the structure of the film and the insanely tight editing means that events in their lives are glanced at rather than lingered over, so the kind of nuances and character beats you'd often expect are absent, with the audience being allocated no time to become enveloped by the emotions on screen. As the narrative is built on ellipses and omissions, many (in fact, almost all) of the standard romantic tropes simply aren't present. By design, the film is barren and emotionally impenetrable, and in that sense, Pawlikowski seems to have been attempting to construct as detached a narrative as he possibly could. If anything, he succeeds too well.", "created_at": "2019-05-17T00:33:03.881Z"}, {"movie_id": 440298, "review_id": "5cde013f9251416b5bd3c1a7", "author_rating": 6.0, "review_text": "**_Aesthetically perfect, narratively frustrating_**\r\n\r\n>_It's very much to do with my parents - the world they lived in that kind of shaped them, tripped them up. But it's also about two people who are very strong individuals, and very attractive. My father was an old-fashioned guy who said a woman has to fit in, and my mother just didn't at all. Their story had betrayal, and separations, getting together again, having a baby, then divorcing and really falling out horribly, then leaving the country separately. My father escaped. My mom married an English guy in order to leave Poland, with me_ _in tow, when I was 14. But then my parents met abroad again a couple of years later and fell in love, and decided they wanted to be together. They dumped their spouses and got married, and ended up living together in Germany, in exile. Then they quarrelled, and she had an affair with some other guy, much younger. But they ended up together because they were both tired, too tired to fight after 40 years of this stuff._\r\n\r\n>_My mother was a ballerina in the first half of her life and she screwed up her back. She had scoliosis, which she didn't look after, and then she had three operations that went wrong. She was in corsets, and there was morphine. My father had three heart attacks; he was a heavy smoker and drinker. They were quite young when they died, 57 and 67, but they died together in a not dissimilar fashion to what you see in the film. Just before they died they were, for two or three years, the happiest couple. They came to realise they had nothing but each other. The countries change. The boyfriends, girlfriends, wives change. Politics change. But they realized that the only thing in the world is her, is him._\r\n\r\n>_It's the mother of all love stories in a way. But it didn't seem like a love story throughout. It felt like a really bad marriage. God forbid you have such a love story. You'd rather have just a normal relationship. In this stable place. In one country, ideally._\r\n\r\n- Paweł Pawlikowski; \"\"I wanted to make it a beautiful disaster\": Paweł Pawlikowski on his new film _Cold War_\" (Alissa Wilkinson); _Vox_ (December 21, 2018)\r\n\r\nReading around some of the reviews of _Zimna wojna_ [_Cold War_], I recognise that this should have been a film I liked, loved even, as so much of what these critics are praising are exactly the kinds of things I myself often look for in a film, and I genuinely wish I had been able to get what people like _The Guardian_'s Peter Bradshaw or the _Los Angeles Times_'s Justin Cheng have gotten from it. It's one of the best-reviewed films of the year (94% approval rating on Rotten Tomatoes at the time of writing), and I freely acknowledge there's a huge amount to praise here, with elements of the visual design borderline genius. However, all the aesthetic brilliance in the world doesn't hide what, for me, is its single greatest flaw - it just left me utterly cold; I didn't care about the two main characters, and I didn't buy their relationship. Yes, I'm aware that emotional detachment is exactly what it was going for, and it's probably unfair to criticise a film for successfully doing what it intended to do, but when it ended, all I could think was \"meh.\" Now, I know what you're thinking, because I've thought it myself in relation to any number of user reviews for any number of films – you're probably already formulating your \"_go back to Michael Bay_\" comments, and I can't say I blame you. But, whilst I can certainly appreciate much of what is on offer, and understand why critics have loved it, the end result for me was one of indifference. Although, to be fair, that may say more about myself than the film.\r\n\r\nWritten by Paweł Pawlikowski (_My Summer of Love_; _The Woman in the Fifth_; _Ida_), Janusz Głowacki (_Wałęsa. Człowiek z nadziei_), and Piotr Borkowski (_Lek wysokosci_), and directed by Pawlikowski, who loosely based the story on events in his parents' lives, to whom the film is also dedicated, the plot of Zimna wojna is simplicity itself. The film begins in 1949, two years since a communist government came to power and the country was provisionally renamed _Rzeczpospolita ludowa_ [Polish People's Republic]. It opens with composer and pianist Wiktor (Tomasz Kot), his ethnomusicologist producer Irena (Agata Kulesza), and rigid state-sponsored overseer Kaczmarek (Borys Szyc) travelling through the isolated rural communities of the Polish countryside, recording folk songs and attempting to find recruits for a folk music school, with the aim of putting together an ensemble to perform nationally, and hopefully, internationally. Wiktor is bored out of his mind with the repetitive nature of the work, until a young woman named Zula (an extraordinary Joanna Kulig) comes to the school to audition. Although she doesn't fit the profile of what they are looking for – she's from the city rather than the countryside, is rumoured to have spent time in prison for killing her father, and performs not a folk song at her audition, but a piece from a Soviet film – and although Irena points out there are better singers, Wiktor argues that she has \"_something different_.\" Irena, who may or may not be in love with Wiktor, immediately recognises that he's enamoured with Zula, but he assures her he's acting out of pure professionalism. Of course, he isn't, and soon enough, he and Zula are in the midst of a passionate relationship. And that's pretty much it as far as the plot goes. The rest of the film takes place over 20 years and four countries (Poland, France, Yugoslavia, and East Germany), but it never branches out from the central relationship. There are no subplots or significant supporting characters; the narrative is pared down to within an inch of its life, with every scene, every line of dialogue, every action, existing only in relation to this focal driving force.\r\n\r\nSo, to look first at some aspects of the film which I liked. The aesthetic is absolutely unparalleled, as Pawlikowski and director of photography Łukasz Żal (_Ida_; _Loving Vincent_) allow the visual design to both originate from and convey thematic points, a truly extraordinary example of form and content blending into one another. As an example, the film is exquisitely shot in Academy ratio (1.37:1), which has the effect of confining the characters within the frame. The nature of the film lends itself to sweeping vistas and cityscapes captured in anamorphic (2.39:1), but, instead, Pawlikowski and Żal use the box-like nature of the Academy frame to trap the characters, meaning they don't seem free even when standing in the vast open countryside or in Paris at night. The epic nature of the narrative and the confined frame work in a kind of ironic symbiosis to visually convey the important theme of the tensions within and between the characters; freedom and confinement constantly working against one another.\r\n\r\nAnother example of the synergy between form and content is the use of focus. For example, in the opening scene, the shallow focus creates a depth of field so small that the village just behind the in-focus singers is completely flattened. This renders it visually inaccessible, and thus compels the audience to concentrate fully on nothing except the foreground singers. Compare this with the scene where Kaczmarek is giving a speech extolling the glory of the state and the prestige of the school to a collection of bored students, all the while a cow is wandering around in the mud behind him. The use of a deeper focus here than in the opening means that the cow falls within the larger depth of field, and can be clearly seen, once again directing the audience's attention, only this time that attention is directed away from the foreground character as opposed towards him. The cow, obviously enough, serves as a commentary, telling us exactly what Pawlikowski thinks of Kaczmarek's speech, and the ideologies underpinning it.\r\n\r\nAnother scene of this ilk is when a worker is attempting to hang a \"_We welcome tomorrow_\" banner on the front of the music school, under directions from Kaczmarek. However, falling from his ladder (and by the sounds of it, falling to his death), the banner is never hung, hanging limply across one side of the building. Again, as with the cow, this is Pawlikowski criticising the state-sanctioned machinery introduced by the _Polska Zjednoczona Partia Robotnicza_ [Polish United Workers' Party] since 1948. Of course, the communists are not \"welcoming tomorrow\" – they are far more interested in the past, which is why they are collecting folk songs; in an effort to create a Politburo-approved musical tradition designed to instil both national pride and political conformity, by rejecting the \"western\" rock & roll music of tomorrow in favour of a musical past.\r\n\r\nSpeaking of music, in relation to the way the opening scene is shot, it instantly becomes clear how vital a part of the story music and singing are. As the narrative develops, music becomes Wiktor and Zula's everything – they derive hope from it, they imbue it with their feelings, it brings them together, it drives them apart, it even comes to symbolise the strange bond between them, never moreso than when Wiktor refers to an album on which they have been collaborating as \"_our child_.\"\r\n\r\nAnother structural aspect that is exceptionally well handled is how Pawlikowski designs the time jumps, as the film skips forward to the next instalment in the story. When a sequence is finished, the film cuts to black, and then, using a variation of a J cut, the sound from the next scene can be heard a few seconds prior to the image being seen. Furthermore, that sound is usually music, reemphasising just how important music is to these characters. Interestingly however, the last few time jumps don't use music to introduce the incoming scene, perhaps referring to the changes in the characters' circumstances at this stage of the film, the darker ideological underpinnings of their psyches. In relation to this, it's also worth pointing out that once we get to the second half of the film, the two leads almost never smile (not that they smiled that much in the first half). Ironically enough, the character who smiles the most is probably Kaczmarek.\r\n\r\nSo, having spent all this time waxing lyrical about aspects of the film which impressed me, why did I not enjoy it? As I said above, there's a huge amount to admire here, the craft is exceptional, but, at the end of the day, this is a romance. And it doesn't work as a romance. Yes, it's not what you would call a standard romance by any means, the character motivations and justifications that you'd see in other narratives of this ilk (not just filmic texts) are absent here, and maybe because of that, although there was undeniable chemistry between the leads, I just didn't buy their seemingly insatiable compulsion to seek one another out, sleep together, hurt one another, and then split up. The problem is, this exact template happens about five times – they meet, have a great time for a while, argue over something, and one runs off. Wash, rinse, repeat. And even at only 85 minutes, this kind of structural repetition becomes, well, repetitive, as I increasingly found myself asking \"why are these two even together?\"\r\n\r\nTo give you an example of what I'm talking about, during one particular argument, after Zula finds out Wiktor has been lying to people about her background, he explains, \"_I wanted to give you more colour_\". Seriously? These are two people who have precious little respect for one another; beneath all the eroticism and physical attraction, they are simply two irreparably damaged people trying to save one another, living with a co-dependency, but instead hastening each other towards destruction. And as I couldn't buy into the believability of the romance, the entire enterprise floundered; it never achieves the status it seems to be aiming for, that of cathartic high-tragedy. And although the end is very well done, and the last line is spectacular, it left me unmoved, because, by that stage, I just didn't care. True, the structure of the film and the insanely tight editing means that events in their lives are glanced at rather than lingered over, so the kind of nuances and character beats you'd often expect are absent, with the audience being allocated no time to become enveloped by the emotions on screen. As the narrative is built on ellipses and omissions, many (in fact, almost all) of the standard romantic tropes simply aren't present. By design, the film is barren and emotionally impenetrable, and in that sense, Pawlikowski seems to have been attempting to construct as detached a narrative as he possibly could. If anything, he succeeds too well.", "created_at": "2019-05-17T00:33:03.881Z"}, {"movie_id": 440298, "review_id": "5cde013f9251416b5bd3c1a7", "author_rating": 6.0, "review_text": "**_Aesthetically perfect, narratively frustrating_**\r\n\r\n>_It's very much to do with my parents - the world they lived in that kind of shaped them, tripped them up. But it's also about two people who are very strong individuals, and very attractive. My father was an old-fashioned guy who said a woman has to fit in, and my mother just didn't at all. Their story had betrayal, and separations, getting together again, having a baby, then divorcing and really falling out horribly, then leaving the country separately. My father escaped. My mom married an English guy in order to leave Poland, with me_ _in tow, when I was 14. But then my parents met abroad again a couple of years later and fell in love, and decided they wanted to be together. They dumped their spouses and got married, and ended up living together in Germany, in exile. Then they quarrelled, and she had an affair with some other guy, much younger. But they ended up together because they were both tired, too tired to fight after 40 years of this stuff._\r\n\r\n>_My mother was a ballerina in the first half of her life and she screwed up her back. She had scoliosis, which she didn't look after, and then she had three operations that went wrong. She was in corsets, and there was morphine. My father had three heart attacks; he was a heavy smoker and drinker. They were quite young when they died, 57 and 67, but they died together in a not dissimilar fashion to what you see in the film. Just before they died they were, for two or three years, the happiest couple. They came to realise they had nothing but each other. The countries change. The boyfriends, girlfriends, wives change. Politics change. But they realized that the only thing in the world is her, is him._\r\n\r\n>_It's the mother of all love stories in a way. But it didn't seem like a love story throughout. It felt like a really bad marriage. God forbid you have such a love story. You'd rather have just a normal relationship. In this stable place. In one country, ideally._\r\n\r\n- Paweł Pawlikowski; \"\"I wanted to make it a beautiful disaster\": Paweł Pawlikowski on his new film _Cold War_\" (Alissa Wilkinson); _Vox_ (December 21, 2018)\r\n\r\nReading around some of the reviews of _Zimna wojna_ [_Cold War_], I recognise that this should have been a film I liked, loved even, as so much of what these critics are praising are exactly the kinds of things I myself often look for in a film, and I genuinely wish I had been able to get what people like _The Guardian_'s Peter Bradshaw or the _Los Angeles Times_'s Justin Cheng have gotten from it. It's one of the best-reviewed films of the year (94% approval rating on Rotten Tomatoes at the time of writing), and I freely acknowledge there's a huge amount to praise here, with elements of the visual design borderline genius. However, all the aesthetic brilliance in the world doesn't hide what, for me, is its single greatest flaw - it just left me utterly cold; I didn't care about the two main characters, and I didn't buy their relationship. Yes, I'm aware that emotional detachment is exactly what it was going for, and it's probably unfair to criticise a film for successfully doing what it intended to do, but when it ended, all I could think was \"meh.\" Now, I know what you're thinking, because I've thought it myself in relation to any number of user reviews for any number of films – you're probably already formulating your \"_go back to Michael Bay_\" comments, and I can't say I blame you. But, whilst I can certainly appreciate much of what is on offer, and understand why critics have loved it, the end result for me was one of indifference. Although, to be fair, that may say more about myself than the film.\r\n\r\nWritten by Paweł Pawlikowski (_My Summer of Love_; _The Woman in the Fifth_; _Ida_), Janusz Głowacki (_Wałęsa. Człowiek z nadziei_), and Piotr Borkowski (_Lek wysokosci_), and directed by Pawlikowski, who loosely based the story on events in his parents' lives, to whom the film is also dedicated, the plot of Zimna wojna is simplicity itself. The film begins in 1949, two years since a communist government came to power and the country was provisionally renamed _Rzeczpospolita ludowa_ [Polish People's Republic]. It opens with composer and pianist Wiktor (Tomasz Kot), his ethnomusicologist producer Irena (Agata Kulesza), and rigid state-sponsored overseer Kaczmarek (Borys Szyc) travelling through the isolated rural communities of the Polish countryside, recording folk songs and attempting to find recruits for a folk music school, with the aim of putting together an ensemble to perform nationally, and hopefully, internationally. Wiktor is bored out of his mind with the repetitive nature of the work, until a young woman named Zula (an extraordinary Joanna Kulig) comes to the school to audition. Although she doesn't fit the profile of what they are looking for – she's from the city rather than the countryside, is rumoured to have spent time in prison for killing her father, and performs not a folk song at her audition, but a piece from a Soviet film – and although Irena points out there are better singers, Wiktor argues that she has \"_something different_.\" Irena, who may or may not be in love with Wiktor, immediately recognises that he's enamoured with Zula, but he assures her he's acting out of pure professionalism. Of course, he isn't, and soon enough, he and Zula are in the midst of a passionate relationship. And that's pretty much it as far as the plot goes. The rest of the film takes place over 20 years and four countries (Poland, France, Yugoslavia, and East Germany), but it never branches out from the central relationship. There are no subplots or significant supporting characters; the narrative is pared down to within an inch of its life, with every scene, every line of dialogue, every action, existing only in relation to this focal driving force.\r\n\r\nSo, to look first at some aspects of the film which I liked. The aesthetic is absolutely unparalleled, as Pawlikowski and director of photography Łukasz Żal (_Ida_; _Loving Vincent_) allow the visual design to both originate from and convey thematic points, a truly extraordinary example of form and content blending into one another. As an example, the film is exquisitely shot in Academy ratio (1.37:1), which has the effect of confining the characters within the frame. The nature of the film lends itself to sweeping vistas and cityscapes captured in anamorphic (2.39:1), but, instead, Pawlikowski and Żal use the box-like nature of the Academy frame to trap the characters, meaning they don't seem free even when standing in the vast open countryside or in Paris at night. The epic nature of the narrative and the confined frame work in a kind of ironic symbiosis to visually convey the important theme of the tensions within and between the characters; freedom and confinement constantly working against one another.\r\n\r\nAnother example of the synergy between form and content is the use of focus. For example, in the opening scene, the shallow focus creates a depth of field so small that the village just behind the in-focus singers is completely flattened. This renders it visually inaccessible, and thus compels the audience to concentrate fully on nothing except the foreground singers. Compare this with the scene where Kaczmarek is giving a speech extolling the glory of the state and the prestige of the school to a collection of bored students, all the while a cow is wandering around in the mud behind him. The use of a deeper focus here than in the opening means that the cow falls within the larger depth of field, and can be clearly seen, once again directing the audience's attention, only this time that attention is directed away from the foreground character as opposed towards him. The cow, obviously enough, serves as a commentary, telling us exactly what Pawlikowski thinks of Kaczmarek's speech, and the ideologies underpinning it.\r\n\r\nAnother scene of this ilk is when a worker is attempting to hang a \"_We welcome tomorrow_\" banner on the front of the music school, under directions from Kaczmarek. However, falling from his ladder (and by the sounds of it, falling to his death), the banner is never hung, hanging limply across one side of the building. Again, as with the cow, this is Pawlikowski criticising the state-sanctioned machinery introduced by the _Polska Zjednoczona Partia Robotnicza_ [Polish United Workers' Party] since 1948. Of course, the communists are not \"welcoming tomorrow\" – they are far more interested in the past, which is why they are collecting folk songs; in an effort to create a Politburo-approved musical tradition designed to instil both national pride and political conformity, by rejecting the \"western\" rock & roll music of tomorrow in favour of a musical past.\r\n\r\nSpeaking of music, in relation to the way the opening scene is shot, it instantly becomes clear how vital a part of the story music and singing are. As the narrative develops, music becomes Wiktor and Zula's everything – they derive hope from it, they imbue it with their feelings, it brings them together, it drives them apart, it even comes to symbolise the strange bond between them, never moreso than when Wiktor refers to an album on which they have been collaborating as \"_our child_.\"\r\n\r\nAnother structural aspect that is exceptionally well handled is how Pawlikowski designs the time jumps, as the film skips forward to the next instalment in the story. When a sequence is finished, the film cuts to black, and then, using a variation of a J cut, the sound from the next scene can be heard a few seconds prior to the image being seen. Furthermore, that sound is usually music, reemphasising just how important music is to these characters. Interestingly however, the last few time jumps don't use music to introduce the incoming scene, perhaps referring to the changes in the characters' circumstances at this stage of the film, the darker ideological underpinnings of their psyches. In relation to this, it's also worth pointing out that once we get to the second half of the film, the two leads almost never smile (not that they smiled that much in the first half). Ironically enough, the character who smiles the most is probably Kaczmarek.\r\n\r\nSo, having spent all this time waxing lyrical about aspects of the film which impressed me, why did I not enjoy it? As I said above, there's a huge amount to admire here, the craft is exceptional, but, at the end of the day, this is a romance. And it doesn't work as a romance. Yes, it's not what you would call a standard romance by any means, the character motivations and justifications that you'd see in other narratives of this ilk (not just filmic texts) are absent here, and maybe because of that, although there was undeniable chemistry between the leads, I just didn't buy their seemingly insatiable compulsion to seek one another out, sleep together, hurt one another, and then split up. The problem is, this exact template happens about five times – they meet, have a great time for a while, argue over something, and one runs off. Wash, rinse, repeat. And even at only 85 minutes, this kind of structural repetition becomes, well, repetitive, as I increasingly found myself asking \"why are these two even together?\"\r\n\r\nTo give you an example of what I'm talking about, during one particular argument, after Zula finds out Wiktor has been lying to people about her background, he explains, \"_I wanted to give you more colour_\". Seriously? These are two people who have precious little respect for one another; beneath all the eroticism and physical attraction, they are simply two irreparably damaged people trying to save one another, living with a co-dependency, but instead hastening each other towards destruction. And as I couldn't buy into the believability of the romance, the entire enterprise floundered; it never achieves the status it seems to be aiming for, that of cathartic high-tragedy. And although the end is very well done, and the last line is spectacular, it left me unmoved, because, by that stage, I just didn't care. True, the structure of the film and the insanely tight editing means that events in their lives are glanced at rather than lingered over, so the kind of nuances and character beats you'd often expect are absent, with the audience being allocated no time to become enveloped by the emotions on screen. As the narrative is built on ellipses and omissions, many (in fact, almost all) of the standard romantic tropes simply aren't present. By design, the film is barren and emotionally impenetrable, and in that sense, Pawlikowski seems to have been attempting to construct as detached a narrative as he possibly could. If anything, he succeeds too well.", "created_at": "2019-05-17T00:33:03.881Z"}]