[{"movie_id": 157336, "review_id": "5463856c0e0a267815002598", "author_rating": 9.0, "review_text": "Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the story. Especially Matt Damon's was the crucial one.\r\n\r\nRemember the movie 'Contact', a lovely movie, which was ruined by its fictional ending. Something like that happened in this film as well. The story was initiated with a realistic approach with actual scientific contents as per the present understanding about the universe. But the end was let me down with the layered contents that kind of impossible to agree with it. As a cinematic theme it worked, yeah, a good solution for this wonderfully written story. We know that the time can't run backwards, so that's the trouble.\r\n\r\nAnyway, this movie defines in a new way, I mean scientifically the existence of ghost. It was not a horror movie, but I liked supernatural force that merged with this science fiction theme. That explains and gives vast ideas to expand our physics beyond something and somewhere yet to reach. Hats off to the director, because he was not thinking of making money here. His idea was to implement what the humans are understood so far about the cosmos. And he very nicely transformed those into the silver screen with the blend of human emotions. In my opinion, this will replace '2001: A Space Odyssey' for sometime till another one make this way.\r\n\r\nI could have not asked a better space travel drama than this, especially when I heard Nolan doing a science-fiction I believed he gonna rock it. He was so true to the science and the human feelings in this film. If you had seen enough movies before like this one, you can recall your memories like the Tom Hanks parts from 'Cloud Atlas'. But still independently stands strong and falls in a never seen before category.\r\n\r\n‘‘Maybe we've spent too long\r\ntrying to figure all this out with theory.’’\r\n\r\nThe end scene leaves a hint of a possible sequel. I would be happy if that happen in a near future, but definitely that would be a completely different cinema as per how this one ended. I know his fans want that to happen and so am I.\r\n\r\nThe visuals were not that great, but simply very good. To see those in digital 3D would have given us a different experience, sadly Nolan was not in favor of that technology. Hoping this movie would get as many as the Oscars nod. Especially not getting into the best motion picture shortlist would be a shame. Like I said I'm no one fan, I just love watching everyone's every movie. I would have went to see it again if it was converted into digital 3D, since I'm modern tech geek when it comes to the films.\r\n\r\nIt will become a talk of the week, perhaps month all over the world, so don't leave behind when your friends talk about it. What I gonna say is it is a must see asap if you are a movie fanatic like me otherwise Nolan movies does not need anyone's recommendation because his movies usually sell itself like the hot samosa.", "created_at": "2014-11-12T16:06:04.927Z"}, {"movie_id": 157336, "review_id": "55f43b7dc3a3686d03003292", "author_rating": 9.5, "review_text": "People seem to think that if you enjoy a Christopher Nolan movie, you are a fanboy and the film couldn't really be that good. That is not true. He has never made a bad movie, Insomnia is probably his worst and it is still an excellent movie. \r\nInterstellar is up there in his top 3, with The Dark Knight being number 1 and Inception in number 2. I don't think he will ever make a better movie than The Dark Knight, it is without a doubt a masterpiece of cinema in my opinion. It can be enjoyed on so many levels.\r\nI remember seeing Interstellar in the movie theater and being on the edge of my seat the whole time. It was breathtaking but the end left me confused so i walked out disappointed. \r\nSince then i have watched it many times but it only took a second viewing to realize what a great ending it is and here is why. How many people discuss the end, was the wormhole open or closed for him to make it to Brand, what happens next, is there a sequel. I discuss this with people who hate the movie and the debate will still last a good 30 minutes if not more without getting heated. It is a wonderful story told through the eyes of a genius film maker who deserves more than he receives, an oscar would be nice start.\r\nI read hat his next movie is to be released in July 2017, I can't wait to find out everything about it like i have since he began.\r\nIf you're unsure about Christopher Nolan, watch his career from the beginning starting with Doodlebug.", "created_at": "2015-09-12T14:49:33.669Z"}, {"movie_id": 157336, "review_id": "5634aee792514129fe009d2c", "author_rating": 7.0, "review_text": "Another grandiloquent movie from Christoper Nolan.\r\n\r\nThe cast is good, and McConaughey performs a role made for himself. The photography is very nice but the movie commits all the same mistakes than previous Nolan's movies. I think mistakes but it may be that they are the points Nolan fans enjoy the most ...\r\n\r\n* The story makes you believe it is a realy deeply thought plot but, in the end, it has so basic mistakes and stupidities that make it nonsensical.\r\n* There is a general ambience of every moment being epic; deep, solemn and smart dialogues but, at some point our highly trained engineer and pilot behaves really stupidly.\r\n* To keep the mentioned constant feeling of being in an epic moment, Nolan uses a thumping and insistent soundtrack. As it is not a moment, but a 3h movie, it is really tiresome.\r\n\r\nAll in all, the movie is OK but you can only think this is a great movie if you are a real Nolan fan.", "created_at": "2015-10-31T12:07:03.650Z"}, {"movie_id": 157336, "review_id": "5807dc6dc3a3680f2d00319f", "author_rating": 10.0, "review_text": "\"Man kind was born on earth, it was never meant to die here.\"\r\n\r\nIT has been two days since I watched it and I still can't get it out of my head. I can safely say that it has been a long LONG time since a movie had this much effect on me after watching it. And the only thing I can think of now is to somehow Re-Watch it again.\r\n\r\nThis movie was surprisingly different from Christopher Nolan's recent works because they had been great cinematic entertainment pieces catered to a wider audience with a blockbuster approach, this certainly didn't felt like that and hence the polarizing response it got. It is an ambitious project that is not meant to merely entertain, walk into it knowing that. I'll say this though, If it works for you, you'll be in heaven.\r\n\r\nThe premise of the movie is that Earth is no longer capable of supporting humans on it, we must find a new home to avoid extinction. This scenario is told from a very personal perspective and not from a Global scale like some sort of apocalyptic catastrophe disaster film. At the core of the movie is the Father-Daughter relationship. The movie takes its sweet time to develop it too.\r\n\r\nMathew McConaughey, not surprisingly, gives an amazing performance as the main lead. He really carries the film, some scenes were very emotional due to his great performance. The rest of the cast does a great job as well, especially the Daughter played by Meckenzie Foy. The One character that I never expected to be great was the robot TARS. He also acted as the source of the humor in the movie, well executed, timely and grounded.\r\n\r\nInterstellar tackles a lot of themes, Survival, Humankind, Love, Time etc, out of which 'Time' had the biggest impact on me. With relativity being a big part in the film, the whole sequence about it just struck me very deeply and I found new respect for Time. I'm actually at a loss of words to describe it. Also, there is a lot science in it so it can be confusing for many and in Nolan's tradition, it also has twists and mind numbing ending, where the more you think about it, the more numbing it gets.\r\n\r\nThe visuals of this movie are breathtaking. Great cinematography and CGI. The depiction of wormholes and blackholes and other space entities were the best I have ever seen. They just suck you into the movie. Along with that, you get to listen to one of Hans Zimmer's best scores. The score not only felt personal, going perfectly with the movie, but also different from his recent works. There were times where combination of epic photography and soundtrack made the scenes timeless, like I was completely sucked into it and didn't had a clue about my surroundings. I didn't want those scenes to end.\r\n\r\nAlas, the movie was not perfect. My biggest gripe with it is that the pacing and editing was off at times. Some scenes dragged on while others were cut far shorter. The beautiful views of space could have definitely benefited from a few seconds longer onscreen time. Also, I wished there was more space exploration in it.\r\n\r\nWith all the remakes, rehashes, reboots and sequels we are getting in these times, it is great to see original gems like these. This movie is definitely one of this year's best, one of Nolan's best work and one of the best movie I have seen in recent years.\r\n\r\n9.5/10", "created_at": "2016-10-19T20:49:49.259Z"}, {"movie_id": 157336, "review_id": "58a46707c3a3686cc200458c", "author_rating": 10.0, "review_text": "This was my most anticipated film of 2014, and I was not disappointed. \r\n\r\nThe story was slightly difficult to follow on the first watch, but that was to be expected in a film dealing with complicated fields such as astrophysics and time dilation. Many didn't find its overall message - that love is the most powerful force in the universe which transcends space and time - to be very appealing, but I thought it was an interesting take on special relativity and how two people can be bound by a common feeling, even when they're in different parts of the universe at different times. I also thought the acting was believable, for the most part, and I didn't think anyone was miscast. I enjoyed the surprise appearance from a certain famous actor about halfway through.\r\n\r\nBut what really blew me away were the visuals and the soundtrack. I believe it was Quentin Tarantino who once said movies and music go hand in hand; that a moving image complimented by the right piece of music can create art. Well, the visuals in this film, which took my breath away, and the score, which perfectly captured the 'feel' of the cosmos and all its wonder, proved him right. I think this was Hans Zimmer's best work yet, and although I'm not Christopher Nolan's biggest fan, I will continue to follow his work if he can pull off more movies like this. \r\n\r\nMy only regret was not seeing this film in IMAX.\r\n\r\n10/10", "created_at": "2017-02-15T14:34:47.716Z"}, {"movie_id": 157336, "review_id": "5a3beb430e0a264cbc23212a", "author_rating": 4.0, "review_text": "That this movie, at the time of writing this, holds an 8.8 rating at IMDb is simply beyond my understanding. Needless to say I did not really like this movie. The story is not very good, the science is ludicrous and the visuals not all that impressive. Maybe the latter would be better in a big theater (I watched this on my home cinema system which has a relatively large screen by European standards) but I am not really sure about that either.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nThe movie starts of with the usual “I told you so” wet dream of the green fanatics on a dying Earth so it is off to a depressing start right away. That is an overused concept today as far as I am concerned. Then they pour it on with a school official claiming that he Apollo missions and moon landings never happened. What the f…? If they wanted to depress the audience right from the start they succeeded, at least with this audience.\r\n\r\nThe story proceeds with our heroes finding these gravity waves in the sand and by a huge stretch of imagination decrypts them to mean coordinates which leads them to the secret NASA base. Once there Cooper is told that he is their best choice of pilot for a “save the human race” mission through a wormhole. Yeah, right! This guy was former NASA. His whereabouts could hardly been unknown to them. If he was their best choice why would they entrust a mission to save the human race to someone else until he stumbled onto their door? Typical Hollywood nonsense!\r\n\r\nThe movie is full of this kind of rubbish. Romilly wastes 23 years of his life doing pretty much nothing except deciding not to go into the sleep capsule. The supposedly highly trained and vetted professor that they do find turns out to be a psychopath as well as and idiot almost blowing up the ship when trying to proceed with a docking that all the systems tells him have not succeeded. Then they proceed to dock with the main ship and stop its spin as well as bring it out of orbit around a planet with the shuttles engines. That is one hell of a powerful shuttle not to mention the strength of the docking mechanism! This just goes on. When someone is not doing something illogical or stupid (or both) they sit around talking, philosophizing and dragging the movie forward at snails pace. 169 minutes is way too much for this movie.\r\n\r\nThe movie ends up in one big time travel mess (okay they do not travel in time, just sends messages through time but still…) during a bunch of psychedelic scenes while traveling through the back hole. Science? Not so much. And what about this totally ludicrous massively illogical and inefficient robot design?\r\n\r\nThe one good thing I can say about this movie is that the performance of most of the actors, especially Matthew McConaughey, are quite good. For the rest, not my cup of tea.", "created_at": "2017-12-21T17:11:31.469Z"}, {"movie_id": 157336, "review_id": "5bdb3eb7c3a3680785012584", "author_rating": null, "review_text": "Again hit produced by christopher nolan after batman.\r\nStoryline is great and also the science theory is perfectly showcased.", "created_at": "2018-11-01T17:58:15.939Z"}, {"movie_id": 157336, "review_id": "5e25efed5294e70015637fe2", "author_rating": null, "review_text": "This might contain spoilers!\r\n---\r\nInterstellar is my favorite movie. I'm really into space and everything about it, so this movie was my cup of tea. \r\nThe soundtrack is the best of the movie. It points out flow of time, which is the most discussed issue in the movie. Special effects are breathtaking. Even with some small mistakes, it is pretty accurate and expectable. There is some visually pleasing cinematography too, including Saturn, the curvature of spacetime or majestic black hole, which is really satisfying. Some scenes are loud and thrilling, but some moments are so quiet, that you actually think, you are in space!\r\nThe movie is long but gripping. The plot, although it's complicated, is told easily and understandably. But the end of the movie is difficult to understand, since it contains time loop and time travel at the same time, but if you listen carefully, you will get it. I watched the movie 7 times and I still enjoy it!", "created_at": "2020-01-20T18:22:37.679Z"}, {"movie_id": 157336, "review_id": "5e2f2a6898f1f1000ffd19cc", "author_rating": 9.0, "review_text": "\"Do not go gentle into that good night; Old age should burn and rave at close of day. Rage, rage against the dying of the light\".\r\n\r\nThe story is about a team of explorers undertakes the most important mission in human history; traveling beyond this galaxy to discover whether mankind has a future among the stars.\r\n\r\nChristopher Nolan once said that 2001: A Space Odyssey was his all time favorite film and how he wanted to do a small tribute to he's next film. And then comes a movie called \"Interstellar\" that will put a smile on Kubrick face if he was alive today, because Interstellar is one of the best movie of 2014 and the best movie experience I've had at the cinema.\r\n\r\nI saw this movie in IMAX and all through out this film I felt like I was in space floating around with Mconaughey and Anne Hathaway. I had that feeling that I was going deep into space just like are main character's, going deep into space just like the viewing auditions and me.\r\n\r\nThe visual effect's in this movie are some of the most stunning, beautiful and Jaw dropping effect's I've seen since 2001: A Space Odyssey. The performances were brilliant, The cinematography was breathtaking and hard to look away. The directing by Christopher Nolan and let me get this out there, this man is a true director; he knows cinema and knows how to interested people into seeing he's films and I'm still shocked that he hasn't won an Oscar yet.\r\n\r\nNow most people or critics have said that last third of this movie ruined the movie for them, but I actually like the ending to the movie. It's new for Nolan because he always ends on a deep and cold note, but this movie didn't and I didn't mind it.\r\n\r\nMy only nick pick with the movie is some of the character's in this movie wasn't all that interesting. Matthew McConaughey, Anne Hathaway and Jessica Chastain are the only character's that to me were interesting and I cared for them, but the rest of the character's I didn't really care for.\r\n\r\nOverall Interstellar is a mind-blowing movie with fantastic visual's, interesting story line and the movie will keep you interested till the end.", "created_at": "2020-01-27T18:22:32.008Z"}, {"movie_id": 157336, "review_id": "6180ea233e2ec8008d18ddfb", "author_rating": 9.0, "review_text": "I will not add another in depth review to the several I see here on this movie. Nor will I try to evaluate the accuracy of the science behind the plot. Apparently a physicist was involved who had veto power if the script wandered out of the realm of what is at least theoretically true or possible.\r\n\r\nBut I have never let inaccuracies get in the way of enjoying science fiction movies anyway, as long as the movie is entertaining and otherwise doesn’t insult my intelligence. In the movie Monsters, for example, I read that giant the aliens looking like octopuses could not have walked upright. Fair enough, but it is entertainment, not a documentary.\r\n\r\nSo the human story of Interstellar held my attention in spite of the length of the film, and despite the elaborate special effects, that story drove the movie and my appreciation of it. I have always liked good time travel movies as well, and theories of space and time come into play in Interstellar as well.\r\n\r\nOh, and I say it is entertainment rather than a documentary, but it is not light entertainment. If you want to give this movie a fair chance, give it your full attention. It is not Mars Attacks, where you can watch it while distracted by life and still pick up on  plot details.", "created_at": "2021-11-02T07:34:59.885Z"}, {"movie_id": 157336, "review_id": "618687c91fd36f008fb1f8cb", "author_rating": 10.0, "review_text": "I've got to say I have been wanting to watch this film for a while now and well it's 2021 and it's a Saturday morning and damn, safe to say this is one of the best films I have ever watched in my life. loved everything about It. The creativity and intelligence put into this film is just mind-blowing considering the fact it is a 2014 film. This clearly shows that mankind will one day achieve the most unexpected and unthought discoveries.\r\nLove and respect to the director Christopher Nolan you are a legend.", "created_at": "2021-11-06T13:48:57.037Z"}, {"movie_id": 157336, "review_id": "62b809457352050c23f46af1", "author_rating": 9.0, "review_text": "It opens my mind after I watched this movie. I have watched it twice to figure out everything on the movie. Basically, this is the movie talking about earth is not a good place to stay anymore. People have to go to space to find another homeland. It reminds me that we will be like them if we didn't care much on environment", "created_at": "2022-06-26T07:22:45.679Z"}, {"movie_id": 157336, "review_id": "62e3844dc8a5ac005fb6633c", "author_rating": 7.0, "review_text": "As humanity faces an existential crisis, farmer \"Cooper\" (Matthew McConaughey) and his family are fighting a losing battle against an environment determined to destroy what is left of their corn crop. Mystery arrives after a sand storm leaves some magnetic clues to a secret location inhabited by NASA scientists led by \"Brand\" (Sir Michael Caine) who manage to convince former pilot \"Coop\" to join a mission to go into space and, using a recently detected wormhole that he believes may have been deliberately sent to help mankind rescue itself, set off to find another home for us all. Leaving a seriously narked daughter behind, he accepts the mission and together with the daughter of \"Brand\" (Anne Hathaway) their perilous trek begins. This is a more solid sci-fi adventure from Christopher Nolan. Though it features doses of his usual time bending scenarios, for the most part it is an exciting action film with mishaps a-plenty as their mission sees danger at just about every junction. There is a decent chemistry between Hathaway and McConaughey allowing the characters to develop with some depth that helps to draw us into to their efforts. The visual effects are superb, it has TARS - a rather clunkily designed robot that proves a whizz when running and rescuing, and the ending has something of the Escher drawing to it. The narrative can be thought provoking offering quite an interesting series of choices, especially when Matt Damon (\"Mann\") joins the story and begins to challenge their approach to just what \"humanity\" might actually be! A host of celebrated co-stars prop it up well. John Lithgow is effective as the patriarch of the family and Casey Affleck and Wes Bentley help diffuse the intensity of the principal relationship as the space-bound menace gradually accumulates. It's all but three hours long, and there is no denying that it hits a barren spell at times during the middle hour, but for my money this is a Nolan film that does not over-complicate itself and is as good a science fiction thriller as I've seen in many a year.", "created_at": "2022-07-29T06:55:09.512Z"}, {"movie_id": 157336, "review_id": "64c15eb12f1be0010c81e134", "author_rating": null, "review_text": "This mind-bending sci-fi masterpiece took me on an unforgettable journey through space and time. From its breathtaking visuals to the captivating performances, the film had me hooked from start to finish. I couldn't help but be inspired by its thought-provoking themes about love, sacrifice, and the boundless nature of human exploration. \"Interstellar\" truly left me in awe and is an absolute must-watch for any movie enthusiast.", "created_at": "2023-07-26T17:58:09.794Z"}, {"movie_id": 157336, "review_id": "5463856c0e0a267815002598", "author_rating": 9.0, "review_text": "Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the story. Especially Matt Damon's was the crucial one.\r\n\r\nRemember the movie 'Contact', a lovely movie, which was ruined by its fictional ending. Something like that happened in this film as well. The story was initiated with a realistic approach with actual scientific contents as per the present understanding about the universe. But the end was let me down with the layered contents that kind of impossible to agree with it. As a cinematic theme it worked, yeah, a good solution for this wonderfully written story. We know that the time can't run backwards, so that's the trouble.\r\n\r\nAnyway, this movie defines in a new way, I mean scientifically the existence of ghost. It was not a horror movie, but I liked supernatural force that merged with this science fiction theme. That explains and gives vast ideas to expand our physics beyond something and somewhere yet to reach. Hats off to the director, because he was not thinking of making money here. His idea was to implement what the humans are understood so far about the cosmos. And he very nicely transformed those into the silver screen with the blend of human emotions. In my opinion, this will replace '2001: A Space Odyssey' for sometime till another one make this way.\r\n\r\nI could have not asked a better space travel drama than this, especially when I heard Nolan doing a science-fiction I believed he gonna rock it. He was so true to the science and the human feelings in this film. If you had seen enough movies before like this one, you can recall your memories like the Tom Hanks parts from 'Cloud Atlas'. But still independently stands strong and falls in a never seen before category.\r\n\r\n‘‘Maybe we've spent too long\r\ntrying to figure all this out with theory.’’\r\n\r\nThe end scene leaves a hint of a possible sequel. I would be happy if that happen in a near future, but definitely that would be a completely different cinema as per how this one ended. I know his fans want that to happen and so am I.\r\n\r\nThe visuals were not that great, but simply very good. To see those in digital 3D would have given us a different experience, sadly Nolan was not in favor of that technology. Hoping this movie would get as many as the Oscars nod. Especially not getting into the best motion picture shortlist would be a shame. Like I said I'm no one fan, I just love watching everyone's every movie. I would have went to see it again if it was converted into digital 3D, since I'm modern tech geek when it comes to the films.\r\n\r\nIt will become a talk of the week, perhaps month all over the world, so don't leave behind when your friends talk about it. What I gonna say is it is a must see asap if you are a movie fanatic like me otherwise Nolan movies does not need anyone's recommendation because his movies usually sell itself like the hot samosa.", "created_at": "2014-11-12T16:06:04.927Z"}, {"movie_id": 157336, "review_id": "55f43b7dc3a3686d03003292", "author_rating": 9.5, "review_text": "People seem to think that if you enjoy a Christopher Nolan movie, you are a fanboy and the film couldn't really be that good. That is not true. He has never made a bad movie, Insomnia is probably his worst and it is still an excellent movie. \r\nInterstellar is up there in his top 3, with The Dark Knight being number 1 and Inception in number 2. I don't think he will ever make a better movie than The Dark Knight, it is without a doubt a masterpiece of cinema in my opinion. It can be enjoyed on so many levels.\r\nI remember seeing Interstellar in the movie theater and being on the edge of my seat the whole time. It was breathtaking but the end left me confused so i walked out disappointed. \r\nSince then i have watched it many times but it only took a second viewing to realize what a great ending it is and here is why. How many people discuss the end, was the wormhole open or closed for him to make it to Brand, what happens next, is there a sequel. I discuss this with people who hate the movie and the debate will still last a good 30 minutes if not more without getting heated. It is a wonderful story told through the eyes of a genius film maker who deserves more than he receives, an oscar would be nice start.\r\nI read hat his next movie is to be released in July 2017, I can't wait to find out everything about it like i have since he began.\r\nIf you're unsure about Christopher Nolan, watch his career from the beginning starting with Doodlebug.", "created_at": "2015-09-12T14:49:33.669Z"}, {"movie_id": 157336, "review_id": "5634aee792514129fe009d2c", "author_rating": 7.0, "review_text": "Another grandiloquent movie from Christoper Nolan.\r\n\r\nThe cast is good, and McConaughey performs a role made for himself. The photography is very nice but the movie commits all the same mistakes than previous Nolan's movies. I think mistakes but it may be that they are the points Nolan fans enjoy the most ...\r\n\r\n* The story makes you believe it is a realy deeply thought plot but, in the end, it has so basic mistakes and stupidities that make it nonsensical.\r\n* There is a general ambience of every moment being epic; deep, solemn and smart dialogues but, at some point our highly trained engineer and pilot behaves really stupidly.\r\n* To keep the mentioned constant feeling of being in an epic moment, Nolan uses a thumping and insistent soundtrack. As it is not a moment, but a 3h movie, it is really tiresome.\r\n\r\nAll in all, the movie is OK but you can only think this is a great movie if you are a real Nolan fan.", "created_at": "2015-10-31T12:07:03.650Z"}, {"movie_id": 157336, "review_id": "5807dc6dc3a3680f2d00319f", "author_rating": 10.0, "review_text": "\"Man kind was born on earth, it was never meant to die here.\"\r\n\r\nIT has been two days since I watched it and I still can't get it out of my head. I can safely say that it has been a long LONG time since a movie had this much effect on me after watching it. And the only thing I can think of now is to somehow Re-Watch it again.\r\n\r\nThis movie was surprisingly different from Christopher Nolan's recent works because they had been great cinematic entertainment pieces catered to a wider audience with a blockbuster approach, this certainly didn't felt like that and hence the polarizing response it got. It is an ambitious project that is not meant to merely entertain, walk into it knowing that. I'll say this though, If it works for you, you'll be in heaven.\r\n\r\nThe premise of the movie is that Earth is no longer capable of supporting humans on it, we must find a new home to avoid extinction. This scenario is told from a very personal perspective and not from a Global scale like some sort of apocalyptic catastrophe disaster film. At the core of the movie is the Father-Daughter relationship. The movie takes its sweet time to develop it too.\r\n\r\nMathew McConaughey, not surprisingly, gives an amazing performance as the main lead. He really carries the film, some scenes were very emotional due to his great performance. The rest of the cast does a great job as well, especially the Daughter played by Meckenzie Foy. The One character that I never expected to be great was the robot TARS. He also acted as the source of the humor in the movie, well executed, timely and grounded.\r\n\r\nInterstellar tackles a lot of themes, Survival, Humankind, Love, Time etc, out of which 'Time' had the biggest impact on me. With relativity being a big part in the film, the whole sequence about it just struck me very deeply and I found new respect for Time. I'm actually at a loss of words to describe it. Also, there is a lot science in it so it can be confusing for many and in Nolan's tradition, it also has twists and mind numbing ending, where the more you think about it, the more numbing it gets.\r\n\r\nThe visuals of this movie are breathtaking. Great cinematography and CGI. The depiction of wormholes and blackholes and other space entities were the best I have ever seen. They just suck you into the movie. Along with that, you get to listen to one of Hans Zimmer's best scores. The score not only felt personal, going perfectly with the movie, but also different from his recent works. There were times where combination of epic photography and soundtrack made the scenes timeless, like I was completely sucked into it and didn't had a clue about my surroundings. I didn't want those scenes to end.\r\n\r\nAlas, the movie was not perfect. My biggest gripe with it is that the pacing and editing was off at times. Some scenes dragged on while others were cut far shorter. The beautiful views of space could have definitely benefited from a few seconds longer onscreen time. Also, I wished there was more space exploration in it.\r\n\r\nWith all the remakes, rehashes, reboots and sequels we are getting in these times, it is great to see original gems like these. This movie is definitely one of this year's best, one of Nolan's best work and one of the best movie I have seen in recent years.\r\n\r\n9.5/10", "created_at": "2016-10-19T20:49:49.259Z"}, {"movie_id": 157336, "review_id": "58a46707c3a3686cc200458c", "author_rating": 10.0, "review_text": "This was my most anticipated film of 2014, and I was not disappointed. \r\n\r\nThe story was slightly difficult to follow on the first watch, but that was to be expected in a film dealing with complicated fields such as astrophysics and time dilation. Many didn't find its overall message - that love is the most powerful force in the universe which transcends space and time - to be very appealing, but I thought it was an interesting take on special relativity and how two people can be bound by a common feeling, even when they're in different parts of the universe at different times. I also thought the acting was believable, for the most part, and I didn't think anyone was miscast. I enjoyed the surprise appearance from a certain famous actor about halfway through.\r\n\r\nBut what really blew me away were the visuals and the soundtrack. I believe it was Quentin Tarantino who once said movies and music go hand in hand; that a moving image complimented by the right piece of music can create art. Well, the visuals in this film, which took my breath away, and the score, which perfectly captured the 'feel' of the cosmos and all its wonder, proved him right. I think this was Hans Zimmer's best work yet, and although I'm not Christopher Nolan's biggest fan, I will continue to follow his work if he can pull off more movies like this. \r\n\r\nMy only regret was not seeing this film in IMAX.\r\n\r\n10/10", "created_at": "2017-02-15T14:34:47.716Z"}, {"movie_id": 157336, "review_id": "5a3beb430e0a264cbc23212a", "author_rating": 4.0, "review_text": "That this movie, at the time of writing this, holds an 8.8 rating at IMDb is simply beyond my understanding. Needless to say I did not really like this movie. The story is not very good, the science is ludicrous and the visuals not all that impressive. Maybe the latter would be better in a big theater (I watched this on my home cinema system which has a relatively large screen by European standards) but I am not really sure about that either.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nThe movie starts of with the usual “I told you so” wet dream of the green fanatics on a dying Earth so it is off to a depressing start right away. That is an overused concept today as far as I am concerned. Then they pour it on with a school official claiming that he Apollo missions and moon landings never happened. What the f…? If they wanted to depress the audience right from the start they succeeded, at least with this audience.\r\n\r\nThe story proceeds with our heroes finding these gravity waves in the sand and by a huge stretch of imagination decrypts them to mean coordinates which leads them to the secret NASA base. Once there Cooper is told that he is their best choice of pilot for a “save the human race” mission through a wormhole. Yeah, right! This guy was former NASA. His whereabouts could hardly been unknown to them. If he was their best choice why would they entrust a mission to save the human race to someone else until he stumbled onto their door? Typical Hollywood nonsense!\r\n\r\nThe movie is full of this kind of rubbish. Romilly wastes 23 years of his life doing pretty much nothing except deciding not to go into the sleep capsule. The supposedly highly trained and vetted professor that they do find turns out to be a psychopath as well as and idiot almost blowing up the ship when trying to proceed with a docking that all the systems tells him have not succeeded. Then they proceed to dock with the main ship and stop its spin as well as bring it out of orbit around a planet with the shuttles engines. That is one hell of a powerful shuttle not to mention the strength of the docking mechanism! This just goes on. When someone is not doing something illogical or stupid (or both) they sit around talking, philosophizing and dragging the movie forward at snails pace. 169 minutes is way too much for this movie.\r\n\r\nThe movie ends up in one big time travel mess (okay they do not travel in time, just sends messages through time but still…) during a bunch of psychedelic scenes while traveling through the back hole. Science? Not so much. And what about this totally ludicrous massively illogical and inefficient robot design?\r\n\r\nThe one good thing I can say about this movie is that the performance of most of the actors, especially Matthew McConaughey, are quite good. For the rest, not my cup of tea.", "created_at": "2017-12-21T17:11:31.469Z"}, {"movie_id": 157336, "review_id": "5bdb3eb7c3a3680785012584", "author_rating": null, "review_text": "Again hit produced by christopher nolan after batman.\r\nStoryline is great and also the science theory is perfectly showcased.", "created_at": "2018-11-01T17:58:15.939Z"}, {"movie_id": 157336, "review_id": "5e25efed5294e70015637fe2", "author_rating": null, "review_text": "This might contain spoilers!\r\n---\r\nInterstellar is my favorite movie. I'm really into space and everything about it, so this movie was my cup of tea. \r\nThe soundtrack is the best of the movie. It points out flow of time, which is the most discussed issue in the movie. Special effects are breathtaking. Even with some small mistakes, it is pretty accurate and expectable. There is some visually pleasing cinematography too, including Saturn, the curvature of spacetime or majestic black hole, which is really satisfying. Some scenes are loud and thrilling, but some moments are so quiet, that you actually think, you are in space!\r\nThe movie is long but gripping. The plot, although it's complicated, is told easily and understandably. But the end of the movie is difficult to understand, since it contains time loop and time travel at the same time, but if you listen carefully, you will get it. I watched the movie 7 times and I still enjoy it!", "created_at": "2020-01-20T18:22:37.679Z"}, {"movie_id": 157336, "review_id": "5e2f2a6898f1f1000ffd19cc", "author_rating": 9.0, "review_text": "\"Do not go gentle into that good night; Old age should burn and rave at close of day. Rage, rage against the dying of the light\".\r\n\r\nThe story is about a team of explorers undertakes the most important mission in human history; traveling beyond this galaxy to discover whether mankind has a future among the stars.\r\n\r\nChristopher Nolan once said that 2001: A Space Odyssey was his all time favorite film and how he wanted to do a small tribute to he's next film. And then comes a movie called \"Interstellar\" that will put a smile on Kubrick face if he was alive today, because Interstellar is one of the best movie of 2014 and the best movie experience I've had at the cinema.\r\n\r\nI saw this movie in IMAX and all through out this film I felt like I was in space floating around with Mconaughey and Anne Hathaway. I had that feeling that I was going deep into space just like are main character's, going deep into space just like the viewing auditions and me.\r\n\r\nThe visual effect's in this movie are some of the most stunning, beautiful and Jaw dropping effect's I've seen since 2001: A Space Odyssey. The performances were brilliant, The cinematography was breathtaking and hard to look away. The directing by Christopher Nolan and let me get this out there, this man is a true director; he knows cinema and knows how to interested people into seeing he's films and I'm still shocked that he hasn't won an Oscar yet.\r\n\r\nNow most people or critics have said that last third of this movie ruined the movie for them, but I actually like the ending to the movie. It's new for Nolan because he always ends on a deep and cold note, but this movie didn't and I didn't mind it.\r\n\r\nMy only nick pick with the movie is some of the character's in this movie wasn't all that interesting. Matthew McConaughey, Anne Hathaway and Jessica Chastain are the only character's that to me were interesting and I cared for them, but the rest of the character's I didn't really care for.\r\n\r\nOverall Interstellar is a mind-blowing movie with fantastic visual's, interesting story line and the movie will keep you interested till the end.", "created_at": "2020-01-27T18:22:32.008Z"}, {"movie_id": 157336, "review_id": "6180ea233e2ec8008d18ddfb", "author_rating": 9.0, "review_text": "I will not add another in depth review to the several I see here on this movie. Nor will I try to evaluate the accuracy of the science behind the plot. Apparently a physicist was involved who had veto power if the script wandered out of the realm of what is at least theoretically true or possible.\r\n\r\nBut I have never let inaccuracies get in the way of enjoying science fiction movies anyway, as long as the movie is entertaining and otherwise doesn’t insult my intelligence. In the movie Monsters, for example, I read that giant the aliens looking like octopuses could not have walked upright. Fair enough, but it is entertainment, not a documentary.\r\n\r\nSo the human story of Interstellar held my attention in spite of the length of the film, and despite the elaborate special effects, that story drove the movie and my appreciation of it. I have always liked good time travel movies as well, and theories of space and time come into play in Interstellar as well.\r\n\r\nOh, and I say it is entertainment rather than a documentary, but it is not light entertainment. If you want to give this movie a fair chance, give it your full attention. It is not Mars Attacks, where you can watch it while distracted by life and still pick up on  plot details.", "created_at": "2021-11-02T07:34:59.885Z"}, {"movie_id": 157336, "review_id": "618687c91fd36f008fb1f8cb", "author_rating": 10.0, "review_text": "I've got to say I have been wanting to watch this film for a while now and well it's 2021 and it's a Saturday morning and damn, safe to say this is one of the best films I have ever watched in my life. loved everything about It. The creativity and intelligence put into this film is just mind-blowing considering the fact it is a 2014 film. This clearly shows that mankind will one day achieve the most unexpected and unthought discoveries.\r\nLove and respect to the director Christopher Nolan you are a legend.", "created_at": "2021-11-06T13:48:57.037Z"}, {"movie_id": 157336, "review_id": "62b809457352050c23f46af1", "author_rating": 9.0, "review_text": "It opens my mind after I watched this movie. I have watched it twice to figure out everything on the movie. Basically, this is the movie talking about earth is not a good place to stay anymore. People have to go to space to find another homeland. It reminds me that we will be like them if we didn't care much on environment", "created_at": "2022-06-26T07:22:45.679Z"}, {"movie_id": 157336, "review_id": "62e3844dc8a5ac005fb6633c", "author_rating": 7.0, "review_text": "As humanity faces an existential crisis, farmer \"Cooper\" (Matthew McConaughey) and his family are fighting a losing battle against an environment determined to destroy what is left of their corn crop. Mystery arrives after a sand storm leaves some magnetic clues to a secret location inhabited by NASA scientists led by \"Brand\" (Sir Michael Caine) who manage to convince former pilot \"Coop\" to join a mission to go into space and, using a recently detected wormhole that he believes may have been deliberately sent to help mankind rescue itself, set off to find another home for us all. Leaving a seriously narked daughter behind, he accepts the mission and together with the daughter of \"Brand\" (Anne Hathaway) their perilous trek begins. This is a more solid sci-fi adventure from Christopher Nolan. Though it features doses of his usual time bending scenarios, for the most part it is an exciting action film with mishaps a-plenty as their mission sees danger at just about every junction. There is a decent chemistry between Hathaway and McConaughey allowing the characters to develop with some depth that helps to draw us into to their efforts. The visual effects are superb, it has TARS - a rather clunkily designed robot that proves a whizz when running and rescuing, and the ending has something of the Escher drawing to it. The narrative can be thought provoking offering quite an interesting series of choices, especially when Matt Damon (\"Mann\") joins the story and begins to challenge their approach to just what \"humanity\" might actually be! A host of celebrated co-stars prop it up well. John Lithgow is effective as the patriarch of the family and Casey Affleck and Wes Bentley help diffuse the intensity of the principal relationship as the space-bound menace gradually accumulates. It's all but three hours long, and there is no denying that it hits a barren spell at times during the middle hour, but for my money this is a Nolan film that does not over-complicate itself and is as good a science fiction thriller as I've seen in many a year.", "created_at": "2022-07-29T06:55:09.512Z"}, {"movie_id": 157336, "review_id": "64c15eb12f1be0010c81e134", "author_rating": null, "review_text": "This mind-bending sci-fi masterpiece took me on an unforgettable journey through space and time. From its breathtaking visuals to the captivating performances, the film had me hooked from start to finish. I couldn't help but be inspired by its thought-provoking themes about love, sacrifice, and the boundless nature of human exploration. \"Interstellar\" truly left me in awe and is an absolute must-watch for any movie enthusiast.", "created_at": "2023-07-26T17:58:09.794Z"}, {"movie_id": 157336, "review_id": "5463856c0e0a267815002598", "author_rating": 9.0, "review_text": "Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the story. Especially Matt Damon's was the crucial one.\r\n\r\nRemember the movie 'Contact', a lovely movie, which was ruined by its fictional ending. Something like that happened in this film as well. The story was initiated with a realistic approach with actual scientific contents as per the present understanding about the universe. But the end was let me down with the layered contents that kind of impossible to agree with it. As a cinematic theme it worked, yeah, a good solution for this wonderfully written story. We know that the time can't run backwards, so that's the trouble.\r\n\r\nAnyway, this movie defines in a new way, I mean scientifically the existence of ghost. It was not a horror movie, but I liked supernatural force that merged with this science fiction theme. That explains and gives vast ideas to expand our physics beyond something and somewhere yet to reach. Hats off to the director, because he was not thinking of making money here. His idea was to implement what the humans are understood so far about the cosmos. And he very nicely transformed those into the silver screen with the blend of human emotions. In my opinion, this will replace '2001: A Space Odyssey' for sometime till another one make this way.\r\n\r\nI could have not asked a better space travel drama than this, especially when I heard Nolan doing a science-fiction I believed he gonna rock it. He was so true to the science and the human feelings in this film. If you had seen enough movies before like this one, you can recall your memories like the Tom Hanks parts from 'Cloud Atlas'. But still independently stands strong and falls in a never seen before category.\r\n\r\n‘‘Maybe we've spent too long\r\ntrying to figure all this out with theory.’’\r\n\r\nThe end scene leaves a hint of a possible sequel. I would be happy if that happen in a near future, but definitely that would be a completely different cinema as per how this one ended. I know his fans want that to happen and so am I.\r\n\r\nThe visuals were not that great, but simply very good. To see those in digital 3D would have given us a different experience, sadly Nolan was not in favor of that technology. Hoping this movie would get as many as the Oscars nod. Especially not getting into the best motion picture shortlist would be a shame. Like I said I'm no one fan, I just love watching everyone's every movie. I would have went to see it again if it was converted into digital 3D, since I'm modern tech geek when it comes to the films.\r\n\r\nIt will become a talk of the week, perhaps month all over the world, so don't leave behind when your friends talk about it. What I gonna say is it is a must see asap if you are a movie fanatic like me otherwise Nolan movies does not need anyone's recommendation because his movies usually sell itself like the hot samosa.", "created_at": "2014-11-12T16:06:04.927Z"}, {"movie_id": 157336, "review_id": "55f43b7dc3a3686d03003292", "author_rating": 9.5, "review_text": "People seem to think that if you enjoy a Christopher Nolan movie, you are a fanboy and the film couldn't really be that good. That is not true. He has never made a bad movie, Insomnia is probably his worst and it is still an excellent movie. \r\nInterstellar is up there in his top 3, with The Dark Knight being number 1 and Inception in number 2. I don't think he will ever make a better movie than The Dark Knight, it is without a doubt a masterpiece of cinema in my opinion. It can be enjoyed on so many levels.\r\nI remember seeing Interstellar in the movie theater and being on the edge of my seat the whole time. It was breathtaking but the end left me confused so i walked out disappointed. \r\nSince then i have watched it many times but it only took a second viewing to realize what a great ending it is and here is why. How many people discuss the end, was the wormhole open or closed for him to make it to Brand, what happens next, is there a sequel. I discuss this with people who hate the movie and the debate will still last a good 30 minutes if not more without getting heated. It is a wonderful story told through the eyes of a genius film maker who deserves more than he receives, an oscar would be nice start.\r\nI read hat his next movie is to be released in July 2017, I can't wait to find out everything about it like i have since he began.\r\nIf you're unsure about Christopher Nolan, watch his career from the beginning starting with Doodlebug.", "created_at": "2015-09-12T14:49:33.669Z"}, {"movie_id": 157336, "review_id": "5634aee792514129fe009d2c", "author_rating": 7.0, "review_text": "Another grandiloquent movie from Christoper Nolan.\r\n\r\nThe cast is good, and McConaughey performs a role made for himself. The photography is very nice but the movie commits all the same mistakes than previous Nolan's movies. I think mistakes but it may be that they are the points Nolan fans enjoy the most ...\r\n\r\n* The story makes you believe it is a realy deeply thought plot but, in the end, it has so basic mistakes and stupidities that make it nonsensical.\r\n* There is a general ambience of every moment being epic; deep, solemn and smart dialogues but, at some point our highly trained engineer and pilot behaves really stupidly.\r\n* To keep the mentioned constant feeling of being in an epic moment, Nolan uses a thumping and insistent soundtrack. As it is not a moment, but a 3h movie, it is really tiresome.\r\n\r\nAll in all, the movie is OK but you can only think this is a great movie if you are a real Nolan fan.", "created_at": "2015-10-31T12:07:03.650Z"}, {"movie_id": 157336, "review_id": "5807dc6dc3a3680f2d00319f", "author_rating": 10.0, "review_text": "\"Man kind was born on earth, it was never meant to die here.\"\r\n\r\nIT has been two days since I watched it and I still can't get it out of my head. I can safely say that it has been a long LONG time since a movie had this much effect on me after watching it. And the only thing I can think of now is to somehow Re-Watch it again.\r\n\r\nThis movie was surprisingly different from Christopher Nolan's recent works because they had been great cinematic entertainment pieces catered to a wider audience with a blockbuster approach, this certainly didn't felt like that and hence the polarizing response it got. It is an ambitious project that is not meant to merely entertain, walk into it knowing that. I'll say this though, If it works for you, you'll be in heaven.\r\n\r\nThe premise of the movie is that Earth is no longer capable of supporting humans on it, we must find a new home to avoid extinction. This scenario is told from a very personal perspective and not from a Global scale like some sort of apocalyptic catastrophe disaster film. At the core of the movie is the Father-Daughter relationship. The movie takes its sweet time to develop it too.\r\n\r\nMathew McConaughey, not surprisingly, gives an amazing performance as the main lead. He really carries the film, some scenes were very emotional due to his great performance. The rest of the cast does a great job as well, especially the Daughter played by Meckenzie Foy. The One character that I never expected to be great was the robot TARS. He also acted as the source of the humor in the movie, well executed, timely and grounded.\r\n\r\nInterstellar tackles a lot of themes, Survival, Humankind, Love, Time etc, out of which 'Time' had the biggest impact on me. With relativity being a big part in the film, the whole sequence about it just struck me very deeply and I found new respect for Time. I'm actually at a loss of words to describe it. Also, there is a lot science in it so it can be confusing for many and in Nolan's tradition, it also has twists and mind numbing ending, where the more you think about it, the more numbing it gets.\r\n\r\nThe visuals of this movie are breathtaking. Great cinematography and CGI. The depiction of wormholes and blackholes and other space entities were the best I have ever seen. They just suck you into the movie. Along with that, you get to listen to one of Hans Zimmer's best scores. The score not only felt personal, going perfectly with the movie, but also different from his recent works. There were times where combination of epic photography and soundtrack made the scenes timeless, like I was completely sucked into it and didn't had a clue about my surroundings. I didn't want those scenes to end.\r\n\r\nAlas, the movie was not perfect. My biggest gripe with it is that the pacing and editing was off at times. Some scenes dragged on while others were cut far shorter. The beautiful views of space could have definitely benefited from a few seconds longer onscreen time. Also, I wished there was more space exploration in it.\r\n\r\nWith all the remakes, rehashes, reboots and sequels we are getting in these times, it is great to see original gems like these. This movie is definitely one of this year's best, one of Nolan's best work and one of the best movie I have seen in recent years.\r\n\r\n9.5/10", "created_at": "2016-10-19T20:49:49.259Z"}, {"movie_id": 157336, "review_id": "58a46707c3a3686cc200458c", "author_rating": 10.0, "review_text": "This was my most anticipated film of 2014, and I was not disappointed. \r\n\r\nThe story was slightly difficult to follow on the first watch, but that was to be expected in a film dealing with complicated fields such as astrophysics and time dilation. Many didn't find its overall message - that love is the most powerful force in the universe which transcends space and time - to be very appealing, but I thought it was an interesting take on special relativity and how two people can be bound by a common feeling, even when they're in different parts of the universe at different times. I also thought the acting was believable, for the most part, and I didn't think anyone was miscast. I enjoyed the surprise appearance from a certain famous actor about halfway through.\r\n\r\nBut what really blew me away were the visuals and the soundtrack. I believe it was Quentin Tarantino who once said movies and music go hand in hand; that a moving image complimented by the right piece of music can create art. Well, the visuals in this film, which took my breath away, and the score, which perfectly captured the 'feel' of the cosmos and all its wonder, proved him right. I think this was Hans Zimmer's best work yet, and although I'm not Christopher Nolan's biggest fan, I will continue to follow his work if he can pull off more movies like this. \r\n\r\nMy only regret was not seeing this film in IMAX.\r\n\r\n10/10", "created_at": "2017-02-15T14:34:47.716Z"}, {"movie_id": 157336, "review_id": "5a3beb430e0a264cbc23212a", "author_rating": 4.0, "review_text": "That this movie, at the time of writing this, holds an 8.8 rating at IMDb is simply beyond my understanding. Needless to say I did not really like this movie. The story is not very good, the science is ludicrous and the visuals not all that impressive. Maybe the latter would be better in a big theater (I watched this on my home cinema system which has a relatively large screen by European standards) but I am not really sure about that either.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nThe movie starts of with the usual “I told you so” wet dream of the green fanatics on a dying Earth so it is off to a depressing start right away. That is an overused concept today as far as I am concerned. Then they pour it on with a school official claiming that he Apollo missions and moon landings never happened. What the f…? If they wanted to depress the audience right from the start they succeeded, at least with this audience.\r\n\r\nThe story proceeds with our heroes finding these gravity waves in the sand and by a huge stretch of imagination decrypts them to mean coordinates which leads them to the secret NASA base. Once there Cooper is told that he is their best choice of pilot for a “save the human race” mission through a wormhole. Yeah, right! This guy was former NASA. His whereabouts could hardly been unknown to them. If he was their best choice why would they entrust a mission to save the human race to someone else until he stumbled onto their door? Typical Hollywood nonsense!\r\n\r\nThe movie is full of this kind of rubbish. Romilly wastes 23 years of his life doing pretty much nothing except deciding not to go into the sleep capsule. The supposedly highly trained and vetted professor that they do find turns out to be a psychopath as well as and idiot almost blowing up the ship when trying to proceed with a docking that all the systems tells him have not succeeded. Then they proceed to dock with the main ship and stop its spin as well as bring it out of orbit around a planet with the shuttles engines. That is one hell of a powerful shuttle not to mention the strength of the docking mechanism! This just goes on. When someone is not doing something illogical or stupid (or both) they sit around talking, philosophizing and dragging the movie forward at snails pace. 169 minutes is way too much for this movie.\r\n\r\nThe movie ends up in one big time travel mess (okay they do not travel in time, just sends messages through time but still…) during a bunch of psychedelic scenes while traveling through the back hole. Science? Not so much. And what about this totally ludicrous massively illogical and inefficient robot design?\r\n\r\nThe one good thing I can say about this movie is that the performance of most of the actors, especially Matthew McConaughey, are quite good. For the rest, not my cup of tea.", "created_at": "2017-12-21T17:11:31.469Z"}, {"movie_id": 157336, "review_id": "5bdb3eb7c3a3680785012584", "author_rating": null, "review_text": "Again hit produced by christopher nolan after batman.\r\nStoryline is great and also the science theory is perfectly showcased.", "created_at": "2018-11-01T17:58:15.939Z"}, {"movie_id": 157336, "review_id": "5e25efed5294e70015637fe2", "author_rating": null, "review_text": "This might contain spoilers!\r\n---\r\nInterstellar is my favorite movie. I'm really into space and everything about it, so this movie was my cup of tea. \r\nThe soundtrack is the best of the movie. It points out flow of time, which is the most discussed issue in the movie. Special effects are breathtaking. Even with some small mistakes, it is pretty accurate and expectable. There is some visually pleasing cinematography too, including Saturn, the curvature of spacetime or majestic black hole, which is really satisfying. Some scenes are loud and thrilling, but some moments are so quiet, that you actually think, you are in space!\r\nThe movie is long but gripping. The plot, although it's complicated, is told easily and understandably. But the end of the movie is difficult to understand, since it contains time loop and time travel at the same time, but if you listen carefully, you will get it. I watched the movie 7 times and I still enjoy it!", "created_at": "2020-01-20T18:22:37.679Z"}, {"movie_id": 157336, "review_id": "5e2f2a6898f1f1000ffd19cc", "author_rating": 9.0, "review_text": "\"Do not go gentle into that good night; Old age should burn and rave at close of day. Rage, rage against the dying of the light\".\r\n\r\nThe story is about a team of explorers undertakes the most important mission in human history; traveling beyond this galaxy to discover whether mankind has a future among the stars.\r\n\r\nChristopher Nolan once said that 2001: A Space Odyssey was his all time favorite film and how he wanted to do a small tribute to he's next film. And then comes a movie called \"Interstellar\" that will put a smile on Kubrick face if he was alive today, because Interstellar is one of the best movie of 2014 and the best movie experience I've had at the cinema.\r\n\r\nI saw this movie in IMAX and all through out this film I felt like I was in space floating around with Mconaughey and Anne Hathaway. I had that feeling that I was going deep into space just like are main character's, going deep into space just like the viewing auditions and me.\r\n\r\nThe visual effect's in this movie are some of the most stunning, beautiful and Jaw dropping effect's I've seen since 2001: A Space Odyssey. The performances were brilliant, The cinematography was breathtaking and hard to look away. The directing by Christopher Nolan and let me get this out there, this man is a true director; he knows cinema and knows how to interested people into seeing he's films and I'm still shocked that he hasn't won an Oscar yet.\r\n\r\nNow most people or critics have said that last third of this movie ruined the movie for them, but I actually like the ending to the movie. It's new for Nolan because he always ends on a deep and cold note, but this movie didn't and I didn't mind it.\r\n\r\nMy only nick pick with the movie is some of the character's in this movie wasn't all that interesting. Matthew McConaughey, Anne Hathaway and Jessica Chastain are the only character's that to me were interesting and I cared for them, but the rest of the character's I didn't really care for.\r\n\r\nOverall Interstellar is a mind-blowing movie with fantastic visual's, interesting story line and the movie will keep you interested till the end.", "created_at": "2020-01-27T18:22:32.008Z"}, {"movie_id": 157336, "review_id": "6180ea233e2ec8008d18ddfb", "author_rating": 9.0, "review_text": "I will not add another in depth review to the several I see here on this movie. Nor will I try to evaluate the accuracy of the science behind the plot. Apparently a physicist was involved who had veto power if the script wandered out of the realm of what is at least theoretically true or possible.\r\n\r\nBut I have never let inaccuracies get in the way of enjoying science fiction movies anyway, as long as the movie is entertaining and otherwise doesn’t insult my intelligence. In the movie Monsters, for example, I read that giant the aliens looking like octopuses could not have walked upright. Fair enough, but it is entertainment, not a documentary.\r\n\r\nSo the human story of Interstellar held my attention in spite of the length of the film, and despite the elaborate special effects, that story drove the movie and my appreciation of it. I have always liked good time travel movies as well, and theories of space and time come into play in Interstellar as well.\r\n\r\nOh, and I say it is entertainment rather than a documentary, but it is not light entertainment. If you want to give this movie a fair chance, give it your full attention. It is not Mars Attacks, where you can watch it while distracted by life and still pick up on  plot details.", "created_at": "2021-11-02T07:34:59.885Z"}, {"movie_id": 157336, "review_id": "618687c91fd36f008fb1f8cb", "author_rating": 10.0, "review_text": "I've got to say I have been wanting to watch this film for a while now and well it's 2021 and it's a Saturday morning and damn, safe to say this is one of the best films I have ever watched in my life. loved everything about It. The creativity and intelligence put into this film is just mind-blowing considering the fact it is a 2014 film. This clearly shows that mankind will one day achieve the most unexpected and unthought discoveries.\r\nLove and respect to the director Christopher Nolan you are a legend.", "created_at": "2021-11-06T13:48:57.037Z"}, {"movie_id": 157336, "review_id": "62b809457352050c23f46af1", "author_rating": 9.0, "review_text": "It opens my mind after I watched this movie. I have watched it twice to figure out everything on the movie. Basically, this is the movie talking about earth is not a good place to stay anymore. People have to go to space to find another homeland. It reminds me that we will be like them if we didn't care much on environment", "created_at": "2022-06-26T07:22:45.679Z"}, {"movie_id": 157336, "review_id": "62e3844dc8a5ac005fb6633c", "author_rating": 7.0, "review_text": "As humanity faces an existential crisis, farmer \"Cooper\" (Matthew McConaughey) and his family are fighting a losing battle against an environment determined to destroy what is left of their corn crop. Mystery arrives after a sand storm leaves some magnetic clues to a secret location inhabited by NASA scientists led by \"Brand\" (Sir Michael Caine) who manage to convince former pilot \"Coop\" to join a mission to go into space and, using a recently detected wormhole that he believes may have been deliberately sent to help mankind rescue itself, set off to find another home for us all. Leaving a seriously narked daughter behind, he accepts the mission and together with the daughter of \"Brand\" (Anne Hathaway) their perilous trek begins. This is a more solid sci-fi adventure from Christopher Nolan. Though it features doses of his usual time bending scenarios, for the most part it is an exciting action film with mishaps a-plenty as their mission sees danger at just about every junction. There is a decent chemistry between Hathaway and McConaughey allowing the characters to develop with some depth that helps to draw us into to their efforts. The visual effects are superb, it has TARS - a rather clunkily designed robot that proves a whizz when running and rescuing, and the ending has something of the Escher drawing to it. The narrative can be thought provoking offering quite an interesting series of choices, especially when Matt Damon (\"Mann\") joins the story and begins to challenge their approach to just what \"humanity\" might actually be! A host of celebrated co-stars prop it up well. John Lithgow is effective as the patriarch of the family and Casey Affleck and Wes Bentley help diffuse the intensity of the principal relationship as the space-bound menace gradually accumulates. It's all but three hours long, and there is no denying that it hits a barren spell at times during the middle hour, but for my money this is a Nolan film that does not over-complicate itself and is as good a science fiction thriller as I've seen in many a year.", "created_at": "2022-07-29T06:55:09.512Z"}, {"movie_id": 157336, "review_id": "64c15eb12f1be0010c81e134", "author_rating": null, "review_text": "This mind-bending sci-fi masterpiece took me on an unforgettable journey through space and time. From its breathtaking visuals to the captivating performances, the film had me hooked from start to finish. I couldn't help but be inspired by its thought-provoking themes about love, sacrifice, and the boundless nature of human exploration. \"Interstellar\" truly left me in awe and is an absolute must-watch for any movie enthusiast.", "created_at": "2023-07-26T17:58:09.794Z"}, {"movie_id": 157336, "review_id": "5463856c0e0a267815002598", "author_rating": 9.0, "review_text": "Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the story. Especially Matt Damon's was the crucial one.\r\n\r\nRemember the movie 'Contact', a lovely movie, which was ruined by its fictional ending. Something like that happened in this film as well. The story was initiated with a realistic approach with actual scientific contents as per the present understanding about the universe. But the end was let me down with the layered contents that kind of impossible to agree with it. As a cinematic theme it worked, yeah, a good solution for this wonderfully written story. We know that the time can't run backwards, so that's the trouble.\r\n\r\nAnyway, this movie defines in a new way, I mean scientifically the existence of ghost. It was not a horror movie, but I liked supernatural force that merged with this science fiction theme. That explains and gives vast ideas to expand our physics beyond something and somewhere yet to reach. Hats off to the director, because he was not thinking of making money here. His idea was to implement what the humans are understood so far about the cosmos. And he very nicely transformed those into the silver screen with the blend of human emotions. In my opinion, this will replace '2001: A Space Odyssey' for sometime till another one make this way.\r\n\r\nI could have not asked a better space travel drama than this, especially when I heard Nolan doing a science-fiction I believed he gonna rock it. He was so true to the science and the human feelings in this film. If you had seen enough movies before like this one, you can recall your memories like the Tom Hanks parts from 'Cloud Atlas'. But still independently stands strong and falls in a never seen before category.\r\n\r\n‘‘Maybe we've spent too long\r\ntrying to figure all this out with theory.’’\r\n\r\nThe end scene leaves a hint of a possible sequel. I would be happy if that happen in a near future, but definitely that would be a completely different cinema as per how this one ended. I know his fans want that to happen and so am I.\r\n\r\nThe visuals were not that great, but simply very good. To see those in digital 3D would have given us a different experience, sadly Nolan was not in favor of that technology. Hoping this movie would get as many as the Oscars nod. Especially not getting into the best motion picture shortlist would be a shame. Like I said I'm no one fan, I just love watching everyone's every movie. I would have went to see it again if it was converted into digital 3D, since I'm modern tech geek when it comes to the films.\r\n\r\nIt will become a talk of the week, perhaps month all over the world, so don't leave behind when your friends talk about it. What I gonna say is it is a must see asap if you are a movie fanatic like me otherwise Nolan movies does not need anyone's recommendation because his movies usually sell itself like the hot samosa.", "created_at": "2014-11-12T16:06:04.927Z"}, {"movie_id": 157336, "review_id": "55f43b7dc3a3686d03003292", "author_rating": 9.5, "review_text": "People seem to think that if you enjoy a Christopher Nolan movie, you are a fanboy and the film couldn't really be that good. That is not true. He has never made a bad movie, Insomnia is probably his worst and it is still an excellent movie. \r\nInterstellar is up there in his top 3, with The Dark Knight being number 1 and Inception in number 2. I don't think he will ever make a better movie than The Dark Knight, it is without a doubt a masterpiece of cinema in my opinion. It can be enjoyed on so many levels.\r\nI remember seeing Interstellar in the movie theater and being on the edge of my seat the whole time. It was breathtaking but the end left me confused so i walked out disappointed. \r\nSince then i have watched it many times but it only took a second viewing to realize what a great ending it is and here is why. How many people discuss the end, was the wormhole open or closed for him to make it to Brand, what happens next, is there a sequel. I discuss this with people who hate the movie and the debate will still last a good 30 minutes if not more without getting heated. It is a wonderful story told through the eyes of a genius film maker who deserves more than he receives, an oscar would be nice start.\r\nI read hat his next movie is to be released in July 2017, I can't wait to find out everything about it like i have since he began.\r\nIf you're unsure about Christopher Nolan, watch his career from the beginning starting with Doodlebug.", "created_at": "2015-09-12T14:49:33.669Z"}, {"movie_id": 157336, "review_id": "5634aee792514129fe009d2c", "author_rating": 7.0, "review_text": "Another grandiloquent movie from Christoper Nolan.\r\n\r\nThe cast is good, and McConaughey performs a role made for himself. The photography is very nice but the movie commits all the same mistakes than previous Nolan's movies. I think mistakes but it may be that they are the points Nolan fans enjoy the most ...\r\n\r\n* The story makes you believe it is a realy deeply thought plot but, in the end, it has so basic mistakes and stupidities that make it nonsensical.\r\n* There is a general ambience of every moment being epic; deep, solemn and smart dialogues but, at some point our highly trained engineer and pilot behaves really stupidly.\r\n* To keep the mentioned constant feeling of being in an epic moment, Nolan uses a thumping and insistent soundtrack. As it is not a moment, but a 3h movie, it is really tiresome.\r\n\r\nAll in all, the movie is OK but you can only think this is a great movie if you are a real Nolan fan.", "created_at": "2015-10-31T12:07:03.650Z"}, {"movie_id": 157336, "review_id": "5807dc6dc3a3680f2d00319f", "author_rating": 10.0, "review_text": "\"Man kind was born on earth, it was never meant to die here.\"\r\n\r\nIT has been two days since I watched it and I still can't get it out of my head. I can safely say that it has been a long LONG time since a movie had this much effect on me after watching it. And the only thing I can think of now is to somehow Re-Watch it again.\r\n\r\nThis movie was surprisingly different from Christopher Nolan's recent works because they had been great cinematic entertainment pieces catered to a wider audience with a blockbuster approach, this certainly didn't felt like that and hence the polarizing response it got. It is an ambitious project that is not meant to merely entertain, walk into it knowing that. I'll say this though, If it works for you, you'll be in heaven.\r\n\r\nThe premise of the movie is that Earth is no longer capable of supporting humans on it, we must find a new home to avoid extinction. This scenario is told from a very personal perspective and not from a Global scale like some sort of apocalyptic catastrophe disaster film. At the core of the movie is the Father-Daughter relationship. The movie takes its sweet time to develop it too.\r\n\r\nMathew McConaughey, not surprisingly, gives an amazing performance as the main lead. He really carries the film, some scenes were very emotional due to his great performance. The rest of the cast does a great job as well, especially the Daughter played by Meckenzie Foy. The One character that I never expected to be great was the robot TARS. He also acted as the source of the humor in the movie, well executed, timely and grounded.\r\n\r\nInterstellar tackles a lot of themes, Survival, Humankind, Love, Time etc, out of which 'Time' had the biggest impact on me. With relativity being a big part in the film, the whole sequence about it just struck me very deeply and I found new respect for Time. I'm actually at a loss of words to describe it. Also, there is a lot science in it so it can be confusing for many and in Nolan's tradition, it also has twists and mind numbing ending, where the more you think about it, the more numbing it gets.\r\n\r\nThe visuals of this movie are breathtaking. Great cinematography and CGI. The depiction of wormholes and blackholes and other space entities were the best I have ever seen. They just suck you into the movie. Along with that, you get to listen to one of Hans Zimmer's best scores. The score not only felt personal, going perfectly with the movie, but also different from his recent works. There were times where combination of epic photography and soundtrack made the scenes timeless, like I was completely sucked into it and didn't had a clue about my surroundings. I didn't want those scenes to end.\r\n\r\nAlas, the movie was not perfect. My biggest gripe with it is that the pacing and editing was off at times. Some scenes dragged on while others were cut far shorter. The beautiful views of space could have definitely benefited from a few seconds longer onscreen time. Also, I wished there was more space exploration in it.\r\n\r\nWith all the remakes, rehashes, reboots and sequels we are getting in these times, it is great to see original gems like these. This movie is definitely one of this year's best, one of Nolan's best work and one of the best movie I have seen in recent years.\r\n\r\n9.5/10", "created_at": "2016-10-19T20:49:49.259Z"}, {"movie_id": 157336, "review_id": "58a46707c3a3686cc200458c", "author_rating": 10.0, "review_text": "This was my most anticipated film of 2014, and I was not disappointed. \r\n\r\nThe story was slightly difficult to follow on the first watch, but that was to be expected in a film dealing with complicated fields such as astrophysics and time dilation. Many didn't find its overall message - that love is the most powerful force in the universe which transcends space and time - to be very appealing, but I thought it was an interesting take on special relativity and how two people can be bound by a common feeling, even when they're in different parts of the universe at different times. I also thought the acting was believable, for the most part, and I didn't think anyone was miscast. I enjoyed the surprise appearance from a certain famous actor about halfway through.\r\n\r\nBut what really blew me away were the visuals and the soundtrack. I believe it was Quentin Tarantino who once said movies and music go hand in hand; that a moving image complimented by the right piece of music can create art. Well, the visuals in this film, which took my breath away, and the score, which perfectly captured the 'feel' of the cosmos and all its wonder, proved him right. I think this was Hans Zimmer's best work yet, and although I'm not Christopher Nolan's biggest fan, I will continue to follow his work if he can pull off more movies like this. \r\n\r\nMy only regret was not seeing this film in IMAX.\r\n\r\n10/10", "created_at": "2017-02-15T14:34:47.716Z"}, {"movie_id": 157336, "review_id": "5a3beb430e0a264cbc23212a", "author_rating": 4.0, "review_text": "That this movie, at the time of writing this, holds an 8.8 rating at IMDb is simply beyond my understanding. Needless to say I did not really like this movie. The story is not very good, the science is ludicrous and the visuals not all that impressive. Maybe the latter would be better in a big theater (I watched this on my home cinema system which has a relatively large screen by European standards) but I am not really sure about that either.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nThe movie starts of with the usual “I told you so” wet dream of the green fanatics on a dying Earth so it is off to a depressing start right away. That is an overused concept today as far as I am concerned. Then they pour it on with a school official claiming that he Apollo missions and moon landings never happened. What the f…? If they wanted to depress the audience right from the start they succeeded, at least with this audience.\r\n\r\nThe story proceeds with our heroes finding these gravity waves in the sand and by a huge stretch of imagination decrypts them to mean coordinates which leads them to the secret NASA base. Once there Cooper is told that he is their best choice of pilot for a “save the human race” mission through a wormhole. Yeah, right! This guy was former NASA. His whereabouts could hardly been unknown to them. If he was their best choice why would they entrust a mission to save the human race to someone else until he stumbled onto their door? Typical Hollywood nonsense!\r\n\r\nThe movie is full of this kind of rubbish. Romilly wastes 23 years of his life doing pretty much nothing except deciding not to go into the sleep capsule. The supposedly highly trained and vetted professor that they do find turns out to be a psychopath as well as and idiot almost blowing up the ship when trying to proceed with a docking that all the systems tells him have not succeeded. Then they proceed to dock with the main ship and stop its spin as well as bring it out of orbit around a planet with the shuttles engines. That is one hell of a powerful shuttle not to mention the strength of the docking mechanism! This just goes on. When someone is not doing something illogical or stupid (or both) they sit around talking, philosophizing and dragging the movie forward at snails pace. 169 minutes is way too much for this movie.\r\n\r\nThe movie ends up in one big time travel mess (okay they do not travel in time, just sends messages through time but still…) during a bunch of psychedelic scenes while traveling through the back hole. Science? Not so much. And what about this totally ludicrous massively illogical and inefficient robot design?\r\n\r\nThe one good thing I can say about this movie is that the performance of most of the actors, especially Matthew McConaughey, are quite good. For the rest, not my cup of tea.", "created_at": "2017-12-21T17:11:31.469Z"}, {"movie_id": 157336, "review_id": "5bdb3eb7c3a3680785012584", "author_rating": null, "review_text": "Again hit produced by christopher nolan after batman.\r\nStoryline is great and also the science theory is perfectly showcased.", "created_at": "2018-11-01T17:58:15.939Z"}, {"movie_id": 157336, "review_id": "5e25efed5294e70015637fe2", "author_rating": null, "review_text": "This might contain spoilers!\r\n---\r\nInterstellar is my favorite movie. I'm really into space and everything about it, so this movie was my cup of tea. \r\nThe soundtrack is the best of the movie. It points out flow of time, which is the most discussed issue in the movie. Special effects are breathtaking. Even with some small mistakes, it is pretty accurate and expectable. There is some visually pleasing cinematography too, including Saturn, the curvature of spacetime or majestic black hole, which is really satisfying. Some scenes are loud and thrilling, but some moments are so quiet, that you actually think, you are in space!\r\nThe movie is long but gripping. The plot, although it's complicated, is told easily and understandably. But the end of the movie is difficult to understand, since it contains time loop and time travel at the same time, but if you listen carefully, you will get it. I watched the movie 7 times and I still enjoy it!", "created_at": "2020-01-20T18:22:37.679Z"}, {"movie_id": 157336, "review_id": "5e2f2a6898f1f1000ffd19cc", "author_rating": 9.0, "review_text": "\"Do not go gentle into that good night; Old age should burn and rave at close of day. Rage, rage against the dying of the light\".\r\n\r\nThe story is about a team of explorers undertakes the most important mission in human history; traveling beyond this galaxy to discover whether mankind has a future among the stars.\r\n\r\nChristopher Nolan once said that 2001: A Space Odyssey was his all time favorite film and how he wanted to do a small tribute to he's next film. And then comes a movie called \"Interstellar\" that will put a smile on Kubrick face if he was alive today, because Interstellar is one of the best movie of 2014 and the best movie experience I've had at the cinema.\r\n\r\nI saw this movie in IMAX and all through out this film I felt like I was in space floating around with Mconaughey and Anne Hathaway. I had that feeling that I was going deep into space just like are main character's, going deep into space just like the viewing auditions and me.\r\n\r\nThe visual effect's in this movie are some of the most stunning, beautiful and Jaw dropping effect's I've seen since 2001: A Space Odyssey. The performances were brilliant, The cinematography was breathtaking and hard to look away. The directing by Christopher Nolan and let me get this out there, this man is a true director; he knows cinema and knows how to interested people into seeing he's films and I'm still shocked that he hasn't won an Oscar yet.\r\n\r\nNow most people or critics have said that last third of this movie ruined the movie for them, but I actually like the ending to the movie. It's new for Nolan because he always ends on a deep and cold note, but this movie didn't and I didn't mind it.\r\n\r\nMy only nick pick with the movie is some of the character's in this movie wasn't all that interesting. Matthew McConaughey, Anne Hathaway and Jessica Chastain are the only character's that to me were interesting and I cared for them, but the rest of the character's I didn't really care for.\r\n\r\nOverall Interstellar is a mind-blowing movie with fantastic visual's, interesting story line and the movie will keep you interested till the end.", "created_at": "2020-01-27T18:22:32.008Z"}, {"movie_id": 157336, "review_id": "6180ea233e2ec8008d18ddfb", "author_rating": 9.0, "review_text": "I will not add another in depth review to the several I see here on this movie. Nor will I try to evaluate the accuracy of the science behind the plot. Apparently a physicist was involved who had veto power if the script wandered out of the realm of what is at least theoretically true or possible.\r\n\r\nBut I have never let inaccuracies get in the way of enjoying science fiction movies anyway, as long as the movie is entertaining and otherwise doesn’t insult my intelligence. In the movie Monsters, for example, I read that giant the aliens looking like octopuses could not have walked upright. Fair enough, but it is entertainment, not a documentary.\r\n\r\nSo the human story of Interstellar held my attention in spite of the length of the film, and despite the elaborate special effects, that story drove the movie and my appreciation of it. I have always liked good time travel movies as well, and theories of space and time come into play in Interstellar as well.\r\n\r\nOh, and I say it is entertainment rather than a documentary, but it is not light entertainment. If you want to give this movie a fair chance, give it your full attention. It is not Mars Attacks, where you can watch it while distracted by life and still pick up on  plot details.", "created_at": "2021-11-02T07:34:59.885Z"}, {"movie_id": 157336, "review_id": "618687c91fd36f008fb1f8cb", "author_rating": 10.0, "review_text": "I've got to say I have been wanting to watch this film for a while now and well it's 2021 and it's a Saturday morning and damn, safe to say this is one of the best films I have ever watched in my life. loved everything about It. The creativity and intelligence put into this film is just mind-blowing considering the fact it is a 2014 film. This clearly shows that mankind will one day achieve the most unexpected and unthought discoveries.\r\nLove and respect to the director Christopher Nolan you are a legend.", "created_at": "2021-11-06T13:48:57.037Z"}, {"movie_id": 157336, "review_id": "62b809457352050c23f46af1", "author_rating": 9.0, "review_text": "It opens my mind after I watched this movie. I have watched it twice to figure out everything on the movie. Basically, this is the movie talking about earth is not a good place to stay anymore. People have to go to space to find another homeland. It reminds me that we will be like them if we didn't care much on environment", "created_at": "2022-06-26T07:22:45.679Z"}, {"movie_id": 157336, "review_id": "62e3844dc8a5ac005fb6633c", "author_rating": 7.0, "review_text": "As humanity faces an existential crisis, farmer \"Cooper\" (Matthew McConaughey) and his family are fighting a losing battle against an environment determined to destroy what is left of their corn crop. Mystery arrives after a sand storm leaves some magnetic clues to a secret location inhabited by NASA scientists led by \"Brand\" (Sir Michael Caine) who manage to convince former pilot \"Coop\" to join a mission to go into space and, using a recently detected wormhole that he believes may have been deliberately sent to help mankind rescue itself, set off to find another home for us all. Leaving a seriously narked daughter behind, he accepts the mission and together with the daughter of \"Brand\" (Anne Hathaway) their perilous trek begins. This is a more solid sci-fi adventure from Christopher Nolan. Though it features doses of his usual time bending scenarios, for the most part it is an exciting action film with mishaps a-plenty as their mission sees danger at just about every junction. There is a decent chemistry between Hathaway and McConaughey allowing the characters to develop with some depth that helps to draw us into to their efforts. The visual effects are superb, it has TARS - a rather clunkily designed robot that proves a whizz when running and rescuing, and the ending has something of the Escher drawing to it. The narrative can be thought provoking offering quite an interesting series of choices, especially when Matt Damon (\"Mann\") joins the story and begins to challenge their approach to just what \"humanity\" might actually be! A host of celebrated co-stars prop it up well. John Lithgow is effective as the patriarch of the family and Casey Affleck and Wes Bentley help diffuse the intensity of the principal relationship as the space-bound menace gradually accumulates. It's all but three hours long, and there is no denying that it hits a barren spell at times during the middle hour, but for my money this is a Nolan film that does not over-complicate itself and is as good a science fiction thriller as I've seen in many a year.", "created_at": "2022-07-29T06:55:09.512Z"}, {"movie_id": 157336, "review_id": "64c15eb12f1be0010c81e134", "author_rating": null, "review_text": "This mind-bending sci-fi masterpiece took me on an unforgettable journey through space and time. From its breathtaking visuals to the captivating performances, the film had me hooked from start to finish. I couldn't help but be inspired by its thought-provoking themes about love, sacrifice, and the boundless nature of human exploration. \"Interstellar\" truly left me in awe and is an absolute must-watch for any movie enthusiast.", "created_at": "2023-07-26T17:58:09.794Z"}]