[{"movie_id": 106646, "review_id": "52e52fda760ee302c027bed9", "author_rating": 10.0, "review_text": "The Wolf of Wall Street is so addicting to watch, that even with it's 3 hour long run time, you wont be surprised if you end up watching it four days in a row. <br>\r\n     This is Scorsese letting loose and having fun, showing all of the debauchery (and man, is there a lot) in all of it's glory. There are orgies, sex, nudity, copious amounts of drug use, and it now holds the record for the most use of fuck in any film. <br>\r\n     Leonardo DiCaprio gives a towering and hilarious performance as Jordan Belfort. He throws himself into the role with free abandon, while also showing that he's aces when it comes to comic timing and physical comedy. If he doesn't win an Oscar this season I'll be quite upset, though Matt from Dallas Buyers Club rightfully deserves it as well. But this is a 3 hour long film, and Leo is in every single second of every single scene. He's ferocious, hilarious, out of his mind, and flat out brilliant.<br>\r\n     The supporting players are tops as well. I was somewhat baffled when Jonah Hill earned a nominee for Moneyball, but this time around he rightfully deserves this years nominations. With his pearly white teeth, charisma, while also throwing himself into the role with no fear, this is without a doubt his greatest work as an actor to date. The real find, however, is Margot Robbie. Strikingly beautiful, her character could have been one note, but she also hits the ball out of the court. Even Matthew Macconaughey steals the show with only one scene. <br>\r\n     Dangerously funny, superbly edited, and with a delicious, irreverent, savage bite. The Wolf of Wall Street is Scorsese at his wildest. And it goes without saying, that this is one of the best films of last year. Just stay away if you are in any way a prude or conservative. \r\n     Rated R- Graphic nudity, strong sexual content, drug use throughout, pervasive language, and some violence.", "created_at": "2014-01-26T15:55:06.337Z"}, {"movie_id": 106646, "review_id": "52ef658a19c295415b023d77", "author_rating": 6.0, "review_text": "An excessive movie in all possible senses with breath taking Margot Robbie and Jonah Hill which is not long in spite of its 3h length but which ends not knowing exactly which is the point of the story.", "created_at": "2014-02-03T09:46:50.645Z"}, {"movie_id": 106646, "review_id": "54b0210d925141746c000154", "author_rating": null, "review_text": "**Voracious Bull**\r\n\r\nEvery time I try to enjoy a Martin Scorcese movie post-1980 I ask myself what made _Raging Bull_ so great? Did Marty burn out after his Jake LaMotta bio, the same way Coppola did after _Apocalypse Now_? These were risky movies, driven by passion, bordering on madness. Did Marty and Francis lose their natural passion for making films because industry priorities dismissed 70's-style hyper-realism for sensational summer blockbusters and CGI spectacles? And why is Scorcese considered one of the greatest director when he really only made one truly superb movie?\r\n\r\nWhen I first saw _Raging Bull_ in 1980 I immediately knew I was watching something that transcended the typical cinematic experience. Genius was shimmering out of every perforated frame flickering on the screen. Paul, Marty, Bobby, Mike and Thelma created something that was completely absorbing. The style and substance was perfectly fueled by a flawless emotional narrative. Every element was orchestrated just right. The audience was spellbound. We were watching greatness. A rare and unique organic creation. I'm still waiting for Robert Redford to correct a travesty of justice and hand his Ocscar over to it's rightful owner. And I'm still waiting for Scorcese to match his own brilliance. But that's like expecting Tarantino to top _Pulp Fiction_. There's a better chance Orson Welles rises up from the dead to one up _Citizen Kane_. \r\n\r\nAfter _Raging Bull_, Scorcese has made a string of pictures ranging from not bad to pretty good. All well-made, thoughtful and meticulously crafted films, but nothing special; certainly nothing profound. Contrary to popular opinion, _Goodfellas_ is not a great movie. I was not swept away by the saga. I was annoyed rather by the fragmented non-stop soundtrack and incessant up-tempo style. Marty wasn't risking anything anymore. He seemed to be afraid of boring the audience. Perhaps he was trying to revive the 1940's never-let-up screwball-bouncing farcical Preston Sturges and co. comedies. But this is a mafia film. This should have been right up Marty's alley. It's been almost a quarter of a century since De Niro got his face busted in a boxing ring. Since the raw, robust and naive will-power of LaMotta's youth plunged into the pathetic, brutal, bone-headed stupidity of his later years. Similarly, Scorsese hasn't registered a knock-out punch since. Would his ensuing movies be considered great if someone else directed them? Would I have liked them all better if Raging Bull had never been made?\r\n\r\n_The Wolf of Wall Street_ is another exhausting affair. It tries too hard to excite and entertain us. It's afraid of slowing down, allowing us to ponder or examine the complexities of excessive greed, shameless wealth and unbridled capitalism. It desperately wants to arouse us. Like a neglected clown at a child's birthday trying to be loved and taken seriously while draining the life out of the party. Give Leo and Jonah an \"A\" for effort. They couldn't have tried harder if they broke out into song and dance every ten minutes. And they convincingly appeared to enjoy themselves freely indulging in coke, ludes and naked women every five minutes. It was nice of Leo to step back while Margot Robbie took her routine and obligatory, supporting-actress hissy fit. And you know a filmmaker has a lot of faith and confidence in his work when a superfluous narration track is added, to plug those terrifying noiseless gaps. Whatever happened to poignant, suspenseful, sure-footed, gripping, emotionally-arresting dramas that take you on a nervy, wild ride to a thoroughly gratifying climax? A truly great director from Kurosowa to, well, Scorcese-(circa 1979) would have plotted the rise and fall of a maniacal protagonist along deeper and more affecting lines even at the risk boring its audience for one minute.", "created_at": "2015-01-09T18:42:21.616Z"}, {"movie_id": 106646, "review_id": "604d8e4cd100b600697ae536", "author_rating": 9.0, "review_text": "I didn't care for the characters, but I damn did have a great time watching <em>'The Wolf of Wall Street'</em>. It's absolutely nuts, and I mean that in a positive way.\r\n\r\nLeonardo DiCaprio simply never puts an acting foot wrong, this is the sixth film I've seen of his and I love <em>(fwiw: all 9/10+)</em> them all. Phenomenal actor! He is outstanding here as Jordan Belfort, the guy this film is based upon. As noted, I didn't really ever care for Jordan but DiCaprio makes it impossible not to enjoy watching events throughout.\r\n\r\nJonah Hill (Donnie) comes in with a very good performance, the type of which I hadn't previously seen from him; closest being, in terms of quality, <em>'Moneyball'</em>. Margot Robbie, meanwhile, isn't easy to forget as Naomi. Though none of the following standout big, it's pleasant to see Jon Bernthal, Matthew McConaughey and Jon Favreau, among others, appear.\r\n\r\nThe almost three hour run time, aside from a couple of moments, goes by fairly quickly. A big reason for that is the sheer bonkers nature of the plot, which goes in so many different directions it's impressive. It doesn't, as I've already mentioned, breed likeability for the characters but I definitely had a fun time watching it all unfold. I guess it depends on what you, as a viewer, prefer. I got the desired amount of entertainment.", "created_at": "2021-03-14T04:17:16.451Z"}, {"movie_id": 106646, "review_id": "611677303a9937004588b23a", "author_rating": 8.0, "review_text": "When I'm Scorsese's age I just hope to still be able to chew my food and go to the bathroom unassisted. That he can still make some of the most cutting edge, visceral, and enjoyable films out there is stunning. \r\n\r\nIs this his best film? No. But, even a mediocre film for him is better than 99% of the movies being made. \r\n\r\nThe performances are super-fun, the pace is relentless, the visual flare is incredible, and the story is fascinating. Is there a discussion to be had about the immorality being glamorized by this film? Sure. That's the case for a lot of his films (and a lot of films in general). We could debate his intentions with the outcome and what the film is saying about our society all day but that's another discussion. Is the film a joy to watch? Yes! It definitely is.", "created_at": "2021-08-13T13:44:16.913Z"}, {"movie_id": 106646, "review_id": "62dfdd22e9da69149541bc9d", "author_rating": 9.0, "review_text": "An amazing bio pic of Jordan Belfort that has everything you'll ever want: comedy, drama, romance, heart and the list goes on. This movie was an absolute joy. The acting was superb in this movie all around. Leonardo DiCaprio gives one of his best performances of his career. Jonah Hill and Margo Robbie were fantastic! For a movie that was almost three hours, it flew by and was incredibly engaging. I can not believe it took me this long to see it.\r\n\r\n**Score:** _90%_\r\n**Verdict:** _Excellent_", "created_at": "2022-07-26T12:25:06.180Z"}]