[{"movie_id": 513310, "review_id": "604585df84f249004587508e", "author_rating": 5.0, "review_text": "At its core, the model is still the Phil Connors self-improvement plan. In trying to finally make it to tomorrow, will Roy become a better father, a better ex-husband, a better version of himself? 28 years ago, Murray and writer/director Harold Ramis wrung this ingenious conceit for everything it was worth. All a diverting riff like 'Boss Level' can do is throw a few sword fights and bazookas in with the recycled pleasures and hope they look like its own. It's inchoate, but mostly fun.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-boss-level-nostalgic-action-and-quirky-foes", "created_at": "2021-03-08T02:03:11.392Z"}, {"movie_id": 513310, "review_id": "610fc3e95c5cc8002a25aac0", "author_rating": 7.0, "review_text": "Didn’t really know what this movie was when I got it but I have to say that it was a quite fun action romp and although I am usually very much against time travel stories this one worked for me.\r\n\r\nAs the name implies the movie kind of plays out like a first person shooter game. Start, run and shoot, die, rinse, restart and repeat. I know, it sound rather boring but it actually works. There’s enough variation in each run to make it interesting and each iteration advances the story and adds another piece to the puzzle.\r\n\r\nObviously there is a lot of action in this movie and it is good and fun action. Luckily they didn’t try to go for some silly PG-13 or TV-PG rating. This is a mature audience movie and both the language and the action is for adults and not the whining easily offended variety of adults. Heads fly, people explode and bullet wholes appear in all kinds of places.\r\n\r\nAt the same time it is fun, over the top and sometimes quite comical action. The background voice from the main protagonist and his matter of fact but also “I’m tired of this bullshit” attitude is adding nicely to the fun-factor.\r\n\r\nThere is a story underneath all of this, believe it or not, and it’s actually not that bad. Sure there are holes in it large enough to drive a battleship through but it doesn’t really matter. The story is good enough to drive the movie and the action forward and the movie makes no pretense of having any form of science or such logic in it anyway. It’s kind of a over the top action version of Groundhog Day with first person shooter elements.\r\n\r\nFrank Grillo is doing a good job of being the bored, violent main protagonist and it was rather fun seeing Mel Gibson again even though he, unfortunately, was one of the bad guys. The rest of the actors, well they are more or less as forgettable as they are expendable (over and over again).\r\n\r\nIt is a fun movie clearly meant to entertain by showering the audience in outrageous (violent) action stunts and some snarky dialogue and it succeeds quite well in achieving this.", "created_at": "2021-08-08T11:45:45.752Z"}, {"movie_id": 513310, "review_id": "630acc05ca7ec6007bcd1366", "author_rating": 5.0, "review_text": "What simultaneously saves and sinks Boss Level is that co-writer/director Joe Carnahan handles the material as if it were a video game, so that the conventions of the time loop genre suddenly make perfect sense; for example, whenever the hero dies, he respawns at the previous checkpoint while retaining the knowledge gained from previous attempts (any gamer will tell you that sometimes the only way to beat a level is knowing beforehand what’s coming).\r\n\r\nThus, when Roy (Frank Grillo) needs a vehicle, he simply procures himself one à la Grand Theft Auto. And every time Guan-Yin (Selina Lo) kills him, she says her catchphrase “I am Guan-Yin, and Guan-Yin has done this”.\r\n\r\nShe repeats this phrase so much it’s infuriating, but that’s precisely the point – to recreate the experience of having a Boss kick your ass so bad (and taunt you mercilessly in the process) that you just have to keep coming back for more, relishing in advance the moment when you finally get the best of him/her.\r\n\r\nThe problem with this is that once Roy figures out where he has to go and what he has to do, and that he has unlimited opportunities to go there and do that, the film is drained of all sense of urgency, becoming as engaging as watching someone else play a video game for hours on end. Even the end of the world is no big deal when there is literally one every day; after all, Roy will always wake up in his bed and the world will always be there for him to save.\r\n\r\nGrillo’s cocky neanderthal schtick is an acquired taste, but considering that his character suffers what essentially is a Rasputinian Death in increments, it’s safe to say that Roy pays his dues. Moreover, Roy shares some genuinely emotional scenes with his preteen son – who happens to be Grillo’s real-life son as well. And then there’s Mel Gibson as the sinister and menacing main villain (Will Sasso, as his lackey, is also surprisingly effective). This is the second time in as many years, following Force of Nature, that Gibson’s presence alone is enough to elevate what would otherwise be little more than a collection of clichés.", "created_at": "2022-08-28T01:59:33.569Z"}, {"movie_id": 513310, "review_id": "6548eb386beaea00ac217c4e", "author_rating": 5.0, "review_text": "\"Live Die Repeat\" with less sense and more beheadings. The movie had us, lost us, had me, lost me... but I stuck it out till the end. The name of the Big Bad company is DYNOW Industries. If that makes you snort, you know what type of movie this is.\r\n\r\nI did break my \"No-Mel Gibson Movie\" streak. On the plus side, you get to watch Mel Gibson die more than once.\r\n\r\nMuch prefer the Joe Carnahan Frank Grillo film \"Cop Shop\" - see that instead.", "created_at": "2023-11-06T13:33:44.668Z"}]