[{"movie_id": 763285, "review_id": "624172c3c740d9005d761a8c", "author_rating": 5.0, "review_text": "So here's the gist. \"Will\" (Yahya Abdul-Mateen II) needs $231,000 urgently, so he taps up his brother \"Danny\" (Jake Gyllenhaal) who, as luck would have it, is on that very day about to hit a bank for $32m. All he has to do is drive and his worries are a thing of the past. They manage to relieve the bank of the cash ok, but horny young police officer \"Zach\" (Jackson White) becomes a fly in their ointment when he decides to ask one of the cashiers out on a date, and gets caught up in the now much more precarious raid. He gets shot, and as the ambulance is leaving to take him to hospital the two robbers jump on board as their ticket out of the now police-strewn crime scene. Luckily, onboard the ambulance, is feisty no-nonsense paramedic \"Cam\" (Eiza González) who now has to keep the critically ill officer alive whilst her two passengers try to evade the might of the LAPD with their loot. What now ensues is just ridiculous. This sixteen tonne truck manages to evade snipers, souped-up police cars, helicopters all whilst having a critically injured man in the back. It seems to have no issues running out of gas; and must have an axle and suspension system that wouldn't be out of place on a Boeing 747. Gung-go police captain \"Monroe\" (Garret Dillahunt) demonstrates adequately that the more resources you have, the cockier you become - and the less successful; and the introduction of FBI man \"Anson\" (Keir O'Donnell) a college pal of \"Danny\" who has to rush from a marriage guidance session with his husband to try and apprehend the fugitives just tops off this rather preposterous narrative. The production is very good; the use of drones and high speed photography does create an effective image as the ambulance continues to evade pursuit, but the dialogue is dreadful. Lots of repetitive expressions with hardly a smile to be had as the plot descends willingly into the absurd. Luckily, we get to come up for air for a moment or so thanks to Christoper Cross' \"Sailing\" but otherwise this is a relentless chase movie with it's root firmly placed in fantasy. The ending takes 2¼ to come, and when it does it is as inevitable as it is poor. I'm sorry, but this is nobody's finest work and being the only person at the screening I couldn't help but wonder if others knew better than me - and stayed at home!", "created_at": "2022-03-28T08:33:07.832Z"}, {"movie_id": 763285, "review_id": "625cb0e4bf09d100993544a3", "author_rating": 4.0, "review_text": "Buried deep within _Ambulance_’s loud, flashy action, sickening editing, overstimulated filming techniques, and a screenplay that seems like it was fished out of a port-a-potty is a somewhat thrilling film. Jake Gyllenhaal is a cashmere obsessed lunatic that you can’t help but love, but _Ambulance_ is a gaudy and sloppy excuse of an action film otherwise.\r\n\r\n**Full review:** boundingintocomics.com/2022/04/11/ambulance-review-action-at-its-dumbest-and-gaudiest/", "created_at": "2022-04-18T00:29:24.956Z"}, {"movie_id": 763285, "review_id": "6268798e5ab81a132e1d6132", "author_rating": 6.0, "review_text": "6 out of 10 for this waste of good actors. Garbage camera work, loud score, and anticlimactic ending that leaves the viewer just disappointed. Car chases and gun fights must have been directed by an action flick newbie, never even once is the cause and effect in the same frame. Looking at people shooting something off-screen and in the next scene seeing bullets hit another thing does nothing for me. Might as well read a book if I'm supposed to connect the dots myself. Similarly watching cars drive fast in close-ups or over hidden ramps is just boring. Dialogue wants to be clever so much and characters are overly colorful, not very believable on the whole. The movie is suspenseful though if nothing else and that is why my rating is relatively high.", "created_at": "2022-04-26T23:00:30.266Z"}, {"movie_id": 763285, "review_id": "62a4dcd5d5dbc20066a75faa", "author_rating": 4.0, "review_text": "I generally like Michael Bay movies, even when they go into stupid, inane territory. However, his latest, Ambulance is a 90-100 minute movie that is stretched to over two hours and got tedious pretty quickly, most notably the aerial/drone shots that did make me a tad nauseous. The writing also was pretty poor including the cringe \"comedic\" lines that didn't work, not to mention a few unnecessary scenes for the supporting characters. I guess on the plus side Jake Gyllenhaal can play psychotic pretty well and Yahya Abdul-Mateen II has his moments. I also liked how Bay/composer Lorne Balfe recycled one of the themes from 13 Hours at the end.\r\n\r\nAs a whole, this is not one I'll revisit. **1.75/5**", "created_at": "2022-06-11T18:20:05.670Z"}, {"movie_id": 763285, "review_id": "630019dd532acb007ed72482", "author_rating": 7.0, "review_text": "**If you want escapism action, you have come to the right place.**\r\n\r\nAmbulance is as Michael Bay as a movie could possibly be. There’s a total of maybe 10 minutes of story and plot development before jumping fully into all-out action. Who needs character development when you have a 2-hour car chase and shootout? Not me! It is a non-stop action romp with next-level camera work and stunt work. You should know what you’re getting if you watch a Michael Bay film, and this is everything you would expect at its very best. Peak Michael Bay action.", "created_at": "2022-08-19T23:16:45.764Z"}, {"movie_id": 763285, "review_id": "6303ba0b3009aa007a268397", "author_rating": 6.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Ambulance is one of the most frenetic, literally non-stop action flicks of Michael Bay's entire career - which might be shocking to state. The cast is exceptional - curiously, it's Eiza González who stands out the most - and their interactions are far more hilarious than I anticipated.\r\n\r\nChoppy editing and inconsistently shaky camera work can be extremely frustrating, especially outside of the action sequences, but on the other hand, these elements also contribute to the unstoppable energy of an authentic blockbuster.\r\n\r\nIs it absurdly ridiculous? Undoubtedly. As silly as can be expected. But entertaining nonetheless.\"\r\n\r\nRating: B-", "created_at": "2022-08-22T17:16:59.293Z"}, {"movie_id": 763285, "review_id": "631fa44b0d2f53007f5dbf5b", "author_rating": null, "review_text": "I laughed, I cried, and now I think I need a nap.\r\n\r\nMy second Bay movie. Jake Gyllenhaal, nitro dog, fantastic cinematography, great emotional core, etc. Excellent stuff.", "created_at": "2022-09-12T21:27:39.826Z"}, {"movie_id": 763285, "review_id": "6326d7f524f2ce00860980c8", "author_rating": 3.0, "review_text": "This is a Michael Bay movie. I could probably stop the review here because that says all about the movie. Lots of special effects and a mediocre story at best.\r\n\r\nThis Michael Bay movie is no different. The two stars I gave it is solely for the action and the special effects. The script is not even mediocre. It is rubbish.\r\n\r\nI think what grated on me the most is that there are two characters in the whole movie that are somewhat likable. The rest are either assholes or idiots. Mostly both.\r\n\r\nThe actions of almost everyone are just annoyingly stupid and illogical. The constant bickering and shouting is frustrating. This “criminal mastermind”, Danny Sharp, is alternating between being a psychopath and just an idiot. His idiot comment towards the end that they were not the bad guys, they were just trying to get home was so braindead it was unbelievable. The police force is not really any better.\r\n\r\nThe entire chase part is just so ridiculous most of the time and the constant shouting and arguing drags it down further. The idea of doing an operation, over the phone, during a high speed chase while taking 90 degree turns every two minutes or so is laughable.\r\n\r\nThen they had all this silly work up to where the baddies were going to assault the cops with their customized vehicles and the one time I expected Michael Bay to shine and even go a bit over the top it ended up being rather meh and mediocre.\r\n\r\nNormally I do not really care that much if the script is not top notch in these kind of movies as long as it is good enough to drive the action but this script was too ludicrous and devoid of intelligence even for me.", "created_at": "2022-09-18T08:33:57.595Z"}]