[{"movie_id": 10140, "review_id": "51ec288d19c29551e2117035", "author_rating": null, "review_text": "In the immortal words of Col. Kurtz, \"The horror...the horror.\" Marlon Brando wasn't speaking of this film, of course, but rather the horrors of the Vietnam War. The sentiment remains applicable.\r\n\r\nWhen I write reviews, I do try to give at least a modicum of context, be it a history of the film itself, predecessors to its place in cinema history, or my general feelings on the type of film. In this case, I've just referenced Francis Ford Coppola's classic take on Joseph Conrad's \"Heart of Darkness,\" Apocalypse Now. What does that have to do with Dawn Treader? Nothing, and I couldn't be happier. Why? Because it's distracted my mind with thoughts of a far, far better film. Allow me my few moments of happiness before I have to rifle through the dark filing cabinet of my mind to marshal my thoughts on this atrocity.\\\r\n\r\nWhat went so wrong here, you may ask? We'll start with the history of this franchise. I do not have the highest opinion of this series. We started out with the most famous of C. S. Lewis' Narnia cycle, The Lion, The Witch, and the Wardrobe. I don't know...perhaps if we hadn't been in the middle of such a fantasy film renaissance, I would have found it more palatable. Instead, coming on the heels of Peter Jackson's generation-defining Lord of the Rings trilogy, and the high class and quality of the Harry Potter franchise, that weak take on a book series that didn't thrill me as a child struck me as a cheap, childish appetizer compared to the magnificent feasts audiences had already been served, their stories facile, their acting (aside from a typically great Tilda Swinton) either poor or phoned-in (Paging Mr. Neeson, your paycheck is waiting for you). SHREK co-director Andrew Adamson was the helmer of both Wardrobe and Caspian, and I had hoped those film's failings were due perhaps to his inexperience as a director of live-action. The first film of course wore its Christian allegory on its sleeve (Lewis, for all his writings, never managed to find the definition of \"subtle\"), and it found favor with the churchgoing crowd, whose turnout afforded it a huge box office windfall. The second film was more of a straight actioner (in the vein of Star Wars Episode I, which is to say the supposed action was mired in a swamp of facile and achingly dull political machinations), and didn't find purchase with the same demographic, and box office returns were disappointingly low. Disney, who had financed the films, saw the writing on the wall, and dropped the series. That should have been the end of it.\r\n\r\nUntil 20th Century Fox stepped in. Now, let's remember: Fox doesn't have the best track record with adapting beloved fantasy series into films (a moment of silence for the tragedies that were The Dark is Rising and Eregon, please). Hiring Michael Apted as the director seemed to be bucking the trend of shoveling out crap. Apted isn't really known as an action, fantasy, or epic film director, but he showed promise with the last Pierce Brosnan/James Bond film, The World is Not Enough (I'll not blame him for Denise Richards'...nuclear physicist...sigh). Still, director in place, 20th Century Fox and Walden Media cobbled together another Narnia adventure, and the results were predictably terrible.\r\n\r\nHonestly, I wish I hadn't expected a poor film going in. Because this film not only met but exceeded my expectations of terrible, and it's not because I was pre-judging it. It's because it was simply that bad. The plot is nonsensical, randomly shunting characters from one loosely-connected vignette to the next, with hokey dialogue and dire predictions of eeeevil standing in for actual menace or intrigue. It's a shaggy dog road trip story, waterlogged on a boat, and I found myself half an hour in wishing desperately that the characters would all get scurvy and die.\r\n\r\nThe plot's so thinly-sketched that I may as well not even try to recount it here, but it has something to do with two of the kids from previous films being once again pulled into Narnia at absolute random, with no thematic or plot reason for any of the nonsense in the first place. Once there, our cast is rounded out with their exceptionally annoying cousin, and despite no one knowing quite what's going on, they stumble upon the titular character of the second film, Prince Caspian, and join him on his completely random quest to recover seven old friends of his long-dead father who disappeared for some reason, and no one knows why. So they fight an island made of evil. Good wins, evil is defeated, the end. Please, let it be the end.\r\n\r\nListen: I love fantasy. I love science fiction, I love horror, I love all of the outré genres, the fantastic, the unreal. It fascinates me, and I love wrapping myself in the trappings of the genre like a favored blanket, letting their comforting warmth wash over me in waves of escapism and nostalgia. But this half-assed bunch of hokum had me rolling my eyes, with the stilted dialogue and the hastily-sketched characters and the nonsensical plot and the ARGH it's too much.\r\n\r\nThe icing on this crap cake was the ham-handed, in-no-uncertain-terms Christian allegory with which the film beat the audience over the head with all the grace, power, and strength of an industrial-size sledgehammer. Yes, the evil was SIN. And Aslan is JESUS. Who exists as a lion in an alternate universe or something, apparently. Who pulls children into this alternate universe at random for...no apparent reason whatsoever (the film explicitly states that it's \"to know Him (Aslan i.e. Jesus, in case you didn't already pick up on that) better,\" but if that's the case, why just these four kids? What's the thematic point of this? Why were the elder kids now judged worthy of not having watery allegory poured down their throats again? What did these kids learn at the end of this film that made them better people?\r\n\r\nARGH again. I cannot even begin to catalogue the problems with this series, from either the internal \"logic\" of the series or the external logic of the human brain. Doing so only hurts my head.\r\n\r\nRemember how I said the second film in the series lacked the ham-fisted Christian allegory of the first? Well, 20th Century Fox apparently recognized the church-going demographic was what made the first film such a success, and had them ramp up the religious content from \"allegory\" to \"explicit yelling at the audience and rubbing its nose in it like it's a puppy who peed on the carpet.\" This sentiment struck me as wholly insincere, a manufactured \"message\" shoehorned in by a film studio who wanted nothing more than to reap the box office rewards of the first film which felt, though unsubtle, genuine in its intentions.\r\n\r\nI've seen films more poorly shot, more poorly acted, more poorly assembled. But this boring, useless, preachy slog with no purpose or point had me at the absolute end of my rope. Rare is it that I sit in a darkened theater constantly looking at my watch, biding my time, aching for the dross on the screen to end so that I simply don't have to endure it anymore. But that's exactly what happened with this film.\r\n\r\nBefore anyone jumps on the obvious point of attack, let me say in no uncertain terms that I am Christian. But (and this is an exceptionally important point) just because a the message of a particular film/book/song/etc. is Christian doesn't make the work inherently good. Nor does criticism of the work in some way equal an anti-Christian sentiment. I often feel that works perceived as \"Christian\" get a free pass on quality because of their message, but quality doesn't work like that. Lowering one's standards results only in mediocre pablum like this continuing to be passed off for media conglomerates to make a quick, insincere buck. Do me a favor. If you've enjoyed these films, fine. I whole-heartedly disagree, but I'm certainly not going to tell you you're wrong for enjoying them. But I beg of you: Don't shut off the critical area of your brain just because something agrees with your worldview. Doing so is a disservice not only to yourself, but everyone else like you who has to suffer through trash like this.", "created_at": "2013-07-21T18:29:33.556Z"}, {"movie_id": 10140, "review_id": "570c752592514144920001c4", "author_rating": 8.0, "review_text": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r\n\r\nIt never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r\n\r\nI enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r\n\r\nFinally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business.", "created_at": "2016-04-12T04:10:13.695Z"}, {"movie_id": 10140, "review_id": "5fa2c2236782590035a0d722", "author_rating": 6.0, "review_text": "I wouldn't class this as a good or bad film, it's in a weird sorta in-between to me.\r\n\r\n<em>'The Chronicles of Narnia: The Voyage of the Dawn Treader'</em> is, comparatively, bad. It loses the vibe and all the intrigue that the first film has, as it continues the downward trajectory set by the other sequel. However, it's still just about got a decent adventure feel to it.\r\n\r\nOnly two of the youngsters reprise their roles 'properly', those being Georgie Henley (Lucy) and Skandar Keynes (Edmund). I'd always prefer a cast to remain the same, but if I'm honest this doesn't miss William Moseley (Peter) and Anna Popplewell (Susan) all that much. That argument is helped by the arrival of a young Will Poulter as Eustace. He's great.\r\n\r\nPlot-wise is where it gets meh. I didn't care for it, even if I did like its swashbuckling nature. I can see many finding enjoyment with it, but for me it doesn't quite come out positively unfortunately - it's sluggish. The ship set also feels rather cheap.\r\n\r\nNot at all a bad film; one that was interestingly made without the involvement of Disney, Walden Media joined up with Fox instead. I just couldn't find enough entertainment in it.", "created_at": "2020-11-04T15:00:51.184Z"}, {"movie_id": 10140, "review_id": "51ec288d19c29551e2117035", "author_rating": null, "review_text": "In the immortal words of Col. Kurtz, \"The horror...the horror.\" Marlon Brando wasn't speaking of this film, of course, but rather the horrors of the Vietnam War. The sentiment remains applicable.\r\n\r\nWhen I write reviews, I do try to give at least a modicum of context, be it a history of the film itself, predecessors to its place in cinema history, or my general feelings on the type of film. In this case, I've just referenced Francis Ford Coppola's classic take on Joseph Conrad's \"Heart of Darkness,\" Apocalypse Now. What does that have to do with Dawn Treader? Nothing, and I couldn't be happier. Why? Because it's distracted my mind with thoughts of a far, far better film. Allow me my few moments of happiness before I have to rifle through the dark filing cabinet of my mind to marshal my thoughts on this atrocity.\\\r\n\r\nWhat went so wrong here, you may ask? We'll start with the history of this franchise. I do not have the highest opinion of this series. We started out with the most famous of C. S. Lewis' Narnia cycle, The Lion, The Witch, and the Wardrobe. I don't know...perhaps if we hadn't been in the middle of such a fantasy film renaissance, I would have found it more palatable. Instead, coming on the heels of Peter Jackson's generation-defining Lord of the Rings trilogy, and the high class and quality of the Harry Potter franchise, that weak take on a book series that didn't thrill me as a child struck me as a cheap, childish appetizer compared to the magnificent feasts audiences had already been served, their stories facile, their acting (aside from a typically great Tilda Swinton) either poor or phoned-in (Paging Mr. Neeson, your paycheck is waiting for you). SHREK co-director Andrew Adamson was the helmer of both Wardrobe and Caspian, and I had hoped those film's failings were due perhaps to his inexperience as a director of live-action. The first film of course wore its Christian allegory on its sleeve (Lewis, for all his writings, never managed to find the definition of \"subtle\"), and it found favor with the churchgoing crowd, whose turnout afforded it a huge box office windfall. The second film was more of a straight actioner (in the vein of Star Wars Episode I, which is to say the supposed action was mired in a swamp of facile and achingly dull political machinations), and didn't find purchase with the same demographic, and box office returns were disappointingly low. Disney, who had financed the films, saw the writing on the wall, and dropped the series. That should have been the end of it.\r\n\r\nUntil 20th Century Fox stepped in. Now, let's remember: Fox doesn't have the best track record with adapting beloved fantasy series into films (a moment of silence for the tragedies that were The Dark is Rising and Eregon, please). Hiring Michael Apted as the director seemed to be bucking the trend of shoveling out crap. Apted isn't really known as an action, fantasy, or epic film director, but he showed promise with the last Pierce Brosnan/James Bond film, The World is Not Enough (I'll not blame him for Denise Richards'...nuclear physicist...sigh). Still, director in place, 20th Century Fox and Walden Media cobbled together another Narnia adventure, and the results were predictably terrible.\r\n\r\nHonestly, I wish I hadn't expected a poor film going in. Because this film not only met but exceeded my expectations of terrible, and it's not because I was pre-judging it. It's because it was simply that bad. The plot is nonsensical, randomly shunting characters from one loosely-connected vignette to the next, with hokey dialogue and dire predictions of eeeevil standing in for actual menace or intrigue. It's a shaggy dog road trip story, waterlogged on a boat, and I found myself half an hour in wishing desperately that the characters would all get scurvy and die.\r\n\r\nThe plot's so thinly-sketched that I may as well not even try to recount it here, but it has something to do with two of the kids from previous films being once again pulled into Narnia at absolute random, with no thematic or plot reason for any of the nonsense in the first place. Once there, our cast is rounded out with their exceptionally annoying cousin, and despite no one knowing quite what's going on, they stumble upon the titular character of the second film, Prince Caspian, and join him on his completely random quest to recover seven old friends of his long-dead father who disappeared for some reason, and no one knows why. So they fight an island made of evil. Good wins, evil is defeated, the end. Please, let it be the end.\r\n\r\nListen: I love fantasy. I love science fiction, I love horror, I love all of the outré genres, the fantastic, the unreal. It fascinates me, and I love wrapping myself in the trappings of the genre like a favored blanket, letting their comforting warmth wash over me in waves of escapism and nostalgia. But this half-assed bunch of hokum had me rolling my eyes, with the stilted dialogue and the hastily-sketched characters and the nonsensical plot and the ARGH it's too much.\r\n\r\nThe icing on this crap cake was the ham-handed, in-no-uncertain-terms Christian allegory with which the film beat the audience over the head with all the grace, power, and strength of an industrial-size sledgehammer. Yes, the evil was SIN. And Aslan is JESUS. Who exists as a lion in an alternate universe or something, apparently. Who pulls children into this alternate universe at random for...no apparent reason whatsoever (the film explicitly states that it's \"to know Him (Aslan i.e. Jesus, in case you didn't already pick up on that) better,\" but if that's the case, why just these four kids? What's the thematic point of this? Why were the elder kids now judged worthy of not having watery allegory poured down their throats again? What did these kids learn at the end of this film that made them better people?\r\n\r\nARGH again. I cannot even begin to catalogue the problems with this series, from either the internal \"logic\" of the series or the external logic of the human brain. Doing so only hurts my head.\r\n\r\nRemember how I said the second film in the series lacked the ham-fisted Christian allegory of the first? Well, 20th Century Fox apparently recognized the church-going demographic was what made the first film such a success, and had them ramp up the religious content from \"allegory\" to \"explicit yelling at the audience and rubbing its nose in it like it's a puppy who peed on the carpet.\" This sentiment struck me as wholly insincere, a manufactured \"message\" shoehorned in by a film studio who wanted nothing more than to reap the box office rewards of the first film which felt, though unsubtle, genuine in its intentions.\r\n\r\nI've seen films more poorly shot, more poorly acted, more poorly assembled. But this boring, useless, preachy slog with no purpose or point had me at the absolute end of my rope. Rare is it that I sit in a darkened theater constantly looking at my watch, biding my time, aching for the dross on the screen to end so that I simply don't have to endure it anymore. But that's exactly what happened with this film.\r\n\r\nBefore anyone jumps on the obvious point of attack, let me say in no uncertain terms that I am Christian. But (and this is an exceptionally important point) just because a the message of a particular film/book/song/etc. is Christian doesn't make the work inherently good. Nor does criticism of the work in some way equal an anti-Christian sentiment. I often feel that works perceived as \"Christian\" get a free pass on quality because of their message, but quality doesn't work like that. Lowering one's standards results only in mediocre pablum like this continuing to be passed off for media conglomerates to make a quick, insincere buck. Do me a favor. If you've enjoyed these films, fine. I whole-heartedly disagree, but I'm certainly not going to tell you you're wrong for enjoying them. But I beg of you: Don't shut off the critical area of your brain just because something agrees with your worldview. Doing so is a disservice not only to yourself, but everyone else like you who has to suffer through trash like this.", "created_at": "2013-07-21T18:29:33.556Z"}, {"movie_id": 10140, "review_id": "570c752592514144920001c4", "author_rating": 8.0, "review_text": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r\n\r\nIt never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r\n\r\nI enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r\n\r\nFinally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business.", "created_at": "2016-04-12T04:10:13.695Z"}, {"movie_id": 10140, "review_id": "5fa2c2236782590035a0d722", "author_rating": 6.0, "review_text": "I wouldn't class this as a good or bad film, it's in a weird sorta in-between to me.\r\n\r\n<em>'The Chronicles of Narnia: The Voyage of the Dawn Treader'</em> is, comparatively, bad. It loses the vibe and all the intrigue that the first film has, as it continues the downward trajectory set by the other sequel. However, it's still just about got a decent adventure feel to it.\r\n\r\nOnly two of the youngsters reprise their roles 'properly', those being Georgie Henley (Lucy) and Skandar Keynes (Edmund). I'd always prefer a cast to remain the same, but if I'm honest this doesn't miss William Moseley (Peter) and Anna Popplewell (Susan) all that much. That argument is helped by the arrival of a young Will Poulter as Eustace. He's great.\r\n\r\nPlot-wise is where it gets meh. I didn't care for it, even if I did like its swashbuckling nature. I can see many finding enjoyment with it, but for me it doesn't quite come out positively unfortunately - it's sluggish. The ship set also feels rather cheap.\r\n\r\nNot at all a bad film; one that was interestingly made without the involvement of Disney, Walden Media joined up with Fox instead. I just couldn't find enough entertainment in it.", "created_at": "2020-11-04T15:00:51.184Z"}, {"movie_id": 10140, "review_id": "51ec288d19c29551e2117035", "author_rating": null, "review_text": "In the immortal words of Col. Kurtz, \"The horror...the horror.\" Marlon Brando wasn't speaking of this film, of course, but rather the horrors of the Vietnam War. The sentiment remains applicable.\r\n\r\nWhen I write reviews, I do try to give at least a modicum of context, be it a history of the film itself, predecessors to its place in cinema history, or my general feelings on the type of film. In this case, I've just referenced Francis Ford Coppola's classic take on Joseph Conrad's \"Heart of Darkness,\" Apocalypse Now. What does that have to do with Dawn Treader? Nothing, and I couldn't be happier. Why? Because it's distracted my mind with thoughts of a far, far better film. Allow me my few moments of happiness before I have to rifle through the dark filing cabinet of my mind to marshal my thoughts on this atrocity.\\\r\n\r\nWhat went so wrong here, you may ask? We'll start with the history of this franchise. I do not have the highest opinion of this series. We started out with the most famous of C. S. Lewis' Narnia cycle, The Lion, The Witch, and the Wardrobe. I don't know...perhaps if we hadn't been in the middle of such a fantasy film renaissance, I would have found it more palatable. Instead, coming on the heels of Peter Jackson's generation-defining Lord of the Rings trilogy, and the high class and quality of the Harry Potter franchise, that weak take on a book series that didn't thrill me as a child struck me as a cheap, childish appetizer compared to the magnificent feasts audiences had already been served, their stories facile, their acting (aside from a typically great Tilda Swinton) either poor or phoned-in (Paging Mr. Neeson, your paycheck is waiting for you). SHREK co-director Andrew Adamson was the helmer of both Wardrobe and Caspian, and I had hoped those film's failings were due perhaps to his inexperience as a director of live-action. The first film of course wore its Christian allegory on its sleeve (Lewis, for all his writings, never managed to find the definition of \"subtle\"), and it found favor with the churchgoing crowd, whose turnout afforded it a huge box office windfall. The second film was more of a straight actioner (in the vein of Star Wars Episode I, which is to say the supposed action was mired in a swamp of facile and achingly dull political machinations), and didn't find purchase with the same demographic, and box office returns were disappointingly low. Disney, who had financed the films, saw the writing on the wall, and dropped the series. That should have been the end of it.\r\n\r\nUntil 20th Century Fox stepped in. Now, let's remember: Fox doesn't have the best track record with adapting beloved fantasy series into films (a moment of silence for the tragedies that were The Dark is Rising and Eregon, please). Hiring Michael Apted as the director seemed to be bucking the trend of shoveling out crap. Apted isn't really known as an action, fantasy, or epic film director, but he showed promise with the last Pierce Brosnan/James Bond film, The World is Not Enough (I'll not blame him for Denise Richards'...nuclear physicist...sigh). Still, director in place, 20th Century Fox and Walden Media cobbled together another Narnia adventure, and the results were predictably terrible.\r\n\r\nHonestly, I wish I hadn't expected a poor film going in. Because this film not only met but exceeded my expectations of terrible, and it's not because I was pre-judging it. It's because it was simply that bad. The plot is nonsensical, randomly shunting characters from one loosely-connected vignette to the next, with hokey dialogue and dire predictions of eeeevil standing in for actual menace or intrigue. It's a shaggy dog road trip story, waterlogged on a boat, and I found myself half an hour in wishing desperately that the characters would all get scurvy and die.\r\n\r\nThe plot's so thinly-sketched that I may as well not even try to recount it here, but it has something to do with two of the kids from previous films being once again pulled into Narnia at absolute random, with no thematic or plot reason for any of the nonsense in the first place. Once there, our cast is rounded out with their exceptionally annoying cousin, and despite no one knowing quite what's going on, they stumble upon the titular character of the second film, Prince Caspian, and join him on his completely random quest to recover seven old friends of his long-dead father who disappeared for some reason, and no one knows why. So they fight an island made of evil. Good wins, evil is defeated, the end. Please, let it be the end.\r\n\r\nListen: I love fantasy. I love science fiction, I love horror, I love all of the outré genres, the fantastic, the unreal. It fascinates me, and I love wrapping myself in the trappings of the genre like a favored blanket, letting their comforting warmth wash over me in waves of escapism and nostalgia. But this half-assed bunch of hokum had me rolling my eyes, with the stilted dialogue and the hastily-sketched characters and the nonsensical plot and the ARGH it's too much.\r\n\r\nThe icing on this crap cake was the ham-handed, in-no-uncertain-terms Christian allegory with which the film beat the audience over the head with all the grace, power, and strength of an industrial-size sledgehammer. Yes, the evil was SIN. And Aslan is JESUS. Who exists as a lion in an alternate universe or something, apparently. Who pulls children into this alternate universe at random for...no apparent reason whatsoever (the film explicitly states that it's \"to know Him (Aslan i.e. Jesus, in case you didn't already pick up on that) better,\" but if that's the case, why just these four kids? What's the thematic point of this? Why were the elder kids now judged worthy of not having watery allegory poured down their throats again? What did these kids learn at the end of this film that made them better people?\r\n\r\nARGH again. I cannot even begin to catalogue the problems with this series, from either the internal \"logic\" of the series or the external logic of the human brain. Doing so only hurts my head.\r\n\r\nRemember how I said the second film in the series lacked the ham-fisted Christian allegory of the first? Well, 20th Century Fox apparently recognized the church-going demographic was what made the first film such a success, and had them ramp up the religious content from \"allegory\" to \"explicit yelling at the audience and rubbing its nose in it like it's a puppy who peed on the carpet.\" This sentiment struck me as wholly insincere, a manufactured \"message\" shoehorned in by a film studio who wanted nothing more than to reap the box office rewards of the first film which felt, though unsubtle, genuine in its intentions.\r\n\r\nI've seen films more poorly shot, more poorly acted, more poorly assembled. But this boring, useless, preachy slog with no purpose or point had me at the absolute end of my rope. Rare is it that I sit in a darkened theater constantly looking at my watch, biding my time, aching for the dross on the screen to end so that I simply don't have to endure it anymore. But that's exactly what happened with this film.\r\n\r\nBefore anyone jumps on the obvious point of attack, let me say in no uncertain terms that I am Christian. But (and this is an exceptionally important point) just because a the message of a particular film/book/song/etc. is Christian doesn't make the work inherently good. Nor does criticism of the work in some way equal an anti-Christian sentiment. I often feel that works perceived as \"Christian\" get a free pass on quality because of their message, but quality doesn't work like that. Lowering one's standards results only in mediocre pablum like this continuing to be passed off for media conglomerates to make a quick, insincere buck. Do me a favor. If you've enjoyed these films, fine. I whole-heartedly disagree, but I'm certainly not going to tell you you're wrong for enjoying them. But I beg of you: Don't shut off the critical area of your brain just because something agrees with your worldview. Doing so is a disservice not only to yourself, but everyone else like you who has to suffer through trash like this.", "created_at": "2013-07-21T18:29:33.556Z"}, {"movie_id": 10140, "review_id": "570c752592514144920001c4", "author_rating": 8.0, "review_text": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r\n\r\nIt never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r\n\r\nI enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r\n\r\nFinally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business.", "created_at": "2016-04-12T04:10:13.695Z"}, {"movie_id": 10140, "review_id": "5fa2c2236782590035a0d722", "author_rating": 6.0, "review_text": "I wouldn't class this as a good or bad film, it's in a weird sorta in-between to me.\r\n\r\n<em>'The Chronicles of Narnia: The Voyage of the Dawn Treader'</em> is, comparatively, bad. It loses the vibe and all the intrigue that the first film has, as it continues the downward trajectory set by the other sequel. However, it's still just about got a decent adventure feel to it.\r\n\r\nOnly two of the youngsters reprise their roles 'properly', those being Georgie Henley (Lucy) and Skandar Keynes (Edmund). I'd always prefer a cast to remain the same, but if I'm honest this doesn't miss William Moseley (Peter) and Anna Popplewell (Susan) all that much. That argument is helped by the arrival of a young Will Poulter as Eustace. He's great.\r\n\r\nPlot-wise is where it gets meh. I didn't care for it, even if I did like its swashbuckling nature. I can see many finding enjoyment with it, but for me it doesn't quite come out positively unfortunately - it's sluggish. The ship set also feels rather cheap.\r\n\r\nNot at all a bad film; one that was interestingly made without the involvement of Disney, Walden Media joined up with Fox instead. I just couldn't find enough entertainment in it.", "created_at": "2020-11-04T15:00:51.184Z"}, {"movie_id": 10140, "review_id": "51ec288d19c29551e2117035", "author_rating": null, "review_text": "In the immortal words of Col. Kurtz, \"The horror...the horror.\" Marlon Brando wasn't speaking of this film, of course, but rather the horrors of the Vietnam War. The sentiment remains applicable.\r\n\r\nWhen I write reviews, I do try to give at least a modicum of context, be it a history of the film itself, predecessors to its place in cinema history, or my general feelings on the type of film. In this case, I've just referenced Francis Ford Coppola's classic take on Joseph Conrad's \"Heart of Darkness,\" Apocalypse Now. What does that have to do with Dawn Treader? Nothing, and I couldn't be happier. Why? Because it's distracted my mind with thoughts of a far, far better film. Allow me my few moments of happiness before I have to rifle through the dark filing cabinet of my mind to marshal my thoughts on this atrocity.\\\r\n\r\nWhat went so wrong here, you may ask? We'll start with the history of this franchise. I do not have the highest opinion of this series. We started out with the most famous of C. S. Lewis' Narnia cycle, The Lion, The Witch, and the Wardrobe. I don't know...perhaps if we hadn't been in the middle of such a fantasy film renaissance, I would have found it more palatable. Instead, coming on the heels of Peter Jackson's generation-defining Lord of the Rings trilogy, and the high class and quality of the Harry Potter franchise, that weak take on a book series that didn't thrill me as a child struck me as a cheap, childish appetizer compared to the magnificent feasts audiences had already been served, their stories facile, their acting (aside from a typically great Tilda Swinton) either poor or phoned-in (Paging Mr. Neeson, your paycheck is waiting for you). SHREK co-director Andrew Adamson was the helmer of both Wardrobe and Caspian, and I had hoped those film's failings were due perhaps to his inexperience as a director of live-action. The first film of course wore its Christian allegory on its sleeve (Lewis, for all his writings, never managed to find the definition of \"subtle\"), and it found favor with the churchgoing crowd, whose turnout afforded it a huge box office windfall. The second film was more of a straight actioner (in the vein of Star Wars Episode I, which is to say the supposed action was mired in a swamp of facile and achingly dull political machinations), and didn't find purchase with the same demographic, and box office returns were disappointingly low. Disney, who had financed the films, saw the writing on the wall, and dropped the series. That should have been the end of it.\r\n\r\nUntil 20th Century Fox stepped in. Now, let's remember: Fox doesn't have the best track record with adapting beloved fantasy series into films (a moment of silence for the tragedies that were The Dark is Rising and Eregon, please). Hiring Michael Apted as the director seemed to be bucking the trend of shoveling out crap. Apted isn't really known as an action, fantasy, or epic film director, but he showed promise with the last Pierce Brosnan/James Bond film, The World is Not Enough (I'll not blame him for Denise Richards'...nuclear physicist...sigh). Still, director in place, 20th Century Fox and Walden Media cobbled together another Narnia adventure, and the results were predictably terrible.\r\n\r\nHonestly, I wish I hadn't expected a poor film going in. Because this film not only met but exceeded my expectations of terrible, and it's not because I was pre-judging it. It's because it was simply that bad. The plot is nonsensical, randomly shunting characters from one loosely-connected vignette to the next, with hokey dialogue and dire predictions of eeeevil standing in for actual menace or intrigue. It's a shaggy dog road trip story, waterlogged on a boat, and I found myself half an hour in wishing desperately that the characters would all get scurvy and die.\r\n\r\nThe plot's so thinly-sketched that I may as well not even try to recount it here, but it has something to do with two of the kids from previous films being once again pulled into Narnia at absolute random, with no thematic or plot reason for any of the nonsense in the first place. Once there, our cast is rounded out with their exceptionally annoying cousin, and despite no one knowing quite what's going on, they stumble upon the titular character of the second film, Prince Caspian, and join him on his completely random quest to recover seven old friends of his long-dead father who disappeared for some reason, and no one knows why. So they fight an island made of evil. Good wins, evil is defeated, the end. Please, let it be the end.\r\n\r\nListen: I love fantasy. I love science fiction, I love horror, I love all of the outré genres, the fantastic, the unreal. It fascinates me, and I love wrapping myself in the trappings of the genre like a favored blanket, letting their comforting warmth wash over me in waves of escapism and nostalgia. But this half-assed bunch of hokum had me rolling my eyes, with the stilted dialogue and the hastily-sketched characters and the nonsensical plot and the ARGH it's too much.\r\n\r\nThe icing on this crap cake was the ham-handed, in-no-uncertain-terms Christian allegory with which the film beat the audience over the head with all the grace, power, and strength of an industrial-size sledgehammer. Yes, the evil was SIN. And Aslan is JESUS. Who exists as a lion in an alternate universe or something, apparently. Who pulls children into this alternate universe at random for...no apparent reason whatsoever (the film explicitly states that it's \"to know Him (Aslan i.e. Jesus, in case you didn't already pick up on that) better,\" but if that's the case, why just these four kids? What's the thematic point of this? Why were the elder kids now judged worthy of not having watery allegory poured down their throats again? What did these kids learn at the end of this film that made them better people?\r\n\r\nARGH again. I cannot even begin to catalogue the problems with this series, from either the internal \"logic\" of the series or the external logic of the human brain. Doing so only hurts my head.\r\n\r\nRemember how I said the second film in the series lacked the ham-fisted Christian allegory of the first? Well, 20th Century Fox apparently recognized the church-going demographic was what made the first film such a success, and had them ramp up the religious content from \"allegory\" to \"explicit yelling at the audience and rubbing its nose in it like it's a puppy who peed on the carpet.\" This sentiment struck me as wholly insincere, a manufactured \"message\" shoehorned in by a film studio who wanted nothing more than to reap the box office rewards of the first film which felt, though unsubtle, genuine in its intentions.\r\n\r\nI've seen films more poorly shot, more poorly acted, more poorly assembled. But this boring, useless, preachy slog with no purpose or point had me at the absolute end of my rope. Rare is it that I sit in a darkened theater constantly looking at my watch, biding my time, aching for the dross on the screen to end so that I simply don't have to endure it anymore. But that's exactly what happened with this film.\r\n\r\nBefore anyone jumps on the obvious point of attack, let me say in no uncertain terms that I am Christian. But (and this is an exceptionally important point) just because a the message of a particular film/book/song/etc. is Christian doesn't make the work inherently good. Nor does criticism of the work in some way equal an anti-Christian sentiment. I often feel that works perceived as \"Christian\" get a free pass on quality because of their message, but quality doesn't work like that. Lowering one's standards results only in mediocre pablum like this continuing to be passed off for media conglomerates to make a quick, insincere buck. Do me a favor. If you've enjoyed these films, fine. I whole-heartedly disagree, but I'm certainly not going to tell you you're wrong for enjoying them. But I beg of you: Don't shut off the critical area of your brain just because something agrees with your worldview. Doing so is a disservice not only to yourself, but everyone else like you who has to suffer through trash like this.", "created_at": "2013-07-21T18:29:33.556Z"}, {"movie_id": 10140, "review_id": "570c752592514144920001c4", "author_rating": 8.0, "review_text": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r\n\r\nIt never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r\n\r\nI enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r\n\r\nFinally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business.", "created_at": "2016-04-12T04:10:13.695Z"}, {"movie_id": 10140, "review_id": "5fa2c2236782590035a0d722", "author_rating": 6.0, "review_text": "I wouldn't class this as a good or bad film, it's in a weird sorta in-between to me.\r\n\r\n<em>'The Chronicles of Narnia: The Voyage of the Dawn Treader'</em> is, comparatively, bad. It loses the vibe and all the intrigue that the first film has, as it continues the downward trajectory set by the other sequel. However, it's still just about got a decent adventure feel to it.\r\n\r\nOnly two of the youngsters reprise their roles 'properly', those being Georgie Henley (Lucy) and Skandar Keynes (Edmund). I'd always prefer a cast to remain the same, but if I'm honest this doesn't miss William Moseley (Peter) and Anna Popplewell (Susan) all that much. That argument is helped by the arrival of a young Will Poulter as Eustace. He's great.\r\n\r\nPlot-wise is where it gets meh. I didn't care for it, even if I did like its swashbuckling nature. I can see many finding enjoyment with it, but for me it doesn't quite come out positively unfortunately - it's sluggish. The ship set also feels rather cheap.\r\n\r\nNot at all a bad film; one that was interestingly made without the involvement of Disney, Walden Media joined up with Fox instead. I just couldn't find enough entertainment in it.", "created_at": "2020-11-04T15:00:51.184Z"}]