[{"movie_id": 526896, "review_id": "6245e7a1960cde0089ad70f2", "author_rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/morbius-spoiler-free-review\r\n\r\n\"Morbius is yet another disaster from the Sony-Marvel shared universe.\r\n\r\nDespite good performances from Jared Leto and Matt Smith and even a couple of visually captivating action sequences, the formulaic screenplay that seems to originate from the beginning of the century ruins everything in its path.\r\n\r\nFrom the predictability and zero creativity of the main plot to the heavy reliance on uninteresting, unnecessary exposition, Daniel Espinosa finds his most significant problem in the blatant lack of care in the treatment of the characters.\r\n\r\nThe narrative logical lapses are too many to ignore and even amplified by extremely messy editing, a third act wrapped in an unfathomable blend of CGI, and a plagiarized score.\r\n\r\nOne of the most embarrassing productions by a major studio in recent years.\"\r\n\r\nRating: D", "created_at": "2022-03-31T17:40:49.699Z"}, {"movie_id": 526896, "review_id": "624aba88d9f4a6004f5911f1", "author_rating": 6.0, "review_text": "I can't go lower than 3 stars because ever since \"Alexander\" (2004) I've had a tiny crush on Jared Leto, and some of the trails for this made him look swarthy and hot too. To be fair, also, he is not afraid of spending a great deal of time in the make up chair, as we saw in \"House of Gucci\" (2021) and frequently see here. Sadly, though, after my appreciation of Jared's eye candiness wore off, what I was left with was Luke Evans' \"Dracula Untold\" (2014) just without Charles Dance, and a hint of \"Dr Jekyll and Mr. Hyde\" (from 1931). The imagery is fine, the film looks super - but so what. Marvel/Columbia should be doing that anyway. It's the story. It's so thin. Matt Smith is lightweight at the best of times, and together with Adria Arjona's really unremarkable contribution as Leto's sidekick \"Dr.Bancroft\" and some sparing interventions from the other Jared in this film (Harris) this all just lollops along as if it were just the money-no-object pilot episode of a drama series that will struggle to get a commission. I love the genre, but the words barrel, bottom and scraped came to mind pretty early on. Sadly the handsome Mr. Leto reminds me of Eric Bana - very easy on the eye but not good enough to carry a film.", "created_at": "2022-04-04T09:29:44.426Z"}, {"movie_id": 526896, "review_id": "6250ba0fc613ce02d3a9ee36", "author_rating": 5.0, "review_text": "**Not a disaster as others seem to imply but definitely disappointing for a movie of such high budget.**\r\n\r\nMorbius is a kind of a vampire Batman-Frankenstein mix. In the search of the cure for a rare and highly-debilitating blood decease, Morbius (a genius doctor) find a cure that has a terrible cost. His sickness is pretty much gone and he attains super powers, but also feel an insatiable lust for blood that can't be fully satiated by artificial blood. \r\n\r\nThe movie revolves around Morbius trying to remedy the consequences of the evil he unleashed to the world. While the cinematography is pretty decent, the plot really sucks. In the end of the movie, there are too many open questions (and inconsistencies) in the plot. \r\n\r\nThe movie seems to end very abruptly without any decent climax, and many of the secondary characters that I expected would play an important role in the resolution of the conflicts, seem to have been completely forgotten. Sony/Marvel does need better writers for their movies...", "created_at": "2022-04-08T22:41:19.078Z"}, {"movie_id": 526896, "review_id": "625eb3948ac3d01602f89024", "author_rating": 6.0, "review_text": "Not even that bad, to be honest.\r\n\r\nI had heard murmurs of <em>'Morbius'</em> being received poorly (as now I see via the average rating!) but didn't know to what degree, which is how I prefer it so I can form my own opinion - which is, I didn't dislike it. Admittedly I have nothing that I like either, but it's a forgettably fine film. In fact, I found it to be the quickest viewing experience of the year so far - the run time absolutely flew by for me.\r\n\r\nThe cast are a bit up-and-down. Jared Leto has a few moments and overall I'm OK with him in the lead role, meanwhile Matt Smith is more miss than hit but again didn't annoy me or anything like that. Elsewhere, it was pleasant to see Jared Harris and Tyrese Gibson in smaller roles.\r\n\r\nThe special effects, for the most part, are serviceable in my eyes. I think I also heard that people were questioning why the filmmakers didn't opt for prosthetics and went full blown CG for the faces - I found everything in that area to be fine, it would've been cooler if they mixed it up but if I hadn't heard anything about it I honestly would not have even noted it.\r\n\r\nThere are some lame lines of dialogue, namely that hunger one, and the credit scenes don't leave any excitement or intrigue behind. Aside from that, I genuinely didn't dislike this. A quintessential 6/10 flick, for me. It is the weakest of the first three <a href=\"https://en.wikipedia.org/wiki/Sony%27s_Spider-Man_Universe#Films\" rel=\"nofollow\">SSU</a> films, granted.", "created_at": "2022-04-19T13:05:24.698Z"}, {"movie_id": 526896, "review_id": "62825929cee481544b14fc4d", "author_rating": 1.0, "review_text": "Nothing in this movie makes any sense. If he has to drink a bag of blood every 6 hours, why not just do so? The human populace of how many billion people can not sustain a single vampire? No, he makes and consumes artificial blood for ethical reasons. Who says he needs to kill or hurt people to get what he needs? Horrible premise for his actions, not believable at all. And the rest of the story is the same. Weird decision making, boring, pointless dialogue. The bad guy is suddenly bad lacking any morals because he was bullied once apparently. Vampire powers are a myriad of random things. One time he is able to fly and it is hard to determine why exactly, the movie suggests because a subway train is pushing the air in front of it. Not only is it nonsense, it also looks bad CGI wise. To end on a good note, Jared Leto is a great actor and I would love to finally see him in a good movie.", "created_at": "2022-05-16T14:01:13.135Z"}, {"movie_id": 526896, "review_id": "62dc94294ccc50004d1c5aff", "author_rating": 8.0, "review_text": "Honestly, I don't know why this movie has gotten so many bad ratings.  Yes, it's a vampire movie, and I'm not sure how much originality can be squeezed out of that genre anymore.  I am totally -not- a Jared Leto fan from some of his other movies and was hesitant on that behalf to watch this film. But once in, he actually pulls off a very realistic doctor role that is also bitter on life due to his health.  Of course, looking for the solution leads to the bigger story that you could probably guess by now.  I'm also at a point where I'm \"over it\" with a lot of these superhero movies, so it was refreshing to see something different out of the MCU.  If I did have any complaints, there are some unanswered questions at the end, but you know, that always leaves room for a sequel.  However, on top of that, the two end credit scenes just add more \"Huuuh?\" and probably do more damage than good.\r\n\r\nNot the best movie ever, but a far reach from the worst as well.  A solid, enjoyable experience, at least for me.  As always, your mileage may vary.", "created_at": "2022-07-24T00:36:57.649Z"}, {"movie_id": 526896, "review_id": "62fbe1835f6c49007a659f73", "author_rating": 8.0, "review_text": "I have to say that I quite liked this movie. A bit surprised since it is a new Marvel movie after all. It is even free of woke bull manure which made me even more surprised.\r\n\r\nThe “scientific” part of Morbius changing his DNA, overnight no less, by means of some serum that he derived from vampire bats is of course utter nonsense but one cannot really complain too much about that since it is straight from the original comic book character.\r\n\r\nThe story is really simple and not much to write home about but it works in its simplicity. After all, in this kind of movie we really do not need something fancy as long as it is not downright stupid. It only needs to be a vehicle for the action and special effects and for that purpose the story works fine.\r\n\r\nI like Morbius. He is intelligent and he doesn’t just sink down in some self pity or whining sessions when he finds out that things did not go exactly as planned. Sure, he is not happy about it but at least he does research into his condition and he actually takes the effort to learn what he can do with his new powers.\r\n\r\nI also do like the special effects and the action in general. The bad guy was rather predictable and not really very charismatic but he worked fairly okay. I think that most of the actors made a good enough job actually.\r\n\r\nIf I should complain about anything it was that scene in the beginning where they claimed that vampire bats could “finish off” big animals in minutes or something. That not what vampire bats do or how they feed. It is of course utter ignorant bull manure by some idiot script writer and it was really totally unnecessary to soil the movie with such nonsense already in the first scenes. I had hoped that ignorant script writers like that died out together with the last flying rubber Piranha in the early 80’s.\r\n\r\nAnyway, I quite liked the movie. A lot of movies that I’ve watched lately have felt bloated and too long for the material. This one I actually felt was too short.", "created_at": "2022-08-16T18:27:15.106Z"}, {"movie_id": 526896, "review_id": "6300296a1da7a60085dc714f", "author_rating": 5.0, "review_text": "**Sadly a run-of-the-mill superhero origin movie with nothing special to make me care.**\r\n\r\nNot as bad as everyone is saying, but it missed its opportunity by about 20 years. I think it could have done a little better if this had been released in the Blade, Fantastic Four, and X-Men movie era in the early 2000s. Still, we have seen too many comic origin stories that success takes more than just seeing a hero gain powers and fight a villain with the same powers in a flurry of mediocre CGI. If you saw, Bloodshot, the quality of effects, writing, and directing are incredibly similar.", "created_at": "2022-08-20T00:23:06.751Z"}, {"movie_id": 526896, "review_id": "64b82468eee1860100eaccb8", "author_rating": 8.0, "review_text": "Another crazy movie by marvel. Like a wolf vampire zombie looking thing. Pretty awesome movie!", "created_at": "2023-07-19T17:59:04.975Z"}]