[{"movie_id": 546554, "review_id": "5ddbc870aad9c20012c232bd", "author_rating": 9.0, "review_text": "This is a crime thriller that’s been a long time in the making. Mystery fans rejoice: ‘Knives Out’ is an impeccable cinematic achievement, laced with sardonic wit, division and conflict, and of course a perplexing puzzle. This is easily one of the most fun films of 2019 - it’s both a brilliant piece of entertainment and beautifully crafted enigma. Sit back, relax, and try to crack the code.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-knives-out-a-whodunnit-worthy-of-agatha-christies-hercule-poirot", "created_at": "2019-11-25T12:26:24.819Z"}, {"movie_id": 546554, "review_id": "5de52e200cd44600123b777e", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nKnives Out has been shown in numerous festivals, and it received massive acclaim in literally every single one of them. Therefore, its hype grew more and more until its wide release date. Before the film, I can’t deny that I was indeed affected by the whole “a whodunnit like you haven’t seen in years.” I went into the theater with high expectations, not only due to the festival praise but due to its jaw-dropping cast. It’s uncommon to possess such a renowned ensemble and deliver a “bad” movie, especially when Rian Johnson is writing and directing it (yes, I like The Last Jedi, and even if I didn’t, he did other stuff, you know?). It’s one of those films everyone knows it’s going to be appreciated by a considerable part of the world.\r\n\r\nEven the genre itself is a very welcome type of cinema entertainment in regards to both critics and the general public. So, does it live up to its hype, or it fails to reach such high expectations? Knives Out is one of the best movies of the year, as well as one of the best mystery-suspense stories of the millennium (everyone is doing the whole “best X of the decade,” I’m going one step beyond). This is a film I know I’m going to rewatch countless times throughout the next years. Usually, when it comes to whodunnits, people are misled into thinking that from the moment they know who “did it,” the movie loses its interest. This is rarely true, and Rian Johnson succeeds because he doesn’t need the ultimate reveal to deliver a great story.\r\n\r\nThis screenplay is definitely getting tons of nominations and wins during the awards season. Every little line of dialogue means something. Every single character says or does something impactful to the narrative (except for Jaeden Martell’s). It’s been half-a-day since I’ve seen it, and for every question that my brain comes up with, there’s an answer lying on someone’s words or actions. It’s such an intricate, complex, extremely subtle script. One with so many tiny, little details that it’s impossible to catch them all on a first viewing.\r\n\r\nI genuinely love the first act, even if it’s the one where I have a minor issue. Rian Johnson doesn’t waste time and puts us directly in the crime scene, interviewing each and every member of the family. It’s through these interrogatories that he cleverly introduces the suspects, developing them solely through masterfully written dialogue, and outstanding performances. For example, with a single sentence and a particular body/face expression, Toni Collette instantly creates a profile of Joni, her character. Rian plays with character-types and cliches in such an intelligent manner. He makes us think a particular character follows a specific cliche, then it doesn’t, then it does again…\r\n\r\nThat’s one of the reasons I couldn’t figure out the mystery until the last act reveal. Every time I was close to indeed follow the right path, new developments arise, meant to mislead, confuse, and create doubts. Some people feel better with themselves if they solve the case before the film. They feel “intellectually superior” just because they found out before everyone else. First of all, I prefer being fooled and end up blown away by an unexpected conclusion than solving the whole thing way before time’s up and end up disappointed and bored. Then, honestly, anyone who says, “I guessed it,” there’s a 99% chance that they’re either lying or not answering correctly to the question “who killed Harlan?” If you’ve seen the movie, you’ll understand what I’m trying to express.\r\n\r\n(I don’t want to sound presumptuous or hypocritical. I’m not trying to say, “I couldn’t figure it out, so no one can.” Please, if you haven’t seen the film, judge the previous paragraph after your viewing.)\r\n\r\nThroughout the second and third acts, loose ends start to tie up, ending up with a brilliantly delivered reveal. From the marvelous cinematography (with those classic close-ups when a character is about to say something meaningful or tell a story through their imagination or memory) to the remarkable editing, the team behind Rian Johnson did a phenomenal job. The suspense is held at high levels, and it reaches limit-breaking points with Marta Cabrera’s (Ana de Armas) narrative. Armas and Daniel Craig deliver the standout performances, with Chris Evans (Ransom) following right behind. Literally, everyone else offers excellent displays, and help carry a story filled with mystery, but also with a lot of humor.\r\n\r\nHowever, I have to emphasize how astonishing Ana de Armas and Daniel Craig are. Ana might be a bit unknown to most people. I’ve been supporting her ever since Blade Runner 2049, so I’m ecstatic that she finally got a major role in a big movie, especially within an ensemble of actors with legendary careers. Craig, who could have just delivered a slight variation of the character he’s been playing for years, instead offers a unique take on the Detective role. Just like Evans, both have been playing iconic characters for years, so it’s sort of an extra joke to everyone who watched Captain America and James Bond for the past decade or so.\r\n\r\nMy only minor issue has nothing to do with the political undertone and the social messages Rian Johnson puts in this film. Honestly, I love that aspect of it. It’s like Rian knew some people would complain about it, so he made sure to have a couple of characters (Jaeden Martell’s Jacob and Katherine Langford’s Meg) somewhat resembling the so-called snowflakes and all that. No, my issue is related to some excessive exposition regarding the first act’s interrogatories. It’s great that every character gets their own motivations, but it feels like each confrontation with the detectives went on for a bit too long. Some pieces of the mystery might be a bit hard to believe that they would occur, but these are all nitpicks in a remarkable movie.\r\n\r\nIn the end, Rian Johnson is able to bounce back from the divisive The Last Jedi with one of the best whodunnits I’ve ever seen, Knives Out. Rian proves that not only he’s a talented filmmaker but also a phenomenal screenwriter. With a renowned and impressive ensemble cast, Daniel Craig and Ana de Armas are standouts within all of the other outstanding performances, Chris Evans being right behind. With one of the best screenplays of the year, the mystery at its center keeps everyone extremely captivated until the very end, even if you guess “who did it” beforehand. Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. It’s an entertaining story with tremendous replay value and significant political/social layers that only elevate the already complex yet subtle narrative. Don’t miss it!\r\n\r\nRating: A", "created_at": "2019-12-02T15:30:40.714Z"}, {"movie_id": 546554, "review_id": "5e0765984c1d9a0013e1cec8", "author_rating": 8.0, "review_text": "I did not think that _Last Jedi_ was a very good movie, but I have always been a fan of Rian Johnson. And honestly? _Knives Out_ is a strong contender for his best work yet. I have never seen a whodunnit like this before. Seeing this in a theatre was the poppy-poppy-paper of movie-going experiences, because I so enjoyed that. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T14:24:24.870Z"}, {"movie_id": 546554, "review_id": "5e2f2c3f98f1f1000ffd1ab3", "author_rating": 8.0, "review_text": "“This case is like a donut\r\nwith a hole\r\nin the middle of a donut hole.\r\nActually,\r\nit's a donut within a donut's hole.”\r\n\r\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.\r\n\r\nRian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.\r\n\r\nOne of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.\r\n\r\nThe cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.\r\n\r\nDose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.\r\n\r\nChris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.\r\n\r\nThe rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.\r\n\r\nToni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.\r\n\r\nJudging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.\r\n\r\nOverall rating: My House. My Rules. My Coffee!!!", "created_at": "2020-01-27T18:30:23.500Z"}, {"movie_id": 546554, "review_id": "5e4cb9e71e9225001dc8298f", "author_rating": 9.5, "review_text": "\"That certainly not what I was expecting.\"\r\n\r\n- Whodunit?\r\n- Rian Johnson.\r\n- Why?\r\n- To subvert the tropes of yet another sub-genre... properly!\r\n\r\nAs divisive as it was, I neither loved nor hated the love-it-or-hate-it The Last Jedi. Maybe because I'm not a huge fan of the much-beloved saga. But I can give you a quick opinion of what I thought about it anyway. The first half almost turned me off completely: tons of lame jokes and out-of-character moments that indicate that Johnson's biggest concern was to subvert expectations and nothing but. The second half of the film was way better. It proved to me that Johnson is actually very capable of adding fresh blood to the saga, so effortlessly to such an extent that I wondered why he struggled so much in the first half.\r\n\r\nIn Knives Out, Johnson didn't add a new spin on the 'whodunit' sub-genre of detective fiction; he took it and turned it on its head. He did so not only by playing with the tropes and mechanisms of this sub-genre -and boy, he did that so exquisitely and gracefully- but he also by using a new and very effective building block: Drama. It doesn't sound new, isn't it? But, actually, relying on it here, in this kind of a story, is nothing short of revolutionary, and that's simply lies in the fact it's unprecedented to build upon it here. The result is nothing but marvellous. And although that, at some point, the main concern of the plot wasn't the murder mystery per se, the mystery didn't lose its sharpness even a tiny bit. And that's a strong proof that everything worked, and integrated, seamlessly. I said integrated because the film has a plethora of comedic bits throughout its runtime -which flies by- and, to be honest, I think every single joke landed perfectly. The film also suggest a political agenda that's exquisitely woven into the plot, and provides a sharp social commentary that's impressively subtle.\r\n\r\nNot only did Rian Johnson reinvigorate this seemingly outmoded and unfruitful sub-genre, but he also did the same thing with a couple of members of the star-studded cast: I didn't know that Chris Evans, Captain America himself, would be better as, well, an \"Anti-Captain America \"; Craig as Blanc is absolutely phenomenal, with his southern accent and caricature detective character; and Jaeden Martell (IT) is very interesting as the weirdo Jacob Thrombey. As for Curtis, Langford, Plummer, Collette and Shannon, Johnson makes an excellent use of their incredible acting abilities, and of their facial expressions and features, especially Shannon with his remarkable menacing countenance. The real standout, though, is Ana de Armas. I mean, she was good in Blade Runner 2049, but here, as she plays my new favourite version of Pinocchio, she proves she's an exceptionally talented actress who is capable of expressing emotions, and changing them readily, only with her eyes. Honestly, I think she should have been nominated for an Oscar!\r\n\r\nOverall, I'm really surprised how much I loved this film. With Johnson superb and clever direction and meticulously-nuanced and witty -albeit slightly too-structured- screenplay, I think this is my favourite - even if it's not my highest-rated - film of 2019. You know what, this film is actually terrible: it's very pretentious; its puzzle is too convoluted for its own good; it has an overabundance of plot twists; it underutilized its stellar ensemble; and it has a lot of plot holes, or -in this case- donut holes! Excuse me, I gotta leave right now!\r\n\r\n(9.5/10)", "created_at": "2020-02-19T04:30:31.926Z"}, {"movie_id": 546554, "review_id": "5e6e92cea885870012e0919c", "author_rating": 8.0, "review_text": "Fun little murder-mystery starts off great, kind of loses a little steam in the middle, before rebounding nicely at the end. Fine performances all around, though especially Daniel Craig (reminded me why he was also great in The Girl with the Dragon Tattoo even with a starkly different tone). Also makes me remember Rian Johnson is a fine filmmaker (loved Brick). **4.0/5**", "created_at": "2020-03-15T20:40:46.985Z"}, {"movie_id": 546554, "review_id": "5eb8b013bbe1dd002083509e", "author_rating": null, "review_text": "This film had quite the rewatch value, keeping a consistent, yet entertaining thrill ride. Rian Johnson's original tale is strikingly filled with a talented ensemble, old-school-mystery-thrills and a sharp envisioning. Knives Out keeps the audience on their toes and brings a surprising delight towards it’s conclusion.", "created_at": "2020-05-11T01:53:23.215Z"}, {"movie_id": 546554, "review_id": "5ef3d8bf976a230035f890c5", "author_rating": null, "review_text": "Best way to watch is on big screen", "created_at": "2020-06-24T22:50:39.256Z"}, {"movie_id": 546554, "review_id": "5f238cf8eea34d0036374c27", "author_rating": 3.0, "review_text": "Caving to popular opinion and seeing this was a bad decision; Daniel Craig's accent is the only interesting aspect, and you can get that from the trailer.", "created_at": "2020-07-31T03:16:08.736Z"}, {"movie_id": 546554, "review_id": "5fe98984a14e10003b16a592", "author_rating": 7.0, "review_text": "80's actors meet the younger generation of Marvel and series for a huge \"camp it up\" under the patronage of Bond himself.", "created_at": "2020-12-28T07:30:12.521Z"}, {"movie_id": 546554, "review_id": "5ffbe21d1d01910041a01d10", "author_rating": 9.0, "review_text": "A great movie, entertaining and it has you playing detective right away. Great for all the Columbo wannabees.", "created_at": "2021-01-11T05:29:01.738Z"}, {"movie_id": 546554, "review_id": "5ffdab4b47c9fb004079c931", "author_rating": 10.0, "review_text": "Incredible. Loved it!\r\n\r\nEven on just one watch, it's one of my favourites already - I have a feeling I'll be revisiting this a lot. I had heard amazing things about this since its release and, man, is the hype befitting. It's a brilliant 131 minutes, even if it feels much shorter than that given how enjoyable it is.\r\n\r\nThe casting is impeccable. Daniel Craig is superb in the role of Blanc, I've actually found Craig a tad hit-and-miss - even with <em>'James Bond'</em> - but he is utterly superb here; even with that unusual yet definitely entertaining accent.\r\n\r\nIt's by no means The Craig Show, though. Ana de Armas is excellent as Marta, she does a lot of heavy lifting in terms of making her character's situation fully believable. She's great from start-to-finish.\r\n\r\nMichael Shannon is top notch too, I literally always find him fun to watch - from <em>'Boardwalk Empire'</em> to, even, <em>'Kangaroo Jack'</em>. Jamie Lee Curtis, Chris Evans, Don Johnson, Toni Collette, Lakeith Stanfield and Christopher Plummer are all fantastic too.\r\n\r\nThe plot is enthralling, it's crafted together expertly. It reveals bits way earlier than I was predicting, which made me worry it was going to all fall flat at any moment but it kept turning out to be the perfect time to twist the story. The comedy is also very funny, I laughed a fair amount.\r\n\r\nA joy to watch! I haven't got a bad word to say about <em>'Knives Out'</em>.", "created_at": "2021-01-12T13:59:39.453Z"}, {"movie_id": 546554, "review_id": "621a90802a210c001bca3645", "author_rating": 10.0, "review_text": "An incredibly well-crafted and beautifully shot whodunit with an impressive cast. ‘Knives Out’ keeps the viewer on the wrong track thanks to the ingenious script, bringing a surprising delight towards its conclusion, but without losing rewatch value.\r\n\r\n10/10", "created_at": "2022-02-26T20:41:36.548Z"}, {"movie_id": 546554, "review_id": "63bf6ab305a53300e99ad386", "author_rating": 1.0, "review_text": "So, this is a bad remake of Clue... but...\r\n\r\n\"The bad scores are because of Star Wars fans\" And, honestly I am sure that some of them are... but once more we see people attacking anyone that doesn't give a Rain Johnson 10 out of 10.\r\n\r\n\"The bad scores are conservative trolls\" And once again we see people, and Johnson, attacking anyone that doesn't like this film.\r\n\r\nOnce again people are throwing a fit because other people don't like the exact same thing they do.\r\n\r\nBut to be honest, again, I can see that. This is overtly political, and by \"overtly\" I mean that they are screaming through a megaphone, at just about every opportunity, to inject their politics into it.\r\n\r\nOther than that, it is kind of like Clue... if Clue was very careful not to insult some people in their jokes, and very focused in an attempt to insult others with a sheer and unadulterated prejudice. And that kind of makes for a very awkward film where the jokes are so self-aware they can't help but fail.\r\n\r\nSo, basically that is what you are getting, Clue with jokes aimed at the politically correct and a hearty injection of politics. And that is all you are getting.\r\n\r\nBut, hey, if you haven't seen Clue, you might like it. And, if you share the politics and think they should be shrieked in everything, you will totally like it.\r\n\r\nThe rest of us are just going to watch Clue.", "created_at": "2023-01-12T02:04:35.348Z"}, {"movie_id": 546554, "review_id": "650c7e5a4da3d400c9dce831", "author_rating": 7.0, "review_text": "**A novel written specifically for a dramatic work**\r\n\r\nThe story of the movie is simply that we have a person murdered and a group of people suspected of being involved in killing this person because they all have an interest or benefit that this person should die. The movie is simply ask who killing old Harlan Thrombey.\r\n\r\nOften these types of films and these types of stories that contain puzzles and crimes are based on old books such as Agatha Christie, Sherlock Holmes, or any other novel, but this story from the movie was written specifically in order to be made in a dramatic form because the story was written for the cinema and the way the story was implemented was far-fetched. Completely different from traditional methods. This is the strong aspect of the film due to its reliance on the theatrical system. It makes you contemplate the music, the method of filming, and the placement of the characters one after the other, as if you are watching a theatrical performance.\r\n\r\nThe most beautiful thing about this theatrical show is the way the characters are presented. Each character sees it for the first time when they are called for investigation by the police and who they are and what is their relationship to the victim. But what is beautiful is when the next character is identified and we know who she/he is and what her/his relationship is to the victim them We start to doubt the stories and information given by the previous character to the investigators\r\n\r\nWith more than one character and with more than one investigation, the contradictions will become clear. This will bring us to the question that comes to our minds after 40 minutes of the movie: Who killed Harlan Thrombey?", "created_at": "2023-09-21T17:33:14.088Z"}, {"movie_id": 546554, "review_id": "5ddbc870aad9c20012c232bd", "author_rating": 9.0, "review_text": "This is a crime thriller that’s been a long time in the making. Mystery fans rejoice: ‘Knives Out’ is an impeccable cinematic achievement, laced with sardonic wit, division and conflict, and of course a perplexing puzzle. This is easily one of the most fun films of 2019 - it’s both a brilliant piece of entertainment and beautifully crafted enigma. Sit back, relax, and try to crack the code.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-knives-out-a-whodunnit-worthy-of-agatha-christies-hercule-poirot", "created_at": "2019-11-25T12:26:24.819Z"}, {"movie_id": 546554, "review_id": "5de52e200cd44600123b777e", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nKnives Out has been shown in numerous festivals, and it received massive acclaim in literally every single one of them. Therefore, its hype grew more and more until its wide release date. Before the film, I can’t deny that I was indeed affected by the whole “a whodunnit like you haven’t seen in years.” I went into the theater with high expectations, not only due to the festival praise but due to its jaw-dropping cast. It’s uncommon to possess such a renowned ensemble and deliver a “bad” movie, especially when Rian Johnson is writing and directing it (yes, I like The Last Jedi, and even if I didn’t, he did other stuff, you know?). It’s one of those films everyone knows it’s going to be appreciated by a considerable part of the world.\r\n\r\nEven the genre itself is a very welcome type of cinema entertainment in regards to both critics and the general public. So, does it live up to its hype, or it fails to reach such high expectations? Knives Out is one of the best movies of the year, as well as one of the best mystery-suspense stories of the millennium (everyone is doing the whole “best X of the decade,” I’m going one step beyond). This is a film I know I’m going to rewatch countless times throughout the next years. Usually, when it comes to whodunnits, people are misled into thinking that from the moment they know who “did it,” the movie loses its interest. This is rarely true, and Rian Johnson succeeds because he doesn’t need the ultimate reveal to deliver a great story.\r\n\r\nThis screenplay is definitely getting tons of nominations and wins during the awards season. Every little line of dialogue means something. Every single character says or does something impactful to the narrative (except for Jaeden Martell’s). It’s been half-a-day since I’ve seen it, and for every question that my brain comes up with, there’s an answer lying on someone’s words or actions. It’s such an intricate, complex, extremely subtle script. One with so many tiny, little details that it’s impossible to catch them all on a first viewing.\r\n\r\nI genuinely love the first act, even if it’s the one where I have a minor issue. Rian Johnson doesn’t waste time and puts us directly in the crime scene, interviewing each and every member of the family. It’s through these interrogatories that he cleverly introduces the suspects, developing them solely through masterfully written dialogue, and outstanding performances. For example, with a single sentence and a particular body/face expression, Toni Collette instantly creates a profile of Joni, her character. Rian plays with character-types and cliches in such an intelligent manner. He makes us think a particular character follows a specific cliche, then it doesn’t, then it does again…\r\n\r\nThat’s one of the reasons I couldn’t figure out the mystery until the last act reveal. Every time I was close to indeed follow the right path, new developments arise, meant to mislead, confuse, and create doubts. Some people feel better with themselves if they solve the case before the film. They feel “intellectually superior” just because they found out before everyone else. First of all, I prefer being fooled and end up blown away by an unexpected conclusion than solving the whole thing way before time’s up and end up disappointed and bored. Then, honestly, anyone who says, “I guessed it,” there’s a 99% chance that they’re either lying or not answering correctly to the question “who killed Harlan?” If you’ve seen the movie, you’ll understand what I’m trying to express.\r\n\r\n(I don’t want to sound presumptuous or hypocritical. I’m not trying to say, “I couldn’t figure it out, so no one can.” Please, if you haven’t seen the film, judge the previous paragraph after your viewing.)\r\n\r\nThroughout the second and third acts, loose ends start to tie up, ending up with a brilliantly delivered reveal. From the marvelous cinematography (with those classic close-ups when a character is about to say something meaningful or tell a story through their imagination or memory) to the remarkable editing, the team behind Rian Johnson did a phenomenal job. The suspense is held at high levels, and it reaches limit-breaking points with Marta Cabrera’s (Ana de Armas) narrative. Armas and Daniel Craig deliver the standout performances, with Chris Evans (Ransom) following right behind. Literally, everyone else offers excellent displays, and help carry a story filled with mystery, but also with a lot of humor.\r\n\r\nHowever, I have to emphasize how astonishing Ana de Armas and Daniel Craig are. Ana might be a bit unknown to most people. I’ve been supporting her ever since Blade Runner 2049, so I’m ecstatic that she finally got a major role in a big movie, especially within an ensemble of actors with legendary careers. Craig, who could have just delivered a slight variation of the character he’s been playing for years, instead offers a unique take on the Detective role. Just like Evans, both have been playing iconic characters for years, so it’s sort of an extra joke to everyone who watched Captain America and James Bond for the past decade or so.\r\n\r\nMy only minor issue has nothing to do with the political undertone and the social messages Rian Johnson puts in this film. Honestly, I love that aspect of it. It’s like Rian knew some people would complain about it, so he made sure to have a couple of characters (Jaeden Martell’s Jacob and Katherine Langford’s Meg) somewhat resembling the so-called snowflakes and all that. No, my issue is related to some excessive exposition regarding the first act’s interrogatories. It’s great that every character gets their own motivations, but it feels like each confrontation with the detectives went on for a bit too long. Some pieces of the mystery might be a bit hard to believe that they would occur, but these are all nitpicks in a remarkable movie.\r\n\r\nIn the end, Rian Johnson is able to bounce back from the divisive The Last Jedi with one of the best whodunnits I’ve ever seen, Knives Out. Rian proves that not only he’s a talented filmmaker but also a phenomenal screenwriter. With a renowned and impressive ensemble cast, Daniel Craig and Ana de Armas are standouts within all of the other outstanding performances, Chris Evans being right behind. With one of the best screenplays of the year, the mystery at its center keeps everyone extremely captivated until the very end, even if you guess “who did it” beforehand. Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. It’s an entertaining story with tremendous replay value and significant political/social layers that only elevate the already complex yet subtle narrative. Don’t miss it!\r\n\r\nRating: A", "created_at": "2019-12-02T15:30:40.714Z"}, {"movie_id": 546554, "review_id": "5e0765984c1d9a0013e1cec8", "author_rating": 8.0, "review_text": "I did not think that _Last Jedi_ was a very good movie, but I have always been a fan of Rian Johnson. And honestly? _Knives Out_ is a strong contender for his best work yet. I have never seen a whodunnit like this before. Seeing this in a theatre was the poppy-poppy-paper of movie-going experiences, because I so enjoyed that. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T14:24:24.870Z"}, {"movie_id": 546554, "review_id": "5e2f2c3f98f1f1000ffd1ab3", "author_rating": 8.0, "review_text": "“This case is like a donut\r\nwith a hole\r\nin the middle of a donut hole.\r\nActually,\r\nit's a donut within a donut's hole.”\r\n\r\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.\r\n\r\nRian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.\r\n\r\nOne of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.\r\n\r\nThe cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.\r\n\r\nDose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.\r\n\r\nChris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.\r\n\r\nThe rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.\r\n\r\nToni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.\r\n\r\nJudging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.\r\n\r\nOverall rating: My House. My Rules. My Coffee!!!", "created_at": "2020-01-27T18:30:23.500Z"}, {"movie_id": 546554, "review_id": "5e4cb9e71e9225001dc8298f", "author_rating": 9.5, "review_text": "\"That certainly not what I was expecting.\"\r\n\r\n- Whodunit?\r\n- Rian Johnson.\r\n- Why?\r\n- To subvert the tropes of yet another sub-genre... properly!\r\n\r\nAs divisive as it was, I neither loved nor hated the love-it-or-hate-it The Last Jedi. Maybe because I'm not a huge fan of the much-beloved saga. But I can give you a quick opinion of what I thought about it anyway. The first half almost turned me off completely: tons of lame jokes and out-of-character moments that indicate that Johnson's biggest concern was to subvert expectations and nothing but. The second half of the film was way better. It proved to me that Johnson is actually very capable of adding fresh blood to the saga, so effortlessly to such an extent that I wondered why he struggled so much in the first half.\r\n\r\nIn Knives Out, Johnson didn't add a new spin on the 'whodunit' sub-genre of detective fiction; he took it and turned it on its head. He did so not only by playing with the tropes and mechanisms of this sub-genre -and boy, he did that so exquisitely and gracefully- but he also by using a new and very effective building block: Drama. It doesn't sound new, isn't it? But, actually, relying on it here, in this kind of a story, is nothing short of revolutionary, and that's simply lies in the fact it's unprecedented to build upon it here. The result is nothing but marvellous. And although that, at some point, the main concern of the plot wasn't the murder mystery per se, the mystery didn't lose its sharpness even a tiny bit. And that's a strong proof that everything worked, and integrated, seamlessly. I said integrated because the film has a plethora of comedic bits throughout its runtime -which flies by- and, to be honest, I think every single joke landed perfectly. The film also suggest a political agenda that's exquisitely woven into the plot, and provides a sharp social commentary that's impressively subtle.\r\n\r\nNot only did Rian Johnson reinvigorate this seemingly outmoded and unfruitful sub-genre, but he also did the same thing with a couple of members of the star-studded cast: I didn't know that Chris Evans, Captain America himself, would be better as, well, an \"Anti-Captain America \"; Craig as Blanc is absolutely phenomenal, with his southern accent and caricature detective character; and Jaeden Martell (IT) is very interesting as the weirdo Jacob Thrombey. As for Curtis, Langford, Plummer, Collette and Shannon, Johnson makes an excellent use of their incredible acting abilities, and of their facial expressions and features, especially Shannon with his remarkable menacing countenance. The real standout, though, is Ana de Armas. I mean, she was good in Blade Runner 2049, but here, as she plays my new favourite version of Pinocchio, she proves she's an exceptionally talented actress who is capable of expressing emotions, and changing them readily, only with her eyes. Honestly, I think she should have been nominated for an Oscar!\r\n\r\nOverall, I'm really surprised how much I loved this film. With Johnson superb and clever direction and meticulously-nuanced and witty -albeit slightly too-structured- screenplay, I think this is my favourite - even if it's not my highest-rated - film of 2019. You know what, this film is actually terrible: it's very pretentious; its puzzle is too convoluted for its own good; it has an overabundance of plot twists; it underutilized its stellar ensemble; and it has a lot of plot holes, or -in this case- donut holes! Excuse me, I gotta leave right now!\r\n\r\n(9.5/10)", "created_at": "2020-02-19T04:30:31.926Z"}, {"movie_id": 546554, "review_id": "5e6e92cea885870012e0919c", "author_rating": 8.0, "review_text": "Fun little murder-mystery starts off great, kind of loses a little steam in the middle, before rebounding nicely at the end. Fine performances all around, though especially Daniel Craig (reminded me why he was also great in The Girl with the Dragon Tattoo even with a starkly different tone). Also makes me remember Rian Johnson is a fine filmmaker (loved Brick). **4.0/5**", "created_at": "2020-03-15T20:40:46.985Z"}, {"movie_id": 546554, "review_id": "5eb8b013bbe1dd002083509e", "author_rating": null, "review_text": "This film had quite the rewatch value, keeping a consistent, yet entertaining thrill ride. Rian Johnson's original tale is strikingly filled with a talented ensemble, old-school-mystery-thrills and a sharp envisioning. Knives Out keeps the audience on their toes and brings a surprising delight towards it’s conclusion.", "created_at": "2020-05-11T01:53:23.215Z"}, {"movie_id": 546554, "review_id": "5ef3d8bf976a230035f890c5", "author_rating": null, "review_text": "Best way to watch is on big screen", "created_at": "2020-06-24T22:50:39.256Z"}, {"movie_id": 546554, "review_id": "5f238cf8eea34d0036374c27", "author_rating": 3.0, "review_text": "Caving to popular opinion and seeing this was a bad decision; Daniel Craig's accent is the only interesting aspect, and you can get that from the trailer.", "created_at": "2020-07-31T03:16:08.736Z"}, {"movie_id": 546554, "review_id": "5fe98984a14e10003b16a592", "author_rating": 7.0, "review_text": "80's actors meet the younger generation of Marvel and series for a huge \"camp it up\" under the patronage of Bond himself.", "created_at": "2020-12-28T07:30:12.521Z"}, {"movie_id": 546554, "review_id": "5ffbe21d1d01910041a01d10", "author_rating": 9.0, "review_text": "A great movie, entertaining and it has you playing detective right away. Great for all the Columbo wannabees.", "created_at": "2021-01-11T05:29:01.738Z"}, {"movie_id": 546554, "review_id": "5ffdab4b47c9fb004079c931", "author_rating": 10.0, "review_text": "Incredible. Loved it!\r\n\r\nEven on just one watch, it's one of my favourites already - I have a feeling I'll be revisiting this a lot. I had heard amazing things about this since its release and, man, is the hype befitting. It's a brilliant 131 minutes, even if it feels much shorter than that given how enjoyable it is.\r\n\r\nThe casting is impeccable. Daniel Craig is superb in the role of Blanc, I've actually found Craig a tad hit-and-miss - even with <em>'James Bond'</em> - but he is utterly superb here; even with that unusual yet definitely entertaining accent.\r\n\r\nIt's by no means The Craig Show, though. Ana de Armas is excellent as Marta, she does a lot of heavy lifting in terms of making her character's situation fully believable. She's great from start-to-finish.\r\n\r\nMichael Shannon is top notch too, I literally always find him fun to watch - from <em>'Boardwalk Empire'</em> to, even, <em>'Kangaroo Jack'</em>. Jamie Lee Curtis, Chris Evans, Don Johnson, Toni Collette, Lakeith Stanfield and Christopher Plummer are all fantastic too.\r\n\r\nThe plot is enthralling, it's crafted together expertly. It reveals bits way earlier than I was predicting, which made me worry it was going to all fall flat at any moment but it kept turning out to be the perfect time to twist the story. The comedy is also very funny, I laughed a fair amount.\r\n\r\nA joy to watch! I haven't got a bad word to say about <em>'Knives Out'</em>.", "created_at": "2021-01-12T13:59:39.453Z"}, {"movie_id": 546554, "review_id": "621a90802a210c001bca3645", "author_rating": 10.0, "review_text": "An incredibly well-crafted and beautifully shot whodunit with an impressive cast. ‘Knives Out’ keeps the viewer on the wrong track thanks to the ingenious script, bringing a surprising delight towards its conclusion, but without losing rewatch value.\r\n\r\n10/10", "created_at": "2022-02-26T20:41:36.548Z"}, {"movie_id": 546554, "review_id": "63bf6ab305a53300e99ad386", "author_rating": 1.0, "review_text": "So, this is a bad remake of Clue... but...\r\n\r\n\"The bad scores are because of Star Wars fans\" And, honestly I am sure that some of them are... but once more we see people attacking anyone that doesn't give a Rain Johnson 10 out of 10.\r\n\r\n\"The bad scores are conservative trolls\" And once again we see people, and Johnson, attacking anyone that doesn't like this film.\r\n\r\nOnce again people are throwing a fit because other people don't like the exact same thing they do.\r\n\r\nBut to be honest, again, I can see that. This is overtly political, and by \"overtly\" I mean that they are screaming through a megaphone, at just about every opportunity, to inject their politics into it.\r\n\r\nOther than that, it is kind of like Clue... if Clue was very careful not to insult some people in their jokes, and very focused in an attempt to insult others with a sheer and unadulterated prejudice. And that kind of makes for a very awkward film where the jokes are so self-aware they can't help but fail.\r\n\r\nSo, basically that is what you are getting, Clue with jokes aimed at the politically correct and a hearty injection of politics. And that is all you are getting.\r\n\r\nBut, hey, if you haven't seen Clue, you might like it. And, if you share the politics and think they should be shrieked in everything, you will totally like it.\r\n\r\nThe rest of us are just going to watch Clue.", "created_at": "2023-01-12T02:04:35.348Z"}, {"movie_id": 546554, "review_id": "650c7e5a4da3d400c9dce831", "author_rating": 7.0, "review_text": "**A novel written specifically for a dramatic work**\r\n\r\nThe story of the movie is simply that we have a person murdered and a group of people suspected of being involved in killing this person because they all have an interest or benefit that this person should die. The movie is simply ask who killing old Harlan Thrombey.\r\n\r\nOften these types of films and these types of stories that contain puzzles and crimes are based on old books such as Agatha Christie, Sherlock Holmes, or any other novel, but this story from the movie was written specifically in order to be made in a dramatic form because the story was written for the cinema and the way the story was implemented was far-fetched. Completely different from traditional methods. This is the strong aspect of the film due to its reliance on the theatrical system. It makes you contemplate the music, the method of filming, and the placement of the characters one after the other, as if you are watching a theatrical performance.\r\n\r\nThe most beautiful thing about this theatrical show is the way the characters are presented. Each character sees it for the first time when they are called for investigation by the police and who they are and what is their relationship to the victim. But what is beautiful is when the next character is identified and we know who she/he is and what her/his relationship is to the victim them We start to doubt the stories and information given by the previous character to the investigators\r\n\r\nWith more than one character and with more than one investigation, the contradictions will become clear. This will bring us to the question that comes to our minds after 40 minutes of the movie: Who killed Harlan Thrombey?", "created_at": "2023-09-21T17:33:14.088Z"}, {"movie_id": 546554, "review_id": "5ddbc870aad9c20012c232bd", "author_rating": 9.0, "review_text": "This is a crime thriller that’s been a long time in the making. Mystery fans rejoice: ‘Knives Out’ is an impeccable cinematic achievement, laced with sardonic wit, division and conflict, and of course a perplexing puzzle. This is easily one of the most fun films of 2019 - it’s both a brilliant piece of entertainment and beautifully crafted enigma. Sit back, relax, and try to crack the code.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-knives-out-a-whodunnit-worthy-of-agatha-christies-hercule-poirot", "created_at": "2019-11-25T12:26:24.819Z"}, {"movie_id": 546554, "review_id": "5de52e200cd44600123b777e", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nKnives Out has been shown in numerous festivals, and it received massive acclaim in literally every single one of them. Therefore, its hype grew more and more until its wide release date. Before the film, I can’t deny that I was indeed affected by the whole “a whodunnit like you haven’t seen in years.” I went into the theater with high expectations, not only due to the festival praise but due to its jaw-dropping cast. It’s uncommon to possess such a renowned ensemble and deliver a “bad” movie, especially when Rian Johnson is writing and directing it (yes, I like The Last Jedi, and even if I didn’t, he did other stuff, you know?). It’s one of those films everyone knows it’s going to be appreciated by a considerable part of the world.\r\n\r\nEven the genre itself is a very welcome type of cinema entertainment in regards to both critics and the general public. So, does it live up to its hype, or it fails to reach such high expectations? Knives Out is one of the best movies of the year, as well as one of the best mystery-suspense stories of the millennium (everyone is doing the whole “best X of the decade,” I’m going one step beyond). This is a film I know I’m going to rewatch countless times throughout the next years. Usually, when it comes to whodunnits, people are misled into thinking that from the moment they know who “did it,” the movie loses its interest. This is rarely true, and Rian Johnson succeeds because he doesn’t need the ultimate reveal to deliver a great story.\r\n\r\nThis screenplay is definitely getting tons of nominations and wins during the awards season. Every little line of dialogue means something. Every single character says or does something impactful to the narrative (except for Jaeden Martell’s). It’s been half-a-day since I’ve seen it, and for every question that my brain comes up with, there’s an answer lying on someone’s words or actions. It’s such an intricate, complex, extremely subtle script. One with so many tiny, little details that it’s impossible to catch them all on a first viewing.\r\n\r\nI genuinely love the first act, even if it’s the one where I have a minor issue. Rian Johnson doesn’t waste time and puts us directly in the crime scene, interviewing each and every member of the family. It’s through these interrogatories that he cleverly introduces the suspects, developing them solely through masterfully written dialogue, and outstanding performances. For example, with a single sentence and a particular body/face expression, Toni Collette instantly creates a profile of Joni, her character. Rian plays with character-types and cliches in such an intelligent manner. He makes us think a particular character follows a specific cliche, then it doesn’t, then it does again…\r\n\r\nThat’s one of the reasons I couldn’t figure out the mystery until the last act reveal. Every time I was close to indeed follow the right path, new developments arise, meant to mislead, confuse, and create doubts. Some people feel better with themselves if they solve the case before the film. They feel “intellectually superior” just because they found out before everyone else. First of all, I prefer being fooled and end up blown away by an unexpected conclusion than solving the whole thing way before time’s up and end up disappointed and bored. Then, honestly, anyone who says, “I guessed it,” there’s a 99% chance that they’re either lying or not answering correctly to the question “who killed Harlan?” If you’ve seen the movie, you’ll understand what I’m trying to express.\r\n\r\n(I don’t want to sound presumptuous or hypocritical. I’m not trying to say, “I couldn’t figure it out, so no one can.” Please, if you haven’t seen the film, judge the previous paragraph after your viewing.)\r\n\r\nThroughout the second and third acts, loose ends start to tie up, ending up with a brilliantly delivered reveal. From the marvelous cinematography (with those classic close-ups when a character is about to say something meaningful or tell a story through their imagination or memory) to the remarkable editing, the team behind Rian Johnson did a phenomenal job. The suspense is held at high levels, and it reaches limit-breaking points with Marta Cabrera’s (Ana de Armas) narrative. Armas and Daniel Craig deliver the standout performances, with Chris Evans (Ransom) following right behind. Literally, everyone else offers excellent displays, and help carry a story filled with mystery, but also with a lot of humor.\r\n\r\nHowever, I have to emphasize how astonishing Ana de Armas and Daniel Craig are. Ana might be a bit unknown to most people. I’ve been supporting her ever since Blade Runner 2049, so I’m ecstatic that she finally got a major role in a big movie, especially within an ensemble of actors with legendary careers. Craig, who could have just delivered a slight variation of the character he’s been playing for years, instead offers a unique take on the Detective role. Just like Evans, both have been playing iconic characters for years, so it’s sort of an extra joke to everyone who watched Captain America and James Bond for the past decade or so.\r\n\r\nMy only minor issue has nothing to do with the political undertone and the social messages Rian Johnson puts in this film. Honestly, I love that aspect of it. It’s like Rian knew some people would complain about it, so he made sure to have a couple of characters (Jaeden Martell’s Jacob and Katherine Langford’s Meg) somewhat resembling the so-called snowflakes and all that. No, my issue is related to some excessive exposition regarding the first act’s interrogatories. It’s great that every character gets their own motivations, but it feels like each confrontation with the detectives went on for a bit too long. Some pieces of the mystery might be a bit hard to believe that they would occur, but these are all nitpicks in a remarkable movie.\r\n\r\nIn the end, Rian Johnson is able to bounce back from the divisive The Last Jedi with one of the best whodunnits I’ve ever seen, Knives Out. Rian proves that not only he’s a talented filmmaker but also a phenomenal screenwriter. With a renowned and impressive ensemble cast, Daniel Craig and Ana de Armas are standouts within all of the other outstanding performances, Chris Evans being right behind. With one of the best screenplays of the year, the mystery at its center keeps everyone extremely captivated until the very end, even if you guess “who did it” beforehand. Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. It’s an entertaining story with tremendous replay value and significant political/social layers that only elevate the already complex yet subtle narrative. Don’t miss it!\r\n\r\nRating: A", "created_at": "2019-12-02T15:30:40.714Z"}, {"movie_id": 546554, "review_id": "5e0765984c1d9a0013e1cec8", "author_rating": 8.0, "review_text": "I did not think that _Last Jedi_ was a very good movie, but I have always been a fan of Rian Johnson. And honestly? _Knives Out_ is a strong contender for his best work yet. I have never seen a whodunnit like this before. Seeing this in a theatre was the poppy-poppy-paper of movie-going experiences, because I so enjoyed that. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T14:24:24.870Z"}, {"movie_id": 546554, "review_id": "5e2f2c3f98f1f1000ffd1ab3", "author_rating": 8.0, "review_text": "“This case is like a donut\r\nwith a hole\r\nin the middle of a donut hole.\r\nActually,\r\nit's a donut within a donut's hole.”\r\n\r\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.\r\n\r\nRian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.\r\n\r\nOne of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.\r\n\r\nThe cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.\r\n\r\nDose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.\r\n\r\nChris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.\r\n\r\nThe rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.\r\n\r\nToni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.\r\n\r\nJudging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.\r\n\r\nOverall rating: My House. My Rules. My Coffee!!!", "created_at": "2020-01-27T18:30:23.500Z"}, {"movie_id": 546554, "review_id": "5e4cb9e71e9225001dc8298f", "author_rating": 9.5, "review_text": "\"That certainly not what I was expecting.\"\r\n\r\n- Whodunit?\r\n- Rian Johnson.\r\n- Why?\r\n- To subvert the tropes of yet another sub-genre... properly!\r\n\r\nAs divisive as it was, I neither loved nor hated the love-it-or-hate-it The Last Jedi. Maybe because I'm not a huge fan of the much-beloved saga. But I can give you a quick opinion of what I thought about it anyway. The first half almost turned me off completely: tons of lame jokes and out-of-character moments that indicate that Johnson's biggest concern was to subvert expectations and nothing but. The second half of the film was way better. It proved to me that Johnson is actually very capable of adding fresh blood to the saga, so effortlessly to such an extent that I wondered why he struggled so much in the first half.\r\n\r\nIn Knives Out, Johnson didn't add a new spin on the 'whodunit' sub-genre of detective fiction; he took it and turned it on its head. He did so not only by playing with the tropes and mechanisms of this sub-genre -and boy, he did that so exquisitely and gracefully- but he also by using a new and very effective building block: Drama. It doesn't sound new, isn't it? But, actually, relying on it here, in this kind of a story, is nothing short of revolutionary, and that's simply lies in the fact it's unprecedented to build upon it here. The result is nothing but marvellous. And although that, at some point, the main concern of the plot wasn't the murder mystery per se, the mystery didn't lose its sharpness even a tiny bit. And that's a strong proof that everything worked, and integrated, seamlessly. I said integrated because the film has a plethora of comedic bits throughout its runtime -which flies by- and, to be honest, I think every single joke landed perfectly. The film also suggest a political agenda that's exquisitely woven into the plot, and provides a sharp social commentary that's impressively subtle.\r\n\r\nNot only did Rian Johnson reinvigorate this seemingly outmoded and unfruitful sub-genre, but he also did the same thing with a couple of members of the star-studded cast: I didn't know that Chris Evans, Captain America himself, would be better as, well, an \"Anti-Captain America \"; Craig as Blanc is absolutely phenomenal, with his southern accent and caricature detective character; and Jaeden Martell (IT) is very interesting as the weirdo Jacob Thrombey. As for Curtis, Langford, Plummer, Collette and Shannon, Johnson makes an excellent use of their incredible acting abilities, and of their facial expressions and features, especially Shannon with his remarkable menacing countenance. The real standout, though, is Ana de Armas. I mean, she was good in Blade Runner 2049, but here, as she plays my new favourite version of Pinocchio, she proves she's an exceptionally talented actress who is capable of expressing emotions, and changing them readily, only with her eyes. Honestly, I think she should have been nominated for an Oscar!\r\n\r\nOverall, I'm really surprised how much I loved this film. With Johnson superb and clever direction and meticulously-nuanced and witty -albeit slightly too-structured- screenplay, I think this is my favourite - even if it's not my highest-rated - film of 2019. You know what, this film is actually terrible: it's very pretentious; its puzzle is too convoluted for its own good; it has an overabundance of plot twists; it underutilized its stellar ensemble; and it has a lot of plot holes, or -in this case- donut holes! Excuse me, I gotta leave right now!\r\n\r\n(9.5/10)", "created_at": "2020-02-19T04:30:31.926Z"}, {"movie_id": 546554, "review_id": "5e6e92cea885870012e0919c", "author_rating": 8.0, "review_text": "Fun little murder-mystery starts off great, kind of loses a little steam in the middle, before rebounding nicely at the end. Fine performances all around, though especially Daniel Craig (reminded me why he was also great in The Girl with the Dragon Tattoo even with a starkly different tone). Also makes me remember Rian Johnson is a fine filmmaker (loved Brick). **4.0/5**", "created_at": "2020-03-15T20:40:46.985Z"}, {"movie_id": 546554, "review_id": "5eb8b013bbe1dd002083509e", "author_rating": null, "review_text": "This film had quite the rewatch value, keeping a consistent, yet entertaining thrill ride. Rian Johnson's original tale is strikingly filled with a talented ensemble, old-school-mystery-thrills and a sharp envisioning. Knives Out keeps the audience on their toes and brings a surprising delight towards it’s conclusion.", "created_at": "2020-05-11T01:53:23.215Z"}, {"movie_id": 546554, "review_id": "5ef3d8bf976a230035f890c5", "author_rating": null, "review_text": "Best way to watch is on big screen", "created_at": "2020-06-24T22:50:39.256Z"}, {"movie_id": 546554, "review_id": "5f238cf8eea34d0036374c27", "author_rating": 3.0, "review_text": "Caving to popular opinion and seeing this was a bad decision; Daniel Craig's accent is the only interesting aspect, and you can get that from the trailer.", "created_at": "2020-07-31T03:16:08.736Z"}, {"movie_id": 546554, "review_id": "5fe98984a14e10003b16a592", "author_rating": 7.0, "review_text": "80's actors meet the younger generation of Marvel and series for a huge \"camp it up\" under the patronage of Bond himself.", "created_at": "2020-12-28T07:30:12.521Z"}, {"movie_id": 546554, "review_id": "5ffbe21d1d01910041a01d10", "author_rating": 9.0, "review_text": "A great movie, entertaining and it has you playing detective right away. Great for all the Columbo wannabees.", "created_at": "2021-01-11T05:29:01.738Z"}, {"movie_id": 546554, "review_id": "5ffdab4b47c9fb004079c931", "author_rating": 10.0, "review_text": "Incredible. Loved it!\r\n\r\nEven on just one watch, it's one of my favourites already - I have a feeling I'll be revisiting this a lot. I had heard amazing things about this since its release and, man, is the hype befitting. It's a brilliant 131 minutes, even if it feels much shorter than that given how enjoyable it is.\r\n\r\nThe casting is impeccable. Daniel Craig is superb in the role of Blanc, I've actually found Craig a tad hit-and-miss - even with <em>'James Bond'</em> - but he is utterly superb here; even with that unusual yet definitely entertaining accent.\r\n\r\nIt's by no means The Craig Show, though. Ana de Armas is excellent as Marta, she does a lot of heavy lifting in terms of making her character's situation fully believable. She's great from start-to-finish.\r\n\r\nMichael Shannon is top notch too, I literally always find him fun to watch - from <em>'Boardwalk Empire'</em> to, even, <em>'Kangaroo Jack'</em>. Jamie Lee Curtis, Chris Evans, Don Johnson, Toni Collette, Lakeith Stanfield and Christopher Plummer are all fantastic too.\r\n\r\nThe plot is enthralling, it's crafted together expertly. It reveals bits way earlier than I was predicting, which made me worry it was going to all fall flat at any moment but it kept turning out to be the perfect time to twist the story. The comedy is also very funny, I laughed a fair amount.\r\n\r\nA joy to watch! I haven't got a bad word to say about <em>'Knives Out'</em>.", "created_at": "2021-01-12T13:59:39.453Z"}, {"movie_id": 546554, "review_id": "621a90802a210c001bca3645", "author_rating": 10.0, "review_text": "An incredibly well-crafted and beautifully shot whodunit with an impressive cast. ‘Knives Out’ keeps the viewer on the wrong track thanks to the ingenious script, bringing a surprising delight towards its conclusion, but without losing rewatch value.\r\n\r\n10/10", "created_at": "2022-02-26T20:41:36.548Z"}, {"movie_id": 546554, "review_id": "63bf6ab305a53300e99ad386", "author_rating": 1.0, "review_text": "So, this is a bad remake of Clue... but...\r\n\r\n\"The bad scores are because of Star Wars fans\" And, honestly I am sure that some of them are... but once more we see people attacking anyone that doesn't give a Rain Johnson 10 out of 10.\r\n\r\n\"The bad scores are conservative trolls\" And once again we see people, and Johnson, attacking anyone that doesn't like this film.\r\n\r\nOnce again people are throwing a fit because other people don't like the exact same thing they do.\r\n\r\nBut to be honest, again, I can see that. This is overtly political, and by \"overtly\" I mean that they are screaming through a megaphone, at just about every opportunity, to inject their politics into it.\r\n\r\nOther than that, it is kind of like Clue... if Clue was very careful not to insult some people in their jokes, and very focused in an attempt to insult others with a sheer and unadulterated prejudice. And that kind of makes for a very awkward film where the jokes are so self-aware they can't help but fail.\r\n\r\nSo, basically that is what you are getting, Clue with jokes aimed at the politically correct and a hearty injection of politics. And that is all you are getting.\r\n\r\nBut, hey, if you haven't seen Clue, you might like it. And, if you share the politics and think they should be shrieked in everything, you will totally like it.\r\n\r\nThe rest of us are just going to watch Clue.", "created_at": "2023-01-12T02:04:35.348Z"}, {"movie_id": 546554, "review_id": "650c7e5a4da3d400c9dce831", "author_rating": 7.0, "review_text": "**A novel written specifically for a dramatic work**\r\n\r\nThe story of the movie is simply that we have a person murdered and a group of people suspected of being involved in killing this person because they all have an interest or benefit that this person should die. The movie is simply ask who killing old Harlan Thrombey.\r\n\r\nOften these types of films and these types of stories that contain puzzles and crimes are based on old books such as Agatha Christie, Sherlock Holmes, or any other novel, but this story from the movie was written specifically in order to be made in a dramatic form because the story was written for the cinema and the way the story was implemented was far-fetched. Completely different from traditional methods. This is the strong aspect of the film due to its reliance on the theatrical system. It makes you contemplate the music, the method of filming, and the placement of the characters one after the other, as if you are watching a theatrical performance.\r\n\r\nThe most beautiful thing about this theatrical show is the way the characters are presented. Each character sees it for the first time when they are called for investigation by the police and who they are and what is their relationship to the victim. But what is beautiful is when the next character is identified and we know who she/he is and what her/his relationship is to the victim them We start to doubt the stories and information given by the previous character to the investigators\r\n\r\nWith more than one character and with more than one investigation, the contradictions will become clear. This will bring us to the question that comes to our minds after 40 minutes of the movie: Who killed Harlan Thrombey?", "created_at": "2023-09-21T17:33:14.088Z"}, {"movie_id": 546554, "review_id": "5ddbc870aad9c20012c232bd", "author_rating": 9.0, "review_text": "This is a crime thriller that’s been a long time in the making. Mystery fans rejoice: ‘Knives Out’ is an impeccable cinematic achievement, laced with sardonic wit, division and conflict, and of course a perplexing puzzle. This is easily one of the most fun films of 2019 - it’s both a brilliant piece of entertainment and beautifully crafted enigma. Sit back, relax, and try to crack the code.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-knives-out-a-whodunnit-worthy-of-agatha-christies-hercule-poirot", "created_at": "2019-11-25T12:26:24.819Z"}, {"movie_id": 546554, "review_id": "5de52e200cd44600123b777e", "author_rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nKnives Out has been shown in numerous festivals, and it received massive acclaim in literally every single one of them. Therefore, its hype grew more and more until its wide release date. Before the film, I can’t deny that I was indeed affected by the whole “a whodunnit like you haven’t seen in years.” I went into the theater with high expectations, not only due to the festival praise but due to its jaw-dropping cast. It’s uncommon to possess such a renowned ensemble and deliver a “bad” movie, especially when Rian Johnson is writing and directing it (yes, I like The Last Jedi, and even if I didn’t, he did other stuff, you know?). It’s one of those films everyone knows it’s going to be appreciated by a considerable part of the world.\r\n\r\nEven the genre itself is a very welcome type of cinema entertainment in regards to both critics and the general public. So, does it live up to its hype, or it fails to reach such high expectations? Knives Out is one of the best movies of the year, as well as one of the best mystery-suspense stories of the millennium (everyone is doing the whole “best X of the decade,” I’m going one step beyond). This is a film I know I’m going to rewatch countless times throughout the next years. Usually, when it comes to whodunnits, people are misled into thinking that from the moment they know who “did it,” the movie loses its interest. This is rarely true, and Rian Johnson succeeds because he doesn’t need the ultimate reveal to deliver a great story.\r\n\r\nThis screenplay is definitely getting tons of nominations and wins during the awards season. Every little line of dialogue means something. Every single character says or does something impactful to the narrative (except for Jaeden Martell’s). It’s been half-a-day since I’ve seen it, and for every question that my brain comes up with, there’s an answer lying on someone’s words or actions. It’s such an intricate, complex, extremely subtle script. One with so many tiny, little details that it’s impossible to catch them all on a first viewing.\r\n\r\nI genuinely love the first act, even if it’s the one where I have a minor issue. Rian Johnson doesn’t waste time and puts us directly in the crime scene, interviewing each and every member of the family. It’s through these interrogatories that he cleverly introduces the suspects, developing them solely through masterfully written dialogue, and outstanding performances. For example, with a single sentence and a particular body/face expression, Toni Collette instantly creates a profile of Joni, her character. Rian plays with character-types and cliches in such an intelligent manner. He makes us think a particular character follows a specific cliche, then it doesn’t, then it does again…\r\n\r\nThat’s one of the reasons I couldn’t figure out the mystery until the last act reveal. Every time I was close to indeed follow the right path, new developments arise, meant to mislead, confuse, and create doubts. Some people feel better with themselves if they solve the case before the film. They feel “intellectually superior” just because they found out before everyone else. First of all, I prefer being fooled and end up blown away by an unexpected conclusion than solving the whole thing way before time’s up and end up disappointed and bored. Then, honestly, anyone who says, “I guessed it,” there’s a 99% chance that they’re either lying or not answering correctly to the question “who killed Harlan?” If you’ve seen the movie, you’ll understand what I’m trying to express.\r\n\r\n(I don’t want to sound presumptuous or hypocritical. I’m not trying to say, “I couldn’t figure it out, so no one can.” Please, if you haven’t seen the film, judge the previous paragraph after your viewing.)\r\n\r\nThroughout the second and third acts, loose ends start to tie up, ending up with a brilliantly delivered reveal. From the marvelous cinematography (with those classic close-ups when a character is about to say something meaningful or tell a story through their imagination or memory) to the remarkable editing, the team behind Rian Johnson did a phenomenal job. The suspense is held at high levels, and it reaches limit-breaking points with Marta Cabrera’s (Ana de Armas) narrative. Armas and Daniel Craig deliver the standout performances, with Chris Evans (Ransom) following right behind. Literally, everyone else offers excellent displays, and help carry a story filled with mystery, but also with a lot of humor.\r\n\r\nHowever, I have to emphasize how astonishing Ana de Armas and Daniel Craig are. Ana might be a bit unknown to most people. I’ve been supporting her ever since Blade Runner 2049, so I’m ecstatic that she finally got a major role in a big movie, especially within an ensemble of actors with legendary careers. Craig, who could have just delivered a slight variation of the character he’s been playing for years, instead offers a unique take on the Detective role. Just like Evans, both have been playing iconic characters for years, so it’s sort of an extra joke to everyone who watched Captain America and James Bond for the past decade or so.\r\n\r\nMy only minor issue has nothing to do with the political undertone and the social messages Rian Johnson puts in this film. Honestly, I love that aspect of it. It’s like Rian knew some people would complain about it, so he made sure to have a couple of characters (Jaeden Martell’s Jacob and Katherine Langford’s Meg) somewhat resembling the so-called snowflakes and all that. No, my issue is related to some excessive exposition regarding the first act’s interrogatories. It’s great that every character gets their own motivations, but it feels like each confrontation with the detectives went on for a bit too long. Some pieces of the mystery might be a bit hard to believe that they would occur, but these are all nitpicks in a remarkable movie.\r\n\r\nIn the end, Rian Johnson is able to bounce back from the divisive The Last Jedi with one of the best whodunnits I’ve ever seen, Knives Out. Rian proves that not only he’s a talented filmmaker but also a phenomenal screenwriter. With a renowned and impressive ensemble cast, Daniel Craig and Ana de Armas are standouts within all of the other outstanding performances, Chris Evans being right behind. With one of the best screenplays of the year, the mystery at its center keeps everyone extremely captivated until the very end, even if you guess “who did it” beforehand. Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. It’s an entertaining story with tremendous replay value and significant political/social layers that only elevate the already complex yet subtle narrative. Don’t miss it!\r\n\r\nRating: A", "created_at": "2019-12-02T15:30:40.714Z"}, {"movie_id": 546554, "review_id": "5e0765984c1d9a0013e1cec8", "author_rating": 8.0, "review_text": "I did not think that _Last Jedi_ was a very good movie, but I have always been a fan of Rian Johnson. And honestly? _Knives Out_ is a strong contender for his best work yet. I have never seen a whodunnit like this before. Seeing this in a theatre was the poppy-poppy-paper of movie-going experiences, because I so enjoyed that. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T14:24:24.870Z"}, {"movie_id": 546554, "review_id": "5e2f2c3f98f1f1000ffd1ab3", "author_rating": 8.0, "review_text": "“This case is like a donut\r\nwith a hole\r\nin the middle of a donut hole.\r\nActually,\r\nit's a donut within a donut's hole.”\r\n\r\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.\r\n\r\nRian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.\r\n\r\nOne of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.\r\n\r\nThe cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.\r\n\r\nDose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.\r\n\r\nChris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.\r\n\r\nThe rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.\r\n\r\nToni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.\r\n\r\nJudging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.\r\n\r\nOverall rating: My House. My Rules. My Coffee!!!", "created_at": "2020-01-27T18:30:23.500Z"}, {"movie_id": 546554, "review_id": "5e4cb9e71e9225001dc8298f", "author_rating": 9.5, "review_text": "\"That certainly not what I was expecting.\"\r\n\r\n- Whodunit?\r\n- Rian Johnson.\r\n- Why?\r\n- To subvert the tropes of yet another sub-genre... properly!\r\n\r\nAs divisive as it was, I neither loved nor hated the love-it-or-hate-it The Last Jedi. Maybe because I'm not a huge fan of the much-beloved saga. But I can give you a quick opinion of what I thought about it anyway. The first half almost turned me off completely: tons of lame jokes and out-of-character moments that indicate that Johnson's biggest concern was to subvert expectations and nothing but. The second half of the film was way better. It proved to me that Johnson is actually very capable of adding fresh blood to the saga, so effortlessly to such an extent that I wondered why he struggled so much in the first half.\r\n\r\nIn Knives Out, Johnson didn't add a new spin on the 'whodunit' sub-genre of detective fiction; he took it and turned it on its head. He did so not only by playing with the tropes and mechanisms of this sub-genre -and boy, he did that so exquisitely and gracefully- but he also by using a new and very effective building block: Drama. It doesn't sound new, isn't it? But, actually, relying on it here, in this kind of a story, is nothing short of revolutionary, and that's simply lies in the fact it's unprecedented to build upon it here. The result is nothing but marvellous. And although that, at some point, the main concern of the plot wasn't the murder mystery per se, the mystery didn't lose its sharpness even a tiny bit. And that's a strong proof that everything worked, and integrated, seamlessly. I said integrated because the film has a plethora of comedic bits throughout its runtime -which flies by- and, to be honest, I think every single joke landed perfectly. The film also suggest a political agenda that's exquisitely woven into the plot, and provides a sharp social commentary that's impressively subtle.\r\n\r\nNot only did Rian Johnson reinvigorate this seemingly outmoded and unfruitful sub-genre, but he also did the same thing with a couple of members of the star-studded cast: I didn't know that Chris Evans, Captain America himself, would be better as, well, an \"Anti-Captain America \"; Craig as Blanc is absolutely phenomenal, with his southern accent and caricature detective character; and Jaeden Martell (IT) is very interesting as the weirdo Jacob Thrombey. As for Curtis, Langford, Plummer, Collette and Shannon, Johnson makes an excellent use of their incredible acting abilities, and of their facial expressions and features, especially Shannon with his remarkable menacing countenance. The real standout, though, is Ana de Armas. I mean, she was good in Blade Runner 2049, but here, as she plays my new favourite version of Pinocchio, she proves she's an exceptionally talented actress who is capable of expressing emotions, and changing them readily, only with her eyes. Honestly, I think she should have been nominated for an Oscar!\r\n\r\nOverall, I'm really surprised how much I loved this film. With Johnson superb and clever direction and meticulously-nuanced and witty -albeit slightly too-structured- screenplay, I think this is my favourite - even if it's not my highest-rated - film of 2019. You know what, this film is actually terrible: it's very pretentious; its puzzle is too convoluted for its own good; it has an overabundance of plot twists; it underutilized its stellar ensemble; and it has a lot of plot holes, or -in this case- donut holes! Excuse me, I gotta leave right now!\r\n\r\n(9.5/10)", "created_at": "2020-02-19T04:30:31.926Z"}, {"movie_id": 546554, "review_id": "5e6e92cea885870012e0919c", "author_rating": 8.0, "review_text": "Fun little murder-mystery starts off great, kind of loses a little steam in the middle, before rebounding nicely at the end. Fine performances all around, though especially Daniel Craig (reminded me why he was also great in The Girl with the Dragon Tattoo even with a starkly different tone). Also makes me remember Rian Johnson is a fine filmmaker (loved Brick). **4.0/5**", "created_at": "2020-03-15T20:40:46.985Z"}, {"movie_id": 546554, "review_id": "5eb8b013bbe1dd002083509e", "author_rating": null, "review_text": "This film had quite the rewatch value, keeping a consistent, yet entertaining thrill ride. Rian Johnson's original tale is strikingly filled with a talented ensemble, old-school-mystery-thrills and a sharp envisioning. Knives Out keeps the audience on their toes and brings a surprising delight towards it’s conclusion.", "created_at": "2020-05-11T01:53:23.215Z"}, {"movie_id": 546554, "review_id": "5ef3d8bf976a230035f890c5", "author_rating": null, "review_text": "Best way to watch is on big screen", "created_at": "2020-06-24T22:50:39.256Z"}, {"movie_id": 546554, "review_id": "5f238cf8eea34d0036374c27", "author_rating": 3.0, "review_text": "Caving to popular opinion and seeing this was a bad decision; Daniel Craig's accent is the only interesting aspect, and you can get that from the trailer.", "created_at": "2020-07-31T03:16:08.736Z"}, {"movie_id": 546554, "review_id": "5fe98984a14e10003b16a592", "author_rating": 7.0, "review_text": "80's actors meet the younger generation of Marvel and series for a huge \"camp it up\" under the patronage of Bond himself.", "created_at": "2020-12-28T07:30:12.521Z"}, {"movie_id": 546554, "review_id": "5ffbe21d1d01910041a01d10", "author_rating": 9.0, "review_text": "A great movie, entertaining and it has you playing detective right away. Great for all the Columbo wannabees.", "created_at": "2021-01-11T05:29:01.738Z"}, {"movie_id": 546554, "review_id": "5ffdab4b47c9fb004079c931", "author_rating": 10.0, "review_text": "Incredible. Loved it!\r\n\r\nEven on just one watch, it's one of my favourites already - I have a feeling I'll be revisiting this a lot. I had heard amazing things about this since its release and, man, is the hype befitting. It's a brilliant 131 minutes, even if it feels much shorter than that given how enjoyable it is.\r\n\r\nThe casting is impeccable. Daniel Craig is superb in the role of Blanc, I've actually found Craig a tad hit-and-miss - even with <em>'James Bond'</em> - but he is utterly superb here; even with that unusual yet definitely entertaining accent.\r\n\r\nIt's by no means The Craig Show, though. Ana de Armas is excellent as Marta, she does a lot of heavy lifting in terms of making her character's situation fully believable. She's great from start-to-finish.\r\n\r\nMichael Shannon is top notch too, I literally always find him fun to watch - from <em>'Boardwalk Empire'</em> to, even, <em>'Kangaroo Jack'</em>. Jamie Lee Curtis, Chris Evans, Don Johnson, Toni Collette, Lakeith Stanfield and Christopher Plummer are all fantastic too.\r\n\r\nThe plot is enthralling, it's crafted together expertly. It reveals bits way earlier than I was predicting, which made me worry it was going to all fall flat at any moment but it kept turning out to be the perfect time to twist the story. The comedy is also very funny, I laughed a fair amount.\r\n\r\nA joy to watch! I haven't got a bad word to say about <em>'Knives Out'</em>.", "created_at": "2021-01-12T13:59:39.453Z"}, {"movie_id": 546554, "review_id": "621a90802a210c001bca3645", "author_rating": 10.0, "review_text": "An incredibly well-crafted and beautifully shot whodunit with an impressive cast. ‘Knives Out’ keeps the viewer on the wrong track thanks to the ingenious script, bringing a surprising delight towards its conclusion, but without losing rewatch value.\r\n\r\n10/10", "created_at": "2022-02-26T20:41:36.548Z"}, {"movie_id": 546554, "review_id": "63bf6ab305a53300e99ad386", "author_rating": 1.0, "review_text": "So, this is a bad remake of Clue... but...\r\n\r\n\"The bad scores are because of Star Wars fans\" And, honestly I am sure that some of them are... but once more we see people attacking anyone that doesn't give a Rain Johnson 10 out of 10.\r\n\r\n\"The bad scores are conservative trolls\" And once again we see people, and Johnson, attacking anyone that doesn't like this film.\r\n\r\nOnce again people are throwing a fit because other people don't like the exact same thing they do.\r\n\r\nBut to be honest, again, I can see that. This is overtly political, and by \"overtly\" I mean that they are screaming through a megaphone, at just about every opportunity, to inject their politics into it.\r\n\r\nOther than that, it is kind of like Clue... if Clue was very careful not to insult some people in their jokes, and very focused in an attempt to insult others with a sheer and unadulterated prejudice. And that kind of makes for a very awkward film where the jokes are so self-aware they can't help but fail.\r\n\r\nSo, basically that is what you are getting, Clue with jokes aimed at the politically correct and a hearty injection of politics. And that is all you are getting.\r\n\r\nBut, hey, if you haven't seen Clue, you might like it. And, if you share the politics and think they should be shrieked in everything, you will totally like it.\r\n\r\nThe rest of us are just going to watch Clue.", "created_at": "2023-01-12T02:04:35.348Z"}, {"movie_id": 546554, "review_id": "650c7e5a4da3d400c9dce831", "author_rating": 7.0, "review_text": "**A novel written specifically for a dramatic work**\r\n\r\nThe story of the movie is simply that we have a person murdered and a group of people suspected of being involved in killing this person because they all have an interest or benefit that this person should die. The movie is simply ask who killing old Harlan Thrombey.\r\n\r\nOften these types of films and these types of stories that contain puzzles and crimes are based on old books such as Agatha Christie, Sherlock Holmes, or any other novel, but this story from the movie was written specifically in order to be made in a dramatic form because the story was written for the cinema and the way the story was implemented was far-fetched. Completely different from traditional methods. This is the strong aspect of the film due to its reliance on the theatrical system. It makes you contemplate the music, the method of filming, and the placement of the characters one after the other, as if you are watching a theatrical performance.\r\n\r\nThe most beautiful thing about this theatrical show is the way the characters are presented. Each character sees it for the first time when they are called for investigation by the police and who they are and what is their relationship to the victim. But what is beautiful is when the next character is identified and we know who she/he is and what her/his relationship is to the victim them We start to doubt the stories and information given by the previous character to the investigators\r\n\r\nWith more than one character and with more than one investigation, the contradictions will become clear. This will bring us to the question that comes to our minds after 40 minutes of the movie: Who killed Harlan Thrombey?", "created_at": "2023-09-21T17:33:14.088Z"}]