[{"movie_id": 214086, "review_id": "63098485e18b97007bdaa161", "author_rating": 1.0, "review_text": "I never thought I’d use the term Idiot Plot to refer to a film starring Annette Bening, Ed Harris, and Robin Williams, but then I’d never watched The Face of Love. Nikki (Bening) is a widow who is still pining for her dead husband Garrett (Ed Harris) five years after he drowned on a beach in Mexico. \r\n\r\nOne day she meets Tom (also Harris), who looks so much like her late husband – complete with the exact same tone of voice and male pattern baldness – that the only possible explanation is that Garrett and Tom were twins separated at birth (I would also accept cloning, at least as the movies usually (mis)understand it).\r\n\r\nThe movie, however, offers no explanation for the fact that Tom is a perfect replica – down to each and every single wrinkle – of Garrett (or viceversa), other than “you know what they say. We all have a double somewhere in the world.” \r\n\r\nNikki becomes romantically involved with Tom, but never even bothers to mention his uncanny resemblance to her defunct spouse. Why not? It would be the perfect icebreaker, and Tom would know it’s not just a pick-up line as soon as Nikki shows her a picture of Garrett.\r\n\r\nShe is also concerned, more reasonably so given the circumstances, by what people, especially her daughter Summer (Jess Weixler) and neighbor Roger (Williams), might think about her dating someone who appears to be an alternate reality version of Garrett. \r\n\r\nThis actually leads me to believe that TFoL would have worked better as a comedy, with Nikki going out of her way to talk Tom into an extreme makeover – the movie, nevertheless, is hell-bent on being a drama, and in that sense it would have been well advised to have Tom played by an actor who isn’t Harris but can reasonably pass for him (John Malkovich, maybe?).\r\n\r\nGiven the quality and credentials of the stars, I have no choice but to point an accusatory finger at director Arie Posin and co-writers Posin and Matthew McDuffie, who manage to get wrong even what they get right; case in point, Williams gives the film’s best performance in what is essentially a throwaway role – one would have expected Roger, who was Garrett’s friend and has feelings for Nikki, to at least attempt to drive a wedge between the lovers, but he and Tom never even come face to face (again, if this were a comedy, and I’m more and more convinced it should have been one, Roger would have gone to hilarious extremes to shape himself in Garrett’s/Tom’s likeness to win Nikki over. Oh well).", "created_at": "2022-08-27T02:42:13.441Z"}]