[{"movie_id": 508947, "review_id": "62261176c995ee006eb61b4d", "author_rating": null, "review_text": "The digital animation geniuses at Pixar are back with “Turning Red” and it marks a departure for the studio known for the “Toy Story” and “Cars”, franchises.\r\n\r\nSet in 1990s Toronto, the film centers around 8th grader Mei (Rosalie Chiang), who considers herself an adult at 13 and eagerly applies herself to school when she is not helping her family tour business at a local Temple or hanging with her friends.\r\n\r\nLife comes crashing to a halt when after a traumatic day of embarrassment; Mei awakens in the form of a large Red Panda. In a panic, Mei attempts to hide her situation which causes her over-protective mother to assume it is Puberty related and that her hormones are kicking in.\r\n\r\nMei desperately wants to get her life back to normal and learns that as long as she is calm her Panda is under control. However, this proves to be harder than expected and soon Mei learns that the Panda is the result of a family bloodline but there is a way to end it during a Lunar ceremony in a couple of weeks.\r\n\r\nChaos soon follows as Mei struggles with her situation and must find a way to cope with the changes that are going on and make some very important decisions about her life and her future.\r\n\r\nThe film is a difficult one to review for me as never having been a teenage girl dealing with puberty, raging estrogen, and the issues that go with it.  That being said the film struggles to find a balance as it tacks on the capers of Mei in Panda form without being overly funny or charming and keeps the focus on Teen Angst, puberty-related issues and becoming an adult.\r\n\r\nThe film lacks the interesting characters, charm, and appeal that have set the foundation for so many Pixar films and it is surprising that a company that can elicit a range of emotions in an animated short fail to really connect with their latest feature. There were some amusing parts but the film as a whole was rather dull and lacked much in the way of humor and was very predictable.\r\n\r\nThe decision to put the film directly on Disney+ as the studio’s recent “Soul” and “Luca” was raised some controversy but in the end, I do believe it was the right decision as “Turning Red” is not likely to be a film that draws people to the cinema beyond the opening weekend.\r\n\r\nIt is a film that is a bold step for the company, but one that lacks the charm and humor of previous films as not everyone is going to want to sit through a feature-length film on teenage angst and dealing with changing bodies and the emotional turmoil that follows.  However, the target audience is likely to connect with the characters and it will be interesting to see what the reaction to the film is long-term.\r\n\r\n3 stars out of 5\r\n\r\n“Turning Red” will debut on Disney+ on March 11th", "created_at": "2022-03-07T14:06:46.684Z"}, {"movie_id": 508947, "review_id": "6226253c1b7c590042aaeb53", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/turning-red-spoiler-free-review\r\n\r\n\"Turning Red is undoubtedly the riskiest, possibly the most divisive work in Pixar history. Without any remorse or restraint, Domee Shi and Julia Cho unapologetically approach the sensitive topic of (female) puberty in a quite shocking, positively impactful manner.\r\n\r\nA narrative that unquestionably explores the hormonal, emotional, and sexual developments of its characters, conveying a message of self-acceptance and understanding of human evolution through its metaphors loaded with youthful excitement.\r\n\r\nWith the well-known technical attributes from the successful studio, this film will serve as an essential companion for all pre-teens who will deal with or are going through this inevitable and \"inconvenient\" phase of life.\r\n\r\nOne of the best movies of the year until this day.\"\r\n\r\nRating: A-", "created_at": "2022-03-07T15:31:08.470Z"}, {"movie_id": 508947, "review_id": "622b6062498ef9001a41b169", "author_rating": 8.0, "review_text": "Well worth a watch, this.\r\n\r\n<em>'Turning Red'</em> is a very good flick from Disney/Pixar. It's different in a way, I wasn't sure how it was going to turn out based on the first few minutes but by the end it provides the required and expected amount of entertainment and meaning.\r\n\r\nThe voice cast are excellent, I have no faults with them. Rosalie Chiang gives a performance full of energy in the lead role, while Sandra Oh puts in a strong display alongside Chiang. The rest of them are good too, as I also recognised James Hong and Lori Tan Chinn. Us UK viewers also have the bonus of a small role for Anne-Marie.", "created_at": "2022-03-11T14:44:50.977Z"}, {"movie_id": 508947, "review_id": "62367a3a53866e007e2e81af", "author_rating": 5.0, "review_text": "Kinda boring", "created_at": "2022-03-20T00:50:02.378Z"}, {"movie_id": 508947, "review_id": "623796c71d820f0044cef423", "author_rating": 9.0, "review_text": "Full Analysis at Spotamovie.com - **Intro** - Pixar’s movies usually have great insights, and even with Turning Red, they provided us with meaningful messages to help our children and us grow our personalities and mindset. - **The Story** - Meilin is an energetic teenager ready to walk into the grown-up world. However, she needs to wear a mask when she is with her parents and another one when she is at school and with her friends. The risk to disappoint her family is too big for Meilin. But something unexpected will happen. Meilin’s life will change drastically because of a secret that lives within her family. When Meilin can’t control her emotions, a new version of herself will appear. But can you hold your feelings? - **Full Analysis and Explanation at** https://www.spotamovie.com/turning-red-review-and-explanation-critic-post-movie-disney-movie-2022", "created_at": "2022-03-20T21:04:07.947Z"}, {"movie_id": 508947, "review_id": "6240906481a7fc00472dd07f", "author_rating": 8.0, "review_text": "Really going to put people on blast for somehow not being able to relate to a movie with themes of controlling parents, puberty emotions, and body image just because it’s in the coat of 13 year old tween Asian angst, shouldn’t the fact that it’s more specific actually be more relatable if you have empathy?\r\nBroke down at the theme of \"never being good enough for parents\", them having their ideas of my future vs. my own. Great music, best animation from Pixar in a while, super expressive.", "created_at": "2022-03-27T16:27:16.078Z"}, {"movie_id": 508947, "review_id": "624ac1c28c7b0f004e5be7a8", "author_rating": 6.0, "review_text": "This has quite a fun premiss but I guess I'm just the wrong demographic because I really struggled to get through it. \"Meilin\" is a thirteen year old girl going through the usual teenage angst sort of stuff - only, when she gets agitated she morphs into a giant panda. A red one. Her mother \"Ming\" is a bit over-protective and when her daughter announces that she wants to go and see a boy-band concert with her friends, a war of wills ensues. It soon turns out that these transformation skills run in the family, and huge great angry pandas are not to be messed with. The animation is fine and Eilish/O'Connell have written some fitting, if hardly their most memorable, numbers, but it is just too long and the theme recycles itself once too often for my old eyes. Colourful enough, but for me it just re-emphasised why I am very, very, glad I am no longer 13! (or even 31!)", "created_at": "2022-04-04T10:00:34.832Z"}, {"movie_id": 508947, "review_id": "62caabd090b87e07586452eb", "author_rating": 8.0, "review_text": "It is great!!", "created_at": "2022-07-10T10:37:04.881Z"}, {"movie_id": 508947, "review_id": "631fa6af9c24fc0091e2e7fd", "author_rating": null, "review_text": "Animation that makes me feel alive!! Right up there with Monsters Inc. for the funniest Pixar movie. It balances its tone well, the characters and world it builds are so much fun while still managing to hit emotional beats with ease. Films exploring generational trauma and emotional/personal repression are apparently my jam? Top-tier.", "created_at": "2022-09-12T21:37:51.566Z"}, {"movie_id": 508947, "review_id": "64128cc52667780081e521fe", "author_rating": 7.0, "review_text": "A beautifully animated movie that touches on real issues like parental pressure, coming of age, friendships, and most importantly...learning who you truly are and accepting all of you. The good and the bad.", "created_at": "2023-03-16T03:28:05.951Z"}, {"movie_id": 508947, "review_id": "652bc8451f3e6001399ed805", "author_rating": 6.0, "review_text": "**Pixar discovered anime and is looking to conquer the eastern box office.**\r\n\r\nI had some expectations regarding this film. I don't know exactly what I expected, but I think everyone will understand if I say that the film is signed by Disney and Pixar, two studios with an enviable track record of successes. However, as soon as the film ended, I felt that I wasn't exactly the target audience for this film: male, over thirty, European, with little connection with pop culture or the anime world.\r\n\r\nThe film follows a young teenager, daughter of Chinese parents, in a somewhat cathartic experience in which she transforms into a friendly red panda. The film focuses on this transformation and turns it into a metaphor for a transformation called puberty, a discovery of one's own individuality and autonomy, particularly with regard to the relationship with one's parents.\r\n\r\nThe film is good, but the theme is… complicated. If it is absolutely true that most teenage girls will see themselves in some of the adventures that Mei experiences, it is no less true that many parents and guardians will face the topic with discomfort and raise some objections regarding a certain “apology of rebellion” that the film suggests. On a positive note, it was the first time I saw an animated film aimed at young audiences that addressed menstruation bluntly. The dialogues continue to insist, however, on that stereotype of the panicking teenager and the mother disturbed by the moment and insisting that, now, her daughter is a woman. This is stupid and conveys inaccurate ideas: a woman is a woman from before birth, from a biological point of view, and becomes a woman from a psychological and social point of view long after her first menstruation, when she begins to be old enough and mature enough to make their own decisions (the same applies to men, with the necessary reservations). In addition to these problems, the plot seems a little incipient to me, following paths that are quite obvious, opting for predictable solutions and creating basic characters. I could even talk about the amount of stereotypes about Chinese and Orientals present in this film… but do I need to talk about that?\r\n\r\nThe best thing about the film is the animations and the extraordinary quality of the drawings and effects. Pixar does not miss the opportunity to defend its credits and reputation in digital animation and offers us a feast for the eyes, with a realism and attention to detail that is difficult to overcome and that makes us think about the way technology has evolved in just a few years: “Toy Story” isn’t even thirty years old yet, and it already seems a little dated! Just one problem: I'm not a fan of anime at all. I think it's a very stylized, excessive, exaggerated type of animation. Unfortunately, this film adopts too many elements that are imported from the anime. Look at the eyes, the exaggeratedly large mouths, the sudden changes in the characters' poses or attitudes... you can't have one foot in two worlds at the same time.", "created_at": "2023-10-15T11:08:53.836Z"}]