[{"movie_id": 4464, "review_id": "5c52647a92514154485d7f99", "author_rating": 7.0, "review_text": "***Hope for the broken via a quirky, forsaken race horse***\r\n\r\nDuring the Depression, an undersized, “lazy” horse named Seabiscuit becomes a champion, lifting the spirits of both its team and that of the nation. Jeff Bridges plays the owner, Tobey Maguire the jockey and Chris Cooper the trainer. Valerie Mahaffey is on hand as the owner’s wife.\r\n\r\nBased on the real story, “Seabiscuit” (2003) is reminiscent in tone of another timeless historical drama starring Bridges, “Tucker: The Man and His Dream” (1988) by Francis Ford Coppola. I prefer the underrated “Tucker” because it’s snappier and less vague, but “Seabiscuit” ain’t no slouch. \r\n\r\nLike the historically-based “Jeremiah Johnson” (1972) the manner of storytelling respects the intelligence of the viewer to sometimes read between the lines. One of the best parts is the build-up to the race with War Admiral and the thrilling race itself. Not knowing the real-life events, a couple of the twists were surprising. The first act, however, seems bogged down by extraneous details about the owner.\r\n\r\nThe film runs 2 hour, 19 minutes and was shot in California, New York and Kentucky.\r\n\r\nGRADE: B", "created_at": "2019-01-31T02:59:06.288Z"}, {"movie_id": 4464, "review_id": "5cea60f00e0a265cded46953", "author_rating": 9.0, "review_text": "It wears its sentimental heart firmly on its fetlock.  \r\n\r\nAs the depression era kicks in, Americans were grasping for any sort of inspiration they could get, enter equine supreme, Seabiscuit. Considered broken down, too small and untrainable, Seabiscuit went on to become a bastion of great racehorses and in the process bringing solace to those closest to it.\r\n\r\nBack in 2003 upon its initial release, critics were very divided as to the merits of Seabiscuit as a picture. Some were concerned that this adaptation from Laura Hillenbrand's highly thought of novel missed too many crucial elements, others were merely touting the tired old charge of the film purely baiting Oscar (something that is levelled at every film in history about hope and second chances), the more astute critics of the time however lauded it as the delightful and inspiring piece that it is.\r\n\r\nIt would be churlish of me to not agree that Seabiscuit is laced with sentiment, rookie director Gary Ross barely wastes a chance to tug the heart strings and paint an evocative sequence, but if you have got it in you to accept this true story for its base emotional point, then it is one hell of a wonderful experience. Seabiscuit is not just about the equine beauty of the picture, it's also a fusion of three men's personal wavering, who for one reason or another need the horse for far more important crutches than those provided by financial gain, make no bones about it, Seabiscuit is a very human drama. Knowing how the picture will end never once becomes a problem, because the historical accuracy in the story makes one yearn for that grandiose ending, one to gladden the heart in the way it must have done to thousands upon thousands of Americans back in the depression era day.\r\n\r\nRoss wisely chooses to filter in as much realism as he possibly can, archive stills and narration serve as exceptional points of worth to the narrative structure. Then there is the first rate cast to fully form the emotional complexities that Seabiscuit provides. Jeff Bridges, Tobey Maguire (waif like), Chris Cooper, Elizabeth Banks, top American jockey Gary Stevens and a splendidly jaunty William H Macy, all can rightly feel proud of their respective work on this picture. Yet it's with the thundering race sequences that Seabiscuit really triumphs best, magnificent beasts hurtling around the race track are excellently handled by Ross and his cinematographer, John Schwartzman, whilst a nod of approval must go to the sound department's efforts, for this is definitely one to give your sub-woofer a work out.\r\n\r\nSeabiscuit was nominated for seven Academy Awards, winning none, perhaps the Academy also felt like those critics who thought it was trying too hard for a Golden Statue? But now after the dust has settled some years later, it pays to revisit Seabiscuit and judge it on its own emotional terms, for it's a tremendously well crafted picture that is of course as inspirational as it most assuredly is tender, a fine fine picture indeed. 9/10", "created_at": "2019-05-26T09:48:32.635Z"}]