[{"movie_id": 747188, "review_id": "648a0a0199259c01392dc8e1", "author_rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://insessionfilm.com/movie-review-asteroid-city/\r\n\r\n\"For fans of Wes Anderson, Asteroid City doesn’t disappoint, offering exactly what was expected from it. For viewers who don’t exactly appreciate the filmmaker’s style, I don’t think this film will convert you.\r\n\r\nPersonally, it’s nowhere near the level of The Grand Budapest Hotel, but it’s a considerable improvement over The French Dispatch.\"\r\n\r\nRating: B-", "created_at": "2023-06-14T18:42:09.343Z"}, {"movie_id": 747188, "review_id": "64966711b34409013983c40d", "author_rating": 2.0, "review_text": "Writer-director Wes Anderson has lost his way, and this film proves it. I realize that the auteur’s signature style of filmmaking is an acquired taste, and, to his credit, he’s made some fine pictures over the years. But this one is not among them. In fact, contrary to many of the inexplicable claims that this is his finest release, I’d contend just the opposite. It’s arguably his worst, a meandering, cryptic, unfocused piece that’s so muddled you’ll need the assistance of a search party to find your way out of it (that is, if you even care by the time the end of this overlong mess rolls around). The director appears to have become so enamored with his own eccentricity that it doesn’t even seem to matter to him whether or not viewers are on the same page as he is. Admittedly, this offering once again captures Anderson’s singularly stylish look with a stunning production design and gorgeous cinematography. But that’s all it has going for it, and that’s unfortunate given the phenomenal cast he has available to him. What’s more, despite his proficiency in creating superb visual style, he’s forgotten about pairing it with meaningful (or even interesting) substance. Its incomprehensibility and inclusion of bits that are there just for the sake of their own whimsy seriously undercut any effort to make this an intelligible work. In short, “Asteroid City” is yet another major disappointment in what is turning out to be a dreadfully dismal summer movie season. It’s likely to appeal only to diehard fans of the director (and maybe not even a lot of them this time out). If you’re on the fence about this one, consider the following two telling tipoffs: (1) when no one in the theater is laughing at what’s been billed as a comedy, that should speak volumes about it (as happened at the screening I attended); and (2) when you consider how aggressively and ubiquitously the distributors have been promoting this film in ads on TV and the internet, it’s obvious they’re trying awfully hard to peddle shabby, substandard merchandise. This is a huge waste of time and money; don’t squander yours.", "created_at": "2023-06-24T03:46:25.652Z"}, {"movie_id": 747188, "review_id": "649a12d77e348300c5637e3b", "author_rating": 5.0, "review_text": "Even though the film has a fair share of chuckle worthy moments, _Asteroid City_ shamelessly rolls around in its eccentricities and unapologetic blundering demeanor with no real depth or character development whatsoever. The gathering of extraordinary talent draws you in yet _Asteroid City_ doesn’t deliver a story that’s fully worth telling.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/06/24/asteroid-city-review-wes-andersons-charmless-comedic-drama/", "created_at": "2023-06-26T22:36:07.765Z"}, {"movie_id": 747188, "review_id": "64baa95a3009aa011c9a9edc", "author_rating": 6.0, "review_text": "Well Wes Anderson has certainly assembled a formidable cast here, but I'm afraid I found the whole thing very much a case of style over substance. It all happens in an one-horse town in Nevada where a meteorite crashed aeons ago. Every year the town awards those youngsters who have achieved something especial in the field of science, so they - and their families - gather together for the awards ceremony presided over by \"Gen. Gibson\" (Jeffrey Wright). The \"Steenbeck\" family are prominent with father and acclaimed photographer \"Augie\" (Jason Schwartzman) and his geeky son \"Woodrow\" (Jake Ryan) suffering the terminal breakdown of their car that necessitates the arrival of the boy's grandfather \"Stanley\" (Tom Hanks) who arrives in his Cadillac to witness this gathering of enigmatic characters staying in tiny chalets in what looked very much like one of the demonstration villages built near nuclear testing sites. \"Augie\" takes a shine to the glamorous actress neighbour \"Midge\" (Scarlett Johansson) and his son to her daughter \"Dinah\" (Grace Edwards) and whilst these romances build in the quirkiest of fashions, we are introduced to some of the other quaint characters who inhabit the place - leaving me, unfortunately with a sort of bemused who cares sentiment. The photography is intense, intimate, intrusive almost and features more than it's share of whip pans and rolling panoramas and the dialogue is not without some pith - but I couldn't help but leave the cinema after the second viewing of this not such masterpiece cinema wondering if it were all just a case of emperor's new clothes. It wasn't that I felt that I missed something, it was that I felt that there was nothing to miss. The story - insofar as there actually was one - could hardly have been more incidental to this whimsy of a film that I would certainly agree looks great, but whose sum of the parts did not add up to much of an whole. I readily acknowledge that I don't do surreal particularly well, but for me this didn't amount to anything at all worth writing, let alone raving, about. Sorry - unremarkable.", "created_at": "2023-07-21T15:50:50.876Z"}, {"movie_id": 747188, "review_id": "64cca23ee04d8a3aa7add3b9", "author_rating": 4.0, "review_text": "Most critics have their personal favorite directors, and it’s sometimes a challenge to keep strict objectivity when reviewing one of their projects. That’s why it pains me to write about “Asteroid City,” the sluggish, smug, exasperating new film from co-writer and director Wes Anderson. In what is unquestionably his worst film by a mile, Anderson leans too heavily on his ordered, signature visual symmetry, saturated color palate, and A-list cast while completely forgetting how to make an entertaining movie.\r\n\r\nThe film takes place in a tiny desert town (famous for their giant crater) where the Junior Stargazers and Space Cadets are holding their awards convention. The event brings together students and their parents, all oddballs in their own right, from all over the country. When a UFO is spotted, the visitors are quarantined until the government deems it safe for them to return to the real world.\r\n\r\nThe plot is thin yet confusing, as the film simultaneously depicts the events of the convention in the form of a stage play, the creation of the play, and the actual events in a retro version of 1955. With so much going on, you’d think it would be at least mildly interesting, but the movie is sluggish and packed with conversational and head-scratching filler that lends nothing to the story.\r\n\r\nThere is a wacky cast of (too many) characters, and only a handful turn out to be memorable. The expected roster of Anderson regulars make an appearance (Jason Schwartzman, Edward Norton, Adrien Brody, Tilda Swinton, Jeffrey Wright, Scarlett Johansson) as well as big names that are new to working with the director (Bryan Cranston, Tom Hanks, Maya Hawke, Matt Dillon, Steve Carell, Liev Schreiber, Hong Chau, Jake Ryan). It’s a dream of a cast list, but this film goes to show that a talented roster doesn’t always result in a gem. There’s nothing wrong with any of the performances, but it’s the source material that needs a lot of work.\r\n\r\n“Asteroid City” may be visually delightful, but it is filled with a detached, hipster indifference that’s off-putting. This is one of the biggest failures of the year, and it’s not because the film is “too Wes Anderson-y,” nor is it because of the general Anderson fatigue: this movie is a series of flagrant missteps that cause the project to flounder and fall.", "created_at": "2023-08-04T07:01:18.208Z"}, {"movie_id": 747188, "review_id": "64dad3f5d100b6011c8376c0", "author_rating": 8.0, "review_text": "Top tongue-in-cheek directors: Wes Anderson and Wen Jiang. Asteroid City isn't my favorite Wes film, but it's surely tongue-in-cheek and pretty damn funny.\r\n\r\nThis movie reminds me a little of Tennessee Williams, the all-time master of damaged and traumatized human psyches. I see this work as a treatise on human issues, especially the labels given to us by others and those we give ourselves, and how they affect one's life and relationships.\r\n\r\nThe partial view of the \"Confessions of a Narcissist\" marquis that showed up in the background of the tet-a-tet between Augie and his almost-onstage-wife is a clue. The term \"narcissist\" didn't become popular psychology until the 1980s. There were other anachronisms, but this one is particularly striking in context.\r\n\r\nAnd what's with that song and dance number in the middle of the show? The band that showed up in this desert had no other raison d'etre!! Did Wes just reference the Time Warp from The Rocky Horror Picture Show??", "created_at": "2023-08-15T01:25:09.642Z"}]