[{"movie_id": 282035, "review_id": "59488c3dc3a36816f604c63b", "author_rating": 1.0, "review_text": "Oh gosh. Where do I even start. This film sucks. \r\n\r\nNow before I begin to tear this film into shreds, let me give you some background. I was excited for this movie. I love Tom Cruise. I love Sofia Boutella. I love Russell Crowe. I love the Universal Monsters. \r\n\r\nLets just say I was disappointed.\r\n\r\nThis film has some of the worst tonal problems in a film ever. An inconsistent tone is my biggest pet peeve. Sometimes it's scary. Sometimes it's a huge action blockbuster. Sometimes it's trying to be like Brendan Frasier's \"The Mummy.\" It doesn't know what it is.\r\n\r\nThe female lead (who's name I can't remember) is incredibly bland. Not her acting, she's actually quite good. It's the writing is what makes her bad. \r\n\r\nJake Johnson's character is one of the most annoying characters in a movie ever. And I mean that. I hated almost every scene he was in.\r\n\r\nThe few high notes: Sofia Boutella kills it. Russell Crowe is delightfully campy. Tom Cruise gives another solid performance despite his character being super unlikable.\r\n\r\nAlex Kurtzman is what hurts this film. The direction is quite bland. Kurtzman is a bad screenwriter and a just as bad director.\r\n\r\nThis film is a mess. Tonal problems and bland writing. Some fun action scenes and performances can't keep this film from being a boring trainwreck.\r\n\r\n1.3/5.0", "created_at": "2017-06-20T02:45:17.420Z"}, {"movie_id": 282035, "review_id": "594fe133925141314b04e1c1", "author_rating": 3.0, "review_text": "Honestly, this film screwed up big time and it's not as good as the 1999 film, most people are going to compare this film to that and I don't blame them. Tome Cruise was like a walking joke in this and while I saw this in the cinema, people were laughing during an action scene that was actually badly put together and I didn't realise this until now. This is pretty much a mix bag of a film which is a shameful way to start off a new cinematic universe of the Dark Universe.", "created_at": "2017-06-25T16:13:39.048Z"}, {"movie_id": 282035, "review_id": "598a87bb9251416b50021f17", "author_rating": 3.0, "review_text": "Remember when _Dracula Untold_ was supposed to kick off Universal's Monster-Movie franchise, but then they canned that because of how poorly received that movie was? Well get ready to go straight back to the drawing board Universal, because _The Mummy_ isn't even half the movie that _Dracula Untold_ was. Sofia Boutella as the titular Mummy is the movie's one redeeming feature, but she far from salvages this train-wreck.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-08-09T03:55:39.135Z"}, {"movie_id": 282035, "review_id": "59f2febb925141229100c9c7", "author_rating": 6.0, "review_text": "In view of the reviews this movie has received I was not expecting much. Being a Sci-Fi/Fantasy/Horror fan I had to watch it regardless of what people said about it of course.\nI have to say that I do not understand why so many seem to claim it is utter crap. Sure, it is not a great movie but it is not really bad either. \n\nIt is not just a remake of the original The Mummy movies which I think is actually good. That concept is becoming a bit deja vue after all.\n\nTo me the worst part of the movie was Tom Cruise. Total lack of charisma. He really do not succeed in his role. He is mostly wondering about being meh and just reacts to the various situations he is thrown into.\n\nRussell Crowe is a lot better as Doctor Jekyll. I quite like Doctor Jekyll being thrown into the mix by the way. I think his role worked quite well and was well played.\n\nBeing a mummy movie there are of course a lot of supernatural stuff, curses, monsters and action. In general I think it was reasonably well done. The special effects were enjoyable and the mummy herself, Sofia Boutella, was not bad at all.\n\nOn the whole the movie and the story held a lot of promise but in the end the overall performance failed to really impress. There were plenty of good things but they were just not put to good work. I think the movie would have fared a lot better with a more charismatic lead in it and perhaps a bit better script for him.\n\nBottom line, I did enjoy the movie. As I wrote it is not really bad but it could have been quite a bit better. The good parts were sometimes really good but in between it felt like everyone went to lunch and let the janitors have a go at movie making.", "created_at": "2017-10-27T09:39:07.666Z"}, {"movie_id": 282035, "review_id": "59f58aa392514142aa00bfe1", "author_rating": 5.0, "review_text": "Disappointingly unoriginal and average.\r\n\r\nSo here we go, then, Universal begin their rebirth of the Universal Creature franchise (Dark Universe) with a crack at old bandage features, The Mummy, sadly the result is very average at best. You would think that with so many \"Mummy\" films of the past already on the market this new lease of life would be giving us, well, something new to gorge on, but what we actually get is a painfully familiar.\r\n\r\nFrom a summer blockbuster audience pleaser point of view it has the requisite effects work, it's loud, rambunctious and has Cruise and Crowe for star wattage, but Cruise is going through the motions, Crowe is laughably miscast (with a later dreadful accent issue to compound the misery), while the rest of the cast play second fiddle to the over egged effects work.\r\n\r\nIt's neither dark enough as a head bothering thinker or witty enough to tickle the funny bone, in fact it at times is very dull. There's also the worrying attempts at crossing over into further creature feature ventures, a big reveal for a main character is sloppily handled, whilst the finale lands as flat as a pancake.\r\n\r\nThere's some nice touches, the \"Mummy\" design is sharp (love those eyes), a plane crash is exhilarating and the film's stand out sequence, and the tomb/prison design is neat, but after that you start to scratch around for positives, which in itself tells a story. At least it looks and sounds great in HD, the colours and sub-woofer shakes a treat for the senses.\r\n\r\nIt's all well and good people asking for it not to be judged by other Mummy films, but the creators here make that inevitable. Lifting the plot from one of the 1940's films, and even stealing a scene from the Stephen Sommers school of Mummy film making. It's unoriginal and as an opening salvo for a franchise it leaves Universal with a hell of a lot of work to do to make it work. 5/10", "created_at": "2017-10-29T08:00:35.952Z"}, {"movie_id": 282035, "review_id": "59fe1fe2c3a3686853025553", "author_rating": 6.0, "review_text": "**The first in the Universal studio's 'Dark Universe'!**\r\n\r\nIf you see the history, the reboots usually fails. It has to be at least half a century old to reboot like 'King Kong'. So the technology advantage would play a major role. It was less than the 20 years, the last 'The Mummy' film had released and pretty impressed everybody with modern visual effects. Even today's young generation getting used to that when it was played on the television. Comparing this to that, there's nothing much other than more perfection in graphics and additional digital 3D. In my opinion, they should have waited another decade.\r\n\r\nIt was exactly reversed version of the 1999 film. I mean the character designs. Like female mummy coming to life and targeting a man for the ultimate power possession. Two US army men in Iraq found a hidden tomb like structure from the Egyptian era beneath the sand. The recovered ancient coffin shipped to England, but the plane crash down. Since then, an unknown force begins to hunt down one of that two army men. Fighting against it, followed by how the story ends comes in the later parts.\r\n\r\nWhen I first heard about the reboot, I said oh no! Hearing about Tom Cruise's involvement, it became double no! Actually, he was good in the film, but the film was unnecessary at this generation. Even though it did good at the box office, it was considered a decent run. But the studio has a bigger plan, that you would know if you watch the film, that they had already developed a plot for at least two more films with enough characters to carry on that long. If needed, it would add more in the latter. I feel that's a bad idea right now. Watching it one time is not bad, but no special at all.\r\n\r\n_5.5/10_", "created_at": "2017-11-04T20:15:30.135Z"}, {"movie_id": 282035, "review_id": "5de9565f7646fd00159bdf78", "author_rating": 7.0, "review_text": "***Adventure, thrills, horror, Tom Cruise and Annabelle Wallis***\r\n\r\nTwo American soldiers & treasure-hunters (Tom Cruise and Jake Johnson) discover the tomb of evil Princess Ahmanet (Sofia Boutella), who attempted to summon the death-god Set but was seized and mummified alive. They and an attractive archaeologist (Annabelle Wallis) fly Ahmanet's sarcophagus to Britain when all hell breaks loose. Russell Crowe is also on hand. \r\n\r\n\"The Mummy\" (2017) is the reboot of The Mummy trilogy of 1999-2008 and the first official film in Universal’s Dark Universe franchise, which reimagines & updates the classic universal monsters.  The producers flirted with the idea of \"Dracula Untold\" (2014) being part of the Dark Universe, and the epilogue of that movie set in the modern world suggested this, but the idea was dropped. While “The Mummy” garnered $410 million worldwide, it was considered a disappointment and critics generally lambasted it.\r\n\r\nI found the modern setting a nice change of environment compared to the late 1920s-40s of the previous trilogy; it prevented it from being the same-old-same-old. I also didn't mind the various locations outside of ancient Egypt, e.g. northern Iraq and England; even Hammer's version from 1959 started in Egypt, but quickly moved to England. I also favored the switch to a female mummy and that the slightly convoluted story kept you guessing. So the flick gets points for NOT being one-dimensional and hackneyed. \r\n\r\nI enjoyed it for the most part, although it coulda been more compelling in the latter portions. It has the same spirit of high adventure of the 1999 movie mixed with gothic horror (including creepy zombies) and a bit o’ comedy, but not too much. While the curious inclusion of Dr. Jekyll (Crowe) smacked of pushing the new franchise, it didn’t ruin the viewing experience. And winsome Wallis doesn’t hurt.\r\n\r\nThe film runs 1 hour, 50 minutes, and was shot in England; Burbank, California; and the Namib Desert, Namibia.\r\n\r\nGRADE: B", "created_at": "2019-12-05T19:11:27.270Z"}, {"movie_id": 282035, "review_id": "5fb9e8259a64c10041949347", "author_rating": 6.0, "review_text": "A disappointment.\r\n\r\n<em>'The Mummy'</em> begins with promise. I initially enjoyed the duo of Tom Cruise and Jake Johnson, the plot set-up and the location choice of London. Russell Crowe is a standout name too. However, sadly, the film gets progressively worse throughout the 110 minutes.\r\n\r\nThe premise kinda just falls into itself, with any interest disappearing pretty quickly. The link between Cruise and Johnson becomes tiresome, as does all the comedy in the film in truth - there's a few chuckles, but nothing laugh worthy. The zombie vibe doesn't fit, either.\r\n\r\nWhat also doesn't help is the fact they're blatantly trying to set up a film universe of some sort, which they put too much focus on. I found the effects hit-and-miss, I feel like they could've used more practical stuff rather than relying so much on CGI - for the make-up et al. at least.\r\n\r\nCruise leads ably and does a decent enough job - he has done far greater of course. Crowe never really gets going in my opinion, though does have a couple of cool to look at scenes late on. Sofia Boutella is alright, as is Annabelle Wallis. A meh for the cast.\r\n\r\nNothing diabolical, but a fair distance from good too.", "created_at": "2020-11-22T04:25:09.173Z"}, {"movie_id": 282035, "review_id": "63c217a78efe73007d8f98b1", "author_rating": 1.0, "review_text": "Well, I do openly hate remakes and reboots. Movies like the Mummy I tend to give a pass to, mainly because that's what you do with movies like that.\r\n\r\nBut...Were they remaking the Mummy or where they Remaking American Werewolf in London? Or were they remaking Hellboy? Or were they remaking League of Extraordinary Gentlemen? In the end its hard to tell, there were far too many similarities between all those films that I'm kind of shocked they haven't gotten sued for plagiarism.\r\n\r\nThe problem isn't that it couldn't decide what direction it wanted to go in, the problem is that it couldn't decide what movie it wanted to reboot.", "created_at": "2023-01-14T02:47:03.802Z"}]