[{"movie_id": 9806, "review_id": "5f27fd1b435abd0037784a3c", "author_rating": 7.0, "review_text": "I don't like this as much as most do, but <em>'The Incredibles'</em> is definitely a fun watch.\r\n\r\nI enjoy how the film starts out, as it introduces the characters and tells some backstories. However, once the film becomes more serious it kinda loses its edge for me. When it's less so though, it's good. The animation is very nice, even if the humans look a tad iffy especially with their expressions.\r\n\r\nAnother part I don't love is the villain, Syndrome. I feel like he's a bit tame, I never once felt fear/angst from the guy at all. A much more devilish, deceptive bad guy would've been far better. I didn't even realise it's Jason Lee who voices him either, it oddly doesn't sound like Lee to me.\r\n\r\nTalking of mishearing the voice cast, am I the only one who thought it was Jodie Foster voicing Elastigirl? Violet kinda sounds like Aubrey Plaza too. I think I may need my ears tested... Elsewhere, it's cool to hear (correctly, this time) Samuel L. Jackson as Frozone.\r\n\r\nDon't get me wrong, this is certainly a film worth watching 100%. I just would've loved a greater threat to the protagonists. Lastly, the end scenes, though amusing, feel like a collective of end credit jokes rolled into one. That's a minor complaint, mind.", "created_at": "2020-08-03T12:03:39.004Z"}, {"movie_id": 9806, "review_id": "63c1f3ab05a53300e99be22e", "author_rating": 10.0, "review_text": "I sort of watched them out of order. I wasn't really privy to the existence of The Incredibles until my fiance wanted to rent the sequel...and then I went back and watched the first one.\r\n\r\nI have to say that I liked 2 more, but only because it looked like a period pop art piece and the first one you really didn't get that feel. It was clearly set in the early 60s, but you didn't get that whole esthetic as much as you did in the sequel and that was the biggest draw I had to it.\r\n\r\nThat being said, it was't bad.\r\n\r\nSociopolitically I liked the line about when everyone has super powers no one does. It registered loudly to someone that works in history. So the plot, on that basis, was compelling.\r\n\r\nAnd I am sure that if I had seen them in order I'd like it just as much.\r\n\r\nThe sequel, the main draw that sucked me in was the look of the film. Here it was the quasi-family struggles which, again, seemed to be highlighted a little better in the second film. Still, it was there enough, the work-life balance to draw you in, and the absurdity that the work was being a hero was entertaining.\r\n\r\nAs was the reason they had to go underground which, again, was done a little better than when the MCU tried it...but still not elaborated on enough to make it as interesting as it could have once been.\r\n\r\nIn any case, it's still an entertaining cartoon. And you can see where the creators took what worked in the first one and elaborated on the concepts until they popped.", "created_at": "2023-01-14T00:13:31.869Z"}, {"movie_id": 9806, "review_id": "6482be3bd2b209012dfc0c34", "author_rating": 7.0, "review_text": "It's got a sort of \"Batman\" meets the \"Man from U.N.C.L.E.\" feel about it as the \"Parr\" family try to get on with their lives after their brave and courageous superhero existence was kiboshed by some daft lawsuits and government cold feet. Thing is, there's no such thing as a well-earned retirement and just over a decade after they were consigned to obscurity, dad \"Bob\" is summoned to a top secret summit where he quickly discovers that it's going to take all of his - and his family's -considerable powers to stop the world from imminent destruction. No, the plot is hardly original - or incredible - but the script and characterisations here are really in kilter as the creatively animated adventure hots up. There's fun in the dialogue for the kids and grown-ups alike, and though maybe a bit on the long side, it's a lively tale of espionage and science with it's fair share of gadgets, gizmos, family strife and even an impenetrable, armoured, steel baddie. The pace becomes hectic and enjoyable and the action builds up nicely before a denouement that isn't the best - it just screams sequel at us. This needs a big screen to enjoy it at it's best and has some engaging, spy-themed, nostalgia for those of us north of forty too.", "created_at": "2023-06-09T05:52:59.225Z"}]