[{"movie_id": 574060, "review_id": "60efe94dab1bc7002a487d2d", "author_rating": 7.0, "review_text": "**🦜 IT'S BIRDS OF PREY \" LITE \" : With Only -{ HALF }- Its Delectably Whacky Trippy Neon Psychedelic Charm . . But -ALL- Of Its MINDLESS { Dark Comics Style } BRUTALITY & GORE 💥**\r\n\r\nA \"Good Old Fashioned\" **-{ _B I G_ }-** Screen Micro Review .\r\n\r\nI'll readily admit it. I set out to watch 'Black Widow' -{ again 😅 }- , had the film's timings wrong, and ended up watching 'Birds ....ooops.... I mean 'Gunpowder Milkshake', ( 'GM' for short ), instead. But no, really, watch the -Official- trailer, and you'll see what I mean ; the similarities, which permeate the ( -Entire- ) movie, are, 'to put it mildly' ...really, really, really... -{ Stark }- . \" _MENTIONS-OF-NOTE_ \" : 1 : The utterly -{ ADORABLE 💜 }- pint sized thespian, Chloe Choleman ( \"8¾ year old Emily\" ) . . . she's Twelve in real-life, and is simply a lovely, -Effusive- bundle of utter delight, and of course . . TALENT. 2 : { Mild-spoiler } : Keep your eyes peeled for the \"Dracula gets killed by . . . ( why, a -Stake- Of course❗)\" scene. In the classic Dark-comedy sense ; it simply could -{ Not }- have been executed more 'Perfectly' .\r\n\r\n\" _DOWNSIDES_ \" : I guess I'm just going to have to  put this one down to a -{ Simple }- case of : \"not very good timing, at all\". In other words, on the one hand you have the USA being -Utterly- battered by a -Very- Deadly Pandemic . . . { 'no offence' to Covid-19, but right now I'm actually referring to the ( TRULY ) Horrific 'summer spike' in **AMERICAN - GUN 🔫 - VIOLENCE } . .** and on the other, you have a -US- ( 'Gunpowder's' Country-of-origin is listed as 'France, Germany, USA' ) picture that -altogether- glorifies a -{ \"seemingly endless\" }- spree of 'Vividly gratuitous slaughter' . . the likes of which I haven't seen in a -serious- while. Not to mention the rather -glaring- \"Birds Of Prey déjà-vu\" aspect of exposing an -Actual- , innocent, young 12 ( -13½ in the case of 'Birds Of Prey'- ) year old -BABYGIRL- ( and in a \"prominent, Starring-Role\", at that ) to -that- level of Darkness & Violence, albeit thematic. And of course, the film -Does- have its fair share of \"wanton\" profanity, and the young child is -{ by no means }- deaf, let's not forget. Seriously . . . What kind of message does that send❓.\r\n\r\nSummation : \"Save some money\". Sure, the movie has its moments, & is even \"SUPREMELY\" funny in -Atleast- 2 or 3 places, let's be clear. But in my humble opinion, if you're -Not- 'particularly' crazy about this sub-genre, then 'GM' is, I'm afraid, -{ Not ⛔ }- worth a special trip to the cinema, -Especially- with the 'delta variant' of Covid 19 -Still- wreaking some Serious \"Mayhem\" in so many, many, many parts of the world. So if you feel like this is a 'must' watch for you, then you should be -Just- fine streaming it on, { say }, Netflix, which, by the way, PRODUCED IT . . 'ANYWAY' . -All- things considered, then, that's going to be an 'Honest-to-goodness' **7.00 Marks Out Of 10.00** from me, because that's -{ REALLY ✅ }- . . . as far as high as I can go with 'Gunpowder Milkshake', all things considered .", "created_at": "2021-07-15T07:52:45.119Z"}, {"movie_id": 574060, "review_id": "61018741a84a470025669c19", "author_rating": 8.0, "review_text": "Gunpowder Milkshake movie is stylish, beautiful, action-packed, violent, and funny. The action sequence was a mixture of John Wick and Jackie Chan. \r\n\r\nDirector Navot Papushado and Cinematographer Michael Seresin transform a generic script into a blast. There was a smart use of a camera and lightning. The music, color grading, costumes, makeup, production design, and the whole atmosphere was brilliant.\r\n\r\nI loved the library scenario and the classic literature language used for the guns. It reminds me of the John Wick movie.\r\n\r\nThe script was decent and predictable to some extent but the direction and Cinematography made it more interesting. Also, I can't forget the funny fighting moments. So It's a must-watch movie.", "created_at": "2021-07-28T16:35:13.611Z"}]