[{"movie_id": 463821, "review_id": "5c448bc5c3a3681a0e251df0", "author_rating": 3.0, "review_text": "There was a couple of instances over the course of _The House with a Clock in Its Walls_, particularly early on, that had my hopes up, but by the end? God I was so disappointed. The lead is not a great actor (often a trouble when you have to cast young), and the effects are pretty bad. The worst thing though is that _Clock in Its Walls_ can't keep its story straight, which is a pretty unforgivable sin when it's your own story. Like, you set the rules here, why are you going out of your way to break them for nothing?\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-01-20T14:55:01.388Z"}, {"movie_id": 463821, "review_id": "5c6969a10e0a261aaf96a876", "author_rating": 8.0, "review_text": "I was surprise about how much I enjoy this film. Jack Black and Cate Blanchett are great together in this film. The film felt like a 80s kids horror film. I would love to see more films with these characters. There are a few poop jokes which were the worst part of the film (but these jokes seem to be expected in modern kids films). I feel like this film would have cult film status in a few years.", "created_at": "2019-02-17T14:03:13.359Z"}, {"movie_id": 463821, "review_id": "64346b161f98d101f6470040", "author_rating": 7.0, "review_text": "**Fantasy and light horror are relatively in harmony, even if this is problematic for a lot of people.**\r\n\r\nI saw this movie recently and I really liked it. It's nothing original, it does what others have done equally well, but manages to entertain the public very well, and especially young people and teenagers. Alright, the movie has some scarier scenes that might impress, but they didn't strike me as unbearable.\r\n\r\nThe script is based on the journey of a young orphan to his uncle's house, a former illusionist who lives in the mansion of his former partner in the show, also deceased, and who is actually really a sorcerer, even if he is not particularly gifted. The house is enchanted and the furniture and objects have a life of their own, but beyond that there is a clock hidden inside the walls, somewhere, that needs to be found to prevent something very bad from happening.\r\n\r\nThe problem with films that try to harmonize comedy with light horror is that, in fact, they risk not pleasing very few people: those looking for one thing may feel uncomfortable with the other. The film, as I said, can be very appealing to young people, but the stronger scenes may make parents think twice about allowing them to see it.\r\n\r\nJack Black is an actor I never particularly liked, not least because I only knew him from rather shallow comic films or films linked to music. This was, as far as I remember, the first of this actor's films that I liked, and it must be recognized that Black is a key part of everything in that he manages to be funny without losing the ability to look serious when necessary. Cate Blanchett is, to some extent, a surprise, she is an extremely high-rated actress that I normally associate with big productions. She's a great actress, she's excellent in this film and it's worth seeing what she's doing, especially when she appears opposite Black, with whom she seems to have established a good collaboration. Unfortunately, I didn't feel anything particularly positive about young Owen Vaccaro. Okay, he's very young and we still can't expect great work as an actor, and there are several moments when he shows signs of talent, but for now it's not much more than that.\r\n\r\nEli Roth is not a director I particularly like. Very focused on slash horror movies, it's someone I wouldn't bet a lot on for a movie like this. Surprisingly, the director handled the task at hand with reasonable skill and competence. The film has excellent cinematography, which is solidly based on good quality CGI and a good design of the sets and costumes. The effects are also really good. I particularly liked the scene where the characters play with stars and planets in the garden of the house, and the opening sequence of the film, which is able to intrigue and conquer us. The soundtrack helps a lot, with good melodies that add to the film without stealing our attention.\r\n\r\nHowever, there are not only flowers here. The editing work is a little lacking, there are scenes that would benefit from being slightly shortened. The pacing also presents problems: after an excellent beginning, and before an excellent ending, the film has a whole middle part that is not so interesting, and there are several characters that were poorly used, starting with the villain, whose motivations and attitudes they are, to say the least, clichés without any kind of interest and there are, throughout the film, some disturbing scenes (the living puppets, for example) that don't seem to be in the right movie.", "created_at": "2023-04-10T20:01:26.585Z"}]