[{"movie_id": 12211, "review_id": "63578ba8c8a2d4008a00ff77", "author_rating": 1.0, "review_text": "**There should have been only one!**\r\n\r\nIf “Highlander 2” was a complete disgrace and “Highlander 3” somehow tried to give us some compensation, this movie makes it look worse and more worn out. However, a TV series had been made that had little or nothing to do with the original film. What this movie came to try to do is to bring together the best of both worlds, but it failed completely.\r\n\r\nThe problems start at the bottom, that is, in the miserably written script and without ideas that can truly be considered good or intelligent. At no time did I feel that the story of this film was interesting or captivating enough to justify the effort of seeing it. From the development it makes, we must assume that the action takes place after what we saw in the original film, which doesn't make much sense if we remember that this film ends in the victory of Connor, the last and only Immortal. The film has lots of plot holes and moments where logic and coherence take a vacation and disappear. The dialogues are poor, poorly finished and annoying. Historical flashbacks don't always work.\r\n\r\nThe cast counts, for the last time, with the honorable participation of Christopher Lambert, now a mature actor. So mature it sounds dangerously old for the role he plays. Despite this, the actor does what he can with what little he has. Adrian Paul also doesn't let us down and gives a good performance, considering the filthy and regrettable quality of the material written for this film. Bruce Payne sounds histrionic and unconvincing, but he does what he has to do. The rest of the actors don't really have anything really good worth mentioning in detail.\r\n\r\nVictim of a very low budget, the film appears for what it is: a very cheap and undercooked production, which tastes bad and looks even worse than it tastes. An excuse for an action movie with swords and frantic duels amid a series of abandoned or deserted industrial sites. The cinematography, sets and costumes are what we would expect to find, but the visual effects and CGI are poor, amateurish and really inexcusable in a 2000s full-length film. It's a disgraceful film.", "created_at": "2022-10-25T07:09:28.034Z"}]