[{"movie_id": 10191, "review_id": "589c59b8c3a3684ce200875b", "author_rating": null, "review_text": "So the movie was great. I wasn't expecting it to be that good actually. I thought it will be one of those movies wherein it turns out just okay because it's not a Disney/Pixar movie. I mean....if it's not a Disney/Pixar movie, don't expect anything. Which was good I think because not expecting turned out great for me. \r\n\r\n\r\nIt was very entertaining (aside from the noisy children and a very noisy and loud mom behind us). I know Toby will like this movie (he actually was able to watch it from beginning to end...for the first time). There's just so much to see. And the ending. Such a tragic ending but it's still a happy ending don't worry.\r\n\r\n\r\nMy rate for this movie is A. Good for kids. Good for adults.", "created_at": "2017-02-09T11:59:52.834Z"}, {"movie_id": 10191, "review_id": "5c17080f92514132b70beb03", "author_rating": null, "review_text": "First of all, the animation in this is spectacular. All the scenery in the film looks like something you could find in real life. The action, mainly the climax, and flying shots in this film also show how great the animation is. The main thing about the animation that is amazing is how the dragons look. They all look like real, kinda cartoonish, dragons that come across as vicious but also cute. The cinematography in this film is stunning. The lighting in each and every scene was chosen correctly for it. I really like the score in this film that was done by John Powell. The music in the film just helped bring you into this fantasy world of Vikings and dragons. Now my main problem is mainly the casting of the voice actors. They all did great jobs as their roles but I think some of them would have been better casted if their character was older and not a teenager. That can mainly be seen with Hiccup who is supposed to be a teenager but sounds like an adult who already went through puberty. I also had a few issues with the pacing in this film. Some scenes were way too short and I would have liked to have seen them a tiny bit longer. Now I do get that it’s a film made for children but as long as there’s moving objects on screen kids won’t care what’s happening in the movie. In the end How to Train Your Dragon is an excellent film for everybody no matter how old you are. I give How to Train Your Dragon a 9/10.", "created_at": "2018-12-17T02:21:03.814Z"}, {"movie_id": 10191, "review_id": "5c8424cf0e0a264301635755", "author_rating": 9.0, "review_text": "Who wouldn't want Toothless as a pet?\r\n\r\nHonestly I can see my future kids and their future kids loving this movie as much as I do. How To Train Your Dragon is just that great of a movie. It's gorgeous, funny, heartfelt, and it's got something to say. I can't praise this wonderful film enough.", "created_at": "2019-03-09T20:40:47.041Z"}, {"movie_id": 10191, "review_id": "6026886795c0af003f5703fa", "author_rating": 10.0, "review_text": "# My favorite movie\r\n\r\nIMO it simply has it all: Action, fun, love, nice animations and CGI, an amazing soundtrack, a good story, etc.", "created_at": "2021-02-12T13:53:43.344Z"}]