[{"movie_id": 424781, "review_id": "5b501f269251413be3006ecb", "author_rating": 7.0, "review_text": "_Sorry To Bother You is “unapollogetic”, “unafraid”, “imaginative”._  \r\nThese are the reviews of audiences, and critics; it’s hard to find someone that didn’t like this movie (unless you’re going to burrow through the Rotten Tomatoes audience reviews, in which case I’m sorry.)\r\n\r\nThe cast is packed with familiar faces: Lakeith Stanfield (as Cassius) who also happened to be in _Get Out_, Jermaine Fowler who had just finished work on CBS’ _Superior Donuts_, Danny Glover from the _Lethal Weapon_ films, and Terry Crews.\r\n\r\nThis movie had stunningly beautiful cinematography, and colors inspired by Bruce Block. Which is quite impressive considering the director (and writer) is a rapper with no background in film. But that story, what in the hell did I watch?\r\n\r\nIf you had seen the trailer and decided you want to go see this movie, maybe see it, but be prepared when that trailer just goes out the window. There isn’t some shocker twist at the end, this is an entirely different story.\r\n\r\nDon’t go in thinking this is going to be funny, know that it’s a horror film and it will scar you. Think _Get Out_, but much, much worse (in a good way).", "created_at": "2018-07-19T05:18:30.366Z"}, {"movie_id": 424781, "review_id": "5c4404490e0a266d69d27b1c", "author_rating": 6.0, "review_text": "Such a great level of surrealism. I love when the setting is completely believeable, normal people, who could easily be from our world, but their's is totally weird. One criticism I will give is the imperfections in the dubbing, normally not a big deal, but dubbing is so absolutely **vital** to the story of _Sorry to Bother You_ that it is hard to get past. It was still a very pleasant surprise though, one I recommend, and one I particularly commend the core cast's performance in.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T05:16:57.082Z"}, {"movie_id": 424781, "review_id": "5d1bdd614dc34a000fa06872", "author_rating": 7.0, "review_text": "**_A sharp satire that runs a little too long and takes a bizarre left-turn that will alienate many_**\r\n\r\n> _In my view, corporations are illegitimate institutions of tyrannical power, with intellectual roots not unlike those of fascism and Bolshevism._\r\n> \r\n[...]\r\n> \r\n_We can - and should - certainly begin pointing out that corporations are fundamentally illegitimate, and that they don't have to exist at all in their modern form. Just as other oppressive institutions - slavery, say, or royalty - have been changed or eliminated, so corporate power can be changed or eliminated. What are the lim__its? There aren't any. Everything is ultimately under public control._\r\n\r\n- Noam Chomsky; _The Common Good_ (1998)\r\n\r\nA paean to the proletariat. A pro-union battle cry. An ideological evisceration of late capitalism. A deconstruction of corporate greed and the concomitant commercialisation of self-worth necessary to succeed. A critique of identity politics. An allegory of institutional racism in big business. A lampooning of Silicon Valley bro culture. _Sorry to Bother You_, the debut feature of writer/director Boots Riley, is all this, and more. Very much in the key of absurdist fiction such as Dino Buzzati's _Il deserto dei Tartari_ (1940) and Ralph Ellison's _Invisible Man_ (1952), as well as race-conscious satirical cinema such as Robert Downey Sr.'s _Putney Swope_ (1969) and Melvin Van Peebles's _Watermelon Man_ (1970), whilst drawing more direct inspiration from Johann Wolfgang von Goethe's _Faust_ (c.1806-1831), Alex Cox's _Repo Man_ (1984), and the work of Spike Jonze, Michel Gondry, and, bizarrely, Ken Loach, _Sorry to Bother You_ is a black comedy/Juvenalian satire/science fiction/horror/magic realist/allegorical character study. In short, it's impossible to classify. Dealing with the obstacles facing African Americans in a white-dominated corporate _milieu_, and positing that the experience of workers is determined by both labour conditions and race, the film examines labour relations, wage issues, worker solidarity, unionism, mass media, and the dangers of betraying oneself and choosing corporate advancement over friendships, relationships, and personal integrity. Although it's a beat or two too long, and although the spectacularly bizarre left-turn at the end of the second act will surely alienate a lot of viewers, the deconstruction and comic appropriation of code-switching results in a film that is constantly inventive, highly confrontational, and extremely funny.\r\n\r\nSet in Oakland, California in an \"alternate present\", the company WorryFree offers food and lodging in exchange for a lifetime labour contract with no wages, a practice which the Supreme Court has deemed legal and not equivalent to slavery. Standing against WorryFree is the radical group \"Left Eye\", who organise protests and vandalise WorryFree's billboards. Unconcerned with any of this is Cassius \"Cash\" Green (LaKeith Stanfield), who lives in his uncle Sergio's (Terry Crews) garage with his girlfriend, Detroit (Tessa Thompson), a performance artist and, unbeknownst to Cash, a member of Left Eye. Struggling to pay rent, and with Sergio close to losing the house, Cash gets a job at the telemarketing firm RegalView, selling encyclopaedia sets. Initially finding it difficult to make any sales, Cash's luck changes when an older co-worker, Langston (Danny Glover), explains that he must use his \"_white voice_\" to be in any way successful. Proving adept at doing so, Cash quickly rises to become one of RegalView's elite \"Power Callers.\" Meanwhile, a co-worker, Squeeze (Steven Yeun), forms a union and recruits Cash, Detroit, and their friend Salvador (Jermaine Fowler). Despite participating in an organised protest, Cash is surprised to get promoted. Now working in the luxurious upstairs suite, where he's mentored by Mr. _______ (a hilarious Omari Hardwick), Cash learns that RegalView is secretly selling human labour to WorryFree. Despite his misgivings, he is earning a substantial wage, and soon finds himself torn between his career and the labour movement. This is exacerbated when WorryFree CEO Steve Lift (a spectacular Armie Hammer) offers him a salary of $1 million a year to work directly for WorryFree. However, Cash then makes a discovery that changes everything, not just for himself, but potentially for all of humanity.\r\n\r\nRiley, who identifies as a communist (but not a Marxist), is best known (thus far) as the lead vocalist of the far-left hip-hop groups The Coup and Sweet Sweeper Social Club. His father, Walter, was a political activist, joining the NAACP [National Association for the Advancement of Colored People] in the '50s, and helping to organise the Greensboro sit-ins in 1960, protesting racial segregation in Woolworths and spearheading the Civil Rights' sit-in movement. Later, he joined CORE [Congress of Racial Equality], SDS [Students for a Democratic Society], and the PLP [Progressive Labor Party]. Riley himself joined the PLP when he was 14, but left when he was 20, subsequently becoming a prominent member of the Occupy Movement in Oakland, and playing a key role in the 15 October 2011 global protests. The screenplay for _Sorry to Bother You_ was inspired by Riley's time working as a telemarketer, and the necessity of altering his voice so as to hide his ethnicity. The script was completed in 2012, but he had no means to make it. Instead, The Coup recorded an album of the same name, based on the script. Of the album, Riley told _The Chicago Tribune_, it talks\r\n\r\n> _about the same stuff I'm always talking about. Capital and labour; racial inequality; organising the masses against a caste system of privilege; that sort of thing._\r\n\r\nWords which are very applicable to the film. The script was then published in Timothy McSweeney's _Quarterly Concern_ in 2014, and Riley was subsequently invited to the Sundance Institute development labs to hone it further.\r\n\r\nAt its heart, _Sorry to Bother You_ is an anti-corporate, proletarian rally cry, something with which Riley has been engaged for decades; just listen to \"Fat Cats, Bigga Fish\" from _Genocide & Juice_ (1994), \"5 million ways to kill a C.E.O.\" from _Party Music_ (2001), or \"My Favorite Mutiny\" from _Pick a Bigger Weapon_ (2006). In relation to this, Riley tells DemocracyNow,\r\n\r\n> _the Taft-Hartely make it so you can't do solidarity strikes. And the reason why they make it so you can't do solidarity strikes is because they're effective. And so, we need a labour movement that's going to break those laws, because the laws that exist make the current ways of organising unions much harder. So, [the film] is almost also a call out to folks that consider theirself radicals._\r\n\r\nSimilarly, he explains to Hot97,\r\n\r\n> _we need to have movements that can actually shut down industries in order to get what we want._\r\n\r\nHowever, unlike Sam Levinson's recent satire _Assassination Nation_, _Sorry to Bother You_ is not especially interested in politics _per se_, certainly not in the explicit sense of films such as Sergei M. Eisenstein's _Stachka_ (1925), Haskell Wexler's _Medium Cool_ (1969), or Warren Beatty's _Bulworth_ (1998). This is not to say that the film ignores politics completely, rather it approaches the subject obliquely. For example, the country's most popular TV show, _I Got the Shit Kicked Out of Me_, involves people being violently assaulted by family and friends and then dunked in a vat of faeces, with Riley providing little to no contextualisation (think _It's Not My Problem!_ from Paul Verhoeven's _Robocop_ (1987), where Bixby Snyder's (S.D. Nemeth) catchphrase, \"I'd buy that for a dollar\", is used as a one-size-fits-all response to every situation). This mindless consumption of meaningless and morally questionable content indicates the passivity of the masses, their critical faculties either dormant or absent entirely (an inverse _verfremdungseffekt_, if you will). Clips of the show feature prominently throughout the film, allowing Riley to depict a _milieu_ where popular entertainment has reached an unimaginable low. Another example of a pseudo-political aspect of the film are the ubiquitous billboards and TV commercials advertising WorryFree, suggesting the corruption or co-opting of mass media. Additionally, Left Eye clearly recalls Antifa.\r\n\r\nHowever, in relation to the most obvious political target for a film of this ilk, Trump's presidency, Riley has explicitly stated it is not an attack on Trump. Indeed, he wrote the script during the Obama administration, before Trump had even announced his candidacy. To ensure that the audience wouldn't think the film's invective was aimed at Trump, Riley made some changes after the election, such as removing a line where Mr. _______ says, \"_WorryFree is making America great again_\". On this pseudo-prescience, Riley tells the _LA Times_,\r\n\r\n> _there are so many things in this movie that, when I wrote them, hadn't happened yet [...] The reason that these things are becoming more and more clear to us now is because it's connected to our economic system, not just connected to who's in elected office._\r\n\r\nAs this suggests, Riley's focus is very much on economic issues, with a lot of the humour derived from pecuniary-based situations. One of the easiest ways to parse the film is to approach it as a parable about selling out, equal parts polemic and acknowledgement that it's next to impossible _not_ to sell out in some way. Indeed, the last act of the film explicitly deals with the literal dehumanisation of the workforce (and I do mean \"literal\" – to say any more would be a spoiler). RegalView and WorryFree exist in an economic system built upon impoverishing the many for the benefit of the few, with Riley attempting to expose the importance of a poverty line for the continued functioning of late capitalism. Within such a system, he suggests, it is exceptionally difficult for African Americans to succeed unless they are willing to code-switch. In this sense, although the concept of \"_white voice_\" does have a practical function within the narrative, its most salient characteristic is as an object of allegorical satire, a hyperbolic caricature of what African Americans need to do to survive in the Caucasian bro-culture corporate ranks of Silicon Valley; they must literally relinquish part of the self and pretend to be something Other. Speaking to DemocracyNow, Riley explains,\r\n\r\n> _the new capitalism is \"there is no capitalism here. What are you talking about?\" It's like, this is not a workplace, this is a bean bag room. And I'm not your boss, I'm your friend who tells you what to do.\" And so, as opposed to the oil baron idea, these are the cool people that everyone loves._\r\n\r\nThis is represented most clearly in the film by Steve Lift.\r\n\r\nInterestingly, however, it's not just at RegalView where white voice is necessary; in attempting to woo customers to her art exhibition, Detroit too employs white voice. However, unlike Cash or Mr. _______'s white voices (provided by David Cross and Patton Oswalt, respectively), Detroit's is not only white, it's also British (voiced by Lily James), a distortion not only of her ethnicity, but so too of her nationality. She uses this voice to convince customers to take her art seriously, suggesting that she feels if she spoke in her real voice, they would not do so.\r\n\r\nThe film also delights in fairly subtle and oftentimes semi-obscure intertextuality. For example, a pair of earrings worn by Detroit declares, \"Bury the rag deep in your face\". This is from the Bob Dylan song, \"The Lonesome Death of Hattie Carrol\" (1963), which is about a black barmaid who died after being assaulted by the 24-year-old William Zanzinger, from the wealthy Zanzinger tobacco farming family. Zanzinger was initially charged with murder, but this was later reduced to manslaughter and assault. He was found guilty by a three judge panel and sentenced to six months in prison, as well as a fine of $500. Elsewhere in _Sorry to Bother You_, during a piece of performance art in which she encourages the audience to throw mobile phones and balloons filled with lamb's blood at her, Detroit quotes from Michael Schultz's _The Last Dragon_ (1985), a martial arts movie produced by Motown founder Berry Gordy. Another example of intertextuality is that Mr. _______ dresses like King George (Robert DoQui) from Jack Hill's blaxploitation classic _Coffy_ (1973).\r\n\r\nAesthetically, the film adopts a visual style obviously influenced by Michel Gondry, and, to a lesser extent, Terry Gilliam. An especially interesting aesthetic device, as anyone who has seen the trailer can attest, is how white voice is handled – rather than having the actors simply speak in a different voice, Riley instead has the white actors' voices overdubbed; when Salvador first hears Cash's white voice, he literally tells him \"_you sound overdubbed_\". However, the lip syncing is, presumably intentionally, far from perfect, with the voice not quite aligning with the actors' mouth movements. This throws the scenes \"off\" ever so slightly, creating an extra layer of surreality, and highlighting just how absurd the whole thing is, drawing attention to the lengths these people have to go to achieve real success. The fact that our culture places such value on \"correct\" intonation is, in and of itself, absurd, like an extreme version of the phone voice that pretty much everyone has, and by failing to perfectly sync white voice to black actor, Riley is able to deconstruct and draw attention to this absurdity.\r\n\r\nThe film's other big aesthetic innovation is having Cash plunge (not especially gracefully) into the living room of the people he calls, desk and all. Obviously, this draws attention to the level of intrusion with which most people greet telemarketers, but, at least in the early stages, it also highlights Cash's own discomfit at being the intruder, seen most clearly when he drops in on a couple having sex. This is an excellently-handled piece of visual shorthand, conveying Cash's internal process, without having him verbalise it at any point.\r\n\r\nAlso impressive is the acting. While the standout performances are definitely Hammer and Hardwick, Stanfield certainly holds his own, with his body-language providing a clinic of wordless performing. Early on in the film, he's hunched over and put-upon, his every movement seemingly uncomfortable, as if ill at ease in his own skin. Later on, however, after his promotion at RegalView, his physicality acquires a more easy nature, he carries himself more confidently, as if high-powered telemarketing has helped him to find himself, something which is, in the context of the whole, doubly ironic. And no matter how surreal things get (and trust me, they get very, _very_ surreal), the cast keep everything grounded, as if what they're experiencing at any given moment is the most natural thing in the world.\r\n\r\nOf course, it isn't all perfect. The wildly unexpected plot twist at the end of the second act will be too much for some people (there were multiple walk-outs at the screening I attended). The film is also just a beat or two too long, and the bottom does fall out to an extent before it reaches its madcap _dénouement_. There's also a mid-credit scene that serves as a kind of epilogue that I'm led to believe was a re-shoot when test audiences found the initial ending too abrupt. For me, however, it doesn't entirely work, and I would have much preferred the original, somewhat darker, ending. Also, with so much satire and humour floating about, almost by definition, not every joke lands, However, the flip side to this is that when Riley's humour does hit the target, it's sublime – Mr. _______ literally beep-denied a name, for example, or Cash's two-word rap being gleefully cheered by Lift's assembled yuppies.\r\n\r\n_Sorry to Bother You_ is as timely and relevant as it is funny and irreverent, as progressive as it is radical, and as inventive as it is confident. Exploring the intersection between race and economics from a wholly satirical point-of-view, the film both condemns and sympathises with those who choose to sell-out in some way so as to climb the ladder of success. Now in his late-40s, Riley is a veteran political protestor, a Chomsky-literate agitator, who is here positing that the most significant divide in the US isn't between white and black, it's between those with money and those without. Suggesting that the desire to cross this divide can lead to a herd mentality, the film argues that the labour force must never forget their collective strength, and must never turn on one another, as in such a situation, management will use workers like horses. A hugely impressive debut, and it will be interesting to see what Riley tackles next.", "created_at": "2019-07-02T22:40:33.643Z"}]