[{"movie_id": 71676, "review_id": "5805ccbd9251415a54001a42", "author_rating": null, "review_text": "**Loved the first Ghost Rider, this one was TERRIBLE**\r\n\r\nTo be honest, i was really looking forward to see this movie, the trailer itself was eye-candy and highly exaggerated.The story is as bad as the actors' performance. Nicholas Cage is going a very , very bad road, his lasts movies , ''season of the witch'' and ''drive angry'' were as thin and dreadful as this one. The action in this movie was unjustified and plain crazy bad, the way ''Blaze'' was written, the laughable dialogues and dumb facial expression of Cage didn't helped at all. The 3D effect on this movie is overrated, everything is too much and fake. Idris Elba was probably the only reason why i went to watch this but even then his role was thin and futile, On the whole, it's messy , funny and plain bad, i pray to god there is not a third one", "created_at": "2016-10-18T07:18:21.208Z"}, {"movie_id": 71676, "review_id": "5a7dcbf8c3a36817b5000b79", "author_rating": 4.0, "review_text": "Christ what kind of bum did they get to write and/or produce this one.\r\n\r\nI really, really liked the first Ghost Rider movie. This one is nowhere near that one. Sure, Nicolas Cage is doing Johnny Blaze again and they even got Christopher Lambert to play an old priest but the movie is just poorly implemented. The Ghost Rider is actually not really appearing that much and when he does, the special effects look cheap and not at all as cool as in the first movie.\r\n\r\nIt doesn’t help that, when he first appears in the movie, he gets shot down by a simple “human” gun and ends up in hospital. This nonsense about, first trying to hide out in some obscure place a ’la The Hulk (been there done that), and then trying to get rid of his powers and afterwards taking on Satan without them is just ruining the fun. The film totally lacks the spirit of the first one.\r\n\r\nAs I said, I’m rather disappointed. It’s really a shame that they screwed this one so badly because now we probably won’t get another one even though they made a lame attempt at the end of the film to leave a door open for that.", "created_at": "2018-02-09T16:27:36.012Z"}, {"movie_id": 71676, "review_id": "611ffb2466ae4d004544dbc4", "author_rating": 7.0, "review_text": "_**Wild sequel**_\r\n\r\nThe first Ghost Rider film from 2007 was fairly faithful to the comic. When Ghost Rider came out in 1972 it was more of a general idea than a fully fleshed-out premise. This was clear as the stories changed from writer to writer and one artist to another. Ideas were added as the years progressed, like the \"penance stare\" and Blaze's growing awareness of the former angel of justice, Zarathos. The book was canceled in 1983 after a ten-year run. In 1990 a new version of Ghost Rider was introduced with a different character and it ran eight years.\r\n\r\nThe first film was an amalgam of the ideas presented in these two series, mostly the first, and struck me as the comic-book come to life. Really, the only thing that was disappointing was the villain, Blackheart, who was seriously scary in the comics, but not so much in the movie.\r\n\r\n\"Ghost Rider: Spirit of Vengeance\" (2012) is a worthy follow-up with Nicolas Cage returning as Johnny Blaze. The story switches to Europe and, more specifically, Romania and Turkey, where the film was shot.\r\n\r\nThis time the devil is played by Ciarán Hinds, rather than Peter Fonda, which isn't a big deal considering Satan could presumably take different physical forms. The devil's main minion is played by Johnny Whitworth, a different character than Blackheart from the original, albeit similar. The hot female is Violante Placido, who's arguably an improvement over Eva Mendes. Another positive is the rockin' soundtrack.\r\n\r\nI don't mind the story switching to eastern Europe since the locations are excellent, particularly the amazing cave-monastery, but there are other changes that I'm not so crazy about, like the charred biker jacket of the Ghost Rider, but this is just a matter of taste; I simply prefer the cool biker \"costume\" as opposed to the dirtbag biker look. A more significant negative is the overactive camera that's annoying and draws attention to itself (hopefully this fad has run its course). But there are enough dramatic parts to balance out the quick-edited thrills; besides, you get used to it\r\n\r\nBOTTOM LINE: \"Ghost Rider: Spirit of Vengeance\" is a quality sequel that interestingly fleshes out the nature of the spirit that possesses Johnny blaze (I'd say more, but I don't want to spoil it). People who claim the film's more \"serious\" and \"faithful\" to the comic are off the mark. It has the same quasi-serious, cartoony-horror vibe as the first film, with glimpses of humor. As radical as the first movie was (in a comic booky way), this one ups the ante and is the better for it. Unfortunately it's marred by the hyperactive camera and quick editing.\r\n\r\nThe film runs 1 hour, 35 minutes.\r\n\r\nGRADE: B", "created_at": "2021-08-20T18:57:40.431Z"}, {"movie_id": 71676, "review_id": "6334b1559d8939007b36e9b3", "author_rating": 2.0, "review_text": "**It's better to forget this movie.**\r\n\r\nAs I said before, in the review I wrote for “Ghost Rider”, I'm not a fan or even an expert in comics, so I'll ignore the source material and focus on the movie. I'm not the right person to say whether or not it's a reliable adaptation. However, I can already say that it is a bad movie. With all its weaknesses, the first film was a work of art when compared to this unfortunate piece.\r\n\r\nThe biggest problem with this movie is that it's a sequel designed to make money. Producers and studios didn't even bother to try to disguise their greed, and rubbed their hands at the good box office obtained. Poorly received by critics, the target of numerous criticisms from the public, but a relative success at the box office, the initial film paved the way for this sequel, which wouldn't be bad if it was a good sequel. Unfortunately, almost the entire cast and crew of the first film (except for Nicolas Cage) is absent from this project, which adopts a totally different visual and dramatic language from the previous film and, thus, cuts any hypothetical continuity.\r\n\r\nThe script is mediocre and is based on a fight between Johnny Blaze and especially powerful evil forces that want to kidnap a child, supposedly the son of the Devil, key-figure to Armageddon. Simple, extremely clichéd, very poorly crafted and poorly developed, it's a script worthy of a 70's B-movie. All the dense atmosphere and something sinister we saw in the initial film is totally absent, having been replaced by something lighter, \"hard rock\" and eventually designed for young adults and teenagers aspiring to be rockers. The fast pace with which everything happens favors the logical flaws, which appear in the script with the magnificence of Baroque palaces, being impossible to ignore them: the case of the monks, with medieval robes and caves coexisting with high-tech devices, weapons that would suffice for Ukraine for a year, and wine capable of getting half the Russian troops drunk, is one of the most egregious. I'd rather not talk about the ability to decompose objects and food that one of the characters will acquire at the end, and that seem to work only when it's convenient for the film.\r\n\r\nNicolas Cage is still present in the film, but he is the only one from the previous cast to do so, since all the others, especially Eva Mendes and Peter Fonda, dropped out of the project after reading the script. Smart decision. Cage, if not brilliant in the first film, is mediocre in the sequel, with a one-dimensional, apathetic and sleepy interpretation. Ciarán Hinds is doing well and doing a great job and very worthy, but he doesn't have much to do, while Violante Placido and Idris Elba, despite their efforts and some good moments, don't make more than an average effort.\r\n\r\nTechnically, the film bets massively on CGI, of great visual and dramatic effect, with the flames and the whole apparatus around the Rider reaching hyperbolic levels. The mine scenes are perhaps the most obvious example of what I'm saying: enough bullets for a military battle, fire everywhere, that huge machine... everything taken to the extreme for visual grandeur and spectacularity. It sometimes worked, there's no denying it, but it often feels like something out of a computer game. Set in an area of ​​Central Europe, the film was partially shot in Romania and makes good use of the beauty of the chosen locations. The sets and costumes are decent given the script and location, and the soundtrack is heavy, tiresome and uninteresting. Worse, however, are the sound effects used, as they are often clearly fake.", "created_at": "2022-09-28T20:40:53.885Z"}, {"movie_id": 71676, "review_id": "63c20c298efe7300a0eb149e", "author_rating": 1.0, "review_text": "Like the First one, this film can't find its footing. Johnny Blaze is also kind of Dan Ketch and the Ghost Rider spirit is kind of both Blaze's and Ketch's possessions.\r\n\r\nIt just doesn't work. It's pulled in two directions in character and because of that it can never find its footing. Like the old Indian saying \"If you chase two rabbits you'll lose them both\"\r\n\r\nThe franchise would have benefited if they chose ONE of the stories to tell, ONE of the Ghost Riders to portray. Pick Blaze, pick Ketch, it wouldn't have mattered, but two characters as fundamentally different as they are, dealing with two completely different demons meshing them together just loses focus on the story.\r\n\r\nAnd beyond that, what you have left is too much CGI.\r\n\r\nIt could have been a much better film if it chose a direction. It didn't, and the story never landed because of it.", "created_at": "2023-01-14T01:58:01.331Z"}, {"movie_id": 71676, "review_id": "6466bc8b2bcf6700fe5f35ed", "author_rating": 6.0, "review_text": "Not any where close to being as good as the first. At least it still has Nicholas Cage. He's the only one from part one in this movie. It's just an ok movie.", "created_at": "2023-05-19T00:02:19.216Z"}, {"movie_id": 71676, "review_id": "6466bc9233a3760158d8ac84", "author_rating": 6.0, "review_text": "Not any where close to being as good as the first. At least it still has Nicholas Cage. He's the only one from part one in this movie. It's just an ok movie.", "created_at": "2023-05-19T00:02:26.332Z"}]