[{"movie_id": 86825, "review_id": "51b7558f760ee3169a001e20", "author_rating": null, "review_text": "Dave’s 1-Word Review:  \r\n_Disturbing _\r\n\r\n67% \r\n\r\nIf you have seen Tim Burton’s run on the classic story, Alice in Wonderland, than you probably know who Mia Wasikowska is, however; you may not be aware of the other works that Wasikowska has been involved with. In fact, Mia has been involved in a little less than thirty titles, but hasn’t been the title character in most of these films. She is known best for her roles as Alice in Alice in Wonderland, Jane Eyre in Jane Eyre, and now India in Chan-Woo Park’s latest thriller, Stoker. Just remember before deciding to watch this film that it is very distasteful for a majority of viewers. \r\n\r\nAfter her father dies in a car accident, India Stoker must cope with the unusual fact that her Uncle Charlie, whom she had no idea even existed, was moving in with her and her distant mother. Charlie is quite a smooth talker and seems to have gotten on India’s mother’s good side…a little too good. His charming personality leads India to believe that there is something more sinister going on, which leads her on a path of discovering the truth. Although, where most movies would have the hero find out the truth and take down the bad guy, India acts as more of a villain who begins to practically side forces with her evil Uncle Charlie, reaching the boundaries of unacceptable behavior. \r\n\r\nRight from the beginning, you know that the movie is remarkably disturbing. You have a creepy Uncle with crazy eyes and a goth girl who you are preparing to witness turn into a psycho-killer at some point. Whether this happens or not, I obviously cannot disclose, but her personality as well as Charlie’s is just out of this world creepy, which is when you begin to realize that there really is no protagonist in this entire story. How can you really root for anyone when no one gives you a solid reason to root? A story can survive with just a protagonist, because we have coming-of-age stories, but just an antagonist doesn’t work well. What this film turns into is the opposite of a coming-of-age flick, you see a teenage girl descend into darkness. \r\n\r\nAlso, even though it isn’t expressly described as such, there is some incestuous themes going on that are hard to miss, which just adds to the ever-growing disturbing nature of the film. When it comes to the writing, it’s a little much to take in, and when it actually comes down to everything all together, it just isn’t very believable unless the world was centered on an extreme episode of Jerry Springer. What was done well, on the other hand was the display of mystery and visual scenery.  \r\n\r\nThe mystery in the movie really provides the life, or the glue to what makes this film survive. You can be as disturbed as you like, but there’s just no way you can leave the movie without seeing how it ends, and that’s a really powerful weapon that a film can have. Yeah, it strives away from your traditional Hollywood format, but it at least did the mystery right. The visual sceneries are just out of this world. It’s not a fantasy or 3D film or anything, but it gets as beautiful as a movie can get, realistically speaking. It does a better job at conveying the beauty that our world already provides without the use of creating beauty that doesn’t exist. This display really compliments the film in a lot of ways, and gives you just another reason to keep watching the movie.  \r\n\r\nWhat it really boils down to is that the movie is just too disturbing to watch on a multiple basis, and doesn’t give you a protagonist to root for, but it has great acting, great visuals, and a dark mystery that will have you plastered to the screen. For some, this may be a guilty pleasure, for others they may find themselves compelled to stop, finding it distasteful. It’s really give or take. \r\n\r\nCheck Stoker out for yourself when it is released on DVD and Blu-Ray on Jun. 18!", "created_at": "2013-06-11T16:51:27.493Z"}]