[{"movie_id": 167073, "review_id": "56cdef8dc3a368126e00015b", "author_rating": 9.0, "review_text": "> An ordinary woman's life struggle that lives very close to average of us.\r\n\r\nA very fascinating movie. Depicted as a real life drama that is totally different from the other Oscars nominees for this year. Based on the novel of the same name, that tells the story of a young Irish woman, Eilis, in the 1950s who travels to the United States, Brooklyn, looking for a better future. Thousands of kilometers across the Pacific ocean, she finds a new job, new friends, a whole new life, but what she misses is her home and family. So how she makes out of those difficulties, and finds a way to go forward is the rest.\r\n\r\nAbout an ordinary woman's life struggle that lives very close to average of us. That's why I loved this film more than other drama films nominated for this Oscar. The first two acts were amazing, the third was a bit off and cliche, but that's how the story rediscovered by getting back at the conclusion. I think this is Saoirse Ronan's full matured character as an adult woman. She was my favourite child actress and seen all her films. So felt strange to see her like this, because that's not how I remember her, but it only gets better after she does more character like this.\r\n\r\nShe was very good, in fact, she should get the Oscar for the role. In my prediction, Brie Larson for 'Room' and Ronan are the top contenders, but if Cate Blanchett wins that'll be a great disappointment. I'm also expecting adapted screenplay awards. The cinematography was fantastic, those 50s New York City really brought back on the screen. It is a must watch, especially if you're a middle aged guy, because you're well experienced about personal and social life already, and this movie only a reminder.\r\n\r\n9/10", "created_at": "2016-02-24T17:59:41.557Z"}, {"movie_id": 167073, "review_id": "59eab15ac3a3685ed800395e", "author_rating": 9.0, "review_text": "Brooklyn (2015)\r\nA Beautiful and Moving Film - A Love Story.\r\n26 August 2016 - 2 out of 2 users found this review helpful.\r\nA beautiful and moving film. A love story that draws you in, and is told so well that you care about the characters almost immediately. The photography and the close-ups are really beautiful, and the camera loves Saoirse Ronan. She leaves Ireland and she is off to America, (Brooklyn). Her trip to America is shot so economically, yet powerfully, you could feel what it must have been like on that Ocean Liner. Homesick and missing her widowed Mum and Sister she makes a home for herself in Brooklyn. But will she stay in Brooklyn? The cast is amazing, Julie Waters, Jessica Pare, and Jim Broadbent, to mention a few. The wardrobe was authentic, and the soft warm colors seemed to give this film a dreamlike feeling. But In the end it was all about Saoirse, she carried this film, there was never a false moment. When she was homesick, you knew it, you could feel it. I love \"BROOKLYN\".", "created_at": "2017-10-21T02:30:50.961Z"}]