[{"movie_id": 49051, "review_id": "50cf0340760ee310f513d014", "author_rating": 6.5, "review_text": "Peter Jackson creates the same world that he already shown us in the LOTR, but that's not the only thing he repeats.\r\n\r\nHe also repeats ripping Tolkiens book into a sucession of endless races and actions scenes with orcs falling everywhere and several \"inventions\" that mess the beautiful story created by the English author.\r\n\r\nHe also repeats those several minutes of platform game inside caves that we saw in Moria and in his version of King Kong.\r\n\r\nIf you loved the previous movies from Jackson, you will love this too.\r\n\r\nIf you are looking for some quality, you will only finding in the re-creation of the Middle Earth and the peformances of Ian McKellen, Martin Freeman and Cate Blanchett.", "created_at": "2012-12-17T11:34:24.128Z"}, {"movie_id": 49051, "review_id": "51429d8219c295563404e583", "author_rating": 9.0, "review_text": "An other great master peace has been added the the Lord of The Rings collection. This movie was an excellent example of how great actors, an amazing story and a beautiful world can be produced in such an excellent way. Peter Jackson has out done his self by creating this great film. There are differences from the book but I can't complain about any of them, yes I love the original story but this one is still one of the best. All in all a amazing movie.", "created_at": "2013-03-15T04:03:14.870Z"}, {"movie_id": 49051, "review_id": "51ec275919c29551df108d8d", "author_rating": null, "review_text": "Over a decade after a little-known director from New Zealand managed to con New Line Cinema into giving him $300 million to make a trilogy based on JRR Tolkien's seminal fantasy (and long considered unfilmable) work The Lord of the Rings, the cinematic landscape for fantasy has changed drastically. Much like Tolkien's tome, the Lord of the Rings films came to utterly define high fantasy in film, with even competing fantasy adaptations like The Chronicles of Narnia and Alice in Wonderland cribbing from Peter Jackon's critically-acclaimed, audience-adored multipart epic. Now Jackson has returned to the land that made him famous for a go-round with Tolkien's earlier work, The Hobbit.\r\n\r\nTolkien's The Hobbit is far more modest in scope than its enormous sequel, and geared for a younger audience. It introduced the world to Bilbo Baggins, a typically quiet hobbit who is coaxed into adventure by the grey wizard Gandalf, enlisted to aid thirteen dwarves in reclaiming their long-lost homeland.\r\n\r\nJackson had the unenviable task of following up on his blockbuster Academy Award-winning masterpiece, and initially passed off the directing responsibilities to fantasy master Guillermo del Toro. Difficulties securing the film rights led to delay after delay, and del Toro finally departed, leaving the original creative team the ability to step back into place and create a follow-up/lead-in with the same creative staff in front of and behind the camera. Jackson returned as director, co-writing with Fran Walsh and Phillipa Boyens (though del Toro retains a screenwriting credit), Andrew Lesnie as cinematographer, and Howard Shore as composer, along with all of the other stalwarts of the original trilogy.\r\n\r\nThe lone exception to that is the recasting of Martin Freeman as the titular hobbit, taking over for the aging Ian Holm. Holm appears in the film's framing sequence (a scene that takes place immediately prior to the beginning of The Fellowship of the Ring), along with that trilogy's star, Elijah Wood. But this time out, it's Freeman's show, and he's as charming, witty, and engaging as you could imagine. He also makes a perfect Young Ian Holm. The casting is truly inspired. Sir Ian McKellen returns as Gandalf (here playing his more impish grey incarnation, rather than the frankly humorless white version) and the heralded thespian manages to imbue his character with both immense power and gravitas, while still throwing in little flourishes that sell Gandalf as an imperfect man, rather than just an all-knowing power. Rounding out the third of this film's main characters, and an addition to this world, is Richard Armitage as Thorin Oakenshield, the leader of the motley crew of dwarves. Armitage likewise manages to imbue Thorin with both rage and honor, and is easily believable as someone who could lead these dwarves into life-threatening battle. The other twelve dwarves are something of a blur, but a few of them manage to make an impression, even with limited screen time. I imagine the two future installments of the series will afford them each the chance to shine.\r\n\r\nWhich brings up the most contentious point of this whole Hobbit affair: the fact that it's a three-part epic. The Hobbit, as written, is a comparatively slim tome of around 300 pages (compare that to The Lord of the Rings' combined 1,600). This installment alone is ten minutes shy of a whopping three hours. And as anyone who's seen The Return of the King can attest, Jackson can get rather indulgent at times (the end[s] of that film). Initially the film was going to be split in twain, then later divvied up into three parts. Tolkien, ever the completist, wrote volumes of backstories for this world, and Jackson decided to pull from them to bulk out these films.\r\n\r\nI've seen a lot of hay being made about the film being bloated and, yes, indulgent. I'm an editor at heart, and am generally hyper-sensitive about cutting down to the bone. But the strangest thing happened on the way to the Lonely Mountain: I found myself simply rolling along with the shaggy-dog pace of the film. It's astonishing in hindsight. The film virtually redefines \"taking the scenic route,\" but the crazy thing is I didn't mind it in the least. I believe it's because of the lowered stakes of The Hobbit. Every single frame of The Lord of the Rings was suffused with overbearing doom; that trilogy's \"save the world\" plot became as heavy a burden to bear as the ring hung around Frodo's neck. But The Hobbit is lighter, freer, funnier, and doesn't have the weight of the world on its shoulders. It's rather the difference between having an appointment you need to get to in heavy traffic and taking a weekend to just drive around, stopping when and where you like. This pace will likely have a dire impact on the film's rewatchability, but sitting in the theater for a midnight showing? Magic.\r\n\r\nThe structure of the film itself seems to have ADD. Its innumerable diversions began to remind me of a live-action Family Guy episode, with character or event mentions that suddenly cause the film to cut away to a dramatization of said. But again, and I can't stress enough how unexpected this was for me, I didn't mind in the least (with one exception: it appears to be an inviolable rule that any scene in Rivendell will stop a film dead in its tracks).\r\n\r\nThe craft of the film manages to best that of its predecessor trilogy: Howard Shore turns in one of his most stirring scores, the production design and art direction are again immersive and beautiful, and Andrew Lesnie continues his unique style of cinematography combining gorgeous shots (wonderful) with frequently blowing out highlights (distracting and ugly).\r\n\r\nOne complaint I do have is Jackon's newfound over-reliance on CGI. Azog the Defiler (a chief antagonist of the film) and the Goblin King (a bit of a lark) are the sorts of character that would have (and should have) been practical effects in the original trilogy. Here they're fully CGI, and their menace is undermined by it. Gollum returns for his most famous scene, and looks wonderful; Andy Serkis' performance and the CGI truly sell this pitiful creature. CGI can be pitiful but not threatening, it appears.\r\n\r\nI don't know what the other two installments of The Hobbit have in store. What I do know is that this return to Middle-earth is off to a great start, and if this is any indication of things to come, I'll most assuredly enjoy the ride.", "created_at": "2013-07-21T18:24:25.950Z"}, {"movie_id": 49051, "review_id": "6031708fb4a543004011f382", "author_rating": 9.0, "review_text": "Of course off the level of its <em>'The Lord of the Rings'</em> predecessors, but I have to say I thoroughly enjoyed <em>'The Hobbit: An Unexpected Journey'</em>.\r\n\r\nIt has good lure to it, the plot is more than interesting, it features pleasant callbacks and - like LOTR - looks exquisite. As for the casting, I like 'em. Martin Freeman (Bilbo) is, like Elijah Wood, an actor I've always found hit-and-miss, but I really did enjoy Freeman's performance here - the humour is his usual schtick, though the rest of his showing is strong.\r\n\r\nIan McKellen (Gandalf) returns and is as much a joy to watch as before. None of the others, though all good, stand out massively, James Nesbitt (Bofur) does bring decent comedic stuff.\r\n\r\nHopefully the two sequels to this are just as fantastic!", "created_at": "2021-02-20T20:26:55.681Z"}, {"movie_id": 49051, "review_id": "631613b91d3143007a43730d", "author_rating": 7.0, "review_text": "There is no doubt that Peter Jackson does a great job bring Tolkien’s fantasies to life, much better, I imagine, than anyone must have assumed when they heard about the Lord of the Rings series way back when.\r\n\r\nI must confess that I don’t like them as much as I enjoyed reading the books. I am sure there are complex reasons applicable to me. I read them when I was very young and it would be difficult to match that first-time experience. Also, the fighting and battles seem more central to the story than I remember. Perhaps that relates more to the modern movie audience rather than my memory.\r\n\r\nAs a funny side note, the film seemed to resemble in places that other fantasy series: the Jurassic Park franchise, in that they seemed to always be going from one close call to another, and the Wizard or somebody repeatedly yelled, “Run!” This series certainly sends the message that if you ever go on a dangerous adventure, it helps to have a wizard along for the journey.", "created_at": "2022-09-05T15:20:25.140Z"}, {"movie_id": 49051, "review_id": "64205ee008cf8700defe61c5", "author_rating": 6.0, "review_text": "It's one thing saying this isn't \"Lord of the Rings\" but it's quite another trying to watch without constantly comparing them. The same style of production with wonderful visual effects, Howard Shore's superb score and for much of the time it features many of the same actors from the earlier Peter Jackson trilogy. Similarly, it takes an age to get going. This first of three struggles in a different way too - there are no clearly defined roles for the characters; no \"fellowship\" if you like, for either the characters or the audience to focus on, so we are effectively starting from scratch with a whole slew of new characters whilst having to adjust to the new timelines for those we already know. Much less of a problem for those who have read the books, but for us other mortals that takes a while - and to be honest, I wasn't so impressed with the casting this time round. Martin Freeman was fine as \"Dr Watson\" in the BBC iteration of \"Sherlock\" but here, he is frankly quite annoying as \"Bilbo\", newbie to the franchise Richard Armitage fares slightly better as Dwarf king \"Thorin\" but it is an otherwise unremarkable cast that joins Sir Ian McKellen's \"Gandalf\" as they set off to reclaim their underground kingdom of Erebor from the fearsome dragon \"Smaug\". To be fair, the story itself is not so good so the team have less to work with; and we are also now very used to the style and look of events from Middle Earth, so this was always going to make less of an impact - but the acting could have been considerably more robust. The saintly elves are bit too wholesome for me - though Cate \"loads of audio reverb\" Blanchett looks stunning as \"Galadriel\". There are plenty of evil orcs, goblins, and wargs to keep their perilous task engaging enough, though, and we are mercifully spared much of the infuriating \"Gollum\" (Andy Serkis) whom I cheered into the volcano at the end of \"Return of the King\" (2003). It is a good film, the two hours fly by and as a fan of the first trilogy, I shall stick with these - but I fear this is really a big screen experience that loses much on a smaller one with far to much dialogue and padding and not enough action.", "created_at": "2023-03-26T15:04:00.898Z"}]