[{"movie_id": 359724, "review_id": "5dc6954a99259c001380a087", "author_rating": 8.0, "review_text": "A biography on American underdogs from a blue-collar industry with notable actors, an impressive production team, and an inspiring story; did someone say Oscars? Whatever its intent, ‘Ford v Ferrari’ is an impressive biopic that rarely strays from its path. A melding of entertainment and creativity, this should be considered both a commercial and critical success. Fire up your engine and race to the cinema to catch this film that everyone’s sure to be talking about.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-ford-v-ferrari-a-racing-biopic-thats-right-on-track", "created_at": "2019-11-09T10:30:34.875Z"}, {"movie_id": 359724, "review_id": "5de333560cd446001437702b", "author_rating": 8.0, "review_text": "_**I'd have preferred to see Michael Mann's version, but this is an impressive and heartfelt study of friendship and triumph**_\r\n\r\n>_Next year, Ferrari's ass is mine._ \r\n\r\n- Carroll Shelby, after losing to Ferrari in the 1964 World Sports Car Championship\r\n\r\n>_To take control of this materialised energy, to draw the reins over this monster with its steel muscles and fiery heart - there is something in the idea which appeals to an almost universal sense, the love of power._\r\n\r\n- A.J. Baime; _Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans_ (2009)\r\n\r\nIn 2015, a long-gestating project was announced as entering pre-production – based on Brock Yates's 1991 book _Enzo Ferrari: The Man, the Cars, the Races_, the film was tentatively called _Enzo Ferrari_ and was to be written, produced, and directed by Michael Mann (_Heat_; _The Insider_; _Ali_). A long-time racing fan, Mann had been trying to bring Ferrari's story to the screen since the book was published (in 1992 it was reported that Robert De Niro was circling the role and Mann would begin shooting right after he completed work on _The Last of the Mohicans_), but in 2015, things seemed to finally be moving ahead. Christian Bale was cast as Ferrari and Noomi Rapace as his mistress, Lina Lardi. And then, nothing. Time passed and no more was heard until 2017, when it was announced that Bale had dropped out and been replaced by Hugh Jackman. And again, nothing. In the meantime, a different film was greenlighted – an adaptation of A.J. Baime's 2009 book, _Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans_. Set to star Tom Cruise and Brad Pitt, it was to be written by Jason Keller (_Machine Gun Preacher_; _Mirror Mirror_; _Escape Plan_) and directed by Joseph Kosinski (_Tron: Legacy_; _Oblivion_; _Only the Brave_). That version of the project never got off the ground, but in 2018, it was announced that James Mangold (_Cop Land_; _Girl, Interrupted_; _Logan_) had signed on as director, working from a new version of Keller's script, written by Jez Butterworth and John-Henry Butterworth (_Fair Game_; _Edge of Tomorrow_; _Get On Up_). Rather confusingly, none other than Christian Bale is in the cast, although not as Ferrari, whilst Mann himself is credited as an executive producer. Is this (at least in part) the remnants of his own film? Is his credit related to nothing more than rights, or was he actively involved in making the movie? Will we still see his _Enzo Ferrari_ at some point?\r\n\r\n_Le Mans '66_ (released in North American with the equally generic title of _Ford v Ferrari_) is an excellently made but unadventurous movie. Mangold is a fine director, but he's no Mann, nowhere near, and the film did, to a certain extent, just leave me pondering what kind of kinetic brilliance Mann would have brought to bear on similar material. In contrast, to Mann's body of work, _Le Mans '66_ could never be accused of breaking any new ground or trying anything especially original – it hits all the beats, it hits them well, but it never strays from the formula. Much as Mann's _Ali_ (2001) was a boxing movie on the surface only, being far more interested in politics and institutional racism, Mangold's film isn't really about motor cars – it's about friendship, male pride, personal integrity, sticking it to the Man, art v commerce, individuals v corporations; it is, in essence, a thematically broad and aesthetically anonymous pre-_auteur_ theory audience-pleaser made with the technology and aesthetic sensibilities of modernity. And whilst the individual parts may be unsatisfactorily safe and familiar, the whole is unexpectedly accomplished and immensely enjoyable.\r\n\r\nThe film begins in 1959 as Carroll Shelby (Matt Damon) wins that year's 24 Hours of Le Mans in an Aston Martin DBR1/300. However, shortly after the victory, he's told he has a heart condition and must stop racing. The film then jumps to 1963, as Ken Miles (Christian Bale), a brilliant but volatile and unpredictable driver, is running a sports car repair garage in LA, but the venture is failing (mainly because he continuously berates his customers for one thing or another). The British-born Miles has a reputation as one of the best drivers in the world, and is renowned for his almost supernatural ability to identify problems in test cars after only one or two laps. However, because of his personality, no one will hire him. Meanwhile, Ford Motor Company Vice President and General Manager Lee Iacocca (Jon Bernthal) suggests that Henry Ford II (a superb Tracy Letts, who steals every scene he's in) buy the cash-strapped Ferrari N.V., speculating that Ford's involvement in international racing may go some way to countering the company's reputation for making boring and unattractive family cars (in essence, he hopes the purchase will give the company more street cred). Enzo Ferrari (Remo Girone), however, turns down the deal in favour of a counter-offer by Fiat Automobiles, which is more lucrative and allows him to retain ownership of Scuderia Ferrari (Ferrari's racing division). He also calls Ford II fat. Enraged, Ford II determines to build a car capable of winning Le Mans, a race which has been dominated by Ferrari for years, winning in 1958, 1960, 1961, 1962, and 1963. Iacocca reaches out to Shelby, the last non-Ferrari driver to have won the event, and asks him to design a car which can beat any Ferrari. Shelby and his engineering partner Phil Remington (Ray McKinnon) get to work but soon Shelby explains to Iacocca and Ford II that they will need a great driver as well as a well-designed car. And so he reaches out to Miles, who comes on board, but immediately clashes with the Ford executives, particularly Senior Executive Vice President Leo Beebe (Josh Lucas). Nevertheless, Shelby, Remington, and Miles press on developing the GT40, a car capable of reaching speeds of 135 mph, if only it didn't keep breaking down.\r\n\r\n_Le Mans '66_ is somewhat similar to Damien Chazelle's _First Man_ (2018), insofar as it uses the grandiose moments of history to tell an intimate story. Whereas Chazelle used the Apollo Program as the background against which to examine a failing marriage, Mangold uses the determination to win Le Mans '66 as the background against which to examine issues such as friendship and the clash between gifted individuals for whom success is its own reward and corporations who don't see value in anything unless it's monetarily successful. Indeed, the argument could be made that the film is actually a commentary on the Hollywood studio system, with Shelby and Miles representing independent filmmakers who love the craft and see the medium as an art-form, whilst the Ford executives represent the studio, always more concerned with the bottom dollar than artistic integrity, always getting in the way of the people who, if left alone to work, could produce something spectacular.\r\n\r\nThe film is also extremely funny in places, especially in a scene where Shelby shows up at Miles's house, and the two get into a fight on the street. Miles's wife Mollie (an underused Caitriona Balfe) emerges from the house, looks at the two men fighting, goes back inside, and remerges with a garden chair, a drink, and a copy of _Better Living_. She then sits down to watch the action. It's a hilarious moment, but it's one with great thematic importance – this is very much an androcentric world (Mollie is virtually the only female in the entire film), but for this brief moment, the audience is allowed to pull back and laugh at the utter ridiculousness of competitive maleness – boys will be clichéd boys, always trying to outdo each other, and getting all worked up over something as pointless as a fast car.\r\n\r\nThis thematic focus, however, is not to say the film ignores the intricacies of racing; on the contrary, there's a huge amount of techno-babble concerning vectors, aerodynamics, the mathematics of torque, the torsion of metal, and the ins and outs of physics. Additionally, although thematically, the focus isn't on the races themselves, there's no denying that the aesthetic design of these scenes is exemplary, albeit familiar. Mann would have done wonders here, but Mangold, cinematographer Phedon Papamichael (_The Ides of March_; _This Is 40_; _Nebraska_), and sound designers David Giammarco (_The Amazing Spider-Man 2_; _The Dark Tower_; _The Predator_) and Jay Wilkinson (_Furious 6_; _Man of Steel_; _Alpha_) have crafted some truly intense moments. For the most part, Mangold and Papamichael avoid any objective shots (for example, there are no overheads giving us a good vantage of the entire race), and there are very few shots showing us something that Miles is unable to see. The scenes aren't shot in the first-person, but our vision is anchored to his. This, of course, contributes to a subjective focalisation and creates the sense of being in the car with him, which brings a default level of intensity, as well as giving the viewer a perfect vantage point from which to see just how fast these guys are going and how difficult what they do actually is.\r\n\r\nIs there a Mann influence on the racing scenes? Absolutely; if you're familiar with how Mann often shoots cars in motion (the camera affixed to the side of the car, with the screen virtually split in two – the side of the car taking up one half, the approaching road taking up the other), you simply can't help but notice the similar positioning of Papamichael's camera. Are they the best racing scenes ever put on film? No; you can find those in Lee H. Katzin's _Le Mans_ (1971), which intercuts footage shot during the real 1970 event with material staged for the film, lending the whole thing an unprecedented intensity that has yet to be topped. However, _Le Mans '66_ makes a hell of an effort, and that can only be commended.\r\n\r\nIn terms of problems, there are only two of any significance. The first concerns just how safe and rudimentary the film is. Aesthetically, although the race scenes are kinetic and exciting, there isn't anything new or inventive in them; thematically, the film doesn't say anything we haven't heard before; and structurally, it walks a very well-worn path – chances are that everything that you think might happen in _Le Mans '66_ does happen. This is your basic underdog story, and it adheres rigidly to that template. The character of Beebe is a good example of just how rigidly. In essence, he's a poorly written token villain because you can't have an underdog story without a token villain (usually in the form of bureaucratic interference). In this case, when Mangold feels the need to inject some conflict into proceedings, Beebe will pop up to throw a wrench into the works. His motivation? Apart from some brief references to how he doesn't think Miles is a \"_Ford man_\", his antipathy is never explained – the character is a Swiss army knife villain who can be used for multiple purposes, a one-size-fits-all token bad guy without an iota of nuance or interiority. The second problem concerns Shelby himself, who is disappointingly one-dimensional (at best), as we learn absolutely nothing about his personal life – for example, the film makes no reference to the fact that by 1963 he was on wife number three (of seven!). Who is the film's Carroll Shelby, and why should non-racing fans care about him? We never get an answer – he's Matt Damon wearing a Stetson and speaking with a Texas drawl. And that's about all the character development he gets.\r\n\r\nAlthough these issues are significant in isolation, the thing about _Le Mans '66_ is that it's so well made, it rises above the clichéd and overly-familiar nature of many of the individual scenes, resulting in a whole that is very much more than the sum of its parts. A film about friendship and integrity rather than racing, it doesn't take any risks, nor does it bend any rules. Indeed it does nothing that could be labelled innovative. For all that, however, I couldn't help but enjoy it. It won't surprise you, it probably won't move you, it certainly won't change your life, but the storytelling is clear and refined, and the journey is one well worth taking.", "created_at": "2019-12-01T03:28:22.280Z"}, {"movie_id": 359724, "review_id": "5e0a04ae4b9bae0012d623a4", "author_rating": 10.0, "review_text": "I never expected a sports film, let alone one based on a true story, to impress me so damn much. James Mangold offers one of the best, if not the best sports movie ever. With award-worthy performances from both Christian Bale and Matt Damon, Ford v Ferrari (aka Le Mans ‘66) has characters so exceptionally-written and so emotionally compelling that I felt like crying by the end of the film. The races are riveting and entertaining, but it’s the beautiful screenplay that gets me. Definitely, one of the movies of the year!\r\n\r\nRating: A+", "created_at": "2019-12-30T14:07:42.742Z"}, {"movie_id": 359724, "review_id": "5e434d630c27100015829287", "author_rating": 6.0, "review_text": "I think _Ford v Ferrari_ suffers from mismarketing. I don't mean that it was poorly marketed, and that the trailers made it look bad or anything. Just that it was marketed inaccurately. When I was keeping myself abreast of this project, it seemed very much that the insinuation was that the movie would be a battle between Bale's and Damon's respective characters. That this would essentially be the run-through of the whole film, and the climax would feature one emerging victorious over the other. In actual fact, the opposite is true. _Ford v Ferrari_ is largely about the friendship and partnership of those two characters. An occasionally rugged, and one occasion even violent friendship, but a friendship nonetheless. Even the title is misleading. I suppose Ford does v Ferrari at a couple of points over the movie's runtime, but it's not what _Ford v Ferrari_ is **about**. In fact, Ferrari barely features in the movie at all. Here's the kicker though: I actually liked what this thing ended up being, more than I think I would have enjoyed a movie that really did revolve around Bale actually versing Damon, or one about Ford actually versing Ferrari.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-02-12T00:57:07.695Z"}, {"movie_id": 359724, "review_id": "5e4f32dda93d25001a44da08", "author_rating": 9.0, "review_text": "Well made sports-racing movie with excellent acting by Damon and Bale (no surprise there) and the racing sequences were great, not to mention the sound design. Kind of was concerned there wouldn't be enough story to fill the nearly 2.5 hour runtime, but this kept me engaged, though the ending was a bit anticlimactic. Still, good work from James Mangold. **4.5/5**", "created_at": "2020-02-21T01:31:09.934Z"}, {"movie_id": 359724, "review_id": "5f13886ed465370036663bc4", "author_rating": 10.0, "review_text": "Click here for a video version of this review: https://youtu.be/IByQpyGV9Lg\r\n\r\nDespite not being a big fan of track car racing - I’m more of a rally man - the chance to see Matt Damon and Christian Bale lead in a true life story attracted me to _Ford v Ferrari_. It’s a very good movie that tells the tale of the development of Ford’s race program to topple Ferrari as the champions of Le Mans. \r\n\r\nHere’s the official description:\r\n\r\n_American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966._\r\n\r\nI’ll say up front that even though Ferrari is mentioned in the title, they don’t really play a huge part in the movie. I was expecting things to bounce between each camp as they tried to one up each other in the race for glory. While Ferrari are here and there throughout, the main battle of the movie is Shelby and Miles trying to get their work done amidst the interference from factions within Ford’s management. \r\n\r\nIt still makes for a great story though, and it’s a movie that takes you on a ride of many highs and lows. From technological failures and success, to corporate shenanigans, to father-son moments, this hits so many beats that it kept us entertained the whole way through. Not only does it hit them, it does them very very well. There were some moments where I was genuinely holding my breath. It’s great stuff. \r\n\r\nEven from a technical point of view there is a lot to love about this. The cinematography was a stand out for me - some of the sunset shots were stunning, as were the very intense race sequences. I’m sure there’s CGI all through this but it was of such a good quality that it was barely noticeable. \r\n\r\nDamon and Bale are outstanding and lead from the front, with Bale in particular seeming to inhabit the role and transform, as he so often does. Even all the side characters bring their A game and the end result is a pleasure to watch. \r\n\r\nThis is an excellent film, it’s the whole package and feels like a real film as opposed to much of the cookie cutter movies we get a lot of these days.\r\n\r\nI thoroughly enjoyed this and highly recommend it.", "created_at": "2020-07-18T23:40:30.659Z"}, {"movie_id": 359724, "review_id": "5f238cbb43999b0037623d13", "author_rating": 6.0, "review_text": "Exactly what you'd expect from a movie featuring Led Zeplin in its trailer (+1 star for Christian Bale's compelling performance).", "created_at": "2020-07-31T03:15:08.000Z"}, {"movie_id": 359724, "review_id": "63001458b39e35007a84c2b4", "author_rating": 8.0, "review_text": "**Overall : The captivating story of Ford v Ferrari is incredible unto itself, but powerful performance and outstanding directing elevate its rich story to masterful heights.**\r\n\r\nThe fascinating and inspiring story of the Ford Motor Company's first venture into racing. Even with no interest in racing or cars, Ford v Ferrari mesmerizes from beginning to end. Even with incredible performances from Bale and Damon, gritty effects and storytelling, and exceptional camerawork, the true history of Ford v Ferrari is the most compelling piece of this remarkable film. James Mangold's directing took each element of this extraordinary story and made it tangible and stirring. The grit and passion Bale's Ken Miles poured into his art of racing genuinely touched and inspired me. Ford v Ferrari is a premier historical drama and racing film.", "created_at": "2022-08-19T22:53:12.525Z"}]