[{"movie_id": 407890, "review_id": "5cb2f073c3a36808a2ac89d1", "author_rating": 6.0, "review_text": "**_Decent enough, but not a patch on Haigh's previous work_**\r\n \r\n> _I feel everything I do is related to that sense of loneliness and that longing to not be alone. I think all of us spend most of our time feeling alone and we find ways to disguise our loneliness - whether it's relationships, a job or whatever it is - because we know that our central state of being is probably to feel alone. For this story that's especially true: Charley spends a lot of time running away, he leaves the frame and disappears. I think we're constantly battling with loneliness, finding things that make us feel bet__ter, striving for things that we think are going to make us happy and then when they fail to do so, striving for the next thing to try and repeating the process over and over. It's just our basic biological need that keeps us going._\r\n\r\n- Andrew Haigh; \"_Lean On Pete_: In Conversation With Filmmaker Andrew Haigh\"; _Candid_ (May 5, 2018)\r\n\r\n15-year-old Charley Thompson (Charlie Plummer) lives with his father, Ray (Travis Fimmel), who is drinking himself into an early grave. Finding work caring for an ageing racehorse named Lean on Pete, Charley is devastated when he learns that Pete's owner, Del Montgomery (Steve Buscemi), is planning to slaughter the animal. Determined to save his friend, Charley steals Pete, and the two set out on an odyssey across the modern American frontier.\r\n\r\nFans of writer/director Andrew Haigh will know his unassailable talent for what one might label unsentimental emotionalism; his films deal with intensely emotional situations without lapsing into Speilbergian fawnishness. And, although compared to the excellent _Weekend_ (2011), and the masterful _45 Years_ (2015), _Lean on Pete_ is a touch melodramatic, Haigh's talent for allowing character and theme to rise organically to the surface through quiet moments of introspection is still very much to the fore. So why not a higher score? Adapted from Willy Vlautin's 2010 novel of the same name, the biggest problem with the film is that things are laid on too thick; Charley is very much a Job figure, and suffers such a litany of misfortunes that one fully expects him to be diagnosed with terminal cancer. Similarly, the pseudo-allegorical nature of the characters he encounters is too on-the-nose for the realistic _milieu_ Haigh has crafted. Part state-of-the-nation address, part _bildungsroman_, it's worth a look, but is ultimately lacking a satisfying thematic through-line.", "created_at": "2019-04-14T08:33:55.049Z"}]