[{"movie_id": 9290, "review_id": "572f487592514173a1002cbf", "author_rating": 5.5, "review_text": "Dundee Death Knell?\r\n\r\nMick \"Crocodile\" Dundee (Paul Hogan) is in Los Angeles with his son and Sue Charlton (Linda Kozlowski), his longtime companion. There's something amiss in the world of movies and art, and Dundee is soon to be right in the middle of it.\r\n\r\nUndeniably the worst of the three Crocodile Dundee movies, to the point where you wonder just why anyone at the studio gave it the green light? By the time Crocodile Dundee II came out in 1988, it was obvious that much of the charm and adventure like magic from the first film had greatly diminished. So fast forward 13 years and they saw fit to produce another movie.\r\n\r\nStrangely enough it turns out to not be a complete stinker, yes the formula is tired, I mean how many times can you do the fish out of water comedy before it gets lame? But there's some genuinely funny sequences in here, with barbed asides towards the movie industry and the American way of life. Hogan and Kozlowski are still likable leads, their chemistry cemented, and if you can get past the stereotypes on show (they forgot this was not the 80s!) there's some fun to be had on a time waster basis.\r\n\r\nInstantly forgettable, and certainly not needed, it is however a pic that fans of the first two films can find a modicum of comfort in. 5.5/10", "created_at": "2016-05-08T14:08:53.388Z"}, {"movie_id": 9290, "review_id": "5c4fba430e0a2612cccd4537", "author_rating": 5.0, "review_text": "***Meh sequel, but a handful of genuine laughs***\r\n\r\nSue (Linda Kozlowski) has to fill-in at a newspaper in Los Angeles for a few weeks and so Mick (Paul Hogan) & their son tag along. Misadventures ensue as they investigate a dubious movie production company.\r\n\r\n“Crocodile Dundee in Los Angeles” (2001) is the final flick of the trilogy and easily the least. Hogan is still his genial self and Linda is more beautiful than ever at 42 (during shooting), inside and out, but too much of the story is flat and the the constant product placements are annoying. Still, it’s likable nonsense and I found myself busting out laughing at the goofy humor at least seven times.  \r\n\r\nThe film runs 1 hour, 32 minutes and was shot in (big surprise) Australia and Los Angeles.\r\n\r\nGRADE: C", "created_at": "2019-01-29T02:28:19.180Z"}]