[{"movie_id": 980078, "review_id": "641ecaedc613ce00e0f1a440", "author_rating": 5.0, "review_text": "Now don't judge. You mustn't judge. If you do this will come across as the most atrocious piece of cinema since \"Mesa of Lost Women\" (1953). \"Christopher Robin\" (Nikolai Leon) is taking his fiancee back to the wood in which he played with \"Pooh\", \"Piglet\", \"Eyeore\" etc. as a child. What he doesn't appreciate, though, is that in the intervening years things got tough for his erstwhile friends. They couldn't fend for themselves, and were reduced to cannibalism to survive.... Aside from altering the balance of their tiny mids, this also instilled in \"Pooh\" and \"Piglet\" a grim and determined need for vengeance. What now ensues is hilarious. What ever budget there was must have been spent on gin for the cast: the costumes and lighting are pretty dreadful and the script - well that is almost as bad as the acting. Leon is quite easy on the eye, but the sight of him being whipped to within an inch of his life with the tail of \"Eyeore\" by a large man in an ill-fitting yellow bear suit whose mouth was oozing honey like a drooling bairn just has to be seen. Cinema can be too earnest and worthy at times, and I think this is the perfect recalibration for that - it is certainly neither, nor is it a film you will ever (want to) remember after you've seen it. Still, the cinema was packed and there was laughter a-plenty throughout the eighty minutes or so this risible drivel lasted. It could easily be a school project - nothing here is of an higher standard, and it did make me squirm at times as the 1970s \"Doctor Who\" special effects department came back to life - but I didn't hate it.", "created_at": "2023-03-25T10:20:29.086Z"}, {"movie_id": 980078, "review_id": "6436c595fd4f800095548b7c", "author_rating": null, "review_text": "Absolutely horrible", "created_at": "2023-04-12T14:52:05.821Z"}, {"movie_id": 980078, "review_id": "64564523c3c891018955bd3e", "author_rating": 1.0, "review_text": "Rhys Frake-Waterfield... what in god's name have you done.\r\n\r\nLet me preface this with a note that I am no stranger to horror, terrible horror, and finding enjoyment in what the masses hated.\r\n\r\nI went into this knowing this was a godawful movie. I expected at least one of those \"i know this b rated horror is ridiculous, terrible and pure shite, but because I know that, it will be hilarious.\"\r\n\r\noh boy. and there's a sequel?\r\n\r\nroll on another godawful series i now have to complete bc thats the way my brain and ocd works.\r\n\r\nthis is godawful. i mean _god awful_. i mean i couldnt stop yawning, i almost stopped watching entirely and dropped it, and i have promptly told everyone who was going to watch it under the same premises of \"this is awful so it should be funny\" to just stay cleer of it and watch any of the other 100-300 horror movies coming out this year.\r\n\r\nthat being said, if this was an animated horror movie, i think this would have been perfect and done brilliantly. but this? dear lord.\r\n\r\nwhat a terrible start to my 2023 year watching.", "created_at": "2023-05-06T12:16:35.523Z"}]