[{"movie_id": 47933, "review_id": "5769f7afc3a3683726001772", "author_rating": null, "review_text": "\"Independence Day: Resurgence entertains like few Hollywood blockbusters have of late, largely by foregoing pretension on every level and drilling down on the basic tenets of popcorn moviemaking...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/6/22/independence-day-resurgence.html", "created_at": "2016-06-22T02:27:59.055Z"}, {"movie_id": 47933, "review_id": "581cf459925141344d00134c", "author_rating": 6.0, "review_text": "**The earthlings are united to defend the home from another alien attack.**\r\n\r\nI have said it many times that when I love a film, I always pray for a sequel to come. But I won't do that for all the films like perhaps 'Taken' and this one. These are not designed for that kind of a stretch or to own a franchise. So anyway they have made it and I'd watched. Since I was not expecting it, I did not care about the how it ends. I mean critically failed and the box office was okay, but did not meet the expectations. I mean not found anywhere near to the original film's collection.\r\n\r\nFor me, minus half point for the Chinese flavour. I think the Hollywood must stop leaning towards Chinese contents. It is like they are ignoring the rest of the world. I want the old days American films, not this yuan targeted films. Sorry, that is one of the reasons why I disliked films like this, 'Now You See Me 2' and many other recent sino-Hollywood films.\r\n\r\nThis story takes place 20 years later to the original film. Only a handful of characters returned and many of them were new. So now the humans leaped forward after adapting the alien technology. But when they learn the distress call was sent to the base of the enemy from the 20 years ago event, they are underprepared for another alien attack that follows very soon. Without any option they push their full force to defend the earth and it would they succeed or not is what the remaining film to reveal.\r\n\r\nNowadays the graphics are not an issue. The filmmaking had touched down for a standard in the visual quality, especially a big production like this. So those parts even overplay the performances of the real actors. We have seen that from Gollum, King Kong and many other monster films. So if you are watching a today's high end film means, it is a pleasure from the blow ups we expect the most. Similar to killings from the horror thrillers. This film does that so well, that mean it is entertaining, but not the overall film very praisable.\r\n\r\nThis story can be easily connected to many classics such as 'Star Wars' and 'Avatar'. Because how it ends seems like a story about the origins of those films. So the third film is like definitely takes us deep into the space. Looks very interesting, but does it work is the real question. It is already in the work with the same director. So lets wait and see how it corrects its mistakes. Meantime, you can watch this if you haven't yet, but it is an average film.\r\n\r\n_5.5/10_", "created_at": "2016-11-04T20:49:29.502Z"}, {"movie_id": 47933, "review_id": "58c7e513c3a3683df300d9fd", "author_rating": 7.0, "review_text": "Independence Day: Resurgence is pretty much what I expected. Actually, given all the negative reviews floating around, it is almost better than what I expected. As is almost always the case, all the 1 and 2 star ratings and “worst movie ever” reviews are pure bullshit. The biggest advantage the original movie had was the novelty of it all. This movie is really pretty much the same except for the special effects being even bigger to the extent that they are somewhat over the top at times and the plot somewhat thinner. Having said the latter, the original movie did not really have much in terms of plot either and the nonsense of giving a totally alien computer a virus was so bad it really dragged down the movie.\r\n\r\nIn the relatively short timespan of two decades humanity have improved their technology base by several orders of magnitude (ray guns on the moon etc. etc…). The speed of improvement is of course pretty unrealistic, even with access to alien technology, but hey, I can live with that in order to increase the coolness factor of the movie.\r\n\r\nThen comes an alien ship. Not the aliens we all expected by another one. The ship is totally different from the previous ones, do not seem aggressive but of course dumbass politicians manage to screw everything up. Fast forward a couple of scenes and the “real” aliens arrive. Of course this time they have a bigger flyswatter and they perfunctorily proceed to swat away the puny, extremely slow firing, little ray guns of the humans and we are back to where we started in the original movie. Huge space ship parks on Earth, time for plan B.\r\n\r\nWell there were quite a few scenes of big space ships, destruction and mayhem before the aliens finally manage to park their spaceship. I guess finding a parking space for a 5 000 kilometer space ship can be a bit tricky (I though I had an issue with my Jeep). Here is were I have quite some gripes about the movie. The special effects are cool, no question about it, but they are also exaggerated and throws any attempt to be remotely adhering to the laws of physics out the window. It is clear that whatever low intelligence storywriter that wrote that garbage flunked science classes in school, if he ever got that far of course. For instance, we have a 5 000 kilometer (the Earth radius is about 6 370 kilometer) that is big enough to generate its own gravity (apparently the engines somehow contributed to this) flies in and lands on earth. When it approaches items on the surface, cars, trains, ships, skyscrapers and bits and pieces of the Earth itself starts to fly upwards. It makes for cool effects but anyone with a mediocrum of intelligence ought to realize that such a force would actually destabilize Earth itself. Possibly change the speed of rotation as well as the orbit around the sun.\r\n\r\nThe story is full of other typical Hollywood stupidities and plot holes. Christ even my kids could spot the plot holes which were often big enough to drive a battleship through!\r\n\r\nAs for the acting. Well, I would say there is not too much to say about it. Most of the main actors managed to make it through the movie without screwing up too badly. Given that it was not the deepest or thought provoking movie one could imagine I would say that was good enough. The best character in my opinion was Judd Hirsch as Julius Levinson. The worst one was probably Dr. Okun. Not that Brent Spiner was making a bad job of representing him but the character was just to crazed out for my taste.\r\n\r\nOkay, I will stop whining now. This movie was pretty much exactly what I expected. Great special effects tied together with a paper thin story. I went into it hoping that the effects were going to be good with little expectations on the rest and that is exactly what I got. The movie fulfilled my expectations completely and thus I consider it worth 7 out of 10 stars. I enjoyed the two hours watching it.", "created_at": "2017-03-14T12:41:55.522Z"}]