[{"movie_id": 6687, "review_id": "5ce20fc40e0a263f91c9b676", "author_rating": 8.0, "review_text": "***Slow-build suspense on the Trans-Siberian Express***\r\n\r\nA couple doing missionary work in China (Woody Harrelson & Emily Mortimer) takes the Trans-Siberian train from Beijing to Moscow, but their involvement with a dubious couple (Eduardo Noriega & Kate Mara) gets them entangled with a no-nonsense narcotics detective (Ben Kingsley).\r\n\r\nA relative told me a story of his travels in Russia back when it was part of the USSR: He said the deeper he journeyed into the country the more it seemed like he was going back in time. At one point he happened to turn around in some kind of an installation and immediately got stopped by authorities and apprehended. He was taken to the proverbial dark room with a hanging light where he was interrogated for a couple hours. I asked what he thought was going to happen and he said he feared getting taken to a gulag in Siberia.\r\n\r\nI bring this up because you’ll see these kinds of elements in \"Transsiberian\" (2008), a crime drama/suspense/thriller that has the tone & themes of “A Simple Plan” (1998), but mixed with a little “Runaway Train” (1985) and “Dr. Zhivago” (1965). While I still prefer “Runaway Train” I have no problem listing “Transsiberian” with these notable films, despite the fact that it’s an obscure flick that bombed at the box office (no doubt because it wasn’t released properly and didn’t reach enough theaters). \r\n\r\n“Transsiberian” works so well because it has the confidence to take its time and establish the characters, which are nicely fleshed-out. Roy (Harrelson), for instance, is an affable Christian who seems oblivious to the evil in the world and assumes the best in everybody. His wife, Jessie (Mortimer), by contrast, has a dark history, but was obviously attracted to Roy’s innocence. She sees her former-self in Abby (Mara), which links them. Meanwhile Carlos (Noriega) is the worldly bad boy who’s an expert at wooing women.\r\n\r\nBut this is just the set-up, the movie takes a thrilling turn in the last act, but it’s superior to the similar Hollywood turn in “A Simple Plan,” which I found unconvincing and a little eye-rolling.  \r\n\r\nThe film runs 1 hour and 51 minutes and was shot in Lithuania, Russian and China.\r\n\r\nGRADE: A-", "created_at": "2019-05-20T02:24:04.382Z"}, {"movie_id": 6687, "review_id": "6083a1dc56b9f7002930fe18", "author_rating": 5.0, "review_text": "Another excellent Woody Harrelson performance. Otherwise, not really worth a watch.", "created_at": "2021-04-24T04:43:08.799Z"}]