[{"movie_id": 19912, "review_id": "5015b1e919c2955653005fa2", "author_rating": null, "review_text": "I had low expectations when I entered the theater to see the 5th installment of the FD series, because the 4th movie was such a disappointment. But after watching it, I was surprised. First off,this movie was way,( and I mean), way better then the last two movies were. It was darker and had a lot of elements from the first movie, which I loved. I don't want to give away too much, but I do want to say that the last scene of the movie will leave you speechless. It had me thinking, \"OMG, that was AMAZING how they came up with that twist.\" One last thing I loved about this movie was that it was well planned out and thought of, unlike the forth movie which was a joke and in my opinion, shouldn't have never been made. The deaths weren't rushed as opposed to the deaths in the forth movie, and it gave more screen time to introduce us to the characters. Note: I will say that there is one death scene in the movie that I didn't see coming, besides the ending. I recommend you see this movie. It might have the same theme as the first four movies, but unlike the first four, it's on a much higher scale.", "created_at": "2012-07-29T21:58:01.000Z"}, {"movie_id": 19912, "review_id": "55bdad5ac3a3686534004584", "author_rating": 4.0, "review_text": "It's not actually final...\r\n\r\nYou can just imagine the suits sitting around their big round table discussing how to churn out another financially beneficial Final Destination movie and get away with it. Big suit number one puts forward that they obviously need more inventive mouse trap like deaths. Big suit number two has the genius notion that 3D is again taking off so why not utilise that option too. And that's pretty much all that it took, with the end result being a movie that is very self aware of its roots, but still plays out as the runt of the Final Destination litter.\r\n\r\nJust as the director of the first one, James Wong, was brought back to direct part 3, the makers here bring back the director of part 2, David R. Ellis, to direct part 4! Which ultimately proves to be nothing more than some sort of nepotism like factor because The Final Destination is basically just over 82 minutes of poor acting, bad writing and a series of kills weaved together by the odd 5 minutes of barely relevant characterisations (the exposition as painful as the gory deaths!). \r\n\r\nThe kills entertain as they pretty much always have throughout the franchise, with the opening disaster sequences (here set at a speedway stadium) continuing one of the series' great traditions. While the opening and closing X-Ray/Skeletal credit sequences are superb and a credit to those involved. Yet it all feels so tired, where in spite of the willingness to upgrade the technology, it's still lazy and has nothing to really justify its very being other than that to make easy money. \r\n\r\nThe makers of part 5 would have to come up with something special to not turn this franchise from being one that was once bright and inventive, into that of a money train joke. 4/10", "created_at": "2015-08-02T05:40:42.960Z"}, {"movie_id": 19912, "review_id": "5aa229910e0a262c71005960", "author_rating": 6.0, "review_text": "For some reason this one is named The Final Destination instead of Final Destination 4. Almost looks like they expected this installment to be the final in the series but since the 5th one is about to come out on Blu-ray that was obviously a wrong assumption in that case.\n\nA positive surprise. Most people have said that the second third and fourth film slipped compared to the first one and it wasn’t until the fifth film that the series took off again. Well they’re wrong in my opinion.\n\nThis installment was a lot better than the third one. Sure if you do not like gory horror movies then you wont like this film but then why did you even bother with it? Me, I like these kind of films so I was quite happy to see it.\n\nThe special effects was much better than the previous film and not so silly and stupid as they sometimes where in the third one. I liked the ending as well. Classical horror movie style ending and really cool touch with those x-ray shots.", "created_at": "2018-03-09T06:28:33.382Z"}, {"movie_id": 19912, "review_id": "5bdc8d950e0a26283e00265d", "author_rating": 6.0, "review_text": "***More of the same, but with one of the better ‘final girls’ and superior music***  \r\n\r\nThe first \"Final Destination\" movie in 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, an invisible spirit. A group of people, mostly teens, escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying the kids who cheated Death in various creative ways, usually an unlikely chain of events. The opening tragedy in the first film was a plane crash, in the second it's a highway pile-up, in the third it's a rollercoaster mishap while in this fourth entry it’s a tragedy at a racetrack. The fifth film (2011) features a bridge collapse.\r\n\r\nAll of the movies in the five-film franchise tell the same basic story with different characters and minor nuances; all of them are of the same high quality of technical filmmaking. Whether you prefer one or another depends on your preference for cast members and the death sequences (and the locations). Other than these factors they're all basically the same.\r\n\r\nReleased in 2009, \"The Final Destination\" (aka “Final Destination 4”) has a quality redhead heroine in Shantel VanSanten. The director wisely showcases her beauty in a tasteful scene, which none of the previous movies managed to accomplish. Haley Webb and Krista Allen are also on hand in the feminine department. The previous film arguably has the best assortment of women in the series.\r\n\r\nWhile it’s true that you know exactly how this film plays out if you've seen the first three installments, or any of them, there are some highlights beyond the females.  For one, this movie has the best music yet, whether score or soundtrack. The opening tragedy is thrilling as usual and there are several creative death or near-death scenes involving a tow truck, a pool, a car wash, a cinema and an escalator.\r\n\r\nThe film runs 93 minutes and is the only installment that wasn’t filmed in the Vancouver area. The entire movie was shot in the East as follows: The speedway sequences were filmed in Mobile, Alabama; the closing mall scenes in McKinley, Pennsylvania; other scenes & studio work in New Orleans/Harahan, Louisiana; and reshoots in Orlando, Florida.\r\n\r\nGRADE: B-", "created_at": "2018-11-02T17:47:01.042Z"}, {"movie_id": 19912, "review_id": "6463a060e3fa2f0166224fc6", "author_rating": 8.0, "review_text": "This movie has a sweet into too. A race car disaster like no other. Bet that would look sweet in 3D.", "created_at": "2023-05-16T15:25:20.663Z"}]