[{"movie_id": 337404, "review_id": "60ae64210f2ae10057563b35", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThe 101 Dalmatians franchise is one of those Disney properties that is always broadcasted across all main television networks during holidays in my country, usually during Christmas. The live-action films of 1996 and 2000 are stored somewhere in my memory, even though I never really sat down and watched the movies all by myself. Cruella might just be another live-action film from the Mickey Mouse studio, but it's far from being yet another remake, much on the contrary. Just like the vast majority of the company's villains, Cruella de Vil (portrayed by Glenn Close in the previous installments) was even worse than the generic antagonist with cliche motivations that eventually every studio used and reused to exhaustion.\r\n\r\nBesides Cruella's greedy necessities, purely evil personality, and extreme vanity, this wicked character was driven by something completely unthinkable: skinning short-haired puppies to have more success in the fashion industry due to their soft fur. Anyone with a conscience knows that Disney would never bring this character back to the big screen in 2021 without making some changes, especially regarding this motivation in particular. How would a movie with a dog-killing protagonist at its front and center be remotely successful? Obviously, this hardcore motif no longer belongs to Emma Stone's Cruella's defining character traits, which might be a no-no for those viewers who are more protective of the original material, as if times and culture didn't change from decade to decade.\r\n\r\nSince the start of Disney's live-action remakes campaign, audiences have been divided about how to feel and what to expect from these films. Some wish for a copy-paste version of the same story, while others desire a completely different take on the well-known narrative. However, the best experience - and the primary goal of these movies - is a mix of both: a version that keeps the essence and the message of the original while bringing something new and different to the table to justify its existence. Cruella isn't a remake but an origin(al) story based on a classic villain... And it's undoubtedly one of the best films I've seen this year until this day! I didn't expect to write an extensive review, but with so much to address, I know my thoughts will take a while to transcribe to this article.\r\n\r\nLet me start with some easy elements that everyone can see and enjoy without having to go into \"deep analysis mode\". The costume design is indisputably the technical standout. The colorfully stunning dresses steal the show visually, but it's how it differentiates Estella and Cruella that Jenny Beavan shines in her job. Just from what Stone wears, the viewers can easily decipher what character she's playing. The differences between the glamorous, rich people that the Baroness surrounds herself with and the dirty, poor friends Estella meets at the beginning of the movie - Jasper (Joel Fry) and Horace (Paul Walter Hauser) - is also accentuated through their wardrobes.\r\n\r\nThe extravagant parties are packed with Oscar-worthy costumes, but also with beautiful makeup & hair (Nadia Stacey) and absolutely ravishing production design (Fiona Crombie). Nicholas Britell's score carries little references to the music of the other installments, as does the film itself. Craig Gillespie doesn't hide the Easter Eggs spread throughout the runtime, of which some will definitely please the most avid fans. Technically, it's as gorgeous as one came to expect from the studio, but not everything is as impressive as the aspects above. In a movie where even the black-and-white hair and clothes of Cruella pop off the screen, the CGI backgrounds and animals are way too noticeable for the studio that just made a hyper-realistic remake of The Lion King.\r\n\r\nCGI dogs are employed during most of the runtime, which is not only understandable but also commendable. Animal violence in filmmaking is a serious topic that fortunately was solved long ago. However, the VFX don't look good enough, causing the dogs - mainly the Dalmatians - to be an unintended distraction. In addition to this, a specific outdoor location that's quite important to the story is surrounded by an awfully dark, fake background that just feels way too off. Finally, the ending boasts a ridiculous sequence made with terrible CGI that will definitely leave the more \"logic-driven\" viewers stunned with disappointment. I consider this a nitpick, especially since it's not a film without silliness.\r\n\r\nIn fact, Cruella's success partially rests on Gillespie's tone balance. Jasper and Horace become the comic-relief characters, starring in the absurd action sequences that occur at parties and other places they decide to steal from. Now, some people might expect that since the other movies are defined by their irrational fun. However, Dana Fox and Tony McNamara's screenplay carries undeniable similarities to The Devil Wears Prada and the most recent Joker. Estella's life story is far from being a happy tale, and Cruella's rise even less. Overall, the balance between the silly comedy and the more dramatic, depressing, traumatic storyline is mostly well-handled, but there are a few moments where Gillespie lets it too loose, especially in the over-Disney-ish last fifteen minutes.\r\n\r\nSo, let's address the two protagonists: Estella and Cruella. The comparisons with Joaquin Phoenix's take on Arthur Fleck / Joker are impossible to unsee. From the upbringing filled with bullying and family tragedy to the final transformation, Emma Stone's character follows a similar arc, but with clear differences concerning the solution for her problems. Estella dreams of being a fashion designer and idolizes the self-centered, self-indulgent Baroness, which takes her down a learning path of how to be successful in the business. The Baroness' despicable treatment of Estella brings the ruthless Cruella gradually back to life, eventually stealing the spotlight from the lovely little Estella who just wanted to do what she loved for a living... without having to carry on extreme measures.\r\n\r\nAn unexpected, clever twist pretty much completes the protagonist's transformation, which genuinely caught me by surprise. I admit that I didn't have high hopes for this origin story. Nevertheless, the well-written screenplay deeply explores a previously hollow villain, offering her a touching backstory and comprehensible motivations. While it's true that she possesses dozens of identical characteristics to the infamous Baroness, Cruella never truly becomes 100% that person. Honestly, I wouldn't mind seeing a sequel, but I don't think there's room for another film that wouldn't hurt the one we just got. So, there's just one more aspect to delve into: the cast's performances.\r\n\r\nJoel Fry and Paul Walter Hauser are truly hilarious as the famous duo of thieves. Both share a compelling connection to Estella, one that I believe deserved a better conclusion. They become a family, living and stealing throughout their lives, but when Estella starts giving Cruella some screentime, a few issues arise within the trio. These problems are indeed approached and solved, but in a less dramatic manner than I hoped for. Fry is excellent as the more competent, rational Jasper, but Hauser never stops being extremely funny. The before-mentioned balance is rarely affected by the characters' comedic banter, which is something the actors also deserve credit for.\r\n\r\nEmma Thompson delivers one of my favorite performances of her recent filmography, interpreting the Baroness von Hellman. How can you make an extremely over-the-top character feel cartoonish yet strangely real? Someone who clearly feels like an exaggeration of a stereotype but still resembles dozens of people from the real world? Thompson takes her role, and the only reason why she doesn't steal the spotlight from everyone else is because the other Emma rises to the challenge of portraying such a classic villain. With obvious references to Miranda Priestly from The Devil Wears Prada, Thompson is able to be amusing and vile in the same scene, making every second with her on screen feel incredibly captivating.\r\n\r\nNevertheless, Emma Stone manages to stay a level above everyone else. I firmly believe that she's one of the best actresses of her generation. Carrying one of the most expressive faces in Hollywood, Stone was born to play a protagonist with two personalities. Without looking at the screen, any viewer will be able to know if she's talking as Estella or Cruella. Not only she changes the tone of her voice depending on the character, but the mannerisms alter as well. It would be a massive surprise if such an early Disney performance got an Oscar nomination, so her chances are obviously thin. However, if there was an award for Best Monologue, Stone would be a strong contender.\r\n\r\nI don't recall how many minutes it really is, but I can't forget that long, uncut take with Stone at the center of the screen with nothing but her acting the hell out of an emotionally impactful monologue. Switching between Estella and Cruella in the span of milliseconds, her micro-expressions elevate a heartfelt, character-defining speech that will undoubtedly mark this year of cinema. Stone gives not one but two impressive, attention-grabbing performances that will satisfy most viewers looking for a Cruella they can understand and even root for.\r\n\r\nCruella is not only one of 2021's biggest surprises, but it's also one of the best movies of the year so far. Despite the occasional lack of balance between the silly comedy and the dramatic narrative, Craig Gillespie offers an incredibly captivating origin(al) story about one of Disney's classic villains. Dana Fox and Tony McNamara's remarkable screenplay profoundly explores the Estella-Cruella transformation, giving her non-dog-killing, emotionally compelling motivations, a traumatic, depressing past, and an unexpected twist that will probably catch most viewers off-guard. With one of her best performances ever, Emma Stone delivers an award-worthy display, interpreting two personalities in impressive fashion, stealing the spotlight from the other outstanding interpretations. Technically, the distracting CGI in animals and some noticeable green-screen don't overcome the predictably Oscar-winning, stunning costume design, as well as the gorgeous makeup & hair, wonderful production design, and sweet score packed with excellent song choices. A character study that makes this one of Disney's best live-action films in the last couple of decades.\r\n\r\nRating: A-", "created_at": "2021-05-26T15:07:13.281Z"}, {"movie_id": 337404, "review_id": "60c1afeaf9a3fb005bc39198", "author_rating": 9.0, "review_text": "It is one of the best villain origin stories. I had so much fun watching. Both Emmas are a joy to watch, they performed their characters very well. Emma is best as **Estella and Cruella** both.\r\n\r\nThe **world-building** and character development are too good. The background story of Cruella is brilliant.\r\n\r\nThe soundtrack is excellent and the costume designs deserve Oscar. Such beautiful costumes I get to see in this movie. The cinematography and direction are the best.\r\n\r\nCruella's character is quite similar to Joker and Harley Quinn but still, Cruella is much different from both the anti villains.\r\n\r\nShe is dark and became burned by her career and looking for revenge as well as popularity just like the joker. While she loves unique costumes, makeup, a hairstyle like Harley Quin.\r\n\r\nShe is cynical too like Harley and self-interested but then Harley is a good-hearted person who just made bad decisions while Cruella is sociopathic and a bit cruel as well.\r\n\r\nIt's a fun, surprising, and engaging movie. So I just loved it.", "created_at": "2021-06-10T06:23:38.279Z"}, {"movie_id": 337404, "review_id": "60e74fc043250f0047133e58", "author_rating": 3.0, "review_text": "Cruella is such a boring movie HOLY SH#$... You would think with that big of a cast that the movie would Go further than the animation ever did but instead it was a snooze fest. just did not capture the real crazy essence of the animation Cruella.", "created_at": "2021-07-08T19:19:28.996Z"}, {"movie_id": 337404, "review_id": "60f80852f1759c005f35cf02", "author_rating": 10.0, "review_text": "I advise watching this movie as an independent film that tells a separate story, which is different from \"101 Dalmatians\". I also want to say that the film is suitable and those who just want to relax in the evening, and see something funny and not loaded with a deep narrative and plot strokes.", "created_at": "2021-07-21T11:43:14.607Z"}, {"movie_id": 337404, "review_id": "60fa99663d3557005e1801c9", "author_rating": null, "review_text": "This is a fun movie to watch. I have never watched 101 Dalmatians in any form so I don’t have any bias as some do comparing it to other films. The script is intelligent and witty despite having several writers involved, which often leads to a flailing disorganized mess.\r\n\r\nSome of the stunts Estella/Cruella pulls off are crazily original as she fine tunes her knack for bad behavior. I will not go on and on about it — I just plain enjoyed watching it. A small part of me wonders how this crook with a heart turns into what seems to be a more evil incarnation of her later, but since I don’t know the 101 Dalmatians story, I don’t need to worry about it, and neither should you.", "created_at": "2021-07-23T10:26:46.974Z"}, {"movie_id": 337404, "review_id": "611e7f62d7059400738e82d1", "author_rating": 9.0, "review_text": "Cruella is an excellent movie. Disney tried a character’s revolution and we loved it. The villain is not anymore the bad guy. Everyone has a past and everyone can change. But how? Cruella will entertain you and teach you a lot of good things, about you ego and alter ego. But also about relationships between mum and daughter, friends and good people who can change the story. If you want to discover more, all the details at SpotaMovie.com Enjoy it!", "created_at": "2021-08-19T15:57:22.330Z"}, {"movie_id": 337404, "review_id": "62b0c34b72c13e008c5feb92", "author_rating": 5.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/punk-fashion-cruella-review<a>\r\n\r\nThere are many aspects of _Cruella_ that are easy to love. The campiness of Emma Stone’s performance as the titular Cruella, Emma Thompson doing her best Meryl Streep in a The Devil Wears Prada impression, the fashion, the development of Anita Darling’s character (lovingly played by Kirby Howell-Baptiste). All of these things make _Cruella_ the perfect summer movie. It’s a film that doesn’t take a lot of brainpower to follow, and it leaves the audience feeling light and happy. This is a summer blockbuster with loose ties to a beloved franchise and a guaranteed instant hit for Disney.", "created_at": "2022-06-20T18:58:19.837Z"}, {"movie_id": 337404, "review_id": "64900041c2ff3d00e2e14ec9", "author_rating": 6.0, "review_text": "Pretty decent movie. Was not expecting the movie to be that entertaining. I love the little twist into the movie.", "created_at": "2023-06-19T07:14:09.680Z"}]