[{"movie_id": 118340, "review_id": "53f11b7c0e0a2675b8004053", "author_rating": null, "review_text": "This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.", "created_at": "2014-08-17T21:15:40.968Z"}, {"movie_id": 118340, "review_id": "53f11c0b0e0a2675ac003e7d", "author_rating": 8.0, "review_text": "Really funny and with great spcial effects. Probably, one of the movies not to miss this year.", "created_at": "2014-08-17T21:18:03.686Z"}, {"movie_id": 118340, "review_id": "53fafb790e0a267a7b006e20", "author_rating": 10.0, "review_text": "I ΛM GЯӨӨƬ!", "created_at": "2014-08-25T09:01:45.503Z"}, {"movie_id": 118340, "review_id": "5459072dc3a36839ac001d55", "author_rating": 8.5, "review_text": "This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych</em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy</em> has ALL of this.  \r\n\r\n<em>Guardians</em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.", "created_at": "2014-11-04T17:04:45.818Z"}, {"movie_id": 118340, "review_id": "5488c29bc3a3686f4a00004a", "author_rating": 8.5, "review_text": "Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!", "created_at": "2014-12-10T22:00:59.390Z"}, {"movie_id": 118340, "review_id": "59052a58c3a3684ab401343c", "author_rating": 8.0, "review_text": "The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.", "created_at": "2017-04-30T00:05:44.960Z"}, {"movie_id": 118340, "review_id": "5a62d0e59251410b1a005f0e", "author_rating": 7.0, "review_text": "This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:", "created_at": "2018-01-20T05:17:25.189Z"}, {"movie_id": 118340, "review_id": "5b1676510e0a262de801570b", "author_rating": 7.0, "review_text": "**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:38:57.949Z"}, {"movie_id": 118340, "review_id": "5c8426750e0a264303637782", "author_rating": 9.0, "review_text": "Guardians of the Galaxy is a gorgeous and wonderfully entertaining space opera. The characters are so damn lovable, the world building is incredible, the soundtrack gives the film an entirely unique feel, and the effects are astoundingly first rate.\r\n\r\nThe story follows the pattern of the space fantasies that influenced George Lucas, but the presentation is the work of the extraordinarily gifted filmmaker James Gunn. If we ever forget that the MCU was ever a thing (we won't but let's just be hypothetical), many generations will still be talking about this fantastic movie.", "created_at": "2019-03-09T20:47:49.058Z"}, {"movie_id": 118340, "review_id": "6004faca223e20003dbcb07a", "author_rating": 9.0, "review_text": "When planning how I was going watch all these MCU films, this is one I earmarked as being one I thought I'd enjoy - not based on anything of note, I knew very little, but from the passing screenshots and such I had seen it seemed like one I'd enjoy. I'm happy to say I certainly did!\r\n\r\n<em>'Guardians of the Galaxy'</em> is so enjoyable. It's 121 minutes of pure entertainment. It does, at least to me, have a different feel to it when compared to the nine preceding MCU films. That's not a negative for either this or those earlier productions, it just felt different to me.\r\n\r\nI particularly enjoyed the cast, which features - as is customary at this point - a load of well known names. Chris Pratt is, probably, the perfect choice for Peter, he carries the role extremely well - his humour sticks out, but he also performs the more serious stuff nicely.\r\n\r\nZoe Saldana, Dave Bautista, Bradley Cooper and Michael Rooker are all thoroughly enjoyable too. Vin Diesel (kinda?) appears to portray Groot, which pleases me as someone who is a big fan of <em>'Fast & Furious'</em>. There are a few others in there, including Djimon Hounsou and Benicio del Toro. Terrific cast!\r\n\r\nThere is a lot to like here. I look forward to seeing the follow-ups to it.", "created_at": "2021-01-18T03:04:42.710Z"}, {"movie_id": 118340, "review_id": "62421677fea0d7005c88d0b4", "author_rating": 7.0, "review_text": "Generally speaking, I'm fan of Chris Pratt and here he is thoroughly entertaining as the \"Star Lord - Peter Quill\", a sort of inter-galactic treasure hunter who is challenged to track down an orb. Once he finds and tries to sell it, his world becomes a whole lot more interesting as just about everyone from Djimon Hounsou - sporting a cracking hairdo as \"Korath\", to kick-ass Zoe Saldana \"Gamora\" and the most unlikely of duos \"Rocket\" & \"Groot\"- one a racoon (Bradley Cooper), the other a walking tree with an extremely limited vocabulary (Vin Diesel) - want to snatch it from him! It soon transpires that the orb contains a source of unimaginable power that the evil \"Thanos\" and his lieutenant \"Ronan\" (Lee Pace) will stop at nothing to possess. When all these attempts to steal his artefact attract the attention of the authorities lead by an immaculately coiffured Glenn Close, they end up in a maximum security prison where they decide to join forces - alongside the deservedly named \"Drax the Destroyer\" (Dave Bautista), forcing their way out and setting off on a quest to stop the arch criminals from reducing Ms. Close's world to atoms. It's got bundles of charisma, this film - the script is witty and fast moving, the characters are easily the most interesting and developed in the ensemble Marvel-verse, and the pretty eclectic soundtrack is used properly, rather than as a substitute for the dialogue. I'm praying that it doesn't spawn a whole slew of pointless sequels and spin-offs; it's originality is an huge part of it's charm.", "created_at": "2022-03-28T20:11:35.074Z"}, {"movie_id": 118340, "review_id": "63e72fb212777800ab941d55", "author_rating": 9.0, "review_text": "**Guardians of the Galaxy embraced its underdog status in the MCU and catapulted its cast of misfits into stardom!**\r\n\r\nWho saw this movie coming? I know I didn’t. I only saw Guardians of the Galaxy because it’s a Marvel movie, but I knew nothing about the characters, and even some of the actors were still on the rise, but James Gunn and this movie turned them into mega-stars! This movie perfectly balances exceptional comedic performances with sincere heartfelt moments. This rag-tag group of outcasts finds family in each other while finding their way into our hearts. I expected a hilarious performance from Chris Pratt (but was surprised at how ripped he got for the role!) but was surprised by how funny Dave Bautista and Karen Gillan were proving themselves as sensational comedic actors. These unknown characters and lesser-known actors became household names due to great fun writing, entertaining performances, excellent effects, and a perfectly chosen director that knew how to bring it all together.", "created_at": "2023-02-11T06:03:30.638Z"}, {"movie_id": 118340, "review_id": "646cea2fc3514c2b07425848", "author_rating": 6.0, "review_text": "A good nerd flick for the geeks! At least this one has some humor. My daughter loves Groot.", "created_at": "2023-05-23T16:30:39.895Z"}, {"movie_id": 118340, "review_id": "53f11b7c0e0a2675b8004053", "author_rating": null, "review_text": "This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.", "created_at": "2014-08-17T21:15:40.968Z"}, {"movie_id": 118340, "review_id": "53f11c0b0e0a2675ac003e7d", "author_rating": 8.0, "review_text": "Really funny and with great spcial effects. Probably, one of the movies not to miss this year.", "created_at": "2014-08-17T21:18:03.686Z"}, {"movie_id": 118340, "review_id": "53fafb790e0a267a7b006e20", "author_rating": 10.0, "review_text": "I ΛM GЯӨӨƬ!", "created_at": "2014-08-25T09:01:45.503Z"}, {"movie_id": 118340, "review_id": "5459072dc3a36839ac001d55", "author_rating": 8.5, "review_text": "This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych</em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy</em> has ALL of this.  \r\n\r\n<em>Guardians</em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.", "created_at": "2014-11-04T17:04:45.818Z"}, {"movie_id": 118340, "review_id": "5488c29bc3a3686f4a00004a", "author_rating": 8.5, "review_text": "Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!", "created_at": "2014-12-10T22:00:59.390Z"}, {"movie_id": 118340, "review_id": "59052a58c3a3684ab401343c", "author_rating": 8.0, "review_text": "The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.", "created_at": "2017-04-30T00:05:44.960Z"}, {"movie_id": 118340, "review_id": "5a62d0e59251410b1a005f0e", "author_rating": 7.0, "review_text": "This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:", "created_at": "2018-01-20T05:17:25.189Z"}, {"movie_id": 118340, "review_id": "5b1676510e0a262de801570b", "author_rating": 7.0, "review_text": "**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:38:57.949Z"}, {"movie_id": 118340, "review_id": "5c8426750e0a264303637782", "author_rating": 9.0, "review_text": "Guardians of the Galaxy is a gorgeous and wonderfully entertaining space opera. The characters are so damn lovable, the world building is incredible, the soundtrack gives the film an entirely unique feel, and the effects are astoundingly first rate.\r\n\r\nThe story follows the pattern of the space fantasies that influenced George Lucas, but the presentation is the work of the extraordinarily gifted filmmaker James Gunn. If we ever forget that the MCU was ever a thing (we won't but let's just be hypothetical), many generations will still be talking about this fantastic movie.", "created_at": "2019-03-09T20:47:49.058Z"}, {"movie_id": 118340, "review_id": "6004faca223e20003dbcb07a", "author_rating": 9.0, "review_text": "When planning how I was going watch all these MCU films, this is one I earmarked as being one I thought I'd enjoy - not based on anything of note, I knew very little, but from the passing screenshots and such I had seen it seemed like one I'd enjoy. I'm happy to say I certainly did!\r\n\r\n<em>'Guardians of the Galaxy'</em> is so enjoyable. It's 121 minutes of pure entertainment. It does, at least to me, have a different feel to it when compared to the nine preceding MCU films. That's not a negative for either this or those earlier productions, it just felt different to me.\r\n\r\nI particularly enjoyed the cast, which features - as is customary at this point - a load of well known names. Chris Pratt is, probably, the perfect choice for Peter, he carries the role extremely well - his humour sticks out, but he also performs the more serious stuff nicely.\r\n\r\nZoe Saldana, Dave Bautista, Bradley Cooper and Michael Rooker are all thoroughly enjoyable too. Vin Diesel (kinda?) appears to portray Groot, which pleases me as someone who is a big fan of <em>'Fast & Furious'</em>. There are a few others in there, including Djimon Hounsou and Benicio del Toro. Terrific cast!\r\n\r\nThere is a lot to like here. I look forward to seeing the follow-ups to it.", "created_at": "2021-01-18T03:04:42.710Z"}, {"movie_id": 118340, "review_id": "62421677fea0d7005c88d0b4", "author_rating": 7.0, "review_text": "Generally speaking, I'm fan of Chris Pratt and here he is thoroughly entertaining as the \"Star Lord - Peter Quill\", a sort of inter-galactic treasure hunter who is challenged to track down an orb. Once he finds and tries to sell it, his world becomes a whole lot more interesting as just about everyone from Djimon Hounsou - sporting a cracking hairdo as \"Korath\", to kick-ass Zoe Saldana \"Gamora\" and the most unlikely of duos \"Rocket\" & \"Groot\"- one a racoon (Bradley Cooper), the other a walking tree with an extremely limited vocabulary (Vin Diesel) - want to snatch it from him! It soon transpires that the orb contains a source of unimaginable power that the evil \"Thanos\" and his lieutenant \"Ronan\" (Lee Pace) will stop at nothing to possess. When all these attempts to steal his artefact attract the attention of the authorities lead by an immaculately coiffured Glenn Close, they end up in a maximum security prison where they decide to join forces - alongside the deservedly named \"Drax the Destroyer\" (Dave Bautista), forcing their way out and setting off on a quest to stop the arch criminals from reducing Ms. Close's world to atoms. It's got bundles of charisma, this film - the script is witty and fast moving, the characters are easily the most interesting and developed in the ensemble Marvel-verse, and the pretty eclectic soundtrack is used properly, rather than as a substitute for the dialogue. I'm praying that it doesn't spawn a whole slew of pointless sequels and spin-offs; it's originality is an huge part of it's charm.", "created_at": "2022-03-28T20:11:35.074Z"}, {"movie_id": 118340, "review_id": "63e72fb212777800ab941d55", "author_rating": 9.0, "review_text": "**Guardians of the Galaxy embraced its underdog status in the MCU and catapulted its cast of misfits into stardom!**\r\n\r\nWho saw this movie coming? I know I didn’t. I only saw Guardians of the Galaxy because it’s a Marvel movie, but I knew nothing about the characters, and even some of the actors were still on the rise, but James Gunn and this movie turned them into mega-stars! This movie perfectly balances exceptional comedic performances with sincere heartfelt moments. This rag-tag group of outcasts finds family in each other while finding their way into our hearts. I expected a hilarious performance from Chris Pratt (but was surprised at how ripped he got for the role!) but was surprised by how funny Dave Bautista and Karen Gillan were proving themselves as sensational comedic actors. These unknown characters and lesser-known actors became household names due to great fun writing, entertaining performances, excellent effects, and a perfectly chosen director that knew how to bring it all together.", "created_at": "2023-02-11T06:03:30.638Z"}, {"movie_id": 118340, "review_id": "646cea2fc3514c2b07425848", "author_rating": 6.0, "review_text": "A good nerd flick for the geeks! At least this one has some humor. My daughter loves Groot.", "created_at": "2023-05-23T16:30:39.895Z"}, {"movie_id": 118340, "review_id": "53f11b7c0e0a2675b8004053", "author_rating": null, "review_text": "This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.", "created_at": "2014-08-17T21:15:40.968Z"}, {"movie_id": 118340, "review_id": "53f11c0b0e0a2675ac003e7d", "author_rating": 8.0, "review_text": "Really funny and with great spcial effects. Probably, one of the movies not to miss this year.", "created_at": "2014-08-17T21:18:03.686Z"}, {"movie_id": 118340, "review_id": "53fafb790e0a267a7b006e20", "author_rating": 10.0, "review_text": "I ΛM GЯӨӨƬ!", "created_at": "2014-08-25T09:01:45.503Z"}, {"movie_id": 118340, "review_id": "5459072dc3a36839ac001d55", "author_rating": 8.5, "review_text": "This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych</em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy</em> has ALL of this.  \r\n\r\n<em>Guardians</em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.", "created_at": "2014-11-04T17:04:45.818Z"}, {"movie_id": 118340, "review_id": "5488c29bc3a3686f4a00004a", "author_rating": 8.5, "review_text": "Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!", "created_at": "2014-12-10T22:00:59.390Z"}, {"movie_id": 118340, "review_id": "59052a58c3a3684ab401343c", "author_rating": 8.0, "review_text": "The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.", "created_at": "2017-04-30T00:05:44.960Z"}, {"movie_id": 118340, "review_id": "5a62d0e59251410b1a005f0e", "author_rating": 7.0, "review_text": "This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:", "created_at": "2018-01-20T05:17:25.189Z"}, {"movie_id": 118340, "review_id": "5b1676510e0a262de801570b", "author_rating": 7.0, "review_text": "**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:38:57.949Z"}, {"movie_id": 118340, "review_id": "5c8426750e0a264303637782", "author_rating": 9.0, "review_text": "Guardians of the Galaxy is a gorgeous and wonderfully entertaining space opera. The characters are so damn lovable, the world building is incredible, the soundtrack gives the film an entirely unique feel, and the effects are astoundingly first rate.\r\n\r\nThe story follows the pattern of the space fantasies that influenced George Lucas, but the presentation is the work of the extraordinarily gifted filmmaker James Gunn. If we ever forget that the MCU was ever a thing (we won't but let's just be hypothetical), many generations will still be talking about this fantastic movie.", "created_at": "2019-03-09T20:47:49.058Z"}, {"movie_id": 118340, "review_id": "6004faca223e20003dbcb07a", "author_rating": 9.0, "review_text": "When planning how I was going watch all these MCU films, this is one I earmarked as being one I thought I'd enjoy - not based on anything of note, I knew very little, but from the passing screenshots and such I had seen it seemed like one I'd enjoy. I'm happy to say I certainly did!\r\n\r\n<em>'Guardians of the Galaxy'</em> is so enjoyable. It's 121 minutes of pure entertainment. It does, at least to me, have a different feel to it when compared to the nine preceding MCU films. That's not a negative for either this or those earlier productions, it just felt different to me.\r\n\r\nI particularly enjoyed the cast, which features - as is customary at this point - a load of well known names. Chris Pratt is, probably, the perfect choice for Peter, he carries the role extremely well - his humour sticks out, but he also performs the more serious stuff nicely.\r\n\r\nZoe Saldana, Dave Bautista, Bradley Cooper and Michael Rooker are all thoroughly enjoyable too. Vin Diesel (kinda?) appears to portray Groot, which pleases me as someone who is a big fan of <em>'Fast & Furious'</em>. There are a few others in there, including Djimon Hounsou and Benicio del Toro. Terrific cast!\r\n\r\nThere is a lot to like here. I look forward to seeing the follow-ups to it.", "created_at": "2021-01-18T03:04:42.710Z"}, {"movie_id": 118340, "review_id": "62421677fea0d7005c88d0b4", "author_rating": 7.0, "review_text": "Generally speaking, I'm fan of Chris Pratt and here he is thoroughly entertaining as the \"Star Lord - Peter Quill\", a sort of inter-galactic treasure hunter who is challenged to track down an orb. Once he finds and tries to sell it, his world becomes a whole lot more interesting as just about everyone from Djimon Hounsou - sporting a cracking hairdo as \"Korath\", to kick-ass Zoe Saldana \"Gamora\" and the most unlikely of duos \"Rocket\" & \"Groot\"- one a racoon (Bradley Cooper), the other a walking tree with an extremely limited vocabulary (Vin Diesel) - want to snatch it from him! It soon transpires that the orb contains a source of unimaginable power that the evil \"Thanos\" and his lieutenant \"Ronan\" (Lee Pace) will stop at nothing to possess. When all these attempts to steal his artefact attract the attention of the authorities lead by an immaculately coiffured Glenn Close, they end up in a maximum security prison where they decide to join forces - alongside the deservedly named \"Drax the Destroyer\" (Dave Bautista), forcing their way out and setting off on a quest to stop the arch criminals from reducing Ms. Close's world to atoms. It's got bundles of charisma, this film - the script is witty and fast moving, the characters are easily the most interesting and developed in the ensemble Marvel-verse, and the pretty eclectic soundtrack is used properly, rather than as a substitute for the dialogue. I'm praying that it doesn't spawn a whole slew of pointless sequels and spin-offs; it's originality is an huge part of it's charm.", "created_at": "2022-03-28T20:11:35.074Z"}, {"movie_id": 118340, "review_id": "63e72fb212777800ab941d55", "author_rating": 9.0, "review_text": "**Guardians of the Galaxy embraced its underdog status in the MCU and catapulted its cast of misfits into stardom!**\r\n\r\nWho saw this movie coming? I know I didn’t. I only saw Guardians of the Galaxy because it’s a Marvel movie, but I knew nothing about the characters, and even some of the actors were still on the rise, but James Gunn and this movie turned them into mega-stars! This movie perfectly balances exceptional comedic performances with sincere heartfelt moments. This rag-tag group of outcasts finds family in each other while finding their way into our hearts. I expected a hilarious performance from Chris Pratt (but was surprised at how ripped he got for the role!) but was surprised by how funny Dave Bautista and Karen Gillan were proving themselves as sensational comedic actors. These unknown characters and lesser-known actors became household names due to great fun writing, entertaining performances, excellent effects, and a perfectly chosen director that knew how to bring it all together.", "created_at": "2023-02-11T06:03:30.638Z"}, {"movie_id": 118340, "review_id": "646cea2fc3514c2b07425848", "author_rating": 6.0, "review_text": "A good nerd flick for the geeks! At least this one has some humor. My daughter loves Groot.", "created_at": "2023-05-23T16:30:39.895Z"}, {"movie_id": 118340, "review_id": "53f11b7c0e0a2675b8004053", "author_rating": null, "review_text": "This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.", "created_at": "2014-08-17T21:15:40.968Z"}, {"movie_id": 118340, "review_id": "53f11c0b0e0a2675ac003e7d", "author_rating": 8.0, "review_text": "Really funny and with great spcial effects. Probably, one of the movies not to miss this year.", "created_at": "2014-08-17T21:18:03.686Z"}, {"movie_id": 118340, "review_id": "53fafb790e0a267a7b006e20", "author_rating": 10.0, "review_text": "I ΛM GЯӨӨƬ!", "created_at": "2014-08-25T09:01:45.503Z"}, {"movie_id": 118340, "review_id": "5459072dc3a36839ac001d55", "author_rating": 8.5, "review_text": "This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych</em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy</em> has ALL of this.  \r\n\r\n<em>Guardians</em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.", "created_at": "2014-11-04T17:04:45.818Z"}, {"movie_id": 118340, "review_id": "5488c29bc3a3686f4a00004a", "author_rating": 8.5, "review_text": "Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!", "created_at": "2014-12-10T22:00:59.390Z"}, {"movie_id": 118340, "review_id": "59052a58c3a3684ab401343c", "author_rating": 8.0, "review_text": "The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.", "created_at": "2017-04-30T00:05:44.960Z"}, {"movie_id": 118340, "review_id": "5a62d0e59251410b1a005f0e", "author_rating": 7.0, "review_text": "This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:", "created_at": "2018-01-20T05:17:25.189Z"}, {"movie_id": 118340, "review_id": "5b1676510e0a262de801570b", "author_rating": 7.0, "review_text": "**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:38:57.949Z"}, {"movie_id": 118340, "review_id": "5c8426750e0a264303637782", "author_rating": 9.0, "review_text": "Guardians of the Galaxy is a gorgeous and wonderfully entertaining space opera. The characters are so damn lovable, the world building is incredible, the soundtrack gives the film an entirely unique feel, and the effects are astoundingly first rate.\r\n\r\nThe story follows the pattern of the space fantasies that influenced George Lucas, but the presentation is the work of the extraordinarily gifted filmmaker James Gunn. If we ever forget that the MCU was ever a thing (we won't but let's just be hypothetical), many generations will still be talking about this fantastic movie.", "created_at": "2019-03-09T20:47:49.058Z"}, {"movie_id": 118340, "review_id": "6004faca223e20003dbcb07a", "author_rating": 9.0, "review_text": "When planning how I was going watch all these MCU films, this is one I earmarked as being one I thought I'd enjoy - not based on anything of note, I knew very little, but from the passing screenshots and such I had seen it seemed like one I'd enjoy. I'm happy to say I certainly did!\r\n\r\n<em>'Guardians of the Galaxy'</em> is so enjoyable. It's 121 minutes of pure entertainment. It does, at least to me, have a different feel to it when compared to the nine preceding MCU films. That's not a negative for either this or those earlier productions, it just felt different to me.\r\n\r\nI particularly enjoyed the cast, which features - as is customary at this point - a load of well known names. Chris Pratt is, probably, the perfect choice for Peter, he carries the role extremely well - his humour sticks out, but he also performs the more serious stuff nicely.\r\n\r\nZoe Saldana, Dave Bautista, Bradley Cooper and Michael Rooker are all thoroughly enjoyable too. Vin Diesel (kinda?) appears to portray Groot, which pleases me as someone who is a big fan of <em>'Fast & Furious'</em>. There are a few others in there, including Djimon Hounsou and Benicio del Toro. Terrific cast!\r\n\r\nThere is a lot to like here. I look forward to seeing the follow-ups to it.", "created_at": "2021-01-18T03:04:42.710Z"}, {"movie_id": 118340, "review_id": "62421677fea0d7005c88d0b4", "author_rating": 7.0, "review_text": "Generally speaking, I'm fan of Chris Pratt and here he is thoroughly entertaining as the \"Star Lord - Peter Quill\", a sort of inter-galactic treasure hunter who is challenged to track down an orb. Once he finds and tries to sell it, his world becomes a whole lot more interesting as just about everyone from Djimon Hounsou - sporting a cracking hairdo as \"Korath\", to kick-ass Zoe Saldana \"Gamora\" and the most unlikely of duos \"Rocket\" & \"Groot\"- one a racoon (Bradley Cooper), the other a walking tree with an extremely limited vocabulary (Vin Diesel) - want to snatch it from him! It soon transpires that the orb contains a source of unimaginable power that the evil \"Thanos\" and his lieutenant \"Ronan\" (Lee Pace) will stop at nothing to possess. When all these attempts to steal his artefact attract the attention of the authorities lead by an immaculately coiffured Glenn Close, they end up in a maximum security prison where they decide to join forces - alongside the deservedly named \"Drax the Destroyer\" (Dave Bautista), forcing their way out and setting off on a quest to stop the arch criminals from reducing Ms. Close's world to atoms. It's got bundles of charisma, this film - the script is witty and fast moving, the characters are easily the most interesting and developed in the ensemble Marvel-verse, and the pretty eclectic soundtrack is used properly, rather than as a substitute for the dialogue. I'm praying that it doesn't spawn a whole slew of pointless sequels and spin-offs; it's originality is an huge part of it's charm.", "created_at": "2022-03-28T20:11:35.074Z"}, {"movie_id": 118340, "review_id": "63e72fb212777800ab941d55", "author_rating": 9.0, "review_text": "**Guardians of the Galaxy embraced its underdog status in the MCU and catapulted its cast of misfits into stardom!**\r\n\r\nWho saw this movie coming? I know I didn’t. I only saw Guardians of the Galaxy because it’s a Marvel movie, but I knew nothing about the characters, and even some of the actors were still on the rise, but James Gunn and this movie turned them into mega-stars! This movie perfectly balances exceptional comedic performances with sincere heartfelt moments. This rag-tag group of outcasts finds family in each other while finding their way into our hearts. I expected a hilarious performance from Chris Pratt (but was surprised at how ripped he got for the role!) but was surprised by how funny Dave Bautista and Karen Gillan were proving themselves as sensational comedic actors. These unknown characters and lesser-known actors became household names due to great fun writing, entertaining performances, excellent effects, and a perfectly chosen director that knew how to bring it all together.", "created_at": "2023-02-11T06:03:30.638Z"}, {"movie_id": 118340, "review_id": "646cea2fc3514c2b07425848", "author_rating": 6.0, "review_text": "A good nerd flick for the geeks! At least this one has some humor. My daughter loves Groot.", "created_at": "2023-05-23T16:30:39.895Z"}]