[{"movie_id": 70160, "review_id": "4fce8bc519c29523e00000a4", "author_rating": 7.5, "review_text": "Very well made movie with quality writing, acting and cinematography. \r\n\r\n**Pros**: strong performance from the star. Technically excellent.\r\n\r\n**Cons**: Seems to me that the ending was premature but perhaps intentionally so - for a sequel? Character development is largely weak but there are a lot of characters and already a long movie so I suspect a lot was left on the cutting room floor.\r\n\r\nDespite some weakness, still a compelling movie worth a watch if not up to all of the hype.", "created_at": "2012-06-05T22:44:21.000Z"}, {"movie_id": 70160, "review_id": "5054e12e760ee33ef7001c17", "author_rating": 8.0, "review_text": "Stories about revolution can be quite good.  But stories about why a revolution is needed are invariably great.  The Hunger Games is such a story.\r\n\r\nThe movie (for the most part), closely follows the book, and does a good job of it.  It also sets up the next book/movie beautifully, even better than the book itself does.\r\n\r\nThe premise, of course, is borrowed from Ancient Rome, when gladiators and/or criminals an/or people whom the emperor wanted killed were forced to fight each other to the death in a public arena for the entertainment of the general populace.  And just as decadent as Rome was back then (only rescued from itself by the rise in prominence of The Christian sect), so the \"Capitol\" is now portrayed in the film/book---and the film portrayed the affluent decadence of the Capitol quite well.\r\n\r\nIn this particular instance the \"tributes\" were chosen at random from among children aged 12 through 18, and it was meant as retribution and reminder of the \"crimes\" the 12 colonies committed by reveling against the authority and rule of the Capitol 74 years ago.  At the public \"reaping\", when a boy and a girl were chosen to become the sacrificial tributes at teach of the 12 colonies, the Decree of Punishment was read and the colonies were reminded that this punishment was established to demonstrate how weak the colonies were in comparison with the Capitol, in that the Capitol could take the most prized possessions of the colonies (namely, their children), and the colonists themselves could do nothing about it.  And to really rub it in, the colonists themselves were forced to watch the tournament proceedings.\r\n\r\nI have to say, the punishment is deviously clever from the point of view of the Capitol.  It certainly keeps the Colonies divided in spirit (they were already segregated physically, with no communication between them allowed by the Capitol), for in cheering for their own children they are therefore cheering for the defeat---and therefore death---of the other colonies' children.  It also keeps colonists divided within each colony, for there can only be one champion, which means that in wishing their children not to be chosen at the reaping, each colonist is thereby wishing that someone else's children be chosen.  Furthermore, in celebrating that their children were not chosen, they are also, incidentally, celebrating that some other person's children will likely die.  And for the families of the chosen children, in supporting their own family member during the tournament, they are incidentally supporting the death of the other family's child.  And it keeps the population of the colonies low, which the Capitol would want to promote (less chance for another insurrection if the population is low): for the youngest are taken, before they are married, and those who survive the yearly reapings will think twice about having children of their own and having them go through this traumatic process year after year during their most vulnerable adolescent years.  And furthermore, the Capitol encourages the colonists' tacit endorsement by rewarding the winner's Colony with extra food that year (hence \"The 'Hunger' Games\").  But it is all manipulation, in the end.\r\n\r\nIn fact, by the end of the Games, right before being killed himself, one of the most avid killers among the children realizes just how much it all is the Capitol's manipulation, how pointless it all is to those who participate, and how, in the end, he didn't really have a chance---that he was destined to die from the beginning---and that killing or being killed is all that not only the Capitol, but also his Colony, want from him.  An eye-opening realization for someone who up to this point had been quite eager to kill his fellow children.\r\n\r\nGiven the vicious circumstances which were thrust upon these children---none of which is their fault---the question naturally arises: how should a child bound under the moral law behave?  Should he try to win, by killing the other children?  Should they try to win at all?  Should they let themselves be killed, in order that another might live?\r\n\r\nOf course, the obvious moral choice would be for none of the children to participate in this horrendous form of reality television: if they do not fight each other the show is not interesting, and eventually it is discontinued.  The children would likely still be executed, along with many of their own family members in reprisal from the Capitol.  If one thinks in terms of consequences only (utilitarianism), then this would be the wrong approach: after all, they would say \"it is better that one person survives than that they---and all their families---die\".  But such thinking is quite repugnant, however logical it is.  Consequentialism is missing a big piece of the moral landscape, namely that we ought not to become evil ourselves in our fight against evil.  Yes, the consequences of \"civil disobedience\" as could morally be practiced in this scenario are more dire in terms of the quantity of damage made.  But they are much more preferable in terms of the quality of damage made.  By fully participating in the carnage (and inflicting some yourself) you become complicit in the very evil which oppresses you.  Similarly, your family, and even your colonies (and all colonies, for that matter) become part of the system, and in some tacit way endorse it---for they all want their children to live, and tacitly support the other colonists' children's death.  Furthermore, what kind of person does one become after killing 23 children by brutal means at a very young age (when the impressions of life still shape us in a powerful manner)?  What kind of society does one help create when one has inwardly become a psychotic monster?  What kind of society abides criminal monsters in its midst?\r\n\r\nBut, some will claim, it is unrealistic to expect each and every child to be morally minded, especially when some children (from two different colonies which are highly favored by the Capitol) actually volunteered for the \"honor\" to represent their colonies at the tournament.  What is the correct moral response when civil disobedience is not an option (no opportunity) and some, if not most of the other children are out to kill you, whether by pleasure or need to survive?\r\n\r\nIt seems to me there are two possible moral responses.  one of them is the route of self-defense, whereby one does not intentionally kill or go out of one's way to engage the enemy, but tries to flee as a first alternative, BUT where one DOES defend oneself against the attacks of others, and inflicts only as much harm as is necessary to stop the aggressor, AND only if absolutely necessary one uses lethal force.  In the end, very likely, the Capitol would force matters to a resolution, either by forcing \"aggressors\" and \"defensors\" into a particular area (very good television), or by artificially creating natural/artificial disasters which killed whomever they disliked most.  But, again, this would be the Capitol's doing: an evil force acting evilly which one cannot stop.  One would have been preserved from sinking to doing/becoming evil.\r\n\r\nThe other moral route, the more perfect route, would be the route of Jesus: to willfully become the sacrificial lamb for the sake of spiritual (and therefore) moral change.  The martyrs of the Church have for ages followed this route, to the spiritual benefit of the whole Church, and the cultural benefit of all humanity.  The spiritual benefit is quite and readily seen through the Communion of Saints, whereby these martyr's love renews and creates the Church anew, greatly adding to the spiritual gifts of which the rest of us partake---gifts which slowly transform us for the better, over years and generations.  And it is this transformation which over the centuries affects culture.  Gradually better people live their lives out in gradually better communities.  And Love wins out at the end of time.  After all, very few societies nowadays would consider it acceptable to inflict the tortures which were inflicted to prisoners (especially Christians) in the ancient days of Rome: we are all repulsed by the Capitol's Decree of Punishment.  If we only partook more of those graces which Christ offers through His Church!\r\n\r\nOne particular odd feature of the book (and the film) is the avoidance of any mention of God or religion whatsoever.  Not even empty phrases deriving from religion appear (\"My Gosh\", \"God willing\", Christmas, Thanksgiving, etc.).  Why is that, especially when the subject matter so clearly lends itself to a religious treatment?  Why is that, when the least historically educated among us would have heard the stories of the Christians ushered into the Colosseum to be executed/sacrificed?  The closest religious reference is when Katniss Everdeen improvises a type of tribute around a fallen friend and ally in the game by creating a bed of flowers for her: the very earliest expressions of the religious impulse, as some Anthropologists would tell us.  Why has the author scrubbed her book from religion at all?  Is she so antagonistic to religion that she will not abide it in her book, even when it seems quite apt?  If so, the bed of flowers tell us that the most primitive of religious impulses remain with her still.  Or is the author trying to appeal to everyone, thus removing religion from the surface of her story so as to not alienate people of different religion than the one she chose to portray, while at the same time infusing her work with religious themes at the substrate level, where they are more powerful?  Or is her point that the despotic Capitol destroyed all hope quite successfully, even the Hope of God?  Given the richness of the religious themes I see in this book/movie below the surface, I am very much inclined to believe that the last of these options is the correct one.  But I may be seeing what I want to see, simply because I like the story.\r\n\r\nNow, turning to the more artistic features of the movie: The most impressive performance was done by the actor who played President Snow.  His facial expressions were insuperable and spoke tons in the few lines he delivered throughout the film.  His performance was astoundingly good, his face delivering contempt, skepticism, and hatred (sometimes all at once) along with the \"weight of office\" while speaking seemingly innocuous lines, or even while congratulating the winners (there were two winners from District 12, thanks to the cleverness of Katniss Everdeen in turning the television show against its organizers!) of the 74th Hunger Games.  He single-handedly set up the next movie installment.\r\n\r\nBut the casting of Peeta is all wrong.  From the book it is clear that Peeta is not handsome at all, that Peeta is the boring guy who never had a chance when it came to women, and who doesn't have a chance when it comes to Katniss Everdeen who clearly has feelings for another guy.  Which makes it all the more poignant that he is desperately in love with her, and is willing to give up his life for her.  In the movie he is played by a movie-star-handsome actor who clearly would have trouble keeping women away from him, and who would therefore be quite self-centered and clueless, rather than the thoughtful man he is in the book.", "created_at": "2012-09-15T20:12:30.000Z"}, {"movie_id": 70160, "review_id": "53fc2f600e0a267a7b009aba", "author_rating": 5.0, "review_text": "I had not really bothered to put this movie on my to-watch shelf since I felt it was not really my cup of tea but when my wife and oldest son wondered why we did not have it in our collection I thought, well, okay let us get it then. Actually I got the set with the two movies that have been released and yesterday we watched the first one.\r\n\r\nWell, as far as I am concerned, it is not a turkey, it is rather “okayish” but I certainly do not understand all the hype. It is really far from a great movie. But then, I am probably somewhat biased since, as I wrote above, I did not really think this movie was my cup of tea. Anyway, it starts of with a lot of scenes in “wobblycam”. I have not met any person outside of the movie industry and self-proclaimed so-called “critics” that actually likes it when the camera wobbles around, scenes are blurred and you generally get nauseous by watching. Bad start!\r\n\r\nThe backbone of the story is ludicrous to say the least. Part of the world leaves in luxury when the rest is starving. Been there, seen that. Every year a seemingly random selection of kids, not adults but kids, are selected to fight to the death under some silly pretext of “preserving the peace”. As I said, ludicrous. The entire air of ludicrousness is enforced by the wacky costumes, makeup and hair styles of the people in the capitol. As I science fiction and fantasy fan I could easily live with this but, sadly, the movie made me only mildly interested in following the characters to the end.\r\n\r\nThe acting in general is adequate but nothing special. Having said that it must be difficult to actually make anything out of some of the silly roles in this movie. I for sure would laugh my head off every time I entered a scene with all of those ludicrous (yes I know I have used that word a lot in this review, live with it) costumes. The main characters act like the children, with absolutely no clue what they are doing, that they indeed are. This is of course entirely in line with the story but still, the main character is spending a lot of the time running away and sitting around looking startled, sorry or depressed when the games start. I have to say that, at times, the movie felt a bit boring. I have liked several movies that are very slow but here it simply did not sit right.\r\n\r\nThe games themselves with those dickheads in control and the changing rules, well they were mostly frustrating.\r\n\r\nThis movie, to me, is a movie for a young adult audience. I have not read the books and I can see how this kind of story would work for a YA book. Personally I was not unhappy having seen the movie and now, having watched the first of the movies I will watch the rest as well but for me it was okay as a two-hour diversion, nothing more.", "created_at": "2014-08-26T06:55:28.350Z"}, {"movie_id": 70160, "review_id": "54d9b1e7c3a3687ac200128e", "author_rating": 5.0, "review_text": "I don't really know what's so special about this movie. I found \"The Running Man\" or \"Total Recall\" much more deep thought than this. Is it maybe that the main character is a female?\r\n\r\nStill, it is entertaining and, in this regard, it does its job.", "created_at": "2015-02-10T07:23:19.287Z"}, {"movie_id": 70160, "review_id": "58ac518f92514158df013cca", "author_rating": 8.0, "review_text": "The Hunger Games is a new concept in a long line of post-apocalyptic future fantasies. Where other stories of the same genre often deal with technology and artificial intelligence as the main threat to human existence, Hunger Games actually takes us back to Roman times, with a revitalised version of \"Panem et Circenses\" or \"Bread and Circuses\". Simply put; human devastation as mass entertainment. Welcome to Panem: formally known as The United States of America, where every year, a young man and woman from each of the twelve districts are selected to fight each other to the death, with only one possible survivor. These Games are broadcasted on national television as a means to keep the people happy and submissive.\r\n\r\nConsidering the fact that this film is based on a teen book series (written by Suzanne Collins), I can't help but feel this concept is pretty far out there, and actually it's kind of sick. It's not a pretty idea to think that one day we might live in a world where watching young people, ranging from 12 to 18 years old, brutally murder each other is considered to be a form of mass entertainment. Thankfully, this is 'just' a story, and I must say, a very entertaining one at that (no pun intended).\r\n\r\nThe story revolves around the two youngsters from District 12, where the people are dirt poor and life is utterly desolate. 16-year-old Katniss Everdeen volunteers as 'tribute' to fight in the Hunger Games, after her little sister is initially selected. Her male counterpart is Peeta Mellark, and together they set off to train for and participate in the Games.\r\n\r\nThe character of Katniss is played by Jennifer Lawrence, and she is terrific. Actually, she is my biggest recommendation for watching this film. Before this, I had only seen her in X-Men: First Class and thought she was pretty good, but after seeing The Hunger Games, it's not hard to see why this 21-year-old already has her first Oscar nomination under her belt. She has a very natural quality about her, which makes it very easy to make you empathise with her character. She's not a superficial, happy-go-lucky kind of girl; she's actually very sullen, not even particularly likable. And yet you just love her from the get go. I guess it's charisma, and Jennifer Lawrence definitely has it.\r\n\r\nActually, this film is full of great actors. One of the greatest is definitely Stanley Tucci, who plays his most flamboyant role yet. His character (Caesar Flickerman, the TV-host who emcees the Games) is ridiculously over-the-top, but brilliantly amusing. With blue hair, prosthetic teeth and a big horse's smile which he flashes incessantly, he looks like a PG-13 version of the Joker. And if you're at all familiar with Tucci's work and talent, you know just what I mean when I say he's making this character appear to be oh-so nice, yet subtly sadistic at the same time. He's just great, period. Woody Harrelson also has a pretty interesting role as Haymitch Abernathy, a once-winner of the Hunger Games, who now mentors Katniss and Peeta in their training. He's scruffy and gnarly, basically just typically another weird Woody character, which is always worth the watch. Wes Bentley plays Seneca Crane, a character most notable for his unusual facial hair: he sports a beard Lucifer himself would be proud of. However, the biggest surprise to me was Elizabeth Banks, whom I am well familiar with, but never really cared for because I only know her from superficial, comedic roles. I was pleasantly surprised to see that she can also play challenging roles like this one. She plays Effie Trinket, a bizarre, neo-Renaissance type from the richest District, big wig, crazy make-up and all. She's pretty much the female version of Tucci's character and she was a delight to watch, beautifully grotesque in all her decadence.\r\n\r\nUnfortunately, it can't all be great. I had three major problems with this film. One: if you haven't read the book, there's a lot that doesn't make sense. They really should have spent a little more time explaining everything, because more than once it simply wasn't clear to me what was going on and why. And that's a risk no filmmaker should take. Two: Peeta's character. It could be just me of course, but he annoyed the crap out of me. He just comes across as such a sissy that it's frustrating to watch. Katniss burns her leg and deals with it. Peeta cuts his leg and stays lying in a cave because he \"can't walk\". And then he lets her take care of him, at the risk of her own life. Give me a break. Three: totally disappointing climax. I was waiting for fireworks, for Katniss having to make brutal decisions, but this never happened. It just kind of faded out.\r\n\r\nAnd this is how you can clearly tell this story has a mainly teenage demographic, and they obviously wanted to keep it PG-13. Because despite the sometimes pretty brutal violence, nasty use of weaponry and tomato ketchup-a-plenty, overall the whole just lacked, well (pardon my French)...balls. You can tell they tried to spike things up a bit here and there, but the film failed to make things truly interesting at moments where it definitely should have been. In my opinion, had they decided to make this rated-R, it would have been infinitely better.\r\n\r\nHaving said that, you can rest assured there is still plenty to enjoy. Visually it is absolutely awesome and simply beautiful. The costumes and make-up are great, as are the CGI effects. The characters (aside from Peeta...) are great, and the whole futuristic 'universe' that is created is pretty inventive.\r\n\r\nThere is actually still a lot more I would like to say, but I've reached my word-limit, so I'll just leave you with this: Thumbs up!\r\n_(April 2012)_", "created_at": "2017-02-21T14:41:19.774Z"}, {"movie_id": 70160, "review_id": "5a04d50c9251413fd60020cd", "author_rating": null, "review_text": "A powerful movie that crosses several genres.  From various post-apocalyptic movies we are shown the world after a worldwide disaster that has destroyed our civilization and left a more brutal one.  From Spartacus the idea of gladiator games, with the added horror that these \"fighters\"  are children who are presumably too naive to put up any resistance to the regime.   From 1984 we have futuristic technology which can monitor anything the victims do, giving them no privacy in their last moments.\r\n\r\nBut the originality is in the heroine --  a tomboy determined to stay alive without losing her integrity.   How can she keep herself and her friends alive in a fight when only one victim will be allowed to leave the arena intact, and an entire decadent empire is arrayed against her?  This part was given to Jennifer Lawrence, who impressed audiences so well that she inspired numerous later action heroines --  Tris in DIVERGENT, Wonder Woman, Arya Stark, and others", "created_at": "2017-11-09T22:22:04.636Z"}, {"movie_id": 70160, "review_id": "6267abb819675700ab9e334d", "author_rating": 6.0, "review_text": "Evil \"President Snow\" (Donald Sutherland) has his own unique way of keeping order amongst his provinces. Once a year he draws a lottery of 12-18 year old boys and girls who must fight to the death for the entertainment of the viewing public on television. He doesn't reckon on the calibre of those in District 12, though - the resourceful \"Katniss\" (Jennifer Lawrence) and her pretty, but weedy, pal \"Peeta\" (James Caan's childlike stunt-double - Josh Hutcherson). Easily the highlights here are the contributions of television host \"Flickerman\" (an hugely over the top Stanley Tucci) and the equally flamboyant \"Effie\" (Elizabeth Banks) who both turn this murderous adventure into an \"X-Factor\" with bows and arrows, deadly wasps, landmines and plenty of life-saving sponsorship opportunities. Thought the story is not without jeopardy, the acting is by and large terrible. Lawrence and Hutcherson have not a jot of chemistry between them; Liam Hemsworth features all too sparingly and, well, there is just no passion! All these hormonal teenagers marauding around the forest, but where is the sex? They are all handsome and yet it's got \"Rated 12\" all over it. There is no grit, there is no spice nor sense of peril. You just know what's going to happen at the end. As a concept, though, it's eminently suitable - perhaps we could substitute this format for election hustings? Think of the benefits to mankind! Otherwise, it's a long old watch.", "created_at": "2022-04-26T08:22:16.485Z"}]