[{"movie_id": 104755, "review_id": "5207b030760ee3630522401d", "author_rating": null, "review_text": "The Lords of Salem is the latest film by industrial rocker-turned-auteur Rob Zombie, and I think it's a good'un, although it's already polarizing people.\r\n\r\nSheri Moon Zombie (Rob's wife who features heavily in all of his movies, though this is her first star turn) is Heidi, a recovering addict and local rock DJ in Salem, Massachusetts, site of the infamous witch trials of 1692. She receives a vinyl record in a wooden box from a band apparently called The Lords, who later on also inform the station that they are performing a one-off gig in the town. Upon playing the record at home however, Heidi experiences migraines and hallucinations of a 17th century coven, performing some manner of birthing ritual, apparently attempting to bring Satan himself to mortal life. Her male DJ colleagues simply experience the tune as a weird, rather turgid dirge (although it'll stick with you like a demonic earworm) and play it over the air on their rock show, where it acts as a sort of trance-inducing spell on many of the women listening. From there on in, Heidi's mental state begins to deteriorate and the migraines/hallucinations increase, not helped by her return to drugs or by her peculiar landlady and her two friends, all of whom seem creepily interested in Heidi and what her \"fate\" might be. Her \"fate\" as it turns out is attending this Lords gig, except that in many ways, it's really HER gig. And what's happening with that supposedly vacant room at the end of the hall? I'll go no further, partly because to do so would be to give too much away, but mostly because to try to explain it would be futile. You need to see it.\r\n\r\nThe Lords of Salem is, for much of its runtime, Rob Zombie's most restrained feature film. It can move pretty slowly most of the way through, although thanks to Mrs. Zombie's best on-screen work to date and some great supporting performances throughout, particularly from Dee Wallace, Judy Geeson and Bruce Davison, those slow moments are largely spent getting to know and like our protagonists (or of course, become ever more unnerved by our antagonists). However, it's the sections where The Lords of Salem lets rip - including a finale that takes an absolute swan-dive off of the cliffs of tangible reality into the seas of utter lunacy - that are dividing opinion. Rather than a balls-to-the-floor gore flick, what we have here is a retro-heavy European art-horror piece, akin to any of Dario Argento's more hallucinatory efforts. The imagery is incredibly striking and bold, and very much as you'd expect from Mr. Zombie, if you're aware of his previous work (House of 1000 Corpses, The Devil's Rejects - neither of which I thought were particularly good, although I may revisit Rejects at some point soon - the 2007 remake of Halloween and its 2009 sequel - both of which I really enjoyed), but because of that retro restraint that same imagery also rides a very fine line between bold and laughable depending I guess on whether you're able to buy into those arthouse horror stylings or you're not, and find yourself pulled out of the movie. The low budget (I've seen figures between $1.5m and $2.5m punted about) isn't an issue until some of the more ambitious special effects present themselves, but if you're not \"feeling it\" at that point, you're not going to. Personally, I like a film that has some scenes that aren't necessarily explained away by a perfunctory, realistic narrative, I like a film - especially a horror - to adopt a retro vibe from time to time, as long as they're done well (which this is), and I love a bit of witchcraftery and devilishness. The Lords of Salem reminded me in many of ways of Ti West's excellent slow-burn retro creeper The House of the Devil, but with added... well, with added Rob Zombieness, I suppose!\r\n\r\nRecommended, although many will find it objectionably bad.", "created_at": "2013-08-11T15:39:28.825Z"}, {"movie_id": 104755, "review_id": "5b21e5380e0a264d8a01477f", "author_rating": 7.0, "review_text": "Witchcraft/Satanism in modern Salem by Rob Zombie\r\n\r\nRELEASED IN 2012 and written/directed by Rob Zombie, \"The Lords of Salem\" is a witchcraft/horror flick starring Sheri Moon Zombie as a DJ in Salem, Massachusetts, who is sent a wooden box containing a mysterious record dubbed \"gift from the Lords.” The creepy music thereof triggers flashbacks of her town's infamous past. Is Heidi going crazy or are the witches taking revenge on Salem?\r\n\r\nThe ambiance, mood, directing, music, locations, sets and cast are all top notch, showing that Zombie has developed into a quality director since his first shot eleven years earlier with “House of 1000 Corpses,” which was shot in 2000. This is serious haunting horror as opposed to the campy black comedy of “1000 Corpses” (not that there’s anything wrong with that, lol). The movie mixes elements from \"The City of the Dead,” aka \"Horror Hotel\" (1960), “Suspiria” (1977), “Rosemary’s Baby” (1968), “The Wicker Man” (1973) and “To the Devil a Daughter” (1976). If you like any of these movies, “The Lords of Salem” is as good or better.\r\n\r\nUsually when you see old hag witches in movies it’s kinda eye-rolling; not so here. Rob gives us the real deal and it’s not pretty, although I admit to busting out laughing every time the witches hailed Satan. Speaking of which, modern Wiccans won’t like how the films mixes Witchcraft with Satanism (the truth hurts). Interestingly, there’s almost as much Christian imagery as there is Satanic.\r\n\r\nOne thing’s for sure, Zombie doesn’t paint witchcraft/Satanism in a positive light. It’s similar to “The Witch” (2015) in this respect, where converting to witch-dom meant becoming a baby-slaughtering, blood-bathing, family-destroying, goat-sucking, friggin’ pedophile hag with the illusion of youth. When the Devil eventually appears in “Lords,” it’s anything but a positive image.\r\n\r\nThe story seems to perpetuate the myth that those condemned at the Salem Witch Trials in 1692-1693 were burned to death. Actually, 19 people were hung, another slowly crushed to death, and over 150 imprisoned.\r\n\r\nSheri makes for a strong protagonist, but she’s the extant of any eye candy on the female front. As noted earlier, the witches are all hideous hags and look even uglier with their clothes off. Meg Foster surprisingly appears as the lead witch. Meanwhile, Judy Geeson, Patricia Quinn and Dee Wallace are on hand as a dubious trio in modern Salem. Speaking of whom, they have a great (hilarious) tea scene with Bruce Davison, who plays an expert on witchcraft.\r\n\r\nTHE FILM RUNS 1 hour, 41 minutes and was shot in Salem, Massachusetts; Sable Ranch, Santa Clarita, California (witches dancing around fire); and the Los Angeles Theatre (opera house).\r\n\r\nGRADE: B", "created_at": "2018-06-14T03:47:04.709Z"}]