[{"movie_id": 138843, "review_id": "539f8d2e0e0a2650810003e5", "author_rating": 9.0, "review_text": " It's November 1st, 1971, I'm sitting here with Carolyn Perron, who with her family, has been experiencing supernatural occurrences.\r\n\r\nThe key with The Conjuring is not that it has freshness on its side, as evidenced by the ream of horror fans arguing on internet sites about \"nothing new on the table\" , but while those fans will be going hungry for a very, very long time, The Conjuring does everything right for the splinter of horror it deals with.\r\n\r\nThere's a lot to admire about a horror film that in this day and age stands tall and proud against the ream of remakes, sequels and teen friendly slashers that \"haunt\" the multiplexes with all too much frequency these days. Free of gore and sex, this was automatically going to alienate a good portion of the lustful members of the horror fan base, but for those who like their horror served with appetising scares and a cauldron of suspense, then this delivers plenty to your particular table.\r\n\r\nForget the \"based on a true story\" tag, since it's kind of irrelevant in this new technological age, it's a selling gimmick that actually means \"this story might be true and we might have played with it a bit\". Regardless of hoax charges and embellishments, just buy into the premise, commit to it as a scary story in the same way as director James Wan has, for then the rewards are there for the compliant.\r\n\r\nStory essentially is based around an investigation in the early seventies by paranormal specialists Ed and Lorraine Warren, who aided the Perron family as they were victims of dreadful supernatural events at their Rhode Island home. Wan builds it deftly, letting us into the Perron families lives as they move into what they believe to be a dream home. Then things start to happen, but again Wan builds it in slow instances, creating a palpable sense of dread, his camera work intelligent. So when the big moments come they have maximum impact and have us also yearning for the Warren's to get involved.\r\n\r\nThere is no over killing of the boo-jump scares, they are placed with care and marry up superbly with the mounting tension. Naturally all the cliché conventions of the haunted house movie are here, strange smells, creaky doors, ominous cellar and etc, yet these are supplemented with Wan's talented knack for a good scare and a very effective production design. From mysterious bruises and literal leg pulls – breath holding games of hide and seek – to bona fide pant soiling moments, The Conjuring is a lesson in sustained unease until the big finale is unleashed.\r\n\r\nThe script is devoid of cheese and pointless filler, itself refreshing in a horror sub-genre that suffers often with these problems. Joseph Bishara's musical score is an absolute nerve shredder, and again it's a refreshing accompaniment because it doesn't resort to telegraphed shrieks to tell us to be afraid, it never overwhelms a scene. John Leonetti's cinematography has Gothic textures, both in the house and outside of the lakeside farmhouse, while the strong lead cast of Vera Farmiga, Patrick Wilson, Lili Taylor and Ron Livingston come up trumps for sure.\r\n\r\nMet with critical and box office success, The Conjuring justifies its reputation as a superb haunted house movie. 9/10\r\n", "created_at": "2014-06-17T00:34:54.270Z"}, {"movie_id": 138843, "review_id": "539fdb9dc3a36850d9000ef5", "author_rating": 7.0, "review_text": "The Conjuring is a fairly classical horror/haunted house/exorcism movie. That was pretty much what I was hoping for. Slow and creepy build up to a final outburst and confrontation with an evil entity. This is a good movie although it is not really something new in terms of story. It is fairly impossible not to think about, and make comparisons with, The Amityville Horror when seeing this movie. I do not think it really deserves the glowing 9 or 10 star ratings that I have seen but it certainly do not merit those 1 or 2 star ones either. What were these people expecting?\r\n\r\nThis is a solid effort of making a movie along the classical lines of supernatural possession. As I wrote, it is not really something new, but it is nice to see a new movie using this kind of story without just turning it into a CGI gore-feast. Sure, the movie also includes the traditional pitfalls that most horror movies apparently must have like people thinking it is a good idea to walk down into the dark and scary basement all alone in the middle of the night.\r\n\r\nOne thing that irked me with the movie though was the idea of phantoms and performing exorcism being presented as kind of normal and accepted things. Of the movie would have played itself out 70 or so years earlier maybe but in the 1970′s? It just felt somewhat surreal to see this “ghosthunter” make presentations and talk to people like supernatural entities and the practice of exorcism was just things that happened.\r\n\r\nThe we have the ending of course. Not that it was overly bad but christ, if you are going to do an exorcism then do it damn it. Do not stop the procedure and look lost every time something goes bump.\r\n\r\nAnyway, I was not sure whether I was going to be disappointed or pleased when sitting down to watch this movie. On the whole I was pleased. It was a nice to watch a movie that was going back to the traditional values in horror movie making and it was as well implemented as one could expect.", "created_at": "2014-06-17T06:09:33.754Z"}, {"movie_id": 138843, "review_id": "5a1cc6aec3a3680b9a062cc0", "author_rating": 5.0, "review_text": "I'm a fan of Wan, and while I must say I believe that _The Conjuring_ is pretty severely overrated, it's also one of the best horror films to have hit the mainstream in the past few years.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-11-28T02:15:10.638Z"}, {"movie_id": 138843, "review_id": "60bc5dafeb64f100574989f2", "author_rating": 8.0, "review_text": "Hadn't seen this in a while and watching it again in preparation for the third movie, found it to be well done. I'm not much for these supernatural horror movies but with James Wan's camera work, and the screen presence from Patrick Wilson and Vera Farmiga, makes it an entertaining flick. **3.75/5**", "created_at": "2021-06-06T05:31:27.256Z"}, {"movie_id": 138843, "review_id": "6319fee1002134007ae8b9da", "author_rating": 7.0, "review_text": "\"Ed Warren\" (Patrick Wilson) and his wife \"Lorraine\" (Vera Farmiga) are renowned paranormal investigators drafted in by the at-their-wits-end \"Perron\" family to their remote Rhode Island farmhouse that they are convinced is possessed. It doesn't take them long to realise that this whole area has been the scene of Satanic worship since time immemorial, and those lingering spirits have got it in for the new occupants of the house - and their five increasingly hysterical daughters. James Wan really does develop this story with an effective degree of menace and Ron Livingston and Lili Taylor work well together as the parents scared out of their pants by the goings-on in their dream home that is turning into a nightmare that perhaps even an exorcism won't resolve. Joseph Bishara presents us with an eerily effective musical accompaniment to this story and the acrobatic and prosthetic visual effects all contribute effectively to create a real sense of malevolence that, unusually for many in this genre - it has a degree of plausibility too. Big screen experience is better especially in a busy cinema, and well worth a watch.", "created_at": "2022-09-08T14:40:33.824Z"}]