[{"movie_id": 376865, "review_id": "5cc8d8259251412ba10075a9", "author_rating": 9.0, "review_text": "A dazzling sci-fi epic that holds nothing back in its entirety. Claire denis' vision is an unrelenting masterwork packed to the brim with nerve-shredding fear and and a pulse-punding gravitational pull that sucks in the viewer and never lets go until the very end.\r\n\r\nI found this film more of a meditation on what makes humanity's backbone so spontaneous; there are many plot points and elements that seem justified by the notion that humans are unpredictable creatures and as we evolve, we'll continue to be more and more focused on following through with our own morals. There's lots of brutality on display on this film and it all feels very contained until one moment near the film's middle that's very quiet and equally contained but that sends the entirety of the cast into chaos. It's almost a testament to the question of whether authority figures actually *do* something for prisoners or instead just make their rage build up further and further until it explodes harder than a dick in the Fuckbox.\r\n\r\nI think the best way its themes can be described is by a quote from the film itself: \"The sensation, moving backwards, even though we're moving forwards, getting further from what's getting nearer.\". The way it presents human evolution as moving forward literally but moving backward metaphorically is more than just smart: it's genius. But the film also tackles issues pertaining to erotic pleasure and abuse of that pleasure; the entire Fuckbox scene is just a nightmare on all levels and it made me want to just die from the shivers it sent down my spine.\r\n\r\nI highly recommend supporting this film it's playing near you, very few people will end up getting to experience it in theaters (i sure didn't) so please don't ensure that another beautiful masterpiece gets slept on!", "created_at": "2019-04-30T23:20:05.831Z"}, {"movie_id": 376865, "review_id": "5d742552127778562427a735", "author_rating": 1.0, "review_text": "This is the worst and most disgusting film I've ever seen. The plotline is horrible and the scope has no sense. I can't believe the cast agreeded to make the film.", "created_at": "2019-09-07T21:46:58.496Z"}, {"movie_id": 376865, "review_id": "5d76c9b412970c00129c26e2", "author_rating": 7.0, "review_text": "**_Esoteric and poetic, but very singular; certainly not for everyone_**\r\n\r\n> _Imagine a star with a mass 10 times that of the sun. During most of its lifetime of about a billion years, the star will generate heat at its centre by converting hydrogen into helium. The energy released will create sufficient pressure to support the star against its own gravity, giving rise to an object with a radius about five times the radius of the sun. The escape velocity from the surface of such a star would be about 1,000 kilometres per second. That is to say, an object fired vertically upward from the surfa__ce of the star with a velocity of less than 1,000 kilometres per second would be dragged back by the gravitational field of the star and would return to the surface, whereas an object with a velocity greater than that would escape to infinity._\r\n\r\n> _When the star had exhausted its nuclear fuel, there would be nothing to maintain the outward pressure, and the star would begin to collapse because of its own gravity. As the star shrank, the gravitational field at the surface would become stronger and the escape velocity would increase. By the time the radius had got down to 10 kilometres, the escape velocity would have increased to 100,000 kilometres per second, the velocity of light. After that time any light emitted from the star would not be able to escape to infinity but would be dragged back by the gravitational field. According to the special theory of relativity, nothing can travel faster than light, so that if light cannot escape, nothing else can either. The result would be a black hole: a region of space-time from which it is not possible to escape._\r\n\r\n- Stephen Hawking; \"The Quantum Mechanics of Black Holes\"; _Scientific American_, 236:1 (January 1977), 34-40\r\n\r\n> _The thing's hollow - it goes on forever - and - oh my God! - it's full of stars!_\r\n\r\n- Arthur C. Clarke; _2001: A Space Odyssey_ (1968)\r\n\r\n>_If information were lost in black holes, we wouldn't be able to predict the future, because a black hole could emit any collection of particles. It could emit a working television set, or a leather-bound volume of the complete works of Shakespeare, though the chance of such exotic emissions is very low. It is much more likely to be thermal Radiation, like the glow from red hot metal. It might seem that it wouldn't matter very much if we couldn't predict what comes out of black holes. There aren't any black holes near us. But it is a matter of principle. If determinism breaks down with black holes, it could break down in other situations. There could be virtual black holes that appear as fluctuations out of the vacuum, absorb one set of particles, emit another, and disappear into the vacuum again. Even worse, if determinism breaks down, we can't be sure of our past history either. The history books and our memories could just be illusions. It is the past that tells us who we are. Without it, we lose our identity._\r\n\r\n>_It was therefore very important to determine whether information really was lost in black holes, or whether in principle, it could be recovered. Many people felt that information should not be lost, but no one could suggest a mechanism by which it could be preserved. The arguments went on for years. Finally, I found what I think is the answer. It depends on the idea of Richard Feynman, that there isn't a single history, but many different possible histories, each with their own probability. In this case, there are two kinds of history. In one, there is a black hole, into which particles can fall, but in the other kind, there is no black hole. The point is, that from the outside, one can't be certain whether there is a black hole, or not. So there is always a chance that there isn't a black hole. This possibility is enough to preserve the information, but the information is not returned in a very useful form. It is like burning an encyclopaedia. Information is not lost if you keep all the smoke and ashes, but it is difficult to read._\r\n\r\n>_What does this tell us about whether it is possible to fall in a black hole, and come out in another universe? The existence of alternative histories with black holes suggests this might be possible. The hole would need to be large, and if it was rotating, it might have a passage to another universe. But you couldn't come back to our universe._\r\n\r\n- Stephen Hawking; \"Black holes ain't as black as they are painted\"; BBC Reith Lecture (February 2, 2016)\r\n\r\nA science fiction thriller from Claire Denis? The uncompromising darling of French art house cinema, adored by critics and met with general puzzlement by audiences? And it's in English? And it stars the guy from _Twilight_? You have to be making this up.\r\n\r\nNot at all. However, as intriguing as that may sound, it's a deceptive overview. Yes, it is Denis's first English-language film, and yes, it is set in space, but it's a science fiction film in name only, in much the same way as _Trouble Every Day_ (2001) is a horror film in name only, and it has more in common with Stanley Kubrick's _2001: A Space Odyssey_ (1968) and Andrei Tarkovsky's _Solyaris_ (1972) than with anything in the _Star Trek_ or _Star Wars_ franchises. And just for the record, the guy from _Twilight_ has developed one of the most eclectic recent CVs of any actor in Hollywood. The long and short of it is that Denis has not sold out, and _High Life_ is as multiplex-friendly as anything in her _oeuvre_ (which is to say, not in the slightest). And although she's ostensibly working within genre parameters, the film covers many of her more familiar themes - the darker aspects of desire; the notion of being an outcast; parenthood; the inescapability of death; the beauty of the human body; the relationship between violence and sexuality. The presence of Robert Pattinson will probably draw in a lot of unsuspecting folks, who will have no idea what to make of Denis's slowly paced existential musings, resulting in a slew of asinine \"_worst film ever_\" reviews. But although it's not Denis's best (that remains either _Beau travail_ or _Les salauds_), it's a fascinatingly poetic and original film that is utterly uncategorisable - a space thriller about a mission collapsing in on itself; an angry ecological allegory positing that we don't have a huge amount of time left to save the planet; a study of what it is that defines our humanity; an analysis of the psychological ramifications of long-term incarceration; an erotic skin flick obsessed with bodily fluids; a metaphor for the perils of imperialism; a fable on the subject of paternity; a story about loneliness and grief; a look at the inherent contradiction in the fact that humanity is constantly reaching for the infinite whilst tied to an irreversibly decaying body; a literalisation of the premise that no amount of evolution, philosophy, or esotericism can ever change the fact that we're biological organisms controlled by our sexual yearnings and impulse to procreate - desire will always trump the social contract; we can place as much artificial limitation on our carnality as we want, but ultimately, desire will betray us.\r\n\r\nLike I say, very multiplex-friendly.\r\n\r\nDeep space. On an unnamed ship marked only with the number #7, Monte (Pattinson) lives alone with his baby daughter Willow (Scarlett Lindsey). However, this wasn't always the case, and as the film begins, Monte is releasing the bodies of his deceased crewmates into the void of space. How this situation came to pass is revealed via an achronological flashback narrative structure. At an unspecified point in the future, scientists came to pin their hopes for a sustainable energy source on the \"Penrose Process\" - a theory developed by Sir Roger Penrose whereby energy could be extracted from the area close to a black hole. Manning their ships with death row inmates to whom they have guaranteed pardons, the scientists neglect to inform the crew that they won't be returning to Earth. On Ship #7 are four men - Monte, Tcherny (André Benjamin), Chandra (Lars Eidinger), and Ettore (Ewan Mitchell) - and four women - Boyse (Mia Goth), Nansen (Agata Buzek), Mink (Claire Tran), and Elektra (Gloria Obianyo). Whilst Chandra is the designated captain, the _de facto_ leader is Dr. Dibs (an ethereal Juliette Binoche oozing uninhibited sexuality from every pore), a criminal herself, who is using the journey to conduct biological experiments on the crew - each day the men give her sperm samples in return for sleeping pills, and she attempts to artificially inseminate the females. Monte, however, refuses to comply, arguing that his chastity gives him strength. His obstinacy, of course, fascinates Dibs, who determines to get a sample from him by any means necessary. Meanwhile, all sexual activity between the crew is prohibited, although they are free to use \"The Box\", a room designed to facilitate masturbation, which all but Monte visit on a daily basis. However, as time passes, the isolation, the dawning realisation that it's a suicide mission, the increasingly invasive activities of Dibs, their past criminal predilections, and their unquenchable libidos start to take over some of the crew, with deadly consequences.\r\n\r\n_High Life_ was written in French by Denis and her regular writing partner Jean-Pol Fargeau in 2013, and translated into English by Geoff Cox. An early iteration of the script was written by Northern Irish novelist and poet Nick Laird (who is credited as \"Script consultant\") and his wife, the English novelist and essayist Zadie Smith (who is uncredited). Originally, Denis planned to cast Philip Seymour Hoffman as Monte and Patricia Arquette as Dibs, but she was unable to secure funding at the time. Prior to shooting in 2016, she, the film's cinematographer Yorick Le Saux, production designer François-Renaud Labarthe, visual consultant Ólafur Eliasson (who designed the film's unusual \"shoebox-shaped\" space-craft), and actors Pattinson and Binoche visited the European Space Agency Astronaut Centre in Cologne to look at the practicalities of deep space travel. Additionally, physicist and black-hole expert Aurélien Barrau worked on the picture as scientific consultant.\r\n\r\n_High Life_ opens, very unexpectedly, with pseudo-Edenic shots of lush vegetation, before slowly revealing we're seeing a garden on a spaceship, surrounded by and subservient to technology. We then hear a baby crying on the intercom. This opening, mixing vegetation, technology, and biology signals both the film's tone and demonstrates the economy of Denis's visual language, telling us much of what we need to know about the upcoming film. In the film's press notes, Denis states,\r\n\r\n> _I was dead set on having that garden. How can you keep up the hope of return if Earth isn't part of the voyage? That earth is their Earth, the only thing that reminds them that they are earthlings, men and women of the Earth._\r\n\r\nDenis and Le Saux employ similarly precise storytelling tools in shooting everything on the spaceship on HD video, whereas the few scenes on Earth are shot on 16mm - this gives the space scenes a sleek polished sheen, whilst the Earth material looks grainy and gritty, more lived-in, setting up an instant visual contrast to mirror the thematic one. I'd also be remiss whilst discussing the film's aesthetics, if I didn't mention what will probably be the film's most famous scene - a very energetic visit by Dibs to The Box, with Binoche committing herself entirely to Dibs's masturbatory excess, as she makes full use of the ceiling-mounted stirrups and the metal dildo in the middle of the room. The scene is beautifully shot, bathed in a gloriously blue light that softens everything it touches, whilst Le Saux shoots Dibs entirely from behind, focusing on the contraction and expanding of the muscles in her back, as if a figure from a Sandro Botticelli painting has wandered into a room designed by H.R. Giger. Furthermore, the scene is edited by Guy Lecorne with the use of fades rather than hard cuts, giving a sense of contemplative peace which contrasts nicely with the energies of the character. And never has the human back looked so sensual and magnificent!\r\n\r\nThematically, rather unexpectedly, the film actually has a lot in common with Paul Schrader's _First Reformed_ (2017); both films deal with the looming end of existence; both examine the possibility of finding hope amidst the oncoming cataclysm; both see the human race as essentially not worth saving; both focus on a very spiritual character facing a crisis of faith - in _First Reformed_ that crisis concerns Fr. Toller's Catholicism, whereas in _High Life_ it's Monte's belief in the importance of self-discipline and chastity. Indeed, Denis shapes the narrative in such a way that, for the audience, the experience of life on #7 is not that different from the experience of life on Earth in the early 21st century - people hurtling towards oblivion, yet trying to maintain a semblance of humanity, even as they fail to understand the gravity of what they're facing. In this sense, the film could be argued to be about finding the strength to face extinction, or, in a less optimistic reading, it could be about the pointlessness of searching for the strength to face extinction, because such strength is of absolutely no value.\r\n\r\nOf course, on a more prosaic level, the film is obsessed with bodily functions and sexuality, with Monte adopting a very conservative ideology by refusing to give Dibs his sperm and electing not to use The Box. Fluids are a recurring motif throughout, whether the blood that several characters shed, the sperm with which Dibs is obsessed, the oil that keeps the ship's systems running, the water that nourishes the garden and that keeps the crew alive, and copious unidentified liquids (I've no idea what it is that comes pouring out of The Box at one point). Speaking of fluid, perhaps the film's most haunting image is a shot of one character lactating; her body producing nourishment for a baby she can't feed, as Dibs has taken it from her, the milk running down her body going to waste. Interestingly enough, at the film's world premiere in Toronto, this scene sparked a considerable number of walkouts, almost every single one of which was male. Make of that what you will.\r\n\r\nThe subject of fluids is introduced from the onset. One of the first things we hear Monte saying is telling Willow that even if it is recycled, one should never eat one's own faeces or drink one's own urine, as such behaviour is \"taboo\". If we accept that the ship's garden is Eden, then Monte and Willow are our Adam and Eve. Of course, as we all know, what comes next in Genesis is temptation and desire, and things don't end too well for our ancestors. Thus Monte's emphasis on taboo in this opening scene becomes ironic given that later in the film, he will come face to face with an even more controversial taboo.\r\n\r\nIn terms of problems, obviously, the film will be far too abstruse for some. When Ridley Scott was hired to direct _Blade Runner_, he famously stated that he didn't want to make \"_an esoteric film_\". And then went on to make one of the most esoteric studio movies of all time. Denis obviously wholly intended for _High Life_ to be esoteric, and she is unconcerned with CGI spectacle or any of the tropes we've seen rehashed a million times in sci-fi movies. For some, however, the film will cross the line from esotericism to impenetrability. Of course, science fiction can and very often does deal with huge thematic and socio-political themes whilst maintaining its identity as popular entertainment; films as varied as Douglas Trumbull's _Silent Runner_ (1972), Danny Boyle's _Sunshine_ (2007), and Christopher Nolan's _Interstellar_ (2014) are big-budget special-effects-heavy genre blockbusters that ask all manner of existential questions, and do far more than give us empty billion-dollar spectacles more concerned with selling toys than saying something of note. Denis, however, is more reluctant to give up the secrets of her picture. And for those more used to films that openly reveal themselves without the audience having to put in much effort, _High Life_ will prove too abstract.\r\n\r\nIn this sense, Denis's litany of themes does come across as a little haphazard, as she jumps around fairly randomly from ecological issues to sexual proclivities to what makes us human to extinction to loneliness. This results in something of a thematic pile-up, which, by definition, can feel like a bit of a dead-end. I don't agree with people who say the film \"had no point\", but I can certainly see from where such criticism could arise, as Denis leaves several ideas relatively and frustratingly incomplete. Another issue is that the journey of #7 is never presented in any way urgently, meaning there's rarely tension, as life on ship moves along at its own lethargic pace. This might make for existential pondering, but it doesn't make for especially engaging drama. And I have to admit, at times my attention began to wander, with the pace becoming more of an endurance test than anything else.\r\n\r\nNevertheless, _High Life_ is a fascinating film, equal parts poetic and prosaic; reaching for infinity, but never lifting its feet from the soil. Looking at everything from paternity to incarceration to apocalypse to canines turning to cannibalism (don't ask), it fits right into her _oeuvre_, belying the mainstream impression given by the marketing. Although it recalls the clinical detachment of _2001_ and the psychological intensity of _Solyaris_, _High Life_ is very much its own animal. Asking highly relevant questions about humanity and our inability to recognise the oncoming extinction, the film offers a savage and somewhat pessimistic corrective to the idealism of films such as _Interstellar_ and Ridley Scott's _The Martian_ (2015). Positing that mankind is a monster driven by its desires isn't going to earn Denis legions of new fans, but for those of us who were already on board, there's much to be relished here.", "created_at": "2019-09-09T21:52:52.922Z"}, {"movie_id": 376865, "review_id": "62405ce4c50ad200883b368a", "author_rating": 4.0, "review_text": "This is a really disappointing effort from all concerned. It is unnecessarily abstruse and manages, quite successfully, to suck any joy from the project more efficiently than any black hole could ever do - it's just devoid of any emotion at all. Sorry, this is just duff!", "created_at": "2022-03-27T12:47:32.305Z"}]