[{"movie_id": 174751, "review_id": "57c5e6d1c3a3683f8b001021", "author_rating": 2.0, "review_text": "Jane has got a gun. Great then maybe she can use it to put those of us that took the time to watch this movie out of our misery. Not a good western at all as Portman is poorly cast as Jane. Boring and slow which are bad things when watching a western. Because when done right they can be a very exciting movie expierience.", "created_at": "2016-08-30T20:04:33.665Z"}, {"movie_id": 174751, "review_id": "57cd0d6692514151ee003523", "author_rating": 4.0, "review_text": "The Western genre is one that has struggled to find its own two feet to stand on in recent years. _Jane Got a Gun_ certainly does not buck that trend. Also I'm pretty sure not a single one of these Wild West folks was American.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2016-09-05T06:15:02.150Z"}, {"movie_id": 174751, "review_id": "57f40fd6925141398a000368", "author_rating": 8.0, "review_text": "**A woman's preparation to fight the outlaws.**\r\n\r\nProbably on underrated film, but for me, I'm sure it is an underrated film. From the director of 'Warrior', another excellent film to include in his filmography. A well written screenplay, but that's where the problem is according to those did not like it. Because it was kind of 'all's well, ends well' story. That does not mean it is full of cliché, maybe they expected the film to be more harsh and violent like most of the high profile western films do.\r\n\r\nSorry to those who did not enjoy it, but I did. It was nothing like only for men, but still R rated. Yep, I understand the last 10-15 minutes was so intentional, so what, the story wrapped perfectly in a right way. I must appreciate the cast, particularly the lead two actors, Natalie Portman and Joel Edgerton. This film is not an opportunity to give the best character display, but everyone did their parts quite finely.\r\n\r\nEwan McGregor was a disappointment with his useless role. I mean it was a good one, but not made for him. I think the villain character lacks the toughness. That leaves it a one sided theme, so you might not know how the developments happen, but you will know which way is it heading in the earliest. Particularly as it was focused more on the romance, despite it is not a romance theme. Though there is a twist and many turns in the narration. Overall film was very entertaining, partly predictable, yet totally worth a watch if you keep your expectation locked in a safe afar while watching it.\r\n\r\n_8/10_", "created_at": "2016-10-04T20:23:50.807Z"}, {"movie_id": 174751, "review_id": "5880e2a4c3a368310600d848", "author_rating": 6.0, "review_text": "Them Bishop boys are coming for you? You don't need a gunslinger. You need a goddamn regiment.\r\n\r\nJane Got a Gun is directed by Gavin O'Connor and collectively written by Brian Duffield, Anthony Tambakis and Joel Edgerton. It stars Natalie Portman, Joel Edgerton, Ewan McGregor, Noah Emmerich, Boyd Holbrook and Rodrigo Santoro. Music is by Marcello De Francisci and Lisa Gerrard and cinematography is by Mandy Walker.\r\n\r\nJane Hammond (Portman) has to turn to her ex lover, Dan Frost (Edgerton), for help when it's revealed that the notorious Bishop gang are heading her way in search of her husband Bill (Emmerich).\r\n\r\nIt's going to be one of those films more talked about for what it could have been than what it is. Changes in production staff were unbound, from director, writer, photographer and some big name cast changes, it was a production blighted and destined to be on a loser. It hasn't helped that with it being a slow paced character based picture, and a Western at that, the market for a fan base was already running low on potential supporters. So what we left with?\r\n\r\nIt undoubtedly is one for hard core Western fans only, it's hard to envisage newcomers entering into the genre for the first time, perhaps lured by the casting of Portman, being won over to the point of seeking out other classic Westerns of past and present. Yet it's got a lot going for it, because if you have the want, then it may just take a second viewing to fully absorb and enjoy. \r\n\r\nAt its core it's a straight Oater of redemption, opportunities waylaid by fate, and of course a good old good versus bad axis. Relying on a flashback structure to set up the character dynamics, it can get a bit disorientating at times, hence the shout out for a second viewing. However, it may not be the perfect way to build the principal characters, but they are worth the investment for there's a big emotional pull there.\r\n\r\nHaving laid the foundation for the first two thirds of the pic, we shift to good old honest violence, for siege read backs against the wall, and not without invention, in fact there's much resourcefulness on show, with Jane at times very much leading the way. The last third pays off handsomely, even if there's the (arguably) inevitable sugar coated candy to swallow as part of the final deal. Cast are dandy and turning in perfs of note, though it needed more of McGregor's John Bishop, because with what little he gets he does make a villainous mark.\r\n\r\nIt looks terrific, Walker's photography bringing to mind the genre work of Roger Deakins, with the New Mexico locations blistering in their beauty, and while the sound mix for dialogue exchanges is a little poor, the musical score is thumping in its tonal appreciations. It's tricky to recommend with confidence even to Western fans, especially in a year when \"Jane\" had to compete with the more rambunctious Magificent Seven reboot, but give it a chance if you liked something like Slow West, and you may just be pleasantly surprised. 7/10", "created_at": "2017-01-19T16:00:36.940Z"}]