[{"movie_id": 458723, "review_id": "5c855c6bc3a3684e8fdd63ff", "author_rating": 10.0, "review_text": "Jordan peele is one of the best dictators in the world with only two movies and this movie is amazing \r\n96%", "created_at": "2019-03-10T18:50:19.954Z"}, {"movie_id": 458723, "review_id": "5c926f1bc3a3686111535623", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, you can read my review of one of my favorite movies of 2017, Jordan Peele‘s Get Out by clicking its title. One of the best feature-long debuts of all-time by a writer-director who I wish he discovered his filmmaker skills sooner because the horror genre urgently needed someone like him. Peele is starting to become one of Hollywood’s most notable people, and he proves once again, now with Us, that his undeniable talent is going to leave our jaws dropped and our minds confused for quite some years. While I do think that his first film is more consistent and better structured, Us is so far the best movie of the year, and I doubt that it will stop being part of that list by the end of it.\r\n\r\nThe best films are the ones that can transform a 45-min car ride back home from the theater into a blink of an eye. I spent all that time plus some more minutes discussing and arguing with my partner who I saw the movie with. By now, I have a pretty decent understanding of the film’s story and of Lupita‘s character arc, which will definitely leave you extremely confused and mind-blown by the end of the movie. However, I will see it a second time to make sure my “theory” aligns with everything else, especially those tiny little details we don’t really think they matter when they actually do.\r\n\r\nPeele‘s screenplay is thought-provoking and suspenseful, filled with brilliant character development, and surprisingly well-filmed action scenes. I guess he knows how to do anything efficiently. The chasing scenes are riveting, and the fights are bloody awesome. In addition to this, most of the action occurs at night which requires the director to know what he’s doing, so the audience is able to follow what’s happening. I never, not once, lost my place during an action sequence. I knew who everyone was, where were they at, and what were they doing. Nowadays, having in mind how actual action blockbusters are being made, this is the best praise I can give a director regarding these type of scenes.\r\n\r\nA lot of articles are calling Jordan Peele the “next Spielberg“ or “new Hitchcock“. I’m calling him the first Jordan Peele! I would have loved to be the one who came up with this last sentence, but I wasn’t … and I’m so happy about it. It means that more people are starting to plant into their minds that Peele is one of a kind, not one like the other. His trademark close-up shots right in the actors’ faces can show and tell so much about a character. Besides that, the actors will have a golden opportunity to show their enormous emotional range, their incredible expressions, their limitless talent … That is if you are someone like Lupita Nyong’o.\r\n\r\nRight after I watched Alita: Battle Angel, I called that it would get an Oscar nomination for Best Visuals Effects, and I still stand by it. Well, I also want to be the first to call not only an Oscar nom, but a Best Actress win for Lupita. Daniel Kaluuya was outstanding in Get Out, but Lupita surpasses his fellow comrade with two (!) powerfully captivating performances. As the original mother, she shows kindness and endearing traits. As her doppelganger, she’s scary, menacing, and evil. Two completely different characters with distinct physical and psychological characteristics are no problem for Lupita. She handles them in such a flawless and effortless manner, carrying the entire narrative on her shoulders like it was nothing. She deserves every recognition there is.\r\n\r\nNonetheless, she still received great help from the remaining cast. Winston Duke (Gabe Wilson) is hilarious, and he’s the primary source of comedy throughout the film. With a remarkable balance of tones, Peele lets Duke shine in a role that he thrives on. Us can be very heavy and dark at times, so a good laugh here and there is always welcome. The young actors are also great, but I have to congratulate Shahadi Wright Joseph‘s performance as Zora Wilson. She has approximately the same age Amandla Stenberg had in The Hunger Games. At the time, I knew Stenberg would be an outstanding actress, and I was not wrong. Now, I’m 100% certain that Shahadi will be an exceptional one if she isn’t already.\r\n\r\nTechnically, I already wrote above how talented Peele is. From his seamless ability to film action sequences in the dark to his brilliantly-written screenplay, he nails almost every aspect of his movie. The score beautifully accompanies the narrative with cool, rhythmic songs when everything seems fine, and with loud, angelically weird voices that instantly change the tone. Flawless editing helps hide some nitpicks I have with some exposition scenes, especially towards the end. While I understand that the story has a lot to take in once “explained”, I believe Peele does so in a slightly too fast monologue that I think some people won’t quite enjoy. For me, I would have loved total ambiguity. If they didn’t explain a thing, I would have been ecstatic, but I understand the need to do it.\r\n\r\nMy other gripe with the film is the other family, portrayed mainly by the always astonishing Elizabeth Moss (Kitty Tyler), and Tim Heidecker (Josh Tyler). Thinking about them and their importance to the story, I find that either they could have been better utilized or they shouldn’t even exist. It’s the middle ground between these two options that bothers me a little since it feels like these two remarkable actors, especially Moss, were left aside too much. They are indeed relevant to elevate the story as a whole, but I still wish they were explored a bit better.\r\n\r\nSadly, I think audiences will like Get Out more, even though Us has more of the horror genre’s traits than the first. Not only due to the story being more comfortable to follow and ultimately understand (some people actually left my theater way before the end … shame on you!), but also because it has a definite ending. Unfortunately, people don’t really like to think about a movie after it finished, so if it has some sort of open-ending, they’re going to be mad. That’s what happens if you go into Us expecting a cheap horror film, filled with cliche jump scares, and hollow characters. This is not a scary flick. It is a horror movie, and a phenomenal one. In case you want a simple, spoiler-free advice on how to approach the film’s story, I’ll leave just one small sentence after my rating.\r\n\r\nJordan Peele is one of a kind. He is not like anyone else. Once again, he offers a thought-provoking, deeply layered, and incredibly suspenseful narrative. Captivating and entertaining from beginning to end, with no misstep along the way. Technically seamless, with his emotionally-driven trademark close-ups on the characters faces being a standout. Lupita Nyong’o delivers what I believe it’s her career-best performance(s), which should grab her not only a bunch of award nominations, but wins as well. Brilliant cast, tonally well-balanced with hilarious comedy, and filled with excitingly scary action sequences.\r\n\r\nUs does not have a single interpretation. My perspective is not right or wrong, it’s just my point of view. It’s one of those movies you can watch time and time again, and each viewing will give you another insight that you missed before. However, I do think that what happens at the very end, it’s true, and I have more than enough hints throughout the film to sustain my opinion. Despite some minor issues/nitpicks, it’s undoubtedly the best movie of 2019 so far, and I highly doubt it will be out of my Top10 by the end of the year. Thank you, Peele, not only for giving us great horror films, but for being yourself. Go see it!\r\n\r\nRating: A-\r\n\r\nAdvice: focus on the boy’s actions, and how he reacts to everything he sees or does.", "created_at": "2019-03-20T16:49:31.383Z"}, {"movie_id": 458723, "review_id": "5c9aa1dac3a36872983d2206", "author_rating": 10.0, "review_text": "Led by stellar performances and careful directing, Us asks more questions than it answers, giving the audience all the tools needed to solve every single mystery for themselves, making this an uncommonly effective horror masterpiece.", "created_at": "2019-03-26T22:04:10.151Z"}, {"movie_id": 458723, "review_id": "5cb0843dc3a3683c26ac18e0", "author_rating": 6.0, "review_text": "_Us_ is gonna be a tough one to review. Difficult to review without spoilers, which is what I'm gonna do here, but I think even if I was doing spoilers, I'd still struggle.\r\n\r\nWhat I will say, is that my feelings on _Us_ went up and down as I sat there and the story progressed. At one point, I was enraptured by a single scene that for a brief moment I got so caught up I felt certain no movie of the year was ever going to be able to top it. But then the scene ended, and shortly after the movie ended and my mind just went to \"...It's good\".\r\n\r\n**Definitely** merits watching, re-watching and analysing (there is a **lot** to unpack from _Us_) but maybe not the highest of all available praises.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-04-12T12:27:41.234Z"}, {"movie_id": 458723, "review_id": "5d4a0cb61b72940018a8f0a6", "author_rating": 7.0, "review_text": "**_An effective socio-political thriller looking at issues of class and privilege_**\r\n\r\n> _Therefore thus saith the LORD, \"Behold, I will bring evil upon them, which they shall not be able to escape; and though they shall cry unto me, I will not hearken unto them.\"_\r\n\r\n- Jeremiah 11:11\r\n\r\nThere's a detail to be found in writer/director Jordan Peele's second feature, _Us_, which gives you a good idea of the amount of thought that has gone into the film. In the opening scene, set in 1986, a young girl walks into a hall of mirrors, with a sign outside proclaiming \"Find yourself\", and a picture of a Native American above the door, with the words \"Shaman Vision Quest\". Later in the film, now in the present day, the same hall of mirrors is seen, the same \"Find yourself\" is seen, but now the picture of the Native American has been replaced with a wizard, and \"Shaman Vision Quest\" with \"Merlin's Enchanted Forest.\" This change, easily dismissed as representative of everything that's wrong with PC culture, is actually much more telling. It represents a meaningless and superficial attempt to tackle society's discomfort with the violence found throughout the history of the United States. It's like putting a plaster on a severed limb; \"_sure, the white man slaughtered the Native Americans, but if we do things like change signs on amusement parks, everything should be forgiven, right?_\" This, in turn, speaks directly to one of the film's most salient themes - the US (or us) as we know it today is a country built on violence, racism, and oppression, but as long as such things are swept under the carpet and no one talks about them, then there's no need to worry. Peele very much wants people to start talking about them.\r\n\r\nI wasn't the biggest fan of Peele's previous film, the smash hit, _Get Out_; it was a terrific idea and a well-made film, but it left me a little indifferent. However, although it wasn't my all-time favourite movie, I certainly admired how he reformulated the tropes of the genre so as to suggest that just because the US gives the appearance of being a pseudo-post-racial society, it doesn't necessarily mean that that's true behind closed doors and in people's hearts. With _Us_, he is working in a similarly metaphorical mode, using the tropes of the home invasion thriller to probe issues of class and, especially, privilege, whilst also suggesting that what gives us our humanity may not be the same thing as what makes us human. The plot is an allegory for a nation divided unto itself; a fractured national identity that sees a strict demarcation between those above and those below, the haves and the have-nots, those with opportunity and those without. Essentially, Peele suggests that when social/economic/political inequality is so pronounced for so long, sooner or later, the only recourse available to the have-nots is to make a grand statement, a statement that will almost certainly not be peaceful.\r\n\r\nThe film opens in 1986 as the Thomas family visit the boardwalk in Santa Cruz. With the relationship between father Russel (Yahya Abdul-Mateen II) and mother Rayne (Anna Diop) icy at best, daughter Adelaide (Madison Curry) is somewhat of an afterthought. Leaving Adelaide in Thomas's charge, Rayne heads to the bathroom, but with Thomas more interested in playing Whack-a-mole, Adelaide wanders down onto the beach. Walking into a strange beachfront hall of mirrors, she sees something that deeply traumatises her, resulting in her not talking for several years. The film then cuts to the present day as the now-adult Adelaide Wilson (an astounding Lupita Nyong'o) travels to Santa Cruz with her family - husband Gabe (Winston Duke), daughter Zora (Shahadi Wright Joseph) and son Jason (Evan Alex). Comfortably middle-class, the family are staying in a house owned by Adelaide's parents, although much to Gabe's irritation, they are nowhere near as wealthy as their neighbours, the Tylers - Kitty (Elisabeth Moss), Josh (Tim Heidecker), and twin daughters Becca and Lyndsey (Cali and Noelle Sheldon). Uneasy at being so close to the scene of her childhood trauma, Adelaide becomes convinced that something terrible is going to happen, and although Gabe is initially dismissive, she seems so earnest in her conviction that he agrees the family can leave the next day. However, the power then cuts out, and Jason reveals that there are four people standing ominously in the driveway.\r\n\r\nIt's not a spoiler, of course, to say that the people in the driveway are the Wilsons' exact _doppelgängers_ (played by the same four actors), or that their intentions are less than friendly. However, one of the problems with reviewing the film is that so many of the themes and larger socio-political ideas are tied to who the _doppelgängers_ are and what they want, that it's difficult to discuss them without spoilers. So, small spoiler ahead - the _doppelgängers_ are called the Tethered; essentially, they are an underground-dwelling race of lookalikes, spiritually tied to those living above (this info is revealed quite early in the film, so it's not a massive spoiler). Although partly inspired by the 1960 \"Mirror Image\" episode of _The Twilight Zone_, the main influences for the Tethers appear to be urban legends surrounding \"mole people\" and, more specifically, the conflict between the Morlocks (strong underground-dwelling troglodyte-like humans) and the Eloi (small fruit-eating humans living on the surface) in H.G. Wells's _The Time Machine_ (1895).\r\n\r\nSetting out to probe both economic and societal divisions in the contemporary US, Peele introduces the theme early on with Gabe's jealousy at the Tylers' nicer house, fancier car, and much bigger boat (named \"B'Yacht-ch\"). Later, after the arrival of the Tethered, the theme becomes more explicit; through no fault of their own, they live in an underground realm, deprived of the opportunities those above the surface have access to. The allegorical dimension couldn't be clearer; the film is essentially a parable about class division. The Wilsons represent a middle-class all-American family, financially comfortable and well educated (Gabe wears a Howard University sweater; Adelaide studied ballet). The Tethered represent the underclass, whose lives are the inverse of the Wilsons, those without access to the privileges enjoyed by the wealthy, despite possessing the same emotions, the same biology, and the same capacity for happiness and success. This similarity is driven home when Adelaide asks Red (her Tethered) who they are, and Red seems confused by the question, answering (truthfully), \"_we're Americans._\"\r\n\r\nIn this sense, the film is very much about classism and marginalisation in contemporary American society. Taught they have no soul, the Tethered are depicted as resentful and bitter versions of the people on the surface, with Peele positing that only circumstance divides them. Adelaide is not smarter or more capable than Red; rather, the main difference between the two is just that of the difference between a poor person and a rich one; fate of birth. This speaks to perhaps the film's most important point - the marginalised, destitute, and discriminated against can succeed just as much as everyone else if only they're given the opportunity to do so. This is also alluded to in the powerful final shot. I won't spoil it, but the last image reveals that the Tethered have accomplished something which the surface dwellers once attempted but failed.\r\n\r\nPhysically trapped underground and emotionally trapped by their connection to those above, the Tethered are ignored, swept under the rug of society, out of sight out of mind, just like the alteration to the picture above the hall of mirrors; \"_if we hide the problem, that means the problem no longer exists._\" In what is essentially a sustained inversion of impostor syndrome, Peele allegorically examines what could happen when the marginalised and ignored can be marginalised and ignored no longer, whether they be the economically impoverished, the racially suppressed, vets suffering from PTSD, non-Americans xenophobically regarded as the Other, really any group of people that society at large has shunned. Looking at issues of double consciousness, social identity, sin, and privilege, Peele asks the US to look at itself in the mirror and consider those invisible millions.\r\n\r\nIf this sounds didactic and/or preachy, that's because it is - Peele is very much preaching. However, he also allows himself to have some fun with it - when Zora arms herself for battle, for example, she does so not with a gun or a knife, but a golf club. What possible better weapon could there be for the bourgeoisie? Later, the only thing that gets Gabe to abandon a secure hiding spot is the prospect of driving the Tylers' car. True, the deeper Peele explores the Tethered, the more insurmountable logistical problems that are thrown up, and the further he strains credibility. However, it's a testament to both his filmmaking acumen and the strength of his thematic concerns, that such straining is not as detrimental as it may sound. Sure, there are huge practical problems with the Tethered, but you sort of go with it because what he's saying is so interesting, and he's saying it so well.\r\n\r\nOne of the most impressive things about the film is the attention to detail. For example, there are numerous references to Jeremiah 11:11, in which the prophet Jeremiah warns Jerusalem it is facing destruction because of their worship of false idols. In the film, so too do such false idols occur, in the form of money and, more specifically, a virtual assistant named Ophelia on which the Tylers are completely reliant, and which is at the centre of probably the darkest joke in the film. Another example is that the number 11, which itself is obviously a mirror image, recurs throughout, not just in objects (a digital clock is shown reading 11:11, the roof of an ambulance has the number 1111), but in the actual shot composition, wherein objects in the frame are made to literally look like the number (two lights reflected in the water, the frame of a door, trees in the background, a pattern on the floor).\r\n\r\nAs this might suggest, _Us_ is exceptionally accomplished from an aesthetic point of view, even more so than was _Get Out_. The opening scene, for example, features extraordinarily impressive photography by Mike Gioulakis, designed to place us as close to young Adelaide's consciousness as possible. As she wanders along behind her parents, the camera sticks primarily to her height, with everything towering above her, whilst the candied apple she holds is hypnotically red and shiny (one could say Edenic). Additionally, her parents never come close to touching, a visual manifestation of the obvious problems in their marriage. The film also features an agonisingly beautiful scene involving one of the Tethered and a fire, which is masterfully shot. The music by Michael Abels is especially good in this scene. Another fine scene features the rare use of a split diopter, a tool favoured by Brian De Palma that allows both foreground and background subjects to stay in focus simultaneously. Using it in a crucial scene towards the end of the film, it is the only time we see Adelaide and Red's faces in the same shot at the same time, with Red shot in BCU, facing away from Adelaide, who stands behind her. Far from being a gimmick, Peele uses it to enhance his theme, allowing the content to dictate the form.\r\n\r\nIn terms of acting, there are no weak links, but Nyong'o's nuanced work as Adelaide and Red is especially noteworthy as a study in fundamental contrasts. Apart from their appearance, nothing about the two is similar; their posture, their facial expressions, how they talk, how they walk, how they react to things around them, how they use their hands. Adelaide, a former ballet dancer, is graceful and elegant, whereas Red is automaton-like, her movements almost staccato and splintered into sudden bursts. It's a clinic on how to convey individualised psychology through body language, and at times, it's hard to believe it's the same actress playing both roles, she really is that good and deserves serious awards recognition for her work. For his part, Duke plays Gabe as a gentle and dorky father with an endless line of bad jokes, who frequently embarrasses his kids, but his _doppelgänger_ Abraham as a hulking monster.\r\n\r\nIn terms of problems, there are a few. As already mentioned, there are insurmountable practical issues with the Tethered which are never addressed, and on occasion, Peele becomes overly didactic. My biggest issue with the film, however, was something you see a lot of, and not just in horror movies - every time the Tethered want to kill someone, they do so immediately, without ceremony or pause. However, they pass up multiple opportunities to kill the Wilsons. At first, this seems as if it's because they wish to keep them alive for some reason, but later in the film, we find out that really, they just want to kill them. Never once do they attempt to do so with the ruthless efficiency with which they kill others, which is an irritating inconsistency. It also means for large parts of the film, there isn't really any tension. Additionally, the final twist, of which I will say nothing, doesn't really work, feeling like something of a twist for twist's sake that was never fully integrated into the narrative.\r\n\r\nThese small problems notwithstanding, _Us_ is an impressive film that improves on _Get Out_ in almost every way, and which serves as a more complete artistic statement. Examining what it means to be so concerned with what you don't have that you never consider the fact there are people with far less, the film holds a cracked mirror up to society, showing some of its ugliest prejudices and failings. The Tethers are monsters because they have been left with little choice other than to become monsters, imprisoned by a system they had no part in creating and in which they are not allowed to participate. Both visually accomplished and thematically complex, _Us_ once again finds Peele examining the kind of social oppression that no one wants to acknowledge (just like that sign above the hall of mirrors), but this time he widens his scope to move beyond issues of race. In _Get Out_, he took a story of bodily possession and moulded it into a story of black/white relations. In _Us_, he demonstrates that oppression can easily cross racial boundaries. And the real horror of this isn't to be found in monsters or jump scares. It's to be found in humanity's frequent inhumanity to one another.", "created_at": "2019-08-06T23:26:46.840Z"}, {"movie_id": 458723, "review_id": "5d7f6630c54304001196af21", "author_rating": 5.0, "review_text": "It started really intriguing and mysteriously interesting and thought it was something about supernatural/paranormal stuff (which I like a lot), but unfortunately transformed into something else and all in all, it became average movie in my opinion.", "created_at": "2019-09-16T10:38:40.940Z"}, {"movie_id": 458723, "review_id": "5dcbcb2d1d78f20018240261", "author_rating": 6.0, "review_text": "It’s sloppy, lacks logic or internal consistency, makes really bizarre and inane storytelling decisions, and has a less than satisfying ending. It’s also strangely fun and absorbing and a good time, even if you end up racking your brain trying to figure out the logic.\r\n\r\nFollowing up his excellent \"Get Out,\" Jordan Peele gives us \"Us,\" the story of a family terrorized be evil doppelgangers who want revenge for something and to finally get their time in the sun in a very clear socioeconomic metaphor. Ultimately it doesn't make a lot of sense, and yet there's still something strangely compelling about this film. It's as though Peele tries to walk us through the door, but realizes too late that he forgot to open the door first and we end up crashing through it, Kool-Aid man style, getting a few splinters stuck in our eye in the process. We get the results we ultimately wanted, but it's far from painless.\r\n\r\nThe problem comes down to basic logic. As the movie goes on, you can't help but wonder how exactly this works. When needing to identify with movie characters, you have to figure out how the world they're in works. Honestly, I found Middle Earth to have more of an internal logic than this world. And this is supposed to be our world, not some weird fantasy realm.\r\n\r\nWhile this movie is plagued by problems with disbelief, it’s still strangely fun. Like, really fun! It’s a great idea, just sloppily executed and rushed out without fixing the logic part. As such, it’s one of those movies that seems to have divided audience everywhere. I myself can see both sides, so it’s getting a middle of the road rating from me. If you can consciously suspend disbelief in the face of some major logical problems, you’re bound to have a lot of fun. Otherwise, you might want to skip it to save your own sanity.", "created_at": "2019-11-13T09:21:49.529Z"}, {"movie_id": 458723, "review_id": "63bf878905a5330085a42f6f", "author_rating": 1.0, "review_text": "Well, they cut back on the blatant racism from \"Get Out,\" so that's a plus. It didn't make the film a uncomfortable to watch in an original \"A Birth of a Nation\" kind of way. But's it's still there, just slightly muted.\r\n\r\nAnd, like \"Get Out,\" it'll have the same cringe effect once its not socially acceptable any longer. But again, it was toned down so it isn't as uncomfortable a watch.\r\n\r\nHowever, the film kind of gives everything away in the very beginning. Straight down to the grand event at the end. So if you're paying attention to glaring, obvious, detail the twist at the other end can be seen easier than a 20mph fastball.\r\n\r\nThere is a moment of doubt that, maybe the obvious hints were wrong, but right before the action starts the mother gives a speech to absolutely ensure that you, yes, you were right from the start.\r\n\r\nAnd the racism, though toned down, makes it pretty clear that the peaceful and loving event highlighted at the start of the film, isn't just going to be for nostalgic reasons. It's going to be a plot element, only because someone like Jordan Peele isn't that type that would look at that gesture of 80s kindness favorably.", "created_at": "2023-01-12T04:07:37.460Z"}]