[{"movie_id": 2503, "review_id": "5f93a731ce6c4c004204b1dc", "author_rating": 8.0, "review_text": "Solid entry that should have been the conclusion to the Bourne character, instead Damon and Greengrass chased the dollar to return to \"Jason Bourne\" which I remember being underwhelmed by (will be revisiting it sometime during the week).\r\n\r\nStill, some good chase and fight sequences though the great trailer line (\"If you were in your office right now we'd be having this conversation face-to-face.\") makes Bourne look like an arrogant a** because if he hadn't tipped off his location, he would've avoided the chase and made it to the E. 71st location having the element of surprise. In addition, the relationship between Bourne and Nicki (sp?) still felt off.\r\n\r\nAnyway, still was entertained but probably rank this as the third best of the series (right now, going to revisit Legacy soon). **4.0/5**", "created_at": "2020-10-24T04:01:53.127Z"}, {"movie_id": 2503, "review_id": "63e7098563aad2008586e732", "author_rating": 8.0, "review_text": "**The Bourne Ultimatum provides an exciting conclusion to the original Bourne storyline, answering questions and leaving a trail of bodies in the process.**\r\n\r\nThe Bourne Ultimatum picks up immediately where The Bourne Supremacy left off, once again raising the stakes and ratcheting up the action. This time Bourne’s memories are flooding back more and more, and he’s hellbent on bringing those responsible for Treadstone to justice. The story focuses much more on answering the questions of Bourne’s past and the CIA’s illegal activities. I enjoyed the reunion of Julia Stiles’ character with Matt Damon’s. It developed some care between them, providing a little hope and stability in a world filled with betrayal, greed, spycraft, and subterfuge. The Bourne Ultimatum is an explosive conclusion to the original Bourne trilogy and is incredibly satisfying. Still, compared to the first two, it is a little bogged down with all the questions it needs to answer the wrapping up the story. But that is a minor complaint when the movie is one of the best in the spy genre.", "created_at": "2023-02-11T03:20:37.793Z"}]