[{"movie_id": 10771, "review_id": "5d87955e336e0100191797b7", "author_rating": 5.0, "review_text": "CGI manages to completely shadow Jackie Chan's talent. Why wire-fu, when he can do much better for real (as he has more than proved throw his films).", "created_at": "2019-09-22T15:38:06.925Z"}, {"movie_id": 10771, "review_id": "5f20ae266905fb0036f7cf8c", "author_rating": 7.0, "review_text": "Good watch, might watch again, and can recommend.\r\n\r\nI'm not sure Jackie Chan has made a bad movie on the simple fact that almost no one can do what he does, and the flair he puts on it would keep distinct even if someone else tried to compete.  Part of his charm is how humble he acts, and this movie amplifies that as he's a guy that doesn't know what he's doing and has to rely on a Tuxedo for his abilities and Jennifer Love Hewitt for basically everything else.\r\n\r\nJLH is great in this as well, she does some action, she's funny, she does some positive messaging for women, and she act's smart.  I'm not sure if this could have been a little stronger if she was an experience field agent instead of a socially awkward scientist, but I don't think it would have been nearly as charming.\r\n\r\nThe writing is structured fine, but I wish it had a little more oompf to it.  The villain's plot is interesting and innovative, but I feel like they could have done a lot more with it.\r\n\r\nAll said and done, it was good, but there are probably better actions, comedies, and spy movies you could watch.", "created_at": "2020-07-28T23:00:54.952Z"}, {"movie_id": 10771, "review_id": "60b5aa527d5504007c3cc652", "author_rating": 5.0, "review_text": "Came out when Jackie Chan, Jet Li or Chow Yun-fat was doing anything thrown their way in Hollywood, probably thanks to the success of the Rush Hour franchise. The Tuxedo is a middling action-comedy that never really works though you get plenty of gratuitous shots of Jennifer Love Hewitt's cleavage. Has some moments but pretty forgettable even with Chan's martial arts skills on display. **2.5/5**", "created_at": "2021-06-01T03:32:34.388Z"}]