[{"movie_id": 244539, "review_id": "567c35039251417dec003c39", "author_rating": 9.0, "review_text": "> About a father and his two little girls who has been there was each other.\r\n\r\nBased on the real life events of the director's childhood and it is her first directional film as well. Mark Ruffalo and Zoe Saldana as her onscreen father and mother respectively, while her character as a 12 year old girl was played by her own daughter. I think it was a great team, the mother is the director, the daughter performing under her, the father producing it and it is their story.\r\n\r\nI was worried that this film's going to emotionally hurt me as I'm an easy target to strike with a theme like this as what the synopsis says and the trailer revealed. But I was prepared for that, I wanted to have a tearjerker flick and in the end, I had a great time with it as the fulfillment was way beyond than what I was expected.\r\n\r\nIt was the story of a small family, a father and a mother and their two little girls that set in the 1978 Bostan city. Because of the condition of the father, the struggling family whose children are growing up needs a financial support for their better education and care. So the mother decides to sacrifice a few years of hers to go back to college to graduate and get a job. Now its between the father and the girls, how they spend those years together, which will be their worst nightmare as well as the best years of their lives.\r\n\r\n> \"We'll be braver, Daddy.\r\n> Next time, I promise we'll be braver.\"\r\n\r\nIt really scared me a few times, because of the temperament of the father character, kids playing with a machete and so on. A wonderful family flick, but only for the adult members. Because of the too much cigarette smoking, I mean Mark Ruffalo smoked almost all in his screen presence and obviously the excessive usage of the foul language is the other reason.\r\n\r\nSo it is an R rated flick, but it was so perfect, the 70s atmosphere was spot on. Except the only bothering thing was the children never grew physically, while the cars, clothing style, society, cameras, the timeline has kept changing. But it did not leap extremely forward like a decade or something. That was not a big issue, while the film and its story telling kept the rhythm always on the high. Yep, there's no dull moments, whenever it began to sink under the emotion, repelled back with the same force which is why I hooked all the way. By the way I thought those innocent family sentiments were strongly appealing in a cute manner.\r\n\r\nNow we talk about the roles. Mark Ruffalo definitely deserves an Oscars nomination. But I can't declare the award for him as I have to find out how the other actors performed in their films. This is his best film in a lead I have seen, probably his career best. To me it is this year's version of the last year's JK Simmons performance for the movie 'Whiplash'.\r\n\r\n> \"Our dad is totally polar bear.\"\r\n\r\nThe other side, Zoe Saldana was as usual in a charming and polite character. As I know she never disappoints her fans. Ruffalo and Saldana are one of the best on screen pair, looked so real, like a real couple. The two little girls were also awesome in their debuting film. The entire movie's focus was these four members, very occasionally outside characters come into play with hardly any lines to deliver. I wondered what is the meaning of the title and if your focus is on, you won't miss the explanation, which was so cute.\r\n\r\nAn amazing fusion between the incredible narration and the background score. The tracks (some of them are not OST) as well very good that played till the credits rolled out. I liked 'The Pirate Song' that was written by the director and 'Oogum Boogum' was funny. Many of them I heard for the first time and thinking to grab them for my movie song collection. Overall, it will surely transform your mood by the end of the movie, I mean in a good way.\r\n\r\nInspiring, yes the film inspires to have our own little family with kids. Especially a perspective of a father and his great responsibility was portrayed tremendously. And also the girls who saved their father from being lost. They stayed for each other and stayed that way as how a parent and his children should be as an example, but in a little harsh human nature.\r\n\r\nIt is a rare gem, undoubtedly completely enjoyable. This was one of those that came silently into the productions. The earlier posters were unimpressive and made me stay away, but later, now it turned out one of my favourite flick from the 2015. Obviously movie fanatics loved this heartwarming family drama and I highly recommend it. As usual like I always say, whether you like it or not, but don't miss it.\r\n\r\n9/10", "created_at": "2015-12-24T18:10:11.002Z"}]