[{"movie_id": 338952, "review_id": "5bf42ec6c3a36818a30a7175", "author_rating": null, "review_text": "_By JD Phillips, geekr.org_\r\n\r\nThe Harry Potter movies are great but one of the main flaws of the original franchise was the struggle the films had condensing the lengthy novels into movies under three hours. Despite the Fantastic Beasts sequel not being based on a book, it still somehow feels like its stressing to condense a five hundred page book into a smaller narrative.\r\n\r\n\r\nThe movie runs from scenario to scenario so quickly that it’s hard to remember what all happened in its muddled story. That’s not to say the film is terrible at all, surprisingly. For a movie that has serious pacing problems throughout and has more interest in setting up sequels than it is at finding a memorable plot of its own, it’s actually very entertaining.\r\n\r\n\r\nThe returning cast members are all back and while none leave quite the impression they did before they’re all still entertaining in their own way. Newt is back but the movie doesn’t seem nearly as interested in him and his magical monsters than it is with all of the new elements. Redmayne is still terrific in the role, however, and makes the character much more interesting than the script does by itself.\r\n\r\n\r\nJacob and Tina are back as well though both of their stories are shelved for most of the film and completely forgotten in the final moments.\r\n\r\n\r\nThe biggest surprise though is that Queenie gets the best arc of any character in the movie. She was one of the more interesting characters in the original and while many of the twists in the film fall flat, the one involving her character was my favorite moment of the entire movie. I’m more excited to see her story resolved than I am most of the other elements.\r\n\r\n\r\nIt shouldn’t surprise anyone who has seen the trailers that the new characters kind of take over the film from the returning players. Jude Law and Johnny Depp’s Dumbledore and Grindelwald are what this film is more focused on than any other plot element.\r\n\r\n\r\nBoth veteran actors shine so much that the movie loses energy when they aren’t on screen. Law effortlessly settles into Dumbledore’s twinkly-eyed wise, yet manipulative schtick.\r\n\r\n\r\nDepp also kills it as Grindelwald. In fact, it pains me to say this because of how much of an ass the actor is in real life, this is the most I’ve liked Depp as a performer since his first time playing Jack Sparrow. He avoids most of the oddball antics he’s been milking for so many years and delivers a subdued, terrifying performance as Grindelwald. He more than holds his own against Ralph Fiennes, which is saying something.\r\n\r\n\r\nOther new players are a mixed bag. Zoe Kravitz’s Leta Lastrange is an interesting character but none of the others really stand out. Newt’s brother Theseus is a particularly big missed opportunity. The film never adequately explains what caused the rivalry between the two Scamanders and it all gets resolved before there’s a chance to go into it more. Claudia Kim’s Nagini may have caused a big stir when she was announced in one of the trailers but very little is actually done with her character. It feels more like a stunt than anything else.\r\n\r\n\r\nThe biggest stunt comes from the big reveal in the end featuring Ezra Miller’s Credence. There’s a huge twist that not only breaks established history but feels extremely forced. For one, the movie never really explains how Credence came back to life in the first place. It feels like Ezra Miller became a bigger commodity for DC since he is the Flash so now the franchise is committing more to him than initially intended. There was no hint at all in the first movie that he was secretly connected to existing characters in a big way, so it seems out of left field. Regardless, I love Ezra Miller and hope the twist gets him better material in the future.\r\n\r\n\r\nThe movie doesn’t feel much like a Fantastic Beasts franchise anymore but when it does focus on its titular magical creatures, it really shines. The design and concept of the creatures lead to some of the best visuals of the entire Harry Potter pantheon. In fact, it feels like a real shame that we can’t get a smaller franchise that is just about Newt’s magical zoological adventures. The quieter moments of the movies where Newt is just connecting with a magical animal on its own terms are truly beautiful. Unfortunately, these moments get overtaken by the larger story around them.\r\n\r\n\r\nI feel like this franchise is straining to be two different franchises at the same time. It would almost make more sense to separate them into a smaller scale “Fantastic Beasts” franchise and a larger scale “Crimes of Grindelwald” franchise. This mishmash of different ideas is feeling a little too much like the Hobbit films.\r\n\r\n\r\nSomehow though, despite all of the messiness of the movie’s screenplay, I still found myself entertained throughout. While it may never hit the heights of its legendary predecessors, this film easily proves that the Wizarding World still has lots of magic left. Maybe the executives at Warner Bros should consider other avenues like television or other films so that Newt’s film series doesn’t carry the weight of one of the most magical film series ever.\r\n\r\n\r\n“Fantastic Beasts: Crimes of Grindelwald” may not rise to the levels one would hope for, it still proves itself to be worth your time, if even just for one viewing.\r\n\r\n\r\n**7.0**", "created_at": "2018-11-20T15:56:54.422Z"}, {"movie_id": 338952, "review_id": "5c011138c3a3686476089cce", "author_rating": 6.0, "review_text": "The first Fantastic Beasts movie was excellent. It was a bright and magical adventure. This one is going down another path and I cannot say that I was overly thrilled by that.\r\n\r\nThis movie is putting emphasis on political machinations, division between the wizards and the non-wizards, betrayals etc. etc. Take away the magic component and you really have a fairly regular racial-differences, humans are bad and all that, movie of the kind that Hollywood is all too eager to mass produce these days. Sure it is not as blunt, preachy and totally ridiculous as a lot of their creations but still … not the path I wanted these movies to take.\r\n\r\nAt least there are plenty of magic and beasts around in this movie to make the dark and, at times, boring story a bit more compelling. The magic and the beasts, i.e. the special effects, are really the most enjoyable part of this movie.\r\n\r\nI was not too keen about Newt already in the first movie and he is not any better in this one. He is simply too nerdy and insecure for my taste. I prefer main protagonists that are more assertive and active. Having said that he is still a likable chap in general. Queenie is still annoying as hell though.\r\n\r\nI was very positively surprised by Johnny Depp as Grindelwald though. I was not at all sure that his normal half crazy and comical acting style would make for a good main bad guy. However, he worked very well in the role. \r\n\r\nThe end is pretty much a big cliffhanger and not exactly on a good note. This is actually a fairly sad movie overall which is perhaps one reason that I, personally, did not feel overly impressed by it. That is not too say that it is not a good movie. It is just that is is not the kind of story I hoped for.", "created_at": "2018-11-30T10:30:16.248Z"}, {"movie_id": 338952, "review_id": "5c050a7b92514110800c270d", "author_rating": 6.0, "review_text": "The first Fantastic Beasts movie was excellent. It was a bright and magical adventure. This one is going down another path and I cannot say that I was overly thrilled by that.\r\n\r\nThis movie is putting emphasis on political machinations, division between the wizards and the non-wizards, betrayals etc. etc. Take away the magic component and you really have a fairly regular racial-differences, humans are bad and all that, movie of the kind that Hollywood is all too eager to mass produce these days. Sure it is not as blunt, preachy and totally ridiculous as a lot of their creations but still … not the path I wanted these movies to take.\r\n\r\nAt least there are plenty of magic and beasts around in this movie to make the dark and, at times, boring story a bit more compelling. The magic and the beasts, i.e. the special effects, are really the most enjoyable part of this movie.\r\n\r\nI was not too keen about Newt already in the first movie and he is not any better in this one. He is simply too nerdy and insecure for my taste. I prefer main protagonists that are more assertive and active. Having said that he is still a likable chap in general. Queenie is still annoying as hell though.\r\n\r\nI was very positively surprised by Johnny Depp as Grindelwald though. I was not at all sure that his normal half crazy and comical acting style would make for a good main bad guy. However, he worked very well in the role. \r\n\r\nThe end is pretty much a big cliffhanger and not exactly on a good note. This is actually a fairly sad movie overall which is perhaps one reason that I, personally, did not feel overly impressed by it. That is not too say that it is not a good movie. It is just that is is not the kind of story I hoped for.", "created_at": "2018-12-03T10:50:35.835Z"}, {"movie_id": 338952, "review_id": "5c1707a4c3a36866c037fd8c", "author_rating": null, "review_text": "First of all, just like in the last movie the acting in this film is excellent but with a few exceptions. Eddie Redmayne was still excellent as Newt but I think he did a better job in the first film. Same thing with Dan Fogler who didn’t seem as funny but useless and could have just been written out of this film. But I did really like Jude Law as a young Dumbledore and Joshua Shea who plays young Newt. Joshua played younger Newt so well that he actually looked like a younger version of Eddie. Jude Law brought the same kind of attitude towards Dumbledore that we all know and love. The special effects and set designs still looked marvellous. The creatures special effects just like last time were great and looked like if we saw them in real life that’s what they would look like. The sets looked directly like they got taken directly out of a history book. Now with this film being a sequel, you would think they would fix the problems they had in the last film but for this one, they didn‘t. The main thing that bugged me was Johnny Depp. He didn’t do a good job of playing the main villain. It could be because of the writing or just because of his acting. Next is all of the subplots. I counted there are around four of them. But seeing how I couldn’t really figure out the main plot one of those subplots could have been the main plot. The last thing is the pacing in this film. Some scenes just seemed like the plot stopped for this one scene that could have just been taken out. The entire film felt really slow and only in the action scenes did it seem to pick up. At least the music was good. In the end, Fantastic Beasts: The Crimes of Grindelwald just seemed like a cash grab film. I give Fantastic Beasts: The Crimes of Grindelwald a 5.5/10.", "created_at": "2018-12-17T02:19:16.277Z"}, {"movie_id": 338952, "review_id": "5f30cf9e7739410037e7788c", "author_rating": 3.0, "review_text": "I re-watched the original _Fantastic Beasts_ today to prep for _Crimes of Grindelwald_ and it made me realise that the only reason I gave that first film a positive review was because of Queenie Goldstein. She's just **such** a sweetheart. Her character wasn't the **only** thing I liked about that movie, but without her, it still gets pushed down into Rotten. So when they took her in this one and first made her a rapist and then a Nazis, I was uh... Not exactly stoked. But that's a personal thing, and I try to, at least partially, put that aside and review on things like technical aspect. And in that Avenue, _Crimes of Grindelwald_ is an **abysmal** failure. This is not the outright worst film of the year, but it was definitely the worst one I've seen in cinemas for a long damn time. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2020-08-10T04:39:58.554Z"}, {"movie_id": 338952, "review_id": "627d35316d1bb2006635e711", "author_rating": 6.0, "review_text": "Better than its predecessor, even if I still didn't really dig it.\r\n\r\n<em>'Fantastic Beasts: The Crimes of Grindelwald'</em> has more of a vibe about it, especially early on, and is marginally better paced. Overall, though, I'm kinda split on how I feel about this second instalment. It is a definite improvement, and yet I don't have any noteworthy positives to share about it. The cast, despite names I like, are just so forgettable to me in this.\r\n\r\nAs such, I don't feel like I can give it any more than a 6/10 rating - which feels harsh, but 7/10 feels too high. With that said, I still plan to check out <em>'Fantastic Beasts: The Secrets of Dumbledore'</em>. It just needs that little extra oomph and these would be films that I'd enjoy, so hopefully that 2022 release will produce.", "created_at": "2022-05-12T16:26:25.513Z"}, {"movie_id": 338952, "review_id": "62dfa993e18e3f004e32131c", "author_rating": 2.0, "review_text": "Confused, lost, Johnny Depp always awesome. I think the days of me playing in the Harry Potter world are over.", "created_at": "2022-07-26T08:45:07.123Z"}, {"movie_id": 338952, "review_id": "63c1fd5405a5330094efa178", "author_rating": 10.0, "review_text": "Well, there was one too many twists here and I only say that because it was unnecessary. The plot would have been cleaner if they just let that one go...and don't worry, you'll know what is being mentioned when you watch it.\r\n\r\nIt would have worked in a novel, but in a screen play it just made it a bit messy and loose. And, unfortunately, that is what the critics are going to focus on. But then, J.K. is a novelist and it got a bit lost in translation from one writing style to another.\r\n\r\nBut, beyond that you have a wonderful cast and the film as a whole is delightfully fun.\r\n\r\nEddie Redmayne is once more the lead, and he does a decent job...but what is better is how generous both Johnny Depp and Jude Law were in the film. Each have, in their day, stolen a show or two. They are both fully capable of stealing the spotlight...but instead they took a step back rather than hogging any of the limelight and, as a result, it allowed for everyone involved to deliver a solid performance.\r\n\r\nIt could have easily gone the way of a Russel Crowe film with Law and Depp involved...however they didn't do the Crowe-hog and because of that the film ended up with more balance than it should have with the unnecessary plot turn.\r\n\r\nIn other-words, they helped bring it back from being truly over blown.\r\n\r\nSo what do you get? You get to walk into the weird world of Harry Potter again, and that is always fun. You get adventure and mystery and, again, that is always fun. You get decent performances and a solid (if bloated plot) and you walk away entertained.\r\n\r\nIt's worth viewing even if it is unbalanced. It's still entertaining and fun and, after all, that is the point of making a movie.", "created_at": "2023-01-14T00:54:44.741Z"}]