[{"movie_id": 380124, "review_id": "580c663fc3a368249d00931d", "author_rating": null, "review_text": "For those so-called devoted Tyler Perry fans out there wondering why it took so long to bring back their favorite sassy gun-toting grandma after a two-plus year absence from the big screen can feel some relief that America’s acerbically gray-haired Queen of Quirkiness has arrived for her latest holiday-themed shtick (following the humbug dud known as 2013’s “A Madea’s Christmas”) in the generically goofy-minded comedy horror **Tyler Perry’s Boo! A Madea Halloween**. Woefully witless and as appetizing as a box of stale Junior Mints the terribly contrived **Boo! A Madea Halloween** is a nightmarish experience and it has nothing to do with the nature of the ghosts-and-goblins seasonal spirit either. Indeed, **Boo! A Madea Halloween** screams of being a cruel trick for the mis-treat-ment of Perry enthusiasts eagerly willing to embrace this piece of throwaway holiday hokum.\r\n\r\nPerry, whose brief sabbatical leave from film-making has mainly been devoted to stepping up his various television projects, elects to go drag once again as he dusts off his frothy old ladies garb and grayish wig to bring his acid-tongued _Madea_ to life in yet another embarrassing and exhausting platform in sheer ridiculousness. The majority of Perry’s fare, whether mired in silliness or seriousness, usually has a Christian-based foundation to accompany the robust “slap-you-upside-the-head” brashness that pushes across Perry’s signature penchant for urban wayward wackiness. From a cinematic perspective the _Madea_-oriented movie franchise has been Perry’s most consistent and financially artistic enterprise for the specialized audiences that get a raucous kick out of his over-the-top shenanigans.\r\n\r\nNaturally, **Boo! A Madea Halloween** is yet another convenient excuse for Perry to reintroduce the Southern slapstick garrulous granny to another shameless round of farcical mayhem where the straight shooter oldster recycles the same old gimmick–threatening to hush the mouths of the pesky juveniles that get on her last nerve through preachy sermons and nonsensical action-packed chicanery. It appears that **Boo! A Madea Halloween** is an unlikely senior citizen _Ghostbusters_ knockoff where Perry gets to place the predictable mouthy Madea in idiotic situational “Hallelujah” high jinks. In essence, the banal boofest that is _Madea’s_ Halloween horror hoax is neither genuinely funny or refreshingly spooky but merely lame and forced in its masked mediocrity. Somehow Perry’s off-kilter Madea and her two stereotypical sidekicks in Aunt Bam and Hattie (Cassie Davis and Patrice Lovely) along with the anemic satire of a few notable frightfests past and present plus the annoying hearty-party teens add up to nothing but a smashed jack-o-lantern of random, limping cheap chuckles.\r\n\r\nIn addition to snuggling up to the ballistic and bespectacled Madea’s busty bra and house dresses Perry assumes the role of Brian, a worrywart father trying to contain the hormonal tendencies of his 17-year old daughter Tiffany (Diamond White). In general, Brian’s pretty offspring and her equally fetching friends are curious about attending the Upsilon Theta Fraternity Halloween bash where you guessed it…the scene where touchy-feely hot college guys are there for the taking. Brian’s fatherly instincts is to shield Tiffany and her tag-a-long vixens from that male meat market on campus. Since Brian cannot guard Tiffany due to a business commitment he recruits honorary “warden” Madea, the aforementioned Aunt Bam and Hattie (along with Perry’s other persona in Joe) to watch over the tempting teen to ensure that she stays put in the household. Obviously it is going to be a task for the determined Tiffany to sneak away from the intrusive elders keeping a watchful eye on her. The unflappable Madea and her Preparation H posse are challenged by restraining the young beauty as she attempts to apply an assortment of pranks and other methods of distraction to throw off her geriatric guardians.\r\n\r\nOf course Tiffany is successful in eluding Madea’s clutches and ends up at the Halloween bash after all. Thus, Madea and her old school associates realize the girl’s deception and schemes to snatch Tiffany away from the high-wire costumed event hoping to return her home before Brian learns what has happened in their failed mission to keep Tiffany home-bound. Not only is Madea and her “back-up muscle” in Aunt Bam and Hattie not effective in retrieving Tiffany they bring additional chaos and confusion to the frat house in the process. Madea is dismissed from the Halloween frivolous function but not before the fraternity decides to get even with the elderly loudmouth party-pooper and her aged minions. Madea and her rowdy team are not only in hot water with the miffed mob of fratboys and their guests but she must battle the array of creepy agitators in ghouls, zombies, killers and other ominous spirits looking to tame matured wily women\r\n\r\n**Tyler Perry’s Boo! A Madea Halloween** is nothing more than an aimless, gaudy goosebump of a farce that does not care to incorporate any kind of consideration for the Halloween celebration other than to serve as a shoddy showcase for Perry to parade out the insufferable Madea as well as other degrading characterizations in this relentlessly toothless romp. Perry’s paper-thin direction and scripting is lazy, uneventful and just plain stillborn in conception. The cockeyed camaraderie among Perry’s Madea, Davis’s Aunt Bam and Lovely’s Hattie is synthetic and mindless. The thought of these Halloween-havoc hags engaging in pseudo side-splitting discussions that range from whipping misbehaving minors to the legalization of marijuana comes off as desperately hapless for the sake of the transparent humor. Also, the continual religious-minded exclamations by Madea convincingly overstay their welcome.\r\n\r\nOne never gets the idea that the formulaic Boo! cannot just settle for a side dish of minimal jolts and jumps and just leave it at that level. Unfortunately, Perry lets this myopic material feel labored in its lackluster nuttiness while regurgitating the same old Madea’s incredulous tics highlighted by nonsensical yelling, cringe-worthy bugged-out eyes and carefree slapping. The only ones that come off rather plausible in this comedic crappy costume caper is White’s spoiled brat Tiffany and her on-screen galpal Aday (played by Liza Koshy). Otherwise, this dismal bump-and-jump laugher nary registers with crude grandma cursing, tepid off-balance jokes, weak sight gags, meathead himbos and vapid bimbos, stunt casting (YouTube sensation Yousef Erakat), servings of “Oh Lord” exasperation and trendy inclusions of the day (twerking movements and creepy roaming clown sightings that have dominated the real-life news as of late).\r\n\r\nSure, _Madea’s_ sophomoric antics have amassed an inexplicable following in the past but this tired and empty-headed retread is simply going through the makeshift motions.\r\n\r\n**Tyler Perry’s Boo! A Madea Halloween** (2016)\r\n\r\nTyler Perry Studios\r\n\r\n1 hr. 43 mins.\r\n\r\nStarring: Tyler Perry, Diamond White, Cassie Davis, Patrice Lovely, Yousef Erakat, Liza Koshy, Bella Thorne, Lexy Panterra, Andre Hall, Brock O’Hurn\r\n\r\nWritten and directed by: Tyler Perry\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Comedy\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-10-23T07:26:55.316Z"}]