[{"movie_id": 336804, "review_id": "573762d59251411518000d19", "author_rating": 7.0, "review_text": "> The clash of culture and modern lifestyle.\r\n\r\nThis is a Turkish film with the Turkish cast and crew, but financially co-supported by France. So it was nominated for the 88th American Academy Awards to represent France, after the Turkish film board denied to pick it. The film is set in the rural that tells a story of five young orphaned sisters who were raised by their stereotype grandmother and strict uncle. It depicts how those girls grow up without the parental supervise which is more essential than under others care and challenges they face due to difference between modern lifestyle they want to adopt and old traditions they inherited.\r\n\r\nI know everybody comparing it with 'The Virgin Suicides' and so I thought the same because that's what everyone thinks who had watched these two films. There are some similarities between these two titles, but not the same film, that's very clear. Because of the cultural difference they slightly drew a different storyline, other than that the core of the story remained same. Written and directed by a woman filmmaker, so the narrative was very good that details the issues surrounding women. Especially about the impact of the lives when people nose into others affair.\r\n\r\nIt opens when the five sisters were punished by their grandmother after the report came from their neighbour lady for them playing on the beach with the boys. Thereafter their life changes and day by day their happiness declines for the severely imposed rules against them in the house. Later, one after another, they all forced to marry the groom they have chosen for them in a traditional way. But the youngest among them all is the most rebellious, so when her sisters were enforced, she plans to fight back and that's the remaining story that tells what happens with the remaining sisters.\r\n\r\n> \"I don't care about the match, I want to get the hell out.\"\r\n\r\nThey say Turkey is more a Europe than the middle-east, except being an Islam nation. But this film briefs the domestic abuse in the name of culture and religion on the young generation. The truth is, there is an upcoming culture of the future among the youngsters of the human earthlings in the line of one planet, one culture. That is nothing, but getting themselves free from the thousands of years old rules. Obviously, in this advanced science and digital world, they're completely outdated, especially islam is struggling to cooperate with the future world. From that perspective, this film narrated a wonderful, an eye opening tale.\r\n\r\nI have heard the Turkish origins who had watched the film arguing about what it depicted is not true. I know that they know better than me on this, but what I want to tell is that any nation and its people go through this kind of cultural struggle/revolution. Especially in the remote places who are cut off from the modern lifestyle in their daily routine, and when the chief of the house is an elder person who is very conservative. Whatever the advanced country is Turkey among other islam countries, there's still the gender equality issue's persist due to the religion. Of course not the whole nation, but among the orthodox families. That's the same fate of other nations and its religion as well that has to change.\r\n\r\nI have seen many Turkish films and this was very different from those, especially it digs on the positive and negative impacts of the old cultural practice which questions is it really necessary to carry on in this modern world? I am not a religious person, and I have no problem with the people of faith, but my take on this might really irk them. The elders should give chance to choose what their youngsters want, of course with supervised, instead forcing them to do everything in the old way what they and their parents did decades and centuries ago.\r\n\r\nYep, the film deserved it's Oscars nominee, but it did not win the prestigious award and that's okay because a better film bagged it. This director is going to have a great future in the filmdom, like the next Sofia Coppola. I hope her next work would be an international project. In the meantime, if you haven't seen it, give it a try, it is a good film that briefs in the line between the past and the future, there is present that ever exist where everything happens like the pains of the past, the present revolution and the future plan.\r\n\r\n7/10", "created_at": "2016-05-14T17:39:33.826Z"}]