[{"movie_id": 756999, "review_id": "62b6aa269566580052bd4211", "author_rating": 7.0, "review_text": "The thing about adapting a short story for cinema is that we tend to get a great deal of padding to get it to the duration. This film is certainly guilty of that, with the first half hour spent on way too much character establishment that really has very little to do with the gist of the story. Once it does get going though, it's a cleverly crafted and well put together scary movie centred around \"Finn\" (Mason Thames). Bullied at school, he is protected by his friend \"Robin\" (Miguel Cazarez Mora) until he disappears. He isn't the first child to disappear either, indeed five from this small community have gone missing over the last few weeks. \"Finn\" is walking home after school when he encounters a man who has dropped his groceries. Offering to help, next thing he knows he is in a grubby basement with only a soiled mattress and a disconnected phone on the wall. His mask-clad captor - who has something of the \"Joker\" about him - insists he is in no danger, but the phone on the wall starts to ring and the callers - the other five victims - warn him otherwise, and help him to try to best his nemesis. There are one or two jump moments, but mostly there is an effectively accumulating sense of menace well fuelled by confident efforts from Thames and his sister \"Gwen\" (Madeleine McGraw) who might have inherited her mother's ability to see the future in dreams - a skill that may prove vital in helping the police save her brother from certain death. There are violent undertones, but very little actual violence is shown as the young man comes to terms with some of his own demons and to try to escape. The last ten minutes redeem it well, and there is something distinctly satisfying about the conclusion. Scott Derrickson has provided us with one of the better Blumhouse dramas of recent years that is sure worth a watch.", "created_at": "2022-06-25T06:24:38.927Z"}, {"movie_id": 756999, "review_id": "62b8e8312e2b2c031ceb6121", "author_rating": 7.0, "review_text": "With supernatural dread lifted directly from the likes of _Stir of Echoes_ and _The Sixth Sense_, _The Black Phone_ features a breakthrough performance from Madeleine McGraw while Ethan Hawke’s hauntingly memorable turn as The Grabber is felt in a hair-raising sense; like someone who has unknowingly snuck up behind you and waits in your peripheral for that dramatic reveal. _The Black Phone_ is a solid, pulse racing horror film that packs a punch, but seems like the type of film that simply won’t be as delectable on repeat viewings.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Black-Phone-2022-Review-A-Juvenile-Curtain-Call-of-Death", "created_at": "2022-06-26T23:13:53.642Z"}, {"movie_id": 756999, "review_id": "62b9b027229ae21212d3dc5c", "author_rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-black-phone-spoiler-free-review\r\n\r\n\"The Black Phone carries a horror premise with a supernatural touch full of potential, but it plays too safe by betting on a narrative that's too simple, predictable, and repetitive.\r\n\r\nScott Derrickson elevates his work with a distinct style, and the fact that the main focus belongs to the protagonists development rather than on generic jumpscares pleases me.\r\n\r\nMason Thames and Madeleine McGraw are, without a doubt, the most impressive elements of the entire film, delivering two of the best performances by young actors of the last decade. Ethan Hawke is underused, just like his unexplored character.\r\n\r\nI recommend it, but personally, I expected something more creative.\"\r\n\r\nRating: C+", "created_at": "2022-06-27T13:27:03.951Z"}, {"movie_id": 756999, "review_id": "62c4419a2da84606af361e6d", "author_rating": 8.0, "review_text": "The Black Phone is a paranormal abduction thriller that balances the tension/despair of being trapped and the ghost elements very well. The movie does a great job setting up the main characters in the beginning that gives you a relationship with them and genuine desire for them to succeed. There are a few plot points that are a little questionable, but are they are minor nitpicks and didn’t pull me out of the story too much. The performances all around were great. Ethan Hawke does fantastic in his limited screen time. He conveys the mental state of the Grabber with such nuance, it really makes the hair on the back of your neck stand up. The children do very well too, especially in the more emotionally heavy scenes. A few of the classmates performances in the beginning were a bit awkward.  Overall, I had a great time with this movie and it is a testament to the directors and writers that they could adapt such a creative thriller from a short story.\r\n\r\n**Verdict:** _Great_", "created_at": "2022-07-05T13:50:18.078Z"}, {"movie_id": 756999, "review_id": "62dd0c8f5ca7040b29901658", "author_rating": 1.0, "review_text": "I had to abandon this very early on, as I couldn't see anything. I'm pretty sure it was daytime, because kids were going to school, but it was so darkly lit that it looked like late dusk. I think there was a sun in the sky, but it might have been a firefly. I put my TV on \"vivid,\" but it couldn't remedy the problem. Maybe there's a good movie in here, but the production is clearly broken, so if you have an HDR TV, you won't be able to see anything.", "created_at": "2022-07-24T09:10:39.351Z"}, {"movie_id": 756999, "review_id": "62f89eed724de1007a0160e7", "author_rating": 8.0, "review_text": "THE BLACK PHONE is a haunting and suspenseful new thriller starring Mason Thames, Madeleine McGraw, and Ethan Hawke, and directed by Scott Derrickson.\r\n\r\n13-year-old Charlie is kidnapped by a child murderer and locked in a soundproof basement. The previous victims of the killer start calling Charlie on an out-of-service phone. These chilling calls give the boy a chance to save himself and others from the killer's clutches.\r\n\r\nTHE BLACK PHONE is suspenseful and scary without the need to have onscreen violence (the violence is mostly off-screen). The cast is excellent, particularly Thames and McGraw, who both give standout performances. Thames is particularly convincing as the terrified boy who is trying to make sense of the situation he's in. Hawke is also chilling as the killer, though his character is not as fleshed out as I would have liked. The movie is well-made and well-acted and has a solid story with some creepy moments — and the length is exactly right. An enjoyable addition to the genre.", "created_at": "2022-08-14T07:06:21.556Z"}, {"movie_id": 756999, "review_id": "62feac0f6a3448007a2a7754", "author_rating": 6.0, "review_text": "Had some decently suspense-filled moments and Ethan Hawke was great but otherwise I found most of this pretty forgettable, yet still worth watching as a rental. **3.25/5**", "created_at": "2022-08-18T21:15:59.061Z"}, {"movie_id": 756999, "review_id": "63001a6abb2602008ebd6add", "author_rating": 7.0, "review_text": "**Not quite a full-on horror movie but a well-done creepy thriller.**\r\n\r\nI love a good Blumhouse flick (and honestly, I love the bad Blumhouse flicks too). Thankfully The Black Phone is the former. Even though it’s more thriller than horror, The Black Phone is an eerie story that keeps the tension high. I was worried with the subject matter that Scott Derrickson could take things too far and into some tasteless places, but instead, the plot was intense and satisfying.", "created_at": "2022-08-19T23:19:06.113Z"}, {"movie_id": 756999, "review_id": "6307016518864b0080e35e3b", "author_rating": 8.0, "review_text": "Excelente Película, sin duda la volveria a ver de nuevo", "created_at": "2022-08-25T04:58:13.994Z"}]