[{"movie_id": 866, "review_id": "5ea13db50b5fd6001a813acc", "author_rating": 10.0, "review_text": "He is the irrepressible spirit of youth.\r\n\r\nUnder pressure due to his success, in a token socialite marriage, playwright J.M. Barrie is less than enamoured with his lot. Then whilst out walking his dog in Kensington Gardens, he meets widowed Sylvia Llewelyn Davies and her four young sons, George, Jack, Peter and Michael. It is the start of a long lasting friendship that revitalises Barrie and brings about his masterpiece, Peter Pan.\r\n\r\nOK, lets get the grumble out the way, you know the one, the one that so many are quick to mention. No this is not a definitive take on J.M. Barrie and this time in his life. Much like Allan Knee's play, \"The Man Who Was Peter Pan\", from which this is adapted, there are liberties taken and it's most definitely chronologically unsound.\r\n\r\nBut this is not a biography is it? This is basically asking what sort of man conceived the magical world of Peter Pan? It's a celebration of childhood, life, whimsically asking us if it's wrong to keep the inner child in us all locked away as adulthood takes control? A tale of comedy blended with tragedy, from which glorious art is born to live long and forever, the kind that will be touching generations long after we have left this mortal coil.\r\n\r\nElegantly crafted by director Marc Forster and his screenwriter David Magee, Finding Neverland could so easily have given way to over sentiment and floundered in the search for emotional kickers. Yet it doesn't because Forster (immeasurably aided by the lush cinematography by Roberto Schafer) has created a quaint Victorian world, a world where fantasy is never far away. What emotion is here (and there is lots of it) sits perfect within this setting. We are actually being asked to be Barrie himself, the makers daring us to not be swept up in the magic being born. Wonderful, wonderful stuff.\r\n\r\nJohnny Depp is perfectly cast as Barrie, delicately fusing childish playfulness with inner sorrow, Depp doesn't put a foot wrong. It will be a crime if this multi talented actor doesn't finish his career with the highest acting honour on offer, the Academy Award for Best Actor (nominated three times, including this performance), it's practically impossible to imagine another actor in this generation nailing the role of Barrie like Depp does. Playing off him expertly is Kate Winslet as Sylvia, raw and honest like, it's emotionally driven and gnaws away at the audience's heart strings. Yet it's young Freddie Highmore as Peter that steals the show. Very much the film's heart, his relationship with Barrie has a grace about it, with Highmore (just 12 at the time) able to portray a subtle tenderness that drives the relationship forward.\r\n\r\nNominated for seven Academy Awards (including Best Picture), Finding Neverland won just the one for Jan Kaczmarek's poignant score. It matters not, because to me at least, this will forever be a personal favourite film. Something that just like Peter Pan himself, will never ever get old. 10/10", "created_at": "2020-04-23T07:03:17.308Z"}]