[{"movie_id": 14873, "review_id": "5f10b1ab6dea3a0035f19ab9", "author_rating": 4.0, "review_text": "Decent watch at best, won't watch again, and can't recommend.\r\n\r\nImmediately, you can tell there is a dip in the quality of animation.  To be fair, no only is this in that string of unnecessary sequels that Disney did, it is right after they switched from classic cell animation to digital cell animation, but it was 2 years after \"Atlantis: The Lost Empire\" and that looks amazing.\r\n\r\nThe other immediate problem (even on the cover) is that Mowgli is still wearing his mystery diaper (never established where it came from) instead of actual clothes.\r\n\r\nAs Mowgli struggles with being of two worlds (an arguably great point from the original movie), he extends his entitled behavior to returning to the Jungle, aggravating the village, as Sher Khan returns to hunting Mowgli, extending his obsession / pride (sort of a Moby Dick thing).\r\n\r\nLacking some creativity, they return to some of the old songs (3 that I can think of, \"Bear Necessities\" and \"Jungle Rhythm\" being over used, and \"I Wanna Be Like You\" at the credits of all places) instead of using original material.\r\n\r\nAs the adventures continue it's reveal that Mowgli had no natural connection to the animals, it's just that EVERYTHING speaks English, the other human characters don't bat an eye or lose a beat.  It completely ruins the movie.  At least in Tarzan it was clear he would \"ooh ooh\" to the Guerillas.  What little charm they were able to drag from the previous movie to this one is just destroyed by that.\r\n\r\nThe dramatization of Mowgli's endangerment also has a lesser impact this time, as he's survived before, and this time around we also have 2 other hapless children running about the Jungle who must have been blessed with invincibility to survive all that they do.\r\n\r\nI'm not saying there isn't something to enjoy here, but there is a lot more that I didn't, and there are far too many other movies to see.", "created_at": "2020-07-16T19:59:39.893Z"}]