[{"movie_id": 399055, "review_id": "5a6939e00e0a260d71009407", "author_rating": 7.0, "review_text": "Not just a love letter to the Creature from the Black Lagoon, but to cinema itself. Del Toro's _The Shape of Water_ is the \"Who is the real monster?\" question taken to the nth degree, with some some fascinating side-concepts that are explored just enough to be worthwhile. At the end of the day _The Shape of Water_, at its most stripped back, is a movie about fucking a fish. But it's the kind of movie about fucking a fish that should also probably win the Academy Award for Best Picture.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-01-25T01:58:56.845Z"}, {"movie_id": 399055, "review_id": "5ac9375dc3a36834d404de30", "author_rating": 7.0, "review_text": "GDT's first truly great flick. The R-Rated Family Movie schtick always came off as silly or had a story too dull to carry its own weight. Characters and morality are two dimensional; the world functions via cartoon logic. But the love story here is precious. Could be argued it's an apologist film for zoophilia, considering the amphibian shows little intelligence beyond that of a dog.", "created_at": "2018-04-07T21:25:49.850Z"}, {"movie_id": 399055, "review_id": "5c201a0d9251411abcbfdf68", "author_rating": 6.0, "review_text": "Bend me, shape me, anyway you want me!\r\n\r\nGuillermo del Toro directs and co-writes with Vanessa Taylor what would turn out to be the Best Picture Academy Award Winner for 2017. A much loved film that's not without dissention in certain quarters, it's a picture that warrants dissention but it should be noted that just because someone doesn't like it, that doesn't make it a bad film. I'm certainly in the camp that finds it over praised, even annoyingly disappointing, whilst appreciating many of the facets within its production.\r\n\r\nStory in simple terms is a Beauty and the Beast like fable where Sally Hawkins' mute cleaning lady Elisa Esposito falls in love with a captured Amphibian Man. Amphibian Man is known by the government types as The Asset, and as the Cold War rises and 60s paranoia takes a hold, the American big wigs want to vivisect the special species to learn from it. Elisa, after courting \"The Asset\", enlists the help of close friends and plots to free the creature from its captivity in the underground medical bunker labyrinth place.\r\n\r\nNow as simple as that sounds, there is more to it than that, del Toro and Taylor whilst enveloping the pic in a fantasy realm feel, ensure messages are thrust hard at the viewers. Be it the racial disharmony, the quest for different walks of life finding love with each other, the cry for humans to stop being bad and killing things because they don't understand them, torture is evil and etc etc. It's all right there in your face and we get it. So plot maybe simple but for sure there's a lot being said in the narrative.\r\n\r\nYet as great as it looks, and it's superbly acted by Hawkins, Michael Shannon, Richard Jenkins and Octavia Spencer, it just to me loses its way come the mid-point, getting daft and even getting a little icky into the bargain. I have no problem with improbabilities and outrageous contrivances here, this is del Toro painting one of his fantastical worlds - only on Earth in the early 60s! But the pay off is poor, hinging on a twist that's not only ridiculous, but insulting as well because otherwise the pic would be very troubling indeed. No art deco eye orgasms or vibrant characterisations can compensate for a film that runs out of steam.\r\n\r\nThat said, I was glad to have watched it, there's even a possibility I could return to it in the future - this is very good film making. But it's not a great film by any stretch of the imagination and not for the first time in the Academy's long history, many are baffled by their choice of Best Picture winner. 6/10", "created_at": "2018-12-23T23:28:13.587Z"}, {"movie_id": 399055, "review_id": "6379e289fab3fa00cd1077c6", "author_rating": 6.0, "review_text": "**It's a good movie, but not as good as I was expecting.**\r\n\r\nI don't know many Guillermo del Toro movies, but I imagined this movie to be a little similar to “Pan's Labyrinth”, a work that I really liked. So I sat down to watch it with some anticipation. When it ended, I didn't feel cheated, but I also don't think it's any better than that other Del Toro film, despite the greater media attention and professional criticism. It received four Oscars (Best Film, Best Director, Best Production Design and Best Soundtrack).\r\n\r\nThe film begins by introducing us to Elisa, a mute cleaning lady who works in a high-security Army facility, where there are military laboratories and workshops, and where a marine creature caught in the Amazon River ends up being arrested. The creature quickly becomes close to Elisa, who falls in love with that being. When it becomes obvious that the military is going to kill him, Elisa decides to save his life and give him back his freedom.\r\n\r\nThe film is quite surreal and dreamlike, and that for me was something very positive. I really liked the creature, and the design given to it, and I think that the characters and dialogues were written and conceived in a very detailed and thorough way. Unfortunately, the film has too much explicit nudity to be a family movie, and there are also some shocking and violent scenes that are not strictly suitable for children or sensitive people.\r\n\r\nThe cast leaves us, in general, a very well-executed job. Sally Hawkins manages to be convincing in the role she plays and leaves us with an excellent performance. I also really liked Octavia Spencer and Richard Jenkins, who brought to life the only friends the film's protagonist really had. Michael Stuhlbarg also handled the challenge at hand quite well, even if he doesn't have a lot of time to do much of it. The actor who turned out to be the weakest here was Michael Shannon. He wasn't able to make his villain really threatening and cold. Instead, he turned him into an insecure, fake, and aggressive individual who uses his profession to humiliate and demean others.\r\n\r\nWe all know that Del Toro's films tend to have a lot of style, and a strong style, with a very personal nature. This film does not escape, on the contrary: it is one of the best to see well the habits and visual signatures of the director. This is the case of cinematography and the color palette that was used, and where green, in various shades, has a great ascendant. Set in the 60s, the film has several sets and period cars and this works very well, as well as the costumes, highlighting here, of course, the aquatic monster costume. All the visual effects worked reasonably well, and the characterization team also deserves praise for their work with Doug Jones. The soundtrack, signed by Alexandre Desplat, was also excellent and quite unusual.", "created_at": "2022-11-20T08:17:13.610Z"}, {"movie_id": 399055, "review_id": "63bba5e4aede590085207e79", "author_rating": 8.0, "review_text": "Just finished watching this movie and despite the other critical reviews I enjoyed it!  No I don't think it deserved the BP Oscar but it is the kind of movie that I will be watching again in time! David N.", "created_at": "2023-01-09T05:28:04.170Z"}, {"movie_id": 399055, "review_id": "63c20c7817b5ef00d360b228", "author_rating": 10.0, "review_text": "My girlfriend and I called it \"the Fish F***er Movie\" and that is really what it is...but it's also green, very, very green.\r\n\r\nEver wondered how Abe from Hellboy had sex? Well this movie explains it.\r\n\r\nBut honestly, it isn't bad. It's a total period piece. It's beautiful, I mean it is very beautiful, and it has a story.\r\n\r\nBut, yeah, the thing about it is that it's beautiful AND has a story. The English Patient, Brokeback Mountain, they were just beautiful and beauty alone with no story behind it is boring. The Fisk F***** Movie had both.\r\n\r\nAnd, yeah, the story is something we are used to. It was the good, friendly monster that had to be rescued by the mean nasty government plot and, especially if you are a child of the 80s, it works. It's a plot that we've seen over and over again...only in kids movies.\r\n\r\nThis Fish F***er movie, the plot is made for adults, so less adventure and fart jokes and a lot more beauty slightly deeper issues, issues that equate homosexual and racial issues to being the outsider that matters...in the right way. Not the immature and racist way that we see in Black Panther and Get Out...\r\n\r\n...so it's refreshing to see that handled subtly and politely and still make the point.\r\n\r\nSubtle and polite hardly go hand in hand with a serious point now days.\r\n\r\nThe Shape of Water was able to hint at a point, still entertain, and, well, do it in a way that was so beautiful it was mesmerizing.", "created_at": "2023-01-14T01:59:20.340Z"}]