[{"movie_id": 60308, "review_id": "5682454cc3a3684be3013d21", "author_rating": 6.0, "review_text": "A movie done to the size and skills of Brad Pitt. The story is interesting enough and is well driven and directed. Hill does a good job, mostly because nobody had seen him doing a serious role before.", "created_at": "2015-12-29T08:33:16.407Z"}, {"movie_id": 60308, "review_id": "5c04fe230e0a26486607d175", "author_rating": 9.0, "review_text": "Sporting Economics\r\n\r\nI have no affinity to Baseball as a sport, I'm British you see. I tried to get in to it when British cable networks began showing it, but it never grabbed me. My only contribution to any conversation about the sport is that I support The Cleveland Indians because of the film Major League, a film that continues to make me laugh to this day.\r\n\r\nI was intrigued by Moneyball, synopsis tantalisingly offering up a sports success story based on an improbable blend of maths (something I hate with a passion), guile and perceived misfits as a team. Sure enough, after viewing Moneyball it has landed joyously onto a personal favourites list.\r\n\r\nUnsurprisingly, when digging into the actual facts of the Oakland Athletics 2002 season at the core of the story, I found truths stretched, some character portrayals toyed with, and omissions to round out a better story. But crucially, the key element here is the moulding of a team for what in Baseball parlance is financial peanuts. This makes their 20 game wining run as being an outstanding achievement.\r\n\r\nThe mathematical aspects of the story are easily explained via the interactions of General Manager Billy Beane (Brad Pitt) and his economics right hand man Peter Brand (Jonah Hill). Baseball operations behind the scenes are given fascinating clarity via the tremendous screenplay (Steven Zaillian and Aaron Sorkin). And ultimately the blend of on field action, family relationships and team assembling flows beautifully as one.\r\n\r\nIn turn punch the air brilliant with heart tugging worth, and brainy into the bargain, Moneyball most certainly a film non Baseball fans can watch and maybe love for bringing something new to the sports movie table. 9/10", "created_at": "2018-12-03T09:57:55.450Z"}, {"movie_id": 60308, "review_id": "5fa5a2c75aadc4003f8121e5", "author_rating": 2.0, "review_text": "BORING watch, won't watch again, and do not recommend unless you're both a baseball and a statistics or financial business fan.\r\n\r\nWith Jonah Hill, Chris Pratt, Brad Pitt, and Philip Seymore Hoffman, I thought it would at least be interesting if not entertaining.\r\n\r\nAs the movie begins and it is clearly about Baseball, I at least hoped it would be done in a fun entertaining way.  I guess Jonah Hill got tired of being stereo-typed as \"fun\".\r\n\r\nI know 1 guy that would probably get great pleasure out of this movie as a fan of baseball statistics, and if I didn't know about that 1 guy, I wouldn't have any clue why this movie was made.\r\n\r\nI can't express this enough: this movie is about cold hard numbers and how they can be manipulated to impact real people in the world of baseball.", "created_at": "2020-11-06T19:23:51.760Z"}, {"movie_id": 60308, "review_id": "62e2db2bdf857c005a889d73", "author_rating": 6.0, "review_text": "**A good behind-the-scenes movie about baseball.**\r\n\r\nIn general, sports-themed movies are not strictly my piece of cake, I prefer to see other things. But this film already had an interesting list of award nominations, which includes six Oscars (Best Film, Best Adapted Screenplay, Best Actor, Best Supporting Actor, Best Editing and Best Sound Mixing) and three BAFTA, with in none of these cases it came out victorious. And the truth is that there are a lot of very good films in which the theme is sport.\r\n\r\nThe theme of this film is quite simple and, however, very well-used: the director of a medium-sized baseball team finds himself in the need to recruit new players and, to a certain extent, compete on an equal footing with stronger teams. and with more money in their pockets to spend. In order to balance things out, he rethinks the entire team's strategy, from the way they recruit and evaluate players to what goes on the pitch. Therefore, it is a movie about baseball, but with very little action and game played, which is not exactly what sports movie fans prefer. I personally liked it, because it gives us an idea of ​​what goes on behind the scenes of these high competition teams, in the offices and in the dressing room. And it was interesting to see how math, statistics and number analysis can be decisive in choosing certain players and game strategies. A subject of little interest, which seems dry and too technical, has thus become an excellent screenplay.\r\n\r\nBrad Pitt is a good actor and uses all his charisma and presence in this film. The actor is able to lead and guide us through the entire film and ensures a very satisfactory performance throughout the entire production. Also, Jonah Hill does a pretty good job as a creative mathematician who seems to be in the least likely position for a numbers man. On the other hand, I didn't particularly like Seymour Hoffman's work on this film. I think the actor was not given material to match his abilities and had little screen time and very little to do. So it's not the actor's fault...\r\n\r\nThe direction of Bennett Miller does a generally decent job, and ensures a very good pace to the film, with a dynamism that prevents the film from falling into the doldrums. The cinematography is very sharp, dynamic and colorful, and the sets are very good, especially the countryside and the bathhouses, with all the details. The sound effects are quite good, and the soundtrack is discreet but competent.", "created_at": "2022-07-28T18:53:31.791Z"}, {"movie_id": 60308, "review_id": "63815aed0cd32a00830dce59", "author_rating": 8.0, "review_text": "**Moneyball hits a home run with remarkable directing and performances and an intriguing true story that drastically changed everything for the sport of baseball.**\r\n\r\nMoneyball is as brilliant and interesting as a sports movie gets. Bennett Miller's genius use of the film's score enhances the emotion and tension by letting the film's most intense moments hang in silence. As a result, the audience feels a more profound impact from those scenes and the relief when the score returns, signaling hope and resolution. Miller also uses Brad Pitt's greatest strengths as an actor by providing plenty of playful banter and clever exchanges between his character and the various players, managers, and staff. Pitt's powerful emotion shines brightest in the scenes with his character's daughter showing a struggle to hide his fear for his future and ability to provide for his family while standing for what he believes. I am not really a baseball fan, but this movie is compelling! The fact that this is a true story only makes it better. The directing, acting, writing, and story are all exceptional. Moneyball is a winner!", "created_at": "2022-11-26T00:16:45.577Z"}]