[{"movie_id": 68735, "review_id": "5804e4e292514148280001b2", "author_rating": 7.0, "review_text": "I really was expecting very little from this movie, but I was surprised. Good action and quite a decent story. Not all fresh, but well put together.\r\n\r\nI think the biggest pity is the lack of talent of Fimmel. He learnt how to perform for Vikings and he lays another flat copy of the same character.\r\n\r\nPositive points to the very good OST by Djawadi.", "created_at": "2016-10-17T14:49:06.090Z"}, {"movie_id": 68735, "review_id": "58092361925141102800c0ad", "author_rating": 9.0, "review_text": "Even if you have never played \"Warcraft\" or \"World of Warcraft\" before,\r\nI think you will like this movie. It has a great story, good acting &\r\nis visually stunning. The special effects are not over the top, but are\r\nvery good & believable. Do yourself a favor & don't think of this a\r\nanother \"video game movie\", see it & you will love it & want another to\r\nbe made. I hope this turns this into a great franchise, there are too\r\nmany good stories in the \"Warcraft\" universe waiting to be told on the\r\nbig screen.  Some non WoW fans might have a hard time following the fast paced story, but watch it again if you missed it & you will understand it more. I think there could have been a bit more character development & the addition of a narration track might help non Warcraft fans understand a little better, I hope they will do a little better on the sequel.", "created_at": "2016-10-20T20:04:49.382Z"}, {"movie_id": 68735, "review_id": "580e4943c3a36859b1001b6e", "author_rating": 8.0, "review_text": "**One fights for their new home and the others to defend theirs.**\r\n\r\nI never played Warcraft game in my life, nor read comic book, but I enjoyed this new fantasy universe. Azeroth is the world where this story takes place. When the Orcs planet was destroyed, they use a magic portal to get to Azeroth and make a safe home. But that is where humans and other intelligent species live peacefully. A new race means a new conflict to solve the differences. So the battle commences at no time to gain the power to rule the land. Between the two great powers, who wins is the film to tell us in the rest of the parts.\r\n\r\nIt was something like 'Avatar' and 'The Lost of the Rings' coming together. Despite having alien race, it is very much an action- fantasy film, not a sci-fi. From the games to film, it was awesomely made which is obviously a latest trend in the filmmaking. The graphics were good, but not perfect, and that's fine, because it succeeds to give the game look than the realistic one. I think that's the point, otherwise no disgrace to call it was inspired by the games or comic book.\r\n\r\nI know it is not a masterpiece like 'The Lord of the Rings', but there's a promise like the quality and story and its characters. There's no big names, but these actors who are known mostly for their supporting roles has given their best. Like I said I'm new to this Warcraft universe, so I don't know anything outside this film, but I'm kind of neutral on the war between the humans and orcs. Because one's world was destroyed and they're seeking a new home and the other ones are defending theirs. So everything makes sense from both the perspectives for their actions.\r\n\r\nThis is just a beginning, there's lot more sequels to come. Though, it's a pity that it failed in America, the native product, but internationally proved it is one of best of its kind, I mean games to screen adaptation. The director of 'Source Code' did a great job and all the actors, including those motion-capture artists. I missed Zoe Saldana in this, to be as another blue or green skinned alien specie, instead Paula Patton did well in a similar role. The character name also very similar to the one from 'Guardian of the Galaxy'. I know it's going to get even bigger in the follow-up, so I can't wait for it. Hope it will release in less than couple of years.\r\n\r\n_8/10_", "created_at": "2016-10-24T17:47:47.470Z"}, {"movie_id": 68735, "review_id": "60eae55e9824c8007fb629ab", "author_rating": 5.0, "review_text": "The beginning is confusing and poorly acted, but it gets better as it goes.  The CGI looks seamless with the live-action.", "created_at": "2021-07-11T12:34:38.912Z"}, {"movie_id": 68735, "review_id": "61cc456e8566d2001cb1a893", "author_rating": 6.0, "review_text": "A good fantasy movie, a bad video game movie (27 February 2017)\r\n\r\nThe day it premiered, me not being a wow fan or anything, i went and watched it, a mere fantasy lover who just couldn't resist not coming in contact with something new and promising. Hands down, even if i didn't know anything from this lore, through the movie i couldn't hold a grin all over my face. I don't know why maybe cause i was seeing before me a fantasy world well established. A world that probably deserved it. I left the cinema over-excited. I started playing the game, and more importantly i started reading the novels.\r\n\r\nFirst come the Rise of the Horde(RoH), describing the durotan's life, gul'dan's rise to power, the fall of draenor etc. Second would be the Last Guardian(TLG) establishing Kadhagar, Garona, Medivh and Lothar. The third one, Tides of Darkness takes place after the death of Llane and the fall of Storwind, so the movie should sit between novels 2 and 3. And it is between those that i decided to rewatch the movie, now more experienced in the World of Warcraft.\r\n\r\nTo my sadness, i was disappointed. My once 8.5/10 rating fell to 5.5. Althouth the CGI was again THRILLING, the story was honestly RAPED. Reading TLG i noticed that the movie i had watched months ago, had changed some, but damn after rewatching it, i just couldn't stand it. There were some huge changes that honestly served no reason! For example why on earth Stormwind didn't fall? or why did the alliance exist already when it should not? why Orgrim was a Frostwolf? why Lothar's character was so damn wrong?? I hated movie-Lothar! I understand that the movie being made for non wow fans too, should be changed a bit, but come on... Video game movies should be more close to the lore! Even more than book-only fandoms! And me saying that, i am twice a reader than a gamer! For one, if they couldn't make a proper movie of the coming of the horde to azeroth then they could very well start from RoH story. It has the content to support a great fantasy movie. Works that end up lesser than they should, are disappointing.", "created_at": "2021-12-29T11:24:30.422Z"}, {"movie_id": 68735, "review_id": "62b361ec245dbe06b520e48b", "author_rating": 5.0, "review_text": "I had fairly low expectations for this, and I wasn't really disappointed. Based on a highly complex game structure, the characterisations seem to be drawn from a Tolkien meets Arthurian world in which magicians, guardians, orcs, humans and Glenn Close are all vying for power. What ensues now is a pretty straightforward tale of betrayal and manipulation with a bit of romance and plenty of visual effects that must have caused no end of boredom for an almost comedic Travis Fimmel, Ben Foster, Dominic Cooper and many others who must have been dangled, stood, sat or made to pretend-fight in front of a green screen for most of the production process. The fight scenes are relentless, colourful and creative, but they all go on for far too long with each ugly great beastie trying to wrestle another to the ground in the face of some terrible green glowing eyes that are trying to impose the \"fel\" magic on the kingdom. It is not a terrible film, though it is too long, it's just all about the technology and very little about a coherent piece of entertaining cinema that could have delivered much more had the screenplay worked harder with the undoubtedly promising opportunity for fantasy storytelling.", "created_at": "2022-06-22T18:39:40.837Z"}]