[{"movie_id": 1048522, "review_id": "64fcfaa066469a011d6bc990", "author_rating": 6.0, "review_text": "Life can be so confusing at times that we really don’t know where we stand with it, other than having a clear sense that what we’re experiencing isn’t working and that we desperately need direction to help fix it. But who are we to turn to if we have few friends and no family for meaningful, helpful guidance? Peers? Co-workers? A psychiatrist? Such is the fate of Donya (Anita Wali Zada), an Afghan transplant living in Fremont, CA, a distant suburb of San Francisco and home to a large population of her country’s fellow immigrants. Having worked as a translator for the US Army while in Afghanistan, she qualified for a special exit visa program that brought her to safety in America when the US pulled out of the war-torn nation. She now holds what appears to be a reasonably well-paying, decidedly whimsical job as a writer of messages for Chinese fortune cookies, but, beyond that, she doesn’t have much of a life. She often questions (ironically speaking) the good “fortune” from which she’s benefitted compared to many of her countrymen back home, frequently experiencing difficulty accepting it and consequently suffering from loneliness and severe insomnia. But what’s causing these feelings: Guilt? Isolation? An inability to fit in (or even knowing how to go about doing so)? Or is it some of all of the above? Writer-director Babak Jalali’s latest wrestles with these issues from the perspectives of both an isolated immigrant and of a lost twenty-something merely trying to find her way in the world. And, to its credit, the film comes up with some truly brilliant insights in these regards. Unfortunately, there aren’t enough of them to make this an enlightening, finely crafted character study. Much of it meanders (especially in the second half), looking for direction through a series of inconsequentially mundane events and a failure to more fully flesh out the insights that it otherwise successfully manages to nail. The film is also sprinkled with delightfully quirky comic relief, but, again, there’s not enough of it, which is unfortunate given how well it works when it’s successfully and deftly employed. The picture’s fine performances, intriguing character development and stark but gorgeous black-and-white cinematography bolster the elements that do work. But, regrettably, this is yet another example of a film that could have used another round of script revisions and tighter editing to help bring the overall production up to snuff, a problem that seems to be plaguing a plethora of offerings these days. Enjoy what works with this one, but don’t be disappointed if you end up getting the distinct impression that it comes up short.", "created_at": "2023-09-09T23:07:12.922Z"}, {"movie_id": 1048522, "review_id": "650d4e242c6b7b00ac6f9566", "author_rating": 7.0, "review_text": "This starts off with what has to be slowest, least efficient, example of the industrialisation process that I've ever seen! Those images rather set the scene for what follows as we meet fortune cookie maker \"Donya\" (a strong performance from Anaita Wali Zada). She was an interpreter for the US military in her native Afghanistan and has arrived in California on a special visa scheme and is awaiting proper settlement. She can't sleep, so manages to inveigle an appointment with the slightly eccentric psychiatrist \"Dr. Anthony\" (Gregg Turkington) and his rather unorthodox methods manage to illicit some clues (for us) from this rather reticent woman as to what drove and now drives her. Her love life is pretty much non-existent, but a mysterious text message that sends her on a drive might just sort that out - her savvy best pal \"Joanna\" (Hilda Schmelling) reckons that it might! It's quite hard to describe this film. Precious little actually happens, and the pace is glacial in the extreme - but it still works well as a characterful study of a woman who is having to come to terms with some profound changes to her circumstances and to deal with the loneliness, guilt and frustrations - as well as the opportunities - of her new life in a city where her situation is nothing particularly unusual. It's not a dreary introspective, though. There are moments of dark humour (usually from Turkington) as he uses \"White Fang\" to a surprisingly innovative effect. The film is an episode in her life, we have some details from her past and we see a glimmer of what might be on her horizon at the conclusion. It's interesting, oddly engaging and well worth a watch. Television will do fine though.", "created_at": "2023-09-22T08:19:48.082Z"}]