[{"movie_id": 341013, "review_id": "5979eaacc3a36867fd016327", "author_rating": 8.0, "review_text": "I have seen it said of _Atomic Blonde_ that it is hollow piece wrapped in an attractive shell. I would respond by saying that \"attractive\" hardly does the shell justice, it's absolutely fucking gorgeous. Otherwise though that sounds about right.\r\n\r\nNo, in all seriousness, the plot itself is more than fine. Even the absolute worst aspects from any individual part of _Atomic Blonde_, no matter how much you pick them apart, more than pass the litmus test for minimum acceptable standard. It truly is a case of style over substance, and that is something that I can understand the complaint for. But it's style **over** substance, not style **instead of** substance. At no point did I feel that the story was cobbled together as an excuse to get to the next setpiece. The story was what it was (a pretty genuine throwback to the espionage thrillers of the late and post-Cold War era) and the aesthetic, the music, the design, was simply how that story was chosen to be delivered. And a brilliant choice at that.\r\n\r\nWalking in, I was already certain that I was going to like the film, because even if it was just an extended version of the trailer, then it appealed enough to my personal tastes that I was in for a good time. Walking out, I knew that taking everything beyond those factors into account, I didn’t just like _Atomic Blonde_, I loved it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2017-07-27T13:29:16.740Z"}, {"movie_id": 341013, "review_id": "5a703b79925141374500bbab", "author_rating": 10.0, "review_text": "This is a good solid cold war spy story with plenty of action. I have to say that I liked this movie a lot.\r\n\r\nI expected a fairly shallow over the top action flick with a sexy but not very bright kick-ass chick as the main protagonist. To my surprise I got something quite a bit more than that. Sure the movie is quite “Hollywoodish”, it is supposed to be a action movie after all, but it is surprisingly well done and Charlize Theron is great as the sexy, not at all stupid and very much kick-ass chick.\r\n\r\nAs a bit of a twist the story is told in the form of a debriefing at the MI6 headquarter. This type of storytelling can be a bit miss or hit since, unless the writer is good at it, it has a tendency to spoil the movie and the events already when the movie starts. I would say that in this one they got it right.\r\n\r\nThe movie is frequently quite dark and gritty which of course is fitting with the former East Germany setting. To my great delight they did not stoop to the usual dark, almost black and white, boring type of footage that you too frequently get. Instead the dark and gritty scenes are filmed in a “darkish” blue hue and the scenes actually have a lot of color in them.\r\n\r\nThe story is a fairly standard spy-is-given-a-mission-behind-the-wall-and-it-all-goes-to-hell one. As a story goes it is really not much to write home about and it has the usual plot holes and illogical twists. What makes this movie good is how it is implemented.\r\n\r\nAs I have already mentioned Charlize Theron is great in her role. She is sharp tongued, hot and kicks ass. Unlike many protagonists in movies like this one she not only administers pain but she receives it as well. Actually the movie starts with scenes of her showing off bruises all over her body (yes all of it).\r\n\r\nTo fill out the picture we get some brutal, and I mean brutal, KGB agents, the traitorous colleague, the defector and a few other characters. Together they embark on a roller coaster ride of spy work, chases, (brutal) ass kicking etc. All of it very well done as far as I am concerned. It is not the silly fx loaded blow-everything-up kind of action but instead up-personal-beat-them-up action.\r\n\r\nI have to say that I quite liked the end of the movie as well. The twist at the end was maybe not the biggest surprise of the year but I definitely liked it. I really do not like movies that fizzles out with a bunch of loose ends and objectives not achieved. This movie is, to my great enjoyment, not one of those.\r\n\r\nTo me this movie was really good. Certainly better than I expected.", "created_at": "2018-01-30T09:31:37.235Z"}, {"movie_id": 341013, "review_id": "6132d3ebe194b00042ffb27d", "author_rating": null, "review_text": "IN MY DREAMS I AM LORIANNE BROUGHTON, IN REALITY I AM MONA LISA VITO.  OH WELL A GIRL CAN DREAM.  CHARLIZE THERION IS ICEY COLD PERFECTION.", "created_at": "2021-09-04T02:03:23.330Z"}, {"movie_id": 341013, "review_id": "6132d3fde3fa2f0065a2b6e8", "author_rating": null, "review_text": "IN MY DREAMS I AM LORIANNE BROUGHTON, IN REALITY I AM MONA LISA VITO.  OH WELL A GIRL CAN DREAM.  CHARLIZE THERION IS ICEY COLD PERFECTION.", "created_at": "2021-09-04T02:03:41.822Z"}, {"movie_id": 341013, "review_id": "63c1f205df857c009f4434f2", "author_rating": 1.0, "review_text": "It SHOULD have been good. It is a spy movie with a basic spy movie plot. It promises double crosses and intrigue.\r\n\r\nBut it never really delivers on the suspense and tension that are the principle trope of good spy movies...and it never really delivers on the empty mindless popcorn stuffing atmosphere that are the basic tropes of action movies.\r\n\r\nSo in the end you're left with a movie that isn't tense and suspenseful enough to be \"3 Days of the Condor\" or \"The Americans\" and a movie that isn't as mindless action packed fun as James Bond.\r\n\r\nAll the elements were there, but they never seemed to pull them off. It's like that old Native American saying, \"if you chase two rabbits you'll lose them both.\" And that's really what happened here. it tried to be two different kinds of spy movie in one and never really made it into either.\r\n\r\nYou're left wondering why you bothered. Had they picked one and went whole headlong for that goal, it could have been stellar. Instead it's luke warm at best.", "created_at": "2023-01-14T00:06:29.551Z"}, {"movie_id": 341013, "review_id": "643e3b03f288380314aa955f", "author_rating": 4.0, "review_text": "The movie wasn't that good. It does have a lot of action though. Some pretty sweet fight scenes too.", "created_at": "2023-04-18T06:38:59.762Z"}]