[{"movie_id": 293660, "review_id": "56c146cac3a36817f900d5f0", "author_rating": 9.5, "review_text": "A funny movie with a romantic love story.\r\n\r\nWade Wilson (Ryan Reynolds) is a former Special Forces operative who now works as a mercenary. His world comes crashing down when evil scientist Ajax (Ed Skrein) tortures, disfigures and transforms him into Deadpool. \r\n\r\nThe rogue experiment leaves Deadpool with accelerated healing powers and a twisted sense of humor. With help from mutant allies Colossus and Negasonic Teenage Warhead (Brianna Hildebrand), Deadpool uses his new skills to hunt down the man who nearly destroyed his life.", "created_at": "2016-02-15T03:32:26.766Z"}, {"movie_id": 293660, "review_id": "56ca035a9251414a7a0062f0", "author_rating": 7.0, "review_text": "I actually enjoyed the movie so much that i'll recommend it to all my friends, at first i didn't really want to watch it because i'm not into super hero movies at all, but i did anyway, i mean people were talking so much about it i had to see it myself and what an awesome choice i made. The good thing about this movie is that Deadpool is a hero but in a very comedic way, you don't usually expect comedy from a superhero film but this one was full of comedy and the way they treated the plot was amazing, it was there, humor was there in every scene, even when there was fighting or romance or any other scene, the writers managed to add comedy everywhere in a very good way that'll surprisingly make you want to watch it again, and again. Thank you for taking the time read my review and if you're asking yourself if you should watch this movie, it's a definite Yes.", "created_at": "2016-02-21T18:35:06.961Z"}, {"movie_id": 293660, "review_id": "57375b8bc3a3687e1a0046bf", "author_rating": 6.5, "review_text": "> So this guy in the red suit came and broke some records...\r\n\r\nI was not a Deadpool fan and I'm still not, but like any superhero films I'd pleasure watching it. The other reason was, we had other superheroes in our time, so this guy is kind of new to me. It was a stunning launch to the big screen for the Deadpool as well as for this new director. This film was merely an introduction tale than a fully stretched story. Like how a human becomes a mutant and later who seeks a revenge for ruining his natural life. But it yet to explain a couple of things and I hope it all will be revealed in its sequel.\r\n\r\nI am happy for Ryan Reynolds to get another chance, because his previous comic book character did not received well. I certainly liked the film, but nowadays there are plenty of superheroes to choose, in that, Deadpool's not in my top 5. So I am happy he joined the 'X-Men', because I never liked the boring 'X-Men' films or its characters, but I do love its spinoff 'Wolverine'. I'll definitely look forward for his solo films like 'Wolverine'.\r\n\r\nThis film broke a few records like the best box office so far for an 'X-Men' installment. A short film with the present and flashback narration shared the screen piece by piece alternatively. This was a strong R rated film so far I have seen in a superhero theme and there were plenty of other films referred. No offense to the people who liked it (and those who are going watch will do the same), but in my personal opinion it was a bit over-celebrated.\r\n\r\n6½/10", "created_at": "2016-05-14T17:08:27.579Z"}, {"movie_id": 293660, "review_id": "57ad1b93925141588400129e", "author_rating": 9.0, "review_text": "Though I have always been a DC enthusiast, I was intrigued by the idea of the Deadpool movie, and knew I'd end up watching it (I probably see 70% of DC films that are released and maybe 20% of Marvel ones). I enjoyed its definitely postmodern approach--and wish Reynolds' Green Lantern movie had one-tenth the humour and charm that THIS film had.\r\n\r\nIt'll be very interesting to see how comic-book movies are affected, both short- and long-term by its massive success.", "created_at": "2016-08-12T00:42:59.904Z"}, {"movie_id": 293660, "review_id": "58c17054925141732700ace9", "author_rating": 7.0, "review_text": "This film was very funny. Ryan Reynolds was made for this role. The innuendos did get a bit much though.\r\n\r\nIt was well written and the direction was very good but it did go into a territory that it was trying to make fun of. I got bored of all the action hero conventions after a while.\r\n\r\n★★★½", "created_at": "2017-03-09T15:10:12.915Z"}, {"movie_id": 293660, "review_id": "592b7805c3a368783e069f68", "author_rating": 8.0, "review_text": "As a comic book fan, I was fairly dubious about Deadpool’s cinematic outing. I wasn't altogether sure that a film that would obviously have to be fun, self-referential and self-aware could also be able to talk about a character who not only becomes seriously ill, but also struggles to keep a grip on his sanity well enough to do the character justice. \r\n\r\nWhen I watched the film, it was clear that I had been over-thinking. Perhaps the makers of the film had thought the same as me. Perhaps they thought that trying to be lighthearted and slightly dark at the same time would be like trying to keep too many balls in the air. I say that because the issue of Deadpool’s sanity, or lack thereof, is only touched upon. If that is the case, I think it is quite a clever decision in a ‘let's not try to run before we can walk’ kind of a way. If not, Tim Miller has still given us a very enjoyable film, in which, Ryan Reynolds shines as an extremely good comedic actor.", "created_at": "2017-05-29T01:23:17.816Z"}, {"movie_id": 293660, "review_id": "5e08146e4c1d9a0015e34b0a", "author_rating": 6.0, "review_text": "After what I honestly think is the best promotional & viral marketing campaign a film has had, probably ever, the Deadpool feature film is finally here! And it's... Alright.\r\n\r\nI always try to manage expectations with these things, but after the aforementioned advertisements as well as multiple critics I highly regard the opinions of raving about it (John Campea of Collider for example gave the film his seventh 5-out-of-5 in his entire career) and my well-documented appreciation for the character of Deadpool, not to mention it's higher MPAA rating, there's only so neutral you can be going in. Still, I don't think my own personal biases had me too overhyped for Deadpool, I think I can fairly lay the lion's share of my underwhelming experience at the film itself.\r\n\r\nI should start out by saying that I didn't dislike Deadpool, I'm giving it a positive rating, and I recommend that people go watch it. Three stars for me is not a low score at all, I am glad I watched the movie and would happily watch it again, this is not a scathing review; Ryan Reynolds has tried his hand at the comic book film no less than five times, and of those five movies, Deadpool is inarguably the best.\r\n\r\nAlso worth noting that among those other four films, Ryan Reynolds was not the problem in them, but they were all truly bad movies.\r\n\r\nThe way in which Deadpool is done is pretty impressive, we get all the gore-laden action, R-rated comedy, quip-havery and fourth-wall-breaking you could want from a feature of his own. There are lots of meta-references to previous work to the past failings of both Reynolds as well as the Fox Studio itself. It's non-linear. It's 100% non-serious, almost a comedy before an action film. It's like the 22 Jump Street of the superhero genre. Stylistically, it's a completely fresh comic book movie.\r\n\r\nWhich is why the complete juxtaposition of how unbelievably generic the actual plot is, is so jarring. It's not only completely unoriginal, it's sometimes downright bland. The \"how\" is great, but the core of the \"what\" feels completely uninspired, and these two aspects clash up against each other very unpleasantly.\r\n\r\nPoints go out to the work done between Ryan Reynolds and Morena Baccarin, although the majority of their characters' relationship is montaged through, the actors themselves had a great on-screen chemistry. I'm also totally on board for a Deadpool sequel (which has been greenlit) or seeing Deadpool show up in other X-franchise properties. But that doesn't mean I can give Deadpool a pass on the things that didn't gel for me.\r\n\r\n63% \r\n\r\n-Gimly", "created_at": "2019-12-29T02:50:22.571Z"}, {"movie_id": 293660, "review_id": "63f6908bd1ca2a00f0092377", "author_rating": 10.0, "review_text": "Its my favorite film, this film really fun even its action", "created_at": "2023-02-22T22:00:43.597Z"}, {"movie_id": 293660, "review_id": "645ed6416e0d72013dcb26ef", "author_rating": 10.0, "review_text": "Awesome movie. I could have lived without the play by play commentary from him. Like he say's people have tried to shut him up.", "created_at": "2023-05-13T00:13:53.757Z"}]