[{"movie_id": 506072, "review_id": "5c5c8b12c3a3683a4689aeb5", "author_rating": 10.0, "review_text": "This film knocked my socks off, since it was exactly the kind of hard science-fiction that I often read as a young man. In it, we are transported to a future time when space travel is commonplace; in this movie we see a man and his daughter who are hard-scrabble people trying to get by in life, but not wealthy. They are prospectors, and hope to strike it rich on a planet where breathing the air is deadly, so the atmosphere has to be filtered & atmosphere suits must be worn when outside.\r\n\r\nThe planet is spectacularly real. The airborne spores can be seen, and we are shown their deadly effect; most of the action takes place while wearing the suits which filter out those deadly spores. This film impressed me mostly for its realism; the suits were well-worn, the spacecraft were also, and much of their equipment had to be jury-rigged to be useful. \r\n\r\nThe actors did a great job; Cee (Sopie Thatcher) was a natural, and totally believable, and had good chemistry with Ezra (Pedro Pascal) who really carried the movie; he sometimes reminded me of Nathan Fillian in Firefly. I would've preferred a bit more background on their characters, and a few times I was unimpressed by their emotional reaction to certain events, but those are minor quibbles about an excellent film, which I urge all lovers of hard science-fiction to enjoy, as I certainly did!\r\n\r\nAs there are so very few real sci-fi movies to compare it with, I give this film 5/5; it's excellent!", "created_at": "2019-02-07T19:46:26.994Z"}, {"movie_id": 506072, "review_id": "5c5fe98cc3a368386c870baf", "author_rating": 8.0, "review_text": "This film is an excellent example of a low budget, realistic, drama Sci-Fi. It's not an action Sci-Fi so don't expect it to be one. It is a drama, style is somewhat reminiscent of some of the old classics where technology is still quite basic and mechanical. It is not a western but it is analogous to the pioneering days of young western cultures like USA or Australia when times were tough and prospecting could send you back to the heart of the empire either filthy rich or in a coffin. This is by no means an epic tale but it is one of millions of stories that could have been told throughout recent history or may even be told in times to come.", "created_at": "2019-02-10T09:06:20.150Z"}, {"movie_id": 506072, "review_id": "5fadb2cda2d2e9003e1305fe", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nWhile the movie doesn't have top tier actors, you'll recognize some faces / voices if you pay attention.\r\n\r\nThis movie does a lot with a low budget, and, most of all, it properly builds an atmosphere that makes you feel what the characters are going through on an inhospitable planet.  The story exemplifies  how dangerous it is to be in space, putting the weight of survival heavy on the story.\r\n\r\nThe story itself is wonderfully complex: a contentious alliance between enemies with the goal of survival / escape.\r\n\r\nI really enjoyed this, even if the planet itself is a little weird.", "created_at": "2020-11-12T22:10:21.749Z"}]