[{"movie_id": 157350, "review_id": "53f0530e0e0a2675a9002e4c", "author_rating": 5.0, "review_text": "I should probably mention right away that I have not read the book-trilogy that this movie is based on. Given the content matter I might actually have liked the books. The movie? Well to me the movie was a rather mediocre one. As the blurb states the story is set in a dystopian future but we do not really get to know how they got there except the standard explanation that “there was a war”. The world is a bizarre mixture of primitive post-apocalypse living and modern, futuristic tech. The division of people into factions…well to me it felt pretty dumb to begin with and the idea that some people could not possibly fit into more than one faction was absolutely ludicrous to me. How the hell was it supposed to keep peace by deliberately factioning people against each other?\r\n\r\nOkay, trying to get over these gripes, what about the rest of the movie. Well it was okayish I guess. It did give me the same feeling as when reading a young-adult book and I would say that this movie is most suitable for a younger audience. The story is rather predictable. There is the initial training part where Tris of course gets a few friends and in particular befriends one of her tutors. Not surprisingly there is also the obligatory jerk. The one thing that makes the movie a bit out of the ordinary are the induced dream sequences which are not too bad.\r\n\r\nLater in the movie Tris starts to discover the plot of the bad guys and of course goes off to save the day. Again these part are simple and predictable. The ease by which Tris and a few of her friends manages to infiltrate the lab/headquarters of the baddies is rather unbelievable. It of course helps that it seems like it is only the good guys who can shoot straight or fight worth a damned with a few occasional exceptions when the script calls for it.\r\n\r\nThe movie is, as far as I understand it, based only on the first book in the trilogy so it is perhaps not very surprising that it ends with a lot of loose ends but, for Christ sake, they fight their way to stop the plot, taking down a lot of people on their way, and then they leave the chief mastermind of this despicable plot lying unconscious but alive on the floor just taking off. That just felt dumb!\r\n\r\nIt is not a bad bad movie but I do not understand the high ratings some people seem to give it.", "created_at": "2014-08-17T07:00:30.209Z"}, {"movie_id": 157350, "review_id": "54d9077fc3a3687ab500004e", "author_rating": null, "review_text": "Remedial Dystopia\r\n\r\nI'm not a big fan of YA lit. Nothing like it when I was young. I grew up with Kesey, Huxley, Salinger, Dickens and The Who. I probably would have liked a steady diet of teen vampires and young dystopians. I would have loved my comic book heroes on the big screen in 3D. And video games and smart phones and search engines. Oh to be a millenial! \r\n\r\nI was introduced to a truckload of Young Adult Lit during English Ed studies and found myself wanting to read _Catcher in the Rye_ all over again. There was just something really amateurish and disposable about these novellas. Like the authors weren't fully-developed writers. Nor am I all that interested in movies adapted from these novels, unless they are packed with talent (_The Hunger Games_), or star someone I just can't get enough of. That someone at the moment is Shailene Woodley. A young woman who is just oozing talent. She has that authentic, subdued strain of self-consciousness, it makes you forget she's in a movie. In fact, her focus seems to come so unassumingly natural I wonder if she even knows she's in a movie.\r\n\r\nI watched _The Fault in Our Stars_, The Spectacular Now and _Divergent_ in succession. _Divergent_ is getting short-changed by the same critics who praise _The Hunger Games_. Yes, it's simplistic, essentially a shallow allegory. Factions representing classes, institutions and vocations. The coercion of the Dauntless by the Erudite as a military coup. And rebellious adolescents as heroic Divergents. But if this gets kids even remotely interested in politics and the social sciences, I'm all for it. I'd prefer this to bare-chested werewolves and forest warfare. Then again, there's no defending _Divergent_ if it weren't for Woodley's splendid presence. Her inner strength mixing in with her vulnerability. She provides the suspense, as we are always awaiting her next reaction. Makes me wonder how she'll develop in the years to come? As well as Kate Winslow has I'm sure.", "created_at": "2015-02-09T19:16:15.870Z"}, {"movie_id": 157350, "review_id": "5624c426c3a3680e1d0123ef", "author_rating": 5.0, "review_text": "Well, it seems we needed a clone of The Hunger Games because, you know, they give too much money to ignore.\r\n\r\nStupid and foreseeable story with the typical action, romance and WTFs moments.\r\n\r\nJust ignore the whole saga.", "created_at": "2015-10-19T10:21:26.416Z"}, {"movie_id": 157350, "review_id": "57b391839251414a4500037a", "author_rating": 2.0, "review_text": "I decided since this was my mother's 75th birthday to check out the first of the 'Divergent' series, since I love Kate Winslet and Ashley Judd, and Neil Burger's earlier 'Limitless' was intriguing and decent for recent sci-fi. Unfortunately the actors playing the main protagonists and the special effects were atrocious, the paper-thin plot was resoundingly predictable and I couldn't wait till it ended.\r\n\r\nDefinitely one Burger that was way overdone.\r\n\r\nOf course Hollywood garbage like this produces a ton of sequels, while much better and original projects get kicked to the gutter.", "created_at": "2016-08-16T22:19:47.846Z"}, {"movie_id": 157350, "review_id": "64998262bbd0b000e7305c92", "author_rating": 6.0, "review_text": "A new world order type of movie. With 5 different factions. It was an ok movie but we only really learn about 2 of the factions really in this movie. What about the other 3. It would have been nice if we could see all 5 factions and how they lived and came about but instead you only know 2. So what's the point of even having the other ones in the movie pointless.", "created_at": "2023-06-26T12:19:46.884Z"}]