[{"movie_id": 429203, "review_id": "5d1e92d994d8a83116409459", "author_rating": 7.0, "review_text": "**_A well-made, old-fashioned yarn, but the laid-back ballad-like tone will be too insubstantial for some_**\r\n\r\n> _In the old days, the stickup men were like cowboys. They would just go in shooting, yelling for everyone to lie down. But to me violence is the first sign of an amateur. There is an art to robbing a bank if you do it right._\r\n> \r\n[...]\r\n\r\n> _Once you've got your cool car parked nearby, you've got your radio, your hands are covered with gloves or superglue, you walk in. Go right up to the manager. Say, \"Sit down.\" Never pull the gun - just flash it. Tell him calmly you're here to r__ob the bank and it better go off without a hitch. Don't run from the bank unless you're being shot at, 'cause it only shows something is going on. Just walk to the hot car, real calm, then drive to the cool car. Rev it up, and you're gone._\r\n\r\n- David Grann quoting Forrest Tucker; \"The Old Man and the Gun\"; _The New Yorker_ (January 27, 2003)\r\n\r\nOf all the young American writer/directors to break through in the last few years, for me, Jeff Nichols and David Lowery stand tall; in particular, Nichols's _Take Shelter_ (2011), and Lowery's _Ain't Them Bodies Saints_ (2013) and the existential masterpiece that was _A Ghost Story_ (2017). Both filmmakers are five-for-five thus far, with even Lowery's 2016 mainstream Disney remake _Pete's Dragon_ managing to impress in all sorts of ways I wasn't expecting. Apart from being enjoyable in its own right, it also showed us that Lowery is as comfortable making personal small-scale character dramas as he is big-budget special effects blockbusters. With _The Old Man & the Gun_, he stands somewhere between – it's not as intimate as _St. Nick_ (2009), _Ain't Them Bodies Saints_, or _A Ghost Story_, but neither is it as mainstream as _Pete's Dragon_. Originally touted as Robert Redford's final performance, although he has walked that claim back somewhat, _The Old Man & the Gun_ is a laid-back ballad-like elegy to both the character Redford is playing _and_ to Redford himself. Filmed in the style of a 1970's indie, _Old Man_ is so tied to Redford as a performer as to be virtually self-referential. In short, if you're not a fan of the actor, you will get absolutely nothing from this film.\r\n\r\nTelling the \"mostly true\" story of Forrest Tucker (the career criminal, not the prolific actor), Lowery's script is based primarily on David Grann's 2003 _New Yorker_ article of the same name, which was later collected in his book, _The Devil & Sherlock Holmes: Tales of Murder, Madness & Obsession_ (2010). By the time of the article, the 83-year-old Tucker, who had been robbing banks since his early 20s, had amassed at least 80 successful jobs and escaped from prison 18 times. Usually described by the tellers from whom he stole as \"gentlemanly\" and \"charming\", his M.O. never changed – he would walk into a bank and ask if he could open an account. When asked what kind, he would pull back his coat, showing his gun (which was often unloaded, and which he never fired), assure the teller that he didn't want any trouble, and quietly talk them through the process of emptying their till. He would then wish them the best, tell them they'd done well, and walk out. The story takes place in 1981, when Tucker was 61 (although in the film, he's 76), and had recently escaped from San Quentin. Although he usually works alone, he does have two colleagues, Teddy (Danny Glover) and Waller (Tom Waits), in what the press later dubs the \"Over-the-Hill Gang\". Fleeing from police pursuit after pulling off his first job since escaping, Tucker pulls over to help Jewel (Sissy Spacek), a widow whose car has broken down on the highway. He doesn't do it out of gallantry, but as a way to hide in plain sight; what kind of person being chased by police would stop to help someone fix their car? Heading to a nearby diner for a bite, Tucker and Jewel strike up a tentative romance. Initially, he tells her he is in sales, but shortly thereafter tells her what he really does, something she's not sure whether to believe. Meanwhile, when he pulls off a job in a bank where Det. John Hunt (Casey Affleck, playing, for a change, Casey Affleck) is queuing, completely unaware of what is happening right behind him, Tucker finds himself closely pursued by Hunt who, having just turned 40, is going through a mid-life crisis, which his wife Maureen (Tika Sumpter) can do little to dispel. The longer Hunt chases Tucker, however, the more he comes to respect him.\r\n\r\nRedford himself brought Grann's article and Tucker's story to Lowery's attention, who subsequently wrote the script specifically for Redford (who also produces). In 1986, whilst imprisoned in San Quentin, Tucker underwent a quadruple bypass, and subsequently began documenting his exploits. Initially writing _Alcatraz: The True Story_, a two-hundred-and-sixty-one page manuscript about how he had escaped from Alcatraz in the 50s (actually, although he was an inmate of Alcatraz, he escaped from an LA hospital whilst having a kidney operation), he then wrote an autobiography called _The Can Opener_, in which he described himself as a \"_highly intelligent, nonviolent type of criminal in the Willie Sutton mould_.\" He was released in 1993 and settled with his wife in Pompano Beach, Florida, where he earned a living giving saxophone and clarinet lessons, and occasionally playing the local jazz clubs. Turning _The Can Opener_ into a script, he tried to recruit Clint Eastwood to direct and star, but was told by Eastwood's secretary, \"_unless you have an agent, he won't read it_.\" Tucker was re-arrested in 1999 after carrying out at least four robberies, and in 2000, he was sentenced to thirteen years. He died of natural causes in 2004 whilst imprisoned at Federal Correctional Institution, Fort Worth. In terms of the film, most of the details of Tucker's life are reasonably accurate, although Jewel is a fictional character. She is, however, loosely based on Tucker's third wife, Jewell Centers, whom he married in 1982. Hunt is also a real person, although, he was a sergeant in Austin, not a detective in Dallas, and he was unmarried and childless (in the film, Hunt and Maureen have two children).\r\n\r\nThe first thing you'll notice about _Old Man_ is its pace, which is measured, to say the least. Ostensibly, this is a heist film, but the crime narrative is very much secondary to tone and character beats. Lowery is relatively uninterested in excitement, suspense, plot twists, or any of the usual generic tropes. Instead, approaching the material casually, he focuses on a year of Tucker's life. You learn pretty quickly, however, what kind of film this will be. Opening with Tucker in mid-robbery, instead of concentrating on his escape, as you would expect, Lowery instead cuts from the robbery to Tucker meeting Jewel, and from that, to a lengthy dialogue scene in a diner as Tucker and Jewel get to know one another. Just as you expect important plot details and character-illustrative moments to be front and centre in a bombastic opening salvo, Lowery gives us two people sitting in a diner talking to one another. And this establishes the tone for the rest of the film, which is as mellow as a film can be; rather than a shot of absinthe, it's a fine Irish malt drunk at a fireplace.\r\n\r\nIndeed, even within this structure, there's not a huge amount of character development, nor is there much of a dramatic arc. And that's not a criticism. Rather, the meditative, quasi-somnolent pace is very much one of the film's charms. To give you an example, about three-quarters of the way through, there's a scene where Jewel fills a kettle as she stares out the window. We are literally watching her thinking. Then she puts the kettle on the stove and thinks some more. The scene lasts a couple of minutes, and is reminiscent of Rooney Mara's four-minute pie-eating scene in _A Ghost Story_, which a lot of people disliked, but which I thought was very much the essence of the film rendered in pure visual form. Here, the kettle scene doesn't forward the narrative one iota. It's precisely the kind of scene that a young filmmaker would be told to avoid in film school. However, it's a key scene for the character, and although the film is only 93 minutes long, Lowery is in absolutely no rush to get through such scenes. Indeed, the heist scenes are very much the background noise against which the more interesting character beats happen. Additionally, Lowery almost completely ignores what, for many, would be the most interesting part of Tucker's story – his 18 escapes. Instead, Lowery puts them all together into one superb montage.\r\n\r\nHowever, for all that, Lowery's primary goal is not to tell the story of Tucker, or even to introduce the character to the audience. It's to create an ode to an icon, and that icon is Robert Redford. Tucker's story is basically a vehicle which Lowery uses to celebrate Redford; the character is always there, but he exists behind the actor, rather than the other way around. What I mean by this is perhaps best explained by citing its inverse – an actor disappearing into a character; think Daniel Day-Lewis in Paul Thomas Anderson's _Phantom Thread_ (2017). In _Old Man_, the audience is never allowed to forget that this is Robert Redford on screen, to the point where the performance is self-referential. Indeed, during the escape montage, there's even a clip of Redford from another film, Arthur Penn's _The Chase_ (1966). There's an obvious correlation between Tucker and Redford of which Lowery wants the audience to be very aware – they are both elderly, and still doing what they do best, reluctant to stop, with a massive CV to prove it. We can never look past the fact that Tucker is played by Redford, and for the most part, Redford is playing Redford, with the film existing in large part only because it explicitly leans on his back catalogue and real-life legacy. Essentially, the whole thing is an extended metatextual allegory for Redford's own impending retirement, not to mention his reluctance to let go.\r\n\r\nAs one would expect from Lowery, aesthetically, the film is fascinating. Lowery is very unusual in the sense that, thus far, he has never used the same cinematographer twice – _St. Nick_ was shot by Clay Liford; _Ain't Them Bodies Saints_ by Bradford Young; _Pete's Dragon_ by Bojan Bazelli; _A Ghost Story_ by Andrew Droz Palermo; and _Old Man_ by Joe Anderson. Stylistically, the film is most similar to _A Ghost Story_, which was shot 1.33:1. _The Old Man & the Gun_ is 2.39:1, but the cinematography is extremely unique, with the celluloid having a gritty, grainy quality, almost as if it were an amateur project. This is because Lowery shot on Super 16, doing so because he wanted it to look like it had been made in the period in which it was set. This is in direct contrast to, say, how Michael Mann shot _Public Enemies_ (2009), which was 2.35:1, shot on Kodak Vision3 500T 5219 film with modern Arriflex 235s, Arriflex 435s, Sony CineAlta F23s, Sony CineAlta HDC-F950s, and Sony PMW-EX1s, with the use of fast, seemingly anachronistic, digital photography creating a sense that what was happening on screen wasn't necessarily taking place in the past, but could easily have been taking place right now. Lowery, in contrast, tries to suture the viewer into the past _milieu_.\r\n\r\nIn relation to this, Anderson tells _Filmmaker Magazine_,\r\n\r\n> _when making a period piece, I think to really do it well and transport the audience back in time you have to acknowledge the way movies were made in the period that the story is set in._\r\n\r\nHe also tells _Deadline_,\r\n\r\n> _we didn't take an overly technical approach to the cinematography. Sometimes there's little bumps in camera moves, and a pan isn't necessarily perfectly controlled, and it has a lot of personality._\r\n\r\nAdditionally, the news broadcasts were shot using period-accurate video equipment. Initially, the producers wanted to shoot on cheaper digital and then degrade the images, but Anderson insisted on using '80s-era video cameras.\r\n\r\nAnother important aesthetic point is how much Lowery has obviously been influenced by the aforementioned Mann, to whom there are several homages – the diner scene recalls a similarly shot scene between James Caan and Tuesday Weld in _Thief_ (1981); the scene in the toilet where Hunt approaches Tucker is an obvious nod to Al Pacino confronting Robert De Niro in _Heat_ (1995); and the scene of Tucker gaining inspiration whilst sitting in a cinema recalls a scene where Dillinger (Johnny Depp) does the same thing in _Public Enemies_. In relation to this scene, the movie Tucker is watching is Monte Hellman's _Two-Lane Blacktop_ (1971), a film depicting the openness and freedom of the American highway. Of this choice, Lowery tells _SlashFilm_,\r\n\r\n> _I didn't intend for that movie to be in the movie. We paid homage to_ Blacktop _already when we shot the chase scene with the '55 Chevy, but when I was trying to figure out what movie they'd be watching at the movie theatre, so I just decided one day to try that clip from_ Two-Lane Blacktop _and the resonance it had was just perfect._\r\n\r\nIn terms of problems, there are a few. Indeed, we've covered one of them already – for many, the film will depend far too much on Redford, specifically the self-referential allusions to his career and legacy. If you're not a fan of his, you will get zero from this, absolutely nothing. Similarly, if you aren't familiar with at least some of his previous work, and his status in Hollywood, the whole thing will probably seem inconsequential. Another problem I have concerns Affleck. I know he's a celebrated actor and so forth, but for me, he plays himself in every single movie. There is virtually nothing to distinguish Hunt from Robert Ford in Andrew Dominik's _The Assassination of Jesse James by the Coward Robert Ford_ (2007) or Les Chandler from Kenneth Lonergan's _Manchester by the Sea_ (2016) or either of his performances in previous Lowery films. Every performance he gives, he plays a character with the weight of the world on his shoulders, shuffling around, speaking in a low-key hang-dog voice, reluctant to make eye contact, shifting on his feet. The exact same thing in every film, with the exception of Scott Cooper's underrated _Out of the Furnace_ (2013), where he showed some fire.\r\n\r\nLowery also has a strange habit of introducing themes which seem to be setting something up, only to completely abandon them without any kind of engagement. This is most obvious in relation to Hunt's inter-racial marriage and their two mixed-race children. This is a fictional element added by Lowery, so one assumes there was some thought behind it. But this is Texas in 1981; there wouldn't have been a huge amount of mixed marriages. Yet Lowery seems to portray it as if it's the most normal thing in the world. Indeed, for the wife and children, life is fairly idyllic, with not a hint of any kind of societal disapproval. My point is why would you introduce a mixed-race marriage into this _milieu_ without commenting on it. Lowery obviously has little interest in exploring the social reality of race relations in Texas in the early 1980s, which is fair enough, but if that's the case, why bother raising the issue at all? I'm also mystified as to what we're supposed to make of the scene where one of Hunt's daughters writes a get-well card to Ronald Reagan after he was shot by John Hinckley Jr..\r\n\r\nThese issues aside, however, _The Old Man & the Gun_ is a fine film. As much about Robert Redford as it is Forrest Tucker, although that won't appeal to everyone, there is much to praise. Made in a key so low, it's practically subterranean, Lowery hinges everything on Redford's presence, and, for the most part, it works well. There's little in here to get overly excited about, but neither is there much to criticise. Yes, the film is somewhat insubstantial, and there's virtually nothing here beyond the Redford/Tucker character, but it's still beautifully made, and, honestly, there's nothing wrong with spending 93 minutes hanging out with Redford, whether he's playing Forrest Tucker or Robert Redford. Whether or not this is actually his last performance remains to be seen, but if it is, it's as fine a send-off as any Hollywood icon could hope for.", "created_at": "2019-07-04T23:59:21.156Z"}, {"movie_id": 429203, "review_id": "63bf7d5805a53300aeced65d", "author_rating": 10.0, "review_text": "Wow, the bottom of the barrel for this film is Casey Affleck and Tom Waits, that's the cinematic equivalent of Washington's cabinet where the weakest among them was John Jay. And even here, Casey probably (while playing himself) played the absolute best depiction of himself that he's ever done. He pulls off the burned out, fed up, hates his job detective i a way that is both totally entertaining and totally believable.\r\n\r\nDanny Glover is the only down side and, honestly it's not because he didn't do a good job, he was lovable, believable, realistic, and maddeningly under-utilized. He leaves you wanting to see more, and unfortunately you never get it.\r\n\r\nBut, of course, the best of the best are Robert Redford and Sissy Spacek who manage to take a film about elderly bank robbers and turn it into a charming love story.\r\n\r\nIt all comes together in a slow burn of a film, punctuated by a pretty hysterical Tom Waits story, that seems to get by exclusively on the charm and characters that are so well developed and so brilliantly acted that you lose track of time.", "created_at": "2023-01-12T03:24:08.946Z"}, {"movie_id": 429203, "review_id": "5d1e92d994d8a83116409459", "author_rating": 7.0, "review_text": "**_A well-made, old-fashioned yarn, but the laid-back ballad-like tone will be too insubstantial for some_**\r\n\r\n> _In the old days, the stickup men were like cowboys. They would just go in shooting, yelling for everyone to lie down. But to me violence is the first sign of an amateur. There is an art to robbing a bank if you do it right._\r\n> \r\n[...]\r\n\r\n> _Once you've got your cool car parked nearby, you've got your radio, your hands are covered with gloves or superglue, you walk in. Go right up to the manager. Say, \"Sit down.\" Never pull the gun - just flash it. Tell him calmly you're here to r__ob the bank and it better go off without a hitch. Don't run from the bank unless you're being shot at, 'cause it only shows something is going on. Just walk to the hot car, real calm, then drive to the cool car. Rev it up, and you're gone._\r\n\r\n- David Grann quoting Forrest Tucker; \"The Old Man and the Gun\"; _The New Yorker_ (January 27, 2003)\r\n\r\nOf all the young American writer/directors to break through in the last few years, for me, Jeff Nichols and David Lowery stand tall; in particular, Nichols's _Take Shelter_ (2011), and Lowery's _Ain't Them Bodies Saints_ (2013) and the existential masterpiece that was _A Ghost Story_ (2017). Both filmmakers are five-for-five thus far, with even Lowery's 2016 mainstream Disney remake _Pete's Dragon_ managing to impress in all sorts of ways I wasn't expecting. Apart from being enjoyable in its own right, it also showed us that Lowery is as comfortable making personal small-scale character dramas as he is big-budget special effects blockbusters. With _The Old Man & the Gun_, he stands somewhere between – it's not as intimate as _St. Nick_ (2009), _Ain't Them Bodies Saints_, or _A Ghost Story_, but neither is it as mainstream as _Pete's Dragon_. Originally touted as Robert Redford's final performance, although he has walked that claim back somewhat, _The Old Man & the Gun_ is a laid-back ballad-like elegy to both the character Redford is playing _and_ to Redford himself. Filmed in the style of a 1970's indie, _Old Man_ is so tied to Redford as a performer as to be virtually self-referential. In short, if you're not a fan of the actor, you will get absolutely nothing from this film.\r\n\r\nTelling the \"mostly true\" story of Forrest Tucker (the career criminal, not the prolific actor), Lowery's script is based primarily on David Grann's 2003 _New Yorker_ article of the same name, which was later collected in his book, _The Devil & Sherlock Holmes: Tales of Murder, Madness & Obsession_ (2010). By the time of the article, the 83-year-old Tucker, who had been robbing banks since his early 20s, had amassed at least 80 successful jobs and escaped from prison 18 times. Usually described by the tellers from whom he stole as \"gentlemanly\" and \"charming\", his M.O. never changed – he would walk into a bank and ask if he could open an account. When asked what kind, he would pull back his coat, showing his gun (which was often unloaded, and which he never fired), assure the teller that he didn't want any trouble, and quietly talk them through the process of emptying their till. He would then wish them the best, tell them they'd done well, and walk out. The story takes place in 1981, when Tucker was 61 (although in the film, he's 76), and had recently escaped from San Quentin. Although he usually works alone, he does have two colleagues, Teddy (Danny Glover) and Waller (Tom Waits), in what the press later dubs the \"Over-the-Hill Gang\". Fleeing from police pursuit after pulling off his first job since escaping, Tucker pulls over to help Jewel (Sissy Spacek), a widow whose car has broken down on the highway. He doesn't do it out of gallantry, but as a way to hide in plain sight; what kind of person being chased by police would stop to help someone fix their car? Heading to a nearby diner for a bite, Tucker and Jewel strike up a tentative romance. Initially, he tells her he is in sales, but shortly thereafter tells her what he really does, something she's not sure whether to believe. Meanwhile, when he pulls off a job in a bank where Det. John Hunt (Casey Affleck, playing, for a change, Casey Affleck) is queuing, completely unaware of what is happening right behind him, Tucker finds himself closely pursued by Hunt who, having just turned 40, is going through a mid-life crisis, which his wife Maureen (Tika Sumpter) can do little to dispel. The longer Hunt chases Tucker, however, the more he comes to respect him.\r\n\r\nRedford himself brought Grann's article and Tucker's story to Lowery's attention, who subsequently wrote the script specifically for Redford (who also produces). In 1986, whilst imprisoned in San Quentin, Tucker underwent a quadruple bypass, and subsequently began documenting his exploits. Initially writing _Alcatraz: The True Story_, a two-hundred-and-sixty-one page manuscript about how he had escaped from Alcatraz in the 50s (actually, although he was an inmate of Alcatraz, he escaped from an LA hospital whilst having a kidney operation), he then wrote an autobiography called _The Can Opener_, in which he described himself as a \"_highly intelligent, nonviolent type of criminal in the Willie Sutton mould_.\" He was released in 1993 and settled with his wife in Pompano Beach, Florida, where he earned a living giving saxophone and clarinet lessons, and occasionally playing the local jazz clubs. Turning _The Can Opener_ into a script, he tried to recruit Clint Eastwood to direct and star, but was told by Eastwood's secretary, \"_unless you have an agent, he won't read it_.\" Tucker was re-arrested in 1999 after carrying out at least four robberies, and in 2000, he was sentenced to thirteen years. He died of natural causes in 2004 whilst imprisoned at Federal Correctional Institution, Fort Worth. In terms of the film, most of the details of Tucker's life are reasonably accurate, although Jewel is a fictional character. She is, however, loosely based on Tucker's third wife, Jewell Centers, whom he married in 1982. Hunt is also a real person, although, he was a sergeant in Austin, not a detective in Dallas, and he was unmarried and childless (in the film, Hunt and Maureen have two children).\r\n\r\nThe first thing you'll notice about _Old Man_ is its pace, which is measured, to say the least. Ostensibly, this is a heist film, but the crime narrative is very much secondary to tone and character beats. Lowery is relatively uninterested in excitement, suspense, plot twists, or any of the usual generic tropes. Instead, approaching the material casually, he focuses on a year of Tucker's life. You learn pretty quickly, however, what kind of film this will be. Opening with Tucker in mid-robbery, instead of concentrating on his escape, as you would expect, Lowery instead cuts from the robbery to Tucker meeting Jewel, and from that, to a lengthy dialogue scene in a diner as Tucker and Jewel get to know one another. Just as you expect important plot details and character-illustrative moments to be front and centre in a bombastic opening salvo, Lowery gives us two people sitting in a diner talking to one another. And this establishes the tone for the rest of the film, which is as mellow as a film can be; rather than a shot of absinthe, it's a fine Irish malt drunk at a fireplace.\r\n\r\nIndeed, even within this structure, there's not a huge amount of character development, nor is there much of a dramatic arc. And that's not a criticism. Rather, the meditative, quasi-somnolent pace is very much one of the film's charms. To give you an example, about three-quarters of the way through, there's a scene where Jewel fills a kettle as she stares out the window. We are literally watching her thinking. Then she puts the kettle on the stove and thinks some more. The scene lasts a couple of minutes, and is reminiscent of Rooney Mara's four-minute pie-eating scene in _A Ghost Story_, which a lot of people disliked, but which I thought was very much the essence of the film rendered in pure visual form. Here, the kettle scene doesn't forward the narrative one iota. It's precisely the kind of scene that a young filmmaker would be told to avoid in film school. However, it's a key scene for the character, and although the film is only 93 minutes long, Lowery is in absolutely no rush to get through such scenes. Indeed, the heist scenes are very much the background noise against which the more interesting character beats happen. Additionally, Lowery almost completely ignores what, for many, would be the most interesting part of Tucker's story – his 18 escapes. Instead, Lowery puts them all together into one superb montage.\r\n\r\nHowever, for all that, Lowery's primary goal is not to tell the story of Tucker, or even to introduce the character to the audience. It's to create an ode to an icon, and that icon is Robert Redford. Tucker's story is basically a vehicle which Lowery uses to celebrate Redford; the character is always there, but he exists behind the actor, rather than the other way around. What I mean by this is perhaps best explained by citing its inverse – an actor disappearing into a character; think Daniel Day-Lewis in Paul Thomas Anderson's _Phantom Thread_ (2017). In _Old Man_, the audience is never allowed to forget that this is Robert Redford on screen, to the point where the performance is self-referential. Indeed, during the escape montage, there's even a clip of Redford from another film, Arthur Penn's _The Chase_ (1966). There's an obvious correlation between Tucker and Redford of which Lowery wants the audience to be very aware – they are both elderly, and still doing what they do best, reluctant to stop, with a massive CV to prove it. We can never look past the fact that Tucker is played by Redford, and for the most part, Redford is playing Redford, with the film existing in large part only because it explicitly leans on his back catalogue and real-life legacy. Essentially, the whole thing is an extended metatextual allegory for Redford's own impending retirement, not to mention his reluctance to let go.\r\n\r\nAs one would expect from Lowery, aesthetically, the film is fascinating. Lowery is very unusual in the sense that, thus far, he has never used the same cinematographer twice – _St. Nick_ was shot by Clay Liford; _Ain't Them Bodies Saints_ by Bradford Young; _Pete's Dragon_ by Bojan Bazelli; _A Ghost Story_ by Andrew Droz Palermo; and _Old Man_ by Joe Anderson. Stylistically, the film is most similar to _A Ghost Story_, which was shot 1.33:1. _The Old Man & the Gun_ is 2.39:1, but the cinematography is extremely unique, with the celluloid having a gritty, grainy quality, almost as if it were an amateur project. This is because Lowery shot on Super 16, doing so because he wanted it to look like it had been made in the period in which it was set. This is in direct contrast to, say, how Michael Mann shot _Public Enemies_ (2009), which was 2.35:1, shot on Kodak Vision3 500T 5219 film with modern Arriflex 235s, Arriflex 435s, Sony CineAlta F23s, Sony CineAlta HDC-F950s, and Sony PMW-EX1s, with the use of fast, seemingly anachronistic, digital photography creating a sense that what was happening on screen wasn't necessarily taking place in the past, but could easily have been taking place right now. Lowery, in contrast, tries to suture the viewer into the past _milieu_.\r\n\r\nIn relation to this, Anderson tells _Filmmaker Magazine_,\r\n\r\n> _when making a period piece, I think to really do it well and transport the audience back in time you have to acknowledge the way movies were made in the period that the story is set in._\r\n\r\nHe also tells _Deadline_,\r\n\r\n> _we didn't take an overly technical approach to the cinematography. Sometimes there's little bumps in camera moves, and a pan isn't necessarily perfectly controlled, and it has a lot of personality._\r\n\r\nAdditionally, the news broadcasts were shot using period-accurate video equipment. Initially, the producers wanted to shoot on cheaper digital and then degrade the images, but Anderson insisted on using '80s-era video cameras.\r\n\r\nAnother important aesthetic point is how much Lowery has obviously been influenced by the aforementioned Mann, to whom there are several homages – the diner scene recalls a similarly shot scene between James Caan and Tuesday Weld in _Thief_ (1981); the scene in the toilet where Hunt approaches Tucker is an obvious nod to Al Pacino confronting Robert De Niro in _Heat_ (1995); and the scene of Tucker gaining inspiration whilst sitting in a cinema recalls a scene where Dillinger (Johnny Depp) does the same thing in _Public Enemies_. In relation to this scene, the movie Tucker is watching is Monte Hellman's _Two-Lane Blacktop_ (1971), a film depicting the openness and freedom of the American highway. Of this choice, Lowery tells _SlashFilm_,\r\n\r\n> _I didn't intend for that movie to be in the movie. We paid homage to_ Blacktop _already when we shot the chase scene with the '55 Chevy, but when I was trying to figure out what movie they'd be watching at the movie theatre, so I just decided one day to try that clip from_ Two-Lane Blacktop _and the resonance it had was just perfect._\r\n\r\nIn terms of problems, there are a few. Indeed, we've covered one of them already – for many, the film will depend far too much on Redford, specifically the self-referential allusions to his career and legacy. If you're not a fan of his, you will get zero from this, absolutely nothing. Similarly, if you aren't familiar with at least some of his previous work, and his status in Hollywood, the whole thing will probably seem inconsequential. Another problem I have concerns Affleck. I know he's a celebrated actor and so forth, but for me, he plays himself in every single movie. There is virtually nothing to distinguish Hunt from Robert Ford in Andrew Dominik's _The Assassination of Jesse James by the Coward Robert Ford_ (2007) or Les Chandler from Kenneth Lonergan's _Manchester by the Sea_ (2016) or either of his performances in previous Lowery films. Every performance he gives, he plays a character with the weight of the world on his shoulders, shuffling around, speaking in a low-key hang-dog voice, reluctant to make eye contact, shifting on his feet. The exact same thing in every film, with the exception of Scott Cooper's underrated _Out of the Furnace_ (2013), where he showed some fire.\r\n\r\nLowery also has a strange habit of introducing themes which seem to be setting something up, only to completely abandon them without any kind of engagement. This is most obvious in relation to Hunt's inter-racial marriage and their two mixed-race children. This is a fictional element added by Lowery, so one assumes there was some thought behind it. But this is Texas in 1981; there wouldn't have been a huge amount of mixed marriages. Yet Lowery seems to portray it as if it's the most normal thing in the world. Indeed, for the wife and children, life is fairly idyllic, with not a hint of any kind of societal disapproval. My point is why would you introduce a mixed-race marriage into this _milieu_ without commenting on it. Lowery obviously has little interest in exploring the social reality of race relations in Texas in the early 1980s, which is fair enough, but if that's the case, why bother raising the issue at all? I'm also mystified as to what we're supposed to make of the scene where one of Hunt's daughters writes a get-well card to Ronald Reagan after he was shot by John Hinckley Jr..\r\n\r\nThese issues aside, however, _The Old Man & the Gun_ is a fine film. As much about Robert Redford as it is Forrest Tucker, although that won't appeal to everyone, there is much to praise. Made in a key so low, it's practically subterranean, Lowery hinges everything on Redford's presence, and, for the most part, it works well. There's little in here to get overly excited about, but neither is there much to criticise. Yes, the film is somewhat insubstantial, and there's virtually nothing here beyond the Redford/Tucker character, but it's still beautifully made, and, honestly, there's nothing wrong with spending 93 minutes hanging out with Redford, whether he's playing Forrest Tucker or Robert Redford. Whether or not this is actually his last performance remains to be seen, but if it is, it's as fine a send-off as any Hollywood icon could hope for.", "created_at": "2019-07-04T23:59:21.156Z"}, {"movie_id": 429203, "review_id": "63bf7d5805a53300aeced65d", "author_rating": 10.0, "review_text": "Wow, the bottom of the barrel for this film is Casey Affleck and Tom Waits, that's the cinematic equivalent of Washington's cabinet where the weakest among them was John Jay. And even here, Casey probably (while playing himself) played the absolute best depiction of himself that he's ever done. He pulls off the burned out, fed up, hates his job detective i a way that is both totally entertaining and totally believable.\r\n\r\nDanny Glover is the only down side and, honestly it's not because he didn't do a good job, he was lovable, believable, realistic, and maddeningly under-utilized. He leaves you wanting to see more, and unfortunately you never get it.\r\n\r\nBut, of course, the best of the best are Robert Redford and Sissy Spacek who manage to take a film about elderly bank robbers and turn it into a charming love story.\r\n\r\nIt all comes together in a slow burn of a film, punctuated by a pretty hysterical Tom Waits story, that seems to get by exclusively on the charm and characters that are so well developed and so brilliantly acted that you lose track of time.", "created_at": "2023-01-12T03:24:08.946Z"}, {"movie_id": 429203, "review_id": "5d1e92d994d8a83116409459", "author_rating": 7.0, "review_text": "**_A well-made, old-fashioned yarn, but the laid-back ballad-like tone will be too insubstantial for some_**\r\n\r\n> _In the old days, the stickup men were like cowboys. They would just go in shooting, yelling for everyone to lie down. But to me violence is the first sign of an amateur. There is an art to robbing a bank if you do it right._\r\n> \r\n[...]\r\n\r\n> _Once you've got your cool car parked nearby, you've got your radio, your hands are covered with gloves or superglue, you walk in. Go right up to the manager. Say, \"Sit down.\" Never pull the gun - just flash it. Tell him calmly you're here to r__ob the bank and it better go off without a hitch. Don't run from the bank unless you're being shot at, 'cause it only shows something is going on. Just walk to the hot car, real calm, then drive to the cool car. Rev it up, and you're gone._\r\n\r\n- David Grann quoting Forrest Tucker; \"The Old Man and the Gun\"; _The New Yorker_ (January 27, 2003)\r\n\r\nOf all the young American writer/directors to break through in the last few years, for me, Jeff Nichols and David Lowery stand tall; in particular, Nichols's _Take Shelter_ (2011), and Lowery's _Ain't Them Bodies Saints_ (2013) and the existential masterpiece that was _A Ghost Story_ (2017). Both filmmakers are five-for-five thus far, with even Lowery's 2016 mainstream Disney remake _Pete's Dragon_ managing to impress in all sorts of ways I wasn't expecting. Apart from being enjoyable in its own right, it also showed us that Lowery is as comfortable making personal small-scale character dramas as he is big-budget special effects blockbusters. With _The Old Man & the Gun_, he stands somewhere between – it's not as intimate as _St. Nick_ (2009), _Ain't Them Bodies Saints_, or _A Ghost Story_, but neither is it as mainstream as _Pete's Dragon_. Originally touted as Robert Redford's final performance, although he has walked that claim back somewhat, _The Old Man & the Gun_ is a laid-back ballad-like elegy to both the character Redford is playing _and_ to Redford himself. Filmed in the style of a 1970's indie, _Old Man_ is so tied to Redford as a performer as to be virtually self-referential. In short, if you're not a fan of the actor, you will get absolutely nothing from this film.\r\n\r\nTelling the \"mostly true\" story of Forrest Tucker (the career criminal, not the prolific actor), Lowery's script is based primarily on David Grann's 2003 _New Yorker_ article of the same name, which was later collected in his book, _The Devil & Sherlock Holmes: Tales of Murder, Madness & Obsession_ (2010). By the time of the article, the 83-year-old Tucker, who had been robbing banks since his early 20s, had amassed at least 80 successful jobs and escaped from prison 18 times. Usually described by the tellers from whom he stole as \"gentlemanly\" and \"charming\", his M.O. never changed – he would walk into a bank and ask if he could open an account. When asked what kind, he would pull back his coat, showing his gun (which was often unloaded, and which he never fired), assure the teller that he didn't want any trouble, and quietly talk them through the process of emptying their till. He would then wish them the best, tell them they'd done well, and walk out. The story takes place in 1981, when Tucker was 61 (although in the film, he's 76), and had recently escaped from San Quentin. Although he usually works alone, he does have two colleagues, Teddy (Danny Glover) and Waller (Tom Waits), in what the press later dubs the \"Over-the-Hill Gang\". Fleeing from police pursuit after pulling off his first job since escaping, Tucker pulls over to help Jewel (Sissy Spacek), a widow whose car has broken down on the highway. He doesn't do it out of gallantry, but as a way to hide in plain sight; what kind of person being chased by police would stop to help someone fix their car? Heading to a nearby diner for a bite, Tucker and Jewel strike up a tentative romance. Initially, he tells her he is in sales, but shortly thereafter tells her what he really does, something she's not sure whether to believe. Meanwhile, when he pulls off a job in a bank where Det. John Hunt (Casey Affleck, playing, for a change, Casey Affleck) is queuing, completely unaware of what is happening right behind him, Tucker finds himself closely pursued by Hunt who, having just turned 40, is going through a mid-life crisis, which his wife Maureen (Tika Sumpter) can do little to dispel. The longer Hunt chases Tucker, however, the more he comes to respect him.\r\n\r\nRedford himself brought Grann's article and Tucker's story to Lowery's attention, who subsequently wrote the script specifically for Redford (who also produces). In 1986, whilst imprisoned in San Quentin, Tucker underwent a quadruple bypass, and subsequently began documenting his exploits. Initially writing _Alcatraz: The True Story_, a two-hundred-and-sixty-one page manuscript about how he had escaped from Alcatraz in the 50s (actually, although he was an inmate of Alcatraz, he escaped from an LA hospital whilst having a kidney operation), he then wrote an autobiography called _The Can Opener_, in which he described himself as a \"_highly intelligent, nonviolent type of criminal in the Willie Sutton mould_.\" He was released in 1993 and settled with his wife in Pompano Beach, Florida, where he earned a living giving saxophone and clarinet lessons, and occasionally playing the local jazz clubs. Turning _The Can Opener_ into a script, he tried to recruit Clint Eastwood to direct and star, but was told by Eastwood's secretary, \"_unless you have an agent, he won't read it_.\" Tucker was re-arrested in 1999 after carrying out at least four robberies, and in 2000, he was sentenced to thirteen years. He died of natural causes in 2004 whilst imprisoned at Federal Correctional Institution, Fort Worth. In terms of the film, most of the details of Tucker's life are reasonably accurate, although Jewel is a fictional character. She is, however, loosely based on Tucker's third wife, Jewell Centers, whom he married in 1982. Hunt is also a real person, although, he was a sergeant in Austin, not a detective in Dallas, and he was unmarried and childless (in the film, Hunt and Maureen have two children).\r\n\r\nThe first thing you'll notice about _Old Man_ is its pace, which is measured, to say the least. Ostensibly, this is a heist film, but the crime narrative is very much secondary to tone and character beats. Lowery is relatively uninterested in excitement, suspense, plot twists, or any of the usual generic tropes. Instead, approaching the material casually, he focuses on a year of Tucker's life. You learn pretty quickly, however, what kind of film this will be. Opening with Tucker in mid-robbery, instead of concentrating on his escape, as you would expect, Lowery instead cuts from the robbery to Tucker meeting Jewel, and from that, to a lengthy dialogue scene in a diner as Tucker and Jewel get to know one another. Just as you expect important plot details and character-illustrative moments to be front and centre in a bombastic opening salvo, Lowery gives us two people sitting in a diner talking to one another. And this establishes the tone for the rest of the film, which is as mellow as a film can be; rather than a shot of absinthe, it's a fine Irish malt drunk at a fireplace.\r\n\r\nIndeed, even within this structure, there's not a huge amount of character development, nor is there much of a dramatic arc. And that's not a criticism. Rather, the meditative, quasi-somnolent pace is very much one of the film's charms. To give you an example, about three-quarters of the way through, there's a scene where Jewel fills a kettle as she stares out the window. We are literally watching her thinking. Then she puts the kettle on the stove and thinks some more. The scene lasts a couple of minutes, and is reminiscent of Rooney Mara's four-minute pie-eating scene in _A Ghost Story_, which a lot of people disliked, but which I thought was very much the essence of the film rendered in pure visual form. Here, the kettle scene doesn't forward the narrative one iota. It's precisely the kind of scene that a young filmmaker would be told to avoid in film school. However, it's a key scene for the character, and although the film is only 93 minutes long, Lowery is in absolutely no rush to get through such scenes. Indeed, the heist scenes are very much the background noise against which the more interesting character beats happen. Additionally, Lowery almost completely ignores what, for many, would be the most interesting part of Tucker's story – his 18 escapes. Instead, Lowery puts them all together into one superb montage.\r\n\r\nHowever, for all that, Lowery's primary goal is not to tell the story of Tucker, or even to introduce the character to the audience. It's to create an ode to an icon, and that icon is Robert Redford. Tucker's story is basically a vehicle which Lowery uses to celebrate Redford; the character is always there, but he exists behind the actor, rather than the other way around. What I mean by this is perhaps best explained by citing its inverse – an actor disappearing into a character; think Daniel Day-Lewis in Paul Thomas Anderson's _Phantom Thread_ (2017). In _Old Man_, the audience is never allowed to forget that this is Robert Redford on screen, to the point where the performance is self-referential. Indeed, during the escape montage, there's even a clip of Redford from another film, Arthur Penn's _The Chase_ (1966). There's an obvious correlation between Tucker and Redford of which Lowery wants the audience to be very aware – they are both elderly, and still doing what they do best, reluctant to stop, with a massive CV to prove it. We can never look past the fact that Tucker is played by Redford, and for the most part, Redford is playing Redford, with the film existing in large part only because it explicitly leans on his back catalogue and real-life legacy. Essentially, the whole thing is an extended metatextual allegory for Redford's own impending retirement, not to mention his reluctance to let go.\r\n\r\nAs one would expect from Lowery, aesthetically, the film is fascinating. Lowery is very unusual in the sense that, thus far, he has never used the same cinematographer twice – _St. Nick_ was shot by Clay Liford; _Ain't Them Bodies Saints_ by Bradford Young; _Pete's Dragon_ by Bojan Bazelli; _A Ghost Story_ by Andrew Droz Palermo; and _Old Man_ by Joe Anderson. Stylistically, the film is most similar to _A Ghost Story_, which was shot 1.33:1. _The Old Man & the Gun_ is 2.39:1, but the cinematography is extremely unique, with the celluloid having a gritty, grainy quality, almost as if it were an amateur project. This is because Lowery shot on Super 16, doing so because he wanted it to look like it had been made in the period in which it was set. This is in direct contrast to, say, how Michael Mann shot _Public Enemies_ (2009), which was 2.35:1, shot on Kodak Vision3 500T 5219 film with modern Arriflex 235s, Arriflex 435s, Sony CineAlta F23s, Sony CineAlta HDC-F950s, and Sony PMW-EX1s, with the use of fast, seemingly anachronistic, digital photography creating a sense that what was happening on screen wasn't necessarily taking place in the past, but could easily have been taking place right now. Lowery, in contrast, tries to suture the viewer into the past _milieu_.\r\n\r\nIn relation to this, Anderson tells _Filmmaker Magazine_,\r\n\r\n> _when making a period piece, I think to really do it well and transport the audience back in time you have to acknowledge the way movies were made in the period that the story is set in._\r\n\r\nHe also tells _Deadline_,\r\n\r\n> _we didn't take an overly technical approach to the cinematography. Sometimes there's little bumps in camera moves, and a pan isn't necessarily perfectly controlled, and it has a lot of personality._\r\n\r\nAdditionally, the news broadcasts were shot using period-accurate video equipment. Initially, the producers wanted to shoot on cheaper digital and then degrade the images, but Anderson insisted on using '80s-era video cameras.\r\n\r\nAnother important aesthetic point is how much Lowery has obviously been influenced by the aforementioned Mann, to whom there are several homages – the diner scene recalls a similarly shot scene between James Caan and Tuesday Weld in _Thief_ (1981); the scene in the toilet where Hunt approaches Tucker is an obvious nod to Al Pacino confronting Robert De Niro in _Heat_ (1995); and the scene of Tucker gaining inspiration whilst sitting in a cinema recalls a scene where Dillinger (Johnny Depp) does the same thing in _Public Enemies_. In relation to this scene, the movie Tucker is watching is Monte Hellman's _Two-Lane Blacktop_ (1971), a film depicting the openness and freedom of the American highway. Of this choice, Lowery tells _SlashFilm_,\r\n\r\n> _I didn't intend for that movie to be in the movie. We paid homage to_ Blacktop _already when we shot the chase scene with the '55 Chevy, but when I was trying to figure out what movie they'd be watching at the movie theatre, so I just decided one day to try that clip from_ Two-Lane Blacktop _and the resonance it had was just perfect._\r\n\r\nIn terms of problems, there are a few. Indeed, we've covered one of them already – for many, the film will depend far too much on Redford, specifically the self-referential allusions to his career and legacy. If you're not a fan of his, you will get zero from this, absolutely nothing. Similarly, if you aren't familiar with at least some of his previous work, and his status in Hollywood, the whole thing will probably seem inconsequential. Another problem I have concerns Affleck. I know he's a celebrated actor and so forth, but for me, he plays himself in every single movie. There is virtually nothing to distinguish Hunt from Robert Ford in Andrew Dominik's _The Assassination of Jesse James by the Coward Robert Ford_ (2007) or Les Chandler from Kenneth Lonergan's _Manchester by the Sea_ (2016) or either of his performances in previous Lowery films. Every performance he gives, he plays a character with the weight of the world on his shoulders, shuffling around, speaking in a low-key hang-dog voice, reluctant to make eye contact, shifting on his feet. The exact same thing in every film, with the exception of Scott Cooper's underrated _Out of the Furnace_ (2013), where he showed some fire.\r\n\r\nLowery also has a strange habit of introducing themes which seem to be setting something up, only to completely abandon them without any kind of engagement. This is most obvious in relation to Hunt's inter-racial marriage and their two mixed-race children. This is a fictional element added by Lowery, so one assumes there was some thought behind it. But this is Texas in 1981; there wouldn't have been a huge amount of mixed marriages. Yet Lowery seems to portray it as if it's the most normal thing in the world. Indeed, for the wife and children, life is fairly idyllic, with not a hint of any kind of societal disapproval. My point is why would you introduce a mixed-race marriage into this _milieu_ without commenting on it. Lowery obviously has little interest in exploring the social reality of race relations in Texas in the early 1980s, which is fair enough, but if that's the case, why bother raising the issue at all? I'm also mystified as to what we're supposed to make of the scene where one of Hunt's daughters writes a get-well card to Ronald Reagan after he was shot by John Hinckley Jr..\r\n\r\nThese issues aside, however, _The Old Man & the Gun_ is a fine film. As much about Robert Redford as it is Forrest Tucker, although that won't appeal to everyone, there is much to praise. Made in a key so low, it's practically subterranean, Lowery hinges everything on Redford's presence, and, for the most part, it works well. There's little in here to get overly excited about, but neither is there much to criticise. Yes, the film is somewhat insubstantial, and there's virtually nothing here beyond the Redford/Tucker character, but it's still beautifully made, and, honestly, there's nothing wrong with spending 93 minutes hanging out with Redford, whether he's playing Forrest Tucker or Robert Redford. Whether or not this is actually his last performance remains to be seen, but if it is, it's as fine a send-off as any Hollywood icon could hope for.", "created_at": "2019-07-04T23:59:21.156Z"}, {"movie_id": 429203, "review_id": "63bf7d5805a53300aeced65d", "author_rating": 10.0, "review_text": "Wow, the bottom of the barrel for this film is Casey Affleck and Tom Waits, that's the cinematic equivalent of Washington's cabinet where the weakest among them was John Jay. And even here, Casey probably (while playing himself) played the absolute best depiction of himself that he's ever done. He pulls off the burned out, fed up, hates his job detective i a way that is both totally entertaining and totally believable.\r\n\r\nDanny Glover is the only down side and, honestly it's not because he didn't do a good job, he was lovable, believable, realistic, and maddeningly under-utilized. He leaves you wanting to see more, and unfortunately you never get it.\r\n\r\nBut, of course, the best of the best are Robert Redford and Sissy Spacek who manage to take a film about elderly bank robbers and turn it into a charming love story.\r\n\r\nIt all comes together in a slow burn of a film, punctuated by a pretty hysterical Tom Waits story, that seems to get by exclusively on the charm and characters that are so well developed and so brilliantly acted that you lose track of time.", "created_at": "2023-01-12T03:24:08.946Z"}, {"movie_id": 429203, "review_id": "5d1e92d994d8a83116409459", "author_rating": 7.0, "review_text": "**_A well-made, old-fashioned yarn, but the laid-back ballad-like tone will be too insubstantial for some_**\r\n\r\n> _In the old days, the stickup men were like cowboys. They would just go in shooting, yelling for everyone to lie down. But to me violence is the first sign of an amateur. There is an art to robbing a bank if you do it right._\r\n> \r\n[...]\r\n\r\n> _Once you've got your cool car parked nearby, you've got your radio, your hands are covered with gloves or superglue, you walk in. Go right up to the manager. Say, \"Sit down.\" Never pull the gun - just flash it. Tell him calmly you're here to r__ob the bank and it better go off without a hitch. Don't run from the bank unless you're being shot at, 'cause it only shows something is going on. Just walk to the hot car, real calm, then drive to the cool car. Rev it up, and you're gone._\r\n\r\n- David Grann quoting Forrest Tucker; \"The Old Man and the Gun\"; _The New Yorker_ (January 27, 2003)\r\n\r\nOf all the young American writer/directors to break through in the last few years, for me, Jeff Nichols and David Lowery stand tall; in particular, Nichols's _Take Shelter_ (2011), and Lowery's _Ain't Them Bodies Saints_ (2013) and the existential masterpiece that was _A Ghost Story_ (2017). Both filmmakers are five-for-five thus far, with even Lowery's 2016 mainstream Disney remake _Pete's Dragon_ managing to impress in all sorts of ways I wasn't expecting. Apart from being enjoyable in its own right, it also showed us that Lowery is as comfortable making personal small-scale character dramas as he is big-budget special effects blockbusters. With _The Old Man & the Gun_, he stands somewhere between – it's not as intimate as _St. Nick_ (2009), _Ain't Them Bodies Saints_, or _A Ghost Story_, but neither is it as mainstream as _Pete's Dragon_. Originally touted as Robert Redford's final performance, although he has walked that claim back somewhat, _The Old Man & the Gun_ is a laid-back ballad-like elegy to both the character Redford is playing _and_ to Redford himself. Filmed in the style of a 1970's indie, _Old Man_ is so tied to Redford as a performer as to be virtually self-referential. In short, if you're not a fan of the actor, you will get absolutely nothing from this film.\r\n\r\nTelling the \"mostly true\" story of Forrest Tucker (the career criminal, not the prolific actor), Lowery's script is based primarily on David Grann's 2003 _New Yorker_ article of the same name, which was later collected in his book, _The Devil & Sherlock Holmes: Tales of Murder, Madness & Obsession_ (2010). By the time of the article, the 83-year-old Tucker, who had been robbing banks since his early 20s, had amassed at least 80 successful jobs and escaped from prison 18 times. Usually described by the tellers from whom he stole as \"gentlemanly\" and \"charming\", his M.O. never changed – he would walk into a bank and ask if he could open an account. When asked what kind, he would pull back his coat, showing his gun (which was often unloaded, and which he never fired), assure the teller that he didn't want any trouble, and quietly talk them through the process of emptying their till. He would then wish them the best, tell them they'd done well, and walk out. The story takes place in 1981, when Tucker was 61 (although in the film, he's 76), and had recently escaped from San Quentin. Although he usually works alone, he does have two colleagues, Teddy (Danny Glover) and Waller (Tom Waits), in what the press later dubs the \"Over-the-Hill Gang\". Fleeing from police pursuit after pulling off his first job since escaping, Tucker pulls over to help Jewel (Sissy Spacek), a widow whose car has broken down on the highway. He doesn't do it out of gallantry, but as a way to hide in plain sight; what kind of person being chased by police would stop to help someone fix their car? Heading to a nearby diner for a bite, Tucker and Jewel strike up a tentative romance. Initially, he tells her he is in sales, but shortly thereafter tells her what he really does, something she's not sure whether to believe. Meanwhile, when he pulls off a job in a bank where Det. John Hunt (Casey Affleck, playing, for a change, Casey Affleck) is queuing, completely unaware of what is happening right behind him, Tucker finds himself closely pursued by Hunt who, having just turned 40, is going through a mid-life crisis, which his wife Maureen (Tika Sumpter) can do little to dispel. The longer Hunt chases Tucker, however, the more he comes to respect him.\r\n\r\nRedford himself brought Grann's article and Tucker's story to Lowery's attention, who subsequently wrote the script specifically for Redford (who also produces). In 1986, whilst imprisoned in San Quentin, Tucker underwent a quadruple bypass, and subsequently began documenting his exploits. Initially writing _Alcatraz: The True Story_, a two-hundred-and-sixty-one page manuscript about how he had escaped from Alcatraz in the 50s (actually, although he was an inmate of Alcatraz, he escaped from an LA hospital whilst having a kidney operation), he then wrote an autobiography called _The Can Opener_, in which he described himself as a \"_highly intelligent, nonviolent type of criminal in the Willie Sutton mould_.\" He was released in 1993 and settled with his wife in Pompano Beach, Florida, where he earned a living giving saxophone and clarinet lessons, and occasionally playing the local jazz clubs. Turning _The Can Opener_ into a script, he tried to recruit Clint Eastwood to direct and star, but was told by Eastwood's secretary, \"_unless you have an agent, he won't read it_.\" Tucker was re-arrested in 1999 after carrying out at least four robberies, and in 2000, he was sentenced to thirteen years. He died of natural causes in 2004 whilst imprisoned at Federal Correctional Institution, Fort Worth. In terms of the film, most of the details of Tucker's life are reasonably accurate, although Jewel is a fictional character. She is, however, loosely based on Tucker's third wife, Jewell Centers, whom he married in 1982. Hunt is also a real person, although, he was a sergeant in Austin, not a detective in Dallas, and he was unmarried and childless (in the film, Hunt and Maureen have two children).\r\n\r\nThe first thing you'll notice about _Old Man_ is its pace, which is measured, to say the least. Ostensibly, this is a heist film, but the crime narrative is very much secondary to tone and character beats. Lowery is relatively uninterested in excitement, suspense, plot twists, or any of the usual generic tropes. Instead, approaching the material casually, he focuses on a year of Tucker's life. You learn pretty quickly, however, what kind of film this will be. Opening with Tucker in mid-robbery, instead of concentrating on his escape, as you would expect, Lowery instead cuts from the robbery to Tucker meeting Jewel, and from that, to a lengthy dialogue scene in a diner as Tucker and Jewel get to know one another. Just as you expect important plot details and character-illustrative moments to be front and centre in a bombastic opening salvo, Lowery gives us two people sitting in a diner talking to one another. And this establishes the tone for the rest of the film, which is as mellow as a film can be; rather than a shot of absinthe, it's a fine Irish malt drunk at a fireplace.\r\n\r\nIndeed, even within this structure, there's not a huge amount of character development, nor is there much of a dramatic arc. And that's not a criticism. Rather, the meditative, quasi-somnolent pace is very much one of the film's charms. To give you an example, about three-quarters of the way through, there's a scene where Jewel fills a kettle as she stares out the window. We are literally watching her thinking. Then she puts the kettle on the stove and thinks some more. The scene lasts a couple of minutes, and is reminiscent of Rooney Mara's four-minute pie-eating scene in _A Ghost Story_, which a lot of people disliked, but which I thought was very much the essence of the film rendered in pure visual form. Here, the kettle scene doesn't forward the narrative one iota. It's precisely the kind of scene that a young filmmaker would be told to avoid in film school. However, it's a key scene for the character, and although the film is only 93 minutes long, Lowery is in absolutely no rush to get through such scenes. Indeed, the heist scenes are very much the background noise against which the more interesting character beats happen. Additionally, Lowery almost completely ignores what, for many, would be the most interesting part of Tucker's story – his 18 escapes. Instead, Lowery puts them all together into one superb montage.\r\n\r\nHowever, for all that, Lowery's primary goal is not to tell the story of Tucker, or even to introduce the character to the audience. It's to create an ode to an icon, and that icon is Robert Redford. Tucker's story is basically a vehicle which Lowery uses to celebrate Redford; the character is always there, but he exists behind the actor, rather than the other way around. What I mean by this is perhaps best explained by citing its inverse – an actor disappearing into a character; think Daniel Day-Lewis in Paul Thomas Anderson's _Phantom Thread_ (2017). In _Old Man_, the audience is never allowed to forget that this is Robert Redford on screen, to the point where the performance is self-referential. Indeed, during the escape montage, there's even a clip of Redford from another film, Arthur Penn's _The Chase_ (1966). There's an obvious correlation between Tucker and Redford of which Lowery wants the audience to be very aware – they are both elderly, and still doing what they do best, reluctant to stop, with a massive CV to prove it. We can never look past the fact that Tucker is played by Redford, and for the most part, Redford is playing Redford, with the film existing in large part only because it explicitly leans on his back catalogue and real-life legacy. Essentially, the whole thing is an extended metatextual allegory for Redford's own impending retirement, not to mention his reluctance to let go.\r\n\r\nAs one would expect from Lowery, aesthetically, the film is fascinating. Lowery is very unusual in the sense that, thus far, he has never used the same cinematographer twice – _St. Nick_ was shot by Clay Liford; _Ain't Them Bodies Saints_ by Bradford Young; _Pete's Dragon_ by Bojan Bazelli; _A Ghost Story_ by Andrew Droz Palermo; and _Old Man_ by Joe Anderson. Stylistically, the film is most similar to _A Ghost Story_, which was shot 1.33:1. _The Old Man & the Gun_ is 2.39:1, but the cinematography is extremely unique, with the celluloid having a gritty, grainy quality, almost as if it were an amateur project. This is because Lowery shot on Super 16, doing so because he wanted it to look like it had been made in the period in which it was set. This is in direct contrast to, say, how Michael Mann shot _Public Enemies_ (2009), which was 2.35:1, shot on Kodak Vision3 500T 5219 film with modern Arriflex 235s, Arriflex 435s, Sony CineAlta F23s, Sony CineAlta HDC-F950s, and Sony PMW-EX1s, with the use of fast, seemingly anachronistic, digital photography creating a sense that what was happening on screen wasn't necessarily taking place in the past, but could easily have been taking place right now. Lowery, in contrast, tries to suture the viewer into the past _milieu_.\r\n\r\nIn relation to this, Anderson tells _Filmmaker Magazine_,\r\n\r\n> _when making a period piece, I think to really do it well and transport the audience back in time you have to acknowledge the way movies were made in the period that the story is set in._\r\n\r\nHe also tells _Deadline_,\r\n\r\n> _we didn't take an overly technical approach to the cinematography. Sometimes there's little bumps in camera moves, and a pan isn't necessarily perfectly controlled, and it has a lot of personality._\r\n\r\nAdditionally, the news broadcasts were shot using period-accurate video equipment. Initially, the producers wanted to shoot on cheaper digital and then degrade the images, but Anderson insisted on using '80s-era video cameras.\r\n\r\nAnother important aesthetic point is how much Lowery has obviously been influenced by the aforementioned Mann, to whom there are several homages – the diner scene recalls a similarly shot scene between James Caan and Tuesday Weld in _Thief_ (1981); the scene in the toilet where Hunt approaches Tucker is an obvious nod to Al Pacino confronting Robert De Niro in _Heat_ (1995); and the scene of Tucker gaining inspiration whilst sitting in a cinema recalls a scene where Dillinger (Johnny Depp) does the same thing in _Public Enemies_. In relation to this scene, the movie Tucker is watching is Monte Hellman's _Two-Lane Blacktop_ (1971), a film depicting the openness and freedom of the American highway. Of this choice, Lowery tells _SlashFilm_,\r\n\r\n> _I didn't intend for that movie to be in the movie. We paid homage to_ Blacktop _already when we shot the chase scene with the '55 Chevy, but when I was trying to figure out what movie they'd be watching at the movie theatre, so I just decided one day to try that clip from_ Two-Lane Blacktop _and the resonance it had was just perfect._\r\n\r\nIn terms of problems, there are a few. Indeed, we've covered one of them already – for many, the film will depend far too much on Redford, specifically the self-referential allusions to his career and legacy. If you're not a fan of his, you will get zero from this, absolutely nothing. Similarly, if you aren't familiar with at least some of his previous work, and his status in Hollywood, the whole thing will probably seem inconsequential. Another problem I have concerns Affleck. I know he's a celebrated actor and so forth, but for me, he plays himself in every single movie. There is virtually nothing to distinguish Hunt from Robert Ford in Andrew Dominik's _The Assassination of Jesse James by the Coward Robert Ford_ (2007) or Les Chandler from Kenneth Lonergan's _Manchester by the Sea_ (2016) or either of his performances in previous Lowery films. Every performance he gives, he plays a character with the weight of the world on his shoulders, shuffling around, speaking in a low-key hang-dog voice, reluctant to make eye contact, shifting on his feet. The exact same thing in every film, with the exception of Scott Cooper's underrated _Out of the Furnace_ (2013), where he showed some fire.\r\n\r\nLowery also has a strange habit of introducing themes which seem to be setting something up, only to completely abandon them without any kind of engagement. This is most obvious in relation to Hunt's inter-racial marriage and their two mixed-race children. This is a fictional element added by Lowery, so one assumes there was some thought behind it. But this is Texas in 1981; there wouldn't have been a huge amount of mixed marriages. Yet Lowery seems to portray it as if it's the most normal thing in the world. Indeed, for the wife and children, life is fairly idyllic, with not a hint of any kind of societal disapproval. My point is why would you introduce a mixed-race marriage into this _milieu_ without commenting on it. Lowery obviously has little interest in exploring the social reality of race relations in Texas in the early 1980s, which is fair enough, but if that's the case, why bother raising the issue at all? I'm also mystified as to what we're supposed to make of the scene where one of Hunt's daughters writes a get-well card to Ronald Reagan after he was shot by John Hinckley Jr..\r\n\r\nThese issues aside, however, _The Old Man & the Gun_ is a fine film. As much about Robert Redford as it is Forrest Tucker, although that won't appeal to everyone, there is much to praise. Made in a key so low, it's practically subterranean, Lowery hinges everything on Redford's presence, and, for the most part, it works well. There's little in here to get overly excited about, but neither is there much to criticise. Yes, the film is somewhat insubstantial, and there's virtually nothing here beyond the Redford/Tucker character, but it's still beautifully made, and, honestly, there's nothing wrong with spending 93 minutes hanging out with Redford, whether he's playing Forrest Tucker or Robert Redford. Whether or not this is actually his last performance remains to be seen, but if it is, it's as fine a send-off as any Hollywood icon could hope for.", "created_at": "2019-07-04T23:59:21.156Z"}, {"movie_id": 429203, "review_id": "63bf7d5805a53300aeced65d", "author_rating": 10.0, "review_text": "Wow, the bottom of the barrel for this film is Casey Affleck and Tom Waits, that's the cinematic equivalent of Washington's cabinet where the weakest among them was John Jay. And even here, Casey probably (while playing himself) played the absolute best depiction of himself that he's ever done. He pulls off the burned out, fed up, hates his job detective i a way that is both totally entertaining and totally believable.\r\n\r\nDanny Glover is the only down side and, honestly it's not because he didn't do a good job, he was lovable, believable, realistic, and maddeningly under-utilized. He leaves you wanting to see more, and unfortunately you never get it.\r\n\r\nBut, of course, the best of the best are Robert Redford and Sissy Spacek who manage to take a film about elderly bank robbers and turn it into a charming love story.\r\n\r\nIt all comes together in a slow burn of a film, punctuated by a pretty hysterical Tom Waits story, that seems to get by exclusively on the charm and characters that are so well developed and so brilliantly acted that you lose track of time.", "created_at": "2023-01-12T03:24:08.946Z"}]