[{"movie_id": 300671, "review_id": "576d82049251414105002546", "author_rating": 8.0, "review_text": "> In an unfriendly environment they got 13 long hours to survive and resist the attack.\r\n\r\nIt is an action-thriller-war version of the 'Argo'. Based on the true story where the most of the film was the 13 hour long armed battle event took place in Libya, 2012. I remember the middle-east's protest over the western films, this story is set in the same time when the islamic terrorists targeted the American diplomatic compounds in Benghazi, but six brave men stood and fought against the uprising.\r\n\r\nIt is an American patriotic film, but because of the hatred over their own countrymen Michael Bay, they're surely missing a nearly a war masterpiece. The rest of the world saw it as a fine film and appreciated that. If you haven't seen it yet, I say just don't ignore it. It was a well made realistic war film, the actors were amazing and the scenes were suspenseful to spectacular. Definitely one of the best in this theme.\r\n\r\nIt was simply focused on the armed conflict between the two forces, so it won't reasons out us how and where it all began, because that might take another film to tell the tale. That's really a very clever writing. In this 150 minute long film, the first act was full of characters and story development. Then begins the gun fight that commences from the dust hours till the dawn breaks out. With many twists in the narration during confrontation, surely not a film to be missed.\r\n\r\n8/10", "created_at": "2016-06-24T18:55:00.997Z"}, {"movie_id": 300671, "review_id": "57cbb526925141420e00102b", "author_rating": 4.0, "review_text": "If you fancy yourself a big swingin' dick yank, then I'd recommend you watch _13 Hours_, but of course, you already have.\r\n\r\nI can move past the xenophobia and jingoism pretty easily, even the typical Bay tropes don't ruin a movie for me, but what I find difficult to abide is boredom, and with _13 Hours_, I personally found that in spades.\r\n\r\nThough it doesn't make a whole lot of sense, though I didn't care about any of the characters, and though I am giving this film a negative review, I can still say it's Michael Bay's best work in years.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2016-09-04T05:46:14.093Z"}, {"movie_id": 300671, "review_id": "640b2de43a4a1200b6eac4c7", "author_rating": 7.0, "review_text": "\"13 Hours: The Secret Soldiers of Benghazi\" is a 2016 war film directed by Michael Bay and starring John Krasinski, Pablo Schreiber, and James Badge Dale. The movie is based on the true story of the attack on the United States diplomatic compound in Benghazi, Libya, on September 11, 2012.\r\n\r\nThe movie follows the story of six CIA contractors who were hired to protect the American diplomatic compound in Benghazi. As the night progresses, the contractors find themselves in the middle of a violent attack by Libyan militants, and they must do everything in their power to protect the compound and the people inside.\r\n\r\nOne of the movie's strongest points is its depiction of the intense and chaotic atmosphere of the attack. Michael Bay's direction and use of action sequences create a sense of urgency and danger that keeps the audience engaged throughout the film. The actors also deliver excellent performances, particularly John Krasinski, who portrays the team leader, and Pablo Schreiber, who plays one of the contractors.\r\n\r\nThe movie also highlights the bravery and heroism of the CIA contractors, who put their lives on the line to protect their fellow Americans. The camaraderie and brotherhood between the contractors are well portrayed, adding emotional weight to the film.\r\n\r\nHowever, the movie's portrayal of the events leading up to the attack and the political aftermath is a weak point. The movie does not provide enough context to understand the complexities of the situation in Libya, and the political commentary feels heavy-handed at times.\r\n\r\nAdditionally, some critics have accused the movie of being overly jingoistic and overly sympathetic to the contractors, painting a one-sided view of the events.\r\n\r\nOverall, \"13 Hours: The Secret Soldiers of Benghazi\" is a well-directed and well-acted war film that effectively portrays the intensity and danger of the Benghazi attack. However, the movie's lack of context and political commentary may be off-putting to some viewers. I rate it 7 out of 10.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:17:24.138Z"}]