[{"movie_id": 303991, "review_id": "57951cafc3a36828e1001526", "author_rating": 7.0, "review_text": "> When we won't feel a thing for a great loss...\r\n\r\nI am observing closely Jake Gyllenhaal's acting career and he's giving the best performances in all his films. He's one of top 5 best actor of our generation. So technically I love all his films, especially in the recent years and tell me who won't if they love good stories and performance. I expected this to be another excellent film and yes it was, but not that great.\r\n\r\nWhat he has given to his fans and film viewers is the promise and fulfilled it all the way. So even an average film can automatically become a better one. This film was based on the one of the blacklisted script, but Gyllenhaal's presence made all the difference along with the wonderful director.\r\n\r\nIt was the story of a man who lost his wife in a car accident. His way of grieving is what the film narrates. He realises that he's not able feel a thing when everyone around does, so he decides to make search for the answers and so the bizarre journey begins. The casting was good, but it was all about the Gyllenhaal's role. I like Naomi Watts, but for the first time she looked old to me. And the others did not have much screenspace, except that new face boy who was decent.\r\n\r\nI think not everyone would enjoy it, it is a weird story of almost a weird person, so you would easily get it. You must need to be a patience, besides it is a dark comedy. You might wonder why the title was named 'Demolition', the films gives a strange demonstration for that in a good way. It is not like a must see, but totally worth for Gyllenhaal alone. I can't say it should have been better, because there's nothing to get better, everything was at its best.\r\n\r\n7/10", "created_at": "2016-07-24T19:53:19.363Z"}, {"movie_id": 303991, "review_id": "63099e8bb7d352007bc9f856", "author_rating": 5.0, "review_text": "Early on in Demolition there is a brief but interesting scene. Davis Mitchell (Jake Gyllenhaal) is looking in a mirror, crying the way bad actors do – i.e., contorting the face to compensate for the inability to produce tears.\r\n\r\nGyllenhaal is of course far from a bad actor, and sure enough, Davis immediately regains his composure. Was he rehearsing? Quite possibly, especially when you consider that he seems more concerned with the faulty vending machine in the hospital hallway than the fact that his wife Julia (Heather Lind) has just died in a car accident.\r\n\r\nBut Davis is not a heartless bastard; he simply finds it easier to depend on the kindness of strangers. For example, the letter he writes to the vending machine company, which quickly becomes a confessional epistle, and gives us a clue to his impassive reaction to Julia's death.\r\n\r\nIn contrast, Davis is unable to relate to Phil Eastwood (Chris Cooper), Julia's father. As usual, Cooper delivers the goods, in particular an emotional speech about how there is no word – such as ‘orphan’ or ‘widower’ – to describe someone who has lost a child.\r\n\r\nIronically, while we've been fascinated by Cooper's craft, Davis’s mind has been wandering, trying to discern why the drinks are so expensive at the restaurant where they're at, without taking the slightest notice of a single word his father-in-law has said.\r\n\r\nMeanwhile, the letters he will continue to write to the vending machine company customer service department become his main outlet. In a delightful plot twist, Karen Moreno (Naomi Watts), the company's only customer service rep, has been moved to tears by Davis's missives, and begins talking to him on the phone.\r\n\r\nDavis is certainly an intriguing character, and to develop him Gyllenhaal has borrowed from others as well as himself. Davis is outwardly a vain, aloof yuppie like Christian Bale in American Psycho – although instead of dismembering people, he takes apart machines, not bothering to put them back together again.\r\n\r\nAt the same time, he undergoes an inner transformation that is a combination of Kevin Spacey's in American Beauty and Ron Livingston's in Office Space. Also, Davis becomes the opposite of Gyllenhaal's character in Moonlight Mile.\r\n\r\nUnfortunately, Demolition loses momentum in the second half, with director Jean-Marc Vallée putting the plot on autopilot. Davis and Karen's relationship is perfect when limited to letters and phone calls, but goes awry as soon as they meet in person. Additionally, and completely out of the clear blue sky, Davis is diagnosed with a rare medical condition that results in part of his heart being apparently eaten by “gypsy moths.” The hell?.\r\n\r\nAll things considered, Demolition feels familiar, and we can recognize elements we've seen elsewhere, but while some of it is clichéd, the outside-the-box use of some of those familiar elements is in itself refreshing; furthermore, Gyllenhaal provides another stellar performance.", "created_at": "2022-08-27T04:33:15.639Z"}]