[{"movie_id": 13572, "review_id": "59c229fbc3a3682c6f00976f", "author_rating": 5.0, "review_text": "Twister? Alledgedly...\r\n\r\nFrom the middle tier of what we know as being Neo-Noir, Twisted is a frustrating experience. Right off the bat the cast list boasts weighty worth, giving us the promise of a dramatic thriller, filmed on location in Frisco, with misty lenses, lamp lights, waterside moods etc, it's set up a treat. As is the premise...\r\n\r\nAshley Judd stars as a newly promoted hot-shot police detective, who in quality noir traditions has a whole heap of problems going on. Her family back story is shattering, she herself is heavily reliant on alcohol and she likes casual sex with strangers, strangers who start turning up dead, the kicker of which sees her basically investigating herself as a the prime suspect! Unfortunately with everything in place the pic never shifts out of first gear. The red herrings stack up, but nothing with any real conviction, and the whole premise starts to get monotonous, worse still the big reveal really isn't a surprise. There was a raft of these type of films in the 80s and 90s that were done much better, and on completion of viewing this effort one hankers for those pics - not to mention for the film noir of old!\r\n\r\nAshley Judd always frustrates, one can see a very good actress in her body of work, but she's more often than not starring in so so thrillers. It can possibly argued that her co-star Andy Garcia is a great actor who hasn't reached the heights he should have, the days of The Untouchables and Godfather III seeming to be fleeting glimpses of talent. Here he gets a thankless role that's poorly written, while both Samuel L. Jackson and David Strathairn add nice touches but aren't asked to extend themselves. Directed by Phillip Kaufman who as with Rising Sun, here also looks out of his comfort zone with the genre. But the presence of Mulholland Dr DOP Peter Deming is noticeable and one of the pics strengths. 5/10", "created_at": "2017-09-20T08:42:35.390Z"}]