[{"movie_id": 102651, "review_id": "53f11f71c3a3685aed003112", "author_rating": 7.5, "review_text": "Nice re-interpretation of the sleeping beauty children's tale. Angelina Jolie has some really good moments in which a simple smile from her can make you shit your pants, although the interpretation is, in some parts, irregular. Elle Fanning is not a good option as \"the Beauty\" in the same way Kristen Stewart wasn't for Snow White. Angelina eats completely her role as Charlize Theron eat Stewart's. Sharito Copley has a great performance, as always, and the FX are really decent.", "created_at": "2014-08-17T21:32:33.813Z"}, {"movie_id": 102651, "review_id": "544e81b9c3a36865a4000268", "author_rating": 8.0, "review_text": "When I first read about this movie I was not entirely sure whether I liked the idea or not. After having watched it I have to say that I really liked it. It is a nice fairy tale based on the Sleeping Beauty but from the perspective of the evil fairy (who is not really that evil actually) instead. As far as I am concerned the concept worked surprisingly well.\r\n\r\nObviously the story is highly rewritten compared to the original Sleeping Beauty story. Whether that is good or bad is probably a matter of personal opinion. I think it is good since it allowed to story in the movie to have its own merits and not be too dependent on the original. It works for me since the original story is not very present except and thus you do not get any annoyed every so often because the deviate from the “original” since the movie clearly demonstrated that it intended to be quite different from the start.\r\n\r\nThe movie is quite beautiful with a typical fairy-tale air to it and at the same time dark and ominous during the scenes that required it. There are plenty of CGI of course and, to me, it was all quite well done. Angeline Jolie did a good job as Maleficent. I was actually less impressed by the three fairies that were supposed to take care of the princess though. They tried to be funny but it never really became very funny.\r\n\r\nOn the whole I found this to be a very enjoyable movie. So did the kids by the way. When I watched it  (with the kids) the kids had already watched it twice.", "created_at": "2014-10-27T17:32:41.632Z"}, {"movie_id": 102651, "review_id": "58ac4b1ac3a36849b00120de", "author_rating": 9.0, "review_text": "Today, June 4, I went to see Maleficent on the birthday of its star, Angelina Jolie. In itself, nothing more than a funny coincidence, although when you think about it, it is customary for someone who is celebrating their birthday, to hand out treats. And boy, this was the best treat ever.\r\n\r\nThree reasons why I was completely stoked to see Maleficent after hearing about it for the first time about a year and a half ago: 1) I love Angelina. 2) I love Sleeping Beauty. 3) Maleficent is my favourite fairy tale villain of all time. On the other hand, I was also a little wary of the way they had apparently altered the story. See, if there is one thing I hate in films, it's when they explain and justify the motives and reasons why a certain character is \"bad\". I for one believe that some people are just plain evil and that's the way it is. And going into this persons' childhood and explaining how bad everything was (or something to that effect) only works to weaken that characters' force. Now, I don't know why a somewhat clichéd story about the love and betrayal of a young Maleficent (who apparently used to be good and pure-hearted), worked here, but somehow it just did. It completely surprised me, to be honest. I'm usually allergic to this kind of fluff, but it worked! Maleficents' back-story actually intrigued me, moved me even. And it succeeded at what it was supposed to do in the first place: it made Maleficent human.\r\n\r\nIn the end though, they could have written any kind of story about what is undoubtedly Disney's most beloved villainess, it never would have been raised to an above-par level without its most crucial element: Angelina Jolie. I might sound biased because I'm such a fan, but I am perfectly able to look at her performances in a critical way, and I can only say this about her performance as Maleficent: she was in one word, perfect. I honestly can't imagine any other actress who could have approached this role with the same flawless combination of properties (short of maybe Charlize Theron): she is beautiful and very charismatic, yet at the same time undeniably cruel and cold. She was everything I had hoped this real life characterization of Maleficent would be, and then some. \r\n\r\nCompliments also go out to the three other main actors in this film. First to Elle Fanning, for being very convincing as the young princess Aurora. She is sweet, lovely and kind and she has the right personality to play this famous princess just the way she should be. Second, to Sam Riley, who was a pleasant surprise as Maleficents' pet raven Diaval in human form. I was thus far unfamiliar with his work, but he was very well suited to his role and I enjoyed watching him. Last, but certainly not least, Sharlto Copley, who has already thrilled me with his performances in District 9 and Elysium, and who has now definitely made a fan out of me. His range is awesome and he was totally terrifying as Stefan.\r\n\r\nOK, there are some things you have to look past. My first, and most blatant, issue with this film is: if young Maleficent was a good, pure- hearted girl, then why did she, as an innocent 10-year-old, already have evil-looking horns, devilish wings and is she called \"Maleficent\"? Right… Secondly, I found the three pixies to be very unconvincing and even somewhat annoying CGI-wise. Overall the special effects are well done but the pixies were definitely an eyesore. The dragon in the end also looked a bit unreal. \r\n\r\nThat being said, Maleficents' costumes and make-up were absolutely stunning. I just couldn't get enough of gazing at her intricate headdresses and beautiful gowns. The costume and styling department really deserve top credit and I truly hope there will be some awards for them in the near future. The music was also great, with flawless scoring by James Newton Howard and a terrific rendition of \"Once upon a dream\" by Lana Del Rey over the end credits. Also, awesome battle scenes and action sequences galore!\r\n\r\nGoing into this film, I thought it would be nothing more than a so-so, kind of fun summer flick. A 6.5/7 maybe. Sometimes, I love it when I'm wrong. Out of the three films that I've seen at the cinema over the last week (the other two being X-Men and Godzilla, both disappointments…) I can tell you, Maleficent was by far the most gratifying. Perhaps because I had relatively low expectations, perhaps because it was simply that good.\r\n\r\nOne serious warning for the rough, rugged men out there: this film features pixies, fairies, sparkly thingies and magical fluff out the wazoo. If you're going to see this, do it for Angelina. If not, treat this film like kryptonite. You will thank me later.\r\n\r\nTo everyone else: go see this film. It will rock your socks off. Maleficent is magnificent.\r\n_(June 2014)_", "created_at": "2017-02-21T14:13:46.497Z"}, {"movie_id": 102651, "review_id": "5f349e51f6fd18003528df9e", "author_rating": 7.0, "review_text": "Good watch, would watch again, and can recommend.\r\n\r\nI'm not a big Angelina Jolie (\"Lara Croft: Tomb Raider\") fan, but she definitely nailed the part, and I felt for her when those things happened, so I'm definitely not going to say she's not a good actor.\r\n\r\nElle Fanning (\"The Great\") is great, mostly an annoyingly happy little thing while she's awake, alongside wonderful supporting cast and gorgeous (and sometimes goofy) CG animated creatures.\r\n\r\nDisney definitely poured money into this to make it look great.  They also spent quite the effort to revitalize the story.  After rewatching \"Sleeping Beauty\" and some other variations (I did fail to reread the original story), I am definitely a fan of the direction they took.  The original story was just so weak and empty, and this does one of my favorite things and humanizes a villain into an adversery into of an evil monster.\r\n\r\nI'm not a fan of how or why the 3 faeries get involved, but it makes some sense.  And I'm very happy with how they handled the resolution of the curse.\r\n\r\nThey created this awesome world which adds to the movie in a very special way.", "created_at": "2020-08-13T01:58:41.494Z"}, {"movie_id": 102651, "review_id": "5fad604590ea4b00419d8cfe", "author_rating": 7.0, "review_text": "Not as dark or deep as I was expecting/wanting, but it is cool to see a different telling of <em>'Sleeping Beauty'</em>.\r\n\r\nAngelina Jolie fits as the titular character, bringing with her a good performance. Elle Fanning (Aurora), Sharlto Copley (Stefan) and Sam Riley (Diaval) play their respective roles well enough, but neither come close to matching Jolie - as you'd probably expect.\r\n\r\nI found the special effects a bit iffy. It's not that it looks anything close to bad, I just thought it could've looked better. The score isn't all that memorable, either. I did enjoy how the plot unfolds though, mainly thanks to the lead admittedly.\r\n\r\nIntrigued to see what the sequel to <em>'Maleficent'</em> has to offer.", "created_at": "2020-11-12T16:18:13.137Z"}, {"movie_id": 102651, "review_id": "61a377faa3d02700850296c2", "author_rating": 9.0, "review_text": "_TL:DR  \r\nAn enchanting retelling of a classic story which really holds it's own with the changes in it's story-line. If you love magical worlds, definitely give this one a watch! (7/10 on the Dragon-Scale for including two very badass dragons!)_\r\n\r\nI truly appreciate the modern trend of humanizing the \"villains\" in a story, real life is rarely as simple as: 'This person is just evil.' and it allows for so much more depth and emotional investment in both protagonists and antagonists.\r\n\r\nHats off to the visual effects team for making the Moors feel truly enchanted, with many magical critters and beautifully strange fauna all pining for your attention. Everything feels like it has it's own personality through their movement and design, making the whole movie a feast for the eyes. (And I of-course cannot forget the raven-like aspects in all of Diaval's forms. Raven dragon? Yes please!)\r\n\r\nAs for the story, it takes great inspiration from the original but brings it's own charms to the table. Opting to take the 'Parental Love' definition of true love, rather than Romantic Love. Which is a decision I personally can get behind. (Even _if_ Maleficent is not Aurora's birth-mother, she has certainly been more of a mother to her than her biological mother. Which is another great message to send!)\r\n\r\nLastly, what did I get out of the story? When we're young, we tend to be young, naïve and have an optimistic colorful view of the world. And something will inevitably happen to change our views and jade us. (Making our outlook darker and thornier. _Wink wink nudge nudge._) \r\n\r\nThis new outlook will usually stay for years, if not for life, but sometimes we find something or someone who revives (part of) the child we all have inside of us that we wish dearly to protect. (The Moors going from colorful to dark and back to colorful again.) And I can certainly find myself in that.", "created_at": "2021-11-28T12:37:14.237Z"}, {"movie_id": 102651, "review_id": "64b5f7e978570e011daa7b7d", "author_rating": 7.0, "review_text": "Good movie seeing how maleficent became maleficent. Pretty bogus what they did to her. Now she fights to get her wings back.", "created_at": "2023-07-18T02:24:41.596Z"}, {"movie_id": 102651, "review_id": "53f11f71c3a3685aed003112", "author_rating": 7.5, "review_text": "Nice re-interpretation of the sleeping beauty children's tale. Angelina Jolie has some really good moments in which a simple smile from her can make you shit your pants, although the interpretation is, in some parts, irregular. Elle Fanning is not a good option as \"the Beauty\" in the same way Kristen Stewart wasn't for Snow White. Angelina eats completely her role as Charlize Theron eat Stewart's. Sharito Copley has a great performance, as always, and the FX are really decent.", "created_at": "2014-08-17T21:32:33.813Z"}, {"movie_id": 102651, "review_id": "544e81b9c3a36865a4000268", "author_rating": 8.0, "review_text": "When I first read about this movie I was not entirely sure whether I liked the idea or not. After having watched it I have to say that I really liked it. It is a nice fairy tale based on the Sleeping Beauty but from the perspective of the evil fairy (who is not really that evil actually) instead. As far as I am concerned the concept worked surprisingly well.\r\n\r\nObviously the story is highly rewritten compared to the original Sleeping Beauty story. Whether that is good or bad is probably a matter of personal opinion. I think it is good since it allowed to story in the movie to have its own merits and not be too dependent on the original. It works for me since the original story is not very present except and thus you do not get any annoyed every so often because the deviate from the “original” since the movie clearly demonstrated that it intended to be quite different from the start.\r\n\r\nThe movie is quite beautiful with a typical fairy-tale air to it and at the same time dark and ominous during the scenes that required it. There are plenty of CGI of course and, to me, it was all quite well done. Angeline Jolie did a good job as Maleficent. I was actually less impressed by the three fairies that were supposed to take care of the princess though. They tried to be funny but it never really became very funny.\r\n\r\nOn the whole I found this to be a very enjoyable movie. So did the kids by the way. When I watched it  (with the kids) the kids had already watched it twice.", "created_at": "2014-10-27T17:32:41.632Z"}, {"movie_id": 102651, "review_id": "58ac4b1ac3a36849b00120de", "author_rating": 9.0, "review_text": "Today, June 4, I went to see Maleficent on the birthday of its star, Angelina Jolie. In itself, nothing more than a funny coincidence, although when you think about it, it is customary for someone who is celebrating their birthday, to hand out treats. And boy, this was the best treat ever.\r\n\r\nThree reasons why I was completely stoked to see Maleficent after hearing about it for the first time about a year and a half ago: 1) I love Angelina. 2) I love Sleeping Beauty. 3) Maleficent is my favourite fairy tale villain of all time. On the other hand, I was also a little wary of the way they had apparently altered the story. See, if there is one thing I hate in films, it's when they explain and justify the motives and reasons why a certain character is \"bad\". I for one believe that some people are just plain evil and that's the way it is. And going into this persons' childhood and explaining how bad everything was (or something to that effect) only works to weaken that characters' force. Now, I don't know why a somewhat clichéd story about the love and betrayal of a young Maleficent (who apparently used to be good and pure-hearted), worked here, but somehow it just did. It completely surprised me, to be honest. I'm usually allergic to this kind of fluff, but it worked! Maleficents' back-story actually intrigued me, moved me even. And it succeeded at what it was supposed to do in the first place: it made Maleficent human.\r\n\r\nIn the end though, they could have written any kind of story about what is undoubtedly Disney's most beloved villainess, it never would have been raised to an above-par level without its most crucial element: Angelina Jolie. I might sound biased because I'm such a fan, but I am perfectly able to look at her performances in a critical way, and I can only say this about her performance as Maleficent: she was in one word, perfect. I honestly can't imagine any other actress who could have approached this role with the same flawless combination of properties (short of maybe Charlize Theron): she is beautiful and very charismatic, yet at the same time undeniably cruel and cold. She was everything I had hoped this real life characterization of Maleficent would be, and then some. \r\n\r\nCompliments also go out to the three other main actors in this film. First to Elle Fanning, for being very convincing as the young princess Aurora. She is sweet, lovely and kind and she has the right personality to play this famous princess just the way she should be. Second, to Sam Riley, who was a pleasant surprise as Maleficents' pet raven Diaval in human form. I was thus far unfamiliar with his work, but he was very well suited to his role and I enjoyed watching him. Last, but certainly not least, Sharlto Copley, who has already thrilled me with his performances in District 9 and Elysium, and who has now definitely made a fan out of me. His range is awesome and he was totally terrifying as Stefan.\r\n\r\nOK, there are some things you have to look past. My first, and most blatant, issue with this film is: if young Maleficent was a good, pure- hearted girl, then why did she, as an innocent 10-year-old, already have evil-looking horns, devilish wings and is she called \"Maleficent\"? Right… Secondly, I found the three pixies to be very unconvincing and even somewhat annoying CGI-wise. Overall the special effects are well done but the pixies were definitely an eyesore. The dragon in the end also looked a bit unreal. \r\n\r\nThat being said, Maleficents' costumes and make-up were absolutely stunning. I just couldn't get enough of gazing at her intricate headdresses and beautiful gowns. The costume and styling department really deserve top credit and I truly hope there will be some awards for them in the near future. The music was also great, with flawless scoring by James Newton Howard and a terrific rendition of \"Once upon a dream\" by Lana Del Rey over the end credits. Also, awesome battle scenes and action sequences galore!\r\n\r\nGoing into this film, I thought it would be nothing more than a so-so, kind of fun summer flick. A 6.5/7 maybe. Sometimes, I love it when I'm wrong. Out of the three films that I've seen at the cinema over the last week (the other two being X-Men and Godzilla, both disappointments…) I can tell you, Maleficent was by far the most gratifying. Perhaps because I had relatively low expectations, perhaps because it was simply that good.\r\n\r\nOne serious warning for the rough, rugged men out there: this film features pixies, fairies, sparkly thingies and magical fluff out the wazoo. If you're going to see this, do it for Angelina. If not, treat this film like kryptonite. You will thank me later.\r\n\r\nTo everyone else: go see this film. It will rock your socks off. Maleficent is magnificent.\r\n_(June 2014)_", "created_at": "2017-02-21T14:13:46.497Z"}, {"movie_id": 102651, "review_id": "5f349e51f6fd18003528df9e", "author_rating": 7.0, "review_text": "Good watch, would watch again, and can recommend.\r\n\r\nI'm not a big Angelina Jolie (\"Lara Croft: Tomb Raider\") fan, but she definitely nailed the part, and I felt for her when those things happened, so I'm definitely not going to say she's not a good actor.\r\n\r\nElle Fanning (\"The Great\") is great, mostly an annoyingly happy little thing while she's awake, alongside wonderful supporting cast and gorgeous (and sometimes goofy) CG animated creatures.\r\n\r\nDisney definitely poured money into this to make it look great.  They also spent quite the effort to revitalize the story.  After rewatching \"Sleeping Beauty\" and some other variations (I did fail to reread the original story), I am definitely a fan of the direction they took.  The original story was just so weak and empty, and this does one of my favorite things and humanizes a villain into an adversery into of an evil monster.\r\n\r\nI'm not a fan of how or why the 3 faeries get involved, but it makes some sense.  And I'm very happy with how they handled the resolution of the curse.\r\n\r\nThey created this awesome world which adds to the movie in a very special way.", "created_at": "2020-08-13T01:58:41.494Z"}, {"movie_id": 102651, "review_id": "5fad604590ea4b00419d8cfe", "author_rating": 7.0, "review_text": "Not as dark or deep as I was expecting/wanting, but it is cool to see a different telling of <em>'Sleeping Beauty'</em>.\r\n\r\nAngelina Jolie fits as the titular character, bringing with her a good performance. Elle Fanning (Aurora), Sharlto Copley (Stefan) and Sam Riley (Diaval) play their respective roles well enough, but neither come close to matching Jolie - as you'd probably expect.\r\n\r\nI found the special effects a bit iffy. It's not that it looks anything close to bad, I just thought it could've looked better. The score isn't all that memorable, either. I did enjoy how the plot unfolds though, mainly thanks to the lead admittedly.\r\n\r\nIntrigued to see what the sequel to <em>'Maleficent'</em> has to offer.", "created_at": "2020-11-12T16:18:13.137Z"}, {"movie_id": 102651, "review_id": "61a377faa3d02700850296c2", "author_rating": 9.0, "review_text": "_TL:DR  \r\nAn enchanting retelling of a classic story which really holds it's own with the changes in it's story-line. If you love magical worlds, definitely give this one a watch! (7/10 on the Dragon-Scale for including two very badass dragons!)_\r\n\r\nI truly appreciate the modern trend of humanizing the \"villains\" in a story, real life is rarely as simple as: 'This person is just evil.' and it allows for so much more depth and emotional investment in both protagonists and antagonists.\r\n\r\nHats off to the visual effects team for making the Moors feel truly enchanted, with many magical critters and beautifully strange fauna all pining for your attention. Everything feels like it has it's own personality through their movement and design, making the whole movie a feast for the eyes. (And I of-course cannot forget the raven-like aspects in all of Diaval's forms. Raven dragon? Yes please!)\r\n\r\nAs for the story, it takes great inspiration from the original but brings it's own charms to the table. Opting to take the 'Parental Love' definition of true love, rather than Romantic Love. Which is a decision I personally can get behind. (Even _if_ Maleficent is not Aurora's birth-mother, she has certainly been more of a mother to her than her biological mother. Which is another great message to send!)\r\n\r\nLastly, what did I get out of the story? When we're young, we tend to be young, naïve and have an optimistic colorful view of the world. And something will inevitably happen to change our views and jade us. (Making our outlook darker and thornier. _Wink wink nudge nudge._) \r\n\r\nThis new outlook will usually stay for years, if not for life, but sometimes we find something or someone who revives (part of) the child we all have inside of us that we wish dearly to protect. (The Moors going from colorful to dark and back to colorful again.) And I can certainly find myself in that.", "created_at": "2021-11-28T12:37:14.237Z"}, {"movie_id": 102651, "review_id": "64b5f7e978570e011daa7b7d", "author_rating": 7.0, "review_text": "Good movie seeing how maleficent became maleficent. Pretty bogus what they did to her. Now she fights to get her wings back.", "created_at": "2023-07-18T02:24:41.596Z"}, {"movie_id": 102651, "review_id": "53f11f71c3a3685aed003112", "author_rating": 7.5, "review_text": "Nice re-interpretation of the sleeping beauty children's tale. Angelina Jolie has some really good moments in which a simple smile from her can make you shit your pants, although the interpretation is, in some parts, irregular. Elle Fanning is not a good option as \"the Beauty\" in the same way Kristen Stewart wasn't for Snow White. Angelina eats completely her role as Charlize Theron eat Stewart's. Sharito Copley has a great performance, as always, and the FX are really decent.", "created_at": "2014-08-17T21:32:33.813Z"}, {"movie_id": 102651, "review_id": "544e81b9c3a36865a4000268", "author_rating": 8.0, "review_text": "When I first read about this movie I was not entirely sure whether I liked the idea or not. After having watched it I have to say that I really liked it. It is a nice fairy tale based on the Sleeping Beauty but from the perspective of the evil fairy (who is not really that evil actually) instead. As far as I am concerned the concept worked surprisingly well.\r\n\r\nObviously the story is highly rewritten compared to the original Sleeping Beauty story. Whether that is good or bad is probably a matter of personal opinion. I think it is good since it allowed to story in the movie to have its own merits and not be too dependent on the original. It works for me since the original story is not very present except and thus you do not get any annoyed every so often because the deviate from the “original” since the movie clearly demonstrated that it intended to be quite different from the start.\r\n\r\nThe movie is quite beautiful with a typical fairy-tale air to it and at the same time dark and ominous during the scenes that required it. There are plenty of CGI of course and, to me, it was all quite well done. Angeline Jolie did a good job as Maleficent. I was actually less impressed by the three fairies that were supposed to take care of the princess though. They tried to be funny but it never really became very funny.\r\n\r\nOn the whole I found this to be a very enjoyable movie. So did the kids by the way. When I watched it  (with the kids) the kids had already watched it twice.", "created_at": "2014-10-27T17:32:41.632Z"}, {"movie_id": 102651, "review_id": "58ac4b1ac3a36849b00120de", "author_rating": 9.0, "review_text": "Today, June 4, I went to see Maleficent on the birthday of its star, Angelina Jolie. In itself, nothing more than a funny coincidence, although when you think about it, it is customary for someone who is celebrating their birthday, to hand out treats. And boy, this was the best treat ever.\r\n\r\nThree reasons why I was completely stoked to see Maleficent after hearing about it for the first time about a year and a half ago: 1) I love Angelina. 2) I love Sleeping Beauty. 3) Maleficent is my favourite fairy tale villain of all time. On the other hand, I was also a little wary of the way they had apparently altered the story. See, if there is one thing I hate in films, it's when they explain and justify the motives and reasons why a certain character is \"bad\". I for one believe that some people are just plain evil and that's the way it is. And going into this persons' childhood and explaining how bad everything was (or something to that effect) only works to weaken that characters' force. Now, I don't know why a somewhat clichéd story about the love and betrayal of a young Maleficent (who apparently used to be good and pure-hearted), worked here, but somehow it just did. It completely surprised me, to be honest. I'm usually allergic to this kind of fluff, but it worked! Maleficents' back-story actually intrigued me, moved me even. And it succeeded at what it was supposed to do in the first place: it made Maleficent human.\r\n\r\nIn the end though, they could have written any kind of story about what is undoubtedly Disney's most beloved villainess, it never would have been raised to an above-par level without its most crucial element: Angelina Jolie. I might sound biased because I'm such a fan, but I am perfectly able to look at her performances in a critical way, and I can only say this about her performance as Maleficent: she was in one word, perfect. I honestly can't imagine any other actress who could have approached this role with the same flawless combination of properties (short of maybe Charlize Theron): she is beautiful and very charismatic, yet at the same time undeniably cruel and cold. She was everything I had hoped this real life characterization of Maleficent would be, and then some. \r\n\r\nCompliments also go out to the three other main actors in this film. First to Elle Fanning, for being very convincing as the young princess Aurora. She is sweet, lovely and kind and she has the right personality to play this famous princess just the way she should be. Second, to Sam Riley, who was a pleasant surprise as Maleficents' pet raven Diaval in human form. I was thus far unfamiliar with his work, but he was very well suited to his role and I enjoyed watching him. Last, but certainly not least, Sharlto Copley, who has already thrilled me with his performances in District 9 and Elysium, and who has now definitely made a fan out of me. His range is awesome and he was totally terrifying as Stefan.\r\n\r\nOK, there are some things you have to look past. My first, and most blatant, issue with this film is: if young Maleficent was a good, pure- hearted girl, then why did she, as an innocent 10-year-old, already have evil-looking horns, devilish wings and is she called \"Maleficent\"? Right… Secondly, I found the three pixies to be very unconvincing and even somewhat annoying CGI-wise. Overall the special effects are well done but the pixies were definitely an eyesore. The dragon in the end also looked a bit unreal. \r\n\r\nThat being said, Maleficents' costumes and make-up were absolutely stunning. I just couldn't get enough of gazing at her intricate headdresses and beautiful gowns. The costume and styling department really deserve top credit and I truly hope there will be some awards for them in the near future. The music was also great, with flawless scoring by James Newton Howard and a terrific rendition of \"Once upon a dream\" by Lana Del Rey over the end credits. Also, awesome battle scenes and action sequences galore!\r\n\r\nGoing into this film, I thought it would be nothing more than a so-so, kind of fun summer flick. A 6.5/7 maybe. Sometimes, I love it when I'm wrong. Out of the three films that I've seen at the cinema over the last week (the other two being X-Men and Godzilla, both disappointments…) I can tell you, Maleficent was by far the most gratifying. Perhaps because I had relatively low expectations, perhaps because it was simply that good.\r\n\r\nOne serious warning for the rough, rugged men out there: this film features pixies, fairies, sparkly thingies and magical fluff out the wazoo. If you're going to see this, do it for Angelina. If not, treat this film like kryptonite. You will thank me later.\r\n\r\nTo everyone else: go see this film. It will rock your socks off. Maleficent is magnificent.\r\n_(June 2014)_", "created_at": "2017-02-21T14:13:46.497Z"}, {"movie_id": 102651, "review_id": "5f349e51f6fd18003528df9e", "author_rating": 7.0, "review_text": "Good watch, would watch again, and can recommend.\r\n\r\nI'm not a big Angelina Jolie (\"Lara Croft: Tomb Raider\") fan, but she definitely nailed the part, and I felt for her when those things happened, so I'm definitely not going to say she's not a good actor.\r\n\r\nElle Fanning (\"The Great\") is great, mostly an annoyingly happy little thing while she's awake, alongside wonderful supporting cast and gorgeous (and sometimes goofy) CG animated creatures.\r\n\r\nDisney definitely poured money into this to make it look great.  They also spent quite the effort to revitalize the story.  After rewatching \"Sleeping Beauty\" and some other variations (I did fail to reread the original story), I am definitely a fan of the direction they took.  The original story was just so weak and empty, and this does one of my favorite things and humanizes a villain into an adversery into of an evil monster.\r\n\r\nI'm not a fan of how or why the 3 faeries get involved, but it makes some sense.  And I'm very happy with how they handled the resolution of the curse.\r\n\r\nThey created this awesome world which adds to the movie in a very special way.", "created_at": "2020-08-13T01:58:41.494Z"}, {"movie_id": 102651, "review_id": "5fad604590ea4b00419d8cfe", "author_rating": 7.0, "review_text": "Not as dark or deep as I was expecting/wanting, but it is cool to see a different telling of <em>'Sleeping Beauty'</em>.\r\n\r\nAngelina Jolie fits as the titular character, bringing with her a good performance. Elle Fanning (Aurora), Sharlto Copley (Stefan) and Sam Riley (Diaval) play their respective roles well enough, but neither come close to matching Jolie - as you'd probably expect.\r\n\r\nI found the special effects a bit iffy. It's not that it looks anything close to bad, I just thought it could've looked better. The score isn't all that memorable, either. I did enjoy how the plot unfolds though, mainly thanks to the lead admittedly.\r\n\r\nIntrigued to see what the sequel to <em>'Maleficent'</em> has to offer.", "created_at": "2020-11-12T16:18:13.137Z"}, {"movie_id": 102651, "review_id": "61a377faa3d02700850296c2", "author_rating": 9.0, "review_text": "_TL:DR  \r\nAn enchanting retelling of a classic story which really holds it's own with the changes in it's story-line. If you love magical worlds, definitely give this one a watch! (7/10 on the Dragon-Scale for including two very badass dragons!)_\r\n\r\nI truly appreciate the modern trend of humanizing the \"villains\" in a story, real life is rarely as simple as: 'This person is just evil.' and it allows for so much more depth and emotional investment in both protagonists and antagonists.\r\n\r\nHats off to the visual effects team for making the Moors feel truly enchanted, with many magical critters and beautifully strange fauna all pining for your attention. Everything feels like it has it's own personality through their movement and design, making the whole movie a feast for the eyes. (And I of-course cannot forget the raven-like aspects in all of Diaval's forms. Raven dragon? Yes please!)\r\n\r\nAs for the story, it takes great inspiration from the original but brings it's own charms to the table. Opting to take the 'Parental Love' definition of true love, rather than Romantic Love. Which is a decision I personally can get behind. (Even _if_ Maleficent is not Aurora's birth-mother, she has certainly been more of a mother to her than her biological mother. Which is another great message to send!)\r\n\r\nLastly, what did I get out of the story? When we're young, we tend to be young, naïve and have an optimistic colorful view of the world. And something will inevitably happen to change our views and jade us. (Making our outlook darker and thornier. _Wink wink nudge nudge._) \r\n\r\nThis new outlook will usually stay for years, if not for life, but sometimes we find something or someone who revives (part of) the child we all have inside of us that we wish dearly to protect. (The Moors going from colorful to dark and back to colorful again.) And I can certainly find myself in that.", "created_at": "2021-11-28T12:37:14.237Z"}, {"movie_id": 102651, "review_id": "64b5f7e978570e011daa7b7d", "author_rating": 7.0, "review_text": "Good movie seeing how maleficent became maleficent. Pretty bogus what they did to her. Now she fights to get her wings back.", "created_at": "2023-07-18T02:24:41.596Z"}, {"movie_id": 102651, "review_id": "53f11f71c3a3685aed003112", "author_rating": 7.5, "review_text": "Nice re-interpretation of the sleeping beauty children's tale. Angelina Jolie has some really good moments in which a simple smile from her can make you shit your pants, although the interpretation is, in some parts, irregular. Elle Fanning is not a good option as \"the Beauty\" in the same way Kristen Stewart wasn't for Snow White. Angelina eats completely her role as Charlize Theron eat Stewart's. Sharito Copley has a great performance, as always, and the FX are really decent.", "created_at": "2014-08-17T21:32:33.813Z"}, {"movie_id": 102651, "review_id": "544e81b9c3a36865a4000268", "author_rating": 8.0, "review_text": "When I first read about this movie I was not entirely sure whether I liked the idea or not. After having watched it I have to say that I really liked it. It is a nice fairy tale based on the Sleeping Beauty but from the perspective of the evil fairy (who is not really that evil actually) instead. As far as I am concerned the concept worked surprisingly well.\r\n\r\nObviously the story is highly rewritten compared to the original Sleeping Beauty story. Whether that is good or bad is probably a matter of personal opinion. I think it is good since it allowed to story in the movie to have its own merits and not be too dependent on the original. It works for me since the original story is not very present except and thus you do not get any annoyed every so often because the deviate from the “original” since the movie clearly demonstrated that it intended to be quite different from the start.\r\n\r\nThe movie is quite beautiful with a typical fairy-tale air to it and at the same time dark and ominous during the scenes that required it. There are plenty of CGI of course and, to me, it was all quite well done. Angeline Jolie did a good job as Maleficent. I was actually less impressed by the three fairies that were supposed to take care of the princess though. They tried to be funny but it never really became very funny.\r\n\r\nOn the whole I found this to be a very enjoyable movie. So did the kids by the way. When I watched it  (with the kids) the kids had already watched it twice.", "created_at": "2014-10-27T17:32:41.632Z"}, {"movie_id": 102651, "review_id": "58ac4b1ac3a36849b00120de", "author_rating": 9.0, "review_text": "Today, June 4, I went to see Maleficent on the birthday of its star, Angelina Jolie. In itself, nothing more than a funny coincidence, although when you think about it, it is customary for someone who is celebrating their birthday, to hand out treats. And boy, this was the best treat ever.\r\n\r\nThree reasons why I was completely stoked to see Maleficent after hearing about it for the first time about a year and a half ago: 1) I love Angelina. 2) I love Sleeping Beauty. 3) Maleficent is my favourite fairy tale villain of all time. On the other hand, I was also a little wary of the way they had apparently altered the story. See, if there is one thing I hate in films, it's when they explain and justify the motives and reasons why a certain character is \"bad\". I for one believe that some people are just plain evil and that's the way it is. And going into this persons' childhood and explaining how bad everything was (or something to that effect) only works to weaken that characters' force. Now, I don't know why a somewhat clichéd story about the love and betrayal of a young Maleficent (who apparently used to be good and pure-hearted), worked here, but somehow it just did. It completely surprised me, to be honest. I'm usually allergic to this kind of fluff, but it worked! Maleficents' back-story actually intrigued me, moved me even. And it succeeded at what it was supposed to do in the first place: it made Maleficent human.\r\n\r\nIn the end though, they could have written any kind of story about what is undoubtedly Disney's most beloved villainess, it never would have been raised to an above-par level without its most crucial element: Angelina Jolie. I might sound biased because I'm such a fan, but I am perfectly able to look at her performances in a critical way, and I can only say this about her performance as Maleficent: she was in one word, perfect. I honestly can't imagine any other actress who could have approached this role with the same flawless combination of properties (short of maybe Charlize Theron): she is beautiful and very charismatic, yet at the same time undeniably cruel and cold. She was everything I had hoped this real life characterization of Maleficent would be, and then some. \r\n\r\nCompliments also go out to the three other main actors in this film. First to Elle Fanning, for being very convincing as the young princess Aurora. She is sweet, lovely and kind and she has the right personality to play this famous princess just the way she should be. Second, to Sam Riley, who was a pleasant surprise as Maleficents' pet raven Diaval in human form. I was thus far unfamiliar with his work, but he was very well suited to his role and I enjoyed watching him. Last, but certainly not least, Sharlto Copley, who has already thrilled me with his performances in District 9 and Elysium, and who has now definitely made a fan out of me. His range is awesome and he was totally terrifying as Stefan.\r\n\r\nOK, there are some things you have to look past. My first, and most blatant, issue with this film is: if young Maleficent was a good, pure- hearted girl, then why did she, as an innocent 10-year-old, already have evil-looking horns, devilish wings and is she called \"Maleficent\"? Right… Secondly, I found the three pixies to be very unconvincing and even somewhat annoying CGI-wise. Overall the special effects are well done but the pixies were definitely an eyesore. The dragon in the end also looked a bit unreal. \r\n\r\nThat being said, Maleficents' costumes and make-up were absolutely stunning. I just couldn't get enough of gazing at her intricate headdresses and beautiful gowns. The costume and styling department really deserve top credit and I truly hope there will be some awards for them in the near future. The music was also great, with flawless scoring by James Newton Howard and a terrific rendition of \"Once upon a dream\" by Lana Del Rey over the end credits. Also, awesome battle scenes and action sequences galore!\r\n\r\nGoing into this film, I thought it would be nothing more than a so-so, kind of fun summer flick. A 6.5/7 maybe. Sometimes, I love it when I'm wrong. Out of the three films that I've seen at the cinema over the last week (the other two being X-Men and Godzilla, both disappointments…) I can tell you, Maleficent was by far the most gratifying. Perhaps because I had relatively low expectations, perhaps because it was simply that good.\r\n\r\nOne serious warning for the rough, rugged men out there: this film features pixies, fairies, sparkly thingies and magical fluff out the wazoo. If you're going to see this, do it for Angelina. If not, treat this film like kryptonite. You will thank me later.\r\n\r\nTo everyone else: go see this film. It will rock your socks off. Maleficent is magnificent.\r\n_(June 2014)_", "created_at": "2017-02-21T14:13:46.497Z"}, {"movie_id": 102651, "review_id": "5f349e51f6fd18003528df9e", "author_rating": 7.0, "review_text": "Good watch, would watch again, and can recommend.\r\n\r\nI'm not a big Angelina Jolie (\"Lara Croft: Tomb Raider\") fan, but she definitely nailed the part, and I felt for her when those things happened, so I'm definitely not going to say she's not a good actor.\r\n\r\nElle Fanning (\"The Great\") is great, mostly an annoyingly happy little thing while she's awake, alongside wonderful supporting cast and gorgeous (and sometimes goofy) CG animated creatures.\r\n\r\nDisney definitely poured money into this to make it look great.  They also spent quite the effort to revitalize the story.  After rewatching \"Sleeping Beauty\" and some other variations (I did fail to reread the original story), I am definitely a fan of the direction they took.  The original story was just so weak and empty, and this does one of my favorite things and humanizes a villain into an adversery into of an evil monster.\r\n\r\nI'm not a fan of how or why the 3 faeries get involved, but it makes some sense.  And I'm very happy with how they handled the resolution of the curse.\r\n\r\nThey created this awesome world which adds to the movie in a very special way.", "created_at": "2020-08-13T01:58:41.494Z"}, {"movie_id": 102651, "review_id": "5fad604590ea4b00419d8cfe", "author_rating": 7.0, "review_text": "Not as dark or deep as I was expecting/wanting, but it is cool to see a different telling of <em>'Sleeping Beauty'</em>.\r\n\r\nAngelina Jolie fits as the titular character, bringing with her a good performance. Elle Fanning (Aurora), Sharlto Copley (Stefan) and Sam Riley (Diaval) play their respective roles well enough, but neither come close to matching Jolie - as you'd probably expect.\r\n\r\nI found the special effects a bit iffy. It's not that it looks anything close to bad, I just thought it could've looked better. The score isn't all that memorable, either. I did enjoy how the plot unfolds though, mainly thanks to the lead admittedly.\r\n\r\nIntrigued to see what the sequel to <em>'Maleficent'</em> has to offer.", "created_at": "2020-11-12T16:18:13.137Z"}, {"movie_id": 102651, "review_id": "61a377faa3d02700850296c2", "author_rating": 9.0, "review_text": "_TL:DR  \r\nAn enchanting retelling of a classic story which really holds it's own with the changes in it's story-line. If you love magical worlds, definitely give this one a watch! (7/10 on the Dragon-Scale for including two very badass dragons!)_\r\n\r\nI truly appreciate the modern trend of humanizing the \"villains\" in a story, real life is rarely as simple as: 'This person is just evil.' and it allows for so much more depth and emotional investment in both protagonists and antagonists.\r\n\r\nHats off to the visual effects team for making the Moors feel truly enchanted, with many magical critters and beautifully strange fauna all pining for your attention. Everything feels like it has it's own personality through their movement and design, making the whole movie a feast for the eyes. (And I of-course cannot forget the raven-like aspects in all of Diaval's forms. Raven dragon? Yes please!)\r\n\r\nAs for the story, it takes great inspiration from the original but brings it's own charms to the table. Opting to take the 'Parental Love' definition of true love, rather than Romantic Love. Which is a decision I personally can get behind. (Even _if_ Maleficent is not Aurora's birth-mother, she has certainly been more of a mother to her than her biological mother. Which is another great message to send!)\r\n\r\nLastly, what did I get out of the story? When we're young, we tend to be young, naïve and have an optimistic colorful view of the world. And something will inevitably happen to change our views and jade us. (Making our outlook darker and thornier. _Wink wink nudge nudge._) \r\n\r\nThis new outlook will usually stay for years, if not for life, but sometimes we find something or someone who revives (part of) the child we all have inside of us that we wish dearly to protect. (The Moors going from colorful to dark and back to colorful again.) And I can certainly find myself in that.", "created_at": "2021-11-28T12:37:14.237Z"}, {"movie_id": 102651, "review_id": "64b5f7e978570e011daa7b7d", "author_rating": 7.0, "review_text": "Good movie seeing how maleficent became maleficent. Pretty bogus what they did to her. Now she fights to get her wings back.", "created_at": "2023-07-18T02:24:41.596Z"}]