[{"movie_id": 109428, "review_id": "51f39e1b760ee37a701d9223", "author_rating": null, "review_text": "Has all the props we remember him the original.Some new information about the book(necronomicon).Yet the sacastic amounts of blood wasn't funny.The only funny line was\"Why does my face hurt?\".I hope that Evil Dead2 will bring back the jokes & overacting that the second original did.Bruce Campbell one liner of \"Groovy\" we hope is a precursor to the next movie!I hope that we see it to \"Army of darkness\"!!!", "created_at": "2013-07-27T10:16:59.642Z"}, {"movie_id": 109428, "review_id": "5207aece760ee308b2768d99", "author_rating": null, "review_text": "David and Mia are brother and sister. As children, they vacationed in the family cabin, far out in the woods. As they got older, David took off, leaving Mia caring for their sick and ultimately dying mother. When mum threw a seven, Mia went downhill, and hit the class \"A\"'s. She hit the drugs so hard in fact that she even technically died at one point, only to be brought back from the brink in a quite portentous bit of backstory. Well, enough's enough. David's back, and he, his girlfriend Natalie, and a couple more close mates of theirs, Eric and Olivia, intend to take her up to the old family cabin in the woods and force her to go cold turkey for a weekend. That'll learn her.\r\n\r\nWhat's the deal with these cabins in American films and shows and whatnot? They always seem to be miles away from any recognisable civilisation. Do the owners own the land, and just decide to build a log cabin? How does one just take ownership of a patch of forest out in the middle of nowhere? I mean, they're never in a larger holiday park environment that's regularly patrolled and maintained. They're never one of a dozen by a beautiful lake, with neighbours here and there. No, they're always out in the deep wild nothing. It's like holidaying in a shed. Who'd do that? Also, the property is ripe for other people to just break in and use the place for their own nefarious ends: Free holiday? Crystal meth flop-house? Sex dungeon? A serial murderer's kill-room?\r\n\r\nKandarian demon incantations, resurrections and exorcisms?\r\n\r\nUnluckily for our merry bunch of interventionists, that's exactly what's been going on down in the cellar of their cabin. Mia - hypersensitive as a result of her withdrawal - and the dog they've brought along can smell... well, a bad smell in the house. Upon investigation they find the cellar door, and through the cellar into another door they find a room full of skinned dead cats and similar small animals, all hanging off the ceiling by meat hooks. There's something else: A package wrapped in black bags, further enclosed in barbed wire. Someone obviously didn't want this package opened. Well, curiosity seems to have killed a bunch of cats already, and now it's going to have a crack at these guys. They open the package and, of course, it's The Book of The Dead. The tape player from the 1981 original is gone but in this version, fragments of the Kandarian script have been translated and written in English. And when they're read out, all hell breaks loose in soul-swallowingly familiar fashion. One by one, we will take you.\r\n\r\nI liked this film, but it's a frustrating beast, for sure. On the one hand, it's as gory as f*ck, the sound design is superb, the movie is strewn with nods to both The Evil Dead (1981) and Evil Dead 2: Dead by Dawn (1987) without those nods seeming too hokey and the actors, whilst not especially outstanding, are at least as effective as the original cast (Bruce Campbell excepted, of course. There is no adequate substitution for him here and, in fairness to the new film, how could there be?). On the other hand... look: The \"intervention\" plotline was a great reason for the group going up into an isolated place, and it continued as a great device for when Mia started seeing and experiencing crazy Evil Deaddery (the woods-raping-the-girl scene from the Raimi original? It's back, baby! Sort-of); they put it down to her withdrawal. At best, she's lying so's they can all go home and she can get munted. At worst, she's bugging out. Except that, very early on in the proceedings, following Mia's insistence that there was a smell in the house, the boys, David and Eric (David, Eric, Mia, Olivia, Natalie. Cool, no? No.) discover the cat-swinging signs of foul witchcraft in the cellar (which we the viewers are privy to in the very first scene btw, before we even meet our protagonists), meaning they no longer have to put the weirdness down to Mia having a cold turkey episode. Just leave the premises, call it in at the nearest cop-shop, job done. So why don't they do this?\r\n\r\nBecause the characters in Evil Dead are prone to making some of the most pinheaded decisions I've seen in a horror film in maybe twenty years. And horror as you all know is a genre beset with characters who make pinheaded decisions, right? Well, the Evil Dead quintet make the average bunch of Camp Crystal Lake dirty-weekenders look like astro-physicists. I don't want to give away specific set-pieces but these characters seemed to have opportunity after opportunity to get away from what was happening to them. Their dunderheaded refusal to do anything but stumble towards their own demise caused me to lose any and all sympathy for them, and when you stop caring, the tension disappears down the plughole. While we were watching the movie, my missus said at one point: \"Yeah, but if they did that (ie the right thing), there wouldn't be a film, would there?\" But, in this day and age (and with the superior budget and skills availed to these remakes), I'm not prepared to buy that. There needs to be more. And in this case, the \"intervention\" plotline at the very beginning of the movie seemed to kick things off on the right note. It was the last decision by the characters that made any logical sense. The end fell apart too, but don't virtually all horrors unravel in the final fifteen? It certainly seems that way.\r\n\r\nStill, I liked it, as I said. Didn't love it as I really hoped that I would, but I liked it. I suppose. In a way. Anyone not into horror will not come anywhere near anyway, but lovers of all things gruesome will find Evil Dead an entertaining waste of a nice and crisp ninety minutes. You'll see not even a modicum of common sense on display, but then that's not why you came, is it?", "created_at": "2013-08-11T15:33:34.390Z"}, {"movie_id": 109428, "review_id": "5570cec8c3a368107300317d", "author_rating": 8.0, "review_text": "Dead Evil!\r\n\r\nIn truth this was always going to struggle to appease many of the horror hordes, Sam Raimi's original film held up as some sort of religious artifact that should never be tempered with - this even though it was considerably trumped by the sequel (erm: remake). Is it fair to say that even before it was released there were those hating it? It certainly seemed that way. \r\n\r\nCan you judge this piece of horror film making on its own terms? Are there a new breed of horror film fans out there whom haven't seen Raimi's trilogy and therefore can go into it and get the tar shocked out of them? I hope so because this is a rip-snorter of a remake. Full of jumps, guts, gore, and genuine moments of terror, with Fede Alvarez and his team adding some fresh touches to Raimi's original nightmare. \r\n\r\nIt is what it is, a horror remake of an old favourite that ramps up the horror and uses the tools available to splinter the ears - turn the stomach - and fray the nerves. It's illogical, daft even at times, but this is one of the better horror remakes of recent times, a real pant soiler. Bravo you undead muthas. 8/10", "created_at": "2015-06-04T22:18:48.672Z"}, {"movie_id": 109428, "review_id": "5f3d938835a61e0037f6a165", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nLook, I'd watch pretty much anything with Jane Levy, and she's awesome in this, far better than any two other actors in the movie.\r\n\r\nIt feels like someone with some sense look at the original movie and identified some much needed upgrades.  Just having a dramatic reason for these characters to gather at this cabin immediately makes the story a bit more palatable than the original.  There are also several sequences towards the end of the movie that diverge from the original that makes this version vastly superior.\r\n\r\nThe other big difference is that the special effects has come a long way in the 30 years between the two movies.  The do an excellent job of keeping the pacing of the first movie and matching the effects to the original, but just better.\r\n\r\nSimilar to the original, the majority of this movie is gore effects, but they add just enough explanation and narrative to keep decent motivation in place.\r\n\r\nThis is a rare example of how to \"upgrade\" a movie, changing it, but keeping the spirit of the movie.", "created_at": "2020-08-19T21:03:04.448Z"}, {"movie_id": 109428, "review_id": "6463a72f8c44b97808ffe207", "author_rating": 7.0, "review_text": "Evil Dead is one of the most brutal and disgusting films I have ever seen. I applaud the unique direction to take the franchise, which has previously embraced camp, into a super realistic and vicious horror film. The effects and gore are the best of the franchise, having a nearly 20-year gap between the previous entry. Some of the scenes go down as all-time greats in horror that have been cemented in my mind ever since. The bread cutter scene is just disgusting and done so well, I absolutely loved all of the blood that was used in these scenes. The story is not as fleshed out as the first or second film, but it does take unique directions that I can appreciate it. The use of a recovering drug addict was done really well and was an interesting motive to keep the cast at the cabin. The weakened state she was in made her the perfect victim to be the first possessed, which worked really well. The dialogue and acting were quite atrocious. Other than Jane Levy, everyone else was quite bad. The lines were corny and delivered in a somewhat awkward fashion. This made the twenty-minute rising action of the film to be quite lackluster, but luckily once the action gets going, there is plenty of things to distract you from it. Overall, this movie's visuals and horror carry the film to its rating. It unfortunately does not live up to the hype I once had for it as a 15-year-old boy, but it is still one of the better remakes in cinema history.\r\n\r\nScore: 73% 👍\r\nVerdict: Good", "created_at": "2023-05-16T15:54:23.945Z"}]