[{"movie_id": 360920, "review_id": "5be868c5c3a368173d0327fd", "author_rating": 8.0, "review_text": "After hearing negative reviews from others I was reluctant to see this one at first but I went with my gut feeling and saw it and wow I am so happy I did this movie made my Christmas already it's just what we need in the world today a movie about people putting aside their differences and enjoying just being together", "created_at": "2018-11-11T17:37:09.374Z"}, {"movie_id": 360920, "review_id": "5be9cd9a0e0a263c020458b3", "author_rating": 1.0, "review_text": "So I paid £7 to fall asleep! Alas, even my kids aged 11 and 14 found it uninteresting. Grandma came along, she loves all animation films, but even this failed to capture her interest. We were expecting some new twists in an already well-known tale, but hey-ho, not this time.", "created_at": "2018-11-12T18:59:38.594Z"}, {"movie_id": 360920, "review_id": "5c2dfd3d0e0a267603387d53", "author_rating": 8.0, "review_text": "The Grinch was a movie I really wanted to see before Christmas but life was so busy and I just didn't have enough time. I am so glad I finally managed to see it.\r\n\r\nLIKED:\r\n- the animation is absolutely stunning! all of the colours and the contrast with the snow was amazing.\r\n\r\n- Max was the most adorable puppy ever! for some reason, it reminded me of Dobby a bit :D\r\n\r\n- a big part of the story was told in verse and there were many quotes taken directly from the book.\r\n\r\nDISLIKED:\r\n- I kind of wanted more songs\r\n\r\n- Grinch wasn't portrayed as mean as I expected\r\n\r\nOVERALL:\r\nIt was cute, adorable and very Christmasy! Yes, it was cheesy but it is supposed to be like that. I think I prefer it as an animation.", "created_at": "2019-01-03T12:17:01.744Z"}, {"movie_id": 360920, "review_id": "5fd61db4d48cee003b73faad", "author_rating": 6.0, "review_text": "It was a little too eccentric. I would've thought they would make the storyline similar to the 2000 remake, this time with Jim Carrey voicing the bullying mayor!\r\n\r\nStill, this film had its laughs, along with a voice cameo from Made in Chelsea's Toff!", "created_at": "2020-12-13T13:57:08.799Z"}, {"movie_id": 360920, "review_id": "5fdfb286d70594003c2ce02d", "author_rating": 7.0, "review_text": "A much more family friendly story about <em>'The Grinch'</em>.\r\n\r\nI like it. It has a few issues but still does most things right, it's definitely solely made for families but that's not a negative - it does make sense to make an animated version of this Dr. Seuss book.\r\n\r\nWith that noted, I don't rate Benedict Cumberbatch in the lead role. I don't think his voice suits the role at all, it needed someone who sounds more menacing and treacherous. I never felt, away from his obvious acts, any horrid side to Grinch here - though perhaps that suits the aforementioned family vibe they were aiming for.\r\n\r\nAway from Cumberbatch, I thoroughly enjoyed Pharrell Williams' narration and it's cool to hear Angela Lansbury in a minor role. The plot to this 2018 film is solid, but the thing about it that stands out most to me is the humour - which I found consistently amusing, there are some funny gags in there.\r\n\r\nOverall, this is a film I'll look back on as being good - even if it could've been greater, especially with a more suitable lead. If we're comparing this and the 2000 production, I think I prefer this one? It's close, Jim Carrey is great in that but this one's pacing is much better.", "created_at": "2020-12-20T20:22:30.276Z"}]