[{"movie_id": 9693, "review_id": "56d2da85c3a3681e5000db59", "author_rating": 6.0, "review_text": "A strong premise and great cast prompted my interest, but the movie falls short of its promise. Clive Owens gives a great performance and a few of the scenes are remarkably memorable and resonant. However, there are very long stretches where the movie simply stagnates and the plot drifts away, especially towards the end. Overall, it's rather melancholy and despite the \"action\" scenes, not especially thrilling. If you like sci-fi movies set in dystopian futures, or are a big Clive Owen fan, you may still find it worth watching despite its flaws.\r\n\r\nAn aside: One of the \"extras\" on the DVD has some heavily accented academic trilling at length about the movie's philosophical meaning. It's entertainingly over-the-top and almost unintelligible: jargon piled into a Dagwood sandwich of contradictory abstractions. Anyway, if you don't watch too much of it, its good for a laugh.", "created_at": "2016-02-28T11:31:17.913Z"}, {"movie_id": 9693, "review_id": "570885ea9251417216000184", "author_rating": 10.0, "review_text": "Cuaron's masterpiece so far (including Gravity, which was gravely miscast). This film is: a) easily the best film of the decade of the 2000's; b) the finest dystopia film since 'A Clockwork Orange' and probably the best sci-fi since '2001: A Space Odyssey'; and c) all the evidence you need that Clive Owen should have been selected as James Bond in place of Daniel Craig. Heartily recommended to anyone interested in how great both science fiction and cinema can possibly be. You may be depressed with the state of both the world and mankind, after watching it, but you won't be disappointed in the possibilities of cinema.", "created_at": "2016-04-09T04:32:42.236Z"}, {"movie_id": 9693, "review_id": "590b2be89251414fa8014a96", "author_rating": 9.0, "review_text": "**Thought provoking piece of art !!**\r\n\r\n**CHILDREN OF MEN**....How a baby's cry can make the whole world stop, the bullets stop flying in a war, people forget all their pain, the only thing that matters is how to make that precious gift of god smile again..The movie depicts it beautifully! When the world is falling apart, coming to its end, how a THEO does things that he otherwise would have not done for anything or anybody else...It doesn't seems practical that how at every point of time there is somebody to see them sail through, but that is all LIFE is about...HOPE...There's a THEO in everyone of us...It's in our hands...to choose, THEO or Luke...The world will surely end someday but till then we must all protect the CHILDREN OF MEN, protect the world...Do our bit for the mother earth..!!\r\n\r\n**P.S. - loved the laughter of the babies in the end!!**\r\n\r\nScenes I LOVED - \r\n\r\n1. When Julian was shot.\r\n2. When Theo thought Jasper was dead.\r\n3. When Dylan was born.\r\n4. When Theo said to Luke \"It's a GIRL\"\r\n5. When Marichka expressed she isn't coming.\r\n\r\n\r\nThere may be more, but these are all I remembered.\r\n\r\nMichael Caine was adorable as always, Julianne Moore was pretty, Clive Owen was perfect, Kee was sweet, Miriam was, don't know, clean...at heart !", "created_at": "2017-05-04T13:26:00.066Z"}, {"movie_id": 9693, "review_id": "6534dcbfc8a5ac00fffa13d8", "author_rating": 10.0, "review_text": "One of the bleakest, most magnificently crafted films of all time. The dialogue is one-of-a-kind in actually capturing realism.", "created_at": "2023-10-22T08:26:39.062Z"}]