[{"movie_id": 492611, "review_id": "5ea5a82da2d2e90021de124c", "author_rating": 1.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI... am... in shock. The Turning had tons of development issues, switching directors (Juan Carlos Fresnadillo was the first choice), cast, producers (Steven Spielberg was once responsible for the project), and who knows what else. It's yet another adaptation of the famous ghost story, Turn of the Screw by Henry James, so it was always going to be a challenging task to bring a horror flick with something unique that the others didn't possess. After so many changes, the film finally decided on Mackenzie Davis as the adult protagonist, and Finn Wolfhard and Brooklynn Prince as the young kids.\r\n\r\nThey replaced everything and everyone, except the people who are behind the main reason why this movie fails so miserably: the screenwriters. With all due respect to the Hayes brothers, but this is the worst kind of a bad film. It doesn't have a single redeemable quality about it. It's a movie about... nothing! It has no message, no purpose, no structure, and last but not least: there's no ending. I'm not joking, The Turning doesn't have an ending. It's like someone abruptly shouts \"roll credits\" way before any sort of payoff is delivered.\r\n\r\nThe whole film is a collection of repetitive, dull scenes that only vary in location. Scareless and predictable jump scare sequences spread throughout the entire runtime with no meaning or objective underneath. Close to ninety minutes of build-up to utterly nothing. This isn't one of those cases where the ending is just ambiguous, and people can interpret it in several ways. As baffling as it might sound, this monotonous, cliche, boring horror movie doesn't possess an ending. I have to repeat it, so you actually believe what I'm writing.\r\n\r\nEven if I simply ignore that last (nonexistent) act, the rest of the film is still awful. As the viewer, knowing more than the main character about what's happening or what's about to unravel is almost always a lousy aspect concerning the horror genre. Not only there's a lack of a scary or eerie environment, but the narrative raises dozens of logical questions that eventually get no answer. The movie actually starts reasonably okay, it got me slightly invested in Davis' character, but it quickly becomes one of the most yawning-inducing experiences I've had this year.\r\n\r\nUsually, I can turn to the acting to help me get through the hardest portions of the film. However, Mackenzie Davis (who I liked a lot in Terminator: Dark Fate) gradually starts to become uninteresting, and Finn Wolfhard delivers the worst performance I've ever seen from him. Brooklynn Prince is good for her age, but she's still a 9-year-old kid, so... you know. Barbara Marten is probably the best as Mrs. Grose, but just like the movie itself, she has no real impact on anything. Technically, the score is weird, and instead of elevating the scary sequences, it turns them into a rock concert. The editing also lacks consistency.\r\n\r\nHonestly, I thought that Fantasy Island was a safe bet for the \"Worst Movie of 2020\" prize, but The Turning just entered the race. As logically absurd as the former might be, at least it has an ending. It's a ridiculous one, but it's, in fact, an ending. The latter not only lacks a payoff to the ninety minutes of build-up, but it has absolutely no redeeming quality. Describing a film in a one-word sentence was never this easy: \"nothing\". It's a movie about nothing! No meaning, no message, no purpose, no logical sense. An extremely boring journey through a mansion with predictable jump scares, an awkward score, and disappointing acting. It's an emotionless story packed with unanswered questions, and no, it's not one of those \"ambiguous narrative\" cases. I definitely don't recommend it, unless you desire that frustration of watching an incomplete film.\r\n\r\nRating: F", "created_at": "2020-04-26T15:26:37.933Z"}, {"movie_id": 492611, "review_id": "5f4f475271f0950034a254e3", "author_rating": 1.0, "review_text": "Can a horror movie get by on nothing but atmosphere, on the je ne sais quoi of its unsettling mood? Sure, just take a look at Oz Perkins' 'I Am the Pretty Thing That Lives in the House'. And Lenny Abrahamson's brilliantly underrated 'The Little Stranger' is barely a horror movie at all - it's more of an impeccably crafted chamber drama with a supernatural bent. These films prove that there's room in the world for this sort of old-dark-house story. But, as we see with 'The Turning', making scares stick means more than just building a spook house, dropping a few spiders inside, shoving audiences through the door, and hoping for the best.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-turning-henry-james-haunting-masterpiece-gets-the-conjuring-treatment", "created_at": "2020-09-02T07:18:42.479Z"}, {"movie_id": 492611, "review_id": "5fda3710511d090040604558", "author_rating": 4.0, "review_text": "The Turn of the Screw, a book written by Henry James, is considered one of the most influential Gothic horror books ever written, which, in turn, gave rise to one of the most influential classics of cinematic terror: The Innocents (1961). Of course, when hearing rumors of a possible new adaptation of this classic work, a person tends to fear the worst, as it will be difficult to achieve the splendor of the original film. In this way, can Chill be at the level of the original? The answer is a round no, this film only serves to confirm the initial fear caused by the announcement of this new adaptation. \r\n\r\nI'm not going to lie, the film manages to build a Gothic atmosphere, out of a tale from the era, with beautiful cinematography, centered on the house and the estate and its eminent threat to the new tenant. However, atmosphere, a decent performance and a promising start cannot save the film from a confused and uninspired script.\r\n\r\nThe skeleton of the original work remains (although, for no apparent reason, it happens now during the 90s), a young caretaker is called to work in the decrepit and old Bly mansion, a mansion inhabited by two brothers whose parents died, Miles (who in this version, loses any kind of threat adjacent to her character) and Flora, and by a maid in charge of looking after orphans. After a few days at the mansion, the janitor begins to experience paranormal phenomena.\r\n\r\nHowever, and unlike the original film, this new version of the events is not built with the same type of ambiguity as to the existence of frightening phenomena, it does not use psychological terror in a really effective way, considering itself more intelligent than in the reality is. The film introduces some interesting ideas, but lets them fall into the deepest clichés of the genre (like the use of jump scares), and apart from one or the other chilling sequence, the film just doesn't know how to be scary.\r\n\r\nOne of the biggest problems in the film is the use of special effects on ghosts, which remove any kind of frightening effect that simplicity could have offered them, and which make the few ghost appearances ineffective. Given that the appearances are sporadic and the characters relatively uninteresting, the pace at which the film goes also suffers during its duration, as it drags mainly in the middle, where little happens and the disinterest begins to be felt by the cinema.\r\n\r\nI must add that never in cinema did I visualize such a pretentious ending, without any kind of nexus or logic and that invalidates the entire trip that had been completed throughout the film. It was not a deserved ending, it was just an attempt to give rise to the ambiguity felt in the original, it was an ending indicator that my time had been wasted watching this film, which is nothing more than a confusing narrative.\r\n\r\nOn the whole, The Turning is a film that just isn't worth it, and if it weren't for the fact that it had a beautiful cinematography, a well-built atmosphere, some decent interpretations and a clear effort behind the making, it would really be worthy of a star.", "created_at": "2020-12-16T16:34:24.564Z"}]