[{"movie_id": 59436, "review_id": "539efdd3c3a36827a50000db", "author_rating": 8.0, "review_text": "Really nice movie, done with a great delicacy.\r\n\r\nWorth watching to get in love with Paris but it is also a great story of self knowledge and evolution.", "created_at": "2014-06-16T14:23:15.628Z"}, {"movie_id": 59436, "review_id": "62e878cc1ad93b0061543f5c", "author_rating": 8.0, "review_text": "**Magnificent, it is a love declaration for Paris.**\r\n\r\nWith this film, Woody Allen makes, in the background, a love declaration for Paris, a city he already knows very well and for which he seems to feel a great affection. In addition to the beauty of the city, especially in the opening sequence, the script revisits the history and importance of the French city, as a meeting point for artists and writers.\r\n\r\nThe film begins very well, introducing us to an American engaged couple who came to Paris on their father's business trip. From the start they seem a bit strange: she is quite frivolous and seems to feel that she is doing him a huge favor by marrying him, and it is perfectly obvious that her parents do not approve of the match; in turn, the young man is an aspiring writer who has grown tired of making Hollywood screenplays and wants to dedicate himself to writing and stay in Paris, ideas seen with disdain by the bride. However, everything will change when, after a disagreement, he walks back to the hotel and ends up having a meeting with a series of famous artists and writers from Paris in the 1920s: Scott Fitzgerald, Ernest Hemingway, Picasso, Dali, Buñuel, Gertrude Stein and others. That is, the film starts from a basic romantic comedy situation and creates a story where time travel ends up happening in a way that seems like the character is just dreaming, or in an illusion.\r\n\r\nOwen Wilson was impeccable in the lead role and gives us one of his best serious performances, which is no small feat. He is credible and convincing. Equally pleasant and sympathetic is Marion Cotillard, who gave life to the “soul mate” of Wilson's character, a dreamer and idealist who would rather live on a page of the past. In addition to being smart and sensitive, she is beautiful and attractive. Kathy Bates, Tom Hiddleston, Alisson Pill, Corey Stoll and Marcial Di Fonzo have given life to a series of artists and writers, each of whom played their part with aplomb and care. Rachel McAdams is good at her tiresome and irritating character.\r\n\r\nTechnically, the film is flawless. The cinematography is exquisite, has ideal light and color, sharpness and depth. The city scenes are magnificent, and it's very easy to see the movie and want it all to be real. The sets are very good, and the same can be said for the choice of filming locations, made with care and method. Comedy is very present in the film and has elements with a certain quality, being in the dialogues and puns that it thrives. The entire film has a very good rhythm, which does not tire the audience or allow us to lose sight of it. Finally, a word of appreciation for the jazz soundtrack.", "created_at": "2022-08-02T01:07:24.966Z"}]