[{"movie_id": 453405, "review_id": "5d97fbcd55937b00183396e6", "author_rating": 6.0, "review_text": "A century ago, man was just getting started with movies - heck, we even had sound and colour to explore. ‘Gemini Man’ deserves to be acknowledged for its purposeful step towards discovering what potentially lies out there for the future of movies and the capacity of the technology. Sure, the film finished and Michael and I both agreed the plot was safe and it really does stick to the “boy runs, meets girl and keeps running“ framework -  but if you want to see it for more than that, at least respect it’s go-getter exploration of a new digital world.\r\n- Lily Meek\r\n\r\nRead Lily's full article...\r\nhttps://www.maketheswitch.com.au/article/review-gemini-man-ang-lee-vs-ang-lee-has-technology-gone-too-far", "created_at": "2019-10-05T02:11:25.337Z"}, {"movie_id": 453405, "review_id": "5d9f549e65686e001e625aa1", "author_rating": 4.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nUsually, I leave the technical aspects to the end of my reviews since story, characters, and the critical element of each genre (action in action flicks, comedy in comedies, and so on) are way more important. However, having in mind the whole marketing campaign surrounding Gemini Man's \"groundbreaking innovations\", I'll address them now. Even after sleeping on it, my experience in high frame rate still feels very … weird. In case you need some explaining, HFR adds a lot more detail to the image since it captures more frames per second hence making the image smoother, which can be extremely distracting. I always disable motion smoothing on my TV since I hate that feeling of knowing that \"something's not right\".\r\n\r\nIt doesn't have to do with speed, which is something people are going to wrongly state regarding this film. The action isn't faster, don't make the mistake of saying this. Since there's 2.5x more detail (24 FPS is the standard frame rate), movements become easier to follow, so there's the illusion of watching something faster than normal. Truth is, it just FEELS like it. When characters are just talking, and there's no action involved, it works because it simply looks better. However, the action sequences are very hit-and-miss. Some pieces look absolutely amazing, but it's clear this technology needs a few more years of experience to reach its full potential.\r\n\r\nScenes featuring car/motorbike chases, running, or shootings are stunningly filmed, but any hand-to-hand combat is frustratingly off-putting. Additionally, Ang Lee applies an excessive use of CGI to a lot of these moments, which makes some fights look incredibly absurd. HFR is not the only technical attribute people are going to discuss. That young version of Will Smith … Honestly, it doesn't really work for me. People who complained about The Lion King (2019) not being able to show animals emoting will surely hate this attempt of replicating a young Will Smith (if they don't, then Joker was right, society is indeed extremely hypocritical).\r\n\r\nIt's just like the action sequences with HFR: hit-and-miss. There are some genuinely mind-blowing scenes with medium shots of young Will Smith, and he looks 99.9% real. In these specific shots, it's impossible to tell the difference between the clone and a real version. However, it still fails to deliver this realism throughout the entire runtime. First of all, young Henry barely shows any emotions (except a brilliant crying moment), which is obviously meant to facilitate the VFX team's work. But even with his face completely still and empty of emotions, the eyes just look too doll-like. The eyebrows move strangely, and the forehead seems odd.\r\n\r\nIn the end, it all comes down to forgetting that it's a digital character and that almost never happens. I always felt like I was watching a blend of CGI, motion-capture, and whatever other technology they used to try to pull this off. In a few years from now, if Gemini Man gets a remake or some other movie tries to do something similar, I bet it will look near-perfect. Right now, it's more of a disturbance than an achievement. Put this together with the already not-that-good HFR, and we get a visually striking yet distracting film.\r\n\r\nAnd if you thought the story would save it… It's pretty bad. Generic, predictable, and filled with almost offensive exposition. I would have to go through my reviews, but this is definitely one of the most exposition-heavy screenplays of the year. I lost count of the number of times a character starts ranting with the purpose of explaining something evident to another character. The worst thing a screenplay can do is treat the audience like they are 5-year-old children. The whole plot revolves around people asking someone else what happened, what's happening, and what's next. We already know from the trailer Will Smith is being hunted by a young version of himself, a clone.\r\n\r\nTry to imagine how many ways you can tell someone there's an individual exactly like that person. Now, just lazily insert all of those sentences on a character's script and make it say them in a single scene. I'm sorry, but it's laughably bad. There are no surprises! It ends abruptly, utterly disregarding the only interesting plot point (still very predictable), by not developing it any further than one sequence. If it wasn't for the truly fantastic cast (Will Smith is always impeccable, Mary Elizabeth Winstead and Benedict Wong deliver great performances), Gemini Man would easily be one of the absolute worst movies of the year. Shoutout to Lorne Balfe's score, which is by far the technical aspect worthy of only compliments.\r\n\r\nAll in all, Ang Lee's attempt to deliver a groundbreaking film doesn't quite hit the mark. Honestly, it's still far from it. The 60 FPS HFR and the young version of Will Smith are occasionally jaw-dropping, but both technical aspects need years of improvement to be able to work seamlessly. As of now, these only serve as a frustrating distraction. However, the biggest problem with Gemini Man is its exposition-heavy screenplay, which besides treating the audience like dumb people, doesn't carry any sort of surprise or novelty. As generic and predictable as it could be. The unbelievably talented cast, a spectacular score from Lorne Balfe, and a few notable action sequences save this technological hit-and-miss from missing its target entirely.\r\n\r\nRating: C-", "created_at": "2019-10-10T15:56:14.669Z"}, {"movie_id": 453405, "review_id": "5e2236148f26bc001574a4ad", "author_rating": 7.0, "review_text": "Not at all bad and pretty watchable action-thriller, but also outside some of the effects and fight choreography (when you can see what's going on), not terribly memorable either.\r\n\r\nAlso, using 60 fps was a bit off-putting, especially with the daylight scenes making this look cheaper than it probably was, at times feeling like you're watching something online or even on 1x fast forward. Not entirely sure why Ang Lee went in that direction, but didn't work for me.\r\n\r\nAll in all, maybe worth a rental but certainly far from a best effort from both Lee and Will Smith. **3.25/5**", "created_at": "2020-01-17T22:32:52.228Z"}, {"movie_id": 453405, "review_id": "5ec3874e18b7510020ca7623", "author_rating": 4.0, "review_text": "The effects, sometimes, not all the time, but sometimes, look **great**. But boy oh boy was this dumb. And badly acted too, which is surprising. Like I've seen these people before, I know they are more than capable of the job, what was it about _Gemini Man_ that just caused them to throw all of that out the window? I assume it's the fact that everything about it was completely hollow and they couldn't bee bothered putting in the effort required to... Do their jobs well. Bet they didn't mind that paycheque though.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-05-19T07:14:22.880Z"}, {"movie_id": 453405, "review_id": "5f08a53693db92003447dc80", "author_rating": 6.0, "review_text": "You made a person out of another person, then you sent me to kill him. You made a choice to do this to me.\r\n\r\nGemini Man is directed by Ang Lee and co-written by David Benioff and Darren Lemke. It stars Will Smith, Mary Elizabeth Winstead, Clive Owen and Benedict Wong. Music is by Lorne Balfe and cinematography by Dione Beebe.\r\n\r\nHenry Brogan (Will Smith) is an aging but elite assassin who's ready to call it quits. However, his plans are put on hold when he suddenly becomes the target of a mysterious operative who can seemingly predict his every move. The assassin who stalks him has a very familiar feel to him...\r\n\r\nLets not beat around the bush, Smith and Winstead deserve a better screenplay than this. The writing is weak and lazy, Lee is clearly the wrong director for such a high concept action film, while the action scenes are shoddy in effects. In fact the storyline, as trite as it is, is unfairly in a constant battle against the CGI on show.\r\n\r\nHowever, film never sits still and refuses to let boredom take a hold. The lead actors are engaging enough to hold attention throughout, and even as the sugary coatings fill out the final throes, we at least can acknowledge there were earnest intentions to make an existential clone thriller here. But with Jerry Bruckheimer on production you can see there's a popcorn action film trying to break free of the literary treacle.\r\n\r\nHardly the worst clone sci-fier that some have called it, but it's not memorable either. Think of it more as a time filler for the curious about the subject to hand. 6/10", "created_at": "2020-07-10T17:28:22.177Z"}, {"movie_id": 453405, "review_id": "5f6be9d6c1ffbd0036e68874", "author_rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nIf there is someone you want to put on the screen twice, then I understand it being Will Smith, and the rest of the cast is great.  This might even have been the role that got Mary Elizabeth Winstead into the Huntress role later on.\r\n\r\nI think they specifically reference it a some point in the movie, but a lot of the story is Will Smith fighting himself.  The action sequences are solid, the scary secret spy organization is scary and secretive, and there are even a few \"twists\" along the way.\r\n\r\nMy biggest problem is that this entire movie is unnecessary.  If Clive Owen's character wasn't basically a super villain, then he could have left old Will Smith retire and no one would be the wiser.  That might have possibly been a better movie, though I think Star Wars might be a point against me there.\r\n\r\nLong short: it's good, it's great action, it's not world moving, but does include a touch of sci-fi (/sci-fact, we're on that border).  It just has a bad clash of reality that people and organizations like that exist, and we pay for them.", "created_at": "2020-09-24T00:35:34.813Z"}, {"movie_id": 453405, "review_id": "62421c9e9ba86a0047b16abe", "author_rating": 5.0, "review_text": "Ok, so it isn't going to trouble any Oscar or BAFTA juries but it is quite a watchable 2 hours of special effects and fisticuffs in the same vein as \"The Mechanic\". Will Smith still has just enough charisma to carry this off. Sure, it is all predictable stuff and Clive Owen still performs with all the animation of the wooden horse in \"Troy\" but the precept is interesting nonetheless.", "created_at": "2022-03-28T20:37:50.279Z"}]