[{"movie_id": 302, "review_id": "61b6c6e7e263bb0088728c1a", "author_rating": 9.0, "review_text": "_**Engaging psychological drama with Ludivine Sagnier and Charlotte Rampling**_\r\n\r\n\"Swimming Pool\" (2003) is a drama/psychological thriller about a popular English novelist named, Sarah (Charlotte Rampling), who vacations at her publisher's villa in France to find inspiration for her next book. Unfortunately, the publisher's oversexed daughter, Julie (Ludivine Sagnier), visits and disrupts her activities.\r\n\r\nIf you remember 70s' films like \"Orca\" and \"Zardoz\" you'll know that Rampling was stunning in her physical prime in a looks-that-kill way. In \"Swimming Pool\" she's still in decent shape for a woman verging on 60, but her character's a joyless biyatch desperately seeking inspiration. Julie, by contrast, is young, friendly and overflowing with sexuality, but – like Sarah – she's not a pushover in the least.\r\n\r\nSagnier shines as the wild child French hottie. There's just something about the female French accent that's a turn-on. Despite her sexiness, it's clear in some scenes that Julie's actually sort of plain in a girl-next-door kind of way. It's what she does with what she's got that makes her stunning.\r\n\r\nLike 2005's \"Match Point,\" \"Swimming Pool\" is the antithesis of the modern 'blockbuster' and all its moronic trappings -- there's no quick editing, no CGI, no goofy one-liners, no explosions and no promise of $400 million at the box office. No, \"Swimming Pool\" is movie-making based simply on excellent writing and cinematic storytelling. The end is a revelation to the viewer even if you were expecting it, particularly because, if you research it, it's way more than even that, believe it or not. It's amazing how good writing & storytelling can create a 'Wow' reaction more so than the most elaborate overkill action sequence with all its requisite CGI and explosions.\r\n\r\nThe film runs 102 minutes and was shot in Luberon, Vaucluse, France, and London.\r\n\r\nGRADE: A-\r\n\r\n***SPOILER ALERT*** (Don't read further if you haven't seen the film)\r\n\r\nThe obvious interpretation is that Julie isn't real, but rather a character created by Sarah for her next book whereas Julia is the publisher's real daughter, revealed at the end. People who draw this conclusion, like me on my first two viewings, are on the right track, but this interpretation is only accurate to a point. For details see the thread on the MovieChat message board \"The Definitive Answer / Color-Key to Swimming Pool.\"", "created_at": "2021-12-13T04:07:03.081Z"}]