[{"movie_id": 429422, "review_id": "603b2254c2ff3d004e06dbc7", "author_rating": 6.0, "review_text": "<em>'Capone'</em> disappoints.\r\n\r\nIt's not what I was expecting. I hadn't heard much about it admittedly, but I was anticipating a full blown film about Al Capone - especially with the casting of Tom Hardy. That's not a bad thing in isolation, at all, but coupled with iffy storytelling it ends up being a waste.\r\n\r\nHardy (Al) is undoubtedly the best thing about this, yet I still think he had way more in him for this sort of role - if the filmmakers had allowed him to use it, of course. There aren't any standouts behind Hardy, though Linda Cardellini (Mae) and Kyle MacLachlan (Karlock) are OK.\r\n\r\nThere's nothing I massively dislike about this, I just wanted so much more from it. It is, I will say, at least a film that makes you think - I just don't, personally, think it came out as perhaps intended.", "created_at": "2021-02-28T04:55:48.023Z"}, {"movie_id": 429422, "review_id": "6307f63b3dd126007ed81c8d", "author_rating": 1.0, "review_text": "Bobby De Niro's Al Capone in The Untouchables could make you figuratively crap your pants. Tom Hardy's Capone, on the other hand, is the only one soiling his pants – literally. In the Godfather, Don Vito Corleone leaves, through Luca Brassi, a horse's head on Jack Woltz's bed. In Capone, the only thing the titular character leaves in a bed, which happens to be his own, is his dinner – after he has digested it.\r\n\r\nThe events of Capone take place during Al Capone's final year on Earth, when the notorious criminal was “no longer considered a threat” to anyone or anything other than his underwear or his bed sheets. This film is arguably the second lowest point in the Al Capone mythos, following The Mystery of Al Capone's Vaults. Not unlike Geraldo Rivera, Capone purports to give us access to the vault that was the mobster's psyche during his last days, and the result is equally disappointing.\r\n\r\nIn theory no movie should be too bad that includes Hardy (or at least the Tom Hardy I remember from The Revenant), Kyle MacLachlan and Matt Dillon, but Capone gives them very little to do. MacLachlan looks as if he got lost on his way to the Twin Peaks set, Dillon wastes his considerable talent on some sort of Sixth Sense-esque routine, and Hardy spends the entire film wearing a prosthetic masks that covers the entire surface of his face and skull, making him look like Michael Myers in Halloween 3000: Massacre at the Old Folks Home.\r\n\r\nThe worst part of the whole thing is that the majority of events in Capone take place only in the protagonist's feverish, senile mind, and while there's nothing wrong with a film that reflects the deteriorated mental state of a character – e.g., The Machinist –, my problem is that director/writer Josh Trank has no way of knowing what was going on in Al Capone's head during his last days of life; in other words, he's making this stuff up as he goes, and this gives the film a double layer of unreality.\r\n\r\nPut another way, we are dealing with not one, but two levels of fantasy; there's the character's ravings, and then there's the filmmaker's musings as to what the actual person's ravings might have been. We cannot expect to gain any new insights from this approach, and indeed the film fails to reveal anything important or relevant about its subject.", "created_at": "2022-08-25T22:22:51.911Z"}]