[{"movie_id": 82702, "review_id": "53a670d20e0a26143900304a", "author_rating": null, "review_text": "If you loved the first How to Train Your Dragon, you'll absolutely love this movie. If you are a frequent user of Tumblr, you'll want to capture SO many moments in .gif format. If you've never seen the first movie, you'll still love this movie, or at least, like it.\r\n\r\nEssentially, this movie is great. It has all that a child could desire in a film (trust me, the kids in the theatre LOVED it - it was super cute) and it also had some absolutely hilarious moments for the adults. The plot is pretty good; even if it is predictable, it's predictable in a way that works. The animation is gorgeous. The voicework is awesome. The way all of the characters have grown over the 5 year gap between the two movies in the series was really well done and evident, not just in appearance, but also in their personalities and interactions with each other.\r\n\r\nIn any case it was a lot of fun! Go watch it, even if you don't have kids.", "created_at": "2014-06-22T05:59:46.511Z"}, {"movie_id": 82702, "review_id": "55464003925141499f003038", "author_rating": 8.0, "review_text": "Like I said a couple of year ago during 'Cloudy with a Chance of Meatballs 2' review, it's a terrible title for a sequel. The host, Neil Patrick also said the same thing during the 2015 Oscars. But in the digital world, slight change in the title makes random in order. I mean on the computer and web world, it won't show in order. Even sometime it might get lost in a vast number of other titles if they dare to chance the first word in the title for a sequel. Other than that they are not stupid as many people think. That's why they highlighted 'Dragon' boldly than the rest of the words.\r\n\r\nThis part two was not much different to its first. The story continues five years after Hiccup recovers from his injury. He and his pet, Toothless discovers a new land during the survey for the map. So their's adventure begins, but end in a trouble and forces all his people from the town to involve and fight against the rising evil force that tries to conquer them all.\r\n\r\nLike I always say, those days are gone, now animated movies are for all ages. This was a very nicely and carefully written screenplay, did not fail to deliver. Very close to the impact the first movie made, but due to simplicity it stayed a couple of steps behind. Developed well with a bit of suspense, thrill and entertainment. Nothing more we could have asked, a perfect follow-up and hoping to explore beyond lot more in the upcoming movies in this series. Four years gap between the movies is a nice idea and fine breathing space for this franchise fan. A movie must be seen by animation fans, especially if you have already seen the first then don't miss it. \r\n\r\n8/10", "created_at": "2015-05-03T15:34:27.090Z"}, {"movie_id": 82702, "review_id": "56f3f9c2c3a3682fcf002e66", "author_rating": 8.0, "review_text": "The first one was good and the second is not any worse.\r\n\r\nThis series is standing out of the pack for its complex plot involving several topics, not just the typical ones in an animated movie. Arguably, they have been also treated in former movies; two main characters which are crippled (Finding Nemo ...), greater involvement of strong female roles (although, still, not as main characters and utterly in need of help from the male roles), ecology, etc.\r\n\r\nThe points I dislike the most is the speech of homeland being the good \"peacekeeper\" nation forced to use violence to keep it (peace). Quite hypocritical but, clearly, addressed to the US audience.\r\n\r\nThe repetitive line of story about the (nerd) hero who is the only one to save the world is quite tiresome too.\r\n\r\nFinally, how lightly some other traumatic causing topics are treated: finding that a parent abandoned their child, death, etc ...\r\n\r\nIn any case, this is a good movie, funny and with an interesting story. Worth watching for a franchise that, I think, doesn't have all the attention it should have.", "created_at": "2016-03-24T14:29:22.347Z"}]