[{"movie_id": 146198, "review_id": "576d743ac3a36874f50021d1", "author_rating": 6.0, "review_text": "> Combination of wrong path and untrustworthy troop.\r\n\r\nThis should have been the Holywood's bad boys film. I mean the big cast names are expected like the earlier films of QT, or especially like 'The Departed'. There were many who dropped out of it for various reasons prior to the production commence, although this cast did a great job. In my finding I blame for the screenplay. It was a good story, but the first half was not very interesting compared to the next half, which was so brilliant, especially towards the end, mind blowing.\r\n\r\nIt was a multi starrer film, only that's much I know, but I kind lazy to count how many were there because I thought it was a modernised and an improvised cop version of the 'Ten Little Indians' theme. There's no evidence to prove that, it is just my theory. But seeing all the deaths and the conclusion, I felt the inspiration to the writer might have been possible.\r\n\r\nFrom the director of 'Lawless' who aimed for another success, but received backfire from critically and commercially. Mixed response from the audience though. Definitely it will find its own fans in the days and years to come. The ladies had scopeless roles, so they're completely forgettable their existence the narration, except very often just appear to show the faces. But well made crucial parts, in all the action sequences which kind what back the films along with Casey and Harrelson's parts.\r\n\r\nLike there is a saying, 'slow start, but ended strong', this film belongs to the same category. If you hold your patience for nearly 2 hours long, in the end you might feel after all it was not a bad flick. So not recommended to everybody, at a same time not suggested to skip it without properly knowing about it. P.S, the closing credit song, the remix version of 'Pigs' by Cypress Hill was awesome considering the theme of the film, I mean the corrupted cops, but felt the words were strong.\r\n\r\n6/10", "created_at": "2016-06-24T17:56:10.573Z"}, {"movie_id": 146198, "review_id": "57d68f019251416f65007155", "author_rating": 5.0, "review_text": "An okay movie with some very impressive visual flourishes, but a narrative mess, and not up to par with Director Joh Hillcoat's prior work.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-12T11:18:25.824Z"}]