[{"movie_id": 615, "review_id": "632610f3174973007a3204f0", "author_rating": 7.0, "review_text": "The fact that there is precious little English spoken here can come across as a little off-putting at the start. Until, that is, you remember that this is a story that has been told several times - not least in the bible, and so actually the language of the dialogue doesn't really matter so much. Once I was over that, I was rather impressed by the standard of production presented here by Mel Gibson. Jim Caviezel has a wonderful vulnerability and potency in his portrayal of the last day spent by Jesus before his crucifixion. The cinematography is very good, as is the glorious attention to detail with the costumes and settings rich and authentic to behold. The last half hour demonstrates a degree of brutality that is very difficult to watch but somehow that, too, enhances the plausibility of this speculative depiction of events. The supporting cast of relatively unknown talent work well to generate a sense of the inevitability of the proceedings and John Debney's score is rousing and effective too. It does play a little bit fast and loose with the text of the bible, and the very graphic nature of the lives (and loves!) of some of the characters - and their flaws - is provocative and challenges the more traditional (i.e. Cecil B. de Mille) interpretations of this ultimate example of man's inhumanity to man. It is far too long, though. It really does take it's time to get going - perhaps expending a little too much effort on scenario development for subjects that most of us already know (regardless of our own personal faith). At times the direction is also a little bit heavy-handed. It forces us to accept the conclusions drawn by the screenplay, rather than allow us much scope to evaluate, even judge, the unfolding events for ourselves. That said, Gibson has not delivered anything elegiac here, he successfully offers us something illustrating the warts and all existence of biblical-time, Roman occupied, Judea and it is well worth a watch.", "created_at": "2022-09-17T18:24:51.298Z"}]