[{"movie_id": 93456, "review_id": "51ec26b719c29551dc10feeb", "author_rating": null, "review_text": "Three years ago, Despicable Me launched Illumination Entertainment and announced Universal Studios as a viable player in the animation game (only Disney/Pixar and DreamWorks used to show up to these box-office battles). The film wasn't even the only supervillain animation to hit the theaters that year, but it did one-up its rival Megamind both in critical acclaim and commercial success.\r\n\r\nNow, the original film's creative team returns with Despicable Me 2, continuing the adventures of former supervillain-cum-adopted father Gru, his precocious daughters Margo, Edith, and Agnes, and his little, yellow, nonsense-spouting minions. Following closely on the first film's heels (this film gratifyingly puts a premium on continuity), the now-retired Gru is settling into his new paternal role, and while the spikier parts of his personality remain, he's reshaped himself into an adoring father and potential purveyor of jams (and jellies). When an evil plot threatens the globe, however, Gru finds himself pulled back into the supervillain game by the Anti-Villain League, who've recruited him to be the hero, an ersatz spy who knows how the mystery bad guy thinks. One earnest and delightfully overbearing partner introduction later, the pair (Gru and newbie AVL agent Lucy Wilde, played by Kristen Wiig) are undercover as bakers in a strip mall where the bad guy's scheme is likely to go down.\r\n\r\nDespite the world being threatened, the stakes feel surprisingly low in the film; the archness of the plot never feels as real or immediate as the character interactions, which are enjoyable all the way through. Here, Gru realizes his loneliness, his neophyte partner realizes her true calling, and his daughters come to grips with new realizations and wishes. The characters take center stage, rarely letting the transparently-raised stakes of the plot machinations get in the way of sitcom-like character arcs such as the eldest daughter dating (and Gru's dogged insistence on undermining it) or little Agnes wanting a new mother. But that's sort of the magic of these films; despite the plot beats being the stuff of basic sitcoms, the setting and characters manage to still make the film a winning combination.\r\n\r\nSteve Carell dusts off the strange Eastern European accent he originated for Gru, and manages to be both an amusing character and his own straight man. Miranda Cosgrove, Dana Gaier, and Elsie Fisher embody adorableness as the girls. But it's Wiig who steals the show as Agent Wilde, a professional woman who is also goofy and personable. Wiig and Carell have fantastic chemistry, even with just their voices in play.\r\n\r\nThe minions, those little yellow blobs in overalls that accompany all of the film's publicity, are back and hilarious as ever, despite their laser-like focus on slapstick and complete lack of intelligible dialogue. The Despicable films seem to be two separate animation genres welded together: the first is a heartfelt, Pixarian meditation on the nature of family, but the second is the part with the minions, which embody the anarchic spirit of the Looney Tunes more successfully than any of their predecessors. It's a strange melange that shouldn't work, but dammit, it does, and the resulting films wound up being both moving and guffaw-inducing.\r\n\r\nThe other aspect of the Despicable films that bowls me over is the virtual cinematography; truly, alongside the best of Pixar's output (like Wall-E), these are some of the most beautiful animated films ever made. The use of color, depth, and art are stunning, from Gru's Charles Addams-inspired design to the beautiful play of light, shadow, and color. This sequel follows the high standards of the first, and the result is a feast for the eyes.\r\n\r\nThe bottom line is that like the first film, this one is a trifle, but a very enjoyable one. It's little more than a victory lap for Carell and company, but when there are characters you can enjoy this much, what's wrong with spending another couple of hours with them?", "created_at": "2013-07-21T18:21:43.587Z"}]