[{"movie_id": 599975, "review_id": "5e3c893d43250f0015c97826", "author_rating": 2.0, "review_text": "Not sure who thought this was a good idea, much less release this to theaters (this is the kind of film one would find for free on Amazon Prime). I like the lead actress thanks to that show YOU, but otherwise this was just a dumb movie. Perhaps the premise would've been fine as a segment for an episode of The Twilight Zone or, back in the day, Tales from the Crypt. Perhaps.\r\n\r\nUnfortunately with only a $6.5 million budget and grossing $35 million worldwide, a sequel is inevitable, though wouldn't surprise me if it gets streaming release. **1.25/5**", "created_at": "2020-02-06T21:46:37.159Z"}, {"movie_id": 599975, "review_id": "5ead0abd1a934f0020e856b5", "author_rating": 1.0, "review_text": "As a fan of Final Destination (2000) I approached the film with an air of optimism hoping to discover a similar result. The premise was interesting, ideal for the mystery horror genre. \r\nUnfortunately, 'Countdown' quickly descends into your standard cheese eg. jump scares, silly monsters that come and get you. Too much of the unknown malevolence is revealed too soon - and the mystery, suspense and most importantly scariness falls by the wayside. Fear lies in the unknown and what your own mind can conjure up. Unfortunately, not many filmmakers appear to realize this anymore... but that's not what killed this movie.\r\n\r\n**SPOILERS!**\r\nJust about every mainstream movie and TV show made nowadays is filled with political messaging; some more overt than others, but if you know what to look for you'll see it.  \r\nI was really hoping this one could just stick to telling a story, where I could sit back for 90 minutes and watch our protagonist \"Quinn\" race against the Countdown to avoid certain death, as opposed to having political messages shoved down my throat and endure yet more anti-White attacks, insults and repugnance. Shamefully, 'Countdown' joins that growing list of Cultural Marxist propaganda. That's what destroyed this movie for me.\r\n\r\nNow not all of these instances alone I'm about to provide are proof of Cultural Marxism. It's the contrast of having a false representation forcibly repeated with agenda driven consistency and how they're programming us to believe that these representations are real-world norms. \r\nGenerally observable group behaviors, patterns and actions are no longer being characterized and instead misrepresented; even inverted in media. Stereotypes are \"no longer politically correct,\" regardless whether they're accurate or fair. Alternatively, these real-life human traits and personas are being distorted not only in fiction but the real world for a political agenda.\r\n\r\nThe propaganda that's occurring throughout the majority of media now has a real-life impact and consequences. In other words; our understanding of real-world actions, events and moral standards are being corrupted and manipulated through media.\r\n\r\nSome examples:\r\n\r\n* \"Evil White man\" as doctor Sullivan the sociopath and sexual predator. [Whites with fair hair and blue eyes are increasingly portrayed as evil villains and wrongdoers; untrustworthy and treacherous. Often with English, German or Eastern European accents].\r\n* \"Good & heroic Black man.\" In contrast noble Matt is a perfect gentleman and sensitive boyfriend material. [Black and Brown performers are often now given the role of hero or good doer. Courageous and virtuous; trustworthy and loyal].\r\n* White male bashing and anti-White remarks. The line by Matt: _\"I just found out I'm gonna die and I don't mind taking a White man with me.\"_ Imagine if the roles were reversed?\r\n* Miscegenation. Predictably a blue-eyed, blonde girl with a Black man. Race-mixing propaganda is everywhere you look now. Film, TV, Advertising etc. Diversity means: 'without Whites,' particularly straight, White males. The more diversity there is, the fewer White people they'll be.\r\n* More White male bashing & conspiracy theorist attacks. A drunk at the bar becomes a test subject because he's talking about Antarctica and \"Flat Earth.\" Matt wants to get him to download the app so they can read the Terms & Conditions and Quinn doesn't feel good about it. \r\nOf course, once the drunk mentions the taboo subject you're not allowed to question, 'the Holocaust,' Quinn changes her mind and promptly tells Matt to go ahead. Bear in mind the protagonist, Quinn is supposed to be a caring, ethical nurse!\r\n* Quinn and Matt share an interracial kiss in front of her teenage sister and she looks on approvingly. [The younger the age one can start receiving programming & conditioning, the better. This has been proven with declassified mind control experiment files].\r\n* In a scene at the end credits 'Tech Nerd' Derek is on his Tinder date and acts like a complete ass and turn-off to his date. If only she'd chosen the \"more desirable\" non-White date instead?!\r\n\r\nNow that I've pointed out some examples of Cultural Marxism and anti-White propaganda you'll begin to notice them everywhere - that's if you haven't already. Hope this review helps and you got to swallow a few Red Pills in the process! Thanks for reading.\r\n\r\n**Verdict 1/10**\r\n**'Countdown'** is more subversive Cultural Marxist anti-White propaganda with a story that could have been good if done right.", "created_at": "2020-05-02T05:53:01.185Z"}, {"movie_id": 599975, "review_id": "5ff722b9383df2003e30656a", "author_rating": null, "review_text": "Countdown is another of Hollywood's recent attempts to generate a quick win with a small investment, yet another soulless film and product of a system that wastes premises with potential in generic films.\r\n\r\nThe film follows Quinn Harris, a girl who decides to download an application that can predict how long until our imminent death. However, everything gets complicated when Quinn discovers that she has just over two days until her death prediction and strange things start happening around her. Reading a short description of these, we cannot help but be intrigued by what the film may offer, as we live in a world dependent on technology and applications that make life easier for us on a daily basis.\r\n\r\nBut instead of observing on screen a premise with explored potential to the fullest, we are forced to visualize a generic amalgamation of Jump Scares every minute, without any kind of tension, without any kind of terror. \r\n\r\nThe film is really more of the same, more than we have seen millions of times, without offering anything new, without even trying to be original (since, in its execution, it resembles the saga of films The Last Destination, only without the elaborate bloody deaths that made the 5 films so famous), containing only a relatively decent cinematography and direction.\r\n\r\nIt's really a shame to see ideas like the one that gave rise to this film being wasted, turned into scripts full of unexplored, basic mythologies and monotonous and trivial dialogues. The characters we are presented with are superficial, without any kind of distinct characteristics (although the actors do a good job with the material provided to them), the situations they find themselves in are familiar, many of the scenes in the film are unintentionally hilarious (which is not supposed to happen when you want to scare the audience) and the tone of the film oscillates as much (sometimes it tries to be completely terror, others a kind of amalgam of comedy and terror) as the waves of the peaceful.\r\n\r\nAll in all, this is a film that is not at all worthwhile, a product of a studio looking for easy money, without really wanting to present the audience with something worthy of their attention. This is the worst kind of horror film: the one without artistic integrity.", "created_at": "2021-01-07T15:03:21.642Z"}]