[{"movie_id": 11908, "review_id": "60a2b42fe18e3f002a442636", "author_rating": 4.0, "review_text": "_**Slasher parody with good plot & technical work, but too raunchy and not funny enough**_\r\n\r\nTired of partying on Bourbon Street, a guy and his buddy (Joel David Moore and Deon Richmond) decide to take a night sightsee with other tourists at the alligator-infested bog, unaware of the dubious nature of the tour and the legend of a notorious hatchet man lurking the woods.\r\n\r\n\"Hatchet\" (2006) is a horror/comedy/spoof that combines the indoor swamp sets of “Man-Thing” (2005) with elements of the “Wrong Turn” or “Friday the 13th” franchises and the parody tone of “Club Dread” (2004). Regrettably, it’s the least of these. There’s nothing wrong with the cast or technical filmmaking as the gore, F/X and swamp sets are fine, although the ‘monster’ make-up looks kinda cartoonish (which fits the genre).\r\n\r\nWhile it’s relatively amusing and occasionally funny, it’s hindered by an odious raunchy air right out of the gate. For instance, the two supposedly hot girls flash their breasts every 5 minutes in the first half hour. Don’t take that as prudish, I’m just pointing out that a movie is questionable when it goes overboard with female nudity to hide its deficiencies. Meanwhile the heroine played by Amara Zaragoza is interesting, but she has little sex appeal, although that’s a matter of taste.\r\n\r\nI could handle those flaws if the story was more compelling and the humor more amusing, yet that’s not the case. Although the plot is great, the script needed a rewrite to flesh out better prospects. But that takes time & money and the flick only cost 1.5 million, which is almost six times LESS than what “Club Dread” cost.\r\n\r\nI should add that Kane Hodder plays the Jason-like antagonist while Robert Englund has a cameo in the opening.     \r\n\r\nThe film runs 1 hour, 24 minutes, with a longer version running an additional 9 minutes. It was shot in New Orleans (Mardi Gras sequences) with the swamp scenes done in a convincing indoor set at Sable Ranch, Santa Clarita, California.\r\n\r\nGRADE: C-/D+", "created_at": "2021-05-17T18:21:35.857Z"}]