[{"movie_id": 309302, "review_id": "57951efc92514142690041b1", "author_rating": 6.0, "review_text": "> When the man and the nature overlaps.\r\n\r\nA semi biographical adventure-drama from China directed by the French director known for 'Seven Years in Tibet'. He was chosen after many Chinese filmmakers refused to take the project, because of the dedication it required. The film highlighted the outcome of the two ethnic groups, Mongols and Hans overlapping with the mother nature. The film should have been one of the best in the line of 'Siberia Monamour', but there a few things that did not work in its favour.\r\n\r\nIt was just like the 'Embrace of the Serpent', based on a person who went to a distant place with a motive, but learnt another thing. Especially realsing the value of the native people and their land and culture. The main character was totally resembling to the Brad Pitt's role from 'Seven Years in Tibet' and very inspiring. You learn nothing by observing afar, you have to get in and get along to gain knowledge of the place. So you have to be one of them in order to see through their eyes of the place and then would find its true identity.\r\n\r\nThe tale begins in the late 60s during the China's cultural revolution. Two young students from Beijing sent to a remote place in the Inner Mongolia to teach the locals read and write. Instead, one of them gets interested in wolves and decides to study them by raising a cub. During that time, the confrontation between the wolves and for the human encroachment of their natural habitant determines the future of the grassland. The ultimate face-off between them ends with the emotional.\r\n\r\n> \"The problem for us Mongols is that our history wasn't written by us, but mostly by our enemies.\"\r\n\r\nWhen you don't belong to that place, you should not intervene in its natural order. The China's history is always bad when it comes to the land grabbing, either it is the ongoing South China Sea dispute or the Tibet and thousands of others. This is such a film made by China itself that spotlights their wrongdoings. Just see the film to know how much different the Mongolian, especially the nomad culture and the Han-Chinese. They' both saw the mother nature with different intentions. So imposing one land's rule to another does not work and that's the film's most important message.\r\n\r\nVery sad the film was not realistic since it was based on a real story. Visually it was very good, especially the locations were spellbinding and used so well to tell a story, but the animal behaviours were too silly, something like that happen in the children's stories. Then there's evidence the animals were harmed during making it, so feels uncomfortable in many scenes and I won't advise kids to watch it if they're very fond of the animals. In that angle this film got a completely a wrong motion picture rating. If you are a light hearted, you should as well turn away from it. Because even though they won't show the killings, in a few segment they were just graphics and make-up, but still you are definitely going to feel the pain, very disturbing film.\r\n\r\nIn a few scenes, feels bad for what Mongols regrets for letting the Hans to do all the terrible things to their land despite at one stage of the history they were more superior than them. At least the film ended on a positive note, only because of the alteration in the screenplay from the controversial book. It was originally selected to represent the previous Oscars, but soon it replaced with another to avoid the International humiliation. I think the film was not that terrible, but not being true to the book was the issue. It is very hard to suggest it, it might upset you for the various reasons, so all I can say is choose wisely.\r\n\r\n6/10", "created_at": "2016-07-24T20:03:08.646Z"}]