[{"movie_id": 256924, "review_id": "577aaf2dc3a368204f001715", "author_rating": 9.0, "review_text": "> A 40 year old letter and the road to redemption.\r\n\r\nFirst of all, the director proved the script is very important to a film's success. He wrote it, basically he's a screenplay writer who had written many great stuffs and this film is his first directional venture. He excelled it by picking the right stuffs for the project. As the great actors on-board, it was shot in the fine locations and the music was wonderful. It should have been a dream coming true for him, for a great project to work with.\r\n\r\nThe dialogues were so brilliant like the poems. I'm sure you won't end watching it without having fun because there were many small-small jokes attached everywhere. It was inspired by the real story of a person, but I think they have made some changes for a cinematic translation, hence it is not a biopic.\r\n\r\nMainly it revolves around 4-5 characters and the cast were amazing in their respective roles. Especially the Al Pacino, without him this film would have not been this much exciting. If you're an his ardent fan, you will going love this from your heart and others as well find it a beautiful drama-music. He was nominated for Golden Globe Awards for his excellent title role display. A very appropriate film for him for his age.\r\n\r\nYou know in this era, film fans are looking for what superhero film is going to hit the screen, a heartwarming film like this is what makes them realise still there's a hope for small scale films. Only if they're a welcoming type. Especially for the yesteryears actor who are physically can't compete with the young generation actors, films like this is a breather.\r\n\r\nThis is a tale of an aging star singer who one day discovers a letter written for him by an another great singer of his generation when he was yet to taste the success. 40 years later, that mean now he decides to quit his music tour and begin to trace his family for the unfinished business. So the remaining narration reveals lots of inspiring and heartbreaking events. \r\n\r\n> \"If I am going to find any kind of redemption, I can't waste any more time.\"\r\n\r\nLife as a singer, especially being old and seeking redemption won't quite end as expected. Over the 40 years of addiction to drugs, booze and women, a self-discovery sail begins. In an unpredictable world, anything might happen and so this man's journey tells the impact on the family he's going to meet. It is not just about facing the one who he had abandoned long ago and now trying to fix it, but in reality, life is not easy, especially family means lots of commitment and choosing the best for it should be priority where this film opts that root to reveal a story.\r\n\r\nIt is almost a good family film, but for the theme the drug parts were essential, so that changed its rating. The sub-plots like how he tries to win a date add more on the romance side of the tale. Kind of predictable because of the heartwarming drama, but differences were made from the twists in the narration. Not of that breathtaking kind, just developed to have a fresh aspect an the well known theme. Especially the ending was so simple yet very cool.\r\n\r\nAs usual Bobby Cannavale was in a supporting role, but it was kind of different. He shined like a star, he appeared in a well noticeable character than ever. Along with Jennifer Garner, his performance in the film covered an important portion. So it is not just Al Pacino, these guys as well deserves to be appreciated for their contribution. A film that kind of resembles the recent 'Ricki and the Flash', except it was a male version. A product like this hard to come by, so consider to check it out. That means I'm recommending it.\r\n\r\n9/10", "created_at": "2016-07-04T18:47:09.884Z"}]