[{"movie_id": 16608, "review_id": "5157f78419c2953ed0168db5", "author_rating": 4.0, "review_text": "Well, no matter how I rate this movie a lot of people are going to say that my rating is wrong. That is something that you probably can say about any rating for any movie. I feel it is especially true as far as this movie goes though. As you can see from my rating I was not exactly thrilled by the movie. That does not mean that it is a bad movie. Again, this you can say about a lot of ratings, especially my ratings.\r\n\r\nOkay, I guess I have confused everyone enough now so let me try to explain. As a piece of cinematic art this movie is excellent. The acting is quite good. I especially liked John Hurt as the literate bounty hunter but most of the main characters where performing admirably. The scenery is wonderful. The Australian outback makes for a excellent backdrop and it is indeed a nice change from the classical North American western sceneries.\r\n\r\nAs a movie it falls flat though. In my opinion a movie should at least try to tell a story. Even if it aspires to be a piece of art it should try and tell a story that the audience can, in one way or another, follow. This movie have a basic idea of a story but it does not really tell a story. We never get to know who the bad guys really are, what they really did, except for a bunch of hints about killing and rape, or why. Heck, we never actually get to know of the guy the flogged to death where really taking part in the deed or not.\r\n\r\nThroughout the movie the bad guys are supposedly hiding in some place where it is impossible to get them so the main character tries to get the bad guys brother to kill him. Not very plausible at all. The governor, Eden Fletcher played by David Wenham, or whatever he as supposed to be was pretty much an asshole. Okay every movie has to have one but his role was never really developed. Once he managed to get the young kid, innocent or not, flogged we really do not see much of him for the rest of the movie.\r\n\r\nThe end of the movie is much the same as the rest of the movie. Cinematically excellent but not much of a story. There is no real conclusion. It just ends in a sequence of well done scenes but without any real story behind it.\r\n\r\nMaybe I’m a too simple mind when it comes to these kind of movies but I, even though I appreciated the graphics that was shown on my TV-screen, I did not really enjoy it as a movie.", "created_at": "2013-03-31T08:44:52.751Z"}, {"movie_id": 16608, "review_id": "549dfb679251411d53000e1d", "author_rating": 7.0, "review_text": "Australia. A man looking to catch a criminal by the name of Arthur Burns (the head of the Burns Gang). He catches his brothers instead, and offers the elder brother (Guy Pearce) a deal. A proposition. Bring him Arthur Burns, the man who raped and killed Eliza Hopkins. And to make sure that Charlie will honor the deal, he keeps the youngest brother, Mikey.\r\n\r\nThe stage is set early on in the movie, and yet, this is more than just a simple story about a gang of criminals and the law enforcers who are chasing them down, this is a story about a country being created, about the fight for survival in a strange land. About justice and peace of mind.\r\n\r\nNick Cave wrote the screenplay, and also most of the music. This gives us a hint that it is not going to be your average movie, but something... more, something different. We can also expect the sound to be spectacular and forceful, and indeed, it is. The music here very much reminded me of the music in There Will Be Blood by Paul Thomas Anderson, extraordinary and... haunting really. But it doesn't stop at the music, the visual side of the movie is rather stunning in a haunting way as well, dirty and dusty all the way through. I love when a movie has a distinct visual style and rhythm, and this one does.\r\n\r\nThe movie starts out with a bang, as the law enforcers hunt down the two younger brothers, Charlie and Mikey, but as soon as Charlie is given the proposition, it slows down considerably and branches out to tell two stories, that of Charlie hunting down his brother, but also that of Captain Stanley and his wife, two opposing forces. This guy clearly has demons of his own, and is looking for justice to be served. I love the pace in this movie, it wants to tell its story just right.\r\n\r\nThe cast is a great one, as mentioned Guy Pearce plays one of the Burns brothers, together with Danny Huston. These guys are dirty and bend on doing whatever it takes to survive. Captain Stanley is played by the amazing Ray Winstone. He plays the role with a quietness and a subtlety that surprised me. He is the hero of the story, at least for me, and wants only justice to be served. In other parts we see David Wenham and John Hurt, both delivering quirky and interesting characters. A great movie needs a great cast, and this one most certainly have that.\r\n\r\n_Last words... this movie does not compromise. It is honest, it is dark and it forces you to think about right and wrong. How does one identify a criminal and what forces people to do evil deeds? Nothing is simple really, and it shouldn't be. Most people have both light and darkness within them, and that is the case in this movie._", "created_at": "2014-12-27T00:20:55.285Z"}]