[{"movie_id": 114150, "review_id": "52b7e873760ee37a6d01c898", "author_rating": null, "review_text": "A modern cult movie (in a good way, of course). It started a movement of sorts with people posting youtube videos with them singing and rearranging cups. Very powerful!", "created_at": "2013-12-23T07:38:27.143Z"}, {"movie_id": 114150, "review_id": "552fd587c3a3681c41000fe2", "author_rating": 5.0, "review_text": "Not sure why this movie has become so famous.\r\n\r\nIt is not a really good comedy with the exception of the jokes by the competition commentators and the story as with any movie of this kind is weak and expectable.\r\n\r\nNothing very remarkable here but the fact that there are so many fans of it.", "created_at": "2015-04-16T15:30:15.336Z"}, {"movie_id": 114150, "review_id": "58a50c0c925141655b0018cc", "author_rating": 8.0, "review_text": "A quintessential crowd-pleaser. Exuberant musical numbers and great chemistry between the cast makes this a 'chick flick' everyone can enjoy.", "created_at": "2017-02-16T02:18:52.136Z"}, {"movie_id": 114150, "review_id": "60493993c4ad59002a4dc416", "author_rating": 8.0, "review_text": "More entertaining than anticipated.\r\n\r\nI enjoyed myself watching <em>'Pitch Perfect'</em>, simply put. That's largely thanks to pleasant music choices and a fun cast. The plot isn't anything crazy good but the aforementioned things are done nicely.\r\n\r\nAnna Kendrick (Beca) is enjoyable as the lead, she is supported by Skylar Astin (Jesse) who I did find a little bit hit-and-miss to be honest. Rebel Wilson (Fat Amy) and Brittany Snow (Chloe) are the only ones of the rest that stood out to me, though all of the <em>The Barden Bellas</em> are solid in actual fact. Elsewhere, Adam DeVine (Bumper) is amusing.\r\n\r\nDon't get me wrong there a few moments that are cringe and some jokes do not land, but for the vast majority it's a fun watch - in my opinion, anyway. Onto the sequels!", "created_at": "2021-03-10T21:26:43.854Z"}, {"movie_id": 114150, "review_id": "64c1998e097c490100d1dd1b", "author_rating": 7.0, "review_text": "The best out of the series. The woman against the men. In the biggest singing group competition. Very funny as well.", "created_at": "2023-07-26T22:09:18.575Z"}]