[{"movie_id": 329996, "review_id": "5c9cfacd0e0a2613ebebb767", "author_rating": null, "review_text": "Disney has continued their trend of live-action remakes of their animated classics with “Dumbo”. The film follows the same premise as the 1941 classic in that a baby elephant with giant ears is born into a travelling circus. Like in the animated film he is separated from his mother and soon becomes an unlikely circus act when it is discovered that his giant ears give him the power of flight. \r\nIn the new version we are introduced to Holt Farrier (Colin Farrell); who returns from WWI injured and dealing with the fact that his wife has died  and he must raise their two children alone. Further complicating matters is the fact that Circus owner Max Medici (Danny DeVito), has sold the prized horses Holt used in his act in an effort to keep his struggling circus alive. \r\nWhat has become a tragedy soon becomes a boon when wealthy industrialist V.A. Vandevere (<ichael Keaton) offers to make Max a partner and take him and his troup on at his fabled entertainment park with Dumbo as his featured star. \r\nIt is at this point where the film takes some wild deviations and becomes very linear with paper thin characters and an emphasis on effects over story. \r\nDirector Tim Burton has once again crafted a film filled with lavish visuals as his take on the entertainment park and circus is amazing; but it as usual comes at a cost. Like most of Burton’s works, the visuals are the star and key element and the development of characters and story are often given little more than lip service. \r\nThe same is true fro this film as we learn noting about the motivation of the characters and the villains play out as stock baddies without even a nod as to why they are so inclined to tehir action.s They are being evil just for the sake of being evil. The same can be said for the other characters as we are given very little reasons to care for them. There is a nice subplot with Eva Green but it is never fully developed and the worst part is that the title star almost becomes an afterthought in the final acts so we can be given scene after scene of lavinsh park visuals. \r\nThe film may be a bit to dark and intense at times for younger viewers and those who remember the original may have a hard time with this take of the film. It entertains at times but could have been so much better. \r\n3 stars out of 5 \r\n \r\nSecond review by Tracey Barrientos\r\nIn 1941 Walt Disney Pictures brought audiences around the world the fourth animated Disney feature film Dumbo. 78 years later Disney has partnered with Tim Burton to bring audiences of new generations a fresh and live action take on the classic tale.\r\nAfter returning home and left injured from the war, Holt Farrier (Collin Farrell) unites with his kids and his beloved job and home. His home is a traveling circus and his act has been cut due to his injury. Max Medici (Danny DeVito) the owner of the circus asks him to forget about the act and instead take care of a newborn elephant with hopes that the young elephant would help the once booming but now looming circus. The peculiar pachyderm nicknamed Dumbo with extremely oversized ears is the new laughingstock of the circus until Holt’s children discover the magic within Dumbo. He can fly and is attracting attention from all around.\r\nAs a huge Tim Burton fan I was ecstatic to hear that he was set to direct the live action version of the beloved film. A fantastic cast was put together and to be honest I don’t know that anybody else could’ve played those roles as well as Collin Farrell, Michael Keaton, Danny DeVito, Eva Green and Alan Arkin just to name a few. They brought a sense of magic and true emotion to each character which added depth and soul to the film. Every time the first note from Danny Elfman’s music reaches my ear I instantly get goosebumps. I was extremely happy to here that familiar music in this film. As with all of Tim Burton’s films, it gave a touch of magic and intrigue that Dumbo deserved. The colors were beautiful and vibrant but still held drab contrast to what we are normally used to.\r\nI was asked a little bit ago if the film made me cry. The answer is I did. Both with sad and happy tears. A film that encapsulates so many emotions in only two hours and leaves you with a happy heart, THAT is what I look for in a film. That is what a film should make an audience feel. A good tug at those heart strings along with happiness and laughter is the perfect formula. Well done Mr. Burton! I recommend this film to be seen by fans old and new because you won’t be disappointed.\r\n5 out of 5!", "created_at": "2019-03-28T16:48:13.872Z"}, {"movie_id": 329996, "review_id": "5ca367a60e0a2605a68e73d1", "author_rating": 7.0, "review_text": "If you enjoy reading my spoiler-free reviews, please follow my blog :)\r\n\r\n1941’s Dumbo was never a favorite of mine. It’s a great movie with a sweet message (as most Disney flicks), but I was curious to see how a remake of a 60-min film would develop. Obviously, changes to the story not only will occur, but they need to. People have to stop desiring these live-action remakes to be a literal copy-paste of their originals and start being fair to these movies. Pure animation is different from live-action, and the latter provides a much more realistic environment than the former, so it’s evident that every remake they produce will have some “updates” in the more “silly” aspects.\r\n\r\nFurthermore, I’ve witnessed a couple of “critics” hating this Dumbo. Hating! Calling it one of the worst films of the year! Now that’s a strong feeling to have against a movie that improves so much regarding its original. Yes, it has a bunch of narrative issues, and the dialogues can be cringe-worthy, but hating this 2019 remake while defending the original as it was some kind of masterpiece is ridiculous. Complaining about the 2019’s ending when the 1941’s is absolutely inadmissible is being a hypocrite. Whining about Dumbo not being 100% the star of the show when the original has the elephant discover his flight abilities four minutes before the end is dumb. In addition to that, this film runs for twice the original’s runtime! What did you expect?! That human characters wouldn’t be a necessary modification? \r\n\r\nSome “critics” are even complaining about animal abuse or their unnecessary exploration … Are they joking?! Have they seen the original? Do they remember how racist it was? How discrimination was treated as comedy? Even alcohol was handled as a plot point for God’s sake! 2019’s Dumbo barely has any animal violence, and its final message is against animal captivity or exploration, so any person who criticizes this ending is either a despicable human being or not a fan of the original Dumbo, at all.\r\n\r\nEnough about those “critics”. I feel sick just remembering what they wrote/said. Unfortunately, 2019’s Dumbo does have a lot of screenplay issues. There’s no way of denying it. The human characters are filled with cliche storylines and child-written dialogues. I know that analyzing children’s acting is not exactly a fair critic, but I’ve seen so many remarkable young actors nowadays, who make Nico Parker and Finley Hobbins performances look not that good (their scripts also don’t help). The visual style characteristic of Tim Burton is definitely present, even if its magic becomes overwhelming at times. 1941’s Dumbo was very concentrated in one small location contrary to its 2019 remake where V. A. Vandevere‘s park feels like Disneyland.\r\n\r\nThe stiff dialogues don’t help the movie’s pacing, and its tone could be better balanced. Nevertheless, just the opportunity to watch such a gorgeous, magnificent, and visually jaw-dropping live-action elephant come to life is absolutely delightful and entertaining as hell. When a character like Dumbo makes you cry when he’s crying, makes you feel sad when he’s feeling sad, makes you happy when he’s feeling happy, that’s when you know the visual effects team has reached a point where live-action is pretty much reality. The little elephant looks like an adorable little elephant. I mean, what better compliment can I give a live-action character than “it looks and feels real”?\r\n\r\nEven with the issues mentioned above, it’s still a heartfelt story, filled with emotional moments, and a wonderful message. Technically, it might lack consistency and some overall quality, but I end up enjoying myself. Experiencing Dumbo‘s pain, happiness, and his bond with the kids flourish is special. Colin Farrell and Eva Green deliver good performances, and their character arcs, cliche as they may be, still carry some efficiency. There’s a wrong vibe surrounding the word “cliche”, like it’s a bad thing. Not at all! Something being cliche just means we’ve seen that before a lot of times, it doesn’t mean we’ve seen it performed better or worse. Dumbo is a remake of a very influential 1941 film, so obviously, cliches are a certainty. It’s a Disney tale, after all. \r\n\r\nIn the end, cliche as it might be, 2019’s Dumbo improves on a lot of aspects of its predecessor. I do believe these movies are almost incomparable since the dimension, runtime, and even the main plot are surprisingly (or not) different. Still, not remembering or even acknowledging the original not only is an absolute flaw, but it can ultimately make you a hypocrite, so be careful with what you write/say. I understand a person not enjoying this film or not liking it as much as I did, but if you hate (!) it, you better give me good enough reasons.\r\n\r\nDumbo is probably the most visually stunning and incredibly realistic live-action character Disney was able to produce so far. This little elephant alone is worth the price of admission. His arc is way bigger and complex than the one in the original, which can either delight or disappoint you. To me, it not only worked, but it finished strong and way better than the original. It’s upsetting that the screenplay couldn’t accompany Burton‘s impressive visual style, even if overwhelming at times, as well as the human characters who feel a bit detached from the actual story to tell. It’s still a good time at the movie theater, so go see it!\r\n\r\nRating: B", "created_at": "2019-04-02T13:46:14.773Z"}, {"movie_id": 329996, "review_id": "5ca9798dc3a3683f4f60839a", "author_rating": 6.0, "review_text": "The visuals are done well, but this movie is crowded and there wasn't enough working room to make this the great movie I'd hoped for.", "created_at": "2019-04-07T04:16:13.581Z"}, {"movie_id": 329996, "review_id": "5d2e991827d9cc00127c74f2", "author_rating": 3.0, "review_text": "Can't believe I got cheated out of Pink Elephants on Parade like that. Literally the only reason I watched this. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-07-17T03:42:16.609Z"}, {"movie_id": 329996, "review_id": "5fb490ab0d5d85003e418ef1", "author_rating": 7.0, "review_text": "Straight off the bat: I do not like the 1941 original, which is one of Disney's weakest animated films in my opinion. So that's worth bearing in mind.\r\n\r\n2019's <em>'Dumbo'</em> surpasses the '41 film with ease, it's admittedly a low bar. There's actually a storyline to this one which is pleasing, while the live-action nature really helps suck me into believing in the - obviously ludicrous - plot. With that noted, it isn't perfect. The pacing is off, while the antagonists are a bit irritating - if suitably cast.\r\n\r\nAs for the protagonist, Colin Farrell plays his role nicely. Danny DeVito is an obvious but excellent cast for Max Medici, while Michael Keaton and Eva Green suit their roles. Amusing cameo from Michael Buffer too, by the way. As for the kid actors, not great... There is no real human appearance in the first film, so this one had to create one from scratch and I think they did a good job.\r\n\r\nDumbo is super cute, just as before, and his story is undoubtedly hearty; which are arguably the only things that the 40s film did right.\r\n\r\nOverall, I liked this remake.", "created_at": "2020-11-18T03:10:35.738Z"}, {"movie_id": 329996, "review_id": "603d4d1c519bbb00458fd59b", "author_rating": 5.0, "review_text": "_**It looks great and has a fine cast, but the story’s curiously lackluster**_\r\n\r\nAfter WW1, a struggling American circus discovers they have a star attraction on hand, a big-eared baby elephant that can fly! Colin Farrell plays the one-armed elephant trainer, Danny DeVito the circus owner, Michael Keaton a Walt Disney-like entrepreneur and Eva Green his French performer.  \r\n\r\n“Dumbo” (2019) is a live-action remake of the 1941 classic and almost twice as long. Being made by Tim Burton, it LOOKS great and you can’t beat the cast (except for the monotone kids). Unfortunately the story is generally dull. One can’t help but think of the excellent “Water for Elephants” (2011), but this is nowhere near the same league. The flat script by Ehren Kruger needed reworked for more human interest and pizazz. It plays it too safe.\r\n\r\nIt’s strange that a Disney film would feature a Walt Disney-like character (with ‘Dreamland’ standing in for Disneyland), but put a malevolent spin on him. Meanwhile the sharp Green is serviceable as the aerial performer who works with Dumbo, but she seemed to be a tad long-in-the-tooth for the role at 38 during shooting.\r\n\r\nAs a fan of the underrated “Dark Shadows” (2012) I thought I’d like this despite the bad reviews and mediocre box office performance. Wrong. It’s okay, but that’s not good enough for a live-action remake of such an iconic flick.\r\n\r\nThe film runs 1 hour, 57 minutes, and was shot in Cardington, Bedfordshire, England, and Pinewood Studios, which is about an hour south in the west London area.\r\n\r\nGRADE: C", "created_at": "2021-03-01T20:22:52.938Z"}, {"movie_id": 329996, "review_id": "62adb03931234500527d320d", "author_rating": 8.0, "review_text": "**It's not perfect, it's not extraordinary, but I liked what I saw, and I think the film manages to deliver what it promises.**\r\n\r\nIn 1941, Disney debuted one of its most outstanding feature films and the shortest. Relatively cheap to produce and without great ambitions, the film was a success and even the US entry into World War II did not turn away the public, who saw the film as a welcome escape. It would also be the first Disney film to be released on VHS and is now considered an important part of the history of animated cinema, and of universal cultural memory. Making a live-action with enough dignity to match the original was, therefore, a very demanding task in itself. I cannot say that the result fully achieved the objectives, but the truth is that I liked what I saw.\r\n\r\nUnlike the original film, which focuses on how Dumbo overcame being different from the others, this film passes very briefly on that subject, almost never addresses the issue of difference, and chooses to focus on what happens next, on how the circus deals with unexpected success, and in Dumbo's relationship with his mother and the human elements that surround him. There are some predictable sub-plots here, such as the drama of the Farrier family, grappling with the death of their mother and the return of their father, injured, from the war, or the difficulties of a small circus with financial problems to compete with other entertainments. However, the movie seems to get darker and more adult as we watch it, and the truth is that I would have some doubts about letting young children see this movie.\r\n\r\nThe main human role in the film is played by the experienced Colin Farrell, who offers us a good job, full of commitment, but unable to resist when he has to share the scene with Danny DeVito, a very charismatic actor who feels completely comfortable in his role, shinning in a very particular way here. Eva Green also deserves an applause for her work here, in yet another character that is somewhat peculiar, but full of elegance. Unfortunately, the rest of the cast is considerably less interesting and works less well: Michael Keaton is a predictable and uninteresting villain, more contrived than menacing; Alan Arkin doesn't have more than a cameo with a few lines of spoken text; Nico Parker and Finley Hobbins don't do more than what's asked of them, and that's not enough.\r\n\r\nDirected by Tim Burton, the film was destined from the start to be a massive work of high-quality visual effects and CGI. Burton likes that, all his films have a lot of visual elements and the visual aesthetic, sometimes a bit far-fetched and kitschy, is one of the style marks of this director, who in this film seems to want to capture the most of the magic of life in the circus, alongside the difficulties and hardships that its artists know. Thanks to the budget available, this director had access to the best CGI and there is virtually not a shred of reality in the film: everything was filmed in the studio, using green screens and other similar resources. Dumbo is all done in computer, and results in a harmonious union between the expressiveness seen in the original animation and the naturalness and realism that we can achieve through CGI.\r\n\r\nAnd if visually the film is extraordinary and really well executed, the rest is not far behind in quality. There are scenes that are virtually copied from the original film, and some of the most famous songs will also reappear (\"Baby Mine\", \"Pink Elephants on Parade\", etc.), in clear homages to the first film. The original soundtrack made for this film, signed by Danny Elfman, is very good and does an excellent job.", "created_at": "2022-06-18T11:00:09.189Z"}, {"movie_id": 329996, "review_id": "646194c68c44b900fc91439c", "author_rating": 6.0, "review_text": "Way better than the animation movie. Great for families. Dumbo is pretty cute I can't lie. Has a really good cast as well.", "created_at": "2023-05-15T02:11:18.181Z"}]