[{"movie_id": 503314, "review_id": "5c8bd9a8c3a3686465103c28", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nThis is the third canon (or official if you’re not familiar with anime terms) Dragon Ball movie, after Dragon Ball Z: Battle of Gods and Dragon Ball Z: Resurrection ‘F’. So, unless you kept up with the anime, this film isn’t for you. Just letting you know right off the bat.\r\n\r\nI would love to be able to describe in words what Dragon Ball means to me, but I can’t. It’s impossible to create a sentence that seamlessly lets you know how nervously excited I was right before the movie started. Yesterday, it was my first time watching my favorite anime on the big screen, and oh my God, it was AWESOME! Finally, I watched a film that I was highly anticipating, and I actually enjoyed it. Finally! I was tired of expecting big things from movies I really wanted to become a huge success, just to get ultimately disappointed. Broly is everything I wished for and more. Nevertheless, I must advise you: this animated flick is NOT for a casual moviegoer! \r\n\r\nIf you stopped following Dragon Ball after Z or you don’t even know what DB is, you’ll basically be lost. You won’t recognize certain characters, you won’t understand how and why some guys are still alive, and you’ll have no clue about how strong our warriors became. This is for the fans. I’ve seen critics bashing this film to shreds, and they start their reviews stating “I’ve never seen the anime.” Then why would you watch a movie that clearly follows the anime’s story and review it? Just leave it alone! It’s like watching Avengers: Endgame without ever watching a single one of the 21 previous installments. It’s just nonsensical. So, with that out of the way, and assuming I’m writing for fans of the anime … \r\n\r\nThis is the best Dragon Ball film ever, by a long shot. Yes, the track record wasn’t that good to begin with, and most of the movies released aren’t even canon. Still, Battle of Gods and Resurrection ‘F’ were pretty great, especially the former. Broly easily surpasses these two, in almost every aspect. Of course, I need to be fair to those first films. Dragon Ball Super elevated the anime once again and brought it back to the mainstream, so obviously, Broly had a lot of advantages since the studios offered everything they could so that the movie would be a major success. When the first two films were released, Super didn’t exist yet. Basically, these first movies were trying to bring back Dragon Ball to life while Broly is all about keeping it alive and showing it still has tremendous potential.\r\n\r\nThankfully, it all worked out perfect. The box office results are mind-blowing which will surely guarantee the continuation of Super (I’m waiting every single day for the news of the series renewal), and the film is, in fact, astonishing. The animation quality is absolutely jaw-dropping. You know when you go with friends to watch a movie and something so awesome occurs that you just look at each other in awe of what just happened? That’s Broly every single minute from the moment the fight begins. Super gave the fans a glimpse of what the animation level could be if time was not an issue for the animators. The Tournament of Power arc is undeniable proof that when the production leaves the animators work with no pressure, the end result is outstanding.\r\n\r\nIt’s just so freaking awesome. This is the only word in the dictionary that can reflect how crazily good the animation is. Awesome. There are so many long sequences of choreographed fights, with the animation always on-point, and with exceptional editing. The aspect I love the most is probably how fast it all is. Finally, I can understand Krillin when he says “how are you following that?!” Everything flows in such a flawless style: the characters, the blasts, the environment, everything. The sound design is incredibly powerful, as well. From the get-go, you know you’ll feel every punch, kick, “Kamehameha” and “Galick Gun.” Goku, Vegeta, and Broly provide so many amazing action scenes, and I know I’ll constantly rewatch them once they become available. God, Super ended a year ago, and I still find myself watching the final fight with Jiren every week or so.\r\n\r\nHowever, Dragon Ball isn’t about the fights. Yes, everyone loves them, and there are a lot of fans who only care about the actual moment when our heroes fight their enemies. As a hardcore fan of the saga, it’s so much more than that. If characters like Goku and Vegeta, but also Piccolo, Gohan or even Frieza didn’t exist, their battles wouldn’t have the same impact. They mean something because these characters are important to me. I care so much about them because they were beautifully-developed throughout hundreds of episodes. I know that fillers can be a bit boring, but for me, they were just another way of getting to know these characters. Give me twenty minutes of banter between Goku and Vegeta, and I’ll be the happiest man on Earth, right now.\r\n\r\nI’ll put it this way: if you enjoyed Battle of Gods more than Resurrection ’F’, you will love DBS: Broly as much or more than I do. If it’s the other way around, the first half of this film might leave you a bit disappointed. If you’re one of those fans who only care about the fights, you can leave the first 45 minutes with barely any Goku or Vegeta to me and the other fans who care about the story. I heavily praise Akira Toriyama‘s screenplay. This is the big difference to the other non-canon movies: they weren’t written by someone who really understands the characters at their disposal. Toriyama knows exactly who Broly is, where he comes from, and how he lived through his young years.\r\n\r\nHe wonderfully flushes out Broly by giving him an emotionally captivating backstory, filled with parent abuse, violence, and isolation from the rest of the universe. The history of Saiyans and Planet Vegeta is (finally) told entirely, by showing us characters that we all know and love, but that we were never able to see for more than a few minutes. Nevertheless, the standout character of the film is Broly. He has more screentime than any of the other warriors, precisely due to the reason I mentioned above: for us to care about him. Truth is, when they start fighting, I don’t want anyone to win or lose, because I genuinely care about all of them. Toriyama wasted half of the movie to develop this “new” character, and I 100% support his decision. Not only it generates more build-up to the inevitable climax, but it offers more layers to it. It stopped being “just a fight.”\r\n\r\nObviously, there were going to be nods to the past adventures. I almost dropped a tear when Goku and Vegeta show up for the first time due to the soundtrack alone. You’ll love every single “flash” regarding previous moments of Dragon Ball history, including the latest series and arc. Toriyama also does a remarkable job in helping fans that never watched Super trying to understand what happened after Z, even if he didn’t need to. The comedy bits are hilarious, as they have been with the latest series. From Vegeta yelling at Goku for doing or saying something dumb, to Bulma‘s interactions with Beerus and Whis, every joke lands in one way or another.\r\n\r\nAs much as I love this film, it does have some issues regarding its mixing of CGI with animation. One of the things I didn’t like at all in Resurrection ‘F’ was how some sequences felt like a video game. Unfortunately, there are a couple of moments like that in Broly. In order to keep the scenes flow without any cuts, CGI is necessary so the camera can change to another angle, and sometimes there’s this feeling that you seem to be playing one of Dragon Ball games. However, my biggest gripe has to be with the overuse of visual effects. Using VFX to build rich environment and help the battles have more impact, not only doesn’t work well but it’s just not Dragon Ball.\r\n\r\nAs we reach the climax, the VFX overpower the animation, and that is never a good thing. The fight loses its animated essence, and it becomes something that I don’t even know how to describe, except that it isn’t what it was supposed to be. In addition to this, even though I stated that this movie is about Broly and Broly alone, I would have loved to see more from Frieza. He acts purely as a plot device, and there’s barely anything for him to actively do, but he’s still important to make the plot move forward. Finally, the pacing could have been more balanced. Since the ending is predictable from even before the fight begins, it feels that the film was a bit stretched to try to reach the two-hour runtime.\r\n\r\nAlso, if you’ve seen all the trailers, you basically know the entire movie. That’s why I keep advising my followers to stop watching trailers or at least all of them. If you really need visual confirmation that the film deserves your time and money, watch the first trailer and decide from there. Dragon Ball Super always gave spoiler-heavy previews of the next episode, and the movie literally shows everything. Even without watching a single clip from it, I couldn’t escape the spoilers regarding the appearance of specific characters, which pretty much ruined any surprise the film could have offered me. Even with that in mind, I still think the ending felt a bit rushed, contradicting the somewhat slow pace during the first two acts.\r\n\r\nIn the end, there’s no doubt about it. Dragon Ball Super: Broly is, by far, the best Dragon Ball movie to date, and it’s really freaking awesome! It beats any other installment of the franchise, including the latest films. Akira Toriyama working together with a phenomenal team of animators is a match made in heaven. The story is remarkably well-written, with a full half dedicated to introduce and develop Broly as a mentally troubled child who had to deal with so much pain during his life. The animation reaches its peak quality-wise, demonstrating that when time is given to the animators, their work can be a visual masterpiece. With such an intriguing backstory on the history of Saiyans and a brilliantly structured build-up to an epic fight between Broly, Goku, and Vegeta, there was still time to cherish the nostalgia with some nods to previous moments in the beloved saga, as well as some hilarious comedy bits.\r\n\r\nWith more control over the use of CGI and visual effects, this could very well be one of 2019’s best movies. It still can be, but the climactic final battle lost of a bit of its impact due to the overwhelming VFX which completely overcame the animation itself. The ending is predictable before we reach half-runtime, and the spoiler-heavy trailers didn’t help to keep surprise as a factor. I have to repeat what almost every critic has been saying: if you’re a fan of the saga and you kept up with Super, this will give you everything you want and more. If you’re just a casual moviegoer or if you stopped watching after Z, it’s better if you don’t “poison” social media with opinions on a film that simply wasn’t made for you. \r\n\r\nThank you, Toriyama! Thank you for giving me the chance to see my favorite anime on the big screen for the first time, and for making it epic. Can’t wait for the announcement of the series continuation …\r\n\r\nRating: A-", "created_at": "2019-03-15T16:58:16.050Z"}]