[{"movie_id": 985939, "review_id": "631145261511aa0080d77496", "author_rating": 7.0, "review_text": "Even if the story was kind of lackluster, the film itself was incredible.  If you consider the tower as a kind of true main character of the movie.  \r\n\r\nOn first watching this I can instantly imagine the blustering cacophony of outrage about climbing technique from viewers.  From the first, the film is rather jarring but honest about its juvenile depiction of \"climbing\".  At the start I had to decide NOT to care about how realistic it was because it would be wrong to reduce a film abductio absurdum because it is a story after all.  A creation.  It isn't being judged on its ability to remind one of real life so much as to forget it.  I do this 'forgetting' voluntarily and I seem to enjoy films more. \r\n\r\nI felt my body constricting away slightly and getting anxious during the gravity yawning scenes, 2000ft above the ground!  The characters were reckless enough to believe they would die at almost any time.  It was unrelenting in the tension.  \r\n\r\nEven if the writing is kind of silly at times, there are elements in a film, perhaps shown through other mediums besides the writing itself that can raise the score of the film quite a bit. Consider the cinematography.  The deft and skilled work at showing the tension existing in every moment by rattling bolts in close up with uncanny metallic sounds protesting the extra weight.  The drone shots that highlight the mind bending fear of such a radical location.   Honestly!  It seemed like such a labor of love of the filmmakers.  They immediately saw how much could be done with the location.\r\n\r\n  The story felt like a vehicle for the film which was this awesome gigantic testament to the fear of heights.  The movie poster sold this one for me because I was thinking, well, even if it isn't that good, the idea itself is good enough to be fascinating.  Consider the main character of the movie: the tower itself.  It said nothing the entire time, but it was the star of every scene.   Such as it was, the story was like kind of this extra fluff that you had to deal with, but what a cool film.  \r\n\r\nThere was an amazing number of times I was 'triggered' by how silly and unrealistic the climbing aspects were, and how insanely reckless it became.  However, I don't believe that anyone thinks this a film to be studying climbing from.  It isn't even showing climbing's artistic nature which is the film's biggest pitfall.  I loved how the arc centered around conquering your fears through this metaphorical path of climbing and I'm sure a lot of climbers embraced that, and were reminded of it, but it was a crime to leave out why the characters are pursuing this passion.", "created_at": "2022-09-01T23:49:58.044Z"}, {"movie_id": 985939, "review_id": "6311aa49e78687007f5a95ff", "author_rating": 7.0, "review_text": "**Fall is 47 Meters Down but with heights instead of depths - 47 Meters Up.**\r\n\r\nFall keeps your stomach in your throat with its dizzying heights and anxiety-inducing peril. The movie’s plot is extremely thin, but that’s what you would expect from a film with this premise. Grace Curry and Virginia Gardner’s despair seemed authentic through their convincing performances. Panic and distress filled every shot as the camera soaked in the unbelievable heights and endless landscapes. Scott Mann once again directs an emotional suspense-laden film that feels incredibly similar to 47 Meters Down, even borrowing an identical plot twist. Fall stretched on a little longer than needed, but I appreciated the staggering suspense and character development that elevated a meager concept to vertigo-inducing heights.", "created_at": "2022-09-02T07:01:29.569Z"}, {"movie_id": 985939, "review_id": "631473fdc048a9008fe9cdef", "author_rating": 7.0, "review_text": "Fall is a sweaty palms, nerve racking ride, that plays, with gleeful sadism, on one the most basic and widespread, of human fears.\r\n\r\nAn Acrophobic's worst nightmare, Fall takes a very basic premise and uses it to good effect, building a primal, instinctively terrifying, anxiety soaked action flick, of quite literally, dizzying heights. \r\n\r\nThis is, somewhat antithetically, both an easy and hard watch rolled into one. I frequently found myself holding my breath, tensing, jumping and having to take breaks to get over my own sense of fear, at what I was witnessing. \r\n\r\nI was heavily invested in the main characters, wanting to see them safely escape their horrible predicament, in spite of their reckless decision to climb an obviously rusted, dilapidated tower. \r\n\r\nIn short, great edge of your seat stuff. Just goes to show how much can be achieved with a modest budget and a lot of inspiration.", "created_at": "2022-09-04T09:46:37.610Z"}, {"movie_id": 985939, "review_id": "63152562d40d4c007ab0c72c", "author_rating": 6.0, "review_text": "Right. First things first. Understood that you erect a 2000ft television relay tower back in the day, but when that industry moves to satellite delivery, why on Earth would anyone just leave this gradually rusting structure standing - only for it to come crashing down one day when the metal fatigue has won out? Hmmm! Anyway, luckily for us the planner's ineptitude allowed for \"Becky\" (Grace Caroline Currey) and her friend \"Hunter\" (Virginia Gardner) to go climb it. It's quite a big deal for the former woman - she had been free-climbing almost one year earlier with her friend and her husband \"Dan\" (Mason Gooding) when disaster struck and she has spent much of the intervening period married to Jack Daniels. Scorning any sensible planning - food, gloves etc. up they go - there is a ladder - and are soon at the top surveying the immensity of the view. Time to go down, the ladder gives way. The two are lucky to have the platform right at the top to take refuge on, but their bag - water and drone contained within - falls 50 feet and balances precariously on a redundant satellite dish below. What's to do? The plot really does take a quite cynical turn when they fire a flare to attract the attention of some men in a nearby camper van, only for the guys to spot them and then proceed to steal their car! Otherwise, this is really just a remarkable feat of photography that certainly had my palms sweating. Director Scott Mann and the cinematographer (MacGregor) do manage to effectively draw us into the two friend's predicament and if you are even vaguely acrophobic, then this film can be a really tough watch at times. Sadly, though, in the search for characterisation we discover that even at altitude, there is a place for a rather tiresome melodrama. Thereafter it is quite difficult to warm to either of the women who are being harried by some hungry buzzards as they perch! The ending is not good. To be fair, it isn't straightforward either, it has a few quirks to keep us on our toes - but they are not terribly realistic quirks. Enjoy is not the correct word for this film - I cannot say I was too relaxed for much of my time in the cinema tonight, but if this is to be seen at all, then it does need that big screen. On television it will lose much of it's photographic impact and that really is all this film is worth watching for - the acting and repetitive \"Are you OK?\" dialogue leaves much to be desired.", "created_at": "2022-09-04T22:23:30.470Z"}, {"movie_id": 985939, "review_id": "631f6fcb0bb076009286f13a", "author_rating": 8.0, "review_text": "**might contain spoilers**\r\n\r\nWhat a great murder mystery film. As an amateur climber, I too was initially put off by the amount of unprofessional climbing techniques. However, if they were truly climbing/solo enthusiasts, how could they not get injured way before they take on any big challenges? (And from a filmmaking perspective, with climbing being such a popular sports, surly it is not hard to get some random joe from the gym to tell the film crew that those techniques are horrible! also there are other suspicious common-sense defying points later…) The answer of course, what we watched is just simply a **recounting of Becky’s version of what transpired!!!** Then all the inaccuracies makes perfect sense as that’s how you get the authorities to believe why the “accidents” happened in the first place — sheer negligence and amateur skills!\r\n\r\nI believe what happened was that Becky found out that she was cheated on, then plotted to get rid of the asshat by either screwing with the cam placements and/or - as filmed but with a malignant intent - to get rid of the rope too liberally. And no one else knows exactly how good the cam placements are or whether they were tempered with - Hunter is way above them busy down-climbing!\r\n\r\nThen, this explains perfectly her year-long depression as even if not fully planned out, her imo premeditated actions naturally put herself in even deeper sense of guilt.\r\n\r\nThen there’s the forever unknowable fact that whether the tower trips is truly initiated by Hunter. Possibly Becky saw Hunter is living a guilt-free life and had another urge for murder and proposed to feed Hunter this great youtube/instagram clickbait trip to convince her to come along! Although the film depicts that Hunter is very heartwarming at times, it’s entirely plausible that Hunter **is** in fact the care-free personality that she demonstrates in **all her videos online!** (which might makes her more murderable in Becky’s eye). So Becky could be using a very high-IQ way of framing her victims as compassionate sweethearts.\r\n\r\nFinally, the biggest telltale sign that the final accident is premeditated (and possibly intended by the filmcrew/writer) is that when Becky lastly went for Hunter’s body to drop down the phone, she **instinctively — rightfully so for a climber** clipped the carabiner to the lowest stable point which is the as yet unbroken ladder!!!(and the film gave this a real good close-up) Why on earth wouldn’t Hunter do that when she went down to retrieve the bag???!!! This is not just bad climbing, this defies common sense! We were all screaming how stupid it was of Hunter to do what she did in the bag sequence and now we know, **these are all extremely likely fabrications recounted by Becky at the end of the accident!**\r\n\r\nLastly, some keen chinese filmgoers also noted the “mistake” on the poster where in fact **the ladders are failing while Becky’s at the top and Hunter is still climbing!** Maybe this is a hint from the production team ;)\r\n\r\n**welp anyways it’s just a theory :p I probably watched too many asian sope-operas**", "created_at": "2022-09-12T17:43:39.153Z"}, {"movie_id": 985939, "review_id": "63216caf87a27a0085bc6385", "author_rating": 4.0, "review_text": "I can’t help having a soft spot for a movie that name-drops several pro wrestlers as a means to convey a nice bit of subtle foreshadowing, and plays Warrants «Cherry Pie» on its soundtrack like every five minutes.\r\n\r\nOn the other hand, it’s very difficult to empathize with the characters in this film; anyone who climbs a rusty, super creaky 2,000 foot TV tower (a choice so inane that under normal circumstances it’s known as the Fallacy of the Climbing Villain) in the middle of bumfuck nowhere just for shits and giggles deserves whatever’s coming to them. \r\n\r\nThe rationale, such as it is, behind the protagonists’ actions is that life is «too short» and «you gotta do something that makes you feel alive.» Methinks they’re confusing joie de vivre with having a fucking death wish. According to these people’s logic, Bobby De Niro and Chris Walken were really sucking the marrow out of life in those Russian roulette scenes from The Deer Hunter.  \r\n\r\nNow, that climbing artificial structures (known as buildering as well as several other names) is a reckless (not to mention illegal) thing to do doesn’t necessarily mean that those who do it take it lightly. I’m sure a lot of planning and prepping and getting in shape mentally and physically (even the relatively simple act of climbing a ladder becomes a Herculean labor when the ladder is twice as tall as the Eiffel Tower) precedes the actual deed.\r\n\r\nWe don’t see any of that here; not even a training montage. For Hunter (Virginia Gardner) and Becky (Grace Caroline Currey) it’s an overnight decision; sure, Hunter says she’s has «planned» it, and she’s some sort of daredevil You Tuber, but Becky is an out-of-practice rock climber who has ostensibly become a drunken slob in the year since her husband’s Disney Villain Death. \r\n\r\nAll of the above notwithstanding, the film certainly makes the most of its chosen setting. The landscape around the top of the tower (consisting of a «pizza-size platform») betrays a green screen quality to it, but this is a rare occasion in which this actually works in the movie’s favor; at such dizzying heights, wouldn’t the world and everything in it look surreal? Or, to put it more bluntly, wouldn’t your perception get all screwed up? \r\n\r\nMoreover, the stunts don’t flat-out take your breath away, but they do kind of borrow it for a little while, which is better than nothing; also, there’s a certain measure of suspense regarding whether or not help is on the way — and while this is the only movie that I can think of where the audience is left literally waiting for the other shoe to drop, this aspect of the plot actually involves a pretty neat shot of, well, a shoe dropping.", "created_at": "2022-09-14T05:54:55.748Z"}, {"movie_id": 985939, "review_id": "6343af7f39a1a6008442c82b", "author_rating": 7.0, "review_text": "**_Fall_** is a survival thriller that succeeds, at least for those of us with the fear of heights, to get an uneasy feeling with the aerial shots. The visual effects used to do those scenes were fairly well done and even though it is a movie with two (naïve) climbers being stuck on top of a tower, the film co-scripted and directed by Scott Mann still was quite entertaining. The performances from both Grace Caroline Currey and Virginia Gardner were well done (Jeffrey Dean Morgan only had a couple minutes of screen time and likely did this as a favor to Mann as the pair previously worked together on 2015’s Heist).\r\n\r\n**_Fall_** isn’t a movie I’d watch again, not unlike many other of these survival thrillers (like 47 Meters Down, Shallows, 127 Hours), but it’s still well worth a watch especially on a Friday or Saturday night with nothing else that might catch your eye.\r\n\r\nAs a side, apparently this was shot for an R-rating with numerous f-bombs which were dubbed over once Lionsgate was distributing and in one scene the replacement of two f-bombs with “fricking” was pretty laughable. **3.75/5**", "created_at": "2022-10-10T05:37:03.960Z"}, {"movie_id": 985939, "review_id": "6352876d84448e007a5d1ddf", "author_rating": 7.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Fall is one of the biggest surprises of the year! Its premise automatically brings high levels of adrenaline, suspense, and tension - especially for acrophobes - and Scott Mann achieves the ideal mix of realism and absurdity.\r\n\r\nIt doesn't go overboard to the point of causing countless \"eye rolls\", nor is it too generic and inconsequential, adding a rather impactful narrative twist near the third act. Grace Caroline Currey shines alongside an also competent Virginia Gardner, both having enough time to lead a character-driven story focused mainly on a single location.\r\n\r\nToo bad the frustratingly abrupt ending prevents the movie from reaching the next level...\"\r\n\r\nRating: B", "created_at": "2022-10-21T11:50:05.528Z"}, {"movie_id": 985939, "review_id": "6463ab4c0f36550153c7ec30", "author_rating": 3.0, "review_text": "Going into Fall, I did not have super high hopes, and unfortunately it met my expectations. This movie attempts to be something far greater than it ever needed to be, resulting in a super bloated experience that just feels completely unfocused. The nearly two-hour runtime is entirely too long for a plot that is on the surface, fairly bare bones. But the screenplay attempts to deliver multiple subplots that are supposed to develop our characters, but all it did was take away from the tension that it was building. For every scene where I was gripping my chair waiting to see what will happen next, there is a scene where the two characters talk about their feelings for far too long. Furthermore, there are story elements that are either too convenient or exist solely as obstacles for the sake of obstacles which detract from the overall believability.\r\n\r\nI do think Grace Caroline Currey is going to have a fantastic future in this industry, but her performance alongside Virginia Gardner left a lot to be desired. Currey did her best to save a pretty horrendous script, but it just was not enough. Despite this, the movie was directed fairly well, with great shots of the tower and of the action that was ensuing. The cinematography was fantastic, with beautiful skyboxes and sharp silhouettes of our protagonists that I particularly enjoyed.\r\n\r\nOverall, I think this film would have been much better if it had stuck to being a cheesy thriller with a bare bones plot. All the extra filler really weighed down the overall experience.\r\n\r\nScore: 35% 💩\r\nVerdict: Bad", "created_at": "2023-05-16T16:11:56.812Z"}]