[{"movie_id": 584, "review_id": "5688daaa92514131df022eca", "author_rating": 6.0, "review_text": "Get revved up for a bit of car porn.\r\n\r\nThe second instalment of what will become an on going film franchise, 2 Fast 2 Furious ticks all the boxes of the action junkie fan. Paul Walker is back as Brian O'Conner and joined by Tyrese Gibson and Eva Mendes, who all get involved in an undercover job to bring down Cole Hauser's nefarious bad guy. There's lots of awesome cars, pecs and breasts, noise, carnage, violence and awful dialogue. The story is weak, but are we really looking for some brains over brawn here? We want car porn and we want it now! And so it delivers as per our polite request. John Singleton directs, David Arnold scores the music and Matthew F. Leonetti photographs the sumptuous Florida locations. 6/10", "created_at": "2016-01-03T08:24:10.987Z"}, {"movie_id": 584, "review_id": "5cd475bc0e0a265dee61652a", "author_rating": 6.0, "review_text": "***Paul Walker and Tyrese Gibson team-up to bring down a pompous drug lord in south Florida***\r\n\r\nNow living in the Miami area and no longer an undercover cop, Brian O’Conner (Paul Walker) is compelled by the authorities to work with a US Customs agent (Eva Mendes) to nail an arrogant drug lord (Cole Hauser). To accomplish this, he teams-up with an old street-racing buddy (Tyrese Gibson) who’s in dire need of redemption.\r\n\r\nPaul Walker is the only notable cast member to return for \"2 Fast 2 Furious\" (2003). The others won’t return until the fourth installment, “Fast & Furious” (2009). Anyway, I like the beginning of this sequel better than the first movie. Director John Singleton has a better eye for photographing women, at least as shown in the first 40 minutes or so; plus I appreciate the diverse cast, which also includes the likes of Ludacris as Tej, cutie Devon Aoki as Suki and James Remar as a lead agent.\r\n\r\nBut as effective as Gibson is here, he can’t rival the charisma of Vin Diesel. And somewhere just after the midpoint I started to get a little bored. Nevertheless, “2 Fast 2 Furious” is an entertaining race-oriented action thriller. It basically mixes the first movie (2001) with “Licence to Kill” (1989).\r\n\r\nThe film runs 1 hour, 47 minutes and was shot in the Miami area.\r\n\r\nGRADE: B-", "created_at": "2019-05-09T18:47:24.957Z"}, {"movie_id": 584, "review_id": "64f4c7a5f29d6601000898fe", "author_rating": 5.0, "review_text": "Sadly, this sequel really did miss Vin Diesel. Paul Walker tries, he has a glint in his eye, and Tyrese Gibson gives it all he has as the wise-assed sidekick \"Roman\" but sadly this entire thing resembles an hybrid of \"Starsky & Hutch\" meets \"Miami Vice\". Plenty of squealing rubber, the cars and the people all look great but the thinnest of plots and some seriously woeful dialogue make this better to watch with the sound turned down. Poor stuff.", "created_at": "2023-09-03T17:51:33.616Z"}]