[{"movie_id": 22949, "review_id": "5f67c151e18e3f00380bcdf6", "author_rating": 3.0, "review_text": "Bad watch, won't watch again, and can't recommend.\r\n\r\nI love Robin Williams and Seth Green, but man, I don't know what is wrong with Travolta in this.  I'm not a big fan of his to begin with, but he's just a jackass.  Not only does he have a jerk character, but he looks like he's phoning it in too.  \"I'm here, I'm saying the lines.\"\r\n\r\nIt wouldn't be so bad if he wasn't the lead character.  The movie is about THEIR business, and Robin's character's kids, but personality wise Robin has to play this push over character that can't do anything but take the punches, and he doesn't do abuse humor well.  He's known for absurd humor, that the situation is ridiculous and out of control, not that he's suffering from it persay.\r\n\r\nI've also always like Robin William's connection to kids and that, at heart, he's a family guy.  This character that lives isolated from his kids, that can't be fun was a poor casting for him.\r\n\r\nHonestly, looking at the story even, I don't know why anyone decided to make this, unless the right names made it happen, and they just left big blank spaces in the script that said, \"something ridiculous and funny\" and they just slotted in things like \"Seth Green gets adopted by a Guerilla\".\r\n\r\nDon't waste your time with this unless you're just on a Robin Williams marathon for completionist sake.", "created_at": "2020-09-20T20:53:37.028Z"}, {"movie_id": 22949, "review_id": "5fa7fe8fffc9de003d8ad21b", "author_rating": 3.0, "review_text": "I wanted this to be good, but it's anything but.\r\n\r\nThere is nothing I enjoyed about <em>'Old Dogs'</em>, every second of its 88 minute run time is a hard slog. Robin Williams and John Travolta are the only reasons that I haven't rated this even lower, I'm not saying those two are all that noteworthy in this but their acting ability raises things up ever so slightly.\r\n\r\nThe premise is incredibly lame and painstakingly predictable, while the comedy is very lazy - I didn't laugh once, there's not even a minutely chucklesome moment. There are some terrible attempted gags in there.\r\n\r\nA major disappointment, I wanted to like this due to the two leads but I just couldn't. Dreadful film.\r\n\r\n2000s live-action Disney is mental. From the greatness of <em>'Pirates of the Caribbean'</em>, <em>'Holes'</em> and <em>'The Greatest Game Ever Played'</em> to the diabolical <em>'The Country Bears'</em>, <em>'Max Keeble's Big Move'</em> and now this. Rather incredible.", "created_at": "2020-11-08T14:19:59.299Z"}]