[{"movie_id": 315635, "review_id": "596343df9251410b860f177c", "author_rating": 7.0, "review_text": "There's now officially (not at all officially, more like just-my-opinion-ally) twice as many good Spider-Man movies as there is bad ones. But _Homecoming_ is my favourite of the bunch. 2017 has been a great year for  the Superhero genre, and _Spider-Man: Homecoming_ does nothing to buck that trend. It's got everything a Spider-Man movie should have: Heart, humour, action, spectacle, a grounded school life, coming-of-age themes, and all this while firmly rooting itself in the Marvel Cinematic Universe -- without relying on the framework of the past to hold it up. _Spider-Man: Homecoming_ is spectacular, and it stands up both on its own, and as a part of the larger universe.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-07-10T09:07:43.738Z"}, {"movie_id": 315635, "review_id": "5a2f2fad925141032c16f0e7", "author_rating": 4.0, "review_text": "Disappointing return for the webslinger. After the dramatic introduction in Civil War this film feels like an excercise in keeping the coffers full.\r\nUnlike the Toby Maguire films this incarnation feels flat. It never manages to really put our superhero in any real peril...it just goes through the motions and ticks boxes. Granted it is mostly enjoyable, but did we need it??\r\nNo.\r\n\r\nThe suit and inclusion of Iron Man takes away from what is great about Spiderman. The fact he has to juggle school, work, realationships is what kept him grounded...\r\nHe does not need Iron Man's suit or him flying in to save the day!!\r\n\r\nAlso, why does he not have a spidey-sense?!? He gets nailed left, right and centre!\r\n\r\n*  To conclude; disappointing, Yes, as Spiderman just became another member of Tony's team...when he should stand alone.", "created_at": "2017-12-12T01:23:57.898Z"}, {"movie_id": 315635, "review_id": "5a427fdf0e0a2620e9056c3d", "author_rating": 4.0, "review_text": "I guess I should not be too surprised given the Spider Man character we saw in the latest Captain America but I have to say that I was, well, hoping for something else, as in something better.\r\n\r\nIf the producer/writer intended to make a Spider Man movie for kids, and I mean kids, not young adults but kids, then this movie is hitting the spot. It is an excellent action/adventure movie for kids. Unfortunately I am not really in that viewer segment and for me this movie was pretty bad.\r\n\r\nThe movie is childish. There is no other way to describe it. My memory of spider man is a quite serious young man with a sharp and witty tongue. Not the fumbling and childish Spider Man in this movie. His best friend may be a good computer geek but otherwise he is dumb as a door nail and just tiring to watch. His, supposedly adult handler is a screw up who, surprise surprise, is hanging up the phone because he cannot be bothered to listen to kids.\r\n\r\nThe FX may be good as FX goes visually but it was also the typical, nonsensical Hollywood rubbish like boats that stays afloat forever despite being split in half etc. etc. The talking Spider Man suit appears to be programmed by the same guy who wrote the childish script.\r\n\r\nThe main bad guy pretty much has zero charisma and is nothing but a simple thief. Same goes for his buddies.\r\n\r\nThe SJW crap spread out here and there in the movie, especially in the Washington Monument scenes, was unwanted and just pissed me off.\r\n\r\nI am afraid that this movie missed its mark for me by a wide margin. I do not understand why it seems to be so bloody difficult for Hollywood to make a good Spider Man movie. I like Spider Man, the comics character that is, so I find the slew of substandard movies really disappointing.\r\n\r\nThe only reason it doesn't get less than two out of three stars from me is because, as a kids movie, it is not at all bad (except for the SJW crap). It wasn't what I was looking for though.", "created_at": "2017-12-26T16:59:11.029Z"}, {"movie_id": 315635, "review_id": "5a770dcfc3a36859ec04ad39", "author_rating": 7.0, "review_text": "**Young & hungry to fight crimes!**\r\n\r\nNo doubt, Tobey Maguire Spider-man is the best. It was also the first modern superhero of the millennium. The visual effects and entertainment wise, the second live-action Spider-man was good too, but this one is so different. This is about a teenage superhero. Just a kid. Having possessed such superpower, how he manages it alongside his normal life was nicely told.\r\n\r\nThis story begins straight away, because the introduction was done in the previous Marvel film, which are part of Avengers universe. Peter Parker assisted by Tony Stark, is very keen to fight small crimes compared to what Avengers fighting for. He feels, he's held back by Iron Man, so he wanted to make independent decisions. At one stage he succeeds in that, but things get more severe. Fighting bad guys, and the other side of his life, a romance, how the remaining story turns out are revealed with a twist.\r\n\r\nTom Holland was good. The story was simple, more like one liner. But the visuals and each scene forged nicely. Having seen all the five previous Spider-man films, this was quite predictable. Particularly the characters and their connections. Seeing how it had ended, it is possible that the daughter of the villain could take-over her father's place. That would be very interesting, because of the linkage between the film characters.\r\n\r\nAfter seeing the first look, I was afraid that this young Spider-man might be overshadowed by Iron Man, but those parts really well done. Comparing it with the 15 years ago Spider-man, the technology has been the biggest change. That's why I still love Tobey Maguire film. Very simple and down to the earth without cell phones, computers. But the current superhero films are all alien oriented/connected theme, and of course digital technology a big leap. Hoping the next film too would impress us with the same intensity. So lets wait for summer 2019.\r\n\r\n_7/10_", "created_at": "2018-02-04T13:42:39.750Z"}, {"movie_id": 315635, "review_id": "5b1d62b59251416614000cb5", "author_rating": 10.0, "review_text": "After the failure that was 'The Amazing Spider-man 2' Sony made a drastic decision in lending the character back to Marvel, and did it pay off? Absolutely!\r\n\r\nUnlike the Sam Raimi trilogy where Toby Maguire was a better Peter Parker than Spider-man and the Mark Webb duology where Andrew Garfield was a better Spider-man than a Peter, Tom Holland encapsulates both characters perfectly.\r\nOf course there were a negatives, especially in the second act which drops off a bit but the movies does such a wonderful job of recapturing our attention that you just can't help but forgive the movie for it!", "created_at": "2018-06-10T17:41:09.145Z"}, {"movie_id": 315635, "review_id": "5b51217b92514112ae005fe6", "author_rating": 10.0, "review_text": "AMAZING!!", "created_at": "2018-07-19T23:40:43.886Z"}, {"movie_id": 315635, "review_id": "5bcd91b20e0a26015b01dfd9", "author_rating": 9.0, "review_text": "My expectations were extremely low before this one released. Can't argue that the Amazing Spider-Man movies are very bad, yet there is always a room for a getting worse. But seriously, Homecoming has completely changed my experience from movies by Marvel x <a href=\"https://free-psn-codes.org/\">Sony</a> Pictures. It was entertaining and moving. Furthermore, it's as good for re-watch as well, what is a completely new experience for me.", "created_at": "2018-10-22T09:00:34.868Z"}, {"movie_id": 315635, "review_id": "5c8425a80e0a264301635857", "author_rating": 5.0, "review_text": "Spider-Man: Homecoming can't even hold a candle next to Sam Raimi's first two Spider-Man films, not to mention Spider-Man: Into the Spiderverse. Homecoming is simply Marvel's integration of Spider-Man into the MCU. It works on that level. Tom Holland is a good Peter Parker; finally an actor that looks like a high school student! Marisa Tomei does a really cool, sexy Aunt May, which I never thought I'd ever see. Michael Keaton is excellent as Vulture, one of the more interesting villains in the MCU.\r\n\r\nThe relationship between Tony Stark and Peter Parker is good but should have been better. It's clear that they half-assed the development of these two characters. The high-tech Spidey suit is neat but gives off the sense that the movie is trying to be too much like Iron Man.", "created_at": "2019-03-09T20:44:24.443Z"}, {"movie_id": 315635, "review_id": "5ca97838c3a3683f5260a0c8", "author_rating": 8.0, "review_text": "I personally thought all hope was lost, there's no way ANOTHER Spider-Man reboot could be successful. Yet this movie is colourful, fun, and fitting movie for the MCU", "created_at": "2019-04-07T04:10:32.288Z"}, {"movie_id": 315635, "review_id": "600a0e62cf9ba3003f834452", "author_rating": 8.0, "review_text": "A lot of fun!\r\n\r\n<em>'Spider-Man: Homecoming'</em> is entertaining, as I had expected in truth. The plot is possibly not as great as it could've been, but it is still one that is enjoyable to see. The effects are excellent, as is the humour.\r\n\r\nTom Holland is the star of this though. He kills it as the titular character, he adds a tremendous amount to the film. Michael Keaton plays his role well enough, while it's cool to see <em>'Iron Man'</em> duo Robert Downey Jr. and Jon Favreau involved.\r\n\r\nJacob Batalon is good, while it's noteworthy to have Zendaya and Donald Glover appear; even if they are underused/unimportant, at least for now for the former, I assume. I found the whole cast enjoyable, to be fair.\r\n\r\nThis narrowly misses the next rating up from me, but I still had a very pleasant time watching - and await the follow-up with much eagerness!", "created_at": "2021-01-21T23:29:38.251Z"}, {"movie_id": 315635, "review_id": "62404e0c81a7fc00472d0e06", "author_rating": 7.0, "review_text": "Once again, Marvel have succeeded in reinventing this franchise - and again, they have alighted on a Brit. Tom Holland is a super choice as our hero - he has oodles of on-screen charisma; he genuinely looks like he can't believe he is there half the time, and that all helps to make for an enjoyable fantasy adventure film. This time, he has to learn to master his spidey-senses (with a bit of help from \"Tony Stark\" (Robert Downey Jnr.) and the very rarely \"Happy Hogan\" (John Favreau)) before Michael Keaton - equipped with wings and a seriously powerful ray gun destroys all in his path. The performances are top drawer; the script is quickly paced with plenty of action, determination, humour and the slightest hint of menace, and the cleverly designed effects blend seamlessly into the action creating a thoroughly entertaining film. It is a bit too long, to be honest - but the casting is good, the direction tight and the whole thing a good family watch with a little bit for everyone.", "created_at": "2022-03-27T11:44:12.980Z"}, {"movie_id": 315635, "review_id": "63c21abda5743d00b0bfad53", "author_rating": 10.0, "review_text": "I won't complain about the continuity error within the MCU...because no one really cares least of all myself.\r\n\r\nWell, how do we do this. I mean, it is refreshing that Garfield is gone and with him the Spider-Bully. For Marvel comics fans, it really hurt watching Garfield bully and taunt his victims.\r\n\r\nNow we have a Spidey that is, well, nice. Holland is able to be funny and wise-cracking without seeming like a, well, a Flash Thompson. With that it beings us back to the source material.\r\n\r\nIn other words Holland puts the \"friendly\" back in \"your friendly neighborhood Spider-Man.\" And I think the MCU was well aware of this, given the time they took to make sure everyone knew Holland was going to be the hero that everyone loves.\r\n\r\nAnd then Keaton does a great vulture from his origin to his demise he seemed to do everything he could to really become the character.\r\n\r\nMy only complaints were the supporting cast. Aunt May I can accept with a moderate grudge because she is a great actress...\r\n\r\nBut Tony Revolori doesn't seem....built enough to be Flash. He's more the bully of the Millennial generation that uses words and little more and...when it comes down to it, even those are vapid.\r\n\r\nWhat's that old adage, \"sticks and stones will break my bones but words will never harm me.\" Millennials I guess have never heard that.\r\n\r\nFlash is supposed to be that big bully jock that hits his prime in high school and, a decade later, delivers the pizza when you go home to visit your folks...this Flash has a future.\r\n\r\nAnd the MJ tease at the end...it went a little too far away from the character in looks and personality to sit well.\r\n\r\nStill, on the whole the movie is a breath of fresh air in its distance from Garfield's rendition and at times, Holland was even able to pull off almost a James Bond quality while still portraying a kid over his head.\r\n\r\nLike all MCU movies, however, the pay off is the humor.", "created_at": "2023-01-14T03:00:13.520Z"}, {"movie_id": 315635, "review_id": "596343df9251410b860f177c", "author_rating": 7.0, "review_text": "There's now officially (not at all officially, more like just-my-opinion-ally) twice as many good Spider-Man movies as there is bad ones. But _Homecoming_ is my favourite of the bunch. 2017 has been a great year for  the Superhero genre, and _Spider-Man: Homecoming_ does nothing to buck that trend. It's got everything a Spider-Man movie should have: Heart, humour, action, spectacle, a grounded school life, coming-of-age themes, and all this while firmly rooting itself in the Marvel Cinematic Universe -- without relying on the framework of the past to hold it up. _Spider-Man: Homecoming_ is spectacular, and it stands up both on its own, and as a part of the larger universe.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-07-10T09:07:43.738Z"}, {"movie_id": 315635, "review_id": "5a2f2fad925141032c16f0e7", "author_rating": 4.0, "review_text": "Disappointing return for the webslinger. After the dramatic introduction in Civil War this film feels like an excercise in keeping the coffers full.\r\nUnlike the Toby Maguire films this incarnation feels flat. It never manages to really put our superhero in any real peril...it just goes through the motions and ticks boxes. Granted it is mostly enjoyable, but did we need it??\r\nNo.\r\n\r\nThe suit and inclusion of Iron Man takes away from what is great about Spiderman. The fact he has to juggle school, work, realationships is what kept him grounded...\r\nHe does not need Iron Man's suit or him flying in to save the day!!\r\n\r\nAlso, why does he not have a spidey-sense?!? He gets nailed left, right and centre!\r\n\r\n*  To conclude; disappointing, Yes, as Spiderman just became another member of Tony's team...when he should stand alone.", "created_at": "2017-12-12T01:23:57.898Z"}, {"movie_id": 315635, "review_id": "5a427fdf0e0a2620e9056c3d", "author_rating": 4.0, "review_text": "I guess I should not be too surprised given the Spider Man character we saw in the latest Captain America but I have to say that I was, well, hoping for something else, as in something better.\r\n\r\nIf the producer/writer intended to make a Spider Man movie for kids, and I mean kids, not young adults but kids, then this movie is hitting the spot. It is an excellent action/adventure movie for kids. Unfortunately I am not really in that viewer segment and for me this movie was pretty bad.\r\n\r\nThe movie is childish. There is no other way to describe it. My memory of spider man is a quite serious young man with a sharp and witty tongue. Not the fumbling and childish Spider Man in this movie. His best friend may be a good computer geek but otherwise he is dumb as a door nail and just tiring to watch. His, supposedly adult handler is a screw up who, surprise surprise, is hanging up the phone because he cannot be bothered to listen to kids.\r\n\r\nThe FX may be good as FX goes visually but it was also the typical, nonsensical Hollywood rubbish like boats that stays afloat forever despite being split in half etc. etc. The talking Spider Man suit appears to be programmed by the same guy who wrote the childish script.\r\n\r\nThe main bad guy pretty much has zero charisma and is nothing but a simple thief. Same goes for his buddies.\r\n\r\nThe SJW crap spread out here and there in the movie, especially in the Washington Monument scenes, was unwanted and just pissed me off.\r\n\r\nI am afraid that this movie missed its mark for me by a wide margin. I do not understand why it seems to be so bloody difficult for Hollywood to make a good Spider Man movie. I like Spider Man, the comics character that is, so I find the slew of substandard movies really disappointing.\r\n\r\nThe only reason it doesn't get less than two out of three stars from me is because, as a kids movie, it is not at all bad (except for the SJW crap). It wasn't what I was looking for though.", "created_at": "2017-12-26T16:59:11.029Z"}, {"movie_id": 315635, "review_id": "5a770dcfc3a36859ec04ad39", "author_rating": 7.0, "review_text": "**Young & hungry to fight crimes!**\r\n\r\nNo doubt, Tobey Maguire Spider-man is the best. It was also the first modern superhero of the millennium. The visual effects and entertainment wise, the second live-action Spider-man was good too, but this one is so different. This is about a teenage superhero. Just a kid. Having possessed such superpower, how he manages it alongside his normal life was nicely told.\r\n\r\nThis story begins straight away, because the introduction was done in the previous Marvel film, which are part of Avengers universe. Peter Parker assisted by Tony Stark, is very keen to fight small crimes compared to what Avengers fighting for. He feels, he's held back by Iron Man, so he wanted to make independent decisions. At one stage he succeeds in that, but things get more severe. Fighting bad guys, and the other side of his life, a romance, how the remaining story turns out are revealed with a twist.\r\n\r\nTom Holland was good. The story was simple, more like one liner. But the visuals and each scene forged nicely. Having seen all the five previous Spider-man films, this was quite predictable. Particularly the characters and their connections. Seeing how it had ended, it is possible that the daughter of the villain could take-over her father's place. That would be very interesting, because of the linkage between the film characters.\r\n\r\nAfter seeing the first look, I was afraid that this young Spider-man might be overshadowed by Iron Man, but those parts really well done. Comparing it with the 15 years ago Spider-man, the technology has been the biggest change. That's why I still love Tobey Maguire film. Very simple and down to the earth without cell phones, computers. But the current superhero films are all alien oriented/connected theme, and of course digital technology a big leap. Hoping the next film too would impress us with the same intensity. So lets wait for summer 2019.\r\n\r\n_7/10_", "created_at": "2018-02-04T13:42:39.750Z"}, {"movie_id": 315635, "review_id": "5b1d62b59251416614000cb5", "author_rating": 10.0, "review_text": "After the failure that was 'The Amazing Spider-man 2' Sony made a drastic decision in lending the character back to Marvel, and did it pay off? Absolutely!\r\n\r\nUnlike the Sam Raimi trilogy where Toby Maguire was a better Peter Parker than Spider-man and the Mark Webb duology where Andrew Garfield was a better Spider-man than a Peter, Tom Holland encapsulates both characters perfectly.\r\nOf course there were a negatives, especially in the second act which drops off a bit but the movies does such a wonderful job of recapturing our attention that you just can't help but forgive the movie for it!", "created_at": "2018-06-10T17:41:09.145Z"}, {"movie_id": 315635, "review_id": "5b51217b92514112ae005fe6", "author_rating": 10.0, "review_text": "AMAZING!!", "created_at": "2018-07-19T23:40:43.886Z"}, {"movie_id": 315635, "review_id": "5bcd91b20e0a26015b01dfd9", "author_rating": 9.0, "review_text": "My expectations were extremely low before this one released. Can't argue that the Amazing Spider-Man movies are very bad, yet there is always a room for a getting worse. But seriously, Homecoming has completely changed my experience from movies by Marvel x <a href=\"https://free-psn-codes.org/\">Sony</a> Pictures. It was entertaining and moving. Furthermore, it's as good for re-watch as well, what is a completely new experience for me.", "created_at": "2018-10-22T09:00:34.868Z"}, {"movie_id": 315635, "review_id": "5c8425a80e0a264301635857", "author_rating": 5.0, "review_text": "Spider-Man: Homecoming can't even hold a candle next to Sam Raimi's first two Spider-Man films, not to mention Spider-Man: Into the Spiderverse. Homecoming is simply Marvel's integration of Spider-Man into the MCU. It works on that level. Tom Holland is a good Peter Parker; finally an actor that looks like a high school student! Marisa Tomei does a really cool, sexy Aunt May, which I never thought I'd ever see. Michael Keaton is excellent as Vulture, one of the more interesting villains in the MCU.\r\n\r\nThe relationship between Tony Stark and Peter Parker is good but should have been better. It's clear that they half-assed the development of these two characters. The high-tech Spidey suit is neat but gives off the sense that the movie is trying to be too much like Iron Man.", "created_at": "2019-03-09T20:44:24.443Z"}, {"movie_id": 315635, "review_id": "5ca97838c3a3683f5260a0c8", "author_rating": 8.0, "review_text": "I personally thought all hope was lost, there's no way ANOTHER Spider-Man reboot could be successful. Yet this movie is colourful, fun, and fitting movie for the MCU", "created_at": "2019-04-07T04:10:32.288Z"}, {"movie_id": 315635, "review_id": "600a0e62cf9ba3003f834452", "author_rating": 8.0, "review_text": "A lot of fun!\r\n\r\n<em>'Spider-Man: Homecoming'</em> is entertaining, as I had expected in truth. The plot is possibly not as great as it could've been, but it is still one that is enjoyable to see. The effects are excellent, as is the humour.\r\n\r\nTom Holland is the star of this though. He kills it as the titular character, he adds a tremendous amount to the film. Michael Keaton plays his role well enough, while it's cool to see <em>'Iron Man'</em> duo Robert Downey Jr. and Jon Favreau involved.\r\n\r\nJacob Batalon is good, while it's noteworthy to have Zendaya and Donald Glover appear; even if they are underused/unimportant, at least for now for the former, I assume. I found the whole cast enjoyable, to be fair.\r\n\r\nThis narrowly misses the next rating up from me, but I still had a very pleasant time watching - and await the follow-up with much eagerness!", "created_at": "2021-01-21T23:29:38.251Z"}, {"movie_id": 315635, "review_id": "62404e0c81a7fc00472d0e06", "author_rating": 7.0, "review_text": "Once again, Marvel have succeeded in reinventing this franchise - and again, they have alighted on a Brit. Tom Holland is a super choice as our hero - he has oodles of on-screen charisma; he genuinely looks like he can't believe he is there half the time, and that all helps to make for an enjoyable fantasy adventure film. This time, he has to learn to master his spidey-senses (with a bit of help from \"Tony Stark\" (Robert Downey Jnr.) and the very rarely \"Happy Hogan\" (John Favreau)) before Michael Keaton - equipped with wings and a seriously powerful ray gun destroys all in his path. The performances are top drawer; the script is quickly paced with plenty of action, determination, humour and the slightest hint of menace, and the cleverly designed effects blend seamlessly into the action creating a thoroughly entertaining film. It is a bit too long, to be honest - but the casting is good, the direction tight and the whole thing a good family watch with a little bit for everyone.", "created_at": "2022-03-27T11:44:12.980Z"}, {"movie_id": 315635, "review_id": "63c21abda5743d00b0bfad53", "author_rating": 10.0, "review_text": "I won't complain about the continuity error within the MCU...because no one really cares least of all myself.\r\n\r\nWell, how do we do this. I mean, it is refreshing that Garfield is gone and with him the Spider-Bully. For Marvel comics fans, it really hurt watching Garfield bully and taunt his victims.\r\n\r\nNow we have a Spidey that is, well, nice. Holland is able to be funny and wise-cracking without seeming like a, well, a Flash Thompson. With that it beings us back to the source material.\r\n\r\nIn other words Holland puts the \"friendly\" back in \"your friendly neighborhood Spider-Man.\" And I think the MCU was well aware of this, given the time they took to make sure everyone knew Holland was going to be the hero that everyone loves.\r\n\r\nAnd then Keaton does a great vulture from his origin to his demise he seemed to do everything he could to really become the character.\r\n\r\nMy only complaints were the supporting cast. Aunt May I can accept with a moderate grudge because she is a great actress...\r\n\r\nBut Tony Revolori doesn't seem....built enough to be Flash. He's more the bully of the Millennial generation that uses words and little more and...when it comes down to it, even those are vapid.\r\n\r\nWhat's that old adage, \"sticks and stones will break my bones but words will never harm me.\" Millennials I guess have never heard that.\r\n\r\nFlash is supposed to be that big bully jock that hits his prime in high school and, a decade later, delivers the pizza when you go home to visit your folks...this Flash has a future.\r\n\r\nAnd the MJ tease at the end...it went a little too far away from the character in looks and personality to sit well.\r\n\r\nStill, on the whole the movie is a breath of fresh air in its distance from Garfield's rendition and at times, Holland was even able to pull off almost a James Bond quality while still portraying a kid over his head.\r\n\r\nLike all MCU movies, however, the pay off is the humor.", "created_at": "2023-01-14T03:00:13.520Z"}, {"movie_id": 315635, "review_id": "596343df9251410b860f177c", "author_rating": 7.0, "review_text": "There's now officially (not at all officially, more like just-my-opinion-ally) twice as many good Spider-Man movies as there is bad ones. But _Homecoming_ is my favourite of the bunch. 2017 has been a great year for  the Superhero genre, and _Spider-Man: Homecoming_ does nothing to buck that trend. It's got everything a Spider-Man movie should have: Heart, humour, action, spectacle, a grounded school life, coming-of-age themes, and all this while firmly rooting itself in the Marvel Cinematic Universe -- without relying on the framework of the past to hold it up. _Spider-Man: Homecoming_ is spectacular, and it stands up both on its own, and as a part of the larger universe.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-07-10T09:07:43.738Z"}, {"movie_id": 315635, "review_id": "5a2f2fad925141032c16f0e7", "author_rating": 4.0, "review_text": "Disappointing return for the webslinger. After the dramatic introduction in Civil War this film feels like an excercise in keeping the coffers full.\r\nUnlike the Toby Maguire films this incarnation feels flat. It never manages to really put our superhero in any real peril...it just goes through the motions and ticks boxes. Granted it is mostly enjoyable, but did we need it??\r\nNo.\r\n\r\nThe suit and inclusion of Iron Man takes away from what is great about Spiderman. The fact he has to juggle school, work, realationships is what kept him grounded...\r\nHe does not need Iron Man's suit or him flying in to save the day!!\r\n\r\nAlso, why does he not have a spidey-sense?!? He gets nailed left, right and centre!\r\n\r\n*  To conclude; disappointing, Yes, as Spiderman just became another member of Tony's team...when he should stand alone.", "created_at": "2017-12-12T01:23:57.898Z"}, {"movie_id": 315635, "review_id": "5a427fdf0e0a2620e9056c3d", "author_rating": 4.0, "review_text": "I guess I should not be too surprised given the Spider Man character we saw in the latest Captain America but I have to say that I was, well, hoping for something else, as in something better.\r\n\r\nIf the producer/writer intended to make a Spider Man movie for kids, and I mean kids, not young adults but kids, then this movie is hitting the spot. It is an excellent action/adventure movie for kids. Unfortunately I am not really in that viewer segment and for me this movie was pretty bad.\r\n\r\nThe movie is childish. There is no other way to describe it. My memory of spider man is a quite serious young man with a sharp and witty tongue. Not the fumbling and childish Spider Man in this movie. His best friend may be a good computer geek but otherwise he is dumb as a door nail and just tiring to watch. His, supposedly adult handler is a screw up who, surprise surprise, is hanging up the phone because he cannot be bothered to listen to kids.\r\n\r\nThe FX may be good as FX goes visually but it was also the typical, nonsensical Hollywood rubbish like boats that stays afloat forever despite being split in half etc. etc. The talking Spider Man suit appears to be programmed by the same guy who wrote the childish script.\r\n\r\nThe main bad guy pretty much has zero charisma and is nothing but a simple thief. Same goes for his buddies.\r\n\r\nThe SJW crap spread out here and there in the movie, especially in the Washington Monument scenes, was unwanted and just pissed me off.\r\n\r\nI am afraid that this movie missed its mark for me by a wide margin. I do not understand why it seems to be so bloody difficult for Hollywood to make a good Spider Man movie. I like Spider Man, the comics character that is, so I find the slew of substandard movies really disappointing.\r\n\r\nThe only reason it doesn't get less than two out of three stars from me is because, as a kids movie, it is not at all bad (except for the SJW crap). It wasn't what I was looking for though.", "created_at": "2017-12-26T16:59:11.029Z"}, {"movie_id": 315635, "review_id": "5a770dcfc3a36859ec04ad39", "author_rating": 7.0, "review_text": "**Young & hungry to fight crimes!**\r\n\r\nNo doubt, Tobey Maguire Spider-man is the best. It was also the first modern superhero of the millennium. The visual effects and entertainment wise, the second live-action Spider-man was good too, but this one is so different. This is about a teenage superhero. Just a kid. Having possessed such superpower, how he manages it alongside his normal life was nicely told.\r\n\r\nThis story begins straight away, because the introduction was done in the previous Marvel film, which are part of Avengers universe. Peter Parker assisted by Tony Stark, is very keen to fight small crimes compared to what Avengers fighting for. He feels, he's held back by Iron Man, so he wanted to make independent decisions. At one stage he succeeds in that, but things get more severe. Fighting bad guys, and the other side of his life, a romance, how the remaining story turns out are revealed with a twist.\r\n\r\nTom Holland was good. The story was simple, more like one liner. But the visuals and each scene forged nicely. Having seen all the five previous Spider-man films, this was quite predictable. Particularly the characters and their connections. Seeing how it had ended, it is possible that the daughter of the villain could take-over her father's place. That would be very interesting, because of the linkage between the film characters.\r\n\r\nAfter seeing the first look, I was afraid that this young Spider-man might be overshadowed by Iron Man, but those parts really well done. Comparing it with the 15 years ago Spider-man, the technology has been the biggest change. That's why I still love Tobey Maguire film. Very simple and down to the earth without cell phones, computers. But the current superhero films are all alien oriented/connected theme, and of course digital technology a big leap. Hoping the next film too would impress us with the same intensity. So lets wait for summer 2019.\r\n\r\n_7/10_", "created_at": "2018-02-04T13:42:39.750Z"}, {"movie_id": 315635, "review_id": "5b1d62b59251416614000cb5", "author_rating": 10.0, "review_text": "After the failure that was 'The Amazing Spider-man 2' Sony made a drastic decision in lending the character back to Marvel, and did it pay off? Absolutely!\r\n\r\nUnlike the Sam Raimi trilogy where Toby Maguire was a better Peter Parker than Spider-man and the Mark Webb duology where Andrew Garfield was a better Spider-man than a Peter, Tom Holland encapsulates both characters perfectly.\r\nOf course there were a negatives, especially in the second act which drops off a bit but the movies does such a wonderful job of recapturing our attention that you just can't help but forgive the movie for it!", "created_at": "2018-06-10T17:41:09.145Z"}, {"movie_id": 315635, "review_id": "5b51217b92514112ae005fe6", "author_rating": 10.0, "review_text": "AMAZING!!", "created_at": "2018-07-19T23:40:43.886Z"}, {"movie_id": 315635, "review_id": "5bcd91b20e0a26015b01dfd9", "author_rating": 9.0, "review_text": "My expectations were extremely low before this one released. Can't argue that the Amazing Spider-Man movies are very bad, yet there is always a room for a getting worse. But seriously, Homecoming has completely changed my experience from movies by Marvel x <a href=\"https://free-psn-codes.org/\">Sony</a> Pictures. It was entertaining and moving. Furthermore, it's as good for re-watch as well, what is a completely new experience for me.", "created_at": "2018-10-22T09:00:34.868Z"}, {"movie_id": 315635, "review_id": "5c8425a80e0a264301635857", "author_rating": 5.0, "review_text": "Spider-Man: Homecoming can't even hold a candle next to Sam Raimi's first two Spider-Man films, not to mention Spider-Man: Into the Spiderverse. Homecoming is simply Marvel's integration of Spider-Man into the MCU. It works on that level. Tom Holland is a good Peter Parker; finally an actor that looks like a high school student! Marisa Tomei does a really cool, sexy Aunt May, which I never thought I'd ever see. Michael Keaton is excellent as Vulture, one of the more interesting villains in the MCU.\r\n\r\nThe relationship between Tony Stark and Peter Parker is good but should have been better. It's clear that they half-assed the development of these two characters. The high-tech Spidey suit is neat but gives off the sense that the movie is trying to be too much like Iron Man.", "created_at": "2019-03-09T20:44:24.443Z"}, {"movie_id": 315635, "review_id": "5ca97838c3a3683f5260a0c8", "author_rating": 8.0, "review_text": "I personally thought all hope was lost, there's no way ANOTHER Spider-Man reboot could be successful. Yet this movie is colourful, fun, and fitting movie for the MCU", "created_at": "2019-04-07T04:10:32.288Z"}, {"movie_id": 315635, "review_id": "600a0e62cf9ba3003f834452", "author_rating": 8.0, "review_text": "A lot of fun!\r\n\r\n<em>'Spider-Man: Homecoming'</em> is entertaining, as I had expected in truth. The plot is possibly not as great as it could've been, but it is still one that is enjoyable to see. The effects are excellent, as is the humour.\r\n\r\nTom Holland is the star of this though. He kills it as the titular character, he adds a tremendous amount to the film. Michael Keaton plays his role well enough, while it's cool to see <em>'Iron Man'</em> duo Robert Downey Jr. and Jon Favreau involved.\r\n\r\nJacob Batalon is good, while it's noteworthy to have Zendaya and Donald Glover appear; even if they are underused/unimportant, at least for now for the former, I assume. I found the whole cast enjoyable, to be fair.\r\n\r\nThis narrowly misses the next rating up from me, but I still had a very pleasant time watching - and await the follow-up with much eagerness!", "created_at": "2021-01-21T23:29:38.251Z"}, {"movie_id": 315635, "review_id": "62404e0c81a7fc00472d0e06", "author_rating": 7.0, "review_text": "Once again, Marvel have succeeded in reinventing this franchise - and again, they have alighted on a Brit. Tom Holland is a super choice as our hero - he has oodles of on-screen charisma; he genuinely looks like he can't believe he is there half the time, and that all helps to make for an enjoyable fantasy adventure film. This time, he has to learn to master his spidey-senses (with a bit of help from \"Tony Stark\" (Robert Downey Jnr.) and the very rarely \"Happy Hogan\" (John Favreau)) before Michael Keaton - equipped with wings and a seriously powerful ray gun destroys all in his path. The performances are top drawer; the script is quickly paced with plenty of action, determination, humour and the slightest hint of menace, and the cleverly designed effects blend seamlessly into the action creating a thoroughly entertaining film. It is a bit too long, to be honest - but the casting is good, the direction tight and the whole thing a good family watch with a little bit for everyone.", "created_at": "2022-03-27T11:44:12.980Z"}, {"movie_id": 315635, "review_id": "63c21abda5743d00b0bfad53", "author_rating": 10.0, "review_text": "I won't complain about the continuity error within the MCU...because no one really cares least of all myself.\r\n\r\nWell, how do we do this. I mean, it is refreshing that Garfield is gone and with him the Spider-Bully. For Marvel comics fans, it really hurt watching Garfield bully and taunt his victims.\r\n\r\nNow we have a Spidey that is, well, nice. Holland is able to be funny and wise-cracking without seeming like a, well, a Flash Thompson. With that it beings us back to the source material.\r\n\r\nIn other words Holland puts the \"friendly\" back in \"your friendly neighborhood Spider-Man.\" And I think the MCU was well aware of this, given the time they took to make sure everyone knew Holland was going to be the hero that everyone loves.\r\n\r\nAnd then Keaton does a great vulture from his origin to his demise he seemed to do everything he could to really become the character.\r\n\r\nMy only complaints were the supporting cast. Aunt May I can accept with a moderate grudge because she is a great actress...\r\n\r\nBut Tony Revolori doesn't seem....built enough to be Flash. He's more the bully of the Millennial generation that uses words and little more and...when it comes down to it, even those are vapid.\r\n\r\nWhat's that old adage, \"sticks and stones will break my bones but words will never harm me.\" Millennials I guess have never heard that.\r\n\r\nFlash is supposed to be that big bully jock that hits his prime in high school and, a decade later, delivers the pizza when you go home to visit your folks...this Flash has a future.\r\n\r\nAnd the MJ tease at the end...it went a little too far away from the character in looks and personality to sit well.\r\n\r\nStill, on the whole the movie is a breath of fresh air in its distance from Garfield's rendition and at times, Holland was even able to pull off almost a James Bond quality while still portraying a kid over his head.\r\n\r\nLike all MCU movies, however, the pay off is the humor.", "created_at": "2023-01-14T03:00:13.520Z"}, {"movie_id": 315635, "review_id": "596343df9251410b860f177c", "author_rating": 7.0, "review_text": "There's now officially (not at all officially, more like just-my-opinion-ally) twice as many good Spider-Man movies as there is bad ones. But _Homecoming_ is my favourite of the bunch. 2017 has been a great year for  the Superhero genre, and _Spider-Man: Homecoming_ does nothing to buck that trend. It's got everything a Spider-Man movie should have: Heart, humour, action, spectacle, a grounded school life, coming-of-age themes, and all this while firmly rooting itself in the Marvel Cinematic Universe -- without relying on the framework of the past to hold it up. _Spider-Man: Homecoming_ is spectacular, and it stands up both on its own, and as a part of the larger universe.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-07-10T09:07:43.738Z"}, {"movie_id": 315635, "review_id": "5a2f2fad925141032c16f0e7", "author_rating": 4.0, "review_text": "Disappointing return for the webslinger. After the dramatic introduction in Civil War this film feels like an excercise in keeping the coffers full.\r\nUnlike the Toby Maguire films this incarnation feels flat. It never manages to really put our superhero in any real peril...it just goes through the motions and ticks boxes. Granted it is mostly enjoyable, but did we need it??\r\nNo.\r\n\r\nThe suit and inclusion of Iron Man takes away from what is great about Spiderman. The fact he has to juggle school, work, realationships is what kept him grounded...\r\nHe does not need Iron Man's suit or him flying in to save the day!!\r\n\r\nAlso, why does he not have a spidey-sense?!? He gets nailed left, right and centre!\r\n\r\n*  To conclude; disappointing, Yes, as Spiderman just became another member of Tony's team...when he should stand alone.", "created_at": "2017-12-12T01:23:57.898Z"}, {"movie_id": 315635, "review_id": "5a427fdf0e0a2620e9056c3d", "author_rating": 4.0, "review_text": "I guess I should not be too surprised given the Spider Man character we saw in the latest Captain America but I have to say that I was, well, hoping for something else, as in something better.\r\n\r\nIf the producer/writer intended to make a Spider Man movie for kids, and I mean kids, not young adults but kids, then this movie is hitting the spot. It is an excellent action/adventure movie for kids. Unfortunately I am not really in that viewer segment and for me this movie was pretty bad.\r\n\r\nThe movie is childish. There is no other way to describe it. My memory of spider man is a quite serious young man with a sharp and witty tongue. Not the fumbling and childish Spider Man in this movie. His best friend may be a good computer geek but otherwise he is dumb as a door nail and just tiring to watch. His, supposedly adult handler is a screw up who, surprise surprise, is hanging up the phone because he cannot be bothered to listen to kids.\r\n\r\nThe FX may be good as FX goes visually but it was also the typical, nonsensical Hollywood rubbish like boats that stays afloat forever despite being split in half etc. etc. The talking Spider Man suit appears to be programmed by the same guy who wrote the childish script.\r\n\r\nThe main bad guy pretty much has zero charisma and is nothing but a simple thief. Same goes for his buddies.\r\n\r\nThe SJW crap spread out here and there in the movie, especially in the Washington Monument scenes, was unwanted and just pissed me off.\r\n\r\nI am afraid that this movie missed its mark for me by a wide margin. I do not understand why it seems to be so bloody difficult for Hollywood to make a good Spider Man movie. I like Spider Man, the comics character that is, so I find the slew of substandard movies really disappointing.\r\n\r\nThe only reason it doesn't get less than two out of three stars from me is because, as a kids movie, it is not at all bad (except for the SJW crap). It wasn't what I was looking for though.", "created_at": "2017-12-26T16:59:11.029Z"}, {"movie_id": 315635, "review_id": "5a770dcfc3a36859ec04ad39", "author_rating": 7.0, "review_text": "**Young & hungry to fight crimes!**\r\n\r\nNo doubt, Tobey Maguire Spider-man is the best. It was also the first modern superhero of the millennium. The visual effects and entertainment wise, the second live-action Spider-man was good too, but this one is so different. This is about a teenage superhero. Just a kid. Having possessed such superpower, how he manages it alongside his normal life was nicely told.\r\n\r\nThis story begins straight away, because the introduction was done in the previous Marvel film, which are part of Avengers universe. Peter Parker assisted by Tony Stark, is very keen to fight small crimes compared to what Avengers fighting for. He feels, he's held back by Iron Man, so he wanted to make independent decisions. At one stage he succeeds in that, but things get more severe. Fighting bad guys, and the other side of his life, a romance, how the remaining story turns out are revealed with a twist.\r\n\r\nTom Holland was good. The story was simple, more like one liner. But the visuals and each scene forged nicely. Having seen all the five previous Spider-man films, this was quite predictable. Particularly the characters and their connections. Seeing how it had ended, it is possible that the daughter of the villain could take-over her father's place. That would be very interesting, because of the linkage between the film characters.\r\n\r\nAfter seeing the first look, I was afraid that this young Spider-man might be overshadowed by Iron Man, but those parts really well done. Comparing it with the 15 years ago Spider-man, the technology has been the biggest change. That's why I still love Tobey Maguire film. Very simple and down to the earth without cell phones, computers. But the current superhero films are all alien oriented/connected theme, and of course digital technology a big leap. Hoping the next film too would impress us with the same intensity. So lets wait for summer 2019.\r\n\r\n_7/10_", "created_at": "2018-02-04T13:42:39.750Z"}, {"movie_id": 315635, "review_id": "5b1d62b59251416614000cb5", "author_rating": 10.0, "review_text": "After the failure that was 'The Amazing Spider-man 2' Sony made a drastic decision in lending the character back to Marvel, and did it pay off? Absolutely!\r\n\r\nUnlike the Sam Raimi trilogy where Toby Maguire was a better Peter Parker than Spider-man and the Mark Webb duology where Andrew Garfield was a better Spider-man than a Peter, Tom Holland encapsulates both characters perfectly.\r\nOf course there were a negatives, especially in the second act which drops off a bit but the movies does such a wonderful job of recapturing our attention that you just can't help but forgive the movie for it!", "created_at": "2018-06-10T17:41:09.145Z"}, {"movie_id": 315635, "review_id": "5b51217b92514112ae005fe6", "author_rating": 10.0, "review_text": "AMAZING!!", "created_at": "2018-07-19T23:40:43.886Z"}, {"movie_id": 315635, "review_id": "5bcd91b20e0a26015b01dfd9", "author_rating": 9.0, "review_text": "My expectations were extremely low before this one released. Can't argue that the Amazing Spider-Man movies are very bad, yet there is always a room for a getting worse. But seriously, Homecoming has completely changed my experience from movies by Marvel x <a href=\"https://free-psn-codes.org/\">Sony</a> Pictures. It was entertaining and moving. Furthermore, it's as good for re-watch as well, what is a completely new experience for me.", "created_at": "2018-10-22T09:00:34.868Z"}, {"movie_id": 315635, "review_id": "5c8425a80e0a264301635857", "author_rating": 5.0, "review_text": "Spider-Man: Homecoming can't even hold a candle next to Sam Raimi's first two Spider-Man films, not to mention Spider-Man: Into the Spiderverse. Homecoming is simply Marvel's integration of Spider-Man into the MCU. It works on that level. Tom Holland is a good Peter Parker; finally an actor that looks like a high school student! Marisa Tomei does a really cool, sexy Aunt May, which I never thought I'd ever see. Michael Keaton is excellent as Vulture, one of the more interesting villains in the MCU.\r\n\r\nThe relationship between Tony Stark and Peter Parker is good but should have been better. It's clear that they half-assed the development of these two characters. The high-tech Spidey suit is neat but gives off the sense that the movie is trying to be too much like Iron Man.", "created_at": "2019-03-09T20:44:24.443Z"}, {"movie_id": 315635, "review_id": "5ca97838c3a3683f5260a0c8", "author_rating": 8.0, "review_text": "I personally thought all hope was lost, there's no way ANOTHER Spider-Man reboot could be successful. Yet this movie is colourful, fun, and fitting movie for the MCU", "created_at": "2019-04-07T04:10:32.288Z"}, {"movie_id": 315635, "review_id": "600a0e62cf9ba3003f834452", "author_rating": 8.0, "review_text": "A lot of fun!\r\n\r\n<em>'Spider-Man: Homecoming'</em> is entertaining, as I had expected in truth. The plot is possibly not as great as it could've been, but it is still one that is enjoyable to see. The effects are excellent, as is the humour.\r\n\r\nTom Holland is the star of this though. He kills it as the titular character, he adds a tremendous amount to the film. Michael Keaton plays his role well enough, while it's cool to see <em>'Iron Man'</em> duo Robert Downey Jr. and Jon Favreau involved.\r\n\r\nJacob Batalon is good, while it's noteworthy to have Zendaya and Donald Glover appear; even if they are underused/unimportant, at least for now for the former, I assume. I found the whole cast enjoyable, to be fair.\r\n\r\nThis narrowly misses the next rating up from me, but I still had a very pleasant time watching - and await the follow-up with much eagerness!", "created_at": "2021-01-21T23:29:38.251Z"}, {"movie_id": 315635, "review_id": "62404e0c81a7fc00472d0e06", "author_rating": 7.0, "review_text": "Once again, Marvel have succeeded in reinventing this franchise - and again, they have alighted on a Brit. Tom Holland is a super choice as our hero - he has oodles of on-screen charisma; he genuinely looks like he can't believe he is there half the time, and that all helps to make for an enjoyable fantasy adventure film. This time, he has to learn to master his spidey-senses (with a bit of help from \"Tony Stark\" (Robert Downey Jnr.) and the very rarely \"Happy Hogan\" (John Favreau)) before Michael Keaton - equipped with wings and a seriously powerful ray gun destroys all in his path. The performances are top drawer; the script is quickly paced with plenty of action, determination, humour and the slightest hint of menace, and the cleverly designed effects blend seamlessly into the action creating a thoroughly entertaining film. It is a bit too long, to be honest - but the casting is good, the direction tight and the whole thing a good family watch with a little bit for everyone.", "created_at": "2022-03-27T11:44:12.980Z"}, {"movie_id": 315635, "review_id": "63c21abda5743d00b0bfad53", "author_rating": 10.0, "review_text": "I won't complain about the continuity error within the MCU...because no one really cares least of all myself.\r\n\r\nWell, how do we do this. I mean, it is refreshing that Garfield is gone and with him the Spider-Bully. For Marvel comics fans, it really hurt watching Garfield bully and taunt his victims.\r\n\r\nNow we have a Spidey that is, well, nice. Holland is able to be funny and wise-cracking without seeming like a, well, a Flash Thompson. With that it beings us back to the source material.\r\n\r\nIn other words Holland puts the \"friendly\" back in \"your friendly neighborhood Spider-Man.\" And I think the MCU was well aware of this, given the time they took to make sure everyone knew Holland was going to be the hero that everyone loves.\r\n\r\nAnd then Keaton does a great vulture from his origin to his demise he seemed to do everything he could to really become the character.\r\n\r\nMy only complaints were the supporting cast. Aunt May I can accept with a moderate grudge because she is a great actress...\r\n\r\nBut Tony Revolori doesn't seem....built enough to be Flash. He's more the bully of the Millennial generation that uses words and little more and...when it comes down to it, even those are vapid.\r\n\r\nWhat's that old adage, \"sticks and stones will break my bones but words will never harm me.\" Millennials I guess have never heard that.\r\n\r\nFlash is supposed to be that big bully jock that hits his prime in high school and, a decade later, delivers the pizza when you go home to visit your folks...this Flash has a future.\r\n\r\nAnd the MJ tease at the end...it went a little too far away from the character in looks and personality to sit well.\r\n\r\nStill, on the whole the movie is a breath of fresh air in its distance from Garfield's rendition and at times, Holland was even able to pull off almost a James Bond quality while still portraying a kid over his head.\r\n\r\nLike all MCU movies, however, the pay off is the humor.", "created_at": "2023-01-14T03:00:13.520Z"}]