[{"movie_id": 577922, "review_id": "5f4469f7fdc4fa0035b1a753", "author_rating": 6.0, "review_text": "I fully understand that Christopher Nolan is trying to play with time, as that what's the movie's about - and yes, he is known for confusing movies - but here, Nolan has made something uninteresting. The idea of things going backwards is cool, but the rules are unclear. We never know what the basic goal is - I could understand secrets, but the film has to be interesting and 'Tenet' simply isn't. Nothing here makes me want to work things out; it's forgettable. Sure, you can say this has to be seen on the big screen, but the long runtime makes it unappealing to most mainstream audiences. Unfortunately, 'Tenet' is not here to save the 2020 box office. I work at a cinema, and to say it underperformed well would be correct. We are going to see more 'Tenet' hot-take YouTube videos than thinkpiece/what you missed ones. Christopher Nolan has made his most forgettable film to date - it's not a bad movie and I'm sure his diehard fans will adore this one, but for everyone else, there isn't much here. 'Tenet' won't be remembered as another “groundbreaking visual spectacle“ from Nolan or for “saving cinema“. It will be remembered for its weird release schedule and having been shown during a global pandemic, and that's unfortunate. Like the rest of the year, 'Tenet' is a write-off.\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-tenet-time-runs-up-like-my-enjoyment-of-nolans-latest-film", "created_at": "2020-08-25T01:31:35.565Z"}, {"movie_id": 577922, "review_id": "5f47c2d59463180035f1eb84", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nChristopher Nolan has delivered some of my favorite movies of the century. All the way from Memento to the most recent Dunkirk, I've yet to dislike one of his films, so expectations are always high with him. The current global pandemic closed movie theaters worldwide, but fortunately, some countries already opened them, including my own. My IMAX screening of Tenet was my first trip to a theater since February! As a firm believer and strong advocate of the so-called \"cinematic experience\", I would always remember fondly the day I returned to a place I hold very close to my heart independently of my opinion about the film. Nevertheless, it became an even more special day once I left that enormous screen behind with a happy face.\r\n\r\nNowadays, people complain about everything, especially on social media. So, I'm not surprised that the \"savior of cinema\" marketing tagline triggered so many souls. If Nolan didn't have enough haters, it surely got a few more after this campaign. Me? I look at it like any other marketing scheme: it's intended to hype its own movie, so I don't really understand why this specific publicity caused so much controversy. Obviously, \"savior of cinema\" doesn't mean Nolan is going to save theaters from dying. It's just a tagline trying to hype the first major blockbuster in several months! It's a marketing strategy to try and convince people to give Tenet a go. If there's a film meant to be seen at the biggest screen possible, this is the one.\r\n\r\nI'll get the outstanding technical achievements out of the way. Inception and Interstellar boast impressive visuals that are hard to compete with, but Tenet is up to the challenge. With uniquely complex, stunning, grand set pieces, Nolan delivers riveting action based on a mind-blowing temporal concept that will make every single viewer scratch their heads. I lost count to the number of times I tried to open my eyes more so I could see (and understand) everything that was going on. Hoyte van Hoytema's cinematography is handheld for a lot of action sequences, and he has such control over his craft that he was able to capture some of the most jaw-dropping action moments of the last few years through gorgeous angles and a firm grip.\r\n\r\nNolan said that Tenet would be \"the hardest movie to cut\" for any editor. Jennifer Lame's editing plays a vital role in the time inversion sequences. It's relatively easy to imagine how brutal of a task she must have had. She's incredibly consistent throughout the runtime with perfectly timed cuts that elevate even the simplest of scenes. I wish I could be more specific, but in order to avoid spoilers, I'll just write this: she has a bunch of nominations coming her way, including an Academy Award. Ludwig Göransson's score is tremendously powerful, and it definitely adds to the magnificent action set pieces, especially in the third act.\r\n\r\nFinally, Nathan Crowley (production designer) creates such a realistic look that it almost made me believe this could actually occur in the real world. CGI has come a long way, and it's indisputably a tool that can completely transform films into something fascinating when used correctly. However, practical effects will always offer a feeling impossible to replicate through computerized images. It's probably the aspect I appreciate the most about this movie: its massive application of practical effects and real stunts. It surrounds the physics-defying premise within a bubble of realism, and that's only achieved with talented people in the right technical departments.\r\n\r\nStory-wise... this is where it gets tricky. I have to be honest about my experience: I found it surprisingly okay to follow and not that challenging to understand. This doesn't mean that it isn't a remarkably complex, layered narrative with ideas that will be incredibly hard for some people to comprehend. I'm not trying to patronize anyone, far from that, but some viewers will inevitably leave the theater without completely understanding what they just saw, simply because it's a two-hour-and-a-half movie packed with heavy exposition about a fictional quantum physics concept. For example, in the same way that some people genuinely can't have a 3D perspective, other people will also have visual difficulties in distinguishing the inverted sequences.\r\n\r\nThe need to be vague about plot details doesn't let me explain a lot, but the unique concept Nolan develops in Tenet is undoubtedly an exceptionally intriguing idea. As crazy as it might sound, I found the visuals more confusing than the actual scientific explanations that they go with. Unfortunately, that's one of my main issues with the film. Throughout the entire runtime, there's an excessive load of exposition about the time shenanigans. It's a massive amount of information for anyone to be able to remember every single detail. Even worse, some dialogue sequences feel so incredibly forced that it's almost like the movie stops for quick breaks where the characters explain something directly to the audience.\r\n\r\nThis last point leads me to another problem. John David Washington gets better and better as time goes by, but he feels like a mediator between the film and the audience for the first half of the movie. His dialogue revolves around asking questions about what's happening and how the time inversion works, which is obviously understandable given the character's circumstances, but the execution of these conversations lacks that spontaneous vibe. It really feels like someone yelled \"Action!\", the actors did their lines, and that same someone yelled \"Cut!\". Washington isn't exactly a worldwide, well-known actor (Ballers, BlackKklansman), and this is his first big blockbuster appearance, so his inexperience didn't help him through these moments.\r\n\r\nHowever, he ends up being a fine protagonist (no pun intended). Robert Pattinson is charming and quite funny, actually. I couldn't avoid the \"humorless\" review headlines, and being totally honest, it's surprisingly a lot funnier than I thought it would (not) be. His character has a vital role in the whole story, and it's through him that most of the knowledge about the intricate concept at hand is developed. Elizabeth Debicki is probably the spotlight stealer, though. With a remarkable performance, she represents the emotional arc of the film, and she delivers one of her best interpretations ever. I was afraid that her storyline would turn into a forced romance, but fortunately, it only helped build Washington's character traits.\r\n\r\nOn the other hand, Kenneth Branagh plays a cliche Russian bad guy with generic motivations who feels way too formulaic for such a ground-breaking movie. But ultimately, that's what Nolan presents. His astonishingly talented methods as a director and his obsession with detail as a writer make Tenet a certainly flawed yet phenomenal film with a concept that might be the hardest he's ever had to pull off. As long as people can remove themselves from the real world and enter a whole new one with entirely different mechanisms and rules, it will be the so-called \"blockbuster of the summer\" that everyone deserves this year.\r\n\r\nAll in all, Tenet undoubtedly boasts an incredibly complex narrative with a unique temporal concept impressively demonstrated through spectacular, loud, jaw-dropping, practical action set pieces. Christopher Nolan is a masterful director and a fascinating writer, but he has to thank its technical crew for creating such a visually stunning blockbuster. From Hoyte van Hoytema's riveting camera work to Jennifer Lame's seamless editing, passing through Ludwig Göransson's powerful score and Nathan Crowley's beautiful production design, Tenet is one of the most technically mind-blowing movies of the last few years. With the help of a remarkable cast (especially Debicki and Pattinson), the definitely intriguing story makes the epic runtime feel a bit shorter, despite some scenes being unnecessary. The heavy and forced exposition throughout the entire film transforms an otherwise entertaining flick into a fictional physics class that will confuse thousands of viewers. It also doesn't help to have a generic MacGuffin and a formulaic villain at the core of such an unconventional movie. In the end, Nolan isn't the \"savior of cinema\" (no one will be), but he certainly delivers the blockbuster everyone's been waiting for since the beginning of the year. As long as people are able to accept and enter his new world, Tenet will be received as one of the best films of 2020.\r\n\r\nRating: A-", "created_at": "2020-08-27T14:27:33.100Z"}, {"movie_id": 577922, "review_id": "5f4844567739410035e8958a", "author_rating": 9.0, "review_text": "There is a moment midway through this film where you can suddenly feel everything clicking into place. Up until this point, the film has been entertaining, with some great set pieces and a scope that is trademark Nolan, but the central hook of the film - “time inversion” - has felt almost superfluous to the plot, albeit a clever visual conceit that gives the film a different vibe to your average spy thriller. But then comes the “moment” - a simple act of crossing a threshold - where suddenly you realise how the visual conceit is going to figure into the rest of the film and also how most of the first hour has been pure setup for what is to follow. It’s the kind of twist that isn’t really a twist at all as it is a visual explanation that the film has really been waiting for. Nolan has taken quite a gamble in delaying this “moment” for so long and there is always the feeling the film is hiding elements of the plot in the first half. This means the explanation may have come too late for some to invest in the film fully, but if you are still with it, there is a sudden feeling of exhilaration of knowing to an extent some of what is about to follow and the film lets loose with some fantastic set pieces that are hugely satisfying if you have been paying attention.\r\n\r\nPerformances are great, with Branagh in full scenery chewing mode and the score is suitably Zimmeresque and loud. It doesn’t quite hit the highs of its closest cousin - Inception - but it’s scope is similarly impressive and it’s going to lead to plenty of theories and explanations in order to follow each major character’s journey through the film. Great stuff in the end, but it was touch and go there for a while.", "created_at": "2020-08-27T23:40:06.467Z"}, {"movie_id": 577922, "review_id": "5f518512d35dea0034f08535", "author_rating": 10.0, "review_text": "I was recently asked if this was better or worse than Inception. \r\n Personally, I don’t think you can compare any of his films outside the fact that he made them. Like those made by Tarantino, each film is its own living masterpiece ... \r\n\r\nIf you are a fan of Nolan, this is a must see!", "created_at": "2020-09-04T00:06:42.804Z"}, {"movie_id": 577922, "review_id": "5f73f5da21621b00352bec5d", "author_rating": 2.0, "review_text": "**_An aesthetic showcase that's completely uninterested in human beings (and for the love of God, what does Christopher Nolan have against decent sound mixing?)_**\r\n\r\n> S A T O R\r\n> \r\n> A R E P O\r\n> \r\n> T E N E T\r\n> \r\n> O P E R A\r\n> \r\n> R O T A S \r\n\r\n- Sator square (date unknown)\r\n\r\n>_The laws of science do not distinguish between the past and the future. More precisely, the laws of science are unchanged under the combination of operations (or symmetries) known as C, P, and T (C means changing particles for antiparticles. P means taking the mirror image, so left and right are interchanged. And T means reversing the direction of motion of all particles: in effect, running the motion backward). The laws of science that govern the behaviour of matter under all normal situations are unchanged under the combination of the two operations C and P on their own. In other words, life would be just the same for the inhabitants of another planet who were both mirror images of us and who were made of antimatter, rather than matter._\r\n\r\n>_If the laws of science are unchanged by the combination of operations C and P, and also by the combination C, P, and T, they must also be unchanged under the operation T alone. Yet there is a big difference between the forward and backward directions of real time in ordinary life. Imagine a cup of water falling off a table and breaking into pieces on the floor. If you take a film of this, you can easily tell whether it is being run forward or backward. If you run it backward you will see the pieces suddenly gather themselves together off the floor and jump back to form a whole cup on the table. You can tell that the film is being run backward because this kind of behaviour is never observed in ordinary life._\r\n\r\n>_The explanation that is usually given as to why we don't see broken cups gathering themselves together off the floor and jumping back onto the table is that it is forbidden by the second law of thermodynamics. This says that in any closed system, disorder, or entropy, always increases with time. In other words, it is a form of Murphy's law: things always tend to go wrong! An intact cup on the table is a state of high order, but a broken cup on the floor is a disordered state. One can go readily from the cup on the table in the past to the broken cup on the floor in the future, but not the other way round._\r\n\r\n- Stephen Hawking; _A Brief History of Time: From the Big Bang to Black Holes_ (1988)\r\n\r\n> _Imagine you and a friend decide to go to Pisa, with one of you standing atop the famous leaning tower and the other located down at the bottom. From the top, whoever throws a ball off the edge can easily predict where it will land down on the bottom. Yet if the person at the bottom were to throw the ball upwards with an equal-and-opposite velocity to the ball that just landed, it would arrive exactly at the location where the person at the top threw their ball from._\r\n\r\n> _This is a situation where time-reversal invariance holds: where the T-symmetry is unbroken. Time reversal can be thought of the same way as motion reversal: if the rules are the same whether you run the clock forwards or backwards, there's true T-symmetry. But if the rules are different when the clock runs backwards from when the clock runs forwards, the T-symmetry must be broken._\r\n\r\n- Ethan Siegel; \"No, The Laws Of Physics Are Not The Same Forwards And Backwards In Time\"; _Forbes_ (July 5, 2019)\r\n\r\nWatching _Tenet_, the latest film from writer/producer/director Christopher Nolan (_Memento_; _Inception_; _Interstellar_), I was reminded of an apocryphal story about NASA – during the space race, in an attempt to tackle the problem of how to write in zero gravity, NASA poured millions into developing the Fisher Space Pen, whereas the Russians simply gave their cosmonauts pencils. And it seems to me watching this overblown mess of a film that Nolan has become so fixated on the grandiosity of the pen that he has completely overlooked the humble pencil. More so than any of his previous work, _Tenet_ is focused on mixing philosophy and real(ish) science with over-the-top mainstream entertainment to such an extent that he ignores such basic narrative principles as character arcs, empathy, motivation, and interiority. Now, don't get me wrong, I love filmic experimentation (two of my favourite directors are Terrence Malick and David Lynch), but _Tenet_ isn't an especially experimental film – it's a humourless and badly written shambles, convinced of its own portentousness, and created by a man who has achieved such popularity that it seems no one in his circle is willing to tell him when something is a bad idea.\r\n\r\nSpending almost ten years working on the story, and five writing the script, in Tenet, Nolan is yet again examining the vagaries of time. It's a theme that's front and centre in _Memento_ (2000), _Inception_ (2010), _Interstellar_ (2014), and _Dunkirk_ (2017), and to a lesser extent in _Following_ (1998) and _The Prestige_ (2006) (I haven't seen any of his _Dark Knight_ trilogy so I can't attest to their thematic concerns, and we shall not speak of his remake of _Insomnia_). It's undeniably fascinating to see a tent pole Hollywood production engaging with issues such as entropy, thermodynamics, reversibility and irreversibility, time's arrow, the grandfather paradox, and T-symmetry, all the while keeping proceedings housed firmly within the spy genre (it's a Bond movie in all but name). Indeed, one of the film's central questions is especially noteworthy – if what and who we remember from our past defines who we are in our present, do things that haven't happened to us yet also speak to our identity? Do our future actions determine who we are as much as our past actions? It's a fascinating question. And one with which Nolan does precisely nothing. However, the film's main problems aren't related to the squandered existential potential, the much-ballyhooed complexity, the puzzle-like structure, the philosophical musing, or the thematic similarity to Nolan's previous work. Rather, they are more fundamental, existing almost entirely at a structural level (although some of the performances don't help matters, nor does the abysmal sound mixing). The film looks incredible, the practical effects in the action scenes are extraordinarily mounted, the cinematography is stunning, and the editing is superb, but there simply isn't anything of note under the shiny veneer. It's a film with virtually no interest in human beings.\r\n\r\nThe premise of _Tenet_ is straightforward in outline. The film opens as a CIA operative known only as The Protagonist (John David Washington) infiltrates a team of bad guys looking to find a spy at the Kiev Opera House. He finds the man before they do, but during their escape, he sees something which should be impossible – a bullet seems to travel backwards in space and a bullet hole is \"un-shot\", as if time is reversed for that bullet, even though everything else is moving normally. The Protagonist is able to smuggle the spy outside, but their escape goes awry, and to avoid being captured, he swallows a cyanide tablet. Rather than dying, however, he awakens to be told that he has passed the test to join an ultra-secret international espionage squad known as Tenet. His mission is fairly simply – at some point in the future, someone has figured out how to reverse the entropy of objects, effectively being able to send them back along the timeline without having to reverse time itself. The implications of this are catastrophic and have set humanity on course for World War III, and probable extinction, unless The Protagonist can figure out who is doing it and put a stop to their machinations. Along the way, he makes the acquaintance of Neil (Robert Pattinson), his infinitely better-informed handler; Andrei Sator (a spectacularly miscast Kenneth Branagh giving new meaning to clichéd villainy), a dangerous Russian oligarch; Kat Barton (Elizabeth Debicki), Andrei's oppressed and deeply unhappy trophy wife; Priya (Dimple Kapadia), an arms dealer; Ives (Aaron Taylor-Johnson), a Tenet soldier; Michael Crosby (Michael Caine), a British intelligence bigwig; and Barbara (Clémence Poésy), a scientist specialising in all things temporal.\r\n\r\n_Tenet_ is an event movie in every way; this 150-minute, $200m+ original idea (when was the last time a non-franchise, non-comic book original movie got that kind of budget) is a massive studio tent pole written and directed by the most popular filmmaker alive. And I will say this. The budget is on the screen. Oftentimes, you'll see a movie that's cost a ridiculous amount and you'll sit there thinking, \"they must have spent a lot on catering.\" With _Tenet_, however, it's all there, front and centre. No small amount of that money, of course, must have gone on the practical effects (incredibly, the film has only 280 vfx shots) – whether it be our heroes bungie-jumping onto the side of a building, a close-quarters fight where one of the combatants moves in reverse, a Boeing 747 jet crashing into a building (which was shot for real), a highway chase where some of the cars are going forward in time and others are going backwards, or an all-out battle scene where, again, some of the soldiers travel forward whilst others move in reverse. Even Ludwig Göransson's score gets in on the act, employing only melodies which sound the same whether played backwards or forwards.\r\n\r\nAs cinematic spectacle goes (on a purely visual level), I've never quite seen anything like it. It's one of those films where you'll genuinely be asking yourself, \"how the hell did they do that?\"; a question that's become increasingly rare in our CGI-reliant times. Tenet looks like it was an exceptionally difficult movie to make. Along the same lines, the cinematography by the great Hoyte van Hoytema (_The Fighter_; _Spectre_; _Ad Astra_) is stunning, with van Hoytema mixing 15-perf 70mm IMAX film (shot at 1.43:1; projected at 1.90:1) with traditional 70mm stock (2.20:1) and a few 35mm sequences in a manner where the shifts in aspect ratio are barely noticeable (although I saw it on an IMAX screen; aspects shifts would be more obvious on a smaller screen). It's the kind of film that could only exist in the medium of cinema – no other artform could even begin to approximate its aesthetic design and splendour, and I admire that a great deal. A celluloid purist, Nolan has always made a big stink about the artistic importance of cinema, and _Tenet_ finds him pushing the aesthetic boundaries of what the artform can accomplish, foregrounding innovation in ways that big budget mainstream studio productions simply don't, and celebrating the possibilities it affords those with sufficient enough imagination.\r\n\r\nUnfortunately, no matter how visually unique or aesthetically impressive it may be, no amount of gloss can hide the fact that the screenplay is a turgid mess and suffers from some fundamental problems – most notably, it's bereft of emotion and populated with cardboard cut-outs that are supposed to be characters. The problems start early when The Protagonist is told that the future of humanity depends on his mission. This is precisely when I started to tune out. Any film that declares its story is none-other than saving humanity has gone so big as to render the people who populate its narrative as insignificant. It's also a cliché, it's dull as dishwater, and we've seen it done a million-and-one-times. The idea of saving all mankind simply doesn't pack any kind of emotional punch any more, far better to stay smaller and focus on character.\r\n\r\nWhich brings me to those characters. Good lord, they're badly written. The Protagonist isn't a person with an interiority; he's a cipher, the audience's surrogate so that Nolan can explain the plot to us. But there's nothing more to him – he's utterly emotionless, seemingly void of any kind of relatable motivation, has no psychological through line, and nothing even resembling a character arc. I'm not a huge fan of Washington in general, who I feel has played every part in the same sombre, disinterested manner, so there could be some prejudice at work, but I am a huge fan of Branagh, and he's even worse. Think of the most clichéd Russian villain you've ever seen. Now square that and you'll be some way towards imagining how ludicrous Sator is. He isn't a person – he's a collection of near-satirical tics, clichés, and elements from other, better films. Maybe with a more menacing actor in the role it might have worked, but all I could think whenever he was on screen was \"that accent is hilarious.\" Pattinson's Neil and Debicki's Kat fair better, but neither set the screen alight. Along the same lines, much of the second half of the film hinges on the fact that The Protagonist and Kat find themselves drawn to one another, yet Washington and Debicki have zero chemistry. At a human level, there's nothing to take a hold of the audience, nothing to make us care about any of these people; they're gears in the machinery of Nolan's plot.\r\n\r\nSpeaking of Kat, a common criticism of Nolan's filmography as a whole is that his female characters tend to be victims whose deaths motivate men or who need saving by men, and/or women who define themselves almost entirely in terms of their relationship to men. Now, I'm not saying that Nolan is _obliged_ to write more rounded female characters. He isn't. Much like one of his favourite filmmakers, Michael Mann, Nolan's films are androcentric. And there's nothing wrong with that. However, in Mann, there are to be found strong female characters with considerable agency, whereas in _Tenet_, Kat is nothing more than a pawn in a game played by powerful men who effortlessly control her. She defines herself almost entirely in terms of her role as a self-sacrificing mother, and whilst this is an interesting trait the first couple of times it comes up, by the time Nolan is reminding us of how much she has sacrificed for the 237th time, it had become obvious that this was going to be the extent of her characterisation.\r\n\r\nAt one point early in the film, Barbara tells The Protagonist, \"_don't try to understand it, just feel it_\", which is advice that Nolan is also offering to his audience. The problem is that there's nothing to feel. _Tenet_ is a puzzle, the impenetrability of which will depend on each individual viewer (and how much of the appallingly poorly-mixed dialogue you can make out), but unlike _Memento_ (which remains Nolan's best by a long way), which packed a seriously emotional gut-punch when we finally learn what was at the heart of the puzzle, _Tenet_ offers us nothing more than the task of deciphering it for its own sake. There's a twist towards the end that I literally saw coming from about 10 minutes in, but aside from that, there's no payoff. There's nothing to make us want to penetrate a story that seems more intent on reminding us how clever it is instead of trying to depict real people or establish real emotional stakes; it's a film more enamoured by the complexity of its own design than by any of the people contained within. It's an emotional void – all technical virtuosity and surface sheen with next to nothing at its core.", "created_at": "2020-09-30T03:04:58.741Z"}, {"movie_id": 577922, "review_id": "5fcd9dabd9554b004058cf8b", "author_rating": 10.0, "review_text": "I believe Tenet is very underrated. This movie is just too good! The soundtrack, the action, the plot, the acting, the cinematography, and the fact that CGI wasn't really involved much! \r\n\r\nYet it was indeed challenging to understand. However, after watching Dark, I didn't face much difficulty in understanding the plot, as both have a lot in common.  \r\n\r\nNolan's movies aren't there to satisfy you, they are more of something to be felt. I loved Tenet as much as I loved his other movies...", "created_at": "2020-12-07T03:12:43.498Z"}, {"movie_id": 577922, "review_id": "5fcecb25fba625003e7ca451", "author_rating": 6.0, "review_text": "Been a fan of Christopher Nolan's films but this one didn't quite do it for me. One, confusing story that was hard to follow at times (I got the gist), but beyond that, wasn't terribly entertained. Acting was shaky, Pattison was fine but really disappointed with John David Washington, though he's not helped by cliched dialogue. IDK, didn't hate it at all and maybe will revisit it one day, but this is easily Nolan's weakest film to date. **3.0/5**", "created_at": "2020-12-08T00:39:01.710Z"}, {"movie_id": 577922, "review_id": "5fcefc91c0348b0040131b1e", "author_rating": null, "review_text": "I’m a bit annoyed I couldn’t understand the first twenty minutes because of the bombastic bass and a bit underwhelmed by the lack of an emotional arc, but all things considered, Tenet is an epic, mind-blowing James Bond film masquerading as a Christopher Nolan film. ", "created_at": "2020-12-08T04:09:53.653Z"}, {"movie_id": 577922, "review_id": "5fe7697a1d6c5f003ddf89dc", "author_rating": 1.0, "review_text": "Nolan's latest movie is one of his worst. An exaggerated film whose only purpose is to complicate the viewer, but I wish he could do it with cinema. These ambiguities are created only by the chaotic and crowded montage and a series of theoretical dialogues, and no cinema is seen in it. Also, we do not see any coherent story during the film and the events of the film do not form a script at all. There is no characterization in the film, the protagonist character is not made at all and is not believable, also the other characters are completely caricatured and extra, also during the film and its artificial communication, not a bit of feeling is created. Aside from the fact that the film does not even come close to form, it is also very beginner in terms of technique, excessive cuts, and sometimes weird and inappropriate! The opening and closing sequences of the film are highly artificial, and the final sequence is saturated with a large number of cuts, aerial shots and rudimentary special effects. The only slight positive aspect of the film is its acting, and the acting of the antagonist character is defensible. In general, the film is considered to be a very bad and weak film, which is like a puzzle without a pattern, meaning that after putting the white pieces together, which is not a difficult task, it has nothing to offer.", "created_at": "2020-12-26T16:48:58.066Z"}, {"movie_id": 577922, "review_id": "5ff293a09affc00040f7976d", "author_rating": 10.0, "review_text": "man, oooh maaann\r\n<blockquote>everything bumps into each other.</blockquote>\r\nF*ck. yes, another <i>time sh*t</i> by Nolan. people seem to hate or despute it, but I am enjoyed the film. \r\nthe inverted fight, so much to hit my brain. u might call me Nolan's b*tch but i am. idc. this shit is liiiitttttt 🔥🔥🔥. Also: Washington, Pattinson, and Debicki are sexy af.\r\n\r\nGoransson is good. He did an amazing job. After what he did for The Mandalorian, I'm excited what a sound he would build. What a tone is it. But I wished Zimmer would do that.\r\n\r\nBut yeah there are some other things that failed. The dialogues is hard to hear because of the massive soundtracks. How this film has no emotional core. Yes it's just big spectacle to <i>aroused</i> the <i>hornyness</i> for the (time) plot. Understandable. \r\nI loved it (for the sake of new \"time\" plot from Nolan). Cheers mate 🍻 ✌🏽<blockquote><b><i>time runs out</i></b></blockquote>", "created_at": "2021-01-04T04:03:44.867Z"}, {"movie_id": 577922, "review_id": "602155809979d20040e244a4", "author_rating": 7.0, "review_text": "It was a long time since I watched a new blockbuster movie and, mostly for personal reasons, even longer since I actually reviewed a movie, blockbuster or not.\r\n\r\nI guess this movie is not the most simple one to pick to get my reviews/blogging back on track but there’s not that much new movies to chose from this year with the pandemic and all.\r\n\r\nI have to say that I approached this movie with some hesitation and perhaps with an assumption that I wouldn’t like it since I have an aversion towards time travel in movies and books. It is more often than not that the author gets it more or less spectacularly wrong and it turns into a mess.\r\n\r\nWell, I have to say that, in my mind, this movie was a bit of a mess. I felt confused and found it difficult to follow the various twists more than once. Also, at least in the beginning, the parts about bullets jumping up in your hand instead of falling out because the bullets where travelling backwards in time sounded somewhat unbelievable to me. I can accept something travelling backwards in time but for such a bullet to jump up into someone’s hand, seemingly on command, no I do not think that’s very believable at all.\r\n\r\nOnce I had watched the entire movie to the end, then finally, some of the first parts started to make sense. Personally I don’t like that I spend a large part of the movie wondering what the f… even if it (mostly) becomes clear towards the end.\r\n\r\nHowever, I have to say, it was a quite cool mess.\r\n\r\nFirst of all, I quite like the main protagonist. Whether he’s traveling forwards or backwards he kicks ass and he’s intelligent. He is very much a James Bond type of character which I like.\r\n\r\nThere’s also a shitload of action in this movie and it is both well done as well as cool. Of course, with the budget this movie had I would really be disappointed if there wasn’t good special effects in it. However, one thing that made the effects and action to stand out in this movie compared was this concept that for some people, and objects as well, time moved backwards. Watching some of the larger scenes where some explosions where actually explosions and some where implosions. Cars moving both forwards and backwards in car chases etc. etc. I have opinions about the plausibility of that but it looked cool at least.\r\n\r\nFor me the enjoyment of this movie was the main protagonist which I liked and the cool action. The story itself and its rather convoluted (but original I have to say that) time travel concept, well I’m not sure I was (am) too trilled about that except for the fact that it allowed these rather original special effects.", "created_at": "2021-02-08T15:15:12.865Z"}, {"movie_id": 577922, "review_id": "6116758fe54d5d002674f37e", "author_rating": 7.0, "review_text": "Appreciated this film more than any Nolan film since The Dark Knight. Usually his films aim for high concept but get weighed down by syrupy schmaltz. This one ditches his unconvincing attempts at emotional/philosophical depth and just focuses on the very creative core concept of inverted time. There's no labored soliloquies about the power of love, no epic aspirations of cultural poignancy - it's mainly just a bunch of exposition interspersed between some truly breathtaking visual and audio spectacle like nothing else. \r\n\r\nNolan is an artist first and foremost. His films always have a level of craft that is beyond comprehension for mere mortals like me. And in this one he turns that up to eleven. Honestly, I actually enjoyed the challenging sound design. It reminded me of the film Primer (another time bending mind melter) where the discussions about complicated ideas are drowned out by background noise and music because he knows we won't understand and it's not important anyway. What is important is that we \"feel it\" (as is literally said). \r\n\r\nDon't try to figure it out. Just enjoy that an arthouse abstractionist who somehow gets 100+ million dollar budgets to make quirky stories with set pieces that will blow your mind.", "created_at": "2021-08-13T13:37:19.767Z"}, {"movie_id": 577922, "review_id": "61e325322d93750066ece119", "author_rating": 10.0, "review_text": "‘Tenet’ is clearly Nolan's most ambitious project to date, but the highly packed and complex plot make it difficult to fully enjoy the movies mindblowing rules of time-inversion within a single view.\r\n\r\n8/10", "created_at": "2022-01-15T19:49:06.927Z"}, {"movie_id": 577922, "review_id": "621a8c8692e55b006c2af243", "author_rating": 10.0, "review_text": "‘Tenet’ is clearly Nolan's most ambitious project to date, featuring action scenes we never saw before and with a magnificent score by Göransson. The highly packed and complex plot make it difficult to fully enjoy the movies mind-blowing rules of time-inversion within a single view, but the interesting physics and temporal consequences leave you pondering until long after the credits, in which the movie grows on you, making multiple watches irresistible.\r\n\r\n10/10", "created_at": "2022-02-26T20:24:38.172Z"}, {"movie_id": 577922, "review_id": "62c6255c05b549004f3d6028", "author_rating": 3.0, "review_text": "Tenet on paper is a super interesting that I think I would have a great time with, but the execution fell flat on its face. The entire plot is so purposefully convoluted that it is really hard to follow. Christopher Nolan whips from one scene to another so fast to cram as much exposition in that so many moments just got right over the audience's head. Half the scenes are just exposition dumps with audio so poorly done that you have to read the subtitles the entire time to even understand what they're saying. The acting is all fine in this movie, but I spent so much time trying to understand the film that any mishaps could have gone right over my head. The only redeeming aspect of this film is the fights and heists. These scenes were filmed with incredible precision that really showed off the scope that the protagonist was trying to accomplish. I had a good time with that, but that was few and far between.\r\n\r\n**Verdict:** _Poor_", "created_at": "2022-07-07T00:14:20.908Z"}, {"movie_id": 577922, "review_id": "641bde0595c0af0084eb8921", "author_rating": 8.0, "review_text": "Christopher Nolan is a crazy and insane person. There is no dispute about this. What Nolan is trying to convey to the viewers is an adventure that is difficult to imagine on your own. It is also difficult to imagine its events and facts. It is also difficult to photograph many moments. Fear that my mind will be distracted by this wonderful drama.\r\n\r\nThe story of the film is about the attempt of some people to stop the end of the world. This person is known in this film as the Protagonist, as he does not know anything about the mission or how to end the world except for one word, which is Tenet, and the meaning of this word will appear through the events of the film, but frankly, the aesthetic of talking about this film lies In penetrating the events and talking comfortably about the events of the movie.\r\n\r\nThe photography was aesthetic with things that neither the mind nor the eye could have expected while you were sitting in front of the screen. The photographic ability in this film exceeded many stages and reached a stage of dazzling. It exceeded the choice of angles or even the duration of the shot. We have different dimensions and a new method in how to photograph.\r\n\r\nThe aesthetic of the story is not in asking ourselves what the story is. The aesthetic of the story is in how the story is told and explained. The narrative of the story and the photographic capabilities greatly exceeded the events of the story and anything else in the film, where scientific and physical facts and theories were used that greatly assist in storytelling. They greatly help in explaining the events and how they pass. Events and these scientific theories and physical facts that boggle your mind and drive you crazy have made my eyes stop closing while my time to sleep came.", "created_at": "2023-03-23T05:05:09.755Z"}, {"movie_id": 577922, "review_id": "652a8fb4024ec800e4448c4a", "author_rating": 6.0, "review_text": "Fine, but next time with subtitles.", "created_at": "2023-10-14T12:55:16.997Z"}]