[{"movie_id": 76338, "review_id": "5337c1079251417d9e00220d", "author_rating": 9.0, "review_text": "There have been plenty of movies based on classical cartoon superheroes that have been poorly implemented and with a lousy story. Luckily this one is not one of those. This was really a very enjoyable movie and I liked this movie a lot better than the first Thor movie which I felt was mostly silly.\r\n\r\nThis one has a story which was rather okay and held somewhat together. You have to remember that this is a comic book hero and the story is on that level of course. The special effects and the scenery is really nice as well. The views of Asgard is cool, almost breathtaking.\r\n\r\nAnthony Hopkins was excellent as Odin or Oden has he is called in Sweden, my country of birth. Tom Hiddleston is also very good in his role although I have to say that I really do not like his role but then he is supposed to be one of the bad guys so… Chris Hemsworth is good enough in his role but I would say that he is really the weakest ones in terms of acting.\r\n\r\nThe movie is liberally sprinkled with jokes as well and, thankfully, most of them are not too bad. Although a bit silly I have to say that I did laugh when Thor politely hung Mjölnir on the clothes rack in the apartment with Darcy and Dr. Selvig.\r\n\r\nOn the whole I enjoyed this movie tremendously.", "created_at": "2014-03-30T07:00:23.624Z"}, {"movie_id": 76338, "review_id": "545fe448c3a36853580095f9", "author_rating": 6.0, "review_text": "More of the same. Predecible non elaborated script and with a total lack of sense of humor.\r\n\r\nThe FX are, again, OK, but the feeling of swords, axes, armors and helmets is of cheap plastic.", "created_at": "2014-11-09T22:01:44.996Z"}, {"movie_id": 76338, "review_id": "58ac553492514158c0015059", "author_rating": 9.0, "review_text": "Watching Thor: The Dark World tonight, I got the feeling that Hollywood might have finally figured it out. In theory, a sequel should always surpass its predecessor, although as we all know, many have tried and famously failed. But a new trend seems to finally be breaking through. X2 was better than X-Men. Spider-Man 2 was better than the first. And now that I've seen it, I can tell you Thor: The Dark World… is better than Thor. (And the fact that these are all Marvel productions, that's food for anther discussion.)\r\n\r\nI thoroughly enjoyed Thor, directed by Kenneth Branagh, when I only saw it for the first time just this spring. In fact, I watched it again the same week. Which is saying enough to imply that my hopes were high for the sequel. So I was really looking forward to tonight and I was not disappointed.\r\n\r\nThor 2 was helmed by a different director, Alan Taylor, which typically always spells trouble in my book when they change the director, but I take my hat off to him. What I admire is that he managed to capture the tone that Branagh set in the first film flawlessly – even perfected it in a way. He brings to the table a duality which almost never works successfully in any film, but here, does so perfectly: Taylor made Thor 2 notably darker, yet at the same time more humorous. I take my hat off to the writers as well – they put in a ton of great jokes, all at the exactly right moment. Had this been done even a fraction less tactfully, the film would have sunk like a bag of bricks, like so many others have. I found myself (and the audience) laughing my butt off one moment, and feeling very serious and engaged with the on-screen emotions the next. Even when it happened abruptly, it still never felt inappropriate. Now that's good entertainment. Two thumbs up.\r\n\r\nThe actors all wear their roles like a custom-made suit. It's obvious that Chris Hemsworth has really grown into his character, third time around. This guy IS Thor, hands down. The same goes for all the other actors, they were all perfectly comfortable in their roles and respective environments. The one that intrigued me most, however, was Loki – personified absolutely magnificently by Tom Hiddleston. Much like Hemsworth, it seems he was born to play this role. He captures all the slyness, all the arrogance and all the torment of a man almost unable to bear the weight of his own ego in a single flicker in his eyes. And then that grin… Perfection. The way Hiddleston plays Loki is strangely captivating. You know he's totally wicked and cannot be trusted, yet at the same time you can't help but really like him – you might even end up rooting for this guy, and I'm not sure many other actors would have managed this.\r\n\r\nAll the special effects were as good as one should expect them to be these days. I have nothing much to say there, except that it was all terrifically eye-pleasing, and Asgard looked even more beautiful than before. It was all convincing and very well done. \r\n\r\nStill, I have not completely explained why T:TDW is better than the first. Actually, I might not fully be able to. It's mostly a feeling. As much as I was entertained the first time, I was even more entertained now. It was more action-packed, more exciting, darker and it just had a great deal more adrenaline. \r\n\r\nThe only thing that I think was weaker in this film, was the character of Jane Foster. Her character was just less interesting, kind of blank. I actually don't remember much of her at all, except that she slapped Thor a couple of times and she had all this creepy stuff coming out of her… Also she was somewhat of a damsel-in-distress most of the time with the look of a scared kitten on her face, and that's not exactly how we like to see our ladies nowadays. It's so common to see women being perfectly independent now, that it's a little weird to see a grown woman with \"three degrees in physics\" (as Darcy so poignantly points out) scared and shivering like a little girl. Most of the time, Natalie Portman just didn't carry her scenes very strongly, and that's strange coming from such a fine actress. So maybe one of the actors was actually a little out of place after all, thinking about it. \r\n\r\nHaving said that, that's pretty much my only complaint. Every other element in this film was very solid, the story was very good and they absolutely nailed the pacing. Those two hours went by in the blink of a eye. \r\n\r\nThor: The Dark World is wonderfully entertaining and a definite must-see for every Marvel fan. In fact – at the risk of enraging the Marvel Gods – this might just be pretty stiff competition to X-Men… Watch out Wolverine, I think I have a new favorite superhero.\r\n_(November 2013)_", "created_at": "2017-02-21T14:56:52.014Z"}, {"movie_id": 76338, "review_id": "59f29eab925141229f0042fc", "author_rating": 7.0, "review_text": "**A long format review from 2013**\r\n\r\nDespite a virtually non-existent (comparatively) promotional campaign for Marvel’s latest effort, Thor: The Dark World has crushed its competition box-office-wise. Though receiving less critical acclaim than Captain Phillips or Gravity, it did clean up in the finance department.\r\n\r\nI’ve made no secret of the fact that in the MCU, my favourite Avenger is Thor, so a new film was always going to be an easy ticket from me. And I can’t work out if that bias is making me more critical of the film because I care so much, or less because I’m just happy it got made? I’ll try to be as above board as possible.\r\n\r\nThor 2 is a spectacle, make no mistake. It has the appropriate mix of explosions, attractive people, monsters, humour, fighting, mesmerising visuals, sweet symbolism and heart-wrenching sorrow that can be expected from a decent super hero film. But beyond that, it doesn’t really have much.\r\n\r\nI know it sounds like it has a lot, and it honestly does, but I just couldn’t help feeling in a quite a number of moments that the thing felt hurried. Maybe if there wasn’t such a mad rush to get a Thor sequel out by the end of 2013, they could have spent a little more time fleshing out and filling in the script (not that it’s a short movie, I mean the pre-production feels rushed) and better utilising director Alan Taylor (Game of Thrones, Rome, Carnivale). There was a hint of the generic, amongst this otherwise splendid film.\r\n\r\n73%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:49:15.907Z"}, {"movie_id": 76338, "review_id": "5c8426b9c3a3684e98da8cfb", "author_rating": 4.0, "review_text": "Thor: The Dark World represents all of the MCU's worst tendencies: shoehorned humour at the expense of good scenes, a cookie cutter underdeveloped villain, and an over reliance on big outlandish explosions. It doesn't help that the story is also convoluted and lame, made even worse because it introduces the second infinity stone.\r\n\r\nAll in all, Thor: The Dark World is not a terrible movie. It's just far more cliché than its predecessors, and that's disappointing.", "created_at": "2019-03-09T20:48:57.156Z"}, {"movie_id": 76338, "review_id": "5dc3300f8d22fc00123ca0aa", "author_rating": null, "review_text": "I don't understand all the hate surrounding this movie. I loved every bit of it and somehow, to me, it feels like this was even better than its predecessor. Better CGI, a darker, sci-fi fantasy plot and improved action sequences make it a truly great sequel to the first film.", "created_at": "2019-11-06T20:41:51.718Z"}, {"movie_id": 76338, "review_id": "5dc38a309d8939001834aea6", "author_rating": null, "review_text": "Action sequences aside, this movie was a great sequel to the first film. So much character development for Thor and I just love how he reunites with the crew from \"Thor,” especially with Jane.", "created_at": "2019-11-07T03:06:24.744Z"}, {"movie_id": 76338, "review_id": "5dc39386470ead00158d2705", "author_rating": null, "review_text": "One of the first Marvel movies I watched and though I don't know a lot yet about him, I can say that Chris Hemsworth plays Thor quite well.", "created_at": "2019-11-07T03:46:14.427Z"}, {"movie_id": 76338, "review_id": "5dc39970470ead00188d6f7f", "author_rating": null, "review_text": "Not as good as the first one. I had my hopes up the whole time as I was able to enjoy the first one,  but I guess it really is true that sequels always do worse than the originals.", "created_at": "2019-11-07T04:11:28.446Z"}, {"movie_id": 76338, "review_id": "5dc56ea97d2bc100113ff682", "author_rating": null, "review_text": "Not as Thor-y as the first one but definitely gives Thor some character development which, let's all agree, he needs in order for him to establish better his role as one of the main heroes in The Avengers.", "created_at": "2019-11-08T13:33:29.170Z"}, {"movie_id": 76338, "review_id": "5dc57a14470ead0018907013", "author_rating": null, "review_text": "Didn't enjoy it as much as the first one but watched it for the sake of keeping up with the timeline and making sure I wasn't missing any information critical to understanding the next Avengers movie coming out.", "created_at": "2019-11-08T14:22:12.083Z"}, {"movie_id": 76338, "review_id": "5e00ee9565686e0013987f71", "author_rating": null, "review_text": "Although acting was solid and the production value was still through the roof, I wasn't able to enjoy the movie. Probably because everything else sucked.", "created_at": "2019-12-23T16:43:01.701Z"}, {"movie_id": 76338, "review_id": "5e01027165686e0015979506", "author_rating": null, "review_text": "What happened to the deep story and intelligence that was portrayed in the first Thor film?", "created_at": "2019-12-23T18:07:45.810Z"}, {"movie_id": 76338, "review_id": "5e011b4aa6d93100134bf7cc", "author_rating": null, "review_text": "If you're wondering why Thor: The Dark World is a title you're not familiar with, it's because you should just stay away from it.", "created_at": "2019-12-23T19:53:46.920Z"}, {"movie_id": 76338, "review_id": "5e02866065686e00189b19e1", "author_rating": null, "review_text": "Boring,a typical plot of everyone else just relying on the main superhero to save the day.", "created_at": "2019-12-24T21:42:56.180Z"}, {"movie_id": 76338, "review_id": "5e08ff99d236e60012a25d53", "author_rating": null, "review_text": "Just stay away from this film. You'd be wasting your time. Mindless, boring plot with lazy writing.", "created_at": "2019-12-29T19:33:45.645Z"}, {"movie_id": 76338, "review_id": "5e092085d236e60012a2b0cf", "author_rating": null, "review_text": "You can clearly see that they got lazy with the writing on this one. Big insult to superhero fans and just Thor in general.", "created_at": "2019-12-29T21:54:13.791Z"}, {"movie_id": 76338, "review_id": "5e09b874635e780018411d82", "author_rating": null, "review_text": "Marvel flopped! Probably their worst film for 2013. It was annoying and everything was just all over the place!", "created_at": "2019-12-30T08:42:28.861Z"}, {"movie_id": 76338, "review_id": "5e0e0c9012c60400143f8baa", "author_rating": null, "review_text": "Still not a bad film. I personally enjoyed it more than the first Thor movie, but still not comparable to other Marvel films.", "created_at": "2020-01-02T15:30:24.912Z"}, {"movie_id": 76338, "review_id": "5e0e16a412c60400173fc0d1", "author_rating": null, "review_text": "The main villain was not that great but I don't think that destroyed the entire movie. There were still some great scenes and the storyline wasn’t all that bad.", "created_at": "2020-01-02T16:13:24.320Z"}, {"movie_id": 76338, "review_id": "5e0e20d16dc6c000184d1cab", "author_rating": null, "review_text": "Most of the characters from the first Thor film stayed the way they were - one-dimensional. With exception to Loki, everyone else played subpar.", "created_at": "2020-01-02T16:56:49.595Z"}, {"movie_id": 76338, "review_id": "5e0e2a2612c60400173fe022", "author_rating": null, "review_text": "Although it was not as fun and light as the Avengers films, there were still some points that were great. One was how they depicted Asgard - it was plain beautiful. Another was how they wrote the script and the way Asgardian people talked.", "created_at": "2020-01-02T17:36:38.571Z"}, {"movie_id": 76338, "review_id": "5e0e40da6dc6c000154cfe2d", "author_rating": null, "review_text": "I loved it more than the first! The action scenes and plot was  better. The acting was fantastic and there was enough banter to keep it from getting too dark.", "created_at": "2020-01-02T19:13:30.900Z"}, {"movie_id": 76338, "review_id": "5e0e52c7549dda0018a737fb", "author_rating": null, "review_text": "I'm just gonna go ahead say it: this is a waste of time.", "created_at": "2020-01-02T20:29:59.645Z"}, {"movie_id": 76338, "review_id": "5e0f093968188800125945a1", "author_rating": null, "review_text": "It's a good thing they did great on the first Thor film because this one sucked! At least they'll get one more chance to redeem themselves.", "created_at": "2020-01-03T09:28:25.336Z"}, {"movie_id": 76338, "review_id": "5e0f343c58361b0015bfbf13", "author_rating": null, "review_text": "I'm a big Marvel fan but even I can't deny the fact that this film is absolute garbage.", "created_at": "2020-01-03T12:31:56.408Z"}, {"movie_id": 76338, "review_id": "5e1076246f43ec00165a43e6", "author_rating": null, "review_text": "Now I know why no one is talking about this film - it's plain garbage.", "created_at": "2020-01-04T11:25:24.433Z"}, {"movie_id": 76338, "review_id": "5e1214d3d8af670012bce0b7", "author_rating": null, "review_text": "I didn't love this movie but I didn't hate it either. Still decent but Marvel can definitely do better than this.", "created_at": "2020-01-05T16:54:43.603Z"}, {"movie_id": 76338, "review_id": "5e124a0dd64ac20016643a1c", "author_rating": null, "review_text": "One of the first Marvel movies I've seen so I wouldn't know a lot but I definitely liked the first one better than this.", "created_at": "2020-01-05T20:41:49.747Z"}, {"movie_id": 76338, "review_id": "5e125bcfd64ac2001864d4a9", "author_rating": null, "review_text": "It's too bad they weren't able to replicate the success they had with both the Iron Man and Captain America films. Thor had so much potential!", "created_at": "2020-01-05T21:57:35.865Z"}, {"movie_id": 76338, "review_id": "5e12c5ed5907de0017df9883", "author_rating": null, "review_text": "Sure it's funny but now it feels like Thor is aimed to please kids. It's understandable though because that's the biggest audience right now and a studio has to make money.", "created_at": "2020-01-06T05:30:21.487Z"}, {"movie_id": 76338, "review_id": "5e12ca05fc5f06001590a71a", "author_rating": null, "review_text": "The movie pacing was too fast. I wasn't able to fully comprehend what was going on. Then the story became totally predictable at one point. I am disappointed.", "created_at": "2020-01-06T05:47:49.268Z"}, {"movie_id": 76338, "review_id": "5e12cdf9d64ac2001865e1d8", "author_rating": null, "review_text": "Marvel has produced a lot of films that are watch-worthy, but not this one.", "created_at": "2020-01-06T06:04:41.331Z"}, {"movie_id": 76338, "review_id": "5e12d2055907de0014dec5e1", "author_rating": null, "review_text": "Marvel should not have tried so hard to give Thor a darker tone. That's DC's job, not theirs.", "created_at": "2020-01-06T06:21:57.993Z"}, {"movie_id": 76338, "review_id": "5e20d60acf4b8b0017ef0a06", "author_rating": null, "review_text": "It would've been better if they gave us more information about the bad guy. Sure he's just another villain but a back story would've still been great.", "created_at": "2020-01-16T21:30:50.148Z"}, {"movie_id": 76338, "review_id": "5e20df8120af77001437778e", "author_rating": null, "review_text": "If you took out the other main characters, like Jane for example, this film would've still made sense. Everything was a mess!", "created_at": "2020-01-16T22:11:13.775Z"}, {"movie_id": 76338, "review_id": "6003a7426aa8e0003d7b7595", "author_rating": 9.0, "review_text": "One of my favourites from the MCU's opening eight releases. Judging by that average rating: Shows what I know, eh?\r\n\r\nI seriously enjoyed <em>'Thor: The Dark World'</em>, with it not only surpassing its predessceor from 2011 but all bar <em>'Captain America: The First Avenger'</em> in the MCU thus far also. Each to their own, as always, but I found it great.\r\n\r\nLoved the score, one of the more memorable ones from the Marvel Cinematic Universe at this point. I also found the pacing to be near perfect, while the humour fits very well.  The plot is entertaining.\r\n\r\nChris Hemsworth is great as Thor, while Natalie Portman gives a performance worth noting - unlike in the original. I admit I wasn't overly happy to see Tom Hiddleston appear again, given his character isn't good enough to be in three MCU films, but he is satisfactory here. The rest of the cast are solid, too.\r\n\r\nI thoroughly enjoyed it, what can I say?", "created_at": "2021-01-17T02:56:02.322Z"}]