[{"movie_id": 970948, "review_id": "6545d53e6beaea012c8dd893", "author_rating": null, "review_text": "A true rom-com for grown-ups. \r\n\r\nYou'll have to forgive me for the length of this. I'd written a solid 500-ish words explaining everything about this and then one errant cat step on a mouse and here we are: a new tab with the old review gone for good. \r\n\r\nThis feels like it's from an alternate reality where Gerard Butler didn't kill of rom-coms in American cinema in the 2010s and, instead, the field got to thrive like its 90s heyday. \r\n\r\nDuchovny and Ryan are charming as hell, which is to be expected in a movie that's literally just three credited people. The two of them, plus the person voicing the airport's PA system. \r\n\r\nGiven this is a rom-com directed by Meg Ryan, queen of the 90s rom-com, and it's dedicated to Nora Ephron, even the simple premise of \"two people who used to love each other are snowed in at a regional airport\" is given a little heightened reality juice. \r\n\r\nWhile Ryan is not above getting cheesy with it (the airport is basically sentient in how the 'magic' of the day keeps both characters together), the movie also shows some truly adult restraint. It doesn't just give you what you expect from a rom-com for free. There's a maturity to it all. \r\n\r\nI think the best compliment I can give this movie is it's like a good play where the actual sets seem to melt away. As you learn more about both characters, the more they tell stories, and because it's frigging Meg Ryan and David Duchovny they have the chops to capture you into those stories to the point you feel like you saw it happen in a flashback. \r\n\r\nAn absolute blast to watch. I hope it performs well enough to show trimming the fat off a budget and just making a damned good romantic comedy is both possible and profitable. A solid 9/10. I can't wait to get a physical copy, put it on a shelf, and treat myself to a rewatch every few months when the genre winds blow in the right direction.", "created_at": "2023-11-04T05:23:10.566Z"}]