[{"movie_id": 663712, "review_id": "634e9e33d100b6007f94eae6", "author_rating": 6.0, "review_text": "_Terrifier 2_ is a massive improvement over its parent film but doesn't quite do enough to move the needle for me. From the get-go, this films tone and quality is drastically superior to the previous entry. The writing gives characters room to develop, and audiences can actually grow attached to characters in way that was blatantly absent from the first film. I enjoyed the added lore for Art that was sprinkled throughout, adds a level of depth to the newly founded horror icon. The writing allows for much more creative kills and set pieces, with the story taking place across an entire town rather than one claustrophobic apartment building. But with all those improvements, there are still lingering problems that carried over from the first film. Actor performances were all over the board. Some actresses were really compelling and honestly shocked me for the indie type feel of the film. Some notable highlights for me were the lead actress _Lauren LaVera_, _Kailey Hyman_, and _Elliott Fullam_. But other performances were legitimately bad, it felt like I was watching a high school drama production. There are some major pacing problems, for starters this movie is almost 2.5 hours long. There is no need for a runtime this long, there is so much fluff in here that it really bogs down the flow of the film. This movie does a better job of adding suspense to its scenes but is too reliant on blood and gore to get its gasps from the audience. I normally am one to appreciate when a movie goes above and beyond in the gore department, but this movie went overboard. So many scenes had be physically ill due to the graphic content. Sometimes less is more and that is for sure the case here. Despite its flaws, this is a great next step for this small-time studio and with the success at the box office there will surely be a sequel where Dameon Leone has the opportunity to craft a real top notch horror film.\r\n\r\n**Score:** _63%_ |\r\n**Verdict:** _Decent_", "created_at": "2022-10-18T12:38:11.559Z"}, {"movie_id": 663712, "review_id": "63dc5bb6ce5d82008e07bdc0", "author_rating": null, "review_text": "I liked the first Terrifier movie better. This one just seemed to be an excuse to show blood and gore and there was a lot of wasted time on dream sequences (or, rather, nightmares).\r\n\r\nArt the Clown is as creepy and vicious as ever but there's just not enough story to support the very long running time (it's over two hours!).\r\n\r\nNot recommended.", "created_at": "2023-02-03T00:56:22.888Z"}, {"movie_id": 663712, "review_id": "6429156960975000770e75e7", "author_rating": null, "review_text": "David Howard Thornton is back as Art the Clown in Damien Leone’s Terrifier 2. Art is resurrected and sets his sights on a brother and sister on Halloween. I couldn’t wait to watch this!\r\n\r\nPositives:\r\n\r\nThe kills. Very brutal and gory. I would say bloodier than the first. \r\nI think there is more of a story than in the first Terrifier. More character development with the brother and sister.\r\n\r\nNegatives\r\n\r\nI think 2 hrs 18 mins is way too long. I feel that in the middle it was a little slow and could have been cut.\r\nI was hoping for more of a backstory of Art the Clown but they spent more time on the brother and sister than him.\r\nDoes Terrifier 2 fit into the Terrifier franchise? Yes. If you enjoyed the first movie you should watch Terrifier 2. If you were on the fence about the first one, check this one out. If you don’t like blood and gore, pass on this movie.\r\n\r\nRating:  3/5", "created_at": "2023-04-02T05:40:57.185Z"}]