[{"movie_id": 809787, "review_id": "6444c9f2d35dea7570fbeb58", "author_rating": 2.0, "review_text": "It may still be early in the year, but “Mafia Mamma” is a definite contender for worst film of 2023. This vapid comedy (from director Catherine Hardwicke) feels like it was crafted by a soccer mom groupthink, with a ridiculous fantasy story that’s struggling to be hip and edgy. It’s a truly terrible movie that’s a complete waste of time for everyone but those who have the absolute lowest of low standards when it comes to their choice of entertainment.\r\n\r\nLike most women, American mom Kristin (Toni Collette) has a lot on her plate. She keeps her home running despite dealing with the double emotional punch of her son going off to college as well as discovering that her cheating husband is having an affair. Things aren’t going so well when she gets a mysterious phone call with a shocking message: she has inherited her grandfather’s mafia empire in Italy. Guided by the firm’s consigliere (Monica Bellucci), Kristin must gain the self-confidence to become the new leader of the (mafia) family business.\r\n\r\nAdmittedly, the fish-out-of-water premise is a good one. The story outline is fine, but the execution is a debacle. Although they are working within a very broad parameter of mass appeal, the screenwriting trio’s (Amanda Sthers, J. Michael Feldman, and Debbie Jhoon) script feels like a struggle to stay above water. The writing talks down to the audience and narrative includes dumb scenarios that feel like a sad sack’s fantasy (the worst being a hunky local guy (Giulio Corso) who is instantly smitten by Kristin the second she lands in Rome, and the eventual “twist” that anyone with half a brain can see coming from a mile away). It’s also filled with tired Italian stereotypes and has such a strong desire to be a “cool and different kind of comedy” that it earns an R rating with bloody violence and a bunch of cursing.\r\n\r\nEven worse is Collette’s performance, which is an overblown exercise in desperation and overacting. Her take on the timeworn goofy, gullible American shtick feels like a huge stretch, to the point where her character becomes a weak caricature of a real woman. Kristin is a complete clown, even in a film that is trying (but not exactly succeeding) to tell a story of female empowerment. It’s a tragic waste of Collette’s talent. She is so much better than this.\r\n\r\nI can’t think of anything positive to say about “Mafia Mamma.” Even your worst enemy deserves better.\r\n**\r\nBy: Louisa Moore / SCREENZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T06:02:26.875Z"}, {"movie_id": 809787, "review_id": "649d5cfcc072a2012e23976f", "author_rating": 1.0, "review_text": "A completely stupid comedy.\r\nIt could have been an excellent film for having almost all the conditions for it. Scenography, photography, etc, etc.\r\nCatherine Hardwicke's direction is embarrassing.\r\nA senseless cinematographic expense, where it would have had the possibility of being a pleasant comedy and it is not for being \"silly\". it is a pity.\r\nSCORE: (0 to 10) : \"2\"\r\n-------------------\r\nUna comedia completamente estúpida. \r\nPodria haber sido una excelente película por tener casi todas las condiciones para ello. Escenografía, fotografía,etc,etc. \r\nLa dirección de Catherine Hardwicke da verguenza.\r\nUn gasto cinematográfico sin sentido, donde hubiese tenido la posibilidad de ser una comedia agradable y no lo es por ser \"tonta\". es una pena.\r\nCALIFICACIÓN: (0 a 10) :  \"2\" .-", "created_at": "2023-06-29T10:29:16.723Z"}]