[{"movie_id": 667216, "review_id": "63daad7da9117f00b2ecfdf6", "author_rating": 8.0, "review_text": "Infinity Pool is a horny, horrifying look at ego and self-indulgence based on self-doubt and failure. The film follows novelist James Foster (Alexander Skarsgard) as he is mesmerized by Gabi (Mia Goth) resulting in a stained week of violence and debauchery. \r\n\r\nThe plot is a story of two halves, the first being incredibly strong as the audience is learning the mystery behind the experiments, guests and their past. Viewers can resonate a ton with Foster's wife as she is constantly neglected and misused by her husband. That is ever apparent in the shot selection as she is constantly out of frame or unfocused. This part really worked for me, but as the story progressed the scope grew too large for its own good. The ending becomes unfocused, resulting in aspects that do not make sense or are incredibly unbelievable in the world that the film has set up.\r\n\r\nThe film has fantastic cinematography though, filled with interesting visuals that create for a very unique and chaotic viewing experience. Every shot is calculated and filmed in an interesting way that creates suspense and uncomfortable feelings.\r\n\r\nThe performances are superb, Mia Goth has found her niche in the \"elevated\" horror genre becoming a modern-day scream queen. Although, after X, Pearl, and now Infinity Pool, I would like to see her do some more diverse work, but she has nailed this type of character. Alexander Skarsgard is also great with some emotionally engrossing scenes mixed with cold, emotionless scenes that create an interesting dichotomy for the characters headspace.\r\n\r\nAlthough the film slightly stumbles towards the end and might have a bit of a bloated run time, there is still a ton to enjoy with a creative story, mind bending cinematography, and powerhouse performances.\r\n\r\nScore: 77%\r\nVerdict: Great", "created_at": "2023-02-01T18:20:45.795Z"}, {"movie_id": 667216, "review_id": "63dfa3f48741c4007db08ddb", "author_rating": 8.0, "review_text": "_Infinity Pool_ is an eccentric sci-fi horror filled with disturbing sex, crazy amounts of ultra-violence, and a sequence where Mia Goth breastfeeds Alexander Skarsgard. It’s super weird and obviously a different type of film that won’t appeal to the typical mainstream blockbuster crowd.\r\n\r\nThe film takes an interesting detour into what defines gluttony and to what extremes humans will undergo in order to feel hungry again when their stomachs are already bloated from overeating. Ambiguously haunting with bloodcurdling sensuality, _Infinity Pool _is not for the squeamish and yet such an impressive and bourgeois bloodbath for those who admire unusually unsettling cinema.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/02/01/infinity-pool-review-replicating-the-sins-of-the-new-flesh/", "created_at": "2023-02-05T12:41:24.479Z"}, {"movie_id": 667216, "review_id": "63f68de769c70f009ea55b3f", "author_rating": 5.0, "review_text": "Infinity Pool presents a fascinating concept that is both original and intriguing. The movie follows a storyline that is similar to The Purge, but with a twist. In this movie, there are no consequences for the wealthy elite, which is a unique and thought-provoking concept.\r\n\r\nHowever, the movie loses its way quickly, and the storyline becomes too bizarre for its own good. The events that unfold towards the end are confusing, and there seems to be no clear message to take away from them.\r\n\r\nThe actors' performances are commendable, and the production values are excellent. The visual effects and cinematography are well-executed, but unfortunately, they cannot compensate for the muddled and confusing storyline.\r\nOverall, Infinity Pool is an interesting idea, but the execution leaves a lot to be desired. The movie is too convoluted and lacks a coherent message, leaving the audience feeling unsatisfied. Despite some of its strengths, this movie is ultimately a miss.", "created_at": "2023-02-22T21:49:27.678Z"}, {"movie_id": 667216, "review_id": "641d3bdce0ec51008154e8a4", "author_rating": 6.0, "review_text": "This one's a good watch if you are not expecting something monumental. A descent rollercoaster of a watch to escape momentary boredom.", "created_at": "2023-03-24T05:57:48.274Z"}, {"movie_id": 667216, "review_id": "641ebe8e253fab007c822b0c", "author_rating": 6.0, "review_text": "Struggling writer \"James\" (Alexander Skarsgård) and his wealthy wife \"Em\" (Cleopatra Coleman) are having a vacation on an exclusive island resort where they encounter the enigmatic \"Gabi\" (Mia Goth) and \"Alban\" (Jalil Lespert). A trip outside their compound together ends in a rather drunken tragedy and to the most peculiar of government-backed solutions to a problem that could well have seen the ritual slaughter of \"James\". That's quite intriguing, but the rest of this recycles that theory as an increasingly debauched and unentertaining series of scenarios are played out in front of us, presumably in order to illustrate a range of human frailties and issues with confidence and self-belief. There is one rather amusing scene with Goth on the bonnet of her car towards the end, but the remainder of this is just a rather messy, drug infused, meander of a story that left me wondering why it went on for almost two hours. At times the writing is quite smart, but all too infrequently to sustain this thinnest of stories and by midway through I could honestly say that I couldn't have cared less about any of them - even if Skarsgård does have a nice ass. I suspect you will either love or hate this, there were people at the screening who laughed, others who left - I was probably more on the side of the latter. Certainly no need at all to watch on a big screen.", "created_at": "2023-03-25T09:27:42.438Z"}]