[{"movie_id": 580175, "review_id": "5ffcdaa047c9fb003e797f3b", "author_rating": 8.0, "review_text": "'Another Round' reminds us not to ignore our youthful dreams and encourages us to soar. A supremely charming effort by Thomas Vinterberg, I weep for the inevitable American remake that reunites the cast of 'Old School' or 'Tag' or something.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-another-round-what-a-beautiful-beautiful-ride", "created_at": "2021-01-11T23:09:20.558Z"}, {"movie_id": 580175, "review_id": "62418e09f85958008c2ee93d", "author_rating": 7.0, "review_text": "As a 50-something man who worked in television for thirty-odd years, I wondered what all the fuss was about. So these gents have only just discovered what we've all known for aeons - a modicum of alcohol, administered responsibly and frequently enhances cerebral efficiency. No S**t Sherlock... Well, in this case these Danish teachers decide that their careers - and lives in general - are in need of a little pepping up, so they embark on an ostensibly \"scientific\" programme to measure enhanced (?) performance against increased blood alcohol levels. What ensues is a thoroughly enjoyable watch with a truly on-form Mads Mikkelsen and his colleagues pushing their new found challenge to the limits - challenging and compromising just about every relationship - both personal and professional - in their search for an improved life/career. As with most successful drama, the effects of their frankly reckless behaviour are exaggerated from time to time and the underlying dangers of their new-found philiopsphy are not ignored (well, not entirely, anyway) but this is essentially a feel good film that does touch on the effects of alcoholism and of addiction more generally, but is still a jolly enjoyable watch that allowed me to (s)wallow in a pre-kale smoothie nostalgia that facilitated a collegiate and collaborative way of working that has now, largely, gone the way of the dodo or zoom. I am certain that many in the medical profession will have many, many good reasons why this film may be irresponsible or guilty of glorifying alcohol, but it worked for me - and I think the last few scenes on the harbour are as joyous a piece of cinema as I've seen in a very long while. Skol!!", "created_at": "2022-03-28T10:29:29.281Z"}, {"movie_id": 580175, "review_id": "6533c2d1c8a5ac00ac388c23", "author_rating": 7.0, "review_text": "<em>'Another Round'</em> is good.\r\n\r\nThe plot is a little predictable and its message ends up being pretty standard, with it very much being the performances that elevate this flick up for me. I found the characters cringey a few times as they act like teenagers rather than fully grown adults around alcohol, though I can appreciate what the film was going for. What wasn't cringe, however, was Mads' dancing - chapeau!\r\n\r\nI've watched a lot of Mads Mikkelsen and a fair bit of Thomas Bo Larsen lately and found them to be highly reliable performers and here is thankfully no different, I really enjoyed them as actors throughout this 2020 release. The others merit props too, namely Magnus Millang and Lars Ranthe.", "created_at": "2023-10-21T12:23:45.082Z"}]