[{"movie_id": 170, "review_id": "59393624c3a368783f00f92a", "author_rating": 7.0, "review_text": "**mild abstract spoiler ahead**\r\n\r\nMy feelings about this movie may very well be extended towards Boyle's movies in general : solid direction overall, but events did not fail to go from situational and behavioral realism to sudden heroical action nonsense.", "created_at": "2017-06-08T11:33:56.051Z"}, {"movie_id": 170, "review_id": "5d9271990f5265001ac3baaa", "author_rating": 9.0, "review_text": "It started off as rioting. But right from the beginning you knew this was different...\r\n\r\n28 Days Later is directed by Danny Boyle and written by Alex Garland. It stars Cillian Murphy, Naomie Harris, Megan Burns, Brendan Gleeson and Christopher Ecclestone. Music is by John Murphy and cinematography by Anthony Dod Mantle.\r\n\r\nWhen animal liberation activists break into the Cambridge Primate Research Center, they come across a scientist who tells them that to release these chimps would be insane. They have been injected with a test serum known as \"Rage\", and it's highly contagious and spreads easily and quickly. Ignoring the warnings, one of the activists opens a cage and is attacked and bitten by a chimp and rage quickly spreads among the group...\r\n\r\n28 days later... \r\n\r\nThe amazing thing with Danny Boyles's 28 Days later is that although it owes a huge debt to the likes of George Romero's zombie films, and John Wyndham and Richard Matheson's writings, it still feels fresh and exciting. Film is quintessentially British, as evidenced by the rightly lauded use of a depopulated London for the starting point to the terror, yet there's an earthiness to our small band of survivors. These are flawed characters that are ill equipped to deal with the infected implosion, there's nothing remotely Hollywood about these people or the landscapes that frame them (CG is minimal, where hand-held digital cameras are the order of the day). \r\n\r\nThere's a realistic feel factor that is rarely seen in other films of this ilk. Yep, sure there's implausibilities, but with the infected creatures running at a fair old clip, becoming scary creations in a stark stripped back land, there's too much fun being had - and nervous tension being burnt - to even begin to start nit-picking. Besides, the last quarter alone is a lesson in energy fuelled horror as the survivors, having seemingly found a safe house, find that monsters aren't merely confined to the infected human kind. It's a cracker-jack of a finale, bloody and bloody frantic, all backed by Murphy's simple but totally potent musical arrangements.\r\n\r\nIt's easy to see why America made it a monster hit at the box office, after just making a small profit in the UK, film went to America and made it big. Americans, you have to feel, enjoyed watching something raw in a sub-genre of horror that was at the time reliant on Romero rediscovering his mojo. Worldwide the film made over $70 million in profit, and those are the kinds of figures that speak volumes. The success ensured a sequel would follow, where Boyle and Garland bowed out of the main chairs and into producers roles for \"28 Weeks Later\". It's not as raw as \"Days\", but it's gorier and itself also a fine \"infected\" horror movie, and certainly a worthy follow up to what Boyle and Garland clinically created in 2002.\r\n\r\nA great cast and premise get down and dirty In a sharply executed infected based horror. 8.5/10", "created_at": "2019-09-30T21:20:25.107Z"}, {"movie_id": 170, "review_id": "5e06ebad11386c0014caa337", "author_rating": 8.0, "review_text": "_28 Days Later_ was made on a very small budget in the early days of digital cinema, so, yes, in retrospect, it does look a little bit like it was shot on a Nokia 3310, and yes, it is heavily responsible for the bilious deluge of zombie movies we got in its wake, which we are only now finally recovering from - but it's so **good**. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T05:44:13.702Z"}, {"movie_id": 170, "review_id": "5f9a2f88b4a543003936501b", "author_rating": 9.0, "review_text": "One of the best zombie movies ever made with many of the genre's \"firsts:\" \r\n\r\n1. The first that begins with an actual explanation of what created the zombie plague. \r\n2. The first to introduce a fast-moving \"infected\" horde, ratching up the tension significantly. \r\n3. The first to infect people instantly (within seconds). \r\n\r\nIt also has one of the best movie scores, one that rivals those from John Carpenter classics \"Halloween\" and \"The Thing.\" It is striking how the music can elevate a movie or a scene. \r\n\r\nThe biggest issue, which to be fair, is not something Danny Boyle and his crew could have foreseen, is that it was shot in low quality SD, making it nearly unwatchable on large screen modern HD or 4K TV's.", "created_at": "2020-10-29T02:57:12.042Z"}, {"movie_id": 170, "review_id": "640b2d32caaca200d7364273", "author_rating": 8.0, "review_text": "\"28 Days Later\" is a British horror movie directed by Danny Boyle and starring Cillian Murphy and Naomie Harris. The film tells the story of Jim (Cillian Murphy), a courier who wakes up from a coma to find London abandoned and overrun by rage-infected humans.\r\n\r\nThe film's opening sequence is one of the most iconic and powerful in horror movie history. Jim wakes up in a hospital room to find the world he knew has disappeared, and the eerily deserted streets of London make for an unsettling and ominous backdrop.\r\n\r\nThe film is expertly paced, with a gradual buildup of tension that keeps the audience on the edge of their seats. The infected humans are terrifying, fast-moving, and relentlessly violent, and the film's use of sound and lighting only heightens their impact.\r\n\r\nOne of the standout features of \"28 Days Later\" is the excellent acting by Cillian Murphy and Naomie Harris. Murphy delivers a convincing performance as Jim, a man struggling to survive in a world gone mad, while Harris shines as Selena, a tough survivor who has learned to navigate the dangers of the new world.\r\n\r\nThe film's themes of survival, loss, and the resilience of the human spirit are powerful and thought-provoking. As Jim and Selena make their way through the deserted streets of London, they encounter a range of characters, each with their own story of survival and loss.\r\n\r\nThe film's cinematography and visual effects are also top-notch, with haunting and memorable shots of a deserted London and intense action sequences that will leave you breathless.\r\n\r\nOverall, \"28 Days Later\" is a masterful horror movie that sets the bar high for the genre. The film's excellent acting, pacing, and visuals make for a truly unforgettable experience. I would rate \"28 Days Later\" a 8 out of 10.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:14:26.166Z"}]