[{"movie_id": 266396, "review_id": "57ed8552c3a3686d010002db", "author_rating": 7.0, "review_text": "**When an assassin becomes a target!**\r\n\r\nIt was not bad, but the same old stuff that we'd seen in so many other films. It was actually based on the book and directed by the 'Taken' filmmaker. An international project, takes place in three different countries, but opens and ends in Congo. It centres on an assassin who had successfully executed a high-profile job in Africa. But a few years later, after giving up those kind of work, all the sudden it comes back to haunt him when some unknown men comes looking for him. So he decides to find who's behind it and why.\r\n\r\nEven though it is a familiar theme, very much enjoyable. But the problem is the hero remains unhurt and somebody else dies for him which so cliché. The acting was good, and obviously that is Sean Penn in the lead. The action sequences were okay, but the pace of the film was the reason for me to sit on-board for over 100 minutes.\r\n\r\nSo if you are not expecting a good story and the stunts, it will do okay, particularly for the time pass. Yes, it had a chance to become a better film, but I think it wanted to replicate the book which is a couple of decades old and in the meantime pieces from it was used in the different films, hence this one looked so old. The critics did not like it, but it is much better than they say, as well as not good as some people claim.\r\n\r\n_6.5/10_", "created_at": "2016-09-29T21:19:14.565Z"}, {"movie_id": 266396, "review_id": "63793edd3d355700b3a62d76", "author_rating": 5.0, "review_text": "Sean Penn really should have thought twice before engaging with this derivative and procedural drama. He is sharp-shooter \"Terrier\" whose accuracy put paid to the Congolese Minister for Mines and sets in train a remarkably lacklustre thriller that sees Interpol and corporate greed now out to get him. Pierre Morel has assembled a surprisingly notable cast here with Javier Bardem probably the best of the bunch as the duplicitous \"Felix\"; Idris Elba (\"Barnes\") appears sparingly and adds little - though not as little as the terrible effort from the completely un-menacing Ray Winstone's \"Stanley\" - who ought to have just stuck with looking for waterfalls. The dialogue borders on the puerile and the acting is so ploddingly set-piece that even the shoot-outs and jungle scenarios cannot breathe life into this. I haven't read Jean-Patrick Manchette's original novel, but if this adaptation is in any way true to the book, then I won't be bothering.", "created_at": "2022-11-19T20:38:53.188Z"}]