[{"movie_id": 205775, "review_id": "57951d07c3a36837ae008525", "author_rating": 7.0, "review_text": "> We actually know this story, but not the truth until now!\r\n\r\nRon Howard's latest sea adventure, stars Chris Hemsworth in an important role. So the people comparing it with 'Moby Dick', because both the film is about the same story, but one was inspired and the other one was, I mean this film was based on the actual event. I had seen the BBC film 'The Whale', not a bad film for a low budget television film. Most importantly, it revealed the truth about what I was not aware of from one of my favourite sea adventure films.\r\n\r\nI never read the book, but saw the British version, so I knew what I'm going to witness. Still, I was very interested to check it out, because it is a grand film and as expected I loved the visuals. Those sea adventures were very realistic, except the action sequences which is obviously cinema gimmick. The surprise part was the narration. It was a flashback story, something like 'Life of Pi', a man recall his old memory of his survival at the sea with other crew members of the ship Essex when it was attacked by a big white whale.\r\n\r\nIt is kind of impossible to believe what this film says is true. And obviously what we see is not what exactly happened, but very close. So see this film to believe it. Whatever it is, I totally enjoyed watching it. The 2 hour long never looked too long. There are a few mild disturbing scenes due to the theme concept, but it is a good family film. If you like 'Moby Dick' then you should watch it. Definitely an underrated film by the film critics.\r\n\r\n7/10", "created_at": "2016-07-24T19:54:47.429Z"}, {"movie_id": 205775, "review_id": "590f7f77c3a36864ec02258c", "author_rating": 8.0, "review_text": "I love these type of 18th century film flair, and the whole pirate-like or merchant crew voyaging to the open sea looking for a non-abundant resource later to be topped with an impossible foe because of the technology at the time thus lead to strand in mother nature. Good stuff!", "created_at": "2017-05-07T20:11:35.885Z"}, {"movie_id": 205775, "review_id": "624964eea9117f006478bdc9", "author_rating": 6.0, "review_text": "This movie never really grabbed me. I was impressed by I guess what real critics call the cinematography. Some of the scenes of the action on the ship and the ocean vistas, were realistic and placed me there in the same way I felt like I was there. With Master and Commander.\r\n\r\nThe plot was adequate to the task as well. A familiar story thanks to Moby Dick, but that was the point. My problem was with the characters. I never connected with any of them. I can’t say why or even why I needed to if the other elements of the movie held up their end. But there it is.", "created_at": "2022-04-03T09:12:14.082Z"}]