[{"movie_id": 11400, "review_id": "634b743fd55c3d007cea0086", "author_rating": 5.0, "review_text": "**_Arty, draggy historical romance_**\r\n\r\nI've seen four of Terrence Malick's movies -- \"The New World\" (2005) and his three previous efforts, \"Badlands\" (1973), \"Days of Heaven\" (1978) and \"The Thin Red Line\" (1998). He's an arty filmmaker who isn't interested in making conventional \"blockbusters.\" His three earlier efforts are all well-done and in some ways great. For instance, his pictures are always beautiful and imaginative, but there's also an airy, leisurely quality that will turn off some viewers. My favorite, by far, is \"The Thin Red Line,\" a flawed masterpiece about the taking of a hill during the Guadalcanal Campaign in WWII. It successfully transcended it's storyline to seek answers to life's most profound questions. I guess Malick does this in all his films to some degree, but he was particularly effective with \"The Thin Red Line.\"\r\n\r\nI mention this to stress that I'm familiar with Malick's films and understand his approach. I was really looking forward to \"The New World,\" a historical drama detailing the establishment of the 1607 Jamestown, Virginia, colony with Captain John Smith (Colin Farrell), Pocahontas (Q'orianka Kilcher), John Rolfe (Christian Bale) and others (Christopher Plummer, Wes Studi, etc.).\r\n\r\nShot near the actual locations on the Chickahominy River, Virginia, the film -- to be expected -- is beautiful to look at and the costumes, casting, etc. are all top-of-the-line. Unfortunately, for me, the pace is tedious and the themes aren't compelling enough to keep me spellbound. It's more than a tale of discovering a new world or new culture (for both sides); it's mostly a romance, which doesn't do much for me. Why? I'm not sure. Maybe because the pace was too draggy or possibly because I don't find Kilcher as Pocahontas all that captivating. Don't get me wrong, she's excellent in the role; I just don't find her anything to go ga-ga over, as Smith and Rolfe do in the story.\r\n\r\nOne problem I have with the movie is the ridiculous romanticizing of the Natives as super-virtuous. Exhibit A is when Smith reflects in a voice-over: \"They are gentle, loving, faithful, lacking in all guile and trickery. The words denoting lying, deceit, greed, envy, slander, and forgiveness have never been heard. They have no jealousy, no sense of possession.\"\r\n\r\n_Why sure!_\r\n\r\nIf the Indians had no sense of possession why did they attack the settlement when the Englanders failed to leave the next Spring? Why were tribes in regular warfare all over the Americas? Are we to believe not one of the Natives knew what a lie was? Or jealousy, envy, greed and slander? I get that the naturals weren't yet defiled by European-styled urbanization, but to suggest the above is pretty absurd. You can't tell me there wasn't a brave or two who had his eyes on young Pocahontas and felt a \"smidgen\" of jealousy when Smith stirred her romantic interests.\r\n\r\nThe only way I can get past such nonsense and enjoy the movie is the fact that the voice-over in question was SMITH's idealized, romanticized perspective of a people with which he was enamored. In other words, it wasn't reality; it was his temporarily clouded opinion.\r\n\r\nBOTTOM LINE: \"The New World\" will be more appreciated by those who enjoy arty romantic films. For me, I'm in the middle: I see the good of the film -- even the greatness -- and value it, but I can't deny the film's shortcomings as far as a viewing experience goes. Regardless, it's great to be able to go back in time and visualize how it was when the Jamestown colony was established, highly romanticized as it is portrayed here.\r\n\r\nThe film runs 136 minutes (long enough) and the extended cut 172 minutes.\r\n\r\nGRADE: C+", "created_at": "2022-10-16T03:02:23.213Z"}]