[{"movie_id": 277834, "review_id": "58b340cfc3a368525400b1bd", "author_rating": 7.0, "review_text": "**Girl finds out the true identity of her people.**\r\n\r\nOkay, I shocked when I heard this film did not get the Oscars nod, except for a song. Now I have seen the film and I come to know why. This is a one liner, but developed into a longer version Except the initial parts, this film is like a limited cast/character film. Most of the film takes place in the sea sailing around fighting evil force to break the curse. But at the end, you would feel this kind of story is not worth for a feature film. It looks a perfect short animation theme.\r\n\r\nDisney never disappoints its fans, well, for me. So I enjoyed it, it was fun and entertaining, but too simple. The characters were cute, this is a wonderful film for kids and some grownups would too enjoy it. But this is not for all, unlike most of the Disney animations are. Dwayne's voice lending for one of the lead characters was good, but the girl steals the show. Especially if you are a kid and/or a girl.\r\n\r\nThe best film since 'Lilo & Stitch' on the similar theme about Pacific islands' people. But it reminded me 'Whale Rider'. Overall, I think the story should have been improved a bit, in particular by including a few more characters at least for the partial appearances. This is not the best animation of the year, also definitely the bad one to skip. If your purpose of the watch is entertainment/timepass, it is good at that.\r\n\r\n_6½/10_", "created_at": "2017-02-26T20:55:43.643Z"}, {"movie_id": 277834, "review_id": "58e3a55a92514127f601fa3a", "author_rating": 7.0, "review_text": "After I watched _Zootopia_ in the middle of 2016, I thought to myself \"Well, that does it, this has to be the best Family Movie of the year!\" I was ready to call it right then and there. It wasn't until December rolled around and I got the chance to see _Moana_, that I realised I had spoken far too soon. For in truth Moana deserved that title!\r\n\r\nMostly I'm just happy that I managed to enjoy two whole Disney movies this year.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-04-04T13:53:30.106Z"}, {"movie_id": 277834, "review_id": "5f5528fff5f1c50036896c32", "author_rating": 7.0, "review_text": "Good fun.\r\n\r\nI wasn't expecting <em>'Moana'</em> to be quite so goofy and silly, in that sense the more serious ending doesn't quite fit, but I still felt suitably entertained throughout. The animation is nice, while the music is solid - even if Maui's \"You're Welcome\" is the only memorable song to me.\r\n\r\nDwanye Johnson plays Maui, he is top notch from start-to-finish; obvious casting, but still a welcomed pick. Auliʻi Cravalho (Moana) and Rachel House (Tala) are also up to the mark in their respective roles.\r\n\r\nThought it would be greater, but that doesn't stop the fact that this is an enjoyable film.", "created_at": "2020-09-06T18:22:55.609Z"}, {"movie_id": 277834, "review_id": "6423f5f637b3a900977747a5", "author_rating": 7.0, "review_text": "This is quite a fun meander into the richness of Polynesian myth that allows the animators and the storytellers to fill their boots. The young \"Moana\" is daughter of the King, and he is terrified that an ancient curse will visit their paradise homeland should anyone venture beyond the protective reef that surrounds their island. Thing is, though, that it looks like the curse is coming anyway. Their coconuts start to rot, their supply of fish dries up - they face starvation unless someone heads out... Meantime, the young girl is sent a very clear signal by the ocean itself - and she is certain that she must leave her home and break the scourge once and for ever. Her first challenge is to catch up with the mischievous demigod \"Maui\" - who started the whole problem thing in the first place. Only together might they stand a chance of restoring the balance of nature and calming the wrath of the gods. Loads of escapades ensue - everyone gets wet (frequently), there are plenty of acrobatics as they try to evade some pirates and a rock throwing monster all whilst occasionally belting out some songs from the pen of Lin-Manuel Miranda (et al) that are very much focussed on local traditions and beliefs. The writing is quickly paced and often quite amusing - there is even the odd hint of sarcasm, and the animation is colourful and vibrant. It's a simple story with precious little jeopardy, but so what - it's an enjoyable watch for children of all ages!", "created_at": "2023-03-29T08:25:26.701Z"}]