[{"movie_id": 240832, "review_id": "53da558dc3a3681ee00017b6", "author_rating": 0.5, "review_text": "There is no excuse for basing a screenplay on taking seriously a well known urban myth and writing it as if the audience believes the myth.\r\n\r\nDid no one up the entire production line step out and call bullshit on the discredited 'we only use 10% of our brain,' idea? I am so embarrassed by seeing actors I admire, Scarlett Johansson and Morgan Freeman, deliver solid performances on the basis of an idea at which most people laugh.", "created_at": "2014-07-31T14:41:18.001Z"}, {"movie_id": 240832, "review_id": "541945050e0a265b86000c63", "author_rating": 3.0, "review_text": "I've also struggled to appreciate several o Luc Besson's movies but this is is by far the worst one.\r\n\r\nA lot of jibber-jabber bullshit with sexy Scarlett Johansson, lots of FX, predictable ending in Paris and a pointless car race on its streets.\r\n\r\nBetter spend your time on something else ...", "created_at": "2014-09-17T08:23:33.703Z"}, {"movie_id": 240832, "review_id": "563d7bfe9251416cd8001f1b", "author_rating": 7.0, "review_text": "Ignorance brings chaos, not knowledge.\r\n\r\nLucy is one of those films that brings about furious reactions, it is after all a science fiction type action thriller. They always divide film fans right from the off. It's a film that to all intents and purposes needs to be viewed just as a cinematic experience, as a piece of popcorn fodder that may try to be something more cerebral, but ultimately is a daft - but hugely fun - piece of film.\r\n\r\nLuc Besson writes and directs a film that sees Scarlett Johansson duped into being a drug mule, with the transportation of drugs sewn into her abdomen. It's a new drug, boy is it a new drug, and when things go belly up and the drugs are unleashed into Scarlett's system, she's a threat - or hope - to mankind.\r\n\r\nIt can be, and has been, called pretentious et al, such is the science factor, which is perfectly understandable, so any hope of tight science fiction musings will only end up in a crushing disappointment. Undeniably Besson and his backers thought they had something to say, to open up the film watchers' minds to something deep and probable, to be relevant and viable. But unlike the makers we the viewers didn't have access to donepezil, so we sadly couldn't all turn into Bradley Cooper and be limitless in our viewing capabilities.\r\n\r\nPersonally, it's a rollicking fun film for two thirds, when it's about Scarlett kicking butt, a revenge driven babe, it grips and shakes all the genre compliant cinematic senses. The ending, the grand finale, infuriated me, and by the looks of Morgan Freeman (coasting for easy money), he was also a little frustrated. But I had fun, yet on the flip side if anyone fronted me up and said they hated the film with a passion? Then I would understand and take them home to play with my chemistry set. 7/10", "created_at": "2015-11-07T04:20:14.571Z"}, {"movie_id": 240832, "review_id": "5af5f3390e0a2631b700238a", "author_rating": 8.0, "review_text": "A lot of people appears to have gotten into some hate-mode when watching this movie. I guess they did not check up what the movie was really about before watching it. The movie is not perfect, it has its flaws, but a 1 or 2 star bullshit rating is hugely unfair. Personally, I really liked this movie. It is science fiction, pure and simple. If you expect science without the fiction, well then you should go and see some other movie. With Luc Besson both writing and directing and statements like “merciless warrior evolved beyond human logic” in the blurb … well I got pretty much what I expected.\r\n\r\nThe movie starts off making you think it is a “simple” revenge story with science fiction elements in the form of the superhuman Lucy. However it gradually evolves into something else. Lucy knows that she cannot survive in her new state and it becomes a quest to preserve the knowledge that she has acquired while she still has the time and at the same time dodging the drug dealers that are the cause of her situation in the first place.\r\n\r\nLucy is great. Her powers and how they develop are awesome. I really like surprise effects in movies and books of the kind that you get when someone like Lucy reveals her powers to the “mundane”. Especially when the revealing means swatting a few bad guys. This movie is full of moments like that. It is quite a roller coaster ride of action with Lucy exhibiting her growing powers. Not too surprisingly the movie is also full of scientific bullshit and plot holes. I do not really care. I’m in for the ride and it is a fun ride.\r\n\r\nScarlett Johansson is very good in her role as Lucy. Most of the other actors are ok although the Asian drug boss could have been better. He came out more like a brainless thug than anything else. Certainly not as the mastermind of a criminal organization.\r\n\r\nThe ending was a bit unsatisfactory compared to the rest of the movie though. I was a bit disappointed that the big fight at the end more or less was done without Lucy. The long cinematic sequences where Lucy wondered about in time and space felt a bit like yawn-filler-material. The actual ending, well that “I am everywhere” bit was really been there, seen that, done that. Also, if she was indeed everywhere, why the hurry to create that fancy memory stick?\r\n\r\nAnyway, apart from that I really enjoyed this movie.", "created_at": "2018-05-11T19:47:05.136Z"}, {"movie_id": 240832, "review_id": "5f21a9d25b2f4700354ceeb9", "author_rating": 9.0, "review_text": "_**Time to GROW UP**_\r\n\r\n\"Lucy\" (2014) is about an average hot babe named Lucy, played by Scarlett Johansson, who increasingly taps into her mind's full capacity and, consequently, acquires superhuman powers (or are they just fully-human powers?). She hooks up with the leading expert on the human mind (Morgan Freeman) to share her discoveries and also teams-up with a Paris police captain (Amr Waked) to destroy the malevolent schemes of an arrogant Asian mob boss (Min-sik Choi). \r\n\r\nIt should be emphasized that this is not comic book superhero movie (Don't we have enough of those yet?), it's an ordinary-person-reaching-full-human-potential movie. There were two of these in the mid-90s, \"Powder\" (1995) and \"Phenomenon\" (1996). They're both good, but the latter played it too safe, particularly at the end, while \"Powder\" reached for greatness and got a finger in. Francis Ford Coppola added his take on the genre with 2007's \"Youth Without Youth,\" a dense film with many interesting elements; too bad he forgot to include an entertaining story. \r\n\r\n\"Lucy\" is the best of these and is, in fact, one of my all-time favorite movies. \"Lucy\" includes the mindfood of Coppola's film, but doesn't forget to be entertaining. As such, the film mixes interesting, inspiring elements with thrills, action, eye candy and ear candy (a notable score). On top of this, \"Lucy\" is stylish and \"hip,\" whatever that means; in other words, it's got pizzazz.\r\n\r\nSome complain that the film is flawed because it's based on the notion that we only use 10% of our brain power, but this is only a plot device to illustrate that most people are functioning way under their potential and are obsessed with usually worthless things and blowing precious time accordingly. Take, for instance, the people who blow hour upon hour of valuable time watching sports. Viewing a game here or there is great, but these types have lost all sense of moderation. Or how about those who feel they have to numb themselves with alcohol or drugs just to have a good time? They're, in essence, running away from reality. \r\n\r\nWhat's funny about this criticism that the film's based on humans only using 10% of their brain power is that, in most cases, the number's more like 1-2%. Lol, just kidding. (Or am I?) \r\n\r\nIn regards to Lucy's powers illustrated in the film, and the other films noted above, I've had my own run-ins with such phenomena. For instance, about seven years ago I was in bed having an intense dream when my wife burst into the room to wake me up. The smoke alarm outside the door was blaring like crazy, but there was no smoke or fire or heat. The potent energy evoked by my dream obviously set it off because, as soon as I awoke, it suddenly stopped. If there was any doubt, the same thing happened the next week. What can explain this except the untapped power of the mind and focused energy? \r\n\r\nAnother example comes to mind, albeit different: when I was around 8 years old my family and I were walking the trails of Theodore Wirth Park in Minneapolis when we came to the edge of a baseball field. As soon as we entered the outfield somehow I just knew that the current batter was going to hit the ball and it was going to hit me right in the face. I knew this but I didn't know how I knew it. I just knew. Next thing you know the batter hits the ball high into the air -- it was like slow-motion -- and it came and hit me right on the cheek! (Good thing it was a softball, huh?). How did I KNOW this was going to happen? I don't know, but it's pretty amazing and it shows the power of the mind and spirit to warn us, which some call intuition.\r\n\r\nLess spectacular is something that I experience every day with my wife: One of us will be thinking something and give voice to it and the other says, \"I was thinking the exact same thing.\" What's going on? We're picking up each other's immaterial thoughts, otherwise known as telepathy. What if we developed this further? Other paranormal phenomena featured in the story include psychokinesis, extraordinary empathy and what the Bible calls \"the word of knowledge.\" Although they're exaggerated in the film, they're REAL.\r\n\r\n\"Lucy\" is inspiring in that it's an encouragement to GROW UP. As Lucy evolves she stops at her apartment and runs into her roommate, who's the typical bimbo party girl who spends too much of her free time \"partying\" and pursuing a \"cute guy with nice buns\" (or however she puts it). Not that there's anything intrinsically wrong with these things, except that these people obsess over them and they become their PURPOSE for living. Whatever happened to \"All things in moderation\"? The beginning of the movie shows that Lucy was just like her roommate but something happened and... she GREW UP.\r\n\r\nMy praise of the movie's philosophical and theological ideas shouldn't be interpreted to mean that I agree with every jot and tittle. It's a sci-fi/thriller blockbuster, after all; it's just that this one has more interesting ideas than most. Secondly, who agrees with everyone about everything? Is that even healthy?\r\n\r\nNeedless to say, I love \"Lucy\"! \r\n\r\nThe film doesn't wear out its welcome at a mere 1 hour, 29 minutes, and was shot in Taiwan, France and a German airport.\r\n\r\nGRADE: A", "created_at": "2020-07-29T16:54:42.980Z"}, {"movie_id": 240832, "review_id": "64788718076ce800a8221abe", "author_rating": 8.0, "review_text": "It would be easy to say this is a bad movie, if you wanted to be narrow-minded, but if you're willing to give it a chance it's really pretty good. Not great, but good. It comes at you head-on with some pretty cool and unusual perspectives. I mean, a philosophical action movie. You don't see many of those around. Ok, the philosophy falls short because the script just isn't clever enough but, it's a nice idea. And making the lead a woman was a bold touch. Bring the popcorn but keep a couple of your brain cells awake too. Oh, and if you honestly believe the myth that humans don't use 100% of their brains then there are a few scientists you need to talk to.", "created_at": "2023-06-01T11:55:04.236Z"}, {"movie_id": 240832, "review_id": "53da558dc3a3681ee00017b6", "author_rating": 0.5, "review_text": "There is no excuse for basing a screenplay on taking seriously a well known urban myth and writing it as if the audience believes the myth.\r\n\r\nDid no one up the entire production line step out and call bullshit on the discredited 'we only use 10% of our brain,' idea? I am so embarrassed by seeing actors I admire, Scarlett Johansson and Morgan Freeman, deliver solid performances on the basis of an idea at which most people laugh.", "created_at": "2014-07-31T14:41:18.001Z"}, {"movie_id": 240832, "review_id": "541945050e0a265b86000c63", "author_rating": 3.0, "review_text": "I've also struggled to appreciate several o Luc Besson's movies but this is is by far the worst one.\r\n\r\nA lot of jibber-jabber bullshit with sexy Scarlett Johansson, lots of FX, predictable ending in Paris and a pointless car race on its streets.\r\n\r\nBetter spend your time on something else ...", "created_at": "2014-09-17T08:23:33.703Z"}, {"movie_id": 240832, "review_id": "563d7bfe9251416cd8001f1b", "author_rating": 7.0, "review_text": "Ignorance brings chaos, not knowledge.\r\n\r\nLucy is one of those films that brings about furious reactions, it is after all a science fiction type action thriller. They always divide film fans right from the off. It's a film that to all intents and purposes needs to be viewed just as a cinematic experience, as a piece of popcorn fodder that may try to be something more cerebral, but ultimately is a daft - but hugely fun - piece of film.\r\n\r\nLuc Besson writes and directs a film that sees Scarlett Johansson duped into being a drug mule, with the transportation of drugs sewn into her abdomen. It's a new drug, boy is it a new drug, and when things go belly up and the drugs are unleashed into Scarlett's system, she's a threat - or hope - to mankind.\r\n\r\nIt can be, and has been, called pretentious et al, such is the science factor, which is perfectly understandable, so any hope of tight science fiction musings will only end up in a crushing disappointment. Undeniably Besson and his backers thought they had something to say, to open up the film watchers' minds to something deep and probable, to be relevant and viable. But unlike the makers we the viewers didn't have access to donepezil, so we sadly couldn't all turn into Bradley Cooper and be limitless in our viewing capabilities.\r\n\r\nPersonally, it's a rollicking fun film for two thirds, when it's about Scarlett kicking butt, a revenge driven babe, it grips and shakes all the genre compliant cinematic senses. The ending, the grand finale, infuriated me, and by the looks of Morgan Freeman (coasting for easy money), he was also a little frustrated. But I had fun, yet on the flip side if anyone fronted me up and said they hated the film with a passion? Then I would understand and take them home to play with my chemistry set. 7/10", "created_at": "2015-11-07T04:20:14.571Z"}, {"movie_id": 240832, "review_id": "5af5f3390e0a2631b700238a", "author_rating": 8.0, "review_text": "A lot of people appears to have gotten into some hate-mode when watching this movie. I guess they did not check up what the movie was really about before watching it. The movie is not perfect, it has its flaws, but a 1 or 2 star bullshit rating is hugely unfair. Personally, I really liked this movie. It is science fiction, pure and simple. If you expect science without the fiction, well then you should go and see some other movie. With Luc Besson both writing and directing and statements like “merciless warrior evolved beyond human logic” in the blurb … well I got pretty much what I expected.\r\n\r\nThe movie starts off making you think it is a “simple” revenge story with science fiction elements in the form of the superhuman Lucy. However it gradually evolves into something else. Lucy knows that she cannot survive in her new state and it becomes a quest to preserve the knowledge that she has acquired while she still has the time and at the same time dodging the drug dealers that are the cause of her situation in the first place.\r\n\r\nLucy is great. Her powers and how they develop are awesome. I really like surprise effects in movies and books of the kind that you get when someone like Lucy reveals her powers to the “mundane”. Especially when the revealing means swatting a few bad guys. This movie is full of moments like that. It is quite a roller coaster ride of action with Lucy exhibiting her growing powers. Not too surprisingly the movie is also full of scientific bullshit and plot holes. I do not really care. I’m in for the ride and it is a fun ride.\r\n\r\nScarlett Johansson is very good in her role as Lucy. Most of the other actors are ok although the Asian drug boss could have been better. He came out more like a brainless thug than anything else. Certainly not as the mastermind of a criminal organization.\r\n\r\nThe ending was a bit unsatisfactory compared to the rest of the movie though. I was a bit disappointed that the big fight at the end more or less was done without Lucy. The long cinematic sequences where Lucy wondered about in time and space felt a bit like yawn-filler-material. The actual ending, well that “I am everywhere” bit was really been there, seen that, done that. Also, if she was indeed everywhere, why the hurry to create that fancy memory stick?\r\n\r\nAnyway, apart from that I really enjoyed this movie.", "created_at": "2018-05-11T19:47:05.136Z"}, {"movie_id": 240832, "review_id": "5f21a9d25b2f4700354ceeb9", "author_rating": 9.0, "review_text": "_**Time to GROW UP**_\r\n\r\n\"Lucy\" (2014) is about an average hot babe named Lucy, played by Scarlett Johansson, who increasingly taps into her mind's full capacity and, consequently, acquires superhuman powers (or are they just fully-human powers?). She hooks up with the leading expert on the human mind (Morgan Freeman) to share her discoveries and also teams-up with a Paris police captain (Amr Waked) to destroy the malevolent schemes of an arrogant Asian mob boss (Min-sik Choi). \r\n\r\nIt should be emphasized that this is not comic book superhero movie (Don't we have enough of those yet?), it's an ordinary-person-reaching-full-human-potential movie. There were two of these in the mid-90s, \"Powder\" (1995) and \"Phenomenon\" (1996). They're both good, but the latter played it too safe, particularly at the end, while \"Powder\" reached for greatness and got a finger in. Francis Ford Coppola added his take on the genre with 2007's \"Youth Without Youth,\" a dense film with many interesting elements; too bad he forgot to include an entertaining story. \r\n\r\n\"Lucy\" is the best of these and is, in fact, one of my all-time favorite movies. \"Lucy\" includes the mindfood of Coppola's film, but doesn't forget to be entertaining. As such, the film mixes interesting, inspiring elements with thrills, action, eye candy and ear candy (a notable score). On top of this, \"Lucy\" is stylish and \"hip,\" whatever that means; in other words, it's got pizzazz.\r\n\r\nSome complain that the film is flawed because it's based on the notion that we only use 10% of our brain power, but this is only a plot device to illustrate that most people are functioning way under their potential and are obsessed with usually worthless things and blowing precious time accordingly. Take, for instance, the people who blow hour upon hour of valuable time watching sports. Viewing a game here or there is great, but these types have lost all sense of moderation. Or how about those who feel they have to numb themselves with alcohol or drugs just to have a good time? They're, in essence, running away from reality. \r\n\r\nWhat's funny about this criticism that the film's based on humans only using 10% of their brain power is that, in most cases, the number's more like 1-2%. Lol, just kidding. (Or am I?) \r\n\r\nIn regards to Lucy's powers illustrated in the film, and the other films noted above, I've had my own run-ins with such phenomena. For instance, about seven years ago I was in bed having an intense dream when my wife burst into the room to wake me up. The smoke alarm outside the door was blaring like crazy, but there was no smoke or fire or heat. The potent energy evoked by my dream obviously set it off because, as soon as I awoke, it suddenly stopped. If there was any doubt, the same thing happened the next week. What can explain this except the untapped power of the mind and focused energy? \r\n\r\nAnother example comes to mind, albeit different: when I was around 8 years old my family and I were walking the trails of Theodore Wirth Park in Minneapolis when we came to the edge of a baseball field. As soon as we entered the outfield somehow I just knew that the current batter was going to hit the ball and it was going to hit me right in the face. I knew this but I didn't know how I knew it. I just knew. Next thing you know the batter hits the ball high into the air -- it was like slow-motion -- and it came and hit me right on the cheek! (Good thing it was a softball, huh?). How did I KNOW this was going to happen? I don't know, but it's pretty amazing and it shows the power of the mind and spirit to warn us, which some call intuition.\r\n\r\nLess spectacular is something that I experience every day with my wife: One of us will be thinking something and give voice to it and the other says, \"I was thinking the exact same thing.\" What's going on? We're picking up each other's immaterial thoughts, otherwise known as telepathy. What if we developed this further? Other paranormal phenomena featured in the story include psychokinesis, extraordinary empathy and what the Bible calls \"the word of knowledge.\" Although they're exaggerated in the film, they're REAL.\r\n\r\n\"Lucy\" is inspiring in that it's an encouragement to GROW UP. As Lucy evolves she stops at her apartment and runs into her roommate, who's the typical bimbo party girl who spends too much of her free time \"partying\" and pursuing a \"cute guy with nice buns\" (or however she puts it). Not that there's anything intrinsically wrong with these things, except that these people obsess over them and they become their PURPOSE for living. Whatever happened to \"All things in moderation\"? The beginning of the movie shows that Lucy was just like her roommate but something happened and... she GREW UP.\r\n\r\nMy praise of the movie's philosophical and theological ideas shouldn't be interpreted to mean that I agree with every jot and tittle. It's a sci-fi/thriller blockbuster, after all; it's just that this one has more interesting ideas than most. Secondly, who agrees with everyone about everything? Is that even healthy?\r\n\r\nNeedless to say, I love \"Lucy\"! \r\n\r\nThe film doesn't wear out its welcome at a mere 1 hour, 29 minutes, and was shot in Taiwan, France and a German airport.\r\n\r\nGRADE: A", "created_at": "2020-07-29T16:54:42.980Z"}, {"movie_id": 240832, "review_id": "64788718076ce800a8221abe", "author_rating": 8.0, "review_text": "It would be easy to say this is a bad movie, if you wanted to be narrow-minded, but if you're willing to give it a chance it's really pretty good. Not great, but good. It comes at you head-on with some pretty cool and unusual perspectives. I mean, a philosophical action movie. You don't see many of those around. Ok, the philosophy falls short because the script just isn't clever enough but, it's a nice idea. And making the lead a woman was a bold touch. Bring the popcorn but keep a couple of your brain cells awake too. Oh, and if you honestly believe the myth that humans don't use 100% of their brains then there are a few scientists you need to talk to.", "created_at": "2023-06-01T11:55:04.236Z"}, {"movie_id": 240832, "review_id": "53da558dc3a3681ee00017b6", "author_rating": 0.5, "review_text": "There is no excuse for basing a screenplay on taking seriously a well known urban myth and writing it as if the audience believes the myth.\r\n\r\nDid no one up the entire production line step out and call bullshit on the discredited 'we only use 10% of our brain,' idea? I am so embarrassed by seeing actors I admire, Scarlett Johansson and Morgan Freeman, deliver solid performances on the basis of an idea at which most people laugh.", "created_at": "2014-07-31T14:41:18.001Z"}, {"movie_id": 240832, "review_id": "541945050e0a265b86000c63", "author_rating": 3.0, "review_text": "I've also struggled to appreciate several o Luc Besson's movies but this is is by far the worst one.\r\n\r\nA lot of jibber-jabber bullshit with sexy Scarlett Johansson, lots of FX, predictable ending in Paris and a pointless car race on its streets.\r\n\r\nBetter spend your time on something else ...", "created_at": "2014-09-17T08:23:33.703Z"}, {"movie_id": 240832, "review_id": "563d7bfe9251416cd8001f1b", "author_rating": 7.0, "review_text": "Ignorance brings chaos, not knowledge.\r\n\r\nLucy is one of those films that brings about furious reactions, it is after all a science fiction type action thriller. They always divide film fans right from the off. It's a film that to all intents and purposes needs to be viewed just as a cinematic experience, as a piece of popcorn fodder that may try to be something more cerebral, but ultimately is a daft - but hugely fun - piece of film.\r\n\r\nLuc Besson writes and directs a film that sees Scarlett Johansson duped into being a drug mule, with the transportation of drugs sewn into her abdomen. It's a new drug, boy is it a new drug, and when things go belly up and the drugs are unleashed into Scarlett's system, she's a threat - or hope - to mankind.\r\n\r\nIt can be, and has been, called pretentious et al, such is the science factor, which is perfectly understandable, so any hope of tight science fiction musings will only end up in a crushing disappointment. Undeniably Besson and his backers thought they had something to say, to open up the film watchers' minds to something deep and probable, to be relevant and viable. But unlike the makers we the viewers didn't have access to donepezil, so we sadly couldn't all turn into Bradley Cooper and be limitless in our viewing capabilities.\r\n\r\nPersonally, it's a rollicking fun film for two thirds, when it's about Scarlett kicking butt, a revenge driven babe, it grips and shakes all the genre compliant cinematic senses. The ending, the grand finale, infuriated me, and by the looks of Morgan Freeman (coasting for easy money), he was also a little frustrated. But I had fun, yet on the flip side if anyone fronted me up and said they hated the film with a passion? Then I would understand and take them home to play with my chemistry set. 7/10", "created_at": "2015-11-07T04:20:14.571Z"}, {"movie_id": 240832, "review_id": "5af5f3390e0a2631b700238a", "author_rating": 8.0, "review_text": "A lot of people appears to have gotten into some hate-mode when watching this movie. I guess they did not check up what the movie was really about before watching it. The movie is not perfect, it has its flaws, but a 1 or 2 star bullshit rating is hugely unfair. Personally, I really liked this movie. It is science fiction, pure and simple. If you expect science without the fiction, well then you should go and see some other movie. With Luc Besson both writing and directing and statements like “merciless warrior evolved beyond human logic” in the blurb … well I got pretty much what I expected.\r\n\r\nThe movie starts off making you think it is a “simple” revenge story with science fiction elements in the form of the superhuman Lucy. However it gradually evolves into something else. Lucy knows that she cannot survive in her new state and it becomes a quest to preserve the knowledge that she has acquired while she still has the time and at the same time dodging the drug dealers that are the cause of her situation in the first place.\r\n\r\nLucy is great. Her powers and how they develop are awesome. I really like surprise effects in movies and books of the kind that you get when someone like Lucy reveals her powers to the “mundane”. Especially when the revealing means swatting a few bad guys. This movie is full of moments like that. It is quite a roller coaster ride of action with Lucy exhibiting her growing powers. Not too surprisingly the movie is also full of scientific bullshit and plot holes. I do not really care. I’m in for the ride and it is a fun ride.\r\n\r\nScarlett Johansson is very good in her role as Lucy. Most of the other actors are ok although the Asian drug boss could have been better. He came out more like a brainless thug than anything else. Certainly not as the mastermind of a criminal organization.\r\n\r\nThe ending was a bit unsatisfactory compared to the rest of the movie though. I was a bit disappointed that the big fight at the end more or less was done without Lucy. The long cinematic sequences where Lucy wondered about in time and space felt a bit like yawn-filler-material. The actual ending, well that “I am everywhere” bit was really been there, seen that, done that. Also, if she was indeed everywhere, why the hurry to create that fancy memory stick?\r\n\r\nAnyway, apart from that I really enjoyed this movie.", "created_at": "2018-05-11T19:47:05.136Z"}, {"movie_id": 240832, "review_id": "5f21a9d25b2f4700354ceeb9", "author_rating": 9.0, "review_text": "_**Time to GROW UP**_\r\n\r\n\"Lucy\" (2014) is about an average hot babe named Lucy, played by Scarlett Johansson, who increasingly taps into her mind's full capacity and, consequently, acquires superhuman powers (or are they just fully-human powers?). She hooks up with the leading expert on the human mind (Morgan Freeman) to share her discoveries and also teams-up with a Paris police captain (Amr Waked) to destroy the malevolent schemes of an arrogant Asian mob boss (Min-sik Choi). \r\n\r\nIt should be emphasized that this is not comic book superhero movie (Don't we have enough of those yet?), it's an ordinary-person-reaching-full-human-potential movie. There were two of these in the mid-90s, \"Powder\" (1995) and \"Phenomenon\" (1996). They're both good, but the latter played it too safe, particularly at the end, while \"Powder\" reached for greatness and got a finger in. Francis Ford Coppola added his take on the genre with 2007's \"Youth Without Youth,\" a dense film with many interesting elements; too bad he forgot to include an entertaining story. \r\n\r\n\"Lucy\" is the best of these and is, in fact, one of my all-time favorite movies. \"Lucy\" includes the mindfood of Coppola's film, but doesn't forget to be entertaining. As such, the film mixes interesting, inspiring elements with thrills, action, eye candy and ear candy (a notable score). On top of this, \"Lucy\" is stylish and \"hip,\" whatever that means; in other words, it's got pizzazz.\r\n\r\nSome complain that the film is flawed because it's based on the notion that we only use 10% of our brain power, but this is only a plot device to illustrate that most people are functioning way under their potential and are obsessed with usually worthless things and blowing precious time accordingly. Take, for instance, the people who blow hour upon hour of valuable time watching sports. Viewing a game here or there is great, but these types have lost all sense of moderation. Or how about those who feel they have to numb themselves with alcohol or drugs just to have a good time? They're, in essence, running away from reality. \r\n\r\nWhat's funny about this criticism that the film's based on humans only using 10% of their brain power is that, in most cases, the number's more like 1-2%. Lol, just kidding. (Or am I?) \r\n\r\nIn regards to Lucy's powers illustrated in the film, and the other films noted above, I've had my own run-ins with such phenomena. For instance, about seven years ago I was in bed having an intense dream when my wife burst into the room to wake me up. The smoke alarm outside the door was blaring like crazy, but there was no smoke or fire or heat. The potent energy evoked by my dream obviously set it off because, as soon as I awoke, it suddenly stopped. If there was any doubt, the same thing happened the next week. What can explain this except the untapped power of the mind and focused energy? \r\n\r\nAnother example comes to mind, albeit different: when I was around 8 years old my family and I were walking the trails of Theodore Wirth Park in Minneapolis when we came to the edge of a baseball field. As soon as we entered the outfield somehow I just knew that the current batter was going to hit the ball and it was going to hit me right in the face. I knew this but I didn't know how I knew it. I just knew. Next thing you know the batter hits the ball high into the air -- it was like slow-motion -- and it came and hit me right on the cheek! (Good thing it was a softball, huh?). How did I KNOW this was going to happen? I don't know, but it's pretty amazing and it shows the power of the mind and spirit to warn us, which some call intuition.\r\n\r\nLess spectacular is something that I experience every day with my wife: One of us will be thinking something and give voice to it and the other says, \"I was thinking the exact same thing.\" What's going on? We're picking up each other's immaterial thoughts, otherwise known as telepathy. What if we developed this further? Other paranormal phenomena featured in the story include psychokinesis, extraordinary empathy and what the Bible calls \"the word of knowledge.\" Although they're exaggerated in the film, they're REAL.\r\n\r\n\"Lucy\" is inspiring in that it's an encouragement to GROW UP. As Lucy evolves she stops at her apartment and runs into her roommate, who's the typical bimbo party girl who spends too much of her free time \"partying\" and pursuing a \"cute guy with nice buns\" (or however she puts it). Not that there's anything intrinsically wrong with these things, except that these people obsess over them and they become their PURPOSE for living. Whatever happened to \"All things in moderation\"? The beginning of the movie shows that Lucy was just like her roommate but something happened and... she GREW UP.\r\n\r\nMy praise of the movie's philosophical and theological ideas shouldn't be interpreted to mean that I agree with every jot and tittle. It's a sci-fi/thriller blockbuster, after all; it's just that this one has more interesting ideas than most. Secondly, who agrees with everyone about everything? Is that even healthy?\r\n\r\nNeedless to say, I love \"Lucy\"! \r\n\r\nThe film doesn't wear out its welcome at a mere 1 hour, 29 minutes, and was shot in Taiwan, France and a German airport.\r\n\r\nGRADE: A", "created_at": "2020-07-29T16:54:42.980Z"}, {"movie_id": 240832, "review_id": "64788718076ce800a8221abe", "author_rating": 8.0, "review_text": "It would be easy to say this is a bad movie, if you wanted to be narrow-minded, but if you're willing to give it a chance it's really pretty good. Not great, but good. It comes at you head-on with some pretty cool and unusual perspectives. I mean, a philosophical action movie. You don't see many of those around. Ok, the philosophy falls short because the script just isn't clever enough but, it's a nice idea. And making the lead a woman was a bold touch. Bring the popcorn but keep a couple of your brain cells awake too. Oh, and if you honestly believe the myth that humans don't use 100% of their brains then there are a few scientists you need to talk to.", "created_at": "2023-06-01T11:55:04.236Z"}, {"movie_id": 240832, "review_id": "53da558dc3a3681ee00017b6", "author_rating": 0.5, "review_text": "There is no excuse for basing a screenplay on taking seriously a well known urban myth and writing it as if the audience believes the myth.\r\n\r\nDid no one up the entire production line step out and call bullshit on the discredited 'we only use 10% of our brain,' idea? I am so embarrassed by seeing actors I admire, Scarlett Johansson and Morgan Freeman, deliver solid performances on the basis of an idea at which most people laugh.", "created_at": "2014-07-31T14:41:18.001Z"}, {"movie_id": 240832, "review_id": "541945050e0a265b86000c63", "author_rating": 3.0, "review_text": "I've also struggled to appreciate several o Luc Besson's movies but this is is by far the worst one.\r\n\r\nA lot of jibber-jabber bullshit with sexy Scarlett Johansson, lots of FX, predictable ending in Paris and a pointless car race on its streets.\r\n\r\nBetter spend your time on something else ...", "created_at": "2014-09-17T08:23:33.703Z"}, {"movie_id": 240832, "review_id": "563d7bfe9251416cd8001f1b", "author_rating": 7.0, "review_text": "Ignorance brings chaos, not knowledge.\r\n\r\nLucy is one of those films that brings about furious reactions, it is after all a science fiction type action thriller. They always divide film fans right from the off. It's a film that to all intents and purposes needs to be viewed just as a cinematic experience, as a piece of popcorn fodder that may try to be something more cerebral, but ultimately is a daft - but hugely fun - piece of film.\r\n\r\nLuc Besson writes and directs a film that sees Scarlett Johansson duped into being a drug mule, with the transportation of drugs sewn into her abdomen. It's a new drug, boy is it a new drug, and when things go belly up and the drugs are unleashed into Scarlett's system, she's a threat - or hope - to mankind.\r\n\r\nIt can be, and has been, called pretentious et al, such is the science factor, which is perfectly understandable, so any hope of tight science fiction musings will only end up in a crushing disappointment. Undeniably Besson and his backers thought they had something to say, to open up the film watchers' minds to something deep and probable, to be relevant and viable. But unlike the makers we the viewers didn't have access to donepezil, so we sadly couldn't all turn into Bradley Cooper and be limitless in our viewing capabilities.\r\n\r\nPersonally, it's a rollicking fun film for two thirds, when it's about Scarlett kicking butt, a revenge driven babe, it grips and shakes all the genre compliant cinematic senses. The ending, the grand finale, infuriated me, and by the looks of Morgan Freeman (coasting for easy money), he was also a little frustrated. But I had fun, yet on the flip side if anyone fronted me up and said they hated the film with a passion? Then I would understand and take them home to play with my chemistry set. 7/10", "created_at": "2015-11-07T04:20:14.571Z"}, {"movie_id": 240832, "review_id": "5af5f3390e0a2631b700238a", "author_rating": 8.0, "review_text": "A lot of people appears to have gotten into some hate-mode when watching this movie. I guess they did not check up what the movie was really about before watching it. The movie is not perfect, it has its flaws, but a 1 or 2 star bullshit rating is hugely unfair. Personally, I really liked this movie. It is science fiction, pure and simple. If you expect science without the fiction, well then you should go and see some other movie. With Luc Besson both writing and directing and statements like “merciless warrior evolved beyond human logic” in the blurb … well I got pretty much what I expected.\r\n\r\nThe movie starts off making you think it is a “simple” revenge story with science fiction elements in the form of the superhuman Lucy. However it gradually evolves into something else. Lucy knows that she cannot survive in her new state and it becomes a quest to preserve the knowledge that she has acquired while she still has the time and at the same time dodging the drug dealers that are the cause of her situation in the first place.\r\n\r\nLucy is great. Her powers and how they develop are awesome. I really like surprise effects in movies and books of the kind that you get when someone like Lucy reveals her powers to the “mundane”. Especially when the revealing means swatting a few bad guys. This movie is full of moments like that. It is quite a roller coaster ride of action with Lucy exhibiting her growing powers. Not too surprisingly the movie is also full of scientific bullshit and plot holes. I do not really care. I’m in for the ride and it is a fun ride.\r\n\r\nScarlett Johansson is very good in her role as Lucy. Most of the other actors are ok although the Asian drug boss could have been better. He came out more like a brainless thug than anything else. Certainly not as the mastermind of a criminal organization.\r\n\r\nThe ending was a bit unsatisfactory compared to the rest of the movie though. I was a bit disappointed that the big fight at the end more or less was done without Lucy. The long cinematic sequences where Lucy wondered about in time and space felt a bit like yawn-filler-material. The actual ending, well that “I am everywhere” bit was really been there, seen that, done that. Also, if she was indeed everywhere, why the hurry to create that fancy memory stick?\r\n\r\nAnyway, apart from that I really enjoyed this movie.", "created_at": "2018-05-11T19:47:05.136Z"}, {"movie_id": 240832, "review_id": "5f21a9d25b2f4700354ceeb9", "author_rating": 9.0, "review_text": "_**Time to GROW UP**_\r\n\r\n\"Lucy\" (2014) is about an average hot babe named Lucy, played by Scarlett Johansson, who increasingly taps into her mind's full capacity and, consequently, acquires superhuman powers (or are they just fully-human powers?). She hooks up with the leading expert on the human mind (Morgan Freeman) to share her discoveries and also teams-up with a Paris police captain (Amr Waked) to destroy the malevolent schemes of an arrogant Asian mob boss (Min-sik Choi). \r\n\r\nIt should be emphasized that this is not comic book superhero movie (Don't we have enough of those yet?), it's an ordinary-person-reaching-full-human-potential movie. There were two of these in the mid-90s, \"Powder\" (1995) and \"Phenomenon\" (1996). They're both good, but the latter played it too safe, particularly at the end, while \"Powder\" reached for greatness and got a finger in. Francis Ford Coppola added his take on the genre with 2007's \"Youth Without Youth,\" a dense film with many interesting elements; too bad he forgot to include an entertaining story. \r\n\r\n\"Lucy\" is the best of these and is, in fact, one of my all-time favorite movies. \"Lucy\" includes the mindfood of Coppola's film, but doesn't forget to be entertaining. As such, the film mixes interesting, inspiring elements with thrills, action, eye candy and ear candy (a notable score). On top of this, \"Lucy\" is stylish and \"hip,\" whatever that means; in other words, it's got pizzazz.\r\n\r\nSome complain that the film is flawed because it's based on the notion that we only use 10% of our brain power, but this is only a plot device to illustrate that most people are functioning way under their potential and are obsessed with usually worthless things and blowing precious time accordingly. Take, for instance, the people who blow hour upon hour of valuable time watching sports. Viewing a game here or there is great, but these types have lost all sense of moderation. Or how about those who feel they have to numb themselves with alcohol or drugs just to have a good time? They're, in essence, running away from reality. \r\n\r\nWhat's funny about this criticism that the film's based on humans only using 10% of their brain power is that, in most cases, the number's more like 1-2%. Lol, just kidding. (Or am I?) \r\n\r\nIn regards to Lucy's powers illustrated in the film, and the other films noted above, I've had my own run-ins with such phenomena. For instance, about seven years ago I was in bed having an intense dream when my wife burst into the room to wake me up. The smoke alarm outside the door was blaring like crazy, but there was no smoke or fire or heat. The potent energy evoked by my dream obviously set it off because, as soon as I awoke, it suddenly stopped. If there was any doubt, the same thing happened the next week. What can explain this except the untapped power of the mind and focused energy? \r\n\r\nAnother example comes to mind, albeit different: when I was around 8 years old my family and I were walking the trails of Theodore Wirth Park in Minneapolis when we came to the edge of a baseball field. As soon as we entered the outfield somehow I just knew that the current batter was going to hit the ball and it was going to hit me right in the face. I knew this but I didn't know how I knew it. I just knew. Next thing you know the batter hits the ball high into the air -- it was like slow-motion -- and it came and hit me right on the cheek! (Good thing it was a softball, huh?). How did I KNOW this was going to happen? I don't know, but it's pretty amazing and it shows the power of the mind and spirit to warn us, which some call intuition.\r\n\r\nLess spectacular is something that I experience every day with my wife: One of us will be thinking something and give voice to it and the other says, \"I was thinking the exact same thing.\" What's going on? We're picking up each other's immaterial thoughts, otherwise known as telepathy. What if we developed this further? Other paranormal phenomena featured in the story include psychokinesis, extraordinary empathy and what the Bible calls \"the word of knowledge.\" Although they're exaggerated in the film, they're REAL.\r\n\r\n\"Lucy\" is inspiring in that it's an encouragement to GROW UP. As Lucy evolves she stops at her apartment and runs into her roommate, who's the typical bimbo party girl who spends too much of her free time \"partying\" and pursuing a \"cute guy with nice buns\" (or however she puts it). Not that there's anything intrinsically wrong with these things, except that these people obsess over them and they become their PURPOSE for living. Whatever happened to \"All things in moderation\"? The beginning of the movie shows that Lucy was just like her roommate but something happened and... she GREW UP.\r\n\r\nMy praise of the movie's philosophical and theological ideas shouldn't be interpreted to mean that I agree with every jot and tittle. It's a sci-fi/thriller blockbuster, after all; it's just that this one has more interesting ideas than most. Secondly, who agrees with everyone about everything? Is that even healthy?\r\n\r\nNeedless to say, I love \"Lucy\"! \r\n\r\nThe film doesn't wear out its welcome at a mere 1 hour, 29 minutes, and was shot in Taiwan, France and a German airport.\r\n\r\nGRADE: A", "created_at": "2020-07-29T16:54:42.980Z"}, {"movie_id": 240832, "review_id": "64788718076ce800a8221abe", "author_rating": 8.0, "review_text": "It would be easy to say this is a bad movie, if you wanted to be narrow-minded, but if you're willing to give it a chance it's really pretty good. Not great, but good. It comes at you head-on with some pretty cool and unusual perspectives. I mean, a philosophical action movie. You don't see many of those around. Ok, the philosophy falls short because the script just isn't clever enough but, it's a nice idea. And making the lead a woman was a bold touch. Bring the popcorn but keep a couple of your brain cells awake too. Oh, and if you honestly believe the myth that humans don't use 100% of their brains then there are a few scientists you need to talk to.", "created_at": "2023-06-01T11:55:04.236Z"}]