[{"movie_id": 406759, "review_id": "61fde077fcec2e00e14529aa", "author_rating": 3.0, "review_text": "With Moonfall, Roland Emmerich has essentially made an even dumber version of Michael Bay’s Armageddon. There’s not a lot to enjoy here apart from K.C. Houseman’s house cat being named Fuzz Aldrin. With its idiotic premise, hammy dialogue involving some of the most exaggerated emotional speeches ever, stiff acting, unfunny humor, and purposely distorted CGI, Moonfall features an overwhelming amount of frenetic nonsense and has no excuse to be as boring as it is.\r\n\r\nFull review: https://boundingintocomics.com/2022/02/04/moonfall-review-its-raining-moon/", "created_at": "2022-02-05T02:27:03.725Z"}, {"movie_id": 406759, "review_id": "6203a10bea37e0009451a99f", "author_rating": 9.0, "review_text": "After watching the movie, I thought that if I had watched it on a streaming platform I would wish I caught it in the cinemas. Luckily I watched it on an IMAX cinema so the screen was huge and the sound was great, dialague was loud and clear. It had an entense tone to it to keep my attention. There were jokes here and there, but nothing major to distract me at all. I liked that it starts a bit slow and builds up, the second half is what remind me why I go to the cinemas, non-stop action and greatly done shots that you wish to put on your computer screen. It's science fiction film that captivates your imagination. The plot and ideas I found very interesting. I enjoyed the movie, so I would recommend to catch it in the cinemas. Bigger cinema, the better. My only complaint is that it couldn't take advantage of the full IMAX screen that was available, probably due to budget constraints.", "created_at": "2022-02-09T11:10:03.254Z"}, {"movie_id": 406759, "review_id": "620ee562aa7898001b5b7e19", "author_rating": 6.0, "review_text": "A bit messy, this.\r\n\r\n<em>'Moonfall'</em> is actually good in areas that I was expecting it to be bad in and bad in areas I thought it might've been good in. I had caught one of the trailers - at the cinema for a different film - and didn't hold high hopes for it, especially with the <em>'<a href=\"https://letterboxd.com/film/dont-look-up-2021/\" rel=\"nofollow\">Don't Look Up</a>'</em> similarity, though thought the humour/silliness might carry it over the line.\r\n\r\nYet, the humour is poor and it's in fact the more serious elements that come to the fore. I honestly enjoyed the sci-fi bits of it and the more dramatic stuff. The comedy is very lame, I don't think I even smirked once to be honest. They should've just played it totally straight, in my opinion anyway. The special effects, meanwhile, are a positive.\r\n\r\nThe cast, when not comedic, work fairly well together. Halle Berry, John Bradley - who may be at the front of the limp jokes but he as an actor is likeable enough that I didn't dislike him at all - and Patrick Wilson - who I always forget the name of, I was literally trying to recall him throughout the film and I still didn't crack it - are a solid trio when serious. The support cast, spearheaded by Michael Peña, are meh.\r\n\r\nUnfortunately it's a 6/10 rating from me. I do like disaster movies - <em>'<a href=\"https://letterboxd.com/film/2012/\" rel=\"nofollow\">2012</a>'</em>, Roland Emmerich's best, is great - but this one fell short; particularly towards the end. I wouldn't, personally, say it's as bad as that average rating chart suggests, but to each their own of course.", "created_at": "2022-02-18T00:16:34.839Z"}, {"movie_id": 406759, "review_id": "62dc23ef58361b004ca4b7d3", "author_rating": 2.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Moonfall is as insanely nonsensical as one could hope/expect, but it's the lack of entertaining sequences for most of the runtime that brings the film down. The balance between the different, simultaneous action set pieces suffers immensely due to the underdeveloped, bland characters, and the incoherent, messy editing work doesn't help.\r\n\r\nDisaster movies always ask for suspension of disbelief, but Roland Emmerich really stretches the absurdity levels by co-writing one of the most scientifically ridiculous screenplays in the history of cinema - the third act revelations are genuinely jaw-dropping.\r\n\r\nA surprisingly dull disaster flick across the board, whether it's about the story, action, or even the performances.\"\r\n\r\nRating: D-", "created_at": "2022-07-23T16:38:07.370Z"}, {"movie_id": 406759, "review_id": "631fa80b568463007e346482", "author_rating": null, "review_text": "Put on my Letterboxd shirt and went to the theater to see Moonfall, for the movies ✊\r\n\r\nDumb, ambitious, and fun! A little tedious and laughable at times (some of these line deliveries, man), but I loved it :)", "created_at": "2022-09-12T21:43:39.343Z"}, {"movie_id": 406759, "review_id": "63ea47366c849200851c073e", "author_rating": 7.0, "review_text": "Is this a good movie? Well, if you expect some reasonable scientific accuracy or a story that is logical then hell no! If however you only seek two hours of entertaining action-adventure and a shitload of special effects, then it is a pretty good movie.\r\n\r\nThe story behind this movie is ludicrous to say the least. There are so many holes in it, so much scientific bullshit and so much illogical behaviour by everyone involved that this would be a very, very long post should I list them all.\r\n\r\nBy the way, the rest of this review might contain a spoiler or two if you have not yet seen the movie.\r\n\r\nEven if we ignore the absolutely nonsensical notion that you could actually cram a white dwarf star into the moon without it affecting Earth, like tearing it apart, the story is ludicrous to say the least.\r\n\r\nI would say that the notion that NASA, after the space shuttle clearly being hit by a foreign object would not only decide to hide behind some bullshit human error excuse but also get away with it is rubbish. But then, after two years with a senile sock puppet claiming to be the president of the United States and seeing how one lie after another, each one more obvious and ludicrous than the next, have been spewed out as well as bolstered by a completely biased, borderline criminal, mainstream media and tech industry, maybe it is not that far fetched.\r\n\r\nThen we of course have the usual Hollywood “features” like a main character that starts off by being a reckless and utterly stupid moron, people just standing there and staring, and doing nothing, at bad things approaching and so on and so forth.\r\n\r\nHowever, if you put your brain in idle, something that you have to do more often than not when it comes to Hollywood movies today, this is actually a quite entertaining movie. At least as far as I am concerned.\r\n\r\nYes, it is predictable as hell but it is still a good action-adventure and the nonsensical story behind it allows for some unusual and spectacular special effects. The special effects are of course making up for most of the stars I was willing to give this movie. It is more or less the reason to watch it.\r\n\r\nOne good thing about the movie though, is that it is refreshingly void of woke and political bullshit preaching. No green propaganda or gender or race crap. Well unless you count the US military being portrayed as the usual morons that they are in Hollywood movies of course. Seriously? Even if you managed to fire Earth’s entire nuclear arsenal into the moon it would have zero effect. But then again, with woke asshats like General Milley you never know.\r\n\r\nBottom line, despite the absence of science a ludicrous story, to me, this was a quite entertaining (science) fiction movie with plenty of special effects and action.", "created_at": "2023-02-13T14:20:38.409Z"}]