[{"movie_id": 324849, "review_id": "58e3b75892514127f00211ac", "author_rating": 7.0, "review_text": "How do I feel about _The Lego Batman Movie_? Pissed off. That's how I feel. Pissed off that to get another great Batman movie, we had to wait 5 years and for bloody LEGO of all properties to get their hands on the damn thing.\r\n\r\nSeriously though _Lego Batman_ is pretty gold. Most of all I would recommend it to Batman fans, because there's a couple of tiny little off-the-cuff references you'll get an extra kick out of, but it'll also work for fans of the original _Lego Movie_, and for kids too.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-04-04T15:10:16.195Z"}, {"movie_id": 324849, "review_id": "593a32fec3a36823050083b3", "author_rating": null, "review_text": "DA DA DA DA BATMAN - I MEAN: LEGO BATMAN\r\nNot only in the fun style of the recent Lego film but the 1965-1068 TV show from Fox and Greenaways with DC with Adam West and Burt Ward, and which was produced and narrated by Bill Dozier with bat gusto, this is the second Lego film and the first real fun Batman film and treatment since that 1960s series (which, by the way, had its OWN 1966 Batman movie!). Susan \"Pewter\" Bennett, btw,also is Siri and is billied as such. Also another unique female voice:Jenny Slate (\"Bellwether\" in Zootopia) is Harley Quinn. Numerous funny song references make this an excellent movie..", "created_at": "2017-06-09T05:32:46.034Z"}, {"movie_id": 324849, "review_id": "59976b9b92514163ca000ab5", "author_rating": 8.0, "review_text": "**All important movies start with a black screen...**\r\n\r\nAs the new millennium began, alongside the LEGO films born, but it all started with the song, the breakthrough song 'Everything is Awesome' a couple of years ago. Since then, we all thought LEGO was a new format in 3D animation like Anime in 2D Animation. So I was expecting very eagerly what could be the second LEGO film. When they had announced it was going to be 'Batman', many 'Batman' fans were elated. So here we are.\r\n\r\nIt took a longer time than expected to hit the screen. I'd lost hope in this, because all the sweet memories of the firs LEGO film were fading away from me. So I could not say or think anything about it. That's all changed once I watched it. While watching it, everything was restored like waking up after I was knocked down with a big blow to the head. That reminded how badly I missed it. One of the best animations. It can't be compared to the normal animation. It is more like a jerky type, similar to stop-motion, but done in softwares.\r\n\r\nAnyway, it was not about the animation. It was the story and dialogues. The best Batman film was a very serious film, but this one was so fun. For all ages, a non stop entertainment guaranteed. The surprise was all the villains coming together in one place. When the Batman ignores his arch-rival, the Joker, he is set to redefine his position to fight the Batman. His comeback endangers the whole Gotham city. Then the black clad, the Batman, with the support of his sidekicks, fights to save the city from devastating. The remaining is how it all ends.\r\n\r\nThe voice-over artists were awesome, but first, my praise goes to the screen and dialogue writers. As I said, nothing was great in animation, especially if you had seen the previous LEGO film. All one can see is LEGOS everywhere, the world, the city, the characters made of LEGOS and then even the explosives and other special effects are kind of LEGO brick style visual. But top to bottom a very enjoyable film. An animation that should not be missed. Probably it could contest in the upcoming Oscars. Now all my eyes are towards 'Ninjago'. Bring it on.\r\n\r\n_8/10_", "created_at": "2017-08-18T22:35:07.006Z"}]