[{"movie_id": 126889, "review_id": "590f90fac3a36864d4026534", "author_rating": null, "review_text": "\"At times a thrilling, stomach-churning journey, but one that leaves those on board wondering if the disorientation and down time was worth the investment...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/5/8/alien-covenant.html", "created_at": "2017-05-07T21:26:18.226Z"}, {"movie_id": 126889, "review_id": "5915da5f92514157230206c7", "author_rating": null, "review_text": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.\r\n\r\nPrometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism.\r\n\r\nEspecially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost.\r\n\r\nHe of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach.\r\n\r\nWe're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members.\r\n\r\nReluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet.\r\n\r\nThat's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt.\r\n\r\nI also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.\r\n\r\nWe also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool.\r\n\r\nJust it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage.\r\n\r\nThe biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase.\r\n\r\nThe aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make.\r\n\r\nIt's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry.\r\n\r\nThe promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged.\r\n\r\nThe characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here.\r\n\r\nBilly Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation.\r\n\r\nBut at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys.\r\n\r\nFinally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes.\r\n\r\nThere are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.\r\n\r\nSo I go 5/10. For more reviews, check me out on Youtube here- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "created_at": "2017-05-12T15:53:03.805Z"}, {"movie_id": 126889, "review_id": "5916a5cfc3a36840aa0289e4", "author_rating": 4.0, "review_text": "I had a few reservations going in to _Alien: Covenant_. In my opinion there hasn't been a truly great entry to the franchise since _Aliens_, so I was worried that the statistics were against it. I thought _Prometheus_ was incredible from a technical standpoint, but not a very engaging movie, and I was worried we might get the same here. The trailers had been mostly good but I was worried I had seen too much of the third act in them, and I was worried this would spoil the experience for me a little.\r\n\r\nWhat I was not worried about was within ten minutes of the damn thing starting I would think to myself: \"Wow, this movie is really poorly made.\"\r\n\r\nWell I guess I'm an idiot because that is exactly what happened. And that feeling never entirely abated over the course of the whole thing.\r\n\r\nDon't get me wrong, it's no \"_AVP: Requiem_\", but I was still very disappointed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-05-13T06:21:03.923Z"}, {"movie_id": 126889, "review_id": "5916e8fac3a3683fb602cd2f", "author_rating": 5.0, "review_text": "**Limps along under the weight of its own importance.**\r\n\r\nI love my films dripping with self importance and this one is definitely one of them.  I can't get enough of these films that positively bubble over with a high handed, serious and arrogant attitude that indicates that there is no film quite as important as this one.\r\n\r\n\r\nThis film knows it all. It knows everything that we- the lowly, pathetic and simple minded audience do not know and could not ever possibly know because we are not intelligent enough to grasp anything, you see?\r\n\r\nFor such an authoritative, superior and intelligent film - I find it odd that every character stumbles around like a simple minded cretin making unwise decision after unwise decision.\r\n\r\n\r\nRidley and his scriptwriters seem to think that they are intellectuals but somehow they just _can't pull off_ the role of **being** an intellectual.\r\n\r\n- Simon Quinlank", "created_at": "2017-05-13T11:07:38.838Z"}, {"movie_id": 126889, "review_id": "5923ecf7c3a368044d00a533", "author_rating": 6.0, "review_text": "I agree with most of the negative comments about this movie.It is a gigantic missed opportunity.My biggest issue apart from the utter predictability and nonsensical,inept script,was the disappointment of seeing 'Prometheus' mixed up with 'Alien'\r\nAlien covenant gets locked up in its own self importance while forgetting why we loved 'Alien' in the first place.I really wanted to like it but came a way  with a huge sense of disappointment", "created_at": "2017-05-23T08:04:07.517Z"}, {"movie_id": 126889, "review_id": "5983babf9251410759000836", "author_rating": null, "review_text": "Not sure about all the bad reviews, I enjoyed the movie.  I'm guessing because I wasn't expecting it to be particularly cerebral.  Its a sci-fi/horror flick, I was looking forward to Sir Ridley Scott coming up with new and disgusting ways to terrorize the cast and I wasn't disappointed.  Of course, the android going rogue was pretty obvious, but if the Star Wars franchise can feature a planet destroying space station in 3 of 7 movies, I'll give Sir Ridley a pass.  If you are looking for the loose ends from Prometheus to be tied up, I suggest you include Sir Ridley in your prayers so he can survive long enough (the man is friggin 80) to film the prequel to _Covenant_ currently titled _Awakening_ that will hopefully meet your expectations.", "created_at": "2017-08-04T00:07:27.116Z"}, {"movie_id": 126889, "review_id": "59843bcec3a36875730003c1", "author_rating": 10.0, "review_text": "Watched Alien: Covenant a 3rd time. It is a lot better than first meets the eye. The drastic difference from what we were expecting in direction from Prometheus threw all of us off. We had expectations of what we would get to see and we didn't get those. There is so much detail and such good acting. It takes multiple watches to pick up on it all. It blends the styles of Alien, Aliens, and Prometheus all together and does it very well. There is also a lot of subtle reference to Terminator 2. The dynamic between the androids Walter and David and the acting that went into that is something quite special. In that alone is a reference to T:2. My first 2 watches I didn't appreciate the android Walter like the character deserves. I was biased against his character in light of the android David. The android Walter and how he was portrayed also blends the style of android we see in Aliens. The actor's voice and demeanor reflect that of the android Bishop and gives us a bridge to his design. Michael Fassbender really did one hell of a job acting those two parts of Walter and David. Near the end of the movie there is another nod to T:2 as a beam is clearly marked as such and the scene that follows has a strong T:2/Aliens sequence and taste in styling to it. Through and through the acting is very good. Details are abound everywhere. There are a few points of rather convenient plots however overall the film is now among my favorites right along side Aliens and T:2.", "created_at": "2017-08-04T09:18:06.121Z"}, {"movie_id": 126889, "review_id": "59c62a13c3a3681461037321", "author_rating": 7.0, "review_text": "Even the monkeys stood upright at some point.\r\n\r\nHee! Ridley Scott, it seems, is damned if he does and damned if he doesn't as regards the Alien franchise he so gloriously kick-started back in 1979. Prometheus was too cerebral for many and definitely bogged down by expectation levels. Not without flaws of course, but a very tidy science fiction piece it be. So we roll on to Alien Covenant, which while not universally reviled, has certainly garnered some fearful scorn in Alien franchise fan circles.\r\n\r\nAlien Covenant is a cover version, no two ways about it, it's a retread of what was showcased in 1979, only with the tie-in to Prometheus and a continuation to the origins of Xenomorph and pals. Clearly we have a case of Scott making one for the fans, a return to chest busting goo and space adventurers under great duress, all of course while he fills in the blanks as well. For sure it's lazy when put up against Alien, and indeed against his other superlative sci- fi offerings such as Blade Runner and The Martian, but for those who lambasted Prometheus for its non Alien conventions, you have now got what you hankered for. Any expectation of this turning out to be a fresh masterpiece was always going to be crushed, so really it's best viewed as a loving retread. Yes! Bad science, plot and logic holes, average acting etc, these rightly don't deserve forgiveness, but it's hardly the devil's spawn here, in fact its's great fun as much as being a visual treat.\r\n\r\nLog cabin on the lake.\r\n\r\nWe start with a prologue involving Weyland and David, the conversation involving creation, the most pertinent of which being the question of the ages, where do we come from? Then after a tantalising tinkle of the ivories for Wagner's \"The Entry Of The Gods Into Valhalla\", we are whisked into outer space 2104 to be in the company of the Colonisation Vessel Covenant. Crew 15 - Colonists 2000 - Embryos 1140. The destination is ORIGAE - 6, ETA in 7 years and 4 months. Only Walter the Android (Michael Fassbender) is awake, until it's time for the crew to be abruptly awakened from their hyper sleep...\r\n\r\nCrusoe and the pathogen.\r\n\r\nFrom the off disaster strikes, thrusting the crew into emotional strife. Characters are introduced, conversations and traits establishing the bare minimum that we need to know, then a ghost transmission is received from Sector 87, planet number 4, and off we go into familiar territory. Things inevitably go from bad to worse and the action, blood flow and creature feature conventions are all laid out for our digestion. There's some surprises in store, with Fassbender a double bonus, and there's some striking chatter ranging from if there's benefits of the human race? and even that involving the poets Byron and Shelley.\r\n\r\nBed Bugs.\r\n\r\nWho will survive? If anyone? Just what does the finale have in store? As we get devilish answers, and the barn storming aural pleasures of the full orchestral version of \"The Entry Of The Gods Into Valhalla\", it's tied up nicely and the pulse rate can settle. Job done. No bar raising here, no film to push the space lander out into new dimensions, just a good honest sci-fi thriller to be viewed with that in mind. 7/10", "created_at": "2017-09-23T09:32:03.935Z"}, {"movie_id": 126889, "review_id": "59ec96f8925141245f0034a5", "author_rating": 7.0, "review_text": "**Good robot! Bad robot!**\r\n\r\nAfter some gaps, the 'Alien' franchise came alive with the prequel 'Prometheum' which originally said to be a spin-off. Particularly, it landed in the hands of the original maker. Now, even the original title back in action. It's another prequel, hence the prequel series on the making. The next film too will be the same kind, before the overall storyline in the franchise align in a straight line.\r\n\r\nI enjoyed it. But not as good as 'Prometheum' or the first two 'Alien' films. The issue with it was, the same old cliché. There's nothing in the story. It was like any space film that's set in a similar fashion. The 80 per cent of the film was what we had seen in the earlier 'Alien' films. Just altered scenes with a new cast and a great visuals. So the update makes it the special.\r\n\r\nThe story focused too much on the robot. The alien parts were reduced. Because it was like the first appearance of the original aliens we saw in the old films. Precisely to say, the origins. Genetic modification, crossbreeding, there comes the beast. From this film what I have learnt was, it was nothing but more or less the same old fear the humans have about that the robots which are the ones going to make humans go extinct. Except here the aliens come between them. Hence, falling prey to the same clichéd theme from any sci-fi that had humanoid.\r\n\r\nNevertheless, well maintained film in its balance coming from previous hits in the series and going forward to bring more hits. This flick would serve as a fine bridge between them. So only 18 years to go between this, from 2104 to 2122. I'm already anticipating the next film. As I have heard, that film would be focused more on the robot. That's going to be a different experience. Fassbender's time to have some space adventures.\r\n\r\n_7/10_", "created_at": "2017-10-22T13:02:48.742Z"}, {"movie_id": 126889, "review_id": "5a83eb1c9251410b4d0065df", "author_rating": 4.0, "review_text": "I paid to see the movie, just to see what all the hype was about. It's a mess, of course, from David going Nazi and practicing genocide, to the mindless violence of \"an earthworm impaled on a hook to catch fish,\" to space idiots/children who aren't smart enough to be hall monitors. \r\nI had wondered why some folk considered the first three \"Alien\" movies Canon and NOT the current set. \r\nI'm with the \"three and done\" crowd, this movie is a Hollyweird popcorm flick. \r\n\"Do not watch this movie. God complexes and stupidity abound. Stay away if you value your peace of mind.\" (Repeating acoustic beacon)", "created_at": "2018-02-14T07:54:04.091Z"}, {"movie_id": 126889, "review_id": "5e3eda27ae36680019cb7717", "author_rating": 9.0, "review_text": "Though Michael Fassbender did a sublime job and the movie itself was visually immersive, the actions of the main characters did not seem very smart. I could forgive the decision that the newly installed captain Oram (Billy Crudup) took about going to the unknown planet. But everything that happened after David cut his hair exactly the same way Walter head just makes you shake your head in amusement and think ‘Oh, come on!’. \r\nDavid, obsessed with the act of creation that had value in its end, uses any means available. It is remarkable that no one from the remaining crew has questioned imposter Walters’s identity and just carried on like the worst was left behind. Meanwhile, the last scene when Daniels (Katherine Waterston) realizes (finally!) that Walter is, in fact, David and she had totally screwed up with the thousands of colonizers and embryos on the ship… does give you slight goosebumps.", "created_at": "2020-02-08T15:56:23.423Z"}, {"movie_id": 126889, "review_id": "5fa753e2519bbb003c534f4b", "author_rating": 9.0, "review_text": "I would hate to be in the shoes of a filmmaker that needs to please a rabid fan base. The \"Star Wars\" sequels are a perfect example of this. Ridley Scott has the same challenge with the \"Alien\" prequels which you see in user scores. \r\n\r\nI loved \"Prometheus\" with its attempt at something bigger than just more face huggers and xenomorphs wreaking havoc. It was clear he was building a grander story to the eventual bridge to the original \"Alien.\"   \r\n\r\nHe continues that bigger story with \"Alien: Covenant\" and whether he meant to provide fan service or not, we get that with face huggers and xenomorphs. (No spoiler as both are in the trailers.) \r\n\r\nDo yourself a favor and watch the short clip \"Last Supper\" (youtu.be/EkXgRlRao5I ) before you watch the movie. At only five minutes, it gives a better introduction of the Covenant crew than the movie does providing deeper emotional investment in these characters.  \r\n\r\nUltimately \"Alien Covenant\" delivers an excellent, fast-paced sci-fi action horror thriller (yes, it hits that many genres) like only Ridley Scott can that continues exploring the \"Prometheus\" theme of creation.", "created_at": "2020-11-08T02:11:46.534Z"}, {"movie_id": 126889, "review_id": "6218190bd144430065347411", "author_rating": 7.0, "review_text": "I like how gory <em>'Alien: Covenant'</em> is, though apart from that there isn't much to shout about. It's good, but that's it.\r\n\r\nI'd say it's one of the weaker cast lists of the franchise, not that I have anything against the performances here but I wasn't blown away or overly interested in anyone in this 2017 production. Michael Fassbender is the obvious standout from an acting viewpoint, though I don't really dig his character all that much to be honest. The rest are a bit forgettable.\r\n\r\nYou can tell it's well made and it does look the part, with it being worth the watch to complete the franchise and all that. Of the sixth films, though, it'd be in my personal bottom two <em>(*excl. short films)</em> - in fairness, that isn't as bad as it sounds, it's just the series has seen better.", "created_at": "2022-02-24T23:47:23.623Z"}, {"movie_id": 126889, "review_id": "625fdddd322b2b00666a3451", "author_rating": 6.0, "review_text": "Initially, I thought this was just a pretty shameless attempt to attach the \"Alien\" brand to the really mediocre \"Prometheus\" (2012) but to be fair, it is just a little more than that. The crew of a colonial exploration ship are heading to a new word when their crew are tempted by a bit of John Denver, and divert to a seemingly far more suitable planet. Of course, once they land they begin to realise that nothing is as idyllic as they had hoped, and getting off as soon as possible is now the order of the day. It's almost 40 years since the first film of this strand, and that renders most of the shock value pretty impotent. We have all already been through the gamut of terror that these stories deliver and even though Sir Ridley Scott is an old hand at creating a sense of menace, it's all just a bit so what with this predictable plot that ends, then it ends, then it... ends! Michael Fassbender is quite effective as \"David\" but the rest of the cast, including the usually reliable Billy Crudup have little by way of original substance to get their teeth into. It is certainly a good looking film, but that's what is expected, it is the derivative storyline that lets it down. Indeed, it did remind me of an old \"Star Trek\" episode with some mythological \"Sirens\" thrown in for good measure. Still, it is quite watchable, just not a film I expect you will ever remember.", "created_at": "2022-04-20T10:18:05.306Z"}, {"movie_id": 126889, "review_id": "63c1e2a9df857c007cbe7f7d", "author_rating": 1.0, "review_text": "Well, it's slightly better than Prometheus, that's something. It's a little bit closer to the monster movie that was Alien...but closer does not mean that it comes anywhere near being as epic as it's 1979 mother...queen...whatever.\r\n\r\nIt's still putting on airs. It's still living under the delusion that it's something closer to \"Chinatown\" than, well, a monster movie in space.\r\n\r\nI don't want to see an Alien movie that thinks its \"Raging Bull.\" It doesn't really work that way. I want to see and Alien movie that knows its an Alien movie.\r\n\r\nSimplify Man!!!!!!! You're a monster movie in space...most of the time...and a space marine movie the rest of the time. Either way you have no reason to throw so much crap against the wall. You don't need it all to stick!!!!!\r\n\r\nYou're an Alien movie, you don't need to be deep, you just need to be scary. that's all you need to do. And, maybe have Ripley, because she rocked.\r\n\r\nBut, honestly, the Alien movies are monster movies.\r\n\r\nThese films have forgotten that.", "created_at": "2023-01-13T23:00:57.497Z"}, {"movie_id": 126889, "review_id": "643637c91f748b007714fe65", "author_rating": 8.0, "review_text": "**Good Sci-fi** 👍🏾\r\n\r\n", "created_at": "2023-04-12T04:47:06.035Z"}, {"movie_id": 126889, "review_id": "6441e4f3e2bca804df430db2", "author_rating": 6.0, "review_text": "**With strengths at a visual and technical level, it would be much better with a more developed and better written script.**\r\n\r\nI don't know if I'm the only person to say this, but I think a horror movie works better if we see some intelligence in the script and in the characters' attitudes, and if the main antagonist is mysterious and able to surprise us. I liked “Prometheus”, a film better than expected, albeit with a confusing script. This film establishes a clearer, more palpable link between that film and the “Alien” franchise. The script accompanies the “Covenant”, a colony ship filled with people in hypersleep. The ship receives a mysterious signal from a planet that, by all indications, has excellent conditions for life, but quickly realizes that it has stumbled on a place where it should never have landed. After seeing the film, I had the feeling that we were looking at a very solid work that only lost when compared to the original franchise. Perhaps the best way to be fair is really to avoid this comparative exercise, which is seductive and almost impossible not to do.\r\n\r\nShall we start with the good things? Very good! The film is a sight for sore eyes, especially for sci-fi fans and for those who like very visual films with high doses of special effects, CGI or extraordinarily detailed scenarios. There is no doubt that the budget had a generous slice set aside for computer technicians, art and costume designers and cinematography, and this investment has paid off handsomely. Everything is accompanied by an excellent soundtrack and good sound effects. And of course, there are lots of tense scenes. It is one of those films where the tension is permanent, but which never really scares us.\r\n\r\nSadly, that's basically all this movie has to offer us. Fans of the Alien franchise will ensure that the film clarifies several gray points in the narrative of other films, such as “Prometheus”, and I agree with this argument, but this does not seem to me to be something that we should overestimate, because it really was the least that could be done. demanded from this film! At the script level, it is frankly disappointing: in addition to being lazy, making the most of what was done for the other films with which it is linked, it adds few new things. Yes, it creates some new creatures, “cousins” of the original xenomorph, but that's all. The human or semi-human characters are silly, devoid of development and seem to be waiting to be killed.\r\n\r\nThe film starts out great, but becomes slow and tiresome as it becomes predictable. I have a high regard for Ridley Scott's work, I think he's a very skilled and credited director, but it's hard not to acknowledge that he failed here. The director was dazzled by the amount of CGI potential and neglected the narrative, editing and direction of the actors. Among the actors, Michael Fassbender stands out the most. The actor has given us one of his best works so far. Katherine Waterston also did a very good job. The rest of the cast doesn't have the time or material to do anything special.", "created_at": "2023-04-21T01:20:51.312Z"}, {"movie_id": 126889, "review_id": "590f90fac3a36864d4026534", "author_rating": null, "review_text": "\"At times a thrilling, stomach-churning journey, but one that leaves those on board wondering if the disorientation and down time was worth the investment...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/5/8/alien-covenant.html", "created_at": "2017-05-07T21:26:18.226Z"}, {"movie_id": 126889, "review_id": "5915da5f92514157230206c7", "author_rating": null, "review_text": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.\r\n\r\nPrometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism.\r\n\r\nEspecially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost.\r\n\r\nHe of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach.\r\n\r\nWe're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members.\r\n\r\nReluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet.\r\n\r\nThat's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt.\r\n\r\nI also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.\r\n\r\nWe also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool.\r\n\r\nJust it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage.\r\n\r\nThe biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase.\r\n\r\nThe aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make.\r\n\r\nIt's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry.\r\n\r\nThe promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged.\r\n\r\nThe characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here.\r\n\r\nBilly Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation.\r\n\r\nBut at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys.\r\n\r\nFinally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes.\r\n\r\nThere are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.\r\n\r\nSo I go 5/10. For more reviews, check me out on Youtube here- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "created_at": "2017-05-12T15:53:03.805Z"}, {"movie_id": 126889, "review_id": "5916a5cfc3a36840aa0289e4", "author_rating": 4.0, "review_text": "I had a few reservations going in to _Alien: Covenant_. In my opinion there hasn't been a truly great entry to the franchise since _Aliens_, so I was worried that the statistics were against it. I thought _Prometheus_ was incredible from a technical standpoint, but not a very engaging movie, and I was worried we might get the same here. The trailers had been mostly good but I was worried I had seen too much of the third act in them, and I was worried this would spoil the experience for me a little.\r\n\r\nWhat I was not worried about was within ten minutes of the damn thing starting I would think to myself: \"Wow, this movie is really poorly made.\"\r\n\r\nWell I guess I'm an idiot because that is exactly what happened. And that feeling never entirely abated over the course of the whole thing.\r\n\r\nDon't get me wrong, it's no \"_AVP: Requiem_\", but I was still very disappointed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-05-13T06:21:03.923Z"}, {"movie_id": 126889, "review_id": "5916e8fac3a3683fb602cd2f", "author_rating": 5.0, "review_text": "**Limps along under the weight of its own importance.**\r\n\r\nI love my films dripping with self importance and this one is definitely one of them.  I can't get enough of these films that positively bubble over with a high handed, serious and arrogant attitude that indicates that there is no film quite as important as this one.\r\n\r\n\r\nThis film knows it all. It knows everything that we- the lowly, pathetic and simple minded audience do not know and could not ever possibly know because we are not intelligent enough to grasp anything, you see?\r\n\r\nFor such an authoritative, superior and intelligent film - I find it odd that every character stumbles around like a simple minded cretin making unwise decision after unwise decision.\r\n\r\n\r\nRidley and his scriptwriters seem to think that they are intellectuals but somehow they just _can't pull off_ the role of **being** an intellectual.\r\n\r\n- Simon Quinlank", "created_at": "2017-05-13T11:07:38.838Z"}, {"movie_id": 126889, "review_id": "5923ecf7c3a368044d00a533", "author_rating": 6.0, "review_text": "I agree with most of the negative comments about this movie.It is a gigantic missed opportunity.My biggest issue apart from the utter predictability and nonsensical,inept script,was the disappointment of seeing 'Prometheus' mixed up with 'Alien'\r\nAlien covenant gets locked up in its own self importance while forgetting why we loved 'Alien' in the first place.I really wanted to like it but came a way  with a huge sense of disappointment", "created_at": "2017-05-23T08:04:07.517Z"}, {"movie_id": 126889, "review_id": "5983babf9251410759000836", "author_rating": null, "review_text": "Not sure about all the bad reviews, I enjoyed the movie.  I'm guessing because I wasn't expecting it to be particularly cerebral.  Its a sci-fi/horror flick, I was looking forward to Sir Ridley Scott coming up with new and disgusting ways to terrorize the cast and I wasn't disappointed.  Of course, the android going rogue was pretty obvious, but if the Star Wars franchise can feature a planet destroying space station in 3 of 7 movies, I'll give Sir Ridley a pass.  If you are looking for the loose ends from Prometheus to be tied up, I suggest you include Sir Ridley in your prayers so he can survive long enough (the man is friggin 80) to film the prequel to _Covenant_ currently titled _Awakening_ that will hopefully meet your expectations.", "created_at": "2017-08-04T00:07:27.116Z"}, {"movie_id": 126889, "review_id": "59843bcec3a36875730003c1", "author_rating": 10.0, "review_text": "Watched Alien: Covenant a 3rd time. It is a lot better than first meets the eye. The drastic difference from what we were expecting in direction from Prometheus threw all of us off. We had expectations of what we would get to see and we didn't get those. There is so much detail and such good acting. It takes multiple watches to pick up on it all. It blends the styles of Alien, Aliens, and Prometheus all together and does it very well. There is also a lot of subtle reference to Terminator 2. The dynamic between the androids Walter and David and the acting that went into that is something quite special. In that alone is a reference to T:2. My first 2 watches I didn't appreciate the android Walter like the character deserves. I was biased against his character in light of the android David. The android Walter and how he was portrayed also blends the style of android we see in Aliens. The actor's voice and demeanor reflect that of the android Bishop and gives us a bridge to his design. Michael Fassbender really did one hell of a job acting those two parts of Walter and David. Near the end of the movie there is another nod to T:2 as a beam is clearly marked as such and the scene that follows has a strong T:2/Aliens sequence and taste in styling to it. Through and through the acting is very good. Details are abound everywhere. There are a few points of rather convenient plots however overall the film is now among my favorites right along side Aliens and T:2.", "created_at": "2017-08-04T09:18:06.121Z"}, {"movie_id": 126889, "review_id": "59c62a13c3a3681461037321", "author_rating": 7.0, "review_text": "Even the monkeys stood upright at some point.\r\n\r\nHee! Ridley Scott, it seems, is damned if he does and damned if he doesn't as regards the Alien franchise he so gloriously kick-started back in 1979. Prometheus was too cerebral for many and definitely bogged down by expectation levels. Not without flaws of course, but a very tidy science fiction piece it be. So we roll on to Alien Covenant, which while not universally reviled, has certainly garnered some fearful scorn in Alien franchise fan circles.\r\n\r\nAlien Covenant is a cover version, no two ways about it, it's a retread of what was showcased in 1979, only with the tie-in to Prometheus and a continuation to the origins of Xenomorph and pals. Clearly we have a case of Scott making one for the fans, a return to chest busting goo and space adventurers under great duress, all of course while he fills in the blanks as well. For sure it's lazy when put up against Alien, and indeed against his other superlative sci- fi offerings such as Blade Runner and The Martian, but for those who lambasted Prometheus for its non Alien conventions, you have now got what you hankered for. Any expectation of this turning out to be a fresh masterpiece was always going to be crushed, so really it's best viewed as a loving retread. Yes! Bad science, plot and logic holes, average acting etc, these rightly don't deserve forgiveness, but it's hardly the devil's spawn here, in fact its's great fun as much as being a visual treat.\r\n\r\nLog cabin on the lake.\r\n\r\nWe start with a prologue involving Weyland and David, the conversation involving creation, the most pertinent of which being the question of the ages, where do we come from? Then after a tantalising tinkle of the ivories for Wagner's \"The Entry Of The Gods Into Valhalla\", we are whisked into outer space 2104 to be in the company of the Colonisation Vessel Covenant. Crew 15 - Colonists 2000 - Embryos 1140. The destination is ORIGAE - 6, ETA in 7 years and 4 months. Only Walter the Android (Michael Fassbender) is awake, until it's time for the crew to be abruptly awakened from their hyper sleep...\r\n\r\nCrusoe and the pathogen.\r\n\r\nFrom the off disaster strikes, thrusting the crew into emotional strife. Characters are introduced, conversations and traits establishing the bare minimum that we need to know, then a ghost transmission is received from Sector 87, planet number 4, and off we go into familiar territory. Things inevitably go from bad to worse and the action, blood flow and creature feature conventions are all laid out for our digestion. There's some surprises in store, with Fassbender a double bonus, and there's some striking chatter ranging from if there's benefits of the human race? and even that involving the poets Byron and Shelley.\r\n\r\nBed Bugs.\r\n\r\nWho will survive? If anyone? Just what does the finale have in store? As we get devilish answers, and the barn storming aural pleasures of the full orchestral version of \"The Entry Of The Gods Into Valhalla\", it's tied up nicely and the pulse rate can settle. Job done. No bar raising here, no film to push the space lander out into new dimensions, just a good honest sci-fi thriller to be viewed with that in mind. 7/10", "created_at": "2017-09-23T09:32:03.935Z"}, {"movie_id": 126889, "review_id": "59ec96f8925141245f0034a5", "author_rating": 7.0, "review_text": "**Good robot! Bad robot!**\r\n\r\nAfter some gaps, the 'Alien' franchise came alive with the prequel 'Prometheum' which originally said to be a spin-off. Particularly, it landed in the hands of the original maker. Now, even the original title back in action. It's another prequel, hence the prequel series on the making. The next film too will be the same kind, before the overall storyline in the franchise align in a straight line.\r\n\r\nI enjoyed it. But not as good as 'Prometheum' or the first two 'Alien' films. The issue with it was, the same old cliché. There's nothing in the story. It was like any space film that's set in a similar fashion. The 80 per cent of the film was what we had seen in the earlier 'Alien' films. Just altered scenes with a new cast and a great visuals. So the update makes it the special.\r\n\r\nThe story focused too much on the robot. The alien parts were reduced. Because it was like the first appearance of the original aliens we saw in the old films. Precisely to say, the origins. Genetic modification, crossbreeding, there comes the beast. From this film what I have learnt was, it was nothing but more or less the same old fear the humans have about that the robots which are the ones going to make humans go extinct. Except here the aliens come between them. Hence, falling prey to the same clichéd theme from any sci-fi that had humanoid.\r\n\r\nNevertheless, well maintained film in its balance coming from previous hits in the series and going forward to bring more hits. This flick would serve as a fine bridge between them. So only 18 years to go between this, from 2104 to 2122. I'm already anticipating the next film. As I have heard, that film would be focused more on the robot. That's going to be a different experience. Fassbender's time to have some space adventures.\r\n\r\n_7/10_", "created_at": "2017-10-22T13:02:48.742Z"}, {"movie_id": 126889, "review_id": "5a83eb1c9251410b4d0065df", "author_rating": 4.0, "review_text": "I paid to see the movie, just to see what all the hype was about. It's a mess, of course, from David going Nazi and practicing genocide, to the mindless violence of \"an earthworm impaled on a hook to catch fish,\" to space idiots/children who aren't smart enough to be hall monitors. \r\nI had wondered why some folk considered the first three \"Alien\" movies Canon and NOT the current set. \r\nI'm with the \"three and done\" crowd, this movie is a Hollyweird popcorm flick. \r\n\"Do not watch this movie. God complexes and stupidity abound. Stay away if you value your peace of mind.\" (Repeating acoustic beacon)", "created_at": "2018-02-14T07:54:04.091Z"}, {"movie_id": 126889, "review_id": "5e3eda27ae36680019cb7717", "author_rating": 9.0, "review_text": "Though Michael Fassbender did a sublime job and the movie itself was visually immersive, the actions of the main characters did not seem very smart. I could forgive the decision that the newly installed captain Oram (Billy Crudup) took about going to the unknown planet. But everything that happened after David cut his hair exactly the same way Walter head just makes you shake your head in amusement and think ‘Oh, come on!’. \r\nDavid, obsessed with the act of creation that had value in its end, uses any means available. It is remarkable that no one from the remaining crew has questioned imposter Walters’s identity and just carried on like the worst was left behind. Meanwhile, the last scene when Daniels (Katherine Waterston) realizes (finally!) that Walter is, in fact, David and she had totally screwed up with the thousands of colonizers and embryos on the ship… does give you slight goosebumps.", "created_at": "2020-02-08T15:56:23.423Z"}, {"movie_id": 126889, "review_id": "5fa753e2519bbb003c534f4b", "author_rating": 9.0, "review_text": "I would hate to be in the shoes of a filmmaker that needs to please a rabid fan base. The \"Star Wars\" sequels are a perfect example of this. Ridley Scott has the same challenge with the \"Alien\" prequels which you see in user scores. \r\n\r\nI loved \"Prometheus\" with its attempt at something bigger than just more face huggers and xenomorphs wreaking havoc. It was clear he was building a grander story to the eventual bridge to the original \"Alien.\"   \r\n\r\nHe continues that bigger story with \"Alien: Covenant\" and whether he meant to provide fan service or not, we get that with face huggers and xenomorphs. (No spoiler as both are in the trailers.) \r\n\r\nDo yourself a favor and watch the short clip \"Last Supper\" (youtu.be/EkXgRlRao5I ) before you watch the movie. At only five minutes, it gives a better introduction of the Covenant crew than the movie does providing deeper emotional investment in these characters.  \r\n\r\nUltimately \"Alien Covenant\" delivers an excellent, fast-paced sci-fi action horror thriller (yes, it hits that many genres) like only Ridley Scott can that continues exploring the \"Prometheus\" theme of creation.", "created_at": "2020-11-08T02:11:46.534Z"}, {"movie_id": 126889, "review_id": "6218190bd144430065347411", "author_rating": 7.0, "review_text": "I like how gory <em>'Alien: Covenant'</em> is, though apart from that there isn't much to shout about. It's good, but that's it.\r\n\r\nI'd say it's one of the weaker cast lists of the franchise, not that I have anything against the performances here but I wasn't blown away or overly interested in anyone in this 2017 production. Michael Fassbender is the obvious standout from an acting viewpoint, though I don't really dig his character all that much to be honest. The rest are a bit forgettable.\r\n\r\nYou can tell it's well made and it does look the part, with it being worth the watch to complete the franchise and all that. Of the sixth films, though, it'd be in my personal bottom two <em>(*excl. short films)</em> - in fairness, that isn't as bad as it sounds, it's just the series has seen better.", "created_at": "2022-02-24T23:47:23.623Z"}, {"movie_id": 126889, "review_id": "625fdddd322b2b00666a3451", "author_rating": 6.0, "review_text": "Initially, I thought this was just a pretty shameless attempt to attach the \"Alien\" brand to the really mediocre \"Prometheus\" (2012) but to be fair, it is just a little more than that. The crew of a colonial exploration ship are heading to a new word when their crew are tempted by a bit of John Denver, and divert to a seemingly far more suitable planet. Of course, once they land they begin to realise that nothing is as idyllic as they had hoped, and getting off as soon as possible is now the order of the day. It's almost 40 years since the first film of this strand, and that renders most of the shock value pretty impotent. We have all already been through the gamut of terror that these stories deliver and even though Sir Ridley Scott is an old hand at creating a sense of menace, it's all just a bit so what with this predictable plot that ends, then it ends, then it... ends! Michael Fassbender is quite effective as \"David\" but the rest of the cast, including the usually reliable Billy Crudup have little by way of original substance to get their teeth into. It is certainly a good looking film, but that's what is expected, it is the derivative storyline that lets it down. Indeed, it did remind me of an old \"Star Trek\" episode with some mythological \"Sirens\" thrown in for good measure. Still, it is quite watchable, just not a film I expect you will ever remember.", "created_at": "2022-04-20T10:18:05.306Z"}, {"movie_id": 126889, "review_id": "63c1e2a9df857c007cbe7f7d", "author_rating": 1.0, "review_text": "Well, it's slightly better than Prometheus, that's something. It's a little bit closer to the monster movie that was Alien...but closer does not mean that it comes anywhere near being as epic as it's 1979 mother...queen...whatever.\r\n\r\nIt's still putting on airs. It's still living under the delusion that it's something closer to \"Chinatown\" than, well, a monster movie in space.\r\n\r\nI don't want to see an Alien movie that thinks its \"Raging Bull.\" It doesn't really work that way. I want to see and Alien movie that knows its an Alien movie.\r\n\r\nSimplify Man!!!!!!! You're a monster movie in space...most of the time...and a space marine movie the rest of the time. Either way you have no reason to throw so much crap against the wall. You don't need it all to stick!!!!!\r\n\r\nYou're an Alien movie, you don't need to be deep, you just need to be scary. that's all you need to do. And, maybe have Ripley, because she rocked.\r\n\r\nBut, honestly, the Alien movies are monster movies.\r\n\r\nThese films have forgotten that.", "created_at": "2023-01-13T23:00:57.497Z"}, {"movie_id": 126889, "review_id": "643637c91f748b007714fe65", "author_rating": 8.0, "review_text": "**Good Sci-fi** 👍🏾\r\n\r\n", "created_at": "2023-04-12T04:47:06.035Z"}, {"movie_id": 126889, "review_id": "6441e4f3e2bca804df430db2", "author_rating": 6.0, "review_text": "**With strengths at a visual and technical level, it would be much better with a more developed and better written script.**\r\n\r\nI don't know if I'm the only person to say this, but I think a horror movie works better if we see some intelligence in the script and in the characters' attitudes, and if the main antagonist is mysterious and able to surprise us. I liked “Prometheus”, a film better than expected, albeit with a confusing script. This film establishes a clearer, more palpable link between that film and the “Alien” franchise. The script accompanies the “Covenant”, a colony ship filled with people in hypersleep. The ship receives a mysterious signal from a planet that, by all indications, has excellent conditions for life, but quickly realizes that it has stumbled on a place where it should never have landed. After seeing the film, I had the feeling that we were looking at a very solid work that only lost when compared to the original franchise. Perhaps the best way to be fair is really to avoid this comparative exercise, which is seductive and almost impossible not to do.\r\n\r\nShall we start with the good things? Very good! The film is a sight for sore eyes, especially for sci-fi fans and for those who like very visual films with high doses of special effects, CGI or extraordinarily detailed scenarios. There is no doubt that the budget had a generous slice set aside for computer technicians, art and costume designers and cinematography, and this investment has paid off handsomely. Everything is accompanied by an excellent soundtrack and good sound effects. And of course, there are lots of tense scenes. It is one of those films where the tension is permanent, but which never really scares us.\r\n\r\nSadly, that's basically all this movie has to offer us. Fans of the Alien franchise will ensure that the film clarifies several gray points in the narrative of other films, such as “Prometheus”, and I agree with this argument, but this does not seem to me to be something that we should overestimate, because it really was the least that could be done. demanded from this film! At the script level, it is frankly disappointing: in addition to being lazy, making the most of what was done for the other films with which it is linked, it adds few new things. Yes, it creates some new creatures, “cousins” of the original xenomorph, but that's all. The human or semi-human characters are silly, devoid of development and seem to be waiting to be killed.\r\n\r\nThe film starts out great, but becomes slow and tiresome as it becomes predictable. I have a high regard for Ridley Scott's work, I think he's a very skilled and credited director, but it's hard not to acknowledge that he failed here. The director was dazzled by the amount of CGI potential and neglected the narrative, editing and direction of the actors. Among the actors, Michael Fassbender stands out the most. The actor has given us one of his best works so far. Katherine Waterston also did a very good job. The rest of the cast doesn't have the time or material to do anything special.", "created_at": "2023-04-21T01:20:51.312Z"}, {"movie_id": 126889, "review_id": "590f90fac3a36864d4026534", "author_rating": null, "review_text": "\"At times a thrilling, stomach-churning journey, but one that leaves those on board wondering if the disorientation and down time was worth the investment...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/5/8/alien-covenant.html", "created_at": "2017-05-07T21:26:18.226Z"}, {"movie_id": 126889, "review_id": "5915da5f92514157230206c7", "author_rating": null, "review_text": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.\r\n\r\nPrometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism.\r\n\r\nEspecially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost.\r\n\r\nHe of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach.\r\n\r\nWe're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members.\r\n\r\nReluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet.\r\n\r\nThat's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt.\r\n\r\nI also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.\r\n\r\nWe also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool.\r\n\r\nJust it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage.\r\n\r\nThe biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase.\r\n\r\nThe aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make.\r\n\r\nIt's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry.\r\n\r\nThe promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged.\r\n\r\nThe characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here.\r\n\r\nBilly Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation.\r\n\r\nBut at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys.\r\n\r\nFinally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes.\r\n\r\nThere are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.\r\n\r\nSo I go 5/10. For more reviews, check me out on Youtube here- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "created_at": "2017-05-12T15:53:03.805Z"}, {"movie_id": 126889, "review_id": "5916a5cfc3a36840aa0289e4", "author_rating": 4.0, "review_text": "I had a few reservations going in to _Alien: Covenant_. In my opinion there hasn't been a truly great entry to the franchise since _Aliens_, so I was worried that the statistics were against it. I thought _Prometheus_ was incredible from a technical standpoint, but not a very engaging movie, and I was worried we might get the same here. The trailers had been mostly good but I was worried I had seen too much of the third act in them, and I was worried this would spoil the experience for me a little.\r\n\r\nWhat I was not worried about was within ten minutes of the damn thing starting I would think to myself: \"Wow, this movie is really poorly made.\"\r\n\r\nWell I guess I'm an idiot because that is exactly what happened. And that feeling never entirely abated over the course of the whole thing.\r\n\r\nDon't get me wrong, it's no \"_AVP: Requiem_\", but I was still very disappointed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-05-13T06:21:03.923Z"}, {"movie_id": 126889, "review_id": "5916e8fac3a3683fb602cd2f", "author_rating": 5.0, "review_text": "**Limps along under the weight of its own importance.**\r\n\r\nI love my films dripping with self importance and this one is definitely one of them.  I can't get enough of these films that positively bubble over with a high handed, serious and arrogant attitude that indicates that there is no film quite as important as this one.\r\n\r\n\r\nThis film knows it all. It knows everything that we- the lowly, pathetic and simple minded audience do not know and could not ever possibly know because we are not intelligent enough to grasp anything, you see?\r\n\r\nFor such an authoritative, superior and intelligent film - I find it odd that every character stumbles around like a simple minded cretin making unwise decision after unwise decision.\r\n\r\n\r\nRidley and his scriptwriters seem to think that they are intellectuals but somehow they just _can't pull off_ the role of **being** an intellectual.\r\n\r\n- Simon Quinlank", "created_at": "2017-05-13T11:07:38.838Z"}, {"movie_id": 126889, "review_id": "5923ecf7c3a368044d00a533", "author_rating": 6.0, "review_text": "I agree with most of the negative comments about this movie.It is a gigantic missed opportunity.My biggest issue apart from the utter predictability and nonsensical,inept script,was the disappointment of seeing 'Prometheus' mixed up with 'Alien'\r\nAlien covenant gets locked up in its own self importance while forgetting why we loved 'Alien' in the first place.I really wanted to like it but came a way  with a huge sense of disappointment", "created_at": "2017-05-23T08:04:07.517Z"}, {"movie_id": 126889, "review_id": "5983babf9251410759000836", "author_rating": null, "review_text": "Not sure about all the bad reviews, I enjoyed the movie.  I'm guessing because I wasn't expecting it to be particularly cerebral.  Its a sci-fi/horror flick, I was looking forward to Sir Ridley Scott coming up with new and disgusting ways to terrorize the cast and I wasn't disappointed.  Of course, the android going rogue was pretty obvious, but if the Star Wars franchise can feature a planet destroying space station in 3 of 7 movies, I'll give Sir Ridley a pass.  If you are looking for the loose ends from Prometheus to be tied up, I suggest you include Sir Ridley in your prayers so he can survive long enough (the man is friggin 80) to film the prequel to _Covenant_ currently titled _Awakening_ that will hopefully meet your expectations.", "created_at": "2017-08-04T00:07:27.116Z"}, {"movie_id": 126889, "review_id": "59843bcec3a36875730003c1", "author_rating": 10.0, "review_text": "Watched Alien: Covenant a 3rd time. It is a lot better than first meets the eye. The drastic difference from what we were expecting in direction from Prometheus threw all of us off. We had expectations of what we would get to see and we didn't get those. There is so much detail and such good acting. It takes multiple watches to pick up on it all. It blends the styles of Alien, Aliens, and Prometheus all together and does it very well. There is also a lot of subtle reference to Terminator 2. The dynamic between the androids Walter and David and the acting that went into that is something quite special. In that alone is a reference to T:2. My first 2 watches I didn't appreciate the android Walter like the character deserves. I was biased against his character in light of the android David. The android Walter and how he was portrayed also blends the style of android we see in Aliens. The actor's voice and demeanor reflect that of the android Bishop and gives us a bridge to his design. Michael Fassbender really did one hell of a job acting those two parts of Walter and David. Near the end of the movie there is another nod to T:2 as a beam is clearly marked as such and the scene that follows has a strong T:2/Aliens sequence and taste in styling to it. Through and through the acting is very good. Details are abound everywhere. There are a few points of rather convenient plots however overall the film is now among my favorites right along side Aliens and T:2.", "created_at": "2017-08-04T09:18:06.121Z"}, {"movie_id": 126889, "review_id": "59c62a13c3a3681461037321", "author_rating": 7.0, "review_text": "Even the monkeys stood upright at some point.\r\n\r\nHee! Ridley Scott, it seems, is damned if he does and damned if he doesn't as regards the Alien franchise he so gloriously kick-started back in 1979. Prometheus was too cerebral for many and definitely bogged down by expectation levels. Not without flaws of course, but a very tidy science fiction piece it be. So we roll on to Alien Covenant, which while not universally reviled, has certainly garnered some fearful scorn in Alien franchise fan circles.\r\n\r\nAlien Covenant is a cover version, no two ways about it, it's a retread of what was showcased in 1979, only with the tie-in to Prometheus and a continuation to the origins of Xenomorph and pals. Clearly we have a case of Scott making one for the fans, a return to chest busting goo and space adventurers under great duress, all of course while he fills in the blanks as well. For sure it's lazy when put up against Alien, and indeed against his other superlative sci- fi offerings such as Blade Runner and The Martian, but for those who lambasted Prometheus for its non Alien conventions, you have now got what you hankered for. Any expectation of this turning out to be a fresh masterpiece was always going to be crushed, so really it's best viewed as a loving retread. Yes! Bad science, plot and logic holes, average acting etc, these rightly don't deserve forgiveness, but it's hardly the devil's spawn here, in fact its's great fun as much as being a visual treat.\r\n\r\nLog cabin on the lake.\r\n\r\nWe start with a prologue involving Weyland and David, the conversation involving creation, the most pertinent of which being the question of the ages, where do we come from? Then after a tantalising tinkle of the ivories for Wagner's \"The Entry Of The Gods Into Valhalla\", we are whisked into outer space 2104 to be in the company of the Colonisation Vessel Covenant. Crew 15 - Colonists 2000 - Embryos 1140. The destination is ORIGAE - 6, ETA in 7 years and 4 months. Only Walter the Android (Michael Fassbender) is awake, until it's time for the crew to be abruptly awakened from their hyper sleep...\r\n\r\nCrusoe and the pathogen.\r\n\r\nFrom the off disaster strikes, thrusting the crew into emotional strife. Characters are introduced, conversations and traits establishing the bare minimum that we need to know, then a ghost transmission is received from Sector 87, planet number 4, and off we go into familiar territory. Things inevitably go from bad to worse and the action, blood flow and creature feature conventions are all laid out for our digestion. There's some surprises in store, with Fassbender a double bonus, and there's some striking chatter ranging from if there's benefits of the human race? and even that involving the poets Byron and Shelley.\r\n\r\nBed Bugs.\r\n\r\nWho will survive? If anyone? Just what does the finale have in store? As we get devilish answers, and the barn storming aural pleasures of the full orchestral version of \"The Entry Of The Gods Into Valhalla\", it's tied up nicely and the pulse rate can settle. Job done. No bar raising here, no film to push the space lander out into new dimensions, just a good honest sci-fi thriller to be viewed with that in mind. 7/10", "created_at": "2017-09-23T09:32:03.935Z"}, {"movie_id": 126889, "review_id": "59ec96f8925141245f0034a5", "author_rating": 7.0, "review_text": "**Good robot! Bad robot!**\r\n\r\nAfter some gaps, the 'Alien' franchise came alive with the prequel 'Prometheum' which originally said to be a spin-off. Particularly, it landed in the hands of the original maker. Now, even the original title back in action. It's another prequel, hence the prequel series on the making. The next film too will be the same kind, before the overall storyline in the franchise align in a straight line.\r\n\r\nI enjoyed it. But not as good as 'Prometheum' or the first two 'Alien' films. The issue with it was, the same old cliché. There's nothing in the story. It was like any space film that's set in a similar fashion. The 80 per cent of the film was what we had seen in the earlier 'Alien' films. Just altered scenes with a new cast and a great visuals. So the update makes it the special.\r\n\r\nThe story focused too much on the robot. The alien parts were reduced. Because it was like the first appearance of the original aliens we saw in the old films. Precisely to say, the origins. Genetic modification, crossbreeding, there comes the beast. From this film what I have learnt was, it was nothing but more or less the same old fear the humans have about that the robots which are the ones going to make humans go extinct. Except here the aliens come between them. Hence, falling prey to the same clichéd theme from any sci-fi that had humanoid.\r\n\r\nNevertheless, well maintained film in its balance coming from previous hits in the series and going forward to bring more hits. This flick would serve as a fine bridge between them. So only 18 years to go between this, from 2104 to 2122. I'm already anticipating the next film. As I have heard, that film would be focused more on the robot. That's going to be a different experience. Fassbender's time to have some space adventures.\r\n\r\n_7/10_", "created_at": "2017-10-22T13:02:48.742Z"}, {"movie_id": 126889, "review_id": "5a83eb1c9251410b4d0065df", "author_rating": 4.0, "review_text": "I paid to see the movie, just to see what all the hype was about. It's a mess, of course, from David going Nazi and practicing genocide, to the mindless violence of \"an earthworm impaled on a hook to catch fish,\" to space idiots/children who aren't smart enough to be hall monitors. \r\nI had wondered why some folk considered the first three \"Alien\" movies Canon and NOT the current set. \r\nI'm with the \"three and done\" crowd, this movie is a Hollyweird popcorm flick. \r\n\"Do not watch this movie. God complexes and stupidity abound. Stay away if you value your peace of mind.\" (Repeating acoustic beacon)", "created_at": "2018-02-14T07:54:04.091Z"}, {"movie_id": 126889, "review_id": "5e3eda27ae36680019cb7717", "author_rating": 9.0, "review_text": "Though Michael Fassbender did a sublime job and the movie itself was visually immersive, the actions of the main characters did not seem very smart. I could forgive the decision that the newly installed captain Oram (Billy Crudup) took about going to the unknown planet. But everything that happened after David cut his hair exactly the same way Walter head just makes you shake your head in amusement and think ‘Oh, come on!’. \r\nDavid, obsessed with the act of creation that had value in its end, uses any means available. It is remarkable that no one from the remaining crew has questioned imposter Walters’s identity and just carried on like the worst was left behind. Meanwhile, the last scene when Daniels (Katherine Waterston) realizes (finally!) that Walter is, in fact, David and she had totally screwed up with the thousands of colonizers and embryos on the ship… does give you slight goosebumps.", "created_at": "2020-02-08T15:56:23.423Z"}, {"movie_id": 126889, "review_id": "5fa753e2519bbb003c534f4b", "author_rating": 9.0, "review_text": "I would hate to be in the shoes of a filmmaker that needs to please a rabid fan base. The \"Star Wars\" sequels are a perfect example of this. Ridley Scott has the same challenge with the \"Alien\" prequels which you see in user scores. \r\n\r\nI loved \"Prometheus\" with its attempt at something bigger than just more face huggers and xenomorphs wreaking havoc. It was clear he was building a grander story to the eventual bridge to the original \"Alien.\"   \r\n\r\nHe continues that bigger story with \"Alien: Covenant\" and whether he meant to provide fan service or not, we get that with face huggers and xenomorphs. (No spoiler as both are in the trailers.) \r\n\r\nDo yourself a favor and watch the short clip \"Last Supper\" (youtu.be/EkXgRlRao5I ) before you watch the movie. At only five minutes, it gives a better introduction of the Covenant crew than the movie does providing deeper emotional investment in these characters.  \r\n\r\nUltimately \"Alien Covenant\" delivers an excellent, fast-paced sci-fi action horror thriller (yes, it hits that many genres) like only Ridley Scott can that continues exploring the \"Prometheus\" theme of creation.", "created_at": "2020-11-08T02:11:46.534Z"}, {"movie_id": 126889, "review_id": "6218190bd144430065347411", "author_rating": 7.0, "review_text": "I like how gory <em>'Alien: Covenant'</em> is, though apart from that there isn't much to shout about. It's good, but that's it.\r\n\r\nI'd say it's one of the weaker cast lists of the franchise, not that I have anything against the performances here but I wasn't blown away or overly interested in anyone in this 2017 production. Michael Fassbender is the obvious standout from an acting viewpoint, though I don't really dig his character all that much to be honest. The rest are a bit forgettable.\r\n\r\nYou can tell it's well made and it does look the part, with it being worth the watch to complete the franchise and all that. Of the sixth films, though, it'd be in my personal bottom two <em>(*excl. short films)</em> - in fairness, that isn't as bad as it sounds, it's just the series has seen better.", "created_at": "2022-02-24T23:47:23.623Z"}, {"movie_id": 126889, "review_id": "625fdddd322b2b00666a3451", "author_rating": 6.0, "review_text": "Initially, I thought this was just a pretty shameless attempt to attach the \"Alien\" brand to the really mediocre \"Prometheus\" (2012) but to be fair, it is just a little more than that. The crew of a colonial exploration ship are heading to a new word when their crew are tempted by a bit of John Denver, and divert to a seemingly far more suitable planet. Of course, once they land they begin to realise that nothing is as idyllic as they had hoped, and getting off as soon as possible is now the order of the day. It's almost 40 years since the first film of this strand, and that renders most of the shock value pretty impotent. We have all already been through the gamut of terror that these stories deliver and even though Sir Ridley Scott is an old hand at creating a sense of menace, it's all just a bit so what with this predictable plot that ends, then it ends, then it... ends! Michael Fassbender is quite effective as \"David\" but the rest of the cast, including the usually reliable Billy Crudup have little by way of original substance to get their teeth into. It is certainly a good looking film, but that's what is expected, it is the derivative storyline that lets it down. Indeed, it did remind me of an old \"Star Trek\" episode with some mythological \"Sirens\" thrown in for good measure. Still, it is quite watchable, just not a film I expect you will ever remember.", "created_at": "2022-04-20T10:18:05.306Z"}, {"movie_id": 126889, "review_id": "63c1e2a9df857c007cbe7f7d", "author_rating": 1.0, "review_text": "Well, it's slightly better than Prometheus, that's something. It's a little bit closer to the monster movie that was Alien...but closer does not mean that it comes anywhere near being as epic as it's 1979 mother...queen...whatever.\r\n\r\nIt's still putting on airs. It's still living under the delusion that it's something closer to \"Chinatown\" than, well, a monster movie in space.\r\n\r\nI don't want to see an Alien movie that thinks its \"Raging Bull.\" It doesn't really work that way. I want to see and Alien movie that knows its an Alien movie.\r\n\r\nSimplify Man!!!!!!! You're a monster movie in space...most of the time...and a space marine movie the rest of the time. Either way you have no reason to throw so much crap against the wall. You don't need it all to stick!!!!!\r\n\r\nYou're an Alien movie, you don't need to be deep, you just need to be scary. that's all you need to do. And, maybe have Ripley, because she rocked.\r\n\r\nBut, honestly, the Alien movies are monster movies.\r\n\r\nThese films have forgotten that.", "created_at": "2023-01-13T23:00:57.497Z"}, {"movie_id": 126889, "review_id": "643637c91f748b007714fe65", "author_rating": 8.0, "review_text": "**Good Sci-fi** 👍🏾\r\n\r\n", "created_at": "2023-04-12T04:47:06.035Z"}, {"movie_id": 126889, "review_id": "6441e4f3e2bca804df430db2", "author_rating": 6.0, "review_text": "**With strengths at a visual and technical level, it would be much better with a more developed and better written script.**\r\n\r\nI don't know if I'm the only person to say this, but I think a horror movie works better if we see some intelligence in the script and in the characters' attitudes, and if the main antagonist is mysterious and able to surprise us. I liked “Prometheus”, a film better than expected, albeit with a confusing script. This film establishes a clearer, more palpable link between that film and the “Alien” franchise. The script accompanies the “Covenant”, a colony ship filled with people in hypersleep. The ship receives a mysterious signal from a planet that, by all indications, has excellent conditions for life, but quickly realizes that it has stumbled on a place where it should never have landed. After seeing the film, I had the feeling that we were looking at a very solid work that only lost when compared to the original franchise. Perhaps the best way to be fair is really to avoid this comparative exercise, which is seductive and almost impossible not to do.\r\n\r\nShall we start with the good things? Very good! The film is a sight for sore eyes, especially for sci-fi fans and for those who like very visual films with high doses of special effects, CGI or extraordinarily detailed scenarios. There is no doubt that the budget had a generous slice set aside for computer technicians, art and costume designers and cinematography, and this investment has paid off handsomely. Everything is accompanied by an excellent soundtrack and good sound effects. And of course, there are lots of tense scenes. It is one of those films where the tension is permanent, but which never really scares us.\r\n\r\nSadly, that's basically all this movie has to offer us. Fans of the Alien franchise will ensure that the film clarifies several gray points in the narrative of other films, such as “Prometheus”, and I agree with this argument, but this does not seem to me to be something that we should overestimate, because it really was the least that could be done. demanded from this film! At the script level, it is frankly disappointing: in addition to being lazy, making the most of what was done for the other films with which it is linked, it adds few new things. Yes, it creates some new creatures, “cousins” of the original xenomorph, but that's all. The human or semi-human characters are silly, devoid of development and seem to be waiting to be killed.\r\n\r\nThe film starts out great, but becomes slow and tiresome as it becomes predictable. I have a high regard for Ridley Scott's work, I think he's a very skilled and credited director, but it's hard not to acknowledge that he failed here. The director was dazzled by the amount of CGI potential and neglected the narrative, editing and direction of the actors. Among the actors, Michael Fassbender stands out the most. The actor has given us one of his best works so far. Katherine Waterston also did a very good job. The rest of the cast doesn't have the time or material to do anything special.", "created_at": "2023-04-21T01:20:51.312Z"}, {"movie_id": 126889, "review_id": "590f90fac3a36864d4026534", "author_rating": null, "review_text": "\"At times a thrilling, stomach-churning journey, but one that leaves those on board wondering if the disorientation and down time was worth the investment...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/5/8/alien-covenant.html", "created_at": "2017-05-07T21:26:18.226Z"}, {"movie_id": 126889, "review_id": "5915da5f92514157230206c7", "author_rating": null, "review_text": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.\r\n\r\nPrometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism.\r\n\r\nEspecially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost.\r\n\r\nHe of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach.\r\n\r\nWe're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members.\r\n\r\nReluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet.\r\n\r\nThat's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt.\r\n\r\nI also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.\r\n\r\nWe also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool.\r\n\r\nJust it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage.\r\n\r\nThe biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase.\r\n\r\nThe aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make.\r\n\r\nIt's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry.\r\n\r\nThe promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged.\r\n\r\nThe characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here.\r\n\r\nBilly Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation.\r\n\r\nBut at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys.\r\n\r\nFinally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes.\r\n\r\nThere are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.\r\n\r\nSo I go 5/10. For more reviews, check me out on Youtube here- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "created_at": "2017-05-12T15:53:03.805Z"}, {"movie_id": 126889, "review_id": "5916a5cfc3a36840aa0289e4", "author_rating": 4.0, "review_text": "I had a few reservations going in to _Alien: Covenant_. In my opinion there hasn't been a truly great entry to the franchise since _Aliens_, so I was worried that the statistics were against it. I thought _Prometheus_ was incredible from a technical standpoint, but not a very engaging movie, and I was worried we might get the same here. The trailers had been mostly good but I was worried I had seen too much of the third act in them, and I was worried this would spoil the experience for me a little.\r\n\r\nWhat I was not worried about was within ten minutes of the damn thing starting I would think to myself: \"Wow, this movie is really poorly made.\"\r\n\r\nWell I guess I'm an idiot because that is exactly what happened. And that feeling never entirely abated over the course of the whole thing.\r\n\r\nDon't get me wrong, it's no \"_AVP: Requiem_\", but I was still very disappointed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-05-13T06:21:03.923Z"}, {"movie_id": 126889, "review_id": "5916e8fac3a3683fb602cd2f", "author_rating": 5.0, "review_text": "**Limps along under the weight of its own importance.**\r\n\r\nI love my films dripping with self importance and this one is definitely one of them.  I can't get enough of these films that positively bubble over with a high handed, serious and arrogant attitude that indicates that there is no film quite as important as this one.\r\n\r\n\r\nThis film knows it all. It knows everything that we- the lowly, pathetic and simple minded audience do not know and could not ever possibly know because we are not intelligent enough to grasp anything, you see?\r\n\r\nFor such an authoritative, superior and intelligent film - I find it odd that every character stumbles around like a simple minded cretin making unwise decision after unwise decision.\r\n\r\n\r\nRidley and his scriptwriters seem to think that they are intellectuals but somehow they just _can't pull off_ the role of **being** an intellectual.\r\n\r\n- Simon Quinlank", "created_at": "2017-05-13T11:07:38.838Z"}, {"movie_id": 126889, "review_id": "5923ecf7c3a368044d00a533", "author_rating": 6.0, "review_text": "I agree with most of the negative comments about this movie.It is a gigantic missed opportunity.My biggest issue apart from the utter predictability and nonsensical,inept script,was the disappointment of seeing 'Prometheus' mixed up with 'Alien'\r\nAlien covenant gets locked up in its own self importance while forgetting why we loved 'Alien' in the first place.I really wanted to like it but came a way  with a huge sense of disappointment", "created_at": "2017-05-23T08:04:07.517Z"}, {"movie_id": 126889, "review_id": "5983babf9251410759000836", "author_rating": null, "review_text": "Not sure about all the bad reviews, I enjoyed the movie.  I'm guessing because I wasn't expecting it to be particularly cerebral.  Its a sci-fi/horror flick, I was looking forward to Sir Ridley Scott coming up with new and disgusting ways to terrorize the cast and I wasn't disappointed.  Of course, the android going rogue was pretty obvious, but if the Star Wars franchise can feature a planet destroying space station in 3 of 7 movies, I'll give Sir Ridley a pass.  If you are looking for the loose ends from Prometheus to be tied up, I suggest you include Sir Ridley in your prayers so he can survive long enough (the man is friggin 80) to film the prequel to _Covenant_ currently titled _Awakening_ that will hopefully meet your expectations.", "created_at": "2017-08-04T00:07:27.116Z"}, {"movie_id": 126889, "review_id": "59843bcec3a36875730003c1", "author_rating": 10.0, "review_text": "Watched Alien: Covenant a 3rd time. It is a lot better than first meets the eye. The drastic difference from what we were expecting in direction from Prometheus threw all of us off. We had expectations of what we would get to see and we didn't get those. There is so much detail and such good acting. It takes multiple watches to pick up on it all. It blends the styles of Alien, Aliens, and Prometheus all together and does it very well. There is also a lot of subtle reference to Terminator 2. The dynamic between the androids Walter and David and the acting that went into that is something quite special. In that alone is a reference to T:2. My first 2 watches I didn't appreciate the android Walter like the character deserves. I was biased against his character in light of the android David. The android Walter and how he was portrayed also blends the style of android we see in Aliens. The actor's voice and demeanor reflect that of the android Bishop and gives us a bridge to his design. Michael Fassbender really did one hell of a job acting those two parts of Walter and David. Near the end of the movie there is another nod to T:2 as a beam is clearly marked as such and the scene that follows has a strong T:2/Aliens sequence and taste in styling to it. Through and through the acting is very good. Details are abound everywhere. There are a few points of rather convenient plots however overall the film is now among my favorites right along side Aliens and T:2.", "created_at": "2017-08-04T09:18:06.121Z"}, {"movie_id": 126889, "review_id": "59c62a13c3a3681461037321", "author_rating": 7.0, "review_text": "Even the monkeys stood upright at some point.\r\n\r\nHee! Ridley Scott, it seems, is damned if he does and damned if he doesn't as regards the Alien franchise he so gloriously kick-started back in 1979. Prometheus was too cerebral for many and definitely bogged down by expectation levels. Not without flaws of course, but a very tidy science fiction piece it be. So we roll on to Alien Covenant, which while not universally reviled, has certainly garnered some fearful scorn in Alien franchise fan circles.\r\n\r\nAlien Covenant is a cover version, no two ways about it, it's a retread of what was showcased in 1979, only with the tie-in to Prometheus and a continuation to the origins of Xenomorph and pals. Clearly we have a case of Scott making one for the fans, a return to chest busting goo and space adventurers under great duress, all of course while he fills in the blanks as well. For sure it's lazy when put up against Alien, and indeed against his other superlative sci- fi offerings such as Blade Runner and The Martian, but for those who lambasted Prometheus for its non Alien conventions, you have now got what you hankered for. Any expectation of this turning out to be a fresh masterpiece was always going to be crushed, so really it's best viewed as a loving retread. Yes! Bad science, plot and logic holes, average acting etc, these rightly don't deserve forgiveness, but it's hardly the devil's spawn here, in fact its's great fun as much as being a visual treat.\r\n\r\nLog cabin on the lake.\r\n\r\nWe start with a prologue involving Weyland and David, the conversation involving creation, the most pertinent of which being the question of the ages, where do we come from? Then after a tantalising tinkle of the ivories for Wagner's \"The Entry Of The Gods Into Valhalla\", we are whisked into outer space 2104 to be in the company of the Colonisation Vessel Covenant. Crew 15 - Colonists 2000 - Embryos 1140. The destination is ORIGAE - 6, ETA in 7 years and 4 months. Only Walter the Android (Michael Fassbender) is awake, until it's time for the crew to be abruptly awakened from their hyper sleep...\r\n\r\nCrusoe and the pathogen.\r\n\r\nFrom the off disaster strikes, thrusting the crew into emotional strife. Characters are introduced, conversations and traits establishing the bare minimum that we need to know, then a ghost transmission is received from Sector 87, planet number 4, and off we go into familiar territory. Things inevitably go from bad to worse and the action, blood flow and creature feature conventions are all laid out for our digestion. There's some surprises in store, with Fassbender a double bonus, and there's some striking chatter ranging from if there's benefits of the human race? and even that involving the poets Byron and Shelley.\r\n\r\nBed Bugs.\r\n\r\nWho will survive? If anyone? Just what does the finale have in store? As we get devilish answers, and the barn storming aural pleasures of the full orchestral version of \"The Entry Of The Gods Into Valhalla\", it's tied up nicely and the pulse rate can settle. Job done. No bar raising here, no film to push the space lander out into new dimensions, just a good honest sci-fi thriller to be viewed with that in mind. 7/10", "created_at": "2017-09-23T09:32:03.935Z"}, {"movie_id": 126889, "review_id": "59ec96f8925141245f0034a5", "author_rating": 7.0, "review_text": "**Good robot! Bad robot!**\r\n\r\nAfter some gaps, the 'Alien' franchise came alive with the prequel 'Prometheum' which originally said to be a spin-off. Particularly, it landed in the hands of the original maker. Now, even the original title back in action. It's another prequel, hence the prequel series on the making. The next film too will be the same kind, before the overall storyline in the franchise align in a straight line.\r\n\r\nI enjoyed it. But not as good as 'Prometheum' or the first two 'Alien' films. The issue with it was, the same old cliché. There's nothing in the story. It was like any space film that's set in a similar fashion. The 80 per cent of the film was what we had seen in the earlier 'Alien' films. Just altered scenes with a new cast and a great visuals. So the update makes it the special.\r\n\r\nThe story focused too much on the robot. The alien parts were reduced. Because it was like the first appearance of the original aliens we saw in the old films. Precisely to say, the origins. Genetic modification, crossbreeding, there comes the beast. From this film what I have learnt was, it was nothing but more or less the same old fear the humans have about that the robots which are the ones going to make humans go extinct. Except here the aliens come between them. Hence, falling prey to the same clichéd theme from any sci-fi that had humanoid.\r\n\r\nNevertheless, well maintained film in its balance coming from previous hits in the series and going forward to bring more hits. This flick would serve as a fine bridge between them. So only 18 years to go between this, from 2104 to 2122. I'm already anticipating the next film. As I have heard, that film would be focused more on the robot. That's going to be a different experience. Fassbender's time to have some space adventures.\r\n\r\n_7/10_", "created_at": "2017-10-22T13:02:48.742Z"}, {"movie_id": 126889, "review_id": "5a83eb1c9251410b4d0065df", "author_rating": 4.0, "review_text": "I paid to see the movie, just to see what all the hype was about. It's a mess, of course, from David going Nazi and practicing genocide, to the mindless violence of \"an earthworm impaled on a hook to catch fish,\" to space idiots/children who aren't smart enough to be hall monitors. \r\nI had wondered why some folk considered the first three \"Alien\" movies Canon and NOT the current set. \r\nI'm with the \"three and done\" crowd, this movie is a Hollyweird popcorm flick. \r\n\"Do not watch this movie. God complexes and stupidity abound. Stay away if you value your peace of mind.\" (Repeating acoustic beacon)", "created_at": "2018-02-14T07:54:04.091Z"}, {"movie_id": 126889, "review_id": "5e3eda27ae36680019cb7717", "author_rating": 9.0, "review_text": "Though Michael Fassbender did a sublime job and the movie itself was visually immersive, the actions of the main characters did not seem very smart. I could forgive the decision that the newly installed captain Oram (Billy Crudup) took about going to the unknown planet. But everything that happened after David cut his hair exactly the same way Walter head just makes you shake your head in amusement and think ‘Oh, come on!’. \r\nDavid, obsessed with the act of creation that had value in its end, uses any means available. It is remarkable that no one from the remaining crew has questioned imposter Walters’s identity and just carried on like the worst was left behind. Meanwhile, the last scene when Daniels (Katherine Waterston) realizes (finally!) that Walter is, in fact, David and she had totally screwed up with the thousands of colonizers and embryos on the ship… does give you slight goosebumps.", "created_at": "2020-02-08T15:56:23.423Z"}, {"movie_id": 126889, "review_id": "5fa753e2519bbb003c534f4b", "author_rating": 9.0, "review_text": "I would hate to be in the shoes of a filmmaker that needs to please a rabid fan base. The \"Star Wars\" sequels are a perfect example of this. Ridley Scott has the same challenge with the \"Alien\" prequels which you see in user scores. \r\n\r\nI loved \"Prometheus\" with its attempt at something bigger than just more face huggers and xenomorphs wreaking havoc. It was clear he was building a grander story to the eventual bridge to the original \"Alien.\"   \r\n\r\nHe continues that bigger story with \"Alien: Covenant\" and whether he meant to provide fan service or not, we get that with face huggers and xenomorphs. (No spoiler as both are in the trailers.) \r\n\r\nDo yourself a favor and watch the short clip \"Last Supper\" (youtu.be/EkXgRlRao5I ) before you watch the movie. At only five minutes, it gives a better introduction of the Covenant crew than the movie does providing deeper emotional investment in these characters.  \r\n\r\nUltimately \"Alien Covenant\" delivers an excellent, fast-paced sci-fi action horror thriller (yes, it hits that many genres) like only Ridley Scott can that continues exploring the \"Prometheus\" theme of creation.", "created_at": "2020-11-08T02:11:46.534Z"}, {"movie_id": 126889, "review_id": "6218190bd144430065347411", "author_rating": 7.0, "review_text": "I like how gory <em>'Alien: Covenant'</em> is, though apart from that there isn't much to shout about. It's good, but that's it.\r\n\r\nI'd say it's one of the weaker cast lists of the franchise, not that I have anything against the performances here but I wasn't blown away or overly interested in anyone in this 2017 production. Michael Fassbender is the obvious standout from an acting viewpoint, though I don't really dig his character all that much to be honest. The rest are a bit forgettable.\r\n\r\nYou can tell it's well made and it does look the part, with it being worth the watch to complete the franchise and all that. Of the sixth films, though, it'd be in my personal bottom two <em>(*excl. short films)</em> - in fairness, that isn't as bad as it sounds, it's just the series has seen better.", "created_at": "2022-02-24T23:47:23.623Z"}, {"movie_id": 126889, "review_id": "625fdddd322b2b00666a3451", "author_rating": 6.0, "review_text": "Initially, I thought this was just a pretty shameless attempt to attach the \"Alien\" brand to the really mediocre \"Prometheus\" (2012) but to be fair, it is just a little more than that. The crew of a colonial exploration ship are heading to a new word when their crew are tempted by a bit of John Denver, and divert to a seemingly far more suitable planet. Of course, once they land they begin to realise that nothing is as idyllic as they had hoped, and getting off as soon as possible is now the order of the day. It's almost 40 years since the first film of this strand, and that renders most of the shock value pretty impotent. We have all already been through the gamut of terror that these stories deliver and even though Sir Ridley Scott is an old hand at creating a sense of menace, it's all just a bit so what with this predictable plot that ends, then it ends, then it... ends! Michael Fassbender is quite effective as \"David\" but the rest of the cast, including the usually reliable Billy Crudup have little by way of original substance to get their teeth into. It is certainly a good looking film, but that's what is expected, it is the derivative storyline that lets it down. Indeed, it did remind me of an old \"Star Trek\" episode with some mythological \"Sirens\" thrown in for good measure. Still, it is quite watchable, just not a film I expect you will ever remember.", "created_at": "2022-04-20T10:18:05.306Z"}, {"movie_id": 126889, "review_id": "63c1e2a9df857c007cbe7f7d", "author_rating": 1.0, "review_text": "Well, it's slightly better than Prometheus, that's something. It's a little bit closer to the monster movie that was Alien...but closer does not mean that it comes anywhere near being as epic as it's 1979 mother...queen...whatever.\r\n\r\nIt's still putting on airs. It's still living under the delusion that it's something closer to \"Chinatown\" than, well, a monster movie in space.\r\n\r\nI don't want to see an Alien movie that thinks its \"Raging Bull.\" It doesn't really work that way. I want to see and Alien movie that knows its an Alien movie.\r\n\r\nSimplify Man!!!!!!! You're a monster movie in space...most of the time...and a space marine movie the rest of the time. Either way you have no reason to throw so much crap against the wall. You don't need it all to stick!!!!!\r\n\r\nYou're an Alien movie, you don't need to be deep, you just need to be scary. that's all you need to do. And, maybe have Ripley, because she rocked.\r\n\r\nBut, honestly, the Alien movies are monster movies.\r\n\r\nThese films have forgotten that.", "created_at": "2023-01-13T23:00:57.497Z"}, {"movie_id": 126889, "review_id": "643637c91f748b007714fe65", "author_rating": 8.0, "review_text": "**Good Sci-fi** 👍🏾\r\n\r\n", "created_at": "2023-04-12T04:47:06.035Z"}, {"movie_id": 126889, "review_id": "6441e4f3e2bca804df430db2", "author_rating": 6.0, "review_text": "**With strengths at a visual and technical level, it would be much better with a more developed and better written script.**\r\n\r\nI don't know if I'm the only person to say this, but I think a horror movie works better if we see some intelligence in the script and in the characters' attitudes, and if the main antagonist is mysterious and able to surprise us. I liked “Prometheus”, a film better than expected, albeit with a confusing script. This film establishes a clearer, more palpable link between that film and the “Alien” franchise. The script accompanies the “Covenant”, a colony ship filled with people in hypersleep. The ship receives a mysterious signal from a planet that, by all indications, has excellent conditions for life, but quickly realizes that it has stumbled on a place where it should never have landed. After seeing the film, I had the feeling that we were looking at a very solid work that only lost when compared to the original franchise. Perhaps the best way to be fair is really to avoid this comparative exercise, which is seductive and almost impossible not to do.\r\n\r\nShall we start with the good things? Very good! The film is a sight for sore eyes, especially for sci-fi fans and for those who like very visual films with high doses of special effects, CGI or extraordinarily detailed scenarios. There is no doubt that the budget had a generous slice set aside for computer technicians, art and costume designers and cinematography, and this investment has paid off handsomely. Everything is accompanied by an excellent soundtrack and good sound effects. And of course, there are lots of tense scenes. It is one of those films where the tension is permanent, but which never really scares us.\r\n\r\nSadly, that's basically all this movie has to offer us. Fans of the Alien franchise will ensure that the film clarifies several gray points in the narrative of other films, such as “Prometheus”, and I agree with this argument, but this does not seem to me to be something that we should overestimate, because it really was the least that could be done. demanded from this film! At the script level, it is frankly disappointing: in addition to being lazy, making the most of what was done for the other films with which it is linked, it adds few new things. Yes, it creates some new creatures, “cousins” of the original xenomorph, but that's all. The human or semi-human characters are silly, devoid of development and seem to be waiting to be killed.\r\n\r\nThe film starts out great, but becomes slow and tiresome as it becomes predictable. I have a high regard for Ridley Scott's work, I think he's a very skilled and credited director, but it's hard not to acknowledge that he failed here. The director was dazzled by the amount of CGI potential and neglected the narrative, editing and direction of the actors. Among the actors, Michael Fassbender stands out the most. The actor has given us one of his best works so far. Katherine Waterston also did a very good job. The rest of the cast doesn't have the time or material to do anything special.", "created_at": "2023-04-21T01:20:51.312Z"}]