[{"movie_id": 75174, "review_id": "5b3716209251413c6603809b", "author_rating": 4.0, "review_text": "I am amazed by how many people on IMDb that have given this movie 8, 9 and even 10 stars. It’s perhaps not the worst movie I’ve seen but it is in no way worth that kind of rating.\r\n\r\nThe good part of the movie is Liam Neeson who makes an enjoyable performance with the script that he was given. He is pretty much the reason that I gave it as much as 4 IMDb stars. The rest of the film is just plain wrong.\r\n\r\nMy first impression is, god this director likes film grain! Now this is a matter of taste of course but I don’t like when movies have artificially been made to look like they were filmed on old and crappy film. It has its places but it didn’t add anything here.\r\n\r\nThe film starts off with a plane crash which is not done very good. Neither in terms of special effects nor in terms of realism.\r\n\r\nThe lack of realism, unfortunately, continues throughout the movie. The behavior of the wolves is utterly unnatural and unrealistic. I can live with this if it’s a horror movie or some other fantasy movie but this is not supposed to be that. The actual footage of the wolves is rather mediocre as well.\r\n\r\nThen there is this so called experienced hunter and “wolf expert”. Leaving the crash site is a dubious decision to say the least. Then we got the jumping of cliffs with a flimsy home made rope instead of just walking a bit further to get down not to mention making ammunition go off by poking wooden sticks at it, what the f…? In addition the guy knows nothing about wolves, or any other wild animal for that matter.\r\n\r\nJust to add to this not so enjoyable experience, the film has an utterly lousy ending.", "created_at": "2018-06-30T05:33:20.190Z"}, {"movie_id": 75174, "review_id": "5c4452dcc3a3681a0c24784b", "author_rating": 7.0, "review_text": "I can't believe it took me so long to get around to watching _The Grey_.\r\n\r\nWhat a ride. Don't know that it's realistic but damn it was good. Put me in that wolf pack. Would I be instantly dismembered? Sure, but you get that on the big jobs.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-01-20T10:52:12.233Z"}, {"movie_id": 75174, "review_id": "622b9a8beda4b70044c5417e", "author_rating": 7.0, "review_text": "**_Go out fighting (and believing)_**\r\n\r\nLiam Neeson stars as the quasi-leader of seven misfit Alaskan oil workers who survive a plane crash in the wilderness. As if this isn't bad enough, a pack of territorial wolves want to take them out. Will they survive? \r\n\r\nReleased in January 2012, \"The Grey\" is a somber survival flick filled with primal reflections on death and faith. The trailer is misleading in that it advertises the movie as an action film, but that's not the case at all. Although there is some action, this is a grave, dreary adventure with raw meditations about the will to live or die and more -- God.\r\n\r\nIt's not as good as 1997's \"The Edge,\" \"Flight of the Phoenix\" or \"Sands of the Kalahari,\" the latter two from 1965, mainly because it's so funereal and seemingly empty, but it's unique and worthwhile.\r\n\r\nSome complain that the story's unbelievable, like the wolves and the jump from the cliff, but movies (or certain things in them) aren't always meant to be taken literally and aren't supposed to be realistic as filmmakers are more concerned with aesthetics, psychology, metaphors and conveying ideas; and that's the case with \"The Grey.\" The survival story is merely a stage.\r\n\r\nWhich brings us to another common complaint, that the film's ultimately pointless, which simply isn't the case. Now you may not like the story or the points that it conveys, but it's not pointless. See my interpretation below, if interested.\r\n\r\nThe film runs 1 hour, 57 minutes, and was shot in Smithers, British Columbia.\r\n\r\nGRADE: B \r\n\r\n**MY INTERPRETATION** (Read only if you've seen the film)**:** \r\n\r\nOttway (Neeson) is in a horrible state of grief after the passing of his beloved wife as he protects oil workers by shooting wolves that get too close to the camp. Depressed, he decides to commit suicide but before he can pull the trigger a wolf howling in the distance strangely prevents him. I believe the howling wolf was the Creator's way of speaking to Ottway and giving him a chance to go out fighting; and not just that, go out _believing_ as well, even if it's belief in its rawest form.\r\n\r\nThe next day Ottway finds himself surviving a plane crash in the wilderness with six other men. In contrast to his near-suicide attempt, his survival instincts kick-in and he finds himself doing everything he can to survive, for himself and the others. Do you see the irony? The night before he desperately wanted to die and a mere day later he's doing everything in his power to live and save others.\r\n\r\nThe topic of God and faith comes up at a campfire. A couple of the guys believe, but Diaz naturally mocks such things. Ottway says he doesn't believe either, but wishes he could.\r\n\r\nLater in the story, Ottway finds himself the sole survivor and at the end of his rope. Cursing, he passionately cries out to the Almighty for succor, but the heavens remain mysteriously silent. Regardless, he musters the strength to (try to) carry on. Shortly later, while reflecting on the men and their loved ones who died, he seems to clasp his hands in prayer and the Alpha wolf appears and challenges him. Unlike a few days ago when he was going to kill himself, he goes out fighting and, even more important, believing.\r\n\r\nFor those who argue that Ottway didn't believe, remember that he was praying when he was crying out to God. Yes, it was a prayer of desperation and rage, but prayer nevertheless. Job did the same thing in the bible. The utterly humbling situation drove Ottway to his Creator and compelled him to go out fighting. It was God's gift. The Almighty knew Ottway better than Ottway knew himself.", "created_at": "2022-03-11T18:52:59.290Z"}]