[{"movie_id": 749274, "review_id": "614e08f93975610043320012", "author_rating": 10.0, "review_text": "Still going strong, Eastwood does not disappoint in his latest movie. And yes, there was even a few minutes of action.⭐⭐⭐⭐⭐", "created_at": "2021-09-24T17:20:57.077Z"}, {"movie_id": 749274, "review_id": "618450f9e7414600438afe3b", "author_rating": 7.0, "review_text": "This film was fine, but for me not quite what i expect from Eastward’s more recent efforts. His acting was good in his laid back style and carried the movie in places, I thought, but I was a bit distracted by the more lackluster performance of a few others. Dwight Yoakum, for example, whose singing I have always enjoyed, seemed to deliver his lines woodenly at times.\r\n\r\nBut I won’t dwell on critiquing here and there. Overall it was watchable. It just seems like it could have shown more spark if Eastward had lit a fire under a few butts during some of the scenes. Maybe by planting that doleful, slow-burn stare on them, hand twitching near the holster that wasn’t there.", "created_at": "2021-11-04T21:30:33.265Z"}, {"movie_id": 749274, "review_id": "620b0e0bd96c3c002b12a19f", "author_rating": 7.0, "review_text": "A mid Clint Eastwood flick.\r\n\r\n<em>'Cry Macho'</em> is passable, I had a fine time with it as I got suitable enjoyment. I wasn't overly invested but I don't have any noteworthy issues either. It narrowly gets a 7/10 rating from yours truly.\r\n\r\nAt the age of 91, Eastwood is still acting, directing and producing movies - you gotta admire his longevity! He remains entertaining to watch, having come a long way since that debuting (uncredited) role in 1955's <em>'<a href=\"https://letterboxd.com/film/revenge-of-the-creature/\" rel=\"nofollow\">Revenge of the Creature</a>'</em>. There isn't much to note about the cast behind the lead, though Eduardo Minett and Natalia Traven are alright.\r\n\r\nI have nothing else to say. It's a satisfactory film.", "created_at": "2022-02-15T02:20:59.963Z"}, {"movie_id": 749274, "review_id": "622e42ae0e4419001b6b2be2", "author_rating": 4.0, "review_text": "The writing was pitiful, and the acting was mediocre, at best.  Clint Eastwood is way too old to even attempt being a romantic lead.  The senoritas making a play for him was farcical.  He's also too old to be an action star.  As far as bustin' broncos, you could almost see the stunt man being called in to take the reins.  The kid was supposed to be a streetwise hellion, but the only hint of that was that he could apparently boost old cars.  Overall, if you have good memories of Clint Eastwood, my advice is to skip this movie and avoid tarnishing your image of Clint.", "created_at": "2022-03-13T19:14:54.598Z"}, {"movie_id": 749274, "review_id": "6317bf8246e75f00a574f6c0", "author_rating": 4.0, "review_text": "One of the best scenes in Cry Macho involves sign language. It’s not even a scene, really; just a brief exchange of the short-but-sweet variety. I mention it because I wish more of the film were like that.\r\n\r\nThe two protagonists speak English, and yet there is a language barrier issue going on here. Specifically, the actor who plays Rafael, Eduardo Minett, makes you go for the 'mute' button almost every time he opens his mouth — the exception being when he falls back on his native Spanish.\r\n\r\nIt’s not the young man’s fault, and it happens to the best of them; just listen to Jean Gabin in Moontide, or Javier Bardem in Loving Pablo, or Salma Hayek, Sofia Vergara, and Penelope Cruz in any of their English-speaking roles.\r\n\r\nNow, I understand he’s playing a Mexican boy who speaks English as a Second Language, and I’m also aware that his character is not meant to ingratiate himself with the audience immediately, of even fully — indeed, Rafael remains largely unchanged and unwiser until the end, but I’d like to think this is by design; the film as a whole may be viewed as a short section of a very long circle, and Mike (Clint Eastwood) and Rafael’s intriguing next-to-last conversation foreshadows the latter character’s narrative arc eventually going all the way around to where he is as sensible, though presumably also as old, as his current companion.\r\n\r\nWe find out only slightly more about where Mike is coming from than what we can guess at about where Rafael is headed, but the one’s past and the other’s future are heavily implied in both men’s present; the irony is that Rafael couldn’t skip the poor choices that await him any more than Mike — whose admonitions fall, Cassandra-like, on deaf ears; wisdom is earned, and non-transferable — can go back and avoid his own missteps. The movie’s events are thus, for lack of a better term, Rafael’s preschool of hard knocks.\r\n\r\nOr maybe I’m just reading too much into it; perhaps this is just what my brain occupied itself with while I tuned Minnet and his execrable English accent out. Eastwood would have done well to make Rafael as ignorant of English as Mike is of Spanish (or, why not, have Rafael refuse to speak Mike’s language until the conclusion, to the latter’s surprise, after finally having gained a modicum of the former’s respect), so there could have been more non-verbal communication.", "created_at": "2022-09-06T21:45:38.153Z"}, {"movie_id": 749274, "review_id": "64973b5ceb79c200e29ea29a", "author_rating": 7.0, "review_text": "**_Teaching a boy the ropes of life while traveling through Mexico_**\r\n\r\nAn old-as-dirt ex-rodeo star (Clint Eastwood) is given the task of bringing back the early- teen son of a rancher (Eduardo Minett and Dwight Yoakam respectively) from Mexico City to west Texas in which they have several misadventures. Fernanda Urrejola plays the boy’s mother while Natalia Traven is on hand as a woman they meet along the way.\r\n\r\n“Cry Macho” (2021) has similarities to past Eastwood flicks, like “The Mule” (2018), “Gran Torino” (2008), “A Perfect World” (1993), “Honkytonk Man” (1982) and “Bronco Billy” (1980). It’s a road movie wherein the characters get to know each other as they go from one experience to another. The nuance here is contrast of one character coming-of-age while the other is coming-near-death.\r\n\r\nThere’s drama, humor, potential violence and a hint of romance. Like “The Mule” and “Bronco Billy,” it’s thoroughly mundane, but also somehow (a little) revelational and heartwarming. \"All the Pretty Horses\" (2000) is also comparable, as is \"Rambo: Last Blood\" (2019), just minus the action.\r\n\r\nThe film runs 1 hour, 44 minutes, and was shot in the heart of New Mexico (Belen and Polvadera). \r\n\r\nGRADE: B/B-", "created_at": "2023-06-24T18:52:12.859Z"}]