[{"movie_id": 170522, "review_id": "552e7638c3a36804cd000da0", "author_rating": 7.0, "review_text": "Like I said in 'Song of the Sea' review, its a 3D animation dominated world. That's mainly in Hollywood, but trend spreading so fast everywhere. Even the Japan shifting gear from anime to 3D anime, I saw it in 'Space Pirate: Captain Harlock'. From a comic book to 2D animation is easy because they are much alike, but it's different when it comes to the 3D. I have seen Micky Mouse and Co transformed into 3D characters that I did not like, because some characters do not suit for that kind of leap. In Micky Mouse, the ears were the biggest drawback. But 'Tintin' was a success and so expecting 'Popeye' would do the same magic which is due next year (2016).\r\n\r\nI have seen all the 'Asterix & Obelix' movies so far from both the format, live-shot and animation, but this is the first 3D animation. I'm so happy that it came overall very well, every detail was retained. Even those mud-smoke/dirt-smoke (whatever it's called) shown exactly as it to be which forms during their fight after the consumption of magic potion. That concept is for comic book, to make understand the readers the situation because the picture is still. But in a motion picture you can show the whole action, if they make that change the trademark will lose. So I must praise the technical side of the movie for the lossless transformation.\r\n\r\nIt's like a new beginning in the series in the 'Asterix & Obelix' franchise. Especially this story was not freshly written for the screen, but taken straight from one of the comic books in the series called 'The Mansions of the Gods'. In 3D animation, emotions, violence, comedies would be a little realistic. That's why the movie like 'Brave', 'Frozen', 'Up' appealed strongly on the sentimental side. Gaul's favourite food, the wild boar hunting was compromised, because children would be watching the movie and it might disturb on the softer side of them. Just like the filmmakers avoided the Giant's children and women in 'Jack the Giant Slayer'.\r\n\r\nOne of the best things in 'Asterix & Obelix' movies is that the movie might not be awesome, but still it entertains and keeps you engaged. You can't spot the flaws, in animation all are relevant. A man can jump 1000 feet high and leap a mile away. So if there should be something, that must come from the technical side. Since it (Gauls in 3D) is new and so much fun, you can't concentrate finding those faults or you will miss the actual enjoyment.\r\n\r\n> ‘‘It's weird that the house looks like a box.’’\r\n\r\nAs usual the story set in the first BC. The Gaul's enemy the Romans comes with a new strategy to defeat them. They begin to build the large mansions near to their village and later to invade by seducing the community by the Roman culture. So the fight begins between them where the innocent civilians and black slaves get affect more. But Gaul's main intention is to keep the ecosystem unaffected, especially they're against the Romans modern fancy civilization. What happens to the Julius Caeser's 'Veni, Vidi, Vici' is the movie's final battle to disclose.\r\n\r\nProbably a best 'Asterix & Obelix' movie compared to the previous couple of movies. Good to see a non-Hollywood 3D animated movie with a great quality and doing well commercially as well. A whole family together watchable movie, not only for the children. Hoping for the a sequel, I mean very soon. All the above it was short and sweet which runs about 80 minutes. If you are a fan of this comic, you will love it, because lots of the frames look alike. Must be dedicated  to the fans.\r\n\r\n7/10", "created_at": "2015-04-15T14:31:20.144Z"}]