[{"movie_id": 724495, "review_id": "6349a3bb072166008385f711", "author_rating": 7.0, "review_text": "The Woman King is a touching film that balances the dramatic tone with high octane action delivering a compelling experience. With a powerhouse cast, there is plenty of fantastic performances throughout the entire film. Lashana Lynch was brilliant in this film, she presents herself with a hard exterior but is able to touch into her more emotional and caring self her relationship with Thuso Mbedu's character. Their chemistry was great and one of my favorite parts about the film. \r\n\r\nThe action in this film was really well done. The choreography was great, and the scope was vast. I loved how multiple shot led into each other. Although, part of me wish this had been rated R so that the fight scenes could have the blood and gore that this movie was wanting to deliver so desperately. I really feel like they had to cut even greater combat moves due to keeping the PG-13 rating. But even with that limited scope, that action delivers.\r\n\r\nThere are some pacing issues, with the middle section of the movie dragging on a little too much for my tastes. The ending ramps everything back up again and delivers a great resolution that concludes the film wonderfully.\r\n\r\n**Score:** _74%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-14T18:00:27.133Z"}, {"movie_id": 724495, "review_id": "6351509ef3b49a007dd2d545", "author_rating": 7.0, "review_text": "Viola Davis offers us a compelling and emotional performance as the general of the highly trained and deadly, all-woman, bodyguard of the King of Dahomey (John Boyega). Increasingly embroiled in the ambitions of the European slavers and, to a certain extent, complicit in that trade themselves, the Agojie must face encroaching and modernly armed soldiers of the Oyo empire. On a personal level, this great warrior clearly has demons of her own and as she is introduced to the headstrong and courageous \"Nawi\" (Thuso Mbedu) she sees more of herself than she anticipated. When serendipity now plays it's hand the hitherto unshakable mettle of \"Nanisca\" faces an whole new series of perilous and personal challenges. The cinematography is beautiful, as is the whole look of the film in general. The political and social elements of the narrative are there to be seen but any comments made about them are levelled gently and at both sides who indulge, permit, and/or profit by the activities that made many very wealthy. The action scenes, the ensemble dancing, the singing - all are excellently presented in a colourful and plausible fashion; illustrating the sophistication of this legendary African nation and the shameless brutality of those who would be the exploiters. Lashana Lynch contributes well too, as the personable and feisty \"Izogie\" as do Sheila Atim (\"Amenza\") and Sivuyile Ngesi as the nemesis general \"Migan\". Annoyingly, I could not quite place the \"Santo\" actor until I realised it was none-other than the star of the truly mediocre \"After\" films - Hero Fiennes Tiffin - and he adds very little. It really benefits from the big screen experience, if you can - and is well worth a watch.", "created_at": "2022-10-20T13:43:58.953Z"}, {"movie_id": 724495, "review_id": "6365ad181e6489007a33a31b", "author_rating": 8.0, "review_text": "**The Woman King is a powerful action epic with fantastic fight choreography, dynamic, strong performances, and a compelling story rooted in history.**\r\n\r\nViola Davis crushes brutal action heroine! The entire cast was powerful, vicious, strong, and exciting. The action explodes right out the gate and feels so raw, with the jujitsu, Kali, and Chinese Wushu all blending with the machete and spear fighting to feel like the sword version of John Wick's gun-fu. Viola Davis' steely strong portrayal of Nanisca delivers a mighty yet caring warrior general, creating the genuine and dynamic atmosphere of the film. The entire cast gave stellar performances, but the stand out was Lashana Lynch as Izogie. Lynch was as over-powering, unstoppable, and skilled as any warrior in the film while also serving as the heart, humor, and strength of her Agojie sisters. The film was a fantastic adventure epic but lagged a little in the middle as it focused solely on character development and exposition. Yes, I know I'm complaining about character development, but it was just solid discussion and characters without much to keep me engaged for that hour-long middle section. But that is nitpicking. The movie is fantastic! Watch it!", "created_at": "2022-11-05T00:23:52.951Z"}, {"movie_id": 724495, "review_id": "636e379c1684f700773604e9", "author_rating": 6.0, "review_text": "I liked The Woman King okay: the scenery and acting were fine and the music glorious, but why did I sometimes feel I was watching a different “King” movie by Disney? They danced as well as they fought; though to be fair, is it much different than the complex marches used by more modern armies? There was a bit too much violence for my taste, but perhaps it is needed for the target audience.\r\n\r\nThe story was stereotypical in places, though for this progressive white guy, it was refreshing not to see white faces shoehorned into the story to placate the (only) White Lives Matter crowd, who were out in force with negative reviews. Here is a tip: if a four-star review points out positives but throws in complaints about historical accuracy and not enough Caucasians for the movies’ setting— okay, maybe. But if a one-star review screams about the issue, welcome to the Keep Movies White World. Are they just as offended by the thousands of movies that ignored or appropriated stories and roles of people of color in all white movies though the decades? I think not.\r\n\r\nSo while this movie won’t make any of my lists of favorites, I am glad it was made available to women and girls and other less-thin skinned caucasians like me to enjoy.", "created_at": "2022-11-11T11:53:00.488Z"}, {"movie_id": 724495, "review_id": "638bae811283e9008322acfb", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-woman-king-spoiler-free-review\r\n\r\n\"The Woman King shares an immensely captivating, culturally significant story about the Agojie, a unit of female warriors who fight to protect their own. Viola Davis shines, but Thuso Mbedu delivers one of the best feature film debut performances I've ever witnessed.\r\n\r\nThe anti-slavery, anti-racism and equal human rights messages are well conveyed, but the authentic, emotionally resonant character dynamics stand out due to a chemistry-filled cast. Action sequences hold high levels of brutality, accompanied by excellent choreography and an energetic score.\r\n\r\nOne of the best movies of the year... ignoring the butchered Portuguese.\"\r\n\r\nRating: A-", "created_at": "2022-12-03T20:16:01.191Z"}, {"movie_id": 724495, "review_id": "639a580957d37800a2d321da", "author_rating": null, "review_text": "Amazing movie!", "created_at": "2022-12-14T23:11:05.342Z"}, {"movie_id": 724495, "review_id": "643336aa9a643506f1b0e39b", "author_rating": 1.0, "review_text": "Oh come on with the good reviews, even if she wasn't an evil slave trader, the film comes across as a melodramatic propaganda piece from start to finish...\r\n\r\n... but then again, it was a melodramatic propaganda piece from start to finish...\r\n\r\n... but that's not why it's one of the movies with a huge disparancy between critic and user reviews on the more reputable sights.  It was intentionally polarizing.  Rational people are ripping into it because they turned a power hungry monster responsible for the slave trade and a fair amount of ethnic cleansing into an anti-slavery hero.  It was a monumental rewrite of history from start to finish, one so extreme you can't even give it the excuse of artistic license. \r\n\r\nAnd it was intentional, there were a lot of other people that you could make a heroic movie about that fit the mold they were looking for to push meh message.  But they chose this one because the point wasn't to praise the historical figure, the point was to praise the total rewrite of history.\r\n\r\nAnd make no mistake, that is the reason for the positive reviews.  They don't care that it's a cheap poorly written over-acted political propaganda flick, they are praising the fact that they blatantly and knowingly rewrote history, and then turned around and said \"we don't care, it's rewritten now, we have changed reality and, guess what, all of our goose stepping followers don't care either.\"", "created_at": "2023-04-09T22:05:30.530Z"}]