[{"movie_id": 102899, "review_id": "55d5a00792514102cf0041f2", "author_rating": null, "review_text": "I loved it it was so much fun and very funny, another marvel masterpiece", "created_at": "2015-08-20T09:38:15.691Z"}, {"movie_id": 102899, "review_id": "56207bd192514171cb006642", "author_rating": null, "review_text": "When one thinks of a typical super-hero actioner, they imagine the boisterous boundaries that are associated with such an explosive genre: eye-popping special effects, outlandish and grand-standing villains, world domination escapades, complex yet flashy super-heroes that seem unreal and unapologetic and a big scale of unbelievable escapism that is tellingly becoming of a comic book epic on the big screen for the hungry eyes of the giddy moviegoer. Remember, all these described elements are not a bad thing when it comes to larger than life comic book/superhero fantasies. In fact, we almost insist that our volt-minded vehicles have some kinetic kick to its pulsating, pithy adventures. After all, there is certainly nothing wrong with that approach to the cinematic sensationalism of summertime popcorn pleasers and the costumed heroes that take us on that daring, rollicking ride of magical mayhem.\r\n\r\nHowever, director Peyton Reed’s ‘Ant-Man’ symbolizes a different texture and tone to the familiar action-packed world of Marvel Comics’ outrageous universe both on the printed pages and in the dark movie theaters. It does not necessarily use the overwrought or ultra-stimulating tactics to sell its percolating product as a super-charged heroic fable of mighty manipulators out to save the planet in the tradition of frantic favorites such as ‘The Avengers’ film franchise for instance. Instead, ‘Ant-Man’ relies on its small and intimate take of quirkiness, introspection, a gentle doomsday message of despair and a measurement of an awkward man that wears his bugged-out wardrobe with a sense of curiosity and conviction. In essence, ‘Ant-Man’ is a costumed caper that is high-spirited in its low-key excitement…something quite refreshing and revered in the wild and wacky world of Marvel Comics’ representation of the super-studs and sasses that invade our cinematic sensibilities in the hazy days of summer.\r\n\r\n‘Ant-Man’ lead Paul Rudd, an affable actor that has shown various levels of competence in both comedies and dramas over the years, is the unlikely source to don an ant-oriented attire and let his charm and cheekiness take over as the tiny bugged-eyed avenger of right and might. Rudd plays Scott Lang, a former troubled lawbreaker and gifted engineer whose demons come back to haunt him when he gets involved in the burglary shenanigans with his bad news buddies (T.I. and Michael Pena). The reason for Lang’s lure back to crime: a cockeyed but convenient way to win over the affections of his estranged young daughter.\r\n\r\nInterestingly, another great analytical mind of mechanics and science in stand-offish Hank Pym (Oscar-winner Michael Douglas) is spotlighted as he too struggles to relate to his daughter as well in the pretty Hope Van Dyne (Evangeline Lilly). Anyhow, Pym has a colorful backstory as it is revealed that he used to save the world from harm as the underrated crime-fighter Ant-Man. There was no glory or special recognition for Pym’s heroics as the buggy super-hero but his devotion to his crime-stopping craft was realized nevertheless.\r\n\r\nAs ANT-MAN Paul Rudd's Scott Lang has plans to stop the criminnal foolishness besides raiding a giant-sized picnic basket in Peyton Reed's modest costume caper.\r\nAs ANT-MAN Paul Rudd’s Scott Lang has plans to stop the criminal foolishness besides raiding a giant-sized picnic basket in Peyton Reed’s modest costume caper.\r\nThe conflicted father-daughter tandem of Pym and Hope eventually recruit the beleaguered Lang to climb into the exo-skeletal red-and-black suit and become the current Ant-Man to continue the mission of promoting goodness over evil. In this specific case, Lang’s Ant-Man is asked to foil the nefarious agenda of Pym’s former protege and associate Darren Cross (Corey Stoll) who threatens to expose the revolutionary shrinking technology to anyone sinister that offers him an insane and immediate price for such secretive scientific information that could jeopardize mankind in the long run. Of course, it goes without saying, that Cross has an ominous alter-ego in the vile Yellowjacket whose back-and-forth clashing with Lang’s Ant-Man leads to the calculating and corrosive chess game of one skillful insidious insect trying to outwit and outmaneuver a conscientious one.\r\n\r\nSome may dismiss ‘Ant-Man’ as being too low-grade, cheesy and incidental in its confrontational canvas of saints versus sinners. Still, Reed’s handling of his Marvel-inspired ‘battle of the bugs’ is a winning formula in simplicity because it does not have to be rooted in a spectacular and showy landscape as the other successful bombastic blockbusters that come out of the frivolous factory of Hollywood. Essentially, ‘Ant-Man’ demonstrates the right kind of personality and prestige for its presentation as a scaled-down comic book actioner steeped in the personalized disillusionment of the characterizations and their assorted psyches. Sure, ‘Ant-Man’ will not let anyone forget its popular competitor in the much glorified and iconic standing of another insect-fighting Marvel mastermind in ‘Spider-Ma’n anytime soon. Yet Scott Lang’s Ant-Man is just as angst-ridden, impish, awkward and devoted as Peter Parker’s resilient web-headed wonder Spidey.   \r\n\r\nThe drama unfolds so convincingly in ‘Ant-Man’ not so much because of the dire dilemma of comicbook goodness and badness but because of the examination of deteriorating relations between broken men and their families or more specifically between fathers and daughters. Both Rudd and Douglas are committed to their roles as the Ant-Men that saved the world with ease past and present but could not say the same thing about rescuing the domestic responsibilities that eluded them under their own roofs. As Lang tries to find an opening for forgiveness toward his little girl and remarried ex-wife (Judy Greer), his current adviser Pym struggles to put the pieces together with a disgruntled Hope that blames her father for the neglect of her well-being as well as the death of her beloved late mother known as the Wasp, a super-heroine that shined in her own shadow of accomplishment.\r\n\r\n‘Ant-Man’ is a soulfully weird, witty sliced-down spectacle of a comicbook film that is rare in its skin to deliver the message of a connection not just to stamping out the cartoonish crime and chaos that is routinely found in the playful playground of Marvel’s movie machine of high-powered personalities armed with skillful brute and brilliance. It also has something called heart and hope as it tackles the alienation and isolation of fathers and their vulnerable daughters. It will take more than a gigantic can of Raid to destroy the indomitable presence of ‘Ant-Man’ and what his hedonistic heroics, both physical and psychological, bring to the prized picnic table.\r\n\r\nAnt-Man (2015)\r\n\r\nWalt Disney Studios\r\n\r\n1 hr. 57 mins.\r\n\r\nStarring: Paul Rudd, Michael Douglas, Evangeline Lilly, Crey Stall, Michael Pena, Tip “T.I.” Harris, Judy Greer, Bobby Cannavale, Wood Harris and Abby Ryder Fortson\r\n\r\nDirected by: Peyton Reed\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comic Book Fantasy, Super-heroes, Action and Adventure\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)", "created_at": "2015-10-16T04:23:45.380Z"}, {"movie_id": 102899, "review_id": "566befe49251412dbc0029c4", "author_rating": 7.5, "review_text": "The Pocket Rocket.\r\n\r\nGiven the production problems and its long gestation period, Ant-Man is arguably far better than it had right to be. Unsurprisingly with a Marvel Super Hero film, the critical reactions have been mixed, but given it's not as gargantuan as most Marvel pics it proves to have a big entertaining heart. A pic cunningly viewing the Marvel Universe from a different angle, whilst also not over egging the pudding.\r\n\r\nThe effects work is impressive, the origin story narrative engrossing and with it carrying a lightness of touch, and there's a very enjoyable cast enthusiastically buying into the comic book frivolity. Sure, some of it's just plain daft, our hero's powers are hardly blunderbuss stuff, while the family melodramas bubbling away feel tired, but come the glorious finale, pandering to the child in us all, it's another Marvel winner readying itself for further adventures of Ant-Man. 7.5/10", "created_at": "2015-12-12T09:59:00.747Z"}, {"movie_id": 102899, "review_id": "566ee3b4925141664f00f834", "author_rating": 8.0, "review_text": "> Size doesn't matter if he's a superhero who committed to save the world.\r\n\r\nMy confession is I never read 'Ant-man' comics and I never knew such kind of superhero even exist in Marvel till this movie was announced. (But I know Danish film 'Antboy'.) So I'm glad they brought cinematic version of 'Ant-man' and I'm sure he'll return to the next 'Avengers' as they promoted strongly in this film itself to know what would be the audience response. I don't know others, but I definitely welcome the idea.\r\n\r\nAnother CGI magic, another Marvel's wonder. As long as they pick the right cast and crew with a good story, the sci-fi like this continues to rule the cinema world. It was a great team work, that must be appreciated. As usual the top notch visuals as well the performances, even the sidekicks. But I was surprised to see when Paul Rudd was attached to this project. I believed it would be a comedy sci-fi packed with full of action, and I was wrong. It was a simple tale, a heist theme and of course it was fun to watch, but never was a comedy movie.\r\n\r\nA wonderful beginning, especially for the first film in the series. You know strong foundation is the key to raise a building above. I know the sequels would only get better by progressing and it should be. Because in all the Marvel's superhero flicks, this one was the most family and young kids friendly. That does not mean there were no violence, but from the title to the characters and presentation, all were so casual and can be understood by all.\r\n\r\nIt was so great to see a legend like Michael Douglas to be a part in the modern movie. Now I am eager to see Evangeline Lily as Wasp-girl in the follow-up. It would be like Peter Pan and Tinker Bell, but in a sci-fi version. The extras were very interesting, I enjoyed them as well. If you're are yet to see the film, don't expect anything like Disney's 'Honey' trilogy, after all, if you enjoy the Marvel Cinematic Universe (MCU) then you would do same for it which is the twelfth to follow.\r\n\r\n7.5/10", "created_at": "2015-12-14T15:43:48.920Z"}, {"movie_id": 102899, "review_id": "58c16f88c3a36825db00a955", "author_rating": 6.0, "review_text": "I like Paul Rudd and was hoping this would be as funny as 'The Guardians of the Galaxy' but it wasn't. It looked good and the direction was solid but I think it suffered from the constant screenplay rewrites that the film underwent by changing the screenwriters (Edgar Wright and Joe Cornish).\r\n\r\nI also felt it was a bit too long-winded and it was unbalanced. However, the main good feature in this film was the special effects.\r\n\r\n★★★", "created_at": "2017-03-09T15:06:48.830Z"}, {"movie_id": 102899, "review_id": "5a797cd1c3a368224e01f813", "author_rating": 8.0, "review_text": "I have to say that I did not have great hopes for this movie. However, I found it surprisingly enjoyable. As can be expected from a Marvel super hero movie it is not the most intelligent plot around but instead rather heavy on special effects.\r\n\r\nHaving said that the plot is not bad given the context. I have never read any of the Ant-Man comics so I had no idea what to expect. The little expectation I had was of some guy turning into some ant like creature smashing things left right and center. So it was somewhat of a surprise to me when I found out that the guy was actually shrinking himself to ant size. Actually I went a bit “what the f…” when I first realized this and felt that this was going to be boring.\r\n\r\nHowever, in the end, I felt it worked out quite well. If it would have just been about some guy shrinking himself then it would indeed have been somewhat boring but the added coolness of this guy being able to command armies of bad-ass ants really helped stave of the boredom.\r\n\r\nAs I wrote above it is a Marvel super hero movie so it is heavy on special effects and, personally, I felt they where quite okay. There is of course quite a bit of action in the movie as well as a bit of humour. I quite liked the parts where the Ant-Man and his nemesis slugged it out in a children’s room and a giant size Thomas the Tank Engine was thrown through the roof and into the garden. Maybe I liked it because Thomas the Tank Engine is a TV show that my kids liked to watch when they were smaller. There where of course a few of the usual Hollywood silly, brain-dead stunts like the tank scene. It could have been so cool but it was really ruined by the total lack of intelligence in the stunt following the cool revelation.\r\n\r\nI really liked Michael Douglas as Dr. Hank Pym as well as Evangeline Lilly as Hope Van Dyne. I was not too impressed by Paul Rudd but on the while I guess he was not too bad. It is a bit of a shame though that when Hollywood feels they need to throw in a bit of family drama they always have to throw in a divorce. It is rather depressing for us that have lived through such a tragedy after all.\r\n\r\nBottom line, this was a surprisingly enjoyable movie. Far better than quite a few of the super hero movies that Marvel/Hollywood have produced like for instance the abysmal Spiderman movies although that is of course a personal opinion.", "created_at": "2018-02-06T10:00:49.171Z"}, {"movie_id": 102899, "review_id": "5b167994925141783b016ef4", "author_rating": 6.0, "review_text": "Less spectacle than most MCU films have been serving up, particularly in phase two, but the story and characterisation is actually a little stronger than the past couple of tales Marvel has served up.\r\n\r\nVillain Darren Cross, AKA “Yellowjacket” (originally a hero in the comics) lacks the onscreen presence of top tier Marvel-evil Loki, but is certainly one of the stronger offerings the MCU has given us. His twisted relationship with his former mentor gives another level to this Marvel film not seen since _Winter Soldier_.\r\n\r\nNot so much a super hero film as a super heist film, _Ant-Man_ was a welcome refreshment to the comic book movie party, and though I always like to give myself some time to find exactly where MCU films fit in my overall experience, at the moment I would say _Ant-Man_ sits somewhere comfortably in the middle, maybe even a bit below, but is still well worth a watch, even for those who aren’t deeply involved with the film series as a whole.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-06-05T11:52:52.340Z"}, {"movie_id": 102899, "review_id": "5c22e491c3a3681c34ee395c", "author_rating": 8.0, "review_text": "***Ant-Man?***  \r\n\r\nReleased in 2015, \"Ant-Man\" stars Paul Rudd as Scott Lang, a cat burglar who is offered redemption and the opportunity to be a hero. Michael Douglas plays his mentor, Hank Pym, and Evangeline Lilly Pym's daughter; meanwhile Corey Stoll co-stars as the heavy.\r\n\r\nIn my vast arsenal of old comics I have only one issue where Ant-Man is the main star: Marvel Feature #10, which featured Hank Pym as the hero, not to mention his wife, the Wasp, AKA Janet van Dyne. The character's run in that comic ceased with that very issue. By the 80s Scott Lang, a good-intentioned thief, became Ant-Man after stealing Pym's Ant-Man suit to save his daughter. With the encouragement of Pym, Lang became Ant-Man full-time.\r\n\r\nThe movie is based on these events and I was surprised at how entertaining it is considering how relatively minor the hero is. The movie even makes a joke about this when Ant-Man comes face-to-face with the Falcon (Anthony Mackie). Speaking of which, it's great to see the Falcon in action. It's also great to see Yellowjacket who, in the comics, was Hank Pym after Lang took over as Ant-Man. In the movie Yellowjacket is the villain (Stoll), which is okay since Pym's Yellowjacket in the comics sort of became a villain when he had a mental breakdown and was eventually divorced by Janet, the Wasp. The filmmakers incidentally did an excellent job with the Yellowjacket suit.\r\n\r\n\"Ant-Man\" was a surprise hit at the box office and understandably so. It's a quality superhero flick done with style and brimming with confidence. It's nothing more than this, but that's all it needs to be. It's nice to see Michael Douglas who was, believe-it-or-not, 70 years-old during shooting. He shines in the movie as Pym and could easily pass for ten years younger. I also really liked the Quantum Realm sequence when Lang is reduced to microscopic size.\r\n\r\nThe film runs 117 minutes and was shot in Georgia and San Francisco, CA. ADDITIONAL CAST: Judy Greer, Bobby Cannavale and Michael Peña.\r\n\r\nGRADE: B+/A-", "created_at": "2018-12-26T02:16:49.233Z"}, {"movie_id": 102899, "review_id": "5c842634c3a3684e8cdacb22", "author_rating": 7.0, "review_text": "Ant-Man is a much needed breath of fresh air from all the city-breaking, galaxy saving epicness of the past five Marvel movies. It's a nice, light, fun heist movie with some pretty cool effects and a great cast of characters.\r\n\r\nMichael Pena, T.I. and David Dastmalchian make this movie so much more enjoyable. Not that Paul Rudd, Evangeline Lilly, Michael Douglas, and Corey Still aren't great, but those three as a sidekick trio crack me up.\r\n\r\nEdgar Wright's stamp is all over this movie and it's a shame his directorial touch is missing, because he would have known what to remove to make it even better.\r\n\r\nBut all in all, Ant-Man is great entertainment with a feel good story about a man trying to be the hero his kid thinks he is.", "created_at": "2019-03-09T20:46:44.404Z"}, {"movie_id": 102899, "review_id": "60074f49be4b36003dce761f", "author_rating": 8.0, "review_text": "Much better than anticipated, I actually thoroughly enjoyed <em>'Ant-Man'</em>. The concept is silly, but I felt it made it work very well.\r\n\r\nIt starts off as more Paul Rudd-esque than Marvel-esque, especially with the comedy. I wasn't expecting much from it at that point, not that it was necessarily bad or anything but it wasn't what I'd expect from an MCU film. However, positively, it turns into something that fits in this universe.\r\n\r\nI enjoyed the action, score and humour. The cast do good things, with Paul Rudd filling the titular role nicely. I also really enjoyed Michael Douglas. Evangeline Lilly and Michael Peña are pluses, too. Corey Stoll, meanwhile, is a little meh I will say - entirely passable, but nothing memorable.\r\n\r\nThis is a pleasant watch, one I'd recommend.", "created_at": "2021-01-19T21:29:45.018Z"}, {"movie_id": 102899, "review_id": "643e2d6ff288380314aa8b9d", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-18T05:41:03.238Z"}, {"movie_id": 102899, "review_id": "64430e63b3f6f502fc9e2386", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:29:55.349Z"}, {"movie_id": 102899, "review_id": "64430e7105822404bf324396", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:30:10.010Z"}, {"movie_id": 102899, "review_id": "55d5a00792514102cf0041f2", "author_rating": null, "review_text": "I loved it it was so much fun and very funny, another marvel masterpiece", "created_at": "2015-08-20T09:38:15.691Z"}, {"movie_id": 102899, "review_id": "56207bd192514171cb006642", "author_rating": null, "review_text": "When one thinks of a typical super-hero actioner, they imagine the boisterous boundaries that are associated with such an explosive genre: eye-popping special effects, outlandish and grand-standing villains, world domination escapades, complex yet flashy super-heroes that seem unreal and unapologetic and a big scale of unbelievable escapism that is tellingly becoming of a comic book epic on the big screen for the hungry eyes of the giddy moviegoer. Remember, all these described elements are not a bad thing when it comes to larger than life comic book/superhero fantasies. In fact, we almost insist that our volt-minded vehicles have some kinetic kick to its pulsating, pithy adventures. After all, there is certainly nothing wrong with that approach to the cinematic sensationalism of summertime popcorn pleasers and the costumed heroes that take us on that daring, rollicking ride of magical mayhem.\r\n\r\nHowever, director Peyton Reed’s ‘Ant-Man’ symbolizes a different texture and tone to the familiar action-packed world of Marvel Comics’ outrageous universe both on the printed pages and in the dark movie theaters. It does not necessarily use the overwrought or ultra-stimulating tactics to sell its percolating product as a super-charged heroic fable of mighty manipulators out to save the planet in the tradition of frantic favorites such as ‘The Avengers’ film franchise for instance. Instead, ‘Ant-Man’ relies on its small and intimate take of quirkiness, introspection, a gentle doomsday message of despair and a measurement of an awkward man that wears his bugged-out wardrobe with a sense of curiosity and conviction. In essence, ‘Ant-Man’ is a costumed caper that is high-spirited in its low-key excitement…something quite refreshing and revered in the wild and wacky world of Marvel Comics’ representation of the super-studs and sasses that invade our cinematic sensibilities in the hazy days of summer.\r\n\r\n‘Ant-Man’ lead Paul Rudd, an affable actor that has shown various levels of competence in both comedies and dramas over the years, is the unlikely source to don an ant-oriented attire and let his charm and cheekiness take over as the tiny bugged-eyed avenger of right and might. Rudd plays Scott Lang, a former troubled lawbreaker and gifted engineer whose demons come back to haunt him when he gets involved in the burglary shenanigans with his bad news buddies (T.I. and Michael Pena). The reason for Lang’s lure back to crime: a cockeyed but convenient way to win over the affections of his estranged young daughter.\r\n\r\nInterestingly, another great analytical mind of mechanics and science in stand-offish Hank Pym (Oscar-winner Michael Douglas) is spotlighted as he too struggles to relate to his daughter as well in the pretty Hope Van Dyne (Evangeline Lilly). Anyhow, Pym has a colorful backstory as it is revealed that he used to save the world from harm as the underrated crime-fighter Ant-Man. There was no glory or special recognition for Pym’s heroics as the buggy super-hero but his devotion to his crime-stopping craft was realized nevertheless.\r\n\r\nAs ANT-MAN Paul Rudd's Scott Lang has plans to stop the criminnal foolishness besides raiding a giant-sized picnic basket in Peyton Reed's modest costume caper.\r\nAs ANT-MAN Paul Rudd’s Scott Lang has plans to stop the criminal foolishness besides raiding a giant-sized picnic basket in Peyton Reed’s modest costume caper.\r\nThe conflicted father-daughter tandem of Pym and Hope eventually recruit the beleaguered Lang to climb into the exo-skeletal red-and-black suit and become the current Ant-Man to continue the mission of promoting goodness over evil. In this specific case, Lang’s Ant-Man is asked to foil the nefarious agenda of Pym’s former protege and associate Darren Cross (Corey Stoll) who threatens to expose the revolutionary shrinking technology to anyone sinister that offers him an insane and immediate price for such secretive scientific information that could jeopardize mankind in the long run. Of course, it goes without saying, that Cross has an ominous alter-ego in the vile Yellowjacket whose back-and-forth clashing with Lang’s Ant-Man leads to the calculating and corrosive chess game of one skillful insidious insect trying to outwit and outmaneuver a conscientious one.\r\n\r\nSome may dismiss ‘Ant-Man’ as being too low-grade, cheesy and incidental in its confrontational canvas of saints versus sinners. Still, Reed’s handling of his Marvel-inspired ‘battle of the bugs’ is a winning formula in simplicity because it does not have to be rooted in a spectacular and showy landscape as the other successful bombastic blockbusters that come out of the frivolous factory of Hollywood. Essentially, ‘Ant-Man’ demonstrates the right kind of personality and prestige for its presentation as a scaled-down comic book actioner steeped in the personalized disillusionment of the characterizations and their assorted psyches. Sure, ‘Ant-Man’ will not let anyone forget its popular competitor in the much glorified and iconic standing of another insect-fighting Marvel mastermind in ‘Spider-Ma’n anytime soon. Yet Scott Lang’s Ant-Man is just as angst-ridden, impish, awkward and devoted as Peter Parker’s resilient web-headed wonder Spidey.   \r\n\r\nThe drama unfolds so convincingly in ‘Ant-Man’ not so much because of the dire dilemma of comicbook goodness and badness but because of the examination of deteriorating relations between broken men and their families or more specifically between fathers and daughters. Both Rudd and Douglas are committed to their roles as the Ant-Men that saved the world with ease past and present but could not say the same thing about rescuing the domestic responsibilities that eluded them under their own roofs. As Lang tries to find an opening for forgiveness toward his little girl and remarried ex-wife (Judy Greer), his current adviser Pym struggles to put the pieces together with a disgruntled Hope that blames her father for the neglect of her well-being as well as the death of her beloved late mother known as the Wasp, a super-heroine that shined in her own shadow of accomplishment.\r\n\r\n‘Ant-Man’ is a soulfully weird, witty sliced-down spectacle of a comicbook film that is rare in its skin to deliver the message of a connection not just to stamping out the cartoonish crime and chaos that is routinely found in the playful playground of Marvel’s movie machine of high-powered personalities armed with skillful brute and brilliance. It also has something called heart and hope as it tackles the alienation and isolation of fathers and their vulnerable daughters. It will take more than a gigantic can of Raid to destroy the indomitable presence of ‘Ant-Man’ and what his hedonistic heroics, both physical and psychological, bring to the prized picnic table.\r\n\r\nAnt-Man (2015)\r\n\r\nWalt Disney Studios\r\n\r\n1 hr. 57 mins.\r\n\r\nStarring: Paul Rudd, Michael Douglas, Evangeline Lilly, Crey Stall, Michael Pena, Tip “T.I.” Harris, Judy Greer, Bobby Cannavale, Wood Harris and Abby Ryder Fortson\r\n\r\nDirected by: Peyton Reed\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comic Book Fantasy, Super-heroes, Action and Adventure\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)", "created_at": "2015-10-16T04:23:45.380Z"}, {"movie_id": 102899, "review_id": "566befe49251412dbc0029c4", "author_rating": 7.5, "review_text": "The Pocket Rocket.\r\n\r\nGiven the production problems and its long gestation period, Ant-Man is arguably far better than it had right to be. Unsurprisingly with a Marvel Super Hero film, the critical reactions have been mixed, but given it's not as gargantuan as most Marvel pics it proves to have a big entertaining heart. A pic cunningly viewing the Marvel Universe from a different angle, whilst also not over egging the pudding.\r\n\r\nThe effects work is impressive, the origin story narrative engrossing and with it carrying a lightness of touch, and there's a very enjoyable cast enthusiastically buying into the comic book frivolity. Sure, some of it's just plain daft, our hero's powers are hardly blunderbuss stuff, while the family melodramas bubbling away feel tired, but come the glorious finale, pandering to the child in us all, it's another Marvel winner readying itself for further adventures of Ant-Man. 7.5/10", "created_at": "2015-12-12T09:59:00.747Z"}, {"movie_id": 102899, "review_id": "566ee3b4925141664f00f834", "author_rating": 8.0, "review_text": "> Size doesn't matter if he's a superhero who committed to save the world.\r\n\r\nMy confession is I never read 'Ant-man' comics and I never knew such kind of superhero even exist in Marvel till this movie was announced. (But I know Danish film 'Antboy'.) So I'm glad they brought cinematic version of 'Ant-man' and I'm sure he'll return to the next 'Avengers' as they promoted strongly in this film itself to know what would be the audience response. I don't know others, but I definitely welcome the idea.\r\n\r\nAnother CGI magic, another Marvel's wonder. As long as they pick the right cast and crew with a good story, the sci-fi like this continues to rule the cinema world. It was a great team work, that must be appreciated. As usual the top notch visuals as well the performances, even the sidekicks. But I was surprised to see when Paul Rudd was attached to this project. I believed it would be a comedy sci-fi packed with full of action, and I was wrong. It was a simple tale, a heist theme and of course it was fun to watch, but never was a comedy movie.\r\n\r\nA wonderful beginning, especially for the first film in the series. You know strong foundation is the key to raise a building above. I know the sequels would only get better by progressing and it should be. Because in all the Marvel's superhero flicks, this one was the most family and young kids friendly. That does not mean there were no violence, but from the title to the characters and presentation, all were so casual and can be understood by all.\r\n\r\nIt was so great to see a legend like Michael Douglas to be a part in the modern movie. Now I am eager to see Evangeline Lily as Wasp-girl in the follow-up. It would be like Peter Pan and Tinker Bell, but in a sci-fi version. The extras were very interesting, I enjoyed them as well. If you're are yet to see the film, don't expect anything like Disney's 'Honey' trilogy, after all, if you enjoy the Marvel Cinematic Universe (MCU) then you would do same for it which is the twelfth to follow.\r\n\r\n7.5/10", "created_at": "2015-12-14T15:43:48.920Z"}, {"movie_id": 102899, "review_id": "58c16f88c3a36825db00a955", "author_rating": 6.0, "review_text": "I like Paul Rudd and was hoping this would be as funny as 'The Guardians of the Galaxy' but it wasn't. It looked good and the direction was solid but I think it suffered from the constant screenplay rewrites that the film underwent by changing the screenwriters (Edgar Wright and Joe Cornish).\r\n\r\nI also felt it was a bit too long-winded and it was unbalanced. However, the main good feature in this film was the special effects.\r\n\r\n★★★", "created_at": "2017-03-09T15:06:48.830Z"}, {"movie_id": 102899, "review_id": "5a797cd1c3a368224e01f813", "author_rating": 8.0, "review_text": "I have to say that I did not have great hopes for this movie. However, I found it surprisingly enjoyable. As can be expected from a Marvel super hero movie it is not the most intelligent plot around but instead rather heavy on special effects.\r\n\r\nHaving said that the plot is not bad given the context. I have never read any of the Ant-Man comics so I had no idea what to expect. The little expectation I had was of some guy turning into some ant like creature smashing things left right and center. So it was somewhat of a surprise to me when I found out that the guy was actually shrinking himself to ant size. Actually I went a bit “what the f…” when I first realized this and felt that this was going to be boring.\r\n\r\nHowever, in the end, I felt it worked out quite well. If it would have just been about some guy shrinking himself then it would indeed have been somewhat boring but the added coolness of this guy being able to command armies of bad-ass ants really helped stave of the boredom.\r\n\r\nAs I wrote above it is a Marvel super hero movie so it is heavy on special effects and, personally, I felt they where quite okay. There is of course quite a bit of action in the movie as well as a bit of humour. I quite liked the parts where the Ant-Man and his nemesis slugged it out in a children’s room and a giant size Thomas the Tank Engine was thrown through the roof and into the garden. Maybe I liked it because Thomas the Tank Engine is a TV show that my kids liked to watch when they were smaller. There where of course a few of the usual Hollywood silly, brain-dead stunts like the tank scene. It could have been so cool but it was really ruined by the total lack of intelligence in the stunt following the cool revelation.\r\n\r\nI really liked Michael Douglas as Dr. Hank Pym as well as Evangeline Lilly as Hope Van Dyne. I was not too impressed by Paul Rudd but on the while I guess he was not too bad. It is a bit of a shame though that when Hollywood feels they need to throw in a bit of family drama they always have to throw in a divorce. It is rather depressing for us that have lived through such a tragedy after all.\r\n\r\nBottom line, this was a surprisingly enjoyable movie. Far better than quite a few of the super hero movies that Marvel/Hollywood have produced like for instance the abysmal Spiderman movies although that is of course a personal opinion.", "created_at": "2018-02-06T10:00:49.171Z"}, {"movie_id": 102899, "review_id": "5b167994925141783b016ef4", "author_rating": 6.0, "review_text": "Less spectacle than most MCU films have been serving up, particularly in phase two, but the story and characterisation is actually a little stronger than the past couple of tales Marvel has served up.\r\n\r\nVillain Darren Cross, AKA “Yellowjacket” (originally a hero in the comics) lacks the onscreen presence of top tier Marvel-evil Loki, but is certainly one of the stronger offerings the MCU has given us. His twisted relationship with his former mentor gives another level to this Marvel film not seen since _Winter Soldier_.\r\n\r\nNot so much a super hero film as a super heist film, _Ant-Man_ was a welcome refreshment to the comic book movie party, and though I always like to give myself some time to find exactly where MCU films fit in my overall experience, at the moment I would say _Ant-Man_ sits somewhere comfortably in the middle, maybe even a bit below, but is still well worth a watch, even for those who aren’t deeply involved with the film series as a whole.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-06-05T11:52:52.340Z"}, {"movie_id": 102899, "review_id": "5c22e491c3a3681c34ee395c", "author_rating": 8.0, "review_text": "***Ant-Man?***  \r\n\r\nReleased in 2015, \"Ant-Man\" stars Paul Rudd as Scott Lang, a cat burglar who is offered redemption and the opportunity to be a hero. Michael Douglas plays his mentor, Hank Pym, and Evangeline Lilly Pym's daughter; meanwhile Corey Stoll co-stars as the heavy.\r\n\r\nIn my vast arsenal of old comics I have only one issue where Ant-Man is the main star: Marvel Feature #10, which featured Hank Pym as the hero, not to mention his wife, the Wasp, AKA Janet van Dyne. The character's run in that comic ceased with that very issue. By the 80s Scott Lang, a good-intentioned thief, became Ant-Man after stealing Pym's Ant-Man suit to save his daughter. With the encouragement of Pym, Lang became Ant-Man full-time.\r\n\r\nThe movie is based on these events and I was surprised at how entertaining it is considering how relatively minor the hero is. The movie even makes a joke about this when Ant-Man comes face-to-face with the Falcon (Anthony Mackie). Speaking of which, it's great to see the Falcon in action. It's also great to see Yellowjacket who, in the comics, was Hank Pym after Lang took over as Ant-Man. In the movie Yellowjacket is the villain (Stoll), which is okay since Pym's Yellowjacket in the comics sort of became a villain when he had a mental breakdown and was eventually divorced by Janet, the Wasp. The filmmakers incidentally did an excellent job with the Yellowjacket suit.\r\n\r\n\"Ant-Man\" was a surprise hit at the box office and understandably so. It's a quality superhero flick done with style and brimming with confidence. It's nothing more than this, but that's all it needs to be. It's nice to see Michael Douglas who was, believe-it-or-not, 70 years-old during shooting. He shines in the movie as Pym and could easily pass for ten years younger. I also really liked the Quantum Realm sequence when Lang is reduced to microscopic size.\r\n\r\nThe film runs 117 minutes and was shot in Georgia and San Francisco, CA. ADDITIONAL CAST: Judy Greer, Bobby Cannavale and Michael Peña.\r\n\r\nGRADE: B+/A-", "created_at": "2018-12-26T02:16:49.233Z"}, {"movie_id": 102899, "review_id": "5c842634c3a3684e8cdacb22", "author_rating": 7.0, "review_text": "Ant-Man is a much needed breath of fresh air from all the city-breaking, galaxy saving epicness of the past five Marvel movies. It's a nice, light, fun heist movie with some pretty cool effects and a great cast of characters.\r\n\r\nMichael Pena, T.I. and David Dastmalchian make this movie so much more enjoyable. Not that Paul Rudd, Evangeline Lilly, Michael Douglas, and Corey Still aren't great, but those three as a sidekick trio crack me up.\r\n\r\nEdgar Wright's stamp is all over this movie and it's a shame his directorial touch is missing, because he would have known what to remove to make it even better.\r\n\r\nBut all in all, Ant-Man is great entertainment with a feel good story about a man trying to be the hero his kid thinks he is.", "created_at": "2019-03-09T20:46:44.404Z"}, {"movie_id": 102899, "review_id": "60074f49be4b36003dce761f", "author_rating": 8.0, "review_text": "Much better than anticipated, I actually thoroughly enjoyed <em>'Ant-Man'</em>. The concept is silly, but I felt it made it work very well.\r\n\r\nIt starts off as more Paul Rudd-esque than Marvel-esque, especially with the comedy. I wasn't expecting much from it at that point, not that it was necessarily bad or anything but it wasn't what I'd expect from an MCU film. However, positively, it turns into something that fits in this universe.\r\n\r\nI enjoyed the action, score and humour. The cast do good things, with Paul Rudd filling the titular role nicely. I also really enjoyed Michael Douglas. Evangeline Lilly and Michael Peña are pluses, too. Corey Stoll, meanwhile, is a little meh I will say - entirely passable, but nothing memorable.\r\n\r\nThis is a pleasant watch, one I'd recommend.", "created_at": "2021-01-19T21:29:45.018Z"}, {"movie_id": 102899, "review_id": "643e2d6ff288380314aa8b9d", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-18T05:41:03.238Z"}, {"movie_id": 102899, "review_id": "64430e63b3f6f502fc9e2386", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:29:55.349Z"}, {"movie_id": 102899, "review_id": "64430e7105822404bf324396", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:30:10.010Z"}, {"movie_id": 102899, "review_id": "55d5a00792514102cf0041f2", "author_rating": null, "review_text": "I loved it it was so much fun and very funny, another marvel masterpiece", "created_at": "2015-08-20T09:38:15.691Z"}, {"movie_id": 102899, "review_id": "56207bd192514171cb006642", "author_rating": null, "review_text": "When one thinks of a typical super-hero actioner, they imagine the boisterous boundaries that are associated with such an explosive genre: eye-popping special effects, outlandish and grand-standing villains, world domination escapades, complex yet flashy super-heroes that seem unreal and unapologetic and a big scale of unbelievable escapism that is tellingly becoming of a comic book epic on the big screen for the hungry eyes of the giddy moviegoer. Remember, all these described elements are not a bad thing when it comes to larger than life comic book/superhero fantasies. In fact, we almost insist that our volt-minded vehicles have some kinetic kick to its pulsating, pithy adventures. After all, there is certainly nothing wrong with that approach to the cinematic sensationalism of summertime popcorn pleasers and the costumed heroes that take us on that daring, rollicking ride of magical mayhem.\r\n\r\nHowever, director Peyton Reed’s ‘Ant-Man’ symbolizes a different texture and tone to the familiar action-packed world of Marvel Comics’ outrageous universe both on the printed pages and in the dark movie theaters. It does not necessarily use the overwrought or ultra-stimulating tactics to sell its percolating product as a super-charged heroic fable of mighty manipulators out to save the planet in the tradition of frantic favorites such as ‘The Avengers’ film franchise for instance. Instead, ‘Ant-Man’ relies on its small and intimate take of quirkiness, introspection, a gentle doomsday message of despair and a measurement of an awkward man that wears his bugged-out wardrobe with a sense of curiosity and conviction. In essence, ‘Ant-Man’ is a costumed caper that is high-spirited in its low-key excitement…something quite refreshing and revered in the wild and wacky world of Marvel Comics’ representation of the super-studs and sasses that invade our cinematic sensibilities in the hazy days of summer.\r\n\r\n‘Ant-Man’ lead Paul Rudd, an affable actor that has shown various levels of competence in both comedies and dramas over the years, is the unlikely source to don an ant-oriented attire and let his charm and cheekiness take over as the tiny bugged-eyed avenger of right and might. Rudd plays Scott Lang, a former troubled lawbreaker and gifted engineer whose demons come back to haunt him when he gets involved in the burglary shenanigans with his bad news buddies (T.I. and Michael Pena). The reason for Lang’s lure back to crime: a cockeyed but convenient way to win over the affections of his estranged young daughter.\r\n\r\nInterestingly, another great analytical mind of mechanics and science in stand-offish Hank Pym (Oscar-winner Michael Douglas) is spotlighted as he too struggles to relate to his daughter as well in the pretty Hope Van Dyne (Evangeline Lilly). Anyhow, Pym has a colorful backstory as it is revealed that he used to save the world from harm as the underrated crime-fighter Ant-Man. There was no glory or special recognition for Pym’s heroics as the buggy super-hero but his devotion to his crime-stopping craft was realized nevertheless.\r\n\r\nAs ANT-MAN Paul Rudd's Scott Lang has plans to stop the criminnal foolishness besides raiding a giant-sized picnic basket in Peyton Reed's modest costume caper.\r\nAs ANT-MAN Paul Rudd’s Scott Lang has plans to stop the criminal foolishness besides raiding a giant-sized picnic basket in Peyton Reed’s modest costume caper.\r\nThe conflicted father-daughter tandem of Pym and Hope eventually recruit the beleaguered Lang to climb into the exo-skeletal red-and-black suit and become the current Ant-Man to continue the mission of promoting goodness over evil. In this specific case, Lang’s Ant-Man is asked to foil the nefarious agenda of Pym’s former protege and associate Darren Cross (Corey Stoll) who threatens to expose the revolutionary shrinking technology to anyone sinister that offers him an insane and immediate price for such secretive scientific information that could jeopardize mankind in the long run. Of course, it goes without saying, that Cross has an ominous alter-ego in the vile Yellowjacket whose back-and-forth clashing with Lang’s Ant-Man leads to the calculating and corrosive chess game of one skillful insidious insect trying to outwit and outmaneuver a conscientious one.\r\n\r\nSome may dismiss ‘Ant-Man’ as being too low-grade, cheesy and incidental in its confrontational canvas of saints versus sinners. Still, Reed’s handling of his Marvel-inspired ‘battle of the bugs’ is a winning formula in simplicity because it does not have to be rooted in a spectacular and showy landscape as the other successful bombastic blockbusters that come out of the frivolous factory of Hollywood. Essentially, ‘Ant-Man’ demonstrates the right kind of personality and prestige for its presentation as a scaled-down comic book actioner steeped in the personalized disillusionment of the characterizations and their assorted psyches. Sure, ‘Ant-Man’ will not let anyone forget its popular competitor in the much glorified and iconic standing of another insect-fighting Marvel mastermind in ‘Spider-Ma’n anytime soon. Yet Scott Lang’s Ant-Man is just as angst-ridden, impish, awkward and devoted as Peter Parker’s resilient web-headed wonder Spidey.   \r\n\r\nThe drama unfolds so convincingly in ‘Ant-Man’ not so much because of the dire dilemma of comicbook goodness and badness but because of the examination of deteriorating relations between broken men and their families or more specifically between fathers and daughters. Both Rudd and Douglas are committed to their roles as the Ant-Men that saved the world with ease past and present but could not say the same thing about rescuing the domestic responsibilities that eluded them under their own roofs. As Lang tries to find an opening for forgiveness toward his little girl and remarried ex-wife (Judy Greer), his current adviser Pym struggles to put the pieces together with a disgruntled Hope that blames her father for the neglect of her well-being as well as the death of her beloved late mother known as the Wasp, a super-heroine that shined in her own shadow of accomplishment.\r\n\r\n‘Ant-Man’ is a soulfully weird, witty sliced-down spectacle of a comicbook film that is rare in its skin to deliver the message of a connection not just to stamping out the cartoonish crime and chaos that is routinely found in the playful playground of Marvel’s movie machine of high-powered personalities armed with skillful brute and brilliance. It also has something called heart and hope as it tackles the alienation and isolation of fathers and their vulnerable daughters. It will take more than a gigantic can of Raid to destroy the indomitable presence of ‘Ant-Man’ and what his hedonistic heroics, both physical and psychological, bring to the prized picnic table.\r\n\r\nAnt-Man (2015)\r\n\r\nWalt Disney Studios\r\n\r\n1 hr. 57 mins.\r\n\r\nStarring: Paul Rudd, Michael Douglas, Evangeline Lilly, Crey Stall, Michael Pena, Tip “T.I.” Harris, Judy Greer, Bobby Cannavale, Wood Harris and Abby Ryder Fortson\r\n\r\nDirected by: Peyton Reed\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comic Book Fantasy, Super-heroes, Action and Adventure\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)", "created_at": "2015-10-16T04:23:45.380Z"}, {"movie_id": 102899, "review_id": "566befe49251412dbc0029c4", "author_rating": 7.5, "review_text": "The Pocket Rocket.\r\n\r\nGiven the production problems and its long gestation period, Ant-Man is arguably far better than it had right to be. Unsurprisingly with a Marvel Super Hero film, the critical reactions have been mixed, but given it's not as gargantuan as most Marvel pics it proves to have a big entertaining heart. A pic cunningly viewing the Marvel Universe from a different angle, whilst also not over egging the pudding.\r\n\r\nThe effects work is impressive, the origin story narrative engrossing and with it carrying a lightness of touch, and there's a very enjoyable cast enthusiastically buying into the comic book frivolity. Sure, some of it's just plain daft, our hero's powers are hardly blunderbuss stuff, while the family melodramas bubbling away feel tired, but come the glorious finale, pandering to the child in us all, it's another Marvel winner readying itself for further adventures of Ant-Man. 7.5/10", "created_at": "2015-12-12T09:59:00.747Z"}, {"movie_id": 102899, "review_id": "566ee3b4925141664f00f834", "author_rating": 8.0, "review_text": "> Size doesn't matter if he's a superhero who committed to save the world.\r\n\r\nMy confession is I never read 'Ant-man' comics and I never knew such kind of superhero even exist in Marvel till this movie was announced. (But I know Danish film 'Antboy'.) So I'm glad they brought cinematic version of 'Ant-man' and I'm sure he'll return to the next 'Avengers' as they promoted strongly in this film itself to know what would be the audience response. I don't know others, but I definitely welcome the idea.\r\n\r\nAnother CGI magic, another Marvel's wonder. As long as they pick the right cast and crew with a good story, the sci-fi like this continues to rule the cinema world. It was a great team work, that must be appreciated. As usual the top notch visuals as well the performances, even the sidekicks. But I was surprised to see when Paul Rudd was attached to this project. I believed it would be a comedy sci-fi packed with full of action, and I was wrong. It was a simple tale, a heist theme and of course it was fun to watch, but never was a comedy movie.\r\n\r\nA wonderful beginning, especially for the first film in the series. You know strong foundation is the key to raise a building above. I know the sequels would only get better by progressing and it should be. Because in all the Marvel's superhero flicks, this one was the most family and young kids friendly. That does not mean there were no violence, but from the title to the characters and presentation, all were so casual and can be understood by all.\r\n\r\nIt was so great to see a legend like Michael Douglas to be a part in the modern movie. Now I am eager to see Evangeline Lily as Wasp-girl in the follow-up. It would be like Peter Pan and Tinker Bell, but in a sci-fi version. The extras were very interesting, I enjoyed them as well. If you're are yet to see the film, don't expect anything like Disney's 'Honey' trilogy, after all, if you enjoy the Marvel Cinematic Universe (MCU) then you would do same for it which is the twelfth to follow.\r\n\r\n7.5/10", "created_at": "2015-12-14T15:43:48.920Z"}, {"movie_id": 102899, "review_id": "58c16f88c3a36825db00a955", "author_rating": 6.0, "review_text": "I like Paul Rudd and was hoping this would be as funny as 'The Guardians of the Galaxy' but it wasn't. It looked good and the direction was solid but I think it suffered from the constant screenplay rewrites that the film underwent by changing the screenwriters (Edgar Wright and Joe Cornish).\r\n\r\nI also felt it was a bit too long-winded and it was unbalanced. However, the main good feature in this film was the special effects.\r\n\r\n★★★", "created_at": "2017-03-09T15:06:48.830Z"}, {"movie_id": 102899, "review_id": "5a797cd1c3a368224e01f813", "author_rating": 8.0, "review_text": "I have to say that I did not have great hopes for this movie. However, I found it surprisingly enjoyable. As can be expected from a Marvel super hero movie it is not the most intelligent plot around but instead rather heavy on special effects.\r\n\r\nHaving said that the plot is not bad given the context. I have never read any of the Ant-Man comics so I had no idea what to expect. The little expectation I had was of some guy turning into some ant like creature smashing things left right and center. So it was somewhat of a surprise to me when I found out that the guy was actually shrinking himself to ant size. Actually I went a bit “what the f…” when I first realized this and felt that this was going to be boring.\r\n\r\nHowever, in the end, I felt it worked out quite well. If it would have just been about some guy shrinking himself then it would indeed have been somewhat boring but the added coolness of this guy being able to command armies of bad-ass ants really helped stave of the boredom.\r\n\r\nAs I wrote above it is a Marvel super hero movie so it is heavy on special effects and, personally, I felt they where quite okay. There is of course quite a bit of action in the movie as well as a bit of humour. I quite liked the parts where the Ant-Man and his nemesis slugged it out in a children’s room and a giant size Thomas the Tank Engine was thrown through the roof and into the garden. Maybe I liked it because Thomas the Tank Engine is a TV show that my kids liked to watch when they were smaller. There where of course a few of the usual Hollywood silly, brain-dead stunts like the tank scene. It could have been so cool but it was really ruined by the total lack of intelligence in the stunt following the cool revelation.\r\n\r\nI really liked Michael Douglas as Dr. Hank Pym as well as Evangeline Lilly as Hope Van Dyne. I was not too impressed by Paul Rudd but on the while I guess he was not too bad. It is a bit of a shame though that when Hollywood feels they need to throw in a bit of family drama they always have to throw in a divorce. It is rather depressing for us that have lived through such a tragedy after all.\r\n\r\nBottom line, this was a surprisingly enjoyable movie. Far better than quite a few of the super hero movies that Marvel/Hollywood have produced like for instance the abysmal Spiderman movies although that is of course a personal opinion.", "created_at": "2018-02-06T10:00:49.171Z"}, {"movie_id": 102899, "review_id": "5b167994925141783b016ef4", "author_rating": 6.0, "review_text": "Less spectacle than most MCU films have been serving up, particularly in phase two, but the story and characterisation is actually a little stronger than the past couple of tales Marvel has served up.\r\n\r\nVillain Darren Cross, AKA “Yellowjacket” (originally a hero in the comics) lacks the onscreen presence of top tier Marvel-evil Loki, but is certainly one of the stronger offerings the MCU has given us. His twisted relationship with his former mentor gives another level to this Marvel film not seen since _Winter Soldier_.\r\n\r\nNot so much a super hero film as a super heist film, _Ant-Man_ was a welcome refreshment to the comic book movie party, and though I always like to give myself some time to find exactly where MCU films fit in my overall experience, at the moment I would say _Ant-Man_ sits somewhere comfortably in the middle, maybe even a bit below, but is still well worth a watch, even for those who aren’t deeply involved with the film series as a whole.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-06-05T11:52:52.340Z"}, {"movie_id": 102899, "review_id": "5c22e491c3a3681c34ee395c", "author_rating": 8.0, "review_text": "***Ant-Man?***  \r\n\r\nReleased in 2015, \"Ant-Man\" stars Paul Rudd as Scott Lang, a cat burglar who is offered redemption and the opportunity to be a hero. Michael Douglas plays his mentor, Hank Pym, and Evangeline Lilly Pym's daughter; meanwhile Corey Stoll co-stars as the heavy.\r\n\r\nIn my vast arsenal of old comics I have only one issue where Ant-Man is the main star: Marvel Feature #10, which featured Hank Pym as the hero, not to mention his wife, the Wasp, AKA Janet van Dyne. The character's run in that comic ceased with that very issue. By the 80s Scott Lang, a good-intentioned thief, became Ant-Man after stealing Pym's Ant-Man suit to save his daughter. With the encouragement of Pym, Lang became Ant-Man full-time.\r\n\r\nThe movie is based on these events and I was surprised at how entertaining it is considering how relatively minor the hero is. The movie even makes a joke about this when Ant-Man comes face-to-face with the Falcon (Anthony Mackie). Speaking of which, it's great to see the Falcon in action. It's also great to see Yellowjacket who, in the comics, was Hank Pym after Lang took over as Ant-Man. In the movie Yellowjacket is the villain (Stoll), which is okay since Pym's Yellowjacket in the comics sort of became a villain when he had a mental breakdown and was eventually divorced by Janet, the Wasp. The filmmakers incidentally did an excellent job with the Yellowjacket suit.\r\n\r\n\"Ant-Man\" was a surprise hit at the box office and understandably so. It's a quality superhero flick done with style and brimming with confidence. It's nothing more than this, but that's all it needs to be. It's nice to see Michael Douglas who was, believe-it-or-not, 70 years-old during shooting. He shines in the movie as Pym and could easily pass for ten years younger. I also really liked the Quantum Realm sequence when Lang is reduced to microscopic size.\r\n\r\nThe film runs 117 minutes and was shot in Georgia and San Francisco, CA. ADDITIONAL CAST: Judy Greer, Bobby Cannavale and Michael Peña.\r\n\r\nGRADE: B+/A-", "created_at": "2018-12-26T02:16:49.233Z"}, {"movie_id": 102899, "review_id": "5c842634c3a3684e8cdacb22", "author_rating": 7.0, "review_text": "Ant-Man is a much needed breath of fresh air from all the city-breaking, galaxy saving epicness of the past five Marvel movies. It's a nice, light, fun heist movie with some pretty cool effects and a great cast of characters.\r\n\r\nMichael Pena, T.I. and David Dastmalchian make this movie so much more enjoyable. Not that Paul Rudd, Evangeline Lilly, Michael Douglas, and Corey Still aren't great, but those three as a sidekick trio crack me up.\r\n\r\nEdgar Wright's stamp is all over this movie and it's a shame his directorial touch is missing, because he would have known what to remove to make it even better.\r\n\r\nBut all in all, Ant-Man is great entertainment with a feel good story about a man trying to be the hero his kid thinks he is.", "created_at": "2019-03-09T20:46:44.404Z"}, {"movie_id": 102899, "review_id": "60074f49be4b36003dce761f", "author_rating": 8.0, "review_text": "Much better than anticipated, I actually thoroughly enjoyed <em>'Ant-Man'</em>. The concept is silly, but I felt it made it work very well.\r\n\r\nIt starts off as more Paul Rudd-esque than Marvel-esque, especially with the comedy. I wasn't expecting much from it at that point, not that it was necessarily bad or anything but it wasn't what I'd expect from an MCU film. However, positively, it turns into something that fits in this universe.\r\n\r\nI enjoyed the action, score and humour. The cast do good things, with Paul Rudd filling the titular role nicely. I also really enjoyed Michael Douglas. Evangeline Lilly and Michael Peña are pluses, too. Corey Stoll, meanwhile, is a little meh I will say - entirely passable, but nothing memorable.\r\n\r\nThis is a pleasant watch, one I'd recommend.", "created_at": "2021-01-19T21:29:45.018Z"}, {"movie_id": 102899, "review_id": "643e2d6ff288380314aa8b9d", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-18T05:41:03.238Z"}, {"movie_id": 102899, "review_id": "64430e63b3f6f502fc9e2386", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:29:55.349Z"}, {"movie_id": 102899, "review_id": "64430e7105822404bf324396", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:30:10.010Z"}, {"movie_id": 102899, "review_id": "55d5a00792514102cf0041f2", "author_rating": null, "review_text": "I loved it it was so much fun and very funny, another marvel masterpiece", "created_at": "2015-08-20T09:38:15.691Z"}, {"movie_id": 102899, "review_id": "56207bd192514171cb006642", "author_rating": null, "review_text": "When one thinks of a typical super-hero actioner, they imagine the boisterous boundaries that are associated with such an explosive genre: eye-popping special effects, outlandish and grand-standing villains, world domination escapades, complex yet flashy super-heroes that seem unreal and unapologetic and a big scale of unbelievable escapism that is tellingly becoming of a comic book epic on the big screen for the hungry eyes of the giddy moviegoer. Remember, all these described elements are not a bad thing when it comes to larger than life comic book/superhero fantasies. In fact, we almost insist that our volt-minded vehicles have some kinetic kick to its pulsating, pithy adventures. After all, there is certainly nothing wrong with that approach to the cinematic sensationalism of summertime popcorn pleasers and the costumed heroes that take us on that daring, rollicking ride of magical mayhem.\r\n\r\nHowever, director Peyton Reed’s ‘Ant-Man’ symbolizes a different texture and tone to the familiar action-packed world of Marvel Comics’ outrageous universe both on the printed pages and in the dark movie theaters. It does not necessarily use the overwrought or ultra-stimulating tactics to sell its percolating product as a super-charged heroic fable of mighty manipulators out to save the planet in the tradition of frantic favorites such as ‘The Avengers’ film franchise for instance. Instead, ‘Ant-Man’ relies on its small and intimate take of quirkiness, introspection, a gentle doomsday message of despair and a measurement of an awkward man that wears his bugged-out wardrobe with a sense of curiosity and conviction. In essence, ‘Ant-Man’ is a costumed caper that is high-spirited in its low-key excitement…something quite refreshing and revered in the wild and wacky world of Marvel Comics’ representation of the super-studs and sasses that invade our cinematic sensibilities in the hazy days of summer.\r\n\r\n‘Ant-Man’ lead Paul Rudd, an affable actor that has shown various levels of competence in both comedies and dramas over the years, is the unlikely source to don an ant-oriented attire and let his charm and cheekiness take over as the tiny bugged-eyed avenger of right and might. Rudd plays Scott Lang, a former troubled lawbreaker and gifted engineer whose demons come back to haunt him when he gets involved in the burglary shenanigans with his bad news buddies (T.I. and Michael Pena). The reason for Lang’s lure back to crime: a cockeyed but convenient way to win over the affections of his estranged young daughter.\r\n\r\nInterestingly, another great analytical mind of mechanics and science in stand-offish Hank Pym (Oscar-winner Michael Douglas) is spotlighted as he too struggles to relate to his daughter as well in the pretty Hope Van Dyne (Evangeline Lilly). Anyhow, Pym has a colorful backstory as it is revealed that he used to save the world from harm as the underrated crime-fighter Ant-Man. There was no glory or special recognition for Pym’s heroics as the buggy super-hero but his devotion to his crime-stopping craft was realized nevertheless.\r\n\r\nAs ANT-MAN Paul Rudd's Scott Lang has plans to stop the criminnal foolishness besides raiding a giant-sized picnic basket in Peyton Reed's modest costume caper.\r\nAs ANT-MAN Paul Rudd’s Scott Lang has plans to stop the criminal foolishness besides raiding a giant-sized picnic basket in Peyton Reed’s modest costume caper.\r\nThe conflicted father-daughter tandem of Pym and Hope eventually recruit the beleaguered Lang to climb into the exo-skeletal red-and-black suit and become the current Ant-Man to continue the mission of promoting goodness over evil. In this specific case, Lang’s Ant-Man is asked to foil the nefarious agenda of Pym’s former protege and associate Darren Cross (Corey Stoll) who threatens to expose the revolutionary shrinking technology to anyone sinister that offers him an insane and immediate price for such secretive scientific information that could jeopardize mankind in the long run. Of course, it goes without saying, that Cross has an ominous alter-ego in the vile Yellowjacket whose back-and-forth clashing with Lang’s Ant-Man leads to the calculating and corrosive chess game of one skillful insidious insect trying to outwit and outmaneuver a conscientious one.\r\n\r\nSome may dismiss ‘Ant-Man’ as being too low-grade, cheesy and incidental in its confrontational canvas of saints versus sinners. Still, Reed’s handling of his Marvel-inspired ‘battle of the bugs’ is a winning formula in simplicity because it does not have to be rooted in a spectacular and showy landscape as the other successful bombastic blockbusters that come out of the frivolous factory of Hollywood. Essentially, ‘Ant-Man’ demonstrates the right kind of personality and prestige for its presentation as a scaled-down comic book actioner steeped in the personalized disillusionment of the characterizations and their assorted psyches. Sure, ‘Ant-Man’ will not let anyone forget its popular competitor in the much glorified and iconic standing of another insect-fighting Marvel mastermind in ‘Spider-Ma’n anytime soon. Yet Scott Lang’s Ant-Man is just as angst-ridden, impish, awkward and devoted as Peter Parker’s resilient web-headed wonder Spidey.   \r\n\r\nThe drama unfolds so convincingly in ‘Ant-Man’ not so much because of the dire dilemma of comicbook goodness and badness but because of the examination of deteriorating relations between broken men and their families or more specifically between fathers and daughters. Both Rudd and Douglas are committed to their roles as the Ant-Men that saved the world with ease past and present but could not say the same thing about rescuing the domestic responsibilities that eluded them under their own roofs. As Lang tries to find an opening for forgiveness toward his little girl and remarried ex-wife (Judy Greer), his current adviser Pym struggles to put the pieces together with a disgruntled Hope that blames her father for the neglect of her well-being as well as the death of her beloved late mother known as the Wasp, a super-heroine that shined in her own shadow of accomplishment.\r\n\r\n‘Ant-Man’ is a soulfully weird, witty sliced-down spectacle of a comicbook film that is rare in its skin to deliver the message of a connection not just to stamping out the cartoonish crime and chaos that is routinely found in the playful playground of Marvel’s movie machine of high-powered personalities armed with skillful brute and brilliance. It also has something called heart and hope as it tackles the alienation and isolation of fathers and their vulnerable daughters. It will take more than a gigantic can of Raid to destroy the indomitable presence of ‘Ant-Man’ and what his hedonistic heroics, both physical and psychological, bring to the prized picnic table.\r\n\r\nAnt-Man (2015)\r\n\r\nWalt Disney Studios\r\n\r\n1 hr. 57 mins.\r\n\r\nStarring: Paul Rudd, Michael Douglas, Evangeline Lilly, Crey Stall, Michael Pena, Tip “T.I.” Harris, Judy Greer, Bobby Cannavale, Wood Harris and Abby Ryder Fortson\r\n\r\nDirected by: Peyton Reed\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comic Book Fantasy, Super-heroes, Action and Adventure\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)", "created_at": "2015-10-16T04:23:45.380Z"}, {"movie_id": 102899, "review_id": "566befe49251412dbc0029c4", "author_rating": 7.5, "review_text": "The Pocket Rocket.\r\n\r\nGiven the production problems and its long gestation period, Ant-Man is arguably far better than it had right to be. Unsurprisingly with a Marvel Super Hero film, the critical reactions have been mixed, but given it's not as gargantuan as most Marvel pics it proves to have a big entertaining heart. A pic cunningly viewing the Marvel Universe from a different angle, whilst also not over egging the pudding.\r\n\r\nThe effects work is impressive, the origin story narrative engrossing and with it carrying a lightness of touch, and there's a very enjoyable cast enthusiastically buying into the comic book frivolity. Sure, some of it's just plain daft, our hero's powers are hardly blunderbuss stuff, while the family melodramas bubbling away feel tired, but come the glorious finale, pandering to the child in us all, it's another Marvel winner readying itself for further adventures of Ant-Man. 7.5/10", "created_at": "2015-12-12T09:59:00.747Z"}, {"movie_id": 102899, "review_id": "566ee3b4925141664f00f834", "author_rating": 8.0, "review_text": "> Size doesn't matter if he's a superhero who committed to save the world.\r\n\r\nMy confession is I never read 'Ant-man' comics and I never knew such kind of superhero even exist in Marvel till this movie was announced. (But I know Danish film 'Antboy'.) So I'm glad they brought cinematic version of 'Ant-man' and I'm sure he'll return to the next 'Avengers' as they promoted strongly in this film itself to know what would be the audience response. I don't know others, but I definitely welcome the idea.\r\n\r\nAnother CGI magic, another Marvel's wonder. As long as they pick the right cast and crew with a good story, the sci-fi like this continues to rule the cinema world. It was a great team work, that must be appreciated. As usual the top notch visuals as well the performances, even the sidekicks. But I was surprised to see when Paul Rudd was attached to this project. I believed it would be a comedy sci-fi packed with full of action, and I was wrong. It was a simple tale, a heist theme and of course it was fun to watch, but never was a comedy movie.\r\n\r\nA wonderful beginning, especially for the first film in the series. You know strong foundation is the key to raise a building above. I know the sequels would only get better by progressing and it should be. Because in all the Marvel's superhero flicks, this one was the most family and young kids friendly. That does not mean there were no violence, but from the title to the characters and presentation, all were so casual and can be understood by all.\r\n\r\nIt was so great to see a legend like Michael Douglas to be a part in the modern movie. Now I am eager to see Evangeline Lily as Wasp-girl in the follow-up. It would be like Peter Pan and Tinker Bell, but in a sci-fi version. The extras were very interesting, I enjoyed them as well. If you're are yet to see the film, don't expect anything like Disney's 'Honey' trilogy, after all, if you enjoy the Marvel Cinematic Universe (MCU) then you would do same for it which is the twelfth to follow.\r\n\r\n7.5/10", "created_at": "2015-12-14T15:43:48.920Z"}, {"movie_id": 102899, "review_id": "58c16f88c3a36825db00a955", "author_rating": 6.0, "review_text": "I like Paul Rudd and was hoping this would be as funny as 'The Guardians of the Galaxy' but it wasn't. It looked good and the direction was solid but I think it suffered from the constant screenplay rewrites that the film underwent by changing the screenwriters (Edgar Wright and Joe Cornish).\r\n\r\nI also felt it was a bit too long-winded and it was unbalanced. However, the main good feature in this film was the special effects.\r\n\r\n★★★", "created_at": "2017-03-09T15:06:48.830Z"}, {"movie_id": 102899, "review_id": "5a797cd1c3a368224e01f813", "author_rating": 8.0, "review_text": "I have to say that I did not have great hopes for this movie. However, I found it surprisingly enjoyable. As can be expected from a Marvel super hero movie it is not the most intelligent plot around but instead rather heavy on special effects.\r\n\r\nHaving said that the plot is not bad given the context. I have never read any of the Ant-Man comics so I had no idea what to expect. The little expectation I had was of some guy turning into some ant like creature smashing things left right and center. So it was somewhat of a surprise to me when I found out that the guy was actually shrinking himself to ant size. Actually I went a bit “what the f…” when I first realized this and felt that this was going to be boring.\r\n\r\nHowever, in the end, I felt it worked out quite well. If it would have just been about some guy shrinking himself then it would indeed have been somewhat boring but the added coolness of this guy being able to command armies of bad-ass ants really helped stave of the boredom.\r\n\r\nAs I wrote above it is a Marvel super hero movie so it is heavy on special effects and, personally, I felt they where quite okay. There is of course quite a bit of action in the movie as well as a bit of humour. I quite liked the parts where the Ant-Man and his nemesis slugged it out in a children’s room and a giant size Thomas the Tank Engine was thrown through the roof and into the garden. Maybe I liked it because Thomas the Tank Engine is a TV show that my kids liked to watch when they were smaller. There where of course a few of the usual Hollywood silly, brain-dead stunts like the tank scene. It could have been so cool but it was really ruined by the total lack of intelligence in the stunt following the cool revelation.\r\n\r\nI really liked Michael Douglas as Dr. Hank Pym as well as Evangeline Lilly as Hope Van Dyne. I was not too impressed by Paul Rudd but on the while I guess he was not too bad. It is a bit of a shame though that when Hollywood feels they need to throw in a bit of family drama they always have to throw in a divorce. It is rather depressing for us that have lived through such a tragedy after all.\r\n\r\nBottom line, this was a surprisingly enjoyable movie. Far better than quite a few of the super hero movies that Marvel/Hollywood have produced like for instance the abysmal Spiderman movies although that is of course a personal opinion.", "created_at": "2018-02-06T10:00:49.171Z"}, {"movie_id": 102899, "review_id": "5b167994925141783b016ef4", "author_rating": 6.0, "review_text": "Less spectacle than most MCU films have been serving up, particularly in phase two, but the story and characterisation is actually a little stronger than the past couple of tales Marvel has served up.\r\n\r\nVillain Darren Cross, AKA “Yellowjacket” (originally a hero in the comics) lacks the onscreen presence of top tier Marvel-evil Loki, but is certainly one of the stronger offerings the MCU has given us. His twisted relationship with his former mentor gives another level to this Marvel film not seen since _Winter Soldier_.\r\n\r\nNot so much a super hero film as a super heist film, _Ant-Man_ was a welcome refreshment to the comic book movie party, and though I always like to give myself some time to find exactly where MCU films fit in my overall experience, at the moment I would say _Ant-Man_ sits somewhere comfortably in the middle, maybe even a bit below, but is still well worth a watch, even for those who aren’t deeply involved with the film series as a whole.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-06-05T11:52:52.340Z"}, {"movie_id": 102899, "review_id": "5c22e491c3a3681c34ee395c", "author_rating": 8.0, "review_text": "***Ant-Man?***  \r\n\r\nReleased in 2015, \"Ant-Man\" stars Paul Rudd as Scott Lang, a cat burglar who is offered redemption and the opportunity to be a hero. Michael Douglas plays his mentor, Hank Pym, and Evangeline Lilly Pym's daughter; meanwhile Corey Stoll co-stars as the heavy.\r\n\r\nIn my vast arsenal of old comics I have only one issue where Ant-Man is the main star: Marvel Feature #10, which featured Hank Pym as the hero, not to mention his wife, the Wasp, AKA Janet van Dyne. The character's run in that comic ceased with that very issue. By the 80s Scott Lang, a good-intentioned thief, became Ant-Man after stealing Pym's Ant-Man suit to save his daughter. With the encouragement of Pym, Lang became Ant-Man full-time.\r\n\r\nThe movie is based on these events and I was surprised at how entertaining it is considering how relatively minor the hero is. The movie even makes a joke about this when Ant-Man comes face-to-face with the Falcon (Anthony Mackie). Speaking of which, it's great to see the Falcon in action. It's also great to see Yellowjacket who, in the comics, was Hank Pym after Lang took over as Ant-Man. In the movie Yellowjacket is the villain (Stoll), which is okay since Pym's Yellowjacket in the comics sort of became a villain when he had a mental breakdown and was eventually divorced by Janet, the Wasp. The filmmakers incidentally did an excellent job with the Yellowjacket suit.\r\n\r\n\"Ant-Man\" was a surprise hit at the box office and understandably so. It's a quality superhero flick done with style and brimming with confidence. It's nothing more than this, but that's all it needs to be. It's nice to see Michael Douglas who was, believe-it-or-not, 70 years-old during shooting. He shines in the movie as Pym and could easily pass for ten years younger. I also really liked the Quantum Realm sequence when Lang is reduced to microscopic size.\r\n\r\nThe film runs 117 minutes and was shot in Georgia and San Francisco, CA. ADDITIONAL CAST: Judy Greer, Bobby Cannavale and Michael Peña.\r\n\r\nGRADE: B+/A-", "created_at": "2018-12-26T02:16:49.233Z"}, {"movie_id": 102899, "review_id": "5c842634c3a3684e8cdacb22", "author_rating": 7.0, "review_text": "Ant-Man is a much needed breath of fresh air from all the city-breaking, galaxy saving epicness of the past five Marvel movies. It's a nice, light, fun heist movie with some pretty cool effects and a great cast of characters.\r\n\r\nMichael Pena, T.I. and David Dastmalchian make this movie so much more enjoyable. Not that Paul Rudd, Evangeline Lilly, Michael Douglas, and Corey Still aren't great, but those three as a sidekick trio crack me up.\r\n\r\nEdgar Wright's stamp is all over this movie and it's a shame his directorial touch is missing, because he would have known what to remove to make it even better.\r\n\r\nBut all in all, Ant-Man is great entertainment with a feel good story about a man trying to be the hero his kid thinks he is.", "created_at": "2019-03-09T20:46:44.404Z"}, {"movie_id": 102899, "review_id": "60074f49be4b36003dce761f", "author_rating": 8.0, "review_text": "Much better than anticipated, I actually thoroughly enjoyed <em>'Ant-Man'</em>. The concept is silly, but I felt it made it work very well.\r\n\r\nIt starts off as more Paul Rudd-esque than Marvel-esque, especially with the comedy. I wasn't expecting much from it at that point, not that it was necessarily bad or anything but it wasn't what I'd expect from an MCU film. However, positively, it turns into something that fits in this universe.\r\n\r\nI enjoyed the action, score and humour. The cast do good things, with Paul Rudd filling the titular role nicely. I also really enjoyed Michael Douglas. Evangeline Lilly and Michael Peña are pluses, too. Corey Stoll, meanwhile, is a little meh I will say - entirely passable, but nothing memorable.\r\n\r\nThis is a pleasant watch, one I'd recommend.", "created_at": "2021-01-19T21:29:45.018Z"}, {"movie_id": 102899, "review_id": "643e2d6ff288380314aa8b9d", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-18T05:41:03.238Z"}, {"movie_id": 102899, "review_id": "64430e63b3f6f502fc9e2386", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:29:55.349Z"}, {"movie_id": 102899, "review_id": "64430e7105822404bf324396", "author_rating": 7.0, "review_text": "This movie is like a mix of honey I shrunk the kids' with some action in it, and it's made by Marvel. Plus it's really funny.", "created_at": "2023-04-21T22:30:10.010Z"}]