[{"movie_id": 122857, "review_id": "5115fff0760ee3294638e2a9", "author_rating": 5.0, "review_text": "This movie was not really what I expected or at least not what I hoped it would be. Sure it is a decent enough action flick if you watch it as a stand-alone movie but it is also really different from the other Universal Soldier movies and I cannot say that I really liked the different track this movie took.\r\n\r\nThe good part is that there is no lack of action and it is indeed both brutal and quite gory action. Those parts of the movie are quite good and are what keeps me from giving the movie a real trash rating. However, the pace of the movie also drops into really slow scenes quite frequently. This could have been effective if there would have been some form of coherent plot to follow but there really isn’t. A lot of things just happen and the lead character goes to various places, does things, without any obvious reason or explanation.\r\n\r\nSpeaking of the plot, on some movie sites you can read a synopsis like this one:\r\n\r\n\"In a world without government, the surviving Unisols maintain order and choose the strongest of their ranks to rule, testing them in life-or-death combat.\"\r\n\r\nUnfortunately this synopsis has also ended up on the French Amazon site where I bought the Blu-ray and it is total bullshit. It is not a world without government or any other doomsday world like what the French cover tries to imply. There is also not really any “testing” going on but more a spontaneous brawl ending up in a “unfortunate casualty'” among the rather emotionless uni-sols. This blatantly false advertising really annoys me.\r\n\r\nAnother thing that did not sit very well with me is that both Dolph Lundgren and Jean-Claude Van Damme is not really main characters but rather obscure ones that kind of hide in the shadows until a show-down fight at the end. Not only that but Jean-Claude is more or less portrayed as a bad-guy throughout the movie. Not only as a bad-guy from the governments point of view but also from the viewers. It is kind of shown at the end that he is not but still…the entire movie is very dark and without hope.\r\n\r\nAs I said, the action scenes are really the only thing that saved this movie from a real trash rating. If you have not seen any of the other Universal Soldier movies previously you might give this one a higher rating though.", "created_at": "2013-02-09T07:51:12.072Z"}, {"movie_id": 122857, "review_id": "632b14e6a3b5e6007ddfdf05", "author_rating": 9.0, "review_text": "Masterpiece", "created_at": "2022-09-21T13:43:02.973Z"}, {"movie_id": 122857, "review_id": "636cf9d421621b009ba153bf", "author_rating": 6.0, "review_text": "The handsome, but wooden as a board, Scott Adkins (\"John\") wakes from a coma after his wife and daughter are brutally murdered before his eyes in his kitchen! For some reason he was left alive, and he determines on vengeance against \"Devereaux\" (Jean-Claude Van Damme). He, meantime, is teaming up with \"Scott\" (Dolph Lundgren) and the pair are working to establish a new world order run by him and his fellow \"UniSols\" with only the strongest destined to survive and take on the government. \"John\" meantime is closing in on his protagonist, but as he does he begins to doubt what he believes. Is he being manipulated too? This moves along well with plenty of action and combat scenes but the characterisations are well past their use-by-dates now. Neither Lundgren nor Van Damme are anywhere near their best, the dialogue is clunky at best and Adkins, well his looks were all anyone could ever say he had enough of to merit on-screen time. The ending is predictable, though colourful, and as I finished this fourth outing I prayed that we won't have another. Repetitive and tired, sorry.", "created_at": "2022-11-10T13:17:08.647Z"}]