[{"movie_id": 38317, "review_id": "5b27ec659251410d5401c06a", "author_rating": 8.0, "review_text": "Fun, heartwarming dramedy with Kevin James, Rosario Dawson and… talking animals\r\n\r\nRELEASED IN 2011 and directed by Frank Coraci, \"Zookeeper\" is a dramedy/fantasy/romance starring Kevin James as a (you guessed it) zookeeper in Boston who enlists the aid of the zoo’s animals in his attempt to win the affections of model Stephanie (Leslie Bibb) or, maybe, fellow zoo-worker Kate (Rosario Dawson).\r\n\r\nThis amusing and heartwarming movie succeeds where “Doctor Dolittle” (1998) barely gets by. It’s also more relevant to adults in light of the romantic shenanigans, albeit still family friendly. Everything hinges on whether or not the movie can pull off the animals as (talking) characters while keeping you invested in the drama. And it does, incredibly. I actually found myself caring about one of the animals in particular. As always, James makes for a likable every-guy protagonist. And Dawson is winsome.    \r\n\r\nTHE FILM RUNS 1 hour, 42 minutes and was shot in Franklin Park Zoo & Boston, Massachusetts, as well as Central Park, Manhattan (for the bike race). WRITERS: Jay Scherick, David Ronn, Kevin James, etc.\r\n\r\nGRADE: B+/A-", "created_at": "2018-06-18T17:31:17.914Z"}, {"movie_id": 38317, "review_id": "5f78b2bf1d01910036996e01", "author_rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nKevin James and Rosario Dawson give a good carry, though they have an excellent range of supporting characters and then Adam Sandler as the voice of most of the animals.\r\n\r\nWhile I would prefer him to lose his mind about the animals talking to him, we instead get a \"Do Little\" approach where Leslie Bibb and Rosario Dawson fight over a middle aged fat guy without big money.\r\n\r\nWith a certain suspension of disbelief in place, you can really turn your brain off and enjoy this, and the zoo setting add some fun, if ridiculous situations.", "created_at": "2020-10-03T17:19:59.224Z"}]