[{"movie_id": 837881, "review_id": "63553ff643cd54007f7759e5", "author_rating": 6.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"She Said proves that even a formulaic, overlong movie can still be incredibly compelling and emotionally impactful.\r\n\r\nThe haunting true story of Harvey Weinstein's accounts of sexual abuse is approached with heartfelt care, dedication, and respect for the victims. Everything is elevated by absolutely brilliant performances from the cast, most notably Zoe Kazan. Even without significant innovations, Maria Schrader keeps the narrative interesting with the help of Nicholas Britell's score.\r\n\r\nIt deserves to be seen by everyone.\"\r\n\r\nRating: B-", "created_at": "2022-10-23T13:21:58.373Z"}, {"movie_id": 837881, "review_id": "6381caa9fb834600876f61e7", "author_rating": 6.0, "review_text": "Try as I did, I just couldn't really engage with this rather long, procedural and sterile depiction of two journalist's traumatic and courageous efforts that finally ended Harvey Weinstein's unfettered abuse of many of the women who worked for and with him over the lengthy span of his Hollywood dominance. Carey Mulligan and Zoe Kazan are competent, but no more, as these lead reporters facing the seemingly impossible task of navigating a toxic environment of fear, shame and non-disclosure agreements in the hope that one of his victims will go on the record. When you know what ultimately happens with a true-life scenario, it makes the telling of the story that much harder because there is no sense of jeopardy. The thing with this for me, though, was that the writing and characterisations were all just too flat. It also frequently blurs the distinctions between fact (or \"information\" as it is often referred to here) with unsubstantiated gossip. Now, clearly the aim of these two ladies was to substantiate those rumours, but the film doesn't really get to grips properly with that. One witness has been untraceable for many years (yet she is readily found by them living with her mother!); the others have remained tight lipped due to the NDAs but suddenly start to spill the beans. Why? What made them decide to finally bring this brute to book? The cold-calling nature of their approaches often appears cruel and ill-considered of the consequences (especially the scene with Andrew Cheung (Edward Astor Chin) obliviously mowing his lawn). None of the detail or personalities are really gone into here - the whole style is superficial and the lack of dramatisation of any of the incidents, or - indeed - of Weinstein himself, leaves us with a slightly disjointed, hollow, movie. It looks at the abhorrences of intimidation and oppression in the workplace then makes generic inferences that - and this applies to men, gay people, people of colour and not just women - rather underwhelmed me at the end. As a chronology of an investigative report it is fine. As a drama about real people facing real horrors it just lacks for depth and character.", "created_at": "2022-11-26T08:13:29.810Z"}, {"movie_id": 837881, "review_id": "63b33f73a9117f055d568fa4", "author_rating": 9.0, "review_text": "I tend to like movies with less action and more introspection and more “talkative.” Still, since I had read the book on this and saw other reports, I wondered if this might all seem like old news when I watched it. But I found out to be enthralling. I engaged with the lead characters and appreciated the excellent work of the secondary characters. For example, a quiet but strong portrayal of the partner of one of the reporters who seemed to be a reporter in his own right but who was supportive of her efforts.\r\n\r\nI felt they didn’t go for the melodramatic approach here as they well might have. They merely hinted about moments like one of them wondering if a car occupant was watching her, and used just one threatening phone call when they probably actually had many of them. It kept the story cleaner and moving forward.\r\n\r\nShe Said reminded me of All the Presidents Men, with the two investigative reporters being held to a standard of having sufficient sources to back up their reporting but where Woodward and Bernstein seemed mostly concerned with holding people accountable for their illegal actions, the journalists in she Said connected and formed a personal bond with the victims they located and encouraged to speak out.", "created_at": "2023-01-02T20:32:51.115Z"}, {"movie_id": 837881, "review_id": "6444cfdca06efe0552a54084", "author_rating": 4.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\nImportant subject matter doesn’t always translate to a good movie, and “She Said” is a botched attempt at retelling the true story of two New York Times reporters who took down the infamous Hollywood abuser, Harvey Weinstein. It’s something with which the industry is very familiar, and the years of sexual misconduct that the two women uncovered is horrifying. It was one of the most important articles to ever run in the newspaper, but this story would be better suited to the page and not the screen.\r\n\r\nThe film follows writers Megan Twohey (Carey Mulligan) and Jodi Kantor (Zoe Kazan) as they investigate the Miramax movie mogul, trying repeatedly to get big name actresses to go on the record to expose Weinstein’s gross abuse of power. Instead of offering new insight, director Maria Schrader uses the same old newsroom clichés to create a pedestrian investigative journalism film. It’s procedural, boring, and repetitive, with a series of scenes featuring the two leads making phone calls, writing or reading text messages, and sitting in editorial meetings. Of course, this is less than interesting because the story isn’t cinematic: it’s dull.\r\n\r\nThe film touches on the more interesting aspects of working as a woman in Hollywood, as many of Weinstein’s victims refused to be named on the record because they were terrified they’d never work again. This did happen more often than not, and he either bought or forced their silence. Perhaps if screenwriter Rebecca Lenkiewicz had decided to focus more on the personal dilemmas and fallout his victims faced rather than only briefly touch on them, this would have been a stronger and more powerful movie.\r\n\r\nEven worse, the film doesn’t feel timely. The decision to tell this story now seems dated and past its expiration date. Women will always remember the #MeToo movement and it will go down in history as one of the most important feminist campaigns of the 2000s, but many of us would rather forget about Weinstein while he rots away in jail.\r\n\r\nHere’s where my biggest problem with the film comes in: the story leaves a really bad taste in my mouth, especially when you stop to realize that many of Weinstein’s employees, friends, and peers either aided in covering up his crimes or even worse, willfully looked the other way. Harvey’s touchy nature and treatment of subordinates was the worst kept secret in Hollywood circles. He was as creep, and many who met him were uncomfortable being in his presence. It feels a bit disingenuous (or perhaps just a bit ironic) to make a movie about it, even if the story’s focus is on the two reporters.\r\n\r\nThe better parts of the narrative inspire with the proof of the power of journalism to encourage change, and Kantor and Twohey absolutely played a huge part in giving women who were victimized the courage to come forward. Mulligan gives a strong performance, but it’s a shame she didn’t have an equally robust script to work with. Both of the leads feel wasted, especially when they are called on to do little more than rattle off facts and name-drop big actresses who came forward to expose the year of abusive behavior by Weinstein. None of this is a substitute for compelling drama, and “She Said” fades into the void of forgettable procedural journalism films.", "created_at": "2023-04-23T06:27:40.469Z"}]