[{"movie_id": 57201, "review_id": "53695c200e0a2647db008782", "author_rating": 9.0, "review_text": "Wrong Brother.\r\n\r\nThe early signs were not good, tales of production problems galore and\r\nearly critical notices wading in to kick the film before it had even\r\nhad a run at the theatres. The Lone Ranger seemed destined to be a\r\nblockbuster stinker. Yet in spite of it noticeably alienating original\r\nLone Ranger purists, and some Western lovers as well, for a rollicking\r\naction fun packed time then Gore Verbinski's movie delivers in spades. \r\n\r\nIt's awash with the serial silliness of adventure films and TV shows of\r\nyore, pitching good guys against bad guys with buddy buddy shenanigans\r\npulsing away at the core. The stunts are outrageously enjoyable, the\r\nlandscape photography as beautiful as it is respectful in homage to\r\npast masters of the Western genre, while in Depp's Tonto there's a bona\r\nfide hero to root for just as much as he makes you laugh out loud. \r\n\r\nThis is an origin story, a tale of how John Reid (Armie Hammer) became\r\nThe Lone Ranger, and of course how the noble steed Silver and Indian\r\nside-kick Tonto became integral to his villain fighting ways. Tom\r\nWilkinson and William Fitchner file in for polar opposite villain\r\nduties, the former is the weasel business man trying to mould the West\r\nin is own image, the latter a repugnant psychopath with a penchant for\r\neating human hearts! Then Helena Bonham Carter wanders in from some\r\nGrindhouse movie for a couple of cameos that are resplendent with\r\nsexual energy. \r\n\r\nIt's all very wacky and wild, and rightly so, but this is not at the\r\nexpense of very good story telling. Some parts of the narrative could\r\nhave been trimmed, but as the bromance builds between our two heroes,\r\nand Silver gets up to all sorts of comedy horse escapades, there's nary\r\na dull moment here. Producer Jerry Bruckheimer and director Verbinski\r\nthrow all the action staples into the pot. Chases, fights, swinging\r\nfrom ropes, shoot-outs, people dangling from speeding train (pic is\r\nbookended by awesome train sequences), grisly deaths and on it goes\r\nfrom start to end. \r\n\r\nThere's caustic asides to the machinations of organisations of the\r\ntime, from railroad magnates to the cavalry, while the catchphrases and\r\nlegends of The Lone Ranger TV series are deftly inserted into the tale.\r\nIt was interesting to see Depp come out and defend the movie against\r\nthose damning early critic reviews, it's not something he does, being\r\nas he is very much a guy who sees acting as just a job. Bruckheimer,\r\nHammer and Verbinski backed Depp up, stating that some reviews were\r\nwritten before the film had even been released, the big budget and\r\nproduction problems clearly making this a big stinker… \r\n\r\nNot so, it's certainly not flawless, and those seriously into\r\nanachronisms are likely to have kittens. But if you haven't seen it\r\nyet, if you was put off by the venomous early reviews, then give it a\r\nchance, you may just be surprised at just how entertaining it is. It\r\nalso looks and sounds brilliant on Blu-ray, where repeat viewings even\r\nshow Hammer to be better than first thought as that masked man. 8.5/10", "created_at": "2014-05-06T22:03:12.880Z"}, {"movie_id": 57201, "review_id": "5acf7b169251410c4803e43b", "author_rating": 4.0, "review_text": "If this film would not have been called Lone Ranger and would not have pretended to tell the story the Lone Ranger then I would probably have considered it to be an okay movie. Maybe even a good one. However, this was supposed to be a Lone Ranger movie and that it is not!\n\nI put this movie in the same category as the very disappointing Green Hornet movie. It is a typical case of some dumbass Hollywood producer/director taking a known name and thinks he can do what the heck he wants with it. The Lone Ranger is supposed to be the only survivor of a group of rangers, a hero as well as intelligent and so is Tonto. In this movie the Lone Ranger is a bloody lawyer, he is naïve and generally a screw up. Tonto is, well, as looney as one could expect with Jonny Depp in the role.\n\nIt is really said when you feel the best characters in the movie are the bad guys. I think Butch Cavendish is quite nicely portrayed by William Fichtner. Okay, the movie have its fun moments, a few laughs, some nice special effects and is not really poorly done as such. Unfortunately a lot of the time I phrases like “what and idiot”, “what the f…”, “this is not Lone Ranger” and so on, went through my head while watching it.\n\nIf this is the first time you have heard about the Lone Ranger, or you do not really care if the movie has anything to do with the original Lone Ranger then you probably will find this an entertaining movie. I am afraid that I was hugely disappointed.", "created_at": "2018-04-12T15:28:22.377Z"}, {"movie_id": 57201, "review_id": "5ec3c07b8e2e0000211fef01", "author_rating": 5.0, "review_text": "(I wrote a very long and comprehensive review about this but I lost it in a browser crash so we'll have to make do with just one paragraph).\r\n\r\nWatching _The Lone Ranger_, every now and then, I could genuinely see the spark of a good movie trying its darndest to shine through. With a lot of changes, (foremost amongst them, a change of cast in the two leads) this might have been something special, I really can see how it could have been. But that wasn't the movie we got. We got this, and it is very disappointing.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-05-19T11:18:19.726Z"}, {"movie_id": 57201, "review_id": "5facbbf3e48860003f25bf73", "author_rating": 8.0, "review_text": "It loses its way a bit at around the midway point, but all in all <em>'The Lone Ranger'</em> is a film I found entertainment in.\r\n\r\nNo doubt helped by much of the people behind 2003's <em>'Pirates of the Caribbean: The Curse of the Black Pearl'</em> - my favourite film - reuniting for this. From Johnny Depp to Gore Verbinski to Jerry Bruckheimer to Ted Elliott & Terry Rossio. Therefore, I was bound to like it.\r\n\r\nDepp is enjoyable, as is usually the case. There are, of course, question marks as to whether he's 'right' for the role. He claims he has Native American heritage, though you enter a real grey area with all that stuff. Anyway, judging by his acting, he's fun. Armie Hammer is much better than I thought he'd be, while William Fichtner makes for a good villain. Nice to see Ruth Wilson and Helena Bonham Carter involved, also.\r\n\r\nI like the way the story is told, involving Depp and Mason Cook. It certainly adds a sense of intrigue to events. The end scenes are also enjoyable, at least visually - I don't love the score all that much, to be honest. However, as noted at the top, the middle part of the film is less entertaining - though the finale helps pick things back up.\r\n\r\nI've, evidently, seen better from these lot. Still, it's a very good film in my books; despite having issues.", "created_at": "2020-11-12T04:37:07.075Z"}, {"movie_id": 57201, "review_id": "62a06f9b1130bd3444bc1764", "author_rating": 6.0, "review_text": "Relegated to a fun-fair exhibit, \"Tonto\" (Johnny Depp) regales a young visitor with tales of his adventures with the eponymous, somewhat green and naive, lawyer \"John Reid\" (Armie Hammer). It all started when \"Tonto\" rescues \"Reid\" after he was ambushed by the nasty \"Butch Cavendish\" (William Fichtner). Together with his famed white horse they now set out to right this wrong and bring this evil man to justice. What now ensues just isn't very good. It's a sort of loosely hung together series of escapades with the easy enough on the eye Hammer just far too lightweight to bring even a modicum of charisma to the role. Depp is just recreating his \"Jack Sparrow\" characterisation - just with a white pained face; and the adventure elements are predictable and frankly rather dull. It has an almost slapstick nature to it; the dialogue tries to be pithy but in the end depends too much on the style of delivery from Depp - and I found that style repetitive and unimaginative. It culminates quite entertainingly, to be fair, but this film is just way too dependant on one single character and it just didn't work well for me. At just shy of 2½ hours, it is far too long too. Maybe 45 minutes less with more emphasis on the action and a better screenplay might have helped, but as it is - this is a long, empty, watch that borders on the spoof. Fans of Depp may well disagree, but for the rest of us this is merely a vehicle for him - and not a very good one at that.", "created_at": "2022-06-08T09:44:59.184Z"}, {"movie_id": 57201, "review_id": "642a14158de0ae00978d9d29", "author_rating": 7.0, "review_text": "This should survive the test of time.\r\nThe Lone Ranger and Tonto set out to do good. \r\nWe get a look at the origins of the Lone Ranger. And most of it is told by Tonto (Johnny Depp in a role that is actually well done).\r\nI'm not fond of the many flashbacks, but that's just me. Other than that, the flashbacks are well pieced together into a story, and the story is well molded together. I prefer just an up front telling of the story. That would have given this a higher rating from me, but that's just me.\r\nAs of now, this movie gets a lot of hate, and there's no understanding for the reason, other than simple contrariness. It isn't \"formula\" enough for most critics.\r\nStill, this film has a lot going for it. The Lone Ranger goes through a lot of turmoil, and he is quite likable in a rogue sort of way.\r\nThis film is probably more than half comedy. It has more comedy than \"Raiders of the Lost Ark\" for example, though not as much as \"Romancing the Stone\", although it comes closer to \"Romancing the Stone\" in comedy.\r\nA lot of this film goes into the supernatural, which is good for the legend of the Lone Ranger.\r\nThe \"theatrics\" aren't bought by today's spoiled brats very much, but it looks like a film that will survive the test of time if Western culture stops taking backsteps out of civilization and moves forward. It's just not negative enough for the Beavis and Butthead crowd of today's culture.", "created_at": "2023-04-02T23:47:33.806Z"}, {"movie_id": 57201, "review_id": "643edb941b1f3c05ce464970", "author_rating": 7.0, "review_text": "**_The two protagonists win the day in this amusing, dramatic and thrilling Western_**\r\n\r\nThe so-called 'lone ranger,' John Reid (Armie Hammer), and his Comanche companion, Tonto (Johnny Depp), seek to bring the notorious Butch Cavendish to justice (William Fichtner). Ruth Wilson and Helena Bonham Carter are on hand in periphery roles.\r\n\r\n\"The Lone Ranger\" (2013) surprisingly finds an agreeable balance between comedy, drama and wild action. What especially makes it work are the two leads: Depp is magnetic and interesting as Tonto while Hammer is likable as the Lone Ranger.\r\n\r\nThe format of the elderly Tonto chronicling events from decades earlier is reminiscent of \"Little Big Man\" (1970), not to mention the mixed tone. There are also nods to other notable Westerns, like the music straight from \"Once Upon a Time in the West\" (1968). One of the best bits is when the Lone Ranger exuberantly exclaims, \"Hi ho Silver, away!\" to which Tonto responds in a flat voice, \"Don't ever do that again.\" Speaking of Tonto, his iconic 'look' (with a stuffed crow on his head) was based on a painting by Kirby Sattler called \"I Am Crow\" (Google it).\r\n\r\nIf you like movies like \"The Mask of Zorro\" (1998), the underrated \"The Musketeer\" (2001), the Indiana Jones flicks and the aforementioned \"Little Big Man\" you'll probably appreciate \"The Lone Ranger.\" It's superior to any of the \"Pirates of the Caribbean\" flicks IMHO and I find Tonto a more interesting character than Jack Sparrow.\r\n\r\nThe film runs 2 hours, 30 minutes, and was shot in Utah, New Mexico, Arizona, Colorado, California and Texas.\r\n\r\nGRADE: B", "created_at": "2023-04-18T18:04:04.554Z"}]