[{"movie_id": 693113, "review_id": "60ff33317ad08c00748558b9", "author_rating": 4.0, "review_text": "Generally I love crime-thrillers (both fiction and non-fiction) and this had some good elements, but the editing was shoddy, performances uneven with Bruce Willis once again phoning it in. He has maybe 10-minutes of a screentime and is a non-factor with the plot outside of being Megan Fox's partner who disappears only to briefly show up at the end.\r\n\r\nAs for Fox she at least was okay, though not entirely believable as an FBI agent and Emile Hirsch and his southern accent sounded off, not entirely sure why he had it, didn't really play into his character nor the region. Lukas Haas as the serial killer has his moments though his performance and the character isn't anything different than what had been done on Criminal Minds.\r\n\r\nWanted to really like this but never quite works. Has an ending that should've been filled with suspense but instead was awkwardly edited and just was lackluster. **2.25/5**", "created_at": "2021-07-26T22:12:01.866Z"}, {"movie_id": 693113, "review_id": "61009e3a43999b0073d5444c", "author_rating": 1.0, "review_text": "I know by now that Bruce on the cover probably means a whole lot of driveling banter piss caught on tape in feature length. But the premise and Emile Hirsch co-starring caught my interest. Turns out Emile is the lead really, Megan Fox the damsel in distress and the guy responsible for the editing is the real villain. The dialogue was boring, the story done better many times already, so the director could have learned something beforehand easily when taking this on. Unfortunately for the crime flick fan this is sub-par. And for everybody else it's just cringe-worthy bad.", "created_at": "2021-07-28T00:00:58.838Z"}, {"movie_id": 693113, "review_id": "624a1ed308cf87006312da90", "author_rating": 7.0, "review_text": "_**A serial killer stalks the Interstate in northern Florida**_\r\n\r\nThe bodies of seven young women are found along I-10 in the Panhandle of Florida, mostly prostitutes that service truckers at rest stops. A determined State officer (Emile Hirsch) and an equally resolute FBI agent (Megan Fox) team-up to find the murderer. Lukas Haas is also on hand while Bruce Willis has a small role.\r\n\r\n\"Midnight in the Switchgrass\" (2021) is a crime drama/thriller that cost $15 million and was inspired by serial killer Robert Ben Rhoades, aka The Truck Stop Killer. It combines the typical film noir-ish detective story of “Kiss the Girls” (1997) with elements of “The Onion Field” (1979), “Breakdown” (1997) and “Butchers” (2020).\r\n\r\nBoth Emile Hirsch and Lukas Haas stand out on the acting front with convincing performances. A few of the peripherals are notable as well (e.g. the little daughter, her mother, the captured teen girl and the neighbor).\r\n\r\nWillis was hired for name-recognition and did all his scenes in one day, which is obvious. But, since his part is so small, it's not a major drawback. As for Megan Fox, no producer hires her because she's Meryl Streep, but rather because she's stunning. That said, I think she did a fine job, except for a couple scenes with Bruce (where they were obviously pressed for time).\r\n\r\nSpeaking of Fox, I haven’t seen her in a movie for ten years. She turned 34 during shooting and is more alluring than ever. Meanwhile winsome Caitlin Carmichael was almost 16 during shooting and is surprisingly remarkable as the captive teen. Sistine Rose Stallone (Sylvester’s daughter) is also worth noting on the feminine front.\r\n\r\nThe last act does create some quality suspense. While it's understandably a grey flick that focuses on the ugly side of life, there are rays of reverence, wisdom and hope. \r\n\r\nMusician Machine Gun Kelly appears in a few sequences with Megan. He must’ve worked his charisma on her because, although she was married for a decade to Brian Austin Green at the time, the two would start dating and are currently engaged.   \r\n\r\nThe film runs 1 hour, 39 minutes, and was shot in Pensacola, Puerto Rico and Cincinnati (filming was interrupted at midpoint due to the plandemic and so alternative plans had to be made for completion). \r\n\r\nGRADE: B-/B", "created_at": "2022-04-03T22:25:23.699Z"}]