[{"movie_id": 6171, "review_id": "5a4c7a540e0a2646db0065a9", "author_rating": 6.0, "review_text": "Doesn't quite deserve all the hate...\r\n\r\nA group of friends with a long history are pitted against an invading alien force, and they use their special gifts and talents to try and save the world.\r\n\r\nSure it is not the best Stephen King adaptation, but it is far from the worst.  Some fairly hammy acting, dodgy CGI and tonnes of cliché Stephen King tropes don't stop this film from being lightweight fun, so long as you are not expecting a work of art.  \r\n\r\nDamien Lewis is a stand-out, especially when he is being the Mr Gray personality and most of the rest of the cast do well enough, with a little bit of coasting from Tom Sizemore and Morgan Freeman.  It is however hard to look past the patronising and mildly offensive portrayal of the idiot savant Duddits, and the ending is completely stupid.  But if you have a spare couple of hours there are worse ways to spend time.  \r\n\r\nB grade film with an A grade cast and a budget somewhere in between.", "created_at": "2018-01-03T06:38:12.652Z"}, {"movie_id": 6171, "review_id": "62dfaba833a533051fba20ae", "author_rating": 1.0, "review_text": "This is all I have to say... Butthole-cock-monsters.", "created_at": "2022-07-26T08:54:00.405Z"}, {"movie_id": 6171, "review_id": "63c21a5a23be4600980978a8", "author_rating": 10.0, "review_text": "Compared to the book, yeah, it stinks...but that's really only because it got lost somewhere in translation from prose to screen.\r\n\r\nTake it as it is, take it as a movie and its not half bad, the problem is that, once you leave the book behind what you have is an old fashioned B horror movie that is trying to sell itself in an era where B horror movies need the special effects of modern super hero movies and the basic plot of a Dick and Jane novel.\r\n\r\nAnd then, in many ways, it's just too expensive. It feels like a classic Drive-In horror flick, but it looks like a block buster. Tone down the budget by a few million and make it a direct to video movie and it would have cult classic status already...despite the people that actually read the source material.\r\n\r\nThe acting is good, the special effects are too good, the setting is cool, but the plot hurts a bit and the fact that Duddits is Intellectually Disabled is inevitably going to put off more that a few viewers.\r\n\r\nReally though, what you have is a great B Movie Drive-In fair that somehow got an actual budget wot work with. And you could do a lot worse in this Post New Hollywood day and age.", "created_at": "2023-01-14T02:58:34.325Z"}]