[{"movie_id": 6466, "review_id": "5b10f5170e0a26307c010279", "author_rating": 7.0, "review_text": "I don't think I can go so far as to call _Freddy vs. Jason_ good. But I can still be honest about the fact that I love it. Considering it mad-grabs the humour from both its delivering franchises late-stage entries, with the bizarre, ethereal yet quippy flavour of _Elm Street_, and the body count of a _Friday the 13th_, how could I not?\r\n\r\nCrappy acting, unbelievable SFX, hack script, completely disrespectful to the canon of both parents, yet eminently re-watchable for any occasion.  \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-06-01T07:26:15.655Z"}, {"movie_id": 6466, "review_id": "5b10f518c3a3686230016f84", "author_rating": 7.0, "review_text": "I don't think I can go so far as to call _Freddy vs. Jason_ good. But I can still be honest about the fact that I love it. Considering it mad-grabs the humour from both its delivering franchises late-stage entries, with the bizarre, ethereal yet quippy flavour of _Elm Street_, and the body count of a _Friday the 13th_, how could I not?\r\n\r\nCrappy acting, unbelievable SFX, hack script, completely disrespectful to the canon of both parents, yet eminently re-watchable for any occasion.  \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-06-01T07:26:16.435Z"}, {"movie_id": 6466, "review_id": "5d3349f7caab6d779398b05c", "author_rating": 7.0, "review_text": "***Worthy new millennium entry in the Friday & Nightmare franchises, until they clash, that is***\r\n\r\nTo be expected, 2003's \"Freddy vs. Jason\" mixes together elements of the \"Nightmare\" and \"Friday\" franchises. Both franchises had essentially ran out of gas in the early 90s -- the last conventional \"Friday\" movie, before 2001's \"Jason X,\" came out a decade earlier and the last \"Nightmare\" movie almost as long. So mixing up the formats was a great way to introduce these modern monsters to a new generation as well as re-introduce them to the old.\r\n\r\nTHE PLOT: Freddy Krueger, the wicked spirit of a child molester/serial killer, is trapped in hell and unable to wreak havoc on the youths of Springwood, Ohio, because they have forgotten him and therefore no longer believe. Krueger's diabolical plan is to lure Jason from Crystal Lake, NJ, to Springwood and inspire him to go on a killing spree, which would naturally be blamed on Kruger, thus giving him the power to return.\r\n\r\nSome say \"Freddy vs. Jason\" is more of a \"Nightmare\" film than a \"Friday\" film, and I can see why, but it's really an equal parts crossover. Once Jason is led to Springwood it essentially becomes a \"Nightmare\" movie with Jason as the antagonist until Freddy gains enough power; by that time the story switches to Crystal Lake for the finale and even provides an insightful flashback (via a dream sequence) of Jason's youth and abuse.\r\n\r\nOne of the highlights takes place early in the second act: Jason's flaming attack at a teen party in a cornfield; it's a dynamic sequence and features great opticals.\r\n\r\nAs with all the Friday films, \"FvJ\" features a nice assortment of women, beginning with the cameo of Heather (Odessa Munroe) in the opening reel. She's pretty much on par with the cameo of Agent Marcus (Julie Michaels) at the beginning of \"Jason Goes to Hell.\" From there we have cutie Katharine Isabelle as a secondary protagonist and Monica Keena as the heroine. It took me about half the movie to warm up to Monica but she ultimately won me over.\r\n\r\n\"Freddy vs. Jason\" is a noticeably more technically sophisticated than the first nine \"Friday\" movies. Don't get me wrong, it's very cartoony and hardly scary (except for jump scares and gore), but it LOOKS so much better and has more oomph. The story’s also way more involved than the first eight entries and “Jason X,” which makes the film play better on repeat viewings.\r\n\r\nThe fight between the two monsters in the closing act is a cinematic tradition going back earlier than 1945's \"The Wolf Man vs. Dracula\" (aka \"House of Dracula\"), but it's the weak point of the movie for me because it's just too cartoony. The film works as horror with either Jason or Freddy attacking the youths, but when they finally clash in the action-packed climax it's just too comic booky.\r\n\r\nThe film runs 97 minutes and was shot mostly in British Columbia, Canada (e.g. Buntzen Lake, Anmore), but also Toronto.\r\n\r\nGRADE: B", "created_at": "2019-07-20T17:05:59.203Z"}, {"movie_id": 6466, "review_id": "643dee9fc3aa3f050de6daf7", "author_rating": 10.0, "review_text": "I was so excited to hear this movie coming out. It didn't disappoint. My two greatest horror killers of all time battling each other. Love this movie.", "created_at": "2023-04-18T01:13:03.928Z"}, {"movie_id": 6466, "review_id": "643def8f6af9dd030780935f", "author_rating": 10.0, "review_text": "I was so excited to hear this movie coming out. It didn't disappoint. My two greatest horror killers of all time battling each other. Love this movie.", "created_at": "2023-04-18T01:17:03.354Z"}]