[{"movie_id": 637649, "review_id": "6094662e9f0e19007a5c4ce1", "author_rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSome people really don't appreciate Guy Ritchie's style. His trademark fast-forward, HFR (high frame rate) type of action doesn't appeal to many viewers, and his nonlinear narrative structure is often more confusing than captivating. At least, these are the common complaints across his filmography. While I acknowledge that these attributes don't always work, I'm actually quite a fan of his filmmaking techniques. From his more recent work on Aladdin and The Gentlemen to his take on classic characters such as Sherlock Holmes and King Arthur: Legend of the Sword, I genuinely enjoy Ritchie's risky, divisive approach on the best way to tell a story.\r\n\r\nGoing in completely blind to Wrath of Man, I honestly didn't have a good feeling. I expected a generic, hollow, forgettable action flick with a main actor who everyone has seen countless times in this genre. I just hoped it would be entertaining enough for me to have a decent couple of hours in front of the TV. Well, this movie might be 2021's best surprise to date! If Zack Snyder (Zack Snyder’s Justice League) is often criticized for his excessive use of slow-motion, Ritchie receives the exact same complaints but regarding his high-speed action scenes. This time, the latter leaves his well-known characteristics aside and proves that he's not a one-trick filmmaker.\r\n\r\nImpressively long, uncut takes - some reach the three-minute mark - help create a tremendously tense, suspenseful atmosphere throughout the entire runtime. Every scene is set up with patience and precise timing, making every single tiny movement from the camera and actors capture the audience's attention. Christopher Benstead's score is one of those examples that I will start giving people when they ask about impactful music in film. The heavy cello notes are incredibly ominous, establishing the mood of the whole environment in a way that will leave no viewer indifferent. Some of you might read the following as a critique, but the build-ups for each action scene steal the spotlight from the latter.\r\n\r\nWith that said, the shootouts and overall action are entertaining and well-filmed, which I believe will please a vast majority of spectators. Jason Statham (The Meg, Hobbs & Shaw) delivers a one-dimensional performance that would feel disappointing in any other movie, but it works for this protagonist. The main character is supposed to be mysterious and capable of anything, so it's only logical that he hides every ounce of emotion - even though it negatively affects a couple of dialogues. Furthermore, it's Jason Statham… moviegoers go see his films for his action skills, not his acting chops. When it comes to fire a gun or beat someone up, there are not that many actors who can do so as convincing as him.\r\n\r\nStory-wise, Ritchie didn't let go of his favorite narrative structure. Nonlinear storytelling is extremely difficult to pull off perfectly due to how easily it becomes confusing or messy. Fortunately, Wrath of Man features several storylines converging all in a single moment, which quickly demonstrates what the screenwriters plan to do. A mysteriously compelling first half transitions to a more predictable, formulaic second part where one of the storylines feels both tacked on and uninteresting. The secondary characters lack any sort of arc or random development, with the focus going completely into the protagonist's mission, whatever that may be.\r\n\r\nWrath of Man isn't a groundbreaking, mind-blowing, or even innovative action movie, but it's still one of the biggest, best surprises of the year. While it's true that Guy Ritchie still follows the genre formulas of success, he shocks everyone by leaving his trademark filmmaking techniques aside, delivering an incredibly tense film packed with suspenseful, one-take build-ups to energetic, riveting action sequences. Jason Statham's one-dimensional display works well enough for a mysteriously captivating protagonist who the viewers can easily root for once his true goal is revealed. Christopher Benstead's score tremendously elevates the entire movie, establishing an extremely gripping atmosphere. The nonlinear storytelling features parallel narratives that are not all interesting or necessary, ending with an ironically abrupt last scene, contradicting the overall steady pacing. In the end, it's a solid recommendation to watch in theaters if possible.\r\n\r\nRating: B+", "created_at": "2021-05-06T21:57:02.367Z"}, {"movie_id": 637649, "review_id": "60b277206dea3a00588fd4d9", "author_rating": 6.0, "review_text": "Huge Jason Statham fan. But despite the trailer, this movie was far from his greatest. He's his usual cool self, but the story is weak and performance from Josh Hartnett is downright embarrassing, to say the least. Holt McCallany is decent, but in general the characters come off as two-dimensional. You really don't care about them. I panicked when I saw Jeffrey Donovan, because his appearance is seldom that impressive. He was okay though, far from the one to blame for this B-movie. It's not bad, but certainly not a masterpiece either.", "created_at": "2021-05-29T17:17:20.432Z"}, {"movie_id": 637649, "review_id": "60b593c0371097002ac52fb4", "author_rating": 6.0, "review_text": "Viewers who like action films with plenty of violence for the sake of having violence will love this movie. I can’t deny that the action grabs you by the throat and moves you along with it. Sometimes, however, it felt to me like instead of a storyboard they worked from a murderboard: “Okay, how many do we lose in this scene?”  Once again I am reminded of Hitchcock. Suspense is not a bomb going off; suspense is not knowing when or if it will explode.\r\n\r\nThey took a bit of trouble to make the plot seem more intricate than it was: having maybe three flashbacks do the work of one, for example. Some of that layering of plot could have been diverted to character building and development. Only our hero is given motivation and a back story, and there are even gaps in that.\r\n\r\nBut it should be remembered that these observations are by, and for, someone who is not a fan of action films. If you are a fan, then nothing I have written here should deter you from watching Wrath of Man.", "created_at": "2021-06-01T01:56:16.900Z"}, {"movie_id": 637649, "review_id": "60db1e2a0e5aba007ec68162", "author_rating": 6.0, "review_text": "**Brazen, Brutal, & BLOODY ; Smart, Sleek & STYLISH . But Was It \" INSPIRING \" , Uplifting Or Even \" Particularly \" -{ REMARKABLE }-❓. . . I'm Afraid The Answer Is \" NO ⛔ \" .**\r\n\r\nA Good, Old Fashioned -{ \" **_B I G_** \" }- Screen Mini Review .\r\n\r\n\" 'Wrath Of Man' is more violent, more gritty ..than.. -{ Any }- of my other films \" . ( Director Guy Ritchie, from an official 'Entertainment Access' featurette ) . So there it is, the man himself, saying it... -{ Exactly }- ...like it is. And \"gritty\" -could not- have been a more ( -Apt- ) choice of words, because if you're expecting any 'exceptionally' lavish or Mind-blowing set-pieces from this particular cinematic endeavour, then I ask you not to hold your breath, in earnest. And that is because . . . . { with the ( sole ) exception of the very -fleeting- , & \"solitary\" , \" Staples-Center 🌆 Shot \" ....( that also showcases a few quintessentially 'glitter-ey' night time downtown Los Angeles high rises )... and -Is- indeed, in-all-fairness, \"Dazzlingly Spectacular\" from a cinematographic standpoint, atleast, ( -No- spoilers here : the said scene is proudly embellished in one of Mgm's -official- trailers ) } . . . . in a nutshell ; there actually -{ Aren't }- any . \r\n\r\nAnd in as much as the \"violent\" part of the { otherwise } highly accomplished Mr. Ritchie's brief yet pointed statement is concerned, my earnest advice to you is, quite simply, as follows. Keep any and all 'minors' ( in -Your- care ) away from this 'Dark, dark, red' -{ Adult }- crime thriller . . \" And with a 13-foot pole, at that, at the very -Least- \" . Digging a tad deeper . . . note that the trailer shows a -Seething- { yet outwardly super-calm } 'H', played by action tera-star Jason Statham just . . \"blowing people away\", { i.e straight up -Murdering- them with his pistol, in other words }, willy-nilly. Well, one might have thought that following the cold-blooded murder of his son ( -trailer, also- ) by the -{ 👉Exact }- sort of people as himself { namely, ( -potentially- ) 'Deadly', calculated, & ruthless armed robbers } . . . the primary writer, Éric Besnard, might -Perhaps- have made a little -More- room for soul searching by 'H' in the story. Regrettably however, that is, to a -Large- extent, -{ Not }- the case here . \r\n\r\nSummation : So what is 'Wrath Of Man's' **\" MORAL IMPERATIVE \"** then, you ask. \"Sadly...\", I reply, \"...for the most part, there -{ _IS_ }- None\". If you're -at all- familiar with my reviews, then you would know that I -{ Rarely }- say that a movie is just 'Pure Commerce' ...with no -clear & present- \"Inspiring\" ( or even just \"Redeeming\" ) quality about it... but I'm afraid that in the case of this admittedly enthralling yet ultimately unremarkable picture ; I would indeed be remiss to say that, as best as I can tell atleast, that is evidently -{ Not }- the case. A clear minded, 'Honest-to-goodness' 06.25 out of 10.00 from me -{ \"At Best\" } 🤷‍♂️ .", "created_at": "2021-06-29T13:20:42.659Z"}, {"movie_id": 637649, "review_id": "60e74f509979d200460075ec", "author_rating": 8.0, "review_text": "Wrath of man Has all any action movie needs. A plot of intrigue and mystery with a angry person looking for revenge. honestly did not expect the movie to be good but it came out brilliantly. A man just trying getting justice for what he felt is right. The movie keeps u glued and don't lose interest. Overall good movie.", "created_at": "2021-07-08T19:17:36.302Z"}, {"movie_id": 637649, "review_id": "60e9e8cdefcea9007ff09d55", "author_rating": 8.0, "review_text": "Solid revenge-thriller with the usual bad-ass performance from Jason Statham. Doesn't exactly have the flare of the usual Guy Richie film but little touches here and there. The pacing feels a tad off probably because it switches from H's (Statham) POV to that of the robbers who really didn't do much for me. Still, well worth checking out. **3.75/5**", "created_at": "2021-07-10T18:37:01.365Z"}, {"movie_id": 637649, "review_id": "60faac5bd7fbda0062a8bc3f", "author_rating": 9.0, "review_text": "If you want an evil militant and criminal drama at the same time, then you will get everything at once and even more. Just consider that the \"Wrath of Man\" is not only about shooting and unrestrained action.\r\nIf someone from friends ask me to advise a good thriller, I would recommend the \"Wrath of Man\" along with other movies of Guy Ritchie.", "created_at": "2021-07-23T11:47:39.212Z"}, {"movie_id": 637649, "review_id": "61166ad899d5c30046efdcfa", "author_rating": 6.0, "review_text": "Definitely Guy Ritchie's best in quite a while. Also, nice to see a director take his Disney dollars and return to making something original.\r\n\r\nIs it a great film? Not really. But, it's really well crafted, the story is interestingly told, and it rekindles the vibe that made Ritchie the UK's version of Tarantino when he first emerged. \r\n\r\nMy only complaint isn't necessarily about this film specifically but more it's \"type\" by which I mean it's yet another film about a guy with a secret badass background who goes on a revenge spree. John Wick, Taken, Nobody, The Equalizer, and so many others have done the same thing. Apparently bullets don't do permanent damage to lead characters? Seriously, with the damage he takes in this film he should have spent the runtime changing a colostomy bag and being wheeled to the TV to watch cartoons while drooling down his chest. But, again, that's not unique to this film. It's kinda the standard now days. I guess when so many films seem to have the intention of being a franchise a character's mortality only becomes an issue if the actor doesn't renew their contract. \r\n\r\nIf you don't mind this issue, it's a really fun film. I enjoyed it a lot. I'm just getting tired of invincible heroes in films.", "created_at": "2021-08-13T12:51:36.072Z"}, {"movie_id": 637649, "review_id": "61cee502a802360041c7e86e", "author_rating": 9.0, "review_text": "I am quite a fan of Jason Statham so I am perhaps a bit biased when it comes to movies he is in but, to me, this was a great action thriller. I very much like Statham playing the silent, mysterious tough guy role. He is perfect in this role.\r\n\r\nThe movie builds up somewhat slowly but it does not take very long before Statham shows that he is not an ordinary security guy when he takes down some wannabe robbers with nothing less than extreme efficiency. A very cool scene.\r\n\r\nOn one side I like that the movie takes some time to build up the suspense and reveal the plot. In articular why Statham is there in the first place. On the other side the way the movie does it irks me somewhat. There just to much flashbacks for my taste and some events we are forced to watch from no less than three different perspectives. Felt a bit like a filler to me. Still, Statham’s passed and presents weaves together in a story that, to me, is quite good and not the everyday, run of the mill, revenge story. Quite well done actually.\r\n\r\nNot entirely surprising the movie builds up to a big showdown in the end. I very much liked it. Lots of action although I would have liked that they let a few more of the good guys actually survive. The death count on both sides was somewhat excessive.\r\n\r\nThe ending was satisfactory although from a point in the showdown, about twenty or minutes from the end, it was rather predictable.\r\n\r\nThe reason this movie gets four and a half (or 9 out of 10) stars instead of the full five out of five is only because of the flash backs which. Some of them contributed to the movie but some of them actually bored me a bit.", "created_at": "2021-12-31T11:09:54.638Z"}]