[{"movie_id": 11468, "review_id": "5569d2fec3a36876980018f3", "author_rating": 8.0, "review_text": "My name is Tom Van Allen. I'm a trumpet player.\r\n\r\nThe Salton Sea is directed by D. J. Caruso and written by Tony Gayton. It stars Val Kilmer, Vincent D'Onofrio, Peter Sarsgard, Doug Hutchinson, Anthony LaPaglia, Debora Kara Unger, Adam Goldberg and Luis Guzmán. Music is scored by Thomas Newman and cinematography by Amir Mokri.\r\n\r\nDanny Parker (Kilmer) is hanging out with a bunch of methamphetamine users, apparently in an effort to numb the pain of his one time life that saw his wife murdered. Or is he? The word of mouth for it was strong, but no sooner did it hit cinemas than it disappeared off the face of the earth. However, the cult cinema world is often a vibrant place to lurk, enter there and you find The Salton Sea, a wonderfully tricksy and off beat neo-noir awash with misery, revenge, redemption and odd ball characters that are either stuck in purgatory, or heading to nowhereville.\r\n\r\nProtagonist Danny Parker leads the film, a man whose identity is fractured after being dealt a blow from the hands of fate, very much in limbo mentally, he none the less has goals to achieve, nothing is never quite as it seems until director Caruso wants us in on the side-shifts. Danny is often in the company of danger and weird characters, from a hopped up harpoon wielding loon, to a no nose psycho (too much meth up the nose will make you lose it kids), via dirty cops and meth heads, it's a world of unease, the twisty plot drawing the viewer in with a kinky smile on its face.\r\n\r\nCaruso also pulls off the neat trick of placing humour in this off kilter world without hurting the dramatic harshness of the thematics. There's a quite brilliant sequence that shows a botched crime being attempted by the meth head crew, this we watch at the same time as they discuss about actually pulling the crime off. That it involves a stool sample from Bob Hope should tell you all you need to know about the intelligence of the wannabe perps! Caruso's camera is fluid and he uses certain neo-noir visual tricks of the trade as well (time lapses etc), and he also has a knack for varying the mood without averting the slowly bubbling to the surface pace that the story requires.\r\n\r\nKilmer is superb, perfectly low-key, there is no need for rage, the yearning for revenge and redemption, for identity, is brought out via calmly delivered dialect, and it's very affecting. D'Onofrio as Pooh Bear, the afore mentioned no nose fella, steals the movie with another of his off the planet nut-jobs. Elsewhere, Sarsgard is as appealing as he has ever been as Danny's stoner best mate, Hutchinson and LaPaglia cut fine figures as dirty cops, while Guzmán and Danny Trejo leave an impressively grungy mark. The only disappointment is the lack of screen time for Kara Unger, a fine actress, she is playing what turns out to be a critical femme fatale role, but really we needed more of her. It's a rare misstep in an otherwise cracking neo-noir that is highly recommended to fans of similarly devilishly fun pictures. 8.5/10", "created_at": "2015-05-30T15:10:54.707Z"}]