[{"movie_id": 420809, "review_id": "5da5cf4b97fdec001875084a", "author_rating": 6.0, "review_text": "‘Maleficent: Mistress of Evil’ is not only a surprising follow-up to the original film, but also among 2019’s live-action Disney offerings is the only one that I actually sat through and enjoyed. It made me laugh, and the action is really engaging. Jolie and Pfeiffer are having so much fun that you can't help but join in. Yes, it’s filled with flaws, but it’s nice to leave a Disney film not wanting to cry in a ball and question if you really ever liked them.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-maleficent-mistress-of-evil-disney-still-have-some-magic-left-in-them", "created_at": "2019-10-15T13:53:15.889Z"}, {"movie_id": 420809, "review_id": "5f67d773af3da600342aa354", "author_rating": 8.0, "review_text": "Great watch, would watch again, and can recommend.\r\n\r\nThis was a very impressive sequel to the original.  I'm sure it had something to do with low expectations, \"What are they going to do to follow THAT....ohhhh\".\r\n\r\nIt's probably the first time I've registered a large scale battle like this movie has since....I guess \"Infinity War\", but \"Lord of the Rings\" seems more apt as it is a fantasy movie as well.\r\n\r\nWhat's really odd is that this movie has too many story lines, but still manages to balance them acceptably.  It also goes the extra mile to explore the angle of \"it doesn't matter how different we are, but what we do with our potential\" sort of thing.  There are race traitors, and true examples of evil disregard for life.  Michelle Pfieffer really owns her role as an evil queen, and sure they go into backstory to give a modicum of justification, but she gets into death in a very psychotic fashion, not to mention the page.\r\n\r\nWhile the most charming part of the movie is the most boring, unity and peace, it is amazing at the great lengths people will go to prevent such a thing, and that's really the movie that you're watching here: someone going to every length to be a hero, and just being a jerk instead.\r\n\r\nWell worth the watch, and I think most would enjoy even without having watched the first.", "created_at": "2020-09-20T22:28:03.593Z"}, {"movie_id": 420809, "review_id": "5fada302470ead004205d66c", "author_rating": 6.0, "review_text": "More sluggish than entertaining, for me anyway.\r\n\r\nI enjoyed the first film, but <em>'Maleficent: Mistress of Evil'</em> is one I never really got into. The whole premise surrounding Angelina Jolie's character is uninteresting, not helped by a lack of serious rationale for why characters, other than Maleficent, are acting the way they are; namely Michelle Pfeiffer's Queen Ingrith. At best, it's lame motivation.\r\n\r\nJolie remains the star, while Elle Fanning is solid enough. Pfeiffer isn't as enjoyable as she should be, mainly due to the aforementioned, but still produces a good display. Chiwetel Ejiofor is a terrific addition to the cast, but I can't honestly say I'll remember his performance here - which is a shame.\r\n\r\nWarwick Davis is, slightly, underused too. Also, how strange to see former professional footballer John Carew on the cast; albeit in a minor role. The effects are, pleasingly, an upgrade at least; they all look great.\r\n\r\nI hold no ill feelings towards this, I just wish it was greater.", "created_at": "2020-11-12T21:02:58.507Z"}, {"movie_id": 420809, "review_id": "64b68dde78570e00c6d5ffce", "author_rating": 8.0, "review_text": "A lot better then the first. This one had a lot more action and some epic battles. Easily the best out of the series.", "created_at": "2023-07-18T13:04:30.058Z"}]