[{"movie_id": 788977, "review_id": "643e463843250f04ca510526", "author_rating": 7.0, "review_text": "Young fisherman \"Adam\" (Tawfeek Barhom) receives a letter that is going to change his life. He has been accepted into the prestigious Al-Azhar University and after an emotional farewell with his family he sets off to the hubbub of Cairo. Simultaneously, the Grand Imam dies. This is a very important event for the Sunni community, but it is also an highly significant one for the government too. The President makes it known through his National Security agency whom he wants to succeed to the role. To ensure that the election delivers the required outcome, the rather dishevelled looking \"Col. Ibrahim\" (Fares Fares) is drafted in. Now he already has an \"angel\" working for him at the school, but when \"Zizo\" (Mehdi Dehbi) is found slaughtered in the forecourt, the Colonel must find a new informant - and he alights on the young and impressionable \"Adam\" - using an intriguingly effective carrot and stick combination of threats and promises. The rest of the film follows the rather perilous path the young scholar must take if he is to facilitate his puppet-master whilst protecting his family from their revenge should he fail - and staying safe from his colleagues who have their own form of sedition on their minds. What we have here is quite a plausible and at times effectively menacing look at just how easily the organs of the state can manipulate, or cause to be manipulated, the most public and seemingly inscrutable of processes. Indeed, after a short while there is a rather depressing inevitability to the whole election procedure! The actual story is not the best. There are a few things that remain unexplained - much of the activities of the honourable \"Blind Sheikh\" (Makram Khoury), for example, are largely undercooked; and there are one or two scenarios that end just too briefly and conveniently. At one stage I thought it was heading for a really tough and brutal ending - and that would have worked better for me than the one we are offered - but see what you think about that. This is a well written, paced and dark political drama that challenges the status quo and leaves a rather bitter taste in the mouth. The two leading actors are on good form and the film is certainly thought-provoking. The location architecture is glorious too!", "created_at": "2023-04-18T07:26:48.512Z"}]