[{"movie_id": 75638, "review_id": "5d945aa887ae7b001ca46290", "author_rating": 6.0, "review_text": "When I hear the drumming of hooves, I don't think unicorns, I think horses. \r\n\r\nRed Lights is written and directed by Rodrigo Cortés. It stars Cillian Murphy, Sigourney Weaver, Robert De Niro, Toby Jones, Joely Richardson and Elizabeth Olsen. Music is by Victor Reyes and cinematography by Xavi Giménez.\r\n\r\nA sceptical psychologist and her physicist assistant specialise in exposing fraudulent paranormal phenomena. But when one of the world's most renowned psychics resurfaces onto the circuit, it opens up a whole new can of worms.\r\n\r\nIt's a tricky film to recommend with any sort of confidence, this in spite of a high calibre of actors assembled for the shenanigans. For a good portion of the play it's a deft examination of the cons and belief values involving psychics and faith healers etc. The leading protagonists naturally have issues, and some secrets will have to will out, while Cortés has a keen eye for an other worldly vibe. Yet come the big reveal at pic's denouement there's a feeling of \"really, is that it\"? \r\n\r\nUltimately this doesn't deliver on its promise or enhance the core base ideas on the page. It's creepy at times, even fascinating with the subject matter, but it ends up unfocused and confused and frustrating as a viewing experience. 6/10", "created_at": "2019-10-02T08:07:04.489Z"}, {"movie_id": 75638, "review_id": "5f51928ffba6250032293700", "author_rating": 8.0, "review_text": "Honestly, I don't even truly know what I just watched. Did I, however, absolutely thoroughly and undeniably enjoy it? You betcha! That's probably thanks to the outstanding cast, rather than anything else.\r\n\r\nCillian Murphy is utterly superb in this, I loved his performance as Tom. It's no surprise given what else he has done, he's a great actor to watch. Murphy isn't alone in <em>'Red Lights'</em> though, as he is joined by other notable performers. Sigourney Weaver (Margaret) and Robert De Niro (Simon) are also terrific, they add a lot with what they give. You also have Elizabeth Olsen (Holly) and Toby Jones (Paul) involved too. Top casting!\r\n\r\nOn the other hand, the premise - or at least how it's shown - isn't as great as it could've been. I still enjoyed it wholly, but that's probably because the film makes a lot of noise around the story and builds up the tension well. However, when you break it down after watching it isn't anything as outrageous as you might feel at the time - at least that's how I view it. Some more development into the characters would've been nice, for example.\r\n\r\nNevertheless, the film done its job and made me feel entertained and enthralled into what was happening. It's difficult to criticise it due to that, to be honest. I'll leave it to others to dive deeper into it, but all I can say is I practically loved it.", "created_at": "2020-09-04T01:04:15.032Z"}]