[{"movie_id": 324552, "review_id": "58b1c314c3a368076100edd0", "author_rating": 9.0, "review_text": "~NO SPOILERS~\r\n\r\nThis movie essentially starts right after the first one ends, right at the top-down view of New York City. Dark humor abounds,\r\nbullets rip through head and bodies, and Wick is unstoppable.\r\n\r\nThis film should be held as the gold standard for action movies. There is very little camera shake during fights and Reeves clearly has spent a lot of time preparing for this role. You can see nearly every take-down, every gunshot, and Wick has to reload at inconvenient times in a realistic fashion which also adds to the hilarity of the following kills.\r\n\r\nOverall the acting performances were solid. Reeves isn't known for having an extremely wide range, but his devotion to making this movie a kick-ass martial arts production is second to none. I felt the villain was a bit on the weak side though, but he did his role justice. Ian McShane's character remains the strongest especially combined with the last film.\r\n\r\nThe lighting is superb! There's a red-blue theme that is in nearly every nightclub and darkly lit areas and its absolutely lovely to look at. Overall cinematography is very good.\r\n\r\nDefinitely worth seeing!", "created_at": "2017-02-25T17:47:00.716Z"}, {"movie_id": 324552, "review_id": "5919981bc3a36842d605a7a6", "author_rating": 7.0, "review_text": "Grows the world. Grows the legend. But the story itself and the man himself remain firmly retreading the steps they took in the first outing. Not too harsh a criticism though, 'cause that one was damn good too.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-05-15T11:59:23.113Z"}, {"movie_id": 324552, "review_id": "594e9c78c3a368329b040322", "author_rating": 6.0, "review_text": "I was really hoping I would like this movie. I so enjoyed the first one. However, when the credits started to roll at the end I found myself wondering “What the fuck happened?”.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nOne thing I really liked about the first movie was, as you can read in my review about that one,  that it was a no bullshit, kill the bad guys and no emotional regrets, kind of movie. John Wick went all out for revenge and at the same time we got introduced into this cool world of assassins, safe havens, hidden “shops” for guns, classy tailors providing bullet proof costumes etc. etc.\r\n\r\nIn this movie he is forced onto a job by a real asshole. He is constantly reluctant and walks around with a sad puppy face all the time. Of course said asshole screws him halfway through the movie and that would have been a good time to start get back on track with some decent payback story but unfortunately the script writers thought otherwise. After some more of the same shit no one really wins in the end (although one of the two adversaries suffer a more “permanent” setback than the other).\r\n\r\nWorse is that, in my opinion, in their eager to put together some crap drama this movie essentially screwed up the possibilities for a John Wick 3 unless they pull some rather big surprise rabbit out of the hat for that one.\r\n\r\nThere are plenty of action in the movie of course but also her I feel that it was a bit too over the top. No one, absolutely no one, seems to be able to shoot straight except for John Wick. This makes the action feel more like a parody a’la Kill Bill than a more serious action, revenge movie. Yes it is cool to watch but only up to a point. Heck, if this would have been a Star Trek (TOS) episode Hollywood’s entire supply of red shirts would have been used up on a single movie. While I am bitching I should perhaps also mention that the amount of beating that John Wick seems to be able to absorb is … unbelievable.\r\n\r\nI did enjoy the movie but not at all as much as I hoped I would. To me it has a completely different spirit than what I remember from the first one and the ending is, again to me at least, not a happy one.\r\n\r\nHaving said that the action sequences are as cool, crazy but cool, and violent as they are unbelievable. I found it a bit sad that they wrecked his nice car though.\r\n\r\nOverall a enjoyable movie but no match for the first chapter and I cannot bring myself to give it more than 3 out of 5 stars.", "created_at": "2017-06-24T17:08:08.754Z"}, {"movie_id": 324552, "review_id": "59b1eb6bc3a3682c2208b51e", "author_rating": 8.0, "review_text": "**All eyes on him and all guns pointed at him.**\r\n\r\nIt was not an attracting title for a sequel. The first film was good, completely an unexpected, but I was expecting this one, even though not as much as I was excited to see 'Jack Reacher 2'. That film was good, but did not meet with its first film's merit. And this sequel, really amazing. One of best follow-up flick and better than the original. That feat considered very rare in cinema and here is the one.\r\n\r\nEntirely different than the first. I meant the storyline. A new action, a new adventure, and even on a bigger scale. Though the initial parts were average. I totally disliked that killing assignment Mr. Wick took in his hand, but what followed after made the film great, definitely not to be missed for that alone. Especially if you are an ardent action film fan. For me, that reminded me 'Kill Bill', but they are not the same kind, except the fighting concept with hundreds.\r\n\r\nContinued from a couple of days later where the previous narration had ended. Now the retired assassin, John Wick forced to take a final job, but soon he finds he was backstabbed. Every eye on the town on him and every gun pointing at him, there's no way he could get out of it easily. So, he has to fight them all, just in order to survive. Then what comes later are even more aggressive screenplay that's ends with left open the door for the third film.\r\n\r\nNow this became a stylish franchise. That's what happens when a stuntman takes up the directional job for an action flick. He did not write it, but he knew exactly how to create them, technically perfectly. Besides, he got wonderful, dedicated actors to achieve that. Not just Reeves, but all were awesome. Believe the third film would be a kick-ass, particularly the pace that could match with likes 'Crank'. Just watch it already and be prepared for the next, the mega finale.\r\n\r\n_8/10_", "created_at": "2017-09-08T00:59:23.354Z"}, {"movie_id": 324552, "review_id": "5d86b3a35a469000199b431e", "author_rating": 7.0, "review_text": "Picking almost right where the previous film ended, \"John Wick Chapter 2\" deals with the consequences of Wick's return to the assassin life and how he got out to begin with.\r\n\r\nAs expected, it expands on the mythology hinted at in the first movie, with the revelation that there's a high council of sorts, other Continental hotels around the world, and a very widespread network of assassins.\r\n\r\nAlso as expected, it ups the ante with bigger action sequences, and a much higher body count. We get to know more about some rival assassins played quite brilliantly by Common and Ruby Rose (whose character communicates solely through sign language; in many cases, this kind of thing is used as a gimmick to make the audience remember a character when they have nothing else to distinguish them, but it's not the case here  and is used only as an aspect of the character; smartly done). Keanu Reeves...let's the Reeves of old come through a couple times, with a couple of bizarre and inappropriate inflections. Ian McShane's Winston expands a little bit, although he still refers to John as Jonathan, which is just wrong. If it's supposed to be some kind of an in-joke with them, they don't reveal anything about it. Again, I think there's more going on with Lance Reddick's hotel manager than they're letting on. And I was a little disappointed that Peter Stormare wasn't in more of the film, as he's always fun.\r\n\r\nAgain, the world is very wide, and almost seems like everyone is involved with this underworld. There is an indication that that's not the case here and there, but we never get to meet anyone who doesn't know what's going on, which keeps some of that suspicion up.\r\n\r\nThe plot follows a pretty basic structure. Actually, it follows a pretty rigid structure. In a two hour movie, it can be broken down almost exactly into half-hour sequences, something that struck me as a little odd. There are some minor plot twist. Nothing major or out of the blue, but at least there was an attempt.\r\n\r\nSo now we come down to it. Is it better or worse than the first movie? Well, I would have to say \"yes\". It definitely ups the ante and is a much bigger film than the first movie, expanding on the mythology and the characters. At the same time, it falls into the trap that a lot of these bigger, badder sequels fall into, which is that with the bigger scope, it feels like they have to use a bigger yoke on everything in order to keep in reined in and from going off the rails on its own. In fact, they may have expanded the world too quickly, going from a city in the first movie to the entire globe in the second. That rapid expansion makes that bigger yoke much more percpetible and, while the ambition is admirable, at times I wondered if they may have bitten off more than they could chew.\r\n\r\nStill an enjoyable action film, and if you liked the first film, you'll most likely enjoy this one.", "created_at": "2019-09-21T23:34:59.457Z"}, {"movie_id": 324552, "review_id": "63be1126f8595800ae340e49", "author_rating": 8.0, "review_text": "There are two franchises that my wife loves and forced me to watch...\r\n\r\n... The first is The Fast and the Furious and the Second is John Wick.\r\n\r\nThe Fast and the Furious is low on plot, high on action and vapid... and horrible. It's pure action and it's too... and I can't believe I am saying this... but too machismo hardcore for me to really like.\r\n\r\nSorry, but I couldn't think of any other way to describe it.\r\n\r\nIt seems like it is mindless action that is trying too hard to be cool and edgy.\r\n\r\nJohn Wick is low on plot, high on action and vapid in story... but it's super fun and stylized cool and an absolute pleasure to watch.\r\n\r\nMaybe it's because I like Shoot em up bang bang movies a lot more than drive around voom voom stories.... or maybe it's just that John Wick is the film franchise that doesn't have to try to be cool... and the Fast and the Furious tries too hard.\r\n\r\nOr maybe it's simply that the stylized violence in the John Wick franchise is just so much fun to watch... and if you ask me to not be analytical, I'm going to say that that is the answer.\r\n\r\nIt's just so much fun to watch... and movies should be fun to watch... or they should be emotional or they should make you think.\r\n\r\nAnd ultimately, sometimes you are just in the mood for something fun... and John Wick is a fun movie. All three of them are fun movies... and that is what most movies should strive for... being entertaining and fun", "created_at": "2023-01-11T01:30:14.728Z"}, {"movie_id": 324552, "review_id": "63daad4f955c6500a0ecf268", "author_rating": 8.0, "review_text": "In terms of sequels, you will not be able to find a better film than John Wick: Chapter 2. The sequel takes every aspect of the first and expands on it, making it bigger and better, but still having the same drawbacks of the first. The story and performances are not the greatest, but do enough to drive the action and film forward. I would argue that the plot here is slightly improved due to the larger scope. The assassin underworld is expanded as we get to see more subsects and players in the space. There are complex relationships that Wick has with many characters in this film, and although we never see what occurred in the past, the history is there in terms of their interactions. This is especially apparent in the end when all of Wick’s former “co-workers” start entering into the fold. This had to be my favorite part of the film. Rome, as a setting, was great and the underground tunnels were a fun environment for Wick to play in. The action was brilliant once again, with more weapons and creative kills included. I loved that we got to see Wick use the pencil on two of the guards! There were some beautiful shots with fantastic color due to the city light scape. The use of water reflections was done well, although, I do think there might have been a few too many. The pace towards the end started to slow down. I feel as though this movie should have been maybe 10-15 minutes shorter. Despite that, this movie was once again a fantastic entry into the series and on par with the first in terms of quality, action, and enjoyment. \r\n\r\nScore: 79%\r\nVerdict: Great", "created_at": "2023-02-01T18:19:59.472Z"}, {"movie_id": 324552, "review_id": "63f028c615376c00cb2274d6", "author_rating": 8.0, "review_text": "<em>'John Wick: Chapter 2'</em> felt a tad different to me, even if I still had exactly the same reaction to it - enjoyment!\r\n\r\nKeanu Reeves fits the lead role extremely well, he certainly elevates the films with his performances. I'd say the supporting cast are an improvement from the original, Riccardo Scamarcio alongside the likes of Laurence Fishburne, Ruby Rose and Common are good to watch. More of Ian McShane is welcomed, too.\r\n\r\nThe difference that I felt was that there seemed to be many more talky moments, the preceding film felt like it had more wall-to-wall action than this. I could be wrong, but I'm not complaining either way - just an observation. I'm interested to see how the third film panned out.", "created_at": "2023-02-18T01:24:22.397Z"}, {"movie_id": 324552, "review_id": "645a96113fe1600172254072", "author_rating": 9.0, "review_text": "Ok, so it's not quite as good as the first movie but how often does that actually happen? Mr Wick is cool, again. The action is cool, again. The villains are cool, again. Except for that silly little girl who doesn't speak of course. But again, the addiction to this movie lies in the multiple layers added to further build the world these characters inhabit. Great stuff.", "created_at": "2023-05-09T18:50:57.676Z"}, {"movie_id": 324552, "review_id": "64a6c4d22b531d00aedd20fb", "author_rating": 8.0, "review_text": "Just as good as the 1st. Has some incredible fight scenes. He takes a beating and just keeps on going.", "created_at": "2023-07-06T13:42:42.549Z"}]