[{"movie_id": 8922, "review_id": "51f3a57d760ee37a7c21d3d8", "author_rating": null, "review_text": "I loved this movie.For it's budget & little CGI used.It was a great thriller.I don't consider it as horror.I'm sure many don't agree.I have been hoping for a new movie.", "created_at": "2013-07-27T10:48:29.190Z"}, {"movie_id": 8922, "review_id": "5a2ccf61c3a3680b8814b7d1", "author_rating": 7.0, "review_text": "An under-appreciated horror piece from my formative years, best watched going in with no clue what you are in for.\r\n\r\n_Final rating: ★★★½ - I strongly recommend you make the time._", "created_at": "2017-12-10T06:08:33.731Z"}, {"movie_id": 8922, "review_id": "5cb3dd08c3a3683c20b1040a", "author_rating": 6.0, "review_text": "Indeed, where did you get those eyes?\r\n\r\nSiblings Darius and Trish are driving home from college through rural America. They have a brief run in on the road with the driver of a beat up van, later on, on the road side, they observe weird goings-on from the driver of said van, an observation that puts both of them in immense danger.\r\n\r\nJeepers Creepers tips its hat off to the creepy horror movies that were all the rage in the 70s and early 80s, boasting genuine suspense and characters fully formed, Jeepers Creepers is something of a refreshing antidote to the ream of horror movies available that line up teenagers purely to be slasher fodder. Lifting it just above average is the fact that our two sibling protagonists have viable discussions before venturing into the realm of horror staple requirements, although the picture is \"B\" movie in substance, it does however attempt to be credible in its story telling.\r\n\r\nSadly though, after a wonderfully edgy first half, the picture drops down in standard, the introduction of \"The Creeper\" may well be a necessity, but it shifts the film to such a degree, it rapidly loses its creepy momentum. Not that the second half of the film is a disaster, far from it, it's got a scary fun vibe to it, it's just that it promises so much, but ultimately runs out of steam. Jeepers Creepers was successful enough to spawn inferior sequels, with the \"Creeper\" of the piece firmly entering the horror hall of fame, thus an argument for the film having done its job seems totally viable, it's just sad that it didn't stay on the side of edgy and become a horror classic. 6/10", "created_at": "2019-04-15T01:23:20.690Z"}, {"movie_id": 8922, "review_id": "6078ccf6d8f44e00417b00ad", "author_rating": 6.0, "review_text": "Just OK. Justin Long is his usual quirky, excellent self. Gina Philips plays the sometimes right, sometimes wrong older sister. Won't be watching the other ones...", "created_at": "2021-04-15T23:32:06.388Z"}]