[{"movie_id": 16869, "review_id": "5b5a2a279251411a64002a64", "author_rating": 8.0, "review_text": "**_Refreshingly different alternative WW2 drama/adventure_**\r\n\r\nRELEASED IN 2009 and directed by Quentin Tarantino, \"Inglourious Basterds\" takes place during the German occupation of France in WW2 and revolves around a ruthless “Jew Hunter” Nazi (Christoph Waltz), a beautiful young theater owner dripping with vengeance, a German war hero who pesters her and a brutal team of Jewish-American guerrilla soldiers led by Lt. Aldo Raine.\r\n\r\nThis was my first taste of the popular director's eccentric repertoire, although I've since seen all of his movies. The first time I tried to watch \"Basterds\" I gave up around the 50-minute mark. Don't get me wrong, the dialogue-driven opening sequence is great but the film seemed to bog down with its focus on a French theater during the German occupation and the accompanying interminable dialogue (mostly in subtitles). I just wasn't ready for this because I was expecting a Dirty Dozen-styled WW2 film with lots of action and all that goes with it. What I got instead was a plot that focused on the aforementioned theater accompanied by long sessions of generally subtitled dialogue.\r\n\r\nI eventually gave it a second chance with the understanding that this wasn't some typical war flick. Strangely, the \"interminable dialogue\" pulled me in and I slowly became engrossed in the story, which isn't hard to follow. The drama is only occasionally interrupted by flashes of extreme violence. Until the end, that is, where all hell literally breaks loose.\r\n\r\nThere ARE elements that bring to mind \"The Dirty Dozen\" (1967), including a group of anti-heroes intent on mercilessly obliterating as many Germans as possible and the fact that the real action doesn't kick-in until the final act, but \"Basterds\" is hardly a Dirty Dozen clone. It may borrow a bit from notable films of the past but it absolutely possesses its own refreshing originality.\r\n\r\nAll effective films have quality characters and \"Basterds\" has several: The stunning Mélanie Laurent as Shosanna, the cinema proprietor who quietly seethes with retribution; Christoph Waltz as SS Col. Hans Landa, an articulate and suave love-to-hate villain who mercilessly hunts down Jews; Brad Pitt as the almost-comical, but no-nonsense leader of the brutal Basterds; super-sharp Diane Kruger as a German actress & British spy; and Daniel Brühl as a genial German hero with the hots for the beautiful Shosanna.\r\n\r\nLike Tarantino’s other great movies (“Pulp Fiction,” “Django Unchained” and “Jackie Brown”), \"Basterds\" pulsates with confidence, style, quirkiness and a sense of the unexpected from beginning to end, the perfect antidote to the idiotic \"blockbuster\" syndrome that plagues modern cinema with its predictability and overKILL action & CGI, etc. Most movies seem like they’re in a rush and shy away from extended dialogues because they fear losing the viewer’s limited attention whereas Tarantino makes them a highlight because it’s an area where he excels. Instead of pedestrian verbiage that merely advances the plot or conveys the obvious, his interchanges are rich with amusement and mindfood.\r\n\r\nTHE FILM RUNS 153 minutes and was shot in France and Germany.\r\n\r\nGRADE: A-", "created_at": "2018-07-26T20:08:07.815Z"}, {"movie_id": 16869, "review_id": "61561d1dfe6c18008b49ec14", "author_rating": 9.0, "review_text": "Second time seeing this since it was released on Blu-ray in 2009 and still is a solid war-thriller with Tarantino's flair with dialogue and of course, feet. But seriously, despite being 2.5 hours, the time flew by thanks to the brisk pace and great performances from all around. Not my favorite Tarantino film but it's up there. **4.5/5**", "created_at": "2021-09-30T20:25:01.109Z"}, {"movie_id": 16869, "review_id": "621a95ad42bf010044358ad4", "author_rating": 8.0, "review_text": "It's obviously Tarantino, creating tension with long dialogues and containing short bursts of violence, although some scenes could have been shortened or omitted. Great to see the lineup of French and German actors, where the terrific Waltz takes the cake.\r\n\r\n8/10", "created_at": "2022-02-26T21:03:41.850Z"}]