[{"movie_id": 23047, "review_id": "5a58ea0e0e0a2634fe00d5ca", "author_rating": 6.0, "review_text": "It never received very god critics and I have to say it wasn’t the best film that I have seen, even though Nicolas Cage is one of my favorite actors. Then again, I never really like it when my favorite actors die at the end of the movie. Also the CGI, especially at the end of the film, was of rather mediocre quality.\r\n\r\nAnyway, on the whole it was a fairly nice medieval sword swinging fantasy/supernatural action flick and not at all as bad as the critics tried to make it but then I’m not really surprised that the critics are off-whack as usual.", "created_at": "2018-01-12T17:02:06.968Z"}, {"movie_id": 23047, "review_id": "5a8dbcb8c3a36826780016a6", "author_rating": 8.0, "review_text": "***Knights, crusades, black plague, witches, castles, foreboding forests and demons***\r\n\r\nRELEASED IN EARLY 2011 and directed by Dominic Sena, \"Season of the Witch\" chronicles events when two ex-Teutonic Knight crusaders (Nicolas Cage & Ron Pearlman) traveling through Styria in modern-day Austria are enlisted to escort an alleged witch suspected of causing the black death (Claire Foy) to a remote monastery in the mountains for trial and to hopefully stop the devastating plague. Stephen Campbell Moore (Debelzaq), Stephen Graham (Hagamar) and Robert Sheehan (Kay) accompany the Knights.\r\n\r\nThis is basically the American version of \"Black Death,\" a European film released around the same time. Both movies are dark, gritty and brutal in their depictions of Medieval Europe, but \"Season of the Witch\" is more of a stereotypical blockbuster with modish protagonists, amusing one-liners and CGI-laden climax. \"Black Death\" is deeper, more thought-provoking and realistic, which is why I give it the edge in overall value (see my review).\r\n\r\n\"Season\" is the more conventionally entertaining movie and anyone who appreciates Dark Ages-based flicks are highly encouraged to check it out. Films which come to mind include \"In the Name of the Rose\" (1986), \"Kingdom of Heaven\" (2005), \"Robin Hood\" (2010), \"Ironclad\" (2011), \"King Arthur\" (2004), \"Dragonslayer\" (1981), \"Red Riding Hood\" (2011), \"Tristan + Isolde\" (2006) and \"Robin Hood, Prince of Thieves\" (1991). It's as good, or better, than any of these.\r\n\r\nThe colorful Medieval cinematography (castles, dungeons, villages, dark forests and breathtaking mountains) is mind-blowing and the two protagonists are great with their amusing rapport. Furthermore, Foy is easy-on-the-eyes. Look out for a thrilling rope-bridge crossing à la \"Sorcerer\" (1977). Although the climax is over-the-top cartoony, the tone up to that point is quasi-realistic, similar to \"Robin Hood, Prince of Thieves.”\r\n\r\nTHE MOVIE RUNS 1 hour 35 minutes and was shot in Austria, Hungary and Croatia with reshoots done in Louisiana. WRITERS: Bragi F. Schut. ADDITIONAL CAST: Christopher Lee is almost unrecognizable as the plague-ridden Cardinal D'Ambroise.\r\n\r\nGRADE: A-/B+\r\n", "created_at": "2018-02-21T18:38:48.502Z"}, {"movie_id": 23047, "review_id": "631a020bcaef2d007e72d78b", "author_rating": 1.0, "review_text": "**A perfect example of how disrespect for the past and history can totally annihilate a film, even if it is fiction.**\r\n\r\nI really enjoy watching period films. However, my work as a historian gives me some antibodies to these films, for reasons linked to the lack of ability to harmonize creative freedom and strict respect for the historical facts and period customs. So, it was with some curiosity that I decided to see this film. After seeing it, I just wanted to slap director Dominic Sena and screenwriter Bragi Schut. None deserve any respect for what has been done here. The film is an insult to historians… even if it is not deliberate!\r\n\r\nThe script is the film's biggest problem, with a writing that seems to glue together fragments of several different stories: we start with the Crusades, we follow two knights in several military episodes and then, somewhat brusquely, they turn their backs on the Church (supposedly) and leave, probably for their homeland. It turns out that, on the way, they come across the Plague, and there is a woman, supposedly a witch, who was arrested, accused of causing the disease. Now, it's up to them the task of escorting the so-called witch to a monastery where some friars will judge her, in the light of a book that doesn't exist anywhere else in the world.\r\n\r\nWhen you make a film with a historical background, at the very least, you should ask for the support of a consultant, someone who really knows History. No one should have the presumptuous arrogance to think they know everything, much less to take the public for an idiot, thinking that they will swallow everything that is shown to them! This film is an authentic case study in cinematic anachronism! How can the production admit the placement of clearly baroque decorative pieces in the midst of a medieval setting? How the hell can characters to disinfect their hands with alcohol if that was something totally unknown to medieval man? Since when is there a sea in Styria, if that ancient region is an inland part of present-day Austria and Slovenia? How can characters defect if this military concept simply didn't exist at the time?\r\n\r\nAnd if these small questions seem serious, there is something much worse: the Crusades were an entire religious, political and military effort that involved Christianity for about 300 years, but that effort had practically ended decades before the Black Death, and much before the dates that the film uses for the fights where the characters take part. There were, in fact, no serious crusades in the 14th century. The Battle of Artah, which is shown in the film, took place two hundred years earlier, in 1105. Therefore, the film deliberately delayed the Crusades two hundred years, in order to almost coincide with the Black Death, and the characters could participate in both situations! It's absurd! Another thing that simply didn't exist in the Middle Ages was the notion of a witch hunt! Of course, for medieval man, the Devil was a threat, and of course there was a relationship between diabolical art and the works and studies of many scholars, alchemists or sages who contradicted the religious knowledge. But the so-called witch persecutions only began to be more notable in the 16th century, framed in a clerical response to the Reformation and to ideas (all of them) that endangered the dominion that the Church had over knowledge!\r\n\r\nI pity Nicolas Cage and Ron Perlman. They are actors I respect, and seeing them participate in such a poorly made film is quite unfortunate, given that they have talent and are, as far as I've seen, almost the only positive things to highlight. Even if everything had been done in a way that respects history, the end of the film is so unbelievably stupid that it would spoil any previous effort. The rest of the cast, except for the two names mentioned, do not stand out in any way.", "created_at": "2022-09-08T14:54:03.925Z"}]