[{"movie_id": 7131, "review_id": "5afc6f95c3a3685fd1000415", "author_rating": 6.0, "review_text": "***Big Dumb Blockbuster Monster Fun***\r\n\r\nAlthough writer/director Stephen Sommers had an unexpected hit with 1999's \"The Mummy,\" he went overKILL with the 2001 sequel \"The Mummy Returns,\" a prime example of modern blockbuster dreck that's full of explosions and \"exciting\" things going on, but somehow is strangely boring. That's the problem with 2004's \"Van Helsing,\" although not as bad.\r\n\r\nTHE PLOT: In 1887 Van Helsing (Hugh Jackman) teams up with Anna (Kate Beckinsale) in Transylvania to fight Dracula, his three lovely but vicious brides, the Frankenstein monster, werewolves, vampire babies, etc.\r\n\r\nIt won't take long for the viewer to perceive that \"Van Helsing\" shouldn't be taken too seriously. It's a partial parody/homage of the classic Universal monster movies and part serious, just barely. Imagine \"Bram Stoker's Dracula\" (1992) with the over-the-top thrills of Indiana Jones and the flair of classic monster parodies like “The Vampire Happening” (1971) or \"Young Frankenstein” (1974) and you'd have a good approximation.\r\n\r\nThe film looks good, but there's too much CGI and some of the monsters look really cartoony, like Mr. Hyde and the werewolves. Others look quite good, like the flying vampire brides and Frankenstein's monster. As was the case with \"The Mummy Returns\" the film is strangely tedious despite all the manic happenings. Thankfully, there are worthy hints of depth, e.g. the Frankenstein monster and Anna. I wish there was more.\r\n\r\nSpeaking of Anna, Kate Beckinsale is definitely one of the highlights here as she looks stunning throughout in an amazing form-fitting costume and thigh-high boots seemingly appropriate for the late 1800s (speaking as someone who’s not even a Beckinsale fan). Josie Maran and Elena Anaya are also striking as two of Dracula's wives, Marishka and Aleera. Needless to say, excellent job on the female front. On the other side of the spectrum, Jackman is a great, masculine leading man, perfect for the role. Richard Roxburgh (Dracula), David Wenham (Carl), Kevin J. O'Connor (Igor) and Shuler Hensley (Frankenstein’s monster) are all entertaining or effective.  \r\n\r\nAt the end of the day, though, \"Van Helsing\" barely rises above the limitations of what it is: a big, dumb modern blockbuster with all its over-the-top trappings. Considering the $160 million thrown into it, it shoulda/coulda been better. The story needed time to breathe and less constant mania. The movie’s also over-long at 2 hours and 11 minutes. Still, it's better than \"The Mummy Returns\" and there's enough here to make it worthwhile, if you're in the mood for this type of fare.\r\n\r\nTHE FILM WAS SHOT in the Czech Republic, Rome and Paris with studio work done in Southern Cal and Orlando, Florida.\r\n\r\nGRADE: B-/C+", "created_at": "2018-05-16T17:51:17.030Z"}, {"movie_id": 7131, "review_id": "5dc74f99470ead00189475ab", "author_rating": 5.0, "review_text": "Absinthe Actioner!\r\n\r\nVan Helsing is written and directed by Stephen Sommers. It stars Hugh Jackman, Kate Beckinsale, Richard Roxburgh, David Wenham, Shuler Hensley, Elena Anaya, Will Kemp, Kevin J. O'Connor and Alun Armstrong. Music is by Alan Silvestri and cinematography by Allen Daviau.\r\n\r\nFamed monster hunter Van Helsing (Jackman) is sent to Transylvania to stop Count Dracula's (Roxburgh) fiendish plan involving the Frankenstein Monster and the Wolf Man.\r\n\r\nWell it was universally savaged by the pro critics and is considered a flop. Yet whilst understanding those things, it does for a reason hold above average ratings on the big internet movie sites. It did find a market (and continues to do so), it's like one big long MTV video, a sort of chaotic monster fun frolic in rock opera style. \r\n\r\nIt's effects laden, which is no great thing since they are shoddy, and the dialogue is often as cringe worthy as some of the accents are. Yet it's still a thrilling ride, a strap yourself in and run with it job, to be in the company of sexy lead actors in Gothic garb and devilish period surrounds.\r\n\r\nLoud and boisterous for sure, and tacky at times, but exhilarating all the same for those after some pure escapist carnage. 5/10", "created_at": "2019-11-09T23:45:29.600Z"}, {"movie_id": 7131, "review_id": "63097d39944a57007a64f790", "author_rating": 7.0, "review_text": "**Van Helsing doesn't deserve its early grave and should be resurrected for more fun adventures.**\r\n\r\nWhy do people love to hate such an enjoyable movie? Van Helsing falls much more in the adventure genre than horror but still has a little of the edge of a scary movie. Stephen Sommers' influence can be felt throughout with a lot of the same charm that made The Mummy (1999) so great. Van Helsing showcases many of the Universal classic monsters while building a shared universe that should have been explored more than once. With big names like Hugh Jackman and Kate Beckinsale, blockbuster effects, goofy fun moments, and all the adventure one could hope for. Van Helsing deserves way more love and a lot less disdain. Sure it isn't a perfect movie, but it was a much better attempt at a shared Monsterverse than Tom Cruise's The Mummy (2017) and was entitled to more.", "created_at": "2022-08-27T02:11:05.308Z"}, {"movie_id": 7131, "review_id": "64f568005f2b8d00c433c3d8", "author_rating": 6.0, "review_text": "Sorry, but this is just all over the place. A potpourri of myths and legends loosely connected with the famous vampire hunter that just don't gel at all. Doctor Jekyll, Mr Hyde, Victor Frankenstein and his monster all vie with Count Dracula for the attention of a really rather lacklustre Hugh Jackman in the title role. Kate Beckinsale sort-of recreates her \"Underworld\" role as she becomes his kick-ass sidekick. It's fairly action-packed but the scenes go on for far too long, the script is cheesy, the CGI just isn't great and the attempts at humour don't work well either.", "created_at": "2023-09-04T05:15:44.813Z"}]