[{"movie_id": 14139, "review_id": "5fa9f2735346610040ecf74c", "author_rating": 6.0, "review_text": "Oh my God the time traveler in this movie is an idiot! Do as the time machine guys says and DON'T GO ANYWHERE FOR ONE HOUR. But nope, he's gotta go meddle with the timeline and create multiple versions of himself and events. \r\n\r\nI'm a sucker for time travel flicks, and for a very low budget Spanish import, it was fairly entertaining, but check out the much better \"Predestination\" instead if you haven't seen it. ", "created_at": "2020-11-10T01:52:51.195Z"}, {"movie_id": 14139, "review_id": "603becee77b1fb004d0384d7", "author_rating": null, "review_text": "Timecrimes (2007), titled initially Los cronocrímenes, is one of the best time-travel movies available. Written and directed by Nacho Vigalondo, it was made in Spain and performed in Spanish. Reading English subtitles will not distract, however, as much of the movie is visual, and the pacing is not slow but methodical. \r\n\r\nThe story revolves around Hector and starts at his house, which he recently moved into. He sees something in the woods behind his house and goes to investigate. He is stabbed, and while running away from the mysterious masked figure, he enters a secret lab in the neighboring field. While hiding from the masked figure, he is transported back in time one hour and makes some amazing discoveries about himself. What must he do, and what is he willing to do, to restore the life he had before his accidental time-traveling adventure?\r\n\r\nThe story illustrates the complexities of time-travel and what having multiple \"you\"-beings in existence at once can lead to. Very entertaining and a definite \"much watch.\"", "created_at": "2021-02-28T19:20:14.988Z"}, {"movie_id": 14139, "review_id": "610c4ca8e61e6d00471b4004", "author_rating": 9.0, "review_text": "Before I say a word about the movie itself, let me advise you that if you haven’t already seen the preview for this movie, do yourself a favor and Don’t Watch It! Never have I known a preview to give so much away, and it it is particularly heinous in this case as it is a time travel movie, with plot shifts that should be experienced in real time, so to speak. I would have been some old mad if I had watched the preview first.\r\n\r\nBut on to the movie itself. This is a Spanish language movie with subtitles, but that didn’t detract from my enjoyment of it. It is nicely set up and cleverly done. At one point I guessed right about a little plot twist I saw coming, but there was much more I didn’t predict, which brings us back to how glad I am I didn’t watch that preview. I expect this was a low budget film and there aren’t many characters in it, so don’t expect a glitzy production with awesome special effects. It just tells the story. I did feel like Hector made a couple of really stupid decisions along the way, but I cut it some slack because without them we have a boring half-hour movie!\r\n\r\nOkay, I will stop talking about what happens so as not to possibly give anything away. If you like time travel stories as I do, and are intrigued by the anomalies and problems such fictional activity can cause, give this movie a try.", "created_at": "2021-08-05T20:40:08.115Z"}]