[{"movie_id": 466272, "review_id": "5d4a57a8439be10015910b94", "author_rating": 8.0, "review_text": "The movie isn’t for everyone, of course, but it’s a fun ride back to the past with fantastic performances, hilarious comedy and beautiful aesthetics. Tarantino is the one director in 2019 that can get huge names without people referring to his films as “that Leo film“, and I think that’s worth something whether you’re a fan or not. It’s rare for a film like this to be a mainstream release, and in the lacklustre year of 2019 I think it’s about time we got something in cinemas that's original.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-once-upon-a-time-in-hollywood-another-tarantino-classic", "created_at": "2019-08-07T04:46:32.959Z"}, {"movie_id": 466272, "review_id": "5d5e9465f263ba752c944e09", "author_rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nQuentin Tarantino is one of the best filmmakers of all-time. He has undeniable talent behind the camera, and his movies are fated to leave a mark in each year they’re released. In addition to that, he’s also an extraordinary screenwriter, as Once Upon a Time in Hollywood proves once again. His knowledge of the early decades of film is vast, so every feature he produces is always going to be filled with references to those “fairy tale” years. And that’s precisely what this movie is: a fairy tale in Hollywood, hence its title. Let me just leave this here right off the bat: I’m not going to address any controversy surrounding this film (namely, the whole Bruce Lee depiction and the Manson Family, in general), as I’m always fair and impartial to the movie I’m reviewing. Moving on …\r\n\r\nMy knowledge of the 60s isn’t that good. Obviously, I know the whole Sharon Tate story, as well as the famous Manson murders, but when it comes to actual films from that decade, well … Probably, I only know a few by name, a classic scene, or a memorable soundtrack. Tarantino uses his large runtime to place tons of references to that period, and that’s one of the reasons the first act of the movie drags. There’s a lot of time spent with characters just driving cars while listening to music (references in the songs), wide shots of the city as they drive by (references in the buildings), or even just playing an LP and dancing to it (reference in the songs, again).\r\n\r\nI understand that these mean something, but if they don’t develop the character in any way, then these are just Easter Eggs and have no impact on the actual narrative. The first hour or so is filled with sequences which sole purpose is to show how much Tarantino knows about that time, and there’s nothing wrong with it, as long as it tells a story. That’s the second issue I have with the first act: it takes too long to establish its characters, and there’s no apparent objective within the story. It feels like a person just strolling around with no destination, which in itself isn’t a bad thing. But if you put together repetitive sequences plus a story that no one knows where it’s going or how it connects to the only thing people are actually expecting (the Sharon Tate event), then you’ll bore the hell out of the audience (a lot of people constantly left my theater to get more food or something, and they weren’t in a hurry).\r\n\r\nNevertheless, from the moment we start understanding who Rick Dalton and Cliff Booth are, what they do, what they did, and what they want with their lives, then the film becomes incredibly captivating. It’s definitely a character-driven story. It’s a fairy tale where Rick tries his best to overcome his own personal issues to be the very best movie star, after being on an exponentially negative path. Cliff, as his stunt double, lives off of his buddy by doing everything he needs around the house and everywhere else. These two are inseparable, and their scenes are always filled with laughter and joy, even in the darkest moments. OUATIH works because of its beautifully-written characters.\r\n\r\nIf you don’t care about them, then you won’t enjoy the film at all. In addition to this, if you don’t know anything regarding the art of filmmaking, then you’ll probably hate it since it will become extremely dull. It’s one of those movies that anyone can like. However, for someone who knows and understands how films are made, it will always be a better time at the theater. You can love this movie, sure. But if you love filmmaking and you have knowledge of its techniques, you’ll love it even more. There are so many technical achievements worthy of appreciation that I can’t get to all of them, so I’ll just address two of my favorites. The first has to be the black-and-white flicks inside the actual film. Putting Leonardo DiCaprio acting on classic westerns with over-the-top performances is an absolute delight. Watching those features in a 4:3 black-and-white screen, filled with classic sound effects, and cheesy one-liners … Wonderful.\r\n\r\nThe second allows for my favorite scenes of the whole movie: the extensive one-take dialogues. I mean, 10 or 15-minute sequences where DiCaprio just gives it his all. This is how every single film should be done. There’s even a joke in the movie where Rick criticizes a particular type of filmmaking because they would film every character separately saying their lines and then editing them together. Unfortunately, that’s how most features are done today. Therefore, from watching a simple dialogue scene with DiCaprio and Julia Butters (a 10-year-old little girl!) to a bar sequence which belongs to a movie Rick is filming (this one even has Rick asking his lines, and the camera has to go back to its starting point), everything with no cuts whatsoever … What can I ask more from a director?!\r\n\r\nObviously, if this is a character-driven narrative, the cast has to be genuinely compelling. Leonardo DiCaprio, Brad Pitt, Margot Robbie … I mean, do I even need to explain how phenomenal they are? DiCaprio proves once again he’s one of the greatest actors of all-time. The ability that he has to put 200% in every single scene is unbelievable. I even started to tear up once his character is able to find his footing, solely due to the actor’s performance. The Oscar nom is guaranteed, let’s see about the win. Brad Pitt also has tons of nominations on his lap with an astonishing supporting display. He has a subtle performance, but it’s pretty incredible how much he can transmit to the audience by putting (apparently) so little effort. Margot Robbie doesn’t have that much screentime, but her character had the simple objective of showing how glamorous and dreamy an actress’ life could be at that time, so she didn’t exactly need to deliver her A-game.\r\n\r\nIt’s always good to see Al Pacino (Marvin Schwarz) on-screen, and I’m thrilled that Margaret Qualley (Pussycat), who I know from The Leftovers (one of the most underrated TV shows of the century), is finally getting some recognition. Technically, like I said above, it’s close to a masterpiece. It’s Tarantino, everyone knows what he’s capable of, but having in mind his most recent features, it’s a pleasant surprise and evidence of quality to the naysayers that he was able to produce a film with less bloody action. There are terrific demonstrations of great cinematography (Robert Richardson), and the editing is always impeccable in Tarantino’s features (this time due to Fred Raskin). The score is addictive, and it carries a very significant role in the movie. I would say that if Tarantino was able to shorten its runtime and control its pacing better, this would be a technically perfect film.\r\n\r\nAll in all, Once Upon a Time in Hollywood isn’t the best Quentin Tarantino’s movie, but it’s undoubtedly one of the year’s best. Filled with award-winning lead performances (second Oscar for DiCaprio, please), this character-driven story is packed with references to the 60s which will be the divisive point in whether people will enjoy the film or not. Its first act is slow and takes too long to set up its story, but from the moment it’s able to find its footing, it’s an entertaining ride. If you love filmmaking and you know the insides of the art, Tarantino delivers a near-perfect technical production. Its alternate ending to real-life events is meant to be controversial, but for me, it’s a vision of how everything should have happened if the world was fair or, indeed, a fairy tale … in Hollywood.\r\n\r\nRating: A-", "created_at": "2019-08-22T13:11:01.302Z"}, {"movie_id": 466272, "review_id": "5d625e316dea3a746b9457e8", "author_rating": 8.0, "review_text": "I'm not here to explain _Once Upon a Time In Hollywood_, just to enjoy it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-08-25T10:08:49.200Z"}, {"movie_id": 466272, "review_id": "5d7ee2a83c43440998a16f94", "author_rating": 8.0, "review_text": "***Tarantino’s revenge on the Manson psychos***\r\n\r\nIn the late 60s, Rick Dalton (Leonardo DiCaprio), a popular TV Western actor, finds his career taking a downturn and tries to recover with the encouragement of his kick-axx stunt double and best friend, Cliff Booth (Brad Pitt). Sharon Tate (Margo Robbie) & Roman Polanski are neighbors with Jay Sebring always hanging around (Emile Hirsch). Meanwhile the Manson Family nutjobs are lurking in the background, prepping to attack. \r\n\r\n“Once Upon a Time… in Hollywood” (2019) is Quentin Tarantino’s 9th full film and, for me, ranks somewhere in the middle of his oeuvre. It may not be as great as “Pulp Fiction” (1994) and “Django Unchained” (2012), but it places well with “Inglourious Basterds” (2009), “Jackie Brown” (1997) and “The Hateful Eight” (2015).  \r\n\r\nA famous director once succinctly defined a great movie as such: Three good scenes, no bad scenes. While the second part of this definition is debatable with \"Once Upon a Time... in Hollywood,” seeing as how the movie could've certainly been tightened up (there are some dull sequences), there's no doubt that it fulfills the first part. \r\n\r\nMy three favorite scenes are: The amusing satirical Bruce Lee confrontation; the great Spahn Ranch episode, which effectively creates an underlying sense of menace; and, of course, the entertaining hippie attack in the final act.\r\n\r\nThankfully, there are numerous additional gems: The friendship and respect of Rick and Cliff; the audacious flamethrower sequence; Rick's breakdown with the precocious girl actor (not actress); the beautiful women throughout; the great cast, including several celeb cameos; the entertaining soundtrack; Brandi, the pit bull; Rick's meltdown in his trailer; Rick finally pulling off a quality acting scene via ad libbing; George Spahn not remembering Cliff; everything (surprisingly) turning out to be precisely as so-and-so said; the allusion to what MAY have happened to Cliff's nagging wife (Rebecca Gayheart) on the boat; the way it should have turned out on that infamous night; and the heartwarming close,\r\n\r\nThe film runs 2 hour, 41 minutes, and was shot in the Los Angeles area.\r\n\r\nGRADE: A-", "created_at": "2019-09-16T01:17:28.508Z"}, {"movie_id": 466272, "review_id": "5df015331dbc880014ac2336", "author_rating": 6.0, "review_text": "Well, the last 15-minutes were great, the first 2.5 hours on the other hand was... uneventful. I have an interest in Hollywood, more from the 1980s though, so some of the slower scenes still kept my attention, but there's no real plot and minimal character development.\r\n\r\nThat said, DiCaprio and Pitt both give great performances and Margot Robbie of course had her moments, however I could only chuckle during the theater scene when she kicked her bare feet up. Okay, Quentin, lol. **3.0/5**", "created_at": "2019-12-10T21:59:15.846Z"}, {"movie_id": 466272, "review_id": "5e2f2840c56d2d00154e5a16", "author_rating": 9.0, "review_text": "“When you come to the end of the line, with a buddy who is more than a brother and a little less than a wife, getting blind drunk together is really the only way to say farewell.”\r\n\r\n‘Once Upon a Time In Hollywood’ is a chilled blast from the past told like a fairy tale. It’s both aimless and yet meaningful with the commentary on the new era in Hollywood. The movie pays tribute to old Hollywood, film making, Sharon Tate, stunt work, and actors. This is perhaps Tarantino’s most personal and mature movie his made, until the last 10 minutes (which I love) goes complete ape sh*t.\r\n\r\nI can’t think of any other director where the passion and love for movies is so transparent through Tarantino's craft. He’s such an old school film maker that he and Martin Scorsese are the last golden age directors, as every new release feels like an event. In this movie, Quentin presents 69’ Hollywood at its peak, as he remembers it from his childhood. He manages to rebuild classy LA thanks to the crew and creative team. \r\n\r\nBright neon lights, fashionable clothes, and late 60’s automobiles. There’s a couple of scenes where Cliff Booth (Brad Pitt), drives around LA and there are long shots that shows off the environment and it’s amazing the amount of detail and effort went into the setting - with Robert Richardson brilliant Cinematography bringing it all alive. \r\n\r\nLeonardo DiCaprio was absolutely excellent as the fading Western star, Rick F**king Dalton. Dalton, a self-centered, yet vulnerable actor that you both laugh and pity. I will often forget about DiCaprio comedic chops, something similar to Ryan Gosling. I also like the subtle stutter that’s sprinkled through out, which is sad when given some thought that it’s something he’s got to deal with. There’s a heartfelt scene where Dalton tells his young co-star about a book his reading and mid way through explaining the story he realises it mirrors his life, and breaks down in tears with me crying with him. Yep, I teared up in a Tarantino movie. Leo was the pulse of the movie.\r\n\r\nBrad Pitt was amazing as the deadpan and cool Cliff Booth. This is probably my favorite performance from him. Cliff’s main character trait is his strength and he demonstrates it multiple times, but leaves the scene before anything can escalate. The chemistry between Leo and Brad was electric. Pitt was the meat of the movie.\r\n\r\nMargot Robbie was an absolute delight portraying the late Sharon Tate. Despite her slim screen time, but whenever she has screen time, I couldn’t help but smile. I instantly fell in love with her and it’s painfully to think something so sweet and pure could be taken away from us by brainwashed zombies who don’t deserve a life, just a jail cell. I thought her portrayal in the movie was a beautiful tribute and how they handle her gives new life into her legacy. \r\n\r\nThere’s a great scene where Sharon Tate watches a movie in cinemas that’s she’s in, but instead of Margot Robbie re-creating those scenes, they just show the real Sharon Tate in the movie. Now people were left a bit confused over this decision, although it’s clear to me that erasing the real Tate out of the movie would be more disrespectful to her memory, so leaving her in is a touching tribute to her career and her work. Robbie was the heart of the movie.\r\n\r\nThe other supporting cast all did terrific with the little screen time most of them had. Kurt Russell makes a welcoming return as a character that I assume is Stuntman Mike from 'Death Proof' - either way still a welcoming presence. He’s also the narrator and I find it hilarious whenever he tries to pronounce Italian movie titles. Al Pacino was a blast to watch as the tight and yet colorful producer. Mike Moh portrayal of Bruce Lee may have sparked some controversy recently, but I thought he was entertaining regardless and I don’t really think it mocks his legacy at all. I mean, this is the same director who made a four hour movie honoring the legend. Margaret Qualley was crazy good as the hippie girl who’s brain washed into a cult family. It’s crazy to know that Damon Herriman has played Charles Manson twice in the same year and month for this movie and the TV show ‘Mindhunter’, which you should totally check out by the way.\r\n\r\nJulia Butters, Luke Perry, Timothy Olyphant, Dakota Fanning, Bruce Dern, and Damian Lewis - a stellar cast that did a stellar job.\r\n\r\nAfter letting the film sit for awhile, there’s so many memorable lines that I would often catch myself recreating just from memory after seeing it twice. There’s so many great moments as well. The lights of LA coming to life at the dust of dawn, or the suspenseful scenes that actually got me feeling tense watching it. Without spoiling anything, but the Spahn Ranch scene where the Manson family stares down a defenseless Cliff Booth as he tries to speak to an old friend was terrifying - reminds me of the opening scene of ‘Inglorious Bastards’, in terms of building up tension that you wait in anticipation to explode.\r\n\r\nStill, I think this is the best representation of the Manson family I’ve seen in any movie...by portraying them as absolute buffoons.\r\n\r\nAnd of course with it being a Tarantino movie, the music is lost treasure revived for a modern generation. Always fantastic and incredibly catchy. I can’t think of anything better than Cliff driving around LA with the song ‘Bring a Little Lovin’ playing in the background.\r\n\r\nOverall rating: I’ve seen this movie twice already and I still have a desire to watch it again. This is slowly creeping up to being my favorite Quentin Tarantino movie, but time will tell I guess.", "created_at": "2020-01-27T18:13:20.121Z"}, {"movie_id": 466272, "review_id": "5e8737093f7e1d001c5e2eb9", "author_rating": 9.0, "review_text": "I found this to be an excellent movie despite (or partly because of) major variance from the historic events it is based on.\r\n\r\nUp until watching this movie, I had just seen four Tarantino films, so I guess I am not on his bandwagon. But I really enjoyed two of them (Jackie Brown and Pulp Fiction). I can now say I liked Once Upon a Time in Hollywood just as much as I did those two movies. \r\n\r\nThe dialogue is sharp and the main characters are sympathetic enough so I cared what happened to them. The film is loosely based on actual events, with fictional characters thrown in and at least one major plot change that I won't give away. I think some of the most negative feedback I have seen about this film were from purists who didn't like the major change in the story. But I appreciated the change. If I want total accuracy, I would watch a documentary, but I want to be entertained, not depressed, and I was.\r\n\r\nAnd I plan to watch it again, not just for the sake of the story, but because maybe the second time through I will catch more of the movie references that are supposed to inhabit Tarantino's films.", "created_at": "2020-04-03T13:15:53.166Z"}, {"movie_id": 466272, "review_id": "62dfdf735aba320050d70002", "author_rating": 9.0, "review_text": "An entertaining movie filled with fantastic performances and gripping dialogue. Although, this movie is slightly directionless as I was 2/3rds of the way through the movie and had no idea where it was trying to take me. Despite that fact, I still was engaged and had a great time watching. The third act is so off the walls and crazy that it makes the entire slow burn of the film worth every second.\r\n\r\n**Score:** _88%_\r\n**Verdict:** _Excellent_", "created_at": "2022-07-26T12:34:59.345Z"}, {"movie_id": 466272, "review_id": "63bf7051df857c008926c6e2", "author_rating": 10.0, "review_text": "OK, I'm giving it 10 stars, not because it's a great film and not because it's one of QT's best films... but because compared to everything else out there today it is a Masterpiece.\r\n\r\nHowever, unfortunately, anyone that has seen all of QT's films, the ending is spoiled from the start purely on the basis that we understand how he treats history.\r\n\r\nAnd, unfortunately, for SOME people it is a very slow burner, but one with absolutely fantastic acting and directing. It's a slow burner that is a brilliant period piece, and it is a slow burner that is almost a love letter to classic Hollywood, so though it takes nearly forever for any real pay off, its a fine film to actually watch and one that maintains a quality of entertainment and leaves little clues peppered throughout of the coming payoff.\r\n\r\nAnd the clues are important as they are, essentially, little promises that the film is making for the finale.\r\n\r\nThe finally, however is so ultra-violent, so over-the-top that it's absolutely hysterical.\r\n\r\nIt's not his best film, but its certainly loyal to his others, gone however is the quick witted and quotable dialogue that marked his earlier films, but it is traded off for a sleek professionalism of a seasoned director.", "created_at": "2023-01-12T02:28:33.623Z"}, {"movie_id": 466272, "review_id": "6559199722931a01398e5f11", "author_rating": 9.0, "review_text": "“Is everybody okay?” “Well... the fuckin' hippies aren't. That's for goddamn sure.”\r\n\r\nI have watched this film in the cinema when it first came out in 2019, but didn’t think it was that great. After my second watch, 4 years and a good 550 other movies later, I liked it much better. \r\n\r\nOnce Upon a Time… in Hollywood is essentially a love letter to cinema, a fairytale filled with jokes and references and a deep supporting cast. The film spends most of the time hanging out with its characters; there are plenty of scenes were we can enjoy DiCaprio giving a hell of a performance, or Pitt being effortlessly cool. The fairytale ends in a hilarious climax—an unexpected twist in appropriate Tarantino style—and they lived happily ever after.\r\n\r\n9,0/10", "created_at": "2023-11-18T20:07:51.666Z"}]