[{"movie_id": 423108, "review_id": "60bce70dbb26020057a5dd78", "author_rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI've always questioned myself why The Conjuring Universe possesses more spin-offs than main titles since The Conjuring and The Conjuring 2 are, by far, the best films of the popular horror franchise. Looking at the numbers, The Nun holds the box office record, being the most successful movie of the saga financially, but ironically enough, it's also the most disliked film by both critics and audience members. The viral marketing campaign obviously hyped this spin-off to an unbelievable level of expectation, but it's still strange that it took five years to deliver another The Conjuring flick since both previous installments were tremendously profitable as well.\r\n\r\nWith James Wan out of the director's chair and without a screenplay credit, my expectations weren't exactly high. Wan is one of the main reasons why The Conjuring movies work so well. From his ability to generate an enormous amount of suspense to the actually scary atmosphere, Wan is definitely one of the best horror directors of the last decade. Therefore, replacing him would always be a challenging task. Michael Chaves directed The Curse of La Llorona, a generic, bland horror flick that didn't have a single surprising element. However, I did compliment Chaves' work with the horror sequences since I did find them somewhat effective. So, I was still feeling optimistic about The Devil Made Me Do It...\r\n\r\nIt's admittedly the weakest film of the trilogy, but it's still far from the awful Annabelle Comes Home or the hideous origin story about the famous nun. When it comes to the main titles, the exceptional production value is something all have in common. In fact, this latest flick is arguably the best-looking one. The horror sequences look stunning on the big screen, and the sound design is extremely impactful as always. It's worth remembering that this franchise doesn't waste hundreds of millions to make its movies, being a relatively low-budget cinematic universe, especially when compared to every other studio's massive sagas. Practical effects are always the go-to if possible, keeping the use of CGI to the minimum.\r\n\r\nActing-wise, it's also where these films triumph. Patrick Wilson and Vera Farmiga share palpable chemistry, deeply elevating their characters' emotional connection. At its core, The Conjuring features a love story between Ed and Lorraine Warren, ultimately being their grounded, convincing, loving relationship that keeps the viewers interested in the least \"based on a true story\" events. Both actors deliver remarkable performances, as does the legendary John Noble (The Lord of the Rings, Fringe) as a former priest. I didn't know about his casting before the movie, so I was genuinely surprised by seeing Noble on the big screen again. He's absolutely phenomenal, as expected, and quite creepy as a mysterious character.\r\n\r\nEveryone else is decent enough, but I don't find any other interpretation worth noting. Unfortunately, this is as far as I can go compliment-wise. The primary narrative surrounding the actual case that gives the name to the film is nowhere near as interesting as the stories told in the previous The Conjuring movies. The case itself doesn't have much to tell, so the majority of the film rests on following the beloved couple going on side quests as detectives. Eventually, the clues found are connected to the main plot, but overall, David Leslie Johnson-McGoldrick's screenplay isn't that captivating. Despite the predictability and formulaic horror elements, there's a rather enjoyable \"twist\" to the whole \"demon possession\" routine that marks the entire franchise.\r\n\r\nThe biggest disappointment is something I feared would happen without James Wan at the helm. The once terrifying, suspenseful atmosphere during the effective, creative jumpscare sequences now gives place to the generic build-up that viewers experience in some of the cheapest horror movies of today. Due to a character's health issue, the tension levels are constantly high for this person in particular, but for most of the runtime, the general environment lacks the essential scary feeling. The jumpscares look lazy and too obvious, a cliche that The Conjuring films fought hard to distance themselves from. In addition to this, it's a much darker movie than the rest in terms of lighting.\r\n\r\nFinally, I have mixed feelings about the ending. Without spoiling it, of course, it's similar to A Quiet Place Part II in the sense that two different sequences need to be edited together seamlessly so the viewers can easily follow what's happening without losing the tension and suspense. One of these scenes is particularly shaky, repetitive, and overly dark, which definitely left me a bit disappointed. Peter Gvozdas and Christian Wagner's editing is really good, though. Michael Burgess' cinematography offers a couple of gorgeous shots, and Joseph Bishara's score maintains the ominous tone of the franchise. James Wan is clearly missed, but Michael Chaves didn't do a bad job.\r\n\r\nThe Conjuring: The Devil Made Me Do It is undoubtedly the weakest installment of the trilogy, but it's still quite far from the awful level of the worst films of the horror franchise. Boasting the trademark terrific production value of the saga, Patrick Wilson and Vera Farmiga deliver outstanding lead performances as the only two emotionally compelling characters. Overall, every element is lesser than the previous The Conjuring movies. From the less scary atmosphere to the unimaginative, generic jumpscares, Michael Chaves isn't able to replicate James Wan's tremendous levels of suspense and tension, despite a brilliant opening sequence. David Leslie Johnson-McGoldrick's screenplay focuses on many storylines indirectly connected to the main plot, ending up with a not-that-interesting narrative that doesn't quite justify the main title. Some technical attributes, mainly the editing and cinematography, as well as sound design, compensate with some entertainment. In the end, I still recommend it to fans of the cinematic universe and lovers of the horror genre.\r\n\r\nRating: B-", "created_at": "2021-06-06T15:17:33.318Z"}, {"movie_id": 423108, "review_id": "60bff44cd7fbda006f960d95", "author_rating": 7.0, "review_text": "Decent enough third entry that gets a little goofy at the end but I liked it, though not quite as good as the first two. I'd say Michael Chaves did a fine job directing utilizing some of the tricks James Wan did in the previous entries (like a one-shot scene going through the house early on). But like the others, the biggest plus is with Patrick Wilson and Vera Farmiga who were again wonderful together. **3.5/5**", "created_at": "2021-06-08T22:50:52.542Z"}, {"movie_id": 423108, "review_id": "60e74eaa6ee3d7007546adfa", "author_rating": 6.0, "review_text": "So I watched the movie and what started off well, end up like a half way Romance movie. It had it's up and downs and then peaked and fell flat. Expected abit more for a series that is this good usually.", "created_at": "2021-07-08T19:14:50.157Z"}, {"movie_id": 423108, "review_id": "6189995b69d28000449a9de9", "author_rating": 7.0, "review_text": "Full Analysis at https://www.spotamovie.com/ - **Intro** - Released in June 2021, “The Conjuring: The Devil Made Me Do It” is an American-British production that lasts for one hour and fifty-two minutes. It belongs to the genres of religion, crime, horror and drama, and it’s part of the “Conjuring Universe.” The trial of Arne Johnson inspired the movie. The film is not precisely the reproduction of what happened. But we need to remember that it’s a movie, and fiction is mandatory for our entertainment. And the film is engaging. It provides moments of pure adrenaline and pieces of beautiful cinematography and photography. Although it is not perfect, we think it deserves your time because God, daemons and exorcisms, apparently, are with us, believe it or not. Let us explain it to you. - **The Story** - In July 1981, Ed and Lorraine Warren, a couple who specialised in paranormal investigations, were helping the Glatzel. Their eight-year son David was experiencing unexplained and disturbing symptoms, which were consuming David and the whole family. So the Warren decides that it’s time for a real exorcism, and they go to document it.\r\nBut something terrible and unexpected is going to happen, and also the Warren get surprised. In fact, the event degenerates into an escalation of violence, murder, and occult rituals. The case became a worldwide event because, for the first time in history, the defence lawyer brought in front of the court the fact that a demon possessed the killer. Will the lawyer succeed with her defence? What is that Ed and Lorraine are going to prove?And what is your opinion about this surreal but true story? - **Full Analysis at https://www.spotamovie.com/the-conjuring-the-devil-made-me-do-it-2021-movie-review-and-analysis/**", "created_at": "2021-11-08T21:40:43.645Z"}]