[{"movie_id": 136835, "review_id": "55c208569251410f2a0049f5", "author_rating": 4.0, "review_text": "Generic Guff.\r\n\r\nNo Good Deed is actually not a bad film as such, it sticks rigidly to a formula and has all the requisite requirements - however ridiculous - for a home invasion thriller, and does it competently. The problem is that it has absolutely nothing new to appeal to anyone who has been watching movies through the 80s and 90s.\r\n\r\nThe 1990s was particularly a thriving hot-bed for such thriller fare, where some unhinged nut-case - male or female - would impose themselves upon some amiable good person's life, and then unleash mentally distorted hell upon them. Sam Miller's film is just a lazy retread of what has gone long before. Only he and his backers think that shifting the focus to black characters somehow makes it more vibrant. It doesn't.\r\n\r\nIdris Alba is a fine actor (in great physical shape as usual), and Taraji P. Henson is a more than effective actress, but the turgid screenplay on offer here does them no favours, where even an intended \"big reveal\" is hamstrung by the familiarity of it all. If one is fortunate to be of a youthful enough age and lucky enough to be viewing this thriller format for the first time? Then this works, it absolutely does. The more mature film lovers, however, will be jaded to the point of sleep status. And no, that's not meant to be patronising. 4/10", "created_at": "2015-08-05T12:57:58.491Z"}, {"movie_id": 136835, "review_id": "6052abfdc433ea00292f5ee7", "author_rating": 7.0, "review_text": "I thoroughly enjoyed <em>'No Good Deed'</em>.\r\n\r\nSure it isn't anything incredible and is rather simple, but it delivers on action and brings tension. It also features very good performances Idris Elba (Colin) - somewhat iffy accent aside - and Taraji P. Henson (Terri) - two actors I enjoy. The plot is simple but it's executed well, it doesn't even have the chance to drag either due to the short 83 minute run time.\r\n\r\nNot much more to note. A suitably entertaining flick from 2014 by Sam Miller, who also directed Elba in the outstanding television series <em>'Luther'</em>.", "created_at": "2021-03-18T01:25:17.562Z"}]