[{"movie_id": 36648, "review_id": "5a626649c3a36836b9005bfa", "author_rating": 4.0, "review_text": "It might (barely) have gotten one more star if it hadn’t been the third one in the Blade trilogy. As such it has some mighty good movies to live up to and that it doesn’t.\r\n\r\nThis time David S Goyer took to both write and direct the movie. I guess he should have stuck to script writing or something. The action scenes are not too bad. However, that’s all there is. Just a string of actions scenes barely strung together.\r\n\r\nThe worst offence of them all is Dracula. When I first learned that they brought in Dracula as the chief nemesis I thought that sounded cool. Wrong! Apart from a fairly cool look when he get really pissed off the film’s portrayal of Dracula is a joke. It’s an insult to the Dracula legends.\r\n\r\nTo sum it up, it’s 2 hours of not too bad action but a disappointment as a Blade movie.", "created_at": "2018-01-19T21:42:33.439Z"}, {"movie_id": 36648, "review_id": "5b01046e92514109c9006a9f", "author_rating": 8.0, "review_text": "After watching all 3 of the Blade movies in a row, it gives a lot of perspective. The first was before all the Marvel boxoffice stuff took off, the second was having some Reaper stuff which was cool, but Trinity was the best in the series for sure. It needs better writing as Snipes has attested. We can tone down the Deadpool a bit and have more Wesley being a badass and not trail off into side projects. Whistler's family origins type things as well as Hannibal King's, but focusing more on Blade because he seriously can carry the whole film like he should have been doing since day 1.", "created_at": "2018-05-20T05:15:26.125Z"}, {"movie_id": 36648, "review_id": "5c842807c3a36839d4d284d2", "author_rating": 2.0, "review_text": "When a horror movie has to resort to vampire dogs, you know they're completely out of ideas. That's the least stupid part of Blade Trinity.", "created_at": "2019-03-09T20:54:31.083Z"}, {"movie_id": 36648, "review_id": "5d624cc17f6c8d0016ee0bfa", "author_rating": 4.0, "review_text": "Blade: Trinity completes the Blade trilogy in cinematic grandeur, and brings about Dracula, an inevitable source in almost every Vampire franchise ever conceived of.\r\n\r\nIt was refreshing to have the \"Elder\" ruling-class/vampire-nation-lord/shadow-council thing dropped, since they were in both Blade and Blade II, and in both movies they were completely killed off, and ignored the existence of each other. Instead we have a group of happy-go-lucky vamps, who have one way or another made a mark in the world. You never find out how they managed to buy a skyscraper and a museum's worth of ancient art, but I'd imagine they had quite a lot of time to get their finances in order.\r\n\r\nAnyway, deal is these vamps, right? Danica Talos (Posey \"Queen of the Indies\" Parker; Scream 3, A Mighty Wind), her brother Asher Talos (Callum Keith Rennie; Case 39, The X-Files: I Want To Believe), Jarko Grimwood (wrestler Paul \"Triple H\" Levesque), and their offsider vampires go to Syria in order to dig up the slumbering Dracula (Dominic Purcell; Straw Dogs, Blood Creek)... Or Drake... Or Dagon... They keep changing their mind. Anyway, after Dracula kills a bunch of them, he eventually agrees to join the team after he hears about the defender of humanity Blade (Wesley Snipes; New Jack City, Chaos) whom he believes may be a worthy adversary. Blade in turn gets together with the vampire hunting cell called \"Nightstalkers\", led by Abigail Whistler (Jessica Biel; the The Texas Chainsaw Massacre, Cellular) and Hannibal King (Ryan Reynolds; Waiting..., Buried) and together they continue the war for humankind.\r\n\r\nWith me so far? No? Well you should be, because this plot is about as run of the mill as they get. While I'm on that, it's worth pointing out that where Blade's saving grace was this awesome mythos and story, and totally failed at character-ing, Blade: Trinity had fantastically written characters, in a sort of non-event storyline. Where Blade II blended them, making it the best in the series. Trinity was okay, but it lacked a lot of the engaging elements from the previous two films.\r\n\r\nI think in part this is because the film is meant to sort of cater to the cinema audience. After the success of Blade II, it's like they knew that people were going to go to the theatre for Trinity so they tailored the film accordingly. You know, just little things, cheesy lines come across in a way more badass way on the big screen. Montages can get tedious on the computer, but can often blow you away in theatres. Explosions and action and CG backflips always translate better in cinema than on DVD. Unfortunately, I own the DVD, not a cinema. Maybe the goddamn vampire pomeranian they threw in would've seemed less ridiculous if I'd seen Trinity when it came out in theatres, but I doubt it.\r\n\r\nI'd like to bring up the issue of names. Not that people have unbelievably crazy names in these films, it's the' Super Hero genre after all, of course they've got stupid names! I love it! But the Blade series seems to be populated entirely by characters with the \"Saying Names\" fetish. It's all \"Hannibal King! Die\", \"Blade! There you are\", \"Whistler! Come save us.\" \"Drake! It's him\" and gets pretty unbelievably dramatic rather swiftly.\r\n\r\nIt'll be interesting to see how Ryan Reynolds fairs. This Marvel film came out quite a while ago, since then he's played Wade Wilson in Origins: Wolverine, Green Lantern for DC Films, he was the protagonist in R.I.P.D. He's set to return to the X-Men universe for Deadpool. I suppose if Chris Evans can get away with playing The Human Torch in Fantastic 4 and Rise of the Silver Surfer then move on to playing Captain America in The First Avenger I don't see why Reynolds can't pull it off. Hannibal was great, Ryan Reynolds is great but I'd be fine to see this be the end of it all here.\r\n\r\n-Gimly", "created_at": "2019-08-25T08:54:25.447Z"}, {"movie_id": 36648, "review_id": "5f27c1e99f37b000352671f4", "author_rating": 4.0, "review_text": "TRINITY is not a good movie, instead it is a solid \"Blade\" movie -- meaning, if you are not already a fan, don't bother. Snipes no longer plays Blade for humor, as he did in the first Blade", "created_at": "2020-08-03T07:51:05.189Z"}, {"movie_id": 36648, "review_id": "644eff656dc6c002e5ee20a0", "author_rating": 8.0, "review_text": "All 3 Blade movies are awesome in my opinion. This one is my favorite out of the series. It introduced at the time a different type and kind of vampire. This is movie is freakin' awesome.", "created_at": "2023-04-30T23:53:09.076Z"}, {"movie_id": 36648, "review_id": "64f56582f29d66010008e5bb", "author_rating": 5.0, "review_text": "\"Blade\" (Wesley Snipes) is now alone - surrounded by enemies bent on his destruction. Then, as luck would have it, he meets up with the \"Nightstalkers\", led by former vampire \"Hannibal King\" (Ryan Reynolds) and \"Abigail\" (Jessica Biel) who might just have developed a virus that could rid the world of vampires forever. To combat this threat, the vampires raise their king \"Drake\" (Dominic Purcell) and the battle lines are drawn in the ultimate fight for survival. Snipes is OK as a our leather-clad, mean, moody, hero but actually doesn't seem to feature so much - most of the action is driven by Reynolds who, whilst initially quite sarcastic and witty, rather overplays his hand and soon becomes just a bit too attitudinal; and Biel who appears to be on remote-control for much of her efforts. Purcell makes for quite a decent baddie, as does Parker Posey as \"Danica Talos\", though at times you do wonder if you should be shouting \"boo, hiss\" at the telly. There is plenty of fast-paced action throughout, but all in all this is just one, really pretty derivative sequel too many.", "created_at": "2023-09-04T05:05:06.148Z"}]