[{"movie_id": 12509, "review_id": "5fe25b440d417e003c4c0211", "author_rating": 7.0, "review_text": "_**Downer biography starts weak, but becomes, um, artistic… and moving**_ \r\n\r\nAbstract expressionist Jackson Pollock (Ed Harris) is a struggling artist in New York City in the early 40s when he meets his future wife Lee Krasner, a fellow artist (Marcia Gay Harden). They move to the far end of Long Island where he finally catches a break, but alcoholism threatens his life. Jennifer Connelly shows up in the last act. \r\n\r\n“Pollock” (2000) is an honest biography covering the final fifteen years of the artist’s life from 1941-1956. It was a long-term passion for director/star Ed Harris to bring to the screen. \r\n\r\nThe film starts weak with Pollock being portrayed as a troubled artistic weirdo. While I have no doubt that this is true-to-life, the opening act fails to capture the attention of the viewer. What’s worse, there’s an unintentionally amusing scene reminiscent of the Seinfeld episode \"The Visa\" where Jerry pretends to be morose and disturbed, which unexpectedly turns on George’s Asian girlfriend. This “meh” opening is probably why the film failed at the box office.   \r\n\r\nThankfully, the story perks up when the couple moves to a remote area on Long Island. At one point a journalist asks Pollock how he knows when he’s finished with a painting. He insightfully responds, “How do you know when you're finished making love?” This showed that Jackson loved his work and equated creating art to making love. He was a troubled soul, very much so, but painting was his escape, his bliss. It was Pollock’s area of genius and, indeed, his peculiar art is stunning and somehow aesthetically pleasing. I was so moved I wept.\r\n\r\nUnfortunately, alcohol was his downfall.\r\n\r\nIf you don’t mind downer biographies of artists, like “The Doors” (1991) and “Big Sur” (2013), check this one out. There are inspiring moments amidst the melancholy.   \r\n\r\nThe movie runs 2 hours, 2 minutes and was shot in New York City and East Hampton, Long Island. ADDITIONAL CAST: Jeffrey Tambor, Bud Cork, Val Kilmer and John Heard.\r\n\r\nGRADE: B", "created_at": "2020-12-22T20:47:00.986Z"}]