[{"movie_id": 8988, "review_id": "54fac1b79251417b26000ed3", "author_rating": 6.5, "review_text": "Extended Enlistment.\r\n\r\nKimberley Peirce’s (Boys Don’t Cry) movie proved to be controversial in military circles. The story is about the stop-loss procedure used by the American military, a kind of small print tactic that can extend a soldiers service should their country deem it so. Sergeant Brandon King (Ryan Phillippe) returns home from the Gulf Wars with his mentally scarred pals fully expecting to get back to a domestic life without blood and brains dominating his personal landscape. Yet he is called back in for another tour of Iraq under the stop-loss procedure, something he rebels against and goes AWOL. He has done two tours already, surely he has earned his retirement?\r\n\r\nIt starts off in electrified fashion, the horrors of the war in Iraq bursting from the screen as a firefight ensues, character traits are introduced to us, we are left in no doubt that the soldiers at the end of this tour of duty have seen it all. Pic then settles into a sort of cross between a road movie and a PTSD portrait awash with emotional strangulation. Peirce and her co-writer Mark Richard have honourable intentions, but too much is given over to stereotyping, of stock clichés and the bold signposting of character’s futures. They carefully paint King as a model soldier, this is definitely not about cowardice, but come the cop-out finale it’s evident that the narrative suffers glaring inconsistencies and confused messaging.\r\n\r\nOn the bonus side is the performances of the youthful cast, where some fluctuating accents aside, Phillippe, Channing Tatum and Abbie Cornish are superb, while Joseph Gordon-Levitt makes a weakly written part crackle with pained emotion. Of the elders, most are underwritten, which is a shame when you got the likes of Ciaran Hinds in the cast. We are left as a whole with a film that is as uneven as a dusty road in Tikrit, not only in narrative structure, but also in actual facts as regards the procedures of the American military, both on the written documents and execution of duty in battle.\r\n\r\nIt was a flop at the American box-office and it’s not hard to see why, but it still has merits. Even as the familiarity tries to breed contempt, the anguished reality of a soldiers life, during tours and post service time, strikes a mightily distressing chord. 6.5/10", "created_at": "2015-03-07T09:15:35.187Z"}]