[{"movie_id": 10198, "review_id": "5699f4c3c3a3686f9f0007a7", "author_rating": 7.0, "review_text": "After the third attempt to watch this film, I finally got through the first 15 minutes and am glad I did. There always seemed to be something to stop me from getting too far in. So, what did I think?\r\n\r\n\"Is it entertaining?\" Yes. For the most part, the songs were enjoyable and the animation was fine. The pacing could be improved somewhat, mostly by eliminated 2-3 songs. 2 out of 3\r\n\r\n\"Is it interesting?\" Yes. The character backgrounds and the story development were easily above the average kids movie. The plot was a tad predictable and the moral seemed to meander some. 2 out of 3\r\n\r\n\"Is it memorable?\" Somewhat. The most unique thing were the character types. While the animation was fine, some of the human facial expressions were just off enough to be slightly creepy. I am glad most of the movie had some of the main characters as animals. 1.5 out of 3\r\n\r\nStart with 1.\r\n1+2+2+1.5=6.5\r\nI will round up for the overall enjoyment of the time spent.\r\n7 stars.", "created_at": "2016-01-16T07:44:03.519Z"}, {"movie_id": 10198, "review_id": "5cfe30090e0a261fbbca2525", "author_rating": 5.0, "review_text": "I have some questions, I have some comments, both of which may come across as moderately hostile, but I still enjoyed _The Princess and the Frog_. I'm not too sure why though. I won't be coming back for the soundtrack, which is generally one of the biggest appeals of these Princess deals, and certain things are so *yawn* Disney that you can call them before you press play, but at least it's a little different.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-06-10T10:25:13.405Z"}, {"movie_id": 10198, "review_id": "5f3c0e91ef48890037d63d57", "author_rating": 7.0, "review_text": "Solid.\r\n\r\n<em>'The Princess and the Frog'</em> makes for a good time. It's nothing incredibly different from the studio's other animated princess films, but still produces what you'd want from a film of this type.\r\n\r\nAnika Noni Rose works well in the lead role as Tiana, while it's pleasant to hear John Goodman as Big Daddy; albeit not as a major character. Keith David (Shadow Man) and Oprah Winfrey (Eudora), meanwhile, are welcomed cast members.\r\n\r\nThe music is rather forgettable, though the (traditional) animation is nice. There's a few moments where it drags its heels slightly, but the pacing is mostly fine. It all comes down to whether you enjoy princess stories, given how predictable and formulaic they are. I'm nonplussed about them, to be honest.\r\n\r\nMid-range Disney, for me.", "created_at": "2020-08-18T17:23:29.890Z"}, {"movie_id": 10198, "review_id": "6352ea3f84448e007f77e8a6", "author_rating": 7.0, "review_text": "When the eligible bachelor \"Prince Naveen\" arrives in New Orleans, he suffers quite a character change! It seems that the evil \"Facilier\" - straight out of \"Live and Let Die\" (1973) - has offered his butler the chance to swap places with his master, and his master is now a little green frog. As everyone knows, only true love's kiss can reverse the impact of a curse like this and so it falls to aspiring waitress \"Tiana\" to firstly be convinced that this talking amphibian is actually worth kissing, then when that tried and tested solution merely converts her into another green frog, they must both enlist the help of a trumpeter alligator and an enthusiastic and brave firefly to head into the deepest part of the bayou where an old blind witch might have the solution to defeat this blackest of voodoo magic. Thing is, though - the clock is ticking and the evil \"Faciler\" has enlisted his allies from the underworld to ensure that their predicament becomes permanent! This is a really jolly and characterful family adventure with some splendid and detailed animation and a fun score from Randy Newman that frequently gets the toes tapping. I could have been doing with a bit more of the nasty \"Facilier\" but I suppose Disney don't like too much of the baddie featuring in their movies - which is a shame as they are almost always the best! I saw this recently again on a big screen and it has much more of the traditional cartoon elements to it than many of the others made by this studio in the noughties. Short, sweet and entertaining.", "created_at": "2022-10-21T18:51:43.834Z"}]