[{"movie_id": 257440, "review_id": "57c8b17c92514148e90009fa", "author_rating": 5.0, "review_text": "> When the cops and the bad guys hunting the same duo.\r\n\r\nA simple crime-thriller involving the father-daughter duo running away from the cops and thieves. It was based on the novel of the same name, but kind of feels like another version of Nicola Cage's 2012 film, 'Stolen'. In this the father at any cost protects his daughter. He was actually a heist planner and when his latest bidder was murdered after successfully accomplishing the heist, he and his daughter was targeted by some unknown men. So they're on the run, but how it will solved are told in the rest of the film.\r\n\r\nTo me the film was okay, but the same old stuffs with the new cast and locations and a bit altered storyline. So nothing new in it, but somewhat entertaining. That's the point you know remade, rebooted or copied, all matters if it is boring. Anyway, I was not expecting a masterpiece. But with a concept like 'heist designer', the film was utterly wasted for running and chasing cliché stuffs. Instead, it should have had made a better film by focusing on the main character's special gift.\r\n\r\nThere were none great stunt sequences, but there were some black humours in it, since Vince Vaughn is not known as an action hero. But the character and the story suited him very well and the other side Hailee Steinfeld was not bad either. The film is not worth recommending, but if you choose it, I won't stop you as it wasn't going to hurt anybody.\r\n\r\n5/10", "created_at": "2016-09-01T22:53:48.050Z"}, {"movie_id": 257440, "review_id": "57c8b1cfc3a3685bec000a67", "author_rating": 5.0, "review_text": "> A Cool kind, but suddenly feeling the real life pressure!\r\n\r\nAnother teen comedy-drama, precisely to say a coming-of-age theme based on the novel of the same name. It is not from the big production house, but the well known faces make it a worth a watch and their performances were too not bad. The tale of a teen tomboy girl Lucy, whose father visits home often who works in Canada and her mother is an easy going type. It's about a time for her sexual exploration and the first choice is her best buddy Kenny. But quickly the things around changes which forces her to opt the life she wants and what follows is how it all shapes up before bringing a curtain to the narration.\r\n\r\nI felt like wanting to give it a better rating, at least it deserves a decent respect, but narration had lots of up and down. That does not matter, even for how a tale begins, but the ending should have been a better one where I slightly disappointed with it. Sarah Bolger looked solid, totally one man show you could say. Maybe that is how the story was designed, but that did not stand a chance to impress me, because I thought it leaned excessively on her alone leaving other characters less developed. Anyway, it could also be said like this that it was her story which lacked the good support.\r\n\r\nIt is not just a coming-of-age film, but when you look at how the story ends, that's kind of self-discovery. Maybe the girl was caught between the teenhood and adulthood, especially in the climax it leaped forward too long. The hardest part is the R rating for a teen film, though there were none nudes, even in the sex scenes, but the film topic itself highly influenced by those like experiencing and moving-on in the life. So the film is not worth going after for a watching by someone's recommendation, only when you get an opportunity without much options you could try it.\r\n\r\n5.5/10", "created_at": "2016-09-01T22:55:11.505Z"}]