[{"movie_id": 619592, "review_id": "5efb1bccd6d64d0036cb05b7", "author_rating": 1.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nOne of the worst movies I've seen in my entire life! No, I'm not going to ease you in. I literally spent ninety minutes of my weekend feeling frustrated, angry, stressed out, and genuinely annoyed at how many aspects Force of Nature is horrible at. This is an atrocious film in every imaginable way. There's no redeeming quality or a little tiny positive note. I'm going to be as straightforward as I can. I'm not going to waste the usual time I need to write a review, this one will be written in less than fifteen minutes.\r\n\r\nFirst of all, the narrative. This movie is about a group of thieves that attempt to steal something from a building during a storm. It's a Category 5 hurricane, and all the film shows is rain. There are no windows breaking, doors flying, or any sort of indication that the weather is dangerous in any way. Every single character is plainly stupid. There's no way of describing them more accurately. Everyone makes astonishingly dumb decisions, based on the most illogical and unrealistic scenarios.\r\n\r\nThe action lacks everything it must have: energy, choreography, good editing, and everything else you can think of. A character dies, the camera goes in for a close-up, and the eyes are still freaking moving. That's the level of amateurism Force of Nature displays. The sound design comes from the past century, with punches, kicks, and gunshots sounding like I'm watching an anime. The editing is terrible throughout, but it's far from grabbing the spotlight with so many baffling stuff.\r\n\r\nEven the cast delivers laughable performances. Emile Hirsch (Cardillo) has the worst emotional range I've ever seen in an actor. His expressions are cringe-worthy in almost every single situation, independently of how serious the latter is or not. I have no idea what Mel Gibson (Ray) is doing in such a wretched flick. The \"plot armor\" that protagonists regularly possess is taken to a whole new level. Usually, they survive a 99%-chance of dying scenario, and the audience simply accept it. But the \"bad guys\" in this movie are ridiculously portrayed, almost like the actors are interpreting caricatures of their characters.\r\n\r\nThroughout the whole film, I felt continuously frustrated. Every single minute is packed with story inconsistencies and truly irritating characters. I've never felt so uncomfortable watching a movie before. I never wished so hard for a film to finally end. I was moving around on my couch and giving these nervous chuckles because I was honestly feeling extremely annoyed at what I was watching. Michael Polish and Cory Miller should be ashamed of what they did. This is an embarrassment for any filmmaker. Believe me: I could easily write 2000+ words about this piece...\r\n\r\nForce of Nature is indeed a force to be reckoned with... for the \"Worst Movies I've Ever Seen\" contest. From the baffling character decisions to the illogically absurd narrative, Michael Polish directs an appalling film packed with excruciatingly embarrassing acting, horribly dated sound design, a nonsensical attempt at creating a catastrophic atmosphere, awful editing, impressively lousy action, and last but not least, one of the worst screenplays ever put to screen, by Cory Miller. The level of amateurism is genuinely jaw-dropping. I've never felt so uncomfortable watching a heist movie. I'm feeling incredibly frustrated, bitter, annoyed, and unsure how a film like this was made possible. Please, stay away from this abomination. Even if you're interested in watching it just to know how bad it actually is, be careful. Because you're not going to feel that well after watching Mel Gibson fall to this level.\r\n\r\nRating: F", "created_at": "2020-06-30T11:02:36.058Z"}, {"movie_id": 619592, "review_id": "5f19e7b8a199a60038ff98ca", "author_rating": 6.0, "review_text": "Passable suspense-thriller ruined by an unsatisfying, and predictable, ending, not to mention all the smiles in the final scene given what transpired before. Even so, some of the fights were okay and it's a basic story but for the most part I was entertained.\r\n\r\nI think this is Gibson's first foray into DTV territory and at least shows some charm (disclaimer here for separating art from artist cliche) playing grisly ex-cop. Will be interesting to see if he shows the same commitment in his next DTV flick. Also, I suspect this role was originally offered to Bruce Willis but seeing he would have to get wet, passed...\r\n\r\nOh, as for Kate Bosworth, she's working her way through playing the daughter of washed-up actors. First was Life on the Line with John Travolta, the Heist with Robert De Niro and now with Gibson.\r\n\r\n**2.75/5**", "created_at": "2020-07-23T19:40:40.439Z"}, {"movie_id": 619592, "review_id": "60ef1226cf1afd00753440cb", "author_rating": 2.0, "review_text": "From Mel Gibson's worst fake smokers cough I have ever heard to every line delivered by Emile Hirsch making me cringe, this is one of the worst action/crime films I have ever had the displeasure of sitting through. I was about to take a hiatus from films but I'll have to watch something else because I can't end on this horrendous note. Seriously, I didn't know a mainstream film with this many stars could be this bad. \r\n\r\nTrust my review: don't waste your time on this. You will regret it.", "created_at": "2021-07-14T16:34:46.786Z"}, {"movie_id": 619592, "review_id": "62c5cbbc6f6a99004d851546", "author_rating": 4.0, "review_text": "I vaguely recall a news story some years ago about the discovery of an whole load of old masters in the room of a gent who had hoarded them after the end off WWII. Maybe that is what inspired this otherwise shockingly weak and far-fetched detective thriller. The cringingly poor Emile Hirsch (\"Cardillo\") is posted to Puerto Rico after a fatal accident killed his cop-girlfriend. It is here, teamed up with \"Jess\" (Stephanie Cayo) that they become embroiled in a heist, in the midst of an hurricane, that sees them held hostage by some ruthless robbers in search of a room full of art in an ordinary residential block. Luckily, though, retired officer \"Ray\" (Mel Gibson) is on hand to help them survive. What Gibson is doing in this is anyone's guess. It is a poorly paced, shockingly derivative affair that has all the hallmarks of a college project, just with a bit more cash. The dialogue is puerile and lacks style or humour, indeed the whole thing just lacks... There is the slight menace of a beastie kept behind a very securely locked door - but sadly we have to wait til the very end before that comes into play. Too little too late. There are millions of movies out there if you are bored. This one - don't bother.", "created_at": "2022-07-06T17:51:56.855Z"}]