[{"movie_id": 503919, "review_id": "5e1c63820e29a20015f7c024", "author_rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI love weird movies. The seemingly awkward moments, the apparently nonsensical ambiguity, or simply the pure WTF sequences... All of these leave me deeply captivated by what the story and its filmmaker are trying to transmit to their viewers. The Lighthouse is the most recent addition to the group of psychological horror films that will make you think, \"what the hell am I watching?\" Nevertheless, this is one of the most accessible \"weird flicks\" since most of the story is easily explainable.\r\n\r\nTherefore, I hope this Robert Eggers' movie gets a successful home release. Usually, the general public heavily dislikes ambiguous films. Nowadays, people want everything at the palm of their hands before they even watch the movie (aka trailers). So, a film about two lighthouse keepers who go crazy, where dozens of scenes apparently make no sense (they do), can fail to catch the viewers' attention. However, it found mine. Filmed in black-and-white and with a 1.19:1 aspect ratio (almost squared), Eggers delivers a gorgeous-looking piece of cinema.\r\n\r\nPeople tend to (wrongly) associate the use of black-and-white with \"old movies,\" but it's really just another color palette. For example, Blade Runner 2049 and Mad Max: Fury Road use the color yellow in such a beautiful, eyegasmic way. Color can affect us emotionally, psychologically, and even physically, often without us becoming aware. The Lighthouse's black-and-white establishes the film's mood from the very beginning. A very somber, sad, dark environment, filled with creepy seagulls, and brutal weather conditions.\r\n\r\nIf I try to imagine the movie with color, it's not going to be very different from what it actually is. There's no sun, only tons of rain, wind, and waves. It's always cloudy, and inside the house, it's still dark and cold. So, even if Eggers decided to film with color, black, grey, and white would be the predominant tones either way. That's why the decision to make this film in black-and-white is so perfect. Every shot is dripping with visual beauty. Amazing wide shots of Robert Pattinson working like a slave, getting hit by the relentless weather, all accompanied by a haunting score which elevates every sequence.\r\n\r\nIn my point of view, it's a story about how solitude can make anyone run away from reality. Lack of human contact never contributes to a good way of living. Imagining a better life or literally run away to a remote place with a non-stop job to make you forget who you are or what you did, are not going to help anyone overcome what is, in fact, a personal issue. It's a narrative given to many interpretations, so no one is right or wrong. Depending on our life experience and on our distinct personalities, each and every one of us can have a different perspective and understanding of what this movie tells through the Eggers brothers' brilliant screenplay.\r\n\r\nOne thing is certain: Robert Pattinson and especially Willem Dafoe should be considered for the awards season. However, this film is too weird and ominous to be awarded any nominations, unfortunately. Dafoe is 64-years-old, and he crawls on the muddy ground, he gets hit with rain and literal sh*t in the face, besides delivering a versatile performance. Both he and Pattinson offer a dynamic range of acting, going from absurdly hilarious to intensely dramatic displays. It's probably Pattinson's best performance to date, but Dafoe shines as a crazy old ex-sailor.\r\n\r\nTheir accents are perfect, and Dafoe's ability to \"sing\" complex (linguistically speaking) sea poems for whole uncut takes is worthy of every single Oscar. That's something I wasn't expecting: there's a lot of long takes that become even more impressive due to the actors' undeniable talent. It's been a long time since I had to read subtitles to actually understand what the characters were saying, especially Dafoe. Besides the strong accents, the dialogues are extraordinarily intricate and wordy, which definitely captures my attention since I have to be twice as focused.\r\n\r\nIncredible cinematography, great editing, and a subtle but powerful score. It's a shame if people ignore this movie's existence. It's not getting released in my country, so I'll try my best to make people see it. Unfortunately, it's being ignored by every major award ceremony, which is pretty unfair, having in mind it's one of the best films of 2019. I don't have a single issue with it. Some people might not enjoy its ambiguity or its slow pacing. Still, I genuinely love how everything falls into place, culminating in a shocking, suspenseful, and tense third act that makes the massive build-up worthy of merit.\r\n\r\nAll in all, The Lighthouse is one of my favorite movies of 2019. It's definitely going into my Top10, and way up there. Filmed in beautiful black-and-white with a claustrophobic aspect ratio, Robert Eggers delivers a story about loneliness and isolation that takes the weirdest, craziest route. It's one of those WTF films that will leave everyone thinking about it. I love its ambiguity, even if most of its story is pretty accessible. Packed with suspense and tension, mostly due to the excellent cinematography and the brilliant decision to use black-and-white to set the dark, cold environment. Robert Pattinson delivers his career-best performance, but Willem Dafoe steals the spotlight with an Oscar-worthy crazy display that will be ignored due to the known genre bias. It's tear-inducing hilarious at times, but powerfully dramatic as well. I have not a single complaint, and I love it more the more I think about it. Please, watch this at home if you get a chance. Don't miss it!\r\n\r\nRating: A+", "created_at": "2020-01-13T12:33:06.633Z"}, {"movie_id": 503919, "review_id": "5e2f28c0326c1900181bcd45", "author_rating": 10.0, "review_text": "“𝐾𝑒𝑒𝑝𝑖𝑛 𝑠𝑒𝑐𝑟𝑒𝑡𝑠, 𝑎𝑟𝑒 𝑦𝑒?”\r\n\r\nTime to spill the beans…’The Lighthouse’ is a masterpiece! I loved loved loved loved it! I loved every minute of it. One of my favorite movies of 2019 and I honestly don’t think anything can top it. A slow descent into madness that creeps into your subconscious and won’t be leaving anytime soon.\r\n\r\nFrom the very first frame, I immediately knew this was going to be special. I was hooked throughout until the end credits. \r\n\r\nWillem Dafoe and Robert Pattinson both deliver career defining performances. They play off each others insanity beautifully. I could tell just from the accents and dialect that plenty of homework went into making an authentic portrayal of the time.\r\n\r\nRobert Pattinson is fantastic as a quiet and private lighthouse keeper that witness the madness slowly unfolding, but also feeds the audiences curiosity on revealing the strange happenings on the island. Pattinson is a chameleon when it comes to portraying characters. \r\n\r\nWillem Dafoe, on the other hand, was mesmerizing as the old sea dog captain with a love for farting. His long and insane monologues are the main highlights, because it was so electrifying to watch it was hard not be captivated. He’s strict and often unpredictable, but once you see it, you won’t forget it. \r\n\r\nI hope Robert Eggers continues making horror movies in the future, because right now he’s one of the best living directors working today. The slow-burn tension and lack of conventional scares seems to be his trademark so far. Every choice he made was so carefully thought out and the results is masterful. According to Eggers, they actually built a lighthouse from scratch and everything we see, including the weather, is genuine. Even if some tricky was used, it was so seamless I couldn’t tell what was fake.\r\n\r\nI loved how the movie was shot; the dim black-and-white with the claustrophobic aspect ratio, giving it the appearance of a silent film born like a German expressionism - something you would’ve mistaken for a 1920/30’s horror folklore. Perfectly captures the time period and the overall dread. You really do feel cut off from the outside world and abandoned on this spectral-like island, and this black sheet of cloud strongly looming over the two men. A dark force in all directions, unseen but very eerie. The cold and heartless weather is a character itself. A big bully with salty intentions. \r\n\r\nI adored the use of lighting through out, as the only light source is either natural light during daytime or candle lit lanterns, which cast many shadows that adds to the unease. There’s some gorgeous looking cinematography on display here. Seriously, even as am writing this right now I can memorize every single frame of this strange nightmare of a film. Absolutely breathtaking.\r\n\r\nWhile the movie is mainly horror, but there is comedy sprinkled throughout that was actually pretty hilarious. Everything from Dafoe farting and some creative insults the characters would often spit at each other, which would later expand into long monologues that I sat back and watch in awe with a stupid grin on my face, because how something so silly can be so poetic. Never have I seen a movie that perfectly balances more than one genre so fluently. You can laugh at the moments where it’s suppose to be funny, but also take it seriously whenever it’s suppose to be taken seriously, which is sometimes all in one scene. The writing from Eggers is so excellent. \r\n\r\nAfter only one viewing there was a lot I could easily dissect in terms of interpretation. There's masculinity and Greek mythology imagery that demonstrates a striking sense of power. There’s also a certain idea of sexuality being a sacred thing and the frustration it may bring. Or maybe it’s just a simple story about two guys on a rock getting drunk and then getting even drunker while holding each other until they drift off to sleep. \r\n\r\nOverall rating: One of the best looking horror comedies of 2019.", "created_at": "2020-01-27T18:15:28.898Z"}, {"movie_id": 503919, "review_id": "5e353e0498f1f1001803c185", "author_rating": 10.0, "review_text": "I was worried that my enormously high expectations for 'The Lighthouse' would set me up for inevitable disappointment, but to my relief and awe, it somehow exceeded them. This is an extraordinary, baffling, hypnotic, maddening, hilarious, disturbing, disorienting, arousing, absolute mindfuck of a film, drenched in mud and sweat and salt and booze and shit and semen and piss and blood, primal screams of rage and terror, the laughter of madmen and the sobs of the damned, the cry of seabirds and the roar of the sea and the cataclysm of gods and men at war. It haunts you long after it is over, swills in your mind like an aged whisky, and in the days since seeing it, I can't tell you how desperately I want to dive back in again. After delivering arguably the greatest horror film so far this century, Robert Eggers has created another insane American masterpiece, the kind of film dreams and nightmares are made of. It was worth every single second of the wait.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-lighthouse-robert-eggers-delivers-another-staggering-american-classic", "created_at": "2020-02-01T08:59:48.091Z"}, {"movie_id": 503919, "review_id": "5e48b7022d93750019a7bdc9", "author_rating": 8.0, "review_text": "_**A superbly made film about madness, isolation, alcohol, a pissed off one-eyed seagull, and farts**_\r\n\r\n>_But, as we near'd the lonely Isle;_\r\n\r\n>_And look'd up at the naked height;_\r\n\r\n>_And saw the lighthouse towering white,_\r\n\r\n>_With blinded lantern, that all night_\r\n\r\n>_Had never shot a spark_\r\n\r\n>_Of comfort through the dark,_\r\n\r\n>_So ghastly in the cold sunlight_\r\n\r\n>_It seem'd, that we were struck the while_\r\n\r\n>_With wonder all too dread for words._\r\n\r\n- Wilfrid Wilson Gibson; \"Flannan Isle\" (1912)\r\n\r\n> _Lighthouses are endlessly suggestive signifiers of both human isolation and our_ _ultimate connectedness to each other._\r\n\r\n- Virginia Woolf; _To the Lighthouse_ (1927)\r\n\r\n> _The isolation spins its mysterious cocoon, focusing the mind on one place, one time, one rhythm – the turning of the light. The island knows no other human voices, no other footprints. On the Offshore Lights you can live any story you want to tell yourself, and no one will say you're wrong: not the seagulls, not the prisms, not the wind._\r\n\r\n- M.L. Stedman; _The Light Between Oceans_ (2012)\r\n\r\nA manic fever dream fusing Greek mythology, Jungian psychology, and German Expressionism with Herman Melville and H.P. Lovecraft, by way of George Kuchar, Mike Kuchar, and Guy Maddin, _The Lighthouse_ is about isolation, insanity, competitive masculinity, alcoholism, and farting. The second film from writer/director Robert Eggers, who exploded onto the scene with the masterful _The VVitch: A New England Folktale_ (2015), _The Lighthouse_ was co-written with his brother, Max Eggers, and is very loosely based on the \"Smalls Lighthouse Tragedy\" (1801), in which one of the two assigned keepers died, and it was over four months before relief could be sent. By the time someone did land, the still-living keeper had been driven completely insane. A bizarre film in just about every way, from its glorious visual and aural design to its grandiose acting to its jet black humour to its wonderful ambiguity to its avenging angels/seagulls, if you thought _The VVitch_ was somewhat inaccessible, then you'll most likely despise every second of _The Lighthouse_, insofar as its subtlety, slow pace, and narrative abstruseness will surely frustrate those who prefer their horror in the mould of jump-scares and chainsaw-wielding escaped mental patients. However, if you favour the cerebral, difficult-to-define, and always slightly off-camera terror that was the foundational principal of _The VVitch_ and films such as Daniel Myrick and Eduardo Sánchez's _The Blair Witch Project_ (1999), Jennifer Kent's _The Babadook_ (2014), and Emma Tammi's _The Wind_ (2018), or if you enjoy the oppressive dread of classic German Expressionist films such as Robert Wiene's _Das Cabinet des Dr. Caligari_ (1920), Fritz Lang's _Der müde Tod: ein deutsches volkslied in 6 versen_ (1921), and F.W. Murnau's _Nosferatu, eine Symphonie des Grauens_ (1922), then you'll find much here to appreciate.\r\n\r\nIn the late 1890s, Ephraim Winslow (Robert Pattinson) and Thomas Wake (Willem Dafoe) arrive on an outcropping off the coast of New England to begin their four-week rotation manning the lighthouse. Bombastic, spirited, and flatulent, Wake is a veteran – a former sailor who's been a wickie for the last fifteen years. Withdrawn and taciturn, Winslow is new to the job, having previously worked as a logger in Canada. Wake assigns Winslow the menial tasks – cleaning the floors, emptying the chamber pots, carrying kerosene containers, repairing the exteriors, oiling the gears in the basement – whilst he himself attends to the Fresnel lens, telling Winslow that he is never, ever to approach it, and not to concern himself with its maintenance. And so things go for a while. However, soon enough, Winslow begins to have strange experiences – a one-eyed seagull starts pestering him; he has visions of a mermaid washing up on the shore; he thinks he sees Wake standing in front of the light, completely naked; he has dreams of erotic tentacles; he has a vision of Wake as a barnacle-encrusted titan; he imagines wading out into the water amidst hundreds of logs, which close over top of him and drown him. Although he's unnerved, the four weeks pass without too much incident, but on the night before their relief is due, the wind suddenly changes, and the island is hit by a violent storm. The following morning, their ferry doesn't arrive, and with no way of contacting the mainland, the duo attempt to pass the time attending to their duties, whilst their drinking becomes ever more excessive, their loathing of one another ever more pronounced, and their hold on sanity ever more tenuous.\r\n\r\nThe first thing that jumps out at you in _The Lighthouse_ is the aesthetic. _The VVitch_ was a good-looking movie, no doubt, but _The Lighthouse_ is a rarefied masterclass in visual and aural design. Opening with the old monochrome Universal logo, the importance of Damian Volpe's incredible sound design is indicated immediately, as before we see anything, we hear the wind blowing and a foghorn rumbling in the distance. That horn is omnipresent throughout the film, and to say it gets under your skin is an understatement. You know the siren from the _Silent Hill_ games that sounds right before the town transitions from the Real World to the Otherworld? Well, imagine that sound bellowing out every minute or so for an entire film. It's unsettling, it's disturbing, and it makes it impossible to ever really acclimate yourself to this strange _milieu_. There's only one sequence in which we don't hear the foghorn, the pivotal opening scene of the third act, and the silence is oppressive – it's one of those instances where you don't realise how loud something was until it suddenly goes quiet and you're left with a ringing in your ears.\r\n\r\nThe sound design is matched by the stunning monochrome visuals. Working with cinematographer Jarin Blaschke, who also photographed _The VVitch_, Eggers shot _The Lighthouse_ on 35mm black & white Eastman Double-X 5222 celluloid in the relatively unheard format of 1.19:1. Usually, if a filmmaker shoots in a non-widescreen format, they use Academy ratio (1.37:1), as seen in films such as David Lowery's _A Ghost Story_ (2017), Paul Schrader's _First Reformed_ (2017), and Jennifer Kent's _The Nightingale_ (2018). On the other hand, the use of 1.19:1 (sometimes called Movietone) is extremely rare, especially in modern films, and for good reason – it was a transitional format that was only used briefly during the shift from silent cinema to sound (1926-1932). And that is exactly why Eggers and Blaschke chose it. Yes, they do match form to content insofar as the nearly square format traps the characters within the frame to an even greater degree than 1.37:1 would have, thus enhancing the already oppressive claustrophobia of the lighthouse itself. But where the genius in choosing this format really comes to light is when one considers to what the film aspires. This is a folktale, a fable from a by-gone age, so what better way to present that fable than by replicating the way the film would have looked had it been made during the early years of sound filmmaking? At the same time, although shot with modern cameras, Blaschke used period-specific Baltar lenses and an off-cyan filter custom-made by Schneider Filters to more accurately emulate the look of late 19th-century photography. Taken together, the black & white images, the square frame, the lens design, the patina, and the haunting sound design all work in glorious tandem to create the sense that the film is a disturbing artefact, an antique vestige from a different era, into whose very DNA dread has burrowed.\r\n\r\nOne also has to praise Craig Lathrop's production design. The lighthouse used in the film wasn't an existing structure, but was custom-built to scale on Cape Forchu, an outcropping off the coast of Nova Scotia. However, you'd never know it. Most of the interiors were shot on soundstages, but all exteriors were shot on Forchu. And Lathrop has imbued every inch of the building, both inside and out, with an existentialist dread – from the industrial hell of the gears in the basement to the almost Eden like peace of the lantern room high above, from the cramped and crude bedroom to the squalid kitchen. Malevolence stalks every nook and cranny.\r\n\r\nEggers also does something interesting with the narrative itself. I've seen some critics refer to Winslow and Wake as unreliable narrators, and whilst such critics are on the right track, to call the characters narrators is, in strict narratological terms, inaccurate. Both characters are, in fact, focalisers, to use the term coined by Gérard Genette – the world is filtered entirely through their perspective, but they don't narrate. Indeed, although we shift from one character to the other, meaning there is a narrative presence at the extradigetic level, Eggers never leaves their perspective, nor does he present any kind of omniscient or overt heterodiegetic narration; we're imprisoned within their perspective for the duration of the film. Also important here is the use of what Seymour Chatman refers to as \"fallible focalisation\" (he actually uses the term \"fallible filtration\", but filtration and focalisation are the same thing). The story is one of madness, and it's abundantly clear from early on that neither man is a reliable witness, so everything filtered through their perspective (i.e. the whole film) could be tainted or unreliable (which is why critics erroneously refer to the duo as unreliable narrators). As things begin to fall apart, this sense becomes ever more prevalent – for example, in an important scene near the end, we see Wake do something, and in the next scene, when Winslow confronts him about it, a confused Wake points out it was actually Winslow who did it. Is Wake lying? Is Winslow projecting his own actions onto his companion? Who exactly is misleading who here? And if there's madness in this tale, where does it land – Winslow, Wake, the audience, or all three of us? It's a wonderful use of a defamiliarising technique which works to keep the audience constantly on edge and constantly second-guessing everything they see insofar as we know that some, none, or all of it could be the figment of a failing mind.\r\n\r\nThe dialogue is also beautifully written. Whereas in _The VVitch_, Eggers used pre-colonial Early Modern English lifted from court transcripts of actual witch trials, here he doesn't take the dialogue from anywhere specifically, but there's an obvious debt to writers such as Sarah Orne Jewett, who often wrote about whalers working off the southern Maine coast. Winslow's accent is based on a Maine farming dialect, while Wake's is based on that of Atlantic fishermen, and although their idiolects are more recognisable to our modern ears than those used in _The VVitch_, inflections and sentence structure ensure we never forget this is a tale of the past – for example, Wake declares, \"_I'm a wickie, and a wickie I is_\" and during an argument about his cooking, he asks Winslow, \"_Ye is fond of me lobster ain't ye?_\" And needless to say, the acting is immense, with both men turning in career-best work. Whilst Pattinson slowly morphs from a docile and subservient worker into something more assertive, aggressive, and altogether more sinister, Dafoe goes as big as he can, in a performance that wouldn't be out of place in classic German Expressionism.\r\n\r\nThe film's storyline is slight enough as to suggest several themes without really going too heavily into any of them. For example, one could certainly read Winslow and Wake's relationship as homoerotic, maybe a study of the suppression of desire. Paranoia is also never far from the surface, nor is the societal construct of masculinity, particularly as manifested in competitiveness, with Eggers mocking male bravado and posturing. Another reading would be that the film is an allegory for class struggle _á la_ J.G. Ballard's _High Rise_ (1975) – the lighthouse represents society; the lantern room high above is the upper class, with Wake doggedly protecting the room, literally locking Winslow out; meanwhile, the bowels of the lighthouse is the working class, with Winslow spending much of the film performing menial tasks assigned him by Wake. Alcoholism is also omnipresent – from Wake telling Winslow that \"_boredom makes men into villains_\", and that alcohol is the only medicine for it, to the duo progressively drinking more and more each night, until they run out of rum, and so try to mix turpentine and honey, so dependent have they become on the numbing effects of drink.\r\n\r\n_The Lighthouse_ definitely isn't for everyone. It's challenging and rewarding in equal measure, but it does ask much of the audience, with meaning to be found between the lines, rather than within them. Eggers does some of the legwork, but he still leaves the audience with a distance to go. Personally, I loved every crazy minute of it – whether it be the rising sense of dread, the unrelenting tension, the oppressive suspense, the fierce battle of wills, the consuming paranoia, the descent into insanity etc. There's a lot that has gone into making this film what it is, both in terms of crafting the folkloric story and in the more mechanical sense of putting the finished film together – it's an aesthetic marvel in pretty much every way. Thick with mood and atmosphere, _The Lighthouse_ proves that _The VVitch_ was no fluke.", "created_at": "2020-02-16T03:29:06.401Z"}, {"movie_id": 503919, "review_id": "5f0443c18ec4ab003240506e", "author_rating": 10.0, "review_text": "Click here for a video version of this review: https://youtu.be/qvEDkWC9MMk\r\n\r\n“I’ve got no idea what I just watched, but I loved it” - those were my exact words as the credits rolled on _The Lighthouse_.\r\n\r\nI’d been chomping at the bit to watch this ever since seeing the first trailer, and recently it’s finally became available for rent on YouTube. Starring Willem Dafoe and Robert Pattinson? What’s this weird looking square framed black and white movie all about I hear you say? Here’s the offical description:\r\n\r\n_Two lighthouse keepers try to maintain their sanity while living on a remote and mysterious New England island in the 1890s._\r\n\r\nWith the same director as _The VVitch_ at the helm you get a very good idea of the madness that is about to ensue. And oh boy does madness ensue. In what might be the most perfectly cast movie ever, Pattinson and Dafoe were absolutely the right choice for these roles. The characters they play as we meet them are somewhat stereotypical - Dafoe is the weatherbeaten man of the sea, and Pattinson is the guy with a murky past who might be trying to escape from something. Their relationship goes from dislike to begrudging respect to...well it’s hard to say what happens after that...\r\n\r\nThe artistic decision to film in black and white on 35mm film in an almost square ratio heightens everything. It feels claustrophobic, the characters stare directly at you at times, the framing is perfect, it’s a a sight to behold. This film reminded me of everything from silent films of the 1920s through to the creep-fest known as _Begotten_. Strap yourself in for a ride that will make you clench your teeth at the beautiful destruction. \r\n\r\nAs you can probably tell, I loved this movie. It won’t be for everyone as it’s very much an arthouse piece and doesn’t follow the standard norms for film, but I encourage everyone to give it a shot. You’ll either love it or hate it. As for me, I’m just gutted I never got to see this in a theatre because I reckon it would have blown my mind.", "created_at": "2020-07-07T09:43:29.731Z"}, {"movie_id": 503919, "review_id": "5f5c79684f33ad0039f4c691", "author_rating": 8.0, "review_text": "A cinematic portrayal of the human condition that is as unpleasant as it is intriguing.", "created_at": "2020-09-12T07:31:52.146Z"}, {"movie_id": 503919, "review_id": "602b32202e2b2c0040505714", "author_rating": 8.0, "review_text": "Involving a storm, a small bit of cabin fever and a touch of lovecraftian mermaid mythos... comes 2019’s feature The Lighthouse directed by Robert Eggers written in part by Maxwell Eggers originally loosely based off of Edgar Allan Poe’s last known bit of writing of basically the same name. Taking out the elements of Poe This film follows two men one older one younger played by Robert Pattinson and William Dafoe in some very different roles... Cut off from the public during the storm psychological and about the downward spiral and the madness that follows... when reality gets mixed with loneliness, greed And blatant disrespect of nature... Filmed in black-and-white like The Witch which is Robert Eggers previous feature as it  is slow in its pacing so it will not entirely be a film for everyone you’ll either love it or hate it but I prefer things that are in black-and-white over color for to me it breathes an atmosphere And latitude of another time In moments but I also feel like Robert Pattinson certainly shed by now his almost laughable sparkled-Sparkly Vampire renown role to this ragamuffin rough look hewn to his character as well as William Dafoe’s craggy pirate captain-ish look as well stellar performances by both... plus turn up the sound as you experience the films awesome sounds the film is eerie and well shot I actually think this film is better than The Witch I’m glad that I picked this film up I recommend it for other people as well and wonder what others think about the film...", "created_at": "2021-02-16T02:46:56.935Z"}, {"movie_id": 503919, "review_id": "6116644be54d5d005d874bed", "author_rating": 10.0, "review_text": "To me this is a perfect film. The emotional ebbs and flows of the narrative wash over you and one moment you're laughing then dread overwhelms you. It's expertly crafted both technically and artistically. Even the sound design lingered with me for days afterward. \r\n\r\n\r\nIt's not a film for everyone. The narrative is far from typical, the dialogue is a heavy dialect, and it's one you have to be absorbed in. It's not a passive movie, it's one that challenges you to immerse yourself in it. But, if you're into something truly unique you will find this film to burrow deep into your psyche.", "created_at": "2021-08-13T12:23:39.130Z"}]