[{"movie_id": 234004, "review_id": "5726a2e5c3a3683841003416", "author_rating": null, "review_text": "A popular PlayStation-era game is the frivolous foundation for the kiddie sci-fi action-oriented animation adventure **‘Ratchet & Clank’** that makes it a playful stamp on the big screen. This kid-friendly space saga, armed with its beloved reputation in the world of gamer groupies, could be deemed as the junior-sized ‘Star Wars’ for the minor sect. Why would the mini movie-goers not find this big screen adaptation an appealing space-aged actioner worth its weight in innocuous, escapist gold? After all, what is not to like about the roguish and heroic feline-looking creature Ratchet (otherwise known as a ‘lombax’) with the Buck Rogers attire as well as the cute clanking companion in the green-eyed, robotic Clank (channeling the impish and lovable R2D2 from that certain George Lucas-directed worldwide cinematic sensation from yesteryear?).\r\n\r\nOur galactic good guys look to save the universe and the avid youngish video game fanatics will eat this fun-loving fantasy up with moon dust soup. Unfortunately, **‘Ratchet & Clank’** musters up a tepid by-the-numbers frenzy that will predictably hold the munchkins’ imaginative attention. As for others, the hyper hairball and his trusty tin can tag-along get lost in the shuffle of this somewhat serviceable but sluggish cartoon pie-in-the-sky popcorn pleaser for the little ones at large.\r\n\r\nDirectors Kevin Monroe’s and Jerrica Cleland’s spotty spunk captures the loose lunacy and spirited sauciness on occasion where even the movie’s poster promises to ‘kick some asteroid’. It is too bad that the breezily bland storytelling cannot overcome its conventional confines as one may get a more stimulating kick engaging in the actual video game than viewing this kinetic crater kiddie showcase without much distinction or creative plucking pop. Basically, **‘Ratchet & Clank’** is safe and generic but never grabs the challenging aspects behind its one-note presentation in good versus evil–something that may in fact be a clichéd overload even for those tykes out there begging for these amiable planetary protectors to bring something fresh outside of its gaming inspiration.\r\n\r\nThe youthful mechanic Ratchet (voiced by James Arnold Taylor who also provided the voicing duties in the video game) is a dreamer with heroic plans to join the prestigious glory-seeking Galactic Rangers. Specifically, the Galactic Rangers are known for their courageous crime-fighting activities on Ratchet’s home planet. Ratchet’s lofty ambition to hook up with the Galactic Rangers is somewhat alarming to his boss and mentor Grimroth (John Goodman) who is not too thrilled with his employee’s/protege’s questionable expectations. The Galactic Rangers are currently recruiting for skilled members to collaborate with them and expand the elite unit. For the star-eyed Ratchet this is a golden opportunity to become a starry-eyed superhero reaching for acceptance and self-importance.\r\n\r\nIn the meanwhile, a treacherous tyrant known as Chairman Drek (Paul Giamatti) is the galaxy’s menacing madman and one of the main reasons why the Galactic Rangers are nursing the thoughts of growing their interstellar roster of crime-stoppers. Drek is out of control as he has been destroying planets left and right. Naturally, the dastardly Drek needs to be stopped in his hideous mission to castrate and conquer. Drek’s calculating cronies include his second-in-command robot Victor (Sylvester Stallone) and ominous scientific aide Dr. Nefarious (Armin Shimerman from TV’s “Star Trek Deep Space Nine”). They are instrumental in creating killer robots whose sole purpose is out to eradicate the celebrated do-gooder Galactic Rangers. Of course this begs the question: does Ratchet really know what he is getting into regarding his heralded aspirations to become a Galactic Ranger?\r\n\r\nIt would take a pint-sized turncoat from Drek’s robotic renegades in the form of defective and rejected Clank (voiced by David Kaye) to escape the mechanical baddies and whisper the devious goings-on to the noble Galactic Rangers. The initial meeting of Ratchet and the British-sounding Clank is incidental but when they thwart the sneak attack initiated by Drek’s tin-plated terrorists the pair are invited into the applauded team’s inner circle courtesy of the tandem’s rescuing efforts. Galactic Ranger head honcho Captain Quark (Jim Ward) has his doubts about the eager talented twosome but the other members embrace Ratchet and Clank with open arms. Still, the common goal is to eliminate Drek and his horrible henchmen Dr. Nefarious and Victor from orchestrating the ruination of their jeopardized universe.\r\n\r\nAlthough showing some spunk and off-balance wittiness,   **Ratchet & Clank** feels notoriously recycled as it obviously borrows from other animated fodder while tapping into the all-too-familiar Star Wars mantra that features a young adventurer from a distant planet thriving to save the galaxy from sinister forces. There are colorful action sequences and gun-toting shenanigans that will entertain the impish kiddies as they engage in the elaborate space battles. Both leading lads Ratchet and especially the merry-minded, metal-plated Clank will come off as an adorable yet oddball duo to behold. The villainy of Drek and his devious drones will probably spark the giddiness in the wide-eyed youngsters. The common sense behind Ratchet & Clank is to arm the movie’s presentation with the feel and feisty-oriented flavor of its video game blueprint. If that is the case then why bother serving up a family fantasy on the big screen if it cannot separate occasionally from its vintage gamer blueprint?\r\n\r\nCuriously, the fast-paced hit-and-miss jokes and the spry-looking makeup of this kid-approved cosmic caper is a passable revelation for a movie representing a fourteen-year old video game from yesteryear. Also, the notable names behind the characterizations in **Ratchet & Clank** seem to give some measure of breezy joy to their on-screen roles. Celebrity voices instilled in the fired-up female warriors consist of the likes of Rosario Dawson’s Alaris and Bella Thorne’s Cora which evoke the recent reminiscences of Star Wars: The Force Awakens’ Daisy Ridley’s heroine Rey. Consequently, all these factors mentioned in the rousing yet rudimentary Ratchet & Clank boils down to just another basic and tiresome “good-against-evil” gimmick for the chorus of the kid-watching crowd.\r\n\r\nIt is a given that **Ratchet & Clank** will be a spell-binding spectacle to the young viewers but for the rest of us let’s hope that a nostalgic rerun of Josie and the Pussycats in Outer Space will suffice for our adequate needs blocking out the fire-power crafty cat and his diminutive autotron sidekick.\r\n\r\n**Ratchet & Clank (2016)**\r\n\r\nFocus Features\r\n\r\n1 hr. 34 mins.\r\n\r\nStarring (the voices of): James Arnold Taylor, David Kaye, John Goodman, Sylvester Stallone, Paul Giamatti, Rosario Dawson, Bella Thorne, Jim Ward, Armin Shimerman, Vincent Tong\r\n\r\nDirected by: Kevin Munroe and Jerrica Cleland\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Sci-Fi/Space Fantasy/Action & Adventure/Kids & Family/Animation\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n**(c) Frank Ochieng**", "created_at": "2016-05-02T00:44:21.428Z"}, {"movie_id": 234004, "review_id": "57f41248925141398a00048f", "author_rating": 5.0, "review_text": "**Space warriors, mad scientist, chosen one and saving the planet.**\r\n\r\nI might have heard the name, but seems nothing familiar. So it is very much like my first encounter with these game characters. And this is really a good first film, I enjoyed, but did not like, because I'm not the target audience. I know, many grown-ups liked it, but they had reasons like they have known this for some time. One thing that fascinated me was the production quality. I can't believe, it was not those silly B class animation, it was very much comparable to Disney, Pixar and DreamWorks films. The only thing that did not favour it was the story. If they have got that part right, it would have been one of the best animations of the years.\r\n\r\nSo the truth is I tempted to rate it higher for the quality of animation alone. The directors, and all artists must be praised for that. If I were a kid, it would have been my favourite. So what I'm saying it, this film will be loved by children. There's not child film critic, otherwise this film would have been appreciated better. The problem is the critics did not like it, and so the adults, but families with kids might have chance to enjoy it.\r\n\r\nSome of the big names in the voice-over artist list, but that did not help the film to see its success. There's no innovation in it, everything you see in the film was already exploited in other films. All those the space warriors thing, the chosen one, villain, mad scientist, betrayal, you have seen them from 'Star wars' to 'Guardian of the Galaxy'. That is another reason for not having a good time with it. It is still very much a watchable film.\r\n\r\n_5/10_", "created_at": "2016-10-04T20:34:16.436Z"}]