[{"movie_id": 245698, "review_id": "57ed859ec3a3686d050002de", "author_rating": 7.0, "review_text": "**With this 'Searching for Bobby Fischer' is over for me.**\r\n\r\nI know Bobby Fischer a genius American chess player, in fact, after watching the 'Searching for Bobby Fischer', which is another biopic as this one. Other than that I know nothing about his life, so I'm very thankful for this film. From the director of many sensational flicks comes this to inspire you. Wait, did I say inspire, but I'm little confused over how this film to be considered. Bobby Fischer was a great player, but he had some mental issues. So you can compare him to John Nash from 'A Beautiful Mind', except they're from different fields, but very intelligents.\r\n\r\nThis film was a little patriotic abut the American nation, especially defeating the Russians in the chess game. So I'm being neutral here. Bobby was the one to focus how he makes his life big with the game that requires a brain. The story began with short span of childhood and then soon skipped to adult Bobby Fischer competing in a biggest tournament in the world, a championship against the best. Nicely filmed with lots of exciting scenes, particularly Tobey Maguire as the main lead was brilliant. Liev Schreiber was another surprise with his frequent on and off role.\r\n\r\nGood film, but feels it is not complete, there should have more to it and like I said earlier, it has impacted, but not inspiring way which is why I'm doubting the screenplay. A man like him and a film about him should have nominated for several international awards, including the Golden Globe and the Oscars. Sadly, it failed at the box office, as well as to get recognised at the film festival circuits. Still, it got praised, looks not for the artistic work, but as the compensation. If you watch it, you will know there's something wrong, otherwise a film like this won't go unnoticed. I hope someone else makes another film about him in a grand way. Meanwhile, it is a good watch, but what do you expect from the Bobby Fischer like his game or personal issues will decide how much you liked it.\r\n\r\n_7/10_", "created_at": "2016-09-29T21:20:30.860Z"}]