[{"movie_id": 346698, "review_id": "64bb00dc357c00021de27485", "author_rating": 7.0, "review_text": "_Barbie_ reels you in with its silly humor and fantastical ideas. The war of Kens during the last half hour of the film is an all-timer because a battle full of handsome maneuvers, like showing off their naked chest and manly noogies, turns into a full on dance off between Ryan Gosling and Simu Liu.\r\n\r\nBut the second half of the film leaves a thought-provoking message in your brain regarding both men and women. The Kens gaining respect little by little mirrors how women eventually earned their rights to be respected individuals — after being considered as only being useful in the kitchen or for making babies — except with the gender roles reversed and nude blobs instead of genitalia.\r\n\r\n**Full review:** https://bit.ly/beachoff", "created_at": "2023-07-21T22:04:12.071Z"}, {"movie_id": 346698, "review_id": "64be2c5ce9da6900eceae0cc", "author_rating": 1.0, "review_text": "I took my daughter along to see this, naively expecting light, family friendly fun and well, its not. Not even a little.\r\n\r\nThe kindest way I can describe this monstrosity is mean spirited, misandry. The message is simply not one I want my child taking on board.\r\n\r\nMy daughter wanted to leave before I'd even suggested it, so we did and had a better time doing something else together.\r\n\r\nIn summary, in my opinion, nasty and spiteful. Hollywood deserves its declining viewership, if this is all it has left to offer.", "created_at": "2023-07-24T07:46:36.727Z"}, {"movie_id": 346698, "review_id": "64bea9e3c51acd00af638e02", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-greta-gerwigs-barbie-is-both-hilarious-thought-provoking/\r\n\r\n\"Barbie is hilariously meta, containing spectacularly funny musical numbers, and an efficient tonal balance between over-the-top comedy and rich, thought-provoking social commentary. Inevitable awards are on the way for the brightly colored production design, costumes, and makeup.\r\n\r\nGreta Gerwig and Noah Baumbach's narrative unapologetically tackles quite serious topics, from sociopolitical matters like patriarchy and sexual harassment to questions about existential crises, personal identity, self-love, and, of course, the roles of women and men in today's society.\r\n\r\nMargot Robbie was destined to play Barbie just as Ryan Gosling was born with Kenergy in his veins. Absolutely fantastic, as are the rest of the Barbies and Kens.\r\n\r\nA must-see in a packed theater!\"\r\n\r\nRating: A-", "created_at": "2023-07-24T16:42:11.370Z"}, {"movie_id": 346698, "review_id": "64bfbfe3b3316b011c701db1", "author_rating": 1.0, "review_text": "Terrible movie with no plot.\r\n\r\nThe film is marketed as a light hearted family film but instead focuses on adult themes while pushing an extremist feminist agenda which mocks traditional family values and men.\r\n\r\nThe only enjoyable parts of this movie are the scenes with Ken, played by Ryan Gosling.", "created_at": "2023-07-25T12:28:19.723Z"}, {"movie_id": 346698, "review_id": "64c0e3f6ede1b000c8bcc273", "author_rating": 7.0, "review_text": "\"Thus Spake Zarabarbie\" - that's the opening message as narrated by Dame Helen Mirren who gives us a potted history of the doll - from it's origins as an inanimate plaything of young girls to it's current status as an empowering conduit for young girls to emerge into society as uninhibited and aspirational beings with only the sky as the limit. Well, that's the philosophy in Margot Robbie's \"Barbieland\". A sterile sort of environment that lives it's life along the lines of a pink \"Groundhog Day\". Men? Well yes, there are - as embodied by the tanned, rippled and toned \"Ken\" (Ryan Gosling) but they are very much the in-app purchase in this world, with little purpose aside from augmenting a \"Barbie\". Strangely, one morning, the stereotypical \"Barbie\" finds she has lost some of her charm! She is flat footed, her endlessly elysian existence is fraying at the edges? What do do? See \"Weird Barbie\" (Emerald Fennell) and seek her sagely advice. That, however, she doesn't like. She must enter into the real world and find whoever is supposed to be playing with her - clearly not an happy girl - and see if she can cheer her up and restore the equilibrium. En route, she finds that her ever devoted \"Ken\" will join her and their arrival in the big city introduces both to a bewildering world of sexists, misogynists and cynics. The latter best exemplified by \"Sasha\" - her somewhat disenchanted owner. When the boss of Mattel (Will Ferrell) discovers her escape, he mobilises the whole of his organisation to get her back in her box whilst an equally disillusioned but newly engaged \"Ken\" heads back to his home realising that maybe the men don't have to live quite such understudy lives. Can she elude her pursuers long enough to befriend \"Sasha\", her much less cyclical mother \"Gloria\" (America Ferrera) and then get home before both of her world's are alien to her? This is good fun, this. Gosling is a talented actor who can also churn out a decent power ballad (there are a few) and there is the oddest of chemistries here between him and an very much on-form Robbie who puts her heart and her soul (and loads of joyous/bemused facial expressions) into this role. Greta Gerwig and Noah Baumbach have written a witty script that pitches the naive and the innocent in with the venal and the observational. It swipes at all things sexist - and not just from the woman's perspective either - and though it does ridicule the restrictions society has put on the historical progression of women through the ranks of corporate America, it does so in a positive and enjoyable satirical manner. Will Ferrell - I can take him or leave him - is really only adequate as the epitome of the male dominated company structure but there is quite a nice set of scenes with Rhea Perlman (for ever \"Carla\" from \"Cheers!\") who portrays the inventor - if that is the word - of the whole \"Barbie\" concept, and who knits it all nicely together towards the end. Don't be a snob about this, get yourself into a cinema and prepare to be entertained. Bergman it isn't, but an enjoyable evaluation and parody of 21st century life, opportunity and all things vacuous it certainly is.", "created_at": "2023-07-26T09:14:30.960Z"}, {"movie_id": 346698, "review_id": "64c4e33dcadb6b01066cb4b9", "author_rating": 8.0, "review_text": "This was an _excellent_ film that left me emotionally stretched in just the right way. It's an adult movie with childhood references (not a kids' film at all), and seems pitched at people roughly my age (Matchbox 20 referenced as a track for wooing is too close for comfort!) It _superbly_ voices the internal contradictions women need to navigate to be accepted. It works hard not to centre Ken, even while his role is a critical counterpoint, but also gives a little airtime to how much a male-dominated world makes it hard to be a man too.\r\n\r\nThe writing is out of this world, the pacing is spot on, and Margot Robbie utterly _nails_ the role — especially the emotional and physical aspects of being a doll in a way that playfully nods to the many ways that children play with Barbie.\r\n\r\nIt's a wonderful film that I'd encourage everyone to see. It's _hard_ to watch, as a man—feeling responsible for so many challenges women face—but Barbie doesn't judge, it voices. It's a message that informs me, helps me, as well as entertaining me, but it isn't meant for _me_; the extent to which Yvette felt seen, understood and perfectly spoken on behalf of _is_ this movie, and why it deserves all the praise it's getting.\r\n\r\nOriginally posted at: https://www.byjp.me/posts/reviews/movies/barbie/", "created_at": "2023-07-29T10:00:29.386Z"}, {"movie_id": 346698, "review_id": "64c5b2b1cadb6b00ac65b2ba", "author_rating": 5.0, "review_text": "“Heavy is the arm that wears its heart on its sleeve.” That’s the best way to sum up this overwritten, overlong, stunningly obvious treatise on gender equality, consumerism and existentialism, whose messages get beaten to death beginning early on and never let up, an exhausting experience, to be sure. Writer-director Greta Gerwig’s latest offering, co-written with collaborator Noah Baumbach, features a dreadful script that’s about as subtle as a young adult novel, drones on and on and on for about 30 minutes longer than it needs to be, becomes endlessly repetitive, and incorporates story threads that could have easily been scaled back or eliminated entirely (such as those with Will Ferrell and Michael Cera). What’s more, much of the dialogue is either stupefyingly juvenile or sounds more like “writing” than anything anyone would actually say (even for a fictional fantasy character), with attempts at humor that often fall woefully flat. And, to be honest, for all intents and purposes, the project comes across like a two-hour commercial for Mattel (even if the company manages to find ways to poke fun at itself). To its credit, “Barbie” does have a few strengths going for it, such as its superb production design, some genuinely clever humor (especially its opening pre-titles sequence and occasional asides), and fine performances by Margot Robbie and Ryan Gosling (who manage to make this material look better than it actually is), as well as a heartwarming appearance by Rhea Perlman. Beyond that, though, this is handily the most overrated, overhyped release of the summer movie season, one that I’ll easily forget before year’s end – and one that conclusively proves the power of marketing, no matter what the quality of the merchandise being promoted.", "created_at": "2023-07-30T00:45:37.364Z"}, {"movie_id": 346698, "review_id": "64ca94cee04d8a00e35e887a", "author_rating": 4.0, "review_text": "McKinnon and Gosling's acting is great, and the dance numbers are really well done. But the story is very weak -- the Gloria/Sasha tie-in felt ham-fisted and the 'bonding' Barbie has at the end with Ruth makes no sense in the context of the rest of the film. It also doesn't help that throughout the whole movie you're being hit over the head with a message that they *really* want to make sure you understand (how many times can you say 'patriarchy'?) Not recommended.", "created_at": "2023-08-02T17:39:26.441Z"}, {"movie_id": 346698, "review_id": "64e37ac465e0a200ad07f817", "author_rating": 7.0, "review_text": "The _Barbie_ movie is funny, and fun, and moved with deft pace from laughs to moments so engaging you could hear a pin drop in the theatre.\r\n\r\nIts social message should not be controversial — _Barbie_ is a _critique of power and status quo_. \r\n\r\nIts allegory in art swings at every in-power group, and gives voice to every marginalized group.\r\n\r\nThere's even a point at which Barbie longs to restore the status quo in Barbieland and return to her position of privilege, and is chastised by Ken who, having reversed the roles, asks her \"how does it feel?\" (to be not seen, to not matter).\r\n\r\n_Barbie_ illustrated clearly that _the status quo hurts everyone, including those in power_ — in other words, challenging the status quo is good for men as well as woman (and insert every other power dynamic here  — able-bodied as well as mobility-challenged, rich as well as poor, etc.)\r\n\r\nThat its social message is controversial proves its necessity. The only way this critique on power and status quo could be misconstrued as an attack on men is if people think power and control of the status quo belong only to men — which, eureka! is precisely what this movie is speaking to.\r\n\r\n\"When you're accustomed to privilege, equality feels like oppression\".", "created_at": "2023-08-21T14:55:00.127Z"}, {"movie_id": 346698, "review_id": "64fbe9eee0ca7f00ec8b29d3", "author_rating": 7.0, "review_text": "**Barbie's breathtaking visuals and practical effects outshine the erratic storytelling to make a fresh and innovative movie with themes that will be divisive for many.**\r\n\r\nBarbie is a visually stunning achievement that has excelled at the box office while dividing audiences. On the one hand, Barbie amazes with extravagant practical sets and exceptional performances, but on the other hand, the story and directing feel chaotic and erratic. The target audience seems to be moms who played with Barbies and would bring their daughters to the film. Therefore, some film's themes feel more grown up than expected for a movie about a child's toy. Despite probably not being the primary target demographic, I enjoyed the film, especially Margot Robbie and Ryan Gosling's performance. They elevated the story and script to the successful giant the movie has become. The casting of Kate McKinnon and Will Ferrell was perfect for the roles they portrayed. The sets and production design were some of the most impressive I have ever seen in a film! The story was unfocused and unpredictable but also fun and lighthearted. While I wouldn't say Barbie was perfect, and its themes a little too complex for a movie about a toy, its production design and unique story stood out in an era of remakes and sequels.", "created_at": "2023-09-09T03:43:42.829Z"}, {"movie_id": 346698, "review_id": "651addee07216600acb52555", "author_rating": 8.0, "review_text": "Barbie presents a captivating cinematic journey, deftly utilizing an iconic doll to explore intricate gender dynamics. Guided by Greta Gerwig’s direction, Margot Robbie and Ryan Gosling offer standout performances, complemented by memorable songs and stunning set designs, creating an immersive and humorous experience. This thought-provoking film seamlessly weaves a commentary on equality into its dazzling visuals and catchy tunes, harmoniously blending humour and insight. The result is an unforgettable viewing adventure that engages, entertains, and resonates long after the credits roll.", "created_at": "2023-10-02T15:12:46.921Z"}, {"movie_id": 346698, "review_id": "64bb00dc357c00021de27485", "author_rating": 7.0, "review_text": "_Barbie_ reels you in with its silly humor and fantastical ideas. The war of Kens during the last half hour of the film is an all-timer because a battle full of handsome maneuvers, like showing off their naked chest and manly noogies, turns into a full on dance off between Ryan Gosling and Simu Liu.\r\n\r\nBut the second half of the film leaves a thought-provoking message in your brain regarding both men and women. The Kens gaining respect little by little mirrors how women eventually earned their rights to be respected individuals — after being considered as only being useful in the kitchen or for making babies — except with the gender roles reversed and nude blobs instead of genitalia.\r\n\r\n**Full review:** https://bit.ly/beachoff", "created_at": "2023-07-21T22:04:12.071Z"}, {"movie_id": 346698, "review_id": "64be2c5ce9da6900eceae0cc", "author_rating": 1.0, "review_text": "I took my daughter along to see this, naively expecting light, family friendly fun and well, its not. Not even a little.\r\n\r\nThe kindest way I can describe this monstrosity is mean spirited, misandry. The message is simply not one I want my child taking on board.\r\n\r\nMy daughter wanted to leave before I'd even suggested it, so we did and had a better time doing something else together.\r\n\r\nIn summary, in my opinion, nasty and spiteful. Hollywood deserves its declining viewership, if this is all it has left to offer.", "created_at": "2023-07-24T07:46:36.727Z"}, {"movie_id": 346698, "review_id": "64bea9e3c51acd00af638e02", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-greta-gerwigs-barbie-is-both-hilarious-thought-provoking/\r\n\r\n\"Barbie is hilariously meta, containing spectacularly funny musical numbers, and an efficient tonal balance between over-the-top comedy and rich, thought-provoking social commentary. Inevitable awards are on the way for the brightly colored production design, costumes, and makeup.\r\n\r\nGreta Gerwig and Noah Baumbach's narrative unapologetically tackles quite serious topics, from sociopolitical matters like patriarchy and sexual harassment to questions about existential crises, personal identity, self-love, and, of course, the roles of women and men in today's society.\r\n\r\nMargot Robbie was destined to play Barbie just as Ryan Gosling was born with Kenergy in his veins. Absolutely fantastic, as are the rest of the Barbies and Kens.\r\n\r\nA must-see in a packed theater!\"\r\n\r\nRating: A-", "created_at": "2023-07-24T16:42:11.370Z"}, {"movie_id": 346698, "review_id": "64bfbfe3b3316b011c701db1", "author_rating": 1.0, "review_text": "Terrible movie with no plot.\r\n\r\nThe film is marketed as a light hearted family film but instead focuses on adult themes while pushing an extremist feminist agenda which mocks traditional family values and men.\r\n\r\nThe only enjoyable parts of this movie are the scenes with Ken, played by Ryan Gosling.", "created_at": "2023-07-25T12:28:19.723Z"}, {"movie_id": 346698, "review_id": "64c0e3f6ede1b000c8bcc273", "author_rating": 7.0, "review_text": "\"Thus Spake Zarabarbie\" - that's the opening message as narrated by Dame Helen Mirren who gives us a potted history of the doll - from it's origins as an inanimate plaything of young girls to it's current status as an empowering conduit for young girls to emerge into society as uninhibited and aspirational beings with only the sky as the limit. Well, that's the philosophy in Margot Robbie's \"Barbieland\". A sterile sort of environment that lives it's life along the lines of a pink \"Groundhog Day\". Men? Well yes, there are - as embodied by the tanned, rippled and toned \"Ken\" (Ryan Gosling) but they are very much the in-app purchase in this world, with little purpose aside from augmenting a \"Barbie\". Strangely, one morning, the stereotypical \"Barbie\" finds she has lost some of her charm! She is flat footed, her endlessly elysian existence is fraying at the edges? What do do? See \"Weird Barbie\" (Emerald Fennell) and seek her sagely advice. That, however, she doesn't like. She must enter into the real world and find whoever is supposed to be playing with her - clearly not an happy girl - and see if she can cheer her up and restore the equilibrium. En route, she finds that her ever devoted \"Ken\" will join her and their arrival in the big city introduces both to a bewildering world of sexists, misogynists and cynics. The latter best exemplified by \"Sasha\" - her somewhat disenchanted owner. When the boss of Mattel (Will Ferrell) discovers her escape, he mobilises the whole of his organisation to get her back in her box whilst an equally disillusioned but newly engaged \"Ken\" heads back to his home realising that maybe the men don't have to live quite such understudy lives. Can she elude her pursuers long enough to befriend \"Sasha\", her much less cyclical mother \"Gloria\" (America Ferrera) and then get home before both of her world's are alien to her? This is good fun, this. Gosling is a talented actor who can also churn out a decent power ballad (there are a few) and there is the oddest of chemistries here between him and an very much on-form Robbie who puts her heart and her soul (and loads of joyous/bemused facial expressions) into this role. Greta Gerwig and Noah Baumbach have written a witty script that pitches the naive and the innocent in with the venal and the observational. It swipes at all things sexist - and not just from the woman's perspective either - and though it does ridicule the restrictions society has put on the historical progression of women through the ranks of corporate America, it does so in a positive and enjoyable satirical manner. Will Ferrell - I can take him or leave him - is really only adequate as the epitome of the male dominated company structure but there is quite a nice set of scenes with Rhea Perlman (for ever \"Carla\" from \"Cheers!\") who portrays the inventor - if that is the word - of the whole \"Barbie\" concept, and who knits it all nicely together towards the end. Don't be a snob about this, get yourself into a cinema and prepare to be entertained. Bergman it isn't, but an enjoyable evaluation and parody of 21st century life, opportunity and all things vacuous it certainly is.", "created_at": "2023-07-26T09:14:30.960Z"}, {"movie_id": 346698, "review_id": "64c4e33dcadb6b01066cb4b9", "author_rating": 8.0, "review_text": "This was an _excellent_ film that left me emotionally stretched in just the right way. It's an adult movie with childhood references (not a kids' film at all), and seems pitched at people roughly my age (Matchbox 20 referenced as a track for wooing is too close for comfort!) It _superbly_ voices the internal contradictions women need to navigate to be accepted. It works hard not to centre Ken, even while his role is a critical counterpoint, but also gives a little airtime to how much a male-dominated world makes it hard to be a man too.\r\n\r\nThe writing is out of this world, the pacing is spot on, and Margot Robbie utterly _nails_ the role — especially the emotional and physical aspects of being a doll in a way that playfully nods to the many ways that children play with Barbie.\r\n\r\nIt's a wonderful film that I'd encourage everyone to see. It's _hard_ to watch, as a man—feeling responsible for so many challenges women face—but Barbie doesn't judge, it voices. It's a message that informs me, helps me, as well as entertaining me, but it isn't meant for _me_; the extent to which Yvette felt seen, understood and perfectly spoken on behalf of _is_ this movie, and why it deserves all the praise it's getting.\r\n\r\nOriginally posted at: https://www.byjp.me/posts/reviews/movies/barbie/", "created_at": "2023-07-29T10:00:29.386Z"}, {"movie_id": 346698, "review_id": "64c5b2b1cadb6b00ac65b2ba", "author_rating": 5.0, "review_text": "“Heavy is the arm that wears its heart on its sleeve.” That’s the best way to sum up this overwritten, overlong, stunningly obvious treatise on gender equality, consumerism and existentialism, whose messages get beaten to death beginning early on and never let up, an exhausting experience, to be sure. Writer-director Greta Gerwig’s latest offering, co-written with collaborator Noah Baumbach, features a dreadful script that’s about as subtle as a young adult novel, drones on and on and on for about 30 minutes longer than it needs to be, becomes endlessly repetitive, and incorporates story threads that could have easily been scaled back or eliminated entirely (such as those with Will Ferrell and Michael Cera). What’s more, much of the dialogue is either stupefyingly juvenile or sounds more like “writing” than anything anyone would actually say (even for a fictional fantasy character), with attempts at humor that often fall woefully flat. And, to be honest, for all intents and purposes, the project comes across like a two-hour commercial for Mattel (even if the company manages to find ways to poke fun at itself). To its credit, “Barbie” does have a few strengths going for it, such as its superb production design, some genuinely clever humor (especially its opening pre-titles sequence and occasional asides), and fine performances by Margot Robbie and Ryan Gosling (who manage to make this material look better than it actually is), as well as a heartwarming appearance by Rhea Perlman. Beyond that, though, this is handily the most overrated, overhyped release of the summer movie season, one that I’ll easily forget before year’s end – and one that conclusively proves the power of marketing, no matter what the quality of the merchandise being promoted.", "created_at": "2023-07-30T00:45:37.364Z"}, {"movie_id": 346698, "review_id": "64ca94cee04d8a00e35e887a", "author_rating": 4.0, "review_text": "McKinnon and Gosling's acting is great, and the dance numbers are really well done. But the story is very weak -- the Gloria/Sasha tie-in felt ham-fisted and the 'bonding' Barbie has at the end with Ruth makes no sense in the context of the rest of the film. It also doesn't help that throughout the whole movie you're being hit over the head with a message that they *really* want to make sure you understand (how many times can you say 'patriarchy'?) Not recommended.", "created_at": "2023-08-02T17:39:26.441Z"}, {"movie_id": 346698, "review_id": "64e37ac465e0a200ad07f817", "author_rating": 7.0, "review_text": "The _Barbie_ movie is funny, and fun, and moved with deft pace from laughs to moments so engaging you could hear a pin drop in the theatre.\r\n\r\nIts social message should not be controversial — _Barbie_ is a _critique of power and status quo_. \r\n\r\nIts allegory in art swings at every in-power group, and gives voice to every marginalized group.\r\n\r\nThere's even a point at which Barbie longs to restore the status quo in Barbieland and return to her position of privilege, and is chastised by Ken who, having reversed the roles, asks her \"how does it feel?\" (to be not seen, to not matter).\r\n\r\n_Barbie_ illustrated clearly that _the status quo hurts everyone, including those in power_ — in other words, challenging the status quo is good for men as well as woman (and insert every other power dynamic here  — able-bodied as well as mobility-challenged, rich as well as poor, etc.)\r\n\r\nThat its social message is controversial proves its necessity. The only way this critique on power and status quo could be misconstrued as an attack on men is if people think power and control of the status quo belong only to men — which, eureka! is precisely what this movie is speaking to.\r\n\r\n\"When you're accustomed to privilege, equality feels like oppression\".", "created_at": "2023-08-21T14:55:00.127Z"}, {"movie_id": 346698, "review_id": "64fbe9eee0ca7f00ec8b29d3", "author_rating": 7.0, "review_text": "**Barbie's breathtaking visuals and practical effects outshine the erratic storytelling to make a fresh and innovative movie with themes that will be divisive for many.**\r\n\r\nBarbie is a visually stunning achievement that has excelled at the box office while dividing audiences. On the one hand, Barbie amazes with extravagant practical sets and exceptional performances, but on the other hand, the story and directing feel chaotic and erratic. The target audience seems to be moms who played with Barbies and would bring their daughters to the film. Therefore, some film's themes feel more grown up than expected for a movie about a child's toy. Despite probably not being the primary target demographic, I enjoyed the film, especially Margot Robbie and Ryan Gosling's performance. They elevated the story and script to the successful giant the movie has become. The casting of Kate McKinnon and Will Ferrell was perfect for the roles they portrayed. The sets and production design were some of the most impressive I have ever seen in a film! The story was unfocused and unpredictable but also fun and lighthearted. While I wouldn't say Barbie was perfect, and its themes a little too complex for a movie about a toy, its production design and unique story stood out in an era of remakes and sequels.", "created_at": "2023-09-09T03:43:42.829Z"}, {"movie_id": 346698, "review_id": "651addee07216600acb52555", "author_rating": 8.0, "review_text": "Barbie presents a captivating cinematic journey, deftly utilizing an iconic doll to explore intricate gender dynamics. Guided by Greta Gerwig’s direction, Margot Robbie and Ryan Gosling offer standout performances, complemented by memorable songs and stunning set designs, creating an immersive and humorous experience. This thought-provoking film seamlessly weaves a commentary on equality into its dazzling visuals and catchy tunes, harmoniously blending humour and insight. The result is an unforgettable viewing adventure that engages, entertains, and resonates long after the credits roll.", "created_at": "2023-10-02T15:12:46.921Z"}, {"movie_id": 346698, "review_id": "64bb00dc357c00021de27485", "author_rating": 7.0, "review_text": "_Barbie_ reels you in with its silly humor and fantastical ideas. The war of Kens during the last half hour of the film is an all-timer because a battle full of handsome maneuvers, like showing off their naked chest and manly noogies, turns into a full on dance off between Ryan Gosling and Simu Liu.\r\n\r\nBut the second half of the film leaves a thought-provoking message in your brain regarding both men and women. The Kens gaining respect little by little mirrors how women eventually earned their rights to be respected individuals — after being considered as only being useful in the kitchen or for making babies — except with the gender roles reversed and nude blobs instead of genitalia.\r\n\r\n**Full review:** https://bit.ly/beachoff", "created_at": "2023-07-21T22:04:12.071Z"}, {"movie_id": 346698, "review_id": "64be2c5ce9da6900eceae0cc", "author_rating": 1.0, "review_text": "I took my daughter along to see this, naively expecting light, family friendly fun and well, its not. Not even a little.\r\n\r\nThe kindest way I can describe this monstrosity is mean spirited, misandry. The message is simply not one I want my child taking on board.\r\n\r\nMy daughter wanted to leave before I'd even suggested it, so we did and had a better time doing something else together.\r\n\r\nIn summary, in my opinion, nasty and spiteful. Hollywood deserves its declining viewership, if this is all it has left to offer.", "created_at": "2023-07-24T07:46:36.727Z"}, {"movie_id": 346698, "review_id": "64bea9e3c51acd00af638e02", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-greta-gerwigs-barbie-is-both-hilarious-thought-provoking/\r\n\r\n\"Barbie is hilariously meta, containing spectacularly funny musical numbers, and an efficient tonal balance between over-the-top comedy and rich, thought-provoking social commentary. Inevitable awards are on the way for the brightly colored production design, costumes, and makeup.\r\n\r\nGreta Gerwig and Noah Baumbach's narrative unapologetically tackles quite serious topics, from sociopolitical matters like patriarchy and sexual harassment to questions about existential crises, personal identity, self-love, and, of course, the roles of women and men in today's society.\r\n\r\nMargot Robbie was destined to play Barbie just as Ryan Gosling was born with Kenergy in his veins. Absolutely fantastic, as are the rest of the Barbies and Kens.\r\n\r\nA must-see in a packed theater!\"\r\n\r\nRating: A-", "created_at": "2023-07-24T16:42:11.370Z"}, {"movie_id": 346698, "review_id": "64bfbfe3b3316b011c701db1", "author_rating": 1.0, "review_text": "Terrible movie with no plot.\r\n\r\nThe film is marketed as a light hearted family film but instead focuses on adult themes while pushing an extremist feminist agenda which mocks traditional family values and men.\r\n\r\nThe only enjoyable parts of this movie are the scenes with Ken, played by Ryan Gosling.", "created_at": "2023-07-25T12:28:19.723Z"}, {"movie_id": 346698, "review_id": "64c0e3f6ede1b000c8bcc273", "author_rating": 7.0, "review_text": "\"Thus Spake Zarabarbie\" - that's the opening message as narrated by Dame Helen Mirren who gives us a potted history of the doll - from it's origins as an inanimate plaything of young girls to it's current status as an empowering conduit for young girls to emerge into society as uninhibited and aspirational beings with only the sky as the limit. Well, that's the philosophy in Margot Robbie's \"Barbieland\". A sterile sort of environment that lives it's life along the lines of a pink \"Groundhog Day\". Men? Well yes, there are - as embodied by the tanned, rippled and toned \"Ken\" (Ryan Gosling) but they are very much the in-app purchase in this world, with little purpose aside from augmenting a \"Barbie\". Strangely, one morning, the stereotypical \"Barbie\" finds she has lost some of her charm! She is flat footed, her endlessly elysian existence is fraying at the edges? What do do? See \"Weird Barbie\" (Emerald Fennell) and seek her sagely advice. That, however, she doesn't like. She must enter into the real world and find whoever is supposed to be playing with her - clearly not an happy girl - and see if she can cheer her up and restore the equilibrium. En route, she finds that her ever devoted \"Ken\" will join her and their arrival in the big city introduces both to a bewildering world of sexists, misogynists and cynics. The latter best exemplified by \"Sasha\" - her somewhat disenchanted owner. When the boss of Mattel (Will Ferrell) discovers her escape, he mobilises the whole of his organisation to get her back in her box whilst an equally disillusioned but newly engaged \"Ken\" heads back to his home realising that maybe the men don't have to live quite such understudy lives. Can she elude her pursuers long enough to befriend \"Sasha\", her much less cyclical mother \"Gloria\" (America Ferrera) and then get home before both of her world's are alien to her? This is good fun, this. Gosling is a talented actor who can also churn out a decent power ballad (there are a few) and there is the oddest of chemistries here between him and an very much on-form Robbie who puts her heart and her soul (and loads of joyous/bemused facial expressions) into this role. Greta Gerwig and Noah Baumbach have written a witty script that pitches the naive and the innocent in with the venal and the observational. It swipes at all things sexist - and not just from the woman's perspective either - and though it does ridicule the restrictions society has put on the historical progression of women through the ranks of corporate America, it does so in a positive and enjoyable satirical manner. Will Ferrell - I can take him or leave him - is really only adequate as the epitome of the male dominated company structure but there is quite a nice set of scenes with Rhea Perlman (for ever \"Carla\" from \"Cheers!\") who portrays the inventor - if that is the word - of the whole \"Barbie\" concept, and who knits it all nicely together towards the end. Don't be a snob about this, get yourself into a cinema and prepare to be entertained. Bergman it isn't, but an enjoyable evaluation and parody of 21st century life, opportunity and all things vacuous it certainly is.", "created_at": "2023-07-26T09:14:30.960Z"}, {"movie_id": 346698, "review_id": "64c4e33dcadb6b01066cb4b9", "author_rating": 8.0, "review_text": "This was an _excellent_ film that left me emotionally stretched in just the right way. It's an adult movie with childhood references (not a kids' film at all), and seems pitched at people roughly my age (Matchbox 20 referenced as a track for wooing is too close for comfort!) It _superbly_ voices the internal contradictions women need to navigate to be accepted. It works hard not to centre Ken, even while his role is a critical counterpoint, but also gives a little airtime to how much a male-dominated world makes it hard to be a man too.\r\n\r\nThe writing is out of this world, the pacing is spot on, and Margot Robbie utterly _nails_ the role — especially the emotional and physical aspects of being a doll in a way that playfully nods to the many ways that children play with Barbie.\r\n\r\nIt's a wonderful film that I'd encourage everyone to see. It's _hard_ to watch, as a man—feeling responsible for so many challenges women face—but Barbie doesn't judge, it voices. It's a message that informs me, helps me, as well as entertaining me, but it isn't meant for _me_; the extent to which Yvette felt seen, understood and perfectly spoken on behalf of _is_ this movie, and why it deserves all the praise it's getting.\r\n\r\nOriginally posted at: https://www.byjp.me/posts/reviews/movies/barbie/", "created_at": "2023-07-29T10:00:29.386Z"}, {"movie_id": 346698, "review_id": "64c5b2b1cadb6b00ac65b2ba", "author_rating": 5.0, "review_text": "“Heavy is the arm that wears its heart on its sleeve.” That’s the best way to sum up this overwritten, overlong, stunningly obvious treatise on gender equality, consumerism and existentialism, whose messages get beaten to death beginning early on and never let up, an exhausting experience, to be sure. Writer-director Greta Gerwig’s latest offering, co-written with collaborator Noah Baumbach, features a dreadful script that’s about as subtle as a young adult novel, drones on and on and on for about 30 minutes longer than it needs to be, becomes endlessly repetitive, and incorporates story threads that could have easily been scaled back or eliminated entirely (such as those with Will Ferrell and Michael Cera). What’s more, much of the dialogue is either stupefyingly juvenile or sounds more like “writing” than anything anyone would actually say (even for a fictional fantasy character), with attempts at humor that often fall woefully flat. And, to be honest, for all intents and purposes, the project comes across like a two-hour commercial for Mattel (even if the company manages to find ways to poke fun at itself). To its credit, “Barbie” does have a few strengths going for it, such as its superb production design, some genuinely clever humor (especially its opening pre-titles sequence and occasional asides), and fine performances by Margot Robbie and Ryan Gosling (who manage to make this material look better than it actually is), as well as a heartwarming appearance by Rhea Perlman. Beyond that, though, this is handily the most overrated, overhyped release of the summer movie season, one that I’ll easily forget before year’s end – and one that conclusively proves the power of marketing, no matter what the quality of the merchandise being promoted.", "created_at": "2023-07-30T00:45:37.364Z"}, {"movie_id": 346698, "review_id": "64ca94cee04d8a00e35e887a", "author_rating": 4.0, "review_text": "McKinnon and Gosling's acting is great, and the dance numbers are really well done. But the story is very weak -- the Gloria/Sasha tie-in felt ham-fisted and the 'bonding' Barbie has at the end with Ruth makes no sense in the context of the rest of the film. It also doesn't help that throughout the whole movie you're being hit over the head with a message that they *really* want to make sure you understand (how many times can you say 'patriarchy'?) Not recommended.", "created_at": "2023-08-02T17:39:26.441Z"}, {"movie_id": 346698, "review_id": "64e37ac465e0a200ad07f817", "author_rating": 7.0, "review_text": "The _Barbie_ movie is funny, and fun, and moved with deft pace from laughs to moments so engaging you could hear a pin drop in the theatre.\r\n\r\nIts social message should not be controversial — _Barbie_ is a _critique of power and status quo_. \r\n\r\nIts allegory in art swings at every in-power group, and gives voice to every marginalized group.\r\n\r\nThere's even a point at which Barbie longs to restore the status quo in Barbieland and return to her position of privilege, and is chastised by Ken who, having reversed the roles, asks her \"how does it feel?\" (to be not seen, to not matter).\r\n\r\n_Barbie_ illustrated clearly that _the status quo hurts everyone, including those in power_ — in other words, challenging the status quo is good for men as well as woman (and insert every other power dynamic here  — able-bodied as well as mobility-challenged, rich as well as poor, etc.)\r\n\r\nThat its social message is controversial proves its necessity. The only way this critique on power and status quo could be misconstrued as an attack on men is if people think power and control of the status quo belong only to men — which, eureka! is precisely what this movie is speaking to.\r\n\r\n\"When you're accustomed to privilege, equality feels like oppression\".", "created_at": "2023-08-21T14:55:00.127Z"}, {"movie_id": 346698, "review_id": "64fbe9eee0ca7f00ec8b29d3", "author_rating": 7.0, "review_text": "**Barbie's breathtaking visuals and practical effects outshine the erratic storytelling to make a fresh and innovative movie with themes that will be divisive for many.**\r\n\r\nBarbie is a visually stunning achievement that has excelled at the box office while dividing audiences. On the one hand, Barbie amazes with extravagant practical sets and exceptional performances, but on the other hand, the story and directing feel chaotic and erratic. The target audience seems to be moms who played with Barbies and would bring their daughters to the film. Therefore, some film's themes feel more grown up than expected for a movie about a child's toy. Despite probably not being the primary target demographic, I enjoyed the film, especially Margot Robbie and Ryan Gosling's performance. They elevated the story and script to the successful giant the movie has become. The casting of Kate McKinnon and Will Ferrell was perfect for the roles they portrayed. The sets and production design were some of the most impressive I have ever seen in a film! The story was unfocused and unpredictable but also fun and lighthearted. While I wouldn't say Barbie was perfect, and its themes a little too complex for a movie about a toy, its production design and unique story stood out in an era of remakes and sequels.", "created_at": "2023-09-09T03:43:42.829Z"}, {"movie_id": 346698, "review_id": "651addee07216600acb52555", "author_rating": 8.0, "review_text": "Barbie presents a captivating cinematic journey, deftly utilizing an iconic doll to explore intricate gender dynamics. Guided by Greta Gerwig’s direction, Margot Robbie and Ryan Gosling offer standout performances, complemented by memorable songs and stunning set designs, creating an immersive and humorous experience. This thought-provoking film seamlessly weaves a commentary on equality into its dazzling visuals and catchy tunes, harmoniously blending humour and insight. The result is an unforgettable viewing adventure that engages, entertains, and resonates long after the credits roll.", "created_at": "2023-10-02T15:12:46.921Z"}, {"movie_id": 346698, "review_id": "64bb00dc357c00021de27485", "author_rating": 7.0, "review_text": "_Barbie_ reels you in with its silly humor and fantastical ideas. The war of Kens during the last half hour of the film is an all-timer because a battle full of handsome maneuvers, like showing off their naked chest and manly noogies, turns into a full on dance off between Ryan Gosling and Simu Liu.\r\n\r\nBut the second half of the film leaves a thought-provoking message in your brain regarding both men and women. The Kens gaining respect little by little mirrors how women eventually earned their rights to be respected individuals — after being considered as only being useful in the kitchen or for making babies — except with the gender roles reversed and nude blobs instead of genitalia.\r\n\r\n**Full review:** https://bit.ly/beachoff", "created_at": "2023-07-21T22:04:12.071Z"}, {"movie_id": 346698, "review_id": "64be2c5ce9da6900eceae0cc", "author_rating": 1.0, "review_text": "I took my daughter along to see this, naively expecting light, family friendly fun and well, its not. Not even a little.\r\n\r\nThe kindest way I can describe this monstrosity is mean spirited, misandry. The message is simply not one I want my child taking on board.\r\n\r\nMy daughter wanted to leave before I'd even suggested it, so we did and had a better time doing something else together.\r\n\r\nIn summary, in my opinion, nasty and spiteful. Hollywood deserves its declining viewership, if this is all it has left to offer.", "created_at": "2023-07-24T07:46:36.727Z"}, {"movie_id": 346698, "review_id": "64bea9e3c51acd00af638e02", "author_rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-greta-gerwigs-barbie-is-both-hilarious-thought-provoking/\r\n\r\n\"Barbie is hilariously meta, containing spectacularly funny musical numbers, and an efficient tonal balance between over-the-top comedy and rich, thought-provoking social commentary. Inevitable awards are on the way for the brightly colored production design, costumes, and makeup.\r\n\r\nGreta Gerwig and Noah Baumbach's narrative unapologetically tackles quite serious topics, from sociopolitical matters like patriarchy and sexual harassment to questions about existential crises, personal identity, self-love, and, of course, the roles of women and men in today's society.\r\n\r\nMargot Robbie was destined to play Barbie just as Ryan Gosling was born with Kenergy in his veins. Absolutely fantastic, as are the rest of the Barbies and Kens.\r\n\r\nA must-see in a packed theater!\"\r\n\r\nRating: A-", "created_at": "2023-07-24T16:42:11.370Z"}, {"movie_id": 346698, "review_id": "64bfbfe3b3316b011c701db1", "author_rating": 1.0, "review_text": "Terrible movie with no plot.\r\n\r\nThe film is marketed as a light hearted family film but instead focuses on adult themes while pushing an extremist feminist agenda which mocks traditional family values and men.\r\n\r\nThe only enjoyable parts of this movie are the scenes with Ken, played by Ryan Gosling.", "created_at": "2023-07-25T12:28:19.723Z"}, {"movie_id": 346698, "review_id": "64c0e3f6ede1b000c8bcc273", "author_rating": 7.0, "review_text": "\"Thus Spake Zarabarbie\" - that's the opening message as narrated by Dame Helen Mirren who gives us a potted history of the doll - from it's origins as an inanimate plaything of young girls to it's current status as an empowering conduit for young girls to emerge into society as uninhibited and aspirational beings with only the sky as the limit. Well, that's the philosophy in Margot Robbie's \"Barbieland\". A sterile sort of environment that lives it's life along the lines of a pink \"Groundhog Day\". Men? Well yes, there are - as embodied by the tanned, rippled and toned \"Ken\" (Ryan Gosling) but they are very much the in-app purchase in this world, with little purpose aside from augmenting a \"Barbie\". Strangely, one morning, the stereotypical \"Barbie\" finds she has lost some of her charm! She is flat footed, her endlessly elysian existence is fraying at the edges? What do do? See \"Weird Barbie\" (Emerald Fennell) and seek her sagely advice. That, however, she doesn't like. She must enter into the real world and find whoever is supposed to be playing with her - clearly not an happy girl - and see if she can cheer her up and restore the equilibrium. En route, she finds that her ever devoted \"Ken\" will join her and their arrival in the big city introduces both to a bewildering world of sexists, misogynists and cynics. The latter best exemplified by \"Sasha\" - her somewhat disenchanted owner. When the boss of Mattel (Will Ferrell) discovers her escape, he mobilises the whole of his organisation to get her back in her box whilst an equally disillusioned but newly engaged \"Ken\" heads back to his home realising that maybe the men don't have to live quite such understudy lives. Can she elude her pursuers long enough to befriend \"Sasha\", her much less cyclical mother \"Gloria\" (America Ferrera) and then get home before both of her world's are alien to her? This is good fun, this. Gosling is a talented actor who can also churn out a decent power ballad (there are a few) and there is the oddest of chemistries here between him and an very much on-form Robbie who puts her heart and her soul (and loads of joyous/bemused facial expressions) into this role. Greta Gerwig and Noah Baumbach have written a witty script that pitches the naive and the innocent in with the venal and the observational. It swipes at all things sexist - and not just from the woman's perspective either - and though it does ridicule the restrictions society has put on the historical progression of women through the ranks of corporate America, it does so in a positive and enjoyable satirical manner. Will Ferrell - I can take him or leave him - is really only adequate as the epitome of the male dominated company structure but there is quite a nice set of scenes with Rhea Perlman (for ever \"Carla\" from \"Cheers!\") who portrays the inventor - if that is the word - of the whole \"Barbie\" concept, and who knits it all nicely together towards the end. Don't be a snob about this, get yourself into a cinema and prepare to be entertained. Bergman it isn't, but an enjoyable evaluation and parody of 21st century life, opportunity and all things vacuous it certainly is.", "created_at": "2023-07-26T09:14:30.960Z"}, {"movie_id": 346698, "review_id": "64c4e33dcadb6b01066cb4b9", "author_rating": 8.0, "review_text": "This was an _excellent_ film that left me emotionally stretched in just the right way. It's an adult movie with childhood references (not a kids' film at all), and seems pitched at people roughly my age (Matchbox 20 referenced as a track for wooing is too close for comfort!) It _superbly_ voices the internal contradictions women need to navigate to be accepted. It works hard not to centre Ken, even while his role is a critical counterpoint, but also gives a little airtime to how much a male-dominated world makes it hard to be a man too.\r\n\r\nThe writing is out of this world, the pacing is spot on, and Margot Robbie utterly _nails_ the role — especially the emotional and physical aspects of being a doll in a way that playfully nods to the many ways that children play with Barbie.\r\n\r\nIt's a wonderful film that I'd encourage everyone to see. It's _hard_ to watch, as a man—feeling responsible for so many challenges women face—but Barbie doesn't judge, it voices. It's a message that informs me, helps me, as well as entertaining me, but it isn't meant for _me_; the extent to which Yvette felt seen, understood and perfectly spoken on behalf of _is_ this movie, and why it deserves all the praise it's getting.\r\n\r\nOriginally posted at: https://www.byjp.me/posts/reviews/movies/barbie/", "created_at": "2023-07-29T10:00:29.386Z"}, {"movie_id": 346698, "review_id": "64c5b2b1cadb6b00ac65b2ba", "author_rating": 5.0, "review_text": "“Heavy is the arm that wears its heart on its sleeve.” That’s the best way to sum up this overwritten, overlong, stunningly obvious treatise on gender equality, consumerism and existentialism, whose messages get beaten to death beginning early on and never let up, an exhausting experience, to be sure. Writer-director Greta Gerwig’s latest offering, co-written with collaborator Noah Baumbach, features a dreadful script that’s about as subtle as a young adult novel, drones on and on and on for about 30 minutes longer than it needs to be, becomes endlessly repetitive, and incorporates story threads that could have easily been scaled back or eliminated entirely (such as those with Will Ferrell and Michael Cera). What’s more, much of the dialogue is either stupefyingly juvenile or sounds more like “writing” than anything anyone would actually say (even for a fictional fantasy character), with attempts at humor that often fall woefully flat. And, to be honest, for all intents and purposes, the project comes across like a two-hour commercial for Mattel (even if the company manages to find ways to poke fun at itself). To its credit, “Barbie” does have a few strengths going for it, such as its superb production design, some genuinely clever humor (especially its opening pre-titles sequence and occasional asides), and fine performances by Margot Robbie and Ryan Gosling (who manage to make this material look better than it actually is), as well as a heartwarming appearance by Rhea Perlman. Beyond that, though, this is handily the most overrated, overhyped release of the summer movie season, one that I’ll easily forget before year’s end – and one that conclusively proves the power of marketing, no matter what the quality of the merchandise being promoted.", "created_at": "2023-07-30T00:45:37.364Z"}, {"movie_id": 346698, "review_id": "64ca94cee04d8a00e35e887a", "author_rating": 4.0, "review_text": "McKinnon and Gosling's acting is great, and the dance numbers are really well done. But the story is very weak -- the Gloria/Sasha tie-in felt ham-fisted and the 'bonding' Barbie has at the end with Ruth makes no sense in the context of the rest of the film. It also doesn't help that throughout the whole movie you're being hit over the head with a message that they *really* want to make sure you understand (how many times can you say 'patriarchy'?) Not recommended.", "created_at": "2023-08-02T17:39:26.441Z"}, {"movie_id": 346698, "review_id": "64e37ac465e0a200ad07f817", "author_rating": 7.0, "review_text": "The _Barbie_ movie is funny, and fun, and moved with deft pace from laughs to moments so engaging you could hear a pin drop in the theatre.\r\n\r\nIts social message should not be controversial — _Barbie_ is a _critique of power and status quo_. \r\n\r\nIts allegory in art swings at every in-power group, and gives voice to every marginalized group.\r\n\r\nThere's even a point at which Barbie longs to restore the status quo in Barbieland and return to her position of privilege, and is chastised by Ken who, having reversed the roles, asks her \"how does it feel?\" (to be not seen, to not matter).\r\n\r\n_Barbie_ illustrated clearly that _the status quo hurts everyone, including those in power_ — in other words, challenging the status quo is good for men as well as woman (and insert every other power dynamic here  — able-bodied as well as mobility-challenged, rich as well as poor, etc.)\r\n\r\nThat its social message is controversial proves its necessity. The only way this critique on power and status quo could be misconstrued as an attack on men is if people think power and control of the status quo belong only to men — which, eureka! is precisely what this movie is speaking to.\r\n\r\n\"When you're accustomed to privilege, equality feels like oppression\".", "created_at": "2023-08-21T14:55:00.127Z"}, {"movie_id": 346698, "review_id": "64fbe9eee0ca7f00ec8b29d3", "author_rating": 7.0, "review_text": "**Barbie's breathtaking visuals and practical effects outshine the erratic storytelling to make a fresh and innovative movie with themes that will be divisive for many.**\r\n\r\nBarbie is a visually stunning achievement that has excelled at the box office while dividing audiences. On the one hand, Barbie amazes with extravagant practical sets and exceptional performances, but on the other hand, the story and directing feel chaotic and erratic. The target audience seems to be moms who played with Barbies and would bring their daughters to the film. Therefore, some film's themes feel more grown up than expected for a movie about a child's toy. Despite probably not being the primary target demographic, I enjoyed the film, especially Margot Robbie and Ryan Gosling's performance. They elevated the story and script to the successful giant the movie has become. The casting of Kate McKinnon and Will Ferrell was perfect for the roles they portrayed. The sets and production design were some of the most impressive I have ever seen in a film! The story was unfocused and unpredictable but also fun and lighthearted. While I wouldn't say Barbie was perfect, and its themes a little too complex for a movie about a toy, its production design and unique story stood out in an era of remakes and sequels.", "created_at": "2023-09-09T03:43:42.829Z"}, {"movie_id": 346698, "review_id": "651addee07216600acb52555", "author_rating": 8.0, "review_text": "Barbie presents a captivating cinematic journey, deftly utilizing an iconic doll to explore intricate gender dynamics. Guided by Greta Gerwig’s direction, Margot Robbie and Ryan Gosling offer standout performances, complemented by memorable songs and stunning set designs, creating an immersive and humorous experience. This thought-provoking film seamlessly weaves a commentary on equality into its dazzling visuals and catchy tunes, harmoniously blending humour and insight. The result is an unforgettable viewing adventure that engages, entertains, and resonates long after the credits roll.", "created_at": "2023-10-02T15:12:46.921Z"}]