[{"movie_id": 320288, "review_id": "5cf85547c3a3681a561f09d3", "author_rating": 3.0, "review_text": "It’s just a shame that 'X-Men' was never able to live up to its potential in this form. Drawn of clichés, a tired script and a tired cast, it’s a big wet flop of a film where it looked like the cast were just there to collect their cheques. It’s probably something to wait for a digital release and watch on a rainy Sunday afternoon where you can fall asleep during the exhausting middle section and wake up at the mildly less-exhausting end.\r\n\r\nIf anyone needs me, I’ll be looking for Cyclops, hot choccie, blanket and hug.\r\n- Brent Davidson\r\n\r\nRead Brent's full article...\r\nhttps://www.maketheswitch.com.au/article/review-x-men-dark-phoenix-untapped-potential", "created_at": "2019-06-05T23:50:31.468Z"}, {"movie_id": 320288, "review_id": "5cf92d7692514146dcbe137f", "author_rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nHonestly, I'm going straight to the point, and I'm going to try not to waste anyone's time since that's precisely what Dark Phoenix did. Clearly, no one in the production team cared about this movie. Now, after watching the film, it's pretty easy to understand the reasons behind the constant delays, and the poor marketing campaign (I barely saw anything remotely publicizing this movie). It's not a complete disaster, it's not an absolute mess, but the third act is such a stab into the fans' hearts. Literally, one of the most abrupt endings of the last few years. It really feels like a producer entered the writers' room and said something along the lines of \"let's just hurry this up, Marvel Cinematic Universe is right around the corner, nothing of what we do here matters.\"\r\n\r\nI'm not going to lie, it's actually true. No matter how amazing or horrible this film ended up to be, it wouldn't really matter, which is probably the most negative aspect of this Disney-Fox merger. Days Of Future Past is arguably one of the better X-Men installments, but Apocalypse and Dark Phoenix feel such a waste of time because they never really explore what the time-travel event really changed, and now time's up, a complete reboot is coming. The first act of this movie is genuinely remarkable. I felt invested in both the story and characters, I was deeply captivated by what they were doing, and Hans Zimmer's score elevates a specific sequence that on IMAX really shows off both the visual and audio's phenomenal quality.\r\n\r\nUntil midway through, it's a pretty well-written, well-performed, and exciting film (with occasional minor issues). However, after a risky yet convincing plot point, Simon Kinberg annihilates everything he was working on until then. From this moment on, I can feel the famous merger being signed, and everyone working on this movie just giving up. The writing becomes atrocious, one of the most forgettable and nonsensical villains ever shows up (and I thought that comic-book adaptations were working past the cliche \"bad guys\"), characters like Quiksilver are barely in the film (why set up his relationship with his father if they never approach that subplot again?), and the ending lasts around three minutes. Three. In this amount of time, they do the equivalent of the last hour of Avengers: Endgame. Now, try to imagine that epic hour of climactic battles crushed into a couple of minutes...\r\n\r\nThe cast truly tries. Sophie Turner carries this movie with such an emotionally powerful performance that I almost feel that she alone deserved a positive review. James McAvoy (Professor Charles Xavier) continues his streak of gripping displays (if he doesn't get a freaking Oscar in the next years, I'll explode), Michael Fassbender is splendid as Magneto, and Jennifer Lawrence (Mystique) doesn't do much. Nicholas Hoult (Beast) is a pleasant surprise, but Jessica Chastain (Smith) is the only one at fault here. I never felt any interest from the actress in getting into a superhero film, and honestly, it shows. She's definitely the one that couldn't care less about what comes out of this, so she just offers a one-dimensional performance for a pretty lousy villain.\r\n\r\nThe screenplay is filled with characters making uncharacteristic decisions (they feel unearned), and exposition scenes that don't really do justice to the compelling backstories. Nevertheless, I always feel the need to come back to the ending. I rather have a slow start, but a strong finish than the other way around. Dark Phoenix delivers a fast-paced, entertaining, and captivating first act, but slowly starts to degrade until it culminates with one of the saga's worst third acts. Sure, the action is great, and it's quite well-filmed actually, but it all ends so quickly that you don't have enough time even to try to enjoy it. If it wasn't for Hans Zimmer's score, which completely nailed me to the screen, my brain would have shut itself down before the wrap-up.\r\n\r\nIt's a shame that such a beloved franchise like the X-Men has to end like this. Simon Kinberg, knowing that the merger was going to happen, should have changed the last half, and risk a lot more, to be honest. If the movie really didn't matter, then they should have tried to do something that was never done before, and go all-out. If it fails, it fails, but at least it would have been remembered as a courageous and powerful film. This way, not only it's a disappointing culmination to a 20-year saga, but it's forgettable. It's not even horrible enough for people to remember how bad it was, it's just ... Meh. If they didn't care, how can they ask the audience to do it for them?\r\n\r\nAll in all, Dark Phoenix ends up being what everyone feared it would be: a movie that didn't matter, at all. One that didn't even try to pay homage to an extraordinary saga that notably influenced the comic-book genre. The worst of all is that everyone can imagine how great it could have been since the cast is perfect (Sophie Turner shines), Hans Zimmer's score is sumptuous, and the action is riveting. The worst feeling that a fan can have is that disappointment with how the film turned out to be mixed with the frustration due to how well a fan can imagine how amazing it could have been. However, a flawed narrative with a terrible villain and questionable character decisions ruins those dreams. With one of the most abrupt endings of the last years, X-Men reaches its end as an isolated franchise, and it now rests its hopes on Kevin Feige and Marvel co. that the MCU will do the mutants justice.\r\n\r\nPS: as you know, I try to avoid trailers as much as I can. After watching Dark Phoenix's ones, I can only advise you to not watch a single one. Not even the first one. Especially that first one! I can't understand how someone approves trailers so spoilery as these ones. Unbelievable.\r\n\r\nRating: C", "created_at": "2019-06-06T15:12:54.033Z"}, {"movie_id": 320288, "review_id": "5cfd157192514167adb97848", "author_rating": 6.0, "review_text": "I don't think this was the disaster that the critics make it out to be, but it is one of the lesser Fox X-Men movies. Both the opening scene where the X-Men rescue astronauts stranded in space and the ending where Magneto and the X-Men fight aliens on a train were well done action scenes. It's the middle that sags a bit. The film lacks energy and emotional impact. Simon Kinberg wrote and directed this second go around of the Phoenix Saga as a way to atone for writing the mediocre The Last Stand. But this film does not really improve on that film at all. I am eager to see Kevin Feige cover the full Phoenix Saga properly in a trilogy. You cannot cram the Phoenix story into one movie. We've barely gotten to know these young versions of these characters from Apocalypse. The worst performance is from Jennifer Lawrence, whose Raven is completely smug and obnoxious towards Prof. X. I was happy when she exited the movie. You can tell she doesn't care about this franchise at all. Beast acts completely out of character and joins Magneto to kill Jean--something he would never do. Quicksilver exits the movie quickly after being injured by Jean and only returns at the very end. His relationship with his father, Magneto, is never addressed. Scott Summers takes orders from Mystique (ugh!) and never shows any leadership abilities. The villains are generic evil aliens who want to use the Phoenix Force to take over the world. They are just bargain basement Skrulls. Then there are the usual continuity errors with other X-Men movies. Apocalypse showed that Phoenix was a part of Jean, just like The Last Stand did. Now we are told that the Phoenix lives outside of Jean and comes from outer space. Also, when you see how things end for Prof. X and Jean in this movie, it's unlikely that either of them would appear at the end of Days of Future Past to greet Logan at the school. Overall, disappointing and the perfect time for Disney to reboot this property.", "created_at": "2019-06-09T14:19:29.685Z"}, {"movie_id": 320288, "review_id": "5d1430f99251417581b8593f", "author_rating": 5.0, "review_text": "It's a really good movie with superb graphics and storyline.", "created_at": "2019-06-27T02:59:05.523Z"}, {"movie_id": 320288, "review_id": "5d2b9d6acaab6d19c599ed24", "author_rating": 7.0, "review_text": "***A fuller rendition of the Jean Grey Plot of “X-Men 3” with Sophie Turner***\r\n\r\nThis is another take on the Jean Grey story of “X-Men: The Last Stand” (2006). That movie was good up until the last act with the conventional battle between the good and bad mutants at Alcatraz Island, which diverged from the more interesting core story concerning Jean. “Dark Phoenix” (2019) has a similar problem in that Jean’s inner  conflict between good and evil is the most interesting element, along with the other mutants being troubled by her transformation  and trying to figure out how to handle it.\r\n\r\nUnfortunately, as with “X-Men 3,” the filmmakers insist on having everything come down to a big battle sequence that’s overlong and predictable, although it’s better and more moving here. A good example of predictableness is when Magneto (Michael Fassbender) utilizes many rifles to shoot Vuk (Jessica Chastain); you know very well that the bullets are going to be totally useless. The ending’s not bad, just tedious and perfunctory, similar to the big battle sequence in “Avengers: Endgame,” albeit less dull. The original climax of “Dark Phoenix” took place in space and had too many similarities to “Captain Marvel,” which beat “Dark Phoenix” to the theaters. So the creators had to reshoot the ending as a battle sequence involving a train, but it didn’t feel tacked on or inorganic, although the Juk/aliens subplot did.\r\n\r\nI prefer Sophie Turner to Famke Janssen in the titular role. She’s just an all-around pleasure to behold, although acting-wise she’s not yet up to the caliber of Fassbender, James McAvoy (Xavier) or Jennifer Lawrence (Raven), not even close. In any case, I found the Phoenix story fascinating just as I did with “The Last Stand,” but here it’s more fleshed out, which makes it better in some ways. I just wish the creators would have the gonads to do something fresh rather than strap the conventional “big battle” ending on what could have been a great movie.\r\n\r\nIf you liked “First Class” (2011), “Days of Future Past” (2014) and “Apocalypse” (2016), “Dark Phoenix” is cut from the same cloth in all-around quality. I prefer “Days” and “Apocalypse,” but “Dark Phoenix” ain’t no slouch, despite what detractors might say; and it’s superior to “First Class.” \r\n\r\nThe film runs 1 hour, 53 minutes.\r\n\r\nGRADE: B+", "created_at": "2019-07-14T21:23:54.266Z"}, {"movie_id": 320288, "review_id": "5d77792d5907de000f2c668f", "author_rating": 3.0, "review_text": "I don't know if _Dark Phoenix_ is the **worst** entry in the X-Men franchise. I feel like I remember being much more angry walking out of _Last Stand_ than this one. _Dark Phoenix_ didn't really make me \"angry\"... It didn't make me feel anything I guess. But there was just **nothing** I liked about this. Like, _Apocalypse_ was a bad movie, absolutely, but I really enjoyed that bit in the middle where the young X-Men got to the shopping centre together. That elevated it for me, even if it didn't stop it being a bad movie. _Dark Phoenix_ has no such moment. Nothing. I. Liked.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-09-10T10:21:33.515Z"}, {"movie_id": 320288, "review_id": "5d7e98b4f0647c06629d3575", "author_rating": 5.0, "review_text": "Not as bad as I feared and the plot in and of itself was fine, as were the performances (outside of accents going in and out depending on the scene), even Sophie Turner was okay, the visual effects were alright and the direction serviceable. However, the biggest problem was the dialogue which ranged from predictable (to the point I could predict lines from time to time) to absolutely atrocious.\r\n\r\nNot sure where this ranks amongst the \"franchise\", though initially I'd say it is above Apocalypse, a movie I didn't care much for but a far cry from First Class and Days of Future Past. **2.75/5**", "created_at": "2019-09-15T20:01:56.713Z"}, {"movie_id": 320288, "review_id": "5dc6d4bfa14e1000105d039e", "author_rating": 6.0, "review_text": "I had seen somewhat mixed opinions of this movie and none of them were really that great so I had some doubts about it. Anyway, the other day I sat down with the kids and watched it.\r\n\r\nFar from the greatest X-Men movie but it’s not that bad either. It’s okayish.\r\n\r\nThe story is fairly decent and, as usual, the special effects (which is really why I watch these movies) is quite good actually. The characters are doing a decent enough job of their roles although none of them are really up to the standard Patrick Stewart brought to the franchise.\r\n\r\nThe biggest gripe I have with the movie is it’s incessant whining. Jean is quite cool when she get’s pissed off and shows off her powers pretty much stopping anything that gets thrown at her. However those good moments are overshadowed by both her and other characters going into whining mode every so often. And Hank is just a bloody annoying asshole.\r\n\r\nI haven’t really read that many X-Men comics (didn’t have them in Sweden when I grew up) so I cannot say I know much about Jean’s real story in those. I noticed that a lot of people complained about the story in the movie not being “the right” one. Sure, when they take a known character and remakes him for no good reason that pisses me off as well but this is NOT a one star movie by any stretch of the imagination.\r\n\r\nOverall I cannot say that I really felt disappointed having watched it. Not exactly overjoyed either but it made for a decent enough movie evening with the kids.", "created_at": "2019-11-09T15:01:19.975Z"}, {"movie_id": 320288, "review_id": "62405d1a5a99150090c05c97", "author_rating": 5.0, "review_text": "This had the potential to be the best of the franchise; well it isn't/wasn't/never will be. It's an amalgam of loose acting; mediocre writing and special effects that we have seen so many times before. It goes nowhere, but never quickly enough as the ending seems tantalisingly close, but takes way too long to arrive. It'll be fine on the telly on a dark winter's evening, but that's about it.", "created_at": "2022-03-27T12:48:26.282Z"}, {"movie_id": 320288, "review_id": "62dfae6c5ca7040b2ad34eb1", "author_rating": 1.0, "review_text": "I've been a huge X-Men fan for many years. I especially loved the comic dark Phoenix saga. This movie was a travesty. It was a train wreck from the moment it started and never got any better only got worse. It had nothing to do with the storyline of dark Phoenix like in the comics. The lineup wasnt the same... No wolverine, no hellfire club... I can go on and on and pick this movie apart but I really don't have the time nor do I wish to. Simply put dark Phoenix sucks. The only saving grace to this film is James McAvoy who even in this movie was overshadowed by the stupidity of The angst. It's a shame they didn't do the true story of dark Phoenix because that would have been a good movie. I thought at the end of apocalypse when you see the Phoenix rise from out of Jean you would get that in this movie but it seems that whoever wrote the script and whoever directed this decided that the stupid teeny angst bullcrap was more important than the true story of who dark Phoenix was. Avoid this movie.", "created_at": "2022-07-26T09:05:48.548Z"}, {"movie_id": 320288, "review_id": "63be0da4fa404600c129af19", "author_rating": 1.0, "review_text": "Well... I thought The Last Stand was bad. You know, the movie where they took one of the most classic of classic legendary Claremont X-Men stories and merged it with a Joss Whedon X-Men story line that had nothing to do with Dark Phoenix and.... just lost the plot entirely.\r\n\r\nI mean that was pretty bad. This is worse.\r\n\r\nThis is ultra woke Politically Correct kinda Ghostbusters 2016, they have a message about genderstudies that trumps the story and didn't you know that everyone of a certain race, gender, and sexuality is absolute evil even if they have a long history of being the good guy sort of plot.\r\n\r\nAnd, in the end, it even had less to do with the Dark Phoenix Saga than the Last Stand did. Source material... even X-Men story in name only... and I mean that even after X-Men lost the Marvel Flagship marquee status and did the same downward trajectory as, well, as the X-Men reboot did.", "created_at": "2023-01-11T01:15:16.585Z"}]