[{"movie_id": 4982, "review_id": "55a58df9925141099600004c", "rating": 6.0, "review_text": "Quite a disappointed since it is really as much as you expect, but nothing new.\r\n\r\nWashington and Russell perform really well, so, as a characters movie, it works. It doesn't work at all as a biopic. Too much Hollywood on it.", "created_at": "2015-07-14T22:32:25.312Z"}, {"movie_id": 4982, "review_id": "5f38827a5c071b0032ac291b", "rating": 9.0, "review_text": "A thoroughly entertaining 157 minutes!\r\n\r\n<em>'American Gangster'</em> delivers in every area it needs to. Enthralling premise, immaculate music, phenomenal casting and great pacing. I was surprised slightly with how it finishes, but it's far and away from a disappointing/underwhelming conclusion.\r\n\r\nNot much really needs to be said about Denzel Washington and Russell Crowe. They're exactly how you'd expect them to be, outstanding! Washington is fantastic as Frank, while Crowe is superb as Richie. You have to wait a while for their proper screen time together, but it's worth the time it takes.\r\n\r\nAway from the leads, you have a load of recognizable faces - I was literally that Rick Dalton meme for the first 45-60 mins! Chiwetel Ejiofor (Huey) and Josh Brolin (Trupo) have sizeable roles, though there's also appearances from Carla Gugino (Laurie), Cuba Gooding Jr. (Nicky), Idris Elba (Tango) and Norman Reedus (Norman). Excellent casting, that!\r\n\r\nI was expecting slow moments due to the run time, but there aren't any - at least in my opinion. As noted, the way it ends is a tad differently to how I would've predicted, but I still enjoyed it alongside the rest of the it.\r\n\r\nIt might not be accurate on the real life Frank Lucas, but all that truly matters is does it excel as a film? Yes it does. Highly recommend!", "created_at": "2020-08-16T00:48:58.024Z"}, {"movie_id": 4982, "review_id": "6319f1d8f29d6600841d010a", "rating": 7.0, "review_text": "Denzel Washington is on top-form here as he takes on the role of the unscrupulous and devious heroine importer \"Lucas\" in this superior crime drama. Following the death of his boss, he spots an opening in New York's drugs market which he deftly exploits by importing top grade product directly from Thailand and he sells his \"Blue Magic\" cut-rate to an increasingly willing population. Largely insulated from risk by his very profitable links with organised crime, it falls to \"Richie Roberts\" (Russell Crowe) to head up a narcotics task force charged with stopping this lucrative trade that has made \"Lucas\" one of America's most wanted. It has to be said that his method of importation is extremely shrewd, and as the narrative unfolds we discover that this is not just a tale of drug smuggling, but of police corruption, violence, addiction and brutality and director Ridley Scott gets the best from both his stars - especially a terrifically plausible Crowe. There are strong contributions from a superb Ruby Lee as his mother and from Josh Brolin as the dodgy cop \"Trupo\" and an ensemble cast that keep this well scripted, paced and scored drama moving along in a characterful and interesting fashion. Certainly one of Scott and Washington's better efforts, and though long it flows well and passes just over 2½ hours compellingly.", "created_at": "2022-09-08T13:44:57.000Z"}, {"movie_id": 4982, "review_id": "643c265337806204bc161550", "rating": 6.0, "review_text": "Love gangster movies. Denzel Washington's one of the best to ever do it.", "created_at": "2023-04-16T16:46:11.520Z"}]