[{"movie_id": 1979, "review_id": "5e28a2191685da0019e12a9a", "rating": 6.0, "review_text": "Show off! \r\n\r\nA sequel to 2005 box office winner, \"The Fantastic Four\", \"Rise Of The Silver Surfer\" sees director Tim Story and the original cast principals return for more super hero schlocky fun. The story is based around the Marvel stories that featured the first appearance of said \"Silver Surfer\" in the comic book franchise. Silver Surfer (Doug Jones with Laurence Fishburne dubbing the voice) is acting as a herald for the planet devouring Galactus, the next target? Earth. Which is a bit untimely as Reed Richards/Mr Fantastic (Ioan Gruffudd) and Susan Storm/Invisible Woman (Jessica Alba) are trying to get married. Things are further problematic when after his first encounter with the Silver Surfer, Johnny Storm/Human Torch (Chris Evans) finds his powers a bit off - in fact when he touches any of the others I the team their powers are exchanged, much to Ben Grimm/The Thing's (Michael Chiklis) amusement. Not only that, but the military are starting to get heavy and annoyed with the four - and who is this back on the scene? Doctor Doom! (Julian McMahon) Thought he was dead, and how come he's in league with the military now? All of this issues must be addressed or the Earth will suffer the direst of consequences.\r\n\r\nBudgeted at $130 million, this sequel only just made its money back domestically, however, the Worldwide takings gave it an overall profit of nearly $160 million. Which when you consider that the first film (again raking the coin in) was met with very disdainful reviews (mostly warranted outside of Evans & Chiklis' efforts), it's somewhat surprising. Yet, and it's certainly no towering genre picture, \"Silver Surfer\" is a hugely enjoyable movie for fans of the source comics and the undemanding popcorn muncher. The fans, and I don't speak for all of them of course, should in the main be happy that the makers have been faithful to the origins of the story. There's also some nifty humour and both Alba and Gruffudd aren't as dull as they were in the first movie. Perhaps they are more comfortable now knowing that the paying public held sway over the critics?. Evans is still the best thing in the franchise (no surprise he would go on to play \"Captain America\" in \"The Avengers\" franchise), and the appearance of Andre Braugher as General Hager is a welcome edition. While the effects are considerably better than the poor fodder served up in the first movie - granted it wouldn't have been hard to improve on that score.\r\n\r\nWith a lovely light hearted approach, \"Fantastic Four: Rise of the Silver Surfer\" does its job. In the pantheon of super hero movies it sits some where in the middle, neither great or bad, just honest wholesome family fun. 20th Century Fox have announced that a reboot of the franchise is to come, so while Chris Evans goes off to mouth wateringly play \"Captain America\", the next lot of actors are charged with the not so easy task of winning over a tough comic book crowd, and, the critics too. 6.5/10", "created_at": "2020-01-22T19:27:21.949Z"}, {"movie_id": 1979, "review_id": "63b13a767ef3811f6086cbb9", "rating": 5.0, "review_text": "Oddly enough, I did prefer this to the original (2005) outing for this not so very fab-four. This time the \"Reed\" (Ioan Gruffudd) and \"Sue\" (Jessica Alba) romance is about to tie the knot when the army intervene to enlist their help is dealing with the menacing threat posed by a mysterious \"Silver Surfer\" (who looks like an award your eight year old might have got for a Californian surfing competition in 1975). Anyway, it turns out that he is but a precursor to the far more deadly, planet gobbling, \"Galactus\" who is hungry - and Earth is on his menu. Meantime, good old \"Victor Von Doom'' (Julian McMahon) has not forgotten his shabby treatment from the last time, and so has his own agenda that will manipulate the army and the messenger and, he hopes, give him world domination. Can the four put aside their differences and save the day? What do you think? This is about as unmenacing and devoid of jeopardy as any adventure film could ever be. Again, Evans - now even more cock-sure than before, has all the best lines and action scenes (such as they are) and the special effects are well presented. The casting and writing, though, continue to let the whole thing down and the plot really does lurch along to an ending that - like \"Galactus\", you could see from space! Hopefully the last of these, and it's now pretty clear why \"Hornblower\" isn't going to make an Hollywood star anytime soon.", "created_at": "2023-01-01T07:47:02.473Z"}]