[{"movie_id": 16690, "review_id": "5f1b432e66469a0033d9f5cd", "rating": 3.0, "review_text": "Bad watch, won't watch again, and can't recommend unless you're just a huge Peter Pan fan and a completionist.\r\n\r\nThis is in that run of unnecessary sequels Disney did to make some cheap bucks; it's (clearly) also right after they started in with digital animation.\r\n\r\nWhile they managed to capture Peter and the lost boys fairly well, Hook and Shmee are more like loose cartoony references to their former selves.  Jane and Wendy seem to have the most detail put into their animation.  The (classic) crocodile was replaced with an octopus (but still includes a suction cup version of tik-toking) by a visual director that barely understood what an octopus was.\r\n\r\nNow, being that I'm generally opposed to the octopus in general, I happen to know a few things about octopus so giving it snail-like eyes, a beak AND teeth, as well as an over-sized tongue broke me a little.  The behaviors were typically way off, to include swimming with it's arms above water (they typically help with the locomotion) and some weird physics when climbing the boat.\r\n\r\nAlso, we've pretty much pinpointed the inspiration for Neverland Island, which does actually include salt water crocodiles, but as it is in the Caribbean, this Giant Pacific Octopus  is completely out of place.\r\n\r\nThe animation style was also shifting from scene to scene, object to object.  Sometimes it is very jarring, a digital cell character atop a cg rendered log, or other times it's a cg rendered background against the digital cell animation of the ship (or vice versa) that really took me out of it as it just looked so unnatural.  I'll site \"Titan A.E.\" (Fox) and \"Treasure Planet\" (Disney) as too different examples where it was blended much more smoothly.\r\n\r\nI actually like the premise better: Hook kidnap's Wendy's daughter, but the movie does so many weird things.  Even though the original movie was officially set in the 1950s, Wendy grows at least 4-6 years to 18 to have a 12 year old daughter and a (generously) 3 year old boy, but the entire world travels backwards to WW2.  Even if we retro the original setting, make Wendy....30?, that means the original occurred in 1929 at the latest, as this sequel could occur during 1945 at the latest, and I just did more math than I'm comfortable with to enjoy a movie.\r\n\r\nAnd this bad movie has the audacity to drop like real dilemmas in the middle: obligation to family vs trustworthiness, acceptance of others, and this crazy mechanical suggestion about how The Fey of the island work.  Does belief of faeries / pixies matter, is it disbelief that actually harms them?\r\n\r\nLook, this isn't the worst thing to watch, but I honestly kind of regret my time spent on it.", "created_at": "2020-07-24T20:23:10.587Z"}]