[{"movie_id": 38356, "review_id": "5207afb2760ee3630b248db5", "rating": null, "review_text": "Transformers: Dark of the Moon. 154 minutes long, so Wiki tells me (although whilst watching it it felt as though it flew by in a mere, ooh, fourteen hours or so?). 154 minutes. And I was lost, bored and checking my watch before the fourth minute. So I shall attempt to review a movie I have only just seen but about which I know almost nothing, and about which I care considerably less than that. The following will be far less a coherent review than a disjointed mess. Well, fine. Seems perfectly apt.\r\n\r\nSo, years ago, the old Autobot leader Sentinel Prime crashed into the moon along with some teleporter doowacky - made up of hundreds of \"pillars\" - that only he can control. The Decepticons swiped almost all the pillars but left Sentinel there. On a routine military... um... I'm not sure; Jolly Boy's Outing? Optimus Prime gets into a fracas with Decepticon Shockwave and finds a couple of these pillars. He then throws a strop 'cos the humans knew about this bit of Cybertron kit but never told him, but now they're more than happy to, I suppose. Um. So Optimus rocks up to the moon and finds Sentinel Prime and revives him. Turns out this is what the Decepticons wanted; only Optimus could revive him and only Sentinel can work the teleporter doowacky (the \"Bridge\"). So now they're after Sentinel. But OH NOES, Sentinel has decided that the Autobots are fighting a lost cause, so he's throwing in with the Decepticons anyway. Cue lots of deeply confusing and tedious \"Tranny-Slapping\" as I have just dubbed the Transformer skirmishes as Megatron, Sentinel and the baddies try to use the Bridge to... um, pull their faraway home of Cybertron to Earth? Or turn Earth into Cybertron? Or something.\r\n\r\nMeanwhile, Sam Witwicky* (Shia LaBeouf, even more punchable than usual, which by his standards is quite something) is not just a useless nerd this time around, he's also a whingeing **** who wants a) international acclaim and credit (other than the medal awarded him by the president of course!) for his part in saving the world twice even though nobody knows that that's what he's done, and b) a 40-hour job. Anything really; Trolley-dolly at Asda/Walmart will be fine. Despite all this he seems to have effortlessly brushed off Megan Fox and continued to punch way, way above his weight with his new squeeze, Rosie DoubleBarrelled-Surname: English, impossibly attractive, permanently dressed for all occasions - work, play, sleep, dragging her ****hole across the carpet like a worm-ridden doggie - like a $200-an-hour prostitute, and, incredibly, at least 40% stupider even than Ms. Fox, who as we know is marginally less alert and responsive than a squeezed tube of Anusol. How does Sam fit in to the so-called \"plot\"? Who knows. Double-Barrelled's smarmy, supercar-distributing walking hard-on of a boss turns out to be a Decepticon bitch (Deceptibitch?), and... oh, Christ knows. Alls I DO know is that this time around, Frances McDormand and John Malkovich have joined John Turturro in shilling for dollars like a ****-flashing strumpet. \"Me so shaaaameless.\" \"Me overact LONG time!\" \"Me so shaaaameless.\" Sucky-f*cky, five million dollar?\r\n\r\nFrom the very first second to the very last, the whole thing is needlessly convoluted, comically unfeasible - even within its own logic, such as that is - and most crucially, lifeforce-sappingly dull. Just like the other two movies, and of course just like the Transformers themselves. At one point, maybe two-thirds in (or maybe seven weeks in, who knows?), the angsty, poignant strains of a generic rock ballad signalled the arrival of a \"sad\" scene. On-screen, people crouched and clasped their heads in anguish, weeping and hugging in amongst considerable swathes of burning scenery and unspecifiable wreckage. I'm not sure why this bit was to be considered sad or poignant; perhaps the entire cast simultaneously realised they were in a Transformers movie.\r\n\r\nAwful, awful. As bad as anything Bay has ever shat out during his spiteful, cynical, moviegoer-hating and barely-disguised subterfuge as a \"film director\".", "created_at": "2013-08-11T15:37:22.216Z"}, {"movie_id": 38356, "review_id": "6469e13ed185720101987ab8", "rating": 6.0, "review_text": "Having exhausted the more terrestrial locations for the secret, all-powerful, gadget over which the \"Autobots\" and \"Decepticons\" will squabble relentlessly, this time we move to a lunar environment where there is supposed to be a long-buried \"Cybertron\" ship that could just tip the balance of power should it fall into the wrong hands. To be fair to this iteration, the tiniest bit of effort has been spent on a plot this time. We create a good, old-fashioned, cold war style scenario with the Russians and the Americans, and there is also a little bit of Apollo 11 conspiracy to liven it up as just about everyone battles it out for the technology buried amidst the barren landscape. We've also got a new baddie-in-chief in the form of \"Shockwave\" and he continues to make sure that \"Sam\" (Shia LaBeouf) still cannot shake off his legacy with the robots still bent on mutual destruction. The usual stalwarts make up the numbers. The John Turturro \"Simmons\" character is starting to wain a bit now, Josh Duhamel is starting to lose some of his glitter and though mercifully we are now shot of Megan Fox, we find she is substituted by an even less charismatic Rosie Huntingdon-Whiteley as 'Carly\". Plenty of action and pyrotechnics, same old, same old... I expect there will be another one along soon.", "created_at": "2023-05-21T09:15:42.060Z"}]