[{"movie_id": 243, "review_id": "559a6ea4c3a36855db004b34", "rating": 9.0, "review_text": "What came first - the music or the misery?\r\n\r\nHigh Fidelity is directed by Stephen Frears and adapted to screenplay by D.V. DeVincentis, Steve Pink, John Cusack and Scott Rosenberg from the Nick Hornby novel. It stars Cusack, Jack Black, Iben Hjejle and Todd Louiso. Music is by Howard Shore and Cinematography by Seamus McGarvey.\r\n\r\nRecord store owner and compulsive list-compiler Rob Gordon (Cusack), embark's upon a what does it all mean mission when his latest girlfriend leaves him.\r\n\r\nCusack and Pink take Hornby's hugely popular novel and redirect it to Chicago, with joyous results. High Fidelity is a tale of human love and a love of music, a sort of battle of the sexes with a soundtrack of masculine life. Rob's voyage of self discovery is highly amusing, the trials and tribulations of relationships bringing out a number of scenes and scenarios that ring true, not just tickling the funny bones, but also tugging the heart and cradling the brain.\r\n\r\nAway from the doomed love angles it's the music threads that literally strike the chords. Rob and his two co-workers Barry (Black) & Dick (Louiso) worship music and continually indulge in making top 5 lists whilst bickering with sarcastic glee in the process. All three actors are superb, a trio of odd balls bouncing off of one and other with a zest that's infectious, though it's decidedly Cusack's show. A perpetual miserablist who addresses us the audience at frequent intervals, Rob in Cusack's hands garners sympathy, pity and laughs in equal measure.\r\n\r\nIn the support slots is a ream of talent well in on the joke, beauties like Catherine Zeta-Jones (dropping F-Bombs like they are going out of fashion), Lisa Bonet & Joelle Carter are complimented by the comic skills of Joan Cusack, while Hjejle turns in a wily and womanly performance as the girlfriend who kicks starts Rob's search for meaning. Elsewhere the sight of Tim Robbins as a new age hippy type - with a black belt in martial arts - is so much fun it reminds of what a good comic actor he can be as well. \r\n\r\nAs with Grosse Point Blank, another Cusack/Pink production, sound tracking is everything, and naturally given the setting of the story there is an abundance of classic tunes to delight in. All told it's a special movie, for all sexes and for all music lovers, but especially for anyone who has had relationship problems. Now what did come first, the music or the misery? Priceless. 9/10", "created_at": "2015-07-06T12:03:48.454Z"}, {"movie_id": 243, "review_id": "5ff361ec66e4690040c2dd15", "rating": 8.0, "review_text": "Seen this one a few times over the years, still great each viewing with John Cusack in his element, might even argue should've been nominated for an Oscar. I'm not a music fan but still liked that element and features a good supporting cast. **3.75/5**", "created_at": "2021-01-04T18:43:56.495Z"}, {"movie_id": 243, "review_id": "62e0ac809451e70222aae92a", "rating": 5.0, "review_text": "**_Romantic head games become tedious_**\r\n\r\nReleased in 2000 and directed by Stephen Frears, \"High Fidelity\" is a romcom/dramedy starring John Cusack, as Rob, the owner of a Chicago record store, co-starring Jack Black and Todd Louiso as his two employees, Barry and Dick. When Rob's relationship with his live-in girlfriend, Laura (Iben Hjejle) falls apart, he reflects on the five worst break-ups of his dozen years of dating. His past girlfriends are played by Catherine Zeta-Jones, Joelle Carter, Lili Taylor and Natasha Gregson Wagner. Tim Robbins appears as Rob's rival for Laura's affections while Joan Cusack is on hand as Laura's sister. Lisa Bonet plays a rocker chick, a passing fancy for Rob. Sara Gilbert has a bit part.\r\n\r\nWhat's interesting about \"High Fidelity\" is that it features the five general prototypes of guys' dating life: (1.) the first crush & kiss, (2.) adolescent urgency & loss of virginity, (3.) the hot babe out of his league, (4.) the rebound best friend & soul mate, and (5.) his one true love (maybe).\r\n\r\nIf you've ever made a compilation tape for a babe and worked at a record store you might appreciate this film. You'll particularly like it if you favor romantic head games, which I find irritating and is the main reason I have mixed feelings about the film (speaking as a one-woman type of guy). Because of this, I had a hard time staying with it, although there's enough good in the movie to make it somewhat worthwhile. It's witty and you can tell the creators put a lot of thought into it, but Rob's mopey reflections as he constantly speaks to the camera get tedious after a while. Don't get me wrong, John pulls off the challenging lead role and does so convincingly; I just found his perpetually-smoking character uninteresting. As far as the soundtrack goes, the 90's pop rock struck me as mostly bland.\r\n\r\nThankfully, there are several amusing moments. For instance, the scene where someone confronts Rob at the record store in the second half is laugh-out-loud funny, but Rob's relationship with Laura is decidedly Uninteresting; and Laura's emotional instability and indecisiveness become increasingly annoying (anyone who would marry such a relationally fickle person would have to be insane). Actually, most of Rob's romantic relationships become annoying although, like I said, there are amusing bits. Then there's Barry who arrogantly thinks his opinion on music is law; I kept hoping he'd get his teeth knocked in. On a positive note, the mental manipulations of Rob's unstable romantic life are offset by Dick, who shows the way to go.\r\n\r\n\"Empire Records\" (1995) is the better movie simply because it doesn't go overboard with the dating/romance head games crap.\r\n\r\nThe film runs 113 minutes and was shot in Chicago.\r\n\r\nGRADE: C", "created_at": "2022-07-27T03:09:52.090Z"}]