[{"movie_id": 840326, "review_id": "645c30ea0231f20139eac8dd", "rating": 7.0, "review_text": "_Sisu_ is an hour and a half slaughter fest loaded with despicable characters that you will actually enjoy seeing being ripped to pieces.\r\n\r\nIt is a film that endorses its simplicity a bit too heavily, but is an otherwise immensely entertaining piece of popcorn entertainment that will satisfy action junkies.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/05/10/sisu-review-buying-the-golden-farm/", "created_at": "2023-05-11T00:03:54.423Z"}, {"movie_id": 840326, "review_id": "64653c4022931a0153252835", "rating": 5.0, "review_text": "\r\n\r\nSisu is a Finnish film, not from Quentin Tarantino but certainly cut from the same variety of gruesome cloth. The film is visceral and over the top, celebrating slaughter, in a variety of horrifically novel, ways. \r\n\r\nI personally found the whole affair gratuitous, to be honest. What dwelt at the back of my mind and I feel should be remembered, is war is not a joke or a carnival. \r\n\r\nI grew up surrounded by people who lived and in some cases, served during WWII. The few tales they told were sad, often tragic and spoke of people trapped into a reality, not of their making or their wanting.\r\n\r\nOn the upside, Sisu is well paced, exposition driven and has lots of variety in its action. Acting is solid but exposition, is really this flicks, true driver. On a certain level too, this film, recalls spaghetti Westerns, with a WWII, make over. \r\n\r\nIn summary, if you like splatter style films, you'll probably like this, Just keep in mind, real people lived and died in WWII, on both sides. War is not a game, its not an entertainment.", "created_at": "2023-05-17T20:42:40.859Z"}, {"movie_id": 840326, "review_id": "6466b6c6c3514c0100fd0d99", "rating": 9.0, "review_text": "The movie is all action but without special computer effects (at least none that are over the top like almost all Hollywood movies in last decade). It's all killing and blood with some unrealistic scenes but still a lot better than Hollywood stuff of last decade. No woke stuff here. Definitely worth watching for hour and a half of entertainment without political or social propaganda.", "created_at": "2023-05-18T23:37:42.677Z"}, {"movie_id": 840326, "review_id": "64784d80076ce800c50ad3d0", "rating": 6.0, "review_text": "I did quite enjoy this, but you really do have to be prepared to leave your common sense at the door. It's all about a man \"Aatami\" (Jorma Tommila) who having had a brutal WWII already, has taken refuge in the remote Finnish wilderness where he is panning for - and finds - gold. Packing up, he sets off for civilisation but en route, encounters a dishevelled Nazi tank patrol under the command of \"Bruno\" (Aksel Hennie). Initially, they have little interest in the pilgrim, but some gunfire and explosions shortly after he passes them piques their interest and soon the most perilous of manhunts is engaged. The \"Sisu\" myth is based around a person who is not immortal, but who simply refuses to die - and \"Aatami\" certainly fits the bill. He flirts with knives, bullets, landmines and even the noose but death clearly doesn't want him just yet! Can he get his gold to the bank? It is gory, this film, but I found in quite a light-hearted way. Limbs blown hither and tither but somehow not in a menacing, or scary, fashion. Indeed, at times the action is actually mildly entertaining - especially when the women prisoners are given the opportunity for some good old-fashioned revenge. It's told with an hybrid Guy Ritchie or Sergio Leone style, episodically, and for the first hour works quite well. The tail end, though, falls away as the film - always of questionable plausibility - becomes just a little bit too \"A-Team\". There isn't much dialogue to comment on - no bad thing; and the action comes thick and fast in a production that is wonderfully illustrative of the bleakness of this environment (and of some with an human soul).", "created_at": "2023-06-01T07:49:20.037Z"}, {"movie_id": 840326, "review_id": "64cca50e798e0600ad1830bf", "rating": 7.0, "review_text": "There’s a great deal of pleasure to be had in watching one man violently dispatch dozens of evil Nazis, and the WWII action film “Sisu” is a brutal, bloody delight. This midnight movie from writer-director Jalmari Helander embraces a comic book mentality that’s balanced with gory kills, a hearty dose of wit, and a potent story about courage and determination.\r\n\r\nWith the second world war coming to an end, a solitary prospector (Jorma Tommila) in the Lapland wilderness of Northern Finland searches for gold with his last remaining companion: his dog. The pair cross paths with a band of Nazis who have left a path of scorched-earth destruction in their wake. Seeing an easy target, the Nazis steal the man’s large bag of gold. What they didn’t bargain for is that the man they’ve pissed off is no ordinary miner. The prospector is an ex-commando who is the stuff of legends, and he becomes a one-man death squad who will do anything to get his gold back. Unfortunately for the thieves, this means killing every single Nazi that comes into sight.\r\n\r\nThe film’s title comes from the Finnish concept of “sisu,” a white-knuckled form of courage and unimaginable determination in the face of overwhelming odds. It’s a kick-ass idea to build a story upon, and Helander creates a myth that seems both outrageous yet plausible. The film is divided into chapters, each adding another level of depth to the narrative (including an unexpected and rousing piece that celebrates female empowerment). Viewers looking for nonstop action may find the film to be slow in parts, but the character development is well done (in reality, the pacing is almost perfect).\r\n\r\nHelander understands the real reason you’re here, though: to watch a good old fashioned Nazi massacre. Once the violence starts, it does not disappoint. There are shootings, stabbings, hangings, immolations, and all manners of complete annihilation. Body parts fly, men are crushed by tanks, and a horse explodes, just to name a few. As the kills pile up, the cheers for the body count of dead Nazis grow louder.\r\n\r\n“Sisu” is a skillfully crafted action film that’s a ton of fun. There’s plenty of bloody killing, but also an absorbing dramatic arc that quietly builds into a deafening crescendo.", "created_at": "2023-08-04T07:13:18.799Z"}, {"movie_id": 840326, "review_id": "64cf1ca9303c85013a150ee2", "rating": 9.0, "review_text": "This is gourmet action food. If you think Marvel heroes are great, they pale compared to this guy. Or, if you just like watching Nazis get the living shit beat out of them, (I know I do) this is the film to watch. Or maybe you just want to see raped women get empowered for revenge. Sisu has all that. And it's bloody.\r\n\r\nI also love words that have no direct translation to English, like the Portuguese word soldade, or the German Schadenfreude. Now I've learned another, the Finnish word Sisu: A white-knuckled courage and unimaginable determination.", "created_at": "2023-08-06T04:08:09.098Z"}]