[{"movie_id": 101299, "review_id": "529a2a2619c2953dd104a0c3", "rating": null, "review_text": "Good :3", "created_at": "2013-11-30T18:10:46.301Z"}, {"movie_id": 101299, "review_id": "529c0a46760ee30c9c0c0fff", "rating": null, "review_text": "Awesome movie!", "created_at": "2013-12-02T04:19:18.428Z"}, {"movie_id": 101299, "review_id": "541542490e0a261c35000ffb", "rating": 6.0, "review_text": "I still do not agree with the 9 and 10 star ratings but I feel this movie is slightly better than the first one. This is primarily because Jennifer Lawrence’s character is more mature and she seems more comfortable in the role. She is no longer an immature, naive and lost child. At least not most of the time.\r\n\r\nThe entire setup is still as ludicrous as before. It is a silly and depressing background scenario and it is definitely not my cup of tea. The people running around in ridiculous hair-do, makeup and showing a severe lack of intelligence is not making things better.\r\n\r\nThe enjoyment of this movie comes when the games finally start. These parts are definitely better than in the first movie. The various dangers are well done, the effects good and there is an interesting overall theme to the arena and the dangers instead of randomly throwing new menaces at players that seemed to be the strategy in the first movie.\r\n\r\nTo me the enjoyment of this movie is in the games themselves. This is probably because I just do not like the rest of the plot. The depressing scenario. The nonsensical and/or oppressive behavior, backstabbing etc. etc.", "created_at": "2014-09-14T07:22:49.805Z"}, {"movie_id": 101299, "review_id": "54d9b259c3a3687ab5000fa3", "rating": 4.0, "review_text": "More of the same stuff.\r\n\r\nLawrence is not bad and I think Josh Hutcherson is a great discovering but that's mostly it.", "created_at": "2015-02-10T07:25:13.679Z"}, {"movie_id": 101299, "review_id": "58a8c9679251410a0e002e67", "rating": null, "review_text": "This is a sequel to 2012's HUNGER GAMES, and is set in the same future world: a post-apocalyptic world where an Empire, called Panem, has imposed peace on the survivors only to decay into brutal tyranny. The symbol of the tyranny is the Hunger Games, a gladiator-type combat where only one \"victor\" is permitted and the rest of the fighters die. To keep the flow of victims coming, 12 districts of Panem are required each year to supply a teenage boy and girl for the fight, ostensibly as punishment for decades-old rebellion.\r\n\r\nThe theme of this movie is the moral issues over how to oppose such tyranny. Katniss Everdeen ( Jennifer Lawrence), the spirited girl who won the previous year's Games, wishes to stop the oppression, but fears that outright revolution will hurt too many people. There is another character (whom I won't identify to avoid spoilers) who doesn't care how many people are hurt as long as the revolution is advanced. Many of the subjects of the Empire are resigned to submitting until some messianic deliverer will appear. Meanwhile the ruthless President-for-life Coriolanus Snow ( Donald Sutherland) is determined to destroy the rebels before they can get organized. Who will win out? Therein lies the suspense.\r\n\r\nThere are enough special effects to make the futuristic background and technology credible without overwhelming the movie.\r\nAside from Lawrence and Sutherland as the impressive antagonists, the movie has a strong supporting cast: Woody Harrelson as Katniss's shrewd but alcoholic mentor; Liam Hemworth and Josh Hutcherson as two boys representing the aggressive vs sensitive sides of Katniss's character; Elizabeth Banks as a kindly but naive woman oblivious to the tyranny; Oscar-winner Philip Hoffman as Snow's Machiavellian adviser, and Sam Clafin, Jeffrey Wright, and Jena Malone as formidable former victors drawn into the conflict.\r\nThe movie's only real flaw is that being part of a continuing story keeps the plot from being resolved in the end.", "created_at": "2017-02-18T22:23:35.686Z"}, {"movie_id": 101299, "review_id": "5f349ec693828e00343c1a87", "rating": 7.0, "review_text": "Good watch, would watch again, and can recommend.\r\n\r\nThis is a great survivalist story in a horrible setting (wonderfully set, written to be a horrible world).\r\n\r\nWe get all the great fun that we got from the original movie, and then we add in the whole (spoiler) element.  It's really what makes the movie and leads us into the next arc, but I won't mention it.\r\n\r\nWith Snow just on an angry tantrum spree (literally using childish tantrum words) you can tell very early that he's defeated himself, it's just a matter of time.\r\n\r\nJennifer Lawrence is a big enough personality to carry the movie and she does with everyone else playing support roles centered around her.  It was fantastic to see Jena Malone come on board as I feel she adds something special to everything she's in.\r\n\r\nIf you can stand the battle royale concept, this this is a good watch for you.", "created_at": "2020-08-13T02:00:38.165Z"}, {"movie_id": 101299, "review_id": "6269079f64f716160d0ea5ff", "rating": 6.0, "review_text": "Having survived the 74th Hunger Hames, \"Katniss\" (Jennifer Lawrence) and her on-screen beau \"Peeta\" (Josh Hutcherson) now expect to live a life of luxury in their victor's village - but nope, devious president \"Snow\" (Donald Sutherland) has other plans for them. Having dispensed with the services of poor old Wes Bentley, he brings in Philip Seymour Hoffman (\"Plutarch\") to create a sort of Champions League affair with previous - supposedly forever exempt - winners to come back for a \"quell\". It's a good excuse to bring in some old blood two help out the youngsters - Jeffrey Wright (\"Beetee\") probably most notable amongst them, and we pretty much repeat the perilous escapades of the first film. This time, though, the threads of an uprising and a more collaborative approach to resistance start to win through; we see our combatants start to use their heads more, to thwart the divisive aims of their president and the story starts to gain a bit more momentum. Sadly, though - pretty as they are; the acting is still really weak. Lawrence just doesn't engage with me and the new \"Finnick\" (Sam Claflin) character again offers eye candy a-plenty, but squashing a cutie into lycra doesn't make him any better an actor. To be fair, they don't have a great deal by way of decent dialogue to deliver as almost all of this is an exercise of advanced CGI. The ending does, at least, offer us promise that the third leg of this franchise will offer more scope to vary the theme a bit, but as far as this is concerned, it's nothing at all special.", "created_at": "2022-04-27T09:06:39.328Z"}]