[{"movie_id": 1056360, "review_id": "6588c7ebb7b69d08626d7134", "rating": 6.0, "review_text": "It’s frustrating to watch a much-anticipated movie that doesn’t quite live up to expectations. Such is the case with writer-director Cord Jefferson’s debut feature. The problem here is that the film tries to tell two stories in one picture, one that it does brilliantly and one that could use some serious trimming, because the inclusion of its segments interrupts the flow every time it comes up during the course of the narrative. This tale of a talented but commercially unsuccessful African-American author (Jeffrey Wright) laments the success of a younger peer (Issa Rae) who writes a best-selling “Black” book that he sees as little more than market-pandering rubbish. However, in response, when he does the same under a pseudonym as a means of protest, he becomes an overnight sensation for all of the artistic and readership considerations that he personally despises. He now has to ask himself how can live with that kind of success, especially when the title becomes a runaway juggernaut. As he struggles with this, he’s also faced with a family drama with the death of a relative, managing the future of care for his Alzheimer’s-afflicted mother (Leslie Uggams) and a ne’er-do-well, self-centered sibling who’s reluctant to help out (Sterling K. Brown). Unfortunately, the domestic story thread is overlong and tends to bog down the satirical social commentary/personal integrity aspects of the picture, which are really strong enough to stand on their own and should have been given wider play (fault the screenplay here). Despite its shortcomings, however, “American Fiction” definitely deserves kudos for the performances of its ensemble cast, especially Wright, who turns in his best work here and has garnered a number of awards season nominations already, with more undoubtedly to come. In all, though, this feels like an offering that’s half-baked for what it serves up, which is regrettable, given that, with some shoring up in the writing, this easily could have become a modern screen classic.", "created_at": "2023-12-25T00:08:11.695Z"}]