[{"movie_id": 37735, "review_id": "52b7d6d9760ee31dd908cc3e", "rating": null, "review_text": "This movie while extremely entertaining is actually also very educational. You might discover a whole bunch of new words for your vocabulary and even learn a little bit about englisch literature. Makes me smile every time I watch it.", "created_at": "2013-12-23T06:23:21.819Z"}, {"movie_id": 37735, "review_id": "5624c253c3a3680e1d012394", "rating": 7.0, "review_text": "Fresh comedy. Sometimes funny, but not too much. The cast is good and I like Emma Stone a lot, but she cannot pass as a high school student any more.\r\n\r\nIt could have been much better if the story would have worked better, in spite of the sometimes brilliant dialogues.", "created_at": "2015-10-19T10:13:39.066Z"}, {"movie_id": 37735, "review_id": "58ac431592514158df0135bc", "rating": 9.0, "review_text": "When I first saw the trailer of Easy A, I wasn't particularly intrigued. It looked like just another high school teenage comedy. But then I decided to watch it anyway (mostly because I wanted to know what all the fuss was about), and it turned out to be a very pleasant surprise! Coincidentally, I had just seen Emma Stone for the first time two days ago, when I watched Zombieland, and I thought to myself, \"Hey this girl seems kind of cool\". But that still wasn't an answer as to why right now I can't read a single magazine without seeing her face somewhere. After seeing Easy A, I finally know. This girl is FUN. She has a great talent for comedy of the driest, most sarcastic kind and a perfect sense of timing. And you've got to love that husky voice.\r\n\r\nEasy A is about a girl, Olive, who's a straight A-student with a flawless reputation, until she tells a little white lie to her best friend about how she supposedly lost her virginity to a guy that doesn't even exist. However, things go awry when this little anecdote spreads like wildfire and all of a sudden she has a reputation of being a hussy. (This plot line demands some suspension of disbelief, because it's obviously very hard to believe that any group of high school students would be shocked at the thought of one of their peers _*having sex*_, but whatever.) Of course, like with any rumour, it changes constantly depending on who you talk to. So before Olive knows what hit her, everybody in school thinks she slept with every guy around. Now here's the twist: once it becomes clear that she can use this newfound reputation to her advantage, she does so to the fullest. Simply put: unpopular guys pay her to PRETEND she had sex with them. Obviously, at some point things get out of hand and she has to find a way to fix it all again.\r\n\r\nThis concept could have been really stupid, if it wasn't for the great screenplay. It is a tribute to classic 80's teenage films including, of course, John Hughes, and it also features some great references to The Scarlet Letter and Sylvia Plath. The dialogue is quick and witty, and the characters are all really typical people without being cliché stereotypes. Stanley Tucci is a delight as Olive's dad, bringing the same kind of dry-as-a-bone humour to the table as his on-screen daughter. Patricia Clarkson is a wonderful actress, and as it turns out, a really funny one as well. All the actors are perfectly cast.\r\n\r\nOne of the funniest elements in Easy A is a group of Christian students, the 'Jesus freaks'. The leader of this little group is a girl called Marianne, played by Amanda Bynes. She just can't stop preaching to Olive about her 'indecent behaviour' and the dialogue between the two provides some of the funniest moments throughout the film. Here's a small foretaste; Marianne: \"There's a higher power that will judge you for your indecency.\" Olive: \"Tom Cruise?\" \r\n\r\nOverall, this is mostly a 'chuckle' comedy rather than a 'rolling over the floor laughing' comedy, though it has some really good LOL moments. And the 'chuckles' are widespread.\r\n\r\nI would definitely recommend watching Easy A if you're in the mood for a witty, intelligent comedy about a smart, sassy girl who takes control of her own life and everybody who thinks they have a right to think badly about her.\r\n_(September 2011)_", "created_at": "2017-02-21T13:39:33.114Z"}, {"movie_id": 37735, "review_id": "593d7434925141058f021668", "rating": 6.0, "review_text": "Pretty far removed from my wheelhouse, but Emma Stone makes for such a great lead, the banter-y dialogue given to the adult roles (most masterfully spoken by Stanley Tucci) is so hilarious, and the story flows so naturally from A to B to C that you can't stop for long enough to question the flaws while you're watching it, that there was no way I couldn't at least give Easy A a passing grade (no pun intended).\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2017-06-11T16:47:48.822Z"}]