[{"movie_id": 615777, "review_id": "639d2edd4f33ad00d5328c9d", "rating": 5.0, "review_text": "A fecal, anal honking, and vomit-infused tale revolving around orgy-driven slaphappiness and punchdrunk intoxication as the silent movie era disjointedly stumbled into sound and talkies. Channeling the likes of Michel Hazanavicius’ _The Artist_ and _Fear and Loathing in Las Vegas_ with a rhythmically chaotic boogie seemingly torn right out of Gasper Noe’s _Climax_, _Babylon_ is an aggressive assault of the senses loosely thread together by cinematic evolution and dwindling fame.\r\n\r\n**Full review:** https://boundingintocomics.com/2022/12/15/babylon-review-requiem-for-the-silver-screen/", "created_at": "2022-12-17T02:52:13.281Z"}, {"movie_id": 615777, "review_id": "63b89209028f14007ff9ffec", "rating": 9.0, "review_text": "Babylon is debauchery at its finest. It encapsulates an era like no other and dares to be so different, yet so appealing. On the surface this film is a very straightforward plot, following our three leads and their attempts at success in the ever-changing world of cinema. But deep down, there is another message that is so relevant to everyone's life: accepting death/irrelevance.\r\n\r\nJust as fast as our characters achieve their dreams of being stars in the industry, these dreams are quickly whisked away by the brutality and cutthroat nature of Hollywood. This is juxtaposed with Brad Pitts character, a man already on downward spiral of his career, trying to desperately hold on to what remains. These arches are so honest and vulnerable, I found very compelling.\r\n\r\nThe performances were top notch all around, and I would expect nothing more from a stacked cast of actors including Margot Robbie and Brad Pitt. But the surprise of the bunch was Diego Calva. He was fantastic and stole many scenes he was featured in with both Robbie and Pitt. He is the true lead of this film and does an excellent job bearing the load.\r\n\r\nI really enjoyed almost aspects of the film, but towards the end there are some sequences that I feel got away from Chazelle. They are so over the top and kind of feal out of place in this somewhat grounded story. The tension is there in these scenes, but it just doesn't fit. This whole subplot could have been shorten tremendously helping reduce the bloated runtime of the film.\r\n\r\nThat being, I never really felt the length of this picture with it being quite well paced. Overall, this movie was real treat, and it is quite a shame that marketing was jumbled up so poorly because this film deserves viewership.\r\n\r\nScore: 88%\r\nVerdict: Excellent\r\nTheatre Verdict: See It", "created_at": "2023-01-06T21:26:33.556Z"}, {"movie_id": 615777, "review_id": "63ce7f173c434400ceed852b", "rating": 7.0, "review_text": "It's a sort of triptych of stories of Hollywood, this. A tale that starts off with all the excesses and hedonism of the cocaine fuelled, sexually lascivious antics where even an elephant isn't too much for a party hosted by a movie mogul. It's here we meet the three characters who provide the thread for the rest of this maelstrom of a movie. Firstly we have the young, naive, but quick-thinking \"Manny\" (Diego Calva) who manages to attract the attention of the much-married, established and former silent screen star \"Jack Conrad\" (Brad Pitt) all whilst Margot Robbie's ambitious and outrageous \"Nellie LaRoy\" is sniffing, snorting, dancing and generally sexifying everything she touches as she bids to get into the acting business. What now ensues is a really well crafted and thoughtfully entertaining tale of the rise and fall and rise and fall of these three characters and of how their success brings failure as surely as the sun comes up. Robbie is on excellent form, a truly convincing performance as a character ill-equipped for the journey she is so determined to undertake. Pitt, likewise, plays well here. His character has less in the way of shock factor to deliver, but that storyline offers us a rather more effectively stolid appreciation of just how fickle success can be: there, then gone - in what might seem like a blind of the eye. Finally, the aspirational but (initially) more measured, head-screwed-on Calva who falls in love, and ends up trying to fight the inevitable like King Canute! There's a quirky effort from Tobey Maguire, an alligator and a rat-eater; and a rather scene-stealing contribution - especially at the end - from Jean Smart's Hedda Hopper-style gossip journalist \"Elinor St. John\" - possibly the only honest character in the entire thing! It's a pastiche and/or an homage to all things cinema at a time of the gradual emergence and then dominance of sound pictures, and we are frequently exposed to the car-crash lifestyles as everyone adapted, re-adapted, and continued to stay on their toes as their industry and their audiences did not always want to take everyone with them - and at break neck speed too - as tastes changed. It's got everything from Cecil B DeMille to Baz Luhrmann to it, takes a swipe at the pompous-thinking stage theatricals (from the East Coast), the shallowness of the whole industry - and yet, it never loses a sense the these are still people. Human beings! It is not difficult to imagine Kenneth Anger advising on the script - it \"could\" all be true\". Maybe a bit on the long side, it certainly sags now and again - but it's definitely a big screen experience that delivers solid, engaging performances that are not over reliant on - even, rather comically (and dangerously) illustrating just how films were made before - CGI! No point in waiting for this to come to television - it's a must for the cinema around which it's story is told.", "created_at": "2023-01-23T12:35:35.790Z"}, {"movie_id": 615777, "review_id": "6420c84e68929c007c43841b", "rating": 6.0, "review_text": "Some great production and costume designs and the performance from Margot Robbie was great while Brad Pitt was good but seen better from him, and the opening 30 minutes were wild but otherwise this was far too long and nothing terribly memorable. **3.0/5**\r\n\r\nI did forget this was the movie that proved Margot Robbie and Samara Weaving are indeed different people... :p", "created_at": "2023-03-26T22:33:50.309Z"}, {"movie_id": 615777, "review_id": "652c87bf72c13e00c630e1ce", "rating": 6.0, "review_text": "_Babylon_ is a visually stunning and stylish film with it’s share of pros and cons. On the one hand, the performances by Brad Pitt and Margot Robbie were outstanding. They truly brought their characters to life and added depth to the story. However, I found that the storyline didn't flow smoothly, and at times it felt disjointed and confusing. Additionally, some of the more grotesque scenes were overly exaggerated, which detracted from the overall experience. Another downside was the length of the movie, which at over 3 hours, felt excessive.", "created_at": "2023-10-16T00:45:51.105Z"}]