[{"movie_id": 209112, "review_id": "56f4f0bd9251417a440017bd", "rating": null, "review_text": "Awesome moview. Best Action sequence.\r\n\r\n**Slow in the first half**", "created_at": "2016-03-25T08:03:09.926Z"}, {"movie_id": 209112, "review_id": "56f7944bc3a3686a5c005e1d", "rating": null, "review_text": "One would think that the ultimate showdown between two of the most iconic super-heroes would make for some downright compelling action-oriented exploits against a landscape of angst and destruction. Plus, it certainly did not hurt that exhilarating filmmaker Zack Snyder (‘300’) was at the helm in bringing together the colorfully and concocted confrontation between The Caped Crusader and The Man of Steel. Also, it should have been an effortless task to bring together **Batman v Superman: Dawn Of Justice** leading men Ben Affleck and Henry Cahill since they had prior experiences donning heroic attire as mighty super-heroes on call to save the day. So why then does Snyder’s big-budgeted connect-the-dots comic book caper feel so incoherently stiff and aimless?\r\n\r\nThe dour randomness of **Batman v Superman: Dawn Of Justice** is quite disappointing because this moping actioner wants to grab more than it can chew in its crowded mouth. Snyder and screenwriters David S. Goyer and Chris Terrio aspire to plug in such contemplative issues pertaining to moral ambivalence, political platitudes and religious themes but none of these factors energize or sustain this action-packed narrative that seems to slouch all at the expense of a sluggish approach to the mechanical hedonism that labors.\r\n\r\nThere is no doubt that **Dawn of Justice** has its share of visual opulence as this is obviously expected in an expansive superhero saga where the proven selling point are two mythical comic book titans spearheading the pumped-up proceedings. Again an overreaching script that plods along, a couple of super-powered sourpusses going the moody motions and the lack of carefree robust action undermine the potential explosiveness that **Dawn of Justice** could have capitalized on with dynamic aplomb.\r\n\r\nSure, there is a noted curiosity and interesting element about the topic of “heroism fatigue” and hidden demons that could have certainly contributed to the psychological strain for our Caped Courageous Ones. Still, **Dawn of Justice** never quite turns this premise into a sparkling case of burn-out conviction, Instead, knuckle-dragging duo of Bruce Wayne/Batman (Affleck) and Clark Kent/Superman (Cavell) make the common sleeping pill look like an excitable bag of M&M candy treats. Thankfully, another fan favorite superhero in the form of Wonder Woman (Gal Godot) is thrown into the mix to break up the monotony of the boorish Boys Club. Unfortunately, the appearance of the wily Wonder Woman during the tail end of the second half is too little and too late for her welcomed presence to rescue the film’s clunky pacing.\r\n\r\nGotham’s Bruce Wayne and Metropolis’s Clark Kent are experiencing setbacks that could be perceived as reaching the depressive crossroads. For starters, a maturing Wayne’s/Batman’s crime-fighting prospects have been tailing off drastically. As for Kent/Superman his existence at the Daily Planet newspaper seems mundane especially when his boss in editor Perry White (Laurence Fishburne) declares that the public has moved away from print given the major impact of social media and other online resources. So yes…Wayne and Kent are in a critical funk in their professional lives both in and out of their familiar costumes. However, can the slumping cities afford two down-and-out superheroes when one can probably carry the load in rough, unsure times?\r\n\r\nWhen the film establishes the dilemma that there can be only one muscle-bound ego to handle the affairs of the region’s unprotected this is where the **Batman v Superman** portion of **Dawn of Justice** looks as if the frenetic fantasy will percolate. Inexplicably, the hype involving the sparring twosome is put on hold as the exposition takes its tedious time building up the conflict to satisfy the clashing insecurities of the capable caped crime-stoppers. For those that witnessed Cavell’s mediocre **Man of Steel** a few years ago will probably understand the current bad blood that exists between the two super studs. Whatever the case both Batman and Superman have pegged each other as brawny bad news ambassadors…something that does not sit well with either struggling superhero as their revered reputations are on the line.\r\n\r\nNaturally, there are other outside forces to consider as the acrimonious overtones continue to flow between the brooding mega-powers. The famed instigator in Superman foe Lex Luthor (Jesse Eisenberg) is realized as the high-tech billionaire nuisance that has an underlying scheme to eradicate both bickering super powers once and for all but not before Luthor pronounces his take on philosophical tirades. In the meantime, Lois Lane (Amy Adams) is on board to profess her undying love and support for her desired dreamboat Superman. Luthor loathing Superman while Lane fantasizing about her strong flashy fly boy. In other words it is business as usual. While Superman is trying to figure out his place in the sun Snyder piles on the bothersome dreamy anxieties that plague the aging Wayne.\r\n\r\n**Batman v Superman: Dawn of Justice** is a jumbled mess. Snyder undertakes a convoluted production and tries to sell it as a sophisticated meeting of the misplaced minds between two embattled entities embroiled in uncertainty and super-sized cynicism. Still, Snyder’s vision is mishandled as he seems to have forgotten one crucial point–simply making an action movie that registers with genuine thrills. One cannot help but stumble upon the pretentiousness and piousness that ruins this boneless blockbuster. The film finally decides to stack on the combinations of boisterous match-ups involving everyone but the kitchen sink but all comes off as frivolously forced. Cavell was never really an enticing Superman ever since he donned the big “S” on his chest back in 2013’s** Man of Steel**. Affleck’s Batman is a little more palatable but the constant scowl (both on his face and on the mask) is too much to digest. One would not mind yelling at the screen for Affleck’s alter ego to lighten up a bit.\r\n\r\nThe supporting players are virtually wasted in this exhausting CGI popcorn pleaser. Eisenberg, normally a trustworthy performer with considerable scope, merely irritates as the punkish techno-magnate Luthor. The always radiant Adams is a wash as the gushing Lois Lane. Oscar-winner Jeremy Irons’s Alfred the butler won’t make anyone forget Micheal Caine’s take on Wayne’s trusty man servant anytime soon. Even the reliably adventurous Oscar-nominated actor Michael Shannon cannot exuberantly bring to life the menacing presence of Zod.\r\n\r\nHumorless and hackneyed, **Batman v Superman: Dawn of Justice** will probably satisfy indiscriminate devoted fans that will buy into the proposed heralded rivalry. As for others, they will wonder what lies ahead in terms of other League of Justice movies that hopefully can muster up more entertaining stimulation than this over-indulgent doomsday dud. Is anyone up for **Wonder Woman vs. Redwing** with an empowering feminine twist?\r\n\r\n**Batman v Superman: Dawn of Justice** (2016)\r\n\r\nWarner Bros. Pictures\r\n\r\n2 hrs. 30 mins.\r\n\r\nStarring: Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Laurence Fishburne, Jeremy Irons, Diane Lane, Gal Gadot, Holly Hunter, Michael Shannon, Ray Fisher\r\n\r\nDirected by: Zack Snyder\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Fantasy/Action and Adventure/Superhero Saga\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng", "created_at": "2016-03-27T08:05:31.061Z"}, {"movie_id": 209112, "review_id": "56f7d0b1c3a3686a6e006e46", "rating": null, "review_text": "A bit slow but overall good. There are many sub plots in the movie that could've been made into independent movies of their own.", "created_at": "2016-03-27T12:23:13.365Z"}, {"movie_id": 209112, "review_id": "5787d205c3a368391d0014b7", "rating": 8.0, "review_text": "> Know your enemy's weakness before challenging to a fight!\r\n\r\nIt is known that critics have no brain. It is the best Superman film as Henry Cavill in the red and blue suit. Yep, I know it is always DC versus Marvel, so it is then DC's reply to the 'Avengers'. I don't care their rivalries, as a film fanatic, I enjoy good films and I found it was so good. But I was a bit worried after the Superman was shown in a dark shade in the trailer, especially after Batwan was overly stylised by Nolan, I thought the black suit would take over. After watching the film I was relieved and happy that Batman was exposed.\r\n\r\nBatman fans might have been disappointed, but for the superhero and DC fans, this film is a great treat. You can't compare it with 'Avengers', it had its own style. It follows the 'Man of Steel' and directed by the same director. Excellent cast. I have never been the Ben Affleck hater, so I had no objection to his role in this. He did good along with Cavill and others. He would do better in his solo Batman films if Zack Snyder is retained to script and direct them.\r\n\r\nI'm not a comic book reader, so I did not know the story before the watch. I was surprised for the Wonder Woman's part in the film. The visuals were awesome, the story was unpredictable, well developed characters, cleverly composed scenes, wonderful stunt sequences and the film's overall tone was kind of dark and gloomy, a very satisfying superhero film. The content balance was perfect, but the characters did not do the same as we know Superman is a father of all superheroes.\r\n\r\nI already watched it twice and I can't wait for its sequel. Especially looking forward for Jesse Eisenberg, because he was kind of stayed low in this and I hope his character Lex becomes much stronger. It is a PG13, and there's nothing botherable stuffs in it for the underage audience, but I felt it is targeted for adults because of the matured flavour. Don't think about that I said, just watch it, it will definitely entertain you well if not blow you away. Surely recommended to all.\r\n\r\n8/10", "created_at": "2016-07-14T17:55:17.303Z"}, {"movie_id": 209112, "review_id": "57acf1f9925141587700033c", "rating": null, "review_text": "I still have faith in the DCU but this movie had problems. Watch my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/bvsreview", "created_at": "2016-08-11T21:45:29.140Z"}, {"movie_id": 209112, "review_id": "5a6353120e0a2619fe00e820", "rating": 2.0, "review_text": "As I write this review I have just had a thoroughly disappointing movie experience and it so just happens that I have some strong feelings about the source material for this movie so be prepared for a bit of ranting and a few more “adult” words than usual.\r\n\r\nI have to say that I bought this movie only because I felt I wanted it in my collection just for it to be complete. I was really expecting to be, shall we say, not impressed. A movie about Batman and Superman, heroes that I grew up with, fighting is not my kind of movie.\r\n\r\nIn the end I realized that my expectations of crappines was not enough. I really disliked this movie. In short succession this movie turns several of my childhood heroes to bad guys and the greatest superman bad guy into a unstable hippie-like jerk that goes through the movie behaving like he is a drug addict. So basically this movie went drown the drains for me straight away and then I have not even gotten started about the plot. Actually I felt so annoyed over this crap that I actually spent time taking notes while I was watching.\r\n\r\nLet me see what I noted. Lex Luther is a fucking joke. Alfred, the same. Jimmy Olsen a fucking CIA agent? You got to be fucking kidding me! And not only does he screw Lois Lane but gets himself shot after a few seconds of screen time.\r\n\r\nSame stupid nonsense about XXX being too powerful, is a threat and needs to be government controlled that has been used in hundreds. if not thousands, of crappy low and high budget action movies. I hate that crap. It is stupid, stupid, stupid.\r\n\r\nWeird and totally uninteresting dream scenes, what the f... did the writer smoke? If they wanted to pad the movie it a) was a crappy way of doing it and b) why? With over three hours (Ultimate Edition) it is way to long for such a crappy movie anyway.\r\n\r\nOh, here is a (somewhat) positive note at least. It was indeed rather funny that they had chosen CNN to spew out the nonsense conspiracy theories about Superman being responsible for the bomb in the wheelchair. Fake news anyone?\r\n\r\nI had a little bit of enjoyment of the movie during the last part of the movie when it finally turned into a bit of action. Batman’s car and plane was cool. The action, once Batman getting knocked on his head enough to get to his senses again, was a nice chunk of CGI goodness. That I have to admit.\r\n\r\nOkay, after three, mostly painful, hours the movie finally comes to an end. And what an end. Meh!!! Not only was it a crappy ending but they managed to drag it out forever with excruciatingly boring scenes.\r\n\r\nI am sure a lot of the above can be said to be subjective. For instance my dislike of the way my childhood characters where treated. I am not a professional reviewer though so this is my personal take of the movie. If you don’t like it, fine with me and good for you but do not feel obliged to tell me about it.", "created_at": "2018-01-20T14:32:50.041Z"}, {"movie_id": 209112, "review_id": "5ad757419251413b2b010380", "rating": null, "review_text": "Very short synopsis : Batman has been hit hard by the events of Man of Steel : a \"god\" descends on earth, is confronted by another god, and they fight, killing thousands of humans. He learns about a rock coming from his birth planet that can weaken or kill him. It's the property of Lex Luthor, who could target Superman too, but with evil purpose.\r\n\r\nSo I won't go deeper in the story. This movie, unlike most other superhero movie, is targeting adults. I don't mean 18 or 21 year old, I mean mature beings that have endured bad things in life, and have taken the time to see the goods and bads of humanity. Yes, not the Marvel (Guardians of the galaxy, Ant man) target audience. Batman makes it clear (rejoined by the senator) : if a being is so powerful he can't be killed and can kill thousands, even if for now he does good, what happens if he becomes a villain? What laws or weapons can stop him?\r\n\r\nNow going back to the movie and how it presents its argument. We have Batman's introduction to the new DC movie universe (death of parents, tortured psyche ...) done during the opening credits. That is both efficient and powerful. Then we see Bruce Wayne at the time of the Superman / Zod battle. We also see humans being scared and killed. So, yeah it's superhero movie making not showing merry world with superheroes saving humans. And doing funny quotes. It's people (or super people) facing tragedy and growing up to see how the future has to be settled. And then a new villain appears. Or rather, he appears as a careless billionnaire showing off - how could he be perceived as dangerous? He has the chance of having Batman wanting to take down Superman, when he wants the same thing, so he can go for his secondary plan to use Krypton technology to change the world.\r\n\r\nSo the last part of the movie is the fight of 3 super heroes against a creature created by the \"god\"'s technology and humanity's madness/evilness. Yes, it's not a villain that is there because you need one to fight the bad guys, it's yet another consequence of Kryptonians coming to earth.\r\n\r\nSo the films rolls out and I'm so stunned by the content I feel I was treated as a human being, not as a popcorn eating teenager or a comics fan. Just as someone that could appreciate great movie making.", "created_at": "2018-04-18T14:33:37.845Z"}, {"movie_id": 209112, "review_id": "605088d424b3330053085bb9", "rating": 10.0, "review_text": "I don't understand the hate people had with this film. I thought it was brilliant.\r\nSure, I had my doubts of Gal Gadot as Wonder Woman, but halfway through the end those doubts were put to rest.\r\nAnd Ben Affleck was amazing as the latest incarnation of Batman. It was a long time since the actor did a superhero movie (Daredevil).\r\nMy only critique was Jesse Eisenberg's portrayal as Lex Luthor - really cringing for me. Didn't do justice for the character (no pun intended)! Michael Fassbender would've been a more suitable role.\r\n\r\nAnyway, this film...it was a Zack Snyder masterpiece.", "created_at": "2021-03-16T10:30:44.806Z"}, {"movie_id": 209112, "review_id": "63097c9e7e34830083e9b8c4", "rating": 9.0, "review_text": "**Zack Snyder creates an entire DC universe in one film filled with gritty new takes on familiar characters and brutal action.**\r\n\r\nI know this is a polarizing thing to say, but I loved this movie! I think Zack Snyder crushed it with the incredible production design, off-the-charts casting, and gritty take on a lost and weary Batman. The casting for this movie is a master stroke of brilliance. Ben Affleck’s Batman is jaded and bitter, taking his rage and loss out on the criminal element of Gotham. His hulking physique emphasizes Batman’s imposing strength over his gadgets when in combat. Zack Snyder also gave us Gal Gadot as Wonder Woman, which we all know is one of the best choices in the comic book cinema world. The fight sequences are the best part of BvS; pitting godlike power against a man motivated by grief somehow seems possible and brutal because of Snyder’s writing and directing. Finally, the world-building and teases bring so much intrigue and excitement for future films. It isn’t a perfect film, but as a DC and Batman fan, it is one of my favorite comic book movies and stands out as refreshingly separate from all the bright-colored goofy Marvel movies of the time.", "created_at": "2022-08-27T02:08:30.047Z"}, {"movie_id": 209112, "review_id": "63a07e07f44f2700bfbf1416", "rating": 10.0, "review_text": "**Watch the Ultimate Edition!**\r\n\r\nThe first of several DC movies to suffer from WB forcing a mediocre cut of a great film. Before the Snyder Cut there was the Ultimate Edition, Snyder's vision is better presented here in a longer, darker, and more sensible cut of this film.", "created_at": "2022-12-19T15:06:47.682Z"}, {"movie_id": 209112, "review_id": "63bf76c68efe7300f0a22e9e", "rating": 1.0, "review_text": "I actually thought that Ben Affleck did a decent job in the role. He did that Michael Keaton thing where he understood the link between Batman and Bruce Wayne and was able to pull off a good Bruce, and that is really where Batman is, figuring out which one is the mask and playing both accordingly.\r\n\r\nHowever, it starts... abruptly. It starts with the assumption that you have seen the Superman movies, and for viewers that hadn't it comes across as more than a little jarring. You were expected to understand what was happening from the start and, unfortunately, that's not the best way to start a film that doesn't have the number \"2\" after it.\r\n\r\nIt doesn't have that slow build that explains the story, it just kind of starts and moves along as if the audience is already sucked in... and this with a new star as Batman, and a new universe to host him in.\r\n\r\nHad it taken the time to let you get to know the characters first, it would have made for a more compelling and interesting film. Instead it moved along as if no introductions were necessary for either the characters or the world they inhabited and that made a lot of people lose interest fast.", "created_at": "2023-01-12T02:56:06.619Z"}, {"movie_id": 209112, "review_id": "6448604049756002fcdee4f0", "rating": 8.0, "review_text": "One of the best superhero movies I've seen in quite sometime now. Action packed, along with good actors and actresses. Just an overall great movie!", "created_at": "2023-04-25T23:20:32.790Z"}, {"movie_id": 209112, "review_id": "647c77f0caef2d00df8908dd", "rating": 9.0, "review_text": "If you want to see Batman the way he SHOULD be portrayed on screen then this is the movie for you. It's great to see a 'comic' adaptation tackling darker emotions and greyer morals in its heroes. Batman is a bulked-up savage brute, which I applaud, and Superman is prepared to murder to save his mother. This is the only DC movie worth umpteen rewatches.", "created_at": "2023-06-04T11:39:28.058Z"}]