[{"movie_id": 378236, "review_id": "5a1ebeb8c3a3680b9d07575b", "rating": 3.0, "review_text": "**As a thematic where expressions matter the film failed to express!**\r\n\r\nI agree that this film was not good. Not because of bad writing, animation, voice rendered, but the timing of the film coming out mattered. If this same film was released before 'Wreck it Ralf', 'The Lego Movie', 'Pixels', 'Inside Out', then people might have liked it. But now, it is like Sony desperately wanted their version of toys and/or games related film, so they made it. That's how it looks like. Despite all the criticism, the film minted good sum. So it is not a box office flop, only devalued honestly by those who saw it.\r\n\r\nThose titles I mentioned and this story has the same storyline. Basically, that's very common platform where 80 per cent of the films borrow from. The scenes looked very ordinary, like there's nothing much to explore. The jokes were weaker, the characters were uninteresting in most of the parts. I would say they did not utilise them rightly. The good thing is, it is a watchable film, but the majority won't like it. Usually Sony animations were met with underwhelmingly, and seeing the response it had got, surely there will be no sequel, at least for now.\r\n\r\n**3/10**", "created_at": "2017-11-29T14:05:44.729Z"}, {"movie_id": 378236, "review_id": "5ffdac990fb17f003d42d27d", "rating": 2.0, "review_text": "Excruciatingly bad. It's proper rubbish.\r\n\r\nBased on the reputation of this, I knew it was going to be utter tripe. I always wait to watch myself to form my own opinion, but there is no doubt about it - <em>'The Emoji Movie'</em> is truly awful. It's such a lazy attempt, there is absolutely no creativity and there doesn't seem to have been that much care put into this. How about that product placement, also?!\r\n\r\nI will say I do like the idea, you could probably create a fine film with it. However, man did they get the execution incredibly wrong. That's also not good given the cast performances, all of which are quite pathetic. In fairness, they don't exactly get much to work with.\r\n\r\nI'm someone who likes James Corden, but he is terrible here. As is T.J. Miller, while Anna Faris and Maya Rudolph are forgettable. I was disappointed (sorta) not to see more of Patrick Stewart's character, given how much I've heard in recent years; he's barely in it.\r\n\r\nIt's a painful watch, even with a run time of just 86 minutes.", "created_at": "2021-01-12T14:05:13.990Z"}, {"movie_id": 378236, "review_id": "606cff9c5258ae00571f4a64", "rating": 8.0, "review_text": "In spite of this somehow being a movie, the animation and sound was good with enough subtle references to keep adults entertained, while also being fun and bright enough to hold the attention of my kids.", "created_at": "2021-04-07T00:41:00.827Z"}]