[{"movie_id": 533444, "review_id": "5dd0af492d531a0013d8cd27", "rating": null, "review_text": "Best film of the year by far. ", "created_at": "2019-11-17T02:24:09.142Z"}, {"movie_id": 533444, "review_id": "5e2f2c5d98f1f10012fce64e", "rating": 8.0, "review_text": "I went into this blind, but as soon as it was over, I instantly knew I witnessed something special.\r\n\r\nThis is gonna be hard to talk about since the movie doesn’t follow a conventional narrative. Although I believe that these type of movies will stay with you much longer, as the emotional connection you had will be remembered for years. In other words, I will try my best to keep myself collective through out.\r\n\r\n‘Waves’ is an absolute gut punch of a movie. Incredibly unique with its film making and overall presentation.\r\n\r\nFrom ‘It Comes At Night’ to ‘Waves’, Trey Edward Shults is a director to look out for. I still haven’t seen ‘Krisha’ yet. The way he crafts stories and the close examination of these characters feels so close to life. It hit me on a emotional level. I love how the aspect ratio changes whenever the mood changes in terms of tone. There’s some impressive and effective use of camera work through out, but the scenes that stood out for me was every time someone drives, the camera will spin clockwise at the front - which reminded me of ‘It Follows’ clockwork-like spin. There was also some free flowing camera work that also reminded me of Terrence Malick movies.\r\n\r\nThe performances and characters were all fantastic. Sterling K. Brown delivers a fantastic performance as a strict and yet flawed father who’s method of parenting is incredibly demanding. He has a son and a daughter, but in the first half we only see him hang around with his son and sculpt him to be the very best, while not realizing his putting the weight of the world on his sons shoulders. We barely see him with his daughter and when we do there’s a sense of regret on his face, as if the painful realization is killing him.\r\n\r\nNewcomer Taylor Russell truly shines as the heart of the family, which you later find out was from her perspective this entire time. Alexa Demie, Kelin Harrison Jr., and Renée Elise Goldsberry are all terrific, but most effectively was the characters portrayal that was both dynamic and soul crushing. Lucas Hedges is perfectly cast as a sweet young man with one of the kindest smile you could’ve imagined; warm and welcoming.\r\n\r\nThere was a lot of music from Frank Ocean and Radiohead, but it's something that the characters would listen to rather than the directors own playlist. It actually sets the tone throughout. While at times it can get a bit too much music, but that didn’t ruin the overall experience. I don’t know why, but this entire movie reminded me of ‘Moonlight’.\r\n\r\nThe best complement I can give to this movie is how unpredictable it is, because I had no idea where it was going. Putting aside that I went into this knowing nothing, but that wasn’t the reason. It's a long movie, but I was invested the whole time. What took me by surprise is how the movie is structured and how every act unfolds a new chapter. The first act was a rush of energy in terms of pace, but the second act is almost a different movie and feels almost mystical. And every action the characters make will lead a massive impact to other peoples lives...\r\n\r\nBecause when pain and tension rises, expect it to come crashing down and shatter you into million pieces.\r\n\r\n‘Waves’ is great, but really underrated.", "created_at": "2020-01-27T18:30:53.484Z"}, {"movie_id": 533444, "review_id": "5e3b945143250f0019c87914", "rating": 8.0, "review_text": "**_Bleak, but not despondent; brilliant, but not for everyone_**\r\n\r\n>_For me, style always comes out of the character and the substance. Everything we're doing is just to bring you more inside the main character's head - the camera moves, the colours, the music. Everything's just to be honest to Ty and put you through a subjective, emotional experience with that. For me, if you make it about that and aren't just doing style for style's sake, if there's a purpose behind everything, then it's easier to navigate._\r\n\r\n- Trey Edward Shults; \"_Waves_ Director Trey Edward Shults on Crafting His Sensory, Soul-Bearing Family Saga\" (Isaac Feldberg); Fortune (November 15, 2019)\r\n\r\n\"Challenging\" is a phrase you often encounter in film criticism. Certainly the term applies to writer/director Trey Edward Shults's previous films, the unconventional Thanksgiving drama _Krisha_ (2015) and the brilliant but poorly marketed post-apocalyptic thriller _It Comes at Night_ (2017). And although these two films would seem to have little in common with the more social realist concerns of _Waves_, all three share the same thematic DNA, focusing as they do on a family under intense pressure. And yes, all three are challenging in their own way. Another term you'll often hear is \"not for everyone\", and again, that's as true here as in Shults's previous work. Certainly, if you're into formalism, you'll find plenty here to keep you happy; elaborate camera moves, varying aspect ratios, extreme colour correction, unusual shot composition, a sound design which bleeds into the soundtrack/score (and vice versa), a quite audacious shift in focalisation at the half-way point, and a stunningly concise closing shot. On the other hand, it's an emotionally bruising, deeply upsetting film, which takes its sweet time getting anywhere. It also asks much more of the viewer than your average Marvel movie, and some simply won't want to put in the legwork. Nothing wrong with that, of course, and if you consider cinema as entertainment only, I'd imagine Waves will leave you bored and frustrated. However, if you have the patience and are willing to take the journey on which the film wants to bring you, the cathartic rewards are many.\r\n\r\nIn a middle-class suburb in Florida, Tyler Williams (a brilliant Kelvin Harrison Jr.) is a popular high school senior and skilled wrestler, who is deeply in love with his girlfriend Alexis Lopez (Alexa Demie). At home, he has a good relationship with his sister Emily (a heartbreakingly sweet Taylor Russell) and stepmother Catherine (Renée Elise Goldsberry). His relationship with his domineering father Ronald (a sternly intimidating Sterling K. Brown in full-on stare mode) is somewhat strained due to Ronald, himself a former athlete who was forced to retire due to a knee injury, constantly pushing him to succeed. As the film begins, Tyler's shoulder is causing him problems, and although he keeps it a secret, he soon learns he has a Level 5 SLAP tear, with his doctor telling him he'll need surgery and a few months off from wrestling, or the damage will become permanent. Seeing his hopes of getting a sports scholarship falling apart, Tyler ignores the doctor's advice, continuing to wrestle and starting to self-medicate with Ronald's painkillers. Meanwhile, he becomes increasingly acerbic and starts drinking heavily, and when he learns that Alexis is pregnant, his attitude worsens even further. At around the half-way point of the film, the focalisation then shifts to the shy and socially awkward Emily, looking at her burgeoning romance with Tyler's wrestling teammate Luke (a passive and pensive Lucas Hedges). Meanwhile, the Williams family must try to come to terms with a horrific act of violence that could change all of their lives.\r\n\r\nThe most noticeable thing about Waves is the aesthetic audaciousness. Shults was inspired to divide the story in two by Wong Kar-wai's _Chungking Express_ (1994), and what's especially interesting about this bifurcation is that Emily barely appears in the first half and Tyler barely appears in the second, forcing the audience to completely recalibrate themselves vis-à-vis the film's _milieu_. However, for all its narrative gymnastics, it's _Waves_'s visuals that really pop. Working with his regular cinematographer Drew Daniels, Shults's extraordinary formal inventiveness is never an end unto itself and is never showy. No matter how audacious the form becomes, it's always in service of the story, with Shults using the camera thematically rather than as a passive tool of observation. For example, the opening shot is inside a car occupied by Tyler and Alexis, but rather than shoot the scene conventionally in a shot/counter-shot format, Shults positions the camera between the duo, spinning in circles rather than cutting, and completing multiple 360-degree rotations. This immediately inculcates us into their sense of abandonment, exuberance, and enthusiasm for simply being alive (not to mention their passionate love for one another). Before a single line of dialogue has been spoken, Shults has already started telling us who these people are. It's pure visual storytelling, showing rather telling.\r\n\r\nThis kind of form/content correlation occurs throughout the film. For example, in the first half, which is focalised by the restless and propulsive Tyler, the handheld camera rarely stops moving, reflecting his frenetic energy. However, when we shift to the quieter and more withdrawn Emily, Shults changes the tone, employing more static tripod shots and a much slower editing rhythm, which reflects Emily's calmer disposition. Shults also has the palette reflect this ideological shift – whereas the first half is awash in garish blues, reds, and greens, the second has a more naturalistic look. A crucial part of the film's visual identity is the very unusual use of aspect ratio(s). Beginning in 1.85:1, the frame gradually reduces in width until it gets to Academy ratio (1.33:1), which is how Tyler's section ends. Then, at the start of Emily's section, it starts to widen again, eventually reaching 2.35:1. The narrowing ratio of the first half reflects how Tyler feels he's being progressively trapped as things continue to go wrong, whilst the widening ratio of the second half reflects Emily's determination to recover from tragedy and reconcile her family. In short, the first half symbolises an ever-increasing restriction, the second half a gradually discovered freedom. Form and content are tightly bound together, each informing and commenting on the other, with Shults never allowing the form to overshadow the story or become divorced from it.\r\n\r\nAnd all of this is to say nothing of the diegetic lighting, the shot compositions and camera blocking, or the blending of Johnnie Burn's immersive sound design, Trent Reznor and Atticus Ross's discordant score, and the exceptional 32-song soundtrack, featuring material from artists such as A$AP Rocky (\"LVL\"), Kendrick Lamar (\"Backseat Freestyle\"), H.E.R. (\"Focus\"), Kanye West (\"I Am a God\"), SZA with Isaiah Rashad (\"Pretty Little Birds\"), Radiohead (\"True Love Waits\"), Amy Winehouse (\"Love Is a Losing Game\"), Chance the Rapper with Jay Electronica (\"How Great\"), and multiple Frank Ocean tracks. Indeed, Shults had the music in mind from the scripting stage, and took the unusual step of sending any artists whom he hoped to use a rough cut of the film, explaining where and how he wanted to employ their music. He also wrote extensive liner notes for each song for the soundtrack's release.\r\n\r\nGiven the title, it should come as no surprise that the film's most common visual motif is water – the opening shot sees Tyler and Alexis driving across a bridge; they spend a lot of their free time at a bench near the seafront; Tyler falls asleep in a bath, his life seemingly in ruins as water spills and starts seeping through the floor; Emily and Ronald go fishing; Emily and Luke kiss amid lawn sprinklers and later share a bath; Emily jumps into a pond from a tree; Emily, Luke, and their friends swim with manatees; Emily and Luke jump into the ocean from a pier. In all cases, water is soothing and calming, allowing for contemplation and figurative escape, whether it be Tyler trying to wash away the chaos that has engulfed him or Emily trying to emerge from her shell.\r\n\r\nThematically, the film looks at the pressure to succeed, particularly in men. Ronald equates masculinity with strength, mocks Catherine's job, and barely acknowledges Emily. Instead, he pours all his effort into Tyler, through whom he's trying to live vicariously, pushing him to be the successful athlete that he himself could have been before injury ended his career. He's also acutely aware that as an African-American man, things won't come easy to his son, telling Tyler, \"_we are not afforded the luxury of being average_.\" However, Ronald is by no means the villain of the piece. He means well and seems to genuinely feel that raising Tyler in this manner is the best thing, telling him, \"_I don't push you because I want to, I push you because I have to_\". The problem with all of this is that neither Tyler nor Ronald have a backup plan, so when things start to go wrong, Tyler immediately falls apart. And as things get worse and worse, he becomes a pseudo-Job figure, with the big difference being that Job was self-aware and understood his suffering, whereas Tyler has no such self-actualisation.\r\n\r\nIn terms of problems, there are a few blatantly expositionary scenes. An especially egregious example is the scene where Ronald outlines how hard it is for a black man to get ahead in the US, using that as justification for why he pushes Tyler so hard. Whilst the sentiments are fine, it doesn't ring true that this is the first time Ronald has said this to Tyler. Surely he would have given him this talk in his youth? It's a well-acted scene in isolation, but in the context of the overall script, it's too literal and seems out of place. Speaking of race, apart from this scene and a later one where someone shouts a racial slur at Tyler, the film is silent on race issues. Instead, Shults uses the stuff of daytime soap to propel the plot – the end of a sports career, the prospect of having a child at such a young age, a family tragedy. The performers make the material work, but the film does come close to melodrama on occasion.\r\n\r\nNevertheless, although it's initially bleak, looking at loss and disintegration, _Waves_ ultimately reveals itself to be about the ability of love to conquer despair, about how life can persist no matter the circumstances, about the importance and restorative power of family. Shults uses this framework to build a quite audacious monument that celebrates the ordinary without ever overshadowing it. This is extremely strong and confident filmmaking.", "created_at": "2020-02-06T04:21:37.220Z"}, {"movie_id": 533444, "review_id": "5f17a7e878570e00315d6f84", "rating": 3.0, "review_text": "'Waves', while certainly ambitious, is so busy trying to be a future indie classic with its camera acrobatics and needle drops that it forgets to give any impetus to care about the supposedly profound stories it's trying to tell, instead coasting on its stylistic flairs and hoping these will distract from how shallow its writing is, making the 135-minute run time incredibly laborious. By his own admission, Shults modelled his film on the two-part structure of Frank Ocean's 'Blonde', an album which is featured prominently in the film. What audiences get instead is the cinematic equivalent of putting the album on while having a cry in the shower, a deep dive into misery porn, yet 'Waves' is a far less rewarding experience than just doing the real thing yourself.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-waves-high-school-misery-porn-drowned-by-its-aesthetic", "created_at": "2020-07-22T02:43:52.370Z"}]