[{"movie_id": 818110, "review_id": "658b29efe039f155a7be4fcb", "rating": 6.0, "review_text": "Fresh from recent screenings of Michael Powell's \"Tales of Hoffmann\" (1951) and \"Bluebeard's Castle\" (1963) I thought I'd give this a go... No, in no way can anyone claim that the singing is to the same standard of Norman Foster or Robert Rounseville, but there is one similarity. This is not an opera, it's a filmed interpretation of one - and it's aimed fairly and squarely at younger folks who would no more want to sit through two hours of Mozart sang in German than they'd volunteer for dental surgery. I think that's what makes this worth indulging a bit more. Recruiting the handsome Jack Wolfe (anyone else think he looks a little bit like Thomas Sangster) is guaranteed to turns some heads. He is the seventeen year old \"Tim\" who takes up his place at the famous Mozart school high in the Alps. He knows nobody and is armed only with the tiniest amount of confidence and a book given to him by his now deceased dad. He gets a distinctly frosty welcome from the musical snobs - including the professor \"Lomgbow\" (the sparingly used F. Murray Abraham) - in the place, but his roommate \"Paolo\" (Ellie Courtiour) proves to be OK and he makes friends with \"Sophie\" (Niamh McCormack) over some \"Jackson 5\" music on their headphones. What he also discovers is that his book opens a long forgotten secret passageway into the very land in which \"The Magic Flute\" is set. So long as he goes through at 3 o'clock each night, he will be able to live out the story with \"Papageno\" (Iwan Rheon), \"Pamina\" (Asha Banks) as they face the \"Queen of the Night\" (Sabine Devieilhe). To help defend himself, he has been given a flute and now he must learn to use it to best effect. Yes, it's the \"Janet and John\" version, and the English language obsession with rhyme can limit the power of the libretto at times, but this is still an engaging mix of modern teen/hormonal drama interspersed through some of the darker, funnier and more sinister elements of the original story. The score is rousing and the cast - especially Devieilhe - deliver the songs adequately enough, I'd say, to encourage anyone interested in the production to take it to another level - to see it on the stage even. It's not great, but it's a solid effort that might just make this marvellous form of entertainment become of interest to a new generation of Taylor Swift fans.", "created_at": "2023-12-26T19:30:55.695Z"}]