[{"movie_id": 253412, "review_id": "565614119251414864000cac", "rating": null, "review_text": "\"Director Baltasar Kormákur’s vast, encompassing vision thematically broaches the existential drive that consumes extreme climbers, questioning both the brusque heroism and innate fatalism of those that attempt to conquer such harsh climes...\"\r\n\r\nFull review here: http://screen-space.squarespace.com/reviews/2015/9/10/everest.html", "created_at": "2015-11-25T20:03:29.893Z"}, {"movie_id": 253412, "review_id": "56af215ec3a3681c5400c29b", "rating": 8.0, "review_text": "1996, and Mother Nature's big mama is playing her hand again.\r\n\r\nBased on a true story, Everest tells about a climbing expedition on the world's highest mountain that would become devastated by a severe snow storm.\r\n\r\nShe stands and watches over us all, she is Mount Everest, and climbing her is seen as one of the pinnacles of mountaineering. No matter how many lives are lost over the years, there will always be another group of adventurers ready to take on the mountain and the elements that come with her.\r\n\r\nThe ill fated 1996 trek up Everest gets a worthy cinematic treatment here. Sure it suffers from some of the pitfalls of the disaster movie genre, such as weak characterisations and fake sequences, but emotional investment is high and ready to be grasped by those so inclined. The drama on the mountain is gripping, and thankfully this is matched by the frantic concurrent story strands involving the family and friends waiting at base camp and the family homes. Cinematography is often breathtaking, the acting performances as solid as one of Everest' rock faces, but it's the story that sells itself. A tale well worth reading about, and the cynical among us should do well to remember this fact. 8/10", "created_at": "2016-02-01T09:11:58.806Z"}, {"movie_id": 253412, "review_id": "56b3815892514114e1002275", "rating": 7.0, "review_text": "> One of the most realistically approached adventure movie based on the real.\r\n\r\nI was completely surprised with the movie. Because I was expecting 'Vertical Limit' kind of movie. Like, you know, there's no heroic adventure with the incredible stunt sequences in it. But it was very real and more real. Usually while adapting the true events for the screen, unnecessary overdose stunts created to commercialise the product. But in this it was too much closer to the real world adventure, like a documentary film.\r\n\r\nIt was a man versus the mother nature and nothing else. The human villains were not included or the romance and other subplots. It was a multi starrer movie. Lots of big names played only a small role and magnified the expectation for the movie. But like I said expecting awesomeness will lead you to a great disappointment. One must approach this movie with a clear mind for a good result, because I felt the film very honest, and being honest is always a bit boring.\r\n\r\nThe film was emotionally very strong. No character developments, not individually, but the entire film was focused on one particular expedition taken by a couple of trekking teams that goes wrong after they got hit by a storm. This is Jason Clarke's one of the best films in a lead role, as well as for the director of 'Contraband'. I definitely regret missing it out in digital 3D. It is a good watch, absolutely refreshing from the mainstream commercial films.\r\n\r\n7/10", "created_at": "2016-02-04T16:50:32.398Z"}, {"movie_id": 253412, "review_id": "61cb1606c7c224008cfb6d0d", "rating": 8.0, "review_text": "I have read dozens of books about mountaineering expeditions, and several about this particular disastrous climbing season, including Jon Krakuer’s bestseller. Overall I think they did a good job depicting the events in this movie, which makes sense, as they used the expertise of Guy Cotter, a climbing and business partner of Rob Hall, one of the expedition leaders in the forefront of this tragedy.\r\n\r\nThey do an adequate job of putting the grandeur of the mountain on display, while still focusing on the human interactions and personal physical challenges of the characters. The plot runs fairly true to events and the dialogue is well-written. They made changes, of course, such as details of the helicopter rescue scene, but stayed true to the important stuff.\r\n\r\nI think I agree with the above-mentioned Guy Cotter, who stated in an interview that he only wished they had depicted in more depth the motivations of climbers to risk their lives climbing up in the “Death Zone.” For some climbers of Everest, their reasons are mundane: to be able to gain respect by saying they did it, or to “inspire” others to be all they can be, or even to make money and win some measure of fame. \r\n\r\nBut the true mountaineers are driven by  something deeper, close to what they see as their self identity.  They can’t not climb. There is exhilaration in challenging their physical limits and in appreciation of the rare beauty found at high altitudes. If it was easy they might not do so much of it, being in an odd way addicted to the pain, cold and danger. WHen they are on the mountains they dream of home; when they are home they dream of the mountains. It’s reminds me of aging boxing champions who keep on fighting when they should retire. Oh, they want the money, obviously, but even well-off champions may fight on and endure pain and suffering inside the ring for the cheers of the crowd and the additional acclaim it may bring them.", "created_at": "2021-12-28T13:49:58.203Z"}, {"movie_id": 253412, "review_id": "646625c3d1857201207faa97", "rating": 6.0, "review_text": "Based on true events, this rather beautifully shot film tells the story of Kiwi Rob Hall (an adequate Jason Clarke) who ran an exclusive adventure agency that took well-heeled climbers up Mount Everest. In 1996 he decided to team up with accomplished but rather enigmatic mountaineer Scott Fischer (Jake Gyllenhaal). What now ensues are a rather join-the-dot series of predicable escapades as the mountain decides that it's had enough of these messy and polluting human gadflies on it's slopes, and so it fights back - impressively and decisively. That leads us to the problem with this - the characterisations are seriously undercooked. I didn't really feel that I knew any of them, nor did I actually find - especially with Gyllenhaal - that I cared whether they survived or not. That might be a testament to their acting skills - some creating an aura of complacency and arrogance that well deserved their just desserts, but for the most part the script and the story were just all a bit flat. The cinematography is astonishing though, with actuality of the Nepalese base camps and of the rather benign looking mountain itself. It features quite a notable supporting cast, but again they offer little to beef up the sense of personality here or give us any real sense of the danger, teamwork and camaraderie that must have prevailed in real life. It is watchable for the imagery, and it also serves to remind up that mankind is pretty insignificant when the planet decides to stir itself against us, but as a piece of drama it's all just too lacklustre.", "created_at": "2023-05-18T13:18:59.356Z"}]