[{"movie_id": 619730, "review_id": "633159ecd38b580092a8ca25", "rating": 6.0, "review_text": "So imagine the scenario. A boozy lunch with with some screenwriters who had just seen \"Vivarium\" (2019) and began to recall \"Stepford Wives\" (2004) and the \"Truman Show\" (1998). We know, say the assembled talent - let's write a pointless hybrid of these stories, making sure to avoid the best bits of any of them then get two gorgeous people to take part. We'll end up minted! Well they may well have ended up making loads of cash, but what they have provided for us is an heavily stylised story that goes nowhere fast. To be fair, Florence Pugh tries quite hard as \"Alice\", the increasingly disturbed wife of \"Jack\" (Harry Styles). They live in an Utopian desert community where the men all head to work for \"Frank\" (Chris Pine) in the morning and the women do the standard middle class housework, shopping and networking things. All is idyllic until \"Alice\" notices that one of their neighbours \"Margaret\" (KiKi Layne) is convinced that something is amiss amidst their perfect lifestyle. When an inexplicable tragedy ensues, \"Alice\" starts to have nightmares and soon her marriage and his career prospects are in jeopardy. Pine isn't the least menacing as the duplicitous \"Frank\" and though the camera really does love Styles, he has little here to demonstrate whether he can actually act or can just fill a perfectly tailored suit as well as Daniel Craig. That's really the problem here. The film looks good, but the plot is completely undercooked. We are delivered of a partially formed plot that is derivative and, frankly, rather dull. The last few scenes with the guys in red reminded me of a television commercial for Vodaphone and at just over two hours long, I was just unengaged with it all. Styles' looks will take him far and working with the likes of Pugh and Pine will only help him, but unless his people work harder on the scripts and characterisations, then he will just end up Zac Efron-light. This is a film for television in due course, I'd say.", "created_at": "2022-09-26T07:51:08.654Z"}, {"movie_id": 619730, "review_id": "6345c1a507e2810082f147f5", "rating": 9.0, "review_text": "I thought this was great.\r\n\r\nI only knew of the off-screen drama about <em>'Don’t Worry Darling'</em>, thankfully I hadn't read or seen anything at all about the plot - which, obviously, helped my enjoyment. As such, I was extremely interested in the first chunk of this. It builds up nicely, revealing details here and there. The ending isn't as strong but I still dig it, don't get me wrong.\r\n\r\nThe cast are terrific, even if Florence Pugh completely wipes the floor with her co-stars... and I don't mean that negatively on them one bit, it's simply a case of Pugh giving an outstanding performance. This is only the third film of her's that I've seen... gotta watch more!\r\n\r\nAway from Pugh, I was impressed by Harry Styles. He can act. I will say, though, that Shia LaBeouf would've been greater in the role though. Elsewhere, Olivia Wilde (also dir.), Chris Pine and Gemma Chan do good things.\r\n\r\nIs it a perfect film? Not at all. Is it entertaining? Sure is. Each to their own, but I thoroughly enjoyed this 2022 release.", "created_at": "2022-10-11T19:19:01.690Z"}, {"movie_id": 619730, "review_id": "6349a4a1414291009882333b", "rating": 7.0, "review_text": "It is no surprise that _Don't Worry Darling_ has been marred with public controversies and poor critic reception, but is it really bad as the media would want you to believe? While I admit, there are plenty of issues in the story department, like completely abandoning certain plot details as they are introduced or leaving certain character plots half-baked to name a few, the other aspects of this film really make this an enjoyable viewing experience.\r\n\r\nOlivia Wilde's direction is actually really well done here. I could tell that certain shots and elements were done with the specific intent to create a romanticized version of the 1950's while still giving glimpses of something sinister hidden underneath. Although it is a shame that these elements didn't lead to much in terms of a reveal at the end.\r\n\r\nThe acting is a mixed bag here. Florence Pugh and Chris Pine absolutely carry this film. Pugh carries such complex emotions and is able to show her internal struggles while putting on a pretty face for appearance sakes. It is captivating and the audience can completely be resonant with her, this connection makes her character easy to root for. Chris Pine was really sinister in this role. I have not seen him as a villain in many shows and he does a fantastic job. For whatever reason, his mannerisms really reminded me of James Spader in Avengers: Age of Ultron, and that is a complement. Pine was not giving much screen time or character development, but he does the most with what he has. Olivia Wildes was fine, do not really have any complaints really, wasn't great but wasn't bad. Harry Styles' performance is hard to pinpoint. While I don’t think he did bad, but when he is constantly sharing the screen with Pughe, he is overshadowed a lot and his deficiencies show much more.\r\n\r\nOverall, I was disappointed with _Don't Worry Darling_ and the potential that was there to be such a special film. But it was still a good film that I had a fun time in.\r\n\r\n**Score:** _69%_\r\n**Verdict:** _Good_", "created_at": "2022-10-14T18:04:17.410Z"}, {"movie_id": 619730, "review_id": "634bd53fe263bb009c4f9b55", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/opinion-pieces/what-do-both-dont-worry-darling-and-crimes-of-the-future-have-in-common\r\n\r\n\"Personally, I believe that cinematic narratives with multiple plot points and questions related to the world itself are too often confused and envisioned as character studies driven by a single protagonist.\r\n\r\nBoth Olivia Wilde and David Cronenberg complete their movies when the main character fulfills the minimum requirements of their arc, consequently renouncing all other equally significant issues worthy of in-depth exploration. In the case of Don't Worry Darling, one finishes it with an underwhelming feeling from an unsurprising conclusion, while in Crimes of the Future, viewers are left with several questions and interesting, half-developed paths about such a mesmerizing futuristic world.\r\n\r\nNeither film explores its own world-building satisfactorily.\"\r\n\r\nRating: B-", "created_at": "2022-10-16T09:56:15.543Z"}, {"movie_id": 619730, "review_id": "635b6386f28838007b158ae7", "rating": 6.0, "review_text": "**Don't Worry Darling has a lot going for it, but its script keeps it from being more than a pretty coat of paint on a mediocre story told several times before.**\r\n\r\nDon't Worry Darling is a new take on The Stepford Wives. Same basic story with some fantastic cinematography, great costuming, beautiful visuals, and committed, top-notch performances from the cast. But all that is lost in a script that gets stuck on coming up with as many ways as possible to show its characters' slipping sanity rather than telling a complete story. The plot twists were pretty easy to guess, and the finale ended abruptly without providing any conclusion or resolution for the character. With all the bright spots this film had to offer, the sloppy story squandered all its high points leaving me let down and a little bored even with an exciting climax. With that said, I'm still trying to figure out what could have been done to make this story more compelling. The Stepford Wives concept has been done several times before and seems always to fail to find a way to end with a satisfying resolution.", "created_at": "2022-10-28T05:07:18.237Z"}, {"movie_id": 619730, "review_id": "63ca9feebb070d0084e46a64", "rating": 8.0, "review_text": "Pretty cool, I wasn't expecting the reveal of what's really going on towards the end. Wish it leaned into the horror / unsettling aspects a bit more.", "created_at": "2023-01-20T14:06:38.134Z"}, {"movie_id": 619730, "review_id": "6444d19f651fcf04889da46f", "rating": 4.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\n“Don’t Worry Darling” isn’t the massive mess that so many predicted, but it does suffer from a few major problems. The script (written by Katie Silberman) lacks grace and polish, one star’s questionable acting skills is amplified by the other lead’s performance, and Olivia Wilde‘s direction is noticeably weak. But there’s still something mesmerizing about this feminist-tinged film and its commentary on the supposed ideals of a patriarchal society.\r\n\r\nAlice (Florence Pugh) and Jack (Harry Styles) live a charmed life in the experimental utopia known as Victory. The town is exclusively for employees of the top-secret Victory Project and their families, and it’s truly the most perfect place in the world — or so it seems. Company CEO Frank (Chris Pine) is the visionary behind it all, a stylish, confident leader whom the men all want to emulate. He provides everything the town’s residents need, asking only for loyalty and obedience in return.\r\n\r\nVictory is a place that embodies the idyllic 1950s life, where the women cook and clean, dress to perfection, and spend their free time day drinking, lounging by the pool, and gossiping with friends. The men fulfill their role in this society too, by going to work at the mysterious headquarters and returning like clockwork in the evenings. It’s a don’t ask, don’t tell type of community, until Alice begins having strange, nightmarish visions. She begins to explore the more sinister side of Victory, hoping to eventually expose what’s really going on beneath the facade of domestic bliss.\r\n\r\nThe plot is one that’s been done before, and there isn’t much by way of originality. What makes the first part of the film so successful is that the story is told from the point of view of the women in town. By presenting the narrative through the lens of an army of happy homemaker wives, there’s an ominous tone throughout — especially when the ladies in town turn to self-harm in order to take back control of their lives.\r\n\r\nAlice is a strong female character, and Pugh proves yet again that she’s one of the most exciting talents working in Hollywood today. Much is asked of her and she is up to the task of doing the heavy lifting here, especially in her many scenes with Styles. To put it bluntly, Pugh acts Styles under the table and then some. I believe the film would have been more successful with a more talented leading man.\r\nWhen the ending finally comes through a long drawn out reveal, it’s a letdown that feels like an episode of “Black Mirror.” If you examine some of the film’s earlier scenes, the story doesn’t feel quite as airtight as it should.\r\n\r\nThe themes are excessive and overdone, presenting the conservative male ideal of relationships and life. It’s a chilling statement about women’s rights and responsibilities, and men’s desire to control and dominate. The timing for this message couldn’t be more perfect with the tumultuous political climate that’s spreading around the world. As a woman, I appreciate the sentiment of “Don’t Worry Darling” and the feminist lens in which its presented, but I just wish the film had been more successful overall.", "created_at": "2023-04-23T06:35:11.579Z"}]