[{"movie_id": 384680, "review_id": "5a9cadf70e0a26065803d160", "rating": 5.0, "review_text": "RELEASED IN LATE 2017 and written & directed by Scott Cooper, “Hostiles” is a Western starring Christian Bale as a renowned Army captain who grudgingly agrees to escort a dying hated chief (Wes Studi) & his family from New Mexico to Cheyenne lands in Montana in 1892. Rosamund Pike plays a grieving settler that the detail picks up on the way. Rory Cochrane plays Sgt. Metz and Jonathan Majors Corp. Woodsen. \r\n\r\nWhile the flick starts great and the Western \"road movie\" plot is full of potential, some elements are too contrived/unlikely (e.g. the whole fur trapper episode) or wannabe heavy (e.g. Sgt. Metz' apology in the rain) and the film just wallows in unrelenting glumness. Still, there is some good in it and you’ll discern a glimmer here or there. It's just that after the excellent set-up, I thought I was in for a great Western, but it wasn't to be. The script needed serious rewriting.                \r\n\r\nTHE MOVIE RUNS 2 hours & 14 minutes and was shot in New Mexico/Arizona/Colorado. ADDITIONAL WRITER: Donald E. Stewart.\r\n\r\nGRADE: C/C- (4.5/10)", "created_at": "2018-03-05T02:39:51.877Z"}, {"movie_id": 384680, "review_id": "5c447506c3a3681a0e24e4e4", "rating": 5.0, "review_text": "_Four Weddings and a Funeral Except the Weddings Were Actually Just Extra Funerals._\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T13:17:58.814Z"}, {"movie_id": 384680, "review_id": "5cb39e520e0a2626cec938b1", "rating": 9.0, "review_text": "I've killed everything that's walked or crawled. If you do it enough, you get used to it.\r\n\r\nHostiles is directed by Scott Cooper and Cooper adapts the screenplay from the story written by Donald E. Stewart. It stars Christian Bale, Rosamund Pike, Wes Studi, Rory Cochrane, John Benjamin Hickey, Jeremiah Wilks and Jesse Plemons. Music is by Max Richter and cinematography by Masanobu Takayanagi.\r\n\r\nIn 1892, legendary Capt. Joseph J. Blocker (Bale) reluctantly has to escort his old Cheyenne adversary Chief Yellow Hawk (Studi) and his family through dangerous territories. The aim is to get them to the Cheyenne tribal homelands of Montana so Yellow Hawk can get his wish to die in peace. \r\n\r\nWhere we at these days with the grand old bastion of American cinema, the Western? The only real constant is that thankfully for lovers of the form there are new directors willing to tackle the genre and bring something to the newer generations. Here we have Scott Cooper, who right from the off hasn’t hid the fact that Hostiles is his rallying call for a better world, or at least a better understanding of different cultures. What better way to cry out than to do it in a Western, using the Indian Wars as the backdrop. Perfect really.\r\n\r\nHostiles jumps right out of the blocks to grab you by the throat with soul shattering violence, with Cooper and his team initially facing charges of old by fronting up a one sided argument – but there is more. Quickly a switch ensures that both sides of this particular bloody coin have been tossed, scene set for what will follow. A meeting back at Fort Berringer where Captain Blocker receives the orders he simply doesn’t want to obey is in hushed tones, yet the words being spoken are brutally loud and to the point. And on to the journey, damaged souls unbound who not only have to fear hostiles from outside their group, but the hostiles within it and within themselves.\r\n\r\nAs the story moves through the journey undertaken by our protagonists, the makers have not cut corners with the characterisations, the emotional development of the principals is one of the film’s strengths (cast are superb, there’s a real authenticity to their respective performances). Also worthy is the pacing, it is deliberately unhurried and allows the characters to breathe, it also gives the jolts of action more potency, whilst simultaneously we can absorb the stunning landscapes (New Mexico/Arizona) and rejoice at the pleasures of an outdoor Western.  While how nice it is to have a musical score that doesn’t blunderbuss the important sequences, rounding out what is a top technical production.\r\n\r\nThere’s some irritants here, though, so it’s not perfect, and this is before it is marked poorly by those not in sync with the messages of the piece. Ben Foster turns up as Philip Wills, a most edgy character that makes one wish there was far more of him in the pic, for as it is it ends up feeling a bit pointless since he only emphasises what we have learned about Blocker at the start. Then there’s a key turn of events for the story’s  coup de grâce that leaves a frustrating taste in the mouth, not as a film killer or even close in fact, but it should have gone another way one feels. Especially given the two sides of the argument stance Cooper and co had began with.\r\n\r\nYet this is for Western fans a real treat, following in the footsteps of new era classics like Dances With Wolves and Unforgiven, Hostiles may have a new age sensibility in its narrative thrust, but traditionally old age adultness propels it forward. 9/10", "created_at": "2019-04-14T20:55:46.250Z"}]