[{"movie_id": 332562, "review_id": "5b9017390e0a26796a000eb4", "rating": null, "review_text": "It feels silly to even qualify this one. LADY GAGA. BRADLEY COOPER (who can sing and direct, apparently). You don’t even need to have any info about the plot to know that this a priority must-see.\r\n\r\nBut, in case you’re wondering, it’s also based on one of the most iconic (and beloved) movie musicals of the 20th century (it’s been re-made a bunch of times, but none was better than the Judy Garland-helmed version) and in addition to all the Gaga-Cooper creative brilliance, the screenplay is also co-written by Eric Roth, the Oscar-winning screenwriter who once compared life to a box of chocolates in Forest Gump (he modified the novel’s original — and far less quotable — line, “Being an idiot is no box of chocolates”)", "created_at": "2018-09-05T17:49:45.726Z"}, {"movie_id": 332562, "review_id": "5bfbf724925141111600d16c", "rating": null, "review_text": "Very interesting. As soon as I saw the trailer, I wanted to see it. I work in the <a href=\"https://devmyresume.com/cv-writing/\">professional cv services</a>, and through the big traffic there is no time for going to the cinema, so I will wait for the film to appear in good quality on the Internet. But the trailer is exciting. Everything I love: romance, love and music!", "created_at": "2018-11-26T13:37:40.902Z"}, {"movie_id": 332562, "review_id": "5c493355c3a368576a895e6c", "rating": 4.0, "review_text": "Lady Gaga clearly is (and has been for a very long time) a fantastic singer, and has made massive strides as an actor as well, but I _really_ did not enjoy this.\r\n\r\nBradley Cooper has clearly been studying at the Jeff Bridges' School of Being Completely Fucking Incomprehensible for this one. Maybe he was just trying to lend some believebility to the idea that he and Sam Elliot were brothers, I don't know (If that is the case, it failed miserably). Which I mean, whatever, it's his movie, he do that character whichever way he wants, but I don't appreciate it myself. Honestly the only thing in this, the fourth iteration of _A Star Is Born_ that I **did** appreciate at all was the first 15 minutes and the last 15 minutes. I didn't love those segments by any stretch, but I liked them at least partly. Not so for what came in between.\r\n\r\nI can definitely support _A Star is Born's_ two audio-related Oscars, and maybe, _maybe_ even see my way to understanding the Best Actress nomination for Gaga, but beyond that, I don't follow the logic at all.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-01-24T03:39:01.354Z"}, {"movie_id": 332562, "review_id": "5c6b77c2c3a36848f1dbf589", "rating": 4.0, "review_text": "Lady Gaga clearly is (and has been for a very long time) a fantastic singer, and has made massive strides as an actor as well, but I **really** did not enjoy this.\r\n\r\nBradley Cooper has clearly been studying at the Jeff Bridges' School of Being Completely Fucking Incomprehensible for this one. Maybe he was just trying to lend some believebility to the idea that he and Sam Elliot were brothers, I don't know (If that is the case, it failed miserably). Which I mean, whatever, it's his movie, he do that character whichever way he wants, but I don't appreciate it myself. Honestly the only thing in this, the fourth iteration of _A Star Is Born_ that I **did** appreciate at all was the first 15 minutes and the last 15 minutes. I didn't love those segments by any stretch, but I liked them at least partly. Not so for what came in between.\r\n\r\nI can definitely support _A Star is Born's_ two audio-related Oscars, and maybe, **maybe** even see my way to understanding the Best Actress nomination for Gaga, but beyond that, I don't follow the logic at all.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-02-19T03:28:02.346Z"}, {"movie_id": 332562, "review_id": "5cf590f09251416878ba88d8", "rating": 7.0, "review_text": "_**A strong directorial debut**_\r\n\r\n> _I always knew that I wanted to direct, but I also knew that I could only direct something that I had a point of view about, a story that I want to tell, something deep down. Some people said, why don't you direct a pilot or a commercial or something just so you could learn, and I thought that scares the hell out of me, because I don't even know where I would put the camera._\r\n\r\n- Bradley Cooper; \"The _Star Is Born_ Scene That Scared Bradley Cooper\" (Krista Smith); _Vanity Fair_ (October 1, 2018)\r\n\r\n_A Star is Born_ was met with a rapturous reception at its Venice Film Festival première earlier this year, and has since gone on to receive near universal critical acclaim (90% on Rotten Tomatoes at time of writing), with much speculation as to its staying-power come award season. And whilst I liked it, and found a great deal to admire, I didn't love it. At least I didn't love all of it.\r\n\r\nThe original _A Star is Born_ was made for Selznick International Pictures by William A. Wellman in 1937 and told the story of aspiring Hollywood actress Esther Blodgett (Janet Gaynor). Discovered and mentored by one-time star, but now fading alcoholic, Norman Maine (Fredric March), against all odds, Esther quickly becomes a huge success. When Maine proposes, she says yes, but only on the condition that he give up drinking. He agrees, and they elope and marry. As their careers continue to move along opposite trajectories, he secretly begins drinking again, and when she wins the Academy Award for Best Actress, he ruins her speech by drunkenly storming the stage, prompting a stay in a sanatorium. Upon his release, Esther determines to help him face his demons no matter the cost, leading to much emotional trauma and tragedy. Possibly based on the marriage of Barbara Stanwyck and Frank Fay, and the life and death of John Bowers, the storyline for the film was so similar to RKO's 1932 film _What Price Hollywood?_ that Selznick expected to be sued by RKO (although they weren't). _What Price_ was directed by George Cukor, and based on a story by Adela Rogers St. Johns inspired by the marriage of Colleen Moore and John McCormick, and the life and death of Tom Forman. Although both films were critical successes, _What Price_ was a box office flop, and _A Star is Born_ was a huge hit. It was first remade as a musical by (ironically) George Cukor in 1954, starring Judy Garland and James Mason, and with a virtually identical plot. A second remake followed in 1976, directed by Frank Pierson, which told the story of aspiring singer Esther Hoffman (Barbra Streisand) and fading alcoholic rock-star John Howard (Kris Kristofferson).\r\n\r\nThe latest version was originally set to be directed by Clint Eastwood back in 2011, starring Beyoncé Knowles and either Leonardo DiCaprio, Tom Cruise, or Will Smith. As the project languished in development hell following Beyoncé's pregnancy, Eastwood approached Esperanza Spalding and Bradley Cooper but the project never got going. By 2015, Eastwood had moved on, replaced by Cooper himself, who remained as leading actor (he would also co-produce and co-write, with Eric Roth and Will Fetters). In 2016, Cooper cast Stefani Germanotta (aka Lady Gaga), and the film began shooting the following year.\r\n\r\nSticking pretty close to the beats of the previous three versions, the film tells the story of Jackson Maine (Cooper), a fading drug-addicted and alcoholic country and western singer suffering from tinnitus and slowly going deaf, who is just about held together by his tour manager and elder brother, Bobby (Sam Elliott). After a show, Maine ducks into the first bar he finds, where he sees Ally Campana (Gaga) singing a sultry version of \"La Vie en rose\" (1946). Impressed by her talent, Maine goes backstage to meet her, and they spend the night talking, during which time she tells him of her dreams to be a professional singer/songwriter. Although he invites her to his next show, she has no intention of going, much to the chagrin of her father, Lorenzo (Andrew Dice Clay), a limo driver who is adamant he was a better singer than Sinatra. When Maine's driver arrives for her, she tells him she isn't going, but he refuses to leave without her, and she soon finds herself on Maine's private jet with backstage passes to the show. During his performance, he unexpectedly invites her on stage to sing one of her own songs, and the crowd eat it up. With her performance getting millions of views on YouTube, she joins Maine on tour, and they soon begin a romantic relationship. As Ally's popularity grows, she is approached by Rez (Rafi Gavron), a music producer who offers her a record deal. Maine and Ally are later married, but as Rez moves her away from her pseudo-unplugged origins towards a more manufactured style of pop, Maine begins to voice his disapproval, whilst increasingly indulging in drink and drugs.\r\n\r\nTo begin with what I disliked about the film. Firstly, the first half is markedly superior to the second, which, I think, comes down to pacing issues and editing rhythm. Whereas the first half really takes its time in setting up the characters and their relationship (it's nearly an hour before their first kiss), the second half often feels rushed, offering almost a highlight reel of events spread out over many months, without really giving any of them time to breathe.\r\n\r\nSecondly, I had some problems with the character of Maine. As is the case with all previous versions of the story, although the woman is ostensibly the lead, the man's troubles are the focus of the narrative, with the template established in 1937 (or 1932) inviting the audience to pity the man more than admire the woman. But with Cooper writing, producing, directing and starring, this can come across as a little self-indulgent in ways which weren't an issue in previous versions. Look, for example, at the number of close-ups and shirtless scenes Maine has, with the film going to some lengths to ensure we never think really badly of him despite his, at times, utterly reprehensible behaviour. Additionally, Cooper's Maine is the least convincing and wantonly self-destructive drunk of any of the four _Star_ male leads, with only one scene where he genuinely seems to be completely hammered (although, to be fair, it's a cracking scene).\r\n\r\nAnother issue, and one which I totally recognise I'm in the minority regarding, is that I found Gaga's performance a mixed bag. I hated her work in _American Horror Story: Hotel_ (2015-2016), where I thought her sultry and seductive vampire was a mass of clichés and overacting, although critics and audiences seemed to really like her. She's a lot better here, but still nothing spectacular, essentially doing a Barbara Streisand impression (albeit a decent one). Additionally, her performance doesn't really go any way towards showing us why this young woman would want to be with an alcoholic twice her age (apart from the fact that he's good for her career). Gaga never lets us see her fall in love with him, despite the framework being right there in the script, but neither does she play the role in such a way as to suggest a cynical exploitation of Maine.\r\n\r\nThe gender politics are also (somewhat) troubling; firmly rooted in the 1937 (or 1932) original, Ally is controlled and manipulated by men from start to finish (primarily, Lorenzo, Maine, and Rez), and the entire story is predicated on the fact that she needs a man's help to enable her to make her breakthrough. In this sense, it might have been interesting to reverse the genders, and instead have the film tell the story of a fading, substance-abusing older woman mentoring a hungry up-and-coming young man. It would probably be automatically criticised by the type of men who downvote anything gender progressive, but it would have been an interesting modern spin on an old story.\r\n\r\nTo counter that suggestion, however, and move onto what I liked about the film, it could be argued that by effectively maintaining the themes of the previous iterations of the story (and, in relation to the 1976 version, actually returning to plot points which were ill-advisedly discarded), the film is simply embracing its histrionic Classical Hollywood genesis, unapologetically retelling a traditional story in much the same manner as it was originally conceived. And with that in mind, the film is undoubtedly both an effective melodrama and a Classic Hollywood escapist fantasy.\r\n\r\nWhich is not to say it tries nothing new, or never goes left when you expect it to go right. For example, the film also surprised me in relation to Ally's new style, as never once does it imply that this style is any less authentic than it was under Maine's tutelage, or that his is somehow more \"truthful\" than hers. After she has her hair dyed, Ally looks in a mirror and says, \"_it doesn't even look like me_\", and I fully expected this to be the beginning of an arc which satirised what the industry has cost her, pointing out that the only way she could make it as an artist was by abandoning the art that meant anything to her, in favour of something synthetic. But that doesn't happen. Her new style (which becomes closer and closer to the real Lady Gaga as the film goes along) is presented as simply different from Maine's, in the way that his would have been different from those who came before him. If anything, the film presents the whole thing as a fairly organic evolution, with a lyric of what appears to be Maine's best-known song telling us, \"_maybe it's time to let the old ways die._\"\r\n\r\nAnother aspect of the film which worked well is that there was genuine sexual chemistry between Cooper and Gaga. Sure, having a good script helps tremendously in this sense, but just because there is chemistry on the page, doesn't necessarily mean there'll be chemistry on the screen - think of the wet fish of a relationship that is Kit Harington and Emilia Clarke's romance on _Game of Thrones_ – I've seen more chemistry between relations (pun intended). And although I do have some issues with the performances, the element of sexual attraction is very much there for all to see. Also on the subject of acting, Sam Elliott and Andrew Dice Clay steal pretty much every scene they're in.\r\n\r\nCopper's direction is also pretty impressive, giving the rock world _milieu_ a sense of lived-in verisimilitude – from the drugs, to the living out of limos and hotel rooms, to the whirlwind nature of it all, the film presents perhaps the most vibrantly realistic portrayal of the music industry since Cameron Crowe's _Almost Famous_ (2000). Visually, Cooper's direction is functional (more the laconic style of Clint Eastwood than the hyperkinetic style of Cooper's frequent collaborator, David O. Russell), never drawing attention to itself, and allowing instead the camera to be a fairly passive observer. For the most part, Cooper as director is invisible, which makes sense, given the nature of the story (the ominous nooses seen hanging above Maine on a billboard are a little over the top, however). He also avoids the type of clichés we usually see in this kind of story. For example, to suggest the increasing success of a character, a standard music film will undoubtedly feature either a single scene or a montage of hasty autograph signings, a scene or two of an increasingly rabid fanbase, and at least one, but usually more, chaotic press conferences. Cooper features none of these, relying instead on scenes which illustrate to us Ally's popularity in a more organic manner (for example, we know how successful she has become when she is asked to perform on _Saturday Night Live_).\r\n\r\nYes, Cooper's trying to make a gritty version of one of the most glitzy show-business narratives, which might strike one as an oxymoron, but, for the most part, he strikes a fine balance between over-the-top showbiz fantasy, populated by larger-than-life characters and cartoonish histrionics, and a more grounded and intimate romance imparting universal truths about the sacrifices one may have to make for the person one loves. To cite just one example of how well he handles this dichotomy, the scenes which introduce the two leads are as far as you can imagine from razzmatazz – Maine is shown alone in a green room popping pills before staggering onto stage, and Ally is shown in a toilet cubicle breaking up with her boyfriend over the phone. These two scenes set the tone nicely, and are a credit to Cooper's directorial choices.\r\n\r\nAll things considered, _A Star is Born_ is an impressive directorial debut, and is probably the best of the four versions of the story (it's certainly better than the 1937 and 1976 versions). Signalling the advent of Lady Gaga as a leading lady, the film also marks the arrival of an interesting new directorial voice. I didn't think it was as good as a lot of critics and fans have made it out to be, finding it a little too disposable at times, but I certainly enjoyed it, and I'm looking forward to whatever it is that Cooper does next.", "created_at": "2019-06-03T21:28:16.346Z"}]