[{"movie_id": 14148, "review_id": "656a3a2a0859b400e29bf444", "rating": 6.0, "review_text": "**_Richard Gere pours out his wrath on sexual deviants in the deserts of New Mexico_**\r\n\r\nAn agent for the Department of Public Safety (Gere) is being forced into retirement for overzealousness, but is intent on finding a recently abducted teen female in the desolate areas near Albuquerque while training his replacement (Claire Danes).\r\n\r\n\"The Flock\" (2007) is a psychological crime drama/thriller involving gross sexual offenders in the mold of \"Hardcore,\" “Se7en,” “Kiss the Girls,” “8MM,” “The General’s Daughter” and “The Cell.” It throws in the new-female-partner angle of Eastwood’s “The Enforcer” mixed with the seedy milieu of his “Tightrope.”\r\n\r\nThere are interesting insights into the human condition, such as: If you stare into an abyss long enough it might stare back. In other words, when you chase monsters, be careful you don’t become a monster. Moreover, if the guy who despises perverted sex offenders so much has no control over his own flaws, how can he blame the deviants? People tend to justify their failures by looking at the misdeeds of others. It's a natural reaction and typically not a conscious one. Actually, justification is what this flick zeroes in on: Is Babbage (Gere) rightfully enraged? Or is he just acting out his own perversions using his occupation as an excuse?\r\n\r\nGere is kick-axx as Babbage; we need more tough-on-predators agents like him out there. As with “The Enforcer,” you sense a growing connection between his seasoned detective and the newbie (not that they’re police detectives in this case, but they are indeed detectives of a sort). Also on hand are KaDee Strickland (Viola), Avril Lavigne (Beatrice) and Cyd Schulte in a notable uncredited bit (you’ll know when you see it, lol).\r\n\r\nThere’s a desolateness to the proceedings which fits the subject matter and the Southwest wasteland setting. There’s also some ambiguity in the last act. The film respects the intelligence of the viewer to put the pieces of the puzzle together. It’s superior to the contrived and implausible “Kiss the Girls” and pretty much on par with “Tightrope,” but not as compelling as the others noted. \r\n\r\nThe movie runs 1 hour, 36 minutes, and was shot in the heart of New Mexico in Albuquerque and nearby Bernalillo, which is about ten miles to the north.\r\n\r\nGRADE: B- (6.5/10)", "created_at": "2023-12-01T19:55:22.402Z"}]