[{"movie_id": 218043, "review_id": "5ae5c82e0e0a26792e004a49", "rating": 2.0, "review_text": "I have to confess that I bought this movie a bit on a whim and my purchase decision was mostly based on the fact that Nicolas Cage was in it. That was a mistake! I should have done a wee bit more research before wasting my money. I did not really have any hopes that it would be a great movie but I at least hoped that it would be a somewhat decent disaster / apocalypse movie. Sadly, it is nothing of the kind.\r\n\r\nThis time I have to side with the people trashing this movie, even the so called “critics” at Rotten Tomatoes. This is a bad movie. It could have been a half decent movie. The basic idea is perhaps not super original but it could have been made to work. However, it is simply loaded with religious bullshit. Once you filter out said bullshit, which is bloody difficult since you are more or less force fed it during most of the movie, there is really nothing left.\r\n\r\nThe behavior of people are bizarre to say the least. The dialogue is mostly nonsensical. The movies attempt at putting different and original characters, including an obnoxious dwarf, on the plane is feeble. The action and special effects are generally lousy and the attempts to put some thrill and drama into the landing of the plane is laughable. Come on, you see a plane coming, it doesn’t take a genius to figure out that it has no pilot and is flying in a straight line. You are over the Atlantic, a minor course change would have done the job and there was plenty of time. But nooo, the idiot script writer had Cage fly in a straight line like a chicken race until it was too late. And do not get me started on the stupidity of having someone driving down a stretch of highway in a pickup truck knocking over plastic cones to “clear it for landing”.\r\n\r\nThe only reason this movie gets any stars at all is because I do like Nicolas Cage even in a lousy movie like this.", "created_at": "2018-04-29T13:27:10.917Z"}, {"movie_id": 218043, "review_id": "6178b507f85958008e5921cc", "rating": 4.0, "review_text": "**Do yourself a favor and watch the other one**\r\n\r\nEasily the worst copycat of this story. The script holds more atheism than Bible and doesn't even attempt to discuss God in any meaningful way. Also, the characters - just about all of them - react unrealistically and wander about aimlessly in contrived \"panic\". Not a good film.", "created_at": "2021-10-27T02:10:15.524Z"}, {"movie_id": 218043, "review_id": "63be0e1afa404600aeff286e", "rating": 1.0, "review_text": "There are even very FEW Christians and Conservatives (with the exception of Ned Flanders) that actually enjoy Christian and Conservative movies... or at least Christian movies.\r\n\r\nThere are a lot of exceptions with Conservative films, Dirty Harry, Red Dawn, they can be fun.\r\n\r\nBut Christian Films... MAYBE The Passion of the Christ, The Bible miniseries, Mysteries of the Bible if that actually counts....\r\n\r\n... Movies like this are the reason. Nicolas Cage was once a big star and oh the mighty fall, now he's in a remake of Left Behind that, honestly, I only watched to rip into, I walked into it with low expectations of Fx that wouldn't look cutting edge in the 70s, of acting that is both too earnest and too forced (and that is without Cage) to look naturalistic. Audio quality that...\r\n\r\n... yeah, OK, shockingly the audio quality was a step above most Christian movies.\r\n\r\nIn other words, it stinks, you know it's going to stink because movies like this are more about the message than they are about the entertainment.\r\n\r\nBut... that was 2014 and, as Hollywood piles quota onto quota and demands that creators hit check marks that have nothing to do with the story, I suspect that it will change soon... my guess is that people that want to make entertaining films are going to gravitate towards this genre, towards low budget outside of Hollywood fare, towards whomever is offering up the money and is willing to allow them to make a film they want to make and not a political propaganda film.\r\n\r\nIt was made in 2014, and like all the other movies in this genre it sucks. But Hollywood is working on changing that and forcing talent out... and the people that funded Left Behind will jump at the chance of getting actual talent behind their projects.", "created_at": "2023-01-11T01:17:14.208Z"}]