[{"movie_id": 9373, "review_id": "6517fe67c50ad200c91ae6db", "rating": 4.0, "review_text": "Producer Michael Bay steered this remake of the infamous 1970's horror flick, without bringing in anything new. When I first saw the trailer for this version of the story, I thought it looked a lot like a hurried sequel to the contemporary silly release \"Wrong Turn.\" Five youths on their way to a Lynyrd Skynyrd concert pick up a young hitchhiker who commits suicide in the back of their van. Looking for help, and a little common sense, they stumble upon a weird family and their chainsaw wielding offspring. Much violence and such ensues.\r\n\r\nWhile the first TCM was not perfect, I eventually learned to love the shaky camera, lousy sound, and cheap look. One reason that film worked for me was the fact that much of the horror took place in blinding daylight, the cast was hot and uncomfortable, and it showed. In this version, even with the original's director of photography, most of the shots are too calculated. The horrors in the dark are not all that horrifying. This might be the rantings of a jaded horror film fan, but I never got the same feeling of unease as I did in the first film. Much of the original's story has been changed as film makers tried to keep the audience guessing by not doing a shot by shot remake, like Gus Van Sant's \"Psycho.\" The absolute lunacy of the first film's family was strange enough, here the members are more dimwitted than scary. This lessens the impact of Leatherface's scenes. You know he is the worst it can get, you don't have an equally sick family to fall back on. One disappointing scene involves the heroine Erin (Jessica Biel) running to a trailer and meeting two women who will obviously not help her. Instead of being a tense moment, where mind games involving drinking a seemingly harmless cup of tea could be played out, the women are there for nothing more than exposition, blaming Leatherface's penchant to kill on being teased when he was younger for a degenerative skin disease. The five victims all meld together, Nispel's direction is okay, but the cinematography is too nice for this type of horror film. The black and white scratchy scenes recall TV's \"Millennium\" or \"The Blair Witch Project.\" If I would compare \"The Texas Chainsaw Massacre\" to anything, it would be the terrible sequels that came out after the original \"The Texas Chainsaw Massacre\" to that point. Just one was watchable, \"Leatherface,\" but with the exception of Part 2, they were all simply remakes of the original film. Most direct to video sequels do that now, and while this film tries to be something different, it is simply a remake that cannot match the original. As Leatherface and the clan enter a new millennium, their wrinkles were showing.", "created_at": "2023-09-30T10:54:31.877Z"}]