[{"movie_id": 353070, "review_id": "59fe1481c3a36868a701f049", "rating": 7.0, "review_text": "**In an alternative way, against all the odds, they fought it!**\r\n\r\nThis was a remake of the 1979 film of the same name. I haven't seen that, but I enjoyed this version. I did not say I liked, but very entertaining. From 'Grandma Gangster' to 'Stand Up Guys', there you could find a few more that all these films have commonalities. The old fellows try to do something out of their age and strength can cope. So, for fun, this film will do just fine.\r\n\r\nThe poster says it all, but the film reveals much detail, like with small twist and turns. Three lifelong friends suddenly feeling the heat after their pensions got messed up. Apart from that, serious health condition and other financial struggle force them to rob a bank. The film is going to tell us their preparations for the action and post heist developments with some close encounters.\r\n\r\nNo one particular, but all the three veteran actors were good. Good to see them in such energetic film, other than supporting roles in other big flicks. Zack Braff too was good at his direction. I did not like that much his previous feature film. This is a commercial film, but well done. He says it is a reboot, not a remake. And seeing decent success, there could be a sequel. Simply watch it and have fun, but don't analyse deeply, which might only disappoint you.\r\n\r\n_6.5/10_", "created_at": "2017-11-04T19:26:57.527Z"}, {"movie_id": 353070, "review_id": "64643c6fd05a030153abc35f", "rating": 8.0, "review_text": "<em>'Going in Style'</em> is a fun one!\r\n\r\nI got more entertainment than I was expecting, given I had anticipated a somewhat half-arsed 90 minute comedy with potentially half-arsed showings from stars of yesteryear. Pleasantly, I was wrong. The more it went on, the move I enjoyed it. The one lame scene comes at the supermarket, but even that saves itself really with the addition of Kenan Thompson.\r\n\r\nIt made me laugh at a few moments, namely with the <em>'E.T. the Extra-Terrestrial'</em> 'homage' and when Josh Pais' character does the cat thing the second time (it's barely visible, just about in shot) - both funny! The masks were a nice touch, too. And that last scene with Annabelle Chow & Nancy Sun is so dumb but I'm totally here for it.\r\n\r\nIt's paced well, has a strong second half and, also, features a well done bit with John Ortiz's character in there too. A swell surprise, all in all. I would happily rewatch it. Michael Caine, Morgan Freeman and Alan Arkin make for a great trio!", "created_at": "2023-05-17T02:31:11.214Z"}, {"movie_id": 353070, "review_id": "65a52f76058224012ffdef86", "rating": 7.0, "review_text": "**A good comic film with four great actors.**\r\n\r\nWe are facing a light comedy that tries to remake a much older film that has a very similar story: three elderly people on the verge of retirement who are going to try to rob a bank. Although the film is a very welcome comedy and is not unpleasant to watch and rewatch, unfortunately, it brings to the fore a very serious problem that the USA, and other countries, insist on not solving: the precariousness in which we live when we are sick or has reached retirement age. It is not uncommon to see people who spend the overwhelming majority of their monthly income on medical and pharmaceutical care, and who find themselves on the verge of poverty due to very low pensions. The situation that it brings to us – a company that is going to close and that, through a legal device, is now able to use money from workers' pension funds to pay off part of its liabilities – is much more complicated, and I believe it could even be illegal, but the truth is that it wouldn't be surprising if it happened in real life.\r\n\r\nUnfortunately, I haven't seen the older film yet. What I saw in this film, however, is quite good and worth our attention. The cast is led by well-known veteran actors and their work is excellent. At the same time, the situation is seen with the lightness that befits a comedy, even though it is a serious matter. The film does not need additional explanation, things happen before us, and the film pays much more attention to all the characters' problems, as well as the planning of the robbery, than to the act itself. It’s not “Ocean’s Eleven” or anything like that, there’s no roulade action or great refinement in the “art” of stealing. The intention is to make us laugh with the caricatured situation itself, and this is done in a reasonably effective way: it doesn't make us laugh out loud, but it does enough to entertain us.\r\n\r\nIf the film has any positive points to praise, it will certainly be the participation of the cast, who are far above average and deserve praise for the way they played and acted. The three protagonists – Morgan Freeman, Alan Arkin and Sir Michael Caine – are effective and create an excellent collaboration, and I would venture to say that the pleasure of seeing the four of them working together is one of this film's best assets. In the secondary cast, Matt Dillon provides welcome support as a federal agent tasked with investigating the bank robbery suspects.\r\n\r\nThe film is a regular comedy, it has no technical aspects that deserve an in-depth analysis, but what it presents to us is done with great effort and works well. The point that caught my attention the most was the bank itself, whose setting evoked old banks from the first decades of the 20th century. I discovered, in fact, that this film used a classified historic site as the setting for this bank.", "created_at": "2024-01-15T13:13:26.286Z"}]