[{"movie_id": 9676, "review_id": "55ea26d5c3a3682c76006e6c", "rating": 7.0, "review_text": "I have been pointing my gun at a lot of people this week. \r\n\r\nA box office failure and a neo-noir film that confounded critics and fans alike, The Black Dahlia now appears to be a pic that has had its strengths ignored. As the clamour to kick Brian De Palma continues unabated to this day, and the point blank refusal to accept that Josh Hartnett is a better actor than the likes of Pearl Harbor suggests, it's a film worthy of a revisit by genre/style fans alike. \r\n\r\nPlot revolves around the infamous murder of one Elizabeth Short in Hollywood, 1947. An aspiring actress who was found butchered and her murder to this day remains unsolved. De Palma and his writer Josh Friedman adapt from noir legend James Ellroy's novel of the same name, the crux of the story is about two hot-to-trot detectives who get involved in the Short case, and pretty soon there is a can of worms that has been shaken and opened, and there's dizzying worms everywhere - we think? \r\n\r\nDe Palma loves noir, he has dabbled with it for a long time, not all of it works, but often he delivers for like minded cinephiles. With expectation levels high and following in the slipstream of the critical darling that was L.A. Confidential, Black Dahlia never really had a hope of achieving its lofty ambitions, yet it's a tremendously realised picture from a noir stand point. Whilst it showcases the technical wizardry of the director. \r\n\r\nThe charges of it being convoluted are fair, it's a spinning narrative, stories within stories, characterisations obtuse, but so was The Big Sleep! I know, I know, this is not fit to lace the boots of Hawks' genius movie, but tricksy narratives have always been a fundamental part of many a film noir, so why the distaste for this one? Especially since the period design, costuming, styling, photography and characterisations are so rich in detail? For instance Hartnett's detective is gumshoe nirvana, while Scarlett Johansson and Hilary Swank fatale the femme with mischievous glee. \r\n\r\nBut of course De Palma then spells it out for the finale, explaining things, a sort of macabre wrap up for those that needed it. Either way he was never going to win, it's too complex, it didn't need spelling out, while Mr. De Palma we have to tell you that your characters have been too cold, we don't feel them?! Huh? This is noirville, a place frequented by bad people, idiots and hapless dreamers, of dupes and double crossers. Hell there's even a suggestion of necrophiliac tendencies in this, and that's before we even delve into the machinations of the two femme fatales, a family that's lacking Adams Family Values and coppers of dubious motives. \r\n\r\nYeah, it's cold, and yes De Palma is guilty of trying to please all parties by covering all bases, but it's far from being a stinker. Haters of De Palma, Hartnett and complex noir narratives can knock two points off of my own personal rating, otherwise it's 7/10.", "created_at": "2015-09-04T23:18:45.297Z"}, {"movie_id": 9676, "review_id": "63c1e1aa8efe7300a0eaf683", "rating": 10.0, "review_text": "OK, I'm in the minority here, but I liked it.\r\n\r\nI also like period pieces and I like this period, so...this might be a bit bias.\r\n\r\nBut it has Scarlett Johansson in it and she is always watchable even when she is at her worst.\r\n\r\nAnd it has Josh Hartnett and I really do like him as well, and I like him in the sort of William Holden sort of he tends to do well when he does a voice over kind of way.\r\n\r\nExcept he isn't dead in a swimming pool at the start of the film. However, Mia Kirshner is certainly dead at the start of the film and she's one of those actors that usually does a great job despite being constantly over-looked.\r\n\r\nWhat you have is a film VAGUELY about The Black Dahlia, VAGUELY about a couple of buddy cops with a secrete, VAGUELY about a love triangle, and VAGUELY about the period....and that is why it didn't sit well with so many people. It was Vaguely about a lot of things and never exactly about any of them.\r\n\r\nHowever, there is enough mystery to it to hold my attention, enough style to make it cool and fun, and good enough acting to make it believable.\r\n\r\nIn other words, it still entertains despite the mess. Because of that, 10 out of 10, there is a lot wrong with the film, but ultimately it achieves its goal.", "created_at": "2023-01-13T22:56:42.962Z"}]