[{"movie_id": 452832, "review_id": "5c4f43130e0a2612cccc6f1c", "rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI will always respect and appreciate the will of a director/writer in trying to do something bold and bonkers. Whether that’s a divisive plot twist, a double-faced character or even an unusual method of filming, it doesn’t really matter, as long as it succeeds. Steven Knight delivers a story that doesn’t feel right from the get-go. Everything feels strange and random, with weird dialogues and awkward hints at something underneath it all. Then, a somewhat predictable plot twist changes pretty much everything since our perspective is entirely different now. However, it sinks the movie even more and creates a whole bunch of incongruencies and plot holes.\r\n\r\nThe film wasn’t near good before the twist, and it gradually transformed itself into something jaw-droppingly bad, after it. In addition to this, the final message that Steven Knight leaves the audience with, is probably one of the worst ones since The Emoji Movie. “Doing the wrong things for the right reasons” is always going to be a controversial statement, but in this particular case, having in mind what happens in the movie and who does it involve, it’s 100% wrong and I want to believe that Knight didn’t exactly want to transmit this in the way that he did.\r\n\r\nThere’s an intriguing and meaningful story to be told deep down in this messy screenplay. Behind all of the unnecessary exposition scenes (there’s no need to describe what’s happening since the twist is quite self-explanatory) and cringe-worthy dialogues, there’s a well-structured narrative and an extraordinary concept to be explored. However, I have no idea what happened to the script nor the production and filming stages of the film, but I understand now why its original release date in October was postponed to the traditional January’s garbage. This was supposed to be an Oscar-bait movie: an Oscar-nominated director/writer plus two Oscar-winner protagonists, in a film that seems to be more than what it actually is?  I guess the production companies saw this coming and they tried to prevent an even bigger flop. \r\n\r\nI’m always the first to defend that a movie without at least “good” technical attributes is rarely one of the best of the year. However, I’m also the first to affirm that if a film fails to deliver a captivating story with compelling characters, there’s no magnificent cinematography or mind-blowing special effects that can salvage it. Serenity doesn’t even have that. Despite me feeling pleased that it was filmed in one-location and that the set design is pretty sweet, the editing is incredibly choppy. It feels like Knight had to remove several cuts in order to reduce the overlong runtime, which wasn’t performed in the best way possible. There are a lot of moments where a character is facing a side, and in the next cut, the former is already facing a completely different one (this particular thing really occurs often).\r\n\r\nRegarding the characters, Baker and his son are definitely the ones that we learn more about since their connection is continuously addressed. Like I wrote above, there’s a relevant story behind all of this mayhem, but I did saw (even if briefly) the light at the end of this very dark tunnel. That light is instantly consumed by the darkness as new characters or subplots start to show up, and the hollowness prevails over everything else. Jeremy Strong’s character is baffling ridiculous, Diane Lane (Constance) is one of the dozens of logical reasons why the twist doesn’t work, but the one who annoyed me the most didn’t even show up. You spend a whole movie talking about this one person, like it is going to be a crucial subplot, and then you forget about it. You merely end the film, and it’s like that character was never even mentioned… Why? Why give even more reasons for someone to leave the theater frustrated?\r\n\r\nThen, there’s the tone. It’s weird until the twist and weirder after it. Not even Matthew McConaughey or Anne Hathaway can save themselves from some awfully delivered lines. Nevertheless, it’s the cast who saves this wreckage of being an F. McConaughey is a hell of an actor and he demonstrates his outstanding range throughout the runtime. Hathaway has less to do, and I felt that her lines were the worst, but I can’t argue with her ability to deliver any emotion. Jason Clarke (Frank Zariakas) is perfect as the violent father/husband, and Djimon Hounsou (Duke) has some space to shine.\r\n\r\nIn the end, Serenity tries to go big and bold, but falls astonishingly flat. Plot holes, logical incongruencies, awful dialogues, terrible editing, hollow characters, and neglected subplots. Steven Knight had a great concept and a truly interesting thriller-mystery in his mind, but his execution is shockingly baffling, and the twist transforms everything into something way worse. The final message is the number one reason why I don’t recommend anyone to see this movie, especially if you take teens or kids with you. Matthew McConaughey is good enough to avoid a total disaster, and I know that there was something incredible behind all of this horrible mess. It’s probably going to end up as one of the worst films of 2019, unless we have a truly disastrous year in cinema.\r\n\r\nRating: D-", "created_at": "2019-01-28T17:59:47.808Z"}, {"movie_id": 452832, "review_id": "5cd0c241c3a3684fbcdf5bbc", "rating": 10.0, "review_text": "This is insane, which is why I really like it. It's original, it had my attention throughout the entire runtime, and I can't remember the last time I got this many chills--maybe never! I'll admit it fails to ever become cohesive but it's got so much fucking flavour that I can't not gulp it down. What would one call this? Artsy schlock? This is artsy schlock. This is my initial rating upon a first watch; it is possible I will feel differently about the film on a second watch.", "created_at": "2019-05-06T23:24:49.425Z"}, {"movie_id": 452832, "review_id": "5d6235a754f6eb233f9abfe9", "rating": 3.0, "review_text": "One of the weirder films I've seen recently. And I like weird, I just don't like... This. Credit where credit's due though, both Anne Hathaway and Jason Clarke are **one hundred percent** believable in their roles, which is impressive given the setting, and... Terrifying, given their relationship dynamic.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-08-25T07:15:51.803Z"}, {"movie_id": 452832, "review_id": "5d68758fca83545e55f669d2", "rating": 8.0, "review_text": "If you never heard of Serenity before, you’re not alone because neither had I. The movie was in and out of theaters making a mere $11.4 million off of a reasonable $25 million budget. But one of the best perks of reviewing is getting to see films I might’ve otherwise skipped and boy was Serenity one hell of a ride. Well, more of a ride that’s on a collision course toward a semi, but still…\r\n\r\nHere is the basic plot synopsis: Baker Dill (MATTHEW MCCONAUHEY) is a fishing boat captain who leads tours off of the tranquil enclave of Plymouth Island. His peaceful life is soon shattered when his ex-wife Karen (ANNE HATHAWAY) tracks him down. Desperate for help, Karen begs Baker to save her — and their young son — from her abusive husband (JASON CLARKE). She wants him to take the brute out for a fishing excursion — then throw him overboard to the sharks. Thrust back into a life that he wanted to forget, Baker now finds himself struggling to choose between right and wrong.\r\n\r\nSounds simple enough, no? While indeed that does happen in the movie, where I thought I was getting some sort of modern-day film noir, what eventually we get is more along the lines of The Truman Show. Despite the insanity that I was watching and how some of it makes no sense whatsoever, I have to admit, I kind of was entertained by it all.\r\n\r\nFirst, the performances are, well, uneven. The supporting players of the respectable actors which  included Djimon Hounsou as Dill’s skipper and Diane Lane playing the sugar momma. However, McConaughey switched back and forth from mild mannered to over-the-top, where I wonder if he got to the point where he realized just what a messy movie he had signed on to. Hathaway was decent enough, although she did feel like a character out of an old-time film noir while Jason Clarke went full-on portraying a loutish, all-around despicable human being, necessary if you want your main character to even consider murdering the guy.\r\n\r\nOutside of my reference to The Truman Show, I won’t go much further as not to spoil the twist, though it is one maybe M. Night Shyamalan would probably appreciate… And I suppose I did as well, even if it didn’t make a lick of sense, even days later thinking upon what the hell exactly happened. That being said, it certainly was one of the more unique, and bewildering, viewing experiences  of the last few years.\r\n\r\nSerenity was the brainchild of Steven Knight, Academy Award nominee for writing Dirty Pretty Things and who has also written the screenplays for Eastern Promises, Allied and The Girl in the Spider’s Web amongst others. This also marks his third film in the director’s chair following the Jason Statham thriller Redemption and Locke starring Tom Hardy, both movies released back in 2013.", "created_at": "2019-08-30T01:02:07.096Z"}, {"movie_id": 452832, "review_id": "6001dcf5223e20003db6430c", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nThis is probably more interesting than good when it comes down to it.\r\n\r\nI'm not a big fan of Matthew McConaughey or Jason Clarke, but they sure nail all the crazy in their roles.\r\n\r\nDjimon Hounsou probably has the only character that isn't crazy to some degree.  The \"Moby Dick\" reference is strong, but the story structure allows for theming to evolve as the story continues.\r\n\r\nEach arc is interesting as if it is a new story using the same characters.\r\n\r\nWhile the journey definitely carries some intensity with it, the end is a bit vague and may leave you questioning not only what happened in the movie, but questioning reality.", "created_at": "2021-01-15T18:20:37.160Z"}]