[{"movie_id": 322240, "review_id": "57b125c2c3a368141c00246f", "rating": null, "review_text": "Is it safe to assume that the flea-bitten feline fantasy **Nine Lives** has completely gone to the dogs? Do not let this cockeyed kiddie comedy fool you because despite its intentional cuteness involving a self-deprecating, wise-cracking wealthy businessman-turned-hedonistic hairball may be appealing to the Romper Room crowd **Nine Lives** has all the comical chops of juggling chunky kitty litter. Charmless, insipid and trivial, this juvenile clawed and clumsy caper showcasing cheesy-minded whimsy about a hybrid self-absorbed big bucks blowhard/adorable pesky pussycat and the lead little gal enjoying the mystical mayhem at large may lower the IQs for the tot-friendly audience it looks to cater to with cheap, cloying chuckles.\r\n\r\nPerhaps ragging on a fetid fluff fable as **Nine Lives** is probably as blasphemous as kicking a twitchy-nosed bunny in its precious tummy. The question remains, however, if the bunny initially deserved that harsh kick? It boggles the mind as to what notable names are attached to this toothless, ticklish project. Director Barry Sonnenfeld, the heralded puppeteer behind hits such as _Men in Black_ and _Get Shorty_, inexplicably tries to breathe loony life into this stillborn catty concoction of recycled sight gags, and sugary sentimentality. Still, the manufactured roguishness and obviousness of the lightweight high jinks will have one pawing for something more, er…purrrrr-cisely appetizing. In addition to Sonnenfeld’s mediocre directorial efforts behind the camera, the real curiosity is how two-time Oscar winner Kevin Spacey signed on the dotted line to partake in this catnip-laced catastrophe. Amazingly, **Nine Lives** not only boasts one Academy Award winner in the aforementioned Spacey but two with the inclusion of the ubiquitous off-the-wall Christopher Walken. The only true sympathetic victim subjected to this tepid tail-wagging tease is the helpless cat forced to carry this Disney-esque dud on its poor furry shoulders.\r\n\r\nNoticeably, **Nine Lives** tries to be slick in tackling (or loosely exploiting) the current phenomenon of two separate entities: the popularity of the countless infectious YouTube online cat videos that aim to soothingly please the masses and the satirical profiling of controversial 2016 American presidential hopeful Donald J. Trump (through Spacey’s callous characterization). Granted **Nine Lives** has its occasional brushes with welcomed impishness but for the most part this nutty narrative pussyfoots around in a total lackluster whimper.\r\n\r\nSpacey plays a megalomaniac multi-millionaire New York City-based real estate developer named Tom Brand whose specialty in spouting stylish skyscrapers within his congested urban landscape keeps him hungry for more success and business-minded progression. The problem is that Brand’s workload often interferes with spending quality time (or any time for that matter) with second wife Lara (Jennifer Garner in a throwaway role) and impressionable daughter Rebecca (Malina Weissman). Clearly, Brand’s neglect of his loved ones is inexcusable but the boorish tycoon does care for his offspring Rebecca although his tendency to stomp on his employees and rivals comes second nature for him. Nevertheless, Brand wants to ensure that his Rebecca receives a special upcoming 11th birthday gift to remember. After all, she is Daddy’s little princess.\r\n\r\nRebecca happens to be an insane cat lover. Tom, on the other hand, cannot stomach the four-legged cuddly critters. So Brand has no choice but to satisfy his darling’s wishes as he bites the bullet and visits a questionable pet store operated by creepy Felix Perkins (a seemingly disinterested Christopher Walken). Brand dutifully purchases a striking-looking tomcat named Mr. Fuzzypants for Rebecca to relish as her prized present. Suddenly through a convoluted “accident” criminally wealthy Tom Brand becomes comatose. Additionally, he is transported inside the hairy-coated body of Mr. Fuzzypants. And there you have it–Rebecca’s ultimate wish for the ideal birthday gift as having her absent Daddy Dearest Tom and beloved pet cat Mr. Fuzzypants rolled into a 2-for-1 sale package for her to treasure.\r\n\r\nAside from the predictable puns, lame and cutesy dialogue and by-the-numbers sophomoric bits **Nine Lives** drags and feels as relentlessly ragged as a victimized toy mouse at the mercy of an inner city neighborhood feral tabby. Painfully witless and wooden there is not much for the on-screen participants to do in this flea collar farce other than to play second fiddle to the synthetic exploits of the Spacey-voiced CGI domesticated bushy-tailed beast. Sure, it is easy to dismiss **Nine Lives** as mindless entertainment for the indiscriminate rug rats looking for child-like escapism. The youngsters (or oldsters for that matter) are better off chuckling at the mini funny feline features on the Internet as opposed to tolerating this fledgling fantasy about profit-making papas becoming humbled by the outer-body experience of a playfully turbulent tomcat in order to appreciate what his true and genuine riches are at hand–the foundation of family. It is actually a rather nice message to promote for the kids but it is woefully undermined by the forgettable goofiness that persists in this comedic cat-box.\r\n\r\nSpacey’s Trump-inspired business-minded blowhard Brand is something that could have been rejoiced in another forum if it was not lazily trapped inside this pointless kid-friendly spectacle. The iconic presence of Walken as the resident eccentric cat whisperer is wasted and forgettable. The ones you truly feel sorry for in this merry-minded mess is the doomed duo of Weissman’s Rebecca and her cat cohort Mr. Fuzzypants as they try to capture the childish spirit. Sadly the adult participants in **Nine Lives** need to have their SAG cards revoked. Not since 1993’s _Look Who’s Talking Now_ has voiceover critters been so relentlessly annoying.\r\n\r\nThe 87-minute **Nine Lives** feels like it equally drained the single life out of Mr. Fuzzypants and more important–the movie ticket buyers.\r\n\r\n**Nine Lives** (2016)\r\n\r\nEuropaCorp\r\n\r\n1 hr. 27 mins.\r\n\r\nStarring: Kevin Spacey, Jennifer Garner, Christopher Walken, Malina Weissman, Teddy Sears, Talitha Bateman, Mark Consuelos, Robbie Amell, Cheryl Hines\r\n\r\nDirected by: Barry Sonnenfeld\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Comedy/Fantasy & Adventure\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-08-15T02:15:30.835Z"}, {"movie_id": 322240, "review_id": "581cf9449251416611000080", "rating": 6.0, "review_text": "**We learn from our mistakes, but some people from a supernatural accident!**\r\n\r\nSo another switching body and soul theme, but not as bad as it looks. The problem is, it was so ordinary story, like the writers were never serious about making it big. That is the first thing what this film compromised. That makes it the quality of a television film. I mean the production quality was amazing, including all the graphics parts, but the plot was not developed to greater heights. So falls short to entertain its viewers, especially if you had seen films like 'Fluke' and others. The younger kids might like it, but this film was made keeping in the mind all the ages. So surely anybody can watch this, but the joy is limited.\r\n\r\nVery sad to know it was made by 'Men in Black' director. For his capability, this is a silly film. I don't know the reason, maybe he was tricked and the only way out is making this film. Whatever, his presence was what made this film so rich in the technical side. This is the story of a successful businessman who is a proud owner of the tallest building in the northern hemisphere. There's no respect by him for his employees and he totally neglected his family, particularly his young daughter. But one fateful day, his soul gets trapped in a cat and from there, how he's going to make it back is what told with his great struggles.\r\n\r\nI would say the cast was decent and so the screenplay, but the CGI cat was awesome, almost flawless for such a small film like this. The story and its events were not explained in details for us like how it had all happened like its logic. Since we are familiar with this type of films, they skipped most important segments and went directly to the story to develop which is actually the struggles like fighting back to break the curse than shaping up it with a neat story. So in my viewpoint, it is okay for watching once. This is a comedy, but you would hardly laugh. Yet much better than those real comedies from the recent times.\r\n_\r\n6/10_", "created_at": "2016-11-04T21:10:28.589Z"}]