[{"movie_id": 429617, "review_id": "5d16ef595b4fed001e4684c9", "rating": 6.0, "review_text": "The whole film is a relentless flurry of action and adventure from the get-go, with the man himself sporting no less than four different spider suits (for all the mega fans out there). Maria Hill (Cobie Smulders) gets a look-in once again after her very disappointing absence from 99.99% of ‘Endgame’, but she’s wasted on screen, serving little to no purpose. And while this film finally gives us a Peter/MJ love story, it’s all too familiar territory - not because of the characters involved but because we saw Peter pursue a crush in ‘Homecoming’. We also saw him try to balance the student/hero sides of his life then too. This is THIS Peter Parker’s fifth time on the rollercoaster. We’ve seen him and fell in love with him as the sweet, innocent kid who had greatness thrust upon him and his thirst to be a superhero. He had his shot in the ring - several times in fact - and now we need to see him grow, but they’ve just given us much of the same. We need to know where this is going, not just watch a kid play dress-ups time and time again.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-spider-man-far-from-home-in-a-post-iron-man-world-spideys-still-the-same-insecure-kid", "created_at": "2019-06-29T04:55:53.596Z"}, {"movie_id": 429617, "review_id": "5d1b48a70cd32a1960f777c1", "rating": 10.0, "review_text": "Amazing movie!!", "created_at": "2019-07-02T12:05:59.297Z"}, {"movie_id": 429617, "review_id": "5d23564b15c6364753f412f7", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this is a spoiler-free review of Far From Home, but NOT of Avengers: Endgame! So, if you still didn’t watch the latter or heard what happens in it (by some inexplicable reason), this is a SPOILER WARNING for the events of that era-ending film. Moving on to the web-slinger, this sequel is everything it should be and a bit more. It beautifully encapsulates how everyone’s feeling about the central death of Endgame, especially Peter Parker. I wished Jon Watts would put a lot of focus into Spider-Man’s grief and I hoped that a big part of the plot would be him just having to deal with the fact that his mentor/father figure is gone. He can’t continue to just be the friendly neighborhood Spider-Man. He needs to grow up and become what everyone expects of him: to be the best of them all.\r\n\r\nWatts does all of it. There are so many emotionally powerful dialogues featuring Nick Fury or Happy (Jon Favreau) or even just moments with Tom Holland just standing alone and having to breathe through the pain of losing someone you love. The pressure that everyone is putting on his shoulders is immense, maybe too much for a simple teenager, but he’s everything but simple. I love every single bit of story dedicated to Peter and Tony Stark’s (Robert Downey Jr.) relationship. Chris McKenna and Erik Sommers wrote a wonderful screenplay, and Jon Watts executed it seamlessly. However, the reason why all of this works is due to Tom Holland’s performance.\r\n\r\nHe said in an interview he would play Spider-Man until he can and until producers let him. I hope he stays around for years without end. He’s not only my favorite on-screen Spider-Man but my favorite on-screen Peter Parker as well. I love how he spends most of the movie holding on to his feelings, and in the last act, he just lashes out because he can’t take it anymore. He left my eyes close to tearing up in probably the best dialogue of the film with Happy. As a superhero, he perfectly embodies what Spidey is all about, and Holland has the plus of doing most of his action stunts. As a teenager, he’s incredibly funny, innocent, and he still doesn’t know how to deal with falling in love or having a crush, which leads me to the second of the three main storylines of this movie: his relationship with MJ. \r\n\r\nZendaya did get some criticism from fans who, well, don’t like the fact that MJ is not the same one as in Sam Raimi’s original trilogy (physically and psychologically). Same for Holland and the fact that this Spider-Man has a lot more “gadgets” than Tobey Maguire’s. For those people, I only have one advice: understand that this is a distinct universe with different takes on characters we know and with other stories to tell which are, in fact, the closest we had to the comics so far. The sooner you accept this, the easier will be for you to enjoy these films. Having that in mind, MJ didn’t have much to do in Homecoming. Actually, she was even played as a post-credits twist so that the sequel could focus more on her … and it did.\r\n\r\nTheir relationship gradually evolves throughout the movie smoothly and realistically. They’re teenagers! Having their first crush, trying to come up with a good time and place to tell the other they like them, being nervous when they’re together and being anxious when they’re separated … Watts handled this subplot very well. It didn’t feel forced (rom-coms should take some tips), Zendaya and Holland’s chemistry is palpable, and I love this new MJ. Most of the superhero’s lovers are the cliche damsel in distress, always needing saving and making dumb decisions. Zendaya’s MJ not only can handle herself, but she has an unique personality that makes her stand out.\r\n\r\nFinally, the third and last storyline relies on Mysterio (Jake Gyllenhaal). I can’t really get in-depth about this character because he has a massive impact on the narrative, but I can guarantee that Gyllenhaal makes this character work. I like how they approached Mysterio, but if it wasn’t for the outstanding actor that Gyllenhaal is, Far From Home would have suffered a bit. The relationship between him and Spider-Man is well-developed, but the character of Mysterio lacked better treatment. There’s an exposition dump midway through the runtime that’s just horrible. Really, really bad. However, the film moves on and gets better until it reaches the last 45 minutes, which are unbelievable.\r\n\r\nI will always prefer a slow start and a fantastic finish than the other way around. Far From Home struggles with the first two acts’ pacing, but the last one compensates that with some of the best action a Spider-Man movie ever had! There are so many sequences where our superheroes are just going at it, flying and swinging across buildings, bridges, and rivers like we’ve seen before, only better. The CGI looked like it could be excessive in the trailers, but instead, it’s some of the best Marvel has shown us. Nevertheless, the jaw-dropping scenes are some that involve illusions, very much like Dr. Strange (Benedict Cumberbatch) had in his origin flick. Spider-Man has two memorable sequences (the VFX here are mind-blowing), one of which incorporates a certain superpower not seen in the MCU so far (officially, at least). The kid in me was smiling with pure joy, let’s write that.\r\n\r\nIt’s on par with Homecoming. One is better than the other in various areas, but they’re extremely different, so comparing them might be unfair. The first had the goal of introducing a “new” character to the MCU, so the focus relied solely on Peter Parker having to deal with his powers and being the friendly neighborhood Spider-Man. This sequel is set so far away from the origin story and so much happened between these two that if people chose to watch them back-to-back, they wouldn’t understand much of what’s going on. Nevertheless, Far From Home still has its own issues.\r\n\r\nLike I wrote above, the first two acts struggle with its pacing. While it’s refreshing to watch Spider-Man in other cities besides New York, the transitions between them are ridiculously fast, especially one that takes Peter Parker to another country in such an illogical way. The film tries to play off these less rational moments with comedy bits quite often and sometimes it just doesn’t work, affecting both the tone and pacing. I liked Ned in Homecoming, and I also enjoyed his presence here, but this time he almost felt like just a comic relief guy instead of that essential “sidekick” to Spider-Man. Michael Giacchino’s score is good, but for some reason, I couldn’t really connect with it, which I think it’s the first time I don’t exactly love Giacchino’s themes. Finally, the comedy skits could be better, they don’t land that many times and the one supposedly funny scene I remember is the absolute worst.\r\n\r\nAll in all, I still had a blast! I think I prefer Far From Home to Homecoming since the latter deals with a much more complex and emotionally compelling story than the origin flick. The action is some of the MCU’s best and definitely as great as Spider-Man’s action ever was, featuring some mind-bending, astonishing sequences. The cast is brilliant, especially Tom Holland who cements his spot as the best on-screen web-slinger ever. Zendaya and Jon Favreau are also amazing, but I have to praise Jake Gyllenhaal’s performance because he’s just awesome every single time. It’s the movie the MCU needed after the tragic events of Endgame. It works because we feel what Peter Parker’s feeling and we can deal with our grief with the help of Spider-Man’s journey in this film. Aside from some minor problems with pacing, comedy, and exposition, the last act plus the two post-credits scenes, which have a tremendous impact on the movie and on what’s to come on Phase Four, are more than enough for you to go see this film at the theater. Don’t miss it!\r\n\r\nRating: B+", "created_at": "2019-07-08T14:42:19.577Z"}, {"movie_id": 429617, "review_id": "5d277e4dbe4b3612f69e17c9", "rating": 5.0, "review_text": "Problems: I thought the Gyllenhaal character was corny, Spidey taking selfies too out of character for a selfless hero, and the Fury twist throughout the movie really unnecessary. \r\n\r\nWhat I liked: Tom Holland continues to be a charming actor.", "created_at": "2019-07-11T18:22:05.201Z"}, {"movie_id": 429617, "review_id": "5d2ec9b227d9cc00127d01f6", "rating": 7.0, "review_text": "There's a some things in _Spider-Man: Far From Home_ that I personally didn't love. But I got **exactly** what I wanted from Mysterio, and that was so important to me. It's pretty amazing that the MCU is twenty three films deep, and they're still bringing out this sort of quality. I know this series is not for everyone. But until they start making movies I don't like, I'm gonna keep showing up.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-07-17T07:09:38.538Z"}, {"movie_id": 429617, "review_id": "5d347e55caab6d1640ad1fdd", "rating": 6.0, "review_text": "I just came home with the kids from the cinema where we had watched Spider-Man: Far From Home so I thought I would write a few lines while it was still fresh in my mind.\r\n\r\nI have to say that it was a decent enough movie. I didn’t exactly regret having forked out the money to watch it in the cinema but that’s about it. It’s far from a great movie and the end scene…well it’s a typical really crappy Hollywood ending where the writer cannot be bothered to spend time creating something intelligent so he just goes for the usual sensationalist cliffhanger bullshit.\r\n\r\nAs with the previous movie, Spider-Man: Homecoming, this is a Spider-Man for kids, or at least younger people, movie which perhaps is part of why I am somewhat lukewarm towards it. This one did not feel as childish as the previous one but there is still a lot of teenage angst and rubbish in it. The plot is of course highly predictable as well.\r\n\r\nThe special effects on the other hand are quite good and essentially what makes the movie worth watching. At least to me. The end fight with hundreds of those drones flying around intermixed with Mysterio’s illusions where quite cool. A bit over the top perhaps but cool nonetheless.", "created_at": "2019-07-21T15:01:41.399Z"}, {"movie_id": 429617, "review_id": "5d6701cd2790bf06ea3242c5", "rating": 6.0, "review_text": "I liked it okay, I guess. Tom Holland was good and shared good chemistry with Zendaya and some of the action was okay, but the so-called plot was rather weak and how it forced into the Iron Man movies fell flat, as did Gyllenhaal post-turn including an awkwardly written exposition scene. Definitely not as good as Homecoming and really reminded me why Marvel proper (mostly) is better at this than Sony-Marvel.", "created_at": "2019-08-28T22:35:57.408Z"}, {"movie_id": 429617, "review_id": "5d86919022f5d7000fa8e6cd", "rating": null, "review_text": "Great film!", "created_at": "2019-09-21T21:09:36.275Z"}, {"movie_id": 429617, "review_id": "5dde66bb88bbe60014190298", "rating": 8.0, "review_text": "Great family movie. Has enough comedy, action, and drama to keep you entertained. Love how the villain played on poor old Spideys naiveness. Underwhelming ending though.", "created_at": "2019-11-27T12:06:19.675Z"}, {"movie_id": 429617, "review_id": "5f1fe86bb4a543003532c9a9", "rating": 8.0, "review_text": "Spider-Man: Far From Home is the first of a new chapter in the MCU.\r\nSad though, because it's all the first one with the late Stan Lee.\r\n\r\nStill, this was not a bad film. And I am glad they showed that twist where Mysterio was the real bad guy (a nod to the mainstream comics) - I would not have enjoyed the film if they had altered the background of the character.\r\nAnd that mid-credit scene - I can't wait for the third film! Maybe they'll finally introduce the Sinister Six, and maybe Matt Murdcock/Daredevil.", "created_at": "2020-07-28T08:57:15.841Z"}, {"movie_id": 429617, "review_id": "600f445add83fa003d978d61", "rating": 7.0, "review_text": "A good end to Phase Three of the Marvel Cinematic Universe.\r\n\r\nIn short, I like <em>'Spider-Man: Far from Home'</em>. I do think it's someway off its predecessor, but I still had a suitably fun time watching this. Tom Holland remains top notch in the main role, with Jake Gyllenhaal, Samuel L. Jackson and Zendaya supporting strongly.\r\n\r\nThe story is a solid one, I like the concept of it; especially with Gyllenhaal's character. Some of the special effects do look a little questionable, but only in relation to how great the effects usually are in the MCU. Compared to an 'average' film, they still look good.\r\n\r\nBy sheer process of the elimination, it probably is one of my least favourite films from this universe. That's not a negative though, as I very much like it and keenly await the currently unnamed sequel.", "created_at": "2021-01-25T22:21:14.970Z"}, {"movie_id": 429617, "review_id": "602b72a7ab5e34003ea01680", "rating": 10.0, "review_text": "My favourite Movie.movie villain,costume was great.\r\nGreat and Amazing Movie.Must Watch.", "created_at": "2021-02-16T07:22:15.726Z"}, {"movie_id": 429617, "review_id": "602dd656d4b9d90040d39e02", "rating": 10.0, "review_text": "The Best Spider-Man Movie of All time.", "created_at": "2021-02-18T02:52:06.628Z"}, {"movie_id": 429617, "review_id": "60b5e7d8abf8e2006fae9fb9", "rating": 10.0, "review_text": "This movie is great. It is better than **Spider-Man: Homecoming** and must watch.", "created_at": "2021-06-01T07:55:04.335Z"}, {"movie_id": 429617, "review_id": "63bf7bc48efe730094889411", "rating": 7.0, "review_text": "I'll be honest upfront and say that I am still not a fan of MJ. She is supposed to be a redhead, she is supposed to be a sexpot, and she is supposed to both know she's hot and have no issues telling other people that. She's supposed to be well out of Parker's league. This is a bit too far from the source material for me.\r\n\r\nAnd the same goes with Flash. He's really supposed to be that guy that burns out the moment he graduates from high school. All muscle and no brain. And this Flash has a future. He's not going to deliver your pizza when you go visit your parents.\r\n\r\nBut, beyond that, it's still a fun movie, but one that didn't have as many laughs as the first outing. Although Holland still delivers, this has a more somber and serious tone and, really, Jake Gyllenhaal is not at all as good of a villain as Michael Keaton was. He's kind of irritating to watch and, really he always has been.\r\n\r\nThe plot twist, if took my wife by surprise, but honestly it was something that absolutely everyone familiar with the source material could see coming from the trailers. It didn't come as a surprise for those of us that read the comic books.\r\n\r\nStill, it was fun and sentimental and paid a respect to the Avengers that I suspect certain movies in the franchise will not. That being said it's not going to have the laughs of Homecoming, it couldn't and still feel appropriate.", "created_at": "2023-01-12T03:17:24.178Z"}]