[{"movie_id": 401981, "review_id": "5aadf9cc92514116ba01ed3e", "rating": 9.0, "review_text": "I love Jennifer Lawrence, she's just amazing. It's not her best apparition but she's the main character of the plot, so you can appreciate her like in no other of her movies.\r\n\r\nTwisted and complex, the main plot is defined by itself during the development of the movie.\r\n\r\nBy synopsis, Dominika Egorova (Jennifer Lawrence) it's a professional ballet ballerina that tragically forced to change her career path by an \"accident\".\r\n\r\nMoved by her family needs, she's accept some \"business\" propositions that subsequent convert her into an Sparrow, a secret government physiologic weapon of seduction.\r\n\r\nBy personal opinion you can feel this movie very slow because of the absent of a good sound work. The image of this movie was perfect for an excellent sound editing and mixing, so the absent of this take some points in the final score in public perception.", "created_at": "2018-03-18T05:31:56.226Z"}, {"movie_id": 401981, "review_id": "5af93e280e0a263ef4006916", "rating": 7.0, "review_text": "It's one of those movies where you know what's going to happen in the end but you aren't sure how it's going to happen. Then at the end you know you have to watch it again so that you can understand how it happened.", "created_at": "2018-05-14T07:43:36.440Z"}, {"movie_id": 401981, "review_id": "5c446a740e0a266d5ed33c6a", "rating": 4.0, "review_text": "I thought I was going to get _Black Widow_ only boring, but what I ended up getting was actually _Atomic Blonde_ only boring.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-01-20T12:32:52.913Z"}, {"movie_id": 401981, "review_id": "63b2d2370d417e007aab5f21", "rating": 5.0, "review_text": "Charlotte Rampling is rather menacingly calculating in this otherwise rather dreary espionage thriller. She is the matron of a school where acclaimed ballet dancer turned agent \"Dominika\" (Jennifer Lawrence) is being sent to learn how to use sex (and sexuality) as weapons of war. After a pretty squeamish (best not say sticky) start, she gets into her stride and is soon on the trail of her CIA target \"Nash\" (Joel Edgerton). Of course it isn't going to be straightforward as loyalties are tested, she hasn't really a clue whom she can trust and - yes, it does all sound a bit familiar doesn't it? I am afraid I just could not get \"Hunger Games\" out of my head for most of this and the starkness of the sexual brutality wore very thin very quickly - rendering the remainder of the film quite sterile and frankly, rather dull and repetitive as she proceeds to try to entrap her quarry and discover who his Soviet sources are. It is poorly paced, I felt, and at over 2¼ hours long it seemed to drag interminably once we, the audience, had sort of put two and two together. Edgerton is a competent actor, and the easy on the eye Matthias Schoenaerts adds a little complexity to the plot, but I am afraid, otherwise, this is a long and rather lacklustre outing for a star far from her best delivering a story that is most definitely not John le Carré.", "created_at": "2023-01-02T12:46:47.426Z"}]