[{"movie_id": 283445, "review_id": "5622edbb9251413a7400799d", "rating": null, "review_text": "In filmmaker Scott Derrickson’s original ‘Sinister’, this writer’s critical impressions toward the sub-par psychological yarn was rather blunt if not consistent with the steady diet of formulaic fightfests. The following passage pretty much sums up the cinematic sentiments from the movie’s critique:\r\n\r\n'At best Sinister is a lukewarm twitchy tale that routinely teases the audience with the obligatory guessing game of whether or not the conjured up evil-minded spookiness is imagined…cheapened scare tactics, an ambiguous monstrous myth, transparent characterizations and a mixed bag of a supernatural storyline barely put any Sinister thoughts in our heads worth contemplating.‘\r\n\r\nWell, say what you will about the first ‘Sinister’ outing but it at least had some slight star power in lead Ethan Hawke whose presence was one of the minor pluses in Derrickson’s shoddy shocker. In director Ciaran Foy’s (‘The Citadel’) tingling yet generic ‘Sinister II’, we hardly experience the essence of top-notch horror-induced hedonism. Feverishly flat, the creepily clichéd ‘Sinister II’ continues the tedious tradition of assembling sure-fire goose bump moments yet never really fortifying these mentioned moments with any heft of genuine suspense or titillating intelligence. At best, ‘Sinister II’ skillfully demonstrates its somber shell but horror movies in general, at least ones that strive for sophistication and coherence, should not continuously hide behind the sketchy synthetics of macabre mediocrity.\r\n\r\n'Sinister II’ dutifully shares its symbolic connection with its predecessor. For starters, ‘Sinister’ alum James Ransone (the deputy from the first film) returns to the perverse playground while being blessed with a lead role in this frightful follow-up. After his dubious dealings with the Oswalt family in the first film’ where he was part of the police force’ the former law enforcer now works as a private investigator in his continued quest to combat that pesky spirit known as the demon Baghuul. Ransone’s ex-deputy is consumed with the shocking murders that took place previously, so it is his mission to eradicate the further Baghuul-instigated mayhem.\r\n\r\nThe newest family involved in the menacing mix consists of an Indiana farmhouse containing a mother named Courtney Collins (Shannyn Sossamon) and her two young sons (real-life brothers Dartanain Sloan and Robert Sloan). Unfortunately, Courtney is battling back and forth with her insufferable and indignant husband (Lea Coco) as her poor boys are caught up in the heated drama. The last thing that Courtney needs is a domestic distraction in the farmhouse that incorporates the spookiness of the Baghuul’s mischievousness. Thus, the hapless deputy-turned-PI must do what it takes to prevent the Baghuul from corrupting the psyches of this vulnerable family unit.\r\n\r\nThe film’s screenplay, written by Scott Derrickson and C. Robert Cargill, plays up to its predictable strengths as the audience is already steeped in the ‘Sinister’ mindset. Unfortunately, the element of mystery and intrigue is already compromised because ‘Sinister II’ does not really leave much second guessing for its titillating tension since it already displayed the same kind of copycat gloom-and-doom blueprint as evidenced in the first installment. In echoing the familiar patterns of eerie scare tactics, this sequel merely mirrors the shady shenanigans found in the first showing that was not that innovative the original time around. Sure, the unsettling imagery does have some warranted punch that leaves somewhat of a horrific impact. The grainy and gruesome home film angle showing a family’s hanging is undoubtedly quite affecting but the shock factor is brief and oddly forgettable. One is left wondering if there are enough tingly tricks up Foy’s desperate sleeve to arm ‘Sinister II’ with more than just drab shadows and twitchy innuendo.\r\n\r\nIndeed, ‘Sinister II’ is atmospheric and bleak and does a sure fire job of creating a dank and disturbing universe where the percolating peril steadily brims. However, that is the problem with ‘Sinister II’ as it settles for the surface-base hedonistic haunting without committing to anything morbidly motivating sans the convoluted creepy conventions. Ransone’s bid to expose the imposing beast Baghuul while protecting the fragile welfare of the vulnerable Collins is genuinely a number-by-number plotline that feels stillborn. Even the dastardly Baghuul is stripped of anything particularly mysterious or diabolical for the audience to get on board and become mortified. Resembling a late gray-bluish sandpaper-faced rocker in The Doors’ frontman Jim Morrison with long stringy hair and mod attire, the Baghuul does nothing to really stimulate the gory imagination of ‘Sinister’s movie-making mythology\r\n\r\nLittle beauty and the rock n' roll attire Beast is something being presented as quite SINISTER. \r\nLittle beauty and the rock n’ roll attire Beast is something being presented as quite SINISTER.\r\nIn the long run, ‘Sinister II’ sings a spooky song in many ways but arms its tepid tune with the continued cheap thrills and false jump edits that are so annoyingly common in contemporary creepfests. ‘Sinister’s crime is not so much the calculating presence of a haunt hipster looking to stunt the growth of bewildered housing inhabitants as it is following the pedestrian path of boofests with banal bangs of exhilaration.\r\n\r\nSinister II (2015)\r\n\r\nFocus Features\r\n\r\n1 hr  30 mins.\r\n\r\nStarring: James Ransone, Shannyn Sossamon, Dartanain Sloan, Robert Sloan and Lea Coco\r\n\r\nDirected by: Ciaran Foy\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Horror/Psychological Thriller/Supernatural & Suspense\r\n\r\nCritic’s rating: * * stars (out of 4 stars)", "created_at": "2015-10-18T00:54:19.715Z"}, {"movie_id": 283445, "review_id": "5787babbc3a3683929000c19", "rating": 4.0, "review_text": "> What's the most dangerous? The dark force or the evil father.\r\n\r\nThe first film was good, I enjoyed it, but not scary. So a sequel was expected and it failed to live up to the standards of the original. I would say, it was a decent horror film, with more story and drama than the creepy atmosphere. One character retained from the previous and the core theme remained, but tried a different method of narration. Something like 'Goodnight Mommy' with two brothers and mystery events surrounding them.\r\n\r\nIt definitely lacks what a horror film required the most, and predictable too. But the story wise, it was decent, because the actors did a good job. So it is an average film. I expected a better ending and it did not conclude at its best leaving me disappointing. The way it ended might have been the suitable for the story, but I wasn't impressed. Again, another sequel is most certain, so I think this tale is not over yet and chances are very high that the story would follow with the same cast.\r\n\r\nIt was not a bad flick, but not a follow-up you would have wanted. If you're looking for a genuine horror film, then you should skip it. There's nothing brilliance to appreciate at any level. Overall, I too felt it should have been better in some places. So my advise is if you forget its genre and try to enjoy that you're watching some movie that you don't know its category then surely would have a decent time with it.\r\n\r\n4/10", "created_at": "2016-07-14T16:15:55.257Z"}, {"movie_id": 283445, "review_id": "58c16f289251411d7b0064fa", "rating": 3.0, "review_text": "Modern horror sequels are often failures. I thought that as the first film wasn't great that I wouldn't be as disappointed if this film turned out to be bad. I was wrong, Compared to this, the first instalment was a masterpiece and this made me realise how it was successful at achieving its goals sometimes.\r\n\r\n'Sinister 2' was quite scary in places. No doubt, the cinema playing the film super loud helped elevate the jump scares though. The creepy depictions of murder in the first film were crazily overdone in this.\r\n\r\nThe screenplay was terrible. The main story was stale and predictable and the characters were unsympathetic and cold.\r\n\r\nThe performances were poor all over this film in particularly the ghost children seemed like they were performing a rubbish school pantomime.\r\n\r\nOverall, I can't be too surprised with what I thought of this film but, sadly, I can see sequels for this being churned out more and more in the future.\r\n\r\n★½", "created_at": "2017-03-09T15:05:12.705Z"}]