[{"movie_id": 383807, "review_id": "59fe1dcec3a36868350255d3", "rating": 8.0, "review_text": "**In the world of medical revolution.**\r\n\r\nBased on the novel of the same name, this French film was unique in many ways. Firstly, it was an awareness film. An awareness about the organ donations. In this medical revolution world, all we need is a little support. A support to our own species who are suffering. Not to waste our precious organs after the death. But it's not all about the deaths, the natural death. There are many reasons for death to happen, but not always the organs are the reason. So it can be transplanted to live on in another body, giving a chance of life. Sometimes, there were sentiments involved. Not because of the love and care shown to those particular persons by their family and friends, but because of unexpected event puts them into such position, where they all can only hope for something miracle.\r\n\r\nIt was like hundred minute long film, but for every 10-15 minutes, it changes focus from people to places and situations. So there's no one particular character the film to follow entirely. All were pieces of the individual's story that in a way connected. This surely a much need film. Because of the story design, especially being organ transplant/donation related theme, they wanted to avoid the emotions as much as possible. Since it's always happy at one side and sad on the other, which might discourage the idea of what this film trying to highlight.\r\n\r\nA teenager who met with an accident in now treated in the hospital. But it is not a good news for his beloved ones. Literally, he's dead, though kept alive by machines. This is not those kind of coma, we have had seen in the films. The parents have to make a quick decision about what the doctors had suggested to them that is to donate the organs to whom needed them most. On the other side of the tale, a middle aged woman with heart trouble has her own opinion about heart transplant. But she needs to be there for her two young sons. In the meantime, with all the developments, the narration heads to the final segment, where tense moments arise till the final scene.\r\n\r\n> ❝Maybe my time has come. My heart will stop. That's nature.❞\r\n\r\nI'm surprised that recently I've watched tons of films directed by women. It's really a good sign. Because stories from women's perspective can flourish in the coming generation, similar to the equal rights revolution happed a century ago in the western world. Considering that, it was a bit late to pick up the pace in filmdom. Not all the directresses make romantic or commercial chic films. Take Kathryn Bigelow as an example, she makes lots better men films than many male filmmakers today. This one was a gender neutral films. I've never seen other flicks from this maker, but seems she's young and very potential, that I want her to make a big entry into Hollywood as well.\r\n\r\nThe details in the film were astonishing. I usually not good at bloods. I avoid hospitals till it becomes a must. What I saw in the final quarter of the film was totally something. Like something I watched in a health channel. Of course it was staged, but very realistic presentation or you could say the demonstration was breathtaking. A few weeks ago in one of my reviews I've mentioned a doctor turned director made a film about his former profession. That was a simple rural based drama. The outside struggle. But this one, take us to the deep into the doctors' the other side of the world. I meant the surgery. I have seen many films like this, but none of them were edgy as this one. A perfect ending for such a film too.\r\n\r\nSo, the film might be a bit under-rated, but it was a much better film than many of the recent ones. It might be under-noticed, but that's because of lack of interest in such themed film among common people. Definitely not because of anything defect in the film. The critics have given thumbs up, so do I. But remember that the film has a story, not entirely about what mostly I've mentioned in most of other paragraphs. So expect less from it and be patience for its slow narration. There's nothing like what I've enjoyed you would enjoy it too. Just give it a try, it is totally worth.\r\n\r\n_8/10_", "created_at": "2017-11-04T20:06:38.468Z"}]