[{"movie_id": 44629, "review_id": "545a3080c3a36839930043a5", "rating": 8.0, "review_text": "Terrific movie and terrific performances, specially Jacki Weaver's\r\n\r\nVery well scripted and rolled.", "created_at": "2014-11-05T14:13:20.761Z"}, {"movie_id": 44629, "review_id": "5e206ded0102c900163ca2a7", "rating": 8.0, "review_text": "Animal Kingdom unleashes an unfaltering roar across Australia. The animal kingdom, a hierarchical group of biological creatures that zoologically determine species that are predacious by nature or hunted down by those stronger than them. It is the laws of nature, Darwinism, that the mighty feed on the weak. Natural selection. We, specifically as human apex predators, do what we must in order to increase our survivability odds. For the Cody family, a familial crime syndicate based in Melbourne, that results in suppressing even the most friendly of noises. Their successful drug-distribution has enabled them to purchase a myriad of luxuries in life, including a quaint abode where seventeen year-old Josh stays after his mother overdoses on heroin. With no alternative shelter, he nestles into the heart of the Cody family tree, commanded by the sweet innocent matriarch who’d do anything and everything to see her boys home and safe.\r\n\r\nMichôd based this fictitious story on the Pettingill family, where a pair of brothers were acquitted for slaughtering two police officers at point blank range. Offering an apt yet palpable string of tension that questions the utilisation of firearms, a measure to prevent anarchy not commence it, and the lengths a family will partake in for the sake of hereditary aggregation. His screenplay is smart, boasting a range of unexpectedly intelligent character choices that defy typical tropes within other comparative gangster features. If a main character bravely meets their early demise, it’s executed with no padding or fuss. Bang! Suddenly, Michôd moves on. An irrefutably powerful and perceptible technique that accompanied the meticulously concise script that he had written.\r\n\r\nThe Cody family members are developed substantially, with their affection for each other explicitly displayed for added finesse. The line between psychopathy and scrupulous behaviour is depicted through the character of “Pope”. His outrageous criminal activity tests the loyalty of his brothers whilst embedding a commanding presence within the family. We may view the shenanigans through Josh’s innocent perspective, yet somehow Michôd transforms these detestable characters into, well, protagonists. His attentive detail in illustrating the affectionate bonds within the family, instantly adds a light touch of self-justification for their crimes. Impeccably clever, to turn a group of murderous individuals into something more affable.\r\n\r\nNone of this though would’ve been possible without the sensational performances all-round, with three highlights in particular. Mendelsohn showed the world how brutal his antagonistic capabilities can be, with an arresting performance that cemented his talents almost immediately. Pearce, portraying the “good cop” by convincing Josh not to become a criminal, balances the ethical and moral dilemmas that the main character encounters with a soothingly calm performance. Then Weaver, capitalising on her sweet demeanour, venomously encourages the family through her captivating matriarchal performance. The Brando of Melbourne, perhaps?\r\n\r\nFrecheville lacked emotional conviction, mostly offering a monotonously one-dimensional approach, that forced his uncles to be more enticing as individuals. Occasionally Doolan’s sublime editing consequently resulted in the script feeling somewhat scattershot, particularly in the second act, where the tension dissipated after the shopping centre scene. The introduction of the family’s barrister before the court hearing was also spontaneous, resulting in Phillips’ performance being less than impressive.\r\n\r\nStill, Animal Kingdom is quite simply one of Australia’s greatest exports. Tight, taut and packed full of explosive performances that provide an animalistic bite to this crime story. A rejuvenated modern-take on the classic gangster formula.", "created_at": "2020-01-16T14:06:37.855Z"}, {"movie_id": 44629, "review_id": "62eb18ad091e62006048f094", "rating": 6.0, "review_text": "**A brutal film, where there are no nice people or good guys, but which tells us a good story, in a convincing and credible way.**\r\n\r\nI expected more from this film. It's good, it has an interesting history, but it's lukewarm and uncomfortable, and there's not much to arouse our sympathy. I've seen a lot of films, I'm not sure if this was the first Australian film I saw, but it was certainly the first Australian film that I knew was Australian at the time I was watching it. Inspired by a real-life situation, the film creates a story in which the police seek to capture the members of a family well immersed in Melbourne's criminality. To achieve this, they seek the help of the most balanced person in that family: a young teenager.\r\n\r\nThe movie is good, the script is well written, and it has a lot of very good twists, but it's not a nice or pleasant movie. The characters are very harsh and unsympathetic, and violence and crime are a significant part of their lives, in a way that seems, almost, like a “family business”, proudly transmitted. Josh, the protagonist, is perhaps the one who will better move our sympathy, even though he is too introverted to create good chemistry with the audience. Even the police, with their brutality and cruelty, are far from being the heroes, with only a very thin distance that differentiates them from the bandits.\r\n\r\nI liked the performance of Ben Mendelsohn, who gave life to the most brutal and dominant member of that family, a man that the police themselves seem to have sworn to death, and who doesn't think twice if he has to kill. Jacki Weaver is equally powerful and very good at playing the matriarch of the family, a woman who seems proud of her children's criminal record and will stop at nothing to protect them, no matter what they do. It was no accident that she was nominated for an Oscar for Best Supporting Actress. Also, Guy Pearce met the proposed challenge and gave an excellent performance in the role of a conventional police detective. The film also has good dramatic work by Joel Edgerton, James Frecheville and Sullivan Stapleton.\r\n\r\nTechnically, it's a discreet film, which bets more on a strong script and a good work by the cast than, properly speaking, on any kind of visual or artistic device. More than a visual work, this film seeks to tell a story – a rough, uncomfortable, sad and acidic story, but well written and intense. The cinematography is regular, the editing too, the sets and costumes are what you would expect to find here. The special, visual and sound effects used are discreet but functional.", "created_at": "2022-08-04T00:54:05.992Z"}]